{"fingerprint": "7JMgKTV1r3kg7I6EifXL1MppUcc=", "sitename": "Clarkesworld Magazine", "title": "Saturn Devouring His Son by EA Mylonas", "author": "EA Mylonas", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/mylonas_03_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Saturn Devouring His Son by EA Mylonas", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5010 words, short story\nSaturn Devouring His Son\nThe first time Pa lost an arm was when I was eight.\nIt was his left. Amputated at the shoulder when his sleeve got caught in a band saw for cutting pig carcasses.\nThe Company, of course, got him the prosthetic, like it had done for every single one of its employees who had lost a hand, a foot, an eye on the processing lines. Standard policy. Prosthetics were never the latest or the smoothest-looking models. None of the shiny sports models we saw advertised on TV. One size fits all. Still, better than anything we could afford.\nI remember visiting Pa with Danny, five years old at that point, and Ma at the town clinic—built and paid for by the Company—and seeing him smiling in his bed. He was a barrel-chested Polish man with hair so thick I could get my fingers trapped in it, but it got all shaved off. A wire ran from the elbow of the new arm and entered his skull at the base, which the doctor told us was temporary.\n“Until we get him wireless,” the doctor said while running diagnostics.\nThe black prosthetic looked screwed into the socket where the arm had been connected to the shoulder, rubbing against stained bandages. All angles.\nDanny and I were all quiet while our parents discussed with the doctor. Our attention was on the new left hand clasping and unclasping, Pa’s neurons misfiring while they were getting used to it. Danny approached and touched it, without Pa noticing.\n“Not Pa,” he said. “Not Pa.”\nI pulled him back and pinched him, giving him a stare that promised more punishment if he started crying.\n“It is Pa. Get used to it.”\nThere was a small celebration his workmates at the meat plant threw together when he returned to work, cake and all. Holding me in his new arm, I could feel the gears whirring inside as he lifted me up.\n“Look at the quality,” he said in his booming baritone. “Wish I had me one of these years ago.”\nI remember laughing with him, even though I didn’t want to, fake laughing because his workmates were staring at us, at me, staring and grinning with a sense of expectation.\nThe arm felt so solid, so heavy. Monolithic. It had the Company’s logo stamped on it, two crossed cleavers. You could lift up a panel where the radius would have been and turn a series of knobs to tune it up. Make it more responsive, faster. At some point, jealous of the attention Pa was getting, I might have said out loud that I wanted one too.\nMore laughter by his mates, more grinning.\n“Come work here, and the Company will get you your own one day.”\nThe day Pa died, Danny called me.\n“Pa had a heart attack,” he said when I picked up the phone. Just like that. It took me a while to realize who it was. His voice had turned into its own kind of deep rumbling staccato. So close to Pa’s, but at the same time all his own.\n“At the sausage packing line. We called the nurse from downstairs. He didn’t make it.”\nI listened to him without saying anything, then nodded, as if he could see me. I could hear him breathing and in the background the meat plant’s rumble.\n“Funeral’s in two days,” he said breaking the silence. “Paid for by the Company. Would be decent if you could be part of it. We need to figure out what to do about his things. And the arms.”\n“What about the arms?”\nA sigh from the other end. “Just come home, Jacob. We’ll talk then.”\nThere wasn’t much else said. No How Are You, No How’s Life. Five years of silence stood between us.\nI muttered I’d be there and hung up.\n“Keep going down that road for ten miles, then take the second left after the power plant,” the gas station attendant told me. “It gets tricky from there, if you’re not local. Let me draw it out for you.”\nI nodded my thanks and kept fumbling with my phone. Half of the roads around here didn’t even show up on navigation. Never had. But years away from the town had also made me lose my sense of direction. Too embarrassed to tell the attendant I was from the area, I said I was visiting for business and he, face full of acne, simply stated “You’re looking for the meat plant.”\nHe sketched out a quick map on the back of a receipt with a large X at the end of a long feeder road. Wrote “M PLANT” with block letters over it. Made sure I understood his instructions.\nI thanked him, pocketed the drawing, paid for a couple of burritos I had no intention of eating, and got the rental back on the road.\nOn both sides of the highway, there was nothing but fields of mud. Nothing growing out of them except for plastic bottles and greasy napkins and trash in faded colors that could have been anything, flying in the air every time a reefer truck rolled by. Over the horizon, grain silos hazy with distance broke the flatness of the land.\nA whole lot of nothing that trucks sped through on their way to somewhere, anywhere else, trucks and me.\nIt made me feel lonely, being back. Living in a city, crowds and strangers can be a welcoming form of isolation. There is comfort in hiding amongst the masses. There was no hiding out here.\nThe instructions were good, but they didn’t matter much. Once I got on the feeder road, I smelled the meat plant, still ten minutes away. It wasn’t entirely unpleasant. I grew up with the wet odor of pig turning into pork filling my nostrils, on my clothes. The word “family” smelled of the meat plant. Family, familiar.\nAnd then, there it was.\nIts black carapace, so much like Pa’s arms, not reflecting the sun. White spots, seagulls, flew in from the river mouth, circling chimney stacks that I knew vented the meat curing rooms. The town nestled around it like toadstools around a mighty oak.\nThe plant got bigger on the windshield, and soon I was driving by the first houses. As I made my way, I wasn’t certain what bothered me most. That part of the town had changed, or that part of it had remained exactly as I remembered it. New stores stood next to ancient houses with chipped paint on their walls. Shiny billboards for fast food stood in the middle of overgrown lots strewn with dead cars around them.\nOther than a group of bored twelve-year-olds smoking on a sidewalk, there was not another soul in sight.\nStreet names were coming back to me now as I drove through them. Turns, dead-ends. The single bar in town—build and paid for by the Company. It took about thirty minutes to walk the town from one end to the other. One had to try hard to get lost here. Yet, at some point, I realized I was heading in the wrong direction. The plant was to the right of our house. I made a U-turn and kept going, using the plant as a landmark.\nA side road covered in cracked asphalt sparked recognition, and I turned. When I found our street, I rolled to a stop outside our house and cut the engine. Didn’t get out until the dust I had raised settled.\nThe front door opened, and Danny stepped out, looking like a clone of our Pa. Even down to the thick hair. Didn’t say anything. Only walked down the short porch stairs with an uneven gait, opened his arms, and gave me a hug. Brief, weak. I didn’t expect more. Didn’t feel I could give more myself either.\nHe took a step back to study me and whirring came from his left leg. He noticed me staring and shrugged.\nFive years. He was still sixteen when I last saw him. Now, he was growing a beard and towered over me. And had already given a limb to the Company.\nNeither of us opened his mouth. Neither of us made a move.\n“Danny,” I said finally, trying to break the silence. “You got fat.”\n“How about I test this new foot by introducing it to your ass?”\nWe both smiled.\n“Ma?” I asked relieved.\n“Watching her show. Come.”\nOnce inside, he rapped the frosted glass door to the living room, waited for a second, then opened.\n“Ma,” he said with the kind of gentle voice people use to wake someone up. “Jacob’s here.”\nThere was no movement, no attempt to get out of the recliner. Her rheumy eyes flickered but didn’t leave the TV screen.\n“Ma,” he said again and touched her shoulder. “It’s Jacob. He’s come for Pa’s funeral.”\nHer spine was more crooked than I remembered, twisting a dead olive tree.\n“It’s fine, Danny. Let her rest.”\n“She needs you to repeat things a few times. Got to be patient, is all. Ma, Jacob’s here. The family is all here now.”\nMa, who was only fifteen years older than me, but whose hair had already turned gray. Ma, who joined the plant soon after she had me, where she got a job at the head table. They called it that because that’s where pig heads ended up. After noses and eyes and ears and cheeks and jowls and snouts were removed, the brains got scooped up. The Company sold the slurry to canned goods producers. It made soups thicker.\nBack then, it used to be that one had to work through the skull with a meat saw, and then cut the brain out. One day, the Company figured it was faster firing compressed air into the skulls, then siphoning the remains.\nMa inhaled pig brain for years. Her own body, going into overdrive, started destroying itself. Who knew pig brains and human brains shared so much biology? Not something they taught at my school. Built and paid for by the Company.\nI remember her complaining about her hands going numb. Losing her balance often. One morning, her screaming woke us up. “I can’t feel my legs, I can’t feel my legs,” she cried over and over again from the bed she and Pa shared, as he fumbled calling for an ambulance with his metal fingers.\nWhen management found out Ma got sick, they gave her a pension equal to half her salary, paid for her pills that weren’t making her better but weren’t make her worse, and sent us a ham every year on her birthday.\nMa wasn’t the only one who got damaged.\nThe families of others who got sick working the head table wanted to sue. Wanted us to join them in suing. Stubborn people. They called our house often, and Pa would yell at them, punching holes through the plaster wall with his prosthetic, all red in the face. Often times, they came to our door and asked to see him. Groups of four or five at a time. Figured, the more of them they were, the more chances they had of convincing him. Or surviving his temper.\nI asked him why he didn’t want to sue. There was talk of a lot of money. We could get Ma better treatment, I argued. Maybe move her somewhere where she’d be looked after good and proper, instead of her sons wiping her ass when her hands went numb permanently.\nHe sucked on his lips, gave me the once over. I remember that look, because of how determined it was, like he had been preparing to react to this moment for days.\nIt was warm, he had his shirt off, so I could see the red irritated line where sweaty flesh ended and metal began. Servos and gears whirred in his left arm, even though it remained still. He drummed the fingers of his flesh and blood arm, which he was still a couple of years away from losing too.\n“We sue. And then, what? Hmm? What about our lives?”\nHis voice was small. Tired. Nothing like the fire he screamed down the phone. But there was a conviction in it that kept my mouth shut.\n“We lose, we’re done from the plant. All of us, you, me, they’ll never hire Danny. We win, the plant shuts down. Then, what? How about the other families that work there, did you think about them?”\nHe was no longer talking to me. Wasn’t making an argument to be discussed.\nHe held his prosthetic up. “The Company gave me this. I’d be a cripple without the Company. We have it good,” he said. “The Company will take care of us. They will take care of Ma.”\nThe Company. The Company.\nWe never said its name, because there was only ever one Company that mattered.\nIn the end, there was a lawsuit. A few people did sue. The next morning, someone sent bricks through their windows. Their kids got beaten up at school. Tires got slashed.\nFrom what we read in the town paper, the lawsuit got dropped and the case settled out of court. The plant changed practices, made sure those on the head table wore the right equipment. Masks, goggles, rubberized suits that kept all the pig brain out. But, by then, Ma could hardly speak anymore.\n“Ma,” Danny pressed on. “Jacob’s here.”\n“Hey, Ma. Hey. How are you doing, Ma?”\nShe stared up at me. Stared through me and through the wall. Then, turned her eyes back to the screen.\nDanny nodded at me. I kissed her forehead, and we went to the kitchen.\n“Listen,” I said. “Is Sally’s B&B still open?”\n“You’re staying here. I’ll take the couch.”\n“No, I—”\n“It’s your house too. Would be good to have you around.”\n“Ok.” I didn’t feel like arguing.\n“Sally’s dead, by the way. Cancer.”\nWe ate in silence. Pork chops and mash. When we finished, he got a bowl of soup and fed Ma, dabbing at her lips when she failed to swallow. When the sun went down, he bathed her, carried her to her bedroom, and came back to the kitchen. We sat at the dining table across each other, staring at the vinyl tablecloth, the only sound coming from Danny’s leg. Uncertain of where to start.\nIn the end, he sighed and drummed his fingers on the table the way Pa used to do.\n“Hell, I invited you, so might as well lay down some bridges first,” he said. “How’s your life been?”\nI searched the ceiling for an answer.\n“How’s my life been . . . Did a long run of Beckett last summer. Then, a modern version of Medea set in Cuba. We played for a hundred people tops, but got good reviews. I’ve met a man who cares for me,” I said and waited to see his reaction. He stared at the ground, his cheeks flushing through the beard. “Life is good.”\nDanny scratched his beard. “Yeah, well. That’s nice. Pity it took Pa dying for you to visit.”\n“We both know he didn’t want me here.”\nDanny shook his head, dismissive. “Could have visited for Ma’s sake. Would have done her some good seeing you. She don’t seem like it, but she’s happy you’re back.”\nI didn’t reply. It was my turn to stare at the ground.\n“Well, Pa’s gone now. There’s the three of us left,” Danny went on. “You know, I could convince the Company to take you back.”\n“Take me back?”\n“The family is in good standing with the Company. I might make foreman soon. I could put in a word for you.”\n“Danny . . . Why would I want to work there again?”\n“Well, I said there’s the three of us now,” he said, as if that explained everything.\n“No. I’m not coming back to this shithole.”\n“This . . . ” Danny gritted his teeth. “This ‘shithole’ is your home. And we’re your family. You should be here. While Ma is still around.”\nI crossed my arms and sighed. “You know what? I said life’s good, but I lied. It’s not. Sometimes, I can’t make rent. But I don’t care. I figure, after the funeral I’m done with this town. Not because I don’t care, but because there’s nothing here for me anymore.” I regretted the last words, regretted how callous they came out, but I wouldn’t take them back. “You and Ma are welcome to come visit.”\nDanny snorted. “Visit you where you can’t afford rent? Ma can’t travel. And I got a job here.”\n“Of course,” I said rolling my eyes. “You got a job here.”\n“The Company takes care of us,” he said and nodded and kept nodding, like a bobblehead.\n“When did you lose the leg, Danny?”\nHe stopped nodding and scrunched up his mouth.\n“I’ll fetch you a blanket,” he said and left. We stayed out of each other’s way until breakfast.\nThe funeral was short.\nHeld at the town’s church—built and paid for by the Company.\nA few of Pa’s workmates were there, faces I recognized. Danny’s girl, who worked at the plant warehouse. A representative from the Company that knew us by first name, though neither I nor Danny had met him before.\n“The Company is sorry for your loss,” the representative said to Danny. “Please let us know if there’s anything we can do for the family. Take your time with the prosthetics, you can return them at your convenience.”\nDanny nodded and thanked him, though there was a darkness that passed across his face at the mention of the arms.\nI thought I saw Ma react a couple of times. First as they were about to close the casket, Pa’s empty sleeves puffed up with straw to cover the removed arms making him look like an action figure. The second time was when they lowered him into the ground. She leaned forward both times, fighting against her crooked spine, and I thought I saw her hands tremble.\nWe had Pa’s coworkers over for the wake at the house.\n“Abe’s oldest,” a grizzly of a man exclaimed from across the living room and wobbled over on his prosthetic legs, raising his prosthetic arms. He hugged me and, under his shirt, I could feel warm metal covering his left side. “The last time I saw you, you were this tall,” he said and pointed at waist height. “I bet you don’t remember me.”\n“Sure I do, Mr. K,” I said. “I remember everyone.”\nThey all came and shook my hand with their own metallic fingers that squeezed a bit too hard, a bit too eagerly. Like they all had fine-tuned their arms for the handshaking they would be doling out on this day.\nThat feeling again, their expectation, and I was eight again. With the condolences, came the questions.\nAre you back for good, Jacob?\nAre you here to stay?\nWhen are you starting at the plant?\nI smiled and shrugged.\nNot all of them were friendly. No one spoke their grievances out loud, but I could see the thoughts behind their eyes, even behind the artificial ones. Moments when they looked like they wanted to say something more, moments with tense smiles. Words that in the end they dropped, because this was Abe’s funeral wake, this was Abe’s house.\nAnd Abe was one of them.\nNot even his prodigal son showing up could make them forget that.\nEventually, they drifted toward Danny. Shaking his hand and clapping his shoulder. He stood tall, dignified amongst them. I looked over at Ma sitting alone in her recliner with a blanket over her\n“Hey Ma,” I said and took a seat next to her instead of joining the others. I took her hand and squeezed it, hoping I’d feel her squeezing back. Hoping I’d feel some warmth in that wrinkled skin. “I hear he’s done well for himself at the plant,” I said. “Might make foreman soon.”\nDanny was surrounded by Pa’s workmates. He was talking about something I couldn’t hear, hands in his pockets, while everyone listened leaning in. Nods all around. In the end, whatever speech he was making had them patting his back and smiling.\n“Looks like Danny’s the man of the house now,” I said.\nI thought I heard her sigh. Her rheumy eyes stared in Danny’s direction, unfocused.\n“I’m sure you’re very proud of him. Both you and Pa.”\nWe remained in the corner, invisible, hand in hand.\nWhen Danny and I were children, I never once heard anyone ask us “what do you want to be when you grow up.” If the answer was “not butchering hogs,” you kept that to yourself. Or else folks thought you had it in your mind that you were too good for this place. That is to say, too damn good for them.\nI ran away from the town the day I was told to report to the head table.\nAfter I left, Pa sent me an envelope with only a picture in it. Him standing tall. Grinning, with a proud metal arm on Danny’s shoulder. Both of them wearing clean white work aprons. They were framed by the plant’s gate, the crossed cleavers in blocky black and white above it. That was the last I heard from him.\nDanny never responded to my emails. Somewhere in the back of my mind, I imagined our Pa telling him how ungrateful I was, that I was dead to him. Or worse, not saying a word about me. Because that was real death, being forgotten and not talked about. And what was Danny to do? What was he to say to that?\nAfter the wake, when the house got quiet, Danny came up to me and handed me a bottle of beer.\n“Want to join me in the shed?” he said. “Need to talk. About Pa’s things.”\nI nodded and let him lead.\nDanny.\nDanny, the youngest.\nDanny, who had a girl who worked at the warehouse. Who looked more like Pa than I did. Who had already given a leg to the Company.\nDanny.\nWe went out back by the pigsty that had been empty since before I left, Pa’s failed pet project. Danny pushed the door open to the adjoining shed and turned on the overhead light, a single naked bulb. The interior was covered wall-to-wall with junk, and in the middle stood a workbench. On top of it lay a plastic carrying case with the crossed cleavers on it.\n“Ma used to get so worked up over all this trash,” he said. “I’ll get rid of it. I was thinking I’d keep the tools and the workbench. Reckon I’ll get more mileage out of them than you. Hope you don’t mind.”\nI shook my head. I really didn’t.\n“Clothes go to the trash. You’re welcome to sort through it, though I’m guessing you won’t,” he said and paused until I nodded. “We also need to figure out what to do about these,” he said and opened the case.\nInside were Pa’s metal arms.\n“You’re taking them back soon?”\nDanny ran his fingers along the arms, tracing the stamped cleavers. “I might. Some other fella might need them soon.”\n“Then, what’s there to figure out?” I said and leaned against the door.\nHe nodded. “You met the man from Inventory at the funeral. He was there to check that the arms were removed all nice and proper. I tried to talk him into letting me keep them. You know . . . Just in case,” He said and tapped his leg. “It doesn’t feel proper that someone outside the family might be walking around with Pa’s arms. But, he said no.”\nPa lost his other arm sanitizing a meat grinder, because the prosthetic was too bulky to fit in there. While he was up to his elbow into the grinding plates, the machine somehow got switched on. Somehow.\nWhile the nurse was busy stopping the bleeding, another worker took over, removed the minced arm, wiped away the blood, and finished up the sanitizing.\nMa was having trouble staying lucid by that point. When we told her the news, she stared at us for long minutes, then asked us to fetch Pa for dinner. Danny and I skipped school that day and visited him at the clinic by ourselves.\nHe wasn’t smiling when we saw him. The same doctor, gray now, and stooped, was tuning the new arm. Same model as the other, all angles and blackness. Neither of the two men looked at us, didn’t answer our questions until it was time to head home. Pa shuffled between us, with a heavy metallic arm on each of our shoulders.\nThree days later, he was back on the processing lines, working faster and harder than before. No need to worry about getting cut anymore.\nI wondered what happened to his mind after that second time. He never complained about phantom pains and ghost limbs, like you read about amputees. Didn’t feel odd.\nBut something took over him. He stopped eating, lost weight, and gaps appeared between his flesh and the arms. Infections started bothering him. Summer heat caused the prosthetics to burn and chafe against his flesh. His skin fell off in torn strips, but getting sick didn’t stop him from clocking in, same as everyone.\n“Work is work,” he said in his blue-collar way when I asked him why he was doing this to himself. “That’s what men do. That’s what you’ll do when the time comes.”\nAt the same time, he started spending more time at the bar, leaving me and Danny to take care of Ma. I guess he wanted to be amongst other plant workers more than us, amongst the people who were glad for their lot in life. Even it if meant coming home at two in the morning and getting up at dawn to stare at dead pig flesh for twelve hours a day.\nThe drinking made it worse. Made it all worse.\nLost weight.\nLoose prosthetics.\nMore infections.\n“Danny, do you ever wonder what happened to his arms?” I said.\n“What?” Danny’s eyes went from me to the case in confusion.\n“No. I mean, his real arms.”\nRealization came over his face, and he sighed. “Got thrown away in a dumpster behind the clinic, I reckon. Got eaten by the raccoons.”\n“Doesn’t it bother you? We could have at least buried them.”\n“Jacob, I can’t remember Pa without one of these here. You’re talking about his real arms. These are his real arms to me, even if he probably got them from some other guy.”\nThat moment again when he was five came to my memory, Danny touching Pa’s new arm. Not Pa.\nHe picked up the left arm and opened the panel. Both the inside and out were spotless. I thought I could see the light reflecting off wax. Danny had taken good care of them.\nHe manipulated the knobs, and the fingers curled and extended in a slow smooth manner. He took it out of the case and placed it on the workbench. Flipped a few switches. Then, stepped back.\nFirst the little finger rose, then the ring finger, then the others one by one in a wave.\nThen down again, drumming against the wooden surface. First the little finger, then the rest.\nAgain.\nIt repeated the drumming, filling the silence in the shed, and all I wanted in that moment was for him to put that arm away, I wanted to grab it and hide it somewhere, where it would never move again.\nSensing my mood, Danny flipped another switch. The fingers stopped and pulled together into a loose fist. He put the arm back, closed the case, and turned to me. There was expectation on his face, and I felt the same way as when Pa had lifted me up with his black left hand, showing off his strength, his workmates watching me.\n“You know what?” he said and shook his head. “I don’t feel like giving the arms back.”\nWe stood silent, me unable to understand what he was saying, waiting for the punch line.\n“Danny,” I started. “Whatever it is you have in mind . . . don’t.”\n“We have never asked the Company for anything. Only that they let me . . . let us keep the arms.”\n“You’ll lose your job.”\n“I’ve never asked for anything,” he repeated.\n“Danny . . . No.”\nDanny looked at me with disappointment. “The one time I need you to be a bad influence, and you screw it up.”\nI went over to the workbench next to Danny and opened the case again. I thought about opening the panels, toying with the knobs and the switches, despite the pit in my stomach. Let Danny have the illusion that Pa was right there with us.\n“How are you planning on doing it?” I said, feeling the day’s weariness catching up with me.\n“Don’t know,” Danny shrugged. “Might have a talk with the old doctor at the clinic, see if he has any spares I could pass off as Pa’s arms. They’re all the same model. I reckon we could fake the serial number.”\n“Or you tell the Company I stole them. You tell them I left in the middle of the night with the case, and you couldn’t stop me.”\nDanny snorted. “That’s a dumbass idea, Jacob.”\n“Why? The hell they’re going to do about it?”\n“Bring the police on you. That’s property theft.”\nI sighed and opened the panel of the right arm. I flipped a few switches and felt its fingers squeeze mine, and I squeezed back, and suddenly I was more tired than I had been in years.\nAs Danny put his hand on my shoulder, I said, “Let’s talk to the doctor tomorrow.”\nEA Mylonas is the author of the upcoming speculative fiction novel The Hush (Inspired Quill, 2022). Originally from Athens, Greece, he has spent the last couple of decades tending to loggerhead turtles, baking bread for a Michelin-star restaurant, and writing dialogues for video games. An environmental scientist by training, he is an advocate for the climate cause, sustainable living, and anti-corporatism, which inspire his unique brand of literary sci-fi set twenty minutes into the future.\nHe currently resides in Copenhagen, Denmark on the spot where the city ends and the forest begins."}