{"fingerprint": "09i9kB8Xz0mBnUuLiCDhHW49jVI=", "sitename": "Clarkesworld Magazine", "title": "Nahiku West by Linda Nagata", "author": "Linda Nagata", "date": "2012-01-01", "source": "https://clarkesworldmagazine.com/nagata_07_16_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Nahiku West by Linda Nagata", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8830 words, novelette, REPRINT\n Nahiku West\n A railcar was ferrying Key Lu across the tether linking Nahiku East and West when a micrometeor popped through the car’s canopy, leaving two neat holes that vented the cabin to hard vacuum within seconds. The car continued on the track, but it took over a minute for it to reach the gel lock at Nahiku West and pass through into the atmosphere. No one expected to find Key Lu alive, but as soon as the car repressurized, he woke up.\n Sometimes, it’s a crime not to die.\n I stepped into the interrogation chamber. Key had been sitting on one of two padded couches, but when he saw me he bolted to his feet. I stood very still, hearing the door lock behind me. Nothing in Key’s background indicated he was a violent man, but prisoners sometimes panic. I raised my hand slightly, as a gel ribbon armed with a paralytic spray slid from my forearm to my palm, ready for use if it came to that.\n “Please,” I said, keeping the ribbon carefully concealed. “Sit down.”\n Key slowly subsided onto the couch, never taking his frightened eyes off me.\n Most of the celestial cities restrict the height and weight of residents to minimize the consumption of volatiles, but Commonwealth police officers are required to be taller and more muscular than the average citizen. I used to be a smaller man, but during my time at the academy adjustments were made. I faced Key Lu with a physical presence optimized to trigger a sense of intimidation in the back brain of a nervous suspect, an effect enhanced by the black fabric of my uniform. Its design was simple—shorts cuffed at the knees and a lightweight pullover with long sleeves that covered the small arsenal of chemical ribbons I carried on my forearms—but its light-swallowing color set me apart from the bright fashions of the celestial cities.\n I sat down on the couch opposite Key Lu. He was a well-designed man, nothing eccentric about him, just another good-looking citizen. His hair was presently blond, his eyebrows darker. His balanced face lacked strong features. The only thing notable about him was his injuries. Dark bruises surrounded his eyes and their whites had turned red from burst blood vessels. More bruises discolored swollen tissue beneath his coppery skin.\n We studied each other for several seconds, both knowing what was at stake. I was first to speak. “I’m Officer Zeke Choy—”\n “I know who you are.”\n “—of the Commonwealth Police, the watch officer here at Nahiku.”\n The oldest celestial cities orbited Earth, but Nahiku was newer. It was one in a cluster of three orbital habitats that circled the Sun together, just inside the procession of Venus.\n Key Lu addressed me again, with the polite insistence of a desperate man. “I didn’t know about the quirk, Officer Choy. I thought I was legal.”\n The machine voice of a Dull Intelligence whispered into my auditory nerve that he was lying. I already knew that, but I nodded anyway, pretending to believe him.\n The DI was housed within my atrium, a neural organ that served as an interface between mind and machine. Atriums are a legal enhancement—they don’t change human biology—but Key Lu’s quirked physiology that had allowed him to survive short-term exposure to hard vacuum was definitely not.\n I was sure his quirk had been done before the age of consent. He’d been born in the Far Reaches among the fragile holdings of the asteroid prospectors, where it must have looked like a reasonable gamble to bioengineer some insurance into his system. Years had passed since then; enforcement had grown stricter. Though Key Lu looked perfectly ordinary, by the law of the Commonwealth, he wasn’t even human.\n I met his gaze, hoping he was no fool. “Don’t tell me anything I don’t want to know,” I warned him.\n I let him consider this for several seconds before I went on. “Your enhancement is illegal under the statutes of the Commonwealth—”\n “I understand that, but I didn’t know about it.”\n I nodded my approval of this lie. I needed to maintain the fiction that he hadn’t known. It was the only way I could help him. “I’ll need your consent to remove it.”\n A spark of hope ignited in his bloodied eyes. “Yes! Yes, of course.”\n “So recorded.” I stood, determined to get the quirk out of his system as soon as possible, before awkward questions could be asked. “Treatment can begin right—”\n The door to the interrogation room opened.\n I was so startled, I turned with my hand half raised, ready to trigger the ribbon of paralytic still hidden in my palm—only to see Magistrate Glory Mina walk in, flanked by two uniformed cops I’d never seen before.\n My DI sent the ribbon retreating back up my forearm while I greeted Glory with a scowl. Nahiku was my territory. I was the only cop assigned to the little city and I was used to having my own way—but with the magistrate’s arrival I’d just been overridden.\n Goods travel on robotic ships between the celestial cities, but people rarely do. We ghost instead. A ghost—an electronic persona—moves between the data gates at the speed of light. Most ghosts are received on a machine grid or within the virtual reality of a host’s atrium, but every city keeps a cold-storage mausoleum. If you have the money—or if you’re a cop—you can grow a duplicate body in another city, fully replicated hard copy, ready to roll.\n Glory Mina presided over the circuit court based out of Red Star, the primary city in our little cluster. She would have had to put her Red Star body into cold storage before waking up the copy here at Nahiku, but that was hardly more than half an hour’s effort. From the eight cops who had husks stashed in the mausoleum, she’d probably pulled two at random to make up the officers for her court.\n I was supposed to get a notification any time a husk in the mausoleum woke up, but obviously she’d overridden that too.\n Glory Mina was a small woman with skin the color of cinnamon, and thick, shiny black hair that she kept in a stubble cut. She looked at me curiously, her eyebrows arched. “Officer Choy, I saw the incident report, but I missed your request for a court.”\n The two cops had positioned themselves on either side of the door.\n “I didn’t file a request, Magistrate.”\n “And why not?”\n “This is not a criminal case.”\n No doubt her DI dutifully informed her I was lying—not that she couldn’t figure that out for herself. “I don’t think that’s been determined, Officer Choy. There are records that still need to be considered, which have not made their way into the case file.”\n I had looked into Key Lu’s background. I knew he never translated his persona into an electronic ghost. If he’d ever done so, his illegal quirk would have been detected when he passed through a data gate. I knew he’d never kept a backup record that could be used to restore his body in case of accident. Again, if he’d done so, his quirk would have been revealed. And he never, ever physically left Nahiku, because without a doubt he would have been exposed when he passed through a port gate. The court could use any one of those circumstances to justify interrogation under a coercive drug—which is why I hadn’t included any of it in the case file.\n “Magistrate, this is a minor case—”\n “There are no minor cases, Officer Choy. You’re dismissed for now, but please, wait outside.”\n There was nothing else I could do. I left the room knowing Key Lu was a dead man.\n I could have cleaned things up if I’d just had more time. I could have cured Key Lu. I’m a molecular designer and my skills are the reason I was drafted into the Commonwealth police.\n Technically, I could have refused to join, but then my home city of Haskins would have been assessed a huge fine—and the city council would have tried to pass the debt on to me. So I consoled myself with the knowledge that I would be working on the cutting edge of molecular research and, swallowing my misgivings, I swore to uphold the laws of the Commonwealth, however arcane and asinine they might be.\n I worked hard at my job. I tried to do some good, and though I skirted the boundaries now and then, I made very sure I never went too far because if I got myself fired, the debt for my training would be on me, and the contracts I’d have to take to pay that off didn’t bear thinking on.\n The magistrate required me to attend the execution, assigning me to stand watch beside the door. I used a mood patch to ensure a proper state of detachment. It’s a technique they taught us at the academy, and as I watched the two other officers escort Key Lu into the room, I could tell from their faces they were tranked too, while Key Lu was glassy-eyed, more heavily sedated than the rest of us.\n He was guided to a cushioned chair. One of the cops worked an IV into his arm. Five civilians were present, seated in a half circle on either side of the magistrate. One of them was weeping. Her name was Hera Poliu. I knew her because she was a friend of my intimate, Tishembra Indens—but Tishembra had never mentioned that Hera and Key were involved.\n The magistrate spoke, summarizing the crime and the sanctity of Commonwealth law, reminding us the law existed to guard society’s shared idea of what it means to be human, and that the consequences of violating the law were mandated to be both swift and certain. She nodded at one of the cops, who turned a knob on the IV line, admitting an additional ingredient to the feed. Key Lu slumped and closed his eyes. Hera wept louder, but it was already over.\n Nahiku was justly famed for its vista walls that transformed blank corridors into fantasy spaces. On Level 7 West, where I lived, the theme was a wilderness maze enhanced by faint rainforest scents, rustling leaves, bird song, and ghostly puffs of humidity. Apartment doors didn’t appear until you asked for them.\n The path forked. I went right. Behind me, a woman called my name, “Officer Choy!” Her voice was loud and so vindictive that when the DI whispered in my mind, Hera Poliu, I thought, No way. I knew Hera and she didn’t sound like that. I turned fast.\n It was Hera all right, but not like I’d ever seen her. Her fists were clenched, her face flushed, her brows knit in a furious scowl. The DI assessed her as rationally angry, but it didn’t seem that way to me. When she stepped into my personal space I felt a chill. “I want to file a complaint,” she informed me.\n Hera was a full head shorter than me, thin and willowy, with rich brown skin and auburn hair wound up in a knot behind her head. Tishembra had invited her over for dinner a few times and we’d all gone drinking together, but as our eyes locked I felt I was looking at a stranger. “What sort of complaint, Hera?”\n “Don’t patronize me.” I saw no sign in her face of the heart-rending grief she’d displayed at the execution. “The Commonwealth police are supposed to protect us from quirks like Key.”\n “Key never hurt anyone,” I said softly.\n “He has now! You didn’t hear the magistrate’s assessment. She’s fined the city for every day since Key became a citizen. We can’t afford it, Choy. You know Nahiku already has debt problems—”\n “I can’t help you, Hera. You need to file an appeal with the magistrate—”\n “I want to file a complaint! The city can’t get fined for harboring quirks if we turn them in. So I’m reporting Tishembra Indens.”\n I stepped back. A cold sweat broke out across my skin as I looked away.\n Hera laughed. “You already know she’s a quirk, don’t you? You’re a cop, Choy! A Commonwealth cop, infatuated with a quirk. ”\n I lost my temper. “What’s wrong with you? Tishembra’s your friend.”\n “So was Key. And both of them immigrants.”\n “I can’t randomly scan people because they’re immigrants.”\n “If you don’t scan her, I’ll go to the magistrate.”\n I tried to see through her anger, but the Hera I knew wasn’t there. “No need to bother the magistrate,” I said softly, soothingly. “I’ll do it.”\n She nodded, the corner of her lip lifting a little. “I look forward to hearing the result.”\n I stepped into the apartment to find Tishembra’s three-year-old son Robin playing on the floor, shaping bridges and wheels out of colorful gel pods. He looked up at me, a handsome boy with his mother’s dark skin and her black, glossy curls, but not her reserved manner. I was treated to a mischievous grin and a firm order to, “Watch this!” Then he hurled himself onto his creations, smashing them all back into disks of jelly.\n Tishembra stepped out of the bedroom, lean and dark and elegant, her long hair hanging down her back in a lovely chaos of curls. She’d changed from her work clothes into a silky white shift that I knew was only mindless fabric and still somehow it clung in all the right places as if a DI was controlling the fibers. She was a city engineer. Two years ago she’d emigrated to Nahiku, buying citizenship for herself and Robin—right before the city went into massive debt over an investment in a water-bearing asteroid that turned out to have no water. She was bitter over it, more so because the deal had been made before she arrived, but she shared in the loss anyway.\n I crossed the room. She met me halfway. I’d been introduced to her on my second day at Nahiku, seven months ago now, and I’d never looked back. Taking her in my arms, I held her close, letting her presence fill me up as it always did. I breathed in her frustration and her fury and for a giddy moment everything else was blotted from my mind. I was addicted to her moods, all of them. Joy and anger were just different aspects of the same enthralling, intoxicating woman—and the more time I spent with her the more deeply she could touch me in that way. It wasn’t love alone. Over time I’d come to realize she had a subtle quirk that let her emotions seep out into the air around her. Tishembra tended to be reserved and distant. I think the quirk helped her connect with people she casually knew, letting her be perceived as more open and likeable, and easing her way as an immigrant into Nahiku’s tightly knit culture—but it wasn’t something we could ever talk about.\n “You were part of it, weren’t you?” she asked me in an angry whisper. “You were part of what happened to Key. Why didn’t you stop it?”\n Tishembra had taken a terrible chance in getting close to me.\n Her fingers dug into my back. “I’m trapped here, Zeke. With the new fine, on top of the old debt . . . Robin and I will be working a hundred years to earn our way free.” She looked up at me, her lip curled in a way that reminded me too much of Hera’s parting expression. “It’s gotten to the point, my best hope is another disaster. If the city is sold off, I could at least start fresh—”\n “Tish, that doesn’t matter now.” I spoke very softly, hoping Robin wouldn’t overhear. “I’ve received a complaint against you.”\n Her sudden fear was a radiant thing, washing over me, making me want to hold her even closer, comfort her, keep her forever safe.\n “It’s ridiculous, of course,” I murmured. “To think you’re a quirk. I mean, you’ve been through the gates. So you’re clean.”\n Thankfully, my DI never bothered to point out when I was lying.\n Tishembra nodded to let me know she understood. She wouldn’t tell me anything I didn’t want to know; I wouldn’t ask her questions—because the less I knew, the better.\n My hope rested on the fact that she could not have had the quirk when she came through the port gate into Nahiku. Maybe she’d acquired it in the two years since, or maybe she’d stripped it out when she’d passed through the gate. I was hoping she knew how to strip it again.\n “I have to do the scan,” I warned her. “Soon. If I don’t, the magistrate will send someone who will.”\n “Tonight?” she asked in a voice devoid of expression. “Or tomorrow?”\n I kissed her forehead. “Tomorrow, love. That’s soon enough.”\n Robin was asleep. Tishembra lay beside him on the bed, her eyes half closed, her focus inward as she used her atrium to track the progress of processes I couldn’t see. I sat in a chair and watched her. I didn’t have to ask if the extraction was working. I knew it was. Her presence was draining away, becoming fainter, weaker, like a memory fading into time.\n After a while it got to be too much, waiting for the woman I knew to become someone else altogether. “I’m going out for a while,” I said. She didn’t answer. Maybe she didn’t hear me. I rearmed myself with my chemical arsenal of gel ribbons. Then I put my uniform back on, and I left.\n All celestial cities have their own municipal police force. It’s often a part-time, amateur operation, but the local force is supposed to investigate traditional crimes like theft, assault, murder—all the heinous things people have done to each other since the beginning of time. The Commonwealth police are involved only when the crime violates statutes involving molecular science, biology, or machine intelligence.\n So strictly speaking, I didn’t have any legal right or requirement to investigate the original accident that had exposed Key’s quirk, but I took the elevator up to Level 1 West anyway, and used my authority to get past the DI that secured the railcar garage.\n Nahiku is a twin orbital. Its two inhabited towers are counterweights at opposite ends of a very long carbon-fiber tether that lets them spin around a center point, generating a pseudogravity in the towers. A rail runs the length of the tether, linking Nahiku East and West. The railcar Key Lu had failed to die in was parked in a small repair bay in the West-end garage. Repair work hadn’t started on it yet, and the two small holes in its canopy were easy to see.\n There was no one around, maybe because it was local-night. That worked for me: I didn’t have to concoct a story on why I’d made this my investigation. I started collecting images, measurements, and sample swabs. When the DI picked up traces of explosive residue, I wasn’t surprised.\n I was inside the car, collecting additional samples from every interior surface, when a faint shift in air pressure warned me a door had opened. Footsteps approached. I don’t know who I was expecting. Hera, maybe. Or Tishembra. Not the magistrate.\n Glory Mina walked up to the car and, resting her hand on the roof, she bent down to peer at me where I sat on the ruptured upholstery.\n “Is there more going on here that I need to know about?” she asked.\n I sent her the DI’s report. She received it in her atrium, scanned it, and followed my gaze to one of the holes in the canopy. “You’re thinking someone tried to kill him.”\n “Why like this?” I wondered. “Is it coincidence? Or did they know about his quirk?”\n “What difference does it make?”\n “If the attacker knew about Key, then it was murder by cop.”\n “And if not, it was just an attempted murder. Either way, it’s not your case. This one belongs to the city cops.”\n I shook my head. I couldn’t leave it alone. Maybe that’s why my superiors tolerated me. “I like to know what’s going on in my city, and the big question I have is why? I’m not buying a coincidence. Whoever blew the canopy had to know about Key—so why not just kill him outright? If he’d died like any normal person, I wouldn’t have looked into it, you wouldn’t have assessed a fine. Who gains, when everyone loses?”\n Even as I said the words my thoughts turned to Tishembra, and what she’d said. It’s gotten to the point, my best hope is another disaster. No. I wasn’t going to go there. Not with Tishembra. But maybe she wasn’t the only one thinking that way?\n The magistrate watched me closely, no doubt recording every nuance of my expression. She said, “I saw the complaint against your intimate.”\n “It’s baseless.”\n “But you’ll look into it?”\n “I’ve scheduled a scan.”\n Glory nodded. “See to that, but stay out of the local case. This one doesn’t belong to you.”\n The apartment felt empty when I returned. I panicked for the few seconds it took me to sprint across the front room to the bedroom door. Tishembra was still lying on the bed, her half-closed eyes blinking sporadically, but I couldn’t feel her. Not like before. A sense of abandonment came over me. I knew it was ridiculous, but I felt like she’d walked away.\n Robin whimpered in his sleep, turned over, and then awoke. He looked first at Tishembra lying next to him, and then he looked at me. “What happened to Mommy?”\n “Mommy’s okay.”\n “She’s not. She’s wrong.”\n I went over and picked him up. “Hush. Don’t ever say that to anyone but me, okay? We need it to be a secret.”\n He pouted, but he was frightened, and he agreed.\n I spent that night in the front room, with Robin cradled in my arm. I didn’t sleep much. I couldn’t stop thinking about Key and his quirk, and who might have known about it. Maybe someone from his past? Or someone who’d done a legal mod on him? I had the DI import his personal history into my atrium, but there was no record of any bioengineering work being done on him. Maybe it had just been a lucky guess by someone who knew what went on in the Far Reaches? I sent the DI to search the city files for anyone else who’d ever worked out there. Only one name came back to me: Tishembra Indens.\n Tishembra and I had never talked much about where we’d come from. I knew circumstances had not been kind to her, but that she’d had to take a contract in the Far Reaches—that shocked me.\n My best hope is another disaster.\n I deleted the query, I tried to stop thinking, but I couldn’t help reflecting that she was an engineer. She had skills. She could work out how to pop the canopy and she’d have access to the supplies to do it.\n Eventually I dozed, until Tishembra woke me. I stared at her. I knew her face, but I didn’t know her. I couldn’t feel her anymore. Her quirk was gone, and she was a stranger to me. I sat up. Robin was still asleep and I cradled his little body against my chest, dreading what would happen when he woke.\n “I’m ready,” Tishembra said.\n I looked away. “I know.”\n Robin wouldn’t let his mother touch him. “You’re not you!” he screamed at her with all the fury a three-year-old could muster. Tishembra started to argue with him, but I shook my head, “Deal with it later,” and took him into the dining nook, where I got him breakfast and reminded him of our secret.\n “I want Mommy,” he countered with a stubborn pout.\n I considered tranking him, but the staff at the day-venture center would notice and they would ask questions, so I did my best to persuade him that Mommy was Mommy. He remained skeptical. As we left the apartment, he refused to hold Tishembra’s hand but ran ahead instead, hiding behind the jungle foliage until we caught up, then running off again. I didn’t blame him. In my rotten heart I didn’t want to touch her either, but I wasn’t three. So the next time he took off, I slipped my arm around Tishembra’s waist and hauled her aside into a nook along the path. We didn’t ever kiss or hold hands when I was in uniform and besides, I’d surprised her when her mind was fixed on more serious things, so of course she protested. “Zeke, what are you doing?”\n “Hush,” I said loudly. “Do you want Robin to find us?”\n And I kissed her. I didn’t want to. She knew it, and resisted, whispering, “You don’t need to feel sorry for me.”\n But I’d gotten a taste of her mouth, and that hadn’t changed. I wanted more. She felt it and softened against me, returning my kiss in a way that made me think we needed to go back to the apartment for a time.\n Then Robin was pushing against my hip. “No! Stop that kissing stuff. We have to go to day-venture.”\n I scowled down at him. “Fine, but I’m holding Tishembra’s hand.”\n “No. I am.” And to circumvent further argument, he seized her hand and tugged her toward the path. I let her go with a smirk, but her defiant gaze put an end to that.\n “I do love you,” I insisted. She shrugged and went with Robin, too proud to believe in me just yet.\n Day-venture was on Level 5, where there was a prairie vista. On either side of the path we looked out across a vast land of low, grassy hills, where some sort of herd animals fed in the distance. Waist-high grass grew in a nook outside the doorway to the day-venture center. Robin stomped through it, sending a flutter of butterflies spiraling toward a blue sky. The grass sprang back without damage, betraying a biomechanical nature that the butterflies shared. One of them floated back down to land on Tishembra’s hand. She started to shoo it away, but Robin shrieked, “Don’t flick it!” and he pounced. “It’s a message fly.” The butterfly’s blue wings spread open as it rested in his small palms. A message was written there, shaped out of white scales drained of pigment, but Robin didn’t know how to read yet, so he looked to his mother for help. “What does it say?”\n Tishembra gave me a dark look. Then she crouched to read the message and I saw a slight uptick in the corner of her lip. “It says Robin and Zeke love Tishembra.” Then she ran her finger down the butterfly’s back to erase the message, and nudged it, sending it fluttering away.\n “It’s wrong,” Robin told her defiantly. “I don’t love Tishembra. I love Mommy.” Then he threw his arms around her neck and kissed her, before running inside to play with his friends.\n Tishembra and I went on to my office, where Glory Mina was waiting for us to arrive.\n When Tishembra saw the magistrate she turned to me with a look of desperation. I told her the truth. “It doesn’t matter.”\n A deep scan is performed with an injection of molecular-scale machines called Makers that map the body’s component systems. The data is fed directly into police records and there’s no way to fake the results. Tishembra should have known that, but she looked at me as if I’d betrayed her. “You don’t have to worry,” I insisted. “The scan is just a formality, a required response in the face of the baseless complaint filed against you.”\n Glory Mina watched me with a half smile. Naturally, her DI would have told her I was lying.\n I led Tishembra into a small exam room and had her sit in a large, cushioned chair. After Glory came in behind us, the office DI locked the door. I handed Tishembra a packet of Makers and she dutifully inhaled it. At the same time my DI whispered that Hera Poliu had arrived in the outer office. Sensing trouble, I looked at the magistrate. “I need to talk to her.”\n “Who?” Tishembra asked anxiously. “Zeke, what’s going on?”\n “Nothing’s going on. Everything will be fine.”\n Glory just watched me. I grunted, realizing she’d come not to observe the scan but to gauge the integrity of her Nahiku watch officer, which she had good cause to doubt. “I’ll be right back.”\n The office DI maintained a continuous surveillance of all rooms. I channeled its feed, keeping one eye on Tishembra and another on Hera as she looked around the front office with an anxious gaze. She appeared timid and unsure—nothing at all like the angry woman who had accosted me yesterday. “Zeke?” she called softly. “Are you here?”\n When the door opened ahead of me, she startled.\n “Zeke!” Hera’s hands were shaking. “Is it true Tishembra’s been scheduled for a scan? She didn’t have anything to do with Key. You have to know that. She hardly knew him. There’s no reason to suspect her. Tishembra is my best engineer and if we lose her this city will never recover . . . Zeke? What is it?”\n I think I was standing with my mouth open. “You filed the complaint that initiated the scan!”\n “Me? I . . . ” Her focus turned inward. “Oh, yesterday . . . I wasn’t myself. I took the wrong mood patch. I was out of my head. Is Tishembra . . . ?”\n The results of the scan arrived in my atrium. I glanced at them, and closed my eyes briefly in silent thanks. “Tishembra has passed her scan.”\n Against all expectation I’d made a home at Nahiku. I’d found a woman I loved, I’d made friends, and I’d gained trust—to the point that people would come to me for advice and guidance, knowing I wasn’t just another jackboot of the Commonwealth.\n In one day all that had been shattered and I wanted to know why.\n I sent a DI hunting through the datasphere for background on Key Lu. I sent another searching through Hera Poliu’s past. I thought about sending a third after Tishembra—but whatever the DI turned up would go into police records and I was afraid of what it might find.\n Tish had used a patch to calm herself, resolved to go into work as if nothing was changed. “I’m fine,” she insisted when I said I’d walk with her. She resented my coddling, but there were questions I needed to ask. We took the elevator, stepping out into a corridor enhanced with a seascape. The floor appeared as weathered boardwalk; our feet struck it in hollow thumps. Taking her arm, I gently guided her to a nook where a strong breeze blew, carrying what I’m told is the salt scent of an ocean, and hiding the sound of our voices. “Tish, is there anything you need to tell me?”\n Resentment simmered in her eyes. “What exactly are you asking?”\n “You spent time in the Far Reaches.”\n “So?”\n “Did you know about Key Lu?”\n I deserved the contempt that blossomed in her expression. “There are hundreds of tiny settlements out there, Zeke. Maybe thousands. I didn’t know him. I didn’t know him here, either.”\n The DI returned an initial infodump. My focus wavered. Tishembra saw it. “What?” she asked me.\n “Key Lu was a city finance officer, one who signed off on the water deal.”\n “The water deal with no water,” she amended bitterly. Crossing her arms, she glared at the ocean.\n “Someone tried to kill him,” I told her, letting my words blend in with the sea breeze.\n She froze, her gaze fixed on the horizon.\n “There was never a micrometeor. His railcar was sabotaged.”\n I couldn’t read her face and neither could the DI. Maybe it was the patch she’d used to level her emotions, but her fixed expression frightened me.\n She knew what was going on in my head, though. “You’re asking yourself who has the skill to do that, aren’t you? Who could fake a meteor strike? If it were me, I’d do it with explosive patches, one inside, one outside, to get the trajectory correct. Is that how it was done, Zeke?”\n “Yes.”\n Her gaze was still fixed on the horizon. “It wasn’t me.”\n “Okay.”\n She turned and looked me in the eye. “It wasn’t me.”\n The DI whispered that she spoke the truth. I smiled my relief and reached for her, but she backed away. “No, Zeke.”\n “Tish, come on. Don’t be mad. This day is making us both crazy.”\n “I haven’t accused you of being a murderer.”\n “Tish, I’m sorry.”\n She shook her head. “I remember when we used to trust each other. I think that was yesterday.”\n The second DI arrived with an initial report on Hera. Like an idiot, I scanned the file. To my surprise, I had a new suspect, but while I was distracted, Tishembra walked away.\n Glory Mina was waiting for me when I returned to my office. She’d tracked my DIs and copied herself on their reports. “You should have been a municipal cop,” she told me. She sat perched on the arm of a chair, her arms crossed and her eyes twinkling with amusement.\n “It’s not like I had a choice.”\n She cocked her head, allowing me the point. Reading from the DI’s report, she said, “So Hera Poliu had a brother. Four years ago he was exiled from Nahiku, and a year after that he was arrested and executed for an illegal enhancement.”\n “Hera lost her brother. She’s got to resent it. Maybe she resents anybody who has a—” I caught myself. “Anybody she thinks might have a quirk.”\n “Maybe,” Glory conceded. “And maybe that’s why she made a complaint against your intimate, but so what? It’s not your case, Zeke. Forward what you’ve got to whoever had the misfortune to be appointed as the criminal investigator in this little paradise and let it go.”\n I made compliant noises. She shook her head, not needing the DI to know I wasn’t being straight. “Walk with me.”\n “Where?”\n “The mausoleum. I’m going home. But on the way there, you’re going to listen to what I have to say about the necessity for boundaries.” She crooked her finger at me. I shrugged and followed. As we walked past the vistas she lectured me on the essential but very limited role of the Commonwealth police and warned me that my appointment as watch officer at Nahiku could end at any time. I listened patiently, knowing she would soon be gone.\n As we approached the mausoleum, I sent a DI to open the door. Inside was a long hallway with locked doors on either side. Behind the doors were storage chambers, most of them belonging to corporations. The third door on the left secured the police chamber. It opened as we approached, and closed again when we had stepped inside. One wall held clothing lockers. The other, ranks of cold storage drawers stacked four high. “Magistrate Glory Mina,” Glory said to the room DI. She stripped off her clothes and hung them in one of the lockers while the drawers slid past each other, rearranging themselves. Only two were empty. One was mine. The other descended from the top rank to the second level, where it opened, ready to receive her.\n Glory closed the locker door. She was naked and utterly unconcerned about it. She turned to me with a stern gaze. “You tried to pretend Key Lu was a victim. This once, I’m going to pretend you just missed a step in the background investigation. Zeke, as much as you don’t like being a cop, being an ex-cop can be a lot worse.”\n I had no answer for that. I knew she was right.\n She climbed into the drawer. As soon as she lay back, the cushions inflated around her, creating a moist interface all across the surface of her skin. The drawer slid shut and locked with a soft snick. Very soon, her ghost would be on its way to Red Star. Once again, I was on my own.\n No matter what Glory wanted, there was no way I was going to set this case aside. Key Lu was dead, while Tishembra had been threatened and made into a stranger, both to me and to her own son. I wanted to know who was responsible and why.\n Still, I knew how to make concessions. So I set up an appointment with an official who served part-time as a city cop, intending to hand over the case files, if only for the benefit of my personnel record. But before that could happen a roving DI returned to me with the news that the city’s auto-defense system had locked down a plague outbreak on Level 5 West. The address was Robin’s day-venture center.\n It took me ninety seconds to strip off my uniform and wrap on the impermeable hide of a vacuum-capable skinsuit, police black, with gold insignia. Then I grabbed a standard-issue bivouac kit that weighed half as much as I did, and I raced out the door.\n We call it plague, but it’s not. Each of us is an ecosystem. We’re inhabited by a host of Makers. Some repair our bodies and our minds, keeping us young and alert, and some run our atriums. But most of our Makers exist only to defend us against hostile nanotech—the snakes that forever prowl the Garden of Eden, the nightmares devised by twisted minds—and sometimes our defenses fail.\n A general alert had not been issued—that was standard policy to avoid panic—but as soon as I was spotted on the paths wearing my skinsuit, word went out through informal channels that something was wrong. By the time I reached the day-venture center people had already guessed where I was going and a crowd was beginning to form against the backdrop of prairie. The city’s emergency response team hadn’t arrived yet, so questions were shouted at me. I refused to answer. “Stay back!” I commanded, issuing an order for the center’s locked door to open.\n In an auto-defense lockdown, a gel barrier is extruded around the suspect zone. The door slid back to reveal a wall of blue-tinged gel behind it. I pulled up the hood of my skinsuit and let it seal. Then I leaned into the gel wall, feeling it give way slowly around me, and after a few seconds I was able to pass through. As soon as I was clear, the door closed and locked behind me.\n The staff and children were huddled on one side of the room—six adults and twenty-two kids. They looked frightened, but otherwise okay. Robin wasn’t with them. The director started to speak but I couldn’t hear him past the skinsuit, so I forced an atrial link to every adult in the room, “Give me your status.”\n The director spoke again, this time through my atrium. “It’s Robin. He was hit hard only a couple of minutes ago. Shakes and sweats. His system’s chewing up all his latents and he went down right away. I think it’s targeted. No one else has shown any signs.”\n “Where is he?”\n The director looked toward the nap room.\n I didn’t want to think too hard, I just wanted to get Robin stable, but the director’s assessment haunted me. A targeted assault meant that Robin alone was the intended victim; that the hostile Maker had been designed to activate in his unique ecosystem.\n I found him on the floor, trembling in the grip of a hypoglycemic seizure, all his blood sugars gone to fuel the reproduction of Makers in his body—both defensive and assault—as the tiny machines ramped up their populations to do battle on a molecular scale. His eyelids fluttered, but I could only see the whites. His black curls were sodden with sweat.\n I unrolled the bivouac kit with its thick gel base designed for a much larger patient. Then I lifted his small body, laid him on it, and touched the activation points. The gel folded around him like a cocoon. The bivouac was a portable version of the cold storage drawer that had enfolded Glory. Robin’s core temperature plummeted, while an army of defensive Makers swarmed past the barrier of his skin in a frantic effort to stabilize him.\n The city’s emergency team came in wearing sealed skinsuits. I stood by as they scanned the other kids, the staff, the rooms, and me, finding nothing. Only Robin was affected.\n I stripped off my hood. Out in the playroom, the gel membrane was coming down and the kids were going home, but inside the bivouac Robin lay in stasis, his biological processes all but stopped. Even the data on his condition had been pared to a trickle. Still, I’d seen enough to know what was happening: the assault Makers were attacking Robin’s neuronal connections, writing chaos into the space where Robin used to be. We would lose him if we allowed him to revive.\n I checked city records for the date of his last backup. I couldn’t find one. Robin had turned three a few weeks ago. I remembered we’d talked about taking him in to get a backup done . . . but we’d been busy.\n The emergency team came back into the nap room with a gurney. Tishembra came with them. One glance at her face told me she’d been heavily tranked.\n At first she didn’t say anything, just watched with lips slightly parted and an expression of quiet horror on her face as the bivouac was lifted onto the gurney. But as the gurney was rolled away she asked in a defeated voice, “Is he going to die?”\n “Of course he’s not going to die.”\n She turned an accusing gaze on me. “My DI says you’re lying.”\n I cursed myself silently and tried again, determined to speak the truth this time. “He’s not going to die, because I won’t let him.”\n She nodded, as if I’d got it right. The trank had turned her mood to smooth, hard glass. “I made this happen.”\n “What are you talking about?”\n She turned her right hand palm up. A blue prairie butterfly rested in it, crushed and lifeless. I picked it up; spread its wings open. The message was only a little blurred from handling. On the left wing I read, You lived, and on the right, so he dies.\n So someone had watched as we’d dropped Robin off that morning. I looked up at Tishembra. “No,” I told her. “That’s not the way it’s going to work.”\n The attack on Robin was a molecular crime, which made it my case, and I was prepared to use every resource of the police to solve it.\n Tishembra nodded. Then she left, following the gurney.\n I could work anywhere, using my atrium, so I stayed for a time. First I packed up every bit of data I had on Robin’s condition and sent it to six different police labs, hoping at least one could come up with the design for a Maker that could stop the assault on Robin’s brain cells. The odds of success would go up dramatically if I could get the specs of the assault Maker—and the easiest way to do that was to track down the twisted freak who’d designed it.\n Easy steps first: I sent a DI into the datasphere to assemble a list of everyone at Nahiku with extensive molecular design experience. The DI came back with one name: mine.\n So I was dealing with a talented hobbyist.\n It could be anyone.\n I sent the DI out again. No record was kept of butterfly messages—they were designed to be anonymous—but surveillance records were collected on every public path. I instructed the DI to access the records and assemble a list of everyone who’d set foot on Level 5 at any time that day, because the blue prairie butterflies could only be accessed from there. The list that came back was long. Name after name scrolled through my visual field, many that I recognized, but only one stood out in my mind: Hera Poliu.\n I summoned the vid attached to her name. It was innocuous. She’d been taking the stairs between levels and had paused briefly on the landing. Still, it bothered me. Hera had been involved with Key Lu, she’d filed the complaint against Tishembra, and now I had her on Level 5. Coincidence maybe . . . but I remembered the chill I’d felt when she accosted me in the corridor . . . and how confused she’d been when I reminded her of the incident.\n I went by my office and changed back into my uniform. Then I checked city records for Hera’s location. She was at the infirmary, sitting with Tishembra . . . Tishembra, who’d been a quirk just like Hera’s brother except she’d eluded punishment while Hera’s brother was dead. Maybe it was baseless panic, but I sprinted for the door.\n The infirmary had a reception room with a desk, and a hallway behind it with small rooms on either side. The technician at the desk looked up as I burst in. “Robin Indens!” I barked.\n “Critical care. End of the hall.”\n I sprinted past him. A sign identified the room. I touched the door and it snapped open. The bivouac had been set up on a table in the center of the room. Slender feeder lines descending from the ceiling were plugged into its ports. Tishembra and Hera stood alongside the bivouac, Hera with a comforting arm around Tishembra’s shoulders. They both looked up as I burst in. “Zeke?” Tishembra asked, with an expression encompassing both hope and dread.\n “Tish, it’s going to be okay. But I need to talk to Hera. Alone.”\n They traded a puzzled glance. Then Hera gave Tishembra a quick hug—“I’ll be right back”—and stepped past me into the hall. I followed her, closing the door behind us.\n Hera turned to face me. She looked gaunt and worn—a woman who had seen too much grief. “I want to thank you, Zeke, for not telling Tishembra who filed that complaint. I wasn’t myself when I did it. I don’t even remember doing it.”\n She wasn’t lying.\n I stumbled over that fact. Had I gotten it wrong? Was there something more going on than a need for misguided revenge?\n “When was the last time you had your defensive Makers upgraded?”\n She flinched and looked away. “It’s been a while.”\n I sent a DI to check the records. It had been three years. I pulled up an earlier report and cross-checked the dates to be sure. She hadn’t had an upgrade since her brother’s execution. My heart rate jumped as I contemplated a new possibility. No doubt my pupils dilated, but Hera was still looking away and she didn’t see it. I sent the DI out again.\n We were standing beside an open door to an unoccupied office. I ushered Hera inside. The DI came back with a new set of records even before the door was closed. At my invitation, Hera sat in the guest chair, her hands fidgeting restlessly in her lap. I perched on the edge of the desk, scanning the records, trying to stay calm, but my DI wasn’t fooled. It sensed my stress and sent the paralytic ribbon creeping down my arm and into my palm.\n “Let’s talk about your brother.”\n Hera’s hands froze in her lap. “My brother? You must know already. He’s dead . . . he died like Key.”\n “You used to be a city councilor.”\n “I resigned from the council.”\n I nodded. “As a councilor you were required to host visitors . . . but you haven’t allowed a ghost in your atrium since your brother’s arrest.”\n “Those things don’t matter to me anymore.”\n “You also haven’t upgraded your defensive Makers, and you haven’t been scanned—”\n “I’m not a criminal, Zeke. I just . . . I just want to do my job, and be left alone.”\n “Hera? You’ve been harboring your brother’s ghost, haven’t you? And he didn’t like it, when you started seeing Key.”\n The DI showed me the flush of hot and cold across her skin. “No,” she whispered. “No. He’s dead, and I wouldn’t do that.”\n She was lying. “Hera, is your atrium quirked? To let your brother’s ghost take over sometimes?”\n She looked away. “Wouldn’t that be illegal?”\n “Giving up your body to another? Yes, it would be.”\n Her hands squeezed hard against the armrests of the chair. “It was him, then? That’s what you’re saying?” She turned to look at me, despair in her eyes. “He filed the complaint against Tish?”\n I nodded. “I knew it wasn’t you speaking to me that day. I think he also used you to sabotage Key’s railcar, knowing I’d have to look into it.”\n “And Robin?” she asked, her knuckles whitening as she gripped the chair.\n “Ask him.”\n Earlier, I’d asked the DI to bring me a list of all the trained molecular designers in Nahiku, but I’d asked the wrong question. I queried it again, asking for all the designers in the past five years. This time, mine wasn’t the only name.\n “Ask him for the design of the assault Maker, Hera. Robin doesn’t deserve to die.”\n I crouched in front of her, my hand on hers as I looked up into her stunned eyes. It was a damned stupid position to put myself into.\n He took over. It took a fraction of a second. My DI didn’t catch it, but I saw it happen. Her expression hardened and her knee came up, driving hard into my chin. As my head snapped back he launched Hera against me. At that point it didn’t matter that I outweighed her by forty percent. I was off balance and I went down with her on top of me. Her forehead cracked against my nose, breaking it.\n He wasn’t trying to escape. There was no way he could. It was only blind rage that drove him. He wanted to kill me, for all the good it would do. I was a cop. I had backups. I couldn’t lose more than a few days. But he could still do some damage before he was brought down.\n I felt Hera’s small hands seize my wrists. He was trying to keep me from using the ribbon arsenal, but Hera wasn’t nearly strong enough for that. I tossed her off, and not gently. The back of her head hit the floor, but she got up again almost as fast as I did and scrambled for the door.\n I don’t know what he intended to do, what final vengeance he hoped for. One more murder, maybe. Tishembra and Robin were both just across the hall.\n I grabbed Hera, dragged her back, and slammed her into the chair. Then I raised my hand. The DI controlled the ribbon. Fibers along its length squeezed hard, sending a fine mist across Hera’s face. It got in her eyes and in her lungs. She reared back, but then she collapsed, slumping in the chair. I wiped my bloody nose on my sleeve and waited until her head lolled against her chest. Then I sent a DI to Red Star.\n I’d need help extracting the data from her quirked atrium, and combing through it for the assault Maker’s design file.\n It took a few days, but Robin was recovered. When he gets cranky at night he still tells Tishembra she’s “wrong,” but he’s only three. Soon he won’t remember what she was like before, while I pretend it doesn’t matter to me.\n Tishembra knows that isn’t true. She complains the laws are too strict, that citizens should be free to make their own choices. Me, I’m just happy Glory Mina let me stay on as Nahiku’s watch officer. Glory likes reminding me how lucky I am to have the position. I like to remind her that I’ve finally turned into the uncompromising jackboot she always knew I could be.\n Don’t get me wrong. I wanted to help Hera, but she’d been harboring a fugitive for three years. There was nothing I could do for her, but I won’t let anyone else in this city step over the line. I don’t want to sit through another execution.\n Nahiku isn’t quite bankrupt yet. Glory assessed a minimal fine for Hera’s transgression, laying most of the fault on the police since we’d failed to hunt down all ghosts of a condemned criminal. So the city won’t be sold off, and Tishembra will have to wait to get free.\n I don’t think she minds too much.\n Here. Now. This is enough. I only wonder: Can we make it last?\n Copyright © 2012 by Linda Nagata. Originally published in Analog Science Fiction, October 2012.\n Linda Nagata is a Nebula and Locus-award-winning author. She's spent most of her life in Hawaii, where she's been a writer, a mom, and a programmer of database-driven websites. She lives with her husband in their long-time home on the island of Maui.{Her most recent work is The Red trilogy, a series of near-future military thrillers published by Saga Press/Simon & Schuster. The first book in the trilogy, The Red: First Light, was named as a Publishers Weekly Best Book of 2015. \"Nahiku West\" marked her return to writing short fiction after a twelve-year hiatus. It’s set in the story world of her Nanotech Succession novels, and looks at the early life of a minor character from her novel, The Bohr Maker. The story was runner up for the 2013 Theodore Sturgeon Memorial Award."}