{"fingerprint": "ex7eyWIfK9zd+M9cs7ajmcFOYhI=", "sitename": null, "title": null, "author": "Jeff Reynolds", "date": "2022-01-01", "source": null, "hostname": null, "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine:", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": null, "text": "4030 words, short story\n “Remember The Washington,” They Said as They Fed the Ugoxli\n They took the baby, swaddled in a blanket made of soft, blue cotton, down the dirt track through vine-covered trees, deep into the swamp. Their boots splashed through puddles as they walked, and insects sent piercing squeals through the woods. The baby slept soundly until the end. Not even murmured conversation about the terrible things that had been done that evening woke It.\n Two moons rode over their shoulders as they picked their way along the half-forgotten trail. Little Neid, a red, pockmarked boil shining dim against the night sky. Below it Nolim, fatter and wider, a pregnant blue lady that chased her little red brother like a pool ball across the heavens, features smooth and unblemished this far from her icy surface. Nolim’s light was bright enough to show the way, casting the world in blues and grays, with enough of a glow from Neid to make the shadows appear carmine.\n When the four men reached the edge of solid ground where soggy earth turned to muddy brown fluid, they tossed It into the waters. It woke then, hissing in fear, but the squalls were brief, cut short by the water that filled Its lungs and the ugoxli with their sharp teeth.\n “Remember The Washington,” three men said, a ragged chorus drowned by the feeding of the monsters beneath the froth. The fourth stood silent.\n The men watched the surface churn for a few minutes as the ugoxli took what had been offered, green scales glinting in the moonlight. Once the waters stilled, they walked back the way they’d come, three of them as quiet as if they were in church. Only the youngest of the four spoke, talking rapidly about The Washington, the men and women who had died, the rightness of what they had done that evening.\n “They got what’s coming to all of Them,” he said, his right hand making spasmic gestures in front of his body, like he illustrated what he’d do if he could only get within reach of Them. He giggled. “They all deserved what Those got. Them and Their peace. More like fucking slaves is what it is.”\n “Shut up,” the man who had served said. Quiet words, but spoken hard. Like a boulder blocking a path, the words not rounded off by rain and wind, jagged enough to cut.\n The man who had served had been among the crews that worked recovery detail after the destruction of The Washington. He’d gone out in an old pressure suit that smelled of the previous ten users’ sweat, with an Anubis pack strapped to his back, day after day, pulling the dead into the depressurized bay to lay in tidy rows, held to the metal deck plates with magnetic straps. Some were swollen inside their pressure suits, like fat, pink balloons. Some had red flecks staining their face, their last exhalation bloody as their lungs ruptured. Others looked as though they merely slept, statues of icy perfection except for the frost that rimed their eyelashes and lips.\n The boy was too young to have known any of the crew who had served on The Washington, nor any depravation because of the war. He’d been born after the peace had been offered and folks had begun going about their lives again. He didn’t know anything; all talk and not a lick of sense. His mouthy cowardice had taken two lives already, and forced the man who had served to sacrifice a child, too.\n The boy cast his eyes to the earth and his talk ground down, words falling away like a pebble sliding downhill, diminishing. He mumbled softly, but since the other men couldn’t hear what he said, they didn’t mind this as much. He jammed hands into his pockets and tucked his head between his shoulders.\n When they reached the main road, the man who had served said nothing. He turned right, heading away from town and toward his home on the edge of the swamp. He walked slowly; eyes fixed on the gravel before him. Nolim overtook her little brother and they traded positions in the sky by the time the man arrived home, the pregnant lady near enough now to overhead to make no difference.\n He stood outside the house, little more than a shack he’d pieced together from other homes abandoned by those who’d gone off to war and never returned. The settlers who’d come here to plow and plant and make a new world as green as the old one they remembered, and who gave their bodies to protect what they had started. They floated frozen in space, or rotted beneath the soil of some planet no one could name. He took little pieces of their memories for his own and lived in the shade of their haunts.\n After a long wait, he went inside. Not much to see in the one room beyond a worn table and chair, a bed in the corner. He bent and moved a loose floorboard aside. A small bundle of dirty, red cloth lay in the exposed gap. He unwrapped it, picking the antique Smith & Wesson out of the scrap of an old shirt he had used to keep it from getting dirty. He sat on the edge of his bed, thumbing the hammer back, pulling the trigger, listening to the click as the pin snapped on an empty chamber.\n He let out a long breath and held his lungs empty as he pressed the barrel against his temple, hard enough to mark his skin. Then he pulled the trigger, each snap sending a jolt through his skull. Once for each of his friends from The Concord, killed when she crashed on a nameless world. Once more for The Lexington bridge crew, sucked out of their ship when a rail gun slug punched through the room. Once for his brother, lost during a ground landing from the assault ship, Akoshi. A last time for the two hundred and ten bodies he pulled from space after the destruction of The Washington. Then he took a box of ammunition from the hole and loaded the cylinder.\n He climbed into the rude bunk against the wall boards and fell asleep clutching the revolver to his chest.\n The man who had served walked into town. Morning light gave a watery glow to the road ahead, and it would be hot. It was always hot.\n Someone had found the bodies. He kept an old radio by the bed and charged the battery with a hand winder. He listened to the news every morning. He didn’t want to hear it had all begun again, though it couldn’t of course, now that the peace had been offered, accepted. He didn’t want to know. But he did it just the same, and he’d heard the news before he left the shack that morning.\n Some government official had stopped to pay an early morning call on the only members of They who lived inside the colony. He’d knocked and the door swung open. The mouthy boy had told his father he’d closed it after they’d left with the baby, but he must have lied. The official found the bodies where the men left Them lying on the cold floor of Their home.\n “They moved, so I shot Them,” the boy had said. “They shouldn’t have moved. Fucking ugly monsters, that’s what They are. I told Them not to move.”\n The father had called the man who served to ask for his advice. The three who did the killing hadn’t known there was a baby and couldn’t decide what to do. None of them had the stomach to kill an infant. They called someone they thought hated Them worse than they did.\n “He thinks we should leave the kid where it is,” the father had said. He shrugged, a helpless gesture suggesting he probably agreed.\n “This isn’t about what any of you think,” the man who had served had said. “You didn’t think at all.” He didn’t like this man, who’d come here years ago on a freighter and had decided to stay. A man with no roots. He hadn’t served, but talked as though he knew what it was like. He’d stayed home, got a medical avoidance slip. He’d avoided taking the peace, and kept his son from it as well.\n The boy’s father had shrugged again. “No, maybe not. But that still leaves us with deciding what to do.”\n The boy liked to talk. All the walk into the swamp he talked about Them, how he’d killed Them, how it felt. He wanted to kill more of Them. He couldn’t still his tongue and be silent in the doing of it, he had to relive it over and over. The man who served had known young men like him, the ones who talked about life and death like they were two sides of a game. They were broken inside, cracked pieces of clay that you couldn’t repair, and their fear leaked from the gaps in their flesh like weeds sprouting through broken pavement. Soon enough he’d talk to someone else who wasn’t his father. The kid would be reported, picked up, interrogated. They’d have the other two soon after. They’d make them all take the peace, and then They’d come for him.\n That he couldn’t allow.\n So, he walked to town, and the gun rubbed against the skin at his waist where he’d tucked it into the top of his trousers. He didn’t have a holster, and that was the best he could do. He kept his shirt untucked to cover it.\n The other two men were waiting for him near the first houses, leaning against the side of a picket fence that slumped over. The man who was the father pulled at strips of peeling paint and flicked them onto the road. He heard the crunch of gravel and looked up when the man who had served approached. He nodded at the other man and they stepped forward.\n “Rest easy, friend,” the father said, lifting a hand and placing it on the chest of the man who had served, as though he could hold him back. As if anyone could hold back the tide. The tide wore you down until you crumbled into pebbles, and then sand, and then nothing.\n The man who had served slumped his shoulders as though relaxed. “Where’s the boy?”\n “Down on the corner at the bar having a drink. He needed something to calm him after all that business last night. He won’t talk, you can rest easy, friend.” His face took on a sly look, head turned away, mouth crooked. “No one’s going to know what you did to that little baby, I promise.”\n The man who had served nodded. “That’s good to know.” He pulled the gun out of his waistband and pressed it to the temple of the father.\n “Wait,” the father said, his voice rising, becoming a whine. “I told you, it’s all good. I wasn’t threatening you.”\n The man who had served pulled the trigger. “The Concord,” he said, as the body fell to the ground at his feet.\n The other man stood frozen, his face a grimace, like a mask hanging on the wall of a forgotten temple. Eyes wide, teeth bared, hands coming up in supplication. He shook his head, laughed. He didn’t speak. He kept laughing, though.\n He’d never served, either. He’d run away and hid rather than go to war. Came out when it ended, took up a life here. The man who had served shot him in the stomach. He waited for the echo of the gun to diminish. “The Lexington.”\n People came out of their homes and their shops. They watched as he walked down the middle of the street and into town, the smoking gun held low by his hip, the muzzle pointing down. They saw the two men he left behind, one dead, one holding his stomach and screaming as he lay on the ground kicking his feet. Some walked back inside, some stood and watched, curious, as though this didn’t concern them and, in their unconcern, they were immune to the bullets that sat in the revolver’s chamber. Some smiled and waved, as if they knew him. These people had all taken peace into their hearts and heads. Killing them would be worse than feeding the ugoxli.\n He left them alone. He moved past them, stopped seeing them. What he saw were bodies lined up on the deck plating. The ones who looked like they were asleep and would wake soon, though they were a frozen block of ice; those he saw most often. They’d found their peace.\n He walked past the commissary, the drug dispensary, the greenery, the in vitro clinic. He reached a cross street with a bar on the corner, dirty windows covered with signs, an alley behind it full of trash. The strains of a country song leaked out of its wooden walls, along with the scent of cigarette smoke and beer. Sirens began somewhere, still distant. He had time.\n He stepped into the bar, waiting for the dim lights to grow brighter. The boy sat at the end of the bar, alone, tossing back glasses of liquor. His face was in profile, his cheeks damp. His lips moved, silent words tripping off his never-stilled tongue to flow like liquid silk across the stained bar he leaned on. Day-after regrets. The mouthy ones always cried like babies the next day when they thought no one would know.\n The kid slapped his shot glass down and wiped the back of his shirtsleeve across his nose. “Another,” he said. It was the last thing he said.\n “The Akoshi,” the man who had served said when the noise died and he could hear the music again. He nodded an apology to the fellow who’d have to clean up after him, slapped twenty bucks on the counter, and left. The screen door banged shut behind him.\n He turned right, moving further into the colony. The dirt road terminated at fresh pavement. They’d planted trees along this road, shading it with broad leaves. It was pretty. Peaceful. Exactly what everyone had wanted when the war began. A place to live in quiet enjoyment. But who could do that when you closed your eyes and saw bodies drifting through the void, in orbit around a distant sun, like little asteroids?\n Ahead stood the low-slung metal building of the port facility, where They stayed. Only Their diplomats came into town, and They were dead. The rest stayed here at Wrigley Station. They controlled access in and out. The ships that landed were guided by Their pilots, the star charts written by Their astronomers, the stargates built by Their engineers.\n He crossed the road between cars. A man stepped out of a booth to the right of the security gate. “Sir, may I help you?” he said. He had no weapon but his smile. He didn’t think he needed one.\n The man who had served punched him. He went down in a tangle of limbs, holding his gut, gasping for the air that he’d lost. The man walked through the open gate, across heat-stroked blacktop, and into the main building of the port.\n Inside was hot and dry, with oversized chairs in rainbow patterns scattered around a wide room, a wall of glass opposite the entrance. They waited for him, at least a dozen. The man who had served held the gun at his side. He looked up into Their yellow eyes, black-slitted, inset in narrow heads that rose above slender necks.\n “Have you come to your peace?” They asked. None of Them raised a finger pod toward him. They watched him, eyes unblinking, while behind Them, beyond the clear glass, a shuttle rose into the hazy sky of midmorning, its slender, white form disappearing into puffy clouds. The building shook with its passing.\n When the sound faded, the man who had served raised the revolver and pointed at the nearest of Them. “I came because it was time.”\n One stepped forward, or slithered forward, or became in front of the others. The man never could tell how They moved, only that They were there, and then here. Something in Their gait tricked the eye so you couldn’t quite see it right. This one had more folds of flesh around Its eyes than the others, and Its head sagged on its neck, never rising above spindly shoulders.\n He knew Them well enough to know It was old. Maybe older than he. “I served,” the man who had served said.\n “As did I,” It said. “We watched ken go back to dust and more dust.” It paused, and lowered Its head to the ground, touching Its snout to the white floor tiles. “We participated in many deaths.”\n The man who had served had never seen one of Them bow to a man before. “You know why I came then,” he said. “There is no peace for us.”\n “No,” It agreed.\n “You will take me?”\n “Yes,” It agreed.\n They parted, and the one who had become forward now went behind and moved toward a wall to the right. He followed, holding the gun loosely, finger off the trigger.\n A panel slid open, and they went through. The wet heat of the day grabbed him by the throat, the sweat rising on his skin almost instantly. The heat did not bother Them, it was what They were used to. Across the PDP-covered landing field, a shuttle waited, shimmering in the mirages that rose from the hot stone beneath the diamond-layered surface. A screen of thick foliage blocked the view the spaceport would have of the ocean, and kept cooler breezes from sweeping across the field. He felt like he broiled as he strolled behind the slithering form.\n Inside, the compartment felt narrow and confining. The shuttle had been designed for tall beings, spindly beings, beings made of long limbs and many joints. There was one seat, though, for a human, and he took it. He strapped himself into the harness, closed his eyes. The gun rested on his lap, his hand curled around it, as thrust pushed him with its heavy hand back into the seat. He kept still until the pulse of the engines shifted, and gravity fell back down the hole, leaving him weightless.\n There were no windows in Their ships. They preferred darkness. They viewed the universe through monitors and screens, text readers that described the world to Them in Their language, slashes and squiggles he’d never bothered to learn. There was nothing for him to see from where he sat other than walls pressing around him. Smaller than his shack, and that somehow comforted him.\n It returned. Now the narrow corridors became Its advantage, the rough surfaces of what had been walls and floors and ceilings now all one to It as It becomes here from where It had been there. It waited until he unstrapped and floated to meet Its yellowed slits.\n “How many?” he asked.\n “Uncounted,” It said.\n “The Washington?”\n “Yes.”\n “The Lexington?”\n “Yes.”\n “The Concord?”\n “Do you wish Our death?”\n He lifted the gun and looked at it. Three bullets in the chamber. More in his pocket. But if he’d wanted to kill Them, he would have done so in the station, when They’d stood before him and waited for him to patch the cracked walls of his heart with the lives before him. That wouldn’t have been enough. There wasn’t enough blood to fill all the holes he had.\n “No,” he said. He motioned, opening his fingers, watched the gun drift away in the cabin. It rotated slowly until it brushed a wall, then spun beyond his sight. “I came to find peace.”\n “There is no peace,” the old One said. “We two know this.”\n “How many?”\n “Why do you insist on a number?”\n “Two hundred and ten bodies. I spent a week pulling them from space and bringing them home. Seventeen were never found. The took me off the line because they couldn’t trust me to kill anymore, but they trusted me with the dead.”\n The old One bowed to the floor, which had been the wall on the ground. “The Washington?”\n He nodded.\n “How many more did you handle?”\n He shrugged. “Countless.”\n “One thousand sixty-eight,” It whispered.\n The man who had served nodded again. “I killed men today. They’d broken into the ambassador’s home, killed him and his mate. They asked me to help them.”\n “Why did you kill them?”\n “They deserved it. No treatment would cure the virus that infected them, the black stains in their hearts. They didn’t deserve peace. They would have left the kid orphaned. But it was my decision to take the child to the ugoxli. It was the right thing to do.”\n There was a long pause while It appraised him. It lifted its head higher. “You were a captive,” It said, unquestioning. “How long?”\n “Three years.”\n “And you learned Our traditions.”\n “Some,” the man who had served said. “The boy thought I was doing what I did out of hatred. Not out of respect.”\n It bowed again. “You did it to honor Us.”\n “No,” he said. “I knew the baby wouldn’t live without the chemicals only its birth parents could produce. But I didn’t do what I did because it’s Your custom to feed orphans to a predator instead of allowing them to suffer a slow death through starvation. I did it for myself.”\n “Why do you tell this?” It asked.\n “Because,” he said, and stopped. He added nothing to that. “Why did you not find peace?” he asked, after the silence became frozen bodies lying on a deck plate.\n It turned and made a sound like a teapot whistling. A laugh. “You know why. Some of Us could not find a way to peace. Some of Us decided to stay as We were so that We would be there for you who did not find it, too.”\n “Some took it.”\n “But not all. Not even most. Because peace does not mean living contentedly, does it. It means living with the memory of each skin that passed through Our hands but being unable to feel it. That seems wrong, somehow. It dishonors the dead.” It lifted Its head high and straight and peered up at something beyond the hull of the ship. “I will feel every death that I have made, every skin that I have touched. To take the peace is to dishonor them, and cheapens their loss.”\n “I’m tired,” the man said. “What now?”\n “We do what’s next,” It said. “The only thing left for Us to do.”\n “I can’t go back down there. They’ll arrest me. Force me to take the treatment.”\n “That We cannot allow,” It said. “There are other colonies, with others like Us.”\n It went forward and lead him to the control room at the front of the shuttle. When It entered, It turned back to him and waited until he pushed off a wall and drifted down the narrow hall to join. The door hissed shut behind him. It ran a finger pod over the control panel until a green dial appeared. A bite appeared in the left upper of the circle and begin to eat away at the circumference. The circle became a lopsided u, then a reversed c.\n It drifted to the center of the room and pulled a strap from the floor. It wound the stiff fiber over Its belly and lay back.\n He joined It, finding a spot near where It lay, another strap to hold him down. The c of the circle became a smaller and smaller arc. He craned his neck, watching the light shrink until the last segment flashed red, and then it was gone.\n “Are you ready?” They asked.\n “Remember The Washington,” the man who had served answered.\n “Always,” They said. “We will remember and help others find their peace. Even the uncomfortable peace of feeling.”\n The engines fired, and they began the long ride toward the system’s outer rim and the gate beyond.\n Jeff Reynolds is a science fiction and fantasy writer from the Maryland whose work has appeared in Escape Pod, Daily Science Fiction, Apparition Literary Magazine, and Andromeda Spaceways Magazine. He's attended Viable Paradise writers' workshop and Stonecoast writers' conference, and holds a Bachelor of Science degree in Simulation and Digital Entertainment from the University of Baltimore.\n Jeff works for Johns Hopkins University Applied Physics Lab, home of New Horizons, Parker Solar Probe, and the upcoming Dragonfly mission to Titan. He's only a software licensing analyst, though, and doesn't do any of the really cool stuff like building space probes and meeting Brian Mays."}