{"fingerprint": "zjDTnDOXeVNlku9TQ8/pdn3cMz0=", "sitename": "Clarkesworld Magazine", "title": "Trickster by Mari Ness", "author": "Mari Ness", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ness_06_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Trickster by Mari Ness", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7640 words, novelette\nTrickster\nThe god came to me on a night when both moons were dark, allowing us to see the stars. Not that I could, hidden as I was behind mats and screens and hangings, but I knew the stars were there, one of the rare nights we could be sure of this.\nHe should not have come. But he is a god, and they do not always do what is right, or wise. He shone—I have no other word for it—in the unlight, in the dim bits of candle and lamp and star that had made it through the cracks in my room. Shone, with his black skin and the hands that he had made, for some unaccountable reason of his own, red this evening. His face was a blank oval, truly blank, with no hint of eyes, mouth, or nose in that utter smoothness. And yet—I knew, without knowing how I knew—that behind that blankness his beauty was greater than I could imagine, that I could handle knowing. They hide themselves from us in kindness, they say, though we do not have many examples of their kindness.\nTrickster. My body tensed, though I knew it would be better not to, to appear—to actually be—as calm as if this were merely the visit of a friend.\nI had a blue candle by my bed, for moments like this, but I did not light it. Too undignified, I might have said; caught by his red hands, I might have added. Whatever the truth, it remained unlit.\nSilence stretched between us. His place to speak first, but he did not. Perhaps he thought I was sleeping—I have been told that the gods do not always understand the difference, that they slip in and out of our dreams as easily as they slip from the sky to here, that they themselves do not sleep, although they dream. I do not know. Even now, I am not so familiar with gods. But I suspected—no more than that—that he was silent not because he thought me asleep, but to discomfit me, to make me uneasy. More uneasy, that is; I was uneasy enough with his presence.\nTrickster.\nMore silence.\nI would never sleep with him in the room, and my bones still ached with fatigue, one reason I was inside, instead of searching the stars. “You should not be here,” I said.\nIn the darkness, in the blankness, I could have sworn he smiled, although I could not see his mouth. “You should not have spoken first.”\nUnthinking, I treated him as I might a more normal—a more mortal—visitor: “You wanted me to.”\n“Who knows what one like me wants and desires?”\nAnd this is a reason not to welcome the visits of gods, particularly this one: they can be oh, so irritating.\nI have heard three tales of the coming of the gods: that the universe, lonely, threw up beings of fire and water and wind and iron to bear her company in her eternity that would not be like us, mortal flies too brief to observe. That the gods were once mortal, as we, until they drank a lake of fire, and drained it to its cobalt depths, and filled with fire, began to stalk the world.\nAnd the third: that the gods are not gods at all, but mere tricksters all, with the trickster at their head, whose greatest trick is to seem the least and weakest of these, and trick us into believing these beings gods.\n“What do you wish?” I said, to prevent this conversation from moving in dizzying circles, towards words that could, I knew, warp my dreams, my mind, or worse, change my memories, my thoughts, causing me to rethink friend and foe. Sometimes, I had to admit, to our benefit—the gods had quite often interfered to stop mortal quarrels and wars for reasons of their own—and quite often, not; for every war they had stopped, they had begun something else—a war, a terror, a celebration—for their own amusement, not our own. They are not evil, you understand, the gods. Evil is a thing of mortals. Some might even be named beneficial, good, if even those tend to the . . . capricious. They are, instead, bored. Even those thinking of the happiness of mortals. Perhaps especially those thinking of the happiness of mortals.\nThis one had no such thought in mind.\n“I need you to kill one of us,” he said.\nHave I mentioned that I could have sworn he was smiling?\nWe have tales of the wars of the gods, tales where they have beaten or stabbed or poisoned or eaten one another, only to be miraculously restored in a moment, or less, or upon the next rising of the moon. Our earth bears scars of their passage: a boiling mountain here, a crater there, a lake of ice that will not melt in the center of a desert, and more. I have seen some of these places myself, although they are all old, very old. The gods mostly gave up warring amongst themselves—if not with mortals—long ago, when, the songs said, they realized that they could not die.\nMostly.\nSilence filled the room, so strongly that I had no choice but to speak the obvious.\n“How do you expect a mortal to kill any of you?”\n“By taking you to a place where we are a little less immortal.”\nAnother shock.\n“Is there is such a place?”\n“I am not certain,” he said, and I could not see his face, could not know if he was telling the truth. “But I know where it is, if it exists at all.”\n“Where?” I demanded.\nThis time, he let the light shift, let me see the smile on his face. “One of the moons,” he answered. “But you must not ask for all our secrets.”\nWe did not always have moons, say the stories and songs. Once, we had only earth, and the stars, and in the day, the sun.\nThen a green light, then a blue, moving slowly through the sky, dimming our stars.\nMoons.\nA gift from the gods, say some of the songs. A curse, whisper some of the stories.\nAt the festivals, the children sing of their coming, though they have never known a world without a moon.\n“The moons are not a place,” I said sharply. “They are only . . . ” I struggled for the right word, gave up in vain. “Lights.”\n“On the contrary,” he said. “They are places, places and reflections of light.”\nUseless to argue this point. “Why?” was all I could think of next.\n“Balance,” he said, in a lighthearted tone.\nThe gods have informed us that they number thirteen—precisely thirteen. It is an awkward number, one they consider unlucky, for reasons they do not tell us.\nBecause it is their unluck, not ours, many of us arrange our homes in elements of thirteen—thirteen windows, thirteen screens, thirteen plates, thirteen hangings, thirteen cups. I have known women to hope for 11 children to make a family of thirteen; couples who have joined with others, to have thirteen people in their household, thirteen to stand against the gods.\nIn the house of the Lady of the Waters, we, too, keep to thirteen women, thirteen students of her gifts, no more and no less, although we serve her, and would not—so we say—bring her bad luck. We do not know if she believes us. Her eyes, you understand, are not human, when we see her.\nThirteen. Out of balance, out of symmetry. They cannot pair up evenly, in thirteen, and so they do not, forming circles of twos and threes and fours and fives that come together for a time and then break up again. They cannot divide by gender, and so they do not, with some of the gods choosing to be women, and some men, and some both, and then switching, for no apparent reason. Even as others, including our Lady of the Waters, try to cling to the names we have given them, to the genders they have chosen.\nBut they cannot die, and they cannot birth another, and so they remain: Forever out of balance; forever out of symmetry. Forever doomed with bad luck.\nI have watched my child die in my arms.\nI do not think the gods understand bad luck.\nI sat in silence, contemplating. He spun three balls out of nowhere—or from his sleeves, I could not tell—and began juggling them.\n“Which god did you have in mind?” I asked, trying to sound as casual as if we were merely discussing the weather.\nAs sung in the house of the Lady of the Waters, these are the names mortals have given the gods: The Lady of the Waters, the Dreamweaver, She of the Clouds, the Corn God, the Smoke, He of Shining Feathers, the Lord of Rats, the Shadowcrafter, the Crippled One, the Lord of Chains, the Lord of Fury, the God of Silver, and the Trickster.\nWhat they may call themselves, we do not know. I have been told, and this may be true, that the gods at one time had no names: they were just what they were, and no more, until they encountered—or until they made—mortals. Yet we, as mortals, have a desperate need of names, and so, we when found the gods, we named them, often many times. My own Lady of the Waters is also the Woman Who Weeps, the Girl of Snow, the Ice Bird, the White Crone, the Grey Waters, the Bloody Girl of Red Skin and Hands. (She is not consistent, this lady, in her age; one of my teachers believed that she finds this shifting amusing.)\nSometimes, when we call their names, the night shifts, and even through the light of the moons, we can see the stars.\nI did ask, once. “Are you truly gods? Or is that a trick?”\n“That would be telling.”\nSo now you know as much as I.\n“Not the Lady of the Waters,” he said. “I know you serve her.”\nServe was perhaps not the correct word, although it worked as well as others. I learned from her, in turn for singing songs for her amusement, telling tales of her generosity and bountifulness to those that came to this temple, so that they in turn would be responsive, would sing something to amuse her and bring something to light the dull eternity of her days. And in turn, I learned of healing, of change, and sometimes—sometimes—she would grant me the power to bring ease, or healing, to a child.\nA bargain. A poor one, sometimes, except when a child smiled at the end of pain. I would do nothing to stop that.\nI did not bother to explain. “Then what god did you have in mind?”\n“The God of Silver.”\nThe gods still tried, now and again, the whispers said, tried to kill another, or tried to birth another. It was their number, thirteen, that kept them powerless against mortals—to a certain extent; that kept them dependent upon us—to a certain extent. (My own teachers questioned both the powerlessness and the dependency.) Should the gods ever number twelve, or fourteen—\nWell.\nBalance would be restored.\nNot something mortals should strive for.\nInteresting. I knew as little of this god as I knew of any other, but he was said—or she was said, this was one of the gods bored with the mortal concept of gender—to be one of the more benevolent of the gods, a god of peace, a god who had turned from the greed of gold and gems to be content with the beauty of the lesser silver.\nIt was only a tale.\nBut this was also a god that—if the tales were right—had spent less and less time with mortals, more and more time hidden in the sky, behind the clouds. I had heard some begin to refer to him as the Cloud God, although that was not quite correct: a goddess controlled the clouds and the rain, a sister and rival and friend and lover of my own Lady of the Waters, who had seized the rains of the air even as my Lady seized the waters and snow of the earth. We spoke to She of the Clouds as well, and had even seen her kiss my Lady, although we could never be certain if it was love or hate that bound them. And my Lady had other lovers, mortal and god. Still, my Lady had been able to speak to She of the Clouds and persuade her to break a mortal drought or two, to let waters fill the earth and raise the corn, before (this was said in much softer voices)—both She of the Clouds and the Lady of the Waters had dragged the Corn God into the mud and had their way with him, again and again.\nThe corn and crops had grown strong that year.\nThe God of Silver had only watched, but he had never had much of an interest in growing things.\nAnd so. This was all whispered, not known, but the God of Silver had had less interaction with the other gods, less interaction with mortals, even if those moments with mortals had all been benevolent . . .\n“Why?” I asked. I could not puzzle it out.\n“Because he stole my owl,” the Trickster said.\nI had not known the Trickster had an owl.\n“He also killed your son.”\nI am here because of that son.\nI am here because my son was dying, because my son died. The Lady of the Waters is one of the more . . . beneficent . . . of the gods, when she remembers to be: she knows tricks of healing, of removing pain. She had aided me in the last hours of my son’s death, removing his pain, at least, although she had told me, with what almost seemed compassion, that she could not have saved him, that even the gods can do nothing when it is too late. I did not know whether I could believe her. I did know that I would do anything I could to prevent another death of a child, and so I nodded in acceptance of her words, and immediately began to learn anything I could of her.\nShe had never told me that the gods had killed him.\nI took a sharp breath. I did not know whether I could believe him, or not, but he was already speaking of something else, as if the truth of my son’s death was nothing. And perhaps, to him, it was nothing, although at his words the dull pain I carried, as a constant, had flared into agony. He was speaking of boxes and balls and lights; I could only half listen.\n“I do not claim this will be simple,” he said.\nThat I could respond to. “No,” I said, allowing the irony to fill my voice. “You simply claim that I can go to a moon—a moon—and kill a god. I fail to see the complexity.”\n“I was thinking more that you would need some very special clothing.”\nI gestured at the wheeled chair beside my bed. “And this?”\n“I do not think that will be a problem on the moon.”\nI had never had a portrait done of my son. I had meant to, eventually—artists were expensive, but not entirely beyond my reach at the time—but I had always thought we would have time later. Later. I had always thought we would have a later.\nI have no gift for recalling faces, no gift for picturing people in my mind. I try, oh how I try, but I am never sure, now, if the face I see when I think of him is his.\nMy hands were white on my chair. “Agreed.”\nNone of the gods claim dominion over death.\nAnd death claims no dominion over them.\nHe explained more to me, explained, over my protests, that this would have to be done tonight, when both moons were dark, although he could not explain why. (Or, why, knowing that this must be done in the dark of the moons, he had not thought to prepare me for this earlier.) He gave instructions, some detailed, some not, and warnings, some detailed, most not.\n“Remember this,” he said, when I opened my mouth to protest again. “The God of Silver killed your child. As the others laughed, or wondered, or lost themselves in bright dreams.”\nEven if I could protest—even if I could be sure that he would not kill me if I refused—how could I refuse, after that?\nEven if I could not trust a single word he said.\nI would take the chair, he assured me again. It would be useful for more than traveling on a moon.\nAbout the chair: I had been careless. Nothing more, nothing less. After my son . . . well, no need to dwell on that. The Lady of the Waters had saved me, but not healed me. I did not know why, and did not think to ask. Did not dare to ask; I did not want her reasonings, or her unreasonings. I adjusted, and I have no more to say of that.\nI used a wheeled chair, in this house with its smoothed floors of stone and running streams and waterfalls. I lowered myself into hot and cold springs, and listened to the water, and wheeled myself where I would in this house, and sometimes elsewhere.\nTo this day, I cannot be certain where he actually sent me. It looked like a cave of blue and green and light, but it felt—different. I have no other words. But I had reason, later, to believe that in this, the Trickster was telling the truth, and I was on one of the moons. Or rather, inside one of the moons: I could not see the sky. (A disappointment, that; in the back of my mind I had rather wondered what my home would look like, from the sky.) I felt lighter. Untethered. Very untethered. I realized, in horror, that I was almost sliding up from my chair. I grabbed my handrests in panic, only then realizing that my hands had been enclosed in some sort of white gloves, and were light and clumsy at the same time. I sucked in a panicked breath—and nearly choked on it. This was not the air I was used to, but something else, with an odd half stink to it that I could barely recognize. I could feel my heart racing.\nSomething was on my head, something heavy and solid and light all at the same time. I drew up one hand—carefully clinging to the handrest of my chair with the other—and tapped at it gently. Something clear, like, and yet unlike, glass, I thought, although I could not tell, through the coverings of my hands. I could hear the echo of my own breath. My hands moved so oddly in this place. I looked down at my legs. I swallowed again. Perhaps I could—\nI pushed down with my hands, harder than I meant to, and let go of the chair, finding myself floating up. I could not help it; even in my terror, I grinned at this, even as I found myself floating down, lightly, as everything was here. I saw my feet touch the ground, spread out my arms in instinct—\n—and saw my legs collapse, even in the lightness. My arms and hands followed. I would need to return to my chair.\nI said that I had adjusted. Not that it had been easy.\nReturning to the chair was harder than it sounds. I’d never had problems pulling myself around with hands and arms before, but the blue and greenness of that cave, combined with whatever was wrapped around my head, badly distorted my vision, and my weight and body felt all wrong. I pulled, only to find myself lighter than expected, crashing into two rocks almost impossible to see in the colors. And sliding along the ground, with my body so light, was nearly impossible. But I managed it, hand over hand at last, climbing into the chair and twisting my body around. I took another deep breath.\nLook for the light, the Trickster had whispered, before I had blacked out and found myself here, but everything in this cave—cave? Moon? I could not decide—was light. I turned my head about, difficult though that was under the circumstances, and found a place where the blue light seemed to be a little brighter, and began to wheel myself there.\nEasy and difficult. No one had thought to smooth the floor for me—a common practice of mortals and immortals. And I was completely unused to the strange lightness of the place; a single push sent me rushing forward, almost bouncing into a rock. Maneuvering around that rock took its own care.\nBut I could not help grinning. I might be headed to kill a god, but gods, this lightness was fun.\nSo much fun that I didn’t hear the footsteps behind me, or notice the curtain of silver and blue until I rolled through it.\nMy years at the House of the Lady of the Waters had not been . . . evil, exactly. No. They had been good. In that House, I had found a measure of contentment, of peace, among my new-found sisters. I had begun healing as duty, but soon found it something more, even taken a certain joy in memorizing endless lists of herbs, in determining when we could apply to the Lady for mercy, and when we should not. The floors of the House were wide and flat, separated by curtains and screens easy to shift and move. My patients watched me with mingled hope and disbelief, and those who could not be saved listened to tales of my son, my mother, my grandfather. I had known pain, and so I could hold them.\nContentment. Peace. Even, at times, a certain joy, even when I wept.\nBut never fun.\nBehind the curtain, a room, of sorts. Words fail me when I try to explain this second place. To begin with, it was large—beyond large. Vaster than any room I had ever seen before in my life, or would, I suspect, ever see, so long I could not see the end of it. And high: I could have easily stacked the temple of the Lady of the Waters four times over, and still not reached its ceiling, and that temple was no short building. Like the caves I had passed through, it was filled with blue and green light, but somehow brighter, and I could see more lights—lamps, perhaps, although nothing like any lights I had seen before—scattered about the room. The pinpricks of light that dotted the ceiling, shining blue and green, might be more of those lamps; I could not tell. Whatever the Trickster placed upon my head also distorted my vision.\nBut not enough to keep me from from seeing the other oddness of the room: it was filled, even in its vastness, with things. Boxes made of some odd shimmering material, furniture, stacked up neatly for the most part, with a large table here and there holding more boxes, or, oddly, pictures—pictures that, when I looked at them, seemed to move. No, not seemed. They did move. Why would anyone put a picture like that upon a table, instead of placing it in a position of honor against a wall, with lights shining upon it?\nAlthough the walls here seemed very far away.\nAnd between the tables and boxes and pictures, other objects that looked so strange I could not even begin to guess their purpose. All, naturally, littering the floor, making navigation with my chair difficult to impossible, even without the strange feeling of lightness.\n“So that’s the trick,” I said, through gritted teeth.\nI should have seen it: it featured in a thousand tales of the gods: the quest that ended in the impossible task, solved only with the unexpected aid of those helped along the way. (A symbol, my mother told me, of the importance of small kindnesses, a quality not associated with many of the gods.)\nNot that I had quested, exactly, or taken a particularly long journey—it could not have been more than a few hours after my arrival here. But I had certainly been given the impossible task.\nI did not believe this was his last trick.\nThey claim the gods can love. We had seen it, sometimes, in the House of the Lady of the Waters; we had heard and sung the tales. I had wept, hearing of the lost love of the Dreamweaver and the Lord of Rats, now immortal enemies. (And thus, the song sang, the danger of dreaming of rats.)\nThey claim.\nNo one had claimed that the gods kept boxes and boxes and boxes hidden on a moon.\nIt might have been days later, or merely hours. All I knew was my bladder hurt, my hands hurt, my neck hurt. Whatever the Trickster had wrapped me in was distinctly uncomfortable.\nAnd I had found it—or rather, them.\nCompletely by mistake. I had thought, perhaps, that an odd tube-shaped implement might conceal what I was looking for—it was as good a place as any, and I was tired of boxes that would not open and empty boxes and boxes filled with some sort of metal strings. I had pushed my wheels, hard, in the hopes of bouncing over some smaller objects scattered along the floor, something that had worked all too well, sending my chair flying into a box and tipping it over. Tipping me over as well.\nBy the time I managed to right myself and the chair—a task made easier by the odd lightness of the place, and considerably harder by these wrappings I was in and the growing pain in my bladder, I was ready to curse every god past damnation and kill them by strangling them myself. No matter that the gods were supposedly immune to such things; I was angry enough to make it work. I was about to cry out to the Trickster to beg him to return, to see if I could someone trick him—\nAnd I saw them.\nAs the Trickster had described: small metallic balls, vibrating, almost humming, I thought. Thirteen of them. They looked so innocent. Simple. Nothing more than children’s toys.\nHow could these possibly harm a god?\nI had always thought, always believed, that the gods did not slay us because they were too busy with their own games against one another. But I could not deny that many mortals had died in these games.\nIf the gods were in balance . . .\nDid that mean they would be able to stop the beneficent acts of the Lady of the Waters? Of She of the Clouds?\nI did not know. Gods, if I only knew more of the gods!\nA trick, the Trickster had said. He would know, certainly, and yet . . .\nThe balls had tumbled to the floor and rolled about. I would have to pick them up, one by one, from the chair. While wrapped in something that made it nearly impossible to bend over from the chair to the floor. I could tumble to the floor, I thought, especially in this lightness, and roll around until I had gathered all the balls, and then drag myself up in the chair again. Or I could continue to search through the boxes and items on the table for something that would help me grab the balls from my chair . . .\n. . . I rolled myself off my chair and onto the floor.\nI hit it softly, gently—gods, this place could be such fun, if I were not in such pain—and began to roll and pull myself towards the balls. Careful. The last thing I wanted to do was push the balls away by accident . . .\n. . . my glove covered one of them.\nBells. Bells. Everywhere, bells—\nThe gods are not, as mortals, confined to a single shape, or name, or sound, or word, shifting at a thought from one thing to another.\nIt is one of many reasons we eye birds and rats so warily.\nI had, however, never heard that they took the shape of bells.\nA shower of simmering silver. No. A cloud. No. A column—pointless to describe this; I did not have the words. I did not think any mortal had the words. But I did not question what it was.\nThe God of Silver. And another, a figure shrouded in a cloak and hood, leaning upon an iron cane. The Chained One.\nThe Trickster had failed to mention that possibility.\nI hurriedly began to pull myself towards my chair—rolling over more of the balls as I did so. The sound of the bells grew overwhelming. If the gods spoke to me, I could not hear them. I could not even hear myself. I dragged myself up to my chair, but not before crashing it into more tables, more boxes, and turned the chair to face them.\nIt would have been easier if I could have seen their faces. I had thought the Trickster terrifying, but this was far worse.\n“You will return that,” said a voice, filled with silver. Outside, and yet, inside my head, all at once, echoing, the way the Lady of the Waters voice would sound on her visits. The way the Trickster’s voice had not.\nThe God of Silver killed your child. As the others laughed, or wondered, or lost themselves in bright dreams.\n“Wait,” said a second voice, filled with iron. “This has the touch of the Trickster upon it.”\n“And a pathetic touch, even for him. Look at her.”\nI was certainly looking at him.\n“I see a certain darkness.” If iron could be curious, this was. “Tell us. Why do you believe you are here, child?”\nI did not know if they would know a lie, or not, even if I could have thought of one. “My son.”\n“Ah.” No compassion in that iron. “So beautiful, that darkness.”\n“And so easily illuminated.” The contempt, the dismissal, sang through my mind. “So fortunate, for mortals, that their deaths can bring so much light.”\nI had grown to . . . live . . . with the loss of my son, if not accept it. It had been my fault, I knew; if I had only come to the Lady of the Waters sooner, if I had only learned healing sooner, paid more attention to what was important, rather than what was not—The old familiar pathways of guilt and longing filled my mind. Easier to feel guilt, in some ways, than to miss my child, to long for his crinkled smile, the way he was constantly but constantly underfoot, crowing, crying, laughing—\nI had never loved anything, or any other person, as much. I doubted the gods could understand that kind of love.\nThe words echoed in the room, in my voice. I swallowed, and fumbled in my lap for one of the balls.\nFor a brief moment, I allowed myself to think of the Lady of the Waters.\nI threw the ball at the silver light.\nThe silver shifted, and I could see the ball continue its flight, down to the end of this impossibly long room . . .\n“Damn,” I said.\nThe silver cloud—column—shower—whatever it was—grew larger, brighter. It was coming towards me. In desperation I grabbed the next thing I could—a box covered in red symbols on a nearby table—lifted it, and threw it. Too hard: I had not accounted for its seeming lack of weight, and it sped through the room faster than I could have imagined.\nSomeone—it might have been me, but I do not think so—shouted, “No!” and the bell sound changed, to a sound I have never heard before, a terrible whine and shriek and pulsing sound all at once, and the world exploded into fire and light and—\nIn their way, all the gods do tricks. Deliberately, to entertain the eternal sameness of their lives, and mistakenly, not knowing how mortals view their doings and broken promises.\nBut the Trickster made such doings his life. Even our mortal lives were filled with the tales of his ruses and deceits, the games he had played on mortals and his fellow gods. They had even banished him, from time to time (although some tales claimed this was only to restore the balance and their luck, and the Trickster was the easiest to remove), never to the gain of mortals.\nHe could, when he chose, be beneficial: win a game against him, and find a pot of gold in your home. Lose a game, and find yourself a bird, or granted a harp that would sing only insults. Win a game against him, and find your clothing gone. Lose a game, and find yourself the ruler of an empire.\nThe gods themselves could not trust him. Nor could I.\nLight, bursting into a thousand pieces and spinning and spinning and spinning and spinning and oh gods was I sick so sick and everything was dark and light and colored and dim and I was falling and falling and I would never hear again and ah the light and the darkness—\nIt was not he who killed your child.\nGreen, green rocks flying past me, spinning.\nBut it was also not he who failed to save him.\nI do not remember the rest of that fall.\nI have heard three tales of the coming of mortals:\nOne, that the gods, in their beginnings, saw endless fire and water and mist, and wanted something that would change, that would die and be reborn. And so they made plants, and later animals, and at length, craving speech, mortals. Mortals who in their quarrels and loves and above all, deaths, would always be different, even as they always remained the same, always repeating their lives again and again.\nTwo, that our gods did not create us at all. That, traveling from a place to another place, they encountered us, mortals, created by other gods, and decided to settle here, and watch.\nThree, that we were not created by any gods at all, but merely, like the gods, thrown up by the universe, in its ongoing chaos of fire and stars and water and heat. Pure random chance that they are gods, doomed to watch the universe live and die, and we are not, doomed to see only a portion of life and death.\nI do not know the truth of any of these tales.\nI awoke wrapped in blankets from my own bed, on the small balcony just outside my room. My other wrappings had been removed; I could feel the chair against my back, and the hard lumps there. At some point, I must have finally emptied my bladder—I tried not to think about that too much—but someone had dried and cleaned me. A glass of water had been left by my chair; I seized it, and drank deeply. I pressed my fingers—my unwrapped fingers, that could feel and move freely—against my arm rests. Real. Solid.\nAlive. I had somehow lived through that.\nMy chair had somehow lived through that.\nThe gods can work miracles, at need.\nI placed my face in my hands, for a moment. When I looked up, the night was full of shattered light.\nWhen I was injured, I had to learn to balance myself all over all again. The balance I had learned as a child was lost completely, and I needed to learn new things.\nI learned all that I knew from mortal teachers. The gods, I learned, know nothing of balance.\nA terrible description, shattered light, but I can think of no other word: streaks of burning green, crackling and dimming and reappearing again. Where they reached the ground, they set it on fire, so that the earth, too, was throwing up flames. I could hear—I thought I could hear—screams in the distance. I certainly heard cries behind me, in the house of Lady of the Waters.\nAnd I heard his footsteps behind me. He wanted me to hear; the gods can move silently if they wish. He wanted me to turn towards him.\nI do not know when we began to worship the gods, to bring them offerings of gems and food and clothing, to build high temples where they might sit and dispense judgment. Or miracles. I do not know if it was our idea, or theirs, if they needed the stimulation, or if we needed the reassurance, the hope of occasional aid.\nI only know when I stopped.\nI didn’t thank him for saving my life. For one thing I wasn’t sure he had. For another, I wasn’t grateful. I didn’t bother to tell him my story either; I was certain he already knew it.\n“You lying bastard,” I said instead. “You didn’t want me to kill a god at all. You wanted me to do that.”\nNo need to point, but I did anyway, at the falling green lights, the fires sparking against the earth.\n“Well, I wouldn’t have minded.”\n“Not that I could have done it anyway,” I said. I saw them again, standing against the flames and fires, vanishing before the fires could touch them. “Could I? Those balls—you placed them near something else, that box, hoping I would feel threatened and use that instead, and—”\nI choked on my own words.\n“It’s not a trick if you tell the process.”\n“And is that a trick?” I said, pointing at the sky again.\n“No,” said the Trickster quietly, and I knew—how I knew—he was telling the truth.\nI could not explain it, but I could feel it, the sudden lack of balance in the world. Not from any evidence or measurement, but present, none the less.\nAnd the change did not favor mortals. I could feel that as well.\nHow the loss of one moon—a moon that blocked our sight of the stars—could do that, I could not have explained, but I knew it, without needing to be told, as well as I knew that the screams behind me were no trick as well.\n“Get out,” I said. Reckless beyond thought, to order a god, but I was too angry, in too much pain, to spend much time thinking. “Get out, you miserable bastard.”\n“Only after I give you a gift.”\n“Get out.”\n“I owe you.”\n“You do,” I said through gritted teeth. “You used me, used my child, used me knowing that the other gods would never see a woman in a chair as a threat, would never stop me from picking up whatever that was, and you destroyed a moon and helped destroy my race. So get out.”\n“Oh, I don’t think I owe you for any of that,” said the Trickster. “That was just part of the trick. No. I owe you for the lie.”\n“The lie? You told thousands. Get. Out.”\nNo one could accuse the Trickster of following instructions. “I lied about the God of Silver. In part. He did steal my owl.”\nI wished that a mortal fist could harm his immortal skin.\n“But it was not he who killed your child. That was a toy of the Lord of Rats and the Crippled One. If you had killed the God of Silver, or the Chained One—well. You would have killed an innocent.”\nIf this was meant as comfort, it failed. Rage filled me all over again.\n“But—and this is important—that was the only lie. I left things unsaid, but only those words spoke untruths. Nonetheless. For those words, and for your assistance, a gift.”\nA burning touch of lips against my forehead.\n“I don’t want any of your damned gifts.”\nHe spread three cups upon the long table I kept against the wall, to store flowers and books and other things. Before, when those things had still mattered. “You will want this one,” he said, and explained.\nWhen my son was born, I sang all the songs to him: the sleeping songs, the baby songs, the songs of mortals and gods.\nI told him tales as he grew, eyes large in his tiny face, tales of warning and danger. Tales of the Trickster. Tales of rats. Tales of chains.\nThe Trickster vanished as he had come, unseen, unwanted. I stayed in my chair, watching the falling remnants of the moon, until, tired beyond all exhaustion, I fell asleep.\nWe have three tales of dreams: that they are ours, only ours, untouched by gods, and that dreams are the only place where we can roam free of the gods, even when they seem to walk in our dreams. Or that they are not ours at all, but creations of the Dreamweaver, who spins our dreams on dark wheels and laces them into our mind. Or that they are ghosts, unable to journey to the land of the dead, or be reborn, whether by a trick of gods or mortals or balance or luck, and so they crawl into our minds in sleep, for comfort or sorrow.\nThat night, I dreamt of my son, laughing on the moon, and behind him, silver rain and chains and laughing rats.\nI was woken by the scent of water.\n“They tell me you have destroyed one of the moons,” the Lady of the Waters said, her voice musical, flowing, overwhelming. Far stronger than the Trickster; far more there than either of the two that I had met—and not killed—upon the moon.\nI kept my head bowed, and did not answer. I had no need: even in the day sky, green streaks were still falling, and the Trickster was no place to be found.\n“You will not want my congratulations.”\nThat, at least, was true. I did not dare to look at her, to become lost in her beauty, her kindness . . .\n“And what are these?”\n“Gifts from him, my Lady,” I said, allowing the weariness to seep through my voice.\n“Ah,” she said, moving forward to look at the table, where the three cups rested, upside down.\nSo almost human, her curiosity. She allowed me to hear one footfall, then another; I could almost think her a woman like myself. Could almost forget.\n“And what were you to do with these gifts?”\nA sharpness in that waterfall.\n“Store a ball he took from the moon,” I said, wearily. “He said it was too dangerous for me to touch, but that I should live with it, in remembrance.”\nI thought—I thought—that her eyes looked more alert. Or greedier. I could not have told; even after all this, I was still helpless at deciphering the expressions of immortals. I could see the shimmer of her robes as they swayed. “Three cups. Three cups. In one of these, you say?”\n“Yes, Lady.”\n“Left by him.”\nHer back was to me. I decided I could lift my eyes, just a little.\nHer glowing hands—hands of water, hands of light—were moving above the three cups, shifting them about the table, tapping each lightly. I wondered if she could see through the cups, if the gods had been granted yet another gift we did not have, or if she could hear something, sense something, that I could not. Had the Trickster foreseen this?\nI did not dare take the risk. “The wrong one—the wrong ones—will kill. Will blast the other moon, and—Lady, I beg you.”\nShe must have heard something in my voice. “Trust me, my child. Trust me.”\nHer voice was a rush of water. I took a deep breath, and placed my fingers on the wheels of my chair, and pushed.\nMy chair is generally silent, but not now: I thought I could hear every clatter, every movement of the boards. I heard water. I heard cracks. I heard the ball in my hand sink into her lower back, pushed by my weight and the weight of my chair. I heard her soft cry, a sound like shattered glass, only more musical, more beautiful. I remembered the song she had sung, as she stood by his bedside and watched my son die.\nAnd against my hand, the Lady of the Waters turned into water, a great rush of gray and water that splashed and pushed against me. I had not expected that; had not braced my chair against the water, and found myself pulling the right wheel of my chair with one hand as with my left I continued to hold the stone against the water. Until a pool of water formed, beneath my chair, reflecting the colors of the room.\nOrdinary water. Even I, mere mortal, did not need the sudden stillness of the stone in my hand to tell that. Even I, mere mortal, could feel the shift in the air.\nThe rush of water had knocked down all three cups. Nothing had been under them.\nAs I have said, I have never loved anything so much.\nHe knew that much truth, the Trickster.\nI wheeled myself out to the balcony.\nThe stars glittered above me. I stared and stared. The other moon still floated someplace in the sky, I knew, the moon I had not visited, and doubtless never would. The moon that promised magic and dreams. The moon that, on its own, would still allow us to glimpse the stars.\nI bowed my head, made myself look as weak, as pitiable, as mortal as possible. They would be coming soon, I knew, to mourn their sister, their lover, their rival, to rejoice in their reborn balance. I gripped the stone in my hand, concealed beneath my robes. I would not allow this balance to remain for long.\nMari Ness lives in central Florida with two cats who think her fingers should spend less time on a keyboard and more time in their fur. Her fiction and poetry have previously appeared in numerous print and online publications, including Fantasy Magazine, Ideomancer, Daily Science Fiction, and Shine: An Anthology of Optimistic Science Fiction. On Thursdays, she blogs about classic works of children's fantasy literature over at Tor.com. You can also follow her on Twitter at mari_ness."}