{"fingerprint": "TQt+5hkqyTunFwiTQugTUDeXYDE=", "sitename": "Clarkesworld Magazine", "title": "Pirate Pharmaceuticals, Robots, and Kaiju: A Conversation with Annalee Newitz by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/newitz_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pirate Pharmaceuticals, Robots, and Kaiju: A Conversation with Annalee Newitz by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Pirate Pharmaceuticals, Robots, and Kaiju: A Conversation with Annalee Newitz\n Ownership is becoming a bit murkier. As tech advances and delivery systems become more convenient, we slide more and more into the rental economy with large companies retaining power and control. Instead of movie tickets and record shelves, we have monthly fees for Netflix and Spotify. Some companies have even patented genetic strains of farm crops that they license to farmers. A new book takes a deeper look into the future of pharmaceutical pirates, robots, and ownership.\n Autonomous is the debut novel from Annalee Newitz. It follows the exploits of Jack, an anti-patent drug pirate who reverse engineers pharmaceuticals so that they can be manufactured and released to those who need it but can’t pay the exorbitant price. Eliasz and Paladin, a highly sophisticated robot, are charged with bringing Jack to justice, but when they discover a new drug from a huge corporation that traps people in a productivity loop until insanity sets in, they join forces to figure out what’s really going on behind a corrupt pharmaceutical industry.\n Annalee Newitz is a co-founder and former editor-in-chief of iO9 and current Tech Culture Editor at Ars Technica. She’s written for numerous publications such as Popular Science, Wired, Salon.com, New Scientist, and more. Her previous non-fiction books include Scatter, Adapt, and Remember: How Humans Will Survive a Mass Extinction and Pretend We’re Dead: Capitalist Monsters in American Pop Culture. Her debut novel Autonomous is out from Tor Books September 19th.\n What sparked the original idea for Autonomous?\n It started with a single image, of a robot struggling to climb sand dunes and feeling an ache in his actuators. I had just spent the day at a terrifically interesting seismology lab that’s part of UC Berkeley, where researchers stage earthquakes in various ways to test how structures will withstand this kind of disaster. One of their newer tools was an enormous wall of actuators that attach to structures or material, and then exert pressure to emulate the forces of an earthquake. The actuators are controlled by computer, of course, and I kept thinking what it would be like to be a sentient robot whose entire body is just an actuator. And then I started thinking about what it would be like to have actuators instead of legs . . . and pretty soon I had the first glimpse of my robot character Paladin.\n Autonomous features a lot of tech that feels completely plausible. In your research, did you find anything you thought was science fiction but actually turned out to be real?\n I interviewed a lot of extremely kind and patient scientists about the tech and biology in the book. The thing I knew least about was neuroscience, and I called up a couple of neuroscientists and asked them what it’s like to look at receptors on neurons in the brain. I have this scene where the scientists are watching a drug change someone’s neurological structure, and I thought, “Oh yeah this is totally unrealistic.” But the researchers told me that you can actually see receptors growing in real time, which completely surprised me. One of them said, “Oh yeah, you can see them growing and opening up like flowers.” I knew that our brains are always growing and changing—that’s sort of the definition of neuroplasticity—but I hadn’t quite taken on board how fast it happens.\n I’ve read that you find inspiration in scientific papers. Was that the case with this novel?\n Absolutely. I read a lot of papers about addiction and neuroscience for this novel, so hopefully I got it sort of right. I mean, the problem is that we have a lot of hypotheses and we don’t fully understand all the ways addiction works. So, I picked one of the most plausible hypotheses and went with it.\n I also wanted to include heroic synthetic biologists because I feel like science fiction stories always cast genetic engineers as evil masterminds who are “playing god” or other nonsense. If you actually read papers by people who are working in this field, you’ll see that they are generally trying to save lives and make industrial processes more sustainable and nontoxic.\n Did the news story about Martin Shkreli influence your novel at all?\n No! I was actually finished with my novel when the Shkreli scandal hit. But he is absolutely the kind of fiendish pharma executive that my characters would be fighting against.\n In your research, did you happen to come across an instance of patent abuse or biopiracy that seemed completely out of control?\n I think our laws around patenting drugs are completely broken. Drug companies have figured out all kinds of sneaky ways to keep their drugs under patent, by filing what are called secondary patents on one aspect of a drug’s structure or on a technique for making it. Often, pharma companies spend far more money on marketing drugs than on researching the drugs, so it’s not true that they need 20 patents on one drug just to recoup the costs of developing it. If they just spent more money on development, and less on pimping their pills, they would still be making a tidy profit.\n I also worry a lot about companies that patent genetic materials. We’re already seeing strains of certain crops getting patented by companies like Monsanto. I’m certainly not the first science fiction writer to worry that these kinds of patents will lead to companies owning life forms, or certain parts of life forms.\n What was one piece of information you came across in your research that really surprised you?\n I wanted a plausible economic explanation for why people would enter indenture, so I talked to the economist Noah Smith. Like a lot of economists, he loves coming up with scenarios where people have financial incentives to do all kinds of terrible things. He pointed out that we have many rights that we never think about, like the right to work. What if people had to pay for a permit of some kind just to have the right to work and live somewhere? As soon as he said that, it made perfect sense to me—I had just never considered that being allowed to work somewhere was a right in itself. So, Noah helped make the capitalist system in my novel even bleaker than it already was. People who can’t pay for a franchise in a particular city don’t have the right to work there, and the only way they can survive is to sell themselves into indenture.\n You’ve published non-fiction books in the past. How is writing fiction different for you?\n The best part about writing fiction is that I can say whatever I want about my characters and none of them will get into trouble or be fired. That is always a worry I have as a reporter, especially when I write about people who are doing sensitive work. With fictional characters, I’m completely free to do whatever I want.\n Does your fiction and non-fiction work influence each other? How?\n Absolutely. I love to write really geeky science fiction that has its roots in plausibility. So, the topics I write about as a journalist inevitably work their way into the background (and sometimes the foreground) of my fiction, just because it’s fun to spin up a speculative world out of the real one.\n There are a lot of iconic robots in science fiction. Did any of them inspire Paladin?\n Paladin is basically a love letter to mecha in anime, especially Briareos in Appleseed. There are a lot of examples of robot romance in Appleseed, and I love how the anime makes us believe in the sexiness of a giant, bulky cyborg with multiple eyes and antennas on his head.\n Jack’s workshop is pretty compact for such complex and intensive work. Do you think bioengineering and high-level chemistry will become more of a garage-type hobby as technology advances and becomes more widely available?\n There are already a lot of bio hacker spaces, and I think biotech will undergo the same process of miniaturization that computers have. Jim Munroe has a great novel called Everyone in Silico, where kids have Easy-Bake Ovens to cook up new lifeforms. He’s being satirical there, but I do think that it’s realistic to imagine a future with pocket-sized devices for genetic engineering.\n The relationship between Eliasz and Paladin caught my attention. Do you think that over time that humans will begin to treat technology with the same respect as other living creatures rather than things to be disposed of and replaced?\n I think that people will treat human-equivalent robots exactly the way we treat each other. We will abuse them, enslave them, accuse them of being less-than-human, and force them to do jobs that we would never do ourselves. At the same time, we will forge bonds of love and friendship with them. We will welcome them into our lives and celebrate them as heroes. The whole process will be messy and terrible and—sometimes—hopeful. I think we will need to have several civil rights movements for robots before they are safe from human abuse and cruelty. Even after all that, there will be micro-aggressions against robots, which I deal with a bit in the novel.\n How do you balance conveying highly technical information with pacing of a story?\n Carefully! I hope I did a good job avoiding those info-dumpy moments. It helps that I love action and cool fight scenes, so whenever I found myself getting too technical or worldbuildy I would figure out a way to have somebody punch somebody else or blow something up.\n What is your favorite giant monster movie?\n This is seriously the hardest question ever because I love giant monsters. I’m a fan of Pacific Rim for the fights, and a fan of The Host and Cloverfield for creature design. But the monster I identify with the most is Ghidorah the three-headed space monster from the Toho kaiju universe. (I also love Mecha Ghidorah.) FYI he and I are on a first name basis, so I don’t have to call him “King” anymore. I have spent a lot of time wondering how those three heads get along, and whether they are networked or not. Also, lightning is a badass breath weapon, especially when it’s coming out of three mouths.\n What are you working on next?\n I’ve just started writing my next novel for Tor Books, which is about time travel. I’m also writing a nonfiction book about archaeology, focused on ancient lost cities. When I’m writing about archaeology, I constantly wish I had a time machine to go back and see what really happened. So maybe my time travel novel is a way to work through those feelings.\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}