{"fingerprint": "9fJ673GerFY+iTuJud3/noMZdEg=", "sitename": "Clarkesworld Magazine", "title": "The Color of Nature: A Conversation with Victo Ngai by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ngai_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Color of Nature: A Conversation with Victo Ngai by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n The Color of Nature: A Conversation with Victo Ngai\n Victo Ngai’s images have captivated the science fiction community since her striking 2011 cover for Tor.com publishing’s Time Considered as a Series of Thermite Burns in No Particular Order. It is a cover with soft pastels set against a dark, dangerous backdrop, with careful intimacy amidst the danger, and a spray of petals caught in the maelstrom. By then her work had already made appearances in the Spectrum series of art books as well as The New York Times and The New Yorker.\n Ngai appeared on several SF/F awards lists for 2017: Chesley, Locus, World Fantasy, Hugo, and a Best Artist BSFA win—but before this, she’d already received a pile of accolades, including the The New York Times 20 Notable Op-Ed Art for 2010, 2012, and 2013; two gold medals from the Society of Illustrators in 2012; being named as one of Forbes magazine’s 30 Under 30 in 2014; and more. For 2018 her SF/F accolades continued: Hugo Award finalist for Best Professional Artist, a Best Artwork BSFA win for her cover for Waiting on a Bright Moon, and a Gold Award winner in Spectrum 25. Her client base ranges from wine purveyors to film companies and her recent SF/F cover work includes the dark burnt orange to bright glowing yellow of Nisi Shawl’s Everfair; the slick, period sensibilities of Lara Elena Donnelly’s Amberlough; and the beautiful, graphic geometry of Neil Gaiman’s Norse Mythology.\n A lot of the basic questions are covered thoroughly on your website (victo-ngai.com). So the questions that I’m going to ask you are a little bit different. You covered a lot of territory!\n Thank you so much for doing your research. That doesn’t happen that often. I always have to answer, “Where did you go to school?” like a hundred times.\n Are there themes or motifs that you enjoy that appear in your work often, and what do you like most about them?\n Oh, interesting. I think I really enjoy pulling elements from nature, because, it’s just so great. I feel like if you look at the past artists, the really great ones, they also do the same. I recently went to Spain and I had a little bit more time this time, so I had an in-depth tour of Gaudí’s architecture. And then I went to the backroom exhibition—we really actually went through everything!\n It’s very apparent how he took inspiration from nature. Some are more obvious. But there are other things that are a little bit more subtle, but interesting. For example, some of the structures of the columns are actually not just, “This is how the plant looks,” but a movement of growth of a certain kind of helicoid plant in space and time. These are plants that have leaves that grow in levels, each new level rotates in order to get the maximum amount of sunlight. This twist and turn movement creates really fascinating forms. And I guess for me, I really resonate with that. I feel like there are all these amazing artists, or writers, but our creativity seems so finite compared to the creativity in nature. It just feels like it’s a boundless resource that can be drawn from; and it’s probably the most original inspiration for all these people.\n I saw in the body of work presented on your website that you have some key pieces that are very “modern.” For example, there’s the drawing of the car—do you feel like you’re able to bring that natural element into those pieces as well?\n I think so, in some ways. Even though my line art is quite precise, I feel like I really enjoy the fluidity and curves. I don’t really have anything that’s straight, right angle, or very vectorized. Even when I do architecture drawings, I like it still a little bit off, a little quirky. I just really like the warmth—and I feel like that’s also something that’s separate, maybe, that nature vs. man-made. To quote Gaudí “The straight line belongs to men, the curved one to God.” Personally, I am really drawn to the tactility and warmth of the organic feeling.\n Your work has a lot of different moods and expressions, but I feel like you gravitate toward reds, golds, and greens. What is it about these combinations of colors that speak to you?\n I feel like those are my comfort colors, kind of like your comfort food. I love traveling, I love all kinds of cuisines, but when I’m really tired, I always gravitate toward Chinese food because of my upbringing. And I feel like that’s the same with my palette. That is quite an Asian-esque palette, I would say, and probably the earliest one that I got familiarized with, and probably the one I had the most experience with. I always feel like color choices and how we approach our lines—all this simple stuff added together—is what contributes to an artist’s style. And a so-called style essentially is built on this baseline of who you are, which was influenced by your surroundings as a kid.\n I feel like that’s such an important bedrock that’s being laid down consciously and subconsciously, and I feel like a lot of those colors were just permeated in my visual world when I was young, so I’ve always been really drawn to that. And so the later palettes, which I picked up along the way, are still built on top of that bedrock. Maybe that’s why you see, even with the other developments, it would still sort of be in the same vein.\n That makes sense. When I think of Chinese art and those colors, I feel like a lot of times it’s very stark, very bright, and the way that you use them gives your pieces a warmth and softness.\n That’s a really interesting and good observation. I feel like it depends on what kind of Chinese art you’re looking at. If you’re looking at scroll paintings of landscape, they’re quiet monochromatic, very, very few colors, and beautifully designed mark makings. I feel like my line art is probably more influenced by that kind of artwork and gongbi hua. But color-wise, it’s mostly from folk art and crafts, from textiles for example, from interior design and architecture. Those things tend to have quite brilliant colors and really nice complementary colors. When you translate those elements into a two-dimensional art piece, there’s some transition that needs to be made.\n Chinese paintings tend to have starker contrast between figure-ground because of the medium of ink, it cannot be thinly glazed, layered, feathered, and rendered like oil painting. For the same reason, Middle Age paintings have harsher lines as egg tempera dries too quickly. I don’t work in traditional Chinese media, so that allow me to explore softer edge qualities.\n And of course I also have my influences in Western art. I went to school here at Rhode Island School of Design, so I also had that training of oil painting. I think that softness may be a little bit more rendering with seeing—because between the East and the West, we see space very differently in art. Like, there’s not really that vanishing point in Eastern art, it’s more like a traveling perspective.\n With a scroll painting, sometimes you feel like you’re seeing a mountain ridge, but sometimes it’s actually the mountain being depicted at different angles, the same mountain, as the poet or as some artist travels. So there’s less of that fascination with trying to convey a space as realistically as possible, as with Western art, especially after the Renaissance. But also, I’m kind of in between two worlds, so I see the merit and I really appreciate both sides of that. I kind of mix and match whatever I feel like will work for what I’m trying to convey in that particular piece.\n You do a lot of different pieces for a lot of different types of clients, but your art is appreciated by (and quite fitting for) the SF/F community. You also do commercial, such as American Express, shoe campaigns. Where does science fiction and fantasy fit into your creativity or your artistic body of work?\n Well, first of all, I think “genre” is pretty overrated. Not just scifi/fantasy within illustration, but also, why separate illustration with fine art? I feel like that development is very, very recent, and mostly for the market rather than the art itself. Most people would say Michelangelo is fine art, but if you look at the purpose of his art, it’s pretty much illustration for the Bible, but done on the mural. Now that’s three separate categories these days! I mean, what is illustration, essentially? It’s telling story with visuals. And I feel like a lot of us do that in different ways. Of course, certain art, like the modern art movement, such as abstract expressionism or minimalism, got rid of that storytelling aspect. But even so, pair a Jackson Pollock painting with some well-chosen words, meaning and stories can still emerge and be ran as an editorial illustration or ad campaign. So how do we really define what’s what, is it by its style, media or function?\n I just don’t really like to put myself in any pigeonhole, that, “Okay, I’m a scifi artist, I’m only an illustrator”—I feel like I have a pretty wide interest in a lot of things, and I really appreciate that, so far, I’ve been able to do a lot of that. And I would love to do even more down the road.\n But for what fantasy or scifi means to me personally, I’ve always really loved that genre as a reader. I feel like it is something similar to the reason why I love drawing. If you read my Q&A, you kind of know I grew up as an only child, so I started drawing as a way to escape this reality—to kill time, but also to entertain myself. Fantasy also does that, it provides a means of escape from the mundane, but in some other sense, it also kind of holds up a mirror that can be more poignant than just telling the story as it is.\n For example, with The Handmaid’s Tale—after the book there’s a writer’s note, and I find that to be the most interesting part of the book. It talks about how all the seemingly dystopian elements and fantasy elements in the book have all happened in history across different cultures, across different times. She simply collected all of these seemingly absurd, unbelievable things, put them all together in this sort of parallel universe. It’s a story, but then the story is very powerful because it has that tie to reality, it holds up that mirror to reality. We can very easily fall into that sort of dystopia.\n And same goes with The Lord of the Rings. I feel like there’s a strong message there about conservation of the earth. So, I think—I don’t know, I just love that style of writing, personally. To me, it’s much more effective emotionally than just reading an essay packed with data, telling me we’re doomed if we don’t cut carbon emissions. That kind of thing desensitizes people. I feel like to really be able to move people to change, you have to appeal to them on an emotional level, and I feel like scifi/fantasy is very great at doing that.\n Your story’s a little bit different perhaps than a lot of people’s stories, because you met someone early on who helped you break in. Besides talent, what does it take to make it as an illustrator?\n I agree I have been extremely lucky. I didn’t just meet one person, but I feel like I have been helped all the way by really great people. For example, Chris Buzelli—that’s probably the mentor you read about—in school; and then I started working with his wife, SooJin Buzelli, my first professional gig. But when I moved to New York, I also emailed Steven Heller. He used to be the art director of the Op-Ed section of The New York Times, but he had retired at that point, and I just wanted to see if he wanted to give me some pointers so that I could get a job at The New York Times. He actually liked my work enough that he just sent me the art director’s email, so that’s how I started working with them. And after working with them, the art director of The New York Times sent me to the art director of The New Yorker. Also, through the Society of Illustrators I met Irene Gallo, and that’s how I got into the scifi/fantasy world. I started doing covers for them and other publishers saw it.\n So I would say it just seems like a series of really fortunate events. But I will also have to say that ultimately the work really matters. It’s important to put yourself out there, but I think as a starting artist, the most important part of your day is to focus your energy on creating the best portfolio you can. And not to worry about, you know, the award, or the clients down five years. There are so many factors you cannot control, but what you can control is to make sure that every step you take is the best you can, because that’s going to lead to the next step. It’s very much a cumulative process. And I feel like also, just be nice. Be a kind person. I think the illustration industry in general is a very kind industry compared to a lot of other ones. Almost every successful artist I talk to, they had some kind of mentor or similar story as mine, someone that helped them out. And that kind of opportunity is also up to you.\n Of course, I had my teacher, right, so that is very fortunate; I was able to go to a really good art school and able to afford that tuition, which maybe not everyone can do. But after that, how do you take control of your own life? If I didn’t email Steven Heller, or if I didn’t go to try and meet people in the Society, a lot of the other opportunities might not have happened. In the end, I feel like no matter what situation you are in, it’s up to you to make however much you can make out of it. Definitely, I am super, super lucky. But for people who might not be able to go to art school—just know there are artists who didn’t go to art school, and they can still make things happen. Just don’t let circumstances make you feel defeated.\n You also teach. Is that part of why you teach, to sort of . . . be nice; and to help other people out?\n Well, I used to teach at the School of Visual Arts in New York, but after I moved here I don’t really, I stopped teaching. But now I just did an online class with Skillshare, which talked about color, because that’s something I struggle with a lot. So yeah, I do try to find ways to give back to the community. Like the Q&A page—I would love to be able to answer all of the emails from students, but that’s just not really possible. It took so long to reschedule this interview! That’s why I took the time to just write out a really comprehensive list, pretty much all the questions that I always get, they’re answered in the list, and I can refer them to that list as a resource. I also now have social media in China, because the illustration market is quite new there. It’s still kind of like the Wild, Wild West.\n A lot of things that are very obvious here are big unknowns there. I write blogs from time to time, just to talk a little about the industry, talk about my experience as an illustrator. And even simple things, like which competition to enter—I talk about Spectrum; or share other artists’ work. They can at least feel like there’s something they can find—at least even know the key word, right? If they want to do some research on their own and get into the industry. Because when I was in Hong Kong I didn’t know anything, so I feel like I would have appreciated that.\n You’ve been nominated for and won a number of SF/F awards and you’ve been to a number of conventions. What has your experience with the SF/F community been like, and do you feel like it’s been helpful at all for you career-wise?\n Well, I feel like SF/F artists are the humblest artists I’ve seen, probably. I haven’t met anyone with a huge ego, even though they all have crazy skill. I mean, just coming from the art show when I was putting mine up, I’m seeing all of these original oil paintings, I’m like—it just kind of blew my mind. But everyone just seemed so humble, and everyone is not afraid to be a fan. I think that’s something I really love, the fan culture in SF/F. In other parts of art—for example, advertisement—sometimes you feel like you kind of need to posture a little bit, so that people will take you seriously. If you act too much like a fan or are too humble about yourself, maybe that will depreciate your work. But I don’t feel that [in the SF/F community]. I feel like everyone is pretty true to themselves. I mean, most of them got into this genre because they are fans to begin with, so I think that’s probably why.\n What are some of your favorite pieces or projects you’ve done, whether or not in genre, or perhaps pieces or projects that you’re most proud of?\n That’s tough. I mean, they’re all my babies. I would say one of the most challenging projects I’ve done recently is the Kama Sutra project. And I’m pretty proud of how they came out. It’s really challenging because I always feel like I’m not very good at drawing figures. I’m much more interested in the environment. If you look at my artwork, the environment sometimes has more character and personality, and there are a lot of figures that just kind of turn away, or are kind of small. But the Kama Sutra project, I actually initiated it with the publisher. We worked on another project before, so we have a good relationship, and they asked me if there was anything I wanted to do. I just said, “The Kama Sutra, because I know it’s going to force me to draw bodies.”\n So you took it on because you wanted to challenge yourself?\n Yeah. And I know it’s going to be extra difficult because, of course, the subject matter is juicy, but then it’s also classic literature. So how do you walk the fine line between erotica and pornography? I knew from the get-go that it was going to be a very interesting challenge. Also I just really love the Mongol miniature paintings. I saw a show at the Metropolitan Museum in person, it just kind of blew my mind, so I always wanted to sort of steal that for some project, and this one just seemed so perfect. It’s a great chance to challenge myself with figures, but also play into my love of patterns and colors and rich texture. I’m happy with how it came out.\n Going back to definitions and illustrators vs. gallery and fine arts, because you talk about that on your site, and because you get asked a lot about those definitions: do you paint or draw for yourself, just because you want to? Or do you have designs or thoughts about doing a gallery presentation? Or is that just not a direction that interests you?\n It definitely interests me, but if I do that, I want it to be all self-generated work. And I just haven’t had the bandwidth to do that. As far as just doing work purely for myself, I haven’t done that for a while, because I don’t really feel like I need that creative outlet. I really enjoy my commercial projects. Especially now that I’ve worked with clients that really trust me. On a lot of the projects I’m even able to dictate content. So, not just as an artist, but I’m able to kind of collaborate. Those projects actually feel like my own projects.\n It’s like they’re giving you a prompt?\n Sometimes not even. For example, I recently did this series with Apple, because they have those editorial pieces on their app store, like the Today tab, and they’re like, “Okay, we want to feature you for a week. What do you want to do?” I mean, it is a commercial project, but I get to come up with the whole thing. During that time, I was in Ireland, giving a talk at a design conference, and I went on a road trip around the whole island. And again, I was just really inspired by the beauty of the landscape. I wanted to do this sort of visual documentary of the trip, but also something that would tie back to software/devices, because you know, it’s Apple. So it’s like Procreate, iPad you can just take on the go, you can sketch, you can sort of document what you see. There are photos that I took with my film camera, there’s art demo. There’s also a playlist that I curated. It was really fun. And there’s also my own writing; and I also went to the filming place for Game of Thrones—a little bit of fangirling as well. It’s very personal. Speaking of Game of Thrones, I worked with HBO on the last season #forthethrones campaign. That project had a stronger prompt but, I mean, I love that show, so it feels like a personal piece.\n Do you feel like the demands or aesthetics of SF art are changing, or do you feel like they’ve changed since you started doing SF/F art?\n I feel like it’s definitely getting more diverse, but I feel like that had started when I started, and I feel like Tor should take a lot of credit for that, Irene should take a lot of credit. Because I know she started hiring editorial, traditional editorial illustrators, for scifi/fantasy, and I mean, I look at their covers, and especially their online art, it’s just so diverse and it’s very interesting. And I feel like it’s definitely more mainstream, it’s getting more mainstream because of all these popular shows.\n What does “more mainstream” mean in terms of art aesthetics?\n Now you see, for example, advertisements or editorial, they’re more interested in using something that’s more whimsical and more fantastical; I feel like they’re definitely more open to that. Probably a huge thing to do with shows like Game of Thrones.\n How does your process change if you’re working on a magazine cover as opposed to a book cover, as opposed to an advert or something else?\n With magazine covers and book covers, they are quite similar, it’s just that I get more time with book covers. And a book cover—I guess with the type of design, that will be a little bit different, because with a magazine you have the headline—you know, that’s always standard. So when you work on a sketch you already know what that’s going to be like when you compose the image, but with a book cover, it’s kind of more of an organic back and forth process working with the art director. It’s usually during the sketch stage, we’re trying to figure out where will be the best place to place the type, and then the art director will do a mock-up type, and I will rearrange elements. It’s more of a close collaboration, I would say, with the book covers.\n Do you find that to be like a Tor thing, or do you find that to be the same with other publishers as well?\n I think with all the publishers. Advertisement’s really different. Because advertisement—first of all, each campaign can be so different. Some will involve animation, so the file has to be super layered. Others might involve actual merchandise, or window display or billboard, so it’s just—when it comes to size, what are the requirements—really different.\n Do you feel like, over the past ten years or so, your skill level has changed or your style has changed?\n I would like to think I am a better artist now, at least technically. I’m able to tackle a much wider range of projects. I think my style has also evolved. If you compare a work from now to 2010, it’s definitely more skilled. And I would say the body of work in 2010 is more one-dimensional. I was actually worried that I would be a one-trick pony when I found my own style. Because for a while, I was making work that was strongly reminiscent of Asian art, and a sort of flattened perspective, where you can see the horizon line in almost all pieces; mostly with kids and animals, because I’m not comfortable drawing adult bodies—that’s a huge part. And flat color, with the palette that you mentioned. I feel like if someone would see all my art together in a chronological way, it would become sort of obvious that I diversified slowly over time.\n Where do you hope to take your art next? What do you hope to do with your art?\n That’s a good question. I mean, I kind of want to see if I can get back to the analog world, actually. I’m interested to see how that shift of medium might open up new things, and how that might help me develop my style and grow as an artist. And I’m definitely interested in the gallery world down the road. So yeah, that’s something I would love to explore.\n I mean, there’s all these things I want to do. I also want to make my own children’s book.\n That’s on your website.\n Yeah. I’m just waiting for a story that I really love. Because I’m working on two children’s books right now, and it’s very intense, it’s so much work, that I feel like you have to really commit to a story. Especially if it’s something I do for myself—if I don’t love it enough, I can always quit, and that’s a problem; you know, when you’re working for someone else you can’t quit, you have to stick it through.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}