{"fingerprint": "K9IMYq4aXo3IxLCLzFigSm7SXlU=", "sitename": "Clarkesworld Magazine", "title": "Finding Endor: The Quest for Habitable Exomoons by Julie Nováková", "author": "Julie Nováková", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/novakova_04_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Finding Endor: The Quest for Habitable Exomoons by Julie Nováková", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nFinding Endor: The Quest for Habitable Exomoons\nEndor. Pandora. Acheron. What do these science-fictional places have in common?\nThey’re moons. More precisely, habitable moons.\nIn our own solar system, multiple moons—such as Jupiter’s Europa or Saturn’s Enceladus—host vast oceans of liquid water underneath their icy shells. But we have no moon whose surface would be habitable for life as we know it (Saturn’s large moon Titan, though, has surface lakes of light hydrocarbons, potentially allowing for more exotic life). Is it even possible for a moon to have a thick enough atmosphere and surface liquid water? And do we have any chance of discovering such moons in other star systems?\nLuckily, the answer to both questions appears to be yes.\nNot Too Close, Not Too Far . . .\nHow large must a planet or moon be to keep a thick atmosphere? Not very; Titan is slightly smaller than the planet Mercury and has a thicker atmosphere than Earth. But it’s also terribly cold; water behaves like a rock on Titan’s surface. If we want surface liquid water, we need to go closer to the central star—to regions where the stellar wind is stronger and atmospheres more vulnerable to its whims. Near the outer edge of the “habitable zone,” Mars, being lighter than Earth and lacking a protective magnetic field, has lost most of its atmosphere over the ages, so much that it can’t support liquid water anymore. If Mars is too small, is there any chance for moons covered in oceans and jungles?\nWe can realistically expect Mars-sized moons around giant planets; Earth-sized, not so much. But size isn’t everything. The moon could have its own magnetic field protecting the atmosphere against stellar wind like an invisible lid. Can moons have magnetic fields?\nJupiter’s largest moon Ganymede does.\nAnd moons can have something extra: their planet’s magnetic field. Magnetospheres of Jupiter and Saturn are powerful and far-reaching. This protection is, besides the cold and distance from the Sun, among the reasons why Titan has clung to its substantial atmosphere. Now imagine a large moon with its own magnetic field and protected by its host planet’s magnetosphere.\nIt has a catch, though, or rather a compromise: in order to be enshrouded within the planet’s magnetosphere, the moons needs to be close enough. But it can’t be too close, lest it become too heated by tides and no longer habitable. It appears that only Jupiter-like or more massive planets could have magnetospheres vast enough to protect moons at a convenient distance to keep them habitable.\nBut, tidal effects can be a convenient energy supply for a moon. Being tugged at by the gravity of their planet and potentially other moons would heat their interior, triggering tectonic activity needed for effective biochemical cycles. However, too much tidal heating would result in overbearing volcanism and loss of volatile elements, such as had happened on Jupiter’s very volcanically active moon Io, or the runaway greenhouse effect (creating a “tidal Venus”). We’re treading a fine line here.\nBeing a moon comes with more potentially adverse effects. Remember the protective effect of the planet’s magnetosphere? That’s one thing that can happen; another is the moon coursing through the planet’s radiation belts that bathe the surface of the moon in harmful particle radiation (such as in the case of Io or Europa).\nAn earlier model took all those factors into account and described the possible orbits of habitable exomoons. What does it mean? That if we detect a moon, we should be able to say with a shred of confidence whether it could be habitable. The good news is, habitable moons definitely seem realistic.\nAlthough finding such a moon would be most exciting, we shouldn’t frown upon airless moons such as ours—they can be extremely interesting too . . .\nThe Moon and Habitability\nWe’re speaking about long-term habitable moons here, but it’s worth mentioning that theoretically, our own Moon may have been able to hold onto a volcanically outgassed atmosphere and host surface liquid water for perhaps seventy million years. Even if it had been so, it seems very unlikely that life managed to develop there. If there had already been any on Earth, it may have well gotten there via material thrown into space by an asteroid or comet collision and survived for some time until the inevitable end of the short-lived “habitable” period. Although Moon fauna remains safely within the realm of science fiction, the Moon is very important for astrobiologists. They may be able to spot more Martian or other meteorites that had collided with the Moon in the past and have a look at their chemistry and structure, potentially revealing traces of life or life-friendly conditions.\nEven though we’d be happiest discovering an atmosphere and water-bearing exomoon, a lifeless large moon may still play a key role in habitability—that of its planet. The Moon helps stabilize Earth’s rotational axis, stabilizing its climate; acts as a “shield” against a part of comets or asteroids on a collision course that crash onto it instead of on Earth; and its gravitational tug creates the ebb and flow of Earth’s oceans, which may have helped create early conditions for the emergence of life. And in other systems, moons might even help their planets retain an atmosphere, if both the planet and the moon possess their own magnetic fields.\nDo all rocky planets need a large moon in order to be habitable for life as advanced as ours? The most honest answer would be: we don’t know. The most steadfast proponents of the Rare Earth theory would suggest so; models differ; we lack data. We don’t even know with much certainty how common such large moons are. The Moon’s mass is roughly 1.2 percent Earth’s mass; a lot, even if it may not sound like it. In our own system, only some dwarf planets and smaller bodies have comparably relatively massive moons (for instance Pluto’s moon Charon is a whopping twelve percent of Pluto’s mass).\nHow frequent are such relatively large moons of rocky exoplanets? We don’t have any statistics yet—that will come only with the actual discoveries. But a collision “just right” for creating a large moon seems to be a rare occasion. It may be even rarer if we take into account the properties of the planet. A recent model suggests that huge impacts on much larger-than-Earth terrestrial planets would result in vaporizing all the debris, making it very hard or impossible for moonlets to form, maintain a stable orbit, and grow. Are the more massive “super-Earths” indeed void of large moons? Only observations will tell.\nSince super-Earths might be more numerous than Earthlike planets (although it could just be observational bias, with more massive and larger planets being more easily discovered), it’s quite important for assessing the number of potentially habitable moons in the galaxy. But the existence of moons doesn’t just depend on the planet—we must also look at the star, or rather the planet’s orbit around it.\nThe majority of stars are small dim red dwarfs whose habitable zone is very close to the star—so close, in fact, that planets residing there might not be able to retain a moon. Due to the close presence of the star, the moon’s orbit would likely be disrupted in less than a billion years in most cases. The environment very close to an active, flaring star (such as red dwarfs tend to be) also wouldn’t bode well for retaining an atmosphere on a moon.\nWe also can’t be sure yet about the stability of moons in multiple stellar systems. Ours is a single-star system—but most stars come in binaries or other multiples. Orbital simulations have shown that circumbinary planets (orbiting two stars) likely can hold onto their moons, unless the moons’ orbits are highly inclined. For circumstellar planets in binary systems (orbiting one star of a pair), the space for stable orbits of moons seems to be more reduced—and with it our chances of finding them, since more close-in moons would produce weaker detection signals with most methods.\nSpeaking of detection: how do we spot an exomoon?\nExomoons in the Making\nMost exoplanets have been observed by the transit photometry method: if they pass across the disc of their star from our point of view, we see it as a temporary and regular dip in that star’s light. The light curve can tell a more complicated story, though. It could show us debris from planet collisions, cometary clouds, rings, alien megastructures (none yet)—or moons. Basically, we’d see regular smaller dips near the planet-caused “main event,” and their timing and intensity would depend on the size and orbit of the moon.\nIn some cases, we could even see a transiting exomoon when the planet itself doesn’t transit from our point of view, but its so-called Hill sphere—basically the space where it can retain satellites—does. That’s likely the case of Beta Pictoris b, a massive young planet just over sixty lightyears away, whose Hill sphere may have transited in front of the bright star Beta Pictoris in 2017 and 2018. Astronomers tried to spot moons or rings, but none were found then. The next transit event will happen in the late 2030s; there’s still time to prepare to spot some moons!\nWe can also detect variations in the timing of planetary transits. These would have been caused by the gravitational influence of another massive object—such as another planet in the system or a moon. There are more detection methods than these, but transits and their timing variations are the most realistic for larger-scale surveys with current technology (interestingly, if we wanted to observe exomoon transits in front of a planet, seeking them around rogue planets might be a good idea).\nSo far, most exomoon candidates have been detected with those two methods. There have been claims of over twenty extrasolar moons, but the evidence is not convincing yet. The most recent candidate has been announced in January 2022. The candidate moon orbits the giant planet Kepler-1708 b around a Sun-like star—in the habitable zone, no less. But the moon, if it really exists, is unlikely to be conventionally habitable. It appears to be similar to Neptune in size. The case for the moon seems strong—but it’s not certain yet. More observations will tell.\nWhat does the future hold, overall, for exomoon enthusiasts? We can probably look forward to more evidence of moon-forming regions around exoplanets, such as that which the ALMA array spotted around the young exoplanet PDS 70 b; with enough data, we might be able to make more educated guesses about the likelihood of large moons around planets of different masses, orbits, or stellar systems.\nMore fully formed exomoon candidates can also be expected from analyses of the Kepler mission data and from the ongoing TESS mission. We can realistically expect some confirmed exomoons in this decade.\nAnd once we have them, we could find out whether they have an atmosphere—and try to characterize its composition, since that appears possible for moons as well. So, are we going to find a moon with carbon dioxide, water vapor, even molecular oxygen anytime soon—somewhere like Star Wars’ Endor?\nThat I don’t dare guess—but I’ll certainly keep hoping.\nJulie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council."}