{"fingerprint": "rwZ6zlMHe17u8UOsHUXdE8xrUa4=", "sitename": "Clarkesworld Magazine", "title": "Under Pressure: Life's Last Dance? by Julie Nováková", "author": "Julie Nováková", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/novakova_09_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Under Pressure: Life's Last Dance? by Julie Nováková", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Under Pressure: Life's Last Dance?\n In the stifling depths where nothing had been thought to live, life thrives. In the deepest regions of Earth’s oceans or embedded far within its crust, both macroscopic and microbial life flourish despite the pressure that would instantly crush a human. Do you think the Mariana Trench is deep with great pressure at its bottom? It’s nothing next to the pressures found at the bottom of oceans within icy moons such as Ganymede, and presumably countless exoplanets and exomoons. All life that we know requires water—so if these worlds contain it, could they host life? And could life be found under more exotic environments still, with water that behaves in ways completely alien to us? Let’s get in a metaphorical bathyscaphe and try to find out . . .\n The year was 1960. Jacques Piccard and Don Walsh got into the Trieste with a single goal in mind: to dive to the bottom of the deepest place on Earth, the Mariana Trench. Its lowest point, Challenger Deep, is almost 11 km underneath sea surface. The Trieste had survived trips to the bottom of the Mediterranean Sea and to several less-deep regions of the Mariana Trench, but never to such great depths. No one had ever ventured there before. The pressure was nearly 1,000 bars—thousandfold of Earth’s atmospheric pressure at sea level, said to be the equivalent of fifty jumbo jets piled atop of you. Most surface life would be instantly reduced to a mush. Few expected life, much less evident animal life, to flourish there. And yet—according to Piccard’s account of the Challenger Deep dive, Trieste’s light shone upon what had looked like a flatfish.\n The bathyscaphe Trieste. Only a handful of such submersibles, crewed or robotic, able to withstand such extreme pressure have been built thus far. Image credit: U.S. Navy Electronics Laboratory\n While this sighting must have been an optical illusion—Trieste stirred a lot of silt at the bottom—or at least a mis-categorization (since in dozens of crewed and robotic deep dives since then, no fish were found below approx. 8.5 km), it sparked great interest in life in the deep. Later exploration revealed not just an abundance of microbial life, but also very many macroscopic single-celled amoebas, deep-sea crustaceans, sea cucumbers, worms, and a plethora of other life capable of withstanding the extreme pressure. It’s not just the ocean, either. Over 3 km under Earth’s surface, where the pressure nears 1,000 bars, in tiny cracks in rock imbued with droplets of water, little roundworms live their unhurried lives in permanent darkness, eating microbes that survive on chemistry fueled by radioactive decay. It’s not just them—over 1 km beneath Earth’s surface, buried in its crust, flatworms, rotifers, fungi, and other organisms thrive.\n These discoveries prompted us to look further. Our solar system offers a multitude of environments containing liquid water, indispensable for life as we know it. There are most likely lakes under the Martian south polar cap (perhaps the north cap too—future observation should reveal that); perhaps more brine than water, but exciting nevertheless. Jupiter’s moons Europa, Callisto, and Ganymede contain huge oceans of liquid water beneath their thick icy shells, same as Saturn’s Titan, Enceladus, and most likely Dione. Other moons, even further out, orbiting the ice giants Uranus and Neptune, may possess them too, as well as some dwarf planets such as Pluto or Eris. Even if they resemble Earth’s oceans in chemical composition, like the Enceladan ocean does according to Cassini’s analyses of the little moon’s geysers, they would be very alien to us.\n It’s not just the absence of sunlight and reliance on other sources of energy to keep the water liquid and potentially fuel life. With the notable exception of Enceladus, which is rather tiny, the pressure at the base of these oceans would be at least comparable to the Mariana Trench (slightly lower for Dione, slightly higher for Europa), or outright extreme for the larger moons Callisto, Ganymede, and Titan. While Europa is comparable in size to our Moon, and its ocean is expected to be roughly 100 km deep, Ganymede, the largest moon in the solar system, is larger than the planet Mercury, and so is Titan. We can only indirectly guess the depth of their subsurface oceans from gravity, tidal deformation, magnetic field, and other measurements, but Ganymede’s liquid subsurface ocean likely begins roughly 150 km beneath the moon’s surface and ends about 100 km lower, where the pressure turns water into a solid. If it’s very salty, it might not be quite as deep, but still several times deeper than Earth’s oceans. At its bottom, the pressure must reach about ten times that of Challenger Deep. Could anything survive it?\n Deep-sea microbes thrive under more than 1,000 bars. Studies using diamond anvil cells, where we can generate high pressure, demonstrated survival of bacteria Escherichia coli (commonly found in our gut, not adapted for high pressure)and Shewanella oneidensis (found in deep sea and soil) under more than 1 gigapascal—10,000 bars, likely comparable to the depths of Ganymede’s ocean. The original study’s claim of metabolic activity at such pressure was disputed, but later works demonstrated that the cells can indeed survive such pressure (and that pressure-tolerant lineages can be selected), likely even reproduce under it.\n Even if Earth life couldn’t handle gigapascal pressures, it wouldn’t mean much for the potential for life on the icy moons—it could thrive near the outer icy shell, where pressure would be low, or have evolved ways to cope with the great pressure absent in Earth organisms. But the Shewanella and Escherichia experiments have proven that it is definitely possible to survive. It seems to improve the odds for life not just on icy moons, but also water-rich exoplanets, whether with open oceans or covered with ice. “Super-Ganymedes” may be a common class of exoplanets. We can take an educated guess about their composition by measuring their size and mass, giving us the density. The icy Ganymede has a density of less than 2 grams per cubic centimeter, while the density of the similarly sized rocky Mercury is nearly 5.5 grams per cubic centimeter. Several candidates for large ocean worlds exist, such as Gliese 1214 b with its probably Ganymede-like density.\n One thing may hinder the chances for life (even on worlds more temperate than the very hot Gliese 1214 b), though. Imagine a thick layer blocking direct access of water to the rocky seafloor. No hydrothermal vents right there in the ocean, no minerals seeping directly into the water . . . Such a layer exists on large water-rich worlds, such as Ganymede and Titan, and would also exist on many exoplanets and exomoons of a similar makeup.\n It’s high-pressure ice. You may never have heard about it, because here on Earth, it only exists in laboratory settings. But if you squeeze water a lot, it goes from liquid to solid—not the ice we know that floats on water because of its lower density. High-pressure ice is composed of water molecules pressed close together, has a different structure, and much larger density than the “normal” hexagonal ice we’re familiar with. It stays on the bottom, and that’s where the catch for life may be. If high-pressure ice forms between rock and deep ocean, could that ocean still have geochemical cycles to support life and, in case of an open ocean and an atmosphere, stabilize planetary climate?\n Phase diagram of water. We’re used to seeing water in the form of steam, liquid, or ice I under Earth conditions. But increase the pressure and you encounter various types of high-pressure ices. Ice VI is most expected on Ganymede, perhaps other types as well. However, the diagram shows a simplified scenario, not taking into account salts and other compounds dissolved in water or different solvents mixed with it. Image credit: Cmglee (Wikimedia Commons)\n High-pressure ices may be common throughout the universe. An Earthlike planet could only support an ocean roughly 200 km deep, regardless of the temperature, until high-pressure ice formed. A more massive “super-Earth” would form it at much lower depths.\n Earlier, most scientists seemed rather skeptical of such worlds’ prospects for life, but the tide begins to turn with newer models suggesting that high-pressure ices need not be rigid and prohibitive for geochemical cycling. We can’t observe the behavior of various kinds of high-pressure ices that form under differing pressures and temperatures directly on this scale, but we can run experiments with tiny diamond anvil cells and computer models. At the interface of rock and ice, meltwater can form (especially in places warmed by the moon’s internal heat sources) and leech compounds from the rock, which can then be transported to the ocean by the somewhat permeable and slowly churning ice. How the ice behaves and how efficiently it transports elements needed by life depends mostly on the temperature and various salts’ content.\n Will we ever know for sure how high-pressure ices behave on large scales and whether life could exist in such an environment? More indirect evidence should be supplied by ESA’s JUICE (JUpiter ICy moons Explorer) mission, which is going to make flybys of Europa, Callisto, and Ganymede before entering Ganymede’s orbit. Unless delayed, it’s going to be launched in 2022 and arrive to Jupiter’s system in late 2029.\n Ganymede’s likely inner structure. However, we can’t be completely sure about its accuracy at the moment. With what we know about the moon’s density, gravity, magnetic field, and other properties, other interior structures might be possible, including a multilayered ocean with layers of differing salinity and temperature separated by more layers of ice. Image credit: Kelvinsong (Wikimedia Commons)\n Yet there are more alien environments still, even if we restrict ourselves to water as a necessary prerequisite for life. There may be “sweet spots” of pressure and temperature ranges where life could exist under conditions hardly imaginable on Earth—crushing pressure, but relatively tolerable temperature, in an exotically behaving solvent—say a pressurized mixture of ionized water, ammonia, and other compounds. Science-fictional takes on such life would include for instance Geoffrey Landis’ “Into The Blue Abyss,” where the protagonist embarks on a life-searching mission into Uranus.\n An ionic water-ammonia ocean likely starts at a pressure around tens of kilobars—which even Earth-based life can survive, judging by the Escherichia and Shewanella experiments. Temperature would be far more prohibitive, but not necessarily near the very top of the ocean. However, such an ocean’s chemistry would be completely alien to ours—not just because of its ionization and its likely high ammonia content, but also its possible enrichment in dissolved magnesium and hailstorms of diamonds near the bottom. In addition, would it be stable enough, or convecting too wildly for life to persist anywhere? What would the geochemical cycles be down there? Is the boundary between the water-rich mantle and rocky core discernable at all, or fuzzy? Do some minerals leech up through the superionic ice that likely lies atop the core?\n Superionic ice is an exotic form of water that was first created on Earth in a diamond anvil cell in 2019, confirming earlier computer models. Hydrogen ions, protons, are able to conduct electricity in this type of ice. It may or may not exist (depending on how the water behaves mixed together with other compounds) deep within Uranus and Neptune and generate a part of their complex magnetic fields, but the ice giants have only ever been visited by the Voyager 2 brief flybys and have long been due for another mission, this time an orbiter like Galileo or Cassini. We can only hope . . .\n So far, we still know too little about large icy moons and even less about ice giant planets. Once we learn more about the composition and dynamics of their interiors, we’ll have a much better idea about the chances for life on the Ganymede-like, “super-Ganymede” and “mini-Neptune” worlds that are likely very common throughout the universe.\n Imagine, for a moment, what if most life in the cosmos is confined to oceans hidden deep beneath ice or even deeper under a thick, pressurized atmospheric veil? Could we ever possibly detect it? Could it leave enough traces in the ice or atmosphere to give us a hint?\n We have no definitive answers yet, and all the more reason to explore.\n Such environments might remain habitable even extremely far from their stars, on rogue planets or their moons, or long after the host star is gone. They may, indeed, be life’s final outposts in the far, far future—its last dance in the less and less friendly universe.\n Julie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council."}