{"fingerprint": "FlYvyPxjoEZqlvMpaBLim2Fqb9E=", "sitename": "Clarkesworld Magazine", "title": "Small Markets, Big Wonders by Julie Nováková", "author": "Julie Nováková", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/novakova_04_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Small Markets, Big Wonders by Julie Nováková", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Small Markets, Big Wonders\n How many copies make a bestseller? What does an author need to do in order to have a novel accepted by a publishing house? How does a SF magazine work? We often contemplate these questions but perhaps rarely realize how vastly the answers can differ between national markets.\n Last summer, I met Neil Clarke at Worldcon in London and we spoke about speculative fiction (SF, or fantastika) on the Anglo-American and Czech markets, finding sometimes unexpected differences, and the idea to zoom in on the workings of Czech SF sprang up.\n But before you read further, beware: This is a zombie story.\n From reading market statistics and talking with people in publishing, one can easily come to the notion that current Czech SF market is a high castle built of cards, splendid but fragile and constantly on the verge of collapse. But in spite of all financial crises, VAT changes and an alleged decrease in reading habits, it refuses to collapse, for which most of us are eternally grateful. Is it really as fragile as it looks? How does it differ from the English-speaking market and can either offer any useful insights to the other?\n Czech SF has a rich history, from Jakub Arbes or Svatopluk Čech to J. M. Troska, Karel Čapek or Josef Nesvadba and to many modern authors. However, publishing was severely affected by political changes in the twentieth century. Nazi occupation during WWII and the subsequent decades of communist regime resulted in sixty years of very little freedom in this aspect as well as many others. After 1989, the market grew rapidly. Books and authors previously banned by the regime experienced a big boom and numbers of copies in tens of thousands were no exception. Yet on such a small market—Czechoslovakia (before division into the Czech Republic and Slovakia in 1993) had about fifteen million inhabitants—this could not go on for long. After early 1990s, the numbers went down and stabilized rather in the thousands. Today, works of fiction are usually being published in fifteen hundred to two thousand copies, though the number varies largely depending on the author, genre, and publishing house. How many sold copies make a bestseller? There is no official statement; some say three thousand already, but most publishers agree on ten thousand. In SF, many put the line at five thousand copies.\n There are typically seventeen thousand published titles in a year (about ninety percent of them are new titles, about ten percent reprints). A little under seven thousand of them are fiction, and almost seven hundred constitutes speculative fiction1, from which slightly more than fifty percent is fantasy, almost thirty percent science fiction and less than twenty percent horror (not broken into more specific categories like YA, genre romance etc.).\n Most of them are translations; the number of novels, anthologies or story collections by Czech SF authors fluctuates around one hundred per year. The increasing trend of translated fiction is more apparent in SF than in the whole market: Overall, translations account for more than a third of all books published in the Czech Republic. More than half of the translations are from English titles, but German and French are also numerous with other languages falling behind behind these three. For comparison: The ratio of translated fiction on the US market is about one percent.\n In the number of book titles published per year per one million people, the Czech Republic with fifteen hundred and eighty titles scored fifth in Europe, after Denmark, the United Kingdom, Slovenia and Spain.2 That doesn’t sound bad, does it? But does it reflect how much people read? According to the NOP World Culture Score Index, Czech people spend on average seven and a half hours a week reading, which made for the sixth position, the first being taken by India with more than ten and a half hours of reading per week. These results paint a nice picture of the Czech Republic from the view of publishing. But there is no official data for the speculative fiction market. Can something tell us more?\n Luckily, yes. To find more answers, we should go to the magazines.\n We have two professional speculative fiction magazines in the Czech Republic: XB-1 (formerly Ikarie) and Pevnost. Both are quite lively zombies.\n Let me explain: Ikarie had been the first professional Czech SF magazine, founded in 1990. It was canceled in December 2010 by the publisher due to a decline in advertising revenue (surprisingly, a SF magazine drew fewer advertisers than lifestyle magazines). But the staff did not give up, found an independent publisher and without pause continued the magazine under the name XB-1 (from the classic Czech SF film Ikarie XB-1), as the former publisher still held rights for Ikarie.\n Similarly, Pevnost closed down in January 2013 but it was revived two months later thanks to a risk-loving and SF-loving investor.\n Then again in June 2013, XB-1 announced closure due to financial problems but later in the same month, another such investor stepped in and saved the magazine.\n Pevnost and XB-1 were resurrected by fans that believed the magazines brought something good and irreplaceable to readers and could ultimately prosper given wiser financial decisions and PR. To this day, they are both stable and popular.\n Their sale numbers could tell us more about the number of SF readers; unfortunately, neither of the magazines discloses them. The estimate is somewhere between five and eight thousand sold copies each month, with Pevnost (more multimedia, film, fantasy and YA-focused) likely selling more than XB-1 (focused primarily on fiction, translated as well as Czech). The vast majority of the sales are print versions. How is it comparable to situation on other markets?\n We can try to make a comparison to Anglo-American magazines. Gardner Dozois’s summation of 2013 in his 31st Year’s Best SF anthology indicates that Asimov’s sells around twenty-three thousand copies, as well as Analog. F&SF was around eleven thousand. But the American market is unique in the number of electronic and online magazines very successfully competing with their print cousins.\n Interzone, the most famous British SF magazine with a long-standing tradition, was estimated to sell around two thousand copies. Yet the United Kingdom has a population of about sixty-four million people—six times more than the Czech Republic. However, the sales are hardly comparable because there is no language barrier between the UK and USA. We should look at countries with national languages other than English. There are a lot of European magazines, but they’re mostly nonpaying ezines. Unfortunately, I haven’t been able to locate the sales numbers for regular print magazines, which are not many. For those which have social network accounts, I could only look at their online communities, typically much less active and smaller than for the Czech magazines.3\n And as far as I know, XB-1 and Polish Nowa Fantastyka are the only European paying print magazines that regularly publish translations of foreign stories. One of the most famous European magazines, Russian Esli, which had been doing so as well, ceased publication three years ago.\n In these circumstances, I cannot be but grateful for XB-1 and Pevnost.\n We’ve got zombie magazines—and they’re magazines to be proud of.\n Nevertheless—there are really only two magazines. Recently, the Slovakian irregularly published e-magazine Jupiter joined them as another paying venue for short SF in Czech and Slovak. But imagine you were Ray Bradbury and you wrote one good short story a week. If all of them should be published and paid, you’d need to fill all these magazines yourself and also contribute to most anthologies on the market—impossible. If you were that productive short fiction writer, you’d either need to publish short story collections or offer your stories online—but in the latter case, you couldn’t expect to make profit.\n When I wrote about Anglo-American online genre magazines for the website of XB-1, some people asked in the comments why we haven’t got a professional online magazine in the Czech Republic. Surely it would be a good thing!\n It certainly would. Unfortunately, it’s verging on the impossible. Even with a similar percentage of paying readers that Clarkesworld has, an online magazine in such a small market would be extremely lucky just to break even. It’s a risk no one is willing to take now, though that may change in the future if the readers’ behavior shifts significantly towards supporting their favorite projects even if they can access their contents for free.\n However, while pro-paying online periodicals could hardly exist in today’s Czech market, that doesn’t apply to ebooks or electronic magazines. Ebooks currently account for less than two percent of revenue on the market but their impact is growing larger every year—and I’ve already mentioned the magazine Jupiter. What’s more, those two percent apply to the book market as a whole. In science fiction publishing, the number is approaching twenty percent. Ebooks are certainly proving a viable strategy for publishers and many who refused to do them just a few years ago are now happily publishing them and would strive much harder without them.\n But let’s go back to the authors. The process from having a story/novel accepted and published is not much different from anywhere else; it’s the part before that differs.\n For a start, forget an agent. We’re talking about a tiny market where only a handful of authors can make a living from writing—if they don’t have a very expensive lifestyle. Agents are just unheard of. It’s up to authors to submit their work to publishers. Unfortunately, most don’t quite know how to do it. Publishers receive countless e-mails from authors who send them partial work; sagas printed out in Comic Sans, and novels totally outside their publishing scope.\n A reasonable author figures on her own that the manuscript should be complete, with simple, readable formatting and ideally a synopsis, with a concise cover letter. But there are ways to help authors and publishers at the same time—especially by utilizing submission guidelines. Most Czech publishers don’t have these. Any information about submitting manuscripts and whether the publisher is willing to look at unsolicited work is missing from the vast majority of publishing houses’ sites. That results not just in a flood of crazy queries and submissions but also in uncertainty on the author’s side. The lack makes it more complicated for both sides—but for some mysterious reason, nothing changes.\n Why, you ask? The answer is again “small market;” a market where beginning authors are expected to make their appearance in contests first and have a couple of stories published in anthologies of the winning pieces before they submit to the magazines or write a novel. Once you follow the contest results and read the anthologies and magazines, you start noticing some names and if their fiction appeals to you, you either solicit new stories from them or read their submission if they send you something. Apart from contests, anthology entries are typically solicited too. Or, sometimes, the guidelines travel by word of mouth.\n In such a small and tight community as the Czech fandom undoubtedly is, it works, but this status quo may make it hard for new writers to establish themselves unless they participate in short story contests. On the other hand, the contests don’t charge any submission fees, with one recent exception. But they also don’t pay the published authors, unlike the magazines. Breaking onto the market with paid pieces is difficult almost regardless of how good you already are—which is a significant difference from the Anglo-American market, where nothing prevents you from submitting to the best magazines right away and the result is just up to the quality of your work and a bit of luck. All of that makes clear submission guidelines and tracking submissions very new—and pleasant!—for Czech authors once they venture abroad.\n So what can we gather about the Czech market from all this? The number of published speculative fiction books, the magazines and their sales, compared to the number of Czech speakers, seem almost unreal. It suggests the Czech SF fan base is strong and active, but the peripeties faced by the magazines and some publishers also show that the current situation, however remarkable, really is fragile. We’ve mostly had happy endings so far, but can we count on it?\n The rise of ebooks and rapidly growing popularity of audiobooks are a sign that the traditional market is changing, though it’s coming later and more slowly than on the Anglo-American market. On the other hand, we can’t expect the changes to copy that development due to the small size of our market, which renders some of the changes next to impossible.\n Czech SF works feature ambitious sagas as well as adventure-based book series, space opera as well as high fantasy, hard SF, military, detective SF and countless other subgenres. Maybe only weird and slipstream fiction don’t seem to be doing very well on the home turf. The market is small yet flourishing, at least more than would be expected, but it’s rather isolated; the flow of translations—especially from English—goes in but very few Czech SF works go out. A handful of short stories had been translated into English, others, including novels, into Polish. Thanks to Jaroslav Olša, Jr., the former Czech ambassador in South Korea (currently in the Republic of The Philippines), some pieces were also translated into Korean. Classics like Karel Čapek’s R.U.R. were published in many languages, however, modern works rarely have any translations. With uncertainty about publishing the translation and the cost of it, the risk is too high.\n I don’t dare predict if and how this trend changes but I know of several authors considering writing in English or trying to get their works translated. Another question is whether the shift to writing in English is just a good thing or it takes something away as well. Vilma Kadlečková, a well-known Czech SF author whose story “Longing for Blood” had been translated and published in F&SF in 1997, says that despite her experience as a translator from English into Czech, she wouldn’t write in English because her language is richer and more nuanced when writing in her mother tongue. That’s certainly true for a majority of authors. Is writing in a foreign tongue more restrictive on one’s style and imagination?\n I’d say there’s no definitive answer. In my view, it depends on the individual authors, their particular word power and the stories they write. Let us see when we have a large enough sample to compare . . .\n The future seems more uncertain than ever—but also promising and full of adventure. If publishing taught me anything so far, it’s that it is largely unpredictable. Let’s take a ride into the future and see. And while we’re at it, let’s try to wisely use the steering wheel as well.\n Useful links:\n \n Europa SF site (in English)\n XB-1’s website (in Czech)\n Pevnost’s website (in Czech)\n Academy of Science Fiction, Fantasy & Horror, annual summaries (in Czech)\n \n Footnotes:\n 1 For a rough comparison: According to Locus magazine, the number of English-language books of interest in the SF field published in 2013 was a little over 2600 (via Gardner Dozois in his Year’s Best SF: Thirty-First Annual Collection).\n Julie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council."}