{"fingerprint": "Ma6D+aN6fsHXxZ05bzbCpE5uV9o=", "sitename": "Clarkesworld Magazine", "title": "An Optimist and Pessimist Tackle the Fermi Paradox by Julie Nováková and Tomas Petrasek", "author": "Julie Nováková; Tomas Petrasek", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/novakova-petrasek_10_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Optimist and Pessimist Tackle the Fermi Paradox by Julie Nováková and Tomas Petrasek", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n An Optimist and Pessimist Tackle the Fermi Paradox\n The universe around us echoes with the Great Silence. It seems oppressive to some, foreboding to others. We have not picked up any alien transmissions; seen any indications of interstellar travel or construction; met any other civilization. Yet even with propulsion systems based on known technological principles, it should be possible to colonize the whole Galaxy within hundreds of thousands to several million years. Enter the famous Fermi Paradox: Where are they?\n We’ve all seen the proposed hypotheses of the “zoo,” “Galactic federation,” or the bleak possibility of an inevitable nuclear apocalypse awaiting any technological culture. But is the Fermi Paradox really such a big paradox? Let us first consider our chances for picking up an alien civilization’s transmission.\n Enter the Optimist. “We’ve been transmitting radio waves in all directions for barely more than a hundred years, even less if we consider strong enough transmissions. We’ve actively listened for half a century. I think it’s too short to say that there is no one to listen to.”\n “Lovely. But I don’t think you’re right,” another voice intervenes.\n Who might you be?\n “Just call me the Pessimist.”\n The Optimist, unperturbed, continues: “As I said, the fact that we haven’t picked up any alien signals doesn’t mean there are no other civilizations.”\n When we consider the likelihood of receiving an alien transmission, we usually think of the famous Drake Equation and the number of civilizations in our Galaxy. But most of its parameters are very poorly constrained, and people can end up with estimates of zero civilizations (“10-18,” the Pessimist nods gravely), or a plentitude of them (“Ten thousand at least,” the Optimist announces).\n Perhaps trying to assess only the number of broadcasters within our Galaxy with so many “known unknowns” is not the best approach. What about the detection probability itself? Physicist Claudio Grimaldi has recently published a Scientific Reports article using the signal coverage approach to yield some estimates.\n If we focus on the number of technological civilizations only, we tend to forget that the existence of a broadcasting civilization doesn’t necessarily mean we’d be able to pick up its signals. The age and longevity of the signal, the position within Galaxy relative to us, effects of the interstellar medium on the signal’s degradation, or (non)directionality of the transmission all influence our chances of detecting it. For example: A unique non-directional signal sent a hundred thousand years ago is beyond detection; it would be only detectable outside of the Galaxy at this time (but likely degraded too much to be detectable in any case). A one-off signal sent from a star fifty lightyears away at the dawn of our 20th century would have missed the start of our listening endeavors by a margin of a few years.\n What’s important is the volume of our Galaxy filled with hypothetical transmissions at a time. Grimaldi concludes that even if we assume high detection probabilities for a given signal and multiple emitters, the mean number of detectable emitters within our Galaxy falls below one. If the model approximates reality well enough, it seems the Great Silence is only to be expected and doesn’t necessarily mean anything dreadful.\n Moreover: Would we know an artificial signal if we detected it? True, information-bearing signals are very different from noise and our statistical techniques can distinguish them, but it’s not perfect, and even if we are pretty sure something contains meaningful information, it doesn’t mean we’ll be able to tell whether it’s language—and what meaning it contains. Consider the case of the Indus civilization. It left us ruins of quite complex cities such as Harappa, dating back to approx. 2600 BCE, and many symbols that are still subject to debate as to whether they constitute a language. Measures such as conditional entropy and n-gram Markov chains suggested they possess a syntax, but not all involved scientists agreed with their general validity, though the majority leans toward it.\n “See? Receiving alien signals seems improbable, and even if we are at the right place at the right time, there is no certainty we’ll recognize them. No wonder we don’t know of any. No eschatologist thinking needed,” the Optimist says.\n The Pessimist frowns. “First, recognition as something likely artificial is not as complicated as language detection or even decryption. Second, it doesn’t really solve the Fermi Paradox. We need just one technological civilization capable of expanding to other star systems to colonize the Galaxy. They should be here—and for all we know, they are not. That means they either don’t exist, or tend to end badly. Doesn’t it scare you?”\n “No. It’s not foreboding at all,” the Optimist objects. “Maybe we’re just using the wrong assumptions.”\n True enough; can we even expect a complete Galaxy colonization? One would argue that interstellar expansion would be an adventurous business, with unfathomable dangers and uncertainties facing any ship trying to boldly go where no one has gone before, or even a nascent colony. Colonization waves might be slowed down or even stopped by essentially accidental, yet unavoidable factors both external and internal.\n But what if interstellar travel is so difficult that it’s near impossible, for ships bearing organic beings at least? It’s also possible that favorability of local conditions plays a larger role than we expect. It’s not just the “trivial” factors such as stellar type, presence of potentially habitable planets. What if, for example, different elemental and isotopic compositions of various planetary systems severely limit the colonization options, and to some extent exploration/self-replication probes too?\n If we look at the Earth, we don’t see human settlements everywhere. We have huge cities overflowing with people on one hand, and vast empty spaces—especially deserts and mountains—on the other, and we’re still speaking just about the landmass. Maybe we just happen to sit in the middle of a galactic desert?\n Perhaps ecological models can help us out. One of the simplest models of a species’ expansion is the percolation model (widely used also in material science and other fields), using a three-dimensional network of sites that are either connected or disconnected with a certain probability. NASA scientist and well-known SF writer Geoffrey Landis applied the model to an interstellar civilization’s proliferation.\n Due to time lags, we could expect that colonies will develop cultures different from their mother culture (and will also have different resources at their disposal). Some may therefore continue exploration, while other ones develop a non-colonizing civilization. If the probability of continuing colonization falls below the critical probability, the growth will stop after a finite number of colonized star systems. If the probability exceeds the critical threshold, there would still exist voids at any given time. It rests on the assumption that there is a maximum distance which allows new colonies to be directly established (in other words, that we could for example directly colonize Proxima Centauri but not the more distant Epsilon Eridani—for that, we would need another site in-between), which seems reasonable, though the actual distance itself would be difficult to constrain. Another assumption is that an already colonized world is not suitable for a new wave of colonization.\n It could account for the lack of known interstellar civilizations around us; however, it doesn’t solve the problem of the apparent lack of self-reproducing probes. If von Neumann probes are realistic (which is an assumption in itself), how come we haven’t seen any? Is it because they are mostly instructed to stay away from civilizations? Programmed to only use a very small amount of matter in each system to continue proliferation? Or are we here because we’re lucky and they haven’t converted our system yet?\n A nice solution to this aspect of the Fermi Paradox is outlined in David Brin’s Existence. The monumental novel tackles various problems related to it—How unique are we? What happens when any single person achieves the capacity of destroying an entire civilization at a whim? Could seedling ships succeed? Will AIs join us, replace us, merge with us?—but revolves especially around the finding of several alien artifacts, ambassador probes that establish communication with humanity and invite it to join their respective collectives.\n To avoid spoilers, let us just say that it may not be a bad idea to look at more biological systems, be they complex ecosystems, epidemiological models, or semelparous plants, when considering the Fermi Paradox—or even things like spambots or chain mail—and to distinguish the survival of civilizations and individuals. Though perhaps counterintuitive, the latter may persist for much longer times.\n “So,” the Optimist continues, “it seems that if we look at the Fermi Paradox in a more complex way, it’s not that surprising that they are not here. And we still haven’t mentioned things like colliding domains models, or a singularity where civilizations expand outside the macroscopically observable realm.”\n “That’s all very nice,” says the Pessimist, “but you’re completely overlooking other possibilities that may be more likely. Let’s first look at the popular ones.”\n Oh yes, the destroyer theories. They’re just as popular as the optimistic (one would be tempted to say naïve) hypotheses of the “zoo” or “federation.”\n Despite the vast interstellar distances, civilizations may routinely destroy each other in struggle for resources, territory, or just out of fear of the others striking first, and only those fearful enough to stay hidden remain out there. Do we live in such “dark forest,” like many science fiction stories seem to suggest (recently e.g. Liu Cixin’s aptly titled second volume of his Remembrance of Earth’s Past trilogy, or earlier works by Alastair Reynolds, Greg Bear and many others)? Community ecology has a term called “landscapes of fear” that applies to predator-prey interaction. Could similar dynamics be applied to galactic civilizations’ interactions? So far, we have no way of knowing.\n “But I fear one possibility that is less impressive, but far more likely in my opinion,” the Pessimist continues, “and that is self-destruction.”\n Where does the threshold for the missing galaxy-colonizing civilizations lie? Is there a “Gaia bottleneck” of establishing biogeochemical feedback cycles, leading to the relative scarcity of planets habitable for complex life? Is intelligence so rare? Is advanced technology? Or do advanced civilizations commonly destroy themselves? A pessimist might fear that we’re destroying our environment and ushering forward a new civilization collapse, propelled by drinking water shortage and fertile ground scarcity, local environmental disasters, extinctions leading to severe ecosystem shifts.\n “And while we’re doing that, we’re myopic to it and instead of really trying to mitigate it, we’re investing into wasting our resources even more,” the Pessimist concludes gloomily. “Making a tourist flyby of the Moon? Trying to colonize Mars? It’s wishful thinking. Mars is not a spare Earth. You’ll send astronauts there to die from cancer caused by the radiation, or because of some technical failure, and they would still be dependent on Earth. It’s wasting, not gaining resources!”\n The Optimist remembers one friend’s remark: “Perhaps manned spaceflight is an illogical decision. It’s expensive, and we can simply gain useful data by robotic probes . . . But perhaps the sparse civilizations which made that decision now cruise the galaxy exploring the ruins of the ones which made the reasonable decision.”\n What’s the ideal time for expanding beyond Earth? When does it quickly enough cease to be a deep resource sink and become beneficial in the overall sum? What should such risk assessments look like? There are a number of things that could wipe out our civilization or make it collapse. A large enough asteroid impact or volcanic event, a nearby enough supernova explosion, even a rare solar flare strong enough to fry most of our electronics, even though life itself would remain practically unaffected.\n These are all extremely rare events—but they are as unpredictable as it gets. We might get on without any for many millions of years, or something like that could occur next week. How prepared should we be? Would more near-Earth asteroid surveys and testing mitigation techniques suffice? Should we found space colonies as soon as we can, even though they wouldn’t be self-sufficient for decades, if not centuries? Many people would argue that we should invest first and foremost in eliminating poverty, promoting health care and education, and protecting our environment. But this may be a false problem—it’s not either/or. Resources taken off human spaceflight don’t magically appear in solving health, environmental, or social issues. While the Optimist calls for spaceflight support, the Pessimist argues that our attention should focus elsewhere.\n The Fermi Paradox may be more relevant for our own future ventures than most people realize—but it’s a pity we know so little about it. Our speculations are countless—but we need more testable predictions and the data to test them. Current and near-future ground and space-based surveys such as K2, Gaia, HARPS, NGTS, TESS, CHEOPS, PLATO and many more will vastly improve our data on exoplanets and their host stars. Telescopes such as JWST may greatly contribute to our knowledge of the planets’ characteristics and potential chances for life. Solar system missions like ExoMars, Mars 2020, or JUICE may tell us more about the (un)availability of conditions for life within our own system, and the uniqueness of Earth.\n As to the pressing questions of the likelihood of emergence of intelligence, number of technological civilizations, galactic deserts or habitable zones, expansion speeds, difficulty of interstellar travel, and safety of actively transmitting—we’ll need much more for that. And concerning the tendency of civilizations to survive, communicate, colonize, and make wise decisions about the future, we ourselves are the only example we have so far, and it seems like a good idea to try our best to prove the more optimistic hypotheses—by demonstration.\n Is it the Optimist, or the Pessimist who will be proven right? Both presented valid points and raised reasonable arguments, and almost any explanation of the Fermi Paradox we can think of tells us something important about us, our future and choices we should make. Finally, if we are truly alone in the Galaxy, isn’t it the best time to start exploring?\n Julie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council."}