{"fingerprint": "O7W5T1VCmbyT5iH9cE8XySFVptI=", "sitename": "Clarkesworld Magazine", "title": "Blue Grey Blue by Yukimi Ogawa", "author": "Yukimi Ogawa", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ogawa_12_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Blue Grey Blue by Yukimi Ogawa", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5200 words, short story\nBlue Grey Blue\nNo one knew exactly when or how it’d all started. But there was a time he could think of specifically: it was three or four years ago, when a girl of around ten came to the shop, which sold practical eyewear for the locals. The girl said she needed a pair of glasses, because something was wrong with her eyes.\n“You’d like to see a doctor first,” Tsuyu had told her, crouching to meet her mosaic-like rainbow eyes, so out of place in her tanned, barley-colored face.\n“I did!” she had said. “And they found nothing wrong with me. But something is going wrong with my parrot, and Mother and Father don’t see it, so it must be my eyes.”\n“Your parrot?”\nShe’d nodded defiantly. “He’s got a part of his feather just like my eyes, around his chest. That was why we got him in the first place. But that part is fading these days. As many colors, still, but they all look a bit . . . weaker.”\nTsuyu never found out what happened to her, or the parrot afterward, because the girl never came back after he’d told her to watch out for a little while more, keeping to her doctor’s instructions. Much later, others started to see something similar, too. There must have been something only small children could see, in the early stage.\nNow at the same shop, after an especially nasty fit of coughs, Tsuyu looked at his reflection in one of the mirrors and wondered why he was thinking this. But of course—his own eyes’ color was so weak today that it looked as though he had no irises, and tears from the coughing made him look even more like a horrible monster of some sort.\nHe was about to pour himself some tea when the bell attached to the door rang. His senior, the manager of the branch who had gone for lunch, would have started talking right before the door was fully open, so the person who’d just arrived was a customer. Tsuyu hastily put the pot back down onto the desk. “Hello,” he said, and forced down a cough. “Please let me know if there is anything I can assist you with.”\nWhen these automatic words had rolled out (words for the locals, of course—for foreigners the in-house manual required something much more enthusiastic) another cough threatened him, so that his eyes were brimming with tears. What did he look like right now? The customer, a woman of about his own age, stood framed in the glass door right behind her, against the backcloth of the sallow break-in-rainy-season midday. Most of her skin visible was lazurite, golden pyrite flecks punctuating her countenance here and there. Blue wasn’t that uncommon of course, but gold was, and for a split second he felt a pang of jealousy.\nThe customer smiled at him. “I heard that an ultramarine person works for this company. And I went to the shop on the high street and they said that person can be found here at the branch.”\n“Ah. That is me, actually, though I’m not always ultramarine.” Tsuyu wiped his eyes with a cloth. “Definitely not today. Sorry you didn’t find what you came here for after all that trouble.”\nBut as he was saying this, the woman came striding between the low shelves of glasses on display. For a moment it looked as though she was performing a fluid kind of dance, like a flower petal carried by a current and yet gracefully avoiding collision with rocks and trees, before coming to a sudden halt to stand right in front of him. He almost stepped back, not quite used to a local staring into his eyes. “That’s beautiful,” she said, and her eyes were the deep, deep black-blue of indigo—one of the most stable of blues. Everything he’d have wanted. “Yes, I can feel blues hiding away, but—how does that work?”\nWork? “Well. When I’m ill or simply feeling down, my eyes go just—colorless. Ultramarine is only when I’m feeling really strong.”\n“So your eyes are basically like this? White Chalcedony? Or is there anything in-between?”\n“Chalcedony?” He blinked. “I never . . . well. They’re Asiatic dayflower blue when I’m like, just okay and stable.”\n“Oh, how interesting! Oldest of blues, and quite soluble, dayflower blue is, you know!”\nTsuyu almost winced, stopped himself just in time.\nThe woman shifted a little, as if to have an even better look, making Tsuyu feel even more nervous. “Have you seen them actually changing colors?”\nTsuyu thought about it, using that moment to divert his eyes from her. “Not really. I don’t look at myself more often than necessary.”\n“No?” she sounded surprised, but then took one step back. “Sorry. I’m a collector of blues. Of knowledge of them, of course.” She flashed her teeth like robin eggs. “And as you can see, I’m from one of that blood line, too. But not many people have changing colors the way yours do.”\nTsuyu inhaled to say something, ended up coughing again, stepping away from her.\n“Oh, are you ill? Should I come back, when you’re better? Are you always here at this branch?”\n“I . . . it depends.” He coughed some more. “When I’m ultramarine or dayflower, I’m at high street.”\n“What? Why do they place you here when you’re white chalcedony?”\n“I asked them to. Ultramarine is quite popular with the tourists. Dayflower isn’t exactly what they’d come to this island for, you know, many foreigners having blue eyes. Still, better than nothing.” He pointed at his own eyes.\nThe woman frowned. “I don’t understand.”\nOh no, you wouldn’t. “You can’t watch on until they change colors, anyway.”\n“Do you at least know when the change is most likely to happen?”\nTsuyu gestured an ambiguous answer, smiling despite himself.\n“You can’t turn me away, anyway. I’m a customer.”\n“Are you going to buy something?”\n“Yes! Recommend me a frame! . . . If you aren’t too ill to do that?”\nHe stifled a laugh and looked around the shop. Ordinary gold was too loud for her, nor the tortoiseshell, even the brownish one, quite matched. Collector of blues. Why would anyone do that here, blue being too common and only slightly better than nothing? And he thought about his own color, how it was said to have been the root of every blue, before the strong indigo came along.\nHe took a green frame, green of dayflower’s leaves rendered soft by morning dew, with leaf-like patterns over the temples. Just as he had hoped, the frame seemed to settle with her skin, without darkening the tone.\n“The lenses . . . ”\n“Just leave them plano, thanks. Fashion!”\nHer eyes would look much better without the lenses to veil them. He adjusted the frame to fit her small face and said, “Are you really buying this one?”\n“Yes. Now I can come back, yes?”\nHe let out a small sound that was both sigh and laugh.\n“Yes?”\n“Okay.”\n“Say yes!”\n“Yes.”\nShe grinned her robin-egg grin again. Just as she was paying, Tsuyu saw his senior coming back, on the other side of the street; he probably couldn’t see the inside of the shop, the outside so bright with all the sun. The next moment he wondered why he cared about the senior seeing this woman.\nBefore she could meet the senior, the woman left Tsuyu, with her name Ai ringing in his head.\nTsuyu’s eye-sight wasn’t particularly bad. When he was thirteen, one of the priests managing the orphanage brought back a scratched-up pair of glasses from his trip to the city.\n“This was one of the samples they exhibited in their windows,” the priest told Tsuyu. “They were about to throw this one away. I thought maybe you could use these when you don’t like your own eye color.”\nEver since, he had been wearing glasses. In the village there weren’t many children who wore glasses, and the glasses themselves drew more of people’s attention than his color-drained eyes. It felt good, like a wall he could carry around.\nUp until a few decades ago, eyewear shops weren’t a very strong a business, as far as tourists were concerned. Glasses weren’t something traditional or peculiar to this country, even though the colors and patterns of the frames manufactured here were popular enough for some peoples. It all changed when someone invented contact lenses that made you see the world in might-be colors. Almost every tourist bought a box at least, despite its ridiculous price, to take back and see their homeland or families and friends more colorful, just like the people and scenery of this island. More expensive ones even created the illusion of patterns on people’s skin, too. Tsuyu wondered how the government could possibly invent such a thing, and where all these colors came from, but that was what saved the eyewear industry from ending up a miserable, only-for-locals business, which gave him this job, after all.\nBut then, these days, perhaps it was the locals who needed these contact lenses more. Though they were a bit too expensive for the locals . . .\n“Focus.”\nHer voice pulled him back to here and now so forcibly that he gasped for breath. As she straddled him, a patch of shiny skin inside her knee rubbed against him, and it sent a shiver through him. There was something peculiar about this patch; it looked like a holographic image of countless blues, and if it felt soft or metallic to the touch, Tsuyu couldn’t tell. Ai didn’t seem to mind it when he touched it, but she didn’t seem very willing to talk about it. Was it some kind of scar?\n“Keep your eyes open, okay? I need to see it,” she said, her voice demanding, her eyes pleading.\nTsuyu somehow managed to nod. What color in his eyes now? As he stared up helplessly into her eyes, something changed in Ai’s irises. A glint? A click? He tried to reach for the curves of her body, which felt strangely flexible, even fluid. He’d never felt anything like—\nAnd then Ai laughed and collapsed onto him. Tsuyu coughed. “Did you see it?” His voice sounded terrible.\n“Oh yes, I caught it! That was amazing.”\nHe chuckled as he held her against him. “I wish I could see it, too. Then I might feel more . . . comfortable with myself.”\nShe lifted her head, frowning. “What do you mean? You not comfortable with yourself? Why?”\n“My colors . . . well. You wouldn’t understand.”\nAi sat up, slowly. The frown deepened, and it immediately made Tsuyu regret saying that; she looked bewildered and sad, rather than angry.\n“Sorry,” he said, though unsure what he was sorry for.\nAi unfocused from his eyes, looked down at somewhere around his chest. “Don’t ever say something like that again, okay?”\n“Okay.”\nShe was beautiful, even though she looked ridiculously ambient in her blue gray room. She could have been anything she wanted. Maybe even a PR person for the government or something, showy and important for this country. Why was she working as a researcher in the field?\nAnd that was a dangerous thought, he knew. Dangerous, which always led to him feeling sulky, and to his horrible monster-eyes.\n“Ai . . . Ai?”\n“Yes?”\n“Does your name mean indigo? Or love, or something entirely different?”\nShe smiled and stroked his hair. And pushed her shiny patch hard onto him, so that he completely forgot about his own question.\n“I’m so sorry again,” he said to the manager of the high-street shop, just as he was about to walk out of the back door, to head for the branch. He wasn’t sure if it was the rain that had got to him, or his conversation with Ai last night. Just as Ai had said, dayflower was quite soluble, and rain always affected him badly. But then, when he recalled that expression on her face, he found himself still a bit shaken.\nThe manager shook her head. “Don’t worry, Tsuyu. We always need someone at the small shop anyway. Take care of yourself first.” She smiled. “And who knows, you might even end up an urban legend of some sort—if you see the rare ultramarine guy, all your wishes will come true, or something like that.”\nTsuyu smiled back. Her face full of multi-green geometric patterns, the thin wooden frame of her glasses carefully chosen so that the whole image created one of a lush tree. Was she nice because she had a lot of room in her patience having such beautiful patterns, or because she was feeling sorry for him?\nHe sighed as he walked out of the door. What am I thinking? It’d stopped raining, but the grounds were still quite wet, and he trod carefully avoiding puddles. Boss is just such a nice woman. And he wondered how he deserved such a nice boss and nice job. Where would he have been, if he hadn’t managed to find this place?\nOr did that mean, if he had more colors, or even one strong color for that matter, he deserved even better work?\n“Tsuyu!”\nHe jumped. Looked around, embarrassed. Behind him he spotted a coworker waving at him, splashing through puddles. Sunshine fell through the gap between the clouds, and her silvery skin glinted, her hair thin honey melting over her cheeks.\nWhen she caught up, she was quite out of breaths. “Here, have my ginger tea.”\nHe took the packet from her. “Thanks—you ran all this way just to give me this?”\n“Yeah. Such a nice coworker, aren’t I? Get well soon, okay?”\n“Okay. Thanks again.”\nThe coworker ran back the way she’d come.\nHow did he deserve all this? With his stupid, unstable color that was only in his eyes?\nIn her navy chiffon dress, under her umbrella, Ai looked as ambient as she did in her own room, on her own bed. Only her glasses shone strangely as she waved and smiled. Even her teeth seemed to sink under the veil of the rain. The shiny patch at her knee was hidden under her dress.\nStill beautiful. So beautiful. Tsuyu couldn’t help but grin as they came near enough. “Been collecting a lot of blues today?”\n“Mmm.” Ai spread her arm, so that raindrops touched her hand. “I’m finding it harder to discover more these days. Maybe blue folks don’t like the rain.”\n“Well. Blue is too common that most of us share the same shade or tint or whatever? Unless one is special like you.” Then, he hastily added: “Or my eyes sometimes.”\nAi cocked an eyebrow, but said, “Don’t you know? Our colors and patterns are affected a lot by our life, as well as genetic information. Of course the basic ones are determined genetically, but as we grow other things get to have a lot of say. Like what we eat, what we do, what we think. No blue can be the same, really.”\nNo, he didn’t know that. How was that possible? Also, that he never heard of such a fact? He shook his head, negating many things.\n“You didn’t? Oh, really, this should be something everybody is taught at a very early stage.” She folded her own umbrella and stepped in under his.\nThey had been planning to go see the Star Festival decorations in the locals’ district, only, with the rain, that didn’t feel like a very promising idea now. The festival wasn’t tonight, but they had been hoping to have a look around while it was not too crowded. His shoulder brushing hers, they started walking, their direction uncertain. “If that is true,” he said, “maybe we were one, same blue person, at some point of history? Even if we don’t look like each other at all at this point. I mean, with your lazurite and my ultramarine, we have enough genetic stuff in common.”\nAi fell silent, her steps even more indecisive. For a moment Tsuyu wondered if she hadn’t heard him, or if he’d said something stupid again. But then, “No. It’s impossible.”\n“No? Why?”\n“Why? Because . . . because if we were, we shouldn’t be here, like this.”\nTsuyu laughed. “I meant Very Long Time Ago.”\n“I know. But still.” She suddenly stopped for a second; then grinned and tugged at his hand. “This way!”\n“What? Where to?”\nThey walked, swerving away from the festival site into a narrow alley which only the locals used as a shortcut to the high street. It was hard with the umbrella, and Tsuyu could see that Ai was taking care not to get him too wet, while trying not to be in other pedestrians’ way. Fluid.\nWhen they were on the high street, they went in line with the wave of tourists. It looked very much like they were heading for . . .\n“The Festival site for the foreigners?” Tsuyu wondered aloud.\nAi smiled, without looking at him. “The site for them has a roof, you see.”\n“Yes, but . . . ” He let out a small cough. “But there would be foreigners!”\n“Of course. What do you think the roof is for?”\nBefore he could protest any further, Ai slipped in the dome-like site through its huge doors. Pulling Tsuyu along, who, unlike her, had to bump into others and to nod sorry so many times.\nInside, everything was bigger than the decorations in the locals’ site. Paper flower-balls and paper balloons hanging near the high ceiling so large that Tsuyu wondered how many people it’d taken to make such things, with beautiful shreds dangling to almost touch the floor. The shreds were fabric, not plastic tapes like the ones prepared for the locals, obviously woven especially for this purpose. These behind-the-scene tasks were usually given to people with no prominent colors or patterns. Drowned in thoughts and density of things surrounding him, for a second Tsuyu thought he’d lost Ai in the sea of the shreds, in spite of their linked hands. But of course there she was, when the shreds parted in front of him, in the part of the dome where pinkish decorations dominated, so her color was just too striking in contrast.\nThe tourists noticed, and started taking photos of the blue couple. Tsuyu was torn between running away from this place and looking on at her forever.\n“Look at me, Tsuyu,” she whispered. “You are beautiful.”\nThat moment, he thought he saw a flash of ultramarine reflected on Ai’s glasses, over her indigo eyes, and blinked. It seemed impossible, but nevertheless he felt the surge of pride right there, and everything else around the two of them seemed to melt somehow.\nAnd looking at her forever won. Of course it did.\nHe felt slightly dizzy, and his head throbbed a little with every breath he took, though it wasn’t as bad as he had expected when he had heard the weather forecast mentioning the center of a low air pressure hovering over the island. He forced himself to look into a mirror, and frowned. Just as he did so the manager came to stand beside him, and raised her brows. “They’re blue.”\nTsuyu nodded. It wasn’t exactly ultramarine, but something a bit deeper. And the tinge shifted just a little at angles, as the light changed. Sometimes it even seemed to swirl—as if a distant nebula was reflected in the eye. When he had woken up this morning and felt the heaviness of his head, he hadn’t even bothered looking into a mirror, assuming it looked horrible and ridiculous as usual.\n“That’s beautiful, too. Looks like something darker has been added to your trademark ultramarine.”\nSomething darker. “Indigo?”\n“Oh yes, that.” She took out a couple of painkiller pills from the medicine box. “That’d look really good behind a lacquered frame, if you don’t mind.”\nHe looked at his boss. Today her rimless glasses had brightly colored gems on the temples. Flowers, fruit, or birds in the tree. He wondered if what Ai had said was true—that who you were affected your colors and patterns. If it was, then, what had she gone through to develop these complicated yet sophisticated patterns?\n“What? You don’t think painkillers would do any good?”\n“Oh no, sorry. I’ll be fine. Thank you.”\nSo he forced down the pills, and spent the day at the high-street shop.\nA few tourists who came in that morning recognized Tsuyu from the festival dome, and soon, the high street shop was crowded with foreigners who had heard the rumor. The sales that day were the highest in a long while, and of course, Tsuyu sold more than any other, both usual glasses and the special contact lenses. The silver coworker nudged at him, pretending to be jealous.\nHow did he deserve all this?\nAt the end of the day he checked his eyes again, which were still somewhere between indigo and ultramarine. The locals’ street was still busy as he left the shop for the day, the sun not completely set yet. The sky was strangely colorful, the streetlights coming to life one by one, strengthening the outlines of everything he could see. He walked on, nodding to a few people he knew, and then, something caught his attention at the corner of his eye.\nHe looked.\nThere was no telling if this person was male or female, or something entirely different. This person glowed, soft silver light seeming to cool down the air around. Glowing wasn’t common, but not impossible either, and Tsuyu didn’t know why he was drawn to this person so.\nThen a wind blew just as Tsuyu passed by this person, and the person’s hair swayed a little. At the small of their neck, Tsuyu saw a patch, shiny and metallic, consisting of many silvers.\nJust like . . .\nTsuyu stopped, staring at the person’s back, knowing somewhere in his mind that he shouldn’t be doing this. Even as they were, in this island where everything was meant to be stared at, many locals hated that being done, especially by another local. But he couldn’t help it.\nThe person was soon drowned in the sea of colors of the locals. Somewhere near the back door to the eyewear shop, he lost the glow completely.\nWith an effort he started walking again. Belatedly he realized it was the way the person’s glow felt strangely ambient in the twilight, just like Ai’s blue gray, that he’d found so peculiar about this person. He couldn’t help but glance back over his shoulder, but of course, there was not a hint of the person’s glow in the dusk-fallen street.\nThat night, he called Ai. She never answered.\nThe next morning when he turned in there was a commotion in the high-street shop. Everyone seemed to be at the center of the shop, though it was almost time to open up for the day, and some of them should be away in the back yard or running errands. At the very center of it all, was the silver coworker.\nOnly she wasn’t silver any more.\nThis was the first time Tsuyu actually saw someone completely grayed-out. He had seen people or things slowly toned down, but nothing this drastic. The silver girl had had no patterns, but different tinges of silver crammed all over her surfaces, which had looked like a pattern in a way. Some of the tinges had glowed, especially when she’d smiled, and everybody had loved that. Now, he could see the slight shade differences, but it was all dull gray instead of silver, and she looked as though she just popped out of a black-and-white photograph. The glow was gone, too, but he couldn’t tell if that was because she was crying now.\nThe boss was touching the silver girl’s shoulder, but Tsuyu could feel other employees were afraid to do the same, in case this was contagious. Researchers and reason told this was not the case—there was no logic to how and where people or things were affected—but he knew they just couldn’t help it.\nTsuyu pushed on into the center. “Shiroka,” he called her name, but couldn’t go on.\nShe looked up. “Oh Tsuyu, look. I’m no longer shirokane.” She tried to smile, which made everything seem even worse.\nHe patted on her now almost completely white hair. “Maybe I can walk her home—” he started to say to the boss.\n“No.” Shiroka shook her head. “I was already like this when I woke this morning, and I came in to say I wanted to work at the branch today. I’m only crying because Boss was really nice about it.” She tried to smile again, and ended up sniffing. “But . . . you know, now I realize, maybe locals don’t want to buy stuff from me . . . ”\nTsuyu wanted to tell her it was not true, but he knew some people would react that way. Look how peripheral other workers were being right now—it was all he could do to shake his head. And then the boss cut in. “There is plenty of work to do in the back yard, if that’s more comfortable for you. I know you have deft fingers, so maybe you can help with the repair team and all.” The woman looked around. “Anyway. Let’s get moving! The customers will be in soon!”\nThe workers dispersed, some awkwardly patting Shiroka’s shoulder. Some still unable to make up their mind.\nThat day passed in a blur, everyone’s mind filled with why. Why was this happening? Why here, why her? Shiroka kept herself mostly to the back yard, occasionally running errands, but then covering her head with the boss’s shiny silk shawl. Tsuyu caught a glimpse of her as she sneaked out of the back door, the shawl catching sunlight and shimmering as she gave him a small wave.\nTsuyu nodded back. And he realized he couldn’t help, for some reason, thinking about that glowing silver person he’d seen yesterday.\nAnd about Ai.\nHe cursed himself for having chosen the worst timing when he had left work that day, and having carelessly walked in the hard shower that had just started then. And having stumbled down onto his cot, too tired from the day’s work, without thoroughly drying himself and keeping warm. All of that resulted in him now feeling so weak, fever ridden in the small hours of that night, though he had a feeling that this had nothing to do with his colors—ordinary people did catch a cold when they behaved just like he had, of course. He might be stronger than he used to be, but there was only so much that could change, really. He wanted to see Ai; or at least, hear her voice. He had tried calling her during the day, but she’d never answered. Which made him realize, in an absent-minded way, that he knew nothing of her usual work schedule, or where she would be found when she was not home.\nBut then—\nA hand landed on his eyes. Why, he wanted to say, but there were too many whys that he couldn’t decide which one to ask first.\nSo he let her speak first. “Don’t open your eyes.”\nHe sighed. “Where have you been? I tried—”\n“I made a mistake. It’s all my fault.”\n“Ai?”\nHer head gently touched his, as she awkwardly slipped in beside him, her hand still over his eyes. “I take. I don’t give. I’m built for taking, programmed to collect blues. If I give, that means un-becoming me. End of me.”\nTsuyu thought about the new tinge of his eyes. How it had helped him deal with many things—not only cold and all, but if he had been still the same, unstable dayflower, he might not have felt so sympathetic for Shiroka. But then, without Ai, what were the indigo-tinted eyes any good for? “Ai. Please. If that is such a problem, take it back from me.”\n“It’s too late.” Her hand seemed to shake, or perhaps, ripple. “I didn’t even realize what I was doing, until recently. Until another AI came to this town, until I saw it fully obliging to its duty. We only take. That one silver, me blue. When I cease to function just as I was built, then I have no right to exist—a serious bug detected. They already shut down some of the modules, I will be nothing soon. And then a new, proper blue AI will be placed.”\nNothing Ai was saying made sense to Tsuyu. Except—“The contact lenses.” He swallowed. “Where do all those colors come from . . . ”\nAi laughed, or sighed, and stroked his hair with another hand which felt way too soft. “At least the indigo I gave you settled down well with you and you’re a lot stronger. It will be fully yours once this rain is over. That much, I don’t regret.”\n“Ai. Please—”\n“Look at me, Tsuyu.”\nHer hand lifted and he opened his eyes. He soon understood why Ai hadn’t wanted him to see her before talking. If not, he wouldn’t have recognized the thing beside him as Ai. It looked like a lump of water, with a cracked holographic image projected. Every second Ai’s face—half or quarter of it—showed on a different part of the water. Her shiny patch taking over her, with no proper control. If he hadn’t heard her voice first, let her explain first, he might have screamed.\nBut it did have Ai’s voice, so Tsuyu didn’t have to scream, or to be frightened. “I’m sorry,” her voice said.\n“Don’t go. Please. Maybe there’s something—”\nBut then, the rain struck hard onto his windows, and he made a mistake of looking away from her for a second.\nAnd she was gone.\nA few days later when he had fully recovered from the cold, he was surprised to find Shiroka at the high-street shop, just like she’d done before graying out. “Can you believe,” she said as soon as she saw Tsuyu. “The foreigners even like me this way! They make me wear a colorful frame or colored contacts and take photos. They do have strange tastes, really!”\nTsuyu smiled, relieved. “Yes, they do.”\nThen she looked at his eyes for a second, and tilted her head. “You know, I’m sure this sounds strange from me, but . . . ” Shiroka unfolded a crazily colorful frame, which had been designed especially for her by one of the craftspeople, and set it on her face. “I did like your dayflower eyes. Even the way it drained. I knew it was troubling you so I never mentioned this before, but. Now that I’m gray, I’d be forgiven for saying something like this, or would I not?”\nTsuyu laughed. “You would, yes.” He wiped a single drop of tear at the corner of his eye. “And—thank you. I think I needed someone to mourn that color. Thanks.”\nShiroka blinked her completely gray blinks, behind the custom-made rims. “Are you . . . okay?”\n“Yes.”\nThat was all he could say as an answer to that, for now. He looked out of the front window, at the sunny high street, busy as ever with tourists and islanders. The rainy season had ended while he had slept his cold away. Summer had come."}