{"fingerprint": "ETcSJAC+/nAHaVqTralpQjlvReU=", "sitename": "Clarkesworld Magazine", "title": "Intentionalities by Aimee Ogden", "author": "Aimee Ogden", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ogden_01_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Intentionalities by Aimee Ogden", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4330 words, short story\n Intentionalities\n Sorrel never intended to confer a child to the Braxos Corporation. But Sorrel had never intended a lot of things that managed to happen with or without her say-so.\n She had scarcely marched across the auditorium, diploma in hand, when Congress passed the Protecting America’s Children Act. Education was handed over to the private sector; mostly to prison corporations whose personnel already had certifications in Sublethal Youth Management. Sorrel didn’t have a SYM license, nor the heart to teach with a taser on her hip. Instead, she found work serving as a custodian at Mission Health’s main hospital campus. Mission belonged to the parent corp that owned her student loan debt and her father’s end-of-life bills too. Having them deduct the payments straight from her paycheck cut her interest rate by a full half-percent.\n The hospital had Braxos ads everywhere, of course, along with those for several other parent corp holdings. One holovid played in the air over the middle of the cafeteria several times a day on a twenty-minute loop. Braxos: Our Future and Yours, Hand in Hand. A blurb about the Future Career Training and Advocacy Act. All the ads became white noise to Sorrel sooner or later. But she caught herself sometimes humming that little jingle, or the one for the new Hyperloop line.\n So Sorrel made plans, the kind of plans that can only be made because believing they could come true was the only thing that got a body out of bed in the morning. She was making ends meet. She would find a cheaper apartment and save money there. She would skip breakfast a couple times a week: another couple bucks to sock away. She would stop going out to the matinee theater on her Tuesday mornings off, cancel her Vidja streaming service, skip the occasional beers with friends who still lived nearby. The Shell sparkled overhead, reflecting sunlight back into space, but Sorrel’s apartment sweltered in the hotter-than-ever summers with the air conditioning off. In her head, the numbers added up slowly but steadily, building sturdy mountains out of nickel-and-dime molehills.\n But the balance in her checking account never fell in line the way its imaginary counterpart did. After two months of overdraft fees, her bank transferred her account to a High-Risk Financial Management Plan. When she sat down at the first required meeting with her assigned case manager, the man didn’t even look at her as he typed her entire biography into a two hundred-character field on his form. When he asked how she planned to develop her financial outlook to prevent reaching felony levels of debt, he called her Sara. Her hands refused to warm to the temperature of the office; she clasped them on her lap so he wouldn’t see them shake. Nothing she could say would be right. No secret money stashed away, no education and career development plan, no chance of an inheritance. Her head was an empty box and the only thing bouncing inside of it was the stupid Braxos jingle.\n “I’m going to confer a child to Braxos,” she said, and he looked up from his tablet.\n Sorrel meant to have a plan in place before the screening test arrived in the mail: another part-time job, underemployment relief funds, crowdfunding. But her BizPass résumé only ever racked up a dozen hits and no leads, her relief application bounced, and her HitchooUp ended up in the red after she paid the fee to close it out.\n So, when the screening test came, Sorrel viciously swabbed the inside of her cheek and then dropped it back in the postal box, postage paid. By the time the response arrived, she’d convinced herself not to read it in detail. She would check to see if there was a contract, and if so, she could sign it and send it back. If not, no harm—she would simply be back where she’d started. Knowing what small genetic accidents kept her from being a viable candidate wouldn’t change things.\n She opened the envelope. The cover letter fell out; behind it peeked another document, on heavy paper. At the bottom, a hungry signature line waited.\n Her fingers brushed the letter, not hard enough to sweep it aside. Instead they crawled word by word over the ink, collecting the Scrabble-tile names of celebrated genes. A novel mutation in the POLB gene was her crowning glory, promising a vastly increased rate of replication fidelity that would help her offspring to withstand the withering radiation of space.\n It would keep the baby’s genes hewing closely to the original versions that Sorrel would bestow upon it, in other words. A tie to bind them between worlds. Her hand seized, and she crushed the cover letter.\n Her signature on the contract wavered more than usual, but still recognizable as her own. She put it into the envelope and dropped it into the mailbox downstairs before she changed her mind.\n It was only five years. Sorrel could make it through five years unscathed, if it meant a light at the end of the interminable tunnel of debt she’d fallen into.\n Sorrel got sucked into an argument with the crowd outside the clinic. She was supposed to keep her head down and follow the company liaison from the taxi to the door, but then some asshole hit her in the head with a sign declaring THE YOUTH OCCUPATIONAL SUCCESS ACT IS SLAVERY!!! It wasn’t slavery, it was just ten years of service after their training, and after that the kids would be set up for any career they wanted—she tried to say that, at least, but the protesters shouted her down, calling her corporate broodmare and mother of the year and, more succinctly, bitch. And then the liaison was pulling her away, through the bristling cardboard signs and grabbing hands, and into the cool, clean lobby.\n While she waited for her appointment, Sorrel considered asking about the sperm donor. It was doubtful that Braxos could tell her much, but even if she couldn’t know who he was, she would have liked to hear what he was like, where he’d lived. Why they wanted to knit her DNA to his. But when the technician called her name, he didn’t look up from his tablet, only rattled off her identifying information.\n “Yes.” She stood up and fumbled for her purse, her jacket, the outdated magazine where she’d been staring at a recipe she would never make. “That’s me.”\n “Follow me.” He disappeared into the hallway behind the waiting room and Sorrel trotted to keep up. The waiting room had been full; he must have had a lot of clients that day. Knowing it was true didn’t make Sorrel feel better about it.\n In the patient room, a sheet and a green cotton gown had been folded neatly and left on the edge of the exam table. The technician excused himself while Sorrel changed. “Don’t forget to take your underwear off,” he reminded her before the door whispered shut.\n Sorrel slipped into the gown and lay back on the table. Her skin prickled with cold where the sheet touched her legs. She wriggled, trying to find a comfortable position. Exactly how many people had lain here expecting to get pregnant while still snugly encased in a pair of Hanes?\n A knock on the door pulled her fingers taut on the sheet. “Come in,” she called, and another technician—a different sandy-haired white man—entered with a small cart. “Sorrel McIntosh,” he said, reading from a vial label on the cart, and compared it to the readout on his tablet. “Thumbprint here.”\n She pressed the tablet where he indicated, and it chimed its approval: she was, in fact, who she said she was. No allergies he should be aware of, she averred, no new health conditions since the mandatory complete physical last week. At his instruction, she fumbled her feet into the stirrups and stared up into the clean white fluorescent light. Someone had hung a suncatcher from one intersection of the drop ceiling tiles. A crib mobile, for adults. Suspended, it twisted on its string in the draft from the HVAC vent, beaming faintly flower-shaped patches onto the white wall while the cold speculum stretched Sorrel open.\n “This is the lidocaine injection.” The technician pulled up beside her on a rolling stool to show her a syringe. “You might feel a little pinch.”\n That little pinch darkened the edges of Sorrel’s world. When she swam nauseously up from the depths of her dizziness, the technician had stripped off his latex gloves and tossed them into the used kit on his cart. “You did great,” he said, entering data on the tablet. Sorrel craned her neck, but couldn’t see what he wrote, nor guess what he’d need to. “Please remain in this position for ten minutes before you get up. There are tissues to clean yourself up if you need. Thanks for coming in today.”\n “Thank you,” said Sorrel, foolishly, awkwardly. He pushed the cart out with one foot and shut the door. Sorrel stared at the ceiling, alone with the realization she’d forgotten to ask about the donor. Alone altogether, now.\n Five years wasn’t forever. She could be alone for five years.\n Sorrel wasn’t supposed to be the first one to hold the baby. The predelivery instructions had been clear that the Braxos technician would handle the infant before she did. First things first: turn the newborn into a number. Break her up from a person into a DNA word search puzzle.\n But the C-section had run long, and the technician had left the operating room for a bathroom break, and so this pink, wrinkled, cotton-smelling thing had been pressed directly into Sorrel’s arms. Her whole body trembled, convinced she was ice-cold in the wake of the epidural. “I’ll drop her,” she cried, as the little mouth pushed and puckered against her neck.\n “You can do this, Mama.” The nurse tutted and draped a warm felt blanket over her head and around her shoulders, anchoring it under the baby’s tiny weight. Sorrel didn’t have the energy to explain it to her. If anything happened to the child, if she wasn’t contractually perfect, then these nine months of worry and wellness checks had been for nothing. Then she was still in the same tunnel, digging ever downward, too turned around to hope to surface again. “No one’s ever dropped a baby on my watch. But if you do fumble her,” the nurse went on, appending a wink, “I’ll catch her before she hits the ground.” She collapsed the wave function of Sorrel’s violently oscillating knee by squeezing it through the sheets.\n Then the Braxos technician stumbled back into the OR, scrubbing in and making his apologies concurrently. Sorrel hadn’t stopped shaking by the time he lifted the infant from her arms, nor during the trip from the operating floor to the recovery ward. She was shaking still when her predelivery clothes, folded on the room’s empty chair, buzzed. The nurse brought her the phone, wrapped in Sorrel’s wadded-up jeans, and Sorrel fumbled her passcode twice before it unlocked.\n There was a new message from her bank: the initial Braxos payment had been received. Every zero in the number looped her around and around inside it, dizzying her with relief. She shut the phone off and tossed it by her feet before the nausea overwhelmed her.\n “Here we are, now!” The nurse appeared in the doorway with a swaddled infant in her arms. When Sorrel didn’t hold her arms out, she nestled the baby in the bed alongside her. “She’s been fed according to your wishes. You two should get acquainted and get some rest. Not necessarily in that order.” Her smile had ossified since earlier. Maybe she was at the end of a long shift; maybe she’d remembered that Sorrel was a Braxos parent. “If you’re going to name her yourself, you can start thinking on that; otherwise, we’ll use the random generator tomorrow for the official certificate. In the meantime, you just buzz the nursing station if you need anything. All right, dear?”\n “Okay.” The nurse dimmed the lights. Sorrel frowned down at the infant beside her, scrying for her own reflection in the opaque blue-black eyes and petulant face.\n In the morning, she had the nurse enter the name Abigail onto the birth certificate. Abigail had been Sorrel’s mother’s name. “You can use the generator for a middle name,” she said, aiming the little plastic bottle at Abigail’s incompetently pursed mouth.\n The nurse’s reading lenses jumped as she wrinkled her nose at the tablet. “Abigail April! Doesn’t make much sense for a little girl born in July.”\n “It’s fine.” Sorrel nudged Abigail’s lips with the bottle nipple, the way the nutritional consultant had showed her. This time, she latched on. Tiny bubbles rolled up to the top of the chalky liquid with each of her sluggish pulls. “Just put in Abigail April.”\n The nurse turned her back to tap on her tablet. Abigail’s feeble gulps competed with the room’s silence, then were absorbed into it. Sorrel rearranged to hold the baby and the bottle with the same arm and fumbled her phone out to watch the day’s news. The top story detailed the construction project that would house the new Braxos crèche. She scrolled past it to a bit about a Hyperloop derailment outside Rio, then glazed over the coverage of the Water Riots—nothing new to see there.\n A loud slurping noise roused her from behind drooping eyelids. The baby had made it to the end of the bottle and failed to distinguish dry air from milk. Sorrel flicked the bottle onto the bedside table and hefted the baby toward her shoulder. The baby burped before she ever made it there, dribbling a mouthful of sour milk slobber down the front of Abigail’s gown. “Goddamn it, Abigail April,” she said, and the words rolled too naturally out of her mouth. She snatched a tissue to wipe off her shirt and the baby’s pointed chin. “Damn it. Damn it, damn it, damn it.”\n She knew from the outset the name was a mistake. Pretending it was the first such she’d made, that was only a concession to what was left of her pride.\n Sorrel didn’t mean for Abigail’s second birthday party to be her first and only one. She made a cake, yellow with chocolate frosting, and invited the other three children around Abigail’s age from the Mission housing complex where they lived now. One of the kids’ older siblings who’d tagged along sang “Happy Birthday” with the adults, but the other little ones only shrieked in confused anticipation. When Sorrel stopped Abigail from grabbing for the cake and its still-lit candles—“No no! Hot!”—Abigail burst into frustrated tears.\n Sorrel cried too, but only later, when they were alone, while Abigail played with the presents that Braxos had paid for. They sent money every month for toys and games, as well as for childcare and food and clothes and educational programming. They wanted well-rounded humans, not neurotic lab rats. Abigail was currently banging a plastic spaceship against various things in the apartment, examining the different sounds it made when bounced off the couch versus tapped on the wall.\n The week before, Sorrel had started to fill out a dating profile on A-More.com until she got to the question about whether or not she had children and froze, as she always did. This time, she’d been saved by the ping of July’s check arriving in her bank account. She closed the A-More tab and studied the solid black numbers. Walls of zeroes, holding off all the awful things lying just out of sight but never out of memory, hunger and sickness and exhaustion. Walls full of holes, gaping wounds through which Sorrel couldn’t help but joggle all the painful possibilities to test how loose they’d grown.\n “We could go on vacation,” she said to Abigail, who was banging the spaceship against the toy bin now. She wiped her nose on her sleeve, a habit she’d been trying to break Abigail of. “Neither of us have ever had a vacation.”\n Abigail put the nose cone of the ship in her mouth. “Snack, pweez,” she said, around her mouthful of Braxos fuselage.\n Sorrel picked her up and carried her into the kitchen to make peanut butter banana, which was too messy to eat on the carpet. She cut the banana into little discs, dabbed peanut butter on top, and placed a single Cheerio halo in the middle of each. Abigail ate three slices and pulped the rest in her fists to paint an abstract masterwork on her high chair tray.\n Sorrel hated it when dark fantasies flitted through her head. One day, while waiting to cross the street to do their grocery shopping, she caught herself dreaming about a car blowing through the intersection beneath a bloody red light. She imagined Abigail sailing through the air, imagined her legs shattering into the kind of shrapnel that would never again tolerate space travel. She could hear the sound of Abigail hitting the pavement, the screaming—Abigail’s, her own. Intrusive thoughts, horrible thoughts, that she held on the back of her tongue to savor and never quite swallow.\n “Mommy, ow!” Abigail protested, wringing her hand halfway free of Sorrel’s. But she didn’t pull all the way clear, and she didn’t tumble into traffic, and her perfect legs carried them all the way down the street to the Amazon Market, where the animated cereal mascots sang doggerel verse to Abigail, begging her to convince her mother to choose their variety of technicolor breakfast starch.\n Sorrel meant for Abigail to get plenty of sleep, to be well-adjusted and happy when she started her Technical Track prekindergarten classes. Yet she woke her up three nights out of four, slipping into her big-girl bed beneath the purple-and-green comforter, shuddering silently with tears that Abigail could not be allowed to hear, but which she certainly must have been able to feel.\n “Go back to sleep, baby,” Sorrel begged, every night. “I’m sorry. I’m sorry.”\n The nights that she didn’t wake Abigail up were the ones that came at the end of the days when she met her Developmental Unit lead, singly or in groups with her future cohort. It was important that she spend time with the unit lead, a smiling Thai woman with a kindergarten teacher’s affect and an out-miner’s rangy stature. Adjusting to other adults and to her peer group would ensure an orderly, nontraumatic transition, the Braxos parent handbook informed Sorrel.\n Together, the cohort played what looked to them like games, activities that taught them how to work in teams, how to trust their intuition and each other. The unit lead was generous with praise and rewards alike. Abigail would come home from these meetings with her sweater covered in colorful stickers and explain each one’s provenance to Sorrel over dinner. On those nights, Sorrel’s body was too heavy to lift from her bed.\n The rest of the time, though, when she fumbled her way half-awake into Abigail’s room and roused her from her well-earned sleep, she wrapped herself around a single hard-edged solace: the knowledge that a good mother wouldn’t put her own emotional needs above those of her small child, that she wouldn’t wake a little girl and leave her sleepless and frightened. So a good mother was something Abigail could never have snatched away from her.\n Sorrel knew she could never let the Braxos rep take Abigail away. She made spreadsheet after spreadsheet, trying to find a way to pay back what she had been given, not so much crunching numbers as being crushed by them. She pored over the contract, asked on law advice forums, but found no gap in the net of legalisms wide enough for even a bony five year old to slip through.\n She could never let it happen. She could never. She could not be standing on the apartment complex stairs on Abigail’s cake-less, unsung fifth birthday watching the unit lead, the medical technician, and the legal representative load Abigail’s things, load Abigail, into the company DriveLess car.\n The unit lead came back last, to shake Sorrel’s limp hand. “Don’t worry,” she told Sorrel, her voice as firm as her grip. “She will be loved.” She turned to look at Abigail, whose perplexed, nervous, excited face was just visible through the tinted window. “We have a very dedicated training staff.”\n Sorrel didn’t cry when the car drove off, and Abigail didn’t look back.\n Sorrel wouldn’t have driven all the way out to the Braxos Development Complex outside Baltimore if she’d known the Abbey M. listed on the dark web registry she’d found was the wrong one. Or maybe she would have after all. She had no other leads, no more ideas. Nowhere else to go. Someone’s Abbey M. was better than no Abbey M. whatsoever.\n Either way, when Sorrel shook the facility fence outside Newark and screamed her name, no one answered except the company’s private police. After letting her cool off overnight, they sent her home with the bill for an Overnight Security Stay. Along with the bill, there were some QR codes keyed to suggestions on how she might cover the costs.\n One of those codes pulled up Braxos’ star-studded logo. Braxos, the site said, its colors hideously familiar. Our Future and Yours, Hand in Hand.\n She had enough of Braxos’ money already. She never wanted to see another nickel. She paid the fine with what was left of her last payout and closed the associated account.\n Sorrel went to the interview with a tidy CV printed expensively on real paper, armed with preloaded answers to questions and an air of projected confidence for a field she’d never worked in before. Instead, she found herself spilling her every secret to the interviewer, a woman a little younger than herself in an otherwise nice suit with an old coffee stain on one sleeve. She knew, she knew, she couldn’t change what had happened, couldn’t undo her signature on the contract, couldn’t reclaim what had been surrendered. It had been legal. But it hadn’t been right.\n The interviewer put a box of tissues on the desk between them. “There are a lot of us with similar stories,” she said.\n Sorrel blew her nose. “Did you—?”\n “A nephew,” said the interviewer.\n They sat together, kneading the silence, making it elastic, making it strong. Making something that would rise.\n Sorrel went after the Future Career Training and Advocacy Act with both hands, tearing at it with every weapon she could find: every fundraised dollar origami-bent into blades, every legal precedent and obscure statute fired like bullets into the belly of the behemoth.\n In her entire life, there had been so few things that she’d really wanted, really striven for. It had never seemed worth reaching for things, when they had all been set so far above her. A lifetime’s worth of unspent aspiration and ardor now poured out of her and into her work. She wasn’t fighting alone, either. The organization she worked for had siblings all over the country, more people like her, or people who understood her, a chorus of voices shouting down the clarion call of this idea.\n Thousands of people. Millions of dollars. A year of work. Five. A decade.\n It still wasn’t enough. It still only scratched the surface.\n But a scratch can be big enough for the cold to get into and break the whole thing open.\n When the Miners’ Union spokespeople made landfall on Earth to negotiate their terms for the release of Braxos company property and their own emancipation, Sorrel was supposed to be on the other side of the planet, filling out documentation for the class action lawsuit. But without her asking, her supervisor quietly swapped a few assignments, and so Sorrel found herself as one of the nonprofit’s representatives at the introductory summit.\n The miners stood out in the sea of black suits and skirts. They wore company work suits, emerald green or sapphire blue depending on which project they’d been tagged to, the name BRAXOS defiantly blazoned down each sleeve between the clasps of their exoskeletons. Sorrel avoided them, for the most part, afraid to look too long into their hunger and hurt.\n Not all of them responded in kind. One young woman took up a low orbit around Sorrel, falling closer with each passing cycle. Sorrel looked her over from the corners of her eyes, past the sides of her Pocket as she nudged key notes and legal references to the nonprofit’s lead representative. Seventeen or eighteen (the right age); black hair shorn short (the right color); eyes like brown bruises in her face (right and wrong all at once). During a break, her orbital integrity collapsed entirely; she stopped in front of Sorrel’s seat on her way back from the coffee machine, a paper cup in either hand. “Was I yours?” she asked: a challenge, a rebuke. A wish.\n Maybe it was wishful thinking to recognize any of Abigail in the curl of close-cropped hair behind one ear; maybe it was self-punishment to look into this stern, stubborn face and see a round-cheeked little girl’s smile. “No,” she said, and it was the truth either way. “Maybe I gave birth to you. I don’t know. But I don’t have the right to call you mine either way.”\n The young woman’s bruised eyes did not soften. She did not reach for Sorrel’s hand. Her exoskeleton whined faintly when she set one of the coffee cups in front of Sorrel.\n She did not walk away.\n Steam rose from the surface and bled away to nothing in the cool dry meeting room air. Sorrel took a deep breath and spoke slowly, stuttering, but doling out every word carefully, to say exactly what she meant, to say it all and leave nothing behind or forgotten or overlooked.\n Aimee Ogden is a former software tester and science teacher; now she writes stories about sad astronauts and space mermaids. Her debut novella “Sun-Daughters, Sea-Daughters” is a 2021 Nebula finalist, and her short fiction has appeared in publications such as Lightspeed, Analog, and Beneath Ceaseless Skies, as well as previously in Clarkesworld. She also co-edits Translunar Travelers Lounge, a magazine of fun and optimistic speculative fiction."}