{"fingerprint": "10jl0WjVo5AEgzleEoEPhLm3BT4=", "sitename": "Clarkesworld Magazine", "title": "Company Town by Aimee Ogden", "author": "Aimee Ogden", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ogden_06_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Company Town by Aimee Ogden", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5930 words, short story\nCompany Town\nThe company alarm sends Cass flailing out of bed with its first chime. If she lingers under the blankets, she’ll disturb Maya: if she doesn’t get up before the second alarm, the volume ratchets up to eighty decibels, and the smart thermostat will crank up the furnace to make the bedroom unpleasantly hot. She’s not fully awake, though, until a blast of arctic air hits her in the face. Autopilot has carried her as far as the freezer; she gropes behind the ice maker until she finds the box of Veg-e-Saus; the last one. “Alexa, add veggie sausages to the shopping list. Oh, and run the dishwasher.”\n“Veggie sausages added,” chirps Alexa, in her oh-so-punchable voice. “The dishwasher is offline.”\nA little yellow light blinks on the dishwasher control panel. NETWORK CONNECT ERROR, the readout insists. Without a connection, Cass can’t run it, which means confronting the barricade of last night’s dishes in the sink . . . later. For now, she opens the window over the sink to let some of the pleasant, dry morning air into the house. She and Maya are trying to save some Prime, right now, socking away a bit of savings. Running the AC below the company set point incurs a steep surcharge this time of year.\nFour Veg-E-Saus clink onto a clean (albeit damp) plate; they slide around manically until Cass deposits them in the oven. Over the workaday buzz of microwave radiation, there’s a squeak of cheap floorboards. Maya shuffles out of the bedroom and into the kitchen.\nSomehow she’s managed to get herself into her armor without making a sound: the intricate shoulder guards and breastplate, the winged helm. Cass takes a quick glance around, to make sure the curtains are all closed—yes, Maya’s secret is safe for another morning.\nMaya’s sword hangs at her side, the purple crystal blade dark in its scabbard until her thumb strokes the hilt. A violet glow illuminates the kitchen and brusquely fades. No doubt there are places more deserving of its literally otherworldly illumination.\n“I had the dream,” she says guiltily. Guiltily but without an ounce of apology. “The Lord Revelator has raised an army of the undead, and—”\n“You just got back from Modiru.”\n“You know time passes differently there. They need me.” Maya breaks away from Cass’ frown to buckle her sword-belt around her hips. “Hopefully I won’t be gone long.”\nLong is an empty word, all meaning long since whittled away. Maya has been gone for minutes, and she’s been gone for days. Once, she left during dinner and came home just as Cass was brushing her teeth for bed. Those two hours—just two hours—carved new scars into Maya’s hands and arms and frosted her hair with gray. The gray faded overnight, while a restless Cass watched her sleep. The scars have stayed.\nCass opens the fridge and takes out the iced coffee, and then, just to have something to do, just to keep the door between her and Maya, she takes out an apple and the butter and the bag of English muffins and paws at the wall of yogurts like there’s something she can’t find. The work stoppage is in three days, and she can’t say that out loud. Not just because the Alexa is on the counter, always listening—though yes, also, very much that. But also, she can’t slap Maya in the face like that, right before she leaves. “ . . . Hopefully not.” At least they can talk about Modiru without triggering a keyword watchlist somewhere.\nGently, Maya closes the fridge, and Cass lets her. I’ll be back in time, Maya doesn’t say. I know how much this matters. When she leans in for a kiss, Cass tips her chin forward to meet her. Cass’ lips are still gummy with sleep; they brush against Maya’s and stick for a moment, without softening, before she brushes past. A sitcom-style peck, playacted without an audience. Or a laugh track, but there’s nothing to smile about here. Cass slams the button to open the microwave. “I made sausage. Eat something before you go.”\nMaya fishes a Veg-E-Saus out of its greasy puddle and retreats toward the bedroom. “Thanks. I love you.”\n“Love you too.” That, at least, feels real. Just not as real as an army of the undead, or a tenuous goblin-sprite alliance, or a magic word that can cut between realities. Cass hacks a chunk off one of the remaining Veg-E-Saus with her fork, turning her back on the flash of amethyst that pours through the bedroom door. The portal unravels as quickly as it formed, and Cass hasn’t gotten any farther than salvaging the fake meat into a dozen tiny pieces by the time the shower turns on. She throws the whole plate in the sink to make a run for her five-minute hot water allowance.\nTheir house is on the outskirts of Assiduity—it’s quieter out here, away from the company crèche and the grocery depot and the Smile District, of course, but more importantly, it’s in the part of town with tiny yards and neck-high fences where nobody talks to their neighbors. It’s more than they can really afford if they’re trying to save up some Prime. But it means no one asks questions about Maya’s comings and goings.\nCass used to ride her bike to work to save Prime, too, but someone broke the lock and took it off the porch last month. The neighborhood OrdeRing cams didn’t capture any footage that they could use to identify the thief, and when Cass sent a complaint to the OrdeRing contact email, the autoresponder apologized and offered her fifteen percent off the price of any company-sold bike. Now some of their theoretical Prime savings are directed to a new bike fund.\nIn the meantime, she Loops in to work. The nearest station is two streets over; the Loop is just pulling up as Cass rounds the corner. She vaults over the residential delivery bots offloading from the Loop’s undercarriage and boards just ahead of the closing doors. A soft ping lets her know that her fob has been successfully debited for the fare.\nAt the last stop before the Fresh District, a returning delivery drone jams in the Loop intake port. The interior lights turn off. “This Loop route is undergoing maintenance. Please disembark immediately.”\nCass runs the rest of the way to Fresh and still crashes through the cafeteria’s employee entrance six minutes late. “Sorry, sorry,” she mutters as she ties on her apron and tucks her hair up inside her cap. The clock-in bot is immune to her apologies and gives her only three and a half stars for her start-of-shift eval: one deducted for tardiness, the other half for a smudge on her apron that didn’t wash out.\nCass’ station is between Liz and Paolo, who have already assembled and boxed a small stack of meals: Liz filling reheated and pre-prepped omelet patties, Paolo stacking breakfast sandwiches. Cass jerks a nod at them, and they respond in kind, not quite meeting her eye. They have every reason to be nervous—planning any kind of anti-company demonstration is a firing offense in the code of conduct—but this is ridiculous. If OrdeRing flags the interaction as suspicious enough to tag a manager, Cass has a lie locked and loaded. Boss, I think someone in Fresh is tanking everyone else’s ratings with one-bombs to try to hit the bestprepper bonus. Maybe it’s even true; Cass can pack a salad in thirty-four seconds, but she hasn’t made bestprepper in three months.\nAnd she starts in on salads right away, to get ahead of the lunch rush. Garden salads, first. Iceberg lettuce, shredded carrot, presliced egg, a single cross section of red onion, a plastic bag of croutons—all of it allocated into a biodegradable carton and sealed with one of Cass’ workID stickers. It would be monotonous, if she didn’t have to keep moving so fast. When her break alarm pings in her ear, she startles. She’s been making salads for four hours without noticing the time go by—it’s nice when that happens, when the rut ground down through the middle of her life widens enough to crush away boredom and doubt and sadness. It’s awful when that happens, too. There’s no time to think, and that’s probably at least as much the point as “efficiency.”\nPaolo’s break overlaps with hers by five minutes. When she’s done gulping from her water bottle and fumbling in her bag for the River Bar she brought, he’s waiting with a lopsided smile. “How’s Maya?”\n“Fine. Tired.” Their official line is that Maya has a chronic illness. That fits with her remote work position (sometimes very remote) and most people aren’t rude enough to ask for details. Lying to the company comes naturally to Cass but lying to friends grinds against her every instinct. Still, she keeps a mental spreadsheet of symptoms, medications, and prognoses to use against any sort of snoopiness emergency. “I don’t think she’s gonna be able to come out with us tonight, though.”\n“That sucks,” says Paolo, but he leaves it at that. They eat their River Bars together in peace.\nAt ten, salads start deploying to customers. On her own lunch break, Cass calls up her prep ratings. Mostly fives, thankfully, but someone gave her a two because their hardboiled egg wasn’t sliced all the way through.\nCass’ eyes burn. A rating like that means someone is having a bad day, and that they decided the best way to deal with it was to make sure someone else had a bad day too. At her last job, before she took the bonus to move to Assiduity, she collected used cafeteria trays for the sanitizing station. She’d find wadded napkins, ketchup fingerpaint; sometimes people would smear honey on a tray and press a glass of ice water into it.\nShe’s been off the bestprepper board all week anyway. It doesn’t matter. It shouldn’t, anyway. And soon, it won’t. There are smarter people than her, organizing where the company can’t see them. If the action spreads wide enough, if they can shut Assiduity down for three days, four, a week even, the losses will rack up. Eat shareholder value, motherfuckers.\nThe timer dings; Cass’ lunch quarter is over. She puts away her phone and washes her hands and pulls out a bin of diced melon to start assembling afternoon snackpacks.\nIn the after-work dark, Cass goes out for a beer. Not to the Smile District, where there’s a vice upcharge on all the booze, and all the bars are playing the same fifty most popular licensed music tracks. Instead, she jumps off the Loop on a residential street and turns up her coat collar to hide her face from the camera. At the door of an apartment building, she covers the Ring with her palm too, before buzzing to be let in. Through the doorstep, an aggressive bass line hammers the soles of her feet. No one asks her name before the door pops open to admit her. She slams it shut behind her to keep the screaming auralcore house music off the street.\nBlackout curtains hang in each window, but the hallways are lit with pulsing electric blue and green. Some of the doorways stand open, revealing coolers heaped with melting ice and cans of out-of-company beer. Others invite entry, to join clusters of dancers. One is just far enough ajar for Cass to catch a glimpse of a man and woman: her face cramped in concentration where it presses against the wall; his bare ass clenching each time he thrusts. It’s more privacy than the hallway, at least.\nThis party is a million code-of-conduct violations neatly boxed up in a single package: alcohol service outside the Smile District, distribution of non-company product, unpaid vice fees, unlicensed music, probably a banned substance or two on the higher floors. The company higher-ups have to be aware that this kind of thing goes on, but it’s not worth their time to bother unless they get complaints. Maybe an angry neighbor will ping a supervisor, maybe not; if the party gets broken up, all the partygoers will have a fine taken off their Prime. OrdeRing might increase drone activity around the apartment complex, too. Everyone will complain, and it’ll be hard to take the Prime hit, but that’s the worst that’ll happen.\nThat’s why illicit activities are the best cover for other, more illicit activities.\nCass chooses a dance room at random, one that’s pitch-black but for the glinting lights of the appliances. Her hips rub against someone’s ass on one side, someone’s dick on the other, before she presses past to take up space among the gyrating, sweaty bodies. The house music is loud, and the current track trips and skips out of the bootleg speakers, too fast for Cass’ dizzy heartbeat to keep up. She dances anyway, swaying her shoulders, thrusting her pelvis. Her entire body aches, knees and ankles and back, from a day at the prep table, but all that ebbs as she freefalls into the rhythm. She used to go out dancing more; she and Maya both. Now she only comes out if there’s a good reason. She’s going to feel it tomorrow, but that’s Tomorrow Cass’ problem.\nBeneath the strobing purple lights, unfamiliar hands close on Cass’ hips, and a warm body presses against her back. Even knowing what’s coming, she tenses. “Noon,” says a voice she doesn’t recognize, right by her ear. Their two bodies sway in time. Sweat trickles between Cass’ shoulder blades. “You’re assigned to Gise Street depot. Warehouse ops break in the doors. Other divisions provide support, close ranks, and hold off K9 units while W-O’s occupy the floor.” Then they peel away, and Cass stumbles, losing the rhythm of the song.\nShe sticks around a little while after that, doing her part in turn: whispering Gise Street depot and close ranks and occupy the floor beneath curtains of hair and against stubbled cheeks. Three more days. Three more days. Flowery hair spray and grassy body spray fill her mouth when she breathes, and she sits in the hallway to crack a can of someone else’s beer to wash away one artificial taste with another. A deep satisfaction rises upward from her belly, and it’s definitely not from the beer. It felt good to move, cracking off the grime of the long workday. She misses Maya, watching her dance, eyes closed, the weight of two worlds forgotten for the spell of a song. Besides, loud music keeps people from asking the kinds of questions for which she and Cass might improvise mismatched answers.\nMaybe after the strike, they’ll go out again together. Cass presses into the wall with her back and shoves herself to her feet. Maybe after Maya comes home.\nCass waits up a while, after she stumbles into their house. Just in case. To pass the time, she browses shoe inserts on the company catalog—it makes her feel old as shit, but she’s got what feels like plantar fasciitis in her left heel. Foot discomfort overrules emotional discomfort, in the end.\nOn a whim, she clicks the button to convert Prime to fiat currency: US dollars, Canadian, whatever she wants, or whatever she doesn’t. The numbers feel impossibly heavy, outsized against the tiny pair of neon green gel pads. When the clock rolls around to 2:00 a.m., she gives up on shopping for now. After dry-swallowing two ibuprofen, she collapses in bed and kicks off all the covers.\nShe’s on her feet in the kitchen before she realizes the alarm hasn’t gone off yet. She takes her hand off the refrigerator door and squints at the flashing light where the automatic coffeepot is trying to remind her to fill it with beans and water. That light is out of sync with the one on the dishwasher, and for no good reason that annoys the absolute shit out of her. She gropes toward the cupboard where she keeps the coffee stuff and steps on a hand. Maya’s hand.\n“Maya!” She drops to her knees and cradles Maya’s face. She can’t look away from Maya’s face because if she does, she’ll have to look at all the blood everywhere else. “Maya, speak to me.”\nMaya’s skin is warm and dry. Her eyelids flutter, then commit to opening. She focuses on Cass, one eye at a time, and smiles. “We did it,” she croaks. A film of dried blood clings to her front teeth.\n“You always do.” Cass pulls off the hawk helm and casts it aside; she runs her fingers over Maya’s armor. Cracks spiderweb outward from two clear impact points, but it seems to have held true. It’s Maya’s leg, bare beneath the gym shorts she likes to wear with her armor, where the real damage has been done. Linen bandages wrap her thigh; a broad, dark stain has spread between the layers. When Cass peels them back from the edge to peek at the damage, they stick to Maya’s leg, and Maya’s lips go pale and flat. “How long have you been lying here?”\n“Don’t know. Little while.”\n“You should have hollered! Why didn’t you wake me up?”\nMaya’s glassy eyes take on a new shine. “You’re always so tired, Cassie.”\nWith some effort, and by closing off the part of her heart that clenches with every tight-lipped groan, Cass gets Maya off the floor and into the bathroom. Together, they manage to peel off the gym shorts and T-shirt and sports bra, and then it’s into the tub, with three days’ worth of hot water rations and a brand-new bar of soap. The alarm goes off while she’s slowly peeling the crusted linen away from eight tiny stitches, done neatly, albeit with crude, fraying thread. Goblin handiwork, probably. They’ve got the tiny fingers for the job. And a knack for healing, which is why Maya usually fucking stays with them after a fight. Long enough to mend. Cass doesn’t ask why she came back so quickly this time. Knowing hurts bad enough without having to hear Maya say it.\nShe leaves Maya to bathe while she goes to clean up. There’s a big sticky brown spot on the kitchen tiles; she’ll have to clean the grout later, with a toothbrush, when she has more time. Or maybe she won’t. It’s not like they’re getting their security deposit back either way.\nThe unsheathed sword is on the floor, too, and there’s a nick in the kitchen cabinet where the blade must have caught on its way down. Maybe they can fix that with some putty before they move out. Someday. She stoops to lift the sword. It’s heavier than she expected, and when she holds it aloft, her shoulder burns.\nEven as the hilt warms in her hand, the blade stays dark. Whatever secrets it holds, someone else was chosen to know them. Cass grunts and retrieves the sword belt from the cabinet it got kicked under. The scabbard swallows the murky blade, and Cass chucks the whole thing into the back of their closet. It can stay there, out of sight, until Maya needs it again. Until it needs Maya again.\nWhen she comes back to the bathroom, Maya is still sitting, dripping, on the edge of the tub. Her hair is wet but still dirty, tumbling down her back half in and half out of its braid. “You’re going to be late for work.”\n“I’m not fucking going to work today. I need to take you to Care! If this gets infected—”\n“We have Neosporin in the medicine cabinet.”\n“What? How old is that? It’s got to be expired. If you’re not going to let a unicorn or whatever magic you healthy, then you need someone with a legit medical license to look at you.”\n“It’ll cost Prime, and you need to go to work.”\n“Prime? Who fucking cares about our Prime? Do you think Prime matters more than—”\n“They’ll ask too many questions, Cassie!”\nIt’s the reason she’s been daring Maya to say out loud, and it still strikes her square in the chest. The tang of victory burns its way up her throat, and she sags against the bathroom counter. Maya’s life and health and happiness matter more than Prime, but nothing is allowed to matter more than Modiru. “ . . . I’m going to be late for work.”\nShe throws on clothes, folds a piece of bread in half around a squirt of jelly, and crams her feet into her shoes. When she opens the front door, she pauses a second. The floorboards creak, but Maya doesn’t say anything. Doesn’t ask her to stay.\nCass lets the door bang shut behind her.\nBefore her first break of the morning, Cass has sent out five salads without tomato and used the wrong cheese on another half dozen. Instead of choking down the snackpack she bought with her employee discount, she spends her fifteen minutes crying in a bathroom stall—except she actually spends eighteen minutes, not fifteen, and gets docked the full half-hour of work time.\n“How’s Maya?” whispers Liz when Cass finally returns and puts on a fresh pair of prep table gloves.\nApparently Cass’ efforts to hide her wound-red eyes behind her bangs have been wasted. “Oh, fine,” she says, too brightly. “Pretty tired, but when is she not, you know?”\nLiz and Paolo exchange a glance. Cass counts olives: one, two, three, four, and into the box, press and seal, label, load it into the dispenser, and kiss it goodbye. She texts Maya twice during the day. At ten, she sends: Text back if you’re alive please and receives a thumbs-up emoji in answer. After lunch, she tries again. Let me know if there’s anything you need me to pick up on the way home. That one gets a Read receipt, but no response.\nBy the time Cass Loops home, she’s encased herself in a bright, brittle shell of Normalcy. When she unlocks the front door, Maya is lying on the couch that serves as their living room and dining table. Her eyelids twitch at the sound of the key, but she doesn’t look over.\n“I brought leftover sandwiches from work,” Cass says in the most casual voice she can muster. She gets an extra fifteen percent discount on unsold food, although she’s not allowed to buy the ones she packaged herself. “Do you want chicken salad with barbecue chips or ham and Swiss, also with barbecue chips?”\nMaya doesn’t open her eyes. “Cass.”\nThe weight of her own name is all it takes to crack through her protective armor. Her nose starts running first, then her throat closes around its sudden soreness. She drops the sandwich containers on the counter and slams the bathroom door behind her. On the toilet, hunched over, she chokes on the sobs that claw their way out of her and soaks half a roll of toilet paper. When the tears find their way into her mouth, they taste like old makeup and salt and something hateful—something that needed to be excreted and thrown away.\nWhat returns to her, slowly, isn’t calm, but it’s a good enough substitute. It’s composure, at least; makeshift, but functional. She uncurls from the toilet lid and splashes cold water on her face at the sink. She opens the door and leans into the doorknob, unable to walk out into the kitchen yet. “ . . . Sorry. I’m sorry. For—”\nIt’s the for that catches her up and sets her eyes burning again. She’s not sorry for hating Modiru. She’s not sorry for wishing that portal would never open and rip Maya through it again. She treasures all that not-sorry up and holds it close. “I’m sorry for not being strong enough for you.”\n“That’s not . . . ” Maya pushes up on her elbows. “Do you think that’s what bothers me? That I think you’re weak?”\nThey stare at each other until Maya breaks first and lowers herself back down. “I’m sorry too,” she says. “That I let you think that.”\nShe has her own things that she’s not sorry for, of course, and just like Cass, she keeps those for herself alone. But she slides her legs off the couch, carefully, moving slow, and Cass, carefully, moving slow, sits in the warm space beside her. She puts one arm around Maya’s shoulders, and Maya crushes herself against her. All the things they’re not sorry for remain, but not between them; they’ve left no space for that.\nHunger finally pulls them apart. Maya opts for the chicken salad and rolls up her pajama pant-leg to inspect her wound while Cass heaves herself to a stand. “I think it’s looking better. Less puffy and red. I still heal fast, even without unicorn intervention. One of the benefits of the job.”\n“At least one of us has tangible job benefits.” Cass dumps the sandwiches from the cartons onto actual plates (that she’ll have to handwash later, but whatever, it feels somehow both normal and special to not eat off cardboard).\n“Do you . . . want to talk about it?”\n“Will it upset you?”\n“I’m a big girl.” Which means yes, but do it anyway.\nThey’ve been together long enough that Maya speaks Cass’ language. In between bites, she recounts a battle. To her, the story is epic; to Cass, who’s no kind of hero, it’s terrifying: the arrival of the wolf-men of Baros, newly allied to the Lord Revelator’s cause. Goblin forces pinned between the undead and the slavering jaws of the wolf-men. A feint from General Blightwind’s wyverns, barely repelled, and the undead army rallying to finish the job—Maya pauses to wipe barbecue chip crumbles off her sweatshirt—until the centaurs and sprites, united beneath Prince Theodalus’ banner, rode into battle and shattered the Lord Revelator’s forces under their spears.\nAs the battle winds down, Maya pauses, examining her orange-tinted fingertips. “ . . . Do you want to talk about—it?”\nCass glances sidelong at the Alexa on the kitchen counter. Talking about it would relieve some of the pressure in her chest; talking about it might also ensure that it doesn’t happen. “Forward progress,” she says, generically. “Things are moving along. You know.”\nMaya nods. She has carried encrypted codes behind enemy lines, and she knows Cass’ keywords by heart. “Sure,” she says. She touches Cass’ cheek, and for the first time Cass sees the mirror-image of her own fear, each time she watches Maya step through that portal. “Good. Well. Be careful. Okay?”\n“Okay,” she whispers, but what does she have to be careful about? She’s not Maya, leading armies into battle. She’s not an organizer, risking safety and stability and freedom to give hope to thousands of others. She’s Cass. All she does is make salads and wait for someone else to tell her what to do.\nThey have just two days to fall into the rut of routine. Gears clicking together, a clockwork set of motions to move them through their schedule. Wake, eat, work, eat, rest. Cass has gotten pretty fucking good at not thinking too much, considering that’s how she spends ten hours a day at her prep table six times a week. The comfort of routine liberates her from having to think too much about any of it: about the unnatural speed with which Maya’s wounds heal, about the fights they’ve had, and the ones they refuse to. About the work stoppage. About being the girlfriend that is worried about and not the girlfriend that worries.\nIt’s only in the dark of the night that she has too much time and too much quiet to keep the thoughts of her head. She’s had to come to grips time and again with the fact that she’s not the only one who’s chosen Maya, and that one of these days, she might lose her to that other. Maya’s just now having the thought that she might lose Cass first.\n“Maya,” she says, in the 2:00 a.m. dark. It’s the night before the work stoppage, and her lips move against Maya’s cool, salt-smelling neck. “I . . . ” She can’t get any farther past a pang of guilt.\nBut Maya isn’t asleep. She rolls toward Cass and fumbles her hand inside Cass’ shirt. Her palm slides up Cass’ ribs, and Cass pushes up onto her elbow to find Maya’s mouths with her own. Their lips cling together as Maya slides her good leg between Cass’. It’s too dark to see, but Cass stares down into the space where Maya is, as if she could see her, if she just tried hard enough. If she just wanted it badly enough.\nShe wakes up with a start, her hand still in Maya’s boxers, and fumbles her feet onto the floor. She’s groping for the kitchen light switch when she realizes that what’s woken her isn’t the morning alarm; it’s the town alert system blasting at top volume from the Alexa . . . and outside the windows as well.\n“—to remain in your houses today,” a robotic corporate voice announces, with a discordant calm. “Do not leave for work, food, or recreation. Anyone discovered breaking curfew, whether employee, guest, minor, or other uncategorized resident, will be taken into custody. This curfew will be in effect from dawn on April 15 until dawn on April 16. All residents of Assiduity are directed to remain in their houses today. Do not leave—”\n“Fuck!” Cass cracks the front door to peer out. A pair of K9s patrol the street, their unpleasantly angled robot legs tip-tapping at a jaunty pace. Their glassy eyes swivel left and right, searching. “Fuck fucking fuck.”\nAll the care they’ve taken, all the steps to avoid the company’s notice, and management still got tipped off. Someone must have squealed, probably hoping for a big fat financial pat on the head from their higher-ups. If Cass ever finds out who—and she knows she won’t, but if—she’ll kick their ass so hard that future astronauts will discover frozen rectal fragments on the fucking moon.\nOr maybe there wasn’t a rat at all. It’s not like she’s ever met an organizer, face-to-face. That’s the whole point of the system they’ve devised, after all. Maybe this was a company op from the start: plan a fake strike, kneecap it before it even starts. Cost all the employees in the city a day’s Prime and make them question how much it’s really worth it, to cause this kind of trouble.\nA shuffle of footsteps behind her. It’s Maya, eyes wide and wild, sporting an epic case of bedhead. “Fuck,” Cass repeats. “I didn’t mean to shout. They know about the thing, babe.” The thing. Christ. Even now, instinct keeps her from naming it aloud.\nAnother, deeper instinct unfurls too, and her breath catches. She can see the marks of tears on Maya’s face. “No. No. Don’t say it—”\nMaya pulls her flannel (Cass’ flannel) higher up on her shoulder. “I had the dream,” she says quietly and meets Cass’ eyes.\nOf course she did. Of course. But there’s no anger left in Cass; that’s been purged, or sublimated, last night, into an ache deep enough to scar. She sinks to the arm of the couch; not because she planned to sit there, just because she found it before she found the floor.\n“Why do you always have to go that way?” she asks. Not angrily; there’s anger there, down inside her, but she can’t quite reach it now. It feels like someone else’s. Maybe it always has been. “How come, I don’t know, there’s never a centaur princess wizard popping over here to shoot arrows into the board of directors’ eyeholes? Why can’t you stay? I know not every problem can be solved with a sword, but . . . ”\n“But some can. Yeah.” Maya walks across the room and grasps Cass’ face, her fingernails digging in against the back of Cass’ neck. Her lips are cool on Cass’ forehead. “You’re my hero. I hope you know that.”\nCass doesn’t know anything. She nods dully, which breaks the seal of Maya’s kiss. Maya lets go of her reluctantly and returns to the bedroom. The clatter of armor is a familiar prelude to the electric thrum of the portal—the violet light flashes, then folds in on itself, leaving white aftershocks on Cass’ vision.\nShe stays on the couch until the color comes back to her sight. Being in pajamas still, at this time, goes against the expectations ingrained in her. She shuffles toward the bedroom and stops.\nMaya is gone. The sword is not.\nAbandoned, but not forgotten. She picks it up from the bed, belt and all. It’s still heavy, even sleeping in its scabbard. When she draws it, the blade stays dull and dark, but the hilt feels solid in her hand. When Cass turns the blade, testing its weight, it shows her a glimmer. She almost drops it—but that’s just the dishwasher light and the coffeepot, blinking close enough together that it seems tandem. As long as she doesn’t watch too long, waiting.\nShe peeks between the kitchen curtains. In the other houses, her neighbors’ faces make vague pink-and-brown murals. Some of them surely expected to be at Gise Street today at noon, or one of the other depots, or standing on Loop lines, or downing delivery drones. Everyone’s watching. No one knows what to do.\nCass sure as hell doesn’t. And she doesn’t know if anyone else is going to follow her if she walks outside. She doesn’t know if a sword this size could take the head off a K9 or bust down a depot door. She doesn’t even know what all this is for, anymore. If she walks out that door and starts turning OrdeRing drones into scrap heaps and someone said hey, knock it off, doesn’t she need a list of demands in hand to say, sure, I’ll stop, but first, you’ve gotta—?\nShe knows very little. But she knows how to buckle a belt, even a sword belt, and she knows to jam her feet into shoes before she steps outside. As the K9 heads turn her way, she knows to adjust her grip on the hilt of the sword, getting a feel for its weight. It seems to know, too, its own purpose, and it doesn’t fight her as she brings it to bear.\nFaces move behind the windows. Voices spill into the yards. She doesn’t know how many will join her, but she knows some of them will. The dominoes are trembling, but for now, they remain standing. No one wants to be the first to fall. But someone’s going to be.\nMaybe it’ll be Cass. She steps back into a guard stance, and a shimmer of sunlight travels the length of the blade. Maybe. But not yet.\nThe first K9 charges, gearing up for a takedown; two more hang back, at its sides, to deploy subdual measures. Cass bares her teeth and steps into her swing like some kind of crazed medieval Babe Ruth.\nOf all the things she knows, the truest is this: she is already one person’s hero. And she thinks, maybe, she could be her own, too.\nAimee Ogden is a former software tester and science teacher; now she writes stories about sad astronauts and space mermaids. Her debut novella “Sun-Daughters, Sea-Daughters” is a 2021 Nebula finalist, and her short fiction has appeared in publications such as Lightspeed, Analog, and Beneath Ceaseless Skies, as well as previously in Clarkesworld. She also co-edits Translunar Travelers Lounge, a magazine of fun and optimistic speculative fiction."}