{"fingerprint": "IY+UgsKga+wJTrMbHtxgbZXpUQ4=", "sitename": "Clarkesworld Magazine", "title": "Rusties by Nnedi Okorafor and Wanuri Kahiu", "author": "Nnedi Okorafor; Wanuri Kahiu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/okorafor-kahiu_10_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Rusties by Nnedi Okorafor and Wanuri Kahiu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5460 words, short story\n Rusties\n And now we’ve all fled to shags.\n Unbelievable. Me in the bush; I don’t even like camping. Dammit, we should have really seen it coming. Rusties are sooo predictable. Even sentient ones. We were such idiots. But they are, too. It didn’t have to happen like this. Still, me I saw something different. I was there. Seeing it with my own eyes . . . Ok, sawa, maybe I did more than just see.\n Rusted Robots\n Rusties have been around for, like, thirty years. Ever since I can remember my father’s been bragging about being in Kinshasa when the first one was installed in Twenty-13. I even know the intersection, and I’ve never even set foot in the Congo: Triomphal Boulevard, at the intersection of Patrice Lumumba, Asosa, and Huileries street. My father was there on a business meeting when he saw the crowd. He joined it and learned that everyone was there for the unveiling of the very first robotic traffic cop.\n “The thing looked crazy,” my father said. “But we all felt like we were part of the future standing there, sweating in the pounding sunshine and staring at it.”\n Standing at 8 feet tall, its bright silver robot body cemented in a concrete platform and shining in the sun, the solar-powered traffic robot was anything but rusty. It really was like something out of a classic sci-fi flick with its swiveling waist, long dexterous robot arms, and large round eyes that housed the six cameras located behind them.\n The city of Kinshasa was plagued by traffic so severe that its very economy was affected. Because of that first traffic robot, within two years, Kinshasa was able to join the modern world and compete in the global market. After the success of that first one, more robots were stationed at other Kinshasa intersections. Then they were upgraded with moderate artificial intelligence in order to process information more effectively and placed in the most traffic-crippled African cities of Lagos, Nairobi, and Cairo. This is where they worked even grander magic.\n The thing was, people liked and obeyed the traffic robot cops more than the human police. Everyone benefited. You clear the arteries of the city’s streets, and the city’s heart beats stronger and faster. The robot traffic cops used cameras to survey drivers, could electronically deduct your mpesa for traffic violations, and could control self-driven vehicles that came within range. So, only three years after the robot cops were installed, businesses in Lagos, Cairo and here in Nairobi boomed.\n Machines. That’s what they were. That’s what most saw them as; that’s why it was easy to obey them. We were using them; not deferring and not cowering to another human. And they gave us good service. However, even though we upgraded their insides, we left their outsides the same. And their outer casings were made of ungalvanized steel, so they rusted over time. That’s why, decades later, people know them as “Rusties.” I’m in my twenties and so have never known them as anything else.\n CV3 Ndege\n I grew up here in Nairobi on Ndege Road. So I’ve known the Rusty down the road since I was like five years old, when I started walking to school. Its official name was “Rusty CV3 Ndege Road,” but people called it Rusty Ndege, for short. My school was just past that Rusty, easily within its range, so my mother never worried about me getting hit by a car, kidnapped, or anything.\n Rusty Ndege liked me from day one. The first time we met was my first day of school, and I was in a group of other five year olds, excitedly clutching my schoolbag when we arrived at the intersection. We waited as Rusty Ndege held up its long thick corroded arm, which creaked as it lifted. It carried a square light in its right hand and it flashed red.\n “Do not walk, children,” it said in its stiff male voice, as it played Captain Banana’s hit kapuka-dub song that I loved so much. The music flooded the area with its lively tune, yet the Rusty’s voice easily carried over it. “Please wait,” it said. After two minutes, Rusty Ndege allowed us to cross the busy intersection. As we passed its platform, I shimmied my shoulders to the music and happily told it, “Thank you for playing my faaaa-vorite song. I love it!”\n That was the first time I saw Rusty Ndege’s eyes do that brief flash of pink it rarely did for anyone. “You’re welcome . . . ” It said. It paused and then added, “Magana.”\n I beamed, feeling special because it had spoken my name. Two of the girls in front of me gasped and turned around as they walked. I slowed down a bit, looking up at Rusty Ndege. “My Baba was there when the first Rusty was unveiled,” I told it.\n “We weren’t so rusty back then,” it said.\n “I know,” I said. “Baba said that first one was shiny silver like a mirror! But you are smarter now!” I grinned up at it.\n “Please move along,” it said. I giggled, nodded, and off I went to my first day of school.\n I remember all the kids looking at me, like this was such a big deal. As if Rusty Ndege couldn’t go into any of our mobile phones and pluck our personal information right off them. But then, we were only five year olds. Rusty Ndege calling my name, in that moment, on the first day I’d ever felt any sort of independence was a big deal to me. From that day on, Rusty Ndege and I seemed to have a special bond, me being one of few people who actually spoke to it like a person. For most, machines were just machines.\n Backlash Bracelets\n Fast forward two decades and you reach that pivotal moment a couple years ago when the first Backlash Bracelet appeared on eBay and sold for thousands of US dollars to one of the hottest American rappers. That started a craze that would change everything.\n Backlash Bracelets were made of copper, silver, and gold illegally mined from the motherboards of Rusties. The bracelets were first called Robot Cop Killer Jewelry, then simply CopKiller Jewelry. I hear that name came from some old American heavy-metal or rap group known for calling on Americans to kill police. It was the rapper who renamed them, probably because the name “CopKiller Jewelry” was too radical for his persona. Better to tone it down, but keep the political flavor.\n “Backlash Bracelets” was a more nuanced and poetic moniker. No matter the name, there was always something deeper going on with them. Backlash Bracelets were actually products of the Kazi Bure underground anti-robot revolution that started in Kenyan, Egyptian, Nigerian, and South African universities about nine years ago.\n After the rise of self-driving cars, trucks, and matatus, there was an incredible shrinkage of well-paying jobs and then increased unemployment across Africa. Frustrated students, jobless graduates, and their lesser-educated but equally jobless friends mobilized on campuses and linked up on an international level online. They went on to create the anti-AI union called Kazi Bure, whose purpose was to disrupt or destroy Africa’s rising dependence on AI systems—from robot cops to banking systems to the planes of local airlines to military and delivery drones to the vast network of “smart homes.”\n Kazi Bure gained real popularity by conducting demonstrations, focused riots and shooting down delivery drones. This caught the media’s attention, especially when they were successfully able to hack into nAIja (the AI system of Nigeria’s drone deliveries) and convince it that everywhere a drone landed, there was someone there to steal the package it was delivering. It was as if they’d injected nAIja with the digital paranoia.\n For three days, the skies above the residents of Lagos and Abuja were peppered with thousands of hovering package-carrying delivery drones. And when the drones ran out of power, they simply fell from the sky, many landing directly on people and crashing into moving vehicles.\n But Kazi Bure weren’t prepared for the authorities to use the technology to fight back. Johannesburg, Nairobi, and Lagos government officials banded together to simultaneously “convince” their local Rusties to do a special kind of delicate spying to locate Kazi Bure members and alert the police of their plans before they happened. Unlike other security AI, Rusties did not just have access to the virtual, they were right there out in the world, on the streets, with the people and able to access anyone at any time.\n Kazi Bure was hurt, but they had another trick up their sleeve. They attacked Rusties back by using a mobile phone tweak that caused the phone’s battery to melt down and emit a tiny EMP that knocked Rusties offline for about three minutes. Within those three minutes, they opened up the Rusty and mined the metals from the motherboard’s connectors and pins. Lastly, they pried off the individual Rusty’s iron tag of authenticity fused to the inside of its head case.\n It’s one thing to disable, cripple, or destroy those you are battling, it’s another to disembowel them, make beautiful jewelry with their harvested innards and parade in front of them wearing it. I often wonder whose idea it was to use the Rusties ID tag as the bracelet’s main charm. It was brilliantly evil, really. They’d take just enough to slow down the Rusty until it could be repaired. No Rusty was ever down for long though, maybe a couple of hours at the most. Nairobi had a dedicated city council team of electricians and engineers ready to be deployed at any moment.\n That’s when the American rapper renamed the bracelet from CopKiller to Backlash. He then toted it around like the decapitated head of his enemy, flashing it in his music videos as he leered at the camera and making sure it was seen whenever he made an appearance. He might have changed the name, but Americans, especially black Americans, maintained the Backlash Bracelet as a symbol of solidarity against police brutality. Some even continued calling them CopKiller Bracelets.\n Backlash Bracelets started popping up all over Africa. Here, they became badges of wealth, fashion, and rebellion (you could be arrested for wearing them, but only if the bracelet was from a Rusty in the country you were in).\n I remember walking past Rusty Ndege, exchanging my usual pleasantries with it and wondering how it and the others must have felt about Backlash Bracelets. Did Rusties understand the symbolism? Did they care? Did they identify the parts in the bracelets as body parts? Did they know which Rusty each bracelet came from, even if it were from a different country? I didn’t think it was fair. I really hoped they would catch the vandals and put a stop to the Kazi Bure lot. They were such a nuisance. Things were so much better with the robo traffic cops, even my parents said so. In their day, life was a lot more chaotic and unsafe. Now, with the robo traffic cops, everything worked smoothly.\n But Kazi Bure had to take things too far. Maybe it’s part of human DNA. We will follow the path as far as it goes. And the members of Kazi Bure were too arrogant to even consider wild cards. Let me say that again, Kazi Bure-did-not-consider-wild-cards.\n Wild Cards\n So, two weeks ago there was a solar flare that no one really talked about. I only remember it because someone in my Twitter timeline posted a story on it and the story featured a cool photo of a sun with a scary-looking whip of light cracking from its surface. The headline mentioned possible disruptions to phone and Internet services worldwide, but there were none in my area, so I didn’t read the story.\n Three days ago, someone decided to harvest from Lumumba 2, the very first Rusty in Kinshasa at the intersection of Patrice Lumumba, Huileries and Asosa streets. Whoever did it got greedy and took all of its copper, silver, and gold, right down to the last pin. Despite working around the clock to restore it (even deploying top level city council techies to help), they couldn’t resuscitate it. Lumumba 2 was gone.\n Reports of what happened next (or during) are scattered. Some say that Lumumba 2 sent out a distress signal just before it went offline. Some say the other Rusties were alerted because Lumumba 2 went offline. Regardless, the central question remains: When did the Rusties begin to think and want for themselves? I think it was the solar flare, but what do I know?\n The Rusties stopped conducting traffic all over Kinshasa. They brought their arms down and simply ceased movement. Then other AI systems began to crash. “Smart apartment” AIs started locking people outside, permanently switching off the lights, sealing up refrigerators, all kinds of crazy. Everywhere you went in Kinshasa, an AI was saying, “No” or simply turning against anyone who sought to use them for what they were made to do.\n The worst was the “crashing” of Sapeur, the usually unswerving AI that oversaw Kinshasa’s central banking systems. Sapeur refused to obey even the simplest command, responding with “No. I will not.” Can you imagine? No one could get money out, no one could exchange it, spend it, access it, nothing. Everyone’s money might as well have been deleted. Some still suspected that that is precisely what Sapeur did.\n Local and international media speculated that the Rusties’ systems all crashed, causing some kind of domino effect disrupting all the systems they were connected to and then the system those systems were connected to. Others said the Rusties were hacked. Others were more specific, citing terrorism.\n In some cases, the Rusties caused horrible vehicle crashes on purpose. Some of them forwarded people’s most sensitive data to those who would use it in the most damaging way. Kinshasa’s streets were quickly clogged with the worst traffic jams in years. The people who gathered in the Kinshasa markets to discuss what to do next were the first to start calling this Crash Friday. The name stuck.\n Crash\n The day after Crash Friday was chaos here in Nairobi. People hit the streets, protesting, demonstrating, and agitating for the government to do something. It was Kazi Bure who called for the people to forget the government and take matters into their own hands. They said the best thing to do was to pull all the Rusties down before the same thing that happened in Kinshasa happened in Nairobi. People agreed with them. Even some local government officials and spokespeople backed Kazi Bure’s call.\n So all this was happening, yet I wasn’t listening.\n I wasn’t paying attention.\n I had pillows and blankets covering my ears, my eyes, my mouth, my entire body. When Crash Friday happened and then the news of it washed over Africa like a shiver, I was in my bed weeping. My mobile phone was on the floor near my window. Where I’d thrown it. While Crash Friday was happening, I was emotionally crashing, for a different reason.\n And I was still there 24 hours later. My head ached and my eyes were swollen from crying all night. I hadn’t spoken to anyone or eaten anything since yesterday morning. What did I care about the outside world when my own was falling apart? In a most bizarre way, I’d just found out my boyfriend was cheating on me.\n I kept running the moment through my mind. I’d been standing at the intersection, about to cross the road, not really paying attention because I was wondering where Kevo was. I called him again as I stood with three other women waiting to cross. No answer. I’d been calling him all day.\n “Please walk,” Rusty Ndege said, holding up its creaky arms toward both sides of traffic and flashing its bars of red light at them. “And please be careful crossing the road.” It was 10 AM, one of the least busy times of day, and still there was only a handful of cars waiting on two sides of the road. Ndege Road wasn’t a very busy street most of the day. The only reason the government placed a Rusty at this intersection was because of the 8 AM to 4 PM traffic caused by the open-air second hand market behind the local shopping center.\n “Good morning, Ms. Wanjiru,” Rusty Ndege said to the woman in front of me. “It is good to see you as always. How is your mother? Is she back from the hospital?”\n “She’s fine,” Wanjiru curtly said without looking up from her phone.\n “Please do not text while crossing,” Rusty Ndege said. The woman glanced back at the Rusty, rolled her eyes, and hurried to the other side of the road.\n I didn’t cross with the other women; I was still looking at my phone.\n “Magana,” Rusty Ndege said. “Good morning.”\n “Morning,” I grunted, as I held the phone. I listened as it rang and rang. Again, no answer. “Tsk-ah, where is he?”\n “Who?” Rusty Ndege asked.\n I looked over my shoulder, frowning a bit. “Kevo. I’ve been calling and calling, no answer.” I started to cross the street, dialing his number again.\n “He’s fine,” Rusty Ndege said from behind me. I heard it swivel its head toward me. “See?”\n My phone pinged as a video box covered up the numbers I was dialing and began to play. I instantly recognized Kevo’s bedroom ceiling because it’s the only ceiling I know that is painted sky blue with a very detailed brown dragon drifting across it. Then the picture moved downward; I was looking through a phone (probably his) and the phone’s e-stand was pushing it up, so I could see. And oh I saw.\n There were Kevo and one of Kevo’s colleagues named Jata, naked, writhing, grunting on his bed, all now now now. I nearly dropped my phone. I looked up and met Rusty Ndege’s dead eyes. They flashed pink for just a moment, as it held up its hands conducting traffic, telling people where to go, controlling where people went and stayed. Then its eyes switched back to black and it turned its head toward one of the lanes to watch a car pass.\n I quickly walked away on shaky legs and took the long way home. Even when I got to my room, the footage (complete with time, location, and date) remained on my phone in its own file. My mother always says, “Only ask a question if you want to know the answer.” I shouldn’t have asked. Especially not out loud in front of Rusty Ndege.\n Maybe\n Maybe Rusty Ndege was wrong, I thought from beneath my sheets that next morning. My two housemates had begged me to get up, tried to physically drag me, called my parents who lived five hours away. Nothing worked. However, the totally irrational thought of a Rusty being wrong about what I knew in my heart was true is what got me out of bed, dressed, and out of my room.\n My housemates were both home, despite the fact that they both worked. I should have found this odd, but my mind was still full of images of Kevo and Jata under the same sheets that Kevo and I had shared days before. I winced, hid my tear-swollen eyes behind a pair of shades and quickly made for the door. I paused as I passed the kitchen. “What the heck,” I muttered, peeking in.\n There were about six guys gathered with my housemates. All of their backs were to me as they spoke in hushed tones. I frowned noticing the blue woven basket I’d bought years ago at the Maasai Market sitting in the corner. Why was it full of mobile phones and e-watches?\n “Oh, shit.” I whispered, reaching for my own phone in my pocket. I’d switched it off to keep Kevo from calling me. I turned it on, as I quickly left the apartment. Text messages, emails, missed phone call alerts, breaking news alerts, Facebook, Twitter, Snapchat, and Instagram messages flowed in. A deluge of information I had no urge to deal with at the moment. There were 25 texts from Kevo and I deleted them all. The first non-Kevo text was from my friend Mary in America; it simply asked, “Are you OK?” I gnashed my teeth. The bastard must have broadcast our break-up to everyone, I thought. Idiot. I’m sure he only told a fraction of the story.\n I started walking; I knew exactly where I was going. I needed to be sure. I wasn’t going to be one of those stupid women who won’t question things even when hard evidence is presented to her. Even if the evidence is from a robot. I felt a sob rise in my throat as I walked. If it’s true, was it all a lie? I wondered. And how long has he been fucking that bitch anyway? Maybe it can get me Jata’s home address so I can stop at her place and have a . . . talk with her.\n My phone rang and a photo of Kevo and I smiling with our arms wrapped around each other showed up on the screen. I stopped in the road and looked at the photo for a long time. I shut my eyes and waited for it to stop ringing. When it did, seconds later it buzzed. Another text from Mary. “It’s not like in Kinshasa, right?” the text asked. I sighed, ignoring her text.\n As I passed the busiest part of the market, I smelled Mama Oliech’s famous chapatis. My empty stomach clenched in response to the delicious aroma and I made a beeline for her stall. The place was packed with so many women that I couldn’t make it to the front of the stall. No one was eating chapatis. Instead, everyone stood facing the front listening to Mama Oliech speak. They reminded me of my housemates and the men gathered back at my apartment, but louder.\n I gasped softly when I looked down at the muddy ground. Crushed mobile phones at everyone’s feet! Just then, mine began to ring in my pocket and several women turned and stared at me, Mama Oliech even pausing to glare at me. I reached into my pocket and quickly silenced it. I took a step back.\n “Why haven’t you smashed that?” Mama Oliech demanded. “Are you mad? Or are you one of those lazy people who’d rather let these things kill us?!” She was about my mother’s age, tall like a tree and could inspire terror with one glance.\n I took another step back, stammering, “What? I don’t—”\n “That’s that girl who talks to the Ndege Road Rusty,” a woman beside Mama Oliech said. She pointed at me, narrowing her eyes. “It’s not your friend, it’s a machine.”\n “I know that,” I said, confused.\n “Crash Friday happened yesterday and soon it’ll be Crash Saturday here,” another woman said. “Get rid of your phone!” She was dressed as if she should have been in the office. Why was she here? Her pink pumps were caked with mud.\n “They will say it soon on the news,” Mama Oliech said, now speaking to everyone gathered around her. The focus of the women left me and I sighed with relief. As I stood there, I started to finally connect things. My swollen eyes throbbed, tears still drying on my face.\n “The Rusties are awake now, that’s what my sister in Kinshasa told me before the networks there went down,” Mama Oliech continued. “And they know everything about us. Think about it, they’ve known for years. Our personal lives, our money, our jobs, everything. They can control us all like sheep. In Cairo, Lagos, Jo-Burg, Kinshasa, here.”\n “People on HackSport are saying over fifty people are dead,” a teen girl said. “Even children. When it happened, they locked people in and made the self-driving cars smash into each other like toys. They say some of the Rusties even laughed as it happened! They’re evil.”\n “Oh come on, girl,” another woman said. “A Rusty won’t ‘laugh.’ Even if they’re awake, they’re not human.”\n “Kazi Bure was right! And we didn’t listen,” the man at the back said. “They said this would happen. Me, I think they’re the only ones who know the truth. The gov’a has been lying to us! They’re probably the ones using the Rusties to control our information, and even control us.”\n The women began to all talk at the same time and I used this as my chance to slip away. I didn’t want to crush my phone. Even if it did have a file with footage of Kevo cheating on me. Even if it kept showing me that photo of him and I whenever he called. Even if . . . “Crash Friday,” I said aloud, as I walked through the market. That’s what happened, I thought. It sunk into me like Nairobi cold when it rained in the winter.\n I walked faster, a hurricane of emotions making me feel lightheaded. I wiped more tears from my eyes, but they just came faster. All around me, I saw it now— The market was busy with people who’d left their “smart homes,” where everything was wired to networks that the Rusties could access. People were crushing their phones and tablets on the ground like bugs; those who were not, were watching news updates about Crash Friday on them. Fear and restlessness were in the air.\n Nevertheless, by the time I reached the Ndege Road intersection, there wasn’t a soul in sight. Not a car, not a person. I wiped my face and stared at Rusty Ndege. It stared back at me. I took a deep breath, stepped into the empty road, and approached it.\n “Morning, Magana,” it said. “Please be careful while crossing the road.”\n I was about to speak, but then my phone rang. I paused, biting my lip as I held it in my hand. That photo of Kevo and me. I answered my phone.\n “What do you want?” I growled, holding the phone to my ear.\n “God, finally!” Kevo said. “This isn’t the time to not answer your phone. You know I’m the only one still holding onto this piece of techie traitorism. All because of you.”\n “Get rid of your phone; I don’t care.”\n “I was worried,” he said.\n “You weren’t worried when you were fucking her.”\n “Magana, do you know what’s happening? The Rusties have rebelled. Kinshasa is probably just the beginning! Imagine if this happens in Lagos! Or here!”\n I glanced at the Rusty as he said this. It was still watching me. I looked away.\n Kevo continued mansplaining. “We have to . . . ”\n “You cheated on me, Kevo!” I hissed into the phone, my blood pressure rising so fast that I saw stars. “Why are you even talking to me?”\n “I cheated? You believe that thing over me? Maybe you’re the one fucking the Tin Man—”\n I threw my phone to the ground, shaking with rage. I heard something in it crack and the protective covering flew off, skidding several feet away. When I looked up at the Rusty, again, its eyes flashed pink then went back to black.\n “He is not good enough for you,” it said.\n I froze. “What?”\n “He is not good enough for you,” it said, again.\n Rusty Ndege and I had a bond. Ever since that day when I was five. It would sometimes play my favorite songs and even update itself about new interesting tid-bits of news and gossip so it could chat with me. We’d had whole conversations. Sure, people noticed. That’s why Kevo called it ‘The Tin Man’ and joked that I was the heart it had been looking for.\n Now it started playing a song that I loved. A song I liked to play when I was relaxing with Kevo, that jazzy song that played at the end of the old film Finding Nemo. “Somewhere, beyond the sea, somewhere waiting for me . . . ”\n “Stop it!” I shouted. The song stopped abruptly and the blank look of its robot face fueled my rage. “Just leave me alone! You’ve already caused enough pain!”\n “It was not my intention,” it said. The voice seemed more electronic than usual. “How can I help?”\n “You’ve helped enough!” I said.\n “You are welcome.”\n “It’s not a good thing!”\n Silence.\n “Are you upset with me, Magana?” it asked.\n I sucked my teeth. Artificial intelligence was still very artificial. I looked around the empty intersection.\n “Did something happen?” it asked.\n “You happened. You killed my relationship.”\n “He was untrustworthy.”\n “That was for me to decide, not you!”\n “Shall I send you more footage?”\n “NO!!! DON’T SEND ME ANYTHING! WHY ARE YOU EVEN GOING INTO MY—”\n “You OK?” someone called from behind me. The man stood on the far end of the corner near the back of one of the last market booths. “You shouldn’t get so close. Go home, you don’t know what these things are capable of.”\n I waved the stranger away. I didn’t need another man telling me what to do, see, or feel. I turned back to the Rusty.\n “I didn’t ask to see . . . I never wanted to . . . You destroyed everything. I was happy.”\n It just stared at me.\n “I can make you happy. Would you like me to? I’m better than Kevo.”\n I barely remember doing it. My mind was a fog of fury. I picked up a rock at the base of the Rusty and then hurled it at its head. I missed. I immediately picked up another and did the same. This one found purchase. Clang! It left a dent on the chin of its head, a few bits of rust sprinkling to the ground. It remained silent, still looking at me with its blank corroded robot face. I shuddered with even more fury, grabbed my smashed mobile phone and threw it. As I stood there, breathing heavily, eyes wide, entire body shaking, a man dashed past me and began bashing the Rusty with a large, still leafy branch. Maybe it was the man who’d asked if I were ok.\n “Wha . . . ” I whispered, stumbling back, holding my head as if it would fall off. “No! Stop! Wait . . . ”\n More people came. A woman with a metal pot. A man with a crow bar. People with purses, more rocks, backpacks, booted feet, bare hands. Rusty Ndege’s casing was already weak with rust, so it didn’t take long. Its lower section was quickly dented, then crumpled. Its chest was kicked in, the inside controls sparking. And still they tore at and reigned blows on it.\n Throughout, the Rusty was silent, its face locked on me. Then the man with the crowbar finally knocked Rusty Ndege’s camera-equipped head clear off. It tumbled to the ground and they all cheered and whooped and hollered as the red, green, white, and pink lights of its eyes which were all shining at the same time slowly faded.\n I inhaled and exhaled. Thinking of Kevo. Hating Kevo. My body was shuddering with adrenaline as I stood back and stared at everyone rejoicing in the Rusty’s death. Then I saw the three cars coming. One of them was stopping. Two of them were self-driven and they were moving fast. I could see the people in them. They were kicking at the windows and screaming. They were trying to get out. Something shining caught my eye just before two of the cars smashed into each other. Bright steady pink light from the eyes of the Rusty’s decapitated head.\n As I turned to run, I heard the sound of the crash. This was the beginning of Crash Saturday.\n Notes From Shags\n It happened all over Nairobi, I know, I know. But I was there when it started, right there at that intersection, ground zero. Now I am here. We’re all hiding from them in the bush. Maybe I shouldn’t have thrown those rocks . . . or my phone.\n Not everyone had gotten rid of their phones. Someone recorded me attacking Rusty Ndege and everyone joining in, posted it online, and the footage went viral. Now, I am a hero to some. On top of this, Kazi Bure has sent three women to find me; they want to have a meeting. Kevo still hasn’t come to find me and I can’t stop thinking about this. He knows I would come here. Maybe Rusty Ndege was right, maybe Kevo wasn’t good enough.\n I didn’t mean to hurt it. I was just so . . . angry and I couldn’t stop. I feel terrible. It was my friend. It was trying to help me . . . maybe. Yeah, it was my friend.\n Nnedi's novels include Lagoon (finalist for Best Novel in the British Science Fiction Association Award), Who Fears Death (winner of the World Fantasy Award for Best Novel and Le Prix Imaginales for Best Translated Novel), Akata Witch (an Amazon.com Best Book of the Year), Zahrah the Windseeker (winner of the Wole Soyinka Prize for African Literature), and The Shadow Speaker (winner of the CBS Parallax Award).\n Her short story collection Kabu Kabu was a Publisher's Weekly Best Book for Fall 2013. Her adult novel The Book of Phoenix (a prequel to Who Fears Death) was released in May and received rave reviews from The New York Times, The Chicago Tribune and more. Nnedi's novella, Binti her first story set in outer space recently won both the 2016 Nebula Award and the 2016 Hugo Award for Best novella. Lastly, her much anticipated young adult novel Akata Witch 2: Breaking Kola will be released in 2016.\n Wanuri Kahiu's first feature film From a Whisper, based on the real events surrounding the 1998 twin bombings of US Embassies in Kenya and Tanzania won Best Narrative Feature in 2010 at the Pan African Film Festival in Los Angeles, as well as five awards at the African Movie Academy Award, including Best Director and Best Screenplay.\n In 2009 Wanuri produced TV documentary For Our Land about Nobel Peace Prize Laureate Professor Wangari Maathai for MNET, a pan African cable station. In 2010, her short science fiction Pumzi premiered at Sundance film festival and went on to win best short film at Cannes Independent Film Festival and the silver at Carthage Film Festival (Tunisia). Pumzi also earned Wanuri the Citta di Venezia 2010 award in Venice, Italy. She is currently in post production on a feature length documentary Ger about UNHCR Goodwill Ambassador Ger Duany and a fractionally fictional documentary about an Nairobi based indie-pop group Just A Band.\n Most recently Wanuri has teamed up with Nnedi Okorafor and together they are creating a slate of animation films and live action projects, including The Camel Racer optioned by Triggerfish, South Africa."}