{"fingerprint": "ofRDTBaoscg8iHgHnoiu6KLhfJk=", "sitename": "Clarkesworld Magazine", "title": "Acid and Stoned Reindeer by Rebecca Ore", "author": "Rebecca Ore", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ore_11_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Acid and Stoned Reindeer by Rebecca Ore", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3380 words, short story\nAcid and Stoned Reindeer\nThe reindeer were stoned. Flat Nan, Ken, Ro, some other girls and boy who’d just discovered sex and I were chasing mammoths off the summer range so the horses could eat in peace and so we’d have some hazel nuts left for the winter. We didn’t hunt mammoths until snow fell which made tracking them like following a herd of Buicks. Mammoths always looked surprised when we found them so I don’t think they were that smart.\nCenturies later, I was at a loft party in New York City, having gone back to see how some people I’d met in 2001 had gotten that way. It was easy to wrangle invitations to parties in the early 1970s if you were a presentable boy, and I’ve always been a presentable boy. The loft was full of painters with real gallery shows, of famous painters’ future, present, and ex wives and boyfriends, of the kinds of people who showed up to be at a party with famous painters, poets, and the various entertainments people who threw loft parties had to offer. Dancers danced. Painters chatted up art critics. Poetry professors chatted up graduate students past, present, and future. And I felt both in place and out of place, remembering parties in places that must have been Rome that felt like this, or which could have been provincial capitals pretending to be as vicious as Rome. Clothes change; bodies and poses don’t. I was maneuvering for the drinks table when someone said, “If you want to try acid, the punch is spiked.”\nIf I was going to get drunk, I was going to be pinned down in time for the duration anyway, just like being sleep, so I might as well try something new. To lock me to the party time, I drank two big glasses of white wine, which was the screw-neck bottled cheap Chablis available at all bohemian party those years. Then I took a drink of the punch. I’d heard about acid, like rye fungus without the fingers dropping off, and I was feeling reckless, which happens when you spend a couple of centuries being really cautious after seeing a lover hanged, and your caution starts to recoil. Stonewall marked the change; New York was full of possibilities those days. The revolution hadn’t quite faded.\nEven before the acid hit, I’d spotted a couple of guys who liked what they saw. And saw one man who’d lost his old lover and who would lose his young lover to AIDS, but this isn’t that kind of story, so we’ve got to move on.\nI knew not to spend too much time with the people who’d wonder why I didn’t recognize them in 2001, so I found a couple of people who I knew would have moved away by then, two women, one also tripping and sitting in a chair while people worried about her which amused her, another one curled up on a sofa talking to someone who wasn’t ever going to be famous. Just when I was wondering if the punch had really been spiked, I remembered . . .\nThe reindeer were stoned. I had a vivid dream while awake, of reindeer eating mushrooms, the ones we’d been told were poisonous to average people, and wandering around, bumping into trees, goosing each other with their antlers, eating the mushrooms, and jumping into the air.\nI was carrying a small pack with flint, fire stone, tinder mushrooms, and some dried meat, and I had a spear and throwing stick with me, but these reindeer were acting so silly, I didn’t have the heart to kill one. The boy we’d traded a sister for said, “They get drunk eating the mushrooms. If you drink their piss, you’ll see visions and can fly and talk to them.”\n“How do you get their piss?” asked Flat Nan, ever practical except when she was trying to get someone to sleep with her despite not having much in the way of breasts.\n“Walk right up to them and ask,” the boy said. He walked right up to one of the reindeer and blew it.\nI had Ro for that. Ro looked back at me, obviously thinking the same thing. Neither of us wanted to eat the mushrooms or the yellow snow.\nAl, who was always his alpha daddy’s son, stabbed one of the reindeer and cut out the bladder and began chasing the girls and squirting the piss into them. I walked over to one of the reindeer and asked it to piss in my lamp. Oddly enough it did. The piss tasted nasty, but I gulped it down and stood there. The reindeer looked at me. I looked at the reindeer.\nAnd back in New York, I was telling someone, “Mushrooms, man, they will get you fucked up almost as good as acid.”\n“Mushrooms will make you sick,” the girl said.\n“Not if you filter them through reindeers,” I said.\n“And you’re going to get reindeers where in New York?” she replied.\nAnd after the drugs took hold, the reindeer and I started chatting, and I started telling someone the story, but in the old language, so he led me into a back bedroom and asked, “Do you have any friends here?”\n“The girl in the swing,” I managed to get out in English. “The chair swing.”\nHe led me back out and put me at her feet. I kept telling the story as I saw it unfolding in my awake dream, but I don’t remember if I managed to get the story all the way up to English or not and I was careful to whisper so I didn’t bother anyone. One girl started crying over in another time, um, place in the party and someone pushed her out in the hall. These were a tough drug people, not as friendly as the reindeer. It was important not to bother anyone.\nI put my arm on the reindeer’s shoulder and said, “Why do you want to get stoned? I’m never going to do this again.” Back in New York, I laughed.\nThe reindeer said, “Look, we’re prey animals. We’re too smart to forget that we’re prey animals, but it’s a pain to be always knowing that you’re a prey animal and that everything from lions to dogs to you to eagles wants to kill and eat you or your children. So, since we can’t dumbly forget like the horses who hang around you despite you eating one or two of them every so often, we pig out on mushrooms from time to time. So, kill me already.”\n“I can’t kill you. I’m talking to you.”\n“That’s the drug talking,” the reindeer said.\nI started crying and checked back with my body in New York to make sure I wasn’t crying there. Nope, so back to the reindeer. “So what I’m imagining you saying is just the drug making me think what you’re telling me isn’t what you’d really be thinking?”\n“I’m sorry,” the reindeer said. “I’m just not used to sentences that twist and curl back on themselves like that.”\n“That’s okay,” I said. “What I meant to ask was isn’t the drug giving me special insights, like magic, into your thinking?”\n“Hey, man, don’t try to make my trip your trip,” the reindeer said. “I’m sure your elders and all those kids over there are going to have some magical explanation for all of this, but I’m a reindeer and we don’t do metaphysics. We just fly around after we eat mushrooms and we giggle.”\n“You’re saying just enjoy it?”\nThe reindeer sighed and tried to shrug his arm off his shoulder. I didn’t shrug off. “Look at you. You’ve killed off the giant deer. You’re killing off the mammoths. We’re not doing real well, either, despite being able to sneak a whole lot better than mammoths. You’ll probably eat us out of here. And you want to have me prep your drugs for you.”\n“But we love you. We eat you to assimilate your virtues.”\n“You know that most of what you people painted in your caves is extinct now.”\nThis jolted me back to the loft party. I remembered the reindeer being stoned, but the acid was probably giving me a mental remix of what really happened. But then my life is often like that, first the ending, then the beginning, and then the parallel that happened earlier than the incident it was paralleling.\nVel paused, holding an old stone oil lamp in his hands. He sniffed it as though something should have remained of the urine. “Nothing but dust now,” he said to Quince. “Should I go into details about the sex or not?”\n“More just the blow by blow,” Quince said. “You can skip some of the details when you describe your encounters.”\nI felt confused about what I was doing at this party and remembered the first time I’d stepped into a Seeing. I’d been around 16 or 17. What I’d seen was a bunch of guys wearing towels and having sex. Looked like loincloths to me, so I jumped right in, totally unable to speak any language in the scene, unaware that this was centuries in my future, thinking it was somewhere else in the Paleolithic. I laughed in the loft, thinking that I was probably now close to the time when I’d first jumped. I just thought they had really better lamps somewhere else in the Paleolithic. So, I turned to the hallucinating and hallucinated reindeer in that vivid half dream and said, “I remember you. I haven’t remembered you in thousands of years, but I must have dreamed about you to remember this now.”\nThe reindeer looked at me and said, “I’m long since dead. My descendents are now working for the Sami in Norway and dragging children around on sleds in upstate New York.”\nI tried to fish though my memories for the real story, the original drinking of reindeer piss. The reindeer said, “You know you’re not going to find all of it. You haven’t remembered all of it in so long those brain cells have been recycled and recycled again. You remember better the things you understood at the time, but only if they were really different from day to day life. Big pains. But big joys, too.”\n“That’s not fair,” I said. “What’s the point in living a very long time if you can’t remember everything.”\n“Even I, who you’re going to eat when you catch me next, don’t remember everything. I suspect I won’t remember anything of this conversation,” the reindeer said. “Now will you shut up and let me enjoy my mushrooms.”\n“Sorry,” I said. I turned my attention to the party and found someone really cute to go chase. We went into the bathroom that wasn’t full of people doing lines of coke.\nUnder the light, he saw just how drugged I was and how young I looked. “You’re balls out tripping. I can’t take advantage of you like this.”\nMy frustration levels were about to pop my zipper. “I want you to take advantage of me,” I said in the voice of the reindeer.\nHe said, “I’ll blow you. Just don’t follow me home like a puppy, okay.” He wasn’t the best of lovers, but I didn’t need the best of lovers with my imagination burning acid. The reindeer stuck his nose against my asshole and licked my taint from asshole to balls, and I just exploded.\nThe guy looked at me and took a warm towel and began cleaning up and the reindeer was giving me head and I came again. “Oh, to be young again and be able to endlessly come. I think that should enough,” the man said. “And other people need to use this bathroom.”\nI hopped up on the sink and waved my legs at him. “Come on, already,” he said. He zipped up my jeans as I was starting to shrug myself out of them.\n“Listen to him,” the reindeer said from the scene inside my mind. “You’ll be embarrassed later.”\n“I can give you a blow job you’ll never forget,” I said.\n“My dear, I don’t stick my cock in the mouths of people who are tripping their heads off.”\nOuch, that hurt. I curled up like a snail, and the man pulled me off the counter and sat me down by the woman in the swing chair who was grinning wickedly at someone who’d come by to make sure she was okay.\nBack in the half imaginary, half real past, the reindeer and I were sobering up. We hadn’t been talking for a couple of hours, just wandering about with my arm resting on his back, him being about waist high to me. He rolled his eyes back at me as though he’d just realized he’d been walking around with a human hanging on to him for hours.\nMost of the dogs had gone off once they realized we weren’t going to help them and we were acting as crazy as the deer. One came back and sat down, looking eager. My reindeer friend thrashed his rack against my hand and took off running, the dog chasing him. I washed out my lamp and pissed. A reindeer crept up, weirdly cringing like a dog, and lapped up my piss. The other humans looked wrecked. I supposed that I looked wrecked, too.\nI got a cab home from the party, with two other people, including the woman from the wicker chair, and went back to the Chelsea, different room this time, and lay down on the bed, not quite coming down yet, but aware, as I had been aware 14,000 years ago, that what I’d done was take a neurotoxin and semi-poison myself, and that if this worked like alcohol, I couldn’t step out of this time until I was completely sober. But then I remembered I’d had two glasses of white wine before all this started. And I had wanted to follow home the guy who’d blown me, just like a puppy, but knew that was the acid, too.\nWe built a fire back by the reindeer the foreign boy had killed and sat around eating it for a couple of days, fucking, the way kids did when they made a kill off away from the grown-ups. Flat Nan and one of the other girls skived the deer hide and we all stomped brains into it and folded it. I wondered if eating a stoned deer would make us stoned again, so went off to find another one and killed a fawn of the season, so we had two deer and lots of time to hang around being young humans with each other until the girls got pregnant again from all the good eating. Better with mammoths because you could slide and slip on all that flesh as you were dressing it out, but two deer in the fall before it got cold and snowy and mammoth season were nice.\nHard to hide what Ro and I were up to, and the het boys and girls were curious and we were all just still stoned enough to talk and demonstrate. I don’t know what the half-life of the mushroom drug is in reindeer flesh. The deer had bleed out and the liver and innards were foul from being left in the body after the foreign boy had cut the bladder out, so we probably weren’t getting the most psychoactive parts.\n“So, why don’t you use females to put your cock in?” Ken asked.\nRo said, “Just don’t. Females can’t know what it’s like to touch the pleasure thing in side.”\n“You have a pleasure thing inside your ass?”\n“Probably you do, too,” I said. “There’s one you can feel up the asshole.”\nKen looked like he didn’t believe us at all. He asked Ann, “Put your finger up there and see what you feel.”\nRo and I leaned into each other and watched while Ann put her finger up Ken’s butt. She wiggled around and Ken breathed out, “Okay, but she can do this for me.” Ann looked like she’d figured out a new way to wrap boys around her fingers.\nThe foreign boy said, “You can cut her a stick and make her a harness so she can fuck you.”\n“No,” Ken said. Ann was busy cleaning her finger with leaves. She went down to a branch and cleaned it more. “Okay, so it’s not just the one pushing his dick in who gets something from this.”\n“No, and we have hands,” I said. “We trade off being the girl.”\nAnn looked at us as though we’d said something impossible. “What about this sucking thing?”\nRo said, “You should be able to do this just as well as we can, but you need to look at it carefully and find the little raised ridge behind the cock skin.”\nI said, “Helps to wash good.”\nThe foreign boy said, “The guys who go for guy are good with their sister’s children.”\n“We know that,” Ken said. “That’s why we like having a few in the group.”\nRo and I looked at each other and smiled slightly. Ken was going to challenge his father’s uncle sometime really soon now.\nFlat Nan said, “Since I don’t have good breasts, could you find me sexy?”\nRo looked at her. “Possibly, Nan. I don’t think people should be frustrated. And women get smarter if they have children, I’ve heard.”\nI looked at Ro with some concern. “She’s got a slit, not a dick.”\n“I could try pretending I was with you.”\nNan started to cry. I wish I could give her tits or something so she could get laid without having to get my tenderhearted boy friend to have to try to satisfy her.\nFirst love. For all of us. Nan got someone to get her with child not long after that and grew a pair for nursing the child, so she wasn’t Flat Nan anymore. I suspected it was Ro, since he was capable of being really generous, especially when he could use his dick to make someone smile. We didn’t invent man-man sex, but I think he did invent penis puppetry.\nThe dogs got the hides away from us and ate them, and the deer’s guts and then ran home and hid in their own cave for a few days. Dogs hate drugs and scary things.\nThe grownups had taken a mammoth that refused to stop pestering the horses so nobody was really impressed with what was left of our two little reindeer. We all made some lamps and went hunting for tinder conk, those big fungus that grow on trees, so we could start getting things together for Bringing back the Sun, Winter Solstice.\nI love Winter Solstice, still, having the family around. Never get tired of it.\nBack in New York, I remembered all that, some of it again, some of it messed by the acid which framed understand what the first time was, even if the details were totally confused by what I knew about drugs in the late 1960s and early 70s. And I slept in and went running in Central Park and we were still before AIDS and after Stonewall. I called one of the poets who’d told me we’d met (in that one’s case, I had read enough about him so that I could fake it) and met him again for the first time at his reading at St. Marks Church.\nBut that’s another story.\nWe want to get back to the Paleolithic, at least some of us, and the last part of the Paleolithic wanted to get to our time. 30,000 years of chasing big game, less than that to get to atomic fission and high-speed computers. As long as the ice doesn’t come and scrape us off this island, we’ll be fine.\nQuince remembered playing with some of the things in the storeroom when she was a child and being scolded when her mother finally caught me wearing a 13,000-year-old necklace made of amber carved into wolf heads, restrung every couple of centuries.\nEven the time-bound can’t remember all the time.\nRebecca Ore is a native of Louisville, KY, who has spent considerable time in New York City, Charlotte, NC, Philadelphia, and various part of Virginia, my father's home state. She should be a resident of Northern Virginia by the time this is out. Rebecca has published under the name Rebecca Brown as a poet (Siamese Banana Press, Telephone Books, and Adventures in Poetry Press) and under the name Rebecca Ore as a science fiction writer. Her next book will be from Aqueduct Press, probably to be titled Centuries Ago and Very Fast. \"Acid and Stoned Reindeer\" will be included in the collection.\nRebecca also collects film cameras and Chinese painting brushes and tea sets."}