{"fingerprint": "DugjtKNjhY2uDs9TbLapvtkCeL4=", "sitename": "Clarkesworld Magazine", "title": "Thrilling to the Harmony: A Conversation with Karen Osborne by Arley Sorg", "author": "Arley Sorg", "date": "2021-02-09", "source": "https://clarkesworldmagazine.com/osborne_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Thrilling to the Harmony: A Conversation with Karen Osborne by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Thrilling to the Harmony: A Conversation with Karen Osborne\n As a self-avowed Star Trek nerd, it is perhaps fitting that Karen Osborne’s earliest attempts at selling fiction were in the Star Trek franchise: “As a teen, I once wrote a Star Trek: Voyager spec script with a friend over CompuServe, which became my first real rejection letter. It’s framed.”\n Osborne’s first SFF sales of “Retirement” to Aoife’s Kiss and “Gazer” to Electric Spec may have flown under the radar. But she landed in pro markets with 2017’s “An Equal Share of the Bone” in Escape Pod, which was listed as “Notable” in The Best American Science Fiction and Fantasy 2018. Reviewers took notice, and as her work appeared in more pro venues, such as “The Bodice, the Hem, the Woman, Death” in Beneath Ceaseless Skies, her name appeared ever more frequently in short fiction review columns. Short story “The Dead, In Their Uncontrollable Power” in the March/April 2019 Uncanny earned her nominations for both Nebula and Sturgeon awards. Debut novel Architects of Memory began her Memory War duology, launched September 2020 by Tor Books. Reviewer Liz Bourke described it in her Locus column as “a very entertaining book and a debut with a lot of promise for the rest of Osborne’s career.” Book two, Engines of Oblivion, is due February 9, 2021.\n Karen Osborne was born in Niskayuna, NY near Schenectady. She graduated from Niskayuna High School in 1998 and went to college at Nazareth College in Rochester, NY, where she studied English, communication and information design. She worked for community weekly newspapers doing everything from reporting to photography and editing to website management; she won awards for her news and opinion writing in New York, Florida, and Maryland. She’s also worked as an English teacher, a wedding videographer, a KMart cashier, a bookseller at Waldenbooks, a writer of press releases, and “the person that packs your Tupperware order,” which was her very first job. She attended the Viable Paradise workshop in 2016 and the Clarion Writers’ Workshop at UCSD in 2017.\n Osborne lived in Albany for a while, near the Empire State Plaza, “which makes a cameo in Engines. It’s an alien landscape to say the least.” She currently lives in Baltimore, MD. Pre-pandemic, she played fiddle in the DC/MD-based Homespun Ceilidh Band, electric violin for a fusion outfit called Circle of Confusion, emceed the Charm City Spec reading series, and regularly ran 5k races. She is a full-time writer who lives with “two violins, an autoharp, five cameras, two cats, and a family.”\n What were some of the most important genre works for you when you were younger, and has your view of those books changed over time?\n My one criteria for picking up a new book as a middle schooler was that it had a nice fat spine with a little rocket ship sticker at the bottom. That sticker led me to Elizabeth Moon’s Paksenarrion books, Cherryh’s Cyteen and Downbelow Station, to Sherwood Smith’s Wren books, and to Lois McMaster Bujold’s Vorkosigan series, all of which I still really like (and I kind of feel like I’ve grown up with Miles, honestly). I loved Gayle Greeno’s trilogy about truth-telling alien psychic cats. The middle school library was also where I came across Brian Jacques’ Redwall, a book that taught me that even the meekest of mice can defeat the worst of villains, which was a message I sorely needed to hear at that time in my life.\n And then there are . . . the other books.\n A lot of the novels I read then—books that were in the middle school library, that were actually recommended for us to read—normalized sexual violence and misogyny in a way that now makes me extremely queasy. I didn’t notice it at the time because I was basically still young enough to believe in Santa. I can’t read the Pern books anymore. I can’t read Heinlein. I remember middle school as this time of growth where I really discovered how much I love reading and books, but when I go back to some of these older titles, all I see now is how much some of them hated their female characters. Hated them. Fridged them, objectified them, abused them.\n And that’s partially why I started writing. There wasn’t a place in books like that for smart girls or ambitious women, but that’s what I was and what I wanted to be. It was hard to find my cabin on the rocket ship, so I had to make one for myself. And that, right there, is the start of the journey for so many modern authors.\n Did these books or stories have any measurable effect on your writing?\n Absolutely. Artists are always working in conversation with the works they’ve consumed and the beliefs they had when they were younger, whether they want to interrogate those things or honor them. Architects actually reflects less on the books I read and more on the media I consumed, and wow, I consumed a lot of it. I grew up watching nineties science fiction television, which tended to see the world through rose-colored glasses, with protagonists who might have struggled but were generally on the side of the angels. That’s partially why the explosion of space opera today is made up of more complicated narratives with protagonists who are less heroic and more human—most of the people showrunning The Expanse and the various new Star Treks watched the same stuff as me, but it’s been a long road since childhood, and our rose-colored glasses shattered a long time ago.\n All of the shows I loved—the various Treks, Stargate, Babylon 5, and more—are basically utopiate workplace dramas, where the characters are extremely fulfilled both socially and vocationally, with found families and close friendships tied up in meaningful work. And, of course, that’s not even close to how life is for most people. A lot of modern space operas acknowledge that people have realistic forces working in and around them, and that money and profit and power affect people on every level. So, yeah, I’m interested in black holes and space battles and Alcubierre drives, that’s what I show up to the space opera bar for, but I’m also interested in how, for example, Ash Jackson balances her need to keep her head down in the corporate world with making a ruckus to save people, or how Natalie Chan decides how much of her soul to trade for the stability she’s never had, or how much Leonard Downey uses humor as a survival tactic and what he’s willing to give up for a chance at doing something real. In the real world you can’t change things by walking through a stargate and shooting the nearest Goa’uld. It’s a lot messier than that.\n And it’s that mess I’m much more interested in dealing with now.\n You are also a musician. Are there important connections between your fiction and music, or are they very separate?\n They are very much connected. Music is a language, just like English, and, as a musician, you interpret songs and symphonies in a similar way to how a writer interprets a paragraph or a story. I’ve found that pacing in music is uncannily close to pacing in story—simply listening to a song you like, where the music slows or swells, can help you figure out how a story might do the same. Intricate harmonies, crescendos, solos, and where they all go in a symphony—it’s all directly applicable to what you do with words on the page.\n And music is about the writing process, too, and the fandom that comes with it. Before the pandemic, I played the fiddle with a ceilidh band, which is all about dancing and fun and community-building. It’s about trading energy with the rest of the band, relying on the beat, thrilling to the harmony, and trusting yourself and your fingers. It’s meant to be danced to, it’s meant to build community, it’s meant to find people out of breath, hugging each other, laughing—or crying, or breaking open people’s insides to find their deepest feelings. Music is also time travel—Dar Williams’ “Iowa” kicks me straight back to 2001, while Gillian Welch’s “Look At Miss Ohio” feels like Martha’s Vineyard two weeks before the 2016 election.\n I think we connect with books and fandom very much the same way. Reading is a quiet affair, but it shouldn’t be a solitary one.\n You went to both Viable Paradise and the Clarion workshop at UCSD. Did those programs have a significant impact on your writing or your career?\n I tried for years to get into an MFA program, but the programs I wanted didn’t want me, and when I got into Viable Paradise, I was convinced that I wasn’t going to belong there. The workshop ended up being one of the most validating and encouraging experiences of my life. I came out of it with a bunch of close friends, some very encouraging words from actual professionals, and a critique group. That critique group has seen me through three novels, a handful of short stories, and a lot of related anxiety, and I’d argue, got me further than any MFA ever could.\n Clarion pushed me. I learned something new about the craft every single day. My brain was on overload the entire time. We all were switched on so much that we’d take breaks from class and just lay in the grass, staring up at the sky. A lot of my classmates were honest-to-Jesus literary geniuses, whereas I came to San Diego worried that I couldn’t keep up. My classmates and instructors pushed me to think about story in ways I never had before—kind of reached in and rewired it. That’s how I explain it. I’m not sure I could replicate the process if I tried. (A lot of Clarionites say that you end up hearing your classmates’ voices in your head while you’re writing, and that’s 100% true.) Two of my classmates ended up beta-reading Engines of Oblivion on literally a month’s notice. An entire novel. That’s what you do for other people when you’ve been through the Clarion crucible. I’ll always be grateful for that.\n Your Memory War duology is a foray into space opera. How do you define space opera, and what is the appeal of it for readers?\n The term is originally based off of “soap opera,” of course, but the genre hasn’t relied on generic tropes and melodrama for some time. In fact, I think it’s some of the most forward-thinking fiction being written today—because, in space opera, the only conventions by which you’re limited are the fun, glittery ones. And those limits are extremely loose. You should probably have some wild political machinations, and some space battles, a neat-looking starship, and a laser sword or two, but other than that? The galaxy is your playground.\n For me, space opera is a big, bright Broadway musical. It’s full of squishy feelings and glitter and blood, and although people might not burst into song, that tingling, larger-than-life feeling you get when Lin-Manuel Miranda sings “Alexander Hamilton” . . .only on a galactic scale, with cool stuff liberally applied to everything and everyone. It’s Enjolras stepping forward to start “Do You Hear The People Sing.” That’s space opera.\n The genre is interested in the hard-SF questions of science and the galaxy and aliens and politics, but it’s also interested in how all of those things affect human beings on the ground. How a spaceship works or how a technology functions is secondary to the political and personal ramifications. It’s a massive grand strategy game, but also a very emotional and specific character-based RPG. Arkady Martine does it like nobody else in A Memory Called Empire—an entire empire’s at stake, and it all depends on what one ambassador remembers. J.S. Dewes also captures the essence of space opera in the forthcoming The Last Watch, which is a bunch of military malcontents staring down the literal end of the universe.\n Whatever you do, don’t forget the cool stuff. Make it glitter. Make it glisten. Make it sing.\n What was the journey like with Architects of Memory? Was it a project you started long ago, or did it start coming together more recently? Did the book change much from conception?\n Architects is my own personal little katamari ball. The crew’s been around since 1999, when I got really mad at a terrible movie and decided that I could do much better than that. I never really found a story for the crew I developed in my nerd rage, so into the round file they went.\n In 2006, I broke my foot in five places and developed a blood clot that nearly killed me (and introduced me to the crap sandwich that is American health insurance). Turns out that I had a clotting disorder—which makes me uninsurable in American terms, and means that if the ACA is ever repealed and I get a blood clot, that’s it, that’s all, I’m done. Blood clots are awful, mentally and physically, and to get through the experience, I started joking about the clot as a “time bomb in my blood.” I loved the phrase, but never thought up a plot that justified it, and into the round file it went.\n The last card in the hand was dealt in 2015, when I moved to Baltimore and got churned up in the bloody teeth of the freelance gig market. By October, I was chewed to pieces making pennies on the dollar and just wanted to remember why I liked writing, so I decided to write a novel. (Yes, fellow writers. I hear you laughing at me. It seemed like a good idea at the time.) I was dinking around with ideas when I read an article where Elon Musk was talking about his company’s desire to colonize Mars, and—I had just so many questions. That far out, Earth laws may be moot. Who’s going to provide food, rent, water, and air? The company, of course, will have company stores with company prices, and we all know how that worked out in Harlan County. What happens if your boss on Mars is abusive? This is capitalism; the company’s not there to help you. What happens when escape is three months and a billion dollars away? On top of that, when has colonization ever worked for anyone but the richest and most powerful?\n The lesson is: Be an idea hoarder. Keep everything, even if it doesn’t have a place when you think it up, because you never know when you’re going to need it.\n What were the most challenging aspects of writing Architects of Memory; and were the challenges very different for writing Engines of Oblivion?\n Since I started Architects of Memory to have fun during National Novel Writing Month, pretty much, I didn’t begin knowing where I wanted to go or what I wanted to do, so there were revisions—and more revisions, and even more revisions after that. I did so much writing. And it’s not so easy when you’re trying to write an alien species that is truly alien when you’re bumbling around a human planet, as human as can be. Every single time I thought I truly knew the Vai or what they were about or how they lived, they whispered something different in my ear and it was back to the drawing board. I ended up dropping over eighty thousand words to get from the very first day to my final draft. That’s nearly a novel in itself!\n Engines of Oblivion was difficult, as well, but for a very different reason. I got to meander through writing Architects of Memory, to experiment and to dither. I’d just had my first child, and I was determined to make my deadline even though I was clocking somewhere around four hours or less of sleep per day. I was seriously sleep-deprived. I would keep my laptop close to me during the day, and when my daughter napped, I’d plunk her on my chest and write. Neither of them were ever more than six feet from my body. I wrote like this every day for months. I’d worked pretty hard before—freelancing can be a pretty abusive mistress—but this was an entirely different level. I probably won’t ever work like that again, even though it ended up being an interesting experiment, and I kept quite a few of the gonzo ideas from Sleep Deprivation Land. Folks, always remember: You think writing is a mental game, but your mind is meat just like the rest of you. Take care of yourself. Don’t be me!\n Architects can be seen as a conversation on corporate power, capitalist class structure, healthcare, even the value of people. Is it important for fiction to take on these kinds of topics; is it an inevitable part of writing?\n It’s absolutely inevitable. Space opera is social fiction that deals with systems and the effects those systems have on characters, and its emphasis on politics and galaxy-spanning drama means that even when a writer tries to just write “something fun,” it’s never just that. We often take the systems we live in for granted, but a writer never should. You have to think about systems to write space opera. We buy chicken at the market and don’t think of the farmers or the packers. We pop tomatoes in our mouths without considering the farmworkers who have to wear long sleeves, even in the hundred-degree heat, because tomato plants can rip your arms to shreds. There were people in a Chinese electronics factory a couple years ago who committed suicide over horrible working conditions. Looking away from all of this is just as much of a political choice as getting involved, and that’s true for writing, too. That choice shows up in your work.\n Stories that don’t acknowledge that these systems exist tend to ring false to me. Why do stories like Star Wars, which is the most binary good-and-evil tale in the space opera genre I can think of, still get so much attention? It’s because the franchise spends a lot of time dealing with the question of who has power, who can get power, and what they do with it when they have it. Even the most bubblegum chick-lit romance deals with systems of power, chronicling the very real navigation of what it’s like to be a woman in the world. If you don’t deal with topics like these as a writer, you can’t really drill into what your characters really believe as squelchy, real human beings, and that generally makes writing much blander than it could be.\n Where does Engines take these conversations, and where does the story take the reader?\n Engines of Oblivion takes us back into the central nexus of Auroran Company to follow Natalie Chan as she becomes a citizen and starts moving up the corporate ladder. It follows through on some of the plot threads set up in the first book, and takes you further into the crisis that ensues when human beings start poking around in alien weapons they don’t quite understand.\n Natalie finally has what she wants—citizenship—but the decisions she made in Architects are going to have consequences that will take her back to Tribulation and beyond. Natalie told a pretty big lie at the end of Architects of Memory, and lies reverberate—certainly for those she loves, and definitely for the whole galaxy, especially when the Vai return. Her bosses task her with finding Ash, the only person in the universe who must defeat them, and Natalie has to find Ash before their enemies do.\n Engines also delves further into the issue of how memory makes us who we are. We’ve learned a little about how human memory interacts with Vai technology in Architects, and now we get to see how that plays out on a grander scale. Sometimes we can remember what we had for breakfast on a random day in January sixteen years ago, and sometimes we have entire years wiped from our memory—and sometimes traumas we block out consciously stay inside our cells, still informing our every move. Natalie has forgotten something—something that can build and destroy entire civilizations—and the Company wants it.\n It’s just as fast and wild and gross and complicated as Architects, and I give Natalie free rein to be her rebellious, striving, snarky self. It was a blast to write.\n Some of the reviews on Architects praise not only inclusive representation, but the way it’s pulled off: diverse characters as people organically inhabiting the story, living their lives, rather than feeling like a set of boxes are being checked. Was this a deliberate part of the reading experience, is this something that was carefully executed?\n Thanks. It is really important to me to write fictional worlds that look like the one we actually live in—full of people of all origins and sizes and orientations and heights and classes and religions. Our world includes straight people and queer people and femmes and enbys, farmers who have never traveled more than ten miles from their village and people who qualify for multiple frequent flyer programs, and that’s not going to change in the future. The only way to forget that our world is a wonderfully diverse place is to actively close your eyes against it. Many of the indentures in the company are climate refugees—Earth isn’t doing so well—and if there’s one thing true about the coming crisis, it’s that it will touch literally everyone on the planet. It will be a truly worldwide disaster.\n The characters of Twenty-Five have been the same since their inception—only their names have changed. For newer characters, I like to start with the setting, the world, and the culture, and work from there. Aurora started off as an international conglomerate built in the wake of war and climate change, and it names its ships after cities in which it has recruiting towers (and, thus, a big interest in the local economy). So, you see indentures from everywhere—Colombia, India, Canada, even upstate New York—and that was deliberate. Likewise, all kinds of gender expressions and sexual orientations are acceptable by Aurora, and Aurorans don’t gender their clothing, and that was also deliberate. In this world, humans have learned some lessons. Some, but not all.\n Many have also lauded the worldbuilding. What makes worldbuilding engaging for readers? Or, how do you write great worldbuilding? And what are some of your favorite worldbuilding elements in the second book?\n On the page, I think good worldbuilding lives in the Goldilocks zone: not too little, not too much. Too much worldbuilding kills the sensawunda really good space opera needs for the reader. For example, I’m not interested in the science of midi-chlorians, but “the Force is unexplainable” makes me lose attention just as fast. You have to provide just enough information to the reader to keep them following the story, but not so much that they get bored or mired in detail.\n Good worldbuilding goes “under the hood” just like the engine in a car. The reader might hear it, knows it’s getting them from point A to point Z, but they don’t see the pistons and the gaskets and the exhaust manifold. They’re just enjoying the ride.\n Engines was a worldbuilding dream. I really enjoyed pulling the trigger on things that I set up in the first volume, and it’s full of (and I always imagine Oprah saying this) consequences for everyone! I cackled while writing Engines. A lot. There are some horribly delightful new Vai weapons. There’s the memoria, a brain implant that’s supposed to assist patients with dementia or memory loss in rebuilding their pasts. Natalie also has to deal with Ingest, a panopticon computer with some frightening secrets of its own. And there’s the little Auroran social stuff that Natalie has to deal with this time that wasn’t a problem on Twenty-Five—the list of unwritten rules she has to live by, the list of ways executives like Joseph Solano can get out of those rules (they are the 1%, after all), and the minute power dramas that are suddenly so important to everyone around Natalie. Now that she’s on an executive flagship, everyone suddenly cares about who she’s seen with, how her hair looks, and how loyal she is to the Board. And it’s doubly stressful if a panopticon computer is feeding everything you do to the CEO.\n Before the books launched you had some well-received short fiction out. What sorts of things did you learn about writing through the process of putting these books together? Will any of them impact the way you do short fiction?\n Some authors can take breaks while writing their novels and write short fiction. That makes me incredibly jealous. I’m not like that. My brain very much prefers to stick to one project at a time, length be damned, so it’s either a bunch of shorts in a row or a novel.\n I mentioned before that the first book wasn’t planned very well from the beginning and I had to kill a lot of darlings on its way to Tor—but that just taught me how to adapt. I didn’t think I could plan—I always preferred the loosey-goosey pantsing methodologies of my earlier days that let me discover my characters and plots as I wrote. Well, it turns out that I love being a planner, especially now that I have a toddler that demands so much attention. I’m free to concentrate on words and structure and not worry so much about writing myself into a corner full of rabid plot bunnies.\n And that is where short stories come in. I love plotting novels—and hate plotting shorts. Short stories let me be as experimental and wild as possible. They are chocolate. They are decadence. They are glitter. They are glorious things filled with the wild gonzo fancies that I love. They are short enough that I can write first and plan later, and scratch my pantsing itch.\n And that’s the most important thing I learned from writing these books: The best writing process is all about what works for you in the moment you’re living in, and what works for you can change. Frustration with your process is just a warning that you need to give it a tune-up.\n What excites you most about the duology, what do you really want readers to know about it beyond the blurbs and reviews?\n Some people have used the word “dystopia” to describe the Memory War, but that’s not entirely correct. The Auroran world is not a dystopia—or, it is, but in the same way our own society is a dystopia.\n I often think “dystopia” is a word we use to lessen the blame we feel for how we affect our own world. After all, in dystopias, us common folk are all powerless drudges in gray outfits (except for the Chosen One, of course). So, there’s no leadership to feel or power to reach for, and we can even abdicate our own responsibility, because what can people as small as us do about it?\n We don’t need a time bomb in our blood to understand that we do have power, even if we don’t see it: over others, over our lives, over the things in our world that we can touch with our love and our influence. That’s one thing people have told me about reading Architects of Memory—that it reminded them of that, and I was just so delighted to hear it. Ash and Kate and Natalie are yanked away from the world they hoped for to encounter the world as it actually is. And they step forward.\n So, people can read this as a dark, lightning-fast space opera adventure story, and have a rollicking good time, and I’ll be incredibly happy. But I also hope that readers come away from it thinking about their own universes, and where their priorities lie, and step forward, even if it’s just a little. Because Elon Musk is going to Mars, and our climate is going to pot, and as I write this, the lines for food banks stretch six miles long in the richest country in the world, and we’re all about to be Ash and Kate and Natalie.\n What else are you working on, what else do you have coming up that new fans can look forward to?\n I have a story coming out soon in Don’t Touch That, an anthology about parenting in SFnal situations—it’s about a teenage paladin, her mother, and a grand ol’ serving of mom guilt, fried and festered over seventeen years and served fresh.\n I’m also working on two new books. One’s a space opera set in an entirely new setting, tackling questions of conservation and climate change and our responsibilities to the universe. A second is a fantasy novel based on a short story published in 2019, which is all lady gunslingers and internecine politics and a sorcerer on a hill. I also post new short and flash fiction from the Memory War universe on my Patreon once or twice a month for people who are interested in that, because there are still more stories to tell of the spacelanes between Europa and the White Line. I also yammer about Star Trek and writing on Twitter on a regular basis.\n Thanks for speaking with me today; this has been delightful!\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}