{"fingerprint": "NGpiuN8dn1Qx82hqgXcYGZsimUc=", "sitename": "Clarkesworld Magazine", "title": "Promises We Made Under A Brick-Dark Sky by Karen Osborne", "author": "Karen Osborne", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/osborne_07_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Promises We Made Under A Brick-Dark Sky by Karen Osborne", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5930 words, short story\n Promises We Made Under A Brick-Dark Sky\n I was standing on the dock when the angels fell.\n Their blades stilled. Their lights dimmed. Their corpses shattered on streets and shingles and skulls, all the way from the cathedral at the crest of the world down to the blackwater at the end of it, where I waited on the dock with my baby. The noise was all crashing and squealing and screams—a bawling dirge for the world as it was, and a birthing-song for the world it would become.\n From here, I could see into the windows of the bayside chapel, where the fisher-monks that had taken me in took their daily guidance from the god. All that remained was the scattered, swimming static of divine death, as cold and gray as a recycled human heart. The fisher-monks spilled out onto the street, screaming about the steel-prowed beast and the boundless obliteration and the end of all things. They’d fed us for eighteen months, taught me their prophecies, showed me how to fish and swim and survive. They’d taught me the divine language.\n And I’d killed their god with it.\n Our god.\n Brothers and sisters, until that moment—sweating, shaking in ecstatic terror, my arms aching with the warm and wriggling weight of the most important person that ever lived—I did not believe the god could die. Certainly a god as powerful as ours, that dictated how we were to live and farm and marry, would not allow itself to be killed. But dead it was, and taking the world with it; far above, fires had caught where the angels had fallen, clogging the brick-dark sky with waves of black smoke. I could taste the broken air already, bright with stinking incandescence.\n No, I thought, no, I killed the god to save us, not to burn us, and prayers sprung to my lips and died there in one breath. My daughter buried her face in the crook of my neck and cried, and in the blank space between her first long wail and the huffing, anger-caught sobs that followed, I doubted.\n “He’s coming,” I whispered. “He’s on his way. Your daddy is coming. The ship is coming.”\n It was the only prayer I had left.\n Her smoke-drowned cry curled around my brain stem like a shot of adrenaline. Her little knuckles turned white on the edges of my robe, crying and crying and crying, screaming mamamama like she knew what I’d done. I knew my prayer would not help. In her circumscribed life so far, her father was as useless and dead as the god.\n And with that, a new thought slipped in with the silt from the street: that the god had never existed in the first place.\n That we were the god now, my daughter and I.\n Steret arrived minutes later, out of breath from the run, a gun in each hand, looking for all the world like the burning wind delivered him there. Brothers and sisters, he was barely a silhouette of the boy I had known in the hills, a ragged black space drawn dark against the orange flames behind him. He was older now, but just as beautiful, fine silt and sand coloring his ash-bright hair.\n I moved to greet him, my lips parting, joy in my throat, to say meet your daughter, finally, take her, look at her, when a woman in city silks, clattered heavy and unexpected onto the dock behind me. She was round-hipped and wife-beautiful where I was hunger-thin and monk-plain, and my elation choked in the smoke whirling in drunken circles around our feet.\n “We need to move, Ster,” she said. “Where’s the ship?”\n I moved my crying child to my other shoulder, fashioning a baby carrier out of a forgotten fishing net. “We?”\n “The prophecy says a ship will come. We need to be on it.” The woman paused. Narrowed her eyes. “You didn’t tell her.”\n Steret wavered. “How was I supposed to tell her?”\n “A letter?”\n “And have it be tracked by the angels?”\n “You should have told her.”\n He hauled in a shuddering breath. Checked his gun. “Elissa. This is Anaro, my wife. My second wife.”\n I felt a wild dizziness. The angels gave him two wives while I was waiting for him to return? And he didn’t push back?\n “This was for us,” I said. “You and I and the baby, you said there was a place we could be together. You said—what if we could live for fifty years and marry whom we pleased? You said—what if I could marry only you?”\n Brothers and sisters, this promise had been a hot infection in my heart for the last two years, this memory of the two of us lying together on the hill above the cemetery farm, so close to heaven that we could see the rough outline of the sky above us, as brown and loamy as the ground below. We met as our mothers entered the recycler, as the monks tried to comfort us, saying that their death was blessed, that they would live underground forever, feeding the teeming thousands in the city below. We knew better about that—about our mothers, about ourselves, about all of it.\n There was nothing blessed about how we were dying, about the illness that came up through the lungs in blood and black ichor. And the dead interred in the mushroom fields were getting younger every year. I had already begun to cough. Steret’s brothers were already dead and recycled—so, so young. And so we’d spent those long funereal days near the horizon, our hands and bodies and lips speaking a poetry I’d never thought possible.\n And when Steret returned the city to enter his god-dictated marriage, I discovered there was a network for girls like me, for girls who are too poor and too sick with ichor to marry, who love someone hard enough to break the god’s restrictions on when a baby can be born.\n And now—\n Steret went silent and straight. In the bright firelight, I could see his cheeks flush, and he pointed at my daughter.\n “Is that—”\n “I haven’t named her.”\n “Focus, Steret,” Anaro snapped.\n I swung my eyes back onto the other woman. “She isn’t coming.”\n Steret sighed. “The plan didn’t work. The cathedral guards wouldn’t let me in. I had to improvise. Anaro had to bring the prayer to the cathedral in my stead. You don’t expect me to leave her to die?”\n I pointed up the hill. “Obviously, she messed it up.”\n Anaro exhaled. “I didn’t write the prayer. If there is anyone who is responsible for this, it’s you.”\n “I didn’t mean—”\n “Of course you didn’t.” Her eyes flickered down to my squirming baby. “But that’s your thing, huh?”\n Brothers and sisters, these are my true confessions. I will be frank. I did not want her there. I wanted to rip the gun from Steret’s hand and end the question of this sudden and ant-waisted gulf between us.\n But I was not going to be the kind of god I had just slaughtered.\n I pointed instead at the bags and crates at the dock, at Steret’s shovels and torches and tunneling tools. “Fine. When the ship comes, carry these aboard.”\n Anaro did not answer—just looked over my shoulder. I followed her glassy gaze toward the end of the pier. Beyond was the great, wide darkness where no human could go, with a heavy, dark humidity rolling in—\n —no, not just a darkness, a slickening obliteration—\n —and behind that, a ship coming.\n It was just as the prophecy said—a behemoth of plain, ancient metal, curved and smooth, dark water dripping from the rails and balustrades. It cut the surface of the quiet water like blood welling up around the edge of a knife. No oars, no wheel—just a grinding, growling sound that split the fish in the bay into two frightened schools, their tiny, slippery, ghost-white bodies disappearing into the darkness. I looked, and looked, and looked, but could find no true reason why it would move.\n Steret loaded one of the guns and shoved it in my hand. “We were right,” he said. “Get ready. If there are demons aboard, we take the ship for ourselves.”\n I looked down at my daughter’s scrunched-up face, her tight fists, her shaking shoulders. I was willing to kill a god for her—so why was I so afraid?\n “Steret—”\n “We already killed the god,” he said. “You can kill a demon.”\n You did nothing, I thought, and then there was no more time to dwell—we watched a rope fly out from the deck of the ship, flopping limp against the edge of the pier. Above, the demons appeared in their hellish orange carapaces, their mock-human faces trapped behind the same clear heavenly material the fisher-monks used in water purification ceremonies. They carried bags marked with the sign of hell: two blood-red lines, crossed in the center.\n They breathe a different air, the monks had told me, and they are blind from living in a constant fire humanity could hardly imagine. When they come here, they bring the air of hell with them in baskets on their backs. If you take their helmets off, they choke.\n One of the demons opened his mouth, and sound came from a grille in front of his carapace. It sounded like language, like speech, calm like the few memories I had of my father’s voice before the coughing sickness took him below the earth. He moved forward, indicating that he would come down to our level.\n “Come no further,” Steret roared. “The ship is ours.”\n Behind us, a crowd was forming, a sobbing, angry mass of people covered in soot and tears and utter confusion. Even if I had wanted something different than Steret, even if I thought I could negotiate with demons, it was too late.\n I told Steret I would follow him. I had to follow him. He was the one I loved. I yanked the gun from his hand. Held my baby light and kind with one, and the gun tight and hot in the other. I would kill for her, I’d said. Over and over and over.\n “Do it!” he screamed.\n I aimed. Closed my eyes.\n Pulled the trigger.\n Brothers and sisters, I know you have many questions about our journey, just as I know you have suffered since the death of the god.\n Put simply: the god had to die. The ship had to come. The algorithmic prayers were wrong. The divine mathematics that linked men and women to one another had gone sour and unnoticed by the angels. Why would a god create children just to slip the smoke and ichor into their lungs, so mothers and fathers could watch their children writhe and gasp, their mouths open and breathless to the stone-caught sky? My daughter needed to live. I needed to live. Isn’t that enough of an answer?\n We piled on the ship, using ropes and nets and pulleys. The fisher-monks worked in a neighborhood full of mushroom farmers and body recyclers and factory workers, and we took as many of them as we could, until Anaro realized that the ship was moving of its own volition—that even though the demons had died, they’d left behind some still-active prayer. When the ship turned away from the dock and picked up speed, I watched people on the shore throw themselves into the bay, falling under the water because they could not swim, choosing that death over the fire. And then—the city was gone, the world was gone, and from a place no human had ever ventured, we watched orange light hit the russet sky, making torches of the roots of heaven.\n I vomited over the side of the ship.\n “Get over it,” Anaro said.\n “Have some humanity.”\n Anaro narrowed her eyes. “You wrote the prayer. I didn’t think you’d be concerned.”\n The baby grabbed at my matted hair, and I loosened the carrier, placing her on the deck. My shoulders ached. I needed a break. The baby looked around, her eyes wide, shoving her fingers in her mouth, excited by her new surroundings. “I didn’t know the angels could start fires. There’s only so much air in the world. Nothing we do will matter if we come back to a city full of corpses.”\n “You should have thought of that.”\n “You shouldn’t have married—”\n “Both of you. Stop.” Steret squatted over the demon bodies. He’d dragged them to the center of the top deck and was using his day-knife to cut through their orange carapaces, revealing feet and fingers and faces that looked entirely too human. If I hadn’t already known that we were in the right, I would have started to question myself.\n I’d imagined our reunion in shades of red and brown, passionate, and close, and skintight. This felt cold. Gray. Wrong. “Steret, I need you to meet your daughter.”\n “In a second,” he said.\n “You don’t have to recycle them. There are no machines here, and it’s not like you can bury them in a field.”\n Steret didn’t look up from his task. His knife had moved to the demon-skins, slicing into the fatty, bloody layer beneath. “I don’t know what happens if I don’t.”\n “Nothing happens. The god is dead. There’s nobody left to stop us living how we choose.”\n “Then who sent the ship?”\n “The ship is in the prophecy,” I said. “If the colony core machinery can no longer function, an automatic fail-safe beacon will be dispatched, and a rescue ship will arrive within—”\n His hand tightened on the knife, which came back red. “I know. But we didn’t think. If the god is dead, who dispatched the ship?”\n I felt a stab of bright annoyance. The baby started crawling toward the dead bodies, her fingers raking at the silent bootlaces. “Now you’re troubleshooting?”\n “I don’t know,” he said. “I didn’t actually think the ship would arrive.”\n “You what?”\n He looked down.\n Behind us, Anaro found something useful to do, organizing the monks and factory workers milling around on the deck. A smart thing to do, replacing the god’s rules and algorithms with a structure that frightened people could follow for now. I was absurdly grateful to her; since I was an illegal mother of an extra mouth, I could not step forward to lead, and if Steret tried, I’d punch him in the jaw.\n He must have seen it written on my face, that he’d gone too far, and he dropped the knife. “I got your letters. All of them. And I wasn’t just going to let you die in the basement of some fisher-abbey. I thought I’d humor you.”\n “And then what?”\n He flushed as red as my anger. “I thought you’d finally realize that the baby wasn’t a good idea, that you’d have it recycled like all the other extras.”\n “And die on the street? You told me I’d be the only one! We were in love!”\n He stared at the demon’s cracked skull. “We can’t fight reality, Liss.”\n “But we did. And we won.”\n I heard a squeal. I had not seen the baby crawl forward and close her tiny fingers around the bloodied hilt of the knife. I swore, dropping to the deck like a stone, wrestling the thing out of her deadlocked hands. I cast the knife aside, and it skittered toward the sloshing water; my baby cried. Furious that I’d saved her, just like her father.\n “You don’t leave knives out around babies! She doesn’t even have a name, if something happened to her now—”\n He blinked. “You never named her?”\n “I was waiting on you.”\n “I was thinking—”\n I swept her up in my arms. “And now you won’t get to.”\n With her weight against me, I felt ungainly. My legs burned. I rested my nose in her soft hair. Winced at her wail. She was everything I wanted. The very thing that had destroyed my life. The only person in this dying world I would die for.\n And I’d wanted Steret to fall into that place in my life, too—straight back into our time together on the mountain, the smell of fertilizer and soil and fire all around like a benediction. Maybe, maybe, I could make him see—\n “I couldn’t just leave Anaro,” he said, quietly, puncturing that dream.\n “Like we left everyone else?”\n As if summoned by an angel, Anaro appeared behind his shoulder and cleared her throat. The noise felt like a rock to my head.\n “He’s right,” she said. “Just because the god is dead doesn’t mean the rules no longer apply. Luckily, though, we just might be able to write our own. You know the god’s language, Elissa; want to see what the monks found?”\n I swept up the baby and followed Anaro down the ladder to the deck below. The corridor resembled the cathedral in every single way, almost godlike in its attention to detail. The artificial lights above burned cold like the angel-lamps, and the walls were made of frigid, smooth metal, too thin and too wide to be made by human blacksmiths, as well-worked as the guns we’d left with Steret. Had the guns been made by some hellish power, too?\n Anaro coughed, covering her mouth, and I watched with veiled interest as her hand came away clean. I felt immediately conscious of the blood-spotted bandana in my pocket.\n “If you’re not sick,” I said, “why is he keeping you around?”\n “We shouldn’t fight.”\n “He certainly can’t be in love with you.”\n She kicked open a compartment door. “Does it matter? I’m pregnant.”\n Nervous energy crackled between my ribs. The walls seemed a little closer, a little louder; a thin sheen of water on the deck licked my toes with the swaying of the waves. I felt for all the world like I wanted to drop through the bottom of the ship and drown. I hugged my own child closer.\n “But you knew what he swore. That we would live a hundred years together, that he would love only me—”\n Anaro set her jaw. “The angels want what they want. Do you think you’re the only miserable terror in this world? Steret’s first wife stayed home because she’d rather have one day alone than a hundred more with us. He’s not keeping me around. He’s keeping the baby around. If I had a choice, I’d be anywhere else. And now I do.”\n I felt dizzy. Looked down at my baby. Her luminous, large eyes. Her lips, already lined like they would be for the rest of her life. I tightened the carrier around my shoulder, and she reached out to twist a lock of hair around her finger. To tug. Hard. She wanted to be put down again. “This doesn’t mean we’re friends,” I said.\n Anaro laughed, then pointed inside the compartment. “We are definitely not friends.”\n I walked in and stopped in my tracks. This was a cathedral; a small one, no question of it. The place crackled with godlight, the instruments of prayer square and stacked and blinking, locked into waterproof cabinets. I saw everything I needed—prayerboards and monitors, alive with ancient prayers, spilling onto the smooth black surface over and over again like we had never burned away our connection to heaven. I felt a great, dark whirl in my gut, then put the baby on the floor.\n “Do you think you can—”\n But my fingers were already on the prayerboard. “Oh yes,” I said.\n I let the prayer flow through my fingers; brackets, and parentheses, and more of the god’s unsayable letters, time(NULL) and timePtr=localtime (&t) and int main(). I felt a frightened thrill as the monitor returned a set of numbers, as if everything outside was still completely normal.\n “What did you do?” Anaro whispered.\n “This is how you start a liturgy,” I said. “It’s how you ask what day and time it is in the god’s world, so you can enter the right prayers.”\n “So the god is alive.”\n I shook my head. My voice cracked. “I’m not sure what this is. We killed the god. The angels fell. The city burned.”\n “But what if we didn’t,” she whispered, her eyes wide and filled with fear. “Or worse—what if Steret’s right?”\n “The angels fell,” I repeated.\n “I don’t know what’s going on.” Anaro laid her hand, suddenly protective, on one of the god-machines. Her other hand pushed away the dark hair that hung in front of her half-sunken eyes. “If you continue to pray, if we use this cathedral—”\n “You’re worried about who will receive our prayers.” I locked eyes with her. We breathed in concert. In. Out. In again.\n I turned to the monitor and brought up the ship’s prayer book. Some of the prayers I knew, and some I did not, which was what I expected. Some might have been needed to steer the ship, although they used words I did not understand. Other prayers seemed to be for communication with the god’s world. I recognized the words found and colony, but few others.\n The silence between us grated. I wanted to end it. “How far along are you?”\n Anaro turned to look elsewhere. Her eyes caught a blinking green light. “Four months, I think.”\n “You don’t look happy.”\n Anaro rested her fingers on the wall. “Back there. With you. If he was willing to dismiss one child so easily—”\n The person Steret had once been popped up somewhere in the back of my mind, smiling at me with his gangling legs and yellow teeth. I ached. Love was a lie in every iteration. “You don’t need to worry. You’re the legal spouse. The child was angel-asked.”\n “He does love you.”\n “He has a funny way of showing it.” I prayed—straightened my wrists, just as the monks had taught me, and entered the sacred words to ask where the ship had come from, uttered every bracket and asterisk. When I was living in darkness, thinking Steret was coming for me, the monks had said I was the best they’d ever seen. They wanted me to say the vows and join us. You could keep the baby, they’d said, she could live her life in the basement and never go hungry.\n They probably would have said something different if they knew I was going to kill their god.\n Anaro gasped. “Is that—”\n We were staring at a string of sacred numbers.\n “That’s where we’re going,” I said.\n She stared at the numbers. “I don’t understand. These coordinates aren’t even possible.”\n “Heaven?”\n She breathed out. “Or hell. Steret’s right.”\n Or something else was going on, I thought, because I didn’t want Steret to be right. Something darker and more significant than any angel or demon or god-thing could promise, more terrible than the god that had trapped our ancestors in the world and starved us and fed us ash until we choked to death. Something with so much unfathomable power that it could live past the sins the three of us had committed together to welcome us into a life that was somehow beyond that. A being far, far beyond a simple god.\n A being that had just returned a set of coordinates that were outside the world.\n The baby was hungry.\n I sat down on the floor of the cathedral while Anaro went to get Steret. She huffed eh eh eh and reached for my bedraggled collar, and I let her nurse, the tug of life to life making me feel warm and blank and exhausted. I leaned against the machine-stack, closing my eyes, letting myself drift. I did not know when I would sleep again.\n Steret arrived in a rush of sweat and salt ocean. “It’s a demon-ship,” he said. “Those coordinates are for hell.”\n “We’re not going home,” Anaro said.\n “Well, I’m not going to hell,” he said.\n “We don’t know that’s what—”\n “I’m not going to let you take my baby to hell. I won’t allow it.”\n I dragged my eyes open to stare at him. At his eyes, his mouth—the things about him I’d loved so much, now so different, twisted, and rancid with fear. Anaro stepped between us, her fingers wide and placating. “So what do you propose? We live here in the middle of the ocean with only demons to eat? Or have you magically found some sort of recycling facility, some mud for mushrooms, a vat for meat?”\n “In hell—”\n “They eat in hell, Ster.”\n “Get out of the way. In my opinion—”\n Anaro rolled her eyes. “—here we go again—”\n “I brought the guns, I had the access to the supplies—”\n I dragged myself off the floor as they argued, waving their words around in circles like the legs of starving cockroaches. Husband. Wife. Was this murky fight what I’d wanted? I spent so much time stoking memories in the hearth of my heart, trying to keep them god-bright, only to find that it was all just paint and glitter from the beginning. Promises as thin as paper.\n The baby drank. I crossed the room to the prayerboard and entered the earliest prayer I’d learned—the one that stirred the god-engines on the fishing boats, the one that sent them into the bay to harvest anemic little fish. Around me, the ship groaned and shuddered like a womb, and an engine below spun and whined. I could feel a sudden force pushing against my feet, my back, my fingers, faster than any tiny fishing boat.\n Steret’s voice fell into a whisper. “Liss. What have you done?”\n “I made a promise.”\n His eyes widened. “To love me. I know. This isn’t love, it’s—”\n “Not you,” I said.\n Steret tugged Anaro up the stairs. They screamed at each other, now, laying blame like a road beneath their feet. He wanted to go back to the taste of mushroom on his tongue, the scent of fertilizer in his nose, watching the bodies go into the recycler chunk by chunk. She wanted him to be quiet. It was all just fear. I knew what fear was like.\n It was time for something new.\n Up the stairs, air moved fast and cold against my face, and the boat cut like a dull knife through the water, leaving a white trail like welling blood. The fisher-monks had gone to their knees, their hands raised to the low, darkling sky, pleading for reconciliation. I turned to see what they were so afraid of. As if I already knew how terrible it would be, I covered my baby’s eyes.\n The light.\n The light.\n Steret stood at the bow screaming about hell, his hair wild and limned with it—white light, white, a color I’d never truly understood until now. Surely this was hell, the place where light poured in shining gusts through a crack in the world. Light burned hot through my eyes to the back of my brain, but yet I did not die. Everyone else turned away, hiding their faces, their eyes, their futures.\n I forced myself to look.\n I saw a crack large enough to let a boat through, just as the prayers below had informed me.\n There were no words in scripture for what I had done. Either the ship would crash, would fold underneath us like paper, and we would drown here, at the end of everything, or—\n —or this was only another place where the ground met sky, a place where the entire world itself was bound in a sacred circle. Another cathedral.\n I felt an excited chill.\n Hunching away from the light, I tore long strips from my robe and tied them around my daughter’s eyes, and then my own. The darkness helped—enough to avoid the chunks of sky that fell onto the deck around us, loamy and wet, dislodged by the fast-moving air. I swept one into my hand.\n I’d never touched the sky before. It felt thick and solid, yet crumbled between my fingers like the wet loam on the mountain. I brought it to my face; it smelled exactly like the land I’d tilled nearly every day of my life, like the dead it supported, like the promise of life itself. It stilled me, even as everything sped into hollering chaos—\n “Hold on to something!” hollered Anaro. “Get below! Cover your eyes! Look away! We’re going to crash!”\n And then Steret’s hands were on my shoulders, and he was dislodging me from my reverie, and his arms went around me, around the baby, as the light grew closer and the sky came for us.\n But the ship did not crash.\n We sailed right through the crack in the world like the ship knew how to do it in its metal skin and bones, then came to an easy stop directly outside. Even with the help of the blindfold I could barely keep my eyes open. I felt the movements of people below, smelled fish and salt and air that had never known sulfur. I saw ships, hovering in the distance. Flying things with piercing cries and white wings. People on the other deck, waving. Human voices. It was everything I dreamed.\n And yet.\n Nobody moved.\n It’s funny, isn’t it, brothers and sisters, that even after we slaughtered a god, even after we took a demon’s ship to the edge of the world, that we were still scared to go the last few steps. We city folk prefer the coughing death to the death of pride, even as we called the darkness virtue. I think that was Steret’s problem. He was all for being a hero, until he realized that he didn’t have the answers. He’d always had the answers, even if they were wrong.\n But that reticence, that frightened cowardice, was always our curse. That is what kept us under the geas of the angels for so many generations, what kept our ancestors from killing the god. I knew I couldn’t have been the first person to learn how to write that prayer. I was simply the first person desperate enough to do it.\n “Get up, Steret,” I said, pushing away his arms.\n “I can’t.”\n “Get up,” I hissed.\n “I—” His voice wavered. “I can’t see.”\n I turned. In the light of hell, I could see his eyes as they truly were: green, the god’s color, the color we had so rarely seen outside the farms and the moss on the rocks to the north of the bay. Green like emeralds from the mines, cast against flame. I nearly stuttered to a stop to marvel at them, but—\n “Go below, then,” I said, instead. “It’s darker. You’ll be able to see. Get the monks in order. We can make some sort of signaling apparatus, figure out what’s going on—”\n He scrambled back. “What if we die?”\n “We have killed the god for this,” I said. My lungs filled with the loamy scent of the fallen sky, rattled with the salt in the air. With my own sweat. With the breath of hell. “We have killed demons. We have come to the end of the world, and now you are afraid?”\n “I’m not afraid,” he breathed. It was a lie. His chest rose and fell in the shallow rhythm of the god-choked, the rhythm that I had made my peace watching in the mirror every night. In the blaring light, I could see it now, the truth he’d been hiding from me this whole time: the rattle in his chest, the black spittle lodged at the corner of his mouth. “But if we die out here, if we die, what’s the point of everything we just did? Everything we’ve gone through? The angels—the city—the truth—”\n I hated to explain it to him. I hated to tell him in words what had been implicit in my world for these last exhausting months of my life. I hated to give him any more of the time that was left to me. The baby cried, her little mouth a wide, aching maw. I unhooked the carrier, kissed the baby on her forehead, and slipped her into Anaro’s waiting arms.\n “She is,” I said.\n I turned toward the bow, brothers and sisters, feeling the air itself move, cold and clear like water, caressing my arm, my cheek, my entire body, the light slamming into my eyes. The air moved through my hair, dragging tendrils around my shoulders, and I felt like a god. Like the god. I felt that if I jumped, the air would hold my body and my child up like twin bats, like we would grow thin, leather-black wings and scream our truth to echo in the entire cramped world.\n “You’re the demon,” said Steret, behind me, taking me out of my reverie. He pointed out to where the ships lay waiting for us. “You always have been—”\n Anaro slapped him.\n “You’re a coward, Steret,” said Anaro. “You say you can’t fight reality. That’s only because you won’t.”\n I stared at her. At my baby.\n “Go on,” Anaro said, giving me a thin smile. “Go say hello.”\n I climbed up on the railing and took a long look back. Then I slipped into the water that tasted of bloody salt, swimming for the ships.\n There is no god. There never was.\n Brothers and sisters, you will see the light first as a pinprick on the horizon. You will gather, starving, at the quiet edges of the bay, where the skinny alabaster fish lie rotting in their thousands. As your false sky falls away, as we come for you, you will have to close your eyes, cover them with your hands, with cloth and with metal, but the pain will only last a little while.\n Your eyes will adjust to the truth, and when you open them to the desperate blue beyond, you will see the prophecy in fruition: ships, dozens of them, coming to carry you to your true home—the place we turned away from generations ago because of a terrible lie, a place full of trees and lakes and sunlight. I will be standing on the bowsprit to greet you, with Anaro and our children and those who scooped us out of the water.\n You will scream about the prophecy, the ship that will come at the end of the world.\n I know you will not understand, when we come. It will look like the end of the world, but the end of the world is just a story told to you by people who want you to remain lost to what truly is. The world is so much bigger than we could ever imagine. There is music and dancing and fruit as big as your fist. The others, the astronauts who tried to find you, had been locked out from our systems for so many generations that they thought we were all dead. But some never gave up on us—just as we never gave up on them.\n I know it hurts.\n The truth always does.\n As the sky falls, the air will move around you, press at your skin, worry at your mouth. You will taste salt on your tongue, salt and loam from some faraway place. Do not be afraid. It is only the wind. It is your birthright.\n You need not worry about going to hell.\n You were born there.\n Karen Osborne is a speculative fiction writer and visual storyteller living in Baltimore. She is the author of Architects of Memory and Engines of Oblivion from Tor Books, and her work has been nominated for the Nebula, Sturgeon and Locus Awards. A graduate of Viable Paradise and the Clarion Writers’ Workshop, her short fiction appears in Uncanny, Fireside, Escape Pod, Beneath Ceaseless Skies, and more."}