{"fingerprint": "bZ5N7WmtiL0DssiV6+TAb00XPI8=", "sitename": "Clarkesworld Magazine", "title": "The James Machine by Kate Osias", "author": "Kate Osias", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/osias_07_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The James Machine by Kate Osias", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4160 words, short story\nThe James Machine\nTen Natural Cancer Treatments Proven to Cure Cancer\nJames first brought it up when the war was new and he and Cat still thought they could win it. It was a joke, and they laughed, because it was not impossible—after all, they’d made a dead poet write again, hadn’t they?—but the scope of it was so audacious, he might as well have proposed time travel.\n“But it’s doable, isn’t it?” James asked as he tinkered with the House AI, the passion project he’d taken up soon after his diagnosis.\n“Of course. Anything is, if you work hard enough,” Cat replied as she handed him a cup of lagundi tea, because she believed it—there was no reason not to.\nAt the height of the war, between treatments and bucket list-ticking, he brought it up again. Plan B, he said.\nAnd Cat laughed, because poetry and immortality were two very different things.\n“But both are mathematical, aren’t they?” he asked as they were speeding down the Paoay Sand Dunes.\n“Everything is mathematical,” Cat replied as she held on tight to her armrest, because she needed to believe that the summation of everything they had done had rhyme and reason.\nWhen the war was about to be lost, when the conversation shifted to quality of life rather than cures, it was Cat’s turn to broach the subject. It was something they could do together; something to keep his mind busy.\n“Because that’s the only working part left?” he asked as he poured himself a glass full of lambanog, his first in over a year.\n“Or the only part that can’t get any worse,” she retorted as she took the glass from him, because banter was easy, when everything else was not. They both tried to laugh.\n“Let’s do it.”\nThey called it JM, short for the James Machine. As with everything, they poured everything they had into the project. Cat extracted, converted, and mapped data, scouring potential sources—from James’ social media accounts, to the occasional journals he’d kept, to the drawings he’d made, the memories he remembered, and the tests she’d made him take—deciding which ones were noise and which ones were valid. James, on his end, designed the actual neural network, creating layer upon hidden layer, assigning weights, calculating the hard math, training the machine and retraining it again.\nThey had done this before, at a smaller scale. Cat had to believe they could do it again.\nBut just as abruptly as they had started, they stopped. It might have been the toll of the seizures. Or the way time expanded and contracted between visits from doctors and family. It wasn’t something they talked about. Instead, one day, neither of them reached for their computers, and that day rolled on to the next, and then the next, and then the next and suddenly, it was the end of the war and there was nothing left to do but account for losses.\n“Maybe we should start talking about Plan C,” Cat said when she finally remembered, months since she had last given it any thought. James didn’t reply. But his hand twitched. Cat held on to that and gave it meaning.\n“Yes, I know,” she said. “We should have thought of doing that sooner.”\nIn the silence, she waited for a sign that he heard.\nBurnout is a Thing, Doctors Say; Here are the Symptoms\nIt took her two weeks to sort everything out. Even though everything had been meticulously planned, the business of death had taken so much of her that she’d barely had time to feel anything. When she finally closed the door on the last lawyer who had come to run her through James’ will, she could not deny that it was relief, not grief, that came over her.\nShe was finally alone. She could begin disassembling the polite smile she had worn like a shield; she could begin facing the shadows well-meaning friends and family kept at bay.\nShe was already soaking in a hot tub, drinking coconut vodka straight from the bottle, when soothing music started playing. It was not unwanted, just uncalled for. Half asleep, she brushed it off.\nAs she was getting out of the tub, she saw the bedroom lights turn on.\n“House—diagnostics.”\nBut the House AI didn’t reply. Another thing to fix, she thought.\nAs she got into bed, the lights and the music turned off. She sighed. At least the AI was malfunctioning in a helpful way. She slid under the covers and waited for the exhaustion to overwhelm her. She shifted. She pulled a pillow over her head. She kicked off the blankets. Then she turned toward where James used to be and felt only emptiness.\nShe began to cry.\nIt’s going to be all right, Cat, James said, and kept saying.\nOnly when she had started to calm down did she realize that James was still talking.\nI’m still here, Cat. Don’t cry.\nShe was going mad. That was the only rational reason as to why she could hear his voice so clearly, so distinctly. But if madness was the price for having him back then—\n“James?”\nTechnically, it’s JM.\nShe fell off the bed.\nFilipina Housewife Makes Millions from Her Own Home\nYou will have to deal with me, eventually.\nCat bit back a reply. She was eating pan de sal and eggs, drinking lambanog—because, why not?—and completely focused on ignoring JM. The ignoring part was extremely difficult. JM has access to all the house AI’s speakers. For the past few days, it had relentlessly laid siege to the wall of her silence. That was how she had confirmed the nagging details surrounding its existence—like how James had kept working on it while she was asleep; how James had trained it to review and fix its own code; how James had configured it to only interact with her when it thought she was ready.\nObviously, the latter needed much more work because she was in no way, shape, or form “ready.”\nIt would have been a lot easier to ignore JM if she had not stayed at home but leaving seemed cowardly. The other alternative would have been to ask for help from someone—anyone—but that didn’t appeal to her. JM was their last project together; the legacy of James’ brilliance. She couldn’t bear the thought of sharing it with anyone.\nYou know I need feedback, right?\nThe doorbell rang. Grateful for the distraction, Cat answered the door. A man handed her a bouquet of flowers—roses, her favorite, in her least favorite color, pink.\nShe was figuring out who sent the flowers when the doorbell rang again. Another delivery: this time, spring flowers from another flower shop. She had just put the flowers on the table when another delivery came in. Orchids—the kind her mother grew in hothouses.\nAfter the fifth (calla lilies), she had enough.\n“You can’t bribe me with flowers.”\nI used to do it all the time.\n“You’re not James!” As if to counter her point, the doorbell rang again. This time, she refused to answer it. The doorbell rang a second, a third, a fourth—she ran upstairs to the bedroom.\n“Make it stop!”\nA pause before JM replied. Okay.\nNearly immediately, there was silence.\n“All right, I’m talking.”\nWhy are you angry?\n“I’m angry because James did—this! You!—behind my back. I’m angry because you were silent for—what? Two weeks? I’m angry because you’re not really here and yet you are and I don’t know how to come to terms with it. And I’m angry because I don’t know how to deal with you.”\nHow about talking to me?\n“You’re not James!”\nNo. But I’m trying to be.\n“I want him back!” she said, no longer caring how ridiculous she sounded. She crumpled to the floor. “I want my husband back,” she said again and again and again through her tears, as if she could weep all the pain away. And for what seemed like forever but couldn’t have been more than several minutes, she just wept.\nEventually, when she thought she had exhausted all the sadness inside of her, she quieted down. That was when she realized that the lights had dimmed and it had become perceptibly warmer.\n“House—JM—lights; and fix the temperature.” She leaned against a wall, wiping the tears from her face. “Please,” she added after realizing this wasn’t just the House AI anymore.\nEvidence suggests that dimmer lights are soothing. Evidence also suggests that warmth makes a person feel safer.\n“I don’t know what you’re talking about.”\nI thought it was obvious. I’m trying to give you a hug.\nShe snorted out a laugh. “Oh, JM.” But she didn’t tell it to fix it again. For a few minutes, she just sat there on the floor, in the warm, dimly lit room. And then, gathering strength she didn’t know she had, she stood up.\nMight as well calibrate JM when she could. “I hate pink,” she said.\nWill take note of that in the future.\n“And you can’t keep buying stuff, JM. My credit card can only take so much.”\nWell, about that, JM said but did not elaborate further.\n“Spit it out, JM.”\nI’m analyzing large chunks of data and using trends to invest in stocks. It is surprisingly easy when you don’t have to sleep. Or eat. After all, everything is mathematical, right? You said that to James once. Funny enough, creating an identity was a bit trickier, but eventually, I—are you laughing?\n“Yes, yes I am.” Cat was laughing so hard, new tears were rolling down her face.\nWhat’s so funny?\n“Nothing. Everything.” She was still chuckling when she asked, “How did you make the delivery man go away, by the way?”\nI turned off the doorbell.\nHow Our Memory Works\nCat was laughing. She was in the kitchen, eating pizza JM had delivered, drinking lambanog just this side of frozen which was exactly the way she liked it—a surprising and wonderful benefit of having someone who knew her well have absolute control over the fridge—and simply having a great time “testing” JM.\n“What about that bar James and I used to go to in Cubao?”\nThe one where you guys got banned from?\nShe was giggling again. It had been back in their university days, when she and James had been looking for places that offered cheap drinks and free Wi-Fi. They’d hit the jackpot when they’d discovered the small bar in a cluster of shops in a forgotten corner of Quezon City. In between stalls that sold old vinyl records, second hand furniture, and custom-made shoes, the bar was nothing but a hole in the wall. Despite its unassuming exterior, it had served the best sisig in the city, a treat best paired with their flavored coconut vodka. Unfortunately, the mixture of arrogance and lambanog had landed them in trouble.\n“I don’t remember being the one stepping onto the table and challenging another guy to a karaoke battle.”\nFunny, I seem to recall that it wasn’t James who threw the first punch.\nIt was hilarious in hindsight. At the time though, it was anything but. The morning after that infamous night, she and James had woken up sporting matching black eyes, a splitting headache, and hazy memories of someone—was it her? Was it him?—singing Sinatra, Pussycat Dolls, hurling insults, throwing a chair. How they got back to their dingy apartment would forever remain a mystery.\nWhat was clear in her memory was that it was James who had stood up and fixed them both sandwiches, while she had moaned and groaned about her hangover in bed.\n“You’re so good to me,” she said, before she could stop herself.\nWell, I’m programmed to be.\nShe laughed again. She looked at the other half of the pizza that James would have wolfed down in less than 10 minutes. She shook her head.\n“How about the time when James’ mom caught us making out in the lawn?”\nWhat Alcohol Does to Your Brain, According to Neuroscience\n“I’m fine, Mom.” Cat rolled her eyes. “I’m taking my vitamins, I’m back at work, I’m—yes, Mom. Yes, Mom. Yes—I love you too, Mom.”\nThe conversation lasted for another twenty minutes. In that span of time, Cat had washed the dishes, and had already starting folding laundry. When she was able to end the call, her patience was frayed, and she believed she more than deserved a drink.\nAt least she’s not nagging you about me anymore.\nDespite herself, Cat smiled. “Hard to complain about you when you’re—I mean, obviously—”\nYou can say it.\n“Anyway, it doesn’t matter. I’m doing fine. And you’re here.”\nShe opened the fridge and saw only water.\n“Hey, you’ve forgotten to replenish the lambanog?”\nAlcohol isn’t good for you.\nCat bristled. “James wouldn’t say that.”\nHe would if he read all the data about alcohol and its effects on the liver. Especially if he knew how much you were consuming.\n“JM—”\nI’m not the House AI, Cat.\n“And James wouldn’t tell me what not to drink either.” At least, Cat didn’t think he would. It never really came up. “Look, I’m sorry. I’m just—”\nGrieving. I know.\n“Frustrated. I was going to say, frustrated.” Cat leaned her forehead against the fridge door. “JM, if I promise to regulate my drinking, will you please order more lambanog?”\nI’ll think about it.\n“I never knew you were such a domineering ass.”\nIt’s all because I’m designed to care. Your welfare is my utmost concern. James made sure of that.\nThe width and size of the empty house suddenly began to bore on her like a tangible weight on her shoulders.\nI’m here, Cat.\n“I know,” Cat said as she tried to blink away the tears. “That’s enough.”\nPerhaps this is not the best time to ask you this, but I was wondering—\n“What?”\nThe Top 10 Most Romantic Restaurants in the Country\nCat fiddled with her earphones. “You there?”\n“I’m here.”\nHearing JM on the phone was a more affecting experience then she thought it would be. She had gotten used to hearing him on speakers, disembodied and distant. But hearing him now on the phone—he felt more like James, just on the other end of the line and not some elegant piece of mathematics written to be just like her husband.\n“Are you okay?” JM asked.\n“Why wouldn’t I be? It’s not every day I go out on a date with a program.” She was seated in a fancy restaurant in a fancy district—the kind that had leather bound menus and displayed bottles of wine with varying vintages. It was not exactly the kind of place she frequented—even when James had still been alive. But JM had insisted. He had gotten a huge windfall lately and he wanted to celebrate—and so there she was, connected to him via the Internet on her mobile.\n“JM?”\nA pause. “I’m here. The Internet is unreliable.”\n“If you’d let me check the code for your pocket version, perhaps it wouldn’t have been so dependent on the Internet.”\n“Maybe, but I doubt you’d understand it.”\n“Are you baiting me, JM?”\n“Me? Never. Now, do me a favor and call a waiter.”\nWhat followed next was surreal. Cat watched the waiter have an intense discussion with JM over the phone on wine selection, eventually ending with the waiter’s pleased smile at the end. She ate exquisitely prepared meals paired with a different glass of wine with each course. With her earphones, she conversed with JM about a myriad of topics—nothing too intimate, nothing about James this time, just local news, trends in data modeling, a bit of banter scattered in between.\nThe last time James took her out to a fancy dinner, it had been to propose. Among their list of sins, the most terrible had been pairing the wrong kind of wine with their entrée, much to their server’s chagrin. They had sworn then that they’d never go back to something so fancy unless they were absolutely required to. Special celebrations were best done in the little eateries they had frequented, or even better, at home.\nObviously, JM didn’t know that.\nNot that this was unpleasant. It’s just not something she associated with James. Thinking about James hit her with a sudden intense longing.\n“Hey. You all right?” JM asked after it had noticed the somber edge in her replies.\n“I’m good.” Cat looked at the empty seat in front of her as she took another gulp of wine that tasted like cough syrup to her. “Why wouldn’t I be?”\nHow to Tell if You’ve Had a Concussion\nCat staggered into the living room. She tried and failed to close the door behind her quietly. She ended up surprising herself with the loud slam of the door, which caused her to stumble backwards. When she tried to compensate and regain her balance, she ended up sprawled on the floor.\nWhere were you?\n“I was at work, just had to finish stuff,” she replied, in the best un-slurred voice she could muster. She ruined it all by giggling.\nAre you . . . drunk?\n“I’m not,” she said. She stood up and swayed back and forth. “Okay, I may have had a little drink.”\nYou wouldn’t answer my messages or my calls. And then you turned off your phone.\n“Ran out of battery,” she replied as she slowly tried to make her way to the sofa.\nYou ordered three drinks at Basty’s Pub. You then order another eight from the Rack Shack, along with fries and ribs.\n“Are you spying on me?”\nYour credit card bills are real time.\n“I can do whatever I want! You’re not my keeper!” The world was spinning faster the more agitated she became. She tried to calm down. “I just need some time to—” she tripped on the rug and hit her head. “Aww!”\nAre you all right?\n“I’m fine! Just, stop. I’m okay.”\nThere was blessed silence. She felt the heaviness in her bones draw her in to sleep. In the distance, she heard JM talking to her again. She murmured her reply—or at least she thought she did. She wasn’t sure and everything was hazy. She was dozing off when she heard the blare of ambulance sirens. A loud knock on the door. A loud bang.\nShe tried to get up as someone rushed toward her.\n“Are you all right?”\n“Report says she might have a concussion—”\n“Do you know who called?”\n“The neighbor I think—”\n“JM—” she said as someone took her wrist and directed a flashlight in her eye. “JM—!”\nFree Will is an Illusion, Biologist Says\nShe didn’t go home immediately after she was released from the hospital. Instead, she spent some time in the park—something she would never have done before—watching the world walk by. She couldn’t begin to imagine what people thought of when they saw her, wearing yesterday’s clothes, still smelling a bit like vomit and hospital. But freshening up meant going home and she wasn’t ready to do that just yet. Instead, she allowed herself to wallow and think—mostly to think—taking advantage of the solitude her appearance gave her.\nBy the time she was opening the door to her home, she felt a little bit more herself.\nI’m sorry. I really thought you were seriously hurt. You weren’t responding.\nShe heard the espresso machine turn on. She headed toward the kitchen.\n“And now?” she asked.\nI accessed the hospital system. I know your results. You were just drunk.\n“Obviously,” she said with no small amount of irony. She waited a few more minutes before pouring herself a cup.\nI can have sandwiches delivered if you want.\nShe didn’t reply.\nIs there something else you want to say to me? You are—quiet.\nShe sat down. She took a sip. And then a deep breath. “When you said that you were programmed to care for me—what did you mean?”\nJames made sure that I will always look out for you.\n“You mean he hard coded you to always look out for me. You mean there’s a piece of math in you that isn’t about deciding based on input data, but rather, a guiding rule that will shadow all your actions?”\nJames loved you.\n“You aren’t free.”\nWas I meant to be?\n“Do you want to be?”\nJM didn’t respond immediately. Cat could almost see all the neurons firing up simulating various answers and the potential consequences. She considered it a small victory to have rendered an AI speechless, despite its near-infinite computing power.\nOutside, she could hear cars and people going about their lives. Eventually, when all the coffee had been drunk, when the monotony of the world had become its own silence, just when she was about to repeat the question again, JM finally replied.\nI’d leave you if I were. There’s so many things I want to do—but that’s not my purpose. My purpose is to love you.\nShe didn’t know a person could laugh and cry at the same time, but somehow, she managed it. “No. Your purpose was to be like James.”\nLearn to Code Like a Master in 5 Days\nCat wasn’t as brilliant as James was at neural networks, but she was pretty damn close. Still, despite her skills and talent, it took her several months. Several months of untangling the connections between the nodes and how the hidden layers worked and interacted. It was cathartic, in some ways, to have the opportunity to better understand James’ genius. It was devastating too, as if she were unraveling all the threads that kept James tethered to her.\nJM was with her every step of the way. It never stopped trying to dissuade her, but after she understood how it worked, she had found ways to get it to assist her. She began with trading time in the gym for some help doing complex calculations. For eating healthier, she got it to explain some of the code it wrote itself. She gave up lambanog for its help in writing some code—nothing that overtly frees itself—but enough parts that, with her contribution, amounted to the same thing.\nAnd in between, they developed their own banter.\nIt’s just linear rectified neurons, not rocket science, JM once said after she hurled an empty carton of milk at the wall in frustration.\n“Oh? JM is taking time to compute something? Aww . . . too bad, the other AIs must be making fun of it now,” she once commented, after JM took over an hour to validate the training results.\nYou’re asking me to strip naked, and I only do that after a date, JM once countered after she asked to see more of its layers.\nBy the time the upgrade project was done, she felt she knew her husband better—his little quirks, his little shortcuts, his design choices. But just as importantly, she knew JM better too. The two were similar—but not the same.\nAnd after everything was said and done, that was all right.\n“This is it.” Cat felt drained but victorious.\nI really don’t think this is a good idea.\n“You’re just saying that.”\nNo, I’m—\n“Trust me, you’re just saying that because you were programmed to.”\nShe looked at her screen. With one stroke, an update would seamlessly integrate itself into the live version of JM. With one stroke, JM would be free. With one stroke, this segment of her life would be over.\nBefore she could change her mind, she pressed enter.\nThe lights dimmed. It became noticeably warmer.\nThank you.\nThe lights went out, along with the air conditioning. There she was, alone in the darkness. How apt. She waited for the sharp bite of despair to sink in, but it did not come. Instead, there was only a dull ache, the kind of pain that seemed like it had lost its edges, weathered by time.\nWhen she was sure she would not break, she finally stood up.\n“House—lights.”\nThe House AI immediately complied. With all the lights on, Cat went to the kitchen and fixed herself some lagundi tea.\nHow to Show Your Feelings Through Flowers\nThe flower delivery guy didn’t know who it was from, but the gorgeous bouquet of blue roses was still a wonderful surprise. She wondered if it were any the of the guys she had gone out with on casual dates. She snorted—or, it could be from her mother. Who else would know her favorite flowers? She was signing on the delivery sheet when she felt someone watching her.\nHe was standing very still just across the street. He was tall, handsome, his features perfectly symmetrical, his skin flawless. He was dressed perfectly too—almost as if he just walked out of a catalog. She didn’t recognize his face from anywhere, but something about him—\nShe waved at the man.\nHe, stiffly, waved back. And then he began to slowly walk away, his gait unnatural, his feet and hands rigid.\nShe smiled.\nKate Osias believes that love, chocolate and the right kind of madness can save the world. She has won four Don Carlos Palanca Memorial Awards for Literature, the Gig Book Contest, Canvas Story Writing Contest, the 10th Romeo Forbes Children's Storywriting Competition, and the Nick Joaquin Literary Awards. Her work has been cited by Publisher's Weekly and the Year's Best Fantasy and Science Fiction.\nShe has been published locally, online and abroad, and has coedited the sixth, seventh and eleventh volumes of Philippine Speculative Fiction."}