{"fingerprint": "hjDyZ6wG1k7iyb6uKafSahR+RP0=", "sitename": "Clarkesworld Magazine", "title": "If the Mountain Comes by An Owomoyela", "author": "An Owomoyela", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/owomoyela_06_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: If the Mountain Comes by An Owomoyela", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4820 words, short story\nIf the Mountain Comes\nFrançois and Papa were outside, discussing what to do if the water rose. I was in, scrubbing blood from the walls with a palmful of sand.\nThat was the summer Enah came to our village. He’d led a donkey, and the donkey pulled a cart with tools, a flowering lilac, and a barrel of fresh water. The barrel made Enah richer than the doctor, richer than the preacher. Richer than anyone but us, and he meant to change that.\nI heard footsteps crunching the cracked earth outside, but I assumed it was a pumpyard guard until Papa went silent and his dogs went barking mad and I looked to see why. There they were, in the dry riverbed: Papa and François and the Rottweilers all glaring at Enah, who approached as though he feared nothing. He had skin as dark as François; he walked barefoot, and smiled. People weren’t in the habit of smiling at my father.\nEnah and Papa exchanged a few words, then turned and came into the house with the dogs keeping pace. “Make us tea,” Papa said, and I was banished to the kitchen. I boiled the water and measured the leaves, and brought out the teapot and the cups, several of them chipped. I poured for my father first, then Enah. Enah didn’t say anything. Not even to acknowledge such luxury.\n“In the next months, I’m going to sink my pumps another ten meters into the ground,” Papa was saying. “I can bring more water up and provide it even more cheaply to the people of this village.”\n“The people of this village do not want to pay for something the world provides freely,” Enah said. Papa snorted, boar-like.\n“Not so freely. My grandfather would have called this a drought; I call it the state of things. It rains perhaps thirty days a year. Your program might work where you’re from, but here, it’s foolishness.”\nEnah shrugged. “There was a river here once,” he said, and sipped the steaming tea.\n“That mountain to the east was a volcano once,” Papa said. “The world changes.”\n“And we are often the ones who change it.” Enah shrugged again. “That’s what I’ve promised them, Mr. Wolfe: there was a river here once and there will be again.”\nThey sat watching each other for a moment, these two men, Enah small and strange with laughter lines around his mouth and forehead, Papa solid and strong with anger carved into his brow.\n“There is a house here now,” Papa said. “A family. A dozen workers. Water pumps. You’d have us all vanish?”\n“No, no,” Enah said. “I’d have you go up the bank, join the rest of your town. It must be lonely down here.”\nIt was lonely down there.\nEver since Mama died, Papa and I went around with a higher awareness of mortality. His mortality, mostly. Papa wasn’t a young man, and death was something we expected with half a head. Death was like rain—uncommon, but it would come.\nSo ever since Mama died, I had a bag packed, and I was ready to run away. I knew I couldn’t survive on the riverbed without Papa, though I didn’t know where I could go. Up to the village, if they’d take me, but what would I do? Set bones, or forage in the brush, or whore myself?\nOr I could set off. See what lay beyond the horizon, and beyond the horizon beyond that. Water would be the problem—so heavy, so necessary, and something that unlike the people of the village I had never learned to go without.\nThe riverbed had been parched for as long as I could remember, its dirt cracked and peeling like thick and brittle plates. You could throw them toward the bank, and watch them burst into plumes of dust. Our family drilled deep and sucked water from the earth, and it was enough to keep us wealthy, by our own, dusty standards of wealth.\nPapa sent Enah away. Then he went out to the pumpyard, and I ran out after our visitor. “Wait!”\nEnah turned and looked at me. “We weren’t introduced,” he said.\n“I’m Lena,” I said. “Lena Wolfe. You say you can bring the river back?”\nHe looked up and down the riverbed. The town was clustered on the bank, and my grandfather’s home and his father’s home connected the town and our farm like the dots of an ellipsis. My family had always followed the water.\n“Let me ask you something,” Enah said. “Why is it you think these people don’t seek their fortunes elsewhere?”\nI shrugged. “This is home,” I said.\nHe nodded. “It’s their home, and it’s still possible to live here. If it is possible to live, many will stay where they’ve buried their parents, and where they’ve dug the wells with their hands, and laid the cobblestones. And besides, the sun is hot everywhere. Water is precious everywhere.” He tapped the ground with one foot. “What is the name of this river?”\nThe name dried up when the water did. I think Papa knew it. I think it was written on the old maps, but we didn’t use the old maps. “It doesn’t have one.”\nEnah turned to look at me, and his eyes were as sharp as a carrion bird’s. “That’s sad, isn’t it?” he said. “I’ve brought waters to desert arroyos, Lena. I can make this river flow again. And when the waters flow again, your town will name it.”\nHe reached out to touch my cheek, and I stepped back. Ordinarily, no one would touch me—I’d have a dog, like Papa’s dogs, to dissuade anyone from coming too close. Not then, though. Papa had killed my dog that morning.\n“There will be enough water to grow hyacinths here,” Enah said.\n“What are hyacinths?” I asked.\nI went to the pumpyard to draw water to pay the guards’ salaries. I hated going to the pumps, but they were locked so the guards couldn’t draw their own. The men who guarded them, with old automatics and new machetes, looked at me as though only my father kept them from leaping on me like wolves.\nOnly my father. So much in my life was because of my father, or only my father. Because of my father, I would never die of thirst. Only my father aimed to keep life and death in a birdcage on his accounting desk.\nWhen I’d filled the jugs and dragged the heavy handcart back to Papa’s office, I saw Papa yelling at François. Almost-yelling. Papa only barely raised his voice, but it felt like a shot from a cannon.\n“By God, they won’t have their way!” Papa was saying.\nFrançois, a braver man than most, said “God is not always merciful to our needs.”\nI’d never heard him speak back to Papa before.\n“I don’t care about God’s mercy,” Papa said. “Who has mercy? He doesn’t. I don’t. And you least of all.” His voice became harder, like stone. “Go find whoever brought this troublemaker to our village. Make sure they don’t bring any more trouble our way.”\nFrançois stood with his jaw muscles bulging. He must have been biting down hard.\n“Well?” Papa said, and raised his hand as though to strike him. “Go on! Go!”\nFrançois turned and walked outside.\nPapa turned to me, and I stared at him. Then he sighed, and clicked his fingers twice. One of the dogs perked his ears, ready for commands.\n“You should take Brutus,” Papa said, though neither of his dogs will obey anyone but him. “Jaime’s bitch is about to pup; we’ll train up another dog for you soon.”\n“I’d rather have Mogul back,” I said.\nPapa was not a man who showed sadness, but sometimes, I could catch a softness in his eyes. Only for me. “They never live once the bloody coughs start.”\n“You never treat them,” I said.\n“We are all dying, Lena,” he said, and started out past me. “If I kill them a week before their time or five years before their time, what does it matter?” He stopped at the doorway to touch my cheek. “You are the only one I will fight to keep alive.”\nPapa would fight anything. Fighting was the only life he knew.\nWhen my mother came down with the cough, he fought the doctors. He fought the dust which rolled in through the windows. He even fought my mother’s body. When she died, he seemed like a man who’d lost a public match—pride smarting, eyes burning, looking to prove himself back up.\nBy that summer, when the dogs were sick, he’d take a machete and lop off their heads. Maybe he thought it was winning if he didn’t watch them dwindle away.\nI went to fill the drip-irrigators. I passed the side path leading to the gate, where François was sharpening his machete, his skin gleaming in the sunlight in contrast to my own. François was as strong and dark as Mogul once was, and I was as tan and useless as the dirt on the riverbed.\n“Where’s your dog?” he demanded.\n“He was sick,” I said.\nFrançois said, huh, and went back to sharpening.\n“What did you mean,” I asked him, “that God is not always merciful?”\n“You know what I meant. The world doesn’t work the way we’d like it.”\n“But why did you say it?” I asked. “Why God?”\nFrançois shrugged one corded shoulder. “A saying came to mind. A story my parents told me.”\nPapa never told me stories. Mama had, but Mama was gone. “Tell me,” I said.\nFrançois grimaced. I think he wanted to be rid of me. He didn’t speak much, and especially not to me. Still, my father paid him, and paid him twice as much as anyone else on the water farm, so he indulged most things.\n“The Prophet Mohammed was told to prove the greatness of God,” François said. “He shook his fist at a mountain and said ’Come here, mountain, so I may pray on you!’ The mountain didn’t come. The Prophet turned to his people and said ’If that mountain had come, it would have crushed us. So you see, God is merciful. I’ll go to the mountain and thank God for sparing his foolish children.’”\nI chewed on that. “So if the river comes, God won’t stop the water from flooding our home?”\nFrançois shrugged.\n“Why aren’t you Muslim?” I asked. “You still remember those Islamic stories. Weren’t your parents Muslims?”\nFrançois put the finishing edge on his machete and stood up. “You’ll learn one day that you can’t always do what your parents want you to,” he said. He looked over at the edge of the river, up toward the village on the lip. “My parents would be disappointed in what I do. Besides.” He rested his machete on his shoulder. “It’s not right to profess what you don’t believe.”\nI didn’t believe in a God, either. My father prayed, but never told me who he prayed to. Mama had been a Catholic from an old sect. I usually found François the most sensible of all of them.\nI took two gallons of water, separated into quarts, up the bank to the market. The people there watched me, many of them angry, but not as hungry as the guards we kept sweating and rich on the farm. Papa said people resented the rich, and that it shouldn’t bother me.\nFrançois had followed me up and I wondered if my father had told him to be my dog until I had a new one, but then he went on his way and I put him out of my mind.\nThe noise of the market quieted as I passed by, and resumed again in pitched whispers, and the stares were more furtive. Because I didn’t have my dog, or because of Enah?\nI found Jaime, who was at least kind to me, under a frayed sunshade, fixing small electronics. A rickety contraption of rods and wires with a metal dish in the middle was perched on the edge of his table, with a radio tied into it.\n“What is that?” I asked, and he flashed me a grin.\n“Listen to that,” he said, and turned the radio on.\nThere weren’t many stations nearby—there was the Christ Channel, and the staticky weather for a city climates away. And then there was this, a violin, a channel I’d never heard before.\nI strained forward into the music. “Is it a new station?”\n“Just far away,” Jaime said. “But with that antenna, I can focus in on it.” He turned up the volume as high as it would go. I closed my eyes and breathed it in.\nThe song ended, and someone spoke in a foreign tongue. “Papa says you have a dog ready to pup,” I said.\nJaime nodded. “Any day now. The best of my stock.”\n“We’ll want to buy a boy,” I said. “If there’s one you don’t keep back for breeding, reserve it for us.”\nHe looked at me quizzically. “I noticed you didn’t have Mogul with you.”\nHe didn’t ask, What happened? And so I didn’t tell him, even as the words pressed on the back of my tongue. I didn’t say how his entire body had shaken when he sneezed, how blood had sprayed out from his nostrils to paint the living room walls. “He was sick,” I said. And they never live once the coughing starts.\nJaime understood. “Tell your Papa that these dogs are companions and workers, not pieces of equipment he can use up and replace.” There was no heat to his tone. We were his best customers, and sometimes his only customers for months at a time.\nBeside him, the man on the radio stopped talking and a new song started up. “Jaime,” I asked. “Why don’t we make anything that beautiful?”\nJaime shook his head. “What do you mean? Don’t you see the soapstone carvings Elise does? Hear Luc singing to his rabbits? See the mats Camille weaves out of the grasses? There are beautiful things all over the village.”\n“Yes, yes,” I answered, but my head was full of the violin, my mind’s eye captured by the curves of its wood. I had only seen pictures in old books. “But why don’t we make anything that beautiful?”\nJaime sighed. “Because beautiful flowers don’t grow on dry clay, girl,” he said, and I felt myself drop in his estimation. “When we’re not too busy scraping by, we’ll go to another city just to buy a violin. Or perhaps you should ask your father to buy one for you.”\nThe words stung, so I turned to leave.\nI bought rabbit meat from Luc, and wild garlic and scrawny tubers from strange old Abed. Traded water for soap, for thread, for a tin of white paint to cover the blood I hadn’t been able to scrub away. Then I started back down toward the water farm, but Enah caught my eye.\nHe was sitting on the edge of his cart, at the lip of the river bank, leaning down to draw pictures in the dirt with a stick. He was surrounded by villagers, and all of them watched him like a prophet. I drew nearer.\n“. . . and when that is done,” he was saying, “there will be water to last you between rains, and we can turn our attention to healing the river. We’ll dig percolation trenches, to let water return to the aquifer.”\nBy then people had noticed me, and they were muttering. I’d decided it was time to go when Enah looked up and motioned me forward.\n“It’s all right,” he said. “Come up and see.” He looked to the villagers, and before they could say anything he said, “The water we’ll bring is for everyone; go ahead and let her in.”\n“She’ll just tell her father,” one of them said. I didn’t look to see who.\n“I’d tell him myself if he asked me,” Enah said. “Come up, Miss Wolfe.”\nI looked around at the faces of the people who hated my family. They seemed foreign, and at first I didn’t know why; of course I had little interaction with them, but I knew their faces. I saw their houses on the hill.\nThen it struck me. I had never seen the flicker of hope in their eyes, and now they watched Enah as though he were the word of God. I thought back to François, and felt that I was standing on the edge of a cliff. I stepped up.\n“Have you ever heard the words ’watershed management,’ Miss Wolfe?” Enah asked. I shook my head. “Do you know what a water table is? A kund?”\n“I know the aquifer is drying,” I said. A rumble passed from mouth to mouth in the crowd.\n“That’s because this place,” Enah said, and gestured over the village, “is designed to waste water. It rains, and the water evaporates again. With bunds and kunds and ditches, we can train it to go back into the aquifer, and capture it from this whole land surrounding your village—”\nHe was interrupted by screaming.\nEnah seemed confused, but the villagers knew their screams. They broke and ran, ready to help someone bit by a snake or trapped under an ancient, crumbled wall, but what they found was Jaime, his wife crouched over him and keening, his radio smashed. My heart caught and I stepped forward, knowing what I would see—and I saw that his head was lying separately to his body, the two of them connected by a sweep of bright blood.\nThen it was my turn to break away from them and run. It took the villagers a moment to work through why I was running away from them, and then a yell went up. I heard Enah’s voice, nasal and rising, and then a rock crashed into the ground by my ankle. I ran faster, down into the riverbed, to the safety of the guards and Papa’s dogs.\nThey came to the house in numbers that night, carrying fire. I could taste their anger on my skin. From the pumpyard the guards readied their weapons, unsure whether to run to the defense of the house or to protect the water, and Papa flogged the dogs to get them growling. “Where is François? That worthless man! He can put down what he’s stirred up or I’ll have his hide nailed to my wall!”\nSomething crashed against our window, and I jumped back. Papa grabbed his rifle and checked it, then made it ready to fire.\nPapa had had people murdered before. We never talked about it, but there was no secret. When I was ten, he had François kill the bonesetter’s son, and everyone knew it was him. Papa had guards and dogs and Papa had the water; the whole village hated him, but no one dared cross him. Now they dared.\nOutside the window, something was happening in the crowd. Enah ran in front of them, raising his hands. I couldn’t hear his words but just his voice was beautiful, melodic like a violin, fanning the fires and banking the coals until the entire mob was singing their agreement with him, and the chant started up: Enah! Enah! Bring the river! Flood them out!\nWhen the crowd was his, he turned to our house and waved his hand until I stepped up and opened the window.\n“Mr. Wolfe,” he called. “It’s true that Jaime raised me on the radio, but you’ll have to do more than kill him to drive me off. You’ll have to kill me. And you’ll have to kill all the people I am teaching, and you’ll have to teach them not to kill you. Invite me in, Mr. Wolfe.”\nQuite a thing to say, for someone who had just told my father to kill him. But Papa walked to the door, and—quickly, as though the doorknob was a snake—yanked it open. He invited Enah in.\nNo ancient and carefully maintained gun from the crowd shot him. No fist-sized rocks came hurtling at his head. Enah approached and the mob behind him rumbled like a single, huge beast, with fire in its many claws.\nEnah walked in, and Papa shut the door behind him.\nThey stood watching each other for a moment, these two men, Enah strange and unworldly with fire glowing on his skin, Papa holding his ground like the rocks on the riverbed. Then Enah spoke.\n“All the corpses you’ve planted by your pumps,” Enah said. “How long, tell me, will it take them to bloom? Will they feed your family when they do?”\nPapa frowned, confused. He wasn’t a good man to confuse—he got angry. But instead of striking Enah or taking him by the neck, he showed his hands.\n“Why do you want to destroy me?” he asked. “I want to leave something for my daughter. I want to leave my wealth when I’m no longer here to take care of her.”\n“You can leave her a better wealth,” Enah said, and gestured to the dry riverbed.\n“It will dry up. You don’t understand this village; people don’t learn. If they’re given abundance, they’ll bleed it dry. If I control the water, everyone gets what they need; no one takes more than their fair share.”\n“People learn when they are taught,” Enah said. “When they create with their own hands. They will love the river even as you love your daughter.”\n“You are naive,” father said.\n“And you are stubborn,” said Enah.\nPapa brushed off his hands. “I would rather be stubborn,” he said, but there was a moment when he seemed to consider it. The costs, and the risks, and the damages. But Papa has never been one to back down. “I’m done arguing with you. With a word I’ll have my guards open fire on your mob. Get off of my land.”\nPapa went into his office before Enah could say another word, and I caught Enah’s arm before he left our house. “Why hyacinths?” I asked. I kept my voice at a whisper, so Papa couldn’t hear.\nEnah turned to look at me. “Because this,” he said, gesturing to the riverbed, “is fear in a handful of dust. Have you heard that poem? The Waste Land?”\nI hadn’t, but if there was ever a wasted land, this was it.\n“How much of that world we have forgotten,” Enah said, and shook his head. I understood why people crowded around him like a prophet: he promised beautiful things, and kept them in mind of how strange he was, how little they knew.\nI followed him to the fence around the property, where he went out by the gate and faced the crowd. The mob watched, ready to burn me, but I felt safe in Enah’s shadow. A girl guided through a lions’ den.\n“Those of you who’d see the river run,” he called. “Come at midnight to the highest part of the bank. We’ll gather there and begin: with your own hands and your native rock, we’ll build tanks and dams and bund walls. Little by little, the water will rise. We will name the first wall ’Jaime’.” He turned, faced our house, and seemed to speak straight to Papa. “And the water will rise.”\nHe looked at me, and I ran back inside.\nPapa must have heard him through the walls. He was sitting at his desk with his head in his hands, and his face—what I could see of it—was red.\nHe looked to me, eyes dry and veined. “If they gather I’ll have François and my boys cleave them apart,” he said. “It’s not right that they should try to take the river. There was no law here so our family made the law. May you never have to make such a decision.”\nWe were both silent for a while, and I said, “Hyacinths don’t grow on clay.”\nPapa’s eyes bugged. “What is this?” he demanded. “What sort of nonsense have they put in your head? Hyacinths!” He stood. “I’ve raised a beautiful girl on this land, and by God I’ll leave my wealth for her when I die. Wealth is all you can ask for in a God-forsaken place like this.”\nI bit my teeth. My mind was full of blood and flowers, and the back of my tongue was dry. Papa glared for a minute, then the heat went out of him.\n“Apologize to me, Lena,” he said. “I’m only trying to protect you.”\nI’d lived long enough that I knew there’d be no peace in the household until I did.\n“I’m sorry.”\nHe nodded. For a while he stared out the window, into the distance, his dogs at his ankles.\n“Water,” he said.\nI went into the kitchen.\nI pulled a quart down from the cupboard, and felt the clean weight of it. Wealth, here, sucked out of the dirty riverbed.\nI brought it back to the office, and Papa drank like a man thirsty since the days of the Flood. I watched the water disappear into his body.\nHe set it down and looked at me.\n“Lena,” he said. “Drink up and go to bed. Keep your eyes closed. I’m going to roust the boys.”\nI went into my room and closed my eyes, and imagined blood sprayed across the riverbed. Papa went out to the pumps, and I could hear his voice, and then the rasp of stones sharpening machetes. I counted my breaths. Fifty, eighty, and the guards began to speak to each other, binding their resolve in boasts and quiet banter.\nThen, I snuck outside.\nThe sky was dark, and the electric lamps from the pumpyard didn’t cast light as far as the door. The riverbanks reared high above me to either side.\nI thought, What happens if the water rises?\nBut then, that wasn’t the right question.\nWhat happens if the water never rises?\nThe ground cracks. Skin cracks. Bones crack.\nOn my birthdays I was allowed the extravagant gift of a bath. When Mama was alive, she’d sit at the side of the tub and wash my back. My entire body felt light, then. I think buoyant is the word—a word I had little use for. I wanted the river to roll down from wherever it was hiding, to catch me, carry me away. I wanted buoyancy.\nI ran for the bank.\nNot far from my door a figure stood up from the shadow of my fence. I stopped quick and saw François, silhouetted against the wide white light of the moon.\n“François,” I said. My voice cracked. I wondered: if he hacked off my head, how long would my blood stain the riverbed? Would Enah bring the waters and wash it away?\nFrançois offered his left hand. In his right, his machete gleamed.\nI took a step back, but I gathered my courage and looked toward the high part of the bank. I kept my eyes on the gathering lights there as I said, “Are you going to tell Papa, or just cleave me?”\nFrançois was silent for a moment. Then, “I said that my parents would not be proud of what I do,” he said. “Lena, I am not proud. God is not proud. I hardly know him, even when I want to pray.”\nI swallowed. In all the years Papa had paid him, he had never called me by name. “I don’t have anyone to pray to,” I said.\nHe offered his left hand. Again, I hesitated.\n“François,” I said. “What will happen if the water rises?”\n“Life will return to the river valley,” he said. “And if I’m lucky, I will never again cleave off anyone’s head.”\nMy heart raced. “So you want the water to rise?”\nHe offered his left hand.\nI stepped forward, this time. Close enough to see that his eyes were rimmed with salt, like the blood on Mogul’s nose.\nOur blood will crack. Our tears will crack.\nI ran forward and wrapped my hand in his.\nHis hand closed around mine, larger than mine, warmer, strong. “Your father will have us hunted,” he said. “If you’re afraid, you shouldn’t come.”\nI was afraid. Of him, of the guards, of the villagers, of the flood. Of Papa, of Papa’s dogs, of being cut off from the pumps. Of dying like Mogul. Of dying like Jaime. But I went up on my toes and kissed François on the cheek, and he accepted it like a man made of stone.\nThen he said, “Come,” and we walked up the bank. Toward the lights, where the wind scattered Enah’s lilacs, and I imagined hyacinths on the breeze.\nAn (pronounce it \"On\") Owomoyela is a neutrois author with a background in web development, linguistics, and weaving chain maille out of stainless steel fencing wire, whose fiction has appeared in a number of venues including Clarkesworld, Asimov's, Lightspeed, and a handful of Year's Bests. An's interests range from pulsars and Cepheid variables to gender studies and nonstandard pronouns, with a plethora of stops in-between. Se can be found online at an.owomoyela.net, and can be funded at patreon.com/an_owomoyela."}