{"fingerprint": "Hrq4a4tyyzH2X4xHegSKeVJ/5zE=", "sitename": "Clarkesworld Magazine", "title": "And Wash Out by Tides of War by An Owomoyela", "author": "An Owomoyela", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/owomoyela_02_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: And Wash Out by Tides of War by An Owomoyela", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6460 words, short story\n And Wash Out by Tides of War\n I am sitting at the top of the spire of the Observance of the War, one of three memorials equidistant from the Colony Center. The soles of my runners’ grips are pressed against the spire’s composite, their traction engineered at a microscopic level. But I’m not going to push off. I’m 180 meters up, and while I could drop and catch the festoons—my gloves get as much traction as my grips—that’s not what I want. I want to freefall all 180 meters, and catch myself, and launch into a run.\n That’s crazy thinking. I’m good, but no human’s that good; I’m a freerunner, not a hhaellesh.\n I shift my center of gravity. The wind is still temperate up here, fluttering cool under my collar. It outlines the spot of heat where my pendant rests against my skin.\n The pendant is the size of my thumbnail, and always warmer than it should be. This has something to do with it reflecting the heat of my body back to me, so the pendant itself never heats up. It was built to do this because it’s no gem; its brilliant red comes from my mother’s cryopreserved blood.\n It was, until the Feast of the Return that morning, the only thing I’d known of her.\n The colony’s designed for freerunning. The cops all take classes in it. That’s what comes of a government that worships the hhaellesh, who can carve their own path through the three dimensions.\n I’m not a cop, either.\n I end up dropping, twisting so my fingers and toes find the carved laurels, and from there I make a second drop to the Observance’s dome. At my hip, my phone starts thumping like an artificial heartbeat. I pause with my fingertips on the gilt, and finally turn to brace my heels against the shingles and lean back into the curve. I clip the hands-free to my ear, and thumb the respond button. Then I just listen.\n After a moment of silence, a human voice says, “Aditi?”\n I let out a breath. “Michel,” I answer. He’s a friend.\n “Are you okay—?”\n “I don’t want to talk about it.” Obviously a hhaellesh could get up to my perch here, and so could Michel—he’s from a family of cops, so he’s been playing games with gravity for longer than I have. But effective or not, there’s a reason I’m nearly two hundred meters up, and that reason has a lot to do with not wanting to talk about how okay I am.\n Michel digests that, then says “Okay. Did you hear the new Elías Perez episode?”\n My chest fills with a relief indistinguishable from love. I love Michel so much that it’s painful, sometimes, to know he’s not my brother. I wish the same blood flowed through both our bodies, and without thinking past that, my fingers go to the pendant at my throat. There, my voice catches.\n There are moments when I feel so ashamed.\n “I haven’t,” I say. “Put it on.”\n The hhaellesh stand at least six feet tall, and usually closer to seven or eight. Their skin is glossy black. Their digitigrade feet end in small, grasping pads; their hands end in two fingers and two opposing thumbs which are thin enough to fit into cracks and gaps and strong enough to pierce titanium composite and tear apart the alloys of landships. They are streamlined and swift, with aquiline profiles and a leaping, running gait like a cat or an impala. They can fall from high atmosphere and suffer no injury. They can jump sixteen meters in a bound. They are war machines and killing machines.\n They are also human sacrifices.\n I envy them.\n Gods, if there was anything in the universe Elías couldn’t handle, his writers haven’t thrown it at him yet. He would know how to tell his best friend about an enlistment option. He could figure out how to deal with a hhaellesh showing up at his door.\n Michel starts the playback, and I tweak the audio balance so I can hear Michel breathing while we both listen. The serials are propaganda and we know it, but they’re enjoyable propaganda, so that’s fine.\n [The esshesh gave us the hhaellesh and the hhaellesh handed us the war—but if we didn’t have the hhaellesh, we’d still have Elías Perez,] the canned narrator says, and I lean into the backbeat behind his words. [Welcome to the adventure.]\n Around me, the colony spreads out in its careful geometry. There’s nothing left to chance or whimsy, here, or adapted from the streets and carriageways built by another, more ancient, society. There’s no downtown you can look at and say, this predated cars and light rail. No sprawling tourist docks with names that hold onto history. This place is older than I am, but not by much; it’s only about the age of my mother.\n That’s why we cling so much to ceremony, I think: it’s what we have in place of tradition. We make monuments to an ongoing war, and when the soldiers return home we have feasts, and we plan holidays to rename the Observances to the Remembrances. The war’s only just ended and in a month we’ll have three Remembrances of the War, in shiny white limestone and black edging in places of honor.\n I get it.\n Seriously, I do. When you don’t have history in the place you live, you have to make it up or go insane.\n Earlier in the day, my mother’d shown up to the crappy little allotment I cook and sleep in but don’t spend much time in. My allotment’s on the seventeenth floor of a housing unit, which makes for a perfect launch point, and doesn’t usually get me visitors on the balcony. I was on the mat in my room, with my mattress folded up into the wall, doing pushup jump squats. They weren’t helping. I’d split my lip just a bit earlier, and since I bite when I get restless, I had the taste of blood in my mouth.\n Then there she was, knocking at the lintel, and I split my lip open again.\n I did a thirty-second cooldown and made myself walk to the window. If it had been dark, if the light hadn’t been scattering off the white buildings and back down from the cyan sky, it might not have glinted on her skin. She might have just been a black, alien shape like a hole in the world.\n “I expected to see you at the Feast of the Return,” she said. “I registered my arrival.”\n “I was busy,” I lied.\n She regarded me, quietly. And although I didn’t want to, I invited her in.\n When I first met Michel, he was walking along the rails of the pedestrian bridge by the Second General Form school. I was in Second General Form mostly because my father had hired a tutor before we came to the colony; my education in Shivaji Administrative District hadn’t exactly been compatible with the colony’s educational tracks. I was new, and didn’t know any of my classmates. We knew each other’s names from the class introductions, so Michel didn’t bother to introduce himself.\n “Settle an argument,” he said. “I think Elías is in love with Seve, and Seve just thinks he’s ridiculous. My cousin thinks Seve loves Elías but doesn’t want to show it, and Elías is just friendly and chirpy to everyone, so he doesn’t even see anything weird about acting like that at Seve. You should tell her I’m right.”\n I shook my head. “Elías? Is that the government stuff? I don’t listen to that.”\n “Wha-a-at?” Michel asked, bobbing the a. “Come on, everyone listens to Elías!”\n “My dad says it’s just propaganda,” I said, and I remember that little preadolescent me felt damn proud of herself and all smart and grown-up to be slinging around words like propaganda. “They just make it so people will want to join the war.”\n “Well, duh,“ Michel said. “Everybody knows that. But it’s cool! Come on, lemme tell you about this time that Elías got stuck on this planet; they were trying to make it into a colony, but there was a whole swarm of the enemy and his ship was broken and he couldn’t take off . . . ”\n Elías always found a way through, and by the end of the day, I was listening to the show. I never helped Michel settle his argument, but I came to my own conclusions.\n Today’s episode opens with the soundscape that means Elías is on the bridge of the Command and Control station in the sector designated as the Front. Meaning he’s on the front lines. Last time that happened, he was in a story arc that had him working with the Coalition forces, which he hates to do; Elías isn’t really an official sort of guy.\n [“If our intelligence reports are correct,”] says the voice of Commodore Shah, [“we’re about to lose the war.”]\n The art of the gentle lead-in is verboten in Elías Perez.\n [“A larger enemy presence than any we’ve ever seen is massing at Huracán II. We believe they’ll use this staging ground to launch a major, unified offensive on the colonies.”]\n [“You want us to what?”] That’s Seve, the captain of Elias’s ship. She snickers. [“Take out a whole fleet of the bastids? Hah. No bones in that dog.”]\n “Oh, Seve,” Michel says. Seve’s got a stack of sayings that only make sense to her—and to Elías, nowadays, though they didn’t always. Elías and Seve have been partners since episode 3, where Elías stowed aboard Seve’s pirate ship and ended up saving it when it was infested by the enemy. Seve turned around and said, there, that paid Elías’s boarding fee; what was he going to pay for passage?\n I’m a fan of Elías and Seve. Love at first uncompromising deal. And she isn’t the kind to think the end of the war obligates her into anything.\n [“If their war force goes unopposed, the enemy will be able to sweep through our territories unopposed. The Coalition doesn’t have the fleet strength to stop them.”]\n There’s a subtle swell in the background music, a rumble of drums and solar radio output, and a thrill goes through me. The writers can play drama with our fear of the war: for most of us, it’s the fun kind of fear where something is technically possible but pretty damn unlikely, like an asteroid crashing into the colony. After we lost the Painter settlement, the war was always off somewhere out there; we sent out troops, we made our hhaellesh, but it’s not like we were really under threat of invasion. I don’t think our colony even had an invasion plan in place, beyond the esshesh defense emplacements. We all got a little afraid, but the fear was a what if, on an offchance, someday . . . and not a when, as it will, this happens to us.\n [“Okay,”] Elías says, always the good guy, always the hero. [“What’s our job? We can barely take one enemy ship in a firefight; a force that size is beyond us.”]\n Commodore Shah says nothing, and the delay is striking. The audio play doesn’t go for delays. There’s another rumble, and another sensation thrills up my spine, but it’s not the fun kind of thrill this time.\n “Oh, you’re not,” I whisper.\n [“As you know,”] Shah says, her voice clipped so regret doesn’t make it through. [“Huracán II suffers from a violent geology. Your ship is one of the few with both the range to reach the Huracán system and the maneuverability to penetrate the enemy’s lines and engage your jump engines within the planet’s red jump threshold.”]\n I hear Michel’s sucked-in breath, and I’m sitting dumb, myself.\n [“Blow out the planet and us with it,”] Seve says. [“Jump’ll turn the rock into a frag grenade, and the gravity turns my girl’s engines into a nova. That what you want from us, Shah?”]\n Shah’s always looked after her people. Elías and Seve—they’re not official, military types, but Shah looks after them as her own. Problem is, even Shah’s people come in second to the war.\n [“It’s not what I want,”] Shah says, and I want to slam my headset down. [“But I don’t see another option.”]\n “They’re doing a finale,” I say, my calves and fingers burning again to run. “The war is over, so they’re just going to finish Elías Perez.”\n “You left when I was three years old,” I’d told my mother as she crouched at the edge of the table, as I shuffled through my shelves for a decent tea. I had a couple spoonfuls left of loose-leaf colony Faisal, which I hear is a good substitute for an Earth Assam, which I will never in my life be able to afford unless it goes big and all the importers start shipping it in in bulk. But the urge to make a good impression got in a fistfight with the urge to be petty and spiteful, and I pulled out two bags of a generic colony black and plunked them into mugs.\n “I remember,” she said. “I braided your hair and you wore your favorite dress. It was the blue of cobalt glass.”\n Her voice was deep and flanged, and totally factual. All hhaellesh sound alike. At least, the ones on the war reports sounded the same as my mother.\n I have an allotment and not a flat because I have a work placement and not a career. I don’t care for any of the careers on offer. But the colony’s not so much of a fool to let work potential go unexploited, unlike the governments of Earth which I’m just old enough to remember. I still have images of walking to the subway past the grimy homeless, with my father’s hand on the small of my back to rush me along.\n That’s what I remember of my childhood. My father’s protective hand, my father’s tutoring after school, my father’s anchor mustache with a bit more salt in its pepper every year, my father’s voice carefully explaining the war.\n “I don’t like dresses,” I told my mother, and set down the two mugs of tea. Her fingers clicked around the ceramic.\n The hhaellesh can eat and drink, but human scientists still don’t know how food passes through the suits. We do know that the suits filter and metabolize any toxins—people have tried to poison them before, with everything from arsenic and cyanide to things like strong sulphuric acid, and the hhaellesh just eat and drink it up and are polite enough not to mention it.\n I did not try to poison my mother.\n “You’ve grown,” she said. “Of course, I expected that.”\n “Yeah, kids grow up when you disappear on them.”\n She was quiet for a few seconds. “I did not expect your father to die.”\n I stared down into my slowly-darkening tea.\n “I received notice,” she said. “I had to make the decision whether or not to come home. The tide of the war hadn’t turned yet. I knew the colony would look after you.”\n I swirled the tea in my mug. Tendrils of relative darkness wavered out from the bag.\n “I was one of only eight hundred hhaellesh volunteers at that point,” she said.\n “Yeah, I know,” I finally interrupted. “Without the hhaellesh, we wouldn’t’ve won the war.”\n This is how the hhaellesh happened:\n We had a handful of colonies in the Solar system and three outside of it: Gliese, Korolev, and Painter. Then, abruptly, we had a handful of colonies in the Solar system and two colonies in Gliese and Korolev.\n We still thought interstellar colonization was a pretty neat thing, and despite centuries of space war fiction, we didn’t have the infrastructure or the technology to mount a space war. We were thoroughly thumped.\n Then the esshesh showed up and told us that, while war was (untranslatable, but we think against their religion), they had no problems with arming races to defend themselves.\n So they gave us the hhaellesh.\n This is how the hhaellesh work:\n There’s a black suit that scatters light like obsidian and feels like a flexible atmosphere-dome composite to the touch. A soldier gets inside, bare as the day she was born. The suit closes around her.\n In a few minutes, it’s taking her breath and synthesizing the carbon dioxide back to oxygen. In a few hours it’s taking her waste and digesting the organic components. In a few days it’s replaced the top layers of her skin. In a few months it’s integrated itself into her muscles. In a few years there’s nothing human left in there, just the patterns of her neural activity playing across an alien substrate that we haven’t managed to understand yet.\n This is how a hhaellesh retires:\n The suit has a reverse mode. It can start rebuilding the human core, re-growing the body, replacing the armor’s substrate material with blood and muscle and bone and brain matter until the armor opens up again, and the human steps out, bare as the day they were born. A body like Theseus’s ship.\n But to do that, it needs the original human DNA.\n Or some human DNA, in any case; hell, I don’t know that anyone’s tried it, but you could probably feed in the DNA of your favorite celebrity and the hhaellesh suit would grow it for you, slipping your brain pattern in like that was nothing strange. I suppose that should freak me out—y’know, existentially—more than just growing a new copy of a body long ago digested by an alien non-meatsuit.\n It probably should, but it doesn’t.\n This is how a hhaellesh tries to get the DNA that’ll let it retire:\n My mother crouched at the side of my table. With the inhuman height and the swept-back digitigrade legs, the chairs weren’t designed to accommodate her.\n “When I left, I entrusted you with a sample of my DNA,” she said, and my hand went to the pendant. “With love, my daughter, I ask for it back.”\n At that point, I dove out the window.\n “They can’t cancel Elías,” I say. The top-of-spire restlessness is back, and I want to drop, freefall, roll, clamber, climb. My shoulders and thighs are shaking. “The fuck. He’s a goddamn cultural phenomenon, by now.”\n Michel’s voice is unsteady as well, but not as much as mine. He doesn’t get it. “To be fair, I feel like after you’ve won the war you don’t need to push people to sign up for the Forces any more.”\n “Fuck the war,” I say, and there’s anger at the pit of my throat. Like: how dare they take this away from us. Like: Elías and his adventures belong to us. Since the beginning of the war they’ve been how we’re meant to see ourselves—clever and active and go team human. You can’t take away our stories just because we won.\n The first time I met my mother—\n Except I can’t put it like that, can I? You don’t really meet your mother. Or I guess maybe you do at the moment of conception, if you think your zygote is you, or maybe it’s when the first glimmers of thought show up in your still-developing brain. But I think maybe it doesn’t count if there’s no chance that little undeveloped you won’t retain the memory.\n So. The first time I met my mother, I was in a utility transitway. You know, what we have for back alleys.\n I’ve always been the kid with a chip on her shoulder and a grudge against the world and her nose high in the air. The grudge and the pride come from the same thing. Neither made me many friends.\n I ran into a bunch of the voluntary-career types in the transitway on the morning of the Feast, just after the big public ceremony. My blood was up and they were them, and, well, the specifics of the argument don’t really matter. I started it. And then I was in the comforting beat of a street fight, and with a split lip and three split knuckles, and while one of them was hollering about how he was going to file a complaint for misdemeanor assault, who should show up?\n And my heart leapt up and got a grip in my throat, and I thought, Oh gods, a hhaellesh, and standing right there, alien and beautiful. Staring at us with a blank, featureless swept-forward face that we all unambiguously read as disapproval.\n The fight stopped. The boys stood there, twitching and uneasy, until they worked out that the hhaellesh was only staring at me. Then they slipped away.\n And I stood there, frozen in the moment, until I worked out why a hhaellesh would single me out and come find me in a utility transitway. The wonder was slapped right out of me. It meant nothing: it wasn’t the free choice of an alien intelligence but the obligate bonds of unreliable blood.\n I turned my back and sprinted away.\n . . . hold it there for a moment. I realize this makes it sound like I just run from all my problems, and I want to make it clear that that’s not true. The truth is that I run from this one problem, and looking back at it, I guess I always have.\n I was talking about my pride and my grudge, and how they both come down to this pendant at the base of my throat. My mother’s blood. My mother the hhaellesh, the guardian of the colonies, the war hero.\n All the hhaellesh are war heroes.\n What the hell am I?\n [“My gotdamn ship,”] Seve says. They’re in the corridors of her gotdamn ship now, the soundscape full of mechanical noises and ambiance. There was a behind-the-scenes episode a few months ago back where they talked about those soundscapes, and how they chose the sounds for Seve’s ship to be reminiscent of a heartbeat, rushing blood, ventilation like breath, so it’d seem alive. [“My gotdamn job. Better pilot than you, anyway; I can see this idiot plan through.”] She’s pissed-off. I would be. Hell, I am.\n [“I’m a good enough pilot to dodge through a crowd,”] Elías says. [“Come on, Seve. The captain doesn’t have to go down with her ship.”]\n Michel complains a lot that Seve is a boy’s name, and I tell him that so were Sasha and Madison and Wyatt, back in the pre-space days known as the depths of history. And then Michel says that of course I would pay attention to the pre-space days, and I say that of course he thinks history started with the erection of the initial colony dome.\n Michel is first-generation colony native. He was born here. His parents were in the third or fourth batch of colonists to set down here. We’re never quite sure who’s supposed to be jealous of who in this relationship, so mostly we just rib each other a lot.\n In my position, it’s easy to feel like you don’t have a history. Yeah, I’m from Earth, but I don’t remember much. My dad knew more, but he naturalized us; the most culture I think he held over was the way he made tea in a pot with colony spices, and his habit of saying gods instead of god.\n I’m the girl with the hhaellesh mother and the blood at her throat. That’s who I am. And I was pretty sure no one could take that away.\n [“Seve, I can’t let you die in my place,”] Elías says.\n Seven snorts. [“Well, one of us got to.”]\n “I enlisted,” I blurt out. I swing the words like a fist. And I can hear the change in Michel’s breathing on the other end; I can hear how Elías and the finale and how the writers are screwing us over has ceased to matter.\n “Say what?”\n “I enlisted,” I say again. “I got the assessment. They were going to let me into a Basic Training Group and then the war ended.”\n Michel doesn’t know what to say. I can tell because he says “You—”, and then “Oh.”, and then “So . . . what? What now? Are you—” and then he trails off into silence. I’m pretty sure I’ve hurt him.\n It’s a thing, in my family.\n “I don’t know,” I say. All my plans have been derailed. “I can join the colony’s military track. Would that be totally pointless? Think I should go? I could just get out of here.”\n “ . . . should I know the answer to this?” He gives a nervous laugh—and the laugh is probably fake, now that I think about it. It’s not right, anyway. Michel’s real laugh is this deep, throaty thing that doesn’t sound right when you know that his voice is higher than average and naturally polite.\n If Michel was blood family there’d be a reason I could point to as why I felt so close to him, without wanting to screw him. I could have family that meant what family’s supposed to mean.\n After a moment, he says “Aditi, if this is about your mother, can we just, maybe, talk about your mother?”\n Michel, Michel, my not-family family. Talking about my mother, my family not-family. I got this far by not looking too close at the contradiction. It’s a lot harder to do when it breaks up your fights and shows up to tea.\n It’s a lot harder to do when it wins its fucking war.\n When we came to the Colony, my father and I, we stepped off the transport in a queue of seven hundred other colonists. We waited nearly an hour before it was our turn to go into a white room whose windows let in the blue of the sky and the white of the skyline, and a pleasant-enough woman took our biometric data and verified all my father’s professional assessments. She gave him his schedules —for Colony orientation, the walking tour, the commerce and services lecture, the first day at his assigned career—and set up an educational track for me. Through all of it, I was bored but fascinated by the blue-white-green of the outside world, and my father bounced me on his knee.\n At the end, the woman bent down and put her face in front of mine. “That’s a beautiful piece of jewelry,” she said. “What is it?”\n I looked her straight in the eye, and said—you know, in the way that some kids don’t quite get metaphor, even when they’re using it —“It’s my mother.”\n On my phone, there’s a message from the Coalition Armed Forces Enlistment Office. It reads:\n To Aditi Elizabeth Chattopadhyay,\n This is a note to confirm that your assessment scores were sufficient to place you in a Basic Training Group for Immediate Interstellar and Exo-Atmospheric Combat. However, due to the recent decision of the Colony Coalition Oversight Office and the cessation of hostilities, the Coalition Armed Forces as an oversight unit is being disbanded and the colonies’ individual standing military forces are being scaled back.\n At your request, your application can be transferred to the Gliese Armed Forces Enlistment Office, where you can enter into their Standing Military career track. If no such request is made, we will consider your enlistment withdrawn.\n Thank you for your willingness to serve the safety and security of the Colonies.\n The Standing Military career track trains you in an off-surface location with strict access restrictions. I could still get out of here. I have the option. She can’t take everything away.\n I dial back the Elías audio to a quiet background murmur. I can’t concentrate on it, anyway, and I don’t want to. I don’t want to hear Elías and Seve argue about who’ll sacrifice for the other.\n “Aditi,” Michel says.\n “Why the hell,” I ask him, “wouldn’t you just put your blood in a bank safe if it meant that godsdamn much to you?”\n There’s a moment when I think that could have used a little more context than I gave it, but Michel finds the meaning fast. “If I had a kid, I’d want to leave something they could know me by.”\n I kinda think there’s not a maternal bone in my body, because that just sounds stupid to me. “Yeah, well, I didn’t end up knowing her, did I?”\n “You can, though. Now. Can’t you?”\n “She came back for her blood,” I say. “She never said she came back to get to know me.”\n Like a slap in the face, Michel laughs.\n “What the fuck,” I tell him. “Not funny.”\n “It is, though,” Michel says. “Adi, I swear you just described exactly what you would do. You would go off to war and kick ass and come back home when there was no more ass to kick, and be all ‘hi, I’m back, gimme.’ Tell me you wouldn’t.”\n I spluttered.\n [“Some things are more important than my life, Seve!”], Elías is shouting, though the low volume just makes him sound faraway and muffled like he’s already lost.\n From the beginning, Seve has said that if she can’t save herself, she’s not worth saving. And this is propaganda, so the story never goes out of its way to correct her. I like that. I like that she’s never needed saving when she couldn’t save herself.\n I don’t like change.\n I want to mute the audio.\n “I’m not that self-centered,” I tell Michel, but my hand is on my pendant and I’ve convinced myself the blood inside is mine. It’s demonstrably not mine, and the DNA will prove it. But still. Still.\n “Adi, can I tell you something, and not get in a fistfight with you in a utility transitway?”\n I’ve never been in a fight with Michel. “What?”\n He takes a moment to put the words together. “The necklace is just a thing, Adi. Get your mom back. Once you have her, you can replace the blood. Anyway, one necklace for one mom is a pretty good trade.”\n Theseus’s pendant. I feel a rush of disagreement. I guess that solves that philosophical riddle for me: I really believe that if you replace all the boards, it’s not the same ship.\n Which means I also believe there’s no way to keep the ship from eventually rotting away.\n I never helped Michel settle his argument, but that doesn’t mean I didn’t come to my own conclusions.\n I think Elías and Seve love each other, but love doesn’t tell you what to do with it. It just shows up like a guest you have to make a bed for, and it puts everything out of order, and it makes demands.\n I don’t hear the rest of the episode.\n I take my time. I breathe through the anger in my gut and the sense, not exhilarating now, of falling. Then, in the evening, I sync up with the colony directions database and do a search for hhaellesh in public areas.\n Five hhaellesh arrived during the Feast of the Return, and two of them aren’t hanging out anywhere that the public cams can see them. One of the ones who is is surrounded by children and a lady who looks like their mother, beaming the whole group of them. Of the other two, one is walking the gardens in the Colony Center Plaza, and the other is . . . familiar.\n I take the monkey’s route, as my father called it. Roof to roof and wall by wall, the colony’s engineered and modified design giving me wings. From the feeds I read, the freerunning spirit everywhere means working with your environment, not against it; you have to take your obstacles as opportunities or you’ll never get anywhere. Literally, at that.\n If there’s a lesson to be learned there and applied to the rest of my life, I’ve yet to learn it.\n I pass over alleys and shopways and along the taut wires that traverse the wide boulevards, the places where parades had been held. People see me, but to them, I’m just motion; just another citizen who takes a hobbyist’s interest in how to get around. Anonymous. Not Aditi, the girl with the hhaellesh mother, the girl with her mother’s blood. They see me as I’m starting to see myself.\n I run harder.\n After my father’s first day of work, he took me to the breadfruit shop. It’s not real breadfruit—it’s some native plant the first colony engineers analyzed and deemed edible; something that looked like a breadfruit to whichever one of them named it—but when it’s processed and mashed it has a texture like firm ice cream and a taste that takes flavorings well. My father and I got bowls full of big, colorful scoops, and asked one of the other patrons to take a picture of us. They did, and said “Welcome to the colony!” We were that obvious.\n We sent the picture to my mother, and that’s where I find her today. Sitting at the table we always tried to get, without any of the breadfruit in front of her. Hhaellesh can eat, but I’m not sure they need to, and I have no idea if they have a sense of taste. You only hear about them eating to accept hospitality.\n There’s a halo of awed silence around her, and I slink through it and take another one of the chairs.\n “I’m sorry,” she says, and I let out a breath. Truth was, until she’d said that, I’d had some doubt that it was her. The hhaellesh all look alike.\n I grumble something. I don’t know how to accept her apology.\n “I haven’t been a good mother,” my war hero says. “I don’t know if you want me to start trying now. You’ve done well without me.”\n Yeah, if you want to call it that. I serve the minimum work requirements and spend the rest of my time running across the roofs and up the walls. I haven’t gone out and won any wars in my free time.\n What I’ve done, what they’ll know me for if I touch the history books at all, is that I’ve carried her.\n My fingers itch at the tips. I want to touch the pendant, but I don’t. “Hhaellesh don’t have blood, do they?”\n “The armor substrate carries energy and nutrients,” my mother says. “We don’t need blood, unless . . . ”\n “Why do you want to be human?” I ask. I don’t want to be human. I want to be more than what I am.\n My mother doesn’t answer that, and the stillness of the armor is the stillness of an alien thing: how am I to read it? Then she seems to answer two questions, my own and one she hasn’t articulated.\n Why don’t you?\n “I think,” she says, and her words are careful, perhaps uncertain. “if you are something, you don’t want it. Does that make sense? Because you are it, you forget ever wanting it. Or, I suppose, it never comes up.”\n I shake my head.\n “I miss being human,” she says. “I miss feeling warm and sleeping in and stretching out sore muscles. I miss holding you. You were so small, when I left.” I think she watches me. “You regret not being old enough.”\n “Old enough?” I snap. For what? To remember her leaving?\n My mother holds up her hand. “This lit me up like a candle,” she said, turning those long, precise fingers. “I was a goddess. A fury, a valkyrie. I wanted this. Now I miss being human.”\n I grind my fingertips out against the table. “What’s going to happen to the suit, if you’re not using it?”\n My mother lays her hand near mine, which is a disturbingly human gesture coming from something whose hand is a mechanical claw. “It’ll go into a museum,” she says. “Or on display in one of the Remembrances. I would give it to you if I could.”\n I rear back, at that.\n “Ah,” she says, and she can’t smile. There’s nothing on her face to smile. But I get the impression she’s smiling. “You think I’d say, no, it wasn’t worth it, in the end. I’ve learned my lesson and a human life is the most important thing of all. No.” Her head bends toward the table. “This is a part of my life; this is me. I will not disavow it. I would give it to you if I could.”\n The colony is white buildings and boulevards, green growing plants, and the searing blue sky. And then there’s the black of the esshesh artillery emplacements, the black edging on the Observances. Red’s not a colony color. Red is primal and messy, like blood.\n When I went to enlist, they took a hard-copy signature in black ink and a handprint biometric signature as well. I wonder what else the biometrics recorded: my anxiety? My anger? The thrumming of my heart in my veins?\n My mother’s hands are cool and pulseless on the table. Black as the artillery. Black as the ink. Black as the space between what stars we see, where the primal brightness of the cosmos has been stretched into infrared by the passage of time.\n I reach behind my neck and fumble with the clasp of my pendant. It takes me a bit to work it out; it’s stayed against my throat through showers and formal occasions and a hospital stay or two, busted ribs and broken legs. Pulling it off makes me feel more naked than taking my clothes off does. But here I am, baring myself in front of this alien who wants more intimacy than I think she deserves.\n “Two conditions,” I say. And it’s difficult to tell, under the smooth black mask, but I think she’s still watching me and not the blood. I push on ahead. “One: I want a piece of that armor. Or, I guess, the substrate. Make a pendant out of it.”\n It’s not a replacement for the blood. But it’s not something I’ll be holding in trust: it’s part of my history, now, too, and it’s something that’ll be mine.\n My mother nods.\n I exhale. Red’s no good for the colony anyway. Black’s a bit better, if only because black is the color of the hhaellesh, and the security emplacements which grow fractally more close-packed toward the colony’s borders: the lines we draw around ourselves to protect us from the enemy.\n After Painter, the enemy never set foot on colony land. They’re not the thing that scares me. I’m still figuring out what my enemy is.\n “Two,” I say. And I’m not sure how to say this next part.\n But those were her words. I’d give it to you if I could.\n “I want your stories,” I tell her.\n An (pronounce it \"On\") Owomoyela is a neutrois author with a background in web development, linguistics, and weaving chain maille out of stainless steel fencing wire, whose fiction has appeared in a number of venues including Clarkesworld, Asimov's, Lightspeed, and a handful of Year's Bests. An's interests range from pulsars and Cepheid variables to gender studies and nonstandard pronouns, with a plethora of stops in-between. Se can be found online at an.owomoyela.net, and can be funded at patreon.com/an_owomoyela."}