{"fingerprint": "c94b5Ycl8rLjBZhhfKP7JzpyItY=", "sitename": "Clarkesworld Magazine", "title": "Frozen Voice by An Owomoyela", "author": "An Owomoyela", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/owomoyela_07_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Frozen Voice by An Owomoyela", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3770 words, short story\nFrozen Voice\nThey’ve made us speak Hlerig.\nThey’ve made us wrestle sounds slippery as fish or burly as bears through our throats. They’ve made us stumble through conversations, even human-to-human, that we can hardly say. We can’t pronounce our names. They named me Ulrhegmk, which in Hlerig means little mountain thing.\nMy mother named me Rhianna.\nThe things that brought us Hlerig are called mklimme. Us humans, they call hummke, and all our languages share the descriptor rhlk, a term which means soft or runny. I use rhlk terms to describe Hlerig: Viscous in rhlk English, lipkiy in rhlk Russian, klebrig in rhlk German. They mean that Hlerig sticks like glue in your mouth.\nWe have a term for mklimme, too: daddy longlegs.\nA longlegs came walking through my part of the city on a muggy night while my mother was gone later than usual. Thirty, forty feet above us, its eyes flashed like cats’ eyes and its spindly legs crossed blocks in three, four steps. One of its feet put down right across the street, big around as a trashcan and still delicate because it was so tall, and the other two feet stood in front of the low dome of the granary and at the common park at the end of the path. Three feet, two hands. One head which descended through the air and twitched from window to window, its faceted eyes angling back and forth until it came to ours. It put its hands, wide as splayed-open dictionaries, on the sill, and looked at us and the rest of the room.\nWho is watching you children? it said, in a language my mother called “whalesong.” Hlerig isn’t their only language, and they prefer the whalesong speech humans can’t hope to pronounce. I answered in Hlerig, pushing my brother out of the way.\n“My mother watches us, but she’s with friends.”\nShe shouldn’t be away, the longlegs said, and its head went up and back away from our window toward the sky. We’ll find her.\nLonglegs all think they’re so helpful.\nI watched it walk away, and grabbed my brother. My mother had told us where she was going; after making sure we had food in the cooler, just before she walked us to class in the park two days before, she’d told me exactly where she’d be. When the longlegs went looking they wouldn’t find her with friends, and then they’d look elsewhere.\nI pulled my brother up to the second floor of the house, where the walls had been ripped away and rebuilt like a paper wasp nest. “We’re going to find her,” I said.\nMy brother clapped to get my attention, and then made a clumsy sign with his hands. The longlegs tried to teach him to sign like they did, with their seven digits and two opposable thumbs, but his hands were no more made for their sign language as my mouth was made for their words. I had to squint in the darkness to understand him.\n“We’ll tell her they’re out looking and bring her into the city a back way,” I told him. “We just have to make sure she’s not coming over the plains.”\nI was young, then, and I thought that would be easy.\nMy brother nodded and began to prepare, picking up what he thought we’d need—scarves and a flashlight and a compass with no letters on it, only tick marks around the circumference. The needle wobbled from North to Northeast whenever we used it, but it was the only one we had.\nWhen we were sure the longlegs wouldn’t see us, we went downstairs and pushed open the door. I grabbed my brother’s hand, and we ran for the edge of the city.\nThe mountain by our city is called Etrhe, and the rocky hills and destroyed roads leading up into them are called ulrhe—not foothills, not exactly, but little mountains. In the ulrhe are ruins. And the cairn.\nOur mother went to the cairn whenever she could sneak out at night—whenever the mklimme in our city were few enough in number, or when the skies rumbled with thunder and crackled with lightning. Storms confound the longlegs. They can’t see or hear.\nShe came back from the cairn with books: old books, lost books, books we hid the instant we had them.\nI’d never been out to the cairn. I didn’t know my way out of the city like my mother did. She knew how to evade the longlegs and their sympathizers. (Sympathizers have little to do with sympathy, and we could never tell them anything.) I just ran with my brother, past houses, past the longlegs’ paperwasp structures, doing our best to look like we were on an errand whenever a longlegs turned its body and brought its all-seeing head our way.\nSoon we were in the outskirts of the city, where old houses that hadn’t been repopulated stood. And all the ruins began to look the same: wrecked walls, decaying doors and wooden floors, swept eerily clean of furniture and furnishings and all the detritus of domestic life. Humans had gone through, under the longlegs’ watchful eyes, long ago. They’d brought everything to the cairn.\nThe night deepened and we were picking our way around the buildings, backtracking when roads were blocked, trying to find our way past buildings that had crumbled over their yards. Now and then shadows would move through the rubble, or seem to move, or a sound would be caught by the skeletal landscape and come twisting out at us so warped and strange that my brother had to clap a hand over my mouth to keep me from screaming. It was no wonder we got lost, and with that sense of being lost came fear. Then exhaustion.\nWe went into an old building. I didn’t want to—the war left a lot of buildings crumbling, and every few months you’d hear about someone who got caught in one, broke a leg or their skull or their spine trying to scavenge some piece of a pre-war life. Almost without exception, those pieces were taken to the cairn anyway.\nBut it was cold, and we couldn’t risk the mklimme finding us out there, so I smoothed the broken glass away from a windowsill and climbed inside. I told myself that when the sun rose, I’d go up to the roof and plot a course to the edge of the city. But for that night, we went up a set of groaning wooden stairs and found a bathroom—no windows—to hide in.\nWe didn’t sleep. We huddled there for hours, my brother pressed against my side, and just as I thought he might drift off, the Hum began. The longlegs have a language for calling from city to city. Humans can’t hear it but we can feel it in our bones, and certain houses amplify it. It felt like the tile floor was trying to skitter under us, trapped in the instant before the skitter, and I felt sick to the bottom of my gut.\nMy father used to tell us, before he was taken, that the longlegs don’t sleep. They go about their business at night, walking through the cities or from city to city, with their long legs and their earth-skittering Hum. The ones inside the cities would peek in windows, make sure their humans were sleeping. And if there weren’t humans sleeping there, they’d check back the next day, then look until they found them.\nI couldn’t understand the Hum, but I felt down to my bones that the mklimme were discussing my mother, my brother, and me.\nI turned to hug my brother. His eyes were closed, his mouth pressed into a thin line that made him look much older than he was. “Don’t worry,” I said in pidgin rhlk. “Pretend we’re playing hide-and-seek. Remember when we hid in the fireplace? Before mom brought home those encyclopedias and we had nowhere else to put them?” I brushed my hands against his hair. He has dark hair, almost black. It’s a hobby in my family to name each other, because names are forbidden. Human names, at least.\nWhen I was born, our longlegs looked from us to the mountain bordering our city and then bent down to say the words in Hlerig. Your name is Ulrhegmk. Little mountain thing. When I talked to other longlegs, they made noises and said my name was beautiful.\nI used to stand over my brother’s bed and say Your name is Dougal. It means “dark stranger.” I’d say Your name is Wyatt. It means “hardy” and “brave.” Or I’d say Your name is Avalon. It’s a name from a far-away place. I’ll teach you to read about it one day.\n“Remember when we hid in the fireplace all day?”\nThe far wall of our living room was false. My mother and my father covered up the shelves along the mantlepiece. The false wall wasn’t hard to get into: it was held on with construction gum, and if you knew where to look, you could slide your hand into a handhold and pull it out. Even my brother could, if he planted both feet and tugged; my mother wanted us to have access.\nI hugged my brother against me. “We’ll just be quiet. They can’t see in.”\nOur fireplace had never been used for fire. No one in the city cleaned chimneys and we didn’t want to ask the longlegs, so my parents called it a fire hazard and left it alone. If you were very careful, after the false wall went up, you could climb into the fireplace and ease the wall into place behind you. Sitting in the fireplace wasn’t comfortable, but it was the safest place to read. You had to position yourself into a corner with your legs tucked to one side, then you could put a candle in the corner left over, and you could read.\n“We’ll be very quiet,” I told my brother, who was always quiet. “In the morning we’ll find mom, and then we’ll go home.”\nOur longlegs, the one who caretakes our neighborhood, has a name we can’t pronounce. The name it gives us in Hlerig is Gnheg, but in secret we call it Eroica because the unpronounceable name reminded my father of part of a song by that name. Eroica saw our living room before the false wall was put in, but my father wasn’t worried. He and my mother painted a fireplace on the false wall when they put it up, and Eroica never noticed the difference. It was depth perception, my father explained to me; all the longlegs had problems with depth.\nBut their vision was fine.\nThey saw him running home with a book one day. A bound book, bound for the hidden fireplace, my father bounding over all the things in his path. It’s funny how some things come together.\nThey caught him.\nHe must have thought he could hide the book, explain his running away, but they broke a window after he closed the door. My brother screamed, like he’d never scream again, and I held him back on the stairs. From the stairs I saw Eroica’s hands (wide-open dictionaries) groping after my father (and I hate that word, grope, oshchupyvat’; it’s as gummy in any language as its Hlerig word botb, as stupid and unfeeling) until they found him, standing not quite six feet from the tip of his head to his feet on the ground, and when one of those hands wrapped around him and the other touched the book, I heard Eroica scream too.\nZenig-hrie. Frozen voices. That’s the Hlerig word for books; nothing frightens them more. When they came, mother said, they stomped over our armies and our nuclear waste sites and even natural terrifying things like volcanoes and steep cliffs and the tornado alley, but on pulling a roof from a library they would scream, like Eroica screamed, and they would run away on their long long legs until certain ones, special ones, came and took the books away. Brave people, then, like fighter pilots, followed them and saw them doing strange things to the books, and later on they saw them doing the same strange things to their own dead.\nYou hear stories about people who tied books to tanks and cars and their own bodies so that the longlegs couldn’t touch them. At first it was the big religious books, the ones that are easy to find even now because so many people hid them: the Bible, the Qur’an. Then it was anything. Then the longlegs came back with fire, and the books burned, and the people burned, and in the end (my mother used to tell me stories ending with The End, but this one wasn’t like those; she explained to me the difference between The End and in the end) even the books didn’t save them. The world lay down and we lost our voices, the frozen ones and our rhlk, our beautiful liquid tongues.\nI was born later. And my brother, who snuggled into my arms in that muggy, Humming night, had been born even later than that.\nI searched around in my mind until I found Aesop’s fables. They’re easy to remember, because as long as you know the moral at the end you can say anything that comes to mind to get you there. I told him, as I held him, about the tortoise and the hare. I told him about the ant and the grasshopper. I told him about the boy who cried wolf, and somehow, he found sleep.\nSomehow I slept for a little too, and my dreams were full of words: dancing words, warning words, words as slick as the melting wax from our candles and as dark as the fireplace in the home we’d left behind us.\nLonglegs congregated away from the city. They liked the wide-open spaces where they could stretch their legs without worrying about where to put their feet down in the tangle of broken-down fixed-up houses.\nThe wide-open space east of our city in the foothills used to be part of our city, too. They tore it up. The cairn in the middle was the city around it: chunks of asphalt and brick wall and siding and telephone wires and telephone poles and light poles sticking out of the mess like toothpicks, a mountain among the ulrhe. Underneath that pile is where all of our books went, along with dead longlegs and the dead soldiers the longlegs took away. My mother said there were ways to get under it, using the old sewer systems, but they were dangerous and grim—you never knew when you’d find a skeleton instead of a book, and the sewers hadn’t been maintained in so long that parts of them were always collapsing.\nThe cairn was still where they took the books and dead longlegs, but they only seemed to put them on top and pile more things on top of them. No one could tell if that’s where they took the human dead; they mostly left us alone, digging graves in our usual cemeteries, unless they found corpses with no one to claim them. That didn’t happen often. No one was homeless after the longlegs took over; everyone was fed, everyone had shelter. There were even some people who loved them for that.\nMy mother said it was easy to feed everyone after you’d killed most of them anyway.\nThe good thing about the cairn was that the longlegs never went there. The bad thing was that there weren’t even old buildings left; it was all torn-up ground and wild weeds, broken streets rambling through the grass. Longlegs could see you, the same way you’d see a mouse running across your floor. And sometimes you’d see movement in the grass and remember stories about wild dogs.\nWhen we found our way out of our city in daylight, everything, even the sunlight, frightened us. Whenever we saw longlegs we hunkered down into the long grass and watched until we were sure they were moving away. Then we’d run for the cairn again, swelling larger and larger against the horizon as we neared, like a bruise rising out of the ground to overshadow us.\nThe sun rose too. I started calling out. My brother put his hand to my mouth but I pulled it away; even my voice sounded small in the empty hills, and the far-off longlegs didn’t turn our way. Even if they’d heard me, I wonder how I would have sounded to them—maybe my plaintive rhlk cries would be no stranger than the calling of birds, out here.\nWe ran to the edge of the cairn, then up, into and over it, around disturbed piles of rocks, past pieces of pre-war things I could only identify because I’d read about them. After a while I got to thinking that we were like the birds around the mountain, and our voices were part of the world out here, speaking forbidden words in this world the longlegs built but didn’t control.\nThen I heard my mother’s cry.\nI froze. I grabbed my brother’s hand, because the sound I’d heard was not language, not any language she’d taught me. My brother pulled his hand away and ran. I ran after him, tumbling rocks, scrambling over debris.\nShe was lying on her back. Our mother. Her head was tilted up toward the sky, and she tried to move it to look at us when we came near. When I knelt down next to her I could see a white crust at the corners of her eyes. I took her hand, and felt cold all over.\nShe had ink on her fingertips. Her knapsack had burst and books were scattered across the cairn with their pages flapping in the breeze. And the side of her shirt was dark with blood. I kept looking at the books, the knapsack, because I was afraid to look at the blood.\n“Where are you?” she whispered, in English. It was her first language, and ours, Hlerig be damned. Then she whispered “Non, non,” and her fingers curled around mine.\nMy brother put his hand on her shoulder, and she took one long, shuddering breath.\n“The longlegs are looking for you,” I said. It seemed like such a stupid thing to say, but I had to say something. No other words came.\nShe took another breath. “I fell,” she said, answering what I hadn’t been strong enough to ask. Her head moved, and she looked up at a part of the cairn tan with sandstone. “It was dark, and . . . ”\nShe swallowed. It sounded like it hurt her to swallow.\n“Darling, darling,” she said, “they won’t find me here. You have to go home.”\nIt was in her voice, not her words, that I heard she wasn’t coming with us.\nI gripped her hand. “You have to show us the way back in,” I said. “How to get through the old city. We’ll go through the ulrhe so they don’t see us on the plains.”\nShe was quiet for a while, frowning, her eyes closed. She looked a little like my brother had the previous night; she knew, and I knew, and I think even he knew, that I was lying to myself, thinking she would come back with us.\nCarefully, painfully, she raised her other hand to touch my cheek. I remember how cold her palm was. “Go back,” she said. “The mklimme will take care of you.”\nSometimes I wondered why my mother called them mklimme—that ugly, hard Hlerig word to say. She said they had the right to name themselves. Just as we wanted.\nMy brother was picking up the books from her knapsack, turning over the covers to see them in the full sunlight, and stacking them from biggest to smallest on the ground next to us. He was doing that not to look at her, I think.\nShe rolled her head to the side to watch him. Then she reached out for one of the books, and he handed it over. Her lips pressed together, and a pained noise escaped them.\n“Don’t bring them home,” she whispered. “Let the mklimme find you.”\n“I want to take them,” I told her. I meant, I don’t want to leave you here.\n“I want you safe,” she said.\nI held mother’s hands on top of the book. Her skin was as cold as the cover, or the cover was as warm as her skin. I remembered when she brought my first book home, a thin volume with large illustrated pages and breaths of text on each page. It was so lively, so easy to read, that I forgot why they called it a frozen voice. I’d closed my eyes, and believed I could feel it breathing.\nI closed my eyes, and felt my mother’s hands rise and fall unsteadily with her breath.\nThe Hlerig word zenig can mean frozen or dead. “I wonder,” my mother told me once, when I’d wondered why books frightened the longlegs so much, “if they don’t think we’ve done something horrible to produce them. If when they saw us wearing books like armor, they didn’t react the way we would if we saw people walking around wearing human bones and skin.”\nI wondered if there was a way to show them that every time the covers opened the voices lived again. Show them how to hear them, whispering stories inside you.\nMy mother squeezed my hand. ” They think they’re doing the best for us.”\nIn Hlerig there’s a word for everything, but the words don’t fit us well. I can’t wrestle my mouth around chlkrig and still think love, and my brilliant, warm mother, whose hand I held tight, was nothing like egg-laying yntig. But there are moments of synchronicity. The Hlerig word kpap, which means enduring or venerable, sounds a little like kitap in rhlk Arabic—the word for “book.” And the derivation chldn from chlkrig sounds almost like children does. In Hlerig it means “loved.”\n“There will be more books, I promise you,” she said.\nThey have made us speak Hlerig. But I wouldn’t use the Hlerig words. I wouldn’t speak them then.\nTo my mother I said Spasibo, xie xie, thank you, děkuju. And I held my brother’s hand as he mouthed Au revoir, annyeonghi-geseyo, má`a al-salaama, goodbye.\nAn (pronounce it \"On\") Owomoyela is a neutrois author with a background in web development, linguistics, and weaving chain maille out of stainless steel fencing wire, whose fiction has appeared in a number of venues including Clarkesworld, Asimov's, Lightspeed, and a handful of Year's Bests. An's interests range from pulsars and Cepheid variables to gender studies and nonstandard pronouns, with a plethora of stops in-between. Se can be found online at an.owomoyela.net, and can be funded at patreon.com/an_owomoyela."}