{"fingerprint": "xGfCYdC7DYQy5Ylva0jgZisadys=", "sitename": "Clarkesworld Magazine", "title": "Dave's Head by Suzanne Palmer", "author": "Suzanne Palmer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/palmer_09_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dave's Head by Suzanne Palmer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8080 words, novelette\nDave's Head\nI know what Dave wants even before he says it, before I’ve even taken off my stupid work cap or thrown my keys on top of the pile of crap beside the door. He’s taken his head off again, somehow, and I never can figure how he does it with no thumbs or even fingers, and I know my uncle didn’t help, but there it is on the rug waiting for me, Dave’s head, and he opens his gigantic mouth wide and looks at me with his big, brown fake eyes, and says, “Road trip?”\n“I’m a senior porter now,” I say. “I can’t just skip work.” This is true.\n“I looked at your schedule on the fridge. Your next shift isn’t until Tuesday,” Dave says. This is also true. “So, road trip?”\n“You know I can’t leave Uncle Marty alone that long,” I say.\n“Marty is at the party,” Dave says. “Throw him in the back seat and he’ll be fine.” Back seat of course because Dave’s head is fucking huge—life-size, as advertised—and he wants to see out the front window and “feel” the wind as if he had real fucking skin, real nerves, rather than just a better imagination than most actual people I know. Someday if I ever meet his maker, I don’t know if I’d hug them or kick them in the nuts.\nIf Marty is at the party, I wasn’t gonna get much done here at the house, because he’d always be milling around and in the way and he’d notice me moving or taking stuff. It’s much better when he’s at the garage, and mostly just sits on the couch staring at nothing and mumbling to ghostly coworkers, and then I can sneak off the nasty stuff, old food wrappers and anything likely to go bad or attract bugs or mice, and maybe even sort out and ditch some papers if I take a little from one spot and a little from another so the stacks and piles don’t seem to change much all at once.\nAt least my uncle never collected actual live animals; I’ve seen too many pics of those horrors and we’re not nearly so bad. The closest he got was Dave and a couple of Dave’s friends, the rest of which were too broken to fix. I think it’s because most of the animatronics were indoors when the fire took out their park, but Dave was so big he’d been built to be outside and weatherproof, sturdier all around. One of his knee joints is locked up from an exhibit collapsing against him, but he can still walk around with a stiff limp if he has to, and with Marty nowadays mostly forgetting there was an outdoors I’ve managed to get most of the junk out of the backyard so he has some room to roam.\nStill, as Dave likes to remind me, the backyard wasn’t all that big to start with, and there wasn’t all that much interesting to look at even when your head is normally as high up as Dave’s is. And he gets lonely when Marty is somewhere out of his own head, which is most of the time now.\nDave knows when I’m vulnerable. My job at the airport carrying bags for the few rich fuckers who can still afford to fly anywhere, furiously trying to buy time for the status quo, makes me resentful, and half this week was double shifts. “Road trip?” he says again.\nWhatever it was I had been thinking I should get done this weekend I can’t remember anyway. And I get lonely too; not like I can invite people over, with my uncle’s stuff everywhere and imaginary people taking up whatever room is left. “Fine,” I say. “But not too far.”\n“Awesomesauce!” Dave answers, which, really, is a weird thing to hear from a giant detached theme-park dinosaur head, but at some point you just let the weirdness own you and go with it.\nMy car is an old retired police cruiser, which means nothing much except that it has a reinforced frame and when I get up a little too close to someone on the highway and get myself into a predator mind-set there’s a vibe that surrounds us and they get paranoid and move the hell over to the slow lane. Mostly I don’t do this because it seems a dick thing to do, but I have a personal bias against anyone driving a Luxauto because of my shit of a father, especially if they’re the fucking beige armored ones. And nine times out of ten when you overtake them and they glare at you, you can tell just from that one look that they’re just the sort of douchebro who needed, at some point in their life, to get owned on the road by a green-haired skinny chick with a lip ring and a grease-converted V8 and a fucking dinosaur head in the passenger seat.\nMost people stick to the publics—around here in dead-end post-suburbia that means pretty much electric buses—so those out on the road in private cars are either loaded with money, or looking to take some. Or they’re taking their damned dinosaur head for an outing in a car their uncle pulled out of the junkyard and fixed you for your sixteenth birthday and you’re gonna drive it ’til the bitter end.\nSometimes Uncle Marty will start having conversations with people in other cars, even if we’re only actually beside them for a few seconds and the windows are up and of course they can’t actually hear him and aren’t even looking at him. Once we’re past he’ll tell us about it, but when it’s a beige Luxauto he doesn’t, or he’ll just tsk and look sad or upset, so I think that makes it clear my bias isn’t unreasonable. Family baggage distilled down to car brand hate.\nAnyhow, the sun is still up, the roads aren’t crowded, Marty is happily chatting with four or five imaginary people in the back seat, still at his party, so we’re good. Last time we did this we went west, so this time we go east, and other than that we got no plan. Or at least, I don’t.\n“I was thinking,” Dave says, all casual conversation, and I think right, here it is, “I’d still really like to see the redwoods.”\nYeah, so do I, but I don’t have the heart to tell Dave that some jackhole burned the entire damned forest down nine years ago. Scientists are working on new groves, in better places now that the climate has shifted so much, but they don’t want anyone to know where those are and besides they can’t be more than a few feet tall yet, right? “They’re off-limits,” I say.\n“We could sneak.”\nI snort, which doesn’t sound at all girl-like, but who the hell is gonna care? “You’re a sixty-pound robotic head, Dave. Sneaking is kinda beyond our means.”\n“I just think it would be nice for me,” he says, and what he means is he likes things that are very old and very big, because—as he put it once—they resonate with him. He forgets he’s not real. Sometimes I think the fact that I’m the only one of the three of us with any kind of decent grip means I’m the one losing out. Meanwhile I’m dodging potholes and watching the yes/no machine stuckied to the dash get brighter, and it’s worrying me, so I’m not feeling too charitable about any of it.\n“Yeah?” I ask. “Why’s that?”\n“Because it’s hard when you’re two hundred million years old and everything around you is teeny tiny and fleeting,” he says.\nWhen I cracked Dave open to see if I could fix him, after I moved in to take care of Marty and was exploring the junk in the yard, I’d found his serial number plate. Dave was made when I was two years old. But if I say that the rest of this trip will be sullen silence and now that we’re out and moving I’m kind of getting into the idea of the trip after all.\nWith reservations, though. We’ve had the redwoods convo a bunch of times and I always say no, and Dave knows this even if he doesn’t know why, which means it’s a dodge.\n“We’ll see if we can find something else,” I say, and if that’s not the answer Dave wanted, at least he seems to be okay with it.\nI tap the hexagon face of the yes/no machine, hoping it can give us the all-clear by the time we have to make a pit stop. It was an expensive thing, but I like to think it’s saved our asses a couple of times. It’s got a built-in GPS and it collates data about your location on the fly, economic data and crime data, education, air and water toxicity, and key words in social media posts from or about wherever you’re driving through, and it does whatever magic math it does with that and produces a six-metric rating that is displayed as colors. Right now we’re on the highway, but whatever shit place we’re passing through on the other side of the vine-strangled trees is hot red and yellow. The other colors are there too, but fainter. It’s funny that they called it the yes/no machine because it’s about as far as it could be from giving you a clear yes or no answer to whether you should stop somewhere or floor it ’til you’re out. I mean, I suppose if the hexagon stayed clear that would be a yes, but that never, ever happens. And if it did I’d assume the thing was busted.\n“Maybe if we head more south, it’ll get better,” Dave says from the passenger seat.\n“Yeah?” I ask. “What’s south of here?”\nDave fixes one big fake eye on me. “It was just a random suggestion,” he says, and by his insulted tone I can tell it wasn’t any such thing. But if he has more to say, he’s still not saying it. I fumble one of the new plastic dollar coins out of the collection of candy bar wrappers in my ashtray and, one hand still on the wheel, flip it. Heads I let Dave get his way and head south, tails I be the Girl In Charge and we go due north instead.\nHead wins, damn him.\n“Fine,” I say, “south it is.” When the next big interchange comes up I slow down and take the exit, bump over the vehicle scanner and scale, and then we’re merging onto another pothole-riddled highway heading south.\nThe yes/no machine fades to a lighter pink, paler yellow, and that’s at least something.\nWe drive for about two hours then stop at a roadside service stop so I can usher Marty into the men’s room; he can’t always tell me when he needs to go, but I noticed him being antsy in the back seat. Anyway I want to load up on some cheap packaged snacks. The old lady behind the counter seems nice enough, but with most food regs now entirely voluntary, I don’t trust anything not wrapped, stamped, and safety-sealed while I’m on the road, which is too bad because the pot of chili she has simmering near the counter smells really fucking good.\nAnother hour later and we’re nearing a gate city named Middleton, hidden from view behind the highway walls, and even though the yes/no machine is pretty optimistic about it, I know better than to stop. When everything went to shit and most of the middle class got stripped broke, those who were left circled their wagons into tight little protective clusters, though what they were protecting other than their schmancy boring-ass lawns and their inbred kids I dunno. Nonresidents routinely get targeted for all kinds of fees and harassment, and I’ve heard stories where if you couldn’t cough up ridiculous money you’d find yourself working for the city ’til you paid it off, which with compounding interest and fees on fees you never ever would. Middleton doesn’t have that rep, but I’m not keen on risking my own freedom on it; I’ve got things to do.\n“How about here?” Dave peeps up, the first word he’s said in over half an hour, as we approach the first Middleton exit.\n“Gate city,” I say. “Nope.”\nDave can’t purse his lips, because he’s fucking animatronic and no one thought he’d need that, even though they apparently thought they should make him smart enough to read and be argumentative as hell. For educating children, sure. So instead he does this thing where he just lightly clacks his jaws open and closed, tap tap tap tap, except he’s a giant head so it shakes the whole damned car. “We’re not stopping here,” I say again, just to be sure he gets that this is nonnegotiable.\nMarty in the back seat has gotten quiet, and I glance at him in the mirror and he’s frowning and looking around as if he understands where we are. My uncle might be on another planet most of the time, but not long ago he was one of the sharpest people I knew, the only one who could go toe to toe with my mother in the brains department—macrotech versus nanotech—and he knew everybody and everything.\n“We’re not going to stop here, Uncle Marty,” I tell him, and the anxious look eases. “Just passing through.”\nDave is silent for a bit, then starts clacking again, and this time I do glare at him. “You have a problem?” I ask.\nAnd then, like a goddamned omen, up ahead, half-leaning on the guardrail, I see the falling-down highway billboard for Middleton Prehistoric Playland. I had totally forgotten about it, but I have doubts it’s coincidence that we’re here.\nI keep driving, paying no notice to the billboard as if very busy instead of keeping a safe eye on the faded yellow lines on my side of the road. There is a small metallic chuffing sound I have come to identify as a cough, and then Dave says brightly, “Well, hey!”\n“Hey what?” I say.\n“I just saw a sign for another dinosaur park, right here. What amazing luck! We should stop.”\nYes, Dave sucks at poker, too. “Gate city,” I say again. “We’re not stopping. Besides, it’s been closed for decades, so it’s not like we could go inside.”\n“We could look around, though,” Dave says. “Maybe we could sneak in.”\n“Sneak in?!” I laugh. “You? You must be shitting me. No.”\n“I heard they might have another Euhelopus there,” Dave says.\n“You heard? So you knew this was here all along?” Of course I already know the answer, but it has to be asked.\n“I saw a brochure,” Dave says.\n“You saw a brochure? Where?”\n“Somewhere in the house, in one of the paper piles,” Dave says.\n“And you couldn’t just ask me if we could come here?”\n“I knew you’d say no,” Dave says. “You don’t know what it’s like being extinct. It gets lonely.”\nI’ve already gone down the argument hole with Dave about the Euhelopus thing, a name he picked up off some TV kid doco and decided was him (rather than the Generic Sauropod Model C (XXXL) his maker-plate reads) and I made the mistake once of telling him his kind wouldn’t be extinct until our toaster and microwave died, and that got ugly. Ugly enough that Uncle Marty got upset, which is where I draw the line.\n“Look,” I say, “we can’t just go right into a gate city. I can try to find out who owns it and if we can visit, and then try to find us a resident to sponsor us—”\n“I think it’s outside the gates, on the far side of Middleton,” Marty speaks up from the back. “I once tried to buy some parts off the guy who owns it, to fix Dave’s stuck knee, or maybe barter my time helping him for what I needed, but he wouldn’t even give me the time of day because he was gonna fix it all himself, even though everything in his park was just rusting to heck untouched.”\n“Then he’s not gonna let us in anyway,” I say.\n“Can we maybe just go look?” Dave asks. “I mean, even just drive around it even if we can’t get in?”\nMarty is leaning forward from the back seat, and he’s one hundred percent here, which doesn’t happen too often anymore. “Fine,” I say. “If it’s outside the gates, and if we can get to it, and if the yes/no machine doesn’t give us a hell no, we’ll drive around it.”\n“Okay,” Dave says, and is quiet after that.\nSure enough the Playland exit is right after where the high walls that line the highway finally taper down and away and we leave Middleton behind. Middleton, it seems, didn’t want to take the park with them when they redrew their town lines in concrete. I take the exit and the yes/no machine flickers only slightly brighter. Maybe we’ll even find somewhere independently certified to eat out here and a safe place to either stay or park the car overnight.\nThe sun is low in the sky; I’d forgotten how long we’d been driving. The yes/no machine is still not telling us to get out, as I pass over the road scanners and into the abandoned roads of old Middleton.\nPlayland is not hard to find. There’s a bunch of defaced billboards and signs pointing the way, and already I can see the big fake palm trees up ahead over the cramped streets and low buildings. Only a few houses have barbed wire around them.\nWhen we hit the street with the park on it I slow down, and because there is no traffic behind me I brake in front of the wide front gates.\nThey are open.\n“Can we go in?” Dave asks.\n“No,” I say immediately. “There’s no way that should be open. What if someone is robbing or vandalizing the place right now? We don’t want to get in the middle of that.”\n“It looks pretty quiet,” Dave says.\n“Sure does,” I say. “Doesn’t make me like it better.” In point of fact, it made me like it a whole lot worse.\n“I can’t see from here,” Dave complains. “Can’t we just, you know, pull in a little bit? Just enough for me to see if there are any more of my kind there?”\n“No,” I say again. I pull ahead, and park the car on the side of the road just past the gates. There’s a convenience store across the street, lights on and open sign lit. “I’ll go ask if they know what’s going on here, okay? If the park’s not supposed to be open like that they can call the local police, if there are any. You two wait right here. Got it?”\n“Got it,” Dave says.\n“I’m trusting you,” I say.\n“I know.”\n“Okay.” I get out of the car, lock it, and skip across the street. The sun is below the skyline now and a streetlight comes on just as I run under it. I glance back and I can see Dave and Marty in the car right where I left them, so I go through the metal detector into the shop. The back half is all hard liquor and edibles, in a cage, with an employee on the far side who looks up from a magazine when I walk in, but I’m not interested in anything in there, so the man loses interest in me just as fast. The woman behind the counter barely moves from where she’s leaning against the counter as I walk up and put a few bags of snacks on the scanner. You get better info if you’re not asking just for free.\nShe rings it in, and scans my phone. We wait for it to report that it’s not a stolen ID, then report that I’m not a wanted criminal or a tax escapee, then finally sends the charges.\n“You’re all set, honey,” she says when it rings through. Been a while since I’ve been broke enough to get declined, but I still have that sharp bite of relief every time I don’t.\n“Thanks,” I say. “Hey, I was noticing the gates of the dino park are open. That guy didn’t get off his ass and finally start fixing the place up, did he?”\nShe snorts. “Kurt? Fix something? Not a chance. Sold it a month ago, though. Never heard someone complain that much about getting so much money for shit before, but that’s the kind of man he was. Haven’t met the new owner yet.”\n“Thanks, I just wondered,” I say, and pick up my things.\n“I loved that place when I was a kid,” she continues. “You could go in and talk to the dinos and they’d talk back to you and it was magical. Makes me sad every day to see it falling apart along with everything else in the world. You know what I mean?”\n“Yeah,” I say, even though I’m probably a third as old as her and the world’s been falling apart as long as I’ve been in it. At least I know what it’s like to have a dinosaur talk back to me, except mine is full of moping and complaints rather than handy, cheery facts about ginormous Pleistocene bugs.\nI leave the store, and wait for a lone van, rusted out and smelling of old-school gasoline fumes, to pass. Dude behind the wheel is looking at me, and if I didn’t have my arms full of chips and candy bars I’d’ve flipped him the finger just on principle. But he keeps going, and I start across the empty street and am halfway across before I realize Marty is standing about halfway between the car and the gate, moving back and forth in agitation.\nI run.\nMarty sees me coming and recognizes me, and I get to him before he can run into the road to meet me and get him back safely on the sidewalk. “Cassie!” he says.\n“You okay?” I ask. He doesn’t look hurt, just confused. “What happened?”\nMarty points. The passenger car door is open, and Dave is gone. “He told me I had to help him,” he said.\n“He went into the park, didn’t he?” I say. It’s not really a question. I check the trunk, and sure enough the modified furniture dolly with big rubber wheels that Dave uses to get his head around outside is gone.\n“He told me I had to,” Marty says again. He is wringing his hands between bouts of flapping them, and I throw the junk food into the back of the car, get Marty’s sweater out, and wrap him up in it. It’s not cold, but the weight of it usually helps him calm down. This time, it takes a while.\nIt’s getting dark out, and there’s no way I’m leaving Marty in the car alone. “We can come back for Dave tomorrow,” I say.\n“No, no!” Marty shouts, and starts shaking again. “We have to go get him now! What if we leave and they won’t give him back?”\n“Okay, okay,” I say. “It’s all right. I’ll go get him.”\nWhen Marty is calm again I lure him back into the car with a candy bar, and then I stare at those gates for a minute as if I can make Dave get his ass back out here on his own by force of fury.\nWhen that doesn’t work, I get behind the wheel, back the car up, and I drive through those goddamned fucking gates to go get that goddamned fucking asshole dinosaur head.\nThe parking lot is larger than it looked from the outside; Playland must have been popular in its prime. I’m halfway across it when the sensors for the lot lights figure out I’m there and come on, lighting the place up one empty, Dave-less row at a time until I can see the actual park entrance, dead ahead, and next to it a far-too-familiar beige, armored Luxauto. I yank the wheel hard to the left and turn, accelerating, but already the gates we came in through have swung closed.\nBastard. I should have known it was a trap, but I didn’t think even Dave would be this dumb. Or this selfish.\nI turn again and head toward the Luxauto. I can see my father now standing beside it, arms crossed over his chest, and even though it’s still too dark I know all too well the smug-ass smile he’ll have on his face. For a half-second I think about just ramming the Luxauto—pretty sure my ex-cruiser is a decent match for it—but I’ve got Marty with me, so I don’t. I do park close enough that he has to get out of the way or get trapped between the two cars; I missed kissing his side mirror with mine by about a centimeter, because I’m that good.\nI get out, and so does Marty, and it takes a second for Marty to figure out what’s happening. “Ted,” he says, and the word is as close to a swear as anything I’ve ever heard him say.\n“Martin,” my father says. “Still alive, I see.”\n“At least one of us has to outlive you, so someone can spit on your grave,” Marty says. “I owe my sister at least that.”\nMy father shrugs, as if to say he doesn’t care, which he doesn’t and never has. I don’t know how my mom fell for him at all, much less for so long, since it’s clear as day to me that all he ever wanted was to undermine and steal her work to preserve his own stupid empire, but people can be incredibly smart and stupid at the same time, especially when the heart is involved.\nLike driving through those big open gates after Dave.\n“Your mechanical friend is inside, looking for family,” my father says. “I should have warned him that family is always a disappointment.”\n“That’s funny, coming from you,” I say.\nI pat Marty reassuringly on the shoulder. “Wait in the car. I’ll go get Dave,” I tell him.\n“Uh-uh-uh, no you don’t,” my father says, and waggles a finger at us. “Private property.”\n“I’ve got permission from the owner,” I lie.\n“Really? When did I give you that?” my father asks.\n“You have to be shitting me,” I say. “You went and bought an entire fucking dinosaur park just so you could lure us here? Why? What the hell do you want?”\n“You know what I want,” he says, and it’s true that I do, but now it’s my turn to shrug like I don’t care. He frowns. “I’ll make this easy, no more games. I know about your little secret safety deposit box in Fairham. Give me the key.”\n“How the hell do you know about that?” I explode. “You cheating, scheming, murdering son of a bitch—”\n“Shut up!” he commands. Oh, he looks so fucking proud of himself, too. “And you know perfectly well I didn’t kill your mother.”\n“You didn’t save her, though. You could have. You knew there was a hit out on her.”\n“So? Life isn’t fair, Cassie,” he says. “Get over it. I want what’s mine. I want the key.”\n“Couldn’t find it when you had Marty’s house tossed, huh?” I ask. “How many times now? Three? Four?”\n“Four,” he says, “though how you could tell with that mess I can’t begin to guess. Seriously, how can you live like that? You could have so much more, Cassie, if you just used what you’ve got and started thinking like a winner.”\n“So that’s how Dave found out about this park. You left a brochure around for him to find? Or did you just arrange this visit directly?”\n“Ask him yourself,” my father says. “The key?”\nHe holds out his hand.\n“It’s hidden back at the house,” I say. “Guess your guys just suck at looking.”\nHe shakes his head. “It’s not at the house,” he says. “If you knew we’d been inside, there’s no way you’d leave anything valuable there. I know you have it on you, so hand it over and I’ll let you collect your dinosaur head and go on your way.”\n“No deal,” I say. “You want me to think like a winner, well here it is: the key is worth a lot more than that, certainly way more than one dumb robot dinosaur head that leaks oil on the carpet and sold me out to you.”\n“And what do you want in return? Don’t expect to get much.”\n“Never got anything except pain from you anyway,” Marty interjects. He’s still with us, not drifting, and for once I wish he was because the look of grief on his face is like a gut punch.\n“I want you to stay out of Marty’s house,” I say. “And I want two hours to go do some parts shopping in the park, after I find Dave.”\n“One hour, including finding your dino head,” my father says. “Then you hand me the key before you leave the park. Take the offer: I don’t want to hurt you, but I’ll do whatever I have to. Think of your uncle. Or what’s left of him.”\n“I’ll hand you the key at the open gates,” I say.\n“Deal.”\n“Deal, then,” I answer. “Marty, grab the toolbox out of the trunk and come with me. You coming, Ted?”\n“Hell, no,” he says. “I’ll wait here.”\nI lock the car and set the three separate alarm systems I’ve got on it, and we head into the park to find Dave. It’s full-on twilight now, and the park’s working lights few and far between, but I have flashlights in the toolbox—a big rolling thing with a handle, one of my better investments—and hand Marty one. “You okay?” I ask him.\n“I’m okay,” he says, and flips the light on. “Sometimes, though, it feels like I’m here and then I’m there and I’m not sure where or when, or what’s happened already or not happened or I dreamed it, you know? I thought I gave Ted a black eye.”\n“You did, and it was a beaut. But that was three years ago,” I say. “Might need to re-up it on our way out of here.”\n“I can do that,” he says.\nWe walk forward into the park, look at the fading signs. “Sauropods that way,” I say and point.\nMarty starts to walk, then meanders to a stop and looks back at me. “How’d you get so big, Cassie?” he asks. “Where’s Jennie? Did she save the world?”\n“Mom’s gone,” I tell him, and I’m glad it’s dark because I don’t want to see his face and I don’t want him to see mine either. We’ve done this too many times before—remembering is a bitch and a half. “Hey, we’re here in Middleton Parkland and we have to find Dave and we can grab some parts, okay? Stay with me, here.”\n“Middleton? But the owner—”\n“It changed hands. We’ve got an arrangement. But we only have an hour. Look around. Focus, okay? What do we need?”\n“Dave is here?” he asks, but he’s walking forward again now without the hesitation of moments before. “All of him?”\n“Just his head,” I say.\n“All on his own?”\n“You built him a motorized cart out of a furniture dolly, remember?”\nWe’re nearer one of the working lights, so I can see him grin back at me. “Right!” he says. “That was a clever bit of work on my part. Had to make him promise not to get into trouble with it, though.”\n“Yeah, well,” I say, and wave my hands around us. “Welcome to trouble.”\nThe Sauropod Swamp is up ahead, past a collapsed snack hut, and I can see the long, unmoving necks of three of Dave’s model sticking up into the night sky like strange smokestacks. I follow along the low wall, Marty behind me, until around a curve we find Dave, on his dolly, staring up at the nearest sauropod robot.\n“They’re all dead,” he says, when we are near enough to hear, and he sounds so sad and heartbroken that just for a second I almost forgive him for walking us into a trap with my father. Almost.\nOkay, not really very close at all. But a little tiny bit.\n“Marty, you think you can see if we can get a knee motor out of one of them?” I ask, and he’s already pawing through my open toolbox. He’s been centered for longer than I’ve seen in a while, and maybe it’s just all about keeping him with a new challenge in front of him. Or we’re lucky.\n“Be right back, Cassie,” he says, and climbs over the wall into the weeds and garbage.\nCan a giant animatronic robot dinosaur head avoid looking you in the eye? Yes. Yes, it can. So I went over and gave him a good, solid, totally ineffective kick.\n“I’m sorry,” Dave says.\n“You knew it was my father?”\n“No,” Dave says. He’s still not looking at me. He clacks a few times, then adds, “but I could have guessed, if I’d thought about it. I just wanted to come find another Euhelopus, and when the cable guy said there were some here, dug a brochure out of his truck—”\n“We don’t have cable,” I say. “We’ve never had cable. And you said you found the brochure.”\n“Yeah. I lied a little bit,” he said.\n“And when you saw him? You still came in?”\n“I only saw the Luxauto,” he says. “I thought maybe there was a chance it wasn’t his. Look, I’m sorry. I’m just a stupid, selfish head and you’d be right to just leave me behind here.”\n“Hell yes I would, and I would have,” I say. “But then Marty would be upset, and I’d have a giant headless dinosaur in the backyard. With my luck raccoons or some shit would take up living in your neck and it would be a goddamned health hazard.”\n“That would be terrible,” Dave says.\n“Yeah.” I look at the time. Thirty-eight minutes left. “I’m gonna go see if I can help Marty, and you’re going to stay right the fuck here, right?”\n“I will,” he promises.\nThis time he does meet my eyes, so I climb over the fence and head for where I can hear Marty banging around. I find him and he’s chatting with the other guys in the garage, totally lost as to where he is and what’s going on, but he’s got most of the rusting plating off one of the sauropod’s legs and is up to his shoulders inside, working the socket wrench.\n“Marty?” I ask.\nHe pulls his head out of the cavity. “Jennie!” he says. “You came by the shop to help out? And what did you do to your hair?! You better not let Mom see that.”\n“I came to help,” I say. Grandma was dead before I was even crawling, and sometimes it feels like everything I know about her is from her guest appearances in Marty’s wandering mind.\n“Great,” he says. “The strut on this truck is totally shot, and rusted to boot. Can you hand me the adjustable wrench? The big one.”\nI hand it to him, and his head disappears back inside. “Greg and Barry are gonna go on a coffee run; machine is busted again. If you want anything, tell ’em I’ll cover it.”\n“I’m good, thanks,” I say.\nHe emerges again, a giant smudge of grease across his nose, and hands me a sauropod knee motor. “No wonder this is all messed up,” he says, “you ever see a wheel strut like that?”\n“Couple of times,” I say. “It’s a knee. We’re in the Middleton Prehistoric Playland, looking for parts to fix Dave. I need you here now, okay?”\nMarty blinks at me, then looks around, looking for Greg and Barry and Linda and Scoops, the garage dog. Then he seems to deflate, his arms hanging down by his side, wrench dangling from his hand. “We were happy then,” he says.\n“It’s okay.” I take the wrench from his hand, put it back in the toolbox, bungee the salvaged joint motor across the top. “We’re happy now too, just a different kind of happy. But we’ve got about fifteen minutes to get out of here, and it’s almost that long a walk back to the entrance. Anything else you want to grab, do it quick.”\n“Nothing,” he says. “That’s all we need.”\nWe climb back over the wall to where Dave is still waiting. “We gotta go,” I say. “Keep up as best you can.”\nWe run for the entrance. Marty is not any slower than me while I’m hauling the toolbox along with me, and Dave has the control lead for the dolly in his mouth and is zooming along behind us. We are most of the way there when Marty swerves off to one side and around a big, fake, graffiti-covered rock into the Precambrian Picnic Place. I’m trying to stop without running myself over with the toolbox or getting crushed by Dave when Marty comes running out past the far side of the rock, smiling his best smile, and his pockets and shirt are bulging.\n“Trilobites!” he exclaims. “I can program them for all kinds of things!”\nSure, whatever. If it keeps him busy and present, I can handle some creepy-ass robot bugs around the house. Maybe he can program them to clean.\nWe reach the entrance with about a minute and a half to spare. My father watches, still leaning against his armored car, as I load Dave, Marty—who I swear dropped at least a dozen hockey-puck-sized trilobites on the seat around him—and the dolly, toolbox, and knee back in the car.\n“We have a deal,” he says, when I’m done.\n“Safety deposit box key and then you leave us alone,” I say. “You gave your word.”\n“To be specific, the key to your Fairham First box,” he says. “Number 131. No switching it up. I don’t trust you to not play me on the details.”\nI take a deep breath. I always knew, eventually, he’d get ahead of me, and I always thought I’d be able to play it cool, but my hands are shaking as I reach over my shoulder and down the back of my T-shirt, and break the tiny stitches where the little flat key has sat snug along my bra strap for years now. I hold it out in the palm of my hand.\nMy father reaches for it, and I close my first. “First, open the gates,” I say. Dammit, I am not going to cry, not in front of him. “I know better than to trust you, either.”\nHe signals to someone I can’t see, and a moment later the gates at the end of the parking lot open. I make a show of getting in my car, and backing it out and turning around, and he walks over to stand in front of me. He knows, despite everything, that I won’t kill him. Mostly because I’ve had better opportunities than this.\nI roll down the window, and I hold the key out. He steps out from in front of the car and takes it, and the moment the key is out of my hand I floor it, my good ol’ grease-V8-cruiser, and we’re out of there like a fucking cannonball. We swerve out onto the street hard, which we’re lucky as hell is empty, and I can just see the woman in the store across the street peering out the window as we tear away from there, back toward the highway and away from Middleton as fast as we can go.\nDamned fucking yes/no machine ought to have a color just for proximity to my father.\n“I hate him,” Marty says quietly in the back seat.\n“He didn’t give us a choice not to,” I answer. “But he’ll leave us alone, at least for a little while. Bastard likes being a man of his word, the magnanimous leader, until he figures out the loopholes in whatever he promised.”\n“At least we got away,” Dave says.\n“At what cost?” Marty asks. “What is it that he wants from you so badly as to go through all of this?”\n“Something of Mom’s,” I say. Something she left for me, to save it from him, save me from him.\n“And now he’ll have it,” Marty says. He leans forward and whacks Dave’s head, although not hard. “This is your fault.”\n“I know. I said I was sorry!” Dave complains.\n“It’s all done now,” I say. I can see a drive-through ahead, one of the more reputable chains, and I’m tired enough that I swing into the lane and get food for everyone. If we have the shits tomorrow, well, we’ll suck it up. I don’t want to stop again until we’re home, even if I have to drive all night.\nIt’s close to noon before I get out of bed and find Marty aimlessly wandering around the living room, and I’m not sure if he’s here or not, but he’s not talking to anyone else, so maybe? “Morning, Uncle,” I say.\n“Cassie,” he says. He points to where I dumped all our crap on our way in at four AM. “The fellows at the garage dropped off a new knee for Dave.” He holds up a trilobite. “Also they brought me a bunch of these! I think I can reprogram them . . . ”\n“I bet you can,” I say. “What are you going to have them do?”\n“I don’t know. I’ll need to dig into their code set. I haven’t had a project this fun in a long time.” His face falls. “But I should fix Dave’s knee, first. He’s been so very patient.”\nI don’t comment on that. Instead, I pick up the knee motor. “I’ll do it,” I say.\n“Thanks, Cassie! You’re the best. I wish the guys would get back here with the coffee, though. Machine is busted again . . . ”\n“It’s okay, I’m sure they’ll be along soon,” I say. Greg died of stomach cancer four years ago, and is buried only a few rows over from my mom. I don’t know where the others are. The garage itself is now a dry cleaner.\nDave has put his head back on his neck, and is looking out over the neighborhood. “Hey, Cassie,” he says.\n“Hey, Dave. I’m going to put that joint motor in. I need you to not move, because if you think I’m mad about the road trip, you have no idea how pissed I’ll be if you squash me,” I say.\n“I didn’t want to be alone,” he says.\n“We don’t count? Thanks a lot,” I say, as I pull off the leg plate. There’s a little bit of rust on the edges, and I’ll have to get out here with a wire brush and some touch-up paint in the next month or two.\n“That’s not what I meant,” Dave says.\nAnd I know what Dave meant, but I also know sometimes you gotta adjust your expectation of what counts as alone and what doesn’t, because nobody has a perfect picture life, or not for very long.\nDave still has his neck craned all the way up. “What are you looking for?” I ask.\n“Beige cars,” he says.\n“Not today,” I say. “My father will be on the road to Fairham by now, if he’s not there already. Gonna go personally, too; can’t delegate that to any of his flunkies. Now hold still.” I grab the floor jack designed for house joists and I wedge it up under Dave’s butt crack to keep him steady, just in case.\nDave doesn’t really have a butt crack, of course, but there’s a plate up under the base of his tail where there’s the vague, diplomatic suggestion of something of the sort, and up inside above that plate there’s a small box wrapped in brown paper and tied with green ribbon, with my mother’s handwriting on it: just my name, the words you will know when to use it, and a heart. If I close my eyes I can picture it exactly, and feel the weight of it in my hands, remember the paper cut I got when I wrapped it back up too fast after I realized what the vials inside held, and what my father would do to get them.\nLike buy an entire falling-down park so he could weasel a key out of me. Fucking ridiculous, this long game of ours.\nWhen I was eight, he came to our house where I was playing in the backyard, and gave me a little plastic pony with rainbow hair and told me how much he loved me and what a smart girl I was, and then asked me if I knew where Mommy’s secret hiding place was. I showed him a recently-dug spot in the garden, where I had insisted my mother help me bury a roadkill skunk a few weeks earlier. Didn’t tell him that part, though. I was a smart girl even back then.\nI wonder if he’ll recognize the pony toy, when he finally gets my safety deposit box open. He may have left Dave a Playland brochure, but I left a receipt for the box rent for him to find, ’cause I knew eventually he’d search the house. Girl’s gotta have lots of extra cards up her sleeve, right?\nOr right in the palm of her hands.\nThe hand sanitizer bottle I keep at my porter station at the airport is getting low, and by fall I’ll need to refill it. For now, though, my mom’s package can stay safely where it is, as her work, little by little, goes bon voyage around the world.\nIt takes me an hour and a half to get the knee replaced, then I let Dave back down off the jack and step back, wiping sweat from my forehead with the greasy back of my hand. “Give it a try,” I say.\n“Are you sure?” Dave asks.\n“Just do it, dumbass,” I answer.\nHe takes a tentative step, and the knee actually bends, just like it’s supposed to, and thirty seconds later I’ve got a gigantic metal robot sauropod frolicking in the goddamned yard.\nMarty comes out and puts an arm around my shoulders. “You did good, Cassie,” he says. “Definitely got the family engineer genes. Your mom would’ve been proud.”\n“I know,” I say, though it never hurts to hear. Well, maybe a little.\n“Come on inside,” he says. “The guys are bringing over beer and pizza tonight, and we’re going to discuss what to do with the trilobites. You don’t want to miss it.”\n“Not for anything in the world,” I say. “I just need to clean up our tools and I’ll be in.”\n“Okay. Don’t take too long—you know how Barry is around unguarded pizza.”\n“I sure do,” I say.\nMarty heads inside, and I can hear him talking to one of his memories, excitedly explaining about the trilobites. I take out my device and order a pizza to be delivered, along with a six-pack of root beer, then pack up the rest of my tools.\nDave comes back over and bends his head way down to where we are nose to nose. “What if he comes back?” he asks.\n“He will, sooner or later. He has to, once he realizes he still hasn’t won. Just try to be less stupid next time,” I say.\n“No, I mean, what if he finds that thing he wants?”\n“He won’t,” I say. I pat him on the nose. “Don’t worry about it. And I need you to stop stomping around out here for the night; we don’t need the neighbors complaining.”\n“But I just got my leg working again! That’s not fair!”\n“Life isn’t fair,” I say, and I roll my toolbox with me back into the house, back to Marty’s party, and wait for the pizza guy to show.\nSuzanne Palmer is a writer, artist, and linux system administrator who lives in western Massachusetts with her kids, lots of chickens, and an Irish Wolfhound named Tolkien. She won the 2018 Hugo for Best Novelette for her Clarkesworld story “The Secret Life of Bots,” and its sequel, “Bots of the Lost Ark,” is a nominee for the 2022 Hugo. She has no idea what color her hair is anymore."}