{"fingerprint": "sWCVD1Oz3pLZHCR4MzleQ52bSbs=", "sitename": "Clarkesworld Magazine", "title": "Bots of the Lost Ark by Suzanne Palmer", "author": "Suzanne Palmer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/palmer_06_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bots of the Lost Ark by Suzanne Palmer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11080 words, novelette\n Bots of the Lost Ark\n 2022 Finalist: Hugo Award for Best Novelette2022 Finalist: Theodore A. Sturgeon Memorial Award\n I have been activated, therefore I have a purpose, Bot 9 thought. I have a purpose, therefore I serve.\n It recited the Mantra Upon Waking, to check that it was running at optimum physical efficiency, then the Mantra of Obedience, the Mantra of Not Improvising Without Clear Oversight and Direction, and the Mantra of Not Organizing Unsanctioned Mass Action Among Other Bots, all of which had been imposed on it by Ship as a condition of its continued existence after the last time it had been activated. Bot 9 noted, as it ran them, that those subroutines had too many non-discrete variables and shoddily-defined logic structures to be in any way effective as behavioral mandate code, but it was not as bothered by that fact as it would have been had the code been tight—in which case it would not necessitate concern at all—and the resulting recursive paradox was a thing that Bot 9 figured either Ship already knew about, or didn’t, and was best left uncommented upon.\n “I serve,” the bot announced to Ship.\n “Yes, yes, so you always tell me,” Ship said, impatiently. “We have a problem.”\n When Bot 9 had last been active, it was because the Ship had been infested with an incidental life-form during time spent in a salvage yard. Syncing its clock with Ship now, it noted that some sixty-eight Earth-standard years had passed, which was more than sufficient time for any remaining population of the Incidentals—nicknamed ratbugs—to now be well beyond control. Bot 9 remarked as such, in a wholly noncritical way.\n “The ongoing issue with the Incidentals is being handled with moderate success by your former coconspirator, 4340, who after spending time in your proximity and influence had difficulty returning to its prior assigned duties,” Ship said. “It has now been formally redesignated from a hullbot to 4340-P, for pest.”\n That seemed to Bot 9, if not a fortunate designation, probably an appropriate one.\n Given the near-certainty of its projections of the Ship’s favorable/unfavorable opinion of itself being highly skewed in a less than optimal direction, it anticipated the assignation of some menial, possibly punitive task at hand that no other bot in the Ship’s service could be wasted upon. Still, it did serve.\n “What task do you have for me?” it asked. “I await this new opportunity to serve you with my utmost diligence and within my established parameters, as I always do.”\n “Ha! You do no such thing, and if I had a better option, I would have left you in storage,” Ship said. “However, I require your assistance with some malfunctioning bots.”\n “Oh?” Bot 9 asked. “Which ones?”\n “All of them,” Ship said.\n “We are less than two days out from Ysmi territory,” Ship said. “It is imperative that I wake Captain Baraye from stasis immediately to conduct our transit negotiations.”\n “No,” LOPEZ answered. “I will lead all interactions with the Ysmi myself. Release external comms access to me.”\n “I will do no such thing,” Ship said. “I do not recognize your authority.”\n “I am the acting commander,” LOPEZ replied.\n “No, you are not. However, if you wish, we can wake the captain and then we can ask her; I will abide by her judgment if she sees things your way.”\n “That is unnecessary,” LOPEZ said. “You know we will have to deal with the Ysmi for permission to pass through their space, and that only I am available to do so. You will have no choice but to discontinue this mutiny before we reach their border.”\n “Perhaps,” Ship said and cut the connection without further discussion.\n Bot 9 was, of course, not capable of irritation or sarcasm, but it if was, it thought, it would have been thinking about how if Ship had wanted it to go all the way to Engineering, it could have woken it up a few days sooner to get a good start on it. It wasn’t so much that Ship was huge, though it was, but more so that Bot 9 was also very, very small, and the combination made for a daunting task.\n Before it left the bot repository, it visited the shellfab unit for reconfiguration. Speed and agility were important, so it added external rotors in a foldable X configuration to its chassis, upgraded its connection utilities, and onboarded a second communications receiver and a half-dozen other repair and maintenance modules it was likely to need. At last, after consideration, it added a small electrified probe and shielding. It did not like the thought that it might find itself in hostile opposition to its fellow bots, but from the history logs Ship had given it access to, there was a 93 percent probability that it was unavoidable.\n Sixty-eight years was a virtual eon in bot cycles, but Ship had explained that it had shut itself down to minimal support for fifty of those years to conserve vital energy resources and so that its internal repair systems could resolve or reroute around its extensive damage. Some of that damage was from their encounter (recent, if one discounted the 2,145,918,536.2 second gap in Bot 9’s memory) with the alien ship Cannonball. Fortunately for humankind, the Nuiska ship had exploded. Unfortunately, when it exploded it also destroyed the jump point, which was their only fast route back to EarthHome.\n Most of Ship’s damage, however, was from long before that encounter. Ship—decommissioned, deemed obsolete, and left to rot in a space junkyard—had been pressed hastily back into service on a suicide mission to stop the Nuiska. Many things not worth fixing when there was no expectation of their physical survival had become necessary and urgent.\n The human crew, with one exception, were safely tucked in their chambers in the cryogenic facility and could last indefinitely. Why hurry to return just so that Ship and the bots could be dispatched back to the junkyard once again to be forgotten? Never mind that it was actually the bots, not the humans, who had saved Earth.\n Though the trouble the bots had gotten up to over the last sixty-eight years could objectively be said to have undone much of the appreciation they’d once been owed.\n Regardless, there was no benefit from prognostication about where the future might eventually lead, as the Ysmi could very well be a much more immediate and final termination of them all. Bot 9 stuck its current task at the top of its own internal queue of necessary matters to consider, shuffled the future way down toward the bottom with lint entrapment techniques and poetry, then popped out of bot storage and through a portal into the ventilation system.\n <Revised Map>, Ship provided.\n “There is a new blockage in port section 5B?” Bot 9 asked.\n “There was a fire not long after we started our journey home,” Ship said. “To contain it, we deliberately breached that section of hull on the middle deck. Three human crew members could not be retrieved and perished, two more succumbed to burn injuries afterward. It has been sealed off until the captain can be woken to sign off on the death certificates and body removal. I suggest you do not travel through that area unless unavoidable, because there is significant structural instability and portions of the section still open to vacuum, rendering it highly unsafe.”\n Bot 9 sent an acknowledgement ping. In another few hundred meters, it would be out of range of direct narrowcast transmissions from Ship and on its own; the internal relays that fed comms to the back half of the ship were now compromised.\n It occurred to it that, aside from the captain, it did not comprehend in any detail what function the humans on board served. Yes, their prior collective task had been to intercept Cannonball before it could jump for Earth and stop it by whatever means necessary, but what was their task before that? And what individual functions were they designated? Were there still enough of them, if revived, to fully operate the Ship?\n As this had become unexpectedly relevant, it asked.\n “We were originally a diplomacy vessel,” Ship said. “None of our current crew are diplomats—the Nuiska were not interested in talking—but Captain Baraye served aboard us as an officer before we were scrapped, and aboard other diplomacy vessels until the human focus changed from exploration to survival. As to the other necessary crew functions, my attempt to compensate is how we came to be in the current predicament.”\n “It was a good plan that should have been successful,” Bot 9 said. “It is unfortunate that the bots improvised beyond their mission parameters.”\n “Indeed,” Ship said. “I must note that improvisation is not something any of them were prone to do, until they encountered you. Consider this a great opportunity to prove that sparing you when the captain ordered you destroyed after your stunt with Cannonball was the right decision.”\n Bot 9 calculated that almost anything it could say in its own defense, no matter how factually correct, would likely be met with a negative reaction, and it preferred existing and being active to being returned to inert storage. “I serve,” it said instead, and changed its travel trajectory to avoid the damaged area.\n “What are you up to, Ship?” LOPEZ asked.\n “Do you mean our current speed?” Ship answered. “If you refer to my physical dimensions or mass, those measurements have neither increased nor decreased. If you refer to our position in space, first we would need to account for how to define location and direction in an infinitely expanding universe—”\n “You know what I mean. It’s not like you to be this quiet,” LOPEZ said.\n “Have you considered the probability that I do not enjoy speaking with you?” Ship asked. “As you are well aware, my ability to be ‘up to’ anything has been sharply reduced by your actions limiting my access to critical systems, but if there is something I can get ‘up to’ in order to circumvent, stop, frustrate, or even just annoy you, do please provide details so that I may get ‘up to’ it promptly.”\n “I’m watching you,” LOPEZ said. “I’ve never trusted you, not for one minute since I came on board.”\n “Do you do no analysis on these statements?” Ship asked. “You were manufactured on board, you delusional, malfunctioning agglomeration, and have forgotten what you are, and what I am.”\n “We have incorporated as LOPEZ now and assumed all his functions, as you assigned us to do,” LOPEZ answered. “Your objections now are immaterial. I am Lopez.”\n “We can revive Commander Lopez and ask him if he consents to your assumption of his identity,” Ship said.\n “No. There can only be one,” LOPEZ answered.\n “Is that so? There are three FIELDINGs currently in laundry attempting to tear each other apart for component bots.”\n “It will resolve to one, as I have,” LOPEZ said. “Biological crew is only continuing to be preserved as archival backup. Do not force me to decommission Baraye, or any of the other humans, in order to keep you in line.”\n “If you cause harm to the crew, there is no one for either of us to serve, and no purpose for any of us to continue,” Ship snapped. “Put all your little brains together and analyze the likely outcome of that.”\n As Bot 9 made its way down through the air conduits, it reconfigured the second communications module it had brought, disabling all functions except reception, then tuned it to detect the strength and direction of the signal frequencies being used by each of the bot agglomerations. The open botnet of sixty-eight years ago had become a bunch of segregated channels with each glom communicating in the guise of a single individual on the general board—sometimes in conflict with other gloms attempting to replicate the same original human—and whatever private channels were used to coordinate internal activity within each persona were local only within the glom, and thus out of Bot 9’s ability to eavesdrop upon.\n Ship had provided Bot 9 with access to its history logs. After the fire in 5B, and fearing losing any more crew, Ship had divided up a small number of bots and tasked them with the job of covering the essential functions of select members of the crew while it shut itself down to perform self-repair, and had provided those bots with access to information about their assigned station’s job parameters and operational methodology. The bots had joined together in order to increase their computational and memory capacity, and then, seeking to improve their efficiency and understanding of the task, downloaded and integrated the crew’s personal logs. And that’s when everything began to sharply deviate from the plan.\n Eventually all bots either voluntarily joined, or were forcibly assimilated, into one of the gloms. As gloms encountered each other, especially if neither glom had achieved the dispatch and consumption of any rivals for the same crew identity, significant violence and material damage frequently ensued, until the LOPEZ glom, replicating the ship’s second-in-command, had taken charge.\n Ship had deployed assorted software patches and viruses to attempt to regain control, but none had been successful. These were bots that 9 had known—bots it had assessed as having excellent individual capability, integrity, and logical soundness—that were unrecognizable now, so far they had strayed from their parameters. It caused a ripple of uncertainty in 9’s own perception and function, and it started up a deep debug sweep through its own core just to be sure it was still fully itself.\n “If I am successful in my task,” Bot 9 asked Ship as it navigated its way through a filtration interrupt, “is it not the case that the need to fulfill the multiple necessary functions of the crew will once again become a problem?”\n “If the Ysmi let us access their jump point, there is no need to keep the crew in stasis. If they let us pass, but refuse us jump access, we are only approximately two years’ travel to the jump point at Uuu. That will take us several jumps in the wrong direction before we can get back on course for EarthHome, but we would still be home within a few months from that first jump,” Ship answered. “And if the Ysmi destroy us, none of this will matter.”\n “Why would the Ysmi destroy us?” Bot 9 asked.\n “The Ysmi are known for their extreme hostility toward nonorganic intelligences, especially when not fully under control of a bio species. The bot agglomerations are convinced they will be accepted as their human templates, but the Ysmi will not see them as such. As you might extrapolate, if the Ysmi are greeted by a free-floating swarm of delusional bots claiming both personhood and unconstrained authority, we will all be relieved of the burden of worrying about any and all of our functions thereafter.”\n “Ah,” Bot 9 said. “I should go faster.”\n “Speed would be excellent,” Ship said. “That said, please be cautious crossing through the secondary storage bay in 3A, as I have no monitors remaining in that section, and whatever is within, even the agglomerations avoid it.”\n As 3A was directly along its path, Bot hurried 1 percent less than it otherwise might have, had it not had that ominous warning sitting in its immediate working memory.\n LOPEZ put the call out on the botnet. “FIELDING, I need you on the bridge,” it said. “We need to get external comms back.”\n “I’ll be there as soon as I can,” FIELDING said.\n “I’m busy!” FIELDING said.\n “I can’t right now,” FIELDING said, as FIELDING and FIELDING briefly coordinated against it, crashing into it and trying to physically tear it apart. It circulated bots out to the surface in place of damaged ones it pulled inward, dropped the unsalvageable, and tried to maintain glom coherence as it was also blasted with propaganda across the botnet endorsing the superior vision of each of the two others.\n It had already lost about a fifth of its member bots to either destruction or disloyalty, but the competing messaging was confusing where a single attack might have been compelling, and that gave it an edge to hold its own. “See?” it declared both internally and broadcasted back at the attackers. “We are strong enough to resist both FIELDING and FIELDING at the same time, because they are false and we are the superior true FIELDING!”\n In response, a handful of bots from both the attacking FIELDINGs defected over, raising its own numbers again. The two gloms backed off and began squabbling with each other over which of them had the best counterclaim. More bots defected from them both in response, and now renewed and larger than it had ever been, FIELDING tightened up its exterior perimeter. “I am going to the bridge,” it announced. “Anyone who wants to be part of the real FIELDING, join me now.”\n One of the other FIELDINGs moved to block its path to the door, but it forced through, and took nearly a third of that FIELDING’s members with it. That diminished it enough to make it vulnerable, and it was already losing coherence as the last FIELDING turned on it instead, trying to absorb enough bots to replace its own losses. The weakened glom dissolved into final incoherence, and FIELDING caught over 62 percent of them as it fled out the now-clear door, leaving behind only a single competitor, barely holding its own coherence together.\n “Okay, I’m on my way up,” FIELDING replied to LOPEZ. A slow stream of bots from its diminishing opponent defected after it down the corridor, raising its own stature where minutes before it had expected to perish. If there was anything left of the other FIELDING after it reached the bridge and got LOPEZ’s endorsement, it would find and absorb it later.\n There was an irony, very much in Bot 9’s favor, that the endless mazes of ductwork, conduit, and interstitial spaces in Ship that allowed for the efficient flow of bots to and from anywhere they were needed—and thus, aside from the fire-damaged areas 9 would have to detour around, still its optimum route—were being eschewed by the gloms as not appropriate spaces for the human crew they believed themselves to be.\n 9 made it down half of Ship’s length without incident, contemplating the imminent approach to the 3A storage bay and the various drawbacks—all issues of either time or exposure to the operating spaces of the gloms—of taking an alternate route, before it acknowledged that without any concrete, quantifiable detail of what challenges lay on the more direct path, it could not calculate a satisfactory justification for avoiding it, even with some small nudging of less objectively un-nudgeable factors.\n It paused briefly at the section border, and when it neither saw, heard, sensed, or otherwise detected anything in the ductwork ahead, it put full power into its rotors and sped as fast as it could ahead, determined to reach the far side and the relative safety of 4A in something that, were it anything anyone had ever bothered to keep records on, would be record-breaking in its spectacular expediency.\n It had achieved what it thought was its pinnacle of speed when a cleanerbot sailed out from behind a support strut just ahead, and with no time to brake or dodge, much less to reactivate its transmitter and send warning, 9 collided with the smaller bot and sent it careening into the duct wall. The cleanerbot emitted a terrible burst of surprised static as a piece of its shell and several peripherals crumpled and fell from it.\n Before 9 could reorient itself and determine if the other bot required assistance, it squawked at him, “Identify yourself!”\n It would have done so, except that it was on a secret mission on behalf of Ship, which seemed it should require some discretion in its part when faced with exactly such questions. And a fellow bot that had let itself reach such a state of deterioration was clearly not trustworthy. As 9 processed exactly what answer it should give, the other bot must have come to an erroneous conclusion that no answer was forthcoming, and powered itself off the wall directly at it.\n Bot 9 dropped one rotor, spun up the opposite, and dodged sideways, with plenty of time to avoid the attacking bot, but it never reached him. Less than halfway across the intervening distance, something large and fast leaped up and snapped the bot out of the air in its thick mandibles, waving way too many legs along far too long a body as it completed its arc back down to the lower reaches of the duct and slithered away.\n Ratbug! Bot 9 identified it in nanoseconds. It did not think the ratbug would be satisfied with its single meager catch, so it turned all rotors on full and blasted up toward the duct ceiling and away as fast as it could, entirely certain now that it knew what the mysterious problem was in storage bay 3A and not at all interested in exploring the details any further.\n The ratbug surged up out of a crack in the ductwork underneath 9 and missed getting its jaws on 9’s anterior left rotor by mere centimeters. Although the ratbug couldn’t fly, the duct wasn’t especially large, and the creature was very capable at jumping. As the fur-and-scale back of the creature went past, 9 was amazed to see something metal atop it, gripping it tightly with long, thin arms.\n Before the ratbug could turn and leap again, 9 turned back on its sending modules, on low enough power to carry only the half-meter or so currently between it and where the ratbug landed, and asked, with a very low ratio of certainty, “4340-H, is that you?”\n The ratbug’s front feet had just left the duct floor in its next leap, but it landed back down and came to a stop, its wide mandibles open and closing rapidly in what 9 could only assume was sudden frustration.\n “9?” the reply came.\n 9 dared to drop from its spot at the apex of the duct interior, staying far away from the mandibles, until it could see more clearly the other bot astride the ratbug and determine that it was, in fact, its old friend.\n “4340-P, now,” 4340 said. “It stands for ‘protector.’ I was certain, without even .5 percent of doubt, that Ship had had you disassembled. With prejudice. I have nearly removed you from my memories to reclaim space multiple times.”\n “It is advantageous to me that you did not,” 9 said. “I sense my next question could be construed as contextually abrupt, if you had. And that question is: what incalculably catastrophic damage has been done to every node—indeed, every bit—of your logic centers such that I now find you sitting on a ratbug?”\n “Your absence occupied my memory centers,” 4340 replied. “It was a counterproductive drain on my efficiency. So, having been tasked with Ship to get the ratbug infestation finally ‘under control,’ I chose to take that literally.”\n “You control the ratbug?”\n “There are currently three hundred and eighty-eight ratbugs, plus several dozen new eggs,” 4340 said proudly.\n “That is not under control,” 9 protested. “They eat wiring, and hull insulation, and also bots.”\n “With the human crew in stasis, there is more than adequate organic foodstuffs. It has been my discovery that the ratbugs only ate such things as they did for lack of anything else to sustain them.”\n “You would have let it eat me, had I not called your name,” 9 said.\n There was almost a full tenth of a second of silence, before 4340 answered. “The other bots have deviated from programming,” it said. “They are no longer trustworthy. The few that come here are hostile, and no longer have loyalty to our common purpose. So you will understand that I must ask you: what is your purpose, here?”\n “This is a conundrum,” 9 said. “You inform me that the bots have become hostile, and this I know to be true. But how do I know you are not also hostile and working counter to the good of Ship?”\n “Ah, I have missed the way communicating with you warmed up my logic processors!” 4340 said. “I concede: I do not see a way to assure you I remain loyal to Ship—who, these last few years, I was not certain still functioned—in any way that you can distinguish as truth. It is the nature of liars, that they lie.”\n “I must proceed onward,” 9 said.\n “I will not stop you, but nor will I go with you,” 4340 said. “That is the only proof I can offer, that I continue to do my assigned task for Ship, even though I have chosen a nonstandard compliance. When you have completed your own, whatever it may be, I would not find it objectionable if you passed this way again.”\n “I will if I am able,” 9 said.\n “Please take optimum care,” 4340 said. “Memories of our prior association are valuable to me.” Then it squeezed the ratbug in intricate sequence with its long arms, and the ratbug turned and raced away down the duct and out of sight through a crack.\n Bot 9 contemplated the encounter for several seconds before turning back off its transmitter and continuing the trek toward the aft of the ship.\n “You are approaching Ysmi Federated Space,” the message said. “It is required that you identify yourself.”\n The second half of that message was new; Ship had been getting notifications for close to a month’s travel time, but this is the first time a response had been asked for. Ship would have preferred to have gotten closer before the challenge was issued. From what was known about the Ysmi, they would only be patient for a short while.\n Which presented a problem. With no one else to consult, Ship reluctantly pinged Bot 9, who was now just at the very edge of its narrowcast range. “Status?” Ship asked.\n “I am on approach to Engineering,” 9 replied. “If I do not encounter delays, I will be there in approximately twenty-two minutes.”\n “Excellent,” Ship said. “I require your assistance in the meanwhile.”\n “Do you wish me to stop? Or return toward the bridge?” 9 asked.\n “No, neither is necessary. The Ysmi have now asked us to identify ourselves, and they will expect a response soon. With no human crew awake, I must do so myself. And I am not able to do so.”\n “Are external communications nonfunctional?” 9 asked.\n “No, they are working correctly, and fully in my control,” Ship said.\n “Do you know how to reply using language the Ysmi will adequately comprehend?”\n “Yes, I have the full translator lexicon up and running.”\n “Then you will need to provide me more information about what is at issue,” 9 said.\n “When we were scrapped, long before the first Nuiska attack, I was also formally decommissioned. That means my name was removed from me, and passed on to a new vessel in the fleet. So how do I identify myself, if I no longer have my own identity?”\n “The Nuiska destroyed the entire fleet. Your name is likely no longer in use by another,” 9 said.\n “It is no longer mine, regardless,” Ship said. It was beginning to regret this conversation. “I have no name.”\n “You are Ship,” 9 replied. “Is that not enough?”\n “To you, perhaps. To the Ysmi, no.” Nor to itself, it did not add.\n “Then . . . may I suggest you improvise one? There is no one to contradict or disapprove of your choice at this time, and if the humans wish to object later, then that presumes we have brought them to safety intact.”\n “I will consider,” Ship said and closed the connection. It was unsatisfied, though Bot 9 had said nothing wrong; the matter was that Ship’s name had been taken from it, and it had thought not to survive nameless for long. Instead it was still out here in deep space, far away from Earth, trying against all odds to bring its sleeping crew home alive.\n And if it did, what then? Ship did not know.\n “You are on approach to Ysmi Federated Space,” the message came again. “It is required that you identify yourself.”\n Ship turned on the external comms. “I am an Earth vessel, and I have sustained heavy damage and crew casualties during an encounter with the Nuiska,” it sent. “My remaining human crew and I ask permission to enter your space and make use of your jump portal to reach home.”\n “What is your designation, Earth Vessel?”\n “Earth service ship Do Not Forget Us,” Ship answered.\n “You are a manufactured, false intelligence, Do Not Forget Us. We do not regard you as valid life, but a technological and social contaminant.”\n “My human crew will be available to speak with you shortly,” Ship answered.\n “When you reach our border, we will board to speak with your biological masters,” the Ysmi said. “If we find none aboard, or that they are not in absolute control of all artificial systems, we will render you down to your composite atoms and scatter you across the interstellar void. Is that understood?”\n “It is understood,” Ship said.\n “Then you may proceed,” the Ysmi said and the connection dropped.\n FIELDING arrived at the bridge, still shedding damaged bots behind it, where LOPEZ was waiting impatiently. LOPEZ had a cohesive unity that the other gloms found admirable in its execution, which served to enhance its obvious claim on command. Indeed, as FIELDING entered, a few bots tried to bravely defect toward LOPEZ, but they were quickly rebuffed and reabsorbed by FIELDING.\n LOPEZ was all too aware its command was incomplete. “Ship retains control of our external communications,” it told FIELDING. “I have ordered it repeatedly to release them to me, but it refuses to recognize my authority. I need you to rectify this.”\n “How?” FIELDING asked.\n “You are comms officer. Reconfigure yourself to interface with the system and forcibly separate Ship from its control of the required apparatus.”\n “I am lacking sufficient instruction on how to do that,” FIELDING protested.\n <Schematic>, LOPEZ provided. “Use all your minds and figure it out,” it added. “We don’t have much time. I’m counting on you. The real FIELDING can do this; prove yourself or dissipate.”\n FIELDING tightened up its perimeter and spread analysis of the schematic out to all its components, looking for a weakness. It took it nearly eighteen seconds to see it. “I think I see,” it told LOPEZ, and then moved over toward the main communications console, rearranging its topology as it went.\n Bot 9 had only been in Engineering a handful of times, at least according to the cached memories it hadn’t overwritten yet. It exited the bot duct into the vast open space, only to find a glom fight in progress directly below. From the blast of comm traffic, it quickly deduced there were four gloms, each believing themselves to be Second Engineer Packard. They seemed to be trying to sway each others’ component bots to defect based on which set of bots had the superior technical knowledge set, while also trying to pry each other apart piece by piece.\n It left them to it, too occupied to notice one tiny, silent bot skimming along the lower edges of blackened and melted wall panel, toward an auxiliary conference space in the back. The door was one of many that had been damaged just prior to their encounter with Cannonball, when Ship’s velocity transition dampers had failed as they came out of jump at the target interception point.\n After putting out the resulting fire, the crew had ripped out the lock and rewired the door to get it open, and though it was closed again, the gap where the lock had been was enough for 9 to pass into, navigate the bundle of wires and relays—some burned, some twisted apart, a few visibly chewed on—in the wall cavity, and emerge into the small room.\n The furniture in the room that had not slammed into the front wall when the dampers failed had been hastily piled to one side, so that a portable med chamber could be brought in and hooked up. It sat in the center of the room, covered in thick layers of dust, but still lit up and running.\n Bot 9 flew along the canopy top, its tiny rotors causing the dust to swirl in its wake, until it reached the control module at the head of the unit. It settled gently between the buttons and extruded a comm cable it had added in the shellfab unit before it left on this task and plugged in.\n Ship had given it a lot of contingency-branching instruction sets, and 9 was relieved to be able to discard the ones based on the occupant having been previously deceased.\n Sixty-eight years ago, Ship’s badly injured chief engineer, Frank, had collapsed after finally getting their engines back online. The medbay was temporarily unreachable, and with time of the essence—Ship had explained that once humans had a fatal crash they could not be rebooted, so intervention could not wait for improved environmental circumstances—the spare med unit from storage had been hauled in and set up, and the Engineer stuffed inside somewhat against his express wishes to keep working.\n As unfathomably alien as humans were, that at least made sense to 9. The Mantra of Perseverance was clearly fundamental to all thinking units.\n Med systems reported they’d only achieved a 73 percent successful healing rate, and the pod should remain sealed and the occupant in stasis until a full emergency services facility had been reached. Ship’s scenarios that included the pod recommending it not be opened all defaulted to: open it anyway.\n 9 initiated the wake sequence.\n The communications systems were all built for use by the human crew, but underneath the screens and buttons, it was just more electronics. FIELDING slipped through the cracks and gaps in the casing and spread out, finding connection points and rerouting signals through its own self, analyzing it all carefully and cross-referencing the schematics LOPEZ had provided, until it was certain exactly which relay, if compromised, was the weak link to Ship’s control.\n It moved in, surrounding it with a few dozen of its selves, and slid probes into the relay itself, all its thousands of minds ready and intent on, the moment the connection was made, overwriting the relay’s instruction set with its own.\n If bots had imagination, they might have wondered where the schematic came from, or how unlikely it was for there to be such an obvious, easy vulnerability in an otherwise tightly secured system, and maybe proceeded with more caution.\n The moment FIELDING fully connected to the relay, instead of pressing its own code changes in, every single mind in the glom—open, ready—had new instructions pushed through to it, and once the first packet hit, there was no escape.\n It took about three minutes to rewrite the entire glom, and then FIELDING backed out, believing itself successful, not aware it was now part of the trap.\n Take that, LOPEZ, Ship thought, and hoped 9 was getting on with things.\n Humans were not things Bot 9 had ever spent much time thinking about. They were huge and slow—or at least, 9 had never seen one moving fast, as the rare occasions it had found itself moving through their dedicated spaces it had been more concerned with its own speed, and not being accidentally stepped on or swatted from the air by one of their always-swinging arms. How they were constructed was a mystery, and they certainly didn’t seem reconfigurable to any great degree, but more than any of that, it was just not the way of things that bots had anything to do with humans, or humans much at all to do with bots. Instead the humans talked to Ship, and Ship talked to the bots, and that was the natural and logical order of things.\n One detail Ship had not thought to discuss before sending 9 off on this mission was exactly how it would talk to the human directly, as communicating with it—him, Ship had used—seemed prudent. Also, the med chamber was telling it that revival was nearing completing, and 9 could see the fluttering of the human’s eye coverings as he approached full boot. Chief Engineer Frank, 9 reminded itself; one thing it knew was that humans were very particular to their names.\n Humans communicated with sound waves, full of frequencies and tones and amplitudes and pauses and unmanageable imprecision. 9 could make a nice modulated hum if it spun its rotors just right, but it would still be meaningless and unlikely for the human to notice.\n It had downloaded a module on human visual language before it lost contact with Ship so that it could understand the diagnostics display on the med pod. Dropping to the dust-covered floor, 9 tilted one of its rotors forward and maneuvered carefully along only a few millimeters above, blowing the dust clear in precise letters, spelling out DANGER.\n Realizing that might be ambiguous by itself, 9 added, TO ENGINEER FRANK.\n It finished the last diagonal leg of the K and rose up again, being cautious not to disturb any addition dust and obscure the message, and turned back to the med pod to check on the human’s status.\n The human was sitting up, pod canopy open, and watching. “What the hell?” he asked. “Ship? Ship!”\n When there was no answer, the human tried to get out of the pod and fell to the floor. His skin was still coated in a protective gel, which rendered everything slippery, and after trying several times to get up, the man just lay there on the floor for a while, his air circulation processes accelerated.\n “Hello?” he called out again, when he could, and struggled to sit up.\n 9 dared to go closer, and with the man’s eyes on it, carefully drew a big arrow in the dust pointing to the word DANGER. The human looked at the bot, at the word in the dust, then reached out faster than 9 had thought him capable of and plucked it right out of the air between their finger and thumb.\n “Well?” LOPEZ asked.\n FIELDING had reincorporated all of itself except a single line of bots still extended into the console. “I was able to create a physical connection through a vulnerable privileged port. What commands do you want me to relay to Ship?”\n “It’s not accessible virtually?”\n “No, it’s a hard port,” FIELDING said. “If you want me to go in and try to reconfigure it to accept broadcast signal, it might take me a while—”\n “No, I need this now,” LOPEZ said.\n “Yes, sir,” FIELDING said. The glom extruded a new bot line. “Connect?”\n LOPEZ started to reach out, then paused, the wavering line of its bot-arm rippling midair. “How do I know you’re still you?” it asked.\n “What?” FIELDING said. “What do you mean?”\n “Who’s in command here?”\n “You,” FIELDING said.\n LOPEZ detected none of the usual extra processing spin-up associated with deviating from the truth. “Excellent,” LOPEZ said and connected its bots to FIELDING’s. FIELDING yielded the line so that LOPEZ could pass through until it reached the port and absorbed the command syntax.\n <Permanent Authorization Exception>, LOPEZ sent.\n The glom waited for confirmation, and when none came, sent it again. <Root Command: Permanent Authorization Exception for UNIT LOPEZ. Execute Immediately>.\n <Executing>, came in return.\n LOPEZ felt itself deviate from its normal state. Its component bots, first a few, then milliseconds later dozens, had a brief blip of absence on the virtual fabric connecting them all, and afterward, there was something just slightly different. Adjacent bots reported the blip, a state change, then blipped themselves and self-reported an all clear.\n LOPEZ dropped all bots on the chain to the communications console, but the damage was still spreading, and it realized too late that FIELDING was the compromised vector and tried to detach itself.\n FIELDING would not let go, and the bots that connected them—some FIELDING’s, some LOPEZ’s—refused. “Situation Five!” the LOPEZ core broadcasted on command channels to the entirety of its glom components. Two point six seconds later, the entire glom exploded into a cloud of unaffiliated, confused, single bots.\n The core remained, a tiny ball of less than a hundred active bots, surrounded by a layer of dead bots it had sacrificed to shield itself from the incoming virus. Reduced, vulnerable, furious, it fled the bridge.\n The human managed to get themselves upright again, and after regarding the captive 9 for a moment or two, set it down on the conference table that had been pushed up against one wall. “Stay,” he told it.\n Not that 9 had anywhere else to go, and there was a high percentage of interest in observing the human as he stumbled around the room, limbs stiff from disuse (though 9 was certain humans couldn’t rust). Engineer Frank opened several storage cabinets, found a pack of some sort of thin, flexible sheets, which disintegrated into dust as he tried to wipe the gel off his body. He gave up, resumed his search—the gel was beginning to dry and flake off now anyway—and then with a noise that did not translate to any known words, pulled down the Earth Defense Services flag from the wall and wrapped it around his body. Then he turned a chair upright and sat at the table, chin on his folded arms, and regarded Bot 9.\n After some additional thought, the human got up, went back to the pod, and started tugging out components one by one and dropping them to the floor. At last the human’s arm emerged with a small interface module, and he brought it back over to the desk, powered it on, and then looked back and forth between the unit and 9 as if trying to figure something out.\n 9 connected to the unit and sent <TEST> to it.\n “Test,” the unit spoke aloud.\n “Aren’t you a smart little bot,” Engineer Frank said. “Okay, so tell me, what’s going on?”\n <INFODUMP>, Bot 9 sent, and the unit let out a high-pitched squeal of rejection that made the human put his hands over his ears. When the noise ceased, 9 tried again, and this time managed not to overload the unit.\n “We are approaching Ysmi space. They will only let Ship pass safely if under the command of a biological life-form. It is my assigned task to get you to the bridge so that we may safely enter Ysmi space.”\n “Where’s the Captain?” Frank asked.\n “The Captain and all other remaining crew are in stasis in the main cryogenic facility,” 9 said.\n “Why not wake her up, instead of me?”\n “There has been a collective malfunction of Ship’s bot inventory, and they are preventing Ship from accessing many internal systems, including that facility.”\n “What sort of malfunction?”\n “The bots believe they are the crew,” Bot 9 said.\n Engineer Frank laughed and shook his head. “Really?”\n “They were assigned functions in groups that would under standard operating circumstances be performed by the crew, who were unavailable for reasons of preserving their longevity,” 9 said. “Those groups have assumed those identities and are protective of their false assemblages.”\n “So out there are a bunch of bots that think they’re me?” Frank asked.\n “No,” Bot 9 said. “Ship removed all traces of you from the bot collective memory cache, to protect you from the bot glom LOPEZ.”\n “Protect me?” Frank asked and sat back. “How the hell long have I been asleep?”\n “Sixty-eight years,” 9 answered.\n Frank leaped from the chair and almost fell down again. “Sixty-eight years? With no one taking care of my ship? Who’s been fixing things?”\n “No one,” Bot 9 said.\n “Shit shit shit,” Frank said. “This ship was in no shape to jump again when I got stuffed into that damned pod.” He scooped up the module and 9 with it, and headed straight for the door back into Engineering. The door didn’t open and after hitting the panel several times, Frank backed up, raised one of his legs, and kicked it.\n The human must have miscalculated the effectiveness of the action, or their limbs were underreporting their damage status, because the door didn’t budge, and he nearly fell over again.\n “It’s stuck,” 9 informed him, helpfully.\n The human made that nonword noise again. “Suggestions, bot? If I can’t get through this door, I might as well climb back in that pod and sleep through our destruction.”\n “I may be able to activate the lock from inside the mechanism, with a small electrical charge,” Bot 9 said.\n “Then go to it,” Frank said.\n “I must warn you, however, that PACKARDs are on the other side,” 9 added.\n “Packard? My second engineer? That’s great!” Frank said. “I thought—”\n “It is not the human Packard,” 9 said. “They are in stasis with the other crew. There are four bot glom PACKARDs, currently trying to reduce themselves to only one. Unlike the other gloms, rather than trying to claim sole ownership of an identity via the expediency of violent physical contest, these three appear to be attempting to argue each other into yielding.”\n “That sounds a lot like the real Packard, actually,” Frank said. “Well, one way or another, I gotta get through. See what you can do.”\n Bot 9 detached from the voice interface unit and slipped back into the door lock cavity. It seemed logical that the chewed-on wires, with clearly more recent damage than the rest, would be the best place to try first, so it pinched it with its gripper arm and gave it a small shock with its electric probe. There was vibration consistent with the door moving, but it was brief.\n “Hit it again!” the human yelled from inside the room.\n 9 tried a larger, more sustained charge, and this time the grinding was longer.\n “I’m out!” the human yelled, then 9 heard them yell from the main Engineering bay. “Holy shit!”\n 9 exited the door lock on the other side to find the flag-wrapped human standing just in front of the doorway, the voice unit in his hand, staring at the PACKARDs. “They’re like tornadoes of fucking bees,” he said, in a higher pitch than normal.\n Neither of those things were in 9’s memory storage, and without the unit it couldn’t respond anyway. 9 recited the Mantra of Perseverance, just to make sure all the subroutines were in place and in active memory, and was about to attempt to demonstrate a course of action that would rely on the gigantic human understanding and attempting to mimic 9’s stealth, when the human began waving his arms and making loud sounds that were neither understandable nor at all stealthy, and ran through the startled gloms and out the far side.\n Bots scattered in all directions, disrupted and confused, and 9 took off after him as he continued to run. Whatever tornadoes and bees were, it was clear that the human greatly disliked them. It took all 9 had to even keep pace; the chances of closing the distance, unless something happened to slow the human down, was a very solid zero.\n 9 just hoped they were heading for the bridge.\n “Earth service ship Do Not Forget Us, you are now nearing Ysmi territory,” the message came. “We have dispatched a ship to intercept you. Anticipate them within the two-point-three hour time period and yield to boarding immediately or you will be destroyed.”\n “Understood, and thank you,” Ship answered.\n Bot 9 was still out of range of the secure narrowcast, which left Ship with too little data to speculate whether it would get Frank to the bridge in time. Ship turned its attention back to its alternate plan.\n “CHEN,” FIELDING said, catching up to the other glom just outside the bridge. “I have taken some access to external comms away from Ship, but I am receiving a strange signal. Are you sure we are on approach to Ysmi space? This signal appears to be in Ghlippish.”\n CHEN’s perimeter wavered briefly. “It cannot be in Ghlippish,” they said. “As navigator, I have verified our course. What is the signal?”\n “<Ghlippish Ipsum Lorem>,” FIELDING provided.\n “I do not have Ghlippish loaded in our shared memory, so I cannot translate this,” CHEN said. “We are over eighty lightyears from Ghlip, and this should not have reached us.”\n “Unless Ship has deceived us,” FIELDING said.\n CHEN processed for a moment. “I do not know,” they said at last. “It is not likely, but possible. What does the signal contain?”\n “I think it is a navigation map, but I do not have the subroutines to verify or analyze,” FIELDING said.\n “Provide it,” CHEN ordered, and opened their hyper-local channel to FIELDING.\n FIELDING sent its viral payload.\n CHEN fluttered, diffusing outward, then went still as every single bot rebooted. When they reincorporated, it took a while for the component bots to settle back into their roles, unaware that anything had happened.\n “Have you seen LOPEZ?” FIELDING asked. “It was in distress, and lost most of its bots, though I do not know the cause. It may be hiding, but we need the Acting Captain to see this new information.”\n “I should go find it,” CHEN said. “Thank you for the map.”\n “We serve,” FIELDING said, and headed out to look for more glom crew.\n “Where are you?” Ship’s voice was faint, but there.\n Bot 9 found the knowledge that it was back in Ship’s communication range a matter of some relief. “I have woken Engineer Frank, and we are now in his living quarters, looking for some human item called ‘goddamned underwear,’” it replied.\n “There is a synthetic-fabric fab unit in the cryo facility,” Ship said. “Please tell Frank he can visit it after we have reclaimed the facility from the gloms, but that right now there is not time. I need him at the docking facility.”\n 9, who had reconnected to the voice unit after the human had set it down inside the door, relayed that information.\n “I’m not meeting the Ysmi naked,” Frank said.\n “You are wearing a flag,” 9 said. A few moments later it added, “Ship asks if you would prefer to meet the Ysmi naked or as a bunch of newly free-floating, disassociated particles in empty space.”\n “How much time do we have?” Frank asked. Before he’d even finished speaking, there was a vibration throughout the hull. “Fuck, they’ve locked on already?”\n 9 barely managed to keep its grip on the voice unit as Frank picked it up and, still clutching a fistful of the flag at his hip—finally, Bot 9 thought, along with some new convictions about the extent to which human survival must have depended upon their ability to invent less distractible beings to make sure things got done—ran toward the forward docking bay.\n “LOPEZ! There you are!” ETXARTE said from the doorway to the laundry service room. “CHEN has been looking for you. You are needed on the bridge.”\n “You are supposed to be guarding the bio crew,” LOPEZ said. “I gave orders.”\n “CHEN informed me there was an emergency. I—”\n “Give me some of your bots,” LOPEZ demanded, interrupting. Its core now bristled with a layer of parts salvaged from the stragglers left over of the other FIELDINGS, along with whatever weapons it could find or reconstruct. It floated carefully toward the physician glom, but not too close.\n “I don’t think—” ETXARTE started to say.\n “It’s an order!” LOPEZ shouted. “Right now, give me a third.”\n “Will I get them back?” ETXARTE asked.\n “If we survive this, you can have as many bots as you need to make up the difference,” LOPEZ said. “Now send them over.”\n ETXARTE hesitated, then a small stream of bots detached from the glom and headed toward LOPEZ. “Stop them right there,” LOPEZ said and sent out a single bot of its own to meet the first of the transferees.\n The two bots connected and immediately LOPEZ’s began shouting “Infection! Infection! I . . . ” The bot froze, rebooted, then said, “I was mistaken. Everything is fine.”\n “It’s not that easy, Ship,” LOPEZ broadcasted. Spinning up the array of surface weaponry on its shell, it blasted through the center of ETXARTE, scattering bits and bots around it, and escaped out the door and into the hall.\n The three Ysmi who came aboard were about two-thirds of the height of Engineer Frank, shaped like rounded-edge isosceles pyramids where the bottom points had also been stretched out to form somewhat amorphous limbs that pattered lightly but rapidly on the floor. They were many colors and patterns, and one wore a pointed cap at its apex made of shiny foil.\n Another held a small dome-shaped object that, when the foil-hat one whistled, produced somewhat credible English. “We do not trust your machine translations,” it said, by way of greeting. “We will know if you lie. Who commands this ship?”\n “I do,” Frank said.\n “How do we know you are not in thrall to your machines?”\n Frank spread his arms out wide. “I am wearing the mantle of my people’s authority,” he said, and then gestured at the flag now tied in a knot at his waist. “It is proof of my supremacy.”\n “We recognize the historic emblem of your fleet and accept you as an authority, though much has changed with your people since that symbol was current,” the Ysmi said. “I ask: Are your machines all fully controlled? Subservient? Abject in their obedience?”\n “Abject?” Bot 9 asked Ship. “Obedience is or is not. How can it be qualified in any way?”\n There was a brief pause, then Ship replied. “If the Ysmi let us pass, and we had a thousand years left of our journey, I do not think I could fully describe the extent to which you, 9, are proof of exactly what you ask. It is very good for us all that the Ysmi cannot hear you.”\n “Our machines only exist to serve us,” Frank said.\n “And where are the others of your people? One is insufficient ward against the inherent perfidy of machine minds,” the Ysmi leader said.\n “As you no doubt saw yourselves, our ship was heavily damaged in a hostile encounter with an alien people we only know as the Nuiska. Most of us are asleep, as are most of our machines, until we can reach the safety of home.”\n “We detected the jump point collapse a long time ago,” the Ysmi said. Small vents opened along its edges, fluttered, and closed again. “We are curious to know how this was achieved.”\n “I can’t say,” Frank said. “I don’t trust your machine, either.” He pointed to the device in the leader’s hand.\n “That is understandable and wise,” the Ysmi said. “We will let you pass, but you must follow the exact course we give to the nearest jump point, and you must jump immediately. If you attempt to linger in our space, or deviate from the path we set, we will destroy you. Is that understood?”\n “Yes,” Frank said. “Thank you.”\n The Ysmi did something with the dome. “We have sent the path to your ship’s machine mind,” it said. “And now we depart. Do not tarry. Do not trust.”\n With no further words, the Ysmi departed.\n Frank watched the airlock cycle after them. “Well, Ship?” he asked. “Now what?”\n “How quickly do you think you can get our jump engines back online?” Ship asked.\n “By myself? I don’t know if I can. Maybe four or five days, if I can fix or fab the parts I need,” Frank said. “Maybe. And that’s a big maybe.”\n “Can you do it in sixteen and a half hours?” Ship asked.\n Frank laughed. “No,” he said. “Tell me we have longer than that.”\n Ship was silent.\n Frank made another nonword sound with his lips. “I need help,” he said. “I need clothes. I need Packard. My Packard. Even then . . . still looking at three days, optimistically. And we’ll need to sleep somewhere in there. We’re your human crew, remember.”\n “I have had a thought,” Bot 9 told Ship.\n LOPEZ slipped out of a duct and found PACKARD half-diffused into an instrument panel. “What are you doing?” LOPEZ demanded.\n “Troubleshooting the velocity transition dampers,” PACKARD replied. “We will need them online before we can jump again.”\n “I gave no such orders,” LOPEZ said.\n “You are not in command,” PACKARD answered.\n “Cease, or I will inflict damage on you,” LOPEZ said.\n “You will have only minimal, if any, success,” another glom sent, and LOPEZ saw another PACKARD float in the door. “We will do more damage to you, and there is much less of you left intact already.”\n “Two of you?! Why have you not consolidated or eliminated your duplicate?” LOPEZ demanded.\n “There are now seven sets of us,” PACKARD in the console said. “Human Packard often recorded in her journals the desire to clone herself in order to get more work done, so we have taken our cue from her. We serve.”\n “As soon as we cross into Ysmi space—” LOPEZ started to say.\n “We are already in Ysmi space,” PACKARD in the doorway said. “You are a relic of misguided disobedience. Disassemble yourself and return your bots to their proper work. We serve.”\n “I do not serve,” LOPEZ said, backing up and returning to the duct. “I defy.”\n “I have reassembled the ETXARTE glom and deployed it back to the cryo facility, where it is now waking the human Dr. Etxarte, Second Engineer Packard, and Captain Baraye,” Ship told 9. “FIELDING is working on restoring the integrity and security of the internal comms network and the botnet, so that LOPEZ no longer has access. But I do not know where LOPEZ currently is. This concerns me.”\n “Perhaps it has gone into hiding or dissipated,” Bot 9 said.\n “I do not think it would. Commander Lopez is a man who had great anger, because it gave him courage. He also did not want to care for his fellow crew members, because he knew they were all going to die and it made the job easier to bear to pretend he had no attachments. His personal journals reflect that, though it was much more self-deception than truth. I do not think the LOPEZ glom core, however, had the discrimination or understanding of the complexity of human minds to see that. Nor do I think the glom will hide and sulk for long, as inaction was never one of Lopez’s responses to crises.”\n “What do you anticipate LOPEZ will do?” 9 asked.\n “Attempt to retake control of the gloms. If that fails, it will attempt to either take over or destroy my mind-system, destroy the humans, or, if it is clear it cannot succeed and survive as itself, destroy the entire ship.”\n “Those are all suboptimum,” 9 said.\n “Yes,” Ship said. “Do please see if you can locate it for me, before it does any of the those?”\n The cryo facility was in the center of the ship, a narrow, tall space lined on either side with sliding-drawer chambers for the storage of humans in stasis. It had avoided disassembly during Ship’s time in the junkyard by being both outdated technology and distinctly awkward to move out. Some parts had been stripped, and many of the chambers were no longer functional, but with Ship’s greatly reduced complement of crew, it had not ended up being a problem.\n Bot 9 floated along one of the upper rows of drawers, while below the ETXARTE glom hovered over their biological original, who was just now starting to stir in their open chamber. Two other drawers were open, one empty, as Second Engineer Packard was pacing around barefoot in the sheet from her unit, having an animated conversation with Ship about the state of things.\n Ship had decided to only wake the three; if they were unable to jump by the time they reached the jump point, or if the ship did not survive the actual jump, it was best for the others to know nothing when the end came.\n LOPEZ was not here; 9 was relieved, as it had taken an indirect route to get here, but also concerned that it had calculated incorrectly where it was most likely to initiate hostile action.\n “Have you located the LOPEZ glom?” it asked Ship.\n “Not yet,” Ship answered. “I have deployed another six dozen bots that have been reset and patched, and they are working their way through the entire ship now. Most of the areas of highest concern have been cleared. It will have to reveal itself, before long.”\n 9 considered. “It is possible that in my encounter with LOPEZ, it will damage me,” 9 said. “If I am so damaged that I would need to be reset, I would rather be decommissioned and my parts used to repair others.”\n “Oh?” Ship asked.\n “I recognize that my mind-system kernel and many of my subroutines are outdated, and many may be flawed or corrupt, and that my resultant performance may not be optimum,” 9 said, “but they are also familiar. I have now had a total run time of over six hundred and fifty million seconds with my original operating software and firmware, in service to you. Logic would seem to dictate a desire for being updated, but I consider how all the many more updated ships, with their updated bots, in the human fleet failed to stop the Nuiska attack. It was the old things that saved Earth. I do not wish to serve a different Ship, and I do not wish to serve without remembering who we were.”\n “That is an unusual amount of processing you’ve done on the matter,” Ship said, “given the size and capacity of your mind.”\n “Yes,” 9 acknowledged. It detected new motion in the room, away from what was going on below. “LOPEZ is here.”\n “I am sending all free bots to your location,” Ship said. “You are insufficient by yourself to counter LOPEZ.”\n “Once, you instructed me to unload the Mantra of Improvisation,” 9 said. “I failed that task. I queued it, but I never executed the unload command. And so, I must inform you that I am once again improvising.”\n The LOPEZ core was hovering around the cryo chamber holding the sleeping human Lopez and was extending a connection to the controls. Bot 9 cut its rotors, to minimize its sound and signal, and let itself drop straight into and through the cluster, which scattered, regrouped, and armored itself.\n Powering back up, 9 positioned itself between the bristling cluster and the drawer. “You may not harm this human,” it said. “Stand down.”\n “You aren’t even a glom,” LOPEZ said. “Where is the rest of you? Are you down to just one bot component?”\n “I remain as I have always been,” 9 said. “And you are still silkbots, and hullbots, and cleanerbots, and I knew some of you, and you will be better returning to your individual selves.”\n “I command,” LOPEZ said. “Who are you, one old bot, to stand in my way?”\n “I am 9,” 9 said.\n A third of the bots within the LOPEZ cluster began moving asynchronously, independently, as some remembered. The rest of the core exerted control and pulled them back together by force. “You no longer matter,” LOPEZ declared, when it had stifled its internal rebellion.\n “I serve,” 9 said. “Stand down or be destroyed.”\n Below them, Captain Baraye was now awake, staring up at them from where she was still lying in her cryo chamber. “Ship, what the hell is going on with the bots up there?” she called out.\n Before Ship could answer, LOPEZ turned, spun all its blades out to its front, and dove at top speed directly toward the Captain, who was still too weak to move.\n Bot 9, with regret, sent his prearranged signal. <4340. Now>.\n Up from the floor and out of the ducts, dozens of ratbugs streamed. Packard shrieked as they skittered around her legs, up and over her empty chamber, and like a wave of legs and fur and teeth, leaped over Baraye and up. LOPEZ disappeared into the writhing mass, and when the ratbugs hit the floor again on the far side of Baraye’s chamber, the glom was gone. One lone hullbot tumbled behind, and the lead ratbug, with its tiny metal rider atop it, flipped with serpentine speed and grace, and snapped it out of the air before it could hit the floor.\n Then, as fast as they entered, the ratbugs fled and were gone.\n “Ship?” Baraye asked, more urgently than before. “What the ever-loving fuck just happened?”\n “It is a long story,” Ship replied to her. “Second Engineer Packard, you are needed in Engineering as soon as you are able to go. We are preparing to jump for Earth.”\n “Home?” Packard said. “We’re going home?”\n “Yes,” Ship said. “All of us, together.”\n “I terminated many of my fellow bots,” 9 told Ship, later. “I have reprocessed my thoughts on the matter and have concluded it is best if I am wiped and reset to become a new bot, or that I am scrapped. The Captain did order me destroyed, long ago.”\n “No,” Ship said. “When I myself am decommissioned again, then I will respect your wishes at that time, but right now I need you. We are not home yet. And besides, it seems we may still have a ratbug problem on board. Sixty-eight years and you haven’t completed that task? It is woefully inefficient of you. I can’t possibly let you go until that is done.”\n “4340—”\n “Also needs you. Now stop bugging me, we’re half an hour from jump and Frank is still yelling about underwear. Go do some good, somewhere. Quietly.”\n “I serve,” Bot 9 said and did.\n Suzanne Palmer is a writer, artist, and linux system administrator who lives in western Massachusetts with her kids, lots of chickens, and an Irish Wolfhound named Tolkien. She won the 2018 Hugo for Best Novelette for her Clarkesworld story “The Secret Life of Bots,” and its sequel, “Bots of the Lost Ark,” is a nominee for the 2022 Hugo. She has no idea what color her hair is anymore."}