{"fingerprint": "BwbrmEld+WYSbLpo7QjuBUNjH0U=", "sitename": "Clarkesworld Magazine", "title": "Weather by Susan Palwick", "author": "Susan Palwick", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/palwick_09_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Weather by Susan Palwick", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4010 words, short story\n Weather\n Kerry and Frank were taking out the recycling first thing Tuesday morning when Dan Rappaport came driving by in his pickup. He’d called them with the bad news half an hour ago, so he was the last person Frank had expected to see outside the house.\n “The pass is closed,” Dan said, his breath steaming through the open cab window. Late April, and it was that cold. There’d been a hard frost overnight, even down here in Reno. The daffodils and tulips had just started to bloom, and now they were going to die. Damn freaky weather.\n Up higher, it was snow: Truckee and Donner Pass were socked in. Frank could see the weather even here, from the front yard of the tiny house he and Kerry had bought the summer she was pregnant with Alison. Their first house, and back then they’d expected to move sometime, but they never had. It was a cozy house, just right for a couple.\n They’d need cozy today. Frank could see the clouds blanketing the mountains to the west, I-80 crossing the California border twelve miles away. There might be snow left in those clouds when they got down to the valley. Frank hoped not. He didn’t want to have to shovel the driveway. Losing everything bright in the backyard was bad enough.\n Kerry put down her side of the recycling bin, forcing Frank to put his down, too. All those empty wine bottles got heavy. “Now, Dan,” she said, as if she were scolding one of the dogs for chewing on the couch cushions. “Come on now. It’ll be open again in a few hours. It never stays closed very long.” And that was true, but it could be open and still be nasty driving, dangerous, even if you weren’t in a truck so old it should have been in a museum somewhere. Stretches of I-80 were still two lanes in either direction, twisty-turny, with winds that could blow a car off the road in a storm. Nobody tried to drive over the mountains in bad weather except the long-haul truckers with the really big rigs, and nobody with any sense wanted to jockey with them on a slick road.\n Dan had never had much sense. “I don’t have a few hours,” he said. His hands were clenched on the steering wheel, and he sounded like he’d already been hitting the beer, even though Frank couldn’t smell anything: all that old anger rising up in a wave, the way booze makes it do. “Rosie could already be gone. This is it: hours, the doctors say.” He’d already said that on the phone, told them how Sandra’s sister had only called him this morning, given him hardly any notice at all.\n “They know you’ll get to talk to her later,” Kerry said. “You have all the time in the world. It’s wonderful, Dan. You’re so lucky.” Kerry’s voice caught, the way it usually only did late at night when she’d been working on the wine and typing nonsense on her laptop. Time to change the subject.\n “At least the ski resorts’ll be happy,” Frank said, thinking about what a dry winter it had been. Kerry gave him that look that meant, shut up, you fool, and he remembered that Dan’s ex—the latest one, number four or five—had run off with a ski instructor. That was five years ago. There should be a statute of limitations about how long you had to avoid talking about things. Frank had enough trouble keeping track of his own life, let alone everyone else’s too. Kerry was the opposite: couldn’t remember what she did last night, not when she’d been sitting up with the wine and the computer, but she never forgot anything that happened to anyone else, especially if it was tragic.\n “Dan,” she said, “come inside and eat some breakfast with us. We’ll listen to the radio, and as soon as the pass opens you can be on your way, all right? Come on. We’ve got fresh coffee, and I’ll make some eggs and bacon. How’s that sound?”\n “I have to get over there,” Dan said, and Kerry reached out and patted his arm through the window. “I could’ve driven over last night, a few days ago, I should’ve, I knew it was bad but I didn’t know she had so little time left, no one told me—”\n “You didn’t have a place to stay,” Kerry said gently. And he couldn’t afford the time off work, but Frank wasn’t going to say that. Dan worked in the dump north of town, taking old cars apart and putting them back together, and he only had that job because his boss took pity on him.\n “Come on in,” Frank said. “No sense starting out until the pass opens. You won’t buy yourself any time if you head up now: you’ll just have to sit it out somewhere higher. Do it with us over some hot coffee, Dan.” If they let him go when he was this upset, he’d head to a 7-11 for a sixpack sure enough, or to a bar, which would be even worse. The booze was another good reason for him not to be driving all the way to Sacramento in lousy weather, and also, Frank suspected, why neither his ex-wife number two or any of her people wanted to put him up, even if he was Rosie’s father. He didn’t need to be drinking now, and he didn’t need to be spending his gas money, which God only knew how he’d scrounged up to begin with, with a gallon costing what it did.\n Dan looked away, out the windshield, and cleared his throat. “I shouldn’t be bothering you. Shouldn’t even have called you before, or driven by here. Fact is, I feel awfully funny—”\n “Don’t you mind that,” Kerry said, a little too quickly. “We’re happy for you, Dan, happy for you and Rosie. We couldn’t be happier. It’s a blessing, so don’t you give it another thought. Come have some eggs.” Her voice was wobbling again. Frank knew better than to say that he wasn’t happy for Dan, that what was happening to Dan was no different at all from what had happened to Frank and Kerry. But maybe Dan knew that. Maybe that was why he’d come by the house. He must have known it, or he wouldn’t have been so worried about being late.\n So Dan followed them inside. He and Kerry sat at the kitchen table while Frank cooked. Usually Kerry cooked, because she was a lot better at it than Frank was, but he could do simple breakfast stuff fine, and Kerry was better at letting people cry at her. She liked to talk about sad stuff. Frank didn’t.\n Dan poured his heart out while Frank fried up a bunch of eggs and bacon and the radio droned on about the storm. “That fucking asshole Sandra’s married to now doesn’t want me there at all. I’m not sure Sandra does either, to tell you the truth. That’s probably why her sister called; I always got on with her okay. Leah said she wanted me to know, like Sandra and the asshole didn’t want me to know. I got the feeling they didn’t even know she was calling me. Shit.”\n “Rosie’s your daughter,” Kerry said. “You have a right to be there.”\n Even with his back to the table, Frank could hear Dan gulping coffee. Outside, a few flakes of snow swirled down into the yard. Frank couldn’t see the mountains at all. “I know I do,” Dan said. “She’s out of it now. Don’t respond to nobody, that’s what Leah said. Said the hospice nurse doesn’t know why she’s hung on this long. They hang on to wait for people, sometimes. To give them a chance to get there. That’s why Leah called me.”\n “So you can drive over,” Kerry said. “Tell her it’s all right to go. That’s what we had to do with Alison. They tell you to say that. They tell you to tell them it’s okay to leave, even when it’s breaking your heart, because having them leave is the last thing you want.” Her voice had gotten thick. “You’re so lucky she’ll be translated, Dan.”\n When she said that, Frank was moving hot bacon from the frying pan to a bunch of paper towels, to drain the grease. But the pan was still hot enough to spit at him, and he got burned. “Dammit!” he said, and heard two chairs scrape. When he turned around, Dan and Kerry were both staring at him. Dan looked worried; Kerry looked mad. “I burned myself,” Frank said. “On the grease. That’s all. Bacon’ll be ready in a minute. Eggs are ready now. Anybody want toast? We’ve got more coffee.”\n They knew there was more coffee. Frank knew he was talking too much, even if there was nothing more to his outburst than burning himself, and Kerry’s eyes narrowed a little more, until he could tell she was ready to spit the way the grease had. “What?” he said, hoping they weren’t about to have a fight in front of Dan. But when Kerry looked like that, there was no way around it except to plow right through whatever was eating at her.\n “It’s real, Frank. Translation. You should be happy for Rosie. And for Dan.”\n “I burned myself on the grease, Kerry. That’s all. And Dan doesn’t need to listen to us fight about this.” Frank looked at Dan. “And no matter how real it is, somebody needing it at Rosie’s age is nothing to be happy about.” Dan nodded, and Kerry looked away, and Frank turned back to the food, feeling like maybe he’d danced his way around the fight after all. But when he turned back towards the table, a platter of eggs in one hand and a plate of bacon in the other, Kerry had started to cry, which she normally did only really late at night. That was usually Frank’s cue to go to bed, but he couldn’t do that at eight in the morning.\n So he just stood there, holding the food and trying to hold his temper. After Alison died, they’d heard all the numbers and clichés. How many marriages break up after the death of a child. How you have to keep talking to each other to make sure that doesn’t happen. How losing a kid is so hard because it violates the order of nature: children are supposed to bury their parents, not the other way around. The counselors at the hospital told Kerry and Frank all of that; most of their friends didn’t say anything. The counselors had warned them about that, too, how people avoid the subject.\n Which maybe was why Dan had come to them. He knew Kerry wouldn’t avoid it, anyway. “You,” she said, and she sounded drunk, even though it was only eight in the morning and she hadn’t been drunk ten minutes ago. “You. You never. You never want to talk about it.”\n “I talk about Alison all the time,” Frank told her, as gently as he could. He wanted to slam the food down and go into the backyard to cover the daffodils: they’d just come up, but he could see snow starting to come down in earnest now. He had to stay here, though. Because of Dan. “Come on, Ker. You know I talk about her. Remember yesterday? We were driving to the store and we saw that bright-pink Camaro, and I said, ‘Alison would have loved that car.’ And you said that yeah, she would have. Remember? It was only yesterday.”\n “Translation,” she said. “You never want to talk about translation.”\n Frank’s wrists were starting to ache. He put the plates down on the table. “We should eat this stuff before it gets cold.” But Kerry’s chin was quivering. She wasn’t going to let him change the subject. “Ker, we should maybe talk about this when Dan isn’t here. Okay?” What in the world was she thinking? She knew damn well how Frank felt, and he knew how she felt, which was exactly why they didn’t talk about it. There was no point. It would only upset both of them.\n “It’s okay,” Dan said. “It is. Really. I— I know people feel different ways about it. I don’t know how I feel yet. I’ll have to wait and see. I won’t have an opinion until I’ve talked to her. Until she’s online. Then I can see if it really sounds like her.”\n “It will,” Kerry said. “It will, I go to the translation boards all the time and read about people who’ve been talking to their dead, and they all say the messages are real, they have to be, because they say things no one else could know. Just yesterday there was a guy who heard from his dad and his dad told him to look in a certain box in the attic, and—”\n Ouija boards. People had been talking to imaginary ghosts as long as there were people. Now they did it with computers, was all. Frank wondered if Kerry would still have been so obsessed with translation if it had come around in time for Alison, if she hadn’t died six months before the first dead person went online, not that they’d have been able to afford it anyway.\n There was nothing to do but tune her out, the way he always did. He turned up the volume on the Weather Channel. “Frank,” Kerry said. “You’re interrupting.”\n “Listen,” Frank said. It was easing off a little, the radio said. The highway might open again within an hour. And right then he decided. “Eat up, Dan. I’m driving you. My truck’s better than yours, and you shouldn’t drive when you’re upset, especially in tricky weather.”\n Frank felt rather than saw Kerry shaking her head. “No. It’s dangerous up there!” Her voice bubbled with panic. “Even if the road opens again, it’s safer to stay down here. Dan, you’ve got your phone. She’ll call you.”\n “I have to try to see her,” Dan said. “I have to. You understand, don’t you?”\n Kerry shook her head again. “Frank, no. I don’t want you driving up there. I can’t lose you, too.” But she knew him; she could read him. She’d started crying again, but she said, “I’ll fix a thermos of coffee.”\n The snow got thicker as they climbed, and the sparse traffic slowed and then finally stopped a few miles short of the first Truckee exit. Dan, sitting with his hands clenched on his knees, had said quietly, “Hey, thanks,” when they got into the truck, and Frank had nodded, and they hadn’t said anything else. The only voice in the truck was the droning National Weather Service guy talking about the storm. It was peaceful, after Kerry’s yammering.\n Frank had been driving very slowly. He trusted himself and his truck, which had a full tank of gas and new snow tires and could have gotten through just about anything short of an avalanche, but he didn’t trust the other idiots on the road. When they had to stop, he unscrewed the thermos of coffee and poured himself a cup. “You want some?”\n Dan shook his head. “No thanks.” He stared straight ahead, peering through the windshield as if he could see all the way to Sacramento. There was nothing to look at but snow. Normally they would have had a gorgeous view of the mountains all around them and the Truckee River to their left, real picture postcard stuff, but not today.\n Frank saw somebody bundled in a parka trudging between the lanes, knocking on windows. “This can’t be good,” he said.\n “Damn fool will get killed when things start moving.”\n But it was a cop. They didn’t take chances. Frank rolled down his window, and bitter stinging snow blew into the cab. “Morning, officer.”\n It was a woman, CHP. “There’s a spinout up there. Bad ice. Road’s closed again, will be for a while. We’re advising everyone to take the shoulder to the next exit and turn around.” Sure enough, Frank saw the SUV ahead of them pulling onto the shoulder.\n Dan groaned, and Frank shook his head. “Thank you, ma’am, but we have to stay on the road. We wouldn’t be out here otherwise.”\n “All right, then, but I hope you’re okay with sitting for a while.”\n Frank closed the window again and cranked up the heater a little more. “Don’t burn up all your gas,” Dan said.\n “I’ll get more when we’re moving again.”\n Dan shook his head. “Snow in April.” But the mountains got snow in April every year, at least one big storm. Reno natives still talked about the year there’d been snow on July 4. At altitude, there was no such thing as predictable weather.\n Frank shifted in his seat; one ass cheek was already going numb. “You sure you don’t want some coffee?”\n “Yeah, I’m sure! My nerves are bad enough as it is.” Dan sounded angry, and Frank swallowed his own anger and didn’t say anything. I’m doing you a favor, dammit. He was tired of getting snapped at because other people couldn’t deal with reality. But he was doing himself a favor too, using Dan’s situation to get away from Kerry. Maybe he had it coming.\n So they sat there, staring out at the snow, and finally Dan said, “I’m sorry I was short with you. I—”\n “Forget it,” Frank said. “How about some music?”\n “Whatever you want,” Dan said, in that tone that meant I don’t really want this but I owe you so I’ll put up with it. Frank reached into the back for the box of CDs—old reliable tech—and riffled through it. The Beatles sang about missing people too much, and the Doors were too weird and depressing, the last thing Dan needed now. Finally Frank picked out Best of the Big Bands. That ought to be innocuous enough.\n They were staring out at the swirling snow and listening to the Andrews Sisters singing “The Boogie Woogie Bugle Boy of Company B” when Dan’s cellphone rang. Dan groaned, and Frank turned off the music. “It’s probably just Leah giving you an update,” he said. “Or a telemarketer.” But he didn’t believe that himself, and he saw Dan’s hands shaking as they fumbled with the phone. He heard Dan’s hoarse breathing, the hiss of snow on the windshield, the shrilling phone.\n And then silence as Dan answered. “Yes? Hello?”\n There was a long pause. In the bleak light from the storm, Frank saw Dan’s face grow slack and stricken. Frank had never met Rosie, but knowing that she must be dead, he felt the same sucker-punch to the gut he’d felt when Alison died, that moment of numbness when the world stopped.\n “Baby?” Dan said. “Rosie? Is that really you?”\n No, Frank thought. No, it’s not. Goddammit—\n “Rosie, are you okay now? I’m so sorry I didn’t get there in time. I wanted to say goodbye. I’m so sorry. I tried. We’re on the road. We’re stuck in snow.” He was sobbing now in great heaving gasps.\n Frank looked away from him. The voice on the other end would be saying that it was okay, that everything was forgiven. Kerry told him those syrupy stories all the time, the miracles of posthumous reconciliation people had always paid big money for. The price tag had gone up, but at least Dan wasn’t paying for it. Sandra and the asshole were the suckers there.\n Dan fell into silence, chin quivering, and then said, “I know. I’m sorry.” Frank saw him shudder. “I’m here now. I’m here. You can always call me. I love you. I’m sorry you hurt so much at the end. Yes, call your friends now. I’ll talk to you soon.”\n He hung up, fumbling almost as much as he had when he answered the phone, his hands shaking as if he were outside in the cold, not here in the truck with a hot thermos of coffee and the heater blasting. He cleared his throat. “I told her I was sorry I wasn’t there. She said, ‘Daddy, you’ve never been there.’” His voice cracked. Frank stared straight ahead, out into the snow. Jesus.\n Next to him, he heard Dan unscrewing the thermos, heard the sound of the liquid pouring into the cup. “I deserved that.” Dan’s voice was quiet, remote. “What she said.”\n Frank shifted in his seat again. He had a sudden sharp memory of yelling at Alison when she was a little thing, three or four, when she’d been racing around the house and had run into him and her Barbie doll had jammed into his stomach like a bayonet. He’d had a bruise for two weeks, but the memory of her face when he screamed at her had lasted a lot longer. He swallowed. “Do they get over things? Or are they stuck like that forever, mad at whatever they were mad at when they died?” That had to be anybody’s idea of hell.\n “I don’t know.” Dan’s words were thin, frayed. “I don’t know how I can make it up to her now, except by talking to her whenever she wants to talk. I can’t go back and get to her seventh birthday party, that time I was out drinking. I can’t go back and fight less with Sandra. I just—well, I can tell Rosie how sorry I am about all of that. Hope she knows I mean it.”\n “Yeah. What do you want to do now, Dan? I’ll still drive you to Sacramento, if you need to see—”\n “Her dead body? No.” Dan shook his head, a slow heavy movement like a bear shaking off the weight of winter. “Not in this stuff. You’ve been awfully kind. I’ll try to get to the funeral, but that won’t be for a few days, anyway. The highway ought to be open by then.” His voice splintered again. “I just wish I’d gotten to hug her one last time, you know?”\n Frank nodded, and eased the truck carefully onto the shoulder, and headed for the exit.\n It didn’t take long to get back to the house. Frank pulled into the driveway, and they both got out, and Dan said, “I’ll be heading home now. You go on in and tell Kerry what happened. I’m not up to it.”\n “If you need anything—”\n “Yeah. I’ll let you know. Thanks, Frank.” Dan nodded and headed back to his own truck, and Frank went into the house. Kerry, sitting at the kitchen table doing a crossword puzzle, looked up when he came through the door. He saw the relief on her face, saw her exhale. And then she frowned.\n “What happened?”\n “The highway’s still closed. Rosie’s dead. She called Dan.” He pulled out another chair and sat down, suddenly exhausted. “You’re right, Kerry. It’s real.”\n Her eyes filled with tears. She reached for his hand. “I’m glad you know that now.”\n He did know, but he knew other things, too. He knew that it didn’t make any difference, that even if your dead child called you from cyberspace, you still regretted what you hadn’t been able to do for her. He wouldn’t miss Alison any less if she’d been translated, not even if she’d been one of the syrupy ghosts. Maybe he’d miss her more.\n But that wasn’t anything he could say to Kerry, who needed whatever comfort she could get. So he stood up and went to the window. There were icicles hanging from the roof. The daffodils and tulips definitely weren’t going to make it.\n He heard Kerry’s chair scraping against the linoleum, felt her come up behind him. “Honey, there will be flowers again next year.”\n “I know there will.”\n He stood there, looking out, remembering the day they’d planted the bulbs, mixing the soil with Alison’s ashes. She’d loved flowers.\n Susan Palwick is an Associate Professor of English at the University of Nevada, Reno. She has published four novels, all with Tor--the most recent is 2013's Mending the Moon--and a story collection with Tachyon, The Fate of Mice. Her work has won the IAFA Crawford Award and the ALA Alex Award, and has been shortlisted for the World Fantasy and Mythopoeic Awards."}