{"fingerprint": "Q4UN7jHW4tpPTVIp74P5XLqKftw=", "sitename": "Clarkesworld Magazine", "title": "The Good Story: A Conversation with Susan Palwick by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/palwick_interview_2019/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Good Story: A Conversation with Susan Palwick by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nThe Good Story: A Conversation with Susan Palwick\nSince 1982, Susan Palwick has explored visions of the fantastic. She has crafted worlds resembling ours, as well as realms strikingly different; she has taken readers to the delightful, to the humorous, and to the horrific. In creative narratives, occasionally experimenting with style and structure, she has introduced interesting, memorable characters, capturing and exploring human nature. Most recently, award-winning Palwick sets out to prove that All Worlds Are Real (Fairwood Press)—her second collection, about which Publishers Weekly says, “Readers will be thoroughly transported by these achingly beautiful tales.”\nSusan Palwick weaves fiction and textiles—since making her own cardboard loom in 2011—in Reno, Nevada. She won the 1993 Crawford Award for best first novel for Flying in Place and the 2006 Alex Award for The Necessary Beggar. She also won a 1986 Rhysling in the short poem category for “The Neighbor’s Wife.” Her fiction has appeared a number of times on the Locus Recommended Reading lists: 2018 for novelette “Recoveries” on Tor.com; 2017 for short story “The Shining Hills” and novelette “Remote Presence,” both appearing in Lightspeed Magazine; 2014 for short story “Windows” in Asimov’s Magazine of Science Fiction and Fact. She has also received nominations or appeared on short lists for the Sturgeon Award, the Nebula Award, the World Fantasy Award, and the Hugo Award. Besides being a former editor of The New York Review of Science Fiction, a novelist, an essayist, and a poet, she embodies (at least) three more definitions: “liberal Episcopalian, cat owner, proud geek.”\nWhat books did you read growing up and how did that transition into being a writer?\nI read a lot of fantasy and SF! Actually, I read everything, but SF/F was always my favorite. My parents both loved T. H. White’s The Once and Future King, so I reread that multiple times. My older sister read The Lion, The Witch, and the Wardrobe to me before I’d learned to read on my own, and the Narnia books became favorites. My sister also introduced me to Tolkien; she gave me a copy of The Hobbit for my eighth birthday. By the stereotypical SFnal age of twelve I was devouring Asimov, Heinlein, Bradbury, Le Guin, McCaffrey, Norton: really, anything I could get my hands on. The first place I was allowed to go by myself that involved crossing a major street was our town library, where I became a regular. The children’s librarian found all kinds of wonderful books for me, and then recommended adult ones.\nAs for transitioning to being a writer, I wanted to create the wonder I’d felt when I was reading. Also, as a kid I was far more comfortable with books than humans. Writing was a way to communicate without having to talk to anyone and risk ridicule or bullying, both of which I’d suffered in large quantities for reading so many books, and talking funny (slight speech impediment! big words!), and having no athletic ability whatsoever.\nDid you benefit from any workshops or writing classes, or are you more of a self-taught writer?\nI was a creative writing major in college, so I did a lot of workshopping there, but the professors weren’t comfortable with SF/F, so I started up a writing workshop through the SF club on campus. That was pretty successful; we were halfway between New York and Philadelphia and invited various professionals to come talk to us. Some of them were very encouraging, and one—Ellen Kushner—became a friend. After college, I attended Clarion West. After a while, though, I got burned out on workshopping. These days (many decades later!) my first reader is my husband, who’s an excellent critic and editor, but from there I usually go straight to submission. I’m such a slow writer anyway that if I had to sift through twenty workshop comments and decide which suggestions to incorporate and which to toss, I’d never finish anything.\nYou’ve been publishing short fiction since “Taller Than Trees” in 1982 (and “The Woman Who Saved the World” in Asimov’s Science Fiction in 1985), as well as poetry, essays, and reviews. Your fourth novel, Mending the Moon, came out from Tor in 2013. Are there important differences in the way you approach longer work compared to shorter work? Does poetry influence your other writings?\nEvery story and novel is different in terms of process, so this is difficult for me to answer. If I’m in the thick of a project, long or short, I try to write a certain small amount every day—generally 500 words or so—to keep momentum going. The trick with any piece of writing, for me, is to figure out the structure. Before I wrote The Necessary Beggar, for instance, I knew how many chapters there would be, which character would narrate each, and how long it would be. I often write to length: “Okay, in this book each chapter will be fifty manuscript pages,” that kind of thing. I talked about this on a writing-process panel at a convention once, and one of the other panelists—Terry Bisson, I think—looked over at me and said, “No one works that way. Come on, you don’t really do that. That’s insane!” But for me, it works.\nMy concern with structure comes partly from my work with poetry; I’m fond of writing sonnets, for instance, because the form provides a shape, a container, for what I want to say. I’m also quite conscious of language and prose rhythm.\nYour second collection, All Worlds Are Real, is due out from Fairwood Press in November 2019. How did the collection come about, and what was the process of putting it together like for you? Do you see the collection as thematic, or is it more a “Best Of”?\nThe book came about because I’d published a bunch of stories since my first collection came out in 2007. A couple had been reprinted in “Best Of” anthologies, but I wanted them all in one place, between covers, so they wouldn’t fade into oblivion. So, while there are certainly themes that wind through the collection, because they’re perennial preoccupations of mine—community, faith, loss, existence on the margins—the collection’s neither consciously thematic nor a “Best Of.” It’s more of an omnibus (a modest one, because my output’s so small).\nPutting it together involved striving for balance. I tried to alternate different kinds of narration (voice, gender, POV). I’ve sometimes been described as a “women’s writer,” a label I loathe—I certainly address feminist concerns, but I see them more generally as human concerns—but many of the stories in the collection, almost half, are narrated by men.\nThe trickiest thing was producing new material. As I’ve mentioned, I write very slowly, but I wanted three new stories in the book. I managed to push out three stories in three months, which is something of a record. They’re all very short, though!\nLooking at the new collection, which story are you are most proud of and why? What is it about?\nThat’s a little like asking a parent, “Who’s your favorite child?” I’m proud of all of the stories, for different reasons. My real interest is in which ones resonate with readers, and why. Some of the stories in the book have been loved by some readers and dismissed by others, which is always how that works.\nI will say, though, that of the three new stories in the book, the one that seems to have stood out for early readers is “Hodge,” the one piece in the collection that arguably isn’t even SF/F. It’s about a woman with schizophrenia who’s trying to cope without antipsychotic meds, because she’s terrified of their side effects. It grew out of the decade I served as a volunteer chaplain in an ER, and later, as a social work student interning in a psychiatric hospital. (I retired from being an English professor in 2017, got my Masters in Social Work in 2019, and then—amazingly, and as a direct result of my ten years of volunteering—got hired as a hospital chaplain. I’ve been in that job for a month now, and I love it.)\n“Hodge” was a technical challenge because I was writing stream-of-consciousness from the viewpoint of someone struggling with disorganized thoughts. I wanted to imagine what it would be like to live with severe mental illness, but in a way that invited compassion instead of stigma, and that also explored the very real reasons people are leery of medication.\nAre there any stories that you weren’t sure fit quite as well; or perhaps stories that were a bit different than usual for you?\n“Hhasalin” is one of the oldest stories in the book—I started writing it in 1988—and some readers called it old-fashioned when it was published in The Magazine of Fantasy & Science Fiction a few years ago. It’s the story I had to fight the hardest not to edit and rewrite when I was going over material for the collection; I believe in presenting stories as they were originally published. Some readers have loved it and found it very moving, though, so I trust it will find its audience.\nDo you see trends or similarities in a lot of your protagonists? Are there character types you lean towards, or do your characters vary greatly, from story to story?\nI’m strongly drawn to characters who are misfits, marginalized, or misunderstood. Some readers have complained that they don’t like various of my main characters; many of my protagonists aren’t conventionally appealing people. A lot of them have warts and rough edges, or act in challenging ways. Even Penny in “Ash,” one of the most mainstream characters in the new collection, winds up having to make a horrific decision. That said, I try to write from the perspectives of a lot of different kinds of characters, including people very unlike me. That can be dangerous, because I worry about misrepresenting the experiences I’m exploring, but I strongly believe that fiction’s a technology for creating imaginative empathy. My job as a writer is to try to see the world from as many different viewpoints as possible.\nWhat does it take to make solid characters; and do you look for these aspects in the fiction you enjoy reading?\nThe characters I find most interesting are imperfect. They struggle. They have complex inner lives; they aren’t just plot-puppets. They often have to navigate impossible ethical or moral dilemmas in situations where they can’t know for sure what the right course of action is. Since those are the characters I enjoy writing, it’s no surprise that I like reading about such people, too, as often in nonfiction as is fiction. I just finished reading Unfollow, Megan Roper-Phelps’ memoir of leaving the Westboro Baptist Church, and that’s a perfect example. From the outside, leaving that toxic and hate-filled organization seems like a no-brainer, but she’d been raised with those beliefs since childhood, and denying them meant cutting herself off from her family, whom she truly loved and who truly loved her. It’s a fascinating and very moving story.\nYour blog, Rickety Contrivances of Doing Good, has the tagline “Science Fiction. Progressive Christianity. And Other Improbable Optimisms.” Has writing as an Episcopalian (or writing fiction with Christian elements) had an impact on your career as a writer?\nWell, sure. Christianity’s a very triggering topic for a lot of people—for reasons I completely understand!—and I suspect my preoccupation with the topic has limited my audience somewhat. There are people who believe that progressive Christianity is an oxymoron, that anyone who claims the label Christian is automatically oppressive. I know where that comes from; I also know it’s not true. The subject of faith, any faith, is unbelievably complicated and multifaceted, which is why I find it so interesting. Organized religion has a lot to answer for, though, and a lot of people have been too traumatized by spiritual abuse to be able to see anything but what hurt them.\nDo you feel like the landscape of SF/F has changed in specific ways since you started publishing in the ’80s?\nOf course! The field’s much more diverse—which is good for everybody, although it’s created its share of controversies and resistance—and publishing has changed tremendously with the advent of self-publishing, the rise of small presses, the ascendency of the Internet, and so forth.\nYou’re attending World Fantasy in LA this year. Have you found conventions and the genre community in general to be welcoming and helpful? Has meeting people done anything for you career-wise?\nI’ve loved conventions since attending my first Star Trek convention in 1973. Conventions are where I reconnect with the SF/F community, which—of my various communities—contains the highest percentage of people who’ve known me since my twenties. When I was that age, meeting people did everything for me career-wise. If I hadn’t met Ellen Kushner, who introduced me to David Hartwell, who introduced me to Ellen Datlow and the Nielsen Haydens and too many other people to name, I wouldn’t have a career.\nI met Jo Walton at the 2011 Worldcon in my hometown of Reno; she was instrumental in helping me get the new collection published, largely because at the 2018 Worldcon in San Jose, she literally grabbed me by the arm and dragged me into the dealers room’ to talk to editors about the book. The manuscript had been kicking around for a few years by then, but I was feeling discouraged about my career prospects at that point and shy about approaching people. Jo forced me to take action. That wouldn’t have happened if we hadn’t been at a convention.\nWhat are you working on now that readers can look forward to?\nThat’s the ten million dollar question! I have three partial novel drafts and at least twice that many partial story drafts. When will I finish any of them? I wish I knew! Right now, I’m adjusting to a demanding new job and also taking Clinical Pastoral Education, a rigorous course for chaplains. CPE will end in late March. I’m also still recovering from knee replacement surgery in June, so my energy level isn’t where I want it to be. But I’m hoping to finish a couple of new stories and get them published next year, and also to get back to one of the novels next spring.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}