{"fingerprint": "XGD8drP/dfYUxUFj+c5zN8N0e1M=", "sitename": "Clarkesworld Magazine", "title": "City of Eternity by Pan Haitian, translated by Carmen Yiling Yan", "author": "Pan Haitian; Carmen Yiling Yan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/pan_11_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: City of Eternity by Pan Haitian, translated by Carmen Yiling Yan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4220 words, short story\n City of Eternity\n Strange boulders littered the Mountain of the Empty.\n They were ovoid in appearance and similar in size, their corners and edges smoothed away by the wind, so that even the moonlight shining upon them found no purchase. Like ghastly white skeletons, they lay half-buried in the earth, large and small. They all seemed to be assembled in their proper places, from the chassis onward, rounded and polished, without holes, one ovoid mass jutting atop another. They resembled the spindle-form bodies of birds, the rounded contours of beasts, the big bellies of water jars . . . the list of their shapes would be endless.\n Perhaps it was no more than the desolateness of the Mountain of the Empty that made you see things when you walked past those boulders. You felt as if they were shaking their heads, or nodding, or muttering unintelligible things to the wind. Nothing here was clear or certain. It was an ineffable feeling, beyond close investigation. If you stood and had a clearer look, you would see only motionless, lifeless stone.\n The weather was strange. In one moment moonlight filled my lap; in another there was misty rain. I led Susu through the jumbled boulders. Newly formed rivulets ran underfoot through the crevices between stones.\n A delicate rain fell from the trees like scattered blossoms, or alternatively, scattered blossoms drifted down from the heavens like a delicate rain.\n A lone, powerful black horse came toward us, bearing the moonlight that suddenly flashed through a crevice in the clouds.\n “Who goes there?” I shouted, gathering the remaining courage of one who had been defeated in battle. The shout carried across the broad valley, like an arrow slicing across the azure.\n But the shadow astride the horse did not move. Only when the horse eventually arrived in front of us did we discover that the soldier sitting in the saddle was dead. From his appearance, he’d been dead for at least two days. His face was hidden in the shadow of the iron helmet, pitching in front of his chest with the horse’s every step. The tassels on the horse’s bit swayed in the moistened air, drifting left, then drifting right. The body inside the armor was dead, but the fine iron armor that encased it would not fall so easily. The crest on the shield indicated that he, like me, was one of the Imperial Guard.\n I grasped his frigid ankle and pulled him off the horse.\n As I dragged the body along, as I dug the pit, Susu remained to one side, silent. Only when I flipped the corpse over, preparing to push it into the pit, and the slanting moonlight illuminated the young man’s face, did Susu at last speak. “O fallen one, why have you appeared here? Did you travel so far for no purpose but to die in this foreign land? Did you come here only to inform us of the inevitability of fate and the imperishability of death? Now you will become the wind in the woods, the grass that nourishes the earth. You will become part of this world, and the commotions upon it will have nothing more to do with you—if this is the fate of all of us, o, I fervently hope for the courage to face it with equanimity.”\n I pushed earth atop that face like dead ash. In my heart, I said, “O fallen one, you could not escape the clutches of the enemy, but you have brought us a mount. If we escape alive, I’ll thank you properly. But what gift of thanks do you need? No longer need you concern yourself with the arrow that comes from behind. Your body may soon stink and crawl with bugs, but no longer need you fear any disturbance. O fallen one, you may have died tranquilly, but I still must continue my seeking. The road is long ahead of me; I can’t squander my brief allotted time. I still have courage enough to seek glory, to take victory on the battlefield, and to offer my won honors at the feet of beautiful women—no matter what fate you came to, it cannot change me.”\n The trees in the woods were all very tall, their branches hidden in the black of the night sky, so that the flowers seemed to fall from the heavens themselves. They were in two colors, a pale red and an ashen blue.\n Susu reached out her hand and caught a blossom. Her profile, fixated on the flower, had been chilled livid in the rain. Those long black lashes of hers lay atop her colorless cheek. I could hear her supple breathing.\n Her fearsome king father had died. Her beautiful kingdom had fallen. Her loyal people had all turned traitor. But her face remained ever beautiful.\n For this woman’s beauty alone, the Iron-Boned Khan had sent a hundred thousand soldiers. We were already far from Wolf Pass, far from the limits of his power, but as long as Susu lived and exhaled those breaths that stirred the stamens of the flower, the pursuers sent by the Iron-Boned Khan would not spare this last survivor of a fallen subject kingdom.\n I wouldn’t let her fall into the hands of the Iron-Boned Khan. I wanted to find a way for her to remain forever safe, a way for me to remain forever by her side. I loved her so. The love was like a smoldering flame, slowly consuming my heart and flesh. The love was the feel of her light touch at my elbow when she was hungry. The love was watching her curl up wearily upon the damp fallen leaves. The love was waiting outside the woods, listening to the pattering of urine that came from within.\n I suppressed the love like a tempest in my heart, wordlessly helping her atop the horse, and only looked enviously upon the petals crushed beneath her thighs.\n Amid fine raindrops, we continued forward, and saw the Undying Sages of legend.\n They appeared suddenly in the forest clearing. At first, we could make out only murky silhouettes.\n Susu clutched tightly to my tattered armor, gazing upon them with fearful reverence.\n “General Meng, is this where the Undying Sages live? They look so dirty and wretched. Can they truly help us escape the death that hounds our heels?”\n They were motionless. Admittedly, they didn’t look like scholars full of wisdom. Photinia and lichen grew from their rotting garments. Wild azalea bloomed from their knees. Their skin was covered in dark moss, their eyelids with white bird excrement. Their feet seemed to have sunk deep into the mud and taken root.\n Two of them seemed to be playing weiqi under a pine tree, only the board had become smothered in mushrooms and vines, concealing the position of the pieces. Regardless, they remained deep in consideration, heads lowered. Another Sage seemed to be playing a zither upon his crossed legs, only we couldn’t discern any tune. In fact, when we’d stepped into this clearing, we’d heard the single metallic note of a plucked string. The sound had crossed the dim space under the trees, like an undulating wave line, before striking a crooked tree, and splitting in two, to drift off in opposite directions. We waited for a long time but didn’t hear a second note from the zither. Only when the first sound reached the ends of the earth, perhaps, would a second sound set off sedately to catch up with it.\n These people were in fact alive, but their movements were slow beyond endurance.\n I found it difficult to comprehend. Their sagacity was such that they could fly into the heavens, to tranquilly converse with the stars, to set their lives abloom upon the Nine Provinces’ long river of History like the most resplendent fireworks, and yet they did no more than allow themselves to be rained upon like dilapidated stone statues.\n I walked all the way from the east side to the west end, shouting language that grew increasingly crude with urgency, but none of them paid mind to me.\n I realized that my movements were perhaps too quick for them, like a phantom that passed in the blink of an eye.\n It could drive you to despair. We’d endured hardship after hardship to come here, but we had no way to communicate with them. They wouldn’t even look at us.\n Fortunately, before abandoning my efforts, I took Susu’s horse and walked deeper into the woods for a while.\n I found other silent ones. They were scattered throughout the woods, slowly turning their bodies as if in dance. Their heads were woodenly upraised; their eyes were open but seemed to see nothing. Yet compared to the earlier Sages, their movements were at least more fluid, more nimble. I could even see a grizzle-bearded elder among them, swiveling his eyes toward me.\n I spoke: “What are the lot of you doing?”\n His brow furrowed, as if he’d heard the ear-splitting cry of a bird.\n I had no choice but to slow down and ask again, “What—are—the—lot—of—you—doing?”\n “We’re observing the great and small of all things, including the gods Primordium and Ruin.”\n “But you’re only sitting here unmoving. How is that possible?”\n He wrinkled a face with skin layered like a mummy’s. Dismissively, he said, “With our powers, towering Gouge Mountain can be encompassed in a single speck of dust, and the dust would not be affected in the slightest. The vastness of the four seas can be set inside a humble heart, and the heart would not grow or shrink. Look, that man in gray there has lifted his neck to swallow that viscous cloud. He is not swallowing a cloud; he is swallowing all of Ning Province—see that old man whose beard trails on the ground? He is swallowing the Boundless Sea.”\n I was shocked. “I don’t doubt your powers. It’s precisely because of them that we’ve come to you for aid. Please tell us, how might we survive?”\n But his eyes had already turned elsewhere. He only lifted a finger so thin it was no more than bone and pointed at a white stone in the clearing. “Look . . . ”\n The rain had stopped by then; the wind skipped under the tree leaves, blowing droplets loose. The moonlight was growing bright, shining through the trees to illuminate the clearing. But I didn’t see anything.\n Susu was still gazing intently at the clearing, but my neck was growing stiff. Impatiently, I asked again, “What are we looking at?”\n The Undying Sage gave a long sigh. “If you cannot focus your concentration to a single point, how can you comprehend the answer? Life arises from stillness. Only by settling into complete stillness can one sense the breath and rhythm of heaven and earth. You must make yourself part of it, become one with the sun, moon, stars, mountains, rivers. Then you will understand the truth of Primordium and Ruin.”\n Susu was a girl who could endure loneliness. She gazed fixedly at the stone, seeming as if she’d glimpsed something but could not be sure. Meanwhile my feet grew numb, my eyelids ached, and coldness seeped upward from beneath my feet.\n I couldn’t help but ask again, “Those people we saw first—why weren’t they moving?”\n That Undying Sage seemed to be watching the tip of his nose. It was a long, long time before a hollow voice drifted out from beneath the tangled beard: “They have reached the highest state out of all of us. They simply don’t need to move, don’t need to breathe, don’t need to eat or drink. To them, exercise is meaningless. They are Primordium and Ruin themselves.”\n Susu asked too, “Then why can you speak with us? Is your cultivation insufficient?”\n The Sage became a little angry. He said, “Every month, one of us remains alert for the purpose of guiding you lost mortals. You were fortunate to encounter me immediately upon your arrival.”\n Susu tugged at the corner of my clothes. She said softly, “I’m hungry.”\n I too felt profound exhaustion. My belly rumbled like thunder. “I apologize, we’re too weary to reach your level of comprehension anytime soon. Can you spare us some food?”\n “Food?” The old man smiled and faintly waved his hand. “There are only two foods here. One is the Fruit of Knowledge. The other is the Flower of Life. Eat the Fruit of Knowledge, and your eyes will open to understand everything in the mortal world. Eat the Flower of Life, and you will join us as one of the Undying.”\n Undying! Who could have thought it would be so simple to gain the highest knowledge in the Nine Provinces. This temptation came too sudden and too great to resist. Was this not the answer we sought? So I thought.\n He turned over his left hand, revealing two ash-blue flowers. They were none other than the flowers that had fallen on our shoulders and arms during the entirety of the journey. We looked closely and saw that minute fruits were concealed under the petals. These were the Fruits of Knowledge.\n Susu’s face reflected, mirrorlike, the paleness of my own. But she unhesitatingly reached out a hand, took an ash-blue fruit, and swallowed it down in one gulp. I hurriedly took the other fruit and swallowed it.\n Again, the clear note of a plucked zither reverberated through the woods.\n Time appeared to pause. Dew rolled down from the treetops and seemed to linger at length in the air before falling to the grass.\n “Careful, don’t get too close.” The old man spoke in a voice that contained both contentment and the pleasure of revealing a secret. “They’re right under your feet.”\n The world had suddenly grown fine-grained. I saw all the details that had, though they’d existed before now, never been seen by any.\n I’d gazed countless times upon Susu’s face; nothing could be more familiar to me. But in this instant, it appeared in front of me with a clarity I’d never experienced. So many details revealed themselves that it seemed an unfamiliar mask.\n I saw the fine white hairs on the girl’s face like a fall-frosted field of artemisia. In her eyes were translucent pupils filled with amazement and cone cells and lenses. The lines at the corners of her mouth rippled lightly with surprise and joy. Her face was so alive, full of expressions that we’d never noticed before. Who said that she was a princess as cold as eternal ice? I looked at her for a long time, before following her gaze downward.\n I saw clearly the city of the sand-people.\n They were on the stone at my feet, their movements rapid as they constructed tiny buildings, houses with pointed roofs and beautiful courtyards that were likely smaller than a speck of dust. They were built, taken apart, and built again, each time bigger and more imposing and more beautiful than the last time.\n These people were smaller than the smallest speck of dust, and their lives were similarly short, spanning not even the tick of a clock. But they bustled without rest. Fields and vineyards expanded outward bit by bit. Thin roads spread and canals crossed. The houses and buildings were like tiny chessboards. They raised enormous palaces and gardens and high towers like the point of a pin. They built grand bridges over the remnants of dewdrops. They rode on sand-horses, doing battle with mites, bravely slaying them. There were countless tiny flashes of blades concentrated about black banners—yes, these were their troops and soldiers. They had their own duty and glory.\n Other sand-people continued to build ceaselessly, before quickly dying. But their descendants flooded out steadily from the houses and cities, more than there were before.\n Sometimes their expansions failed. Every drop of dew was a terrible flood. The leap of a squirrel a hundred paces away would make for a terrible earthquake. Even the excessive brightness of the moonlight brought drought. But they were not discouraged, and endured through it all.\n In only a minuscule span of time, they’d raised a tiny but incomparably magnificent city. It was a city on a grander scope than I’d ever seen. Fine wisps of smoke rose from it under the moonlight; it held millions of sand-people. The prosperity and flourishing was more than a single glance could take in.\n And the sand-people did more than just work; they remembered to enjoy the pleasures of life. They decorated their courtyards with gorgeous molds and mosses of every hue, colors changing with every second, a hundred times more dazzling than the gardens of our normal dimension.\n They also had markets, overlaid with the most variegated of colors, the most magnificent of wares. The goods flowed like a parti-colored riverlet. Many merchants from other cities came to participate in their markets; sailboats filled the harbor—the big-bellied cargo ships could fly through the air, like tiny specks of floating dust, borrowing buoyancy from moonlight to rise and descend, coming and going freely.\n The sand-people gathered under the moon, dancing around the faint, flickering light of embers. If you bent down carefully, you could even hear the merry tunes, smell the overpowering fragrance of flowers and wine, see those beautiful women, and the love that was irrepressible under the moonlight.\n The more we looked, the more we grew entranced, practically melding into them and becoming one of the gathering. But perhaps this caused our faces to press too close. Agitation rippled through the sand-people. They looked with alarm upon the giant faces that had suddenly appeared in the sky.\n Susu’s face was so gentle and beautiful that they took it for the manifestation of a god. They overcame their initial panic and began to sculpt a statue in her image. They built tall walls around the statue, raising a temple. They constructed an enormous palace to pay her homage.\n I was drawn by their passion. I bent down farther, wanting to see whether their god’s statue was more beautiful than Susu in the flesh, but my crude breathing, to the sand-people, was the most terrible of storms. It swept over the city, knocking over those walls the width of a hair, collapsing the palaces, bringing down the towers.\n Countless sand-people died in the calamity. Discovering my error, I hastily shrank back and hid my face.\n The sand-people looked at what remained of their city after the disaster and grieved but very soon they put it behind them. They were quick to forget. The city was restored unflaggingly, even greater and more beautiful than before.\n They rebuilt the temple and palace. Beside Susu’s statue, they erected another ferocious, dreadful statue. From above, I recognized my own image.\n They’d taken me for a god of evil—I wasn’t very pleased, but soon, at least, we could once again appreciate their songs and endless revelry under the moonlight.\n I’d assumed that this city would remain vibrant forever. But then, without rhyme or reason, like a great tree suddenly running to the end of its allotted life span, the fountains dried, the flowers and molds in the gardens wilted, the sand-people were no longer replenished when they died, and their numbers dwindled. No god could save them.\n When even we could see that the vitality of the city was gradually draining away, they seemed to come to a collective decision. At once, all the cargo ships moored to the docks departed the city. Tens of thousands of specks of dust danced in the moonlight. All the sand-people had left, never to return.\n All that remained on the stone was the empty city and those countless exquisite little houses. We sighed softly, an emptiness in our hearts. Like children unwilling to part with beloved toys, we stubbornly waited for the sand-people to return—though it seemed that no more time passed than it took to flick a finger. First the smaller houses, likely built of inferior materials, began to collapse like shifting sand. And in the next such interval, the better-constructed houses fell one after the other.\n The city’s drainage system grew clogged. The gathered dew rapidly swelled and washed away the earth, transforming the broad boulevards and walkways into ravines. At least thirty or forty rivers rushed into the city; swarms of mites roamed what had once been the most splendid song-houses and palaces. The grandest of the palaces disappeared in a great fire; a firefly had chanced to alight, and the tiny spark from its foot had set ablaze the many-colored garden.\n The grand bridge took relatively long to fall, followed by the dam. They’d endured for an impressive time over the dried remnants of dewdrops, but the shock of a minute movement of my foot reduced them, too, to dust.\n The storehouses and cellars lasted even longer, but all the same, they collapsed within the time it would take half a stick of incense to burn, returning to the fine dust from which they’d come.\n We refused to give up. Wordlessly, we waited. Look, that black speck. Were they returning?\n No, it was only an ant hurrying through. This lost insect was like a terrible monster, striding over ten neighborhoods with one step. It dragged a grass seed behind itself, which demolished everywhere it had been like an avalanche.\n Perhaps there were other sand-people who could return and restore the city that recorded the dreams and triumphs of their countless generations, just like they’d rescued the city from the storm we’d breathed out.\n But at that moment, my nose tingled. The itch was like a needle, uncontrollable, sinking bit by bit into my nasal cavity. A tempest gathered in my lungs, and ultimately rushed out of my throat in an enormous sneeze. The entire city flew into the air.\n A sound rang out.\n Everything disappeared. Gone.\n The stone, under the moonlight, was a field of desolate white.\n Susu and I awoke as if from a dream. I’d thought a thousand years had passed. Yet I discovered that the third note had just left the fingertip of the man under the tree, rising on a wavering diagonal into the air.\n Under the moonlight, the old man’s face was like decayed wood. Expressionless, he opened his right hand, revealing, again, two flowers, only those flowers were pale red.\n Susu picked up a flower. She turned and gave me a dazzling smile. “General Meng, will you come with me?”\n The old mercenary paused in his story, gazing dully toward the others.\n “I often think,” he sighed quietly, “of the courage of women . . . Susu ate the entire flower and became a boulder on the Mountain of the Empty. And I suppose in front of her I became a wisp of smoke . . . disappearing without a trace.\n “I knew that in the outside world there were many vigorous, ardent deeds to be done, many beautiful young supple-limbed women waiting, many rich, fragrant, throat-tearing wines fermenting. But to Susu, turned to stone, in the time I was experiencing all this, her heart wouldn’t have given half a leap.\n “I escaped back to the outside world and continued living my red-hot days. I fought and killed for my life, experienced the new wonders that every day brought me, acting always according to instinct. I cast down gold like dirt—a fortune won today, I could spend by the next. High titles and salaries came and went. Painted beauties were only sweets on the table. I knew my ultimate end was to return to the Mountain of the Empty and become a piece of wizened stone.\n “Fifty years have passed in the blink of an eye. My body has accumulated hundreds of scars. Whether in Lan Province or Wan Province, I earned much renown for myself, though my hands were empty, and I had nothing. I told myself, it’s just about enough. If I continue my games, I’ll be tossing my bones to the mountains and rivers.\n “So I went back to look for the road to the Mountain of the Empty, year after year. By now I’m so old I’m nearly dead, but I still haven’t found the road back.\n “I’m a real fool,” he said self-pityingly. “What made me think I had the luck to encounter eternity for a second time? If I’d eaten that flower . . . ” He began to chuckle. Suddenly he drew a big circle in the air with his hands. “Heh, all this will become illusion, as if pulled in by the rapids of the river of time to disappear at its other end. But I can go back to find that girl. Every thousand years, we can touch. Every ten thousand years, we can enjoy the fount of love . . . I can live forever . . . ” His voice grew fainter and fainter; the others by the fire couldn’t hear his continued muttered complaints. The wind rose. They seemed to hear a faint, merry tune from somewhere nearby, smell the powerful fragrance of flowers and wine. They saw those beautiful women, and the love that was irrepressible under the moonlight. Had all this—ever truly existed?\n Originally published in Chinese in Fantasy 1+1, September 2006.\n Translated and published in partnership with Storycom.\n Pan Haitian is a graduate of School of Architecture, Tsinghua University, National Class I Registered Architect, and a science fiction and fantasy writer. He has won five Galaxy Awards of Chinese SF. His story “The Legend of Yanshi” was adapted into the ballet drama “Yanshi” by the National Ballet of China. He is also the co-founder of Jiuzhou Novoland, a fantastic ancient Chinese setting crowd worldbuilding project. He worked as editor-in-chief of Odyssey of China Fantasy from 2005-2010, and now works mainly as a screen writer.\n Born in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest."}