{"fingerprint": "kvpg07m+W2yAIm19lUwyT1qxV4c=", "sitename": "Clarkesworld Magazine", "title": "Tripping the Light Fantastic: An Interview with Pan Haitian by Nick Stember", "author": "Nick Stember", "date": "2009-10-01", "source": "https://clarkesworldmagazine.com/pan_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tripping the Light Fantastic: An Interview with Pan Haitian by Nick Stember", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nTripping the Light Fantastic: An Interview with Pan Haitian\nWhen I arrived in China I spent a lot of time trying to find local examples of my two passions: comics and science fiction. Although everyone I met seemed far too busy learning English, preparing for their college entrance exams, hanging out in internet cafes, or (the most popular option in Harbin, where a typical winter day is an average of -18 °C and the sun sets at 4pm) drinking, I soon discovered that comic books and science fiction magazines could be found tucked into the odd corners of the local bookstores and, most accessibly, at newsstands.\nBack in 2007, it was easy to find a newsstand, even in icy Harbin. They came in all sorts of shapes and sizes, but the ones I remember best were red, with a white curving roof designed to look like an open book. Encased in a rainbow-hued cocoon of shiny shrink-wrapped magazines, the doors of the newsstands opened outward, becoming make-shift shelves. Inside one would invariably find a smiling newspaper vender, swaddled in a discarded PLA jacket, working his or her way through a plastic bag of un-hulled sunflower seeds. A red payphone would be placed on the counter, next to a battered looking crockpot filled with tea eggs and an assortment of beverages. Sometimes they would have a cooler parked alongside to sell ice cream as well (unplugged of course in the winter), but for me, it was all about the comics and science fiction.\nAlthough my rudimentary Chinese served me well at the roadside BBQ shacks and Korean bibimbop joints of Harbin, the classes I took at HIT (Harbin Institute of Technology, named after MIT in a fit of aspiration) did little to prepare me for the science-heavy jargon and made-up words which pepper your typical science fiction story. After trying to battle my way through one or two stories, dictionary in hand, I gave up. The stack of magazines I collected over that first year in China followed me back to the States, though, where they spent several years collecting dust in Portland before my parents, looking to downsize, packed them up along with the detritus of my childhood (Legos, Magic 8 Balls, mutilated action figures, etc) and delivered them to my doorstep in Vancouver, BC.\nOpening them today I find an assortment of all the big names, at least two of whom have already graced the pages of Clarkesworld: Xia Jia and Chen Qiufan. This month another big name in Chinese science fiction joins them: Pan Haitian.\nIn China, Pan Haitian is known for mixing his science fiction with a heaping spoonful of fantasy and mythology (conveniently enough, in Chinese, the term for “science fiction,” kehuan 科幻 is used as an umbrella term to include “fantasy,” huanxiang 幻想). Joel Martinsen has described Pan’s has described Pan’s work on the Novoland project as, “an attempt to build an indigenous fantasy universe,” with an early novella Yanshi Chuanshuo 偃师传说 [The Legend of Master Yan, Science Fiction World, 1998] adapting a classic tale from the Lieh Tzu into a modern fable about a man who builds clockwork automatons. Humor also plays an important role in Pan’s stories: a 2010 story by Pan depicts the famous early 20th century intellectual Lu Xun as a demon hunter facing off against his real life rival, Liang Shiqiu. Another story, “The Story of a Pig in the Springtime,” is a comic fantasy about pigs surviving the Wenchuan Earthquake only to take over the world.\nPan is also extremely active in the Chinese science fiction and fantasy community, having worked as an editor of the influential magazine, Jiuzhou Huanxiang 九州幻想 [Odyssey of China Fantasy] since it was founded in 2005. His previous work includes the 2001 collection Dajiao, Kuai Pao! 大角，快跑! [Run Dajiao! Run! New World Press 新世界出版社] and four novels set in the Novoland universe: Baique Shengui白雀神龟 [Ghost Sparrow, Spirit Turtle, New World Press, 2006], Tie Futu [The Iron Stupa, New World Press, 2007], 24 Ge Mei Miao Tiantang 24格每秒天堂 [24 Second Paradise, serialized in China Fantasy, 2009-10], and Anyue Jianglin 暗月将临 [A Dark Moon Rises, Hunan Art and Literature Press October, 2012]. “Hunger Tower” is Pan’s first work to have been published in English.\nAs an editor, writer, and philosopher you wear a lot of different hats. In respect to each of these roles, explain the significance of your magazine, Odyssey of China Fantasy.\nChina Fantasy has changed a great deal from when it first began, as a forum for fantasy short stories, to today’s China Fantasy magazine. Step by step we’ve broken free of the self-imposed limitations of the China Fantasy website and have been working hard to help Chinese fantasy find its own voice.\nOur editorial board uses a variety of themes: every month we destroy one Chinese city, or ask all of the male science fiction and fantasy writers to describe a future matrilineal society, or to imagine a Chinese superhero who is actually just an everyday joe from the lowest levels of society . . . they are all very involved in the magazine. We are always looking for new writers and new readers who “get” us, because we’ve already figured out where we stand: create the new by destroying the old.\nThese themes have given birth to a sister publication, Jizhou Quanmin Huanxiang 九州全民幻想 [National Fantasy], which we dressed up like zombies for and also sold apocalypse survival kits. We even put up a reward for a knock-off ark program like the one in the movie 2012 . . . our goal is to bring down science fiction from its lofty heights, and erase the line between reality and fantasy. We want to use thought, action, graphics, models, data, and diagrams—things outside of literature to express science fiction and fantasy concepts. Once we got started, we quickly found ourselves overwhelmed with material. It’s my hope that we can reach you in your real, everyday life.\nWhat do you think it really means to be “Chinese?” How is it different from being, say, “American?”\nObviously, it’s more than just cheongsam dresses, the limestone karst scenery of Guilin, the canal cities of the Yangtze delta like Wuzhen, conical hats, Lao-tzu and the Tao Te Ching, kung fu and all these symbols. Because Americans use the same symbols when they film movies like Transformers or Mission Impossible in Shanghai.\nAs I understand it, to be Chinese you have to include the contemporary ideology of China today—Chinese people’s way of thinking, their philosophical outlook on life, their way of looking at the world. More specifically, it appears in the choices that characters make in a work, in their attitude towards new things. It can affect the entire thrust of a story.\nPersonally, I think Chinese people can’t escape this kind of awareness. Even if we were to write a story that was set five hundred and fifty thousand light-years away, in a time when national boundaries had been completely erased, the actions the characters would take; walking, lying; all the different monsters they would run into trying to destroy the universe; deep down, they would all really just be the Chinese people that are all around us right now.\nIf we say we are “Chinese,” doesn’t that mean that “Chinese science fiction and fantasy” is a special kind of fiction that is somewhat different from “real science fiction and fantasy”? What is the difference between the two?\nIt’s good to be special. It’s like how Japanese science fiction and fantasy, or Czech, or British all have their own special qualities. For some of them you can tell the difference right away. I think we need to work to preserve this special-ness, even if it means that we get ignored or marginalized by mainstream science fiction and fantasy. But who says that the only standards for criticism out there are the standards of the American Nebula and Hugo awards?\nSo that’s why I like to use the word “distance.” On parallel tracks, each respecting the other and each keeping an eye on the other. Sometimes we collide, sometimes we co-exist in harmony. Someday maybe we will work together to produce a cross-cultural being, something even better than what has come before.\nDo you think that “real science fiction and fantasy” should be without borders? Can you give an example of a story or book that you’ve read which qualifies?\nCompared to other types of fiction, science fiction and fantasy seem to have more of a tendency to go beyond borders. That’s because in many eras national borders are erased and in space, all sorts of beings get to mix together. There are aliens which look like fish, and in many science fiction and fantasy novels the protagonist is a foreigner. But I think that real science fiction and fantasy needs to have a clear sense of place, something that can only happen in that time and that place. If you change the place then it just doesn’t work anymore. Liu Cixin’s “Village Teacher” and “Chinese Sun” both do a very good job of this.\nNick Stember is a Chinese to English translator of Chinese comics /manhua/ and speculative fiction. His work has been featured on the websites of The Comics Journal, Paper Republic, Danwei, Frog in a Well, FluentU, Optical Sloth, Tor, Boing Boing, iO9, Rolling Stone, the BBC World Service, and the South China Morning Post. Most recently, he has been working as consultant for Stone Bridge Press and Storycom.\nCurrently a Masters student in the Department of Asian Studies at the University of British Columbia, Nick lives in Vancouver, BC. In 2013 he spent three months living in Blaine, WA, commuting across the border on a ten-speed bicycle. He is currently working on a project to build the world's first English language encyclopedia of Chinese comics and animation, the Encyclopedia Manhuannica."}