{"fingerprint": "rkc+uEdXs8aBZWV3yyQWAKHL13U=", "sitename": "Clarkesworld Magazine", "title": "A Rich, Full Week by K.J. Parker", "author": "K J Parker", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/parker_10_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Rich, Full Week by K.J. Parker", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9880 words, novelette, REPRINT\n A Rich, Full Week\n He looked at me the way they all do. “You’re him, then.”\n “Yes,” I said.\n “This way.”\n Across the square. A cart, tied up to a hitching-post. One thin horse. Not so very long ago, he’d used the cart for shifting dung. I sat next to him, my bag on my knees, tucking my feet in close, and laid a bet with myself as to what he’d say next.\n “You don’t look like a wizard,” he said.\n I owed myself two nomismata. “I’m not a wizard,” I said.\n I always say that.\n “But we sent to the Fathers for a—”\n ”I’m not a wizard,” I repeated, “I’m a philosopher. There’s no such thing as wizards.”\n He frowned. “We sent to the Fathers for a wizard,” he said.\n I have this little speech. I can say it with my eyes shut, or thinking about something else. It comes out better if I’m not thinking about what I’m saying. I tell them, we’re not wizards, we don’t do magic, there’s no such thing as magic. Rather, we’re students of natural philosophy, specializing in mental energies, telepathy, telekinesis, indirect vision. Not magic; just science where we haven’t quite figured out how it works yet. I looked at him. His hood and coat were homespun, that open, rather scratchy weave you get with moorland wool. The patches were a slightly different color; I guessed they’d been salvaged from an even older coat that had finally reached the point where there was nothing left to sew onto. The boots had a military look. There had been battles in these parts, thirty years ago, in the civil war. The boots looked to be about that sort of vintage. Waste not, want not.\n “I’m kidding,” I said. “I’m a wizard.”\n He looked at me, then back at the road. I hadn’t risen in his estimation, but I hadn’t sunk any lower, probably because that wasn’t possible. I waited for him to broach the subject.\n By my estimation, three miles out of town; I said; “So, tell me what’s been happening.”\n He had big hands; too big for his wrists, which looked like bones painted color “The Brother wrote you a letter,” he said.\n “Yes,” I replied brightly. “But I want you to tell me.”\n The silence that followed was thought rather than rudeness or sulking. Then he said, “No good asking me. I don’t know about that stuff.”\n They never want to talk to me. I have to conclude that it’s my fault. I’ve tried all sorts of different approaches. I’ve tried being friendly, which gets you nowhere. I’ve tried keeping my face shut until someone volunteers information, which gets you peace and quiet. I’ve read books about agriculture, so I can talk intelligently about the state of the crops, milk yields, prices at market and the weather. When I do that, of course, I end up talking to myself. Actually, I have no problem about talking to myself. In the country, it’s the only way I ever get an intelligent conversation.\n “The dead man,” I prompted him. I never say the deceased.\n He shrugged. “Died about three months ago. Never had any bother till just after lambing.”\n “I see. And then?”\n “It was sheep to begin with,” he said. “The old ram, with its neck broke, and then four ewes. They all reckoned it was wolves, but I said to them, wolves don’t break necks, it was something with hands did that.”\n I nodded. I knew all this. “And then?”\n “More sheep,” he said, “and the dog, and then an old man, used to go round all the farms selling stuff, buttons and needles and things he made out of old bones; and when we found him, we reckoned we’d best tell the boss up at the grange, and he sent down two of his men to look out at night, and then the same thing happened to them. I said, that’s no wolf. Knew all along, see. Seen it before.”\n That hadn’t been in the letter. “Is that right?” I said.\n “When I was a kid,” the man said (and now I knew the problem would be getting him to shut up.) “Same thing exactly; sheep, then travelers, then three of the duke’s men. My granddad, he knew what it was, but they wouldn’t listen. He knew a lot of stuff, granddad.”\n “What happened?” I asked.\n “Him and me and my cousin from out over, we got a couple of shovels and a pick and an axe, and we went and dug up this old boy who’d died. And he was all swelled up, like he’d got the gout all over, and he was purple, like a grape. So we cut off his head and shoveled all the dirt back, and we dropped the head down an old well, and that was the end of that. No more bother. Didn’t say what we’d done, mind. The Brother wouldn’t have liked it. Funny bugger, he was.”\n Well, I thought. “You did the right thing,” he said. “Your grandfather was a clever man, obviously.”\n “That’s right,” he said. “He knew a lot of stuff.”\n I was doing my mental arithmetic. When I was a kid; so, anything from fifty-five to sixty years ago. Rather a long interval, but not unheard of. I was about to ask if anything like it had happened before then, but I figured it out just in time. If wise old Grandfather had known exactly what to do, it stood to reason he’d learned it the old-fashioned way, watching or helping; quite possibly more than once.\n “The man who died,” I said.\n “Him.” A cartload of significance crammed into that word. “Offcomer,” he explained.\n “Ah,” I said.\n “Schoolteacher, he called himself,” he went on. “Dunno about that. Him and the Brother, they tried to get a school going, to teach the boys their letters and figuring and all, but I told them, waste of time in these parts, you can’t spare a boy in summer, and winter, it’s too dark and cold to be walking five miles there and five miles back, just to learn stuff out of a book. And they wanted paying, two pence twice a year. People round here can’t afford that for a parcel of old nonsense.”\n I thought of my own childhood, and said nothing. “Where did he come from?”\n “Down south.” Well, of course he did. “I said to him, you’re a long way from home. He didn’t deny it. Said it was his calling, whatever that’s supposed to mean.”\n It was dark by the time we reached the farm. It was exactly what I’d been expecting; long and low, with turf eaves a foot off the ground, turf walls over a light timber frame. No trees this high up, so lumber had to come up the coast on a big shallow-draught freighter as far as Holy Trinity, then road haulage the rest of the way. I spent the first fifteen years of my life sleeping under turf, and I still get nightmares.\n Mercifully, the Brother was there waiting for me. He was younger than I’d anticipated—you always think of village Brothers as craggy old fat men, or thin and brittle, like dried twigs with papery bark. Brother Stauracius couldn’t have been much over thirty; a tall, broad-shouldered man with an almost perfectly square head, hair cropped short like winter pasture and pale blue eyes. Even without the habit, nobody could have taken him for a farmer.\n “I’m so glad you could come,” he said, town voice, educated, rather high for such a big man. He sounded like he meant it. “Such a very long way. I hope the journey wasn’t too dreadful.”\n I wondered what he’d done wrong, to have ended up here. “Thank you for your letter,” I said.\n He nodded, genuinely pleased. “I was worried, I didn’t know what to put in and leave out. I’m afraid I’ve had no experience with this sort of thing, none at all. I’m sure there must be a great deal more you need to know.”\n I shook my head. “It sounds like a textbook case,” I said.\n “Really.” He nodded several times, quickly. “I looked it up in Statutes and Procedures, naturally, but the information was very sparse, very sparse indeed. Well, of course. Obviously, this sort of thing has to be left to the experts. Further detail would only encourage the ignorant to meddle.”\n I thought about Grandfather; two shovels and an axe, job done. But not quite, or else I wouldn’t be here. “Quite,” I said. “Now, you’re sure there were no other deaths within six months of the first attack.”\n “Quite sure,” he said, as though his life depended on it. “Nobody but poor Anthemius.”\n Nobody had asked me to sit down, let alone take my wet boots off. The hell with it. I sat down on the end of a bench. “You didn’t say what he died of.”\n “Exposure.” Brother Stauracius looked very sad. “He was caught out in a snowstorm and froze to death, poor man.”\n “Near here?”\n “Actually, no.” A slight frown, like a crack in a wall. “We found him about two miles from here, as it happens, on the big pasture between the mountains and the river. A long way from anywhere, so presumably he lost his way in the snow and wandered about aimlessly until the cold got to him.”\n I thought about that. “On his way back home, then.”\n “I suppose so, yes.”\n I needed a map. You almost always need a map, and there never is one. If ever I’m Emperor, I’ll have the entire country surveyed and mapped, and copies of each parish hung up in the temple vestries. “I don’t suppose it matters,” I lied. “You’ll take me to see the grave.”\n A faint glow of alarm in those watered-down eyes. “In the morning.”\n “Of course in the morning,” I said.\n He relaxed just a little. “You’ll stay here tonight, of course. I’m afraid the arrangements are a bit—”\n ”I was brought up on a farm,” I said.\n Unlike him. “That’s all right, then,” he said. “Now I suppose we should join our hosts. The evening meal is served rather early in these parts.”\n “Good,” I said.\n Sleeping under turf is like being in your grave. Of course, there’s rafters. That’s what you see when you look up, lying wide awake in the dark. Your eyes get the hang of it quite soon, diluting the black into gray into a palette of pale grays; you see rafters, not the underside of turf. And the smoke hardens it off, so it doesn’t crumble. You don’t get worms dropping on your face. But it’s unavoidable, no matter how long you do it, no matter how used you are to it. You lie there, and the thought crosses your mind as you stare at the underside of grass; is this what it’ll be like?\n The answer is, of course, no. First, the roof will be considerably lower; it’ll be the lid of a box, if you’re lucky enough to have one, or else no roof at all, just dirt chucked on your face. Second, you won’t be able to see it because you’ll be dead.\n But you can’t help wondering. For a start, there’s temperature. Turf is a wonderful insulator; keeps out the cold in winter and the heat in summer. What it doesn’t keep out is the damp. It occurs to you as you lie on your back there; so long as they bury me in a thick shirt, won’t have to worry about being cold, or too hot in summer, but the damp could be a problem. Gets into your bones. A man could catch his death.\n It’s while you’re lying there—everybody else is fast asleep; no imagination, no curiosity, or they’ve been working so hard all day they just sleep, no matter what—that you start hearing the noises. Actually, turf’s pretty quiet. Doesn’t creak like wood, gradually settling, and you don’t get drips from leaks. What you get is the thumping noises over your head. Clump, clump, clump, then a pause, then clump, clump, clump.\n They tell you, when you’re a kid and you ask, that it’s the sound of dead men riding the roof-tree. They tell you that dead men get up out of the ground, climb up on the roof, sit astride the peak and jiggle about, walloping their heels into the turf like a man kicking on a horse. You believe them; I never was quite sure whether they believed it themselves. When you’re older, of course, and you’ve left the farm and gone somewhere civilized, where it doesn’t happen, you finally figure it out; what you hear is sheep, hopping up onto the roof in the night, wandering about grazing the fine sweet grass that grows there, picking out the wild leeks, of which they’re particularly fond. Sheep, for crying out loud, not dead men at all. I guess they knew really, all along, and the stuff about dead men was to keep you indoors at night, keep you from wandering out under the stars (though why you should want to I couldn’t begin to imagine). Or at least, at some point, way back in the dim past, some smartarse with a particularly warped imagination made up the story about dead men, to scare his kids; and the kids believed, and never figured it was sheep, and they told their kids, and so on down the generations. Maybe you never figure it out unless you leave the farm, which nobody ever does, except me.\n As a matter of fact, I was just beginning to drift off into a doze when the thumping started. Clump, clump, clump; pause; clump, clump, clump. I was not amused. I was bone tired and I really wanted to get some sleep, and here were these fucking sheep walking about over my head. The hell with that, I thought, and got up.\n I opened the door as quietly as I could, not wanting to wake up the household, and I stood in the doorway for a little while, letting my eyes get used to the dark. Someone had left a stick leaning against the doorframe. I picked it up, on the off chance that there might be a sheep close enough to hit.\n Something was moving about again. I walked away from the house until I could see up top.\n It wasn’t sheep. It was a dead man.\n He was sitting astride the roof, his legs drooping down either side, like a farmer on his way back from market. His hands were on his hips and he was looking away to the east. He was just a dark shape against the sky, but there was something about the way he sat there; peaceful. I didn’t think he’d seen me, and I felt no great inclination to advertise my presence. If I say I wasn’t scared, I wouldn’t expect to be believed: but fear wasn’t uppermost in my mind. Mostly, I was interested.\n No idea how long I stood and he sat. It occurred to me that I was just assuming he was a dead man. Looked at logically, far more likely that he was alive, and had reasons of his own for climbing up on a roof in the middle of the night. Well; there’s a time and a place for logic.\n He turned his head, looking down the line of the roof-tree, and lifted his heels, and dug them into the turf three times; clump, clump, clump. (And at that point, I realized the flaw in my earlier rationalization. Three clumps; always three, ever since I was a kid. How many three-legged sheep do you see?) At that moment, the moon came out from behind the clouds, and suddenly we were looking at each other; me and him.\n My host had been right; he was purple, like a grape. Or a bruise; the whole body one enormous bruise. Swollen, he’d said; either that, or he was an enormous man, arms and legs twice as thick as normal. His eyes were white; no pupils.\n “Hello,” I said.\n He leaned forward just a little and cupped his hand behind his left ear. “You’ll have to speak up,” he said.\n Words from a dead man; a purple, swollen man sitting astride a roof. “Tell me,” I said, raising my voice. “Why do you do that?”\n He looked at me, or a little bit past me. I couldn’t tell if his mouth moved, but there was a deep, gurgling noise which could only have been laughter. “Do what?”\n “Ride on the roof like it’s a horse,” I said.\n His shoulders lifted; a slow, exaggerated shrug, like he didn’t know what a shrug was, but was copying one he’d seen many years ago. “I’m not sure,” he said. “I feel the urge to do it, so I do it.”\n Well, I thought. One of the great abiding mysteries of my childhood not quite cleared up. “Are you Anthemius?” I asked. “The schoolmaster?”\n Again the laugh. “That’s a very good question,” he said. “Tell you what,” he went on, “come up here and sit with me, so we can talk without yelling.”\n In the moonlight I could make out the huge hands, with their monstrous overripe fingers. How tight the skin would have to be, with all that pressure against it from the inside. Breaking a neck would be like snapping a pear off a tree.\n “Let me rephrase that,” I said. “Were you Anthemius? When you were—”\n ”Yes,” he said, speaking quickly to cut off a word he didn’t want to hear. “I think I was. Thank you,” he added. “I’ve been trying to remember. It’s been on the tip of my tongue, but somehow I can’t seem to think of any names.”\n The approved procedure for coping with the restless dead is, essentially, what Grandfather did; though of course we make rather more of a fuss about it. The approved procedure should, of course, be carried out in daylight; noon is recommended. Should you chance to encounter a specimen during the night, there are two courses of action, both recommended rather than approved. One, you draw your sword and cut its head off. Two, you challenge it to the riddle-game and keep it talking all night, until dawn comes up unexpectedly and strands it like a beached whale in the cruel light.\n Commentary on that. I am not a man of action. I don’t vault onto roofs, I don’t carry weapons. One of the reasons I left the farm in the first place was, I have trouble lifting even moderate loads. So much for option one; and as for option two—\n Also, I was curious. Interested.\n “What happened to you?” I said.\n “You know, I’m really not sure,” he replied; and the voice was starting to sound like a man’s voice, my ears were getting the hang of it, the way my eyes had got used to the dark. “I know I was out in the snow and I’d lost my way. I got terribly cold, so that every bit of me hurt. Then the pain started to ease up, and I sort of fell asleep.”\n “You died,” I said.\n He didn’t like me saying that, but I guess he forgave me. “I remember waking up,” he said, “and it was pitch dark and terribly quiet, and I couldn’t move. I was very scared. And then it occurred to me, I wasn’t breathing. I don’t mean I was holding my breath. I wasn’t breathing at all, and it didn’t matter. So then I knew.”\n I waited; but I hadn’t got all night. “And then?”\n He turned his head away. No hair, just a bulging purple scalp. A head like a plum. “I was terrified,” he said. “I mean, I had no way of knowing.” He paused, and I have no idea what was passing through his mind. “After a long time, I found I could move after all. I got my hands up against the lid, and I pushed, and I could feel the wood burst apart. That scared me even more, I thought the roof, I mean all the earth on top of me, I thought it’d cave in and bury me.” He paused again. “I was always frightened of tight places,” he said. “You know.”\n I nodded. Me too, as it happens.\n “I guess I panicked,” he went on, “because I kept pushing, and I somehow knew that I was incredibly strong, much stronger than I’d ever been before, so I thought, if I push hard enough. I wasn’t thinking straight, of course.”\n “And then?” I asked.\n “Pushed right up through the dirt and into the moonlight,” he said. “Amazing feeling. The first thing I wanted to do was run to the nearest farm and tell them, Look, I’m not dead after all.” He stopped; he’d said the word without thinking. “But then I thought about it; and I still wasn’t breathing, and I couldn’t actually feel anything. I could move my hands and feet, I could stand upright and balance, all that, but—you know when you’ve been sitting a long time and your feet go numb. It was like that, all over. It felt so strange.”\n “Go on,” I said.\n He didn’t, not for a long time. “I think I sat down,” he said. “I don’t know why I’d have done that, standing up didn’t make me tired or anything. I don’t feel tired, ever. But I was so confused, I didn’t know what I was supposed to do. It all felt wrong.” He lifted his heels slowly and let them drop; clump, clump, clump. “And while I was there the sun started to come up, and the light just sort of flooded into my head and bleached everything away, so I couldn’t think at all. I guess you could say I passed out. Anyway, when I opened my eyes I was back where I’d started from, lying in the dark.”\n I frowned. “How did you get back there?”\n “I just don’t know,” he said. “Still don’t. It always happens, that’s all I know. When the sun comes up, my mind washes away. If I’ve gone any distance, I know I have to get back. I run. I can run really fast. I know I’ve got to be back—home,” he said, with a sort of breaking-up laugh, “before the sun comes up. I’ve learned to be careful, to give myself plenty of time.”\n He was still and quiet for a while. I asked, “Why do you kill things?”\n “No idea.” He sounded distressed. “If something comes close enough, I grab it and twist it till it’s dead. Like a cat lashing out at a bit of string. Reflex. I just know it’s something I have to do.”\n I nodded. “Do you go looking—?”\n “Yes.” He mumbled the word, like a kid admitting a crime. “Yes, I do. I do my best to keep away from where there might be people. It’s all the same to me; sheep, foxes, men. I’d go a long way away, into the mountains, if I could. But I have to stay close, so I can get back in time.”\n I’d been debating with myself, and I knew I had to ask. “What were you?” I said. “What did you do?”\n He didn’t answer. I repeated the question.\n “Like you said,” he replied. “I was a schoolteacher.”\n “Before that.”\n When he answered, it was against his will. The words came out slow, flat; he spoke because he had to. “I was a Brother,” he said. “When I was thirty, they said I should apply to the Order, they thought I had the gift, and the brains, and the application and the self-discipline. I passed the exam and I was at the Studium for five years. Like you,” he added.\n I let that go. “You joined the Order.”\n “No.” The flat voice had gone; there was a flare of anger. “No, I failed matriculation. I retook it the next year, but I failed again. They sent me back to my parish, but by then they’d got someone else. So I ended up wandering about, looking for teaching work, letter-writing, anything I could do to earn a living. There’s not a lot you can do, of course.”\n Suddenly I felt bitter cold, right through. Took me a moment to realize it was fear. “So you came here,” I said, just to keep him talking.\n “Eventually. A lot of other places first, but here’s where I ended up.” He lifted his head abruptly. “They sent you here to deal with me, am I right?”\n I didn’t reply.\n “Of course they did,” he said. “Of course. I’m a nuisance, a pest, a menace to agriculture. You came here to dig me up and cut my head off.”\n This time, I was the one who had to speak against my will. “Yes.”\n “Of course,” he said. “But I can’t let you do that. It’s my—”\n He’d been about to say life. Presumably he tried to find another way of phrasing it, then gave up. We both knew what he meant.\n “You passed the exams, then,” he said.\n “Barely,” I replied. “Two hundred seventh out of two hundred twenty.”\n “Which is why you’re here.”\n His white eyes in the ash-white moonlight. “That’s right,” I said. “They don’t give out research posts if you come two hundred seventh.”\n He nodded gravely. “Commercial work,” he said.\n “When I can get it,” I replied. “Which isn’t often. Others far more qualified than me.”\n He grunted. It could have been sympathy. “Public service work.”\n “Afraid so,” I replied.\n “Which is why you’re here.” He lifted his head and rolled it round on his shoulders, like someone waking up after sleeping in a chair. “Because—well, because you aren’t much good. Well?”\n I resented that, even though it was true. “It’s not that I’m not good,” I said. “It’s just that everyone in my year was better than me.”\n “Of course.” He leaned forward, his hands braced on his knees. “The question is,” he said, “do I still have the gift, after what happened to me. If I’ve still got it, your job is going to be difficult.”\n “If not,” I said.\n “Well,” he replied, “I suppose we’re about to find out.”\n “Indeed,” I said. “There could be a paper for the journals in this.”\n “Your chance to escape from obscurity,” he said solemnly. “Under different circumstances, I’d wish you well. Unfortunately, I really don’t want you cutting off my head. It’s a miserable existence, but—”\n I could see his point. His voice was quite human now; if I’d known him before, I’d have recognized him. He had his back to the moon, so I couldn’t see the features of his face.\n “What I’m trying to say is, you don’t have to do it,” he said. “Go away. Go home. Nobody knows you came out here tonight. I promise I’ll stay away until you’ve gone. If I don’t show up, you can report that there was no direct evidence of an infestation, and therefore you didn’t feel justified in desecrating what was probably an innocent grave.”\n “But you’ll be back,” I said.\n “Yes, and no doubt they’ll send someone else,” he said. “But it won’t be you.”\n I was tempted. Of course I was tempted. For one thing, he was a rational creature; with my eyes shut, if I hadn’t known better, I’d have said he was a natural man with a heavy cold. And what if the gift did survive death? He’d kill me. I had to admit it to myself; the thought that I could get killed doing this job hadn’t occurred to me. I’d anticipated a quick, grisly hour’s work in broad daylight; no risk.\n I’m not a coward, but I appreciate the value of fear, the way I appreciate the value of money. I’m most definitely not brave.\n I saw something in the moonlight, and said (trying not to talk quickly or raise my voice); “I could go back to bed, and then come back in the morning and dig you up.”\n “You could,” he said.\n “You don’t think I would.”\n “Not if we’d made an agreement.”\n “You could be right,” I said. “But what about the farmers? You’ve got to admit—”\n At which moment, the Brother (who’d come out of the back door, crawled up on the roof behind him and edged down the roof-tree towards him until he was close enough to reach his neck with the axe he’d brought with him) raised his arms high and swung. No sound at all; but at the last moment, the dead man leaned his head to one side, just enough, and the axe blade swept past, cutting air. I heard the Brother grunt, shocked and panicky; I saw the dead man—eyes still fixed on me—reach behind him with his left hand and catch the swinging axe just below the head, and hold it perfectly still. The Brother gasped, but didn’t let go; he was pulling with all his strength, like a little dog tugging on a belt. All his efforts couldn’t move the dead man’s arm the thickness of a fingernail.\n “Now,” the dead man said. “Let’s see.”\n The delay on my part was unforgivable, completely unprofessional. I knew I had to do something, but my mind had gone completely blank. I couldn’t remember any procedures, let alone any words. Think, a tiny voice was yelling inside me head, but I couldn’t. I heard the Brother whimper, as he applied every scrap of strength in a tendon-ripping, joint-tearing last desperate jerk on the axe handle that had no effect whatsoever. The dead man was looking straight at me. His lips began to move.\n Pro nobis peccatoribus; not the obvious choice, not even on the same page of the book, but it was the only procedure I could think of. Unfortunately, it’s one I’ve always had real difficulties with. You reach out with your hand that is not a hand, extend the fingers that aren’t fingers; I’m all right as far as that, and then I tend to come unstuck.\n (What I was thinking was: So he failed the exam, and I passed. Yes, but maybe the reason he failed was, he didn’t read the questions through properly, or he spent so long on Part 1 that he didn’t leave himself enough time for two and three. Maybe he’s really good, just unlucky in exams.)\n I was mumbling; Sol invicte, ora pro nobis peccatoribus in die periculi. Of course, there’s a school of thought that says the magic words have no real effect whatsoever, they’re just a way of concentrating the mind. I tend to agree. Why should an archaic prayer in a dead language to a god nobody’s believed in for six hundred years have any effect on anything at all? Ora pro nobis peccatoribus, I repeated urgently, nobis peccatoribus in die periculi.\n It worked, It can’t have been the words, of course, but it felt like it was the words. I was in, I was through. I was inside his head.\n There was nothing there.\n Believe me, it’s true. Nothing at all; like walking into a house where someone’s died, and the family have been in and cleared out all the furniture. Nothing there, because I was inside the head of a dead man; albeit a dead man who was looking at me reproachfully out of blank white eyes while holding an axe absolutely still.\n Fine; all the easier, if it’s empty. I looked for the controls. You have to visualize them, of course. I see them as the handwheels of a lathe. It’s because I had a holiday job in a foundry in Second Year. I don’t know how to use a lathe. What I mostly did was sweep up piles of swarf off the floor.\n Here is the handwheel that controls the arms. I reached out with the hand that is not a hand, grabbed it and tried to turn it. Stuck. I tried harder. Stuck. I tried really hard, and the bloody thing came away in my hand.\n It’s not supposed to do that.\n I re-visualized. I saw the controls as the reins of a cart, the footbrake under my boot that was not a boot. I stamped on the brake and hauled back hard on the reins.\n I haven’t got round to writing that paper for the journals, so here it is for the first time anywhere. The gift does not survive death. Nothing survives. The room was empty. And the handwheel only broke off because I’m clumsy and cack-handed, the sort of person who trips over cats and breaks the nibs of pens by pressing too hard.\n I heard the Brother gasp, as he jerked the axe out of the dead man’s grip. The dead man didn’t move. His eyes were still fixed on mine, right up to the moment when the axe shore through his neck and his head wobbled and fell, bounced off his knee and tumbled off the roof into the short grass below. The body didn’t move.\n I know why. It took ten of us, with an improvised crane made of twelve-foot three-inch fir poles, to get the body down off the roof. It must’ve weighed half a ton. The head alone was two hundredweight. Two men couldn’t lift it; they had to use levers to roll it along the ground. There was no blood, but the neck started to ooze a milky white juice that smelt worse than anything you could possibly imagine.\n We burned the body. We drenched it in pine-pitch, and it caught quite easily and burnt down to nothing; not even any recognizable bits of bone. The white juice flared up like oil. They rolled the head over to the slurry-pond and pitched it in. It went down with a gurgle and a burp.\n “I heard you talking to it,” the Brother told me. For some reason, the word it offended me. “I guessed you were using a variation on the riddle game, to keep it distracted till the sun came up.”\n “Something like that,” I said.\n He nodded. “I shouldn’t have interfered, I’m sorry,” he said. “You had the situation under control, and I could have ruined everything.”\n “That’s all right,” I said.\n He smiled; as if to say, it wasn’t all right, but thanks for forgiving me. “I guess I panicked,” he said. Then he frowned. “No, I didn’t. I saw a chance of getting in on the act. It was stupid and selfish of me. You’ll have to write to the prebendary.”\n “I don’t see why,” I said mildly. “The way I see it, your actions were open to several different interpretations. I choose to interpret them as courage and resourcefulness. I could put that in a letter, if you like.”\n “Would you?” In his face, I saw all the desperation and cruelty of sudden, unexpected hope. “I mean, seriously?”\n “Of course,” I said.\n “That’d be—” He stopped. He couldn’t think of a big enough word. “You’ve got no idea what it’s like,” he said; all in a rush, like diarrhea. “Being stuck here, in this miserable place with these appalling people. If I can’t get back to a town, I swear I’ll go mad. And it’s so cold in winter. I hate the cold.”\n You can sleep in the coach, Father Prior said, when I tried to make a fuss about the timetable. I didn’t say to him; have you ever been on a provincial mailcoach, on country roads, at this time of year? A dead man couldn’t sleep on a mailcoach.\n I slept, nearly all the way; on account, I guess, of not having had much sleep the night before. Woke up just as we were crossing the Fulvens bridge; I looked out of the window, and all I could see was water, moonlight reflected on water. Couldn’t get back to sleep after that. Too dark to read the case notes, which I’d neglected to do back at the farm. But I remembered the basic facts from the briefing. These jobs are all the same, anyhow. Piece of cake.\n The coach threw me out just after dawn, at a crossroads in the middle of nowhere. Somewhere up on the moors; I’m a valley boy myself. We had cousins up on the moor. I hated it when they came to visit. The old man was deaf as a post, and the three boys (mid to late thirties, but they were always the boys) just sat there, not saying a word. The mother died young, and I can’t say I blame her.\n They were supposed to be meeting the coach, but there was no one there. I stood for a while, then I sat on my bag, then I sat on the ground, which was damp. I heard an owl, and a fox, or at least I hope it was a fox. If not, it was something we never got around to covering in Third Year, and I’m very glad I didn’t see it.\n They arrived eventually, in a little dog-cart thing; an old man driving, a younger man and the Brother. One small pony, furry like a bear.\n The Brother did the talking, for which I was quite grateful. He was one of the better sort of country Brothers; short man, somewhere between fifty and sixty, a distinct burr to his voice but he spoke clearly and used proper words. The boy was the younger man’s son, the older man’s grandson. He’d been fooling about in a big oak tree, slipped, fell; broken arm and a hideous bash on the head. He hadn’t come round, and it had been a week now. They had to prise his mouth open with the back of a horn spoon to get food and water in; he swallowed all right, but that was all he did. You could stick a needle in his foot half an inch and he wouldn’t even twitch. The swelling on the back of his head had gone down—the Brother disclaimed any medical knowledge, but he was lying—and they’d set the arm and splinted it, for what that was worth.\n I thought; better than killing the restless dead. One of my best subjects at the Studium, though of course we did all our practicals on conscious minds, with a Father sitting a few feet away, watching like a hawk. I’d done one about eighteen months earlier, and it went off just fine; in, found her, straight out again. She followed me like a dog. I’d been relieved when Father Prior told me; it could’ve been something awkward and fiddly, like auspices, or horrible and scary, like a possession. Just in case, I’d brought the book. I’d meant to mug up the relevant chapter, either at the farm or on the coach, but I hadn’t got round to it. Anyway, it had to be better than that empty place.\n It was quite a big house, for a hill-farm; sitting in the well of a valley, with a dense copper-beech hedge on all four sides, as a windbrake. Just the five of them in the house, the Brother said; grandfather, father, mother, the boy and a hired man who slept in the hayloft. The boy was nine years old. The Brother told me his name, but I’m hopeless with names.\n They asked me, did I want to rest after the journey; wash and brush up, something to eat? The correct answer was, of course, No, so I gave it.\n “He’s in here,” the Brother said.\n Big for a hill-farm, but still oppressively small. Downstairs, the big kitchen, with a huge table, fireplace, two hams swinging like dead men on gibbets. A parlor, tiny and dusty and cold. Dairy, scullery, store; doorway through to the cowstalls. Upstairs, one big room and a sort of oversized cupboard, where the boy was. I could just about kneel beside the bed, if I didn’t mind the window-sill digging in the small of my back.\n The hell with that, I thought; I’m a qualified man, a professional, a Father; a wizard. I shouldn’t have to work in conditions you wouldn’t keep pigs in. “Take him downstairs,” I said. “Put him on the kitchen table.”\n They had a job. The stairs in that house were like a bell-tower, tightly coiled and cramped. Father and grandfather did the heavy lifting, while I watched. It’s an odd thing about me. Sometimes, the more compassion is called for, the less capable I am of feeling it. I offer no explanation or excuse.\n “He shouldn’t have been moved,” the Brother hissed in my ear, just loud enough so that everyone could hear. “In his condition—”\n ”Yes, thank you,” I said, in my best arrogant-city-bastard voice. I couldn’t say why I was behaving like this. Sometimes I do. “Now, if you’ll all stay well back, I’ll see what I can do.”\n I looked at the boy, and I could remember the theory perfectly, every last detail, every last lecture note. His eyes were closed; he had a stupid face, fat girly lips, fat cheeks. If he lived, he’d grow up tall, solid, double-chinned, gormless; the son of the farm. Pork fat and home-brewed beer; he’d be spherical by the time he was forty, strong enough to wrestle a bullock to its knees, slow and tireless, infuriatingly calm, a man of few words; respected at market, shrewd and fat, his bald patch hidden under a hat that would never come off, probably not even in bed. A solid, productive life, which it was my duty to save. Lucky me.\n Theory; theory is your lifeline, they used to tell me, your driftwood in a shipwreck. I reminded myself of the basic propositions.\n To recover a lost mind, first make an entrance. This is usually done by visualizing yourself as a penetrating object; a drill bit, a woodpecker’s beak, a maggot. The drill bit works for me, though for some reason I tend to be a carpenter’s auger, wound in with a brace. I go in through the spiral flakes of waste bone thrown clear by the wide grooves of the cutter. I assume it’s from some childhood memory, watching Granddad at work in the barn. You’re not really supposed to use personal memories, but it’s easier, for someone with my limited imagination.\n Once you’re in; first ward, immediately, because you never know what might be waiting for you in there. I raised first ward as soon as I felt myself go through. I use scutum fidei, visualize a shield. Mine’s round, with a hole in it at twelve o’clock so I can see what’s going on.\n I peered through the hole. No nasty creatures with dripping fangs crouched to pounce, which was nice. Count to ten and lower the shield slowly.\n I looked around. This is the crucial bit, and you mustn’t rush. How long it takes depends on the strength of your gift, so naturally I take ages. The light gradually increases. First things first; get your bearings. Orientate yourself, taking special care to get a fix on the point you came in by. Well, obviously. If you lose your entry-point, you’re stuck; in someone else’s head forever. You really don’t want that.\n I lined up on the corners of a ceiling, drawing diagonal lines and fixing on their point of origin, measuring the angles with my imaginary protractor (it’s brass, with numbers in gothic-italic) One-oh-five, seventy-five; repeat the numbers four times out loud, to make sure they’re loaded into memory. Fine. Now I know where I am and how to get out again. One-oh-five, seventy-five. Now, then. Let the dog see the rabbit.\n I was in a room. It’s nearly always an interior; with kids, practically guaranteed it’s their bedroom, or the room they sleep in, depending on social class and domestic arrangements. In all relevant essentials, it was the room upstairs I had him carried down from. Excellent; nice and small, not many places to hide anything. So much easier when you’re dealing with a subject of limited intelligence.\n I visualized a body for myself. I tend not to be me. With children, it’s usually best to be a nice lady; the kid’s mother, if possible. I’m not good enough to do specific people, and I have real problems being women. So I was a nice old man instead.\n Hello, I said. Where are you?\n Don’t worry if they don’t answer. Sometimes, they do, sometimes they don’t. I walked round the bed, knelt down, looked under it. There was a cupboard; one of those triangular jobs, wedged in a corner. I opened that. For some reason, it was full of the skins and bones of dead animals. None of my business; I closed it. I pulled the covers off the bed, and lifted the pillow.\n Odd, I thought, and touched base with theory. The boy must still be alive, or else there would be no room. If he’s alive, he must be in here somewhere. He can’t be invisible, not inside his own head. He can, of course, be anything he likes, so long as it’s animate and alive. A cockroach, for example, or a flea. I sighed. I get all the rotten jobs.\n I adjusted the scale, making the room five times bigger. Go up in easy stages. If he was being a cockroach, he’d now be a rat-sized cockroach. If he was being a rat, of course, he’d be cat-sized and capable of giving me a nasty bite. I used lorica, just in case. I looked under the bed again.\n I visualized a clock, in the middle of the wall opposite the door. It told me I’d been inside for ten minutes. The recommended maximum is thirty. Really first-rate practitioners have been known to stay in for an hour and still come out more or less in one piece; that’s material for a leading article in the journals. I searched again, this time paying more attention to the contents of the cupboard. Dried, desiccated animal skins; squirrels, rabbits, rats. No fleas, mites or ticks. So much for that theory.\n I visualized a glass jug, to represent my energy level. You can use yourself up surprisingly quickly and not know it. Just as well I did. My jug was a third empty. You want to save at least a fifth just to get out again. I visualized calibrations, so as to be sure.\n Quick think. The recommended course of action would be to visualize a tracking agent (spaniel, terrier, ferret) but that takes a fair chunk of your resources; also, it burns energy while it’s in use, and getting rid of it takes energy, too. I drew a distinct red line on my measuring-jug, and a blue line just above it. The alternative to a tracker is to increase the scale still further; twenty times, say, in which case your cockroach will be a wolf-sized monster that could jump you and bite your head off. I was still running lorica, but any effective ward burns energy. If I found myself with a fight on my hands, I could dip below that essential red line in a fraction of a second. No, the hell with that.\n I visualized a terrier. I’m not a dog person, so my terrier was a bit odd; very short, stumpy legs and a rectangular head. Still, it went at it with great enthusiasm, wagging its imaginary tail and making little yapping noises. All round the room, nose into everything. Then it sat on the floor and looked at me, as if to say, Well?\n Not looking good. My jug was half empty, I’d used up my repertoire of approved techniques, and found nothing. Just my luck to get a special case, a real collector’s item. Senior research fellows would be fighting each other for the chance of a go at this one, but I just wanted to get the job done and clear out. Wasted on me, you might say.\n I vanished the dog. Quick think. There had to be something else I could try, but nothing occurred to me. Didn’t make sense; he had to be in here somewhere, or there’d be no room. He couldn’t be invisible. He could only turn himself into something he could imagine—and it had to be real; no fantasy creatures the size of a pin-head. At five times magnification, a red mite would be plainly visible; also, the dog would’ve found it. Tracking agents, even inferior ones visualized by me, smell life. If he was in here, the dog would’ve found him.\n So—\n As required by procedure, I considered abandoning the attempt and getting out. This would, of course, mean the boy would die; you can’t go back in twice, that’s an absolute. I’d be within my rights, faced with an enigma on this scale. The failure would be noted on my record, of course, but there’d be an annotation, no blame attaches, and it wouldn’t be the first time, not by a long way. The kid would die; not my problem. I’d have done my best, and that’s all you have to do.\n Or I could think of something. Such as what?\n They tell you; be wise, don’t improvise. If in doubt, get out. Making stuff up as you go along is mightily frowned on, in much the same way as you’re not encouraged to fry eggs in a fireworks factory. There’s no knowing what you might invent, and outside controlled conditions, invention could lead to the Cartographic Commission having to redraw the maps for a whole county. Or you could make a hole in a wall, which is the worst thing anybody can do. At the very least, I’d be sure to end up in front of a Board, facing charges of unauthorized innovation and divergence. Saving the life of some farm kid would be an excuse, but not a very good one.\n I could think of something. Such as—\n There’s no such thing as magic. Instead, there’s the science we don’t properly understand, not yet. There are effects that work, and we have no idea why. One of these is spes aeternitatis, a wretchedly inconsistent, entirely inexplicable conjuring trick that no self-respecting Father would condescend to use. That’s because they can’t get it to work reliably.\n I can.\n Spes aeternitatis is an appearances-adjuster. You can use it to find hidden objects, or translate lies, or tell if a slice of cake or a glass of wine’s got poison in it. I do it by visualizing everything that’s wrong in light blue. It’s a tiny little scrap of talent that I’ve got and practically everybody else hasn’t; it’s like being double-jointed, or wiggling your nostrils like a rabbit.\n I closed my eyes and opened them again, and saw a light blue room. Everything light blue. Everything false.\n Oh, I thought; then, one-oh-five, seventy five, and I started lining up diagonals for my escape. But that wasn’t to be, unfortunately. The room blurred and reappeared, and it was all different. It was my room; the room I slept in until I was fifteen years old.\n He was sitting on the end of the bed; a slight man, almost completely bald, with a small nose and a soft chin, small hands, short, thin legs. I’d put him at about fifty years old. His skin was purple, like a grape.\n “You were wrong,” he said, looking up at me. “The talent survives death.”\n “That’s interesting,” I said. “How did you get in here?”\n He smiled. “You practically invited me in,” he said. “When I heard that fool behind me, with the axe, I looked at you. You felt sorry for me. You thought; is he not a man and a Brother, or words to that effect. I used Stilicho’s transport, and here I am.”\n I nodded. “I should’ve put up wards.”\n “You should. Careless. Attention to detail isn’t your strongest suit.”\n “The boy,” I said.\n He shrugged. “In there somewhere, I dare say. But we aren’t in his head, we’re in yours. I’ve made myself at home, as you can see.”\n I looked round quickly. The apple-box with the bottom knocked out, where I used to keep my books; it was where it should be, but the books were different. They were new and beautifully bound in tooled calf, and the alphabet their titles were written in was strange to me.\n “My memories,” I said.\n He waved his hand. “Well rid of them,” he said. “Misery and failure, a life wasted, a talent dissipated. You’ll be better off.”\n I nodded. “With yours.”\n “Quite. Oh, they’re not pleasant reading,” he said, with a scowl. “Bitter, angry; memories of bigotry and spite, relentless bad luck, a life of constant setbacks and reverses, a talent misunderstood. You’ll see that I failed the exam the second time because, sitting there in Great School, I suddenly hit on a much better way of achieving unam sanctam; quicker, safer, ruthlessly efficient. I tried it out as soon as the exam was over, and it worked. But I got no marks, so they failed me. I ask you, where’s the sense in that?”\n “You failed the retake,” I said. “What about the first time?”\n He laughed. “I had the flu,” he said. “I was practically delirious, could barely remember my name. Would they listen? No. Rules. You see what I mean. Bad luck and spite at every turn.”\n I nodded. “What happens to me?”\n He looked at me. “You’ll be better off,” he repeated.\n “I’ll stop existing. I’ll be dead.”\n “Not physically,” he said mildly. “Your body, my mind. Your fully qualified licensed-practitioner’s body, and a mind that saw how to improve unam sanctam in a half-second flash of intuition.”\n It says a lot about my self-esteem that I actually considered it, though not for very long. Half a second, maybe. “What happens now?” I asked. “Do we fight, or—?”\n He shrugged.”If you like,” he said, and extended his arm. It was ten feet long, thick as a gatepost. He gripped my throat like a man holding a mouse, and crushed me.\n I guess I was about seventy percent dead when I remembered; I know what to do. I drew a rather shaky second ward; he closed his fingers on thin air, and I was standing behind him.\n He swung round, roaring like a bull. He had bull’s horns sticking out of his forehead. I tried second ward again, but he got there before I did, grabbed my head and smashed my face into the wall.\n Just in time, I remembered; there is no pain. I used Small Mercies, softening the wall into felt, and slipped through his fingers. I was smoke. I hung above him in a cloud. He laughed, and fetched me back with vis mentis. The back of my head hit the floor, which gave way like a mattress. I became a spear, and buried myself in his chest. He used second ward and was the other side of the room.\n “You fight like a first-year,” he said.\n Which was true. I clenched my mind like a fist; the walls closed in on him, squashing him like a spider under a boot. I felt him, like a nail right through the sole. Back to first ward, and we stood glowering at each other, in opposite corners of the room.\n “You can’t beat me,” he said. “I’ll wear you down and you’ll simply fade away. Face it, what the hell have you got to live for?”\n Valid point. “All right, then,” I said.\n His eyes opened wide. “I win?”\n “You win,” I said.\n He was pleased; very pleased. He grinned at me and raised his hand, just as I got my fingers round the handle of the door and twisted as hard as I could.\n He saw that and opened his mouth to scream. But the door flew open, knocking me back. I closed my eyes. The door was, of course, the intersection of two lines drawn diagonally across the room, at 105 and 75 degrees precisely.\n I opened my eyes. He’d gone. I was in the boy’s room, the room upstairs. The boy was sitting on the floor, legs crossed, hands under his chin. He looked up at me.\n “Well, come on,” I snapped at him. “I haven’t got all day.”\n They were pathetically grateful. Mother in floods of tears, father clinging to my arm, how can we ever thank you, it’s a miracle, you’re a miracle-worker. I wasn’t in the mood. The boy, lying on the kitchen table under a pile of blankets, looked up at me and frowned, as though something about me wasn’t quite right. A quiet, analytical stare; it bothered the hell out of me. I refused food and drink and made father get out the pony and trap and take me out to the crossroads. But the mail won’t be arriving for six hours, he objected; it’s cold and dark, you’ll catch your death.\n I didn’t feel cold.\n At the crossroads, huddling under the smelly old hat father insisted on giving me, I tried to search my mind, to see if he’d really gone. There was, of course, no way he could have survived. I’d opened the door (Rule One; never open the door) and he’d been sucked out of my head out into the open, where there was no talented mind to receive him. Even if he was as strong as he’d claimed to be, there was no way he could have lasted more than three seconds before he broke up and dissipated into the air. There was absolutely nothing he could have done, no way he could have survived.\n The coach arrived. I got on it, and slept all the way. At the inn, I got a lamp and a mirror, and examined myself all over. Just when I thought I was all clear, I found a patch of purple skin, about the size of a crab apple, on the calf of my left leg. I told myself it was just a bruise.\n (That was a year ago. It’s still there.)\n The rest of the round was just straightforward stuff; a possession, a small rift, a couple of incursions, which I sealed with a strong closure and duly reported when I got back. Since then, I’ve volunteered for a screening, been to see a couple of counselors, bought a pair of full-length mirrors. And I’ve been promoted; field officer, superior grade. They’re quite pleased with me, and no wonder. I seem to be getting better at the job all the time. And I’m writing a paper, would you believe; modifications to unam sanctam. Quicker, safer, much more efficient. So blindingly obvious, I’m surprised no one’s ever thought of it before.\n Father Prior is surprised but pleased. I don’t know what’s got into you, he said.\n Originally published in Swords & Dark Magic: The New Sword and Sorcery,edited by Jonathan Strahan and Lou Anders.\n One of the most inventive and imaginative writers working in fantasy today, K.J. Parker is the author of the best-selling Engineer trilogy (Devices and Desires, Evil for Evil, The Escapement) as well as the previous Fencer (The Colours in the Steel, The Belly of the Bow, The Proof House) and Scavenger (Shadow, Pattern, Memory) trilogies. His short fiction has been collected in Academic Exercises, and he has twice won the World Fantasy Award for Best Novella, for \"Let Maps to Others\" and \"A Small Price to Pay for Birdsong.\" His other novels include Sharps, The Company, The Folding Knife, The Hammer, Savages, and The Two of Swords. His most recent novels are The Devil You Know and Downfall of the Gods. K.J. Parker also writes under his real name, Tom Holt. As Holt, he has published Expecting Someone Taller, Who's Afraid of Beowulf, Ye Gods!, and many other novels."}