{"fingerprint": "tR6uKPngo3BM+/kpky7SFNWJuJw=", "sitename": "Clarkesworld Magazine", "title": "It Was Educational by J.B. Park", "author": "J B Park", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/park_08_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: It Was Educational by J.B. Park", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2280 words, short story\nIt Was Educational\nStudent A is quite eager to see me. It’s good to see a reporter actually care, he tells me. His grip is hard and he has the kind of face composed by men who have no idea what normal human beings look like.\nWe make our way to the university. Student A is accompanied by Student B and in the middle between them is Civilian C, who is similarly pretty in that cobbled together way.\nGwangju is no cheery place. Figures are seen here and there doing things to simulate normalcy, it’s like the calm before a storm, with all the anticipatory jangle of nerves, their frayed ends stirring. Through the dim windows I see the occasional sign of movement, maybe a flash of white as some student lifts up a banner he has made. The signs are many yet the messages are uniform—death to Chun Doo Hwan, that sort of a thing.\nWe arrive at the university and Student B begs for permission to go do whatever he has to do; he’s not too specific. On the grass I see a group of students filling up empty glass bottles with gasoline. Civilian C has disappeared. Student A apologizes, and leaves to find him.\nI hear loose bits of conversation, murmurs, the odd proclamation. The talk is stuff I’ve heard before in many other pre-war settings. The flavor is different, the languages vary, yet the tone always stays the same.\nInstead of opting for a speed-forward I choose to stay the night in simtime. Call it laziness. I get a cheap room and there’s a bottle of soju and a bowl of peanuts on the table. The TV is large, the bed is impossibly soft. The window faces the city and the night cloaks it under a muffled sort of darkness, dimming the lights, closing the eyes.\nI drink the booze and eat the peanuts and soon there’s a knock on the door. Dinner is served—a bowl of white rice, some danmuji, a bowl of clear beef broth with a speck here and there of meat floating in it. A single semi-translucent chunk of radish sits heavily in the middle. The server is quiet and I wait for him to leave before I start eating. Eating in virtual is always a little strange for me, despite the nutritionally absent luxury of it, or perhaps because of it—instinct informs you that you are not actually eating despite the texture of the food in your mouth, like the grains of rice, the spoonful of broth, or the unpleasant softness of boiled radish. No sound other than the slight noise of metal chopsticks rubbing against one another. I finish everything; I tell myself I am fed.\nI lie down on the bed. I turn the TV on and nothing appears on screen. I file a complaint about this lack of authenticity while noting that the attention to detail in some other aspects of my stay—the disappointing meal, so true to history—may perhaps benefit from a studious lack of attention. The meal didn’t need to be so poor.\nSleep is perhaps the best part. You close your eyes, and when you open them it is morning. The transition is instantaneous. There are no dreams.\nI eat breakfast to the sound of gunfire. It’s begun, I think. I check to see if my admin privileges have been activated; yes, over the “night” I spent sleeping. At least that’s one thing still working. It’s a pain sometimes to wait for my credentials to go through.\nThe TV is working now. Two people are dead—police officers. Their bodies are carried behind the lines of their still-alive comrades. Some unidentifiable number of civilians line the street with their bodies. A bus burns nearby, and as the mob disperses into the various buildings and alleyways, teargas canisters dog their steps and obscure their fleeing forms.\nOne of the dead is a real human being and he has filed a review of his death. It was fast and I had time to watch as my stomach pumped out blood onto the ground. Glub glub, he had noted, jotting down the onomatopoeia. Head trauma didn’t feel real when I got clubbed. Felt more of a clobbering just getting up this morning.\nI shift back in and the footage on TV is now of the army rolling into the city. I look out the window and there are plumes of smoke dissipating above the roofs of the buildings.\nThere is a bit of compression; eight days are folded into one, because no one has the patience to wait out the slaughter over the standard period of violence.\nNow in recorded history there was steady escalation then decompression, set over the course of many days; even in the heaviest fits of fighting some normalcy had remained. Pockets of them, of people holed up waiting for the storm to pass.\nHowever that was boring and thus the tourism board had deemed it fit to retool the attraction into an excitement-friendly version of events, where everything was supposedly more fun. This was what I was here to inspect.\nThe soldiers had been given a sleek new design, their uniforms patterned after the robot troopers of a recent sci-fi hit, all of them decked out in gleaming black metal. And as I watch, a troop of these soldiers march toward the first of the barricades, made of overturned cars and garbage and broken remains of furniture. Someone at the top of the barricade yells, they’re coming, they’re coming! Immediately a few molotovs sail over the barricade, aimed right at the progress of the troopers. They in turn raise their shields and pull out their handguns. The molotovs keep coming and at one point the soldiers march through a roaring mass of flames, the collective accumulation of dozens of bottles that had smashed and exploded. Their boots crunch on shattered glass as they reach the barricade, drop their shields, and begin to climb. I tab one—a construct—but the one next to it is yet another human and I monitor her heart-rate (acceptably brisk) and other such vitals before focusing on the action again. The first of the soldiers had scaled the barricade only to be knocked back by a student wielding an iron pipe. He reaches out with his left hand and barely stops himself from falling; with the right, still holding a gun, he aims at the student’s face and fires. The head disintegrates.\nThe students retreat, as the soldiers continue to give chase, firing as they run after their targets. They’re not all that accurate, but it’s enough to fell more than a few of those fleeing. I spot Student A among those who still live; they reach the gate, but find it shut. Ah, I think, drama.\n“Open up!” Student A yells. Others add their voices. But the gate doesn’t open, although those students manning the walls (which has grown in size since the night before, resembling some medieval fortification now—I make a note that creative liberties are fine and all, but they should be less obtrusive) fire on the soldiers closing in with rifles of their own, long stubby things that spit out bullets with furious speed. About half the troops reach the gate still, and there, after a brief melee, what’s left are the bodies of kids like split watermelons. But the soldiers have been diminished even further by that point: those manning the walls have been firing away for quite some time. What’s left of the soldiers run for it, and in the end about ten reach the safety of the barricade.\nI check the rating again: “Supervision required for ages eight and below.” I note that they should consider raising this now.\nMeanwhile hundreds of taxi cabs and buses try to get into the city, hoping to join in on what they still think of as a protest. There’s a stoppage somewhere up the road and the drivers are honking and the general temper is volatile. Then the ground begins to rumble, a vibratory approach that they all feel; some climb to the top of their vehicles to see what’s coming.\nThe tanks are coming. The cars have nowhere to go, backed up as they are on the road. From somewhere and nowhere, thunderous music, very cinematic, begins playing. The comic fury of it all, the sheer absurdity of it—the drivers scurry away like insects as their cars are crushed. The machine-guns attached to the tanks open fire and those still fleeing are gunned down as they run. The bullets whack into them with such force that for a brief moment before they burst they are lifted into the air.\nNote: while educational, I do not know if it’ll capture the attention of the audience in the same way that, say, Cambodia did last year.\nBy that night the death toll has climbed to a few hundred, as the news reports that a dozen protesters were unfortunately subdued. The reporter is a suitably ugly thing, realistically so. Curious, I check to see if it’s piloted, and the reporter on screen right now is a real human being following a script for his or her own thrill, whatever it might be.\nI drink. The soju tastes like lemons. The bodies blend together in my mind. Red on red, though the setting shifts and shifts. No amount of professional detachment or amusement can truly get rid of the discomfort, as farcical as some of it had become.\nThere’s a knock on the door.\nI put down my cup. The knocks follow one another and it’s a steady, insistent rap.\nWhen I open the door, there’s a young man leaning against the wall. I can smell the smoke on him, smoke and blood. His face is perfectly symmetrical. He reminds me of Student A, though it’s worse here, because the result is actually beautiful. And the whole thing, the scene, it’s all so silly that it hurts, and I feel a sudden urge to delete this thing out of existence.\n“Help,” he says. “They’re chasing me.”\nI help him in; I close the door behind him. I must assess this new development. My movements may as well be robotic for all their stiffness. He crashes into the couch, bounces off, hits the floor. Leaks blood everywhere, blood and a clear liquid that I assume must be urine, though it smells more like gasoline from where I stand. Who’d want to smell real piss, after all? I note that perhaps it could be odorless, as the visual would provide enough cues on its own, so long as they give it a yellow tinge.\n“Stay right there,” I tell him. I go to the kitchen and search for . . . alcohol? In the fridge I find nothing but a jar of denjaang. I open it and the smell of salt and fermentation whiffs out. I get him to lie down straight and I cut through the mess of wadded clothing and drying filth with the knife I suddenly find in my hand. The bullet has entered his side and his breaths come fast and shallow.\n“Thank you,” he whispers. I ignore him and wonder if I should pull off a surgery here, extract whatever remains of the shell with the knife. I get out a lighter and heat the blade until it turns red. Somewhere, music starts playing. I recognize strains of Dvorak mixed in with some mournful pop. The voice is pitched just a bit too high to be perfect, the only concession made to the human discomfort with actual perfection. It’s awful.\nThe knife hisses as it touches skin and meat. It parts with ease. I dig into the flesh. He groans, and his perfect abs glisten under the sterile white lighting. I dig out a fragment of a bullet; when I extract three more, a little trumpet toots a three-note triumph.\n“Thank you,” he whispers again. I say nothing as I smear denjaang on the open wound, thinking that it would work like a disinfectant of sorts—why else would it have been there, after all?\nThen I pop into admin to see just what’s under the hood. The young man is a construct, of course, and by digging out the bullets successfully I’d earned a small medal. Once I’m out I could get a real-life replica of it printed in gold, or at least something with the sheen of gold. I materialize it, amused: there’s a crude picture on it of two human-like figures, one lying on the ground while the other tends to the first. On the back is a date—5.18.80, like the numbers would mean anything to anyone here.\nI peek at the script. Somewhere in the middle of the night there will be another encounter. He’ll groan a bit too loudly and I’ll be forced to wake up. There I will bend down, and he will reach up and caress my face, his one last act before dying. A truly human moment. Very affecting.\nAs I pour myself more soju, I look back at the student dying on the floor. He looks noble like that, dying for a cause. Lips full, skin ashen. Unruly black hair. Bleeding, half-crying. Whispering words to family he’ll never see.\nI fast-forward a little. Time compresses, then returns to normal. The student is close to death. I crouch down by his side. He stinks of blood, the nobility of it.\nI remember the script. He’ll reach up, caress the person waiting by him as he dies. So I wait for it as time passes by, slowly and uncompressed in its normal state."}