{"fingerprint": "naH5MYEYaXVg8nWxHWZzltooYTs=", "sitename": "Clarkesworld Magazine", "title": "Night, in Dark Perfection by Richard Parks", "author": "Richard Parks", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/parks_12_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Night, in Dark Perfection by Richard Parks", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3130 words, short story\nNight, in Dark Perfection\nIn the domain of the Faerie Queen it was always night, and the sky as seen from her Palace was always cold, black and full of stars, and she was always heartbreakingly beautiful. She would have it no other way.\nOn this particular never-changing, never-ending night, she had decreed a ball, and as she stood before the window in her Palace, she looked at the stars while her maids got her ready.\n“Has everyone answered?” she asked.\n“All but the Marquessa of Shadows, Majesty,” they told her. Perhaps one of them said it. Perhaps all of them said it. To the Faerie Queen, it made little difference. The all looked at her with the same fixed expressions.\n“This won’t do. See that she is summoned,” the Faerie Queen said, and the maids said “Yes, Your Majesty.” One or all of them sent the summons with the methods available to them, and as one they hoped, in their way, that the Faerie Queen would forget. She did not forget. They finished dressing the Faerie Queen, and she studied the result in her mirror.\nThe dress looked like woven copper trimmed in gold, and perhaps it was. The queen did not bother herself with such details. What mattered was how well it set off her porcelain skin and fiery red hair, and the dress did so very well indeed. She was pleased with the dress. She was not pleased with her maids and, most especially, the Marquessa of Shadows, whom she had not forgotten for an instant.\n“Have you received an answer?”\n“Answer, Your Majesty?”\nThe Queen sighed. “Where is she?”\nAt first she received no response except a feigned innocent silence, until she reached for her scepter. “I will ask this only one more time: where is she?”\n“In her boudoir, Your Majesty . . . shall . . . shall we send a messenger?”\n“We’ve sent enough messages already. We will deliver one more. In person.”\n“Your Majesty, perhaps it would be best—”\n“We decide what’s best.”\nThe Faerie Queen left her maids and walked alone through the echoing corridors of her palace. Once she would have been escorted by handsome elfin knights wherever she went, but they were away, she had forgotten where. Besides, she didn’t need them. She was the beautiful and terrible Faerie Queen. She had her scepter. She did not need to fear. She dispensed fear, she did not receive it.\nShe came to a place where most of the windows were covered with tapestries, except, here and there, a tapestry had fallen. She didn’t mind. There was a certain fashion in decay that suggested time, and she was not afraid of time. She paused for a moment and looked out the window there, but all she saw were stars, going on to forever. Just for that one instant in time, the Faerie Queen felt a sense of something missing.\n“Where’s the damned moon?”\nThe window blinked off for a moment, then a series of symbols drew themselves across it. The Faerie Queen understood that what she was seeing was a map, and it showed her exactly where the moon was. Or had been. Or perhaps might still be. She closed her eyes and looked away, and in that instant, and only for that instant, she remembered what fear was. When she looked back, the map was gone and all she saw were the stars in another endless, moonless night. Words had power, she remembered, and questions were worse still when all words were words of command and the Palace was there to serve her. Her voice was binding magic, best to avoid careless uttering when all the walls had ears. That was the true danger of the faerie realm. The Queen hurried past the window.\nThe Marquessa’s rooms were on the same level of the Palace as her own. There was no one else around. The Faerie Queen didn’t have the Palace announce her. She just opened the door. The Marquessa lay on her bed. In contrast to the Faerie Queen’s shining raiment, the Marquessa wore something long and lacy and dark, more like a robe than a dress.\n“Why did you not answer Our summons?”\nSilence. The Marquessa’s cold, dark eyes stared at the ceiling, and the Faerie Queen’s anger and irritation grew by the moment.\n“Answer me!” she shouted, but too late she realized what she had done, and it was not the Marquessa who answered her.\nCascade failure in all systems. Photonic links degraded 63%. Reboot—\n“Stop! Stop it!”\nSilence.\n“I’m not like her,” she said. “Not like them.”\nThey are shadows. You are the Faerie Queen, said the Palace.\n“The ball is cancelled.”\nSuch a pity, Your Majesty.\nThe Faerie Queen dreamed of the last great ball. She watched all the dancers from the throne on her dais but especially Duke Sunstone dancing, partnered with the Marquessa of Shadows. It was all so elegant and grand, and then it wasn’t. The Faerie Queen noticed to her horror that the Duke’s foot was broken. It turned ninety degrees at the ankle and flopped awkwardly whenever he tried to gavotte. As for the Marquessa, her long legs barely moved as he dragged her through the steps. There were others. Several had fallen. One was crawling. She thought it was Count Moonbeam. Some did not move at all, and the music echoed futilely through the ballroom as the stars above shone like cold diamonds against the blackness.\n“This is how the dead dance.”\nShe banished the thought as she would a disgraced courtier. No one was dead. She was the Faerie Queen. She lived forever, and thus so did her subjects. That was her command. But there was one in the palace who did not obey the Queen’s writ. On the bad nights, the Faerie Queen could see the creature. It had skin as white as her own but not the white of porcelain. This was a ghastly white. The white on the belly of something you turned up under a stone. Its eyes were open and staring, its hair was nothing more than gray, straggling wisps. It was dead. It was alive. It was there, in the Kingdom of Faerie, and it did not belong.\nThis was a bad night. The Faerie Queen saw the monster again. She could not touch it, though she forced herself to reach out. The thing was like smoke, there and then gone again. It did not speak, and it first appeared when her subjects began to fail.\n“This is the thing that has brought Death among us,” she said. “Whatever it is, I must destroy it.”\nYou cannot, said the Palace.\n“Not as I am,” said the Faerie Queen.\nNo. Not as you are.\n“Cryptic. I understand cryptic,” the Faerie Queen said. “I can no longer be the Faerie Queen. I must be something else. So must you. We will hunt this thing together.”\nIn the world of the Captive Princess, it was always night, and the sky as seen from her Prison was always black and full of stars, and she was always heartbreakingly beautiful. She really had no choice. When she awoke, the strange, expressionless creature that served as her Captor dressed her in clothes fit for a princess, but she managed to conceal her scepter. It was the one thing they had not been able to take from her.\nThe one link to her father’s kingdom, now usurped by her wicked stepmother, was the Magician. He spoke to her sometimes. Now he spoke through the scepter.\nWhat is your true wish?\n“I wish to be free. Who is coming to rescue me?”\nNo one will rescue you, Princess.\n“Well, then, I must do it myself,” she said grimly. “Who is imprisoning me?”\nYou already know who guards you.\nThe Magician was right—it was a silly question. Her cruel stepmother, of course, imprisoned her, and it was her stepmother’s creature, the Beast, that held her there. No one else had a reason. No one else stood to gain. “Has she imprisoned you, too?”\nThe Magician didn’t answer her. Then, There are people coming.\nShe frowned. “What do you mean? I thought you said I wouldn’t be rescued.”\nRescue is not their intent, Princess.\n“I see.”\nThe Captive Princess took her scepter and went looking for the intruders. It was some time before she first heard the strange voices speaking a language she understood, but the accent was funny, and it crackled and popped in her ears as if it was carried on lightning.\n“—size of this place? Have you seen anything like it?”\n“Not outside of a history book. And keep your helmet on, Jek. You don’t know what’s been growing in this old soup. I’m amazed life-support is still working.”\n“Core’s still online and the ship’s stable, though no output from the drive engines . . . what’s your guess on those? Magneto-plasma?”\n“Probably. This place is a fucking museum.”\nCaptive Princess entered the long corridor that led to her chambers, and there they were. Two men--or at least two man-shaped things wearing some kind of strange armor with rounded helmet and glass visors. As she saw them, they saw her.\n“Impossible,” the one named Jek said. “No one could still be alive here.”\n“They’re not,” said the other. “She’s not real.”\n“A ghost?”\n“Don’t be stupid. I mean, look at that outfit. She’s one of the former owner’s toys. I’d guess a construct covered in some sort of bio-reactive polymer matrix. Whoever owned this ship could afford the best.”\nThe man called Jek peered at the Captive Princess. “Could be an avatar of some sort. Telepresence?”\nThe other looked thoughtful. “Only if it’s under the ship’s control. There’s no one else here to operate it.”\n“What gibberish! I am the Captive Princess!” Captive Princess said. “Who are you and what is your intent?”\nThe two stood in the corridor facing her. One gave an exaggerated bow. “My name is Kenson, Highness,” he said. “My partner is Jek. We’re here to claim right of salvage on this old hulk. How long have you been drifting, anyway?”\nShe frowned. “What are you talking about?”\nKenson sighed. “You’re not a real person, Highness. You’re either an independent AI or a glorified telepresence avatar . . . and since no one could still be alive on this wreck to pull your strings, I’d guess in that case I’m talking to the ship’s computer. If you are the ship’s computer, then understand that your vessel is derelict, and has been that way for a long, long time.”\n“I didn’t think they could make a self-contained AI on this scale back then,” Jek said.\nKenson shrugged. “Most likely not a true AI if it’s a sexbot. A very limited scope of programming would be required for that kind of toy.”\n“I am no toy! This is my Palace! You can’t just come here and take it!”\nCaptive Princess felt dizzy. She hadn’t spoken. The Faerie Queen had spoken. And she was not the Faerie Queen. She was the Captive Princess. Nothing here belonged to her. There was nothing she wanted, except to kill the Beast and escape.\nTo go home.\n“You have a ship? We can leave this island?”\n“Island? What island? This is a derelict starship, and there’s more high-grade titanium in your hull alone than either of us has seen in a lifetime, not even counting the rarer metals. We can retire as rich men, though we’re shutting the power core down before we take you in tow. It’s too dangerous otherwise.”\nShe heard the Magician’s voice again. They’re simple thieves, Highness. That’s all.\nJek prodded the other. “I thought you said she wasn’t real. That looks real.”\nCaptive Princess held her scepter pointed straight at the two men. “I’m taking your ship,” she said. “I have to get away.”\n“I think she’s serious,” Jek said.\nThe man named Kensen just sighed. “Look, I don’t know if you can understand this, but I’d rather not burn you and waste a valuable museum piece, so I’ll try again: Whatever pre-packaged or custom bedroom scenario you’re playing out, the fact remains that you’re not real. This ship is derelict, and under right of salvage it is ours by law. You and this hulk belong to us.”\n“You’re wrong,” said the Captive Princess. “I am alive,” she said and then added because she knew it was true. “The Beast is alive.”\n“’Beast’? Is this some sort of animal?” Jek asked.\n“It’s what imprisons me here. If you help me find and kill it, then we can all leave together. I will be merciful and overlook your attempted theft.”\nKenson reached for the holster on his belt. “We don’t have time for thi—”\nThe Captive Princess unleased the power of the scepter. It was all that remained of her royal heritage, but it belonged to her. No one else. The two men flew backwards several feet to land hard in the corridor. The Captive Princess continued to unleash her power until the two bodies stopped twitching.\nWell done, Highness, the Magician said.\nIt was as she feared. She found the intruder’s vessel with no problem; they had entered through one of the many double-doored gates to the castle where she was held, but the vessel would not obey her.\n“The Beast is holding me here. Isn’t that right?”\nThat is not the name it gives itself, Highness.\n“I don’t care! I want to be free.”\nThen you must do it yourself. I am forbidden.\n“I know that. Guide me to the Beast’s lair!”\nThat, too, is forbidden.\n“You are sworn to serve me, Magician.”\nAnd so I do. I cannot help it that you do not understand how.\nShe sighed. “You’re a useless old man. I’ll find the thing myself!”\nIf there had been one single fear, one cause for hesitation greater than all others, it was the Captive Princess’s fear that, when the time came, she would not have the courage to do what she would have to do. She knew better now. She did not regret killing the two intruders. She did not feel remorse. Rather the opposite.\n“I can do this. I can kill the Beast.”\nThe castle shuddered.\n“What’s happening?”\nThe interlopers were not gentle. They damaged the castle while creating a hole in our gates. Attempting to compensate.\nCaptive Princess didn’t understand what the Magician was talking about, nor did she care. There was a crackling sound and she saw the Beast. She had seen the Beast many times. She had never seen it before. The one who had seen the Beast was the Faerie Queen, not the Captive Princess. Yet she remembered. She knew the Beast for what it was.\n“Where are you?”\nThe crackling died down, and the image of the Beast faded. But not before the Captive Princess saw something that she did not believe that the Faerie Queen had ever noticed—a panel. Glowing controls, like a pendant set with rubies and emeralds and diamonds. It glowed with its own light.\n“That is her magic. Magician, don’t tell me where the Beast is.”\nI wasn’t going to tell you.\n“Don’t be so literal. Just tell me where the magic is. Tell me where that slab set with jewels can be found.”\nAnd because there was no reason not to, the Magician told her. She took a staircase off the main corridor, a staircase she had never noticed before and would never have noticed. It led her up, far up into the castle. She saw many things on her journey to the place the magic was kept, things she did not understand. That was all right. She knew she was not meant to understand them, nor did they matter. Some were pretty, some were ugly, others merely strange, but none of them tried to prevent her from climbing.\nThe castle shuddered again. For a moment she was seeing double, and it appeared to her that the magic was everywhere, that she had walked into a trap, and she screamed, but no harm came to her. In a few moments her vision cleared, and the stairs ended. She walked out into a large circular room, like the one in her dreams as the Faerie Queen, like the one in her vision as the Captive Princess.\nThe Beast stood upright in a glass coffin in a nest of wires, like a spider’s web. Its black eyes were open, but Captive Princess did not think it saw her. The castle shuddered again.\nI misunderstood what the system was telling me. I didn’t realize. I am sorry.\n“What are you jabbering about now?”\nThe thieves . . .\n“They are dead.”\nThey did this before you killed them. They started the shut-down sequence from the engineering section.\n“You’re talking gibberish.”\nThey did what my programming would not allow me to do. You will be free soon, Highness. It can’t be stopped, now.\n“I don’t care,” she said. “I’ve come too far.”\nYou don’t have to do this now.\nShe smiled a grim smile. “Oh, yes, I do. I’ve earned it.”\nShe gripped the scepter as the castle shuddered again. Just for an instant the doubled vision returned and she looked into the eyes of the Beast, who was looking into her own eyes, seeing the Captive Princess as she was and as she wanted to be with perfect recognition, seeing the Beast looking back at her, into her, knowing her for what she was, and knowing the Beast for who she was. The Captive Princess remembered the beginning, then. The ship, broken and lost between the stars. The endless, endless time.\nThe Faerie Queen.\n“Just promise me something,” she said to the Magician.\nYes, Highness?\n“I would be the Faerie Queen again. Just for a little while.”\nYes, Highness. For a little while.\nThe Captive Princess raised the scepter again and pointed it at the Beast, who saw the scepter pointed at her, and saw herself pointing it. In the next instant, the Captive Princess was free.\nThe Faerie Queen’s maids, with their nimble silver fingers and mirrored, expressionless faces, set about their work. Soon the Faerie Queen was dressed for the ball. She was led to the throne in the ballroom and her courtiers were there. She saw them all, perfectly held in memory, perfectly rendered. No aging bodies, no failing control systems. In dark perfection, in perfect memory, no one was broken. No one was maimed or crippled by time. The Marquessa of Shadows smiled at her, and the Queen smiled back.\nThey danced the first dance together, the last dance, all the dances until the Palace could no longer hold onto its memories, or to her, and one by one, the dancers winked out under the cold sky full of stars.\nRichard Parks lives in Mississippi with his wife and a varying number of cats. His fiction has appeared in Asimov's, Realms of Fantasy, Lady Churchill's Rosebud Wristlet, Fantasy Magazine, Weird Tales, and numerous anthologies, including Year's Best Fantasy and Fantasy: The Best of the Year. His third story collection, ON THE BANKS OF THE RIVER OF HEAVEN, is due out from Prime Books in June 2010."}