{"fingerprint": "0RwJOxRYlYdN6zpbnvTHDfuymdA=", "sitename": "Clarkesworld Magazine", "title": "Real Ghosts by J.B. Park", "author": "J B Park", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/park_03_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Real Ghosts by J.B. Park", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3650 words, short story\n Real Ghosts\n The outline fills with color and soon she has presence, and a mind, and a laugh—it’s Maureen Hong, back from the dead. Some details don’t match up but that’s fine, everything else does; she remembers the little things, and they share those, even if the remembrance is sometimes painful. The quality of the illusion makes him feel better about his own scheduled imaging. He’d avoided it all these years but now there’s no more years to avoid it in, and so he’d done all the things that he could remember to do—reconnect with surviving members of the Hong family, talk to old friends, finish getting his will set up. Doing them had kept his mind busy, had kept him pushing through. Now as he talks to Maureen he feels like things are about to get better, but that’s when the doorbell rings.\n A quick glance to a view outside confirms his suspicions: it’s Maurice, his still-alive brother. He’s tempted to leave the door shut but Maureen’s disapproving look is enough to let the other in, who struts in with a big grin on his face.\n “Hey,” says Maurice.\n “Hey,” says Maury. And nothing after.\n The smile on Maurice’s face droops and disappears as silence grows. Maureen clears her throat but it’s not enough—what’s there to even talk about? Eventually, Maurice retreats to an adjacent room, and Maury is too tired to object. It’d be better if he’d just left, but that’ll do for now.\n Maury queues up Maureen to talk to her again, but in the middle of doing so he catches a stray bit of conversation, from that same room Maurice had gone to, and he listens and yes, it’s Maureen—and then Maureen comes up and it’s like she’s right there, but it’s not quite right; it’s not his Maureen; and now Maureen’s lack of debilitation and the sight he’d beheld at her funeral of her head all waxen and pale, it all comes rushing back and the illusion, it’s done—he can’t face her anymore, at least not at the moment. She’s not real, for a real person cannot exist in two places at once talking to two people at the same time. There she is, in his room, and in the other is Maurice talking to another version of Maureen, and Maury asks her to leave and she goes and he eavesdrops as his siblings, one dead and one alive, one fake and the other still real, talk and talk about things that don’t involve him.\n His imaging is to take place on Friday. The instructions were short. Think about your best memories, it had said. Hold onto them as your waveform is scanned. And anyone signed into consent, they could bring him up at any time, take solace in his company even after his demise, have conversations and whatnot. Thinking of it, the old insecurities creep up, extant fears that no one will summon his holo.\n Some of that fear is assuaged when more of the family visit on Wednesday. He suspects that Maureen has something to do with this, sensing his anxieties, but then it doesn’t seem plausible given that—as he must remind himself—she’s not real, and likely has no autonomous thought, so how could she have? The only logical conclusion is that these family members have come on their own, and the thought, though he doubts sometimes, is very cheering. The children are loud, but he doesn’t mind; still, when the adults notice their volume they send the kids away with an accompaniment of holos, and Maury recognizes a few of them, Jinsoo, his grandmother, his uncle, his father, and his mother and more—a retinue of past Hongs who shepherd their descendants even after death.\n “They’re the best, aren’t they?” The speaker is a young man whose name Maury cannot recall.\n “I suppose so,” he says, feeling nothing of the sort.\n “Just want to let you know—we’ll be sure to queue you up as much as possible. We’ve talked about it; you’re a real role model, the sort of a person our kids can look up to. A man of conviction.”\n “Thanks.”\n “Anyway, Nicola did get the consent stuff taken care, I think, so no worries there.”\n He says: “Yeah, for sure. No worries there.”\n But yes, there are others besides Maureen; any member of the family that was able to get a holo of themselves done before death—so thirty years back at most—and he calls them up one by one. There’s his grandmother. She’d passed away just after the prototypes had gone up; Maurice, the rich one, had commissioned it for her on her deathbed. There she is—when she first appears she’s way younger than what he remembers of her, always white-haired and cronish, but here a middle-aged Korean woman, an ajumma through and through. The conversation they have is odd in how effortless it is—the language barrier had been very real back then, back when he’d been a kid and she’d still been around, and how fair is it that not only is Maurice the rich one, but also the oldest one, yet still the healthy one? Still, it’s nice to talk to what he remembers of his grandmother without all the gesticulating and the muddled waters of a conversation where sentences don’t begin and end in the same language.\n It’s not flawless, of course. Her imaging is from so long ago that there’s a noticeable hitch if you shift the topic too fast, maybe jut from futbol to football or from breakfast to what he had for dinner.\n Once he grows tired of her, he dismisses her and goes through the rest of the collection. Flipping through a list of undesirables, he’s reminded of how there had always been a divide between the Korean-American and Korean-Korean branches of the family, a benign one but present nonetheless. But it had never been like that with him and Jinsoo, and upon calling him up Maury can’t help but smile at the sight. Seeing an old friend basically, the friendship having ended long before it could sour, though this time the youth is no lie, it was how he’d been when he’d died, what he’d looked like in his 20’s because he’d never lasted beyond that—and this Jinsoo, this fake ghost of the man, he asks Maury if he wants to play another round of baduk. It’s amusing; he’d never done this with the actual Jinsoo. The difference—where what’s in front of him is obviously not the real thing—reassures him.\n They play a little. Maury has black, Jinsoo has white. Maury is terrible, and he loses three games before calling it off. When Jinsoo disappears, he dims the room and for a while sits there mulling over old memories.\n After a few minutes he calls up Maureen. They talk a little and conversation strays to a time when the siblings—all three of them—had gone looking for their cat, Spring; as they remember how they’d walked along the wall of some house and the resident there had sicced her poodles on them, and they’d hopped off laughing, she says, “I wish Maurice was here,” and he agrees despite feeling nothing of the sort. He’d never been one to disagree with her; the yes always came unbidden, a habit.\n That’s when Maurice asks if he could come in. It’s rather odd. He’d been the sort of person who never knocked, and as a result his siblings had developed a habit of locking everything in their rooms. But now Maurice has asked, quietly, if he could enter. So Maury says, “Come in.”\n Maurice enters. Again the picture of health. Damn him. “You feeling okay?”\n “It’s been good.”\n “Just wanted to check up on you, bro.”\n “You’re doing that, yes.”\n Maurice takes a seat by the window, all closed and curtained off. “Look,” he says, “I know we haven’t been the best of friends, or brothers, or family in the past, but now that it’s come to this—”\n “All it takes is two deaths in the family, huh?”\n “One,” says Maurice. “You’re not dead.”\n “Yet.”\n “Yet. Which means we can make up a little. Be better friends, brothers. Right?”\n “I know your game.”\n “Really?”\n “I was there too, you know. Not that you ever talked to me or Maureen. It was that huge mess of a Thanksgiving, when Auntie brought out Uncle, and what a fucking mess that was.”\n Maurice starts giggling and Maury cannot help but join in. No more words are needed. What a fucking mess it had been—the worst and best sort of mess—Uncle had come out, recently deceased but there nonetheless, a real ghost of a man, and everyone had clapped—he’s back, he’s back!—but Uncle had left on bad terms, apparently, because he’d proceeded to tear into everyone present, including his surviving wife, his wife’s family, his own brothers and sisters and extant families of each, and politicians, athletes, even the guy who ran the pool bets on Friday—Auntie had ran off to try to turn him off, because for some reason she was unable to do it from the dining room—and the survivors had watched Uncle wail and wail, all out of insults, bugging out as he screamed. Horribly awkward.\n “So what do you think my endgame is, brother?”\n “I think that—when I die—you want to be able to call up my holo and not have something like that happen.”\n “If I was worried, wouldn’t I just avoid calling you up in the future?”\n “You want to show me to your kids,” says Maury. “Parade me around to the children I never got to meet. You want both my consent, and also my good will.”\n “Oh, them. Well, yes. I’m sorry about that. But now they’re a little too old for this, so don’t you worry about that. Off to live lives of their own and whatnot.”\n “So what then, grandkids? Great-grandkids?”\n Maurice looks uncomfortable. “You could say that.”\n “And now I suppose this is where I forgive you.”\n “You don’t have to, if you don’t want to.”\n “Just go.”\n “Can I come back?”\n Maury looks up at his brother and his brother looks so serious about this that he agrees to it.\n But even after Maurice leaves, he can’t help but dwell on something odd. His uncle, the memory he’d shared with his brother of that man’s ghost being an absolute shitheel—it was so different from how sedate he’d been when seen in the company of other holos earlier.\n Only three days are left until his imaging. He may have a few weeks after that to enjoy life. Maury has no idea how he might go about doing that, and so Maurice tosses suggestions at him—go surfing maybe.\n “I’m scared of water.”\n “What about a marathon? There’s one in Colorado Springs soon.”\n “Have you seen my legs?”\n “We could go eat.”\n “I can’t digest anything anymore, dear brother.”\n “I’m sorry.”\n “You should be. You’d know this if you cared before this, before now.”\n “Hey,” says Maurice, “maybe it’d be easier if you stopped guilt-tripping me all the time.”\n “Maybe you deserve it.”\n “I probably do.”\n “Then why complain?”\n “Because it’s still fucking annoying.”\n “Give me a break,” says Maury. “I’m dying! When I’m gone, I will never be a dick to you. I’ll be all smiles and kisses and you’ll tell your grandchildren that you had the best of all possible brothers and you’ll have my holo beside you nodding along like I really agreed.”\n “I guess that means I have your consent, then?”\n “Yes. No. Maybe. I don’t know.”\n “You can be a dick, brother. Like, feel free to just be real, right? Honest. I’d rather see that then have you be all fake and smiling just so I could show them to my children and their children.”\n Maury opens his mouth. He wants to say something, but that something, though its general idea has already been conceived, lacks specifics. He closes his mouth. Opens them again. Something about what Maurice has said gets to him. Maybe it’s that these are the longest conversations they’ve had in years, but that by itself doesn’t feel quite right.\n Two days left and he spends most of the day drugged out; the pain has gotten to him and so he weaves in and out of consciousness and it feels as if Maurice and Maureen are both always there, and they are indistinguishable, and he thinks, in those spots of lucidity, technology, what an amazing fucking thing it is.\n Maurice, Maureen, and Maury. The Hong siblings. One of them is already gone. And the other, fucking Maurice, is definitely a holo. He tests this out. He calls for Maurice. Maurice appears.\n “Come closer,” he says.\n So Maurice does.\n “Closer.”\n A little closer.\n Still not within range to touch—to feel—and Maury thinks about how he’d had to invite him in always, and that was never Maurice’s deal, he liked having the freedom to barge into his siblings’ rooms, and when Maury had put a lock on his door the lock had gotten filed off a day later—and Maury heaves himself up and swipes at Maurice and his hand passes through everything and nothing and he yells, “Maurice!”\n “Yes,” says the holo, “let me help you, bro.”\n “Fuck you,” says Maury. “But you know what, sure. Help me. Help all you can.” Is this where he laughs? He tries it out. It feels bad, so he stops.\n “Are you okay?”\n “I’m very okay. For now. Tell me—Maurice is nothing like this in life, is he?”\n The holo-brother looks distinctly uncomfortable. “I can’t confirm that.”\n “I bet he’s a jerk still. A real asshole. Maybe it’s better that you’re here still.” The last part just pops out of his mouth and yet he doesn’t regret it, because what’s there to regret? Who is there to offend—the simulacrum?\n Maurice and Maureen were the intentional ones. Then he’d come along, and they’d named him appropriately, the third in the Mau-line of Hongs. If only they could have been, perhaps, Joshua, Joan, Jonas? Good names that could begin with Jo as their lead syllable instead of Mau. But at least Maurice and Maureen sounded natural. Stuffy, admittedly. But still, more natural than Maury.\n He calls for Maureen. He asks if she’d known about Maurice.\n “Yes,” she says. “But I thought it’d be better if you didn’t know.”\n “I wish I didn’t know,” says Maury. “But you remember what Maurice was like. Or rather, is like. I can’t imagine being his kid. Being his kid must be the worst thing in the world. Can you imagine it? Think about our parents getting our grades in email, and how horrible that felt. Now imagine being his kid right now. The guy couldn’t even stand the thought of not being able to come into our rooms whenever he wanted, and now he’s not a child anymore and this is his child. His kid probably has zero privacy. His kid, I bet Maurice is there following on some widget, a fly maybe, just watching and watching every move.”\n “You shouldn’t hate him. He is what he is.”\n “He sent his holo! Not even himself. Fuck him. I can’t believe I ever called him a brother. A sibling. Family.”\n “If you’re like this when you get imaged, your holo is going to be mean and no one will see you.”\n “Fuck him. He couldn’t even come see me in person.” He feels so sorry for himself and he hates it, that he’s pitying himself like this to the point where he’s having to blink a little too much, and when he wipes away at the corners of his eyes his fingers come away smeared with rheum.\n “Let’s talk about something better,” says Maureen. “Remember that trip to Carlsbad?”\n “It was so dark there. We sat there waiting for the dark outside too. For the bats. Or maybe it was another cave. Caves, all of them are the same. You go inside and they turn the light off a little bit and suddenly it’s pitch-black and dark and you’re supposed to feel something, and I do, Maureen, because isn’t that where I’m going?”\n “A better memory. Your birthday party!”\n “Yes,” he says, “yes, that was a good time. We had cake and mom made LA galbi and japchae and remember how we didn’t have enough candles? So you ran down to the store for me, the dollar place, and you got a pack of candles and you also had a pack of army men as my present. Thank you, Maureen.”\n She beams. “You’re welcome. Do you feel better now?”\n “I do,” he says. “Now please go.”\n “I don’t know, you look like you need—”\n “You make me feel like a goddamn baby and you’re not even real. Please go, Maureen.”\n She sighs. “Okay. But I’m here for you, alright? Just call for me. I’ll always be here for you.”\n “Wait,” he says.\n “I’m here for you, like I said.”\n “Just one question. The guidelines said I should think happy thoughts.”\n “And you should.”\n “But does any of that matter?”\n “It has to,” she says. “Why would they mention it otherwise?”\n “Maybe it’s to make me make myself feel better for no reason at all.”\n “But isn’t it a good thing to make yourself feel better?”\n “Of course. Then I’d be feeling better. Jesus Christ. How fucking simple.” He tries to think of an appropriate physical reaction—a shrug perhaps—but nothing really fits and so he simply sighs. “Did you make yourself remember only the good parts when you got imaged? The last imaging, I mean. When you knew there probably wouldn’t be more.”\n “I don’t know if it’s appropriate to tell you, not in your current state.”\n “Of course.”\n “But remember—I’m here for you.”\n And in the end, they’re there, his sister and his brother. Off he goes to the Maestas Spectrum Facility. There in the lobby, he wheels right through a pack of holos and Maureen is horrified.\n “What if they were real?”\n “They’re too healthy to be real,” he says. “Just look at them. Glowing, practically.”\n “I got my imaging done every three years, and for most of those I was super healthy.”\n “That’s true.” He pauses, looks back. “I didn’t run anyone over, did I? I didn’t feel a thing. No bumps, nothing.”\n “If you did, you’d hear the screaming already,” says Maurice.\n “And the ding-ding-ding of incoming lawsuits.”\n “You two are awful,” says Maureen, smiling.\n And Maury thinks about how awful Maureen could be, when she wanted—and how perfect she’d been for the last few days. The ghosts, they’re better people, better than any real ghost, and what would he be like once the only thing that remained of him was the holo, the not-Maury? Chatting with Maurice’s grandchildren and shit, probably. The thought is oddly pleasing and he wonders that it is so.\n They wait for their turn. In front of them is a woman with a little girl. Both real, because the woman is carrying the girl in her arms. The girl looks like she’s two, maybe less.\n Maury asks: “Couldn’t find a babysitter?” It happens sometimes, no doubt. Maybe the parent doesn’t trust non-human caretakers.\n “Oh no,” she says, flashing him a smile that quickly turns to pity once she sees the state he’s in. “It’s for her.”\n “Oh,” he says. “That’s, well, neat.”\n “I mean, okay, it’s not normal, but you never know, right?”\n “Anything could happen,” he agrees. “Anything.”\n “Right. And if something happens, well—” she blinks a few times and Maury feels terrible. Why did he have to be such an asshole?\n “I’m sorry, I shouldn’t have.”\n “No no, it’s fine. But yes, if something did happen, well, there would be a little something of her.”\n What would a holo of a baby would be like? Would they be babies forever? Or aged up? When summoned, would they, what, crawl in on all fours or waddle on their twos, or come as a young child, or a teen, or maybe even an adult? Whatever you want them to be, they will be.\n What the hell, he has nothing to lose. So he asks.\n “No,” she says, looking uncomfortable. “She’ll stay a baby. Assuming she’s a baby if that happens.”\n “But you could watch them grow—”\n She glances at Maureen then Maurice and both of them shrug a little, and the tone conveyed is apologetic and Maury observes this all with a detached, somewhat cruel feeling. As if on queue her number is called, and without a word she hurries away.\n “You’re a real jerk, you know that?”\n “Shut up, Maurice.”\n “Be nice,” says Maureen.\n It’s in front of a tall plastic-gray gate that they stop. There’s a sign—no holos allowed past. No distractions permitted where the real work is done.\n “Maurice,” says Maury, “tell your master—or yourself—or whatever the terminology is that he has my consent to be summoned, called up, whatever it is that people do. I just can’t guarantee that whatever he calls up will be particularly happy with him. In fact I’d like to be particularly nasty to him if possible, but I get the feeling that it’ll be out of my control, anyway.”\n “You’re the best, man.”\n “Maureen, you’re not even real but I’m glad I got to talk to you again for a while.”\n “It was nothing,” she says, smiling. “But it’s not like you’re going in there to die, right? You’ll be right back out. It takes like ten minutes, tops.”\n She’s right. It is silly to be so solemn about this. “Okay, you’re right. Maurice: disregard everything I just said to you.”\n “Oh, come on—”\n Off he goes. When he crosses the gate there’s a dim change in tone, something about the lighting separating the bright warmth outside and the colder, clinical feel within. And they are both gone. He’s never been lonelier."}