{"fingerprint": "awpHqbVRVYvcGga7xRfbHzmHldM=", "sitename": "Clarkesworld Magazine", "title": "My Dear, Like the Sky and Stars and Sun by Julia K. Patt", "author": "Julia K Patt", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/patt_06_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: My Dear, Like the Sky and Stars and Sun by Julia K. Patt", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7670 words, novelette\n My Dear, Like the Sky and Stars and Sun\n Elspeth keeps her shop in the outer rim—in the circle most distant from the center-city—in a neighborhood no one knows. It squats in the shade of two sagging apartment buildings full of senior citizens and recovering addicts, and across the street from warring Greek and Turkish restaurants. Most days, the neighborhood ignores her and her customers. If asked, they probably wouldn’t even know what the faded sign out front reads, generally referring to it as, “That lesbian tattoo place” instead. Business is usually slow, but she prefers it that way. She has more time to spend in the back room, where her real work takes place.\n Typically, she sees three different types of customers. There are the ones who just want stock images from the prints on the walls and the catalogs she leaves around the waiting area: skulls with flames coming out the eyes, tiny smeared butterflies, Chinese and Arabic lettering they can’t read, giant ornate crosses, sports logos, etc. Then there are those who think they know what to ask for, usually rich kids from the center-city airing their bravado for a posse of admiring sycophants, who come away with harmless LEDs imbedded in their skin or ink that changes color with their moods. These almost always come back, alone, begging her to undo whatever she did, which she obligingly does, albeit for double the usual price.\n Then, there are the ones who know what to ask for and how.\n She doesn’t know if the girl is one of these at first. She comes at the end of hours, when they always come: usually girls in trouble. Sometimes they’re older—a few have been the wives of petty government officials or successful businesswomen—and Elspeth has seen the occasional young man who wouldn’t look her in the eye, too. Not that it matters. She takes all types.\n The girl, though, is something different. Something about the way she’s dressed, like she’s trying just a little too hard: the worn jeans splattered with motor oil and filth, the faded t-shirt with its unrecognizable band name, the fingerless gloves unspooling at the ends, the shapeless hoodie unsuccessfully enlarging her small frame.\n It’s the sneakers that throw it off, Elspeth decides. Bright red Darrows. Popular four years ago and common enough, but too bright. Un-scuffed. New.\n She doesn’t look up when the girl enters, pretending instead to study her account books. (That is a lot of red, she notes, and it may be Insta-Noodles and reused tea bags for her foreseeable future.) The girl moves around the shop carefully, drifting from case to case, touching a finger to a design or the health inspector’s certificate on the wall or the glass case of jewelry full of LEDs and synthetic stones.\n The real stuff, the good stuff, is in the back.\n “You got that bioluminescent ink?” the girl murmurs, still not looking at Elspeth.\n “Not since McWright patented it. Cost tripled,” Elspeth replies easily. She still makes her own batches for friends and trusted customers. “But I imagine you knew that.”\n She doesn’t think this kid is with corporate enforcement, but you never know. Maybe they’ve started recruiting soft-spoken teenagers—or folks who look like soft-spoken teenagers.\n The girl smiles. Or flashes her teeth, at least. “Too true. But I heard you could help with the dark anyway.”\n There it is. The key phrases shift every month or so, but this one is current. Almost fresh. Elspeth switches to her appointment book, studiously licking a finger and flipping through the pages. Her ordinary customers like the anachronism of a shop that’s all paper—they assume it’s on behalf of the gang members who occasionally come in, but really it’s for moments like this. She carefully indicates a laminated card on the countertop. It looks like a chart of basic line-art designs: roses, dolphins, hearts. The girl taps the image of the all-seeing eye.\n The safe under Elspeth’s counter knows more than her fingerprints; it knows her resting pulse, her average body temp, the chemical composition of her sweat. It knows now that her adrenal levels are low. It swings open soundlessly; without looking, she retrieves a small, amber bottle with a dropper top. “No more than three doses per eye in 24 hours,” she directs the girl. They shake hands, exchanging the bottle for a wad of bills. Old-school money, very out of fashion. But still valuable.\n Maybe she can manage more than noodles this month after all.\n The girl makes a quick exit, as they often do, without thanks. It’s only when she turns her back that Elspeth sees the hoodie is one of those rabbit-eared numbers little kids sometimes wear. Two long, gray ovals hang over the girl’s hunched shoulders. Then the door chimes and she’s gone.\n Later, much later, Elspeth realizes she can’t remember what the girl looked like.\n She visits the shop again twice after that. The second time, she comes in out of the rain and those rabbit ears droop on either side of her face, dripping water staccato on the floor. She doesn’t say anything, just holds up her hands. The middle and ring fingers on the left are taped. A red crescent has seeped through on each. Apparently she’s tried DIY this time.\n “Magnets?” Elspeth asks.\n “Magnets,” the girl agrees.\n They have to go into the back room for this particular modification. The back’s not so different from Elspeth’s front tattooing and piercing room. As sterile, certainly, even if the health inspector hasn’t seen it. And she picked the best quality chairs for both. But where the front room brims with different ink memorabilia—some artists do action figures, but Elspeth prefers prints and other art—the back room is full of projects. Nothing haphazard, of course. She doesn’t want them to interfere with one another. But there is a small forest of plants being examined for various reactions and a work board full of microchips. In the corner, her three rats, Charles, Barbara, and Richard, live in their habitat while she tracks their neural reactions on the monitor next to them.\n The girl, seeing it for the first time, lets loose a low whistle. “You really are what they say,” she murmurs.\n Elspeth is well aware of her nicknames and has little love for them; she shrugs. It’s the work that matters to her. The sense of inquiry and discovery. She pulls on her gloves while the girl gets settled. “Ready?”\n She nods.\n “Do I want to know what this is for?” Elspeth uses her best responsible older sister voice. It works on some of them, even though she is the picture of an irresponsible older sister with her combat boots and shaved head and glittering jewelry in all the wrong places.\n “Probably not,” the girl says after a pause. And leaves it at that.\n The third time, she comes very late. Elspeth has company—a few peers in the trade to talk over new projects. When she opens the door, the girl shies back from the light and laughter. Elspeth has never seen her so skittish; previously, she has been calm and collected, almost aloof. Now, the girl draws her hood up. “You’re busy,” she says. The shadows pinch her face.\n “All safe people,” Elspeth assures her. The network is growing, but she still knows everyone’s names and faces, at least in this corner of the movement. She’s almost smiling at the girl; there has been wine. And brownies. “Come on inside.”\n She shakes her head. “I just need one of those biometric sensors. The one that goes under the tongue. Now.” This last comes off as imperious and she swallows. “Please. I can pay.”\n She always can. She’s overpaid for both the eye drops and the magnets. When Elspeth doesn’t move immediately, the girl repeats: “Please.” She looks over her shoulder and then into the shop.\n It’s not unusual for them to be frightened, of course. To come with a sense of urgency, even emergency. Usually it’s the first visit, though. Not the third, if there is a third. Eventually, though, Elspeth retrieves the tech. She’s barely handed her the sensor when the girl tosses another wad of bills at her and runs, her sneakers slapping the stairs that ascend to street level. The night swallows her up, leaving only chill air and the feeling of watching eyes behind.\n Elspeth would be lying if she claimed she doesn’t think about the girl in the month that follows. Even more than she thinks of the others, the ones who want temp-tattoo sensors to test their drinks or vital signs monitors that contact emergency services or locks that respond to a certain decibel or pitch of voice. She often lies awake, worrying. Will the tech work—no, of course it will work. She has tested and retested it. But will it help? That she can’t know. Sometimes she doesn’t have to wonder because their faces show up in bulletins online. Missing. Deceased. Sometimes incarcerated. On happier days, they come back for more, not just to be safer, but because they love it—the knowledge of their own bodies. They want more in the way that all mod’rs want more. She wishes there could be more days like that.\n The girl is something different, though. The tech she wanted doesn’t add up to the usual defenses against abuse and violence. It’s either incomplete—or meant for something else entirely. Elspeth starts watching the news more. She works on her own modifications, too. The sensors in her conch piercings that pick up frequencies out of her natural hearing range. The lenses she’s developing for her eyes that can see heat signatures. And the neural camouflage that’s been her pet project for years now.\n She keeps an eye out—and asks some of her regulars to, too—for unusual activity in the neighborhood. Kareem, who runs the newsstand on the corner, says there were a couple guys in suits hanging around a few days ago, but they didn’t stay long. Not cops, he emphasizes. Probably corporate enforcement, maybe even patent officers. You could see where they’d taken the patches off their jackets.\n Suits with patches indicate one of the Big Seven corporations: McWright, Satsuki, Okadigbo, Clausen-Jones, Fernandez-Hart, Winderhuff, Liang-Wu-Song. Now what would bring their lackeys all the way out here, though?\n People have come looking before. Angry parents, usually fathers. Threatening spouses and lovers and bosses. Sometimes they even find Elspeth’s shop. They find her stone-faced and tired-eyed, looking much older than her twenty-nine years. She’s not an unimposing presence, she knows, even wearing her regular tank-tops and jeans: taller than average, especially in her boots, covered from neck to knuckle with ink, sensors glittering on her many piercings.\n Corporate thugs, though. That’s a different matter entirely. Elspeth hasn’t stared down a patent officer since she was last arrested.\n She’s going to need some help on this one, she decides.\n Doralice isn’t the easiest person to find in a hurry even in the best circumstances. It takes three messengers seven tries to get close enough to get a response. Once they do, though, it’s much easier. theo’s, midnight declares the prompt message. Elspeth and Doralice are old friends, from back in their shared anarchist days. Doralice is, in fact, the one who set Elspeth up with her shop; she needed an outpost for the network and Elspeth needed a job and a lab.\n She owes Doralice for even more than that and doesn’t like to ask for favors, but she goes to Theo’s anyway. It’s a riot of aggressive club music, glow-sticks, and bioluminescent mods. Elspeth grins when she spies some of her own work decorating exposed backs, collarbones, and biceps. These are her people.\n She presses through the sweaty mass of them to a quiet back corner—Doralice may be meeting her in a literal broom closet. She smiles when she sees Elspeth approach; her hair is a halo of shifting colors around her dark face.\n They embrace. Doralice has added a cluster of sensors to her temple, but Elspeth suspects those are largely for show. What she’s imbedded in her gray matter is anyone’s guess. Elspeth herself has long abandoned that line of experimentation; she’s had enough of people messing with her brain to last a lifetime.\n “So,” Doralice says without preamble. She’s not the ‘hi, how are you?’ type. “I think I’ve found your girl. The passcode is one of ours, of course, but she got it off a fellow named Jeremiah, who had it from Ronni who got it from your friend Nadine who got it from Zehra, who of course had it from me.”\n “This Jeremiah, is he—?”\n “Doesn’t lab with us, but he’s one of ours. Botanist.” Which usually means some controlled substances on the side. “Yeah, I know. I think he must be over-sampling his wares, because he says he doesn’t have a clue what this girl looks like it, except for a gray rabbit hoodie and—”\n “—red sneakers,” Elspeth finishes. “D, it’s not just him. I can’t remember her either. Not really.”\n Doralice grimaces. “Well, then you’re going to like this even less than I do.” She hands Elspeth the tablet she’s been cradling in her lap.\n That is her, Elspeth is almost sure. A professional photograph, probably done for high school or family a few years earlier. No rabbit hoodie—she’s wearing a deceptively simple blazer that screams of designer clothing. Her dark hair’s plaited neatly to one side. It’s the eyes that are familiar, the wariness in them she recognizes, although she could not have said before that they were gray.\n She scrolls. There’s the headline: Winderhuff heir absconds with top-secret R&D prototype.\n Mari Winderhuff. Only daughter of Liam Winderhuff, Founder and CEO.\n “Well, shit,” Elspeth says.\n She gets home after two and a lot of talking. Doralice’s going to speak to Jeremiah—see: threaten—and figure out why he offered Mari Winderhuff a network passcode in the first place. She wants Elspeth to stay put; there’s no reason to suspect her of aiding and abetting. They haven’t even found her shop yet, which means the neighbors are staying quiet, bless them.\n Still, it was right there in the article: Winderhuff is suspected of using illicit biohacking technology to pull off the heist. Not that the corporate media doesn’t point the finger at mod’rs every time something like this occurs. But this time, of course, it happens to be true. Elspeth doesn’t know what exactly Mari Winderhuff did with the eye drops and the magnets and the biosensors, but she can make some educated guesses and none of them are good.\n Her ride on the inter-circle tram and walk home is paranoid, twitchy. She keeps looking back over her shoulder, thinking she’s being watched. She hasn’t felt this way in a long time. Not since—well, no reason to bring that up again. Anyway, she hates it; she stomps up to the flat she keeps above her shop, furious at herself and Doralice and, above all, at Mari Fucking Winderhuff, corporate brat and spy.\n She’s brewing herself a cup of chamomile to try to calm down and get some rest—she’s definitely going to add a few drops of that proprietary blend of sleep aid she’s been working on—when there’s tapping at her back window, the one by the fire escape. It’s tentative: not authoritative in the way of those furious spouses and wrathful parents. Like a whispered: are you there? Oh, hell.\n There’s the girl, curled up in the shadows of Elspeth’s fire escape. It doesn’t take an expert to see she’s been sleeping on the streets, her clothing rumpled, her skin gray. She’s got her hoodie wrapped tight around her, her hands buried deep in the pockets. Seeing Elspeth at the window, she opens her mouth to make some plea.\n Elspeth sighs. “Come in,” she grunts, before Mari Winderhuff can say anything.\n While Elspeth drinks her tea, the girl eats five peanut butter and jelly sandwiches and three apples. Not fast, although it’s plain she wants to, but methodically. Carefully. No need to say: “Don’t make yourself sick.” This is not a girl who needs mothering. She does need a good scolding, though, Elspeth thinks acidly.\n Before she can chastise her, Mari launches into a little speech: “I know I wasn’t very honest with you and I’m sorry, but I didn’t think anyone would help me if I told them what was really going on. I know I’ve gotten you into some trouble by associating with me, but I really appreciate you helping me again and—”\n Elspeth cuts her off. “Tell me what you want or get out of my house.”\n Mari stops and swallows. She’s probably never been derailed like that before. She pauses, thinking through what came next in her spiel. “I want to be your apprentice,” she says finally.\n Elspeth laughs. It’s a sour, brittle noise. “Take some more food if you want and get out.” She goes to put her mug in the sink.\n The girl jumps up to follow her. “No, please, just hear me out. I think this can be a—a mutually beneficial relationship, if you know what I mean.”\n She folds her arms in front of her chest. What is this child suggesting to her? “Look, there’s nothing you can offer that—”\n “What about tech?” Mari interrupts. She waves a small black case that Elspeth didn’t notice before. Must have been hidden under the hoodie.\n She’d be lying if she said she wasn’t curious what was so important that a corporate heir would risk reputation and well-being to steal what she would inevitably inherit someday. But she shakes her head. “You know how long I would go away for possession of stolen tech? Especially if it’s patented.”\n “It is,” Mari says and winces at Elspeth’s reaction. “But—but the patent’s in my name.”\n She leans back against her countertop. “I’m listening.”\n “I read in one of the mod’r forums it’s something you all have been looking for—something you’ve been working on. No one ever refers to it directly; they just call it Project Woodencloak. But from what I can tell, it’s a smart fabric that has a whole host of applications, including protecting women walking alone at night. I think . . . I think I can help.”\n Woodencloak. She and Doralice have been trying to crack it for years. Whether Mari Winderhuff knows it or not, she couldn’t have offered up a more tantalizing opportunity. Doralice would not approve of the risk to the network, of course. And the girl is a constant liability, whether she means to be or not.\n “Who designed the tech?” Elspeth asks. “You?”\n “No.” Mari swallows hard. “My mother.”\n To begin with: the hoodie, it turns out, is no ordinary piece of clothing. “She made it for me when I was little,” Mari explains. “It messes with facial recognition. People and machines, I think. Neural interference. She never really explained it.”\n Elspeth knows better than ask, “Where is she now?” If she were still alive, there’d be no need for any of this. And these stories never end well anyway, do they? Instead, she says: “So you don’t know how it works.”\n Mari shakes her head. “I studied engineering at MIT-Harvard, like everyone does now, but I don’t know how any of this stuff works. They didn’t want us dabbling in mod’r science, getting the idea we can do things on our own. And it’s basically just recruiting grounds for the Big Seven anyway. We get theory at school and practice on the job; anything we do becomes property of one or the other.”\n “And what you stole, it’s more of the same?” Elspeth has switched over to scotch.\n “I don’t really know.” She looks sheepish at this. “Look, my family and I, we’re not exactly close. I was away at school when she got sick again. I don’t know what she was working on—I only know she wanted me to have it. She left me this.”\n At first glance, it’s an ordinary looking medallion, something you could get cheap in Koreatown. But when Mari slides her thumb over it, it springs open and scrolling lines of instructions project onto the ceiling above them.\n I’m sorry to put you in this position, but you’ll need to break into my office at Winderhuff. You’ll need the following modifications . . .\n “That’s how you knew you needed the eye drops and the magnets and the sensors. How did you know to ask for us? For me?”\n “I didn’t at first,” Mari admits. “I knew there was a black market for this stuff. But I have some friends who have gotten mods, you know, for the rebellion of it . . . None of them came back with anything real, but I figured that meant the real stuff had to be out there somewhere. So I started asking around. Jeremiah is a friend of a friend. He said you were kind of a legend.”\n Elspeth shakes this off. It doesn’t exactly please her that there are still stories about her, especially in center-city. Instead she says, “If we’re going to do this, I need you to do as I ask. That means helping with the experiments. It means staying out of sight and not endangering my shop or the network. It means trusting me. Can you do that?”\n It occurs to Elspeth that she’s never really seen the girl smile. She does now, in pure and obvious relief. It’s lovely. “Yes, of course.”\n They begin by taking precautions, installing basic mods in Mari. She won’t be dealing with the public, but on the off chance someone sees her, even someone from the network, they change the color of her eyes, the texture of her hair. Elspeth applies a large, garish temp tattoo on her cheekbone: a neon purple dragonfly with a sensor imbedded in its back. On the cheek, it can track saliva pH, caloric content of food, alcoholic proof, foreign substances, etc. They are not especially popular for obvious reasons, but they are effective.\n Mari scratches the sensor with one nail. “So, if I get chloroformed or whatever, it’ll know?”\n “Exactly,” Elspeth replies. “Now stop picking at it.”\n She’s also paying the neighborhood kids to keep a special lookout. Eventually, she has to tell Doralice what’s going on, but she’ll wait until they have something concrete to offer the network. She’ll keep her appointments with her own work group until then. On those evenings, Mari hides in Elspeth’s apartment and reads up on mod’r tech.\n During the day, Elspeth works as normal. Legitimate business. Needlework, Mari calls it. Putting needles through ears and noses and eyebrows and nipples and the occasional penis. Stenciling fairies and muscle-bound superheroes and crucifixes dripping blood and dolphins and one 6’7” bouncer’s beloved cat Tink. While she does this, Mari is in the back room, working on the tech.\n It’s harder than Elspeth anticipated, letting someone use her workspace unsupervised. Her mod’r group does experiments in the back room every week, even tweaks Elspeth’s own setups if they know a quicker way, but Mari is a complete stranger relative to the five of them. And completely green on top of it. The first time Elspeth goes to check on her, she’s made an utter mess of the instruments, scattering them across the table and using the wrong set of pliers to rewire a sensor.\n Acting on knee-jerk reaction, Elspeth snarls at her and snatches the piece out of her hands. The girl cringes around her for the rest of the day before Elspeth understands her mistake. She still doesn’t know the full story, and although Mari has made her own life immeasurably harder, it’s unfair to make assumptions because of who her father is. She has, in fact, doggedly avoided talking about Liam Winderhuff.\n She has blundered, Elspeth reminds herself. She will blunder again. But she’s trying. I can be patient. It’ll be worth it for Woodencloak.\n They start with the hoodie, only working on it together. It’s unlike anything Elspeth has ever seen. The rabbit ears, it turns out, contain most of the tech: the disruptors, the mechanism that releases a subsonic pulse, a set of processors. It makes sense that you’d want them close to the face, they concur. As they work on replicating it, Mari breaks down the code, piece by piece for Elspeth. She knows computers, she explains, just not the human body. Not mod’r tech.\n The two are kept artificially separated to protect corporate interest, Elspeth explains. Anything that might genuinely benefit people is patented, marketed, and sold at premium prices. They like to snatch away elements unique to the mod’rs, too: bioluminescent ink has its applications, but more than anything, it’s a mod’r marker, one of the earliest projects a person completes in a biohacking circle.\n “Can I?” Mari asks. “Make bioluminescent ink, I mean? I know it’s not, strictly speaking, related but—well, can I?”\n “Of course,” Elspeth says. It’s the first time the girl has asked to learn something and that pleases her. Mari’s face, too, when she properly extracts the compound and mixes it with the solution, is its own reward.\n “I know it’s a project for primary schoolers,” she tells Elspeth, grinning. “But I love it.”\n As it turns out, when given a chance, the girl is pretty smart. She is quick to learn the parts of her brain and how different tech affects them. Once she learns the language for sensor coding, she does it faster than anyone Elspeth’s met. She’s careful about tending Elspeth’s plants, doesn’t bruise the leaves. And she’s particularly enamored of the three rats. After a week, she’s taken to reporting their responses to various stimuli at the end of the day—“Richard was agitated by the yellow pulse and the Mozart, but not the blue pulse and the Mozart”—like a proud teacher on parent conference day.\n Little by little, Elspeth stops worrying about the back room and her experiments and the girl.\n It takes them about a month, but they do finally learn to replicate the tech from Mari’s hoodie. The rabbit ears are a little conspicuous and obviously it’s not much good if the wearer takes off her jacket, but it works. Elspeth finds herself matching Mari’s smile. “This,” she declares. “Calls for a celebration.”\n The girl is understandably skittish about leaving the shop. She’s wearing her mother’s tech though—they carefully replaced the mechanisms and sewed up the rabbit ears—and the deep breath she takes outside hints at a long bout of restlessness that Elspeth has suspected. “Still smells like piss and hot garage,” she jokes at the girl.\n “But also fried food and roof-top gardens and . . . life,” Mari says.\n And there’s this unexpected pang, in Elspeth’s chest, a reminder that her apartment and her shop will be empty again someday all too soon. Except, of course, she prefers the quiet. The peace. She does.\n Mari looks equal parts delighted and anxious at the prospect of Theo’s. “We’re just going to get a drink,” Elspeth tells her. “Assuming, I mean, you are old enough to drink, right?”\n The girl makes a face. “I’m twenty-three!” she insists, although she doesn’t look much older than sixteen. And her I.D. is fake anyway.\n So they drink and they dance a bit. Elspeth leaves the girl on the dance floor—she is safe among mod’rs the way she is safe nowhere else—and goes to see if Doralice is in. Her friend seems less than pleased with the developments, only offering the occasional “mhm” as Elspeth tells her story.\n “But you don’t know what she stole yet?” she asks when Elspeth has finished.\n “No, but we’ve got a good rapport now. She trusts me. It’s only a matter of time.”\n “Do you trust her?”\n Elspeth considers this. She’s gotten to know Mari considerably better in the last few weeks. “If she’s a corporate spy, I can’t imagine what her end game is,” she points out to Doralice. “She had enough to bust me on the very first day we met, remember? Anyway, she’s still useful to us. Might as well get what we can for Woodencloak. No need to turn her over to the patent office yet.”\n She means this last sarcastically, of course, but the startled noise behind her makes her regret it immediately. Mari stands in the doorway, looking gutted. And before Elspeth can explain or say anything, the girl turns and runs.\n Elspeth isn’t the chasing type and even so, she’s pretty sure the girl just needs a minute alone. When she gets home a few hours later, Mari is sitting in her living room, that slim black case across her knees and a tablet in hand. Elspeth sighs. “We don’t have to do this right now,” she says. “I know you’re not a spy.”\n “No, I haven’t been fair. I should have been honest from the beginning. You’ve helped me so much . . . and we had a deal, I know.”\n Elspeth settles into an armchair across from the girl. “Look, it’s important to present what we’re doing to Doralice in these terms. Risk vs. reward. I get to do what I do because she keeps all of us safe, you included. Those considerations are part of that.”\n Mari swallows. “I understand . . . ” But she’s still apprehensive; it’s all over her face and the way she’s bundled herself into the gray hoodie, the rabbit ears draped over her shoulders.\n If Elspeth doesn’t concentrate, the girl’s face sort of slips away and she finds she doesn’t like that. She gets up again, going over to one of her bookshelves and returning with a small jar. Inside is a chip submerged in clear alcohol. A small pink glob clings to one side. She hands it to the girl.\n “It links people,” Elspeth explains. “You can transmit what you’re feeling into someone else’s brain.”\n Mari frowns. “That sounds kind of intense.”\n “It can be. We thought it was very romantic when mod’rs first started developing it. I know I did.”\n “Wait, this is yours?” Mari pauses. “But . . . you took it out.”\n Elspeth makes a small noise in the affirmative. She can feel the girl’s eyes on her, but she doesn’t look up. It’s been a long time since she’s talked about the chip and what it can do. Longer since she’s thought about the person on the other end. Truly. It’s taken some time—years in fact—but she’s finally stopped thinking of her every day.\n “Doralice helped me. The person on the other end—she was using it to hurt me. It was early in mod’ing. We did a lot of things just because we could. Some of them backfired. Rather spectacularly, actually.” She doesn’t want to go into details, but she will if the girl asks. The arguments and the slammed doors and the bottles and the long, long nights tormented by someone else’s bitter hatred and disgust. “It wasn’t just me, of course. A lot of us trusted people we shouldn’t. Eventually, Doralice organized us. Made us into a family. We look out for each other. If we take risks, it’s for each other.” And she has; she even went to prison for them, if only for a short while. She’ll save that story for another day.\n She gives Mari a chance to think about that. Considers having another scotch, but puts the teakettle on instead. There’s a moment, when she sits down again, that she almost feels the girl’s outstretched hand on her arm, but it’s gone immediately. Instead, Mari hands Elspeth the tablet. “That’s my mother,” she says. “Ana.”\n The girl favors her with her features and inky hair. Only the eyes are different; Ana’s are dark brown while Mari’s are naturally gray.\n “She was sick a lot when I was younger. When I was in high school, she couldn’t get out of bed for eleven months. But she had gotten better. No one told me she was sick this time. And she died.”\n The picture shifts to video of a funeral. Mari stands next to a tall pale-eyed man, both of them in unrelieved black. Liam Winderhuff, unmistakably. Neither of them is crying; Liam puts one stiff arm around his daughter, who shrinks away from him.\n “My mother was my father’s best engineer. She developed half of Winderhuff’s most successful inventions. She was brilliant at mechanics and programming, but she shifted her focus to biotechnology after I was born. She said the future was in the improvement of ourselves, not our tools.”\n Elspeth smiles at this. “Sounds like our kind of lady.” She swipes through designs of many of Ana Winderhuff’s creations. Projects in development. Sketches. Ideas. Beautiful ideas. There was as much art in what she had in mind as science it seemed. She would have made a great mod’r.\n “Yeah,” Mari says. “She wanted to be a painter when she was a child. But you know. Science is more lucrative these days. She never made me choose, though. I got to build robots and have violin lessons. Not that I always appreciated that.” There: the heavy cling of regret.\n Elspeth isn’t one for platitudes, and, for all she knows, Ana may not have known Mari was grateful in the end. Instead she says: “She still saw you as her legacy.” And nods at the briefcase—the girl holds it like it’s her only lifeline.\n Slowly, Mari deactivates the locks; it looks like a complex sequence of touches, no doubt linked to biological signatures as well as timing. “She was working on this when she died. I didn’t understand it then, but I do a bit better now, thanks to you.” She draws out a long, long swath of fabric, handing it yard-by-yard to Elspeth.\n “This is what your father wants back.”\n Mari’s face reddens at the mention of Liam Winderhuff. “He wants everything,” she says. “He always did. He used my mother. He used—”\n Elspeth doesn’t have to guess the end of that sentence. She’s marveling at the fabric in her lap. Watching it shift and change. But it’s unfinished. “This will be a lot more complicated than the hoodie,” she says. “What exactly do you have in mind?”\n The girl picks up the tablet and strikes a few keys. There’s an announcement in blocky fonts and bright colors. The Futures Fair. A three-day extravaganza of the most exciting (legal) advancements in science and technology. Would-be prodigies attend annually to hawk their wares for government and industry contacts. All of the Big Seven will be represented there; all of them sponsor it. But Winderhuff is this year’s headliner. Risky.\n “There’s a prize for amateurs,” Mari explains. “Presented by Liam Winderhuff himself.”\n Risky indeed. “What exactly do you have in mind?” Elspeth asks again.\n The girl grins.\n The first day of the Futures Fair, Elspeth wanders through the crowds, as if she has no purpose or aim in being there. All-access passes aren’t a hard ask for Doralice and the rest of the network, and many of her friends are scattered through the event. Fortunately, the Fair attracts all types; no one blinks twice at the odd green-haired mod’r sitting at the back of a panel. They don’t usually present or compete, but their presence, at least, hasn’t been legislated away yet. Not that there aren’t an equal number of corporate thugs, each wearing patches identifying which of the Big Seven owns their souls.\n So she keeps a low profile, just in case.\n It’s a massive affair, swallowing the whole of center-city’s largest park. Solar-powered lamps are strung across the trees, giving everything a soft, moon-blue glow. Thousands roam the park, most attracted by the main stage, with its promise of new tech on the market this year. Elspeth watches a few of the smaller demonstrations: an AI with the acumen and knowledge of a French chef, a hive of smarter-pollinating mechanized bees, an engineered species of algae which converts enough CO2 and produces enough oxygen for a city block.\n More than the presenters, though, she’s listening to the crowd.\n “Did you hear what Winderhuff’s unveiling this year?”\n “It’s top secret, isn’t it? What do you think? A better breed of sexbot?”\n “Funny. I hear it’s an unbreakable security system. Retinal scans will be dead tech now.”\n Elspeth smiles.\n Later the conversations have changed: “I’m telling you, it’s like nothing I’ve ever seen.”\n “Who’s the inventor again?”\n “They’re not here tonight. It was just a model wearing the tech. But it’s beautiful. The most perfect sky blue.”\n She catches just one glimpse of their complete project that evening. Zehra, one of Doralice’s lieutenants, is the right height and build to wear it. They’re careful; she only spends two hours at the fair—not long enough for Liam Winderhuff to hear about it, but enough to make an impression. Word of mouth will garble it, but there will be enough interest for the next night.\n The second day of Futures Fair, they have a close call. Nadine, a regular in Elspeth’s own mod’r group, wears the tech that evening, twinkling like a night no city dweller can imagine. At first, they hear only oo’s and ah’s, but then there are men wearing Winderhuff jackets moving into the area and blocking the exits. She wants to shout out a warning, but that will only draw their attention.\n Nadine understands the situation unfolding without Elspeth’s help and grabs the hand of the nearest onlooker. “I’m dressed for a party—let’s dance!” she tells the crowd. Before anyone can say or do anything, she shimmies and pirouettes through the onlookers, leaving a cluster of swaying bodies behind her. Someone starts playing music and the Winderhuff agents struggle around the dancers.\n By the time they navigate the swinging hips and raised arms, Nadine has vanished and Elspeth takes this as her cue to leave, too.\n There’s word later, per Doralice, that the five finalists in the amateur competition have been announced. They should attend the main stage event the following night, when Liam Winderhuff will reveal the lucky winner.\n Of course, the name they used is there.\n Mari is wearing her gray hoodie over their project; they stand together, just beyond the stage, where people have begun to gather. The smart fabric is still quiet, inactive. In this inert state, it resembles nothing so much as the increasingly ratty gray sweatshirt the girl is wearing. “Are you sure about this?” Elspeth asks again, apprehensive.\n Mari smiles instead of answering. She looks older tonight, more self-possessed. “I want to give you something.” She produces a package wrapped in thick brown paper and tied with string. “To say thank you. For everything.”\n Elspeth accepts it, mute. There’s no doubt this is the last time she’ll see the girl, whether their plan succeeds or fails. It’s strange to feel that spasm of loss in her chest, but she does, has known that she would for a while now. Some version of herself would hold Mari, but she doesn’t—won’t—reach for her. They stay where they are, as if repelled like a pair of magnets, the night filling the space between them.\n All too soon, Liam Winderhuff’s voice slithers through the speakers near them. “And the winner of the Futures Fair amateur prize is . . . Ana Paek Winderhuff . . . ”\n If the crowd murmurs at the name, Elspeth doesn’t notice. She’s too busy watching the girl. Mari ascends the stairs, shedding the gray hoodie and attaching the neural sensor to her own temple. The dress’ corresponding sensors surge to life, filling the fabric with color and movement. It’s a riot of gold and red. Elspeth does hear the onlookers gasp when they realize that the image is, in fact, the sun. A burst of fiery red explodes across the bodice. A sunspot rotates across the skirt. Mari turns for them, slowly, showing them that the image is not merely a projection. It’s coming from the fabric.\n After a moment, she takes a deep breath and, as she exhales, the image of the sun bleeds into the bone-white surface of the moon, pocketed with craters and spotted with the detritus of space missions. The Sea of Tranquility spans the skirt.\n Winderhuff stands there, watching her. Where he previously wore the cheesy smile of a game show host, his expression now goes hard and twisted. Once the crowd noise dies down, he says. “Well, Miss, tell us about your invention.” There are already Winderhuff agents ringing the stage, but they’re waiting, watching. Elspeth stamps down the urge to punch as many as she can.\n “Well, Dad,” Mari begins, no small amount of ice in her voice. The crowd definitely reacts to that, hissing speculations from front to back. “It’s a bio-responsive fabric that adapts to the emotional and physiological state of the wearer and creates a corresponding—and completely unique—image. In other words, my moon won’t look like your moon and vice versa. We’ve woven sensors into the fabric and these communicate with this—” here she points to her temple “—neurotransmitter here. It’s reactive by default, but if I concentrate, the image will change.” Here a dazzling rainbow arches across the gown to a burst of applause.\n Mari pauses, waiting for them to quiet. “But if I lose focus,” she continues. “My psychological state becomes the determining factor and whatever memory comes to mind might appear.” A malignancy consumes the rainbow, now distended and bruise-colored. Tears start to fall from Mari’s eyes, wetting her face and the dress’ high collar. A huge pair of hands seems to stretch from the floor and seize her, shadowing both skirt and bodice. The audience has gone very quiet. A pale woman lies still in a hospital bed. A man’s fist rises up over her and closes on her, extinguishing the image. “You can’t lie to the smart fabric,” she finishes.\n Winderhuff’s face purples. Closing his hand over his mic, he hisses at his daughter. What, neither Elspeth nor the audience can hear, but the way he looms over her is unmistakable.\n “Of course, if I transfer the neurotransmitter . . . ” She plucks the equipment off quickly and slaps it onto her father’s temple before he can react. “Everyone can see exactly what you are.”\n Images flutter across the fabric as it receives the new information. Liam Winderhuff is trying to pry the device from his skull, but Elspeth created a mechanism that locks the transmitter in place at Mari’s request. “This is a dangerous piece of tech,” she said at the time.\n “I know,” Mari replied. “Trust me?”\n As the crowd watches, the same malignancy of Mari’s memories surges across the dress. Here is its presence at the hospital bed again; there it looms over Mari’s mother knocked to the ground; finally the shadow makes a slow approach to a room with a half-closed door. Inside a younger Mari, no more than fourteen or fifteen, sleeps unaware in her bed—\n Winderhuff finally deactivates the device and flings it from him, panting. Blood runs down the side of his face. “Thief,” he growls at his daughter. “You stole this from my company—when we’re done with you, you’ll be begging to come home and let us do whatever we want with you. But I will leave you in the streets to rot.”\n This last echoes across the stage and the audience.\n Mari grimaces, but she’s not cowed. “I think you’ll find you stole this from my mother. She patented it before she died. In my name.”\n Winderhuff moves as if to lunge for her, but the crowd breaks out into shouting. He freezes as people pour over the dividers and onto the stage, surrounding him.\n In the middle of it all, the girl stands alone, her face still wet with tears.\n Elspeth does not stay to watch Liam Winderhuff get arrested. She goes home to her little apartment above her shop. She holds Mari’s gift in one hand and the gray hoodie in the other. She strokes the rabbit ears absently. She’s feeling too old for these sorts of nights, maybe. For this sort of life, even. She’ll talk it over with Doralice. Later, when she’s ready.\n For now, it’s after one AM and tomorrow is her day off. She can sleep in, if she wants, and then start getting her life back in order. Life without the girl. Without Mari.\n There will be more people who need her help, she knows. And in a day or two, she’ll be there for them, as she has always been. For now, she strokes the rabbit ears and thinks about the blazing light of the girl as she ascended the stage tonight.\n After a while, she unwraps the bundle. It’s more smart fabric, its surface a slick lead gray. Elspeth laughs when she sees the girl has fashioned it into a literal cloak. Mari has attached a note: I’ve designed it to be less invasive. Without the neurotransmitter, it reacts to biological indicators like body temperature, perspiration, etc. Sort of like those mood tattoos you do. But if the wearer is afraid, it goes into camouflage mode. So you can keep being the Godmother and helping lost girls find their way.\n The Godmother. She hates that nickname.\n As Elspeth runs her hands over the fabric, it begins to change. The dark blue of the deep ocean spreads across the fabric like a pool of spilled ink. Shapes move in the shadows beyond her view, but they will not hurt anyone. Instead, everything is quiet. Still.\n The door opens behind her. Mari is standing there, in her ratty jeans and faded t-shirt and her still too-red sneakers from the first day they met. She has a bag slung over one shoulder. Her face pales with an unspoken question and clear hesitation. For a moment, it seems she might even leave again. But then she looks at the scene spread over Elspeth’s lap, her discarded hoodie curled on the couch like a sleeping pet. The girl approaches slowly, coming to kneel next to her; she takes Elspeth’s hands in hers and leans over to kiss them.\n “I knew it would be beautiful,” Mari says."}