{"fingerprint": "LWZaY75rhzw1nWA0FlCDje//Ihw=", "sitename": "Clarkesworld Magazine", "title": "To Study the Old Masters in the Prado at the End of the World by Sarah Pauling", "author": "Sarah Pauling", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/pauling_03_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: To Study the Old Masters in the Prado at the End of the World by Sarah Pauling", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1400 words, short story\nTo Study the Old Masters in the Prado at the End of the World\nYou kissed her while Mom’s broken-down dishwasher roared from the next room over. Lucia had said it would be romantic: You, her, and a pitcher of tinto de verano whipped up from your brother’s old wine stash and a flat Sprite from the back of the fridge. Like it was still springtime. Like you were still at the fair in Sevilla, sketching each other dancing.\nWhat would be really romantic, you told her, would be making out on a sofa that didn’t have a dubious history re: cat vomit. A sofa you could call your own, down Avenida Manolete, where the apartments were spaced farther apart and the mall theater didn’t play ads before American movies.\n“Your immigrant dream,” she teased, winding fingers through your hair.\nA spaceship landed on the Mosque-Cathedral two kilometers away, dead city-center in Córdoba, but you didn’t hear it. The wash cycle was so clamorous you had to pretend it was waves on a shore just to relax into her again.\nPictured: Virgin and Christ Child, Alonso de Herrera. Oil on wood. 1508. 92 x 79 cm.\nDepicts a holy conversation (sacra conversazione, in the tradition of Renaissance painting) centering the Virgin Mary—a human woman—and her child. The setting bears a striking resemblance to the pre-renovation Mosque-Cathedral of Córdoba, itself a unique architectural blending of Islamic and Catholic art.\nThe Virgin’s regal features hint a likeness to Isabella I of Castile, whose marriage to Ferdinand II of Aragon united the kingdoms of Spain. Together, spurred by faith in the Virgin’s cult, the two monarchs drove the last remaining Islamic caliphate from the Iberian Peninsula.\nAbove, the spaceship hung massive as a nightmare: gleaming hot glass, blocking out the sun, icicle appendages trailing down to caress the Mosque-Cathedral like a squid eating something big enough to choke on it.\nLucia pulled you through old-town back roads. She was born to this country, unlike your family of Argentines, and she knew the city—like a birthmark, like a birthright.\nPeople moved helter-skelter, water disquieted by stones. The army hadn’t come yet, though the news and your emergency text alerts said they would, and all anyone could think to do was find each other.\nLucia wanted to find her mother. You left yours in the apartment, her soft hands trembling as she called Dad’s cell phone again and again.\nOrange trees in the cathedral courtyard reflected, distorted, on the spaceship’s mirror-liquid surface. You wondered if the oranges were there before the cathedral was. Before it was a mosque—maybe even before it was a temple to an old Roman god.\nYour own reflection was a distant dot of color, distorting along the spaceship’s edge until you lost yourself completely.\nPictured: Portrait of Ferdinand II of Aragon, Robert Matsys. Oil on wood. Early 1500s. 35 x 28.5 cm.\nRobert Matsys, a prominent Flemish painter of the Renaissance period, worked as a portrait artist for powerful families, including Spanish royalty: first for Isabella I of Castile and then, after her death, for her husband Ferdinand II.\nFerdinand and Isabella launched military campaigns against the Emirate of Granada between 1482 and 1491. Their annexation of the city marked the end of the Reconquista. In the same year, they commissioned Christopher Columbus’ voyage to their planet’s western hemisphere, thus taming the New World alongside the old.\nYou pulled Lucia down a claustrophobic street in the Casco Antiguo, toward the bar you discovered your second week in Spain—when your dickhead brother still lived at home and Dad’s visa wouldn’t come through and you needed to get away from Mom for a while.\nYou led her into the empty building when her breath started heaving; when her gasps turned from exertion to tears.\n“Her phone’s off,” she said. “Mama—”\n“Shh. You remember this place?”\nThe bar once served orange wine outdoors, in glasses small enough to count as shots. Locals and tourists had congregated on cobbled streets. Back then, your Spanish had had the wrong accent: An Argentinian shhh where it should be yyy, and vos instead of tu. You caught eyes in the dark whenever you spoke.\nOne girl had worn heels higher than your hopes, but you talked to her anyway. She asked your opinion on El Greco and Bermejo; you said you liked Latin American muralism. She laughed at you, but without cruelty.\nIt hadn’t been long before you spoke like a Spaniard instead of a porteño. Like a citizen of the motherland instead of the place you were born.\nOutside, the spaceship began to hum. You remembered the cathedral tower was once a minaret.\n“I was so pretentious.” Lucia choked on a laugh, rubbing a hand over her eyes.\nYou pulled out her barstool and tried to smile. “Come on, cielo, you’re still pretentious. You always did prefer the old masters.”\nPictured: King Boabdil Mourns Granada, Hans Durer. Oil on canvas. Circa 1869. 275 x 377 cm.\nAbu Abdallah Muhammad XII, known to contemporary Spaniards as Boabdil, was the final Nasrid ruler to control Granada before its surrender to Ferdinand II and Isabella I. In 1492, Muhammad XII yielded the besieged city and left for exile in Fez. His descendants lived in poverty, as was typical for human commoners of the time.\nVarious Islamic caliphates had controlled portions of the Iberian Peninsula since the eighth-century destruction of the Visigothic Kingdom—who had, in their time, conquered various Germanic tribes in an attempt to restore Roman rule.\nNight fell brokenly. The army didn’t come. You huddled with your mother—and Lucia, and Lucia’s mother, thank god—on the pullout sofa. You watched the news until the power went out. The damn dishwasher finally fell silent.\nLucia ran her hands, rough with brush calluses, over your skin. Her thesis painting from Madrid Complutense hung from your bedroom wall, orange and indigo genius cornered by a staid frame. She had always been better than you—knew how to tame herself, and when.\nYou hated yourself for thinking: maybe art will come from this.\n“They’re everywhere,” your brother told you in his last call before your phone lost signal. “In Córdoba and Granada and everywhere else. They’re building something over the cathedral.”\nFor a while you heard fighting in the streets: rallying cries and football chants. Then nothing. Quickly and painlessly, there was nothing.\nThat night, the power came back on. The news resumed service, and the smiling RTVE anchors explained what would happen next.\nPictured: The High Ask in her Earth-Bound Majesty, Lucia Esquibel. Oil on canvas. 2043. 150 x 245 cm.\nThe work of Lucia Esquibel defined Earth’s early Cosmopolitan period. Rising from humble beginnings, her innovations earned her the patronage of the High Ask and the tutelage of prominent Ganymede artists. Esquibel drew influence both from Earth folk traditions, such as Renaissance portraiture, and Ganymede high art.\nThis work, in Esquibel’s signature orange and indigo, depicts The High Ask’s coronation in the Mosque-Cathedral of Córdoba. According to legend, the Ask was to be crowned in the cathedral nave. However, when she saw preserved floor tiles from the Roman temple that had first occupied the site, she chose instead to hold the ceremony while standing on the protective display glass.\n(“Are there any questions?” you ask the museum’s distinguished visitors. “I knew Esquibel myself. I was with her when the cathedral was rechristened. At the start of the New World.”)\nThe Ganymede shrine rests on top of the cathedral, rests on top of the mosque, rests on top of the Visigoth church, rests on top of the Roman temple, rests on top of dirt and rock and bone.\nStanding in the Court of Oranges, you watched the cathedral’s rechristening. Everyone you know in this strange and battered country stood with you.\nThe new architecture was slick and silver, like you wouldn’t be able to touch it without a finger sliding off again. Like crystal; like wineglass rim-music repurposed and made physical. It hurt your eyes, eating up your field of vision and slurping up holy stone.\nShining, sick with oxygen, the High Ask commanded you to call her Grandmother. Grandmother, birther of the gods who birthed the universe. (In this way, she claimed your god.)\nYour gut clenched. Your tongue pressed to the roof of your mouth. You stiffened your spine—\nAnd Lucia pulled you into a bow.\nShe took your hand, but your fingers were limp with the vision of crystal: sleek, sweating, slipping, sweet.\nSarah Pauling spent several years sending other people to distant places for a living as a study abroad advisor in Ann Arbor, Michigan. She’s now in Seattle, graciously sharing her home with two cats and a husband. A graduate of the Viable Paradise workshop, her stories have appeared in places like Strange Horizons, Escape Pod, and Cast of Wonders. If approached without sudden movement, she can be found at @_paulings on Twitter, where she natters on about writing, tabletop gaming, comics, and books."}