{"fingerprint": "EeoHxPGMzbUwI/XpjeDdLq1SUII=", "sitename": "Clarkesworld Magazine", "title": "Informed Consent Logs from the Soul Swap Clinic by Sarah Pauling", "author": "Sarah Pauling", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/pauling_02_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Informed Consent Logs from the Soul Swap Clinic by Sarah Pauling", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1650 words, short story\n Informed Consent Logs from the Soul Swap Clinic\n TECHNICIAN: Recording new consent document, procedure 228. Patient is a thirty-nine-year-old female. C-could you state your name for the record?\n PATIENT “BLUE”: Sure! I’m [BLUE]. Is this, like, really formal?\n TECHNICIAN: Um. Fairly. C-can you tell me about any reservations you have regarding the procedure?\n BLUE: Probably what I’m most, like, nervous about—besides learning how to walk again [laughs]—is that my new body’s neural pathways won’t be developed right for engineering work. Not that I work since getting married. But you know. I like keeping up with nanomaterials and stuff.\n [pause]\n BLUE: Oh, but I’m, like, totally on board.\n TECHNICIAN: Great. I just n-need to ensure that you understand the medical risks before we schedule. Firstly, we strongly recommend against pursuing repeated swaps, which would increase your risk of d-developing epilepsy or Alzheimer’s in later life.\n BLUE: No problem there. I don’t think my husband would, like, pay for me to swap back. [laughs] He’s really excited.\n TECHNICIAN: Recording n-new consent document with primary sponsor of procedure number 228. [SPONSOR], I’m just going to ensure you understand the medical risks to your wife.\n SPONSOR: We went through the think-pack. Obviously, we think it’s fine.\n TECHNICIAN: She and [RED] will experience significant side effects as they habituate to each other’s neurology. They’ll have to essentially retrain themselves to interact with the world. N-nausea, visual or auditory hallucinations, loss of control of bodily functions. Some patients experience d-dysmorphic distress, which can be transitory or—\n SPONSOR: Do we have to go through it all? My wife and I have the resources to get her back on her feet.\n TECHNICIAN: I d-don’t doubt that, but I still need to walk you through the—\n SPONSOR: She’ll be fine after a week or so, right? In [RED]’s body? Healthy; full of energy?\n TECHNICIAN: Probably, but—\n SPONSOR: Then we’ll be fine. Listen, is [RED] going to be here today? Can I see her? Get her autograph?\n TECHNICIAN: C-could you state your name for the record?\n PATIENT “RED”: Oh, honey. You know my name.\n TECHNICIAN: N-n-nevertheless—\n RED: Chill out, you’re making me nervous. Figured you’d be used to interacting with celebrities by now. I mean, you have to be rich as God to shell out for this. Like [SPONSOR].\n TECHNICIAN: Well, we’re c-contracted by organizations more often than individuals.\n RED: You mean spies and shit? Deep cover face changing shit?\n TECHNICIAN: Um. I’m unable to disclose—\n RED: [laughs] Oh my god. Maybe that’s who I should’ve swapped with instead. Some James Bond lady instead of a past-sell-by wife due for a flesh upgrade.\n TECHNICIAN: [sputters]\n RED: What a freak, that guy, right? You know he paid me [REDACTED]? That’s more than I’ve made in ten years, just to stick an old trophy wife in his movie star crush’s skin.\n TECHNICIAN: Once we get a “map” of each of your n-neurologies—basically a freeze-frame—I’ll program the machine. You and [RED] go to sleep, and when you wake up—\n BLUE: Yeah. I get it.\n TECHNICIAN: Are you alright?\n BLUE: People ask if I miss the pageant days, but they never ask if I miss, like . . . all the stuff that came after. You know I was [SPONSOR]’s first technical hire, before he hit it big? That’s how we met. We were so different then. Both of us.\n SPONSOR: Um.\n BLUE: Like, I guess what I’m saying is I miss going in to work in the morning. Doing science. You’re so lucky.\n TECHNICIAN: It’s . . . alright. It’s fine. For me, it was better than the alternative.\n BLUE: But you, like, went to school for this?\n TECHNICIAN: I d-didn’t, actually. It’s kind of a long story. But it’s not hard! Practically automated. You’re in good hands.\n BLUE: I’m so out of date in my field. Tools, techniques, all of it. Like, over a decade off. Even if I wanted to go back to work, I—\n [pause]\n BLUE: Can I ask you something else?\n TECHNICIAN: We really n-need to get through this script.\n BLUE: Oh, sorry. I’m like, always talking too much. That’s what my husband says. Ever since my sister moved to Sydney and the café in our building shut down it’s been like . . . sorry. I’ll stop.\n TECHNICIAN: N-no, go ahead and ask.\n BLUE: It’s just, maybe you have a read on [RED].\n TECHNICIAN: I n-never have a read on anyone. Fatal weakness.\n [laughter from either BLUE or TECHNICIAN—unclear]\n BLUE: But seriously, why would she agree to trade with me? Like, she gets my old-ass body and a brain that used to be good at microfabrications research. What else? Why would she ever want to, like . . . stop being her?\n TECHNICIAN: I really can’t disclose c-content from these sessions.\n BLUE: I’m sorry. I shouldn’t’ve asked. Just . . . you seem nice. Like the barista who used to work downstairs. He let me talk to him for as long as I needed to. During the day, when I was alone.\n TECHNICIAN: Trophy wife? Please don’t call her that.\n RED: Hey, no offense intended. It’s a solid gig! Hell, I considered it for a hot second before my breakthrough role. Just . . . intoxicating some yacht party with my presence until a powerful creature can’t help but take me home. You ever thought about what that would be like?\n TECHNICIAN: . . . Yes.\n RED: You mean you’ve pictured it, in your head?\n TECHNICIAN: Yes.\n RED: [laughs] Damn, boy! Knew this mouse had a material side. I’m never wrong about these things.\n TECHNICIAN: I’m n-not saying—\n RED: Anyway, listen, she’ll get plenty of love once the tabloids get wind that I’ve donated my rack to her cause. If I were her, I’d divorce [SPONSOR]’s nasty ass right after and have some fun.\n TECHNICIAN: Do you think she’ll do that? D-divorce him?\n [pause]\n RED: Don’t sound so hopeful, honey. Sometimes people get stuck.\n TECHNICIAN: There’s no reason she can’t—\n RED: She can walk away, but she can’t leave. You want somebody to leave, give them something to run toward.\n [pause]\n RED: You know I can tell a lot about people, just by looking at them? I can feel their feelings and shit? My mom called it “hyperempathy.” Your think-pack said it was a highly developed EQ.\n TECHNICIAN: Yes. It’s a c-competency not many people have. I’m envious. I’ve always wanted—\n RED: I’ve spent my life trying to shut that shit out. It follows me closer than the damn paparazzi, or the kids on my feed who think they’re in love with me. I can feel that shit on my skin. I can walk away, but I can’t leave.\n TECHNICIAN: I don’t understand.\n RED: I’m ready to pilot that lady’s big engineer brain straight to my expensive new private island and solve Rubik’s Cubes for the rest of my life. Or lock myself alone in a room and cure cancer or something. She can keep the EQ for all I care if it means I can be alone for once. Alone on the streets, in my own brain, whatever. Both. Either.\n [pause]\n RED: I mean, she’s lucky, right? Everyone’s forgotten her name.\n TECHNICIAN: Last question: why are you undergoing this procedure?\n [pause]\n BLUE: What do you mean?\n TECHNICIAN: I just n-need an answer. Please. Tell me you have a reason to do this. Tell me that you want it.\n BLUE: I . . . I want to.\n TECHNICIAN: If you weren’t married—or if you left him, or he d-died one day—would you still want this? Would you still want to live in her body? Fight off tabloids forever?\n BLUE: Yeah.\n TECHNICIAN: What if you had a better option?\n BLUE: Yeah no, this is like, a life changing opportunity. Or whatever.\n [pause]\n BLUE: Stop making that face, goddammit! Stop pitying me.\n TECHNICIAN: I d-don’t pity you. I would love to have your life.\n BLUE: No you wouldn’t. Don’t lie to me.\n TECHNICIAN: I’m serious! The resources. The body you’re about to have. Her people-reading skills; the d-development of her anterior insula and her ACC.\n [pause]\n TECHNICIAN: C-can I tell you something? My life before this job wasn’t good. I worked in a corporate lab and trusted the wrong guy. Got blackmailed. K-kept being forced into situations I couldn’t control. Then I met someone here who offered me a choice. The same choice someone else gave him.\n BLUE: Must be nice, all these choices.\n TECHNICIAN: What I’m saying is, this job—this life—wasn’t my first.\n BLUE: Well, sorry if I don’t feel bad that you get to spend all day doing—\n TECHNICIAN: I d-didn’t develop this stutter as a child.\n BLUE: Okay?\n TECHNICIAN: Someone else did.\n [pause]\n BLUE: Huh.\n [Investigator’s note: approx. eight minutes are unrecoverable due to audio file corruption. Note potential tampering.]\n TECHNICIAN: Thank you, we’re c-clear to proceed. Are you alright with scheduling for two months out?\n BLUE: Sure! God, I wish you really were my barista. I think we’d have a lot to talk about.\n TECHNICIAN: Okay, people, time for final consent! This is, like, the last possible moment for takesies-backsies. [RED], how we f-feelin’?\n RED: Golden. I consent to the procedure. Honey, you okay? You seem . . .\n TECHNICIAN: Ready to go! F-f-full of energy. I was sick for, like, a week? But now I feel brand new. I’ve already thought of, like, a ton of improvements I w-wanna make to this procedure. “Automated” my ass.\n RED: Huh . . . you don’t say. Good for you.\n TECHNICIAN: F-fill me in, [BLUE]. You ready to, like, start a new life? Become the b-b-beautiful lady you see beside you?\n BLUE: Um. Yes. I consent. I’m ready—I think I’ve been ready my whole life.\n TECHNICIAN: Awesome. Thank you. Now it’s f-finally—finally—time for me to do some goddamn science. Let’s get this show on the road.\n Sarah Pauling spent several years sending other people to distant places for a living as a study abroad advisor in Ann Arbor, Michigan. She’s now in Seattle, graciously sharing her home with two cats and a husband. A graduate of the Viable Paradise workshop, her stories have appeared in places like Strange Horizons, Escape Pod, and Cast of Wonders. If approached without sudden movement, she can be found at @_paulings on Twitter, where she natters on about writing, tabletop gaming, comics, and books."}