{"fingerprint": "z6PCw+Dkdyxj/3tvmXIBMwxFnH8=", "sitename": "Clarkesworld Magazine", "title": "Sirius by Ben Peek", "author": "Ben Peek", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/peek_12_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sirius by Ben Peek", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3780 words, short story\nSirius\nEmily Parker\nAt the edge of Deacon College on Tunel Five, the statue of Amadou Qaramanli stands in an empty, sunlit square. A lab technician, he was born in Tripoli, and began working in the expansion of the Earth Empire at the age of sixteen, dying on a planet ninety seven percent water at the age of thirty four, having lived three years longer than myself. Pictures of him reveal an unassuming man, neither tall, nor overweight, nor blessed with a great or distinctive mind. Of his personal life, of his likes and dislikes, and of the small parts that make each of us an individual, history has nothing recorded. By the time I had been born, he had been dead for a century and humanity had been introduced to hundreds of new cultures and was struggling to establish itself. Asking for him to be anything but a cautionary tale amongst lab technicians was too much by then.\nThe story I heard was this:\nAmadou and fellow Libyan born researcher, Dr. Waled, were a pair of sweat-stained, badly dieted, over-worked men sharing a run-down house in Saire, the capital city of Tunel Five. Tunel was one of the first gift planets by the Ta’La, a nomadic, pale-skinned, tall race that gifted the conquered planets they had no use for to other cultures. There, both men came into contact with a hemorrhagic virus named after the planet. It was the first incident between the two cultures and apologies were made, later. But, beneath the afternoon sun, far away from the official records, and feverish and with pains throughout their bodies, both men made the diagnosis and discussed the diluted state of the immune serum they had on the plastic table before them. They had enough for one shot each but, in the orange drenched evening, they acknowledged that their chances of survival were slim. As the sun darkened again and blood seeped from Amadou Qaramanli’s eyes, he told Dr. Waled to take both doses.\nThe statue on the planet Tunel Five was funded by Dr. Waled after his return to Earth. For decades, the portly scientist told the story of Amadou’s sacrifice, going as far to write about it in his self-published memoirs as a sacrifice for science, a technician’s recognition of the importance of his role. It was a book that sold only to technicians, as Waled, apart from this one event, was an even more unremarkable man than his technician. Having read the book and understanding the tale I, when discovering that the door to the lab containing infected mice had not closed properly after I stepped out of my suit, and fearing Dr. Singh’s response, took two shots of antibiotic cocktails, one for myself and one for the memory of Amadou.\nTwo hours later, alone in my room on board Sirius, I sneezed.\nThat was all.\nJohn Gale\nMaria, I am sorry.\nI thought to come home, to hold you, to touch you, to let the sun sink into my skin, turn me brown, but I cannot. You cannot see the destroyed station below me. You cannot know that it began with the body of Emily Parker, a middle-aged woman with dyed red hair. She was delivered to me by her parents, an elderly pair of Ta’La ethnographers who pushed her into my theater on the back of a silver cart. They told me, as we lifted her, that the Ta’La thought us callous because we mutilated our dead to learn how they had passed. They asked if I could be as gentle as possible with their daughter. As they spoke, Sirius orbited the dusty, red planet of Solle, a gift to the Earth Empire from the beings that saw us as cold and cruel; beings that let us rotate our personnel between the planet and the station, let us cut into the planet as we did our dead, examining it as we built atmospheric pressurizers on top of it, as we proved to them we could colonize the stars.\nOnly you are in my thoughts as I look upon the wreckage that my body now lies in. I wish we had done things differently. Parker followed her parents, or her parents followed her, I do not know which, but I felt your loss in their presence, so much so that while I noted the slight discoloration around the body’s fingers and the gentle swelling in the stomach, I did not fully comprehend it. I would have cut if the head of the Science and Research Department, Dr. Anu Singh, had not strode in. He wore a yellow bio-hazard suit and his breath echoed with every step.\nIn quarantine, the parents apologized.\n“We just didn’t think,” the father, Edward, said. His lined face sagged, as if the skin would drop away. “This is our first planet. Our—”\n“We were just—” Trish, the mother, paused. “She was our only daughter,” she finished quietly.\nMaria, I miss you.\nAnu Singh\nThe problem was simple: to that tall, skeleton race of nomads who wandered across the universe, we were biologically and culturally inferior. Their opinion was clear in the discoloration on Emily and Edward Parker’s fingers, but you could also see how they underestimated us, did not fully understand us, yet. Trish Parker and John Gale did not have the same discoloration and the slight bloating in Emily was singular. As were John Gale’s tumors, which were found inside the heart and argued a rapid onset with no pre-existing condition. Nothing suggested an epidemic yet, but after the death of a young boy who had no connection to Emily Parker, her parents, or John Gale, I took my concerns to the Station Commander, Bruce Cawell.\n“You can’t quarantine the entire Sirius, doctor,” he said, snappish in the way that elderly white Londoners are. A career soldier, his hair close cut and white, he sat before me in his sparse office and sipped water while the rim of Solle, a dirty, red-brown smear, grew outside. “It would panic people and only stop the planetside rotation from returning in nineteen days, days before, I might add, their food and water needs to be resupplied.”\nI tried to impress upon him the fact that we had no idea what had caused it.\n“We have five deaths,” he said, punctuating his diminishing patience by placing his glass down loudly. “It is tragic, but by your own admittance the boy’s death may not even be connected to the first four.”\nBeneath us is a planet with untold secrets, I told him. We bring into our quarantine labs rocks, soil, and the remains of anything we find that is interesting, but we do so like a child slapping blindly at blocks that need to go into a hole. The Ta’La tell us that once, they conquered thousands of planets in a history that they wish to step away from. That they instead, now, wish to help the universe, to grow it, but to do so with a vision we cannot understand.\n“I am aware that the Ta’La are not always thoughtful with their gifts, doctor, but Sirius is fitted with very expensive and very state-of-the-art filters and monitoring systems. With none of those tripped, you are jumping to conclusions.”\nI pressed him to acknowledge the possibility that a secondary infection, one that was droplet-based, could be carried through the system after being spread by sneezing or dust or mice.\n“Are you missing any mice?” he asked.\nNo, I told him.\nHe smiled faintly. “Perhaps we can cross that one out, then.”\nMy response, I admit, was not the most calculated. I have never dealt well with those who cannot see clearly. To my outburst, Commander Cawell straightened and his pale, cold eyes held mine. “Five people have died, doctor. I am not making jokes. Nor am I humoring you anymore. New diseases on our own planet are found all the time, but we do not panic then, nor now. Your belief that the Ta’La are responsible is misplaced.”\nWhen I began to argue, he said, “I suggest you return to your lab.”\nMy hands curled around the plastic handles, furious.\n“You are dismissed,” he said.\nOutside, I let out a frustrated breath. How could he be so blind? Already, I could feel a heaviness in the air, as if there was something new to it, something that we had not seen. Ahead of me in the hallway ran small air ducts, just as there were hundreds throughout Sirius, each of them linking back to a central system that was shared by everyone in the station. To me, it was already a beating, diseased heart, spreading the virus across the ship and my breath was a series of shallow, nervous gasps through my teeth as I made my way to my lab and the contamination suit within.\nI would live in it for six weeks, the longest of anyone on board Sirius, the longest of anyone who stands around me wordlessly now. Such was my prize for being right.\nBruce Cawell\nI did not believe that the Pakistani was right. It was a simple mistake, born from personal dislike.\nAt the time he approached me, Singh had been on board Sirius for just eight station months, an unpleasant replacement for the talented Dr. Ken. This far out into the system, colony stations are not given much choice about who is sent, and in my capacity of commander on this small bastion at the edge of civilization, I have worked with all kinds. The experience had made me more tolerant, though with Singh, it was if I was green all over again.\nHe arrived wanting to make a career for himself, a scientist who believed that it would take him a year to find a disease to make his name and gain tenure in a planet lab. He believed that the Ta’La were killers, that they were involved in our slow genocide, and he wanted proof of that to take back home. Within weeks, he was pushing his lab workers, demanding results that could not happen, and asking for tests that were nothing short of invasive in both privacy and decency from those who returned from Solle. I had already been forced to intervene on two separate occasions when the doctor overstepped his mark. With a limited intelligence and an even more limited moral compass, Dr. Singh had rapidly become detestable not just to me, but the entire Sirius crew.\nMy mistake was that I could not see beyond that.\nWhen his staff informed me that the morning after our meeting he had appeared at work in a yellow biohazard suit, having walked the public corridors in it, my first instinct was to lock him up. He was clearly unfit for the duty that had been bestowed to him. When I started receiving calls not just from within the station, but from the planet, demanding to know what ‘outbreak’ had taken place, I took two soldiers and visited Singh’s room after his scheduled hours. When I arrived, he was not there, and I unlocked the door to his unit to wait for him. Inside, I found it in disarray: the tables, chairs, clothes and bed were pushed up against the wall, hastily thrown to make room for a large map that covered the ground. It took me a moment to realize that it was Sirius itself, with five dots on it. The dots represented the paths that the deceased had traveled upon in their last day.\nIf it was airborne virus, I thought before stopping myself. With a shake of my head, I removed a chair from the pile against the wall and settled down to wait. Staring at the map for that time did not, I admit, help me believe I had made the right choice the day before, but I have already admitted my flaw and will not dwell on it. Perhaps events would have gone differently if I had remained there and stared at the map, if I had allowed Singh’s paranoia to seep into me, but an alert was sent to me that a new body had been found and that the doctor, in his suit, was standing around unsuited technicians and crew, securing the area.\nOnce there, I said coldly, “You are frightening people.”\nWe were standing in the bedroom of the deceased, beneath an air duct above the door. Singh, his eyes on it at all times, moved to stand in front of the window, the lower half of which was filled with the dirty shape of Solle.\n“I will not be quiet,” he replied, his voice carrying an echo from the suit. “This body, this new death—this was not a man connected to any of the previous five. He was not even in the same part of the station! This does not affect just us, but those on Solle too!”\n“Keep your voice down, or I will have you locked up to keep calm.”\n“You would not dare!”\nI did.\nAfter I had placed him in his cell, Dr. Singh refused to remove his suit. This information, however, I used against him. I showed images of him to calm a panic that was emerging in Sirius and to assure those planetside that they could return normally, that supplies were fine. For a week, as normality returned, I was vindicated. But the deaths continued and Singh’s words to me were repeated in whispers by others until they filled the station. When I returned to Singh, he was still in his suit, but he had nothing to say to me. To others, he would speak, but I was given only silence, and as pains began to wrack my body, I was relieved from command and spoken to by no one.\nA week later as I lay shivering in a hot bath that scalded my skin, my last sight was the burst of pressure as escape pods launched.\nAmanda Neal\nI was forced to quarantine the men and women who fell from Sirius not because of their infected state, but because I needed to ration our food and water and control access to the dig sites. Solle City, the only city on Solle, was a sprawling, skeletal creature filled with the remains of a conquering nomadic race and a second, extinct race that the Ta’La did not acknowledge in their histories. If not for the bones, you would believe the Ta’La had found the planet empty. The threat posed by the angry escapees, then, to this knowledge was unacceptable. In my arrogance, I believed that there was much to be learned about the Ta’La through those remains, much that would make our dealings with them easier. Five years ago, I stood before a Ta’La and watched the slow blink of its eyes, its naked, genderless body offering a cold indifference to all conversation made to it and I knew that if we wished to survive in a universe that was not just us, we had to know everything we could of those around us. We could not afford to view these creatures as ancient killers turned galactic shepherds.\nAfter overseeing the quarantine, I stepped into my office and called Sirius privately. As the call was put through, I laid the blame for the situation squarely at the feet of Dr. Singh, a detestable and incompetent man who, for a brief moment, I had thought would be an ally against Commander Cawell. Oh, how I would be eating my words again as I banded with the British soldier against the doctor.\nTo my surprise, however, the call connected me immediately with the image of Singh, sitting in a dirty yellow contamination suit.\n“What is going on, doctor?”\n“Neal.” He smiled, but it was a sickly. “How good it is to see you.”\n“I don’t have time for this. I want to be briefed on what has happened and what is being done to ensure we can feed the people here.”\n“You’ve met the Ta’La.” Singh’s eyes closed, and he swayed; when he lifted his lids, the lack of balance in his physical form was present there, too. “Tell me, are they really like birds? People compare them to birds in the literature, and always favorably. They compare them to hawks and eagles, but they’re wrong. I see that now. They should be compared to myna. That’s a bird that drives off native birds with its violence, drives them off so that when it leaves an area—if it leaves an area—there is nothing but emptiness left behind.”\n“What has happened on Sirius, doctor?”\n“Emily.” A faint smile crossed his face. “That is what I call it. It is airborne. That is the most logical conclusion. There are no survivors and no serum and it manifests differently in everyone and leaves a complete genome in its victim, complete where it had before been incomplete in us since the dawn of time. It’s not the same genome, either. That is what made it difficult for me to understand. It finds different strands in every single person.”\nI frowned, but said nothing.\n“It is a swarm,” he continued, his voice given rhythm by the drugs he had taken. “A swarm of virions that completes what is inside us.”\nI was thirty seven when I met my first Ta’La, when I stood before it and watched as a man I admired tried to convey to it the importance of research, the responsibility we all had—all creatures had—to understand themselves and those around them. Afterward, he said that the being did not understand the double meaning of his words, the veiled threat that was implied in that small office, in that pale, peach-lit room where we were gifted Solle.\n“Doctor, doctor,” Singh whispered, pressing the glass of his contamination helmet to the screen. “You are alone, now.”\nAnd then the screen went black.\nReverend Packer\nThe Lord will have to forgive my cowardice.\nI have prided myself on honesty, of not flinching away from difficult situations, of being true to the Lord and the tenants He has left us, especially here on the edges of civilization amongst the Godless. Yet, when Dr. Neal approached me and asked—through her growing fever—if I would return to Sirius, I agreed only because I thought it would save me. I could think of nothing else. I rejoiced when I was told that I would be given one of the few contamination suits we owned, that I would be taking a quarter of our remaining food and water, that I would be allowed to read the notes left by Dr. Singh and have access to the research done in the station. If a cross were but real upon me now, I would feel its weight, and be chastised by my thoughts.\nI shared the shuttle with Richard, a young blond man who had arrived with the colony on a scholarship from the military. He was the only ‘scientist’ capable of making the journey and it was to him that the deciphering of the notes and saving us would fall. I was but a pilot with a desire to learn. With notes from Dr. Neal strewn around us, we spoke little as we approached the orbiting mass of Sirius, until it was time to voice our fears at the sight the large, circular station adrift brokenly, as if a careless child had dropped it from a great height.\nIn awkward, slow movements, we drifted in bulky space suits from the shuttle to the exposed entrance of Sirius. Debris floated inside: frozen chairs, brittle boxes, cracked glasses. They broke beneath my hands as I pushed them aside to make our way to the command deck. It was there that we found, lodged against the ceiling in a tattered contamination suit, the remains of Dr. Singh. With a clumsy sign of the cross, I turned away from the terrible visage that he was, and tried to bring power back to the remains of the station.\nI could only find a small amount, enough to bring up the design map of Sirius. Disappointed, I made my way to Singh’s laboratory, located in a fragment that curved above the command center. It took an hour to navigate to it, a journey that saw me ticking off the hopes and dreams I had. No wife, no children. I could hear Richard’s voice through the suit, murmuring, and as we made our way through the quiet corridors, his words a repetition of knowledge he dare not forget, a sign of faith I no longer had. Finally, we reached a large white room adorned by floating beakers and frozen fluids. There was no power here, either, and my hope that I would be able to bring up a very basic amount to read what Singh had kept on file was not one that the Lord granted. Instead, there were only papers that crumbled beneath my every touch.\nI became sick when we returned to the shuttle. I took only one kindness, words from a young man who tried to treat me even as he became sick, that all signs of the infection pointed to a virus of such a virulent nature that, by killing us so quickly, it was also killing itself.\nBakana Mer\nI am the first and the last. The last of the first people that watched the huge, shuddering bulk of the Ta’La cruisers press through the atmosphere of our home. The first people who experienced cruelty deliberate in the diseases sown into their gifts, the first who watched a people and culture destroyed so another could take it. Irony, oh irony, I am told by those new spirits, those who arrived here to take the Ta’La gift, that their ancestors did the same, years ago. Then, they gave blankets riddled with diseases and, like the Ta’La, took another’s home to expand their own culture. As I listen to their words, I am unable to offer sympathy. They have died, yes, died from a stain rooted deep into my world, a world that is no longer filled with water, that no longer shimmers, and they are the victims to the thoughts of domination that motivate the Ta’La; but they, in coming to my home, in accepting my world as their gift, have shown that they are nothing but a different shade of the people who killed me.\nHistory, I murmured to my child, does not chart a course in singular events, never to be repeated again.\nHer answer, I knew, was no longer one she could grow into.\nBen Peek is the Sydney based author of three novels, Twenty-Six\nLies/One Truth, Black Sheep, and most recently, Above/Below with Stephanie Campisi.\nHis short fiction has appeared in numerous publications, including\nanthologies and magazines such as Paper Cities, Polyhony, Leviathan, Forever Shores, Overland, Aurealis, and in numerous Year's Best anthologies. He has a doctorate in literature and has published reviews and criticism, a psychogeographical pamphlet, and an\nautobiographical comic, Nowhere Near Savannah, which was illustrated\nby Anna Brown. His collection, Dead Americans, is forthcoming from\nChiZine Publications."}