{"fingerprint": "CRO6XctRT5A6uX9IWymyiEUnnDc=", "sitename": "Clarkesworld Magazine", "title": "Sunless Worlds by Tomas Petrasek", "author": "Tomas Petrasek", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/petrasek_10_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sunless Worlds by Tomas Petrasek", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Sunless Worlds\n Life stories of planets seem to be as eventful as life stories of men. Even a brief glimpse upon the known exoplanets shows that even such large and respectable heavenly bodies are not spared from the ruthless struggle for life. There are many cosmic phenomena that can spell doom for a planet. Stars can destroy or expel them when they die explosively, but often, planets become their own enemies—during their youth, when they grow and migrate, they often come too close to their siblings and get into a conflict of gravitational perturbations. Resulting upheaval may be world-shattering indeed. In a previous article, we explored the fate of planets surviving on eccentric orbits, which is one possible outcome. The other worlds unlucky enough to be thrown out into the void are usually considered lost for good, doomed to slowly freeze in the infinite darkness and eternal oblivion. But do they really give up so easily?\n Free-floating interstellar planets are also known by many poetic nicknames such as rogue, nomadic, orphan or even Steppenwolf worlds. Strictly speaking, they are not planets at all, as they do not orbit around a star anymore. The term “planemo” standing for “planetary mass object” is recommended sometimes. But the term “planet” means “wanderer” in ancient Greek, which fits those nomads well, maybe even better than the ordinary planets going in circles. Besides the many names, hardly any facts are known about the real likeness of those bodies, as they are hard to discover and even harder to study. We can be reasonably sure that they are common, but without observation, their nature and numbers remain highly uncertain.\n Consider a gloomy vision: a planet similar to our own, left alone in the dark. Such a world would cool rapidly: thickening crust of ice would cover the oceans, and even the atmosphere would eventually collapse into frozen state, maybe except a thin envelope of noble gases. Complex life would become impossible—everything dependent on sunlight or photosynthesis-generated oxygen, which means almost all multicellular life, would be forced to extinction. But the internal energy of the Earth, the primordial heat trapped in the core and the incessant decay of radioactive elements, would maintain liquid water in the deepest ocean trenches, in microscopic pores of rocks and in rare volcanic oases. Bacteria, archea, and some eucaryotes might thrive there, creating a biosphere not unlike the hypothetical biospheres of Mars or Europa. However, the classical criterion of planetary habitability, namely, the presence of abundant surface water, is not met.\n David J. Stevenson from California Institute of Technology in Pasadena was the first to notice that young protoplanets ejected even before they got any chance to mature must be quite different from such “frozen Earth.” Because they are so young, they have warmer interiors and ample reserves of radioactive elements. Furthermore, they can have thick insulating atmospheres of light gases. In our Solar system, we observe atmospheres of hydrogen and helium only on gas giant planets, which were massive enough to keep them in spite of solar wind, heat, and ultraviolet rays. But even Earth- or Mars-sized planets may retain light gases from the primordial nebula in substantial amounts before their parent star ignites and sweeps them away. In his 1999 study, Stevenson estimated that Earth-mass planets should be able to keep nebular atmospheres constituting up to 0.1—one percent of their total mass! The point is that the planets which are ejected early enough should never lose these massive nebular envelopes, which would retain their internal heat as an insulating blanket. In this case, geothermal heat alone could be sufficient to maintain liquid water oceans on the surface. It works just like the greenhouse effect on Earth, only the heat is not coming from the sun, but from below, and the amount of greenhouse gases counts in hundreds or thousands of atmospheres.\n The lower atmosphere would exhibit convection, which means weather. In increasing altitudes and decreasing temperatures there would be cloud layers made of water, ammonia, and methane. The upper atmosphere would be clear, calm, and frigid, with temperatures around thirty Kelvins. The surface environment would certainly be conductive to life, as organisms thrive under similar pressures in our oceans and hydrogen and helium are not poisonous. It would be dark down there, however. No starlight could pierce the thick gaseous envelope, and the only source of light would be an occasional lightning or volcanic eruption. The sources of energy available to living things would be limited to chemical compounds generated by geothermal processes, radioactive decay, and maybe electrical discharges or cosmic rays.\n The Earth is bathed in oxygen atmosphere, and most living things seek reduced compounds and oxidize them to gain energy (in our case, the “fuel” is plant sugars, but there are bacteria oxidizing inorganic matter, such as iron or hydrogen sulfide). On the rogue planet life of this kind would not work at all, as the atmosphere would be reduced, and hydrogen-rich. Instead, organisms would seek rare oxidized molecules. Trace amounts of oxygen could be created when radioactivity breaks down water molecules, and volcanoes could emit carbon dioxide, which could be used by methanogenic bacteria that transform it to methane and water by combining it with hydrogen.\n Even on a highly radioactive and volcanic planet, energy sources would be poor, and regardless of open seas of warm water, any organisms living there would be scarce and simple. Although sunless planets may be common, just a small fraction of them would have an atmosphere just right to keep the surface neither too hot nor too cold (although this is also a matter of time, as even the hot planets would cool down eventually as they lose their internal heat).\n The study of Abbot and Switzer (2011) considered airless, ice-covered bodies. They found out that the ideal planet of this kind should be larger than Earth (to provide more heat) or be more water-rich (thicker oceans leave more room for thick ice blankets on the surface and liquid water below) or both to maintain large amounts of liquid water and possibly life. Even Mars-sized planets with oceans under ice become possible with a layer of frozen CO2 on the surface, because it makes an excellent insulation even in the solid state. And as other authors have shown, with chemicals (salts or ammonia) serving as antifreeze, even Pluto-sized bodies can maintain layers of cold liquid inside.\n The recent imagery of Pluto and Charon supports this view, as it shows young craterless surfaces, as would be expected in bodies hosting underground oceans and substantial sources of internal energy. Tidal heating from interaction between several orbiting bodies would help, too. A moon on an eccentric orbit may provide the planet (and itself) with a substantial, but only temporary heating, lasting up to hundreds of millions of years, before the orbit is circularized. That’s nice, but biospheres probably need longer timescales to develop and thrive. More complex systems of multiple bodies would be perhaps better suited to provide a reliable source of tidal heat.\n Could we detect planets lost in space? Gravitational microlensing (observing the unlikely occurrence when the gravity of the planet bends the light from a background star, making it brighten for a while) is the method of choice, and first bodies which are probably rogue giant planets have been found this way in 2011. The problem is, that microlensing is a unique event, offering us a glimpse that will never repeat, and there is no way to gain more knowledge about the exact nature of the objects in question. Young and hot giant planets (and brown dwarfs) can be detected by their infrared glow, but the planets that interest us the most, the small and cold ones, emit virtually no radiation, except for a weak microwave and far infrared signal. If they have a magnetic field, its interactions with interstellar medium or planetary satellites could be a source of radio emissions, offering another way to discover them. But our instruments are not yet powerful enough to achieve this goal, unless we are lucky and have such a planet directly in our cosmic backyard.\n The interstellar space is probably full of scattered objects of various sizes, ages, and compositions, even more diverse than the familiar bodies of our Solar system. And they should be plentiful. Even our Solar system, where the planets have gotten along quite well, without major conflicts, might have lost a planet as large as Neptune (and likely many more smaller ones), as was shown by the Nice model of Solar system evolution. In other planetary systems, the losses might have been much more dramatic. In the Galaxy, the number of rogue giant planets should be at least comparable to the number of stars, with uncountable myriads of smaller bodies ranging from super-terrestrials down to stray boulders of ice or rock. Some of them became rogues as stillborn embryos, still shrouded in the envelope of primordial gases, while others became nomads in their old age, when they abandoned their dying stellar parents. Rogue giant planets would be almost impossible to distinguish from brown dwarfs, which differ only by their origins—they are born from their own nebula and therefore can form independently on a star, unlike a true planet.\n This “interstellar jungle” can be especially interesting if one considers the implications for interstellar travelers. Even the simplest life forms could do it, drifting frozen through space either freely or protected within comets or meteorites. Although the known organisms could conceivably travel this way, they most probably would not survive—in the frozen state, even the toughest of them would be slowly killed by ionizing radiation during the eons necessary to cross the interstellar gulf. But what if they hitched a ride on a planet? In a warm liquid environment, bacteria fight radiation quite well, and they could live there happily for billions of years—they could travel to another galaxy without even noticing. Dispersal of life from such bodies to other worlds would be next to impossible, however.\n For macroscopic, intelligent travelers, rogue planets could make vital stops on the dangerous voyage to other stars, or even respectable colonization targets on their own. For any civilization capable of building artificial habitats and mastering nuclear energy, interstellar objects would be as valuable as any “normal” planet. That would make interstellar traveling a much less formidable task than we usually think.\n Maybe the (sunless) day will come, when a human or post-human will set his foot on a barren, cryogenic surface in the dim light of the Milky Way, to make his living in the eternal night. Will there ever be intelligent beings daring enough to dive into the murky depths of a superdense atmosphere, to disturb the billions-years-old darkness of an orphan world and to search there for a spark of life?"}