{"fingerprint": "dqDG5VP2i3sUG8yNBYQXS5xLT10=", "sitename": "Clarkesworld Magazine", "title": "The Oracle Spoke by Holly Phillips", "author": "Holly Phillips", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/phillips_06_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Oracle Spoke by Holly Phillips", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5350 words, short story\n The Oracle Spoke\n Lt. Caldwell stood in the stone hall outside the kitchen and strained his ears. The men of his platoon were making a last sweep of the manor, and he could hear them slamming doors and cupboards. They were looking as much for food, he knew, as for hidden enemies. Outside, he could hear the distant thumping of artillery and the melancholy whinny of a horse scenting the manor’s stable. None of these was the sound that had shuddered through him. Though in memory the call was as distant and unimaginable as the music from a dream, he knew it had been his name, spoken in a voice that echoed in his gut if not in his ears.\n Dexter Eugene Caldwell.\n No one in his platoon would call him by his full name. He touched the holstered revolver on his belt, and walked slowly down the hall. It had been days since he’d snatched more than an hour of sleep, and his bones were still ringing from the fight to take the manor. Caldwell’s platoon was an advance party, meant to clear the way for the General’s main column to flank the artillery line, and the enemy had been surprised. The fighting had been fierce. He himself had killed the officer in charge—no heroic meeting face to face, but a lucky rifle shot from the shelter of the stone lion at the foot of the stairs. His men had already found the weapons and whatever papers had survived the enemy’s hasty fire. Now they were gathering in the foyer and there was nothing left to look for but the echo of his name.\n A tall cupboard crowded the hallway near the door to the front of the house. It was badly placed and cast a deep shadow. Caldwell drew his revolver, regretful for the rifle and bayonet that he’d left with his sergeant. He eased forward. There was no sound but for the background of the war, which he scarcely heard, and the crunch of his boots on cinders spilled across the flagstones. Then even that stopped. The floor just before the cupboard was clear. Caldwell made a perfunctory check of the cupboard’s far side, then stepped past it to the door.\n “Sergeant! A moment of your time, if you will!”\n “Sir!” The sergeant appeared, a crust of bread in one fist, an electric torch in the other.\n Caldwell took this prescience for granted. He said, “Give me a hand with this,” and hooked his fingers between the back of the cupboard and the wall.\n The sergeant stuffed his crust in his cheek, the torch in his belt, and crouched to do the same near the floor.\n “On three,” Caldwell said. On three they heaved. The cupboard, surprising them with its emptiness, rattled over the flagstones and crashed against the opposite wall. Embarrassed that he hadn’t thought to look inside, Caldwell held out his hand for the torch without looking at the sergeant. The sergeant handed it over and slid his rifle down from his shoulder. Caldwell undid the bolt and opened the door the cupboard had hidden.\n The torch light revealed a trapezoidal room, its ceiling stepped like the stairs that rose from the foyer to the story above. It was dusty, its corners thick with cobwebs, and there was a woman lying unconscious on the floor. Caldwell crouched over her, playing his light across her face, aware that the sergeant was braced in the doorway, his rifle aimed.\n “You might see if she’s armed, sir.”\n She had a pale, triangular face with shadows around the eyes, and hollows at temple and cheek. She looked young, but there was something of experience about the mouth. There was no doubt she was alive. Her veined eyelids flickered against the light.\n “Sir.”\n Caldwell set the torch down by his knee so the beam pointed at the ceiling and pulled the woman’s arms from her sides. Her hands were small and cold, the knuckles dark with dirt or bruises. They were empty of weapons. Despite the chill, she wore only a thin blue frock, no stocking or shoes, and her hair was loose and tangled. Caldwell could find no sign of injury. Perhaps she had merely fainted.\n “All right, sergeant.”\n “Sir.” The sergeant slung his rifle over his shoulder and warmed his hands in his armpits. “Dirty bastards locked her in, eh, sir? Filthy westerners.”\n Caldwell’s mother had come from a town twenty miles from here. After three years of a civil war, he barely registered the insult. He tossed the torch to the sergeant and pulled the unconscious girl to a limp sitting position. She was smaller than he’d thought, but even her slight weight trembled his knees when he put her over his shoulder and stood.\n “Taking her with us, then, are we, sir?”\n “You thought maybe we’d leave her here with the rats?” Caldwell snarled.\n The sergeant stood back to let him into the hall. “No, sir,” he said mildly.\n “Then find me something to wrap her in. And stir out the men, we’ve still got to be at the rendezvous by dark.”\n “Yes, sir.” The sergeant jogged towards the front of the house. Lt. Caldwell followed on behind, still puzzling over the mysterious calling of his name. It couldn’t have been the girl: even if she could have seen him and made herself heard, he had never set eyes on her in his life.\n Cassandra woke, but did not move. Judging by the sounds and smells around her, she was in a damp canvas tent in the midst of a camp full of men. She supposed the Loyalists had taken the manor, and that de Berin and his men had not had time to murder her before they were captured or killed. More likely killed, given the way this war was going. There was a spike of pain in her head, and a fractured rasp in her throat. The Oracle had spoken. She felt longing for the dark silence of her cell, and the familiar pall of despair.\n After a while her bladder complained and she sat up. There was an edge-of-night glow in the sagging canvas walls, enough to make out the bulky shape of the greatcoat that lay heavy on her legs, though not its color. She was on a low cot in the middle of the small tent room. The walls were dark with stains and the stink of mud was all-pervasive. She put her bare feet tentatively over the edge of the cot and flinched at the touch of cold china on her heel. Someone had put a chamber pot under the cot. The foresight and practical kindness behind that gesture astounded her. It made her ashamed for despairing at her rescue. When she had peed, she pulled on the heavy wool coat that was far too big for her and pushed open the flap of the tent.\n The air was charcoal gray and thick with mist, but she could see the expanse of the camp. Orderly rows of tents stretched off to either side, ranging from low pup tents to the large straight-walled affair that stood not far away, its drab walls lighted from within. She had little doubt where she was. The Loyalist General was famous for preferring his camp to the abandoned and often ruined houses in his line of march. Despair swept over her redoubled, and a bitter anger. She would have gone back inside, except the door flap of the big tent swept open and she was seen by the men who emerged.\n “Good evening,” said a cultured voice. A man stepped forward, the light from the tent illuminating from behind his tidy uniform and smooth gray hair. “How are you feeling?”\n “Well, thank you,” she automatically replied. Her voice was a ragged shred of itself.\n The gray-haired man stepped close. “Our medico looked you over, I hope you don’t mind. The good news is that he didn’t spot any damage. I take it your durance vile amongst the enemy wasn’t too vile?”\n His face was in shadow, but his attention was keen. She shook her head, not knowing what to say. It was a lesser hell than others I’ve known?\n He waited patiently for her to speak. One or two of the men who’d come out with him squelched off on their own affairs, but there were four who stood at his back and watched. Eventually he said, his voice so quiet it might have been mistaken for gentle, “I hope you’ll find our hospitality more generous. Why don’t you come and take some tea, while we have a little chat.” He turned his head and said someone’s name, then turned back to her. “But how very rude of me, I haven’t introduced myself. Peter Karrian, General to His Majesty’s Thousand. At your service.”\n Her hand closed over the damp edge of the tent flap. By tradition, by law, there were words she must say. She did not say them. She whispered, “Thank you for your hospitality, General. My name is Cassandra Raythe.”\n “Miss Raythe,” the General said with a courtly little bow. “A pleasure. Do let Lieutenant Caldwell help you across the mud, I’m afraid my quartermaster hasn’t been able to find any shoes dainty enough to fit.” He turned back to his tent.\n The General was being absurdly polite to a captive, but then, he was a courtier . . . as de Berin had also once been.\n The man he’d called, Lt. Caldwell, came up to her and held out his hand. “Miss. Best if I carry you over, there’s God-knows-what in the mud.”\n It was a moment before she could force her hand to let loose from the canvas flap.\n The distant boom of artillery guns made an odd background to the delicate rattle of china cups. Cassandra did not marvel at them. De Berin, too, had been well supplied with the amenities. There was something about power, she thought, that blinded these men to the wretched incongruities of such things in such a time. But she was grateful for the hot, milky tea that soothed her throat.\n The General said, “I do realize you’re still suffering the effects of your imprisonment, but I’m afraid I must ask a few questions. Anything you can tell us about the enemy could prove invaluable to us.”\n Speak! de Berin had screamed at her. You damned selfish, stubborn bitch!\n She nodded. The General sipped, then set his cup precisely in its saucer. He said, “Lieutenant Caldwell’s investigations at the house where you were found suggest it was the False Prince’s advisor, the Comte de Berin himself, who held you captive. Is that correct?”\n Cassandra nodded again.\n “Why?”\n Of course she had known this was coming. She said, her eyes on the cup in her hands, “Surely it’s obvious.”\n There was an obscure shifting among the men around the General’s map table: they were gentlemen, all. Except . . . she glanced at them through the fringes of her eyelashes . . . except for Lt. Caldwell, whose accent had been country, and who watched her from a shadowed corner, his attention fixed and without embarrassment.\n And except for the General, who looked gravely sympathetic and said, “I beg your pardon, Miss Raythe, but the doctor’s examination suggested otherwise.”\n Prodded by a man’s hands whilst unconscious. The twinge of revulsion she felt was insignificant next to the invasions, the violations profounder by far, that she had known half her life.\n And then, as if the very thought conjured it up, she felt the Oracle stir.\n “No,” she said.\n The General’s expression did not waver, but his eyes were pale and cold. “I am sorry,” he began.\n But Cassandra had not been speaking to him. She dropped her cup on the table; the fine china broke into three shards and spilled milky fluid across the surface. She put her hands flat on the table and stood. Her heart pounded as if it, too, would break itself into three. She was desperate to run, to hide . . . to be silent . . . but her body was no longer hers. Men’s voices fled. Lamplight became a hallucinatory halo. Her skull bled darkness across her mind. The last thing she saw was the three china shards, eggshell white painted with violets, caught like fallen petals in a tea-colored river of wood.\n Then the Oracle Spoke, and she was gone.\n Lt. Caldwell kept watch in the Voice’s tent. The General, having a courtier’s sense of the fitness of things, had given her over to her rescuer’s care. Watching her sleep, he felt himself slide beyond the need for rest, into some visionary realm inside his own head. He sat in a camp chair with his boots propped on the corner of her cot, arms folded on his chest for warmth. In his mind he held the sound of the Oracle’s Voice proclaiming destiny in the General’s tent beside the sound of his name echoing through the death-full manor, and found them paired. The implication—his name in an Oracle’s Voice—he left to consider another time.\n Instead, he contemplated that Voice. It was a sound like a storm: the hush of wind in trees so loud it nearly hid the thunder, or the hiss of waves so pervasive, it nearly drowned the breaking of the surf. But it was also a woman’s face, a look of despair that bled away to a mask, blank and white as new plaster, with blue holes where living, grief-shadowed eyes had once been. A mask that hid a power which no one in the world understood, and which everyone in the world coveted. There was no question, now, about why de Berin had kept her captive. Only about what she might have said during her captivity.\n The night passed. Dawn dulled the candle by his chair. Reveille rang out.\n When she woke, the Oracle’s Voice, she turned her head and looked at him as if she’d known in her sleep he was there. She said in an empty husk of a whisper, “What did I say?”\n Reconnaissance teams were sent out, observation posts established, lines of communication laid down. The General’s lorries trundled off through the mud to meet the supply convoy from the coast, and all morning officers came and went from the General’s tent, no doubt to receive the benefit of the Great Man’s interpretation of the Oracle’s words.\n A dynasty grows its roots in the memory of earth.\n A tree must be buried deep before he may be crowned with sky.\n Let fire thin the forest.\n Then shall wind and sunlight follow.\n Poetry, Caldwell thought as he stood in line in the officers mess. Poetry, and a justification for war . . . perhaps. Having been promoted from the ranks, he did not have the usual officer’s education. To hear the toffs around him speak, a boy couldn’t escape a public school without having memorized every Oracular Pronouncement ever recorded, along with interpretations, reinterpretations, theses and theories. It relieved his mind to know that none of that learning did a sweet bit of good to make sense of the Voice’s words.\n It was less reassuring to know that, according to historical fact, no one had ever interpreted a divination exactly right. Somehow, some hidden meaning always came back to throw the fat in the fire.\n The Voice was sitting cross-legged on her cot when he returned with her breakfast. She’d braided her hair and wrapped the looted greatcoat around her, and looked merely thin and defeated, not at all like a receptacle of power. He handed her a tray with porridge and tea, and settled with his own on the canvas chair.\n “Thank you,” she whispered, and took a careful swallow of tea.\n He ate, hungrily, and tried not to eye her untouched bowl when he was done. “You should eat,” he finally said, “for the warmth if nothing else.”\n She looked at the tray as if she hadn’t noticed it till now. “I’ve no appetite.” She set it beside her on the cot. Then, as if the idea had approached from a long way off, she looked at him and said, “You might have it, if you’re hungry.”\n Food was too scant to be proud about it. He took her bowl and ate.\n She said, “You were the one who found me.”\n He nodded.\n “How?”\n He swallowed. “You called me. You said my name.”\n “I did?” Surprise lit her face, then died. “The Oracle did.”\n Caldwell chased his breakfast down with a last swallow of tea, and cleared his throat. “The General will be asking—he’s busy, now—but he’ll want to know what you said to de Berin.”\n “The Oracle speaks or is silent as it chooses. It chose to say nothing to him. As for myself,” she flashed him a look as bitter as the thread of sound in her whisper, “I said to him what you’d expect, being a prisoner to no end.”\n “How do you mean? A prisoner to no end.”\n She picked up her cold tea and drank, twisting her mouth in apparent pain. “If the Oracle had anything to say to him, I would have walked barefoot across half the world so it could speak. I have as much say in the matter as . . . as the earth has in the matter of rain.”\n “So when you called, when the Oracle called, in the house . . . “\n “If it did not wish that I speak for it here, no doubt I would be there still.”\n He looked at her, comprehension beginning to dawn. The picture of the under-stairs cupboard where she’d been hidden was very clear in his mind.\n True to Lt. Caldwell’s prediction, the General asked Cassandra what de Berin had heard from the Oracle. He’d had her brought over during a lull in the constant stream of messengers that passed through his tent. He gave her tea, and food she did not much want, and every courtesy, but he did not believe her answer.\n “Nothing, madame? How long were you in the Comte de Berin’s custody?”\n “Weeks. What has that got to do with anything?” she answered rudely. Caldwell’s curiosity had been less trying, perhaps because there had been no greed in his eyes.\n The General gave her a slow blink like a lizard’s. Indeed, there was something reptilian about his thin, dry, pale face. He said, “It is remarkable to me that in all that time he could not persuade you to speak.”\n “He did not need to persuade me to speak at all. I told him often and at length how useless it was to try and coerce the Oracle. He, like so many others, was simply unable to comprehend the difference.” The implication, like her fulminating stare, lingered.\n The General absorbed it in silence. Then he sat back in his camp chair, satisfaction curling the corners of his narrow mouth. “So. The Oracle had nothing to say to the False Prince’s chief advisor . . . if we can believe you, madame.”\n “I cannot lie about such things.”\n “Yet you did not proclaim yourself to us, as I believe you are bound by law to do.”\n “The Oracle’s Voice is outside the law for a reason,” she said, though in fact he was right.\n “But not outside the traditions of your forebears,” he countered, knowing he was. “I wonder why you tried to keep yourself hidden from us when we had rescued you?”\n “I wonder why you imagine yourself so different from de Berin?” she shot back, her voice cracking into sound halfway through. “I was in the Sanctuary at Felmouth when it was blasted by shells. The Comte was equally sure he was rescuing me. I told him what I was, and he never let me rest for a minute after.”\n “But you have spoken for me.”\n “I have said nothing!” Frustration drove her ruined voice back into a whisper. “It is the Oracle that speaks. Not I. Why is this so difficult to comprehend?”\n He considered her for a time. There was a constant quiet stirring in the background, officers who took the opportunity to exercise their curiosity and snatch a bite to eat. The General turned his attention to his own meal. Then, having eaten a little, he said, “I am curious. What do you make of the prophecy?”\n Cassandra crumbled a bit of journey bread on her tin plate. “I’ve forgotten what it was.”\n He looked at her, disbelieving. “Forgotten!”\n “I never hear it,” she said without looking up. “Lieutenant Caldwell told me, but I forget. Something about trees.”\n The General considered this new datum, then recited, as matter-of-factly as if he were dictating a note to his quartermaster, “A dynasty grows its roots in the memory of earth. A tree must be buried deep before he may be crowned with sky. Let fire thin the forest. Then shall wind and sunlight follow.”\n “The King’s dynasty? The False Prince’s?” Cassandra looked at him. “Yours?” She shrugged.\n Thoughts flickered behind the General’s eyes. “And the rest?”\n “The usual nonsense. It means nothing to me.”\n Someone choked on a crumb. Someone else laughed. The General said slowly, “I do not understand you, madame.”\n “I know,” Cassandra said wearily. “No one ever does.”\n Caldwell looked in on her some time after the bugler sounded Taps. The General was rumored to be somewhat disenchanted with his seer—Caldwell had been, thank God, sound asleep during their noon meeting—but no one had rescinded the order for him to stand guard. The heavy cloud cover pressed blackness down upon the camp, shrouding even the flashes of light from the artillery lines ten miles away, but the rain had stopped for a time. The Voice’s wet tent glowed like tortoiseshell with the light of the lamp inside. Caldwell cleared his throat and scratched on the tent flap.\n “Who is it?”\n Her voice was as broken as a telephone line in a windstorm. Feeling obscurely guilty, he said, “Caldwell, ma’am. Just making sure you’re all right.”\n “Thank you.”\n “I’ll be around if you need anything.”\n “That isn’t . . . “ . . . necessary, he thought she meant to say. But instead, after a pause, she said again, “Thank you.”\n He supposed she would know the two faces any guard wore. He pulled his collar high against the chill, checked the flap on his holster, and asked himself who he was fooling. He wasn’t there to keep her prisoner any more than he was there to keep her safe. How could she escape from the middle of the General’s camp when she didn’t even have any shoes? What harm could find her there? Even the most desperate and depraved private was hardly going to make an attempt on the Oracle’s, and General’s, Voice. No, Caldwell was there to listen if the Oracle had anything to say, and probably she knew it as well as he. The image of the closet came back to him, the bolt on the door, and the cupboard hiding even that.\n He’d been standing guard not more than an hour before the rain resumed. It fell in a cold, light, liquid fall, pattering on canvas and mud, soaking the shoulders of his field jacket. He pulled his collar higher and tried to keep his mind off the lighted tents all around him.\n “Lieutenant?”\n The whisper from the tent at his back was so soft it was nearly lost in the rain.\n “Lieutenant Caldwell. Are you still there?”\n “Yes, ma’am.”\n “It’s raining, isn’t it?”\n He cleared his throat. “Yes, ma’am.”\n “Perhaps you’d better come in.”\n The words shivered down through all the hollows of his body, like a chill and not. He said, almost as quietly as she had spoken, “Perhaps I’d better not, ma’am.”\n The rain fell, softly, softly, patter and hush.\n She said, “I wish you would.”\n He came in looking as if he suspected a trap. The lamp, turned as low as it would go, carved his country-man’s face out of shadow. Cassandra pulled the blankets close to her chin and said, “It doesn’t seem right for them to put you on guard. If I need guarding at all, surely a regular soldier would do?”\n Lt. Caldwell settled into the camp chair by the foot of her cot. “The General has his own ideas about such things.” He took his cap off and shook the rain carefully onto the floor.\n Cassandra was achingly tired, and irritable for feeling responsible for this man’s discomfort. It wasn’t as though she had any more choice in this than she had in anything else. But then, asking him in had been a choice. She bent one arm beneath her head and said, “You didn’t tell them about the Oracle calling your name, did you.”\n He shifted, looking as if he didn’t know where to put his hands, or his eyes. “No.”\n “Why not?”\n “I couldn’t think what it was at the time. You were out cold when we found you and it just never . . . ” He shrugged. “You know there’s an Oracle in the world, but you never think it’d ever have a thing to do with you, anymore than you think God will, I don’t know, pick you out to announce the second coming. And I never supposed the Voice would . . . “\n “What?” She smiled. “Look like a skinny, tired-out girl?”\n Caldwell looked directly at her for the first time, and smiled. “Since it’s you that says it.” A silence settled between them, filled up by the sound of the rain. He dropped his eyes and said, “I wondered, though. I’ve never heard of anyone it called by name.”\n Cassandra looked at the tent’s sloping roof. “No.”\n “So why bother with my name? How does it know?”\n “How does it know anything?” She put her hands over her eyes. “When I was studying with the old Voice, before she died, she said it was a manifestation of the divine will ordering affairs among men. But I’ve read the histories. There has been more war, more murder, more hatred and anger and tragedy surrounding the Oracle’s prophecies than I can even comprehend. I don’t want to lay that at the feet of God. Sometimes I think . . . “\n “Sometimes you think.” His whisper was as faint as hers.\n She looked at him, knowing she’d already said more than she should. “Be thankful it didn’t want any more from you than an open door.”\n After a long silence, he said, “You want me to put out the light?”\n “Yes,” she said.\n The lantern hung from a hook above the head of the cot. The lieutenant half stood to lift the chimney and blow out the flame. When it was dark she reached out for his wrist and pulled him down.\n Late, very late, when their two bodies lay spent and warm, all extraneous concerns fell away and left the heart of the matter exposed. Caldwell said, “The General will take the prophecy as his license to clean house, you know.”\n “What do you mean?”\n “Clear the forest. Build the dynasty. Once this front is secure, he’ll do what he’s been wanting to do for years. Clear the court of all his rivals and make the Prince his own man. It’s all there if you have a mind like his.”\n “Of course it is,” Cassandra breathed. “It gives him license to act, as you say, and gives his enemies room to prove him wrong. That how the Oracle always speaks. In words like shadows hiding blood.”\n “You make it sound like it has a purpose.”\n “Of course it has!” she hissed scornfully. “When did you ever know power without some purpose of its own?”\n The rain patted the canvas roof, dripped musically in puddles of its own making at the corners of the tent.\n “God preserve us,” Caldwell said.\n “What amazes me is that no one—no one, in all these centuries—has ever questioned what that purpose is, or whether the Oracle, even in its twisting way, actually tells the truth.”\n “The Oracle lies?” Shock raised Caldwell’s voice.\n “Hush!” Cassandra pressed her palm over his mouth. “No more. I’ve said too much.”\n The General invited her to his tent not long after Reveille to join him for breakfast. Lt. Caldwell had left her bed, and her tent, more than an hour before dawn. Though he’d left her with a lover’s kindness, she could tell he was shaken by her talk. She did not hold it against him: she was shaken herself. Things she had never dared voice even in her own thoughts, she had said aloud to him. But it wasn’t as though she was afraid to trust him. Her own greatest enemy could tear her open, mind and soul, any time it chose. What would a merely human betrayal matter? And in any case, what would ‘betrayal’ amount to, but a casting of doubt over the Oracle’s pronouncements. Hardly a matter for dread, at least on her account. Cassandra could not say why this foreboding grew with the light of day. She only knew it did.\n The General presided at his breakfast table brilliant with energy. In her presence he and his officers spoke mostly of generalities, certainly not of policy or strategy, but she remembered what Caldwell had said about the General’s interpretation of the Oracle’s words, and she believed him. A kind of grief came over her, a vision of the nation, already split by the civil war, being divided again, and again, and again. And where else had the war begun but with the last Voice’s prophecy of the old King’s death? And before that . . . what? How far back could one trace the trail of spilled blood?\n “I’m beginning to consider my next trip to the capital,” the General was saying to one of his aides. “I hadn’t wanted to leave the front with the Fell Valley still in question, but—” He broke off when the aide cleared his throat and nodded at Cassandra.\n She set her cup back in its saucer. “I beg your pardon, General. I can only be in your way. Thank you for the meal.”\n “You’ve scarcely eaten,” the General said with a glance at her plate. “In any case, I can assure you, you are in no way an impediment. Quite the opposite, in fact, you add a touch of civilization to our bachelor’s domain.”\n Cassandra forced out, “You’re very kind,” and got to her feet. She was dizzy with hunger, yet her stomach clenched on the thought of more food. Even the food on her plate looked strange, like a painting of itself. She leaned on the wooden frame of her chair.\n “Madame, you don’t look at all well. Should I send for the doctor?”\n She shook her head, then managed, “No, thank you. I only need to rest . . . a little more . . . ” Bees like bullets were whirring in her ears. Not now, she thought. Please, God, not now.\n There were murmurings of doctor, and then Caldwell’s name. “There you are,” the General said irritably. “See to the lady, will you? If she’s ill . . . “\n His voice, all their voices, faded into the whir. Sunlight flared at the open door of the tent, like mist-white wings at Caldwell’s back. The cold floor poured numbness up her legs, all through her, into her heart, her skull, her mind.\n The Oracle Spoke.\n As often happened, Cassandra woke to sound before anything else. While the spike of pain pinned her motionless and the cool air tore through her abraded throat, she heard, like the tolling of church bells, a sergeant-major’s bawl.\n Squaaad! Ready h’aaarms!\n H’aaaim!\n Fi-yaaar!\n And then a ragged volley of rifles.\n Dread flooded through her. She raised her head, squinting through the pain. “Caldwell?” There was a man-shaped shadow against the wall. “Caldwell?”\n “No, ma’am. Lieutenant Harney, at your service, ma’am.”\n “Where . . . ” Oh God. “Where is Lieutenant Caldwell?”\n The young man leaned forward, his round face earnest, his forehead dewed with sweat. “Don’t worry, ma’am. The traitor is dead.”\n She stared at him. “What did I say?”"}