{"fingerprint": "APlaalTGSSZnNiolZArL4EvAZT8=", "sitename": "Clarkesworld Magazine", "title": "A Sweet Calling by Tony Pi", "author": "Tony Pi", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/pi_05_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Sweet Calling by Tony Pi", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5380 words, short story\n A Sweet Calling\n Red paper lanterns, strung high like persimmon moons, welcomed customers to the market street. I announced my next performance of the sugar opera to passers-by, hoping to draw the curious to my stall. But if the row of candy zodiac animals in front of me couldn’t lure them in, perhaps my show would.\n Taking a dollop of warm caramel, I fashioned a straw-thin spout and blew into it to inflate a bubble of sugar. An elderly couple stopped to watch, while two boys gaped in amazement as I pulled limbs and long ears from the hollow, golden shell to make a rabbit. Satisfied with my handiwork, I stuck the candy-hare onto a bamboo stick and dabbed on molasses eyes.\n The elderly pair complimented me on the show and bought two caramel monkeys I had on display. I thanked them. I had arrived in Chengdu with very little money, but hoped to make a small profit by the end of the night. For each creation I sold at the festival, I earned a coin. Such was the simple life of a candyman.\n Few customers, however, lingered as long at my stall as Lun the wheelwright. It wasn’t my sugar-figurines that caught the lad’s eye, but the winsome lass ladling out yuanzi dumplings across the street.\n “You want to win her heart, Lun?” I held the caramel rabbit forth. “Give her this. I guarantee she’ll adore it.”\n Lun wavered. “I’m grateful, Tangren Ao, but suppose I say the wrong thing?”\n “Courtship, like any craft, needs practice. Compare her to the moon; they love that. Quickly, before nightfall brings more admirers to her stall.” I’d seen her turn away two suitors already, a willowy scholar and a brocade merchant with a fat purse.\n The lad took the gift and trudged across the stone road, yielding to peasants, horse carts, and even a stiltwalker who passed before him.\n I tried not to smile. I would surprise them both with a little magic when he showed her the rabbit: wrinkle its nose, waggle its tail. They’d dismiss it as a trick of the crimson light. But in sharing that moment of delight, perchance they’d fall in love.\n Spring’s a delicious time to meddle!\n “Make a lóng next!” demanded the pesky boy, who had yet to buy anything.\n “Dragons are hard, kid.”\n “Bet you don’t know how,” said his snotty friend.\n “I said hard, not impossible. After my break, I’ll show you.”\n I sat, shut my eyes, and hurled my senses into the sugar-rabbit across the way.\n I spied through dotted eyes at the world grown vast. Lun’s stammer thundered in my pulled-candy ears. The yuanzi girl’s lips curled in a grand smile. But there came an odd cracking sound from near her soup-pot. The girl glanced down and shrieked.\n Lun backed away but stumbled, and I—rabbit-I—fell from his hand. My vision spun, but I caught a glimpse of flames before the impact against the cobblestones shook me from the candy-shell and back into my body.\n I blinked open true eyes.\n A monkey shaped from fire hunched on top of Lun, setting his shirt alight. Lun grabbed for it but winced as he clutched only flame.\n The crowd fled in panic.\n “Roll, Lun!” I cried as I bolted into the street. “Smother the flames!”\n Lun obeyed, but the fire monkey pressed its attack.\n I grabbed the ladle from the yuanzi girl (with muttered apologies) and scooped soup from the pot, slinging the hot broth at the fire-beast. The splash doused only its tail, but before I could dip the ladle for more sweet soup, the monkey darted away with all-too-human strides.\n “Lun! Are you all right? What happened?”\n The lad winced and blew on the burns to his hands. They’d blister, but he was lucky his wounds hadn’t been worse. “The fire under her pot just came alive! Is it because it’s the Year of the Monkey?”\n “Doubt it.” It moved too like a man to be a wild spirit. Could it be an elemental conjuration under a puppeteer’s sway?\n The monkey clambered up the stiltwalker’s wooden legs, its flaming paws raking the startled performer’s flesh. Climbing onto the man’s shoulders, the beast leapt onto a riddle lantern before the man toppled over.\n People cried for the city guard.\n I called to the frightened yuanzi girl. “Please, look after Lun!”\n The girl remembered to breathe and hastened to Lun’s side, concern clouding her face.\n I dashed to the fallen stiltwalker and untied the stilts from his legs. Motes of burning paper rained down on us as the fire monkey leapt from one lantern to another, then another and another, until it landed on the thatched roof of the yuanzi girl’s family teahouse. With mad glee, it set the thatch ablaze, and the flames regenerated its tail.\n I cursed. Our troubles had just begun.\n Lun raised the cry of “Fire!” while the girl screamed for everyone to get out. Patrons poured out of the teahouse, but those in nearby establishments heeded the call as well, knowing the blaze would eat through the row of wood and thatch buildings like a child through a skewer of candied haws.\n Proprietors filled buckets with water from the bronze vats outside, but how could they tame the rooftop fire?\n I left the stiltwalker and flitted between terrified citizens towards my stall. I saw the boys Pest and Snot run off with fists full of sugar zodiac animals, leaving only a pair of Oxen-on-a-stick and a half-gnawed Rooster in the dust. Greedy brats!\n With the teahouse roof vigorously ablaze, the monkey hopped across a string of lanterns to my side of the boulevard and ignited a new fire. Wide streets normally prevented flames from leaping the gap, but tonight, a web of lanterns crisscrossed all of Chengdu. The monkey conjuration could travel the high paths and set fires wherever it pleased, and no man could hope to intercept it.\n Even the animal seemed deliberate, as the abundance of the Monkey sign would cast suspicion on an angry spirit, or worse, someone who played with that shape.\n Like a Tangren making candied monkeys in plain view of the teahouse.\n Had the arsonist planned it all, choosing the Lantern Festival to wreak the most havoc without getting caught? But who’d harbor such calculated hatred, and how would I catch him?\n The mystery taunted me like a devious lantern riddle, but I hadn’t the time to mull over clues. I couldn’t stand idly by while Chengdu burned.\n My father had taught me the secret of sweet possession. Each generation of Tangren in my family would push the bounds of our magic the way we’d inflate a candy-bubble. Spying was our earliest power, then animation, and last year I discovered water-shaping. To fight the fires, I’d need that new skill now, and also water and golden caramel to conjure with.\n With mandated fire stations every three-hundred steps, the fire-fighting force soon swarmed the street with buckets, but the number of blazes daunted them. Lun, with cloth-bandaged hands, pointed out the monkey to incredulous men.\n At my stall, I pulled a glob of hot caramel from my pan. Years of practice making the scalding heat bearable as I palmed, twirled, and blew on the gooey lump to cool it.\n To battle such hungry blazes spreading by rooftop, I’d need a storm’s worth of water, maybe from the Jinjiang River nearby. The sun had set and the River Bridge Gate was shut, but I had no choice. I tucked a bamboo stick behind my ear and ran southward, rolling the sugar ball between my palms to keep it soft. In my haste I nearly collided with a dour-faced official who glowered and barreled past me, roaring orders to the fire-fighters.\n The walls of Lesser City loomed ahead, too high to climb. But if I chose the right animal, it might be no obstacle at all.\n Only twelve primal shapes could contain an elemental conjuration: the animals of the shengxiao zodiac, the foundation of every Tangren master’s repertoire. Goat, Rabbit, Pig; Tiger, Horse, Dog; Snake, Rooster, Ox; Monkey, Dragon, and Rat.\n I had to call the Dragon, rider-of-mists and bringer-of-rains, the most dangerous of all.\n I shaped a hollow in the caramel with my fourth finger and stretched it funnel-long. Snipping away excess candy with a bite, I blew into the thin sugar-pipe, making the bulbous end expand, but this time I laced the breath with half of my soul like Iron-Crutch Li of the Eight Immortals.\n My hands recalled the Three Joints and Nine Resemblances of the dragon-shape, drawing the soft shell long and plucking limbs, antlers and frills of golden sugar. On the dragon’s head I molded a chimu lump, without which it could not fly.\n I twisted off the airpipe. Almost done save the final touch. Breaking the bamboo stick in two with my teeth, I jabbed a sharp point into the back of my hand and drew blood.\n Dragons only come alive when you dot their eyes.\n I settled on the dirt in the shadow of the wall, hoping my body would be safely hidden here, and called to the spirit of Dragon.\n O Sacred Dragon, hear me! I, the insignificant Ao Tienwei, humbly ask your aid.\n A voice like thunder echoed through my head. You are not one of mine, Water Rat, though I know you from your tributes of art, it said, calling me by the sign of my birth year. What will you ask, and what will you give in return?\n Lord Dragon, Chengdu burns and I must quench the flames. Water I have in plenty, but not strength enough to fly. Legends tell of your dominion over water and sky. If you would lend me your power, I’d soar and save the city, bringing you new worship and reverence.\n It considered it. Your proposal pleases me, Water Rat. Fly with my blessings.\n A thousand thanks, Sacred One.\n I lobbed the blood-eyed Dragon underhand into the air and cast my consciousness inside, becoming the small caramel creature. Starlight on my chimu lump pulled me towards the new moon sky, and I floated over the wall and down into the river.\n I bobbed thrice before sinking into the frigid depths. I felt my sugar-body begin to dissolve, and welcomed the simultaneous sensations of drowning and fading. That was the trick to elemental possession; my first tries failed because I fought those fears when I should have embraced them. As my senses seeped from hardened candy into sweetened water, I asked the river to accept my offering in trade for a moat’s worth of water. The river savored the candy and gave me what I asked, but left to me the shaping of the river-water.\n I began molding the water into likeness of the candy-dragon. I’d never attempted so prodigious a conjuration before, a horse being the largest water-shaping I’d succeeded at. It took all my strength to merely break the surface with my water-dragon head, but as my manifestation took shape, Dragon power welled inside me and lifted me heavenward. As my sinuous body escaped the Jinjiang River, my undulations freed startled fish from my frame and threw them back into safe currents. I gave thanks to Dragon and flew, grander than any conjuration I ever dared.\n Below, the gardens and pagodas grew small like tray landscapes, while the folk on the streets might as well be tiny dough figurines. I spiraled in the air to get my bearings. More the impression of a dragon than a detailed rendition, this grand manifestation was slow to respond to my thoughts, but it would have to do.\n Points of red lantern lights dotted the city below, though the fires in Lesser City shone fierce through billowing smoke. I dove for the scene of the fiery devastation.\n All along the street, blazes raged out of control. The yuanzi girl and her parents huddled by the overturned stall in front of the doomed teahouse, cradling a sign that boasted ‘fragrant tea from river water’. A bandaged Lun fought alongside the others to put out what fires they could, while the magistrate in charge grabbed a snake-halberd and cut down a string of lanterns, hollering for other soldiers to do the same.\n A handful of men saw my coming and cried out in astonishment. All turned to look, with some men thinking it best to flee, while others gaped in bewilderment and forgot their tasks.\n I ignored the stares and twisted through the air, spewing river-water at the flames licking the sky. The blasts of water worked wonders at extinguishing blazes, but each spray diminished me by a like sum and rippled the veneer of my dragon-shape. I did my best to hold the dwindling manifestation together and surveyed the rooftops with liquid eyes.\n There! The fire monkey hid in the high flames and blinding smoke of the brocade shop to my left, its flicking tail betraying its place. I angled my flight towards the demon, our eyes meeting at last. For good or for ill, the sorcerer now knew I pitted my magic against him.\n I spat a cauldron-sized pearl of water at the monkey, but the agile beast vaulted out of the way onto an adjacent roof and raced across black tiles. I rushed through rising steam after it, but the monkey was too small and nimble to target with bursts of water.\n In spite of my laggard reflexes, I could still fly faster than the beast could run. I overflew the beast and walled off its progress forward with watery coils, but the monkey grabbed the roof’s edge and swung through the back window of a wineshop. I gave chase and spewed a great measure of water through the opening, but the monkey leapt out of a front-facing window as the flood struck. In single-minded pursuit, I threaded my body forcibly through the narrow frames, stripping more water from my manifestation. I emerged slimmer, overshadowing the market street where the fire monkey had landed between the magistrate and Lun.\n The magistrate lowered his halberd and sliced at the fire monkey, while Lun hoisted his bucket and readied to throw.\n Trapped between the fearless official and a wheelwright with a bucket of water, the fire monkey hesitated.\n That moment of indecision was just enough time for me to gamble it all.\n High above the trio, I purposefully shaped away my chimu lump and my ability to fly ended abruptly. I fell bodily on top of them, river-water overflowing the bounds of my dragon-shape as the conjuration collapsed. The impact sent my awareness tumbling out of the elemental conjuration.\n For the first time, I lost all of my senses.\n In the past, ending a conjuration meant my soul would fly back to my body. I had never been stripped of every sensation: no sight, no sound, no pulse racing or hackles rising on the back of my neck.\n Nothing but naked fear and solitude.\n I tried picturing my body, from my dry eyes to the growl of hunger in my belly, from the itch between my toes to the sting of the wound on my hand.\n But still I could not return.\n Did I overreach myself, conjuring with too much water? What if I were trapped like this forever?\n What I’d give to feel my heart pound in terror!\n No, stop obsessing over why and think about what-now. I shouldn’t let this predicament cool and harden into permanence while I fretted; I ought to shape the situation while it was malleable. I might be bodiless but I still had memory and thought, purpose and principle. If an escape didn’t exist, I’d make one.\n I remembered asking my father to teach me sweet possession when I was sixteen. Father was a difficult master to please, finding fault in my interpretations of the Dragon. “You must pay tribute to the animal with your artistry.”\n “But why?” I asked. “Paintings, sculptures, and calligraphy last. Candy figurines don’t.”\n Father swatted the back of my head with his folding fan. “The sugar opera may be fleeting art, but it’s no excuse to slacken! Show respect for the animals before you ask to wear their shapes, in particular the spirits of the twelve signs. Revere them, my son, lest they find cause to meddle in your affairs.”\n I took Father’s lesson to heart. It took months of practice to render a Dragon to his liking, thereby completing a Tangren’s zodiac repertoire. At last, he consented to teach me the spying skill. “Always begin with taste,” he said, handing me a golden Tiger impaled on bamboo. “Lick and burn the sweet flavor into your memory.”\n Taste, of course!\n I meditated on the flavor of my family’s secret sugar blend: brown layered on cane, dusted subtly with musk-flavored sugar. As the memory of that taste crystallized in my mind, I caught a tinge of it coming from beyond remembrance. I latched onto the taste and willed myself towards it.\n My senses returned, though not to my body as I hoped, but back inside the rabbit-on-a-stick beside the toppled yuanzi stall. I wore a drenched and sticky hollow candy-skin, a small comfort compared to my own skin, but a skin nonetheless.\n From this low angle, I could only see the hulking remnants of the stall on the paved road, but my rabbit ears revealed my surroundings in full. In the distance, fire-fighters chattered about the Water Dragon and the Fire Monkey battle as they threw water onto flames. I heard no urgency in the men’s voices, which likely meant the fires were under control.\n There would be legends told of this night, which ought to please Dragon.\n Behind me, the magistrate questioned Lun and the yuanzi girl about the mysterious monkey. “And it attacked you without provocation?” he asked in a calm, scratchy voice.\n “Yes, Magistrate Gongsun,” Lun replied. “All I did was, um, offer candy to Miss Deng when the fire monkey crawled out. I stared, it stared, and then it jumped me!”\n I animated the belly of the rabbit-shell and eased myself off the bamboo stick. The wall where I hid my body wasn’t far by human scale, but at caramel-rabbit size it might as well be a li away. Perhaps if I invoked the Rabbit’s speed . . .\n “Candy, hm? Tell me about this candyman,” Gongsun urged.\n “Tangren Ao?” Lun spoke my name with cheer. “He’s a pleasant man, nosy but generous. He’s from Ji’nan, I think.”\n “Did Ao make any monkey figurines?” Gongsun pressed.\n “What? Surely you don’t think he’s behind the fires!”\n I cursed my luck. The judge was right to suspect a human behind the arson, but did he have to suspect me?\n “Answer the question, son,” Gongsun said. “Monkeys or not?”\n “Well, why wouldn’t he in the Year of the Monkey? Magistrate, he saved me from burning alive. I’d rather believe he brought the dragon.”\n I was heartened to hear Lun defend me so.\n “Perhaps, or perhaps not,” Gongsun said. “Regardless, I have questions for him. Guards! Find this candyman.”\n If they brought my body back, I’d be spared the trek. On the other hand, I’d have to lie my way out of another charge of sorcery or flee the city.\n “Magistrate, wasn’t it just a duel between spirits?” Miss Deng asked.\n “It might be, Miss Deng, but magic isn’t the sole providence of gods and demons. I must consider all possibilities, including a magician with a vendetta against you or your family.”\n “A vendetta?” She sounded surprised.\n “It burned your teahouse first. I do not doubt that it was personal. Any trouble with the gangs? Unpaid gambling debts?”\n Miss Deng paused. “My father may love Constellation Dominoes, but he knows his limits.”\n “We shall see,” Gongsun said. “What of this candyman? Did you know him?”\n “No, he never crossed the street.”\n Gongsun sighed. “Try to remember everyone who came to your stall. If this arson is an act of planned revenge, the instigator is likely as meticulous and ruthless in covering up his crime. We must find him before he has that chance.”\n As Miss Deng recounted further details for Gongsun, I wondered if I might have seen my foe. But countless people had passed my stall since I set up shop this afternoon. It could be any of them.\n Instead, I considered how the sorcerer might have enchanted the yuanzi-pot fire. An elemental conjuring required an offering in the shape of a primal animal. If his power were akin to mine, then he must have offered something in the shape of a monkey to that fire. But how?\n I softened the rabbit-candy and hopped to the soup-pot apparatus, knocked over during the chaos. Among the bits of burnt wood lay the charred halves of a walnut-shell. They must have made that cracking sound I heard.\n If an offering had been sealed inside, the flames would have to burn through the shell or melt whatever held the halves together. The sorcerer would have had time to flee the scene.\n The small walnut couldn’t fit a Tangren’s sugar animal. But perhaps a different kind of food offering, like a dough-figure, would suffice. A master of dough-sculpting could easily hide a tiny painted monkey in the hollow.\n But one detail still puzzled me. The soup-pot apparatus sat on the ground, too low for anyone to easily feed a walnut to the fire without attracting attention. Surely Miss Deng would comment if someone tampered with the fire?\n Unless the scoundrel responsible had been short.\n I’d have noticed a dwarfish man among the street performers, but those kids—had Pest and Snot gone for yuanzi? I couldn’t remember, but Miss Deng could have easily dismissed the antics of boys at her stall.\n Of course, neither boy could be the arsonist. By the looks of them they were anywhere between nine and twelve years old, too young to plan arson. Besides, the monkey was setting fires at the same time they were running away with candy loot. The sorcerer must have bribed them to plant the walnut in the fire. And if the magistrate was right about the mindset of the arsonist, then the boys were in grave danger. A promise of more spoils would surely lure them into a trap!\n Squishy footfalls grew loud behind me. I froze.\n Giant fingers hoisted me by the ears in front of great, scrutinizing eyes. Magistrate Gongsun.\n The Sichuanese man in his early fifties suffered his wet official’s robes without complaint; the wing-tips of his black hat, once extending stiffly to either side, now sagged from the wet of river-water. “So this is the candyman’s handiwork,” he boomed.\n Had he seen me move?\n A guardsman raised a call. “Magistrate! We found the candyman unconscious by the town wall. What should we do with him?”\n Gongsun glanced in that direction. “Lay him down by his stall and watch him.”\n My body! I reached for it with my mind but still couldn’t grab hold. How close did I need to be?\n If I squirmed out of Gongsun’s hand, I could hop to my body and try to awaken, and if I did I’d tell the magistrate my fear for the children’s safety. But would he believe my story? I had nothing but guesswork.\n But maybe I could find solid proof. Those kids took so many sugar figurines that they couldn’t possibly have eaten them all. If I could find one of those shells . . .\n What had they taken? A fistful of Monkeys, a pair of Pigs, a Horse, and a Snake. I’d made only one Snake in recent days, as that sign never sold well outside its Year. Unless the boys ate it already, that was my best chance to find them.\n I opened my awareness and sought caramel in the vicinity, reaching as far as the walls of Chengdu. My mind probed each instance like a tongue discerning a shape, hoping to find the serpentine candy. We’d hunt for secrets this way, my father and I. He never shied from using the dirt we uncovered to blackmail rich men.\n When I located the Snake, my mind darted through the connection into its coils, but I left a thread of sugary taste so I could find my way back to Rabbit. Half-wound about a bamboo stick, I saw through dotted molasses that the older boy held me in his right hand and Horse in his left. The younger kid trailed behind him with a bundle of Monkey candy. I caught only dizzying glimpses of our surroundings awash in red light, like the shadowy foliage of a park or garden.\n Snot tugged on Pest’s sleeve. “Let’s go home.”\n Pest stopped. “Not yet, brother.”\n “You go then,” Snot said, his voice wavering. “I’m going home.”\n “Fine! I’ll keep everything for myself,” Pest said.\n Snot ran off while Pest continued onward alone. A familiar pagoda loomed before us, and I realized where we were: the Flower-Strewing Tower. The sorcerer must have intended to watch the streets burn from the tower once he ended his conjuration.\n I had to get Pest out of here now, but how? I hadn’t blooded the Snake’s eyes so I couldn’t shape water, leaving me only this candy-body to defend him. But I could petition the spirit of Snake. O Snake of Ten-Thousand Years! I, Ao Tienwei who did not give you proper notice, ask your help to save a life.\n I taste you, Tangren Rat, Snake answered. What succor do you seek, and what losses will you suffer?\n A beardless man in the garb of a scholar emerged from the pagoda. His eyebrows were so sparse that I’d almost say he had none. He was one of the suitors that Miss Deng had rebuffed!\n “Where’s your brother?” the willowy scholar asked.\n “The crybaby went home,” Pest said. “I did what you asked. Where’s my money?”\n The man smiled. “I left the sycees in a pouch under that bench there. The gold’s all yours.”\n No time to answer Snake. I softened and sprang off the bamboo, landing on the path between the scholar and the boy. They startled and backed away. I reared up, shaped and hardened caramel fangs, and mock-attacked Pest.\n Frightened, the boy turned to run, but saw the stone bench and couldn’t resist. With candy-horse still in one hand, he scrambled to the seat and fumbled under it.\n There’s nothing there, kid, run!\n “So you were the water dragon, Tangren?” the scholar-sorcerer said in a low voice. “Stop interfering with my revenge.”\n He raised his foot and stomped down. I slithered away in the nick of time. Grant me venom, Snake!\n My price—\n The scholar started towards the kid.\n Anything, Snake! I coiled and sprang for the man’s ankle, sinking fangs deep into his flesh. The scholar cried out and stumbled.\n So be it, Snake said.\n Something flowed through my fangs into the scholar’s blood.\n I heard the rattle of rocks, then small footfalls receding. The kid saw through the sorcerer’s lie at last.\n I had no time to celebrate. Pillar-like fingers pulled and ripped me in two.\n The shock again sent my consciousness reeling, but I caught the thread of sweetness and followed it back to Rabbit. My rabbit-self lay on the table at my stall. A towering Magistrate Gongsun stirred through the pot of cooling caramel beside me.\n With Pest still in danger, I abandoned caution and leapt off the table, catching the magistrate by surprise. He grabbed for me but clawed only air as I landed on top of my body’s chest.\n But despite the closeness of my flesh, I could not return to it.\n Gongsun knelt and reached for rabbit-me.\n Always begin with taste, I decided, and scurried towards my human mouth. I burrowed between the lips and kissed the tip of my own tongue.\n My awareness flooded back inside my body.\n I pulled the candy out of my mouth and gasped for breath. The Dragon conjuration had taken too much out of me, and I struggled to sit up.\n Gongsun raised a bushy eyebrow and extended his hand. “You and I have much to discuss, candyman.”\n I took his hand. “Magistrate, you must send men to the Flower-Strewing Tower, without delay.” I said, nearly breathless. “The arsonist’s a scholar with almost no eyebrows. Please hurry, before he catches the boy!”\n “What boy? Explain.”\n Lun and Miss Deng saw me stir and came towards us, hand in bandaged hand. “So good to see you awake, Tangren Ao!” Lun said.\n I smiled weakly. “Miss Deng, did a willowy scholar give you any gifts? Dough-figures, perhaps?”\n “Master Shuai? Yes, he tried to give me several of the miniatures, but I refused them all,” she answered. “I didn’t want to encourage him. He’s chased me since my hair-pinning ceremony two years ago.”\n “Shuai had a kid slip a magical figurine into your fire, but now the boy’s a liability.” I turned to Gongsun. “You must believe me, Magistrate. Find Shuai.”\n Gongsun stood and called to a group of halberdiers. “Go. Detain anyone at the Flower-Strewing Tower.” The soldiers hastened away without question. “Stay here, Tangren Ao.”\n “I’m coming with you.” My legs weak, I could only stand with Lun’s help. “Thank you, Lun.”\n We left Miss Deng with her family on the market street and headed for the pagoda.\n The halberdiers found the scholar Shuai trying to limp with a swollen foot away from the Flower-Strewing Tower. They held the cursing suspect at blades’ point and called out to Pest.\n The boy poked his head out from behind a clump of bamboo, still clutching Horse-on-a-stick in an iron grip. “Did you kill the snake?”\n I grinned. “Don’t worry. It won’t be back.” However, my smile faded when I realized I had no idea what Snake would demand of me.\n With Shuai in custody and the boy safe under the soldiers’ protection, Gongsun demanded answers. “Start from the beginning.”\n “I’ll gladly answer all your questions, Magistrate, but only in confidence.”\n “Agreed.”\n Lun helped me to the tower on Gongsun’s instructions. \"Thank you, Tangren Ao,\" he whispered in my ear.\n “No need, Lun. She likes you. All you needed was a little push.” I was glad the candy-rabbit brought them together, even though things had turned out much differently than I expected.\n “I meant the water dragon.”\n I pretended not to know what he was talking about. “You have a vivid imagination, lad.”\n Lun left with a crooked smile.\n I couldn’t lie to Magistrate Gongsun. I couldn’t prove the scholar’s guilt unless he understood how Shuai’s magic and mine worked. I sat on the steps of the pagoda and recounted the night’s events, and for the first time, spoke frankly about my power. As I revealed my secret, the burden of years fell away. Despite myself, my eyes brimmed with unshed tears.\n At the end of it, Gongsun stroked his beard. “I believe you, though few others will.”\n “No one else must know.”\n “I agree. However, I still intend to bring Shuai up on charges of sorcery and arson. The boy’s testimony will seal his fate, and I will crush him with the full force of the law.”\n Not what I wanted to hear, being a sorcerer myself, but nonetheless I bowed. “I, your insignificant servant, thank you.”\n “You have a strange and useful talent that ought not go to waste, Tangren Ao,” Gongsun said. “Will you work for me? I will pay you well for it.”\n “And give up this sweet calling? The life of a Tangren is all I know.”\n “I am not asking you to abandon your trade. Stay in Chengdu. Learn the city. Help us rebuild. I only ask that when I have need of you, you answer my summons. What say you?”\n He surely knew how my magic could advance his career. For good or for ill, my fate was now entwined with his, so long as he demanded it. But what choice did I have? You should never anger a man who could sentence you to death. I felt as helpless as a rat caught in the coils of a—\n “Your animal sign wouldn’t happen to be Snake, would it?” I asked.\n “Indeed,” Gongsun replied. “How did you know?”\n Tony Pi was born in Taiwan but grew up in Canada. A Ph.D. in Linguistics, he currently works as an administrator at the Cinema Studies Institute, University of Toronto. A finalist in 2009 for the John W. Campbell Award for Best New Writer, his work also appears or will appear in Fantasy Magazine, Beneath Ceaseless Skies, Orson Scott Card's Intergalactic Medicine Show, and On Spec, as well as numerous anthologies, including Writers of the Future XXIII, The Improbable Adventures of Sherlock Holmes, The Dragon and the Stars, and Alembical 2."}