{"fingerprint": "qvjXcqtoO72veXATVLKcsx/Ofp8=", "sitename": "Clarkesworld Magazine", "title": "Book covers, Moorcock, and The Mexicanx Initiative: A Conversation with John Picacio by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/picacio_06_18-2018/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Book covers, Moorcock, and The Mexicanx Initiative: A Conversation with John Picacio by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Book covers, Moorcock, and The Mexicanx Initiative: A Conversation with John Picacio\n The visual arts and genre fiction have always evolved together. Beautiful art complements a story while the story can help a reader find a deeper appreciation for an artist’s brushstrokes. One inspires the other and vice versa.\n John Picacio has long been one of the premiere artists working in science fiction and fantasy publishing. His work has adorned the covers of notable books by Michael Moorcock, Harlan Ellison, Robert Silverberg, L.E. Modesitt, Jr., Dan Simmons, Joe R. Lansdale, George R.R. Martin, and many more. He’s won two Hugo Awards, the World Fantasy Award, the Locus Award, eight Chesley Awards, two International Horror Guild Awards, and has been nominated for numerous other accolades.\n After being the Guest of Honor at the 76th World Science Fiction Convention, John created The Mexicanx Initiative to help encourage Mexicanx representation in science fiction and fantasy.\n When did you realize you wanted to be an artist?\n It was always in my blood. My mother claims I was drawing like a maniac by the age of two. I think it’s what I always wanted to be. When I was a senior in high school, I received my fair share of academic scholarships and my parents kept nudging me toward a professional degree, whereas I think I wanted to major in art or film. The only professional degree that really allowed a person to draw and imagine for a living was architecture. So that’s what I majored in at the University of Texas.\n During my third year of architecture school, my parents sprung for a semester in Europe with my classmates. It was a big deal because our family wasn’t rich and I had never flown on a plane before. That trip was the pivot point for me in so many ways though because I was exposed to the best museums in the world, all kinds of European comics, and more culture than I’d ever experienced. I kept going with architecture and got my degree, but I knew my life was not going to be all about architecture.\n In what medium did you first start creating?\n Comics. It’s my first love and first language. After graduating from architecture school, I went to work as an intern architect for a residential firm, but I started writing and drawing my own comics by night—weird, dreamy, slice-of-life stuff. I co-published a couple of issues worth of those stories with a friend of the time, and those comic books started getting the attention of SF/F book publishers. That wasn’t something I anticipated. One day in 1995, a company called Mojo Press asked if I wanted to do the cover art and design for a Michael Moorcock book and that’s where my cover art career began. I fell in love with the science fiction and fantasy publishing industry based off that job and my life has never been the same since.\n Who is one artist who has most influenced your career?\n That’s hard to say because there are so many. I assume you mean visual artists, but I would say Moorcock has had as big an influence on me as any creator in my professional life. I knew he was a giant of the field when I did that first cover job, but I was not particularly a fan of his before then. I became one after hanging out with him, and he’s definitely a constant that’s meant a lot to me throughout my two decades in this business. He believed I could be “someone” in this business before I even realized it. He never told me what to do, but I learned a lot by just watching him and hanging on his every word. He’s the greatest.\n What does your creative process look like?\n If I’m doing a book cover artwork or something related to a story, then it starts with the story. Once I’ve absorbed that, I’m free-associating and trying to find the strengths of the story and how it connects on an emotional level. When I’m working on something that isn’t related to a story or a set of words, then I’m doing this on my own, just trying to connect to something essential and personal . . . something of the moment.\n I do jot lots of little sketches and notes, trying to narrow down the heart of what I’m doing, and usually that boils down into a single sketch or two that provides my direction. I’ll then start shooting reference photos and Frankenstein those in Photoshop into a comp of sorts. Then I’ll start drawing and fleshing out that idea in final form, on a fresh piece of illustration board with graphite pencils.\n This is where a lot of the fun is because I get to really work out all of the values and produce a finished original. From there, I usually digitally add color to the drawing in Photoshop, but there are a number of my works where there’s no digital at all, and I work with traditional paint. Mostly though, I’m a traditional/digital hybrid, but drawing by hand is still the all-time great joy and the days when I’m doing nothing but drawing are my favorite days.\n Does your process change when you work on something like a book cover as opposed to a piece of stand-alone fine art?\n I don’t think so. Book covers tend to have more voices involved and I listen to the input, but in the end, I’m being hired to connect a book with an audience, and I trust my instincts there.\n Do you feel a book cover influences how a reader experiences a story? How?\n It influences whether people buy a story. Some covers can influence the experience. I try to tie my covers to the narratives, sometimes in a literal way, sometimes in an evocative way. It depends on what I think is best for the narrative. But yeah, when covers speak to the stories behind them, it can be a very heightened experience.\n What made you create the Mexicanx Initiative (M.I.) project?\n I’m the first Mexicanx to be a Worldcon Guest of Honor in the 76-year history of the event, and most likely the first Latinx of any kind to be so named. So, while that’s a breakthrough and an honor, my first thought was, “Hooray!” but my immediate second thought was “Who cares if I’m the first? What matters is I’m not the last.” I looked around at how many other major Mexicanx creators we have in our SF/F field and there are hardly any. Silvia Moreno Garcia is cranking away over in Vancouver and building a legacy. Patty Garcia is Tor’s Publicity Director and she’s awesome. There are a few more prominent Mexicanx creators and luminaries in our field, but the list is short. That’s not good.\n I felt like this Guest of Honor nod is my opportunity to plant some Mexicanx seeds within the field so our stories and our dreams are better represented within the constellation of science fiction, fantasy, and the greater narrative stream. We’re the fourth-largest ethnic constituency in the United States and yet we’re often singled out for cultural attack and denigration by the current administration. Control the story and you control the world, and if Mexicanx are going to steer our own futures, then we need to be in positions of power to better share our stories with the world.\n The M.I. was designed to fund Attending Memberships for fifty deserving SF/F professionals and fans to attend this summer’s Worldcon—and we achieved that number! I’m now deciding the last dozen recipients who will be coming, but it’s going to happen. We’re bringing a veritable Mexicanx All-Star team of SF/F talent to San Jose.\n How can someone get involved with the project?\n At this point, the fund has closed. I’m grateful to all of the sponsors and contributors who smashed our funding goal. We were aiming for $15,000 by Memorial Day Weekend, and we cleared that more than a month earlier than expected. The great Neil Clarke was one of the major contributors to the Assistance Fund and I’m hugely grateful to him. A fan named Chuck Serface has now created The LGBTQ Initiative, and he says his endeavor was inspired by what I did with The Mexicanx Initiative. That’s currently being funded, so everyone can help that achieve the same success that the M.I. scored.\n Science fiction and fantasy art styles have changed over the years. Where do you think the art landscape is headed at the moment?\n I don’t know about styles. I don’t think much of them. What I think is worth noting is the rising wave of visual artists who are creating their own stories and intellectual properties. Brom, Armand Baltazar, Gregory Manchess, Ruth Sanderson, Jeffrey Alan Love, Todd Lockwood, Peter Mohrbacher—we’re seeing a lot of major artists devoting more of their career time toward becoming author/artists, rather than just hired guns serving other people’s projects. I think it’s a positive trend and we’re going to see more and more of the best visual artists in science fiction/fantasy telling their own stories and owning their career paths and that’s exciting.\n Is it a particular challenge to create artwork for extremely popular works like A Song of Ice and Fire?\n I work on them the same as any other. When I’m working on a piece, I’m committed to it, regardless of the subject matter. They’re all challenges, but all different. The great thing about A Song of Ice and Fire was George specifically said he wanted “a John Picacio vision” of his ASoIaF characters for the 2012 Calendar. At the time when he pitched me to Random House as the official artist, there was no Game of Thrones on HBO. They were still casting and I was instructed NOT to look at what who they were casting, as I continued doing my work. So, I didn’t—because I thought it was a great gift not to have actor likenesses in my head. I just drew what I saw in my imagination. In the end, I’m glad my work has connected with so many fans around the world.\n That’s what I love about working in science fiction/fantasy—I love connecting with that world stream of imagination, being influenced by it, and hopefully doing my part to help shape it.\n If you weren’t a visual artist, what job do you think you’d enjoy?\n Being an author/artist. I’m working on that right now.\n What projects are you working on currently?\n More brand-new artworks for Loteria as well as writing the story that goes with it. I’m working on more new art for Tor.com’s Wild Cards stories, edited by George R. R. Martin. There are other projects I’m working on, but those are the ones I can talk about right now.\n What advice do you have for aspiring visual artists? Is there one piece of advice you were given that really helped you?\n “You’re the artist. YOU figure it out.” That’s what Mike Moorcock told me when I first started in the business. It means don’t hand your decision-making power back to someone else. Take charge and take people to a place where they can’t go by themselves.\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}