{"fingerprint": "pYTz67SFVqU84B1FUURgi45qLYo=", "sitename": "Clarkesworld Magazine", "title": "Of Time and Travel by Galen T. Pickett", "author": "Galen T Pickett", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/pickett_05_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Of Time and Travel by Galen T. Pickett", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Of Time and Travel\n A fundamental consequence of Einstein’s Special Relativity is that no physical object can travel faster than light. A somewhat lesser-known consequence of this fact is a counterfactual. Any physical object (like a starship) traveling faster than light will break causality in exactly the same way a “time machine” would. That is, faster-than-light travel and time machines are functional equivalents of each other. Or, to paraphrase a common proverb, it is impossible to break physics even a “little bit.” Allowing a physical particle (or a ship) outside the region of space-time corresponding to “causality” means it can go anywhere—past or future—with all of the mind-numbing paradoxes that entails. The consequences of this in a hard science fiction context are generally unappreciated.\n No matter the mechanism—warping space-time, hyperspace engines, jump gates, or simply invoking “faster is better and fastest is best”—the vast majority of the universe is composed of perfectly ordinary space-time of the sort well-described by Einstein’s theory. That simple fact places severe constraints on how distant events can be related to each other, which one is in the “past,” which is in the “future,” and what counts as the “present.”\n Special Relativity is a part of the grand inheritance of humanity. It is one of the most well-understood and beautiful ideas our species has generated and has been experimentally confirmed billions of times in even the most garden-variety collisions observed at the Fermilab Tevatron, at the Large Electron-Positron collider, and its follow-on the Large Hadron Collider. There are no serious questions about the general framework. Indeed, should any violation of Special Relativity ever be observed and confirmed and then understood in a new intellectual framework, those scientists will certainly be celebrated as Nobel laureates, and we will have something even more interesting and surprising than Special Relativity in our cultural inheritance.\n One result of SR is that the speed of light has a special status. Only objects of zero mass can travel at this speed—indeed, they must travel at this speed. The quantum field that makes the light anyone uses to see and read is composed of photons of zero mass. Any physical object that you can hold or throw—or launch from orbit or command from a bridge—can approach this speed but cannot exceed it.\n It is always possible that in a measurement some massive object might be seen breaking this rule! It is not the job of theoretical physicists to tell experimental scientists what they should not be looking for, and it is definitely not a scientist’s job to tell an observer that they did not see what they saw! But no violations have been found (so far). Every time the scientific community has been faced with the possibility, it turned out to not be true. Indeed, for a short six months, it was reported that neutrinos detected at the Gran Sasso laboratory were traveling superluminally before the malfunctioning equipment causing the observation was discovered. So, never say never, but certainly the case we have right now is consistent with “nope, never happens.”\n So, how does this actually work? How is superluminal travel the same thing as time travel? Isn’t “going faster and faster” totally different from “going back in time”?\n Our senses were tuned on savannahs millions of years ago. Being able to catch objects the size of rabbits and escape objects the size of panthers is mission-critical for any omnivorous animal, and we are no exception. Our senses and the habits of mind that go along with them are only sensitive to scales of speed and mass corresponding to our own human scale. Imagine a different species (for instance an interesting species created by Douglas Adams consisting of a hyperintelligent shade of the color “blue”) that needs to track down and devour individual photons to eat. Such a creature would understand the structure of space and time intuitively in a way we cannot. It is our perceptions and expectations that are approximations to space-time, not the other way around.\n Describing events by giving them a place and a time is natural enough. And our very human conception of the space of possible events is that there is a vast future, there is a vast past, and there is the present. But this is an approximation to what is really going on in Special Relativity. If Captain X of the USS Teacup Poodle asks his navigator to use the “normal” engines, then there is a region of the “future” that the Poodle is constrained to operate within. In ten minutes, the Poodle can be at most about one hundred million miles from its starting point, which is about how far a beam of light could travel in the same time. So, there are positions in the “ten minutes in the future” space that are inaccessible to the good captain. If we need Captain X to be twice as far away as that, we will need to wait at least twenty minutes. The region in which the Poodle can be found will then be larger but is still finite. The navigator knowns full well that the region of space-time that is accessible to the ship is constrained by the speed of light. This region of possible destinations is called the “future light cone” in Special Relativity. There is also a “past light cone” corresponding to any region in space-time from which the Poodle could have been before the story starts. The “present” for the ship corresponds to a single time and a single place, namely the instant Captain X gets the urgent request to get his ship to a battle about to begin at a distance of over ten lightyears away.\n So, the regular engines will not work. (Lets us not question how exactly the captain got this message from ten lightyears away when it would have taken a light signal ten years to be intercepted by the communications officer.) The good captain orders the navigator to set a course and relies on the helmsman and the engineer to use the trusty FTL drive/warp engines/jump point/whatever to get the ship to the battle “on time.”\n Whatever the mechanism, let us imagine that the Poodle manages to poof from its starting point and arrive at a point ten lightyears distant ten minutes in the future. These two events “leave for the battle” and “arrive at the battle” are ordinary events in our ordinary Special Relativity space-time, but they connect events that are outside the future and the past light cones of the Poodle. And, as far as we are concerned “leave” is an event that happens at “t=0” while “arrive” is an event that must occur at “t=ten minutes.” One is “now” and the other is “future.” But, that is not how space-time works. Yes, in the frame of reference of Captain X, this is what the navigator would report. Let us suppose that an enemy ship, the ISS Wienerdog flies past the Poodle and intercepts the distress call. Captain Y of the Wienerdog checks with his navigator, and finds to his wonderment that the battle is in fact going to take place in two weeks. Einstein thought of many ways to explain this feature of Special Relativity, and many classic “paradoxes” along these lines are used to this day in physics classrooms to illustrate the effect. This is called the relativity of simultaneity.\n Essentially, any two events that are outside the future or past light cones can be made to appear to be simultaneous, one can happen first or the other can happen first. Any two events that would require superluminal speed to connect have no intrinsic ordering. And, if one can happen before the other and the order of the events can be manipulated simply by choosing how fast you move while observing them, then the two events cannot be casually connected. The Poodle cannot cause anything with respect to the battle, although the good ship could get to the vicinity of the battle ten years hence and inspect the outcome/damage/new galactic political order. In fact, because these events cannot be linked by cause and effect, the captain of an enterprising starship can arrange a course and speed that makes the two events occur simultaneously. In effect, breaking the cosmic speed limit by just a little bit implies that infinite speeds are possible.\n This can be made quantitative (with equations that are a delight to me personally, but which are not everyone’s cup of tea). The conclusion, however, is easily stated (and has been observed countless times in particle physics experiments). Events that are related by cause and effect cannot involve anything traveling faster than light.\n So, what happens if we let the Wienerdog and the Poodle break causality for the sake of pushing a “hard” science fiction story forward?\n Captain X wants to even the odds of the battle-to-be. The Poodle has normal-space engines, so Captain X orders his ship to set his course and speed such that the embarking of the alien armada from its home world occurs in the future. He then engages his “infinite speed/relativity of simultaneity engines” to arrive at the alien home world just as the armada is arming and preparing, wreaking havoc before withdrawing. Captain X just won a battle in the past. He then reverses course and arrives back at his starting place, and now is getting quite a different message from the Wienerdog’s home world describing a horrific spoiling attack. Captain Y tells his navigator/helm/engineer to set a course and speed to arrive in time to raise the alarm of the home world fleet. The armada never leaves . . . but the Poodle is badly damaged. And on and on and on, the captains of each ship using Special Relativity and their FTL drives to break the chain of cause and effect with abandon, and (one assumes) relish.\n Which means that any FTL process at all can be made to break what we think of as cause and effect. I can’t tell you that we will never find a tachyon. And our human conceptions of things like “cause and effect” are essentially features of our minds that make it easier to catch food, not be eaten, and reproduce. Cause and effect are deeply built into everything we know about how the universe works, from the large-scale structure of space and time to how quantum field theories work (wave functions are strictly zero outside their future light cones).\n But those are all structures we humans have built to make bits of the world make human sense to our human minds. We have been wrong before, we will be wrong again, and we could well be so very wrong about FTL. But we have lots of data that says most of ordinary space (“get the message” and “arrive at the battle”) behaves well enough like our models to construct reliable engineered systems.\n As storytelling devices, both faster-than-light and time travel have pretty-well laid out conventions, and I am not here to say that those conventions are wrong, or that they are not fun, or that they are not immensely consequential in the history of speculative fiction. In light of the actual known and “hard science” behavior of space-time, it seems the only plausible “hard-sci fi” stance for a story that includes FTL is to adopt the absurdist stance of The Hitchhiker’s Guide to the Galaxy. To paraphrase, if anyone every figured out what was REALLY going on, the world would instantly be replaced by something even more strange and wonderful. And we could all read about it in a nice speculative story.\n Galen T. Pickett has been a member of the physics faculty at Cal State Long Beach since 1999. He lives in the greater LA area with his spouse, four grown children, and several canines. His writing is inspired by the grandeur of the physical world and the absurdity of the academic world, in nearly equal measure."}