{"fingerprint": "h77tcHV6GnX+37cRUDeKtPISu5U=", "sitename": "Clarkesworld Magazine", "title": "Accepting a More Profitable Shoe: A Conversation with M. C. Planck by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/planck_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Accepting a More Profitable Shoe: A Conversation with M. C. Planck by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Accepting a More Profitable Shoe: A Conversation with M. C. Planck\n There’s much to enjoy (and admire) about M. C. Planck’s debut novel, The Kassa Gambit. There’s the gritty, well-textured world-building; the lead characters Lt. Kyle Daspar, a “Bruce Willis-like” spy, and Prudence Falling, a “kick-ass . . . but not brash” heroine who holds together a motley crew of space adventurers.\n The prose stays punchy and tough throughout, but allows for lyricism along the way as well.\n In The Kassa Gambit, Planck seems to have picked the best elements from the spy thriller and threaded them through a fast-moving space adventure.\n At the beginning, it’s been hundreds of years since the earth became uninhabitable for humans. Humanity has colonized one planet after another in an attempt to satiate humanity’s seemingly limitless appetite for expansion. Some, like Altair Prime, flourish in gentle environments, and others barely survive poisonous atmospheres, heavy gravity, and other dangers; but the one trouble they never encounter is competition. Mankind seems alone in the universe.\n And then the freighter, Ulysses, passes close to Kassa and picks up a faint distress beacon. Reluctantly, the roguish Prudence Falling decides to land her ship only to find a handful of survivors hiding in the smoking ruins of a once thriving farming company. Next comes the not-quite-what-he-seems Lt. Kyle Despar from Altair Prime, a policeman and low-level apparatchik in an imperialist political party. Kassa has been attacked; the body count is high, and the prime suspect is an unknown alien race. Now Falling and Despar have to figure out who their enemies really are, and possibly, the enemies of the entire human race.\n “For me, the real point is the discussion Prudence has with Mauree, the antiques dealer, over the nature and responsibilities of the ‘Tech-ten’ societies,” said Planck. “The rest of it’s just a bit of fun.”\n The American-born Planck now lives and writes in Australia. Below, we take a little time to get to know him and to discuss writing in general, his new novel in particular . . . and a tree climbing dog named Yahzi.\n Before we really get started, since this is your debut novel, is there anything we need to know about you?\n For years Jack Vance made a point of not giving interviews or even having an author’s blurb on his books; he felt his work should stand on its own, without any reference to the author. What you should know about me is that I am vain enough to desire the same affectation, although my publisher and agent have other ideas.\n You’ve traveled, moved around, and shifted careers a good bit. How do you suppose your “nearly-transient childhood” and various careers prepared you for writing speculative fiction in general and this novel in particular?\n I’ve been to almost all of the states in the USA, which I think gives a certain sense of place. Reading American Gods, one certainly gets the impression that all that traveling affected Neil Gamain, so surely it must have done me some good.\n Mostly, though, I spent a lot of time reading. I estimate I’ve read something on the order of 5,000 books or so, the majority in SF&F but not all. I like to think all that time spent traveling through the genre has given me a sense of place for it.\n Where'd you start with The Kassa Gambit? What came first?\n Setting came first; I wanted to write a space-ship story because that’s what my wife likes. Then I needed something exciting to open with. Thus the mines; the idea that everything could blow up in the first few pages. Then I had to figure out why there were mines. The rest followed.\n What came next?\n Prudence’s character was the second starting point. I wanted a heroine that wasn’t sassy. Kick-ass, yes, but not brash.\n How'd you go bout building Kassa, Altair Prime, and the universe of The Kassa Gambit?\n Most of the locations were plot-driven; Altair had to be hospitable, Kassa had to be primitive, etc. Solistar and Baharain were fun, though. I just tried to imagine how people would adapt to places that had their own quirks.\n The solar suits are one of the few pieces of real science; heavy salts in rubber really do intercept x-rays. I read about a dentist who invented rubber smocks to replace the lead-lined ones. I particularly liked the image of a planet where you could breathe the air, but the sun would kill you; contrasted with another planet where the air was silently toxic but everything else was fine. Every world had its own way to die; on Altair, the danger was boredom, which ultimately turns out to be less benign than it sounds.\n I was also heavily inspired (obviously) by Jack Vance, the master of the space picaresque. The monks are a homage to both his Moon Moth and Dave Duncan’s Hero!.\n What are some of Vance’s most significant influences on you? I wonder if there are any significant ways in which you disagree with Vance’s take on the genre?\n Vance embodies both style and substance. He is one of those authors you can identify from a single paragraph, not merely from the baroque vocabulary but also from the sardonic voice. Even when he is being serious or tragic you can hear him in the background, like Horace Walpole: “This world is a comedy to those that think, a tragedy to those that feel.”\n He is also the master of realistic fantasia; his worlds are always extreme and unique, but at the edge of plausible. Too many authors (in my humble opinion) live by the “rule of cool;” if it’s a cool scene, that’s good enough. Vance always seems to want to make the underlying framework sound, as well.\n If there is anything I disagree with Vance on, it is purely a product of our times. Much of Vance’s work has a patina of sexism to it which might occasionally strike the modern reader. For his time, however, he was as un-sexist as I think it was possible to be; even through his worst, most flagrantly misogynistic characters, you can hear him chuckling through the tears in the background. (Now I need to stress he isn’t that sexist; he’s no Robert A. Heinlein!)\n The other thing he missed was computers. One of his novels has an index card machine. But everybody missed computers, so again, not much of a knock. It does make you twitch, though: if the old masters could miss that, what are we missing? What will future generations chuckle at? Although, honestly, if people are still reading my work that far in the future, I don’t care if they’re laughing.\n Here is a perfect example of Vance’s voice in action. Several characters are having a discussion about religion and the origin of the universe. After listening to a number of amusingly bizarre theories, the grumpy pragmatist of the group is compelled to give his opinion, and does so in true Vancian style:\n “Notice this rent in my garment; I am at a loss to explain its presence! I am even more puzzled by the existence of the universe.”\n What is it about the “space picaresque” that appeals to you? Why clever rogues and not sparkle-tooth heroes?\n A sparkle-tooth hero is just a clever rogue on a lucky streak.\n Mostly, though, I can’t stand the concept of fate. Character agency is what drives dramatic tension. The whole farm-boy-destined-for-greatness grates on my nerves. Heroes have destinies, but rogues have interesting stories.\n Where in the universe of The Kassa Gambit would you most and least like to visit?\n Most: Zanzibar. Like Jorgun, I suspect I would be thrilled with the faux crenulations and open-air bazaars.\n Least: Baharain. Toxic and oppressive, and that’s just the government. The deadly air and extra gravity are no fun either.\n Do the governments in your novel ever live up to their responsibilities? Is it even possible for them?\n Altair is actually a very nice place to live. They build restaurants in the air and their biggest worry is what to wear to a party. That’s the very definition of a successful government. And ultimately it is the strength of Altair that saves the day; Kyle and Prudence are necessary but not sufficient.\n What moment or moments best capture(s) the essence of Prudence Falling?\n The rented shoes. That she recognized how absurd the concept was, and embraced it anyway. That’s probably the most original idea in the whole book, and a comment on the absurdity of commercial engineering: putting advanced technology to work solely to protect brand identity. Not to make a better shoe, but to make a more profitable shoe. One could possibly draw a parallel with current events from that, but I won’t be held responsible.\n Second would be when she first lands on Kassa; that compassion tempered with caution. Originally I wanted to call the book “Prudence Falling,” as in prudence when falling out of orbit. But both my agent and my editor thought that was a terrible title.\n What changed from your original vision of The Kassa Gambit and what remained the same?\n Actually, remarkably little changed. Once Kyle showed up, the rest of the story seemed kind of inevitable. The book is pretty much the same as my first draft.\n One thing I did have to change was some of the language and world-setting; originally I called Fleet personnel by the appellation “milits,’ which earned some reproving glances from my wife [Sara Creasy], insomuch as that was a term from her Song of Scarabaeus. She did let me keep the inertial mass spaceship engines, though, which is nice considering I invented them for her.\n I also borrowed the nodes, which she invented years ago before we met. The whole “stuck in hyperspace” trope is pretty common, of course, but the idea that these locations are fixed and immutable is less common. I found that really interesting.\n So our books could actually be set in the same universe, albeit very far apart. Her book has a different feel, though; more modern, more focused on the tech and big ideas, while mine is very much a low-level romp.\n In what ways has your wife influenced you as a writer in general and as a writer of The Kassa Gambit in particular?\n She sparked TKG by telling me I had to write a story where everything was blowing up on the first page. Also, we both love Firefly. It doesn’t hurt that she used to be a professional editor, either. We bounce story ideas off of each other, although she tends to do more bouncing than actual writing.\n Thanks to her, my manuscripts look like I understand grammar. Her real contribution, though, was inspiring me to write romance novels, which is how I learned to write female characters. But we’ll talk no more about that!\n In what ways, if any, were you surprised by the characters along the way?\n The answer would have to be Garcia. I am sure that I did not have such a heroic role for him in mind when I wrote him. But he seemed the perfect choice, almost mystically equipped for that particular bit of glory. I am always happiest when the hero’s power turns out to be endurance; the ability to hold on, to persevere in the face of both danger and temptation. Secondly, I expect my heroes to know their limits, to understand the difference between sacrifice and suicide. Garcia first equips himself with the tools necessary for his task, and then makes clear just how limited his contribution can be; he is under no illusions of grandeur, and he allows no one else to assign them to him. To me, that is the best kind of heroism.\n The middle of the novel is as taut as a drum. How do you go about building, layering, and maintaining such a high level of suspense and intrigue?\n The middle part was a bit difficult. I was worried that people would get bored with the shilly-shallying and side-plots. I think it mostly works because Kyle seems about to die in every chapter. I wanted to put in more interesting places, but I didn’t want to sacrifice plot momentum. Vance could make those places a whole story in themselves; I'm not quite there yet.\n What's next for you?\n I have a fantasy novel with the agent, and I’m working on a contemporary SF about a dog.\n I’m a huge dog lover; I used to have a coyote-shepherd mix that was the smartest non-human animal I have ever encountered. Problem was, his genius was dedicated to pure evil. Some dogs think they’re human; Yahzi assumed everyone else was a dog.\n Which was funny since he was practically a cat. Twice I had to climb a tree to get him down. He had this on-going war with an owl in the riverbed, and unlike most dogs, would look up to find it. Some of our trees have pretty low-hanging branches, and before you know it this damn dog is twenty feet off the ground. Of course, like a cat, he had no freaking clue how to get down. That was a heart-in-the-mouth moment (two of them, actually).\n He also had a thing going with the local coyote pack. He would go tearing off after them, trying to make them submit to his rule. I would go tearing after him, trying to keep him alive (he outweighed the coyotes by a good margin, but they had a whole pack).\n That sense of adventure—that willingness to go for the brass ring—was very inspiring. It kept me young beyond my time. Yahzi knew no fear. Prudence, yes; he didn’t mess with German Shepherds, geese, or horses, because he knew his limits. But he was willing to give trees a go.\n So, in some small way, my next SF is homage to that nature; to the creature who is more than animal, but not human; a victim of our meddling with the natural order. All dog stories, really, are like that; Call of the Wild is just Frankenstein on four legs.\n Any parting words?\n I hope not! This is supposed to be au revoir, not goodbye. Unless the agent really, really hates the fantasy novel.\n Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}