{"fingerprint": "ak7RivlXo6HxZf2WfAMk/WSWK/w=", "sitename": "Clarkesworld Magazine", "title": "Red Lights, and Rain by Gareth L. Powell", "author": "Gareth L Powell", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/powell_10_17_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Red Lights, and Rain by Gareth L. Powell", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5440 words, short story, REPRINT\n Red Lights, and Rain\n It’s raining in Amsterdam. Paige stands in the oak-paneled front bar of a small corner pub. She has wet hair because she walked here from her hotel. Now she’s standing by the open door, holding half a liter of Amstel, watching the rain stipple the surface of the canal across the street. For the fourth time in five minutes, she takes out her mobile and checks the screen for messages. From across the room, the barman looks at her. He has dark skin and gold dreads. Seeing the phone in her hand again, he smiles, obviously convinced she’s waiting for a date.\n Outside, damp tourists pass in the rain, looking for the Anne Frank house; open-topped pleasure boats seek shelter beneath humped-back bridges; and bare-headed boys cut past on scooters, cigarettes flaring, girlfriends clinging side-saddle to the parcel shelves, tires going bop-bop-bop on the wet cobblestones. Paige sucks the froth from her beer. On the other side of the canal, a church bell clangs nine o’clock. As it happens, she is waiting for a man, but this won’t be any sort of date, and she’ll be lucky if she survives to see the sun come up tomorrow morning. She pockets the mobile, changes the beer glass from one hand to the other, and slips her fingers into the pocket of her coat, allowing them to brush the cold metal butt of the pistol she’s carrying. It’s a lightweight coil gun: a magnetic projectile accelerator, fifty years more advanced than anything else in this time zone, and capable of punching a titanium slug through a concrete wall. With luck, it will be enough.\n She watches the barman lay out new beer mats on the zinc counter. He’s just a boy, really. She should probably warn him to leave, but she doesn’t want to attract too much attention, not just yet. She doesn’t want the police to blunder in and complicate matters.\n For a moment, her eyes are off the door, and that’s when Josef arrives. She hears the swish of his coat, the clack of his boots as they hit the step. She sees the barman’s gaze flick past her shoulder, and his eyes widen, and she turns to find Josef standing on the threshold, close enough to kiss.\n “Hello, Paige.” He’s at least five inches taller than she is; rake thin with pale lips and rain-slicked hair.\n “Josef.” She slides her right hand into her coat, sees him notice the movement.\n “Are you here to kill me, Paige?”\n “Yes.”\n “It’s not going to be easy.”\n “I know.”\n He flicks his eyes in the direction of the bar, licks his bottom lip. “What about him?”\n Paige takes a step back, placing herself between the “vampire” and the boy with the golden dreadlocks. With her hand still in her pocket, she curls her index finger around the trigger of the coil gun.\n “Not tonight, Josef.”\n Josef shrugs and folds his arms, shifts his weight petulantly from one foot to the other.\n “So, what?” he says. “You want to go at it right now, in here?”\n Paige shakes her head. She’s trying not to show emotion, but her heart’s hammering and she’s sure he can hear it.\n “Outside,” she says. Josef narrows his eyes. He looks her up and down, assessing her as an opponent. Despite his attenuated frame, she knows he can strike like a whip when he wants to. She tenses, ready for his attack and, for a moment, they’re frozen like that: eyes locked, waiting for the other to make the first move. Then Josef laughs. He turns on his heel, flicks up the collar of his coat, and steps out into the rain.\n Paige lets out a long breath. Her stomach’s churning. She pulls the coil gun from her pocket and looks over at the barman.\n “Stay here,” she says.\n She follows Josef into a small concrete yard at the rear of the pub, surrounded by walls on all sides, and lit from above by the orange reflection of city lights on low cloud. Rusty dumpsters stand against one wall; a fire escape ladder hangs from the back of the pub; and metal trapdoors cover the cellar. Two stories above, the gutters leak, spattering the concrete.\n Josef says, “So, how do you want to do this?”\n Paige lets the peeling wooden door to the street bang shut behind her, hiding them from passers-by. The coil gun feels heavy in her hand.\n “Get over by the wall,” she says.\n Josef shakes his head.\n She opens her mouth to insist but, before she can speak or raise the gun, he’s closed the distance between them, his weight slamming her back against the wooden door. She feels his breath on her cheek, his hand clasping her throat. She tries to bring the gun to bear but he chops it away, sending it clattering across the wet floor.\n “You’re pathetic,” he growls, and lifts her by the throat. Her feet paw at empty air. She tries to prize his hand loose, but his fingers are like talons, and she can’t breathe; she’s choking. In desperation, she kicks his kneecap, making him stagger. With a snarl, he tosses her against one of the large wheeled dumpsters. She hits it with an echoing crash, and ends up on her hands and knees, coughing, struggling for air. Josef’s boot catches her in the ribs, and rolls her onto her side. He stamps down once, twice, and something snaps in her left forearm. The pain fills her. She yelps, and curls herself around it. The coil gun rests on the concrete three or four meters away on the other side of the yard, and there’s no way he’ll let her reach it. He kicks her twice more, then leans down with his mouth open, letting her see his glistening ceramic incisors. They’re fully extended now, locked in attack position, and ready to tear out her windpipe.\n “Ha’ enough?” he says, the fangs distorting his speech.\n Paige coughs again. She’s cradling her broken arm, and she still can’t breathe properly. She’s about to tell him to go to hell, when the back door of the pub swings open, and out steps the boy with the golden dreads, a sawn-off antique shotgun held at his hip.\n “That’s enough,” he says. His eyes are wide and scared.\n Josef looks up with a hiss, teeth bared. Startled, the barman pulls the trigger. The flash and bang fill the yard. Josef takes both barrels in the chest. It snatches him away like laundry in the wind, and he lands by the door to the street, flapping and yelling, drumming his boot heels on the concrete.\n “Shoot him again,” Paige gasps, but the young man stands frozen in place, transfixed by the thrashing vampire. He hasn’t even reloaded. Paige uses her good arm to claw her way into a sitting position. The rain’s soaked through her clothes.\n “Shoot him!”\n But it’s too late. Still hollering, Josef claws his way through the wooden door, out onto the street. Paige pulls herself up and makes it to the pavement just in time to see him slip over the edge of the bank, into the canal, dropping noiselessly into the water between two tethered barges. She turns back to find the boy with the shotgun looking at her.\n “Is he dead?”\n She shakes her head. The air’s tangy with gun smoke. “No, he’ll be back.” She scoops up her fallen coil gun and slides it back into her coat pocket. Her left arm’s clutched against her chest. Every time she moves, she has to bite her lip against the pain.\n The boy takes her by the shoulder, and she can feel his hands shake as he guides her into the pub kitchen, where she leans against the wall as he locks and bolts the back door.\n When she asks, the boy tells her his name is Federico. He settles her on a barstool, plonks a shot glass and a half-empty bottle of cognac on the counter, then goes to close the front door.\n “I’m going to call the police,” he says.\n As he brushes past her, Paige catches his arm. “There’s no time, we have to leave.”\n He looks down at her hand.\n “I don’t have to do anything,” he says. “Not until you explain what the hell just happened.”\n She releases him. He’s frightened, but the fear’s manifesting as anger, and she’s going to have to do something drastic to convince him.\n “Okay,” she says. She puts her left arm on the bar and rolls up the sleeve, letting him see the bloody contusions from Josef’s boot, and the splinter of bone, like a shard of broken china, sticking up through the skin.\n “What are you doing?”\n “Shush.” She takes hold of her wrist, forces the arm flat against the zinc counter, and twists. There’s an audible click, and the two halves of broken bone snap back into place. When her eyes have stopped watering, she plucks out the loose shard and drops it with a clink into the ashtray. With it out of the way, the skin around the tear starts to heal. In less than a minute, only a red mark remains.\n Frederico takes a step back, eyes wide, hand pointing.\n “That’s not natural.”\n Paige lifts the half-empty bottle of cognac with her right hand, pulls the plastic-coated cork with her teeth, and spits it across the bar.\n “Josef heals even faster than I do,” she says. “You blew a hole in his chest, but he’ll be as good as new in an hour, maybe less.”\n “W-what are you?”\n Paige takes a solid nip of the brandy.\n “I’m as human as you are,” she says, and gets to her feet. She can feel the stiffness fading from her limbs, the hurt evaporating from her ribs and arm. “But Josef’s something quite different. And trust me, you really don’t want to be here when he comes back.”\n “But the police—”\n “Forget the police. You shot him, that makes it personal.”\n Federico puts his fists on his hips.\n “I don’t believe you.”\n Paige jerks a thumb at the back door. “Then believe what you saw out there.” She stands and pats down her coat, making sure she still has everything she needs. Federico looks from her to the door, and then back again.\n “Is he really that dangerous?”\n “Oh yes.”\n “Then, what do you suggest?”\n Paige rubs her face. She doesn’t want to be saddled with a civilian, doesn’t want to be responsible for anybody else’s well-being; but this young man saved her life, and she knows she owes him for that.\n She sighs.\n “Your best bet’s to come with me, right now,” she says. “I’m the only one who knows what we’re up against, the only one with even half a chance of being able to protect you.”\n “How do I know I can trust you?”\n She looks him square in the eye.\n “Because I’m not the one who’s going to come back here and rip your throat out.”\n She lets Federico pull on a battered leather biker jacket two sizes too large, and they leave the pub and splash their way down the cobbled streets in the direction of the Red Light District, and Paige’s hotel. As they walk, she keeps her eye on the canal.\n Federico says, “Is he really a, you know?”\n “A vampire?” Paige shakes her head. “No. At least, not in the sense you’re thinking. There’s nothing supernatural or romantic about him. He’s not afraid of crosses or garlic, or any of that bullshit.”\n “But I saw his teeth.”\n “Ceramic implants.”\n They cut across a square in the shadow of a medieval church. Federico has the shotgun under his jacket, and it makes him walk stiffly. The rain’s still falling, and there’s music from the bars and coffeehouses; but few people are out on the street.\n “Then what is he? Some sort of psycho?”\n Paige slows for a second, and turns to him. “He’s a guerrilla.”\n “I don’t understand.”\n She starts walking again. “I don’t expect you to.” Her right hand’s in her coat pocket, gripping the coil gun. She leads him out of the square, across a footbridge, and then they’re into the Red Light District, with its pink neon shop fronts and narrow alleys. Her hotel’s close to the Central Station. By the time they get there, they’re both soaked, and stand dripping together in the elevator that takes them up to her floor.\n “In a thousand years’ time, there’s going to be a war,” she says, watching the floor numbers count off. “And it’s going to be a particularly nasty one, with atrocities on all sides.”\n The lift doors open and she leads him along the carpeted corridor to her room. Inside, the room smells stale. It’s been her base of operations for nearly a month, and she hasn’t let the cleaner touch it in all that time. She hasn’t even opened the curtains.\n “The vampires were bred to fight in the war,” she says. “They were designed to operate behind enemy lines, terrorizing civilians, sowing fear and confusion.” She shrugs off her coat and drops it over the back of a chair. “They’re trained to go to ground, blend in as best they can, then start killing people. They’re strong and fast, and optimized for night combat.”\n Federico’s standing in the doorway, shivering. She ushers him in and sits him on the bed. Gingerly, she takes the shotgun from his hands, and lays it on the sheet beside him; she then drapes a blanket around his shoulders.\n “After the war, some of them escaped, and they’ve been spreading backwards through time ever since.” She crosses to the wardrobe, and pulls out a spirit bottle. It’s a liter of vodka. She takes two teacups off the side and pours a large measure for him, a smaller one for herself. “They’re designed to survive for long durations, without support. They can eat just about anything organic, and they’re hard to kill. You can hurt them, but as long as their hearts are beating and their brains are intact, there’s a chance they’ll be able to repair themselves, given enough time.”\n She puts the bottle aside and flexes the fingers of her left hand—there’s still an ache, deep in the bone.\n “That’s important,” she says. She kneels down in front of Federico, and takes his hands in hers. “The next time we see Josef, we’ve got to kill him, before he kills us. And the only way to do that is to do as much damage as possible. Stop his heart, destroy his brain, and he’s dead.”\n She takes one of the teacups and presses it into Federico’s hands.\n “Sorry,” He says, accepting the drink, “did you say that this war is going to take place?”\n “A thousand years downstream, yes.”\n “So it hasn’t happened yet?”\n “No.”\n He frowns.\n “Who are you?”\n Paige reaches for her coat, and pulls out the coil gun. “I’m a fangbanger, a vampire killer.”\n “And you’re from the future too?”\n Paige stands.\n “Look,” she says. “All you need to know tonight is this: When you see Josef, shoot out his legs. That’ll immobilize him, and give us time to kill him.” She stops talking then. He can see Federico’s had enough for one night. She slips a pill into his next drink and, within minutes, he’s asleep, wrapped in the blanket, with the shotgun clasped protectively across his chest.\n Alone with her thoughts, Paige moves quietly. She turns out the bedside light and crosses to the window, pulling aside the heavy curtain. It’s after twelve now, and the trams have stopped for the night. The streets are quiet. She feels she should congratulate Josef on his choice of hiding place. Amsterdam is an easy city in which to be a stranger; there are so many tourists, so many distractions, that it’s a simple matter to lose yourself in the crowd. If she hadn’t known what to look for, she might never have found him. But then, she’s been a fangbanger for a long time, and she’s learned to piece together seemingly unrelated deaths and unexplained crimes; to filter out the background noise of modern urban life in order to reveal the unmistakable M.O. of an active vampire. She leans her forehead against the window glass; heart pumping in her chest, knowing it won’t take Josef long to track her down. She’s been doing this job for enough years, waded through enough shit, to know how dangerous a wounded vampire can be.\n At 4am, the sky starts to gray in the east. Federico’s still asleep, and Paige gives up her vigil. She tucks the coil gun into the back of her belt, pulls on a sweater to cover it, and wanders down to the hotel restaurant. When she gets there, she finds the place empty, although she can hear cooking sounds from the kitchen as the staff gear up for the breakfast rush. She helps herself to a cup of coffee from the pot, and a large handful of sugar sachets, and takes it all over to a table by the window, where she stirs the contents of the little packets into her coffee. There are sixteen altogether, and she uses them all. Then, leaving the sticky mess to cool, she rests her left arm on the table, and clenches and unclenches her fist. Everything seems in order. The tendons move as they should, and there’s no trace of the break. It doesn’t even ache now. Satisfied, she takes a sip of the lip-curlingly sweet coffee. It tastes disgusting, but she needs the sugar to refuel the tweaked macrophages and artificial fibroblasts that have allowed her to heal so quickly.\n Outside the window, it’s still raining. She watched the drops slither on the glass. It makes her think of Josef in better times, before he had his fangs implanted. She remembers him as bright and swift and clever; a sociopath, yes, but still her best student. And there it is, her dirty little secret, the inconvenient truth she’s been hiding from Federico: the reason she makes such a good vampire hunter is that during the war, before the vampires were deployed against the enemy, it was she who trained them. She was a military psychologist at the time, an expert in guerrilla warfare. While combat instructors taught the vampires how to kill, she showed them a range of nasty tricks culled from a thousand hard-fought insurgencies: from the Scythians of Central Asia to the soldiers of the Viet Cong, and beyond.\n She remembers her penultimate briefing in particular.\n “The vampire’s a powerful archetype,” she said to the cadets. “It’s an expression of our darker side. It plays into our most primal anxieties, from the threat of rape to the fear of being eaten.” It was a hot day, and the sun blazed through the classroom windows. She walked up and down in front of her students, hands clasped behind her back. At the rear of the room, the surgeons waited with their trolleys, ready to wheel the young men and women down to the operating theater, one-by-one, in order to implant their fangs and night-adapted eyes. “To complete your mission, you must be prepared to kill. You must become assassins—anonymous killers in the night, spreading panic and mistrust.” She stopped pacing and turned to Josef. He sat in the front row of the classroom, chin on fist, eyes blazing, and she knew it would be the last time she’d see him before his transformation. “If you do your jobs correctly,” she said, “each of you will be worth a hundred troops. You’ll demoralize the enemy, eat out his fighting spirit from the inside. You’ll have the soldiers worried about their families, the families suspicious of their neighbors. But in order to achieve this, you’ll have to move like shadows, and show no mercy. Do anything that needs to be done, be ruthless, and be prepared to strike anywhere, at any time.”\n She had taught them every psychological trick she knew, and shown them how to exploit the power of myth, how to generate fear and horror from darkness and blood. From their test scores, she’d known they were intelligent. In fact, she’d personally overseen the original selection process, picking only those recruits with the right balance of brains and insanity—those clever enough to survive the mission, but also psychotic enough to become the monsters they’d need to become in order to succeed.\n And then later, when the war went temporal, spilling into the surrounding decades, they came back and she briefed them again, only this time on the peculiarities of each of the time zones in which they were to operate, giving them the background they’d need in order to blend into each zone’s civilian population.\n Sometimes, she wonders if her history lessons inspired their eventual escape into this dim and distant past, far from even the outermost fringes of the conflict. One thing’s for certain: since they mutinied, and back to these primitive times, she’s had to travel all over the place in order to hunt them down. She’s tracked individual vampires across half a dozen decades, in Los Angeles, Cairo, Warsaw, and London.\n Now she’s here, in Amsterdam.\n And suddenly, there’s Josef.\n He’s standing in the shadow of a doorway on the other side of the street, watching her through the glass. He has his hands in the pockets of his black raincoat. Their eyes meet for a second and Paige can’t breathe. Then he’s gone, moving fast. Between parked cars, she catches a glimpse of him crossing the street, heading for the back of the hotel. With a curse, she pushes herself to her feet. Josef will know which room she’s staying in—a simple phone call will have furnished him with that information—and now he’s after Federico, hoping to kill the boy before tackling her.\n Paige bursts out into the foyer. Her room’s on the fourth floor, so there’s no time to take the stairs. However, luck’s on her side: this early in the morning, the elevators all stand ready, their doors open. She slams into the nearest, and slaps the button for the fourth floor. Then, even as the doors are closing, she’s pulling the coil gun from her belt and checking its magazine.\n Paige kicks her shoes off in the elevator and pads along the corridor in her socks. As she nears her room, she hears the door splinter: Josef’s kicked his way in.\n “Damn.”\n She lifts the coil gun to her shoulder, and risks a peek around the frame. The room’s dark. She can see a faint glow from the curtains. There are shadows all over the place: chairs, desks, and suitcases. Any one of them could be a crouched vampire.\n “Fuck.”\n She ducks back into the corridor and takes a few quick breaths. If Josef’s still in there, he’ll have heard her already—and there’s a good possibility Federico’s already dead. She flicks off the coil gun’s safety catch. There’s nothing beyond this room but window: the chances of civilian casualties are slight. Stepping back, she gives the trigger a squeeze. The gun whines. Holes appear in the door. Splinters flick out. The TV sparks. A chair blows apart.\n And there, in the maelstrom: a shadow moves.\n She tries to hose him down, but he’s moving too fast. He hits the wall and pushes off; hits the floor and rolls; and then he’s running on all fours, leaping at her throat before she can draw a bead.\n Paige rolls with the impact, still pressing the trigger. Scraps of material fly from Josef’s overcoat. An overhead light explodes. Blood sprays. His ceramic teeth scrape her neck, grazing the skin. Then his momentum carries him over her head, and she uses a Judo throw to heave him into the corridor wall. He hits like an upside down starfish, arms and legs splayed, and then falls to the floor.\n They both lie panting.\n The carpet’s soft. She rolls onto her side. Josef’s lying on his front, looking sideways at her. His eyes are as blue as a gas flame. This is the first good look she’s had at him since he left her class, and he looks older and harder than she remembers. His fangs are white and clean. Blood soaks into the carpet from a hole in his side.\n He doesn’t move as she elbows herself up into a sitting position; but, as soon as she lifts the coil gun, he twists. His wrist flicks out, and a pair of shiny throwing stars bite Paige’s arm. She cries out and the gun drops from her fingers. Instinctively, she reaches for it with her left hand, but Josef’s anticipated the move: he pushes himself towards her, delivering a kick to her cheek that shatters the bone.\n Paige falls into the open doorway of her room. Black spots dapple her vision. She feels Josef grip her leg. His hands work their way up. He’s climbing her, using his weight to keep her pinned down. She tries to fight back, but she’s still dazed. He swats her hands away from his face.\n Then he’s on her, his thighs clamped across her hips, his knees pinning her arms. He wraps his fingers in her hair, and yanks her head back, exposing her throat. His fangs are fully deployed. She sees them through the hair hanging down over his face, and cringes, expecting him to lunge for her throat.\n Instead, Josef clears his throat\n “I don’t want to kill you,” he says around his teeth. He pulls away, and his incisors slip back into their sheaths. He lets go of her hair and sits up, straddling her. Paige blinks up at him as he smoothes back his wet hair. “I just want to talk.”\n They end up slumped against opposite walls of the corridor. Josef’s bleeding onto the carpet; Paige feels as if she’s been hit by a fire truck. One side of her face throbs with pain, and the eye above her broken cheekbone won’t focus properly.\n “You’ve got me all wrong,” Josef says.\n She gives him a look.\n “You’re a killer.”\n “Not anymore.” He lets his shoulders relax, but keeps one hand pressed to the bullet hole in his side.\n “But Federico—”\n “I haven’t touched him.”\n “He’s still alive?”\n Josef shrugs. “I can’t say for sure. You sprayed a lot of bullets in there.”\n And suddenly, they’re falling back into their old pattern: teacher and student—and she knows there’s something he’s not telling her.\n “What’s going on, Josef? Why am I still alive?”\n He tips his head back, resting it against the wall.\n “Because things are different now,” he says. “I’m different.” He reaches into his coat and pulls out a photograph, which he Frisbees across to her.\n “I wasn’t trying to hurt you, you know? Not here, and not at the pub.” He dips his chin and looks at her. “Just acting in self-defense, trying to stop you from killing me.”\n The picture shows Josef holding a child, maybe four or five years old.\n “What’s this?”\n “It’s my daughter.”\n The girl has Josef’s blue eyes and blonde hair. She’s wearing a red dress.\n “Your daughter?”\n Josef closes his eyes.\n “Yes.”\n Paige glances at the coil gun, lying on the carpet between them. She wonders if she can reach it before he can reach her.\n Josef says, “I don’t want any more trouble.”\n Paige lifts a hand to her ruined cheek, and her lip curls.\n “So what? You think it matters what you want? So you’ve gone and got yourself a family, and you think that wipes away all the shit you’ve done, all the people you’ve killed?”\n She reaches for the gun. Josef howls in frustration, and lunges for her throat. His teeth rip into her esophagus, and she feels his jaw snap shut on her windpipe. His hair fills her face, and he’s heavy on her chest. She can’t breathe, and wonders how many others have died like this. How many others, because of her, and what she taught him?\n Josef pulls back, his face dripping with her blood and, as Paige gasps for breath, the wound bubbles.\n Josef snatches the photograph from her unresisting fingers. She tries to move her arms, but can’t. Josef’s speaking, but the fangs make it difficult, and she can’t hear him over the roaring in her ears. Her eyes swivel around in panic, looking for help. The guests in the other rooms must be awake now, and cowering behind their peepholes. Some at least will have called the police.\n Then, as she twists her head, she catches movement in the room behind her. Federico stumbles into the light. The boy looks dazed and frightened; there are scratch marks on his face, but he has the shotgun in his hands.\n There’s a flash, and Josef jerks. Part of his face disappears, bitten off by the blast. Another flash, and he topples from Paige like a puppet with its strings cut, knocking his head against the doorframe as he falls.\n Paige slaps a palm over the sucking wound in her neck, pinching the skin together, hoping she can heal before she suffocates.\n Federico bends over her. Wordless, she points to the coil gun, and he kicks it over.\n “Help me up,” she croaks. As long as she keeps her hand covering the injury, her vocal chords still work.\n With Federico’s hands under her shoulders, she struggles to her feet and coughs up a wad of blood. She feels unsteady, but each breath is easier than the last.\n Josef lies in a spreading patch of red-soaked carpet. One of his eyes is completely gone; that side of his face is a gory ruin; but the other seems miraculously untouched, and still beautiful. His hands twitch on the carpet like angry spiders.\n Paige plucks the slippery, homemade throwing stars from her forearm, and tosses them aside. She points the coil gun at Josef’s heart. Dimly, she can hear sirens pulling up on the street outside.\n Josef’s remaining eyelid flutters. She knows he’s down, but he’s obviously not out.\n She says, “How many people have you killed, Josef?” Then, without waiting for an answer, she pulls the trigger. The gun whines and his chest blows apart. His heels scrape at the floor, as if trying to escape, and she raises the gun to his face.\n “I’m sorry,” she says.\n She looks away as she fires, and she keeps the trigger depressed until the magazine clicks empty.\n When she looks back, Josef’s head’s gone, and there’s a hole in the floor.\n The photograph of his daughter falls from his fingers.\n He’s dead.\n She sticks the spent gun back in her belt. For some reason, her smashed cheek hurts more than her torn throat. She looks around to find Federico leaning on the doorframe.\n Paige hawks red phlegm onto the carpet. Then she leans down and takes hold of Josef’s boot. Gritting her teeth, she drags his body back into her ruined hotel room. Moving slowly and painfully, she retrieves the vodka bottle from the dressing table, spins the lid off, and raises the bottle in a toast to her fallen student. She stands over him for a long moment. Then she takes a deep swallow, which makes her cough.\n “Goodbye, Josef,” she says. There’s nothing else to say. There’s no triumph here, no closure, nothing but bone-deep weariness. Solemnly, she pours the remaining contents of the bottle—most of a liter of spirit—over his chest and legs; then she pulls a complimentary matchbook from the desk, and strikes one.\n The wet clothes go up in a woof of blue flame. The fire spills onto the carpet, and the room fills with smoke.\n Paige opens the desk drawer and takes out another clip of ammo for the coil gun. Then she limps back to Federico.\n “I have to go,” she says. She has to move on to the next target, the next time zone.\n A fire alarm rings, and the sprinklers go off. The shotgun’s on the floor at Federico’s feet. He’s holding the photograph of Josef’s daughter. Water’s running down his face, streaking his cheeks. His dreads are soaked.\n “You’re a fucking monster,” he says.\n Paige puts a hand to the torn flesh of her throat. She can feel the sides stitching themselves back together.\n “I know,” she says.\n And with that, she fades away.\n Originally published in Solaris Rising 3: The New Solaris Book of Science Fiction, edited by Ian Whates.\n Gareth L. Powell is an award-winning author from the UK. His alternate history thriller, Ack-Ack Macaque won the 2013 BSFA Award for Best Novel, spawned two sequels, and was shortlisted in the Best Translated Novel category for the 2016 Seiun Awards in Japan. His short fiction has appeared in a host of magazines and anthologies, including Interzone, Solaris Rising 3, and The Year's Best Science Fiction, and his story \"Ride The Blue Horse\" made the shortlist for the 2015 BSFA Award. Gareth is currently working on a new trilogy for Titan Books. The first volume, Embers Of War, will be published in Feb 2018 and followed by two sequels, Fleet Of Knives and Light Of Impossible Stars. He is also writing a crime thriller."}