{"fingerprint": "Omt2wZlN1Eu8/jbnkhjVKIlZdKQ=", "sitename": "Clarkesworld Magazine", "title": "Not Now, Sweetie, Daddy's Worldbuilding by Tim Pratt", "author": "Tim Pratt", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/pratt_04_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Not Now, Sweetie, Daddy's Worldbuilding by Tim Pratt", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Not Now, Sweetie, Daddy's Worldbuilding\n I’m not a full-time writer. It’s much worse than that: I’m a guy with a day job who also has enough freelance work to keep a full-time writer busy. In the past couple of years I’ve made more money from writing than I have in my job as an editor at a trade magazine, but in my attempts to pay down the credit card debt accrued in my misspent early twenties, I’ve kept the day job even as my writing workload increased. At this point, I do a couple thousand words of non-fiction a week, and I’m almost finished with my current book contract (which required me to write four novels in two years); add in the occasional short story, book review, and articles like this one, and, well, you can imagine, I spend a lot of time typing.\n All of which made me a little anxious when my wife (also a writer, Heather Shaw) and I started talking about having a kid back in 2006. The timing was right in a lot of ways; we weren’t quite as flat broke as usual, we weren’t getting any younger, and, more importantly, we wanted our own little bundle of pooping screaming joy. But I’m no stranger to kids. I knew having a baby would utterly transform our lives—mostly, but not entirely, in positive ways. The not-so-positive ways I imagined included sleep-deprivation and a general time-crunch, but I figured, hey, people have been having babies for a few hundred millennia, and it hasn’t spelled the doom of all art and culture and civilization, so I’m sure we’ll cope.\n But after my wife got pregnant and we began spreading the news, I started to get the comments. The knowing, nodding comments from other parents, some of whom were also writers. “That’s it for your writing career for a few years,” they’d say. Or, “Get ready to become an appendage to a tiny human,” they’d say. Or, “So long, sense of self!” Well, hell. Seriously? I could live without my sense of self, but having a kid would trash my ability to write? That was problematic, since the only way we could afford to have a kid, at least without switching to an all-macaroni-and-cheese diet, was with the extra money I made from writing. If parenthood and cranking out words were incompatible, I was pretty well screwed.\n Fortunately I saw a few counterexamples. Creative parents who’d managed to keep producing work, while still enjoying their kids. Many of them used resources I didn’t expect to have, though—nannies, for instance. Or babysitters who came in to watch the kids for a couple of days a week. Or, and this seemed crucial, not working the equivalent of two full-time jobs. I knew writing and parenting an infant could be done—I just wasn’t sure how I, in particular, would do it.\n Our son River was born on November 8, 2007. The birth experience was harrowing and transformative, and once everything was settled down and mom and baby were okay, I was as happy as I’ve ever been. We spent the next few days in the hospital, where my wife slept in a hospital bed, my son slept in a little tiny baby bed, and I slept—or, rather, failed to sleep—on a cot that was essentially a large block of wood with a yoga mat stapled on top of it. At one point, having gone a day and a half without rest, but unable to sleep, I thought, “Okay, let’s do a proof of concept. Let’s write something.”\n I’d done that kind of ritual psych-yourself-out magic before. I went to the Clarion writing workshop in 1999, right after college (remember that debt I ran up in my misspent twenties? Spending six weeks at a workshop was one of the causes of that). At the workshop, I heard about the “post-Clarion slump” that afflicted many writers. After spending six weeks being hyper-critical, a switch got thrown in some people’s heads, and they couldn’t write a damn thing for six months or a year or two years or four, because they couldn’t turn off the internal editor. I was terrified of something like that happening to me, so immediately after returning from Clarion, I wrote a novel. In about 90 days. I didn’t sell the novel or anything, ever, but I proved to myself that I could still write, at least as well as I ever could.\n So while my wife slept, and my son slept, I sat in the hall outside the hospital room, and I wrote. When I finished the story, and my wife woke up, I read it to her, and to our son (he wasn’t much of an audience then, but I don’t hold it against him). The story was called “The River Boy,” and it appeared in this very magazine in January. I proved to myself that I could still write (salable!) fiction, even after not sleeping for 36 hours, in terrible conditions. That was an important moment. That got me over the psychological perils of writing as a new father.\n At the time, I thought, “Ha! I showed you, assorted naysayers!” Boy, was I dumb. Sure, I’d overcome any potential psychological block—but that didn’t help much with practical matters, did it?\n I am, by nature, a binge writer. I like sitting at my computer, cranking up iTunes, and tippy-tapping the keys for six or eight hours at a go. (With breaks to occasionally stare out the window or eat a cheeseburger.) A couple of years ago I finagled things at my day job to get a schedule that’s perfect for me. I work four days a week (nine-hour-days, no less), and get every Wednesday off. On those Wednesdays, I would write—freelance non-fiction stuff in the morning, then I’d take a walk (both an attempt to exercise my sedentary corpus and a chance to think about the afternoon’s work), and then I’d work on fiction for the rest of the day. I was crazy productive. I kept on top of my book-every-six-months deadlines, never turned in a review or column late, and even wrote the occasional short story, just to keep my hand in.\n But with a kid, everything changed. My wife was on maternity leave for a while, and when I got home from work, she was justifiably exhausted and ready to have me take over the kid for a while—something I was happy to do, having missed him all day. As a newborn, he didn’t have a sleep schedule so much as a series of randomly-occurring naps of no set duration, which made it tough for me to get enough sleep to function as a human being, let alone compose words of deathless (or even usably disposable) prose. I could usually scrounge a couple of hours each week to get work done, which was enough to stay on top of my freelance deadlines . . . but what about my novel, the fourth and final one on my contract, due shortly before my son turns six months old? And what about after my wife’s maternity leave ended and she went back to work, too? We wrangled our schedules such that we could avoid day care—I take the kid into the office with me a couple days a week (it’s a small office, and baby-friendly, which helps), and my wife works from home a few different days a week, so between us, the kid is always taken care of. But that means a distinct lack of what you childless types call “free time.” Where was I going to get seven or eight hours in a row, ever, to binge-write fiction?\n Well, nowhere. With a kid, long chunks of time to write is like perpetual motion or zero point energy. You just can’t get it, at least, not without putting more energy into the system than you get out. I was seriously contemplating hiring a babysitter for a few hours just so I could write—but with the kind of money fiction writing pays, that quickly becomes a losing proposition, economically speaking. So . . . I adjusted. Turns out, that’s what being a parent requires. Yes, I’m a natural binge writer. Yes, my preferred technique is to slip into that wonderful zen state of flow for several hours and emerge with twenty or thirty pages of prose. But you know what? Too bad.\n Let me tell you how I write now: in ten or fifteen minute increments. Sometimes a whole half hour on my lunch breaks at work. Or, when my kid wakes up at 4:30 a.m. and wants to eat, and I pour a bottle down him and know he’ll sleep for a couple more hours, I don’t go back to bed—I take advantage of that two hours, and sleep-dep be damned. We’ve got this toy—we call it the “sun spinner”—that’s basically a colorful mat with some toys dangling above, and big mirror, and it spins and sings and talks. Our kid loves it. Put him on his back under the mirror and he giggles and coos for ten minutes, or 20 minutes, or even 30 minutes. That’s when I write—hell, that’s when I wrote most of this. Now, at four months old, he’s finally getting into something resembling a sleep routine, with a morning nap and an afternoon nap. The naps don’t always happen, and they aren’t of dependable length, but on a good day he’ll snooze in the swing for a couple of hours in the morning and a couple of hours in the afternoon, and if I’m home from work that day, I get into work-mode and I crank.\n I am no longer thrown off my game by interruptions, phone calls, knocks at the door. Such things, once enough to distract me and wreck my productivity, now don’t even rate notice. I can pick up a plot thread abandoned two weeks ago mid-sentence and make it work again. I can type one-handed with a baby hanging on my other arm, gnawing on my bicep and kicking my keyboard tray. I plot while I push him in the stroller. I read page proofs while bottle feeding. I check copyedits during tummy time. I put him in the baby harness on my chest and type while he hollers about how incredibly bored he is just watching black marks appear on a white screen.\n I just do it. It helps that I have no choice. Deadlines have a way of concentrating the mind. Is my writing as good now as it once was? I have no idea. It’s definitely different. I worry about the flow of the language, that it might have lost something since I’m producing prose in such short bursts. I worry about having less time to revise, and about having more typos and continuity errors than I used to, and producing generally rougher and more hideous first drafts. And it’s not like I’ve got this thing figured out for all time; I mean, my son is four months old right now. He’s tiny, he pretty much stays where we put him (flailing and early attempts at rolling aside), and he’s overall easygoing. What will I do when he can get out of the swing on his own and do himself bodily harm if I don’t keep a close eye on him? What happens when the terrible twos start and he begins testing limits? When he needs help with his spelling homework? When I’m trying to work and he comes in after school and says, hopefully, “Daddy, will you play with me?” Will I really be able to look at him and say, “Not now, kiddo, daddy’s plotting?” I don’t know. I don’t know how it’ll work. I just know it will, somehow. Learning that I’m capable of absorbing major disruptions to my beloved routines, that I can make adjustments to do what’s necessary, is the first thing my son taught me. (Because I already knew how to change poop-filled diapers.)\n Tim Pratt lives in Oakland California with his wife Heather Shaw and their son River. His short fiction has appeared in The Best American Short Stories, The Year's Best Fantasy and Horror, and other nice places, and last year his story \"Impossible Dreams\" won a Hugo Award. Just lately he's been publishing a series of urban fantasy novels under the name T.A. Pratt, starting with Blood Engines in 2007, with Poison Sleep and Dead Reign to follow in 2008."}