{"fingerprint": "i3ZL6ALwNp3zG8rEqr6a8yFYIo8=", "sitename": "Clarkesworld Magazine", "title": "Struggling to Define Themselves: A Conversation with Cherie Priest by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/priest_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Struggling to Define Themselves: A Conversation with Cherie Priest by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nStruggling to Define Themselves: A Conversation with Cherie Priest\nCherie Priest writes everything from steampunk to horror to alternate history to Southern Gothic to urban fantasy. Sometimes she seems to be pulling the best from all the genres and subgenres and twisting them into harrowing rides for her characters. And there are few authors who can torment her protagonists quite like Priest does.\nA Southerner living in Seattle, Priest brings the best of both regions to her work — deep characterization, rich settings, a pervading sense of loss, and a boundless and battered sense of hope.\n\"I write about people in peculiar, sometimes historically improbable situations,\" said Priest. \"To answer in a broader, more philosophical fashion, I'd say that I tend to write about people who struggle to define themselves.\"\nPriest's Clockwork Century novels include airships, steam trains, zombies, mad scientists, Bushwhackers, and submarines. Her Eden Moore novels feature ghosts, magic, and ruin antebellum estates. Most importantly of all, her central characters do their damndest to survive. They are, as she says below, \"strong, competent people\" who face challenges larger than they are.\nPriest's first book, Four and Twenty Blackbirds, came out in 2003. Since then she has published eight more novels and novellas, including Boneshaker, Clementine, and the recent Dreadnought all set in the Clockwork Century series. Boneshaker was nominated for the Hugo Award and Nebula Award and won the Locus Award and the PBNA Award. She has at least four more novels slated for release in 2011 and 2012.\nCherie Priest has contributed fiction to anthologies from Tachyon Publications, Subterranean Press, and George R. R. Martin's Wild Cards universe, among others. Her writing has also appeared in magazines such as Subterranean Magazine, Chiaroscuro, and Apex Digest. When not writing fiction or freelancing magazine work, Priest is an associate editor at Subterranean Press.\nBelow, Priest and I talk about the South, the Clockwork Century, and where she's headed next.\nWhat do you enjoy about writing? What don't you enjoy?\nIt's indoor work with no heavy lifting. Also, it's amazing what people will share if you tell them you're a writer. I don't know if it's just the general sense of human exhibitionism or what — but if they think there's a chance you might write about them, they'll tell you stuff they wouldn't tell a doctor.\nBut more than that, it's fun and satisfying to produce a story. That's the meat of it, I suppose.\nThere's not much I dislike about it, except that sometimes it can be a lonely way to earn a living. When my husband gets home from work, I'm like a freaking puppy. \"You're home! You're home! I've been by myself all day...pay attention to me...\"\nWhat is the value of speculative fiction? At its best, what role does it play in the world?\nIt's entertaining. I don't think it's required to be any more or less than that, but that's not to say that it can't be — or isn't. Speculative fiction can be an interesting mirror, showing us what we're afraid of, what we want, what we hope. It's a form of fiction that gives us another way of talking about the problems and promises of our times.\nYou are originally from Florida and you've lived throughout the south. Your early books have southern settings and the recent Dreadnought starts in the southeast and moves westward. Some of your books have been called Southern Gothic. Do you self-identify as a southerner? What of the South shows up in your work?\nSure, I self-identify as a southerner — which is sometimes tricky. As a native Floridian, I'm in a funny position: Most of the traditional \"deep south\" states don't think of Florida as Southern, despite the fact that — especially in the rural sections of the state — many Floridians strongly identify as such.\nWhen I moved from Florida to Tennessee, I found myself constantly insisting that yes, I did too qualify as a Southerner, dammit ... meaning that I was asserting my right to be identified as part of the losing side. Which feels ... odd.\nIt was particularly weird once I started writing about Chattanooga. I considered myself a local, as I'd lived there a dozen years. But Chattanoogans (and Southerners in general) did (and still do) tend to see me as an outsider from another region.\nI'm not. And that's why I'm so comfortable there.\nWhen it comes to \"Southernness\" that may or may not appear in my books — it's all over my earlier work, as I often write about wherever I live. Boneshaker less so, for the obvious reason that it's set in Seattle; and I don't want to call out any particular character traits that might be identified as specifically \"Southern,\" because honestly, the strengths and weaknesses of Southerners are the strengths and weaknesses of people everywhere.\nWith a novel, what comes first — character, setting, plot, image, sight, sound, or something else? And how does it grow from there? Is it the same for stories and novels?\nIt depends, and for me, it's all the same regardless of the fiction's length.\nSometimes it starts with just a word, like Boneshaker. I thought, \"What a funny word. If you didn't know what it was [an old bicycle], it could be damn near anything.\" It could have sexual connotations, or horror implications, or the suggestion of violence and adventure. Hell, I sometimes call my husband's coffee roasting machine the \"Boneshaker.\" That word collided with my desire to write (a) a Seattle book, and (b) a steampunk book. When the three things combined, a novel grew out of it.\nBut sometimes it's more complicated. It's a character, or a situation. Often it's a fragment of real history so terribly strange and insufficient that it seems to demand a fuller telling. It varies greatly from project to project.\nI think Four and Twenty Blackbirds (my first novel) was inspired by some sidewalk drawings done by first-graders. Fathom started out as a sliver of a dream, barely remembered, about an abandoned house I saw on an island off the coast of St. Petersburg.\nYou just never know.\nMany of your novels have altered historical settings. Do you find the stories in history or do you have the stories and find the history to go with them?\nIt goes both ways. Often I'll read a snippet, a footnote, a lost scrap of history that's been largely forgotten. And I'll think to myself, \"Self, what a great jumping-off point for something bigger and weirder...\" But occasionally I'll have an idea for a character or a conflict, and then I go mining through the history books to find a good place to stick it.\nHow did you decide on the alternating point of view [POV] for Boneshaker?\nIt actually began with just Briar [Wilkes] as the POV. But everyone who read the first few chapters said the same thing — the feedback was uniform across the board: \"You really need to include the kid's POV. You're missing the opportunity to say a million things about this city.\"\nSo I ran with it, and created Zeke's storyline to interlace with his mother's — and I think the early readers were right. It gives a much fuller picture of the bizarre, dangerous world that way.\nYou've described Boneshaker as a thirty-something-year-old woman's coming of age story. Briar Wilkes is the mother of a runaway, daughter of a folk legend, and widow of a mad scientist... How on earth did you keep her from being consumed by the men in her life?\nI pitched her that way, to tell you the truth. I liked the idea of this woman who's been worn into a groove, defined by other people — in relation to these men, all three of whom are absent. I wanted to tell a story about her clawing out her own identity despite the words that have been stacked against her.\nYou want to know something funny? Women never ask me about this. It's always men who seem to find it interesting (and to tell you the truth, I really like it when they notice).\nMaybe it's something women are simply more accustomed to. We're mothers, wives or widows, whores, sluts, or any number of other descriptors — applied courtesy of our relationships with men. Our proximity to them so often defines us, whether we like it or not.\nYour version of the historical figure Princess Angeline in Boneshaker really kicks butt?\nAngeline was a real woman — Chief Sealth's daughter (I believe that's the appropriate spelling of his name, in English text, anyway). She lived to a very ripe old age, and was a local character for all her days. Quite a pill, by all reports — an intelligent woman with a strong personality. Allegedly, her ghost haunts the Pike Place Market.\nTo answer your question I'll have to be a little vague, in order to avoid Boneshaker spoilers, but here goes: Angeline had a daughter who died under suspicious circumstances, precisely as described in the book. And Angeline fought for decades, trying to see justice done ... but it never happened. She went to her grave knowing what had happened, but having never seen anyone answer for it.\nI thought it might be interesting to fix that.\nBoth Boneshaker and Dreadnought seem to be driven by characters' refusal to accept or be broken by painful loss. The intensity with which you inundate your characters with external jeopardy and internal turmoil makes me wonder... What is at the heart of a novel for you? At the heart of the process?\nI'm not sure, really. I think if I had to boil it down to the core of what's important to me from a storytelling standpoint, I'd say that I want to take strong, competent, intelligent people ... and challenge them. I hate plots wherein the crux of a matter turns out to be stupid behavior — wherein someone has to make a dumb, illogical choice in order to provide the suspense. It's much more interesting to me when the problem is larger than the character's capacity to easily manage it.\nWhat's next for you?\nNext? I'd like to write a few more Clockwork Century books, at least. Following Dreadnought I have Ganymede in the queue — a piece set in my alt-history version of New Orleans, and featuring a fourth-gen \"Hunley\"-esque submarine. Following that, my editor and I are still noodling around with a couple of different stories and angles, trying to decide precisely how to handle what comes after; so I'd rather not talk about that yet.\nSuffice it to say, there are definitely two more books in this setting forthcoming. In my perfect world, if the series continues to sell, I'd like to do another Seattle novel, plus one in Florida, one in Chattanooga, and one in Washington D. C. — whereupon I think I'd like to wrap up the war. I'm also considering a series of shorter pieces about Maria Boyd's case files with the Pinkerton National Detective Agency.\nApart from this franchise, I'm not entirely sure. I enjoy writing stories in the 19th century, but I have the start of a modern urban fantasy series coming from Bantam next year, and those have been an awful lot of fun. Maybe I'll chase those farther, and maybe I'll stick with the vintage stuff. It's hard to say.\nThe ideas are never the tough part. Finding enough hours in the day — that's the tough part.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}