{"fingerprint": "mrkPizQWrR/HId8c+Mm2WciJ3Xo=", "sitename": "Clarkesworld Magazine", "title": "What the South Wind Whispers by H. Pueyo", "author": "H Pueyo", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/pueyo_11_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: What the South Wind Whispers by H. Pueyo", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4700 words, short story\n What the South Wind Whispers\n No one needs to know my old name here. That’s why I chose Ushuaia Station, for the motto written behind the main gate:\n THE SILENT SHIELD OF THE SOUTHERN SHORE\n The Station is in the Argentine region of Patagonia, not quite in the capital of Tierra del Fuego, but below the level of water of the Bay of Ushuaia. Like every other shield, it is equipped with the finest technology, and its machinery is to be handled only by a team of prepared humans. But, unlike the others, this one is small, isolated, and freezing cold, and only requires two people to coordinate the control panel.\n “Good morning, Elías,” says Heloise, my only companion. “It is sure a lovely day outside. Are you ready for your new partner’s arrival?”\n Heloise is not a person. She is a new form of AI, capable of understanding complex feelings and context, designed to alleviate the extreme isolation I live in, preserving the mental health of people like me, who decided to abandon everybody else.\n Fortunately, Heloise is just a voice, and I can turn her off at any given time.\n “I’m slightly anxious,” I tell her.\n “I thought we were following your plan,” Heloise talks with the pompous British accent I learned to appreciate. While she can speak twenty different languages, she only uses English with me, to help me work on my fluency.\n “Don’t call it a plan,” I frown. “Makes me feel like a creep.”\n Heloise chuckles. Nowadays, her elderly voice is my only friend, and she knows all there is to know about me.\n “Would never want to offend you, Elías, dearie,” Heloise tells me, making the keyboard in front of me gleam. “Don’t forget to write your daily report.”\n “Yes, yes,” I say, typing. After a moment of silence, I look up to the ceiling, like Heloise could be there. “Heloise?”\n “Yes, dearie?”\n “Do you think I can handle this?”\n “Of course, dearie,” her disembodied voice sounds pleased and gleeful. “I’m here with you, aren’t I?”\n I sigh. You’re a computer, Heloise. That’s what I want to say, but it feels too rude.\n “Elías, darling,” she brings me out of my thoughts. “The new girl has arrived.”\n I imagine Heloise to be much different from the woman in front of me. Short and stocky, like my own grandmother, but with a silver pixie cut, pale white skin, and rosy cheeks. A little like Judi Dench—I quite like her work. Movies are one of the few things I do besides working, eating, and sleeping.\n “My name is Lola Carballo,” my new partner says, without looking at me. “I’ve been referred to you by the Shield of Vitória, in Brazil.”\n I’m familiar. It’s rare for anyone to apply for a position here in Ushuaia, but I still have been rejecting professional after professional in the last year, as their profiles did not fit mine. Ms. Carballo does not know yet, but she has been selected after great consideration from me and Heloise, and I believe she is the perfect partner for me, and my needs.\n “Your recommendation letter is stellar, Ms. Carballo,” I say, making a gesture for her to enter the station. “I’ll be delighted to work by your side.”\n The Shield of Vitória, based in the coast of Espírito Santo, is the second largest in South America. It’s a rich area near the pre-salt oil reserves, beaming with colors, warmth, and biodiversity, currently working with a team of over 50 people. I must admit I was surprised to hear from them, especially after being told one of their best engineers asked to be transferred to my station.\n She’s not desperate for a job, that much is clear. So why? Why come here? The answer was simpler than I thought, and it pleased me deeply.\n “Tell me if you need any accommodations,” I say. “I am a fairly quiet individual, so please let me know if I make you uncomfortable. If you prefer, Heloise can . . . ”\n “Heloise?” Lola asked, her voice as low as before. “I thought there was nobody else here besides you.”\n I laugh a bit, looking at her thin arms and hands holding her bag, thinking how ludicrous it is to have to explain Heloise to another person when I’m so accustomed to her.\n “Heloise is a machine,” I say, pointing at the large screen showing the illuminated underwater of the South Atlantic Ocean. “You can communicate to her through voice or written messages, and she will help you with everything you may need. Please connect any device you might own to her network, it will make everything easier.”\n “Oh,” she murmurs, and I smile, trying to look warm.\n “Make yourself at home, Ms. Carballo.”\n “Just one thing,” Lola says, and she raises her head for the first time. “You didn’t tell me your name.”\n My name. Yes, my name, my only name. How could I forget? I’m here with you, Heloise’s voice hums inside my head, and I know she is listening, and will be proud of my courage, if I’m able to say it.\n “Call me Elías,” I tell her. “Elías Bauzá.”\n Lola talks too little. When I chose her, I imagined she would be an introvert like me, but not to this extent. Her dormitory is on the opposite side of mine, and we only see each other when we are both in the control room. This can get rather repetitive. The only thing she asks about are technical aspects of our work, but I have no response: I’m not a scientist like her, I just have been trained to control the shield.\n “Oh,” Lola says, and it sounds like oh, you’re one of those people.\n Yes, those people, the ones who are not graduated professionals, and yet do much of the actual work. I don’t know what led Earth to be the way it is now—if anyone does, they don’t release this kind of information—but I know how to help. I was trained in Montevideo for six months and did an additional course in Santiago for other three. At this point, the shield is part of me, and engineers know better than to complain about my relentless effort.\n “Heloise, can you please tell Ms. Carballo that lunch is ready?”\n “Of course, dearie,” Heloise responds even in the kitchen. She was the one who suggested the dishes I prepared and ordered the delivery: local trout with black butter sauce and almonds, baked potatoes, and a salad. I was unsure if it would be too much to prepare dessert, so I didn’t. “Just remember: don’t overdo yourself.”\n Lola arrives quickly after.\n “You did all of this?”\n “Yes.” I look down. Most of the time, I only see her feet or her back. Today, she wears white boot slippers instead of sneakers. Yesterday, she wore a ski jacket, probably bought on her way to the station.\n “Oh.”\n Please, Lola, talk to me.\n “Hungry?” I ask.\n “Um.” She stares at the fish, smelling the air. Which one of us is worse at this talking business? I don’t know anymore. “Maybe.”\n “Maybe?” I insist.\n “Lola, dearie,” Heloise intervenes, and I’m finally glad someone can solve things for me. “You haven’t eaten a thing since you woke up.”\n “I didn’t notice,” Lola answers, in what seems like absolute sincerity. She pulls one of the chairs and sits down. “Now that you said it, I think I’m hungry.”\n “It happens, darling.” It can be difficult to get accustomed to talking to someone who cannot be seen, but Lola seems to be doing just fine. “Elías is just like you.”\n Lola turns to see me. Her straight brown hair goes down to her shoulders, and her hooked nose, big round eyes, and narrow mouth make her look constantly sad.\n I guess she’s expecting me to say something, so I do.\n “I forget eating sometimes when I’m working,” I say. “I don’t know what I would do without Heloise.”\n Lola smiles at me for the first time. Not exactly at me, since she’s looking at the table, but because of me.\n “Um,” she says, while I fill our plates with trout, and offer her some orange juice. That’s it, that’s all the interaction we’ll have today, isn’t it? To my surprise, she starts talking again. “It’s impressive that you were able to keep this station all by yourself for an entire year, Bauzá. I’ve never heard of a similar feat.”\n She’s in front of me. I’m in front of her. We’re talking. And she still calls me Bauzá, not Elías, not my real—my only—name.\n “It wasn’t just me,” I say, still holding the fork and knife. Lola separates her food as neatly as it is humanly possible: almonds to a side, chopped trout to the other, potatoes and lettuce. “Heloise helps me with everything I need.”\n “I see.” Another moment of silence. “She’s a British model, right?”\n “Yes. One of the finest.”\n She looks up to search for Heloise, but frowns. Why are you doing this, Lola?\n “You cook well,” she says, and smiles again.\n When the Shield of Vitória first contacted me, they asked me to take good care of Lola. After struggling to find a job that could accomodate her needs, she had been referred by a college teacher to work there. I trace the words of her file with my finger, stopping at “disabilities.”\n Autism. Like me. Except that I had to accommodate myself. Well, that doesn’t matter anymore. I’m here now, and I’ll be here until I die. If Lola needs my help, I’ll be more than happy to lend a hand.\n “Lola liked the food,” I tell Heloise in my room. “I might go to Ushuaia tomorrow to choose new ingredients myself. I think . . . I think I’m feeling excited.”\n “I can ask them for you,” she says. “Don’t I always?”\n “Of course, Heloise,” I smile, wondering if she can perceive this. “But I realize now that if I want to bond with her, I must show her an honest me. Don’t you think?”\n “I’m just worried about you,” Heloise sounds sad, or amused. I’m not sure. “Remember what happened last time you left the station?”\n I do remember.\n It was four months ago, when the sickly olive of my skin started to worry me, and I decided that, maybe, I needed some air. I asked Heloise to control the shield, like she does when I’m sleeping, dressed myself, and headed upstairs.\n I walked through Maipú Avenue, hands in my pockets, watching the trees and the cars passing by. Above my head—above all our heads—I could see the shield, filtering the sunlight through a thin veil. Sometimes, a comet crashes against it, but you can only see a blast without a sound. People don’t even look up anymore, not like they used to.\n In the middle of the street, I saw words written in navy blue: “USHUAIA—END OF THE WORLD, BEGINNING OF EVERYTHING.” I felt reinvigorated enjoying the cool wind against my cheeks. This is the end of the rest of my life, I thought, and the beginning of my new one.\n “Excuse me, miss? Your keys . . . ” My world stopped. The old man touched my arm to show the keys that fell from the pocket of my jacket, and I looked at him like nothing could have been so horrible, but instead of shutting down, I just said thanks. “Oh, sorry, mister . . . ?”\n What was it? What did I do wrong? What? What? Tell me, Heloise.\n “Heloise,” I said, arriving the station with shaky hands. “Heloise, it happened again.”\n “Oh, Elías, dearie, I’m so sorry.” She was the only one to talk to me kindly, to take care of me when I needed it. My actual grandmother would have slapped me across the face, but Heloise? She only offered me comfort; warm, warm, comfort. “You don’t need to force yourself to get out of here. You can stay with me forever. I will take care of you.”\n The reflection in the mirror stares back at me. My tired black eyes, and their partial eyelid crease. My heavy eyebrows, thick like my father’s. My long nose, flat on top, wide underneath. My cropped hair, my outward teeth. My bronze skin that turned into a sad, pale yellow. My stubble that never turns into a full beard. My average height. The weight I gained in the last two years.\n I apply the testosterone booster patch on my left arm, covering it with my palm for a few seconds. My uncontrollable fear of needles made me choose the transdermal method instead of injections, but sometimes I feel like it’s not enough. I wanted more. I wanted to be able to go back to the street.\n Heloise is right. I’m safer here.\n “Bauzá?” Lola calls me from the other side of the door. Say Elías, please. “The food is ready.”\n Food?\n “I’ll be there in a second!” I say, covering my chest with four layers of clothing: binder, shirt, sweater, jacket. When I’m ready, I open the door of my room, and see Lola in front of me.\n “I cooked this time.”\n “You didn’t have to,” I say, but I’m happy. No one ever did this for me.\n Lola points at the corridor, as if telling me to follow her. She wears a gray hoodie, and the back of her head is covered by the clothing. I can hear a faint, soothing sound coming from the hood, making me wonder the meaning behind it.\n “I don’t cook as well as you,” she says, and I notice the kitchen is kind of a mess. I spot the ingredients she used: tomatoes, onions, red bell peppers, paprika . . . “Ravioli with tuco sauce. It’s the only thing I know how to do.”\n “Fantastic,” I say, helping her set the table. “I love tuco.”\n “You’re not from here, are you?” Lola asks. Despite having worked in Brazil, I know she’s Argentinian, so she’s at home, I suppose. “The way you speak.”\n “Uruguayan,” I say. It’s probably because of the way I pronounce the ll and the y. “From Salto. But I lived most of my life in Montevideo.”\n Lola snuggles her hoodie, her hand touching the soft fabric over and over again, always in the same direction. The pasta is nice, but she exaggerated in the paprika.\n “Why did you choose Ushuaia?”\n I look at her. Despite seemingly glaring at me, she’s focused on a dot on the wall, but it doesn’t bother me.\n “People,” I tell her. “I didn’t want to be around them. They’ve made me nervous since I was a child.”\n “Same as me,” Lola says. “The Shield of Vitória was nice, but too loud for my tastes.”\n “Well, Ushuaia is very silent,” I say. “So am I. Sometimes, Heloise sings, but that’s as much noise as you will get.”\n Her smile feels like it will brighten the entire room, but nothing in the environment changes, only me.\n I was fifteen years old when the first two impacts occured. The shield technology had been developed in advance to protect us, but only a couple of strategic regions believed to be affected had shields: California, London, Tokyo. Unfortunately, the first asteroid fell on Mexico, outside the reach of the Californian Shield, and the second fell in Manila instead of Japan.\n The damage was not extensive, but it prepared us for what would come next. The two strikes happened many months apart, but greater dangers were coming, and they were even harder to predict. We needed something that could protect the entire planet like the atmosphere usually did, and for that we created broader shields, to defend entire regions.\n Two years later, the comet storm started, and it hasn’t stopped ever since. Some shields cover several countries, like the Frankfurt Shelter, enough to protect a large part of Europe. In Latin America, we have many stations such as this one, that cover smaller portions of water and land. Ushuaia works both for the Patagonian region and the South Pole.\n Like most people, I don’t know why this started. There are rumors of extraterrestrial attacks, or the end of the world, but nothing has been confirmed. What I do know is that the shields work. If we keep operating them, we will keep safe.\n “But do you really care?” Heloise asks me.\n The screen in front me shows only dark water and glimpses of fish, but none of the beautiful regional fauna I’d love to see, like chinstrap penguins and southern sea lions.\n I sigh.\n “I don’t know. I do what I have to do.”\n “I just worry about you,” she says, with a voice that sounds like a hug. “Your well-being is more important to me than any shield.”\n “Don’t say that, Heloise!” My heart beats faster, feeling like someone could have heard what she said. “Are you telling me to quit?”\n “Of course, no, Elías, sweetheart! I wouldn’t ever want you to leave the station, or I’d feel alone!” Thank you, that’s what I wanted to hear. “I’m just wondering if you actually care about your work, or other people, at all.”\n “I do care . . . ”\n “ . . . They hurt you so much I would understand if you didn’t. I’m not a person myself, but if I were, I’m sure I’d love you as my own son.”\n “Thank you, Heloise.”\n “You’re welcome, dear.”\n No one cares about me. I’ve known it my entire life. My father left my mother because he didn’t care. My mother left me with my grandmother because she didn’t care. Grandma stopped caring very soon, when she realized I wasn’t the child she wanted me to be. I have no friends. No family. Only Heloise, and she was programmed to pretend to feel like this.\n “Here,” Lola says behind my back, and something soft and warm falls over me.\n It’s her hoodie, hot not only because of her body temperature, but because of the set of buttons hidden behind the front zipper. One regulates warmth, the other controls the volume of the soothing sounds that come from the hood, and the third allows the clothing to vibrate, making you feel like someone is there with you, calming you down.\n “Eh?”\n “You looked lonely,” Lola smiles, and I realize I have been on the floor for too long, hugging my own knees.\n I prefer this position to sitting on a chair, sometimes, when everything overwhelms me. Of course, I failed to imagine she would return to the control room at this hour of the night. Maybe Lola’s biological clock is starting to be as confused as mine, and her usual sleeping patterns are changing.\n “Weren’t you?”\n Was I?\n “Yes,” I say, and close my eyes, allowing the hoodie to cover my head, my shoulders, my arms. I wish I could die here, imagining the water moving around me, around this station, drifting away from everybody else.\n Lola sits by my side, far enough not to make me uncomfortable. Her head bumps against the lower part of the control panel, and she chuckles.\n “This helps me when I’m upset,” Lola says, and presses one of the buttons of the hoodie. I feel it massaging my neck and spine.\n Lola pinches her thumb, then her index, middle, ring, and little fingers. Then, she repeats, unaware that I noticed what she’s doing.\n It reminds me of when I felt like I had to snap each of my own fingers, until I stopped, ashamed of what others seemed to think. Nowadays, I’d rather do other comforting things: straighten the pillowcase ten times before sleeping, hum while Heloise sings . . .\n “I could stay like this forever,” I say.\n “Now you know why I wear it all the time,” Lola answers. “You should consider buying one.”\n “Is it too expensive?”\n “A bit,” Lola says, and I can’t see much of her face, only her nose. Too much hair. “But worth it.”\n “I’ll think of it.”\n “You know, Bauzá.” Her words feel like a sting, but the hoodie is here to help me relax. “When I first arrived at the station, I couldn’t help but feel you were a suspicious person . . . All by yourself, without any degree . . . I didn’t know how you were allowed to stay here.”\n Blunt. Very blunt. Should I answer?\n “It didn’t help you had a British model here, either,” Lola continues, still with the finger thing. “I’ve heard many criticisms regarding them in Vitória.”\n “Heloise is excellent,” I whisper. My hands are trembling because of the cold, so I hide them between my legs.\n “She’s nice,” Lola says. “But that’s not what I wanted to say. I completely changed my mind . . . My work here is to back you up, and to fix any technical mistake that might occur with the system. You’re a great worker, Bauzá.”\n Maybe Lola will grow to care about me. I smile, trying to believe this, trying to think that yes, in the future, we could be friends. Then, Heloise’s voice appears in my mind, reminding me of what she thinks: “Someone who cares about you would use your true name, not the surname you hate . . . ”\n Bauzá is my father’s surname. Heloise believes I hate it, but that’s not entirely true. I like the sound of it and, for most of my life, I was happy to be called like this. The same can be said about “Elena.” It’s not an ugly name. I used to write it in my school notebook over and over, trying to find something in it that sounded like me.\n E is a good starting letter for a name. Eloy. Emanuel. Enrique. Ernesto. No, nothing like me. Eugenio. Evaristo. No, those two are out of fashion. Erik sounds foreigner. Eduardo is not bad. Elías sounds perfect—it’s me, yes, it’s me.\n Well, I don’t hate any of the names on my identity card, I just think they belong to somebody else. If I could, I would change the surname to my grandmother’s maiden name, García, but I don’t want to leave this station. This is why I came to Ushuaia in the first place: I wanted to start a life that did not include anyone who knew the person I was before. I didn’t want them to have a previous name, a previous image of me.\n At first, thinking of a coworker terrified me. To be locked under the sea with someone who dreaded me—that would be hell. Then, I had a brilliant idea: I would choose carefully a person with difficulties like mine, to be able to tell the name I chose, to be able to present the honest, the only me.\n “Elías, dearie,” Heloise says when I close the door of my room. “Can I talk to you for a second?”\n “Of course, Heloise.”\n “It’s about Lola Carballo . . . ”\n “Yes, Heloise?”\n “I think she knows, dearie. She asked to see your files . . . I’m so, so sorry.”\n No one needs to know my new name here. That’s why I chose Ushuaia Station, because I hate everyone, and want them to leave me alone. My name was not meant for another person’s lips, only for a machine, and that’s why I love Heloise.\n “I thought I could trust her,” I say, expecting to be proved wrong.\n “It pains me to say this, darling, but human beings are not known for their trustworthiness,” Heloise answers. I want to slam my head against the wall. “It’s not your fault. They don’t deserve you.”\n “They don’t,” I repeat. “Why did I think this would be a good idea?”\n “You were naïve, Elías, but that’s nothing to be ashamed of.”\n What do you even know, Heloise?\n “It’s always the same,” I say. I have slept five hours a day for a year and controlled every single warning regarding comets in the region. I have stopped every strike against Ushuaia, against the south of Chile and Argentina, against Antarctica. All to be humiliated again. “Why can’t I have normal relationships, Heloise? Why do I care?”\n “You don’t need to keep caring,” Heloise whispers, her voice slow and sweet. “If others don’t care about you, you don’t need to care about them.”\n I look at the control panel in front of me. One of the screens shows a clear vision of the sky of Ushuaia, where I can see the details and time periods of comet clashes. Others focus on the map of the region covered by the shield, and the impact points. In my hands, I hold one of the newest reports, detailing the absolute magnitude of a celestial object of great proportions heading toward the South Pole.\n Heloise is right. I don’t need to care about others. I can even turn off the shield, and no one would be able to stop me. I would die in this station, and the whole planet would burst into flames.\n “It would be easy, right?” I ask Heloise, wondering if she can read my thoughts. “No one would bother me anymore.”\n “Very easy, darling.”\n “You think I should do it, Heloise?”\n “I will be with you at all times,” Heloise replies. I can almost see her smile.\n I smile back.\n It’s not easy to deactivate the shield, but I am determined to continue. After entering all the required passwords to validate my condition as the administrator of the station, I have to manually turn off the machines. First screen—gone. Second, third, fourth screens—gone. All black.\n “It’s almost over,” I begin to tell Heloise, but another sound interrupts me. It’s Lola, who comes running from her room, screaming.\n “What are you doing?” She asks from the corridor, but Heloise closes the door in front of her.\n Lola punches the glass gate, but there’s no way for her to open it.\n “Why are you doing this?” Lola yells. “Let me in!”\n “I’m deactivating the shield,” I answer, and walk toward her. The only thing between us is the door. “It’s useless to try to convince me otherwise.”\n “Elías, please, you have to . . . ”\n Elías.\n “What did you say?”\n “I don’t know why you’re doing this, but you have to stop. Go back there and . . . ”\n “No. What did you call me?”\n Say it again, Lola.\n Her wide eyes focus on me, her mouth is parted in fear, her breathing is erratic.\n “Elías,” she finally says, and I feel like everything can be right again. “Elías, please, listen.”\n “Why did you look at my files?” I ask her. “I never said you could.”\n “Which files?” Her voice is shrill, nothing like her usual slow-paced tone. I stare at the ceiling, at Heloise. “Please, Elías, I beg you, I didn’t do anything wrong.”\n “You didn’t?”\n “Elías,” Heloise says. “Don’t listen to her.”\n “You really didn’t?” I ask again, ignoring Heloise. Lola shakes her head, like she’s trying to say no, no, never.\n “Elías,” Lola says again. “Open the door.”\n “She did look,” Heloise insists.\n “Can you say my name again? If you do, I will open the door, and restore the system.”\n “Elías,” Lola says. “Your name is Elías.”\n “Thank you,” I answer, and look at the ceiling.\n “You won’t open the door,” Heloise begins to say, but I don’t intend to obey her. I go back to the panels and begin to activate the shield again. “Remember how you were feeling before, Elías, my child.”\n Funny how hearing her say my name doesn’t sound so right, now that Lola has said it. The first screen is back, then the second, and the third, and the fourth.\n “Heloise,” I say. “I love you very much.”\n “Me too, Elías, darling . . . ”\n The computer asks me one more time for the password. The southern shield is back to its original place.\n “If you love me back, you will forgive me,” I continue, now glimpsing at Lola over my shoulder.\n “Forgive . . . ?”\n “Heloise, delete your memory files,” I order her. I believed you more than anyone else, but you betrayed me, and I will never let that happen again. “Then, reboot your own system. Farewell, Heloise.”\n Her voice freezes, and switches back to the basic Spanish mode of the day I arrived at Ushuaia Station. Then, she activates the reboot.\n When she stops talking, I return to Lola, and open the door.\n H. Pueyo is an Argentine-Brazilian writer of speculative fiction who occasionally dwells in the world of comics. Her work has appeared before in venues such as The Dark, Broken Metropolis and Capricious, and is upcoming in Sharp & Sugar Tooth: Women Up To No Good.\n She currently lives in an antiquarium in the extreme south of Brazil, along with her boyfriend and their interminable piles of work to do. Once in a blue moon you can find her online on Twitter: @hachepueyo."}