{"fingerprint": "biamIXvzmPIxHNC+7uBBit8m9nY=", "sitename": "Clarkesworld Magazine", "title": "Tyche and the Ants by Hannu Rajaniemi", "author": "Hannu Rajaniemi", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/rajaniemi_05_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tyche and the Ants by Hannu Rajaniemi", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6150 words, short story, REPRINT\nTyche and the Ants\nThe ants arrived on the Moon on the same day Tyche went through the Secret Door to give a ruby to the Magician.\nShe was glad to be out of the Base. The Brain had given her a Treatment earlier that morning, and that always left her tingly and nervous, with pent-up energy that could only be expended by running down the gray rolling slope down the side of Malapert Mountain, jumping and hooting.\n“Come on, keep up!” she shouted at the grag that the Brain had inevitably sent to keep an eye on her. The white-skinned machine followed her on its two thick treads, cylindrical arms swaying for balance as it rumbled laboriously downhill, following the little craters of Tyche’s footprints.\nExasperated, she crossed her arms and paused to wait. She looked up. The mouth of the Base was hidden from view, as it should be, to keep them safe from space sharks. The jagged edge of the mountain hid the Great Wrong Place from sight, except for a single wink of blue malice, just above the gleaming white of the upper slopes, a stark contrast against the velvet black of the sky. The white was not snow—that was a Wrong Place thing—but tiny beads of glass made by ancient meteor impacts. That’s what the Brain said, anyway. According to Chang’e the Moon Girl, it was all the jewels she had lost over the centuries she had lived here.\nTyche preferred Chang’e’s version. That made her think of the ruby, and she touched her belt pouch to make sure it was still there.\n“Outings are subject to being escorted at all times,” said the sonorous voice of the Brain in her helmet. “There is no reason to be impatient.”\nMost of the grags were autonomous: the Brain could only control a few of them at a time. But of course it would keep an eye on her, so soon after the Treatment.\n“Yes, there is, slowpoke,” Tyche muttered, stretching her arms and jumping up and down in frustration.\nHer suit flexed and flowed around her with the movement. She had grown it herself as well, the third one so far, although it had taken much longer than the ruby. Its many layers were alive, it felt light, and best of all, it had a powerskin, a slick porous tissue made from cells with mechanosensitive ion channels that translated her movements into power for the suit. It was so much better than the white clumsy fabric ones the Chinese had left behind; the grags had cut and sewn a baby-sized version out of those for her that kind of worked, but was impossibly stuffy and stiff.\nIt was only the second time she had tested the new suit, and she was proud of it: it was practically a wearable ecosystem, and she was pretty sure that with its photosynthesis layer, it would keep her alive for months, if she only had enough sunlight and carried enough of the horrible compressed Chinese nutrients.\nShe frowned. Her legs were suddenly gray, mottled with browns. She brushed them with her hand, and her fingers—slick silvery hue of the powerskin—came away the same color. It seemed the regolith dust clung to the suit. Annoying. She absently noted to do something about it for the next iteration when she fed the suit back into the Base’s big biofabber.\nNow the grag was stuck on the lip of a shallow crater, grinding treads sending up silent parabolas of little rocks and dust. Tyche had had enough of waiting.\n“I’ll be back for dinner,” she told the Brain.\nWithout waiting for the Base mind’s response, she switched off the radio, turned around, and started running.\nTyche settled into the easy stride the Jade Rabbit had shown her: gliding just above the surface, using well-timed toe-pushes to cross craters and small rocks that littered the uneven regolith.\nShe took the long way around, avoiding her old tracks that ran down much of the slope, just to confuse the poor grag more. She skirted around the edge of one of the pitch-black cold fingers—deeper craters that never got sunlight—that were everywhere on this side of the mountain. It would have been a shortcut, but it was too cold for her suit. Besides, the ink-men lived in the deep potholes, in the Other Moon beyond the Door.\nHalfway around, the ground suddenly shook. Tyche slid uncontrollably, almost going over the edge before she managed to stop by turning around mid-leap and jamming her toes into the chilly hard regolith when she landed. Her heart pounded. Had the ink-men brought something up from the deep dark, something big? Or had she just been almost hit by a meteorite? That had happened a couple of times, a sudden crater blooming soundlessly into being, right next to her.\nThen she saw beams of light in the blackness and realized that it was only the Base’s sandworm, a giant articulated machine with a maw full of toothy wheels that ground Helium-3 and other volatiles from the deep shadowy deposits.\nTyche breathed a sigh of relief and continued on her way. Many of the grag bodies were ugly, but she liked the sandworm. She had helped to program it: constantly toiling, it went into such deep places that the Brain could not control it remotely.\nThe Secret Door was in a shallow crater, maybe a hundred meters in diameter. She went down its slope with little choppy leaps and stopped her momentum with a deft pirouette and toe-brake, right in front of the Door.\nIt was made of two large pyramid-shaped rocks, leaning against each other at a funny angle, with a small triangular gap between them: the Big Old One, and the Troll. The Old One had two eyes made from shadows, and when Tyche squinted from the right angle, a rough outcrop and a groove in the base became a nose and a mouth. The Troll looked grumpy, half-squashed against the bigger rock’s bulk.\nAs she watched, the face of the Old One became alive and gave her a quizzical look. Tyche gave it a stiff bow—out of habit, even though she could have curtsied in her new suit.\nHow have you been, Tyche? the rock asked, in its silent voice.\n“I had a Treatment today,” she said dourly.\nThe rock could not nod, so it raised its eyebrows.\nAh. Always Treatments. Let me tell you, in my day, vacuum was the only treatment we had, and the sun, and a little meteorite every now and then to keep clean. Stick to that and you’ll live to be as old as I am.\nAnd as fat, grumbled the Troll. Believe me, once you carry him for a few million years, you start to feel it. What are you doing here, anyway?\nTyche grinned. “I made a ruby for the Magician.” She took it out and held it up proudly. She squeezed it a bit, careful not to damage her suit’s gloves against the rough edges, and held it in the Old One’s jet-black shadow, knocking it against the rock’s surface. It sparkled with tiny embers, just like it was supposed to. She had made it herself, using Verneuil flame fusion, and spiced it with a piezoelectric material so that it would convert motion to light.\nIt’s very beautiful, Tyche, the Old One said. I’m sure he will love it.\nOh? said the troll. Well, maybe the old fool will finally stop looking for the Queen Ruby, then, and settle down with poor Chang’e. In with you, now. You’re encouraging this sentimental piece of rubble here. He might start crying. Besides, everybody is waiting.\nTyche closed her eyes, counted to ten, and crawled through the opening between the rocks, through the Secret Door to her Other Moon.\nThe moment Tyche opened her eyes she saw that something was wrong. The house of the Jade Rabbit was broken. The boulders she had carefully balanced on top of each other lay scattered on the ground, and the lines she had drawn to make the rooms and the furniture were smudged. (Since it never rained, the house had not needed a roof.)\nThere was a silent sob. Chang’e the Moon Girl sat next to the Rabbit’s house, crying. Her flowing silk robes of purple, yellow, and red were a mess on the ground like broken wings, and her makeup had been running down her pale, powdered face.\n“Oh, Tyche!” she cried. “It is terrible, terrible!” She wiped a crystal tear from her eye. It evaporated in the vacuum before it could fall on the dust. Chang’e was a drama queen, and pretty, and knew it, too. Once, she had an affair with the Woodcutter just because she was bored, and bore him children, but they were already grown up and had moved to the Dark Side.\nTyche put her hands on her hips, suddenly angry. “Who did this?” she asked. “Was it the Cheese Goat?”\nTearful, Chang’e shook her head.\n“General Nutsy Nutsy? Or Mr. Cute?” The Moon People had many enemies, and there had been times when Tyche had led them in great battles, cutting her way through armies of stone with an aluminum rod the Magician had enchanted into a terrible bright blade. But none of them had ever been so mean as to smash the houses.\n“Who was it, then?”\nChang’e hid her face behind one flowing silken sleeve and pointed. And that’s when Tyche saw the first ant, moving in the ruins of the Jade Rabbit’s house.\nIt was not like a grag or an otho, and certainly not a Moon Person. It was a jumbled metal frame, all angles and shiny rods, like a vector calculation come to life, too straight and rigid against the rough surfaces of the rocks to be real. It was like two tetrahedrons inside each other, with a bulbous sphere at each vertex, each glittering like the eye of the Great Wrong Place.\nIt was not big, perhaps reaching up to Tyche’s knees. One of the telescoping metal struts had white letters on it. ANT-A3972, they said, even though the thing did not look like the ants Tyche had seen in videos.\nIt stretched and moved like the geometrical figures Tyche manipulated with a gesture during the Brain’s math lessons. Suddenly, it flipped over the Rabbit’s broken wall, making Tyche gasp. Then it shifted into a strange, slug-like motion over the regolith, first stretching, then contracting. It made Tyche’s skin crawl. As she watched, the ant thing fell into a crevice between two boulders—but dexterously pulled itself up, supported itself on a couple of vertices, and somersaulted over the obstacle like an acrobat.\nTyche stared at it. Anger started to build up in her chest. In the Base, she obeyed the Brain and the othos and the grags because she had Promised. But the Other Moon was her place: it belonged to her and the Moon People, and no one else.\n“Everybody else is hiding,” whispered Chang’e. “You have to do something, Tyche. Chase it away.”\n“Where is the Magician?” Tyche asked. He would know what to do. She did not like the way the ant thing moved.\nAs she hesitated, the creature swung around and, with a series of twitches, pulled itself up into a pyramid, as if watching her. It’s not so nasty-looking, Tyche thought. Maybe I could bring it back to the Base, introduce it to Hugbear. It would be a complex operation: she would have to assure the bear that she would always love it no matter what, and then carefully introduce the newcomer to it—\nThe ant thing darted forward, and a sharp pain stung Tyche’s thigh. One of the thing’s vertices had a spike that quickly retracted. Tyche’s suit grumbled as it sealed all its twenty-one layers, and soothed the tiny wound. Tears came to her eyes, and her mouth was suddenly dry. No Moon Person had ever hurt her, not even the ink-men, except to pretend. She almost switched her radio on and called the grag for help.\nThen she felt the eyes of the Moon People, looking at her from their windows. She gritted her teeth and ignored the bite of the wound. She was Tyche. She was brave. Had she not climbed to the Peak of Eternal Light once, all alone, following the solar panel cables, just to look the Great Wrong Place in the eye? (It had been smaller than she’d expected, tiny and blue and unblinking, with a bit of white and green, and altogether a disappointment.)\nCarefully, Tyche picked up a good-sized rock from the Jade Rabbit’s wall—it was broken anyway. She took a slow step towards the creature. It had suddenly contracted into something resembling a cube and seemed to be absorbed in something. Tyche moved right. The ant flinched at her shadow. She moved left—and swung the rock down as hard as she could.\nShe missed. The momentum took her down. Her knees hit the hard chilly regolith. The rock bounced away. This time the tears came, but Tyche struggled up and threw the rock after the creature. It was scrambling away, up the slope of the crater.\nTyche picked up the rock and followed. In spite of the steep climb, she gained on it with a few determined leaps, cheered on by the Moon People below. She was right at its heels when it climbed over the edge of the crater. But when she caught a glimpse of what lay beyond, she froze and dropped down on her belly.\nA bright patch of sunlight shone on the wide highland plain ahead. It was crawling with ants, hundreds of them. A rectangular carpet of them sat right in the middle, all joined together into a thick metal sheet. Every now and then it undulated like something soft, a shiny amoeba. Other ant things moved in orderly rows, sweeping the surroundings.\nThe one Tyche was following picked up speed on the level ground, rolling and bouncing, like a skeletal football, and as she watched from her hiding place, it joined the central mass. Immediately, the ant-sheet changed. Its sides stretched upwards into a hollow, cup-like shape: other ants at its base telescoped into a high, supporting structure, lifting it up. A sharp spike grew in the middle of the cup, and then the whole structure turned to point at the sky. A transmitter, Tyche thought, following it with her gaze.\nIt was aimed straight at the Great Wrong Place.\nTyche swallowed, turned around and slid back down. She was almost glad to see the grag down there, waiting for her patiently by the Secret Door.\nThe Brain did not sound angry, but then the Brain was never angry.\n“Evacuation procedure has been initiated,” it said. “This location has been compromised.”\nTyche was breathing hard: the Base was in a lava tube halfway up the south slope of the mountain, and the way up was always harder than the way down. This time, the grag had had no trouble keeping up with her. It had been a silent journey: she had tried to tell the Brain about the ants, but the AI had maintained complete radio silence until they were inside the Base.\n“What do you mean, evacuation?” Tyche demanded.\nShe opened the helmet of her suit and breathed in the comfortable yeasty smell of her home module. Her little home was converted from one of the old Chinese ones, snug white cylinders that huddled close to the main entrance of the cavernous lava tube. She always thought they looked like the front teeth in the mouth of a big snake.\nThe main tube itself was partially pressurized, over sixty meters in diameter and burrowed deep into the mountain. It split into many branches, expanded and reinforced by othos and grags with regolith concrete pillars. She had tried to play it there many times, but preferred the Other Moon: she did not like the stench from the bacteria that the othos seeded the walls with, the ones that pooped calcium and aluminum.\nNow, it was a hotbed of activity. The grags had set up bright lights and moved around, disassembling equipment and filling cryogenic tanks. The walls were alive with the tiny, soft, starfish-like othos, eating bacteria away. The Brain had not wasted any time.\n“We are leaving, Tyche,” the Brain said. “You need to get ready. The probe you found knows we are here. We are going away, to another place. A safer place. Do not worry. We have alternative locations prepared. It will be fine.”\nTyche bit her lip. It’s my fault. She wished the Brain had a proper face. It had a module of its own, in the coldest, unpressurized part of the tube, where its quantum processors could operate undisturbed, but inside it was just lasers and lenses and trapped ions, and rat brain cells grown to mesh with circuitry. How could it understand about the Jade Rabbit’s house? It wasn’t fair.\n“And before we go, you need a Treatment.”\nGoing away. She tried to wrap her mind around the concept. They had always been here, to be safe from the space sharks from the Great Wrong Place. And the Secret Door was here. If they went somewhere else, how would she find her way to the Other Moon? What would the Moon People do without her?\nAnd she still hadn’t given the ruby to the Magician.\nThe anger and fatigue exploded out of her in one hot wet burst.\n“I’m not going to go not going to go not going to go,” she said and ran into her sleeping cubicle. “And I don’t want a stupid Treatment,” she yelled, letting the door membrane congeal shut behind her.\nTyche took off her suit, flung it into a corner and cuddled against the Hugbear in her bed. Its ragged fur felt warm against her cheek, and its fake heartbeat was reassuring. She distantly remembered her Mum had made it move from afar, sometimes, stroked her hair with its paws, its round facescreen replaced with her features. That had been a long time ago and she was sure the bear was bigger then. But it was still soft.\nSuddenly, the bear moved. Her heart jumped with a strange, aching hope. But it was only the Brain. “Go ‘way,” she muttered.\n“Tyche, this is important,” said the Brain. “Do you remember what you promised?”\nShe shook her head. Her eyes were hot and wet. I’m not going to cry like Chang’e, she thought. I’m not.\n“Do you remember now?”\nThe bear’s face was replaced with a man and a woman. The man had no hair and his dark skin glistened. The woman was raven-haired and pale, with a face like a bird. Mum is even prettier than Chang’e, Tyche thought.\n“Hello, Tyche,” they said in unison, and laughed. “We are Kareem and Sofia,” the woman said. “We are your mommy and daddy. We hope you are well when you see this.” She touched the screen, quickly and lightly, like a little bunny hop on the regolith.\n“But if the Brain is showing you this,” Tyche’s Dad said, “then it means that something bad has happened and you need to do what the Brain tells you.”\n“You should not be angry at the Brain,” Mum said. “It is not like we are, it just plans and thinks. It just does what it was told to do. And we told it to keep you safe.”\n“You see, in the Great Wrong Place, people like us could not be safe,” Dad continued. “People like Mum and me and you were feared. They called us Greys, after the man who figured out how to make us, and they were jealous, because we lived longer than they did and had more time to figure things out. And because giving things silly names makes people feel better about themselves. Do we look gray to you?”\nNo. Tyche shook her head. The Magician was gray, but that was because he was always looking for rubies in dark places and never saw the sun.\n“So we came here, to build a Right Place, just the two of us.” Her Dad squeezed Mum’s shoulders, just like the bear used to do to Tyche. “And you were born here. You can’t imagine how happy we were.”\nThen Mum looked serious. “But we knew that the Wrong Place people might come looking for us. So we had to hide you, to make sure you would be safe, so they would not look inside you and cut you and find out what makes you work. They would do anything to have you.”\nFear crunched Tyche’s gut into a tiny cold ball. Cut you?\n“It was very, very hard, dear Tyche, because we love you. Very hard, not to touch you except from afar. But we want you to grow big and strong, and when the time comes, we will come and find you, and then we will all be in the Right Place together.”\n“But you have to promise to take your Treatments. Can you promise to do that? Can you promise to do what the Brain says?”\n“I promise,” Tyche muttered.\n“Goodbye, Tyche,” her parents said. “We will see you soon.”\nAnd then they were gone, and the Hugbear’s face was blank and pale brown again.\n“We need to go soon,” the Brain said again, and this time its voice sounded more gentle. “Please get ready. I would like you to have a Treatment before travel.”\nTyche sighed and nodded. It wasn’t fair. But she had promised.\nThe Brain sent Tyche a list of things she could take with her, scrolling in one of the windows of her room. It was a short list. She looked around at the fabbed figurines and the moon rock that she thought looked like a boy and the e-sheets floating everywhere with her favorite stories open. She could not even take the Hugbear. She felt alone, suddenly, like she had when she climbed to look at the Great Wrong Place on top of the mountain.\nThen she noticed the ruby lying on her bed. If I go away and take it with me, the Magician will never find it. She thought about the Magician and his panther, desperately looking from crater to crater, forever. It’s not fair. Even if I keep my promise, I’ll have to take it to him.\nAnd say goodbye.\nTyche sat down on the bed and thought very hard.\nThe Brain was everywhere, but it could not watch everything. It was based on a scanned human brain, some poor person who had died a long time ago. It had no cameras in her room. And its attention would be on the evacuation: it would have to keep programming and reprogramming the grags. She picked at the sensor bracelet in her wrist that monitored her life signs and location. That was the difficult bit. She would have to do something about that. But there wasn’t much time: the Brain would take her for a Treatment soon.\nShe hugged the bear again in frustration. It felt warm, and as she squeezed it hard, she could feel its pulse—\nTyche sat up. She remembered the Jade Rabbit’s stories and tricks, the tar rabbit he had made to trick an enemy.\nShe reached into the Hugbear’s head and pulled out a programming window, coupled it with her sensor. She summoned up old data logs, added some noise to them. Then she fed them to the bear, watched its pulse and breathing and other simulated life signs change to match hers.\nThen she took a deep breath, and as quickly as she could, she pulled off the bracelet and put it on the Hugbear.\n“Tyche? Is there something wrong?” the Brain asked.\nTyche’s heart jumped. Her mind raced. “It’s fine,” she said. “I think . . . I think I just banged my sensor a bit. I’m just getting ready now.” She tried to make her voice sound sweet, like a girl who always keeps her promises.\n“Your Treatment will be ready soon,” the Brain said and was gone. Heart pounding, Tyche started to put on her suit.\nThere was a game that Tyche used to play in the lava tube: how far could she get before she was spotted by the grags? She played it now, staying low, avoiding their camera eyes, hiding behind rock protrusions, crates, and cryogenic tanks, until she was in a tube branch that only had othos in it. The Brain did not usually control them directly, and besides, they did not have eyes. Still, her heart felt like meteorite impacts in her chest.\nShe pushed through a semi-pressurizing membrane. In this branch, the othos had dug too deep for calcium, and caused a roof collapse. In the dim green light of her suit’s fluorescence, she made way her up the tube’s slope. There. She climbed on a pile of rubble carefully. The othos had once told her there was an opening there, and she hoped it would be big enough for her to squeeze through.\nBoulders rolled under her, and she felt a sharp bang against her knee. The suit hissed at the sudden impact. She ignored the pain and ran her fingers along the rocks, following a very faint air current she could not have sensed without the suit. Then her fingers met regolith instead of rock. It was packed tight, and she had to push hard at it with her aluminum rod before it gave away. A shower of dust and rubble fell on her, and for a moment she thought there was going to be another collapse. But then there was a patch of velvet sky in front of her. She widened the opening, made herself as small as she could and crawled towards it.\nTyche emerged onto the mountainside. The sudden wide open space of rolling gray and brown around her felt like the time she had eaten too much sugar. Her legs and hands were wobbly, and she had to sit down for a moment. She shook herself: she had an appointment to keep. She checked that the ruby was still in its pouch, got up, and started downwards with the Rabbit’s lope.\nThe Secret Door was just the way Tyche had left it. She eyed the crater edge nervously, but there were no ants in sight. She bit her lip when she looked at the Old One and the Troll.\nWhat’s wrong? the Old One asked.\n“I’m going to have to go away.”\nDon’t worry. We’ll still be here when you come back.\n“I might never come back,” Tyche said, choking a bit.\nNever is a very long time, the Old One said. Even I have never seen never. We’ll be here. Take care, Tyche.\nTyche crawled through to the Other Moon, and found the Magician waiting for her.\nHe was very thin and tall, taller than the Old One even, and cast a long cold finger of a shadow in the crater. He had a sad face and a scraggly beard and white gloves and a tall top hat. Next to him lay his flying panther, all black, with eyes like tiny rubies.\n“Hello, Tyche,” the Magician said, with a voice like the rumble of the sandworm.\nTyche swallowed and took out the ruby from her pouch, holding it out to him.\n“I made this for you.” What if he doesn’t like it? But the Magician picked it up, slowly, eyes glowing, held it in both hands and gazed at it in awe.\n“That is very, very kind of you,” he whispered. Very carefully, he took off his hat and put the ruby in it. It was the first time Tyche had ever seen the Magician smile. Still, there was a sadness to his expression.\n“I didn’t want to leave before giving it to you,” she said.\n“That’s quite a fuss you caused for the Brain. He is going to be very worried.”\n“He deserves it. But I promised I would go with him.”\nThe Magician looked at the ruby one more time and put the hat back on his head.\n“Normally, I don’t interfere with the affairs of other people, but for this, I owe you a wish.”\nTyche took a deep breath. “I don’t want to live with the grags and the othos and the Brain anymore. I want to be in the Right Place with Mum and Dad.”\nThe Magician looked at her sadly.\n“I’m sorry, Tyche, but I can’t make that happen. My magic is not powerful enough.”\n“But they promised—”\n“Tyche, I know you don’t remember. And that’s why we Moon People remember for you. The space sharks came and took your parents, a long time ago. They are dead. I am sorry.”\nTyche closed her eyes. A picture in a window, a domed crater. Two bright things arcing over the horizon, like sharks. Then, brightness—\n“You’ve lived with the Brain ever since. You don’t remember because it makes you forget with the Treatments, so you don’t get too sad, so you stay the way your parents wanted to keep you. But we remember. And we always tell you the truth.”\nAnd suddenly they were all there, all the Moon People, coming from their houses: Chang’e and her children and the Jade Rabbit and the Woodcutter, looking at her gravely and nodding their heads.\nTyche could not bear to look at them. She covered her helmet with her hands, turned around, crawled through the Secret Door and ran away, away from the Other Moon. She ran, not a Rabbit run but a clumsy jerky crying run, until she stumbled on a boulder and went rolling higgledy-piggledy down. She lay curled up in the chilly regolith for a long time. And when she opened her eyes, the ants were all around her.\nThe ants were arranged around her in a half-circle, stretched into spiky pyramids, waving slightly, as if looking for something. Then they spoke. At first, it was just noise, hissing in her helmet, but after a second it resolved into a voice.\n“—hello,” it said, warm and female, like Chang’e, but older and deeper. “I am Alissa. Are you hurt?”\nTyche was frozen. She had never spoken to anyone who was not the Brain or one of the Moon People. Her tongue felt stiff.\n“Just tell me if you are all right. No one is going to hurt you. Do you feel bad anywhere?”\n“No,” Tyche breathed.\n“There is no need to be afraid. We will take you home.” A video feed flashed up inside her helmet, a spaceship that was made up of a cluster of legs and a globe that glinted golden. A circle appeared elsewhere in her field of vision, indicating a tiny pinpoint of light in the sky. “See? We are on our way.”\n“I don’t want to go to the Great Wrong Place,” she gasped. “I don’t want you to cut me up.”\nThere was a pause.\n“Why would we do that? There is nothing to be afraid of.”\n“Because Wrong Place people don’t like people like me.”\nAnother pause.\n“Dear child, I don’t know what you have been told, but things have changed. Your parents left Earth more than a century ago. We never thought we would find you, but we kept looking. And I’m glad we did. You have been alone on the Moon for a very long time.”\nTyche got up, slowly. I haven’t been alone. Her head spun. They would do anything to have you.\nShe backed off a few steps.\n“If I come with you,” she asked in a small voice, “will I see Kareem and Sofia again?”\nA pause again, longer this time.\n“Of course you will,” Alissa the ant-woman said finally. “They are right here, waiting for you.”\nLiar.\nSlowly, Tyche started backing off. The ants moved, closing their circle. I am faster than they are, she thought. They can’t catch me.\n“Where are you going?”\nTyche switched off her radio, cleared the circle of the ants with a leap and hit the ground running.\nTyche ran, faster than she had ever run before, faster even than when the Jade Rabbit challenged her to a race across the Shackleton Crater. Finally, her lungs and legs burned and she had to stop. She had set out without direction, but had gone up the mountain slope, close to the cold fingers. I don’t want to go back to the Base. The Brain never tells the truth either. Black dots danced in her eyes. They’ll never catch me.\nShe looked back, down towards the crater of the Secret Door. The ants were moving. They gathered into the metal sheet again. Then its sides stretched upwards until they met and formed a tubular structure. It elongated and weaved back and forth and slithered forward, faster than even Tyche could run; a metal snake. The pyramid shapes of the ants glinted in its head like teeth. Faster and faster it came, flowing over boulders and craters like it was weightless, a curtain of billowing dust behind it. She looked around for a hiding place, but she was on open ground now, except for the dark pool of the mining crater to the west.\nThen she remembered something the Jade Rabbit had once said. For anything that wants to eat you, there is something bigger that wants to eat it.\nThe ant-snake was barely a hundred meters behind her now, flipping back and forth in sinusoid waves on the regolith like a shiny metal whip. She stuck out her tongue at it, accidentally tasting the sweet inner surface of her helmet. Then she made it to the sunless crater’s edge.\nWith a few bounds, she was over the crater lip. It was like diving into icy water. Her suit groaned, and she could feel its joints stiffening up. But she kept going, towards the bottom, almost blind from the contrast between the pitch-black and the bright sun above. She followed the vibration in her soles. Boulders and pebbles rained on her helmet and she knew the ant-snake was right at her heels.\nThe lights of the sandworm almost blinded her. Now. She leaped up, as high as she could, feeling weightless, reached out for the utility ladder that she knew was on the huge machine’s topside. She grabbed it, banged painfully against the worm’s side, felt its thunder beneath her.\nAnd then, a grinding, shuddering vibration as the mining machine bit into the ant-snake, rolling right over it.\nMetal fragments flew into the air, glowing red-hot. One of them landed on Tyche’s arm. The suit made a bubble around it and spat it out. The sandworm came to an emergency halt, and Tyche almost fell off. It started disgorging its little repair grags, and Tyche felt a stab of guilt. She sat still until her breathing calmed down and the suit’s complaints about the cold got too loud.\nThen she dropped to the ground and started the climb back up, towards the Secret Door.\nThere were still a few ants left around the Secret Door, but Tyche ignored them. They were rolling around aimlessly, and there weren’t enough of them to build a transmitter. She looked up. The ship from the Great Wrong Place was still a distant star. She still had time.\nPainfully, bruised limbs aching, she crawled through the Secret Door for one last time.\nThe Moon People were still there, waiting for her. Tyche looked at them in the eye, one by one. Then she put her hands on her hips.\n“I have a wish,” she said. “I am going to go away. I’m going to make the Brain obey me, this time. I’m going to go and build a Right Place, all on my own. I’m never going to forget again. So I want you all to come with me.” She looked up at the Magician. “Can you do that?”\nSmiling, the man in the top hat nodded, spread his white-gloved fingers and whirled his cloak that had a bright red inner lining, like a ruby—\nTyche blinked. The Other Moon was gone. She looked around. She was standing on the other side of the Old One and the Troll, except that they looked just like rocks now. And the Moon People were inside her. I should feel heavier, carrying so many people, she thought. But instead she was empty and light.\nUncertainly at first, then with more confidence, she started walking back up Malapert Mountain, towards the Base. Her step was not a rabbit’s, nor a panther’s, nor a maiden’s silky tiptoe, just her very own.\nOriginally published in Edge of Infinity, edited by Jonathan Strahan, 2012.\nHannu Rajaniemi was born in Ylivieska, Finland, but spent many years in Edinburgh, Scotland where he received a Ph.D. in string theory, and currently lives in Oakland, California. He is the co-founder of ThinkTank Maths, which provides consultation service and research in applied mathematics and business development. Rajaniemi has had a big impact on the field with only a relatively small body of work. His first novel, The Quantum Thief, was published in 2010 to a great deal of critical buzz and response, and has been followed by two sequels, The Fractal Prince and The Causal Angel. His most recent book is a collection, Hannu Rajaniemi: Collected Stories. Coming up is a new novel, Summerland."}