{"fingerprint": "TfvyFSfuBJ3tbKq/HgJQs3BZVFI=", "sitename": "Clarkesworld Magazine", "title": "The Giving Heart by Corie Ralston", "author": "Corie Ralston", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ralston_06_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Giving Heart by Corie Ralston", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2430 words, short story\n The Giving Heart\n Coleman studied the dead heart in the store window, the aorta frozen mid-pump in clear acrylic.\n Julie put a hand over her mouth. “Is this for real?”\n “Sandra says it’s all the rage,” Coleman said. “It’s what everyone is doing at weddings these days.”\n “Sandra says this, Sandra says that.”\n Coleman glanced over. Could it be she didn’t want him to marry Sandra? He liked the thought.\n He pulled Julie inside. A man in a suit approached them at once, held out a hand with perfect, manicured nails.\n “Real is the new real,” Mr. Manicured said. “People used to give chocolate hearts, candy hearts, paper hearts. Why not get to the heart of the matter, so to speak? Give your actual heart.”\n “I don’t know,” Julie said. “It’s kind-of creepy.”\n “How does it work?” Coleman said.\n Julie wandered off to a display kiosk and pulled up a graphic demo of heart-replacement surgery.\n Coleman concentrated on Mr. Manicured, who was still speaking.\n “Our surgeons are the best in the country,” he said. “And with cutting edge surgical techniques, so to speak, there is practically no scarring.”\n A holo of a happy couple danced in the corner. Red slogans slid across the walls in laser light. Home is where the heart is, give her your heart. It all seemed very modern.\n Mr. Manicured took Coleman’s elbow and leaned in conspiratorially. “Personally,” he said, “I would take an artificial heart over a real one any day. Much more reliable.”\n He named a price.\n Coleman gasped.\n “Do you love her?” Manicured said.\n “Sure.” It would take all his savings, the money he was saving for his bookstore.\n “There is no cost too great for love,” Manicured murmured.\n Sandra said it was about time they get married. She sighed meaningfully whenever they passed the Give Your Heart store. He did want to make her happy.\n Coleman looked over at Julie, who stood with eyes narrowed at the kiosk. Julie, on the other hand, didn’t believe in marriage.\n “I’ll do it,” he said.\n “Do you, Coleman?” the minister said.\n Coleman blinked. “What?”\n Sandra’s shimmery veil made him dizzy. The heat wrapped his head like soggy towel. He could scarcely breathe.\n “Here.”\n Sandra’s nephew, at Colman’s side in his tiny tux, nudged a package into Colman’s hands.\n “Do you, Coleman, take Sandra as your wife?”\n He knew he was supposed to say something about his heart. Still my beating heart. My heart is breaking? No, that couldn’t be it. There were so many expressions about the heart, he thought in a sudden panic.\n Julie had said he shouldn’t get married. Julie was somewhere in the audience.\n After a pause that felt to Colman as if it might stretch to eternity, Sandra reached over and took the package from Colman’s hands. The minister began to speak again.\n Coleman felt a sudden thump from within his chest, as if his new artificial heart had done a somersault. The surgeon had assured him his new heart was in fine condition. Nothing could go wrong. So why had it thumped like that?\n He knew he was now supposed to do something with the ring, but at that point, he lost consciousness.\n No one would let him live down the fact that he had fainted; the reception was one long running joke about it. Coleman’s heart, in its acrylic cage, made the rounds of the room.\n Colman drank three martinis and wobbled off to a corner where Sandra’s brother Giles gobbled a piece of red heart-shaped cake.\n “The problem with weddings these days,” Giles said, since he was an expert on everything, “is that they are so staged and predictable.”\n “You mean fainting wasn’t exciting enough for you?”\n Giles laughed. “Okay. That was fun. But really, everything else. The dresses, the vows, the flowers, blah blah blah.”\n And Julie was there, all of a sudden. She looked at Giles. “They were all exotics,” she said. “Not blah blah.”\n Giles smiled and held out his hand. “One thing is for sure. I would never cut my heart out and give it to someone.”\n “Good,” Julie said, taking Giles’s hand. “I would never ask anyone to. Have you seen Coleman’s heart in the acrylic? It’s quite gross.”\n Giles smiled at Julie. Coleman didn’t like it. Julie smiled at Giles. Coleman didn’t like it one bit. The thought of all those expensive flowers weighed on Colman and sapped all the bravado he had recently acquired through the martinis. He kept thinking that he could have spent that money on a really nice collection of books.\n The thing in his chest thumped again, followed by a faint slithering sound.\n “Did you hear that?” Coleman said.\n “Hear what?” Julie said.\n Coleman took a breath. “Nothing,” he said. It was the stress of the day. The thought of all his savings now gone, and everyone staring at him all the time. He rubbed his temples and wondered if there was somewhere he could lie down.\n “You don’t look so good,” Giles said.\n “I feel great,” Colman said. “Best day of my life.”\n Giles shrugged.\n “Really. I’m so happy.” He thought maybe it was the alcohol that made his voice waver.\n Julie put a hand on Colman’s shoulder. “Of course you are, Colman. Congratulations.”\n I give you my life, my love, my heart. That’s what he had been supposed to say.\n “There! Did you see that?” Coleman said.\n He stood with his shirt unbuttoned, holding open the flaps so Sandra could see.\n The skin of his chest bulged out faintly, like a fast-growing blister, and then just as quickly smoothed out again.\n “See what? Coleman, you aren’t listening to me.”\n “I’m listening to you.” Maybe he was imagining it. Sandra didn’t see it, after all. “You said you can’t stand living in the city.”\n “It’s killing me,” she said. “The endless rain. This apartment is so crowded. All those stupid books.”\n She lay on the couch with her arm draped over her eyes.\n “We can’t afford a house here,” he said. “And what about my bookstore?”\n “What bookstore?” she said. “We could afford a house in the suburbs.”\n Maybe it was just the idea of something alive in there that gave him chills. The sensation of something crawling around in his chest.\n “I’m miserable here,” she said. “Don’t you care about that?”\n “Of course I care,” he said.\n “Don’t you love me?” she said.\n “Of course I love you.”\n He loved his little apartment; the proximity to bookstores and cafes, the ceaseless pattern of traffic alternately stopping and then pulsing forward like blood through veins. He loved the sound of the rain. And he would be so far from Julie.\n “When do you want to move?” he said.\n She finally lifted her arm, smiled. “I’ll call an agent right now.”\n The tip of the thing poked out his nose, made a small circular motion, and then began to lengthen, sliding smoothly out, long and thin and dexterous.\n Coleman wanted to scream but found he was completely frozen.\n “Coleman?” Sandra’s voice came from the kitchen. “Have you seen my keys?”\n The thin tentacle patted the dining room table, poked under a pile of newspapers. Coleman breathed shallowly through his mouth. He hoped he would faint. Or wake up. This couldn’t be happening.\n The tentacle rooted under the newspapers, came out holding the ring of keys like an elephant trick at a circus. It rattled the keys in front of Coleman’s face. He opened his hand, and the keys dropped into his palm. The tentacle slid smoothly back inside his nose.\n Sandra appeared in the doorway.\n “There they are!” She scooped the keys from Coleman’s outstretched hand. “Everything is so hard to find. We really need to unpack.”\n The garage door slammed. Coleman still stood with his hand outstretched, unable to move.\n “It does appear to be moving around.” The doctor withdrew the probe from the small hole he had made in Coleman’s belly-button. The local anesthetic didn’t completely cover the sensation of a cold metal slipping around inside him.\n “Is this normal?” Coleman asked.\n “Well, I’ve read about cases like this, although I haven’t seen it personally. When you remove your real heart it leaves room for a different kind of creature to grow.”\n “A creature?”\n “We can schedule you for surgery next week,” he said.\n Coleman tried to take deep breaths to calm himself. “Do you have any reading material on this phenomenon?”\n “Sure. I’ll send you home with some literature. You can think about how you want to proceed.”\n Sandra found him on the doorstep, duffel in hand.\n “Where are you going?” she said.\n “I hate this suburb,” he said. “All the houses look identical. It never rains here.”\n “Are you leaving me?”\n “I’m going to the hospital. And then I think I might go live in the city for a while.”\n “The hospital?”\n “I have a thing growing inside me where my heart used to be,” he said. “I’m going to have it surgically removed.”\n She gave him a blank look. He handed her the literature.\n “This is very strange,” she said finally.\n “I’ll see you later,” he said.\n “Wait a minute,” she said. “It says in here the creature can often be very helpful.”\n “It’s disgusting,” Coleman said.\n “And it says the insurance won’t cover it.”\n “Sandra, I need to leave now to make my appointment.”\n “Just come inside for a moment and let’s talk about it.”\n “What’s to talk about?” he said. His hand on the duffel was sweating. “There’s a fucking creature inside of me!”\n “Calm down, Coleman.” She glanced around to make sure no neighbors were out. “Really now.” She leaned in close. “Did you see the cost of the surgery? We can’t afford that.”\n “I don’t care what it costs.”\n “You’re being selfish. Are you going to take all our savings and spend it on yourself?”\n “Well—”\n “You aren’t even thinking about how this might affect me. Remember what we agreed on about making our decisions together?”\n He dropped the duffel. Sandra picked it up. “Come inside,” she said. “We’ll work this out.”\n The tentacle slid out of Coleman’s ear and opened the door for Sandra.\n “See?” she said. “It’s just trying to help.”\n The creature was indeed very helpful. Tentacles protruded from Coleman’s nose and mouth and pushed the vacuum cleaner around, did the dishes, found the remote. They picked up his old acrylic heart and put it on the mantel. They protruded out of his pants to unpack boxes, to pick up his piles of dusty old book and drop them in the recycle bin.\n One night Sandra asked Coleman to make love to her, and he watched with a mixture of arousal and horror as the tentacle protruded from the tip of his penis and caressed her, brought her to climax. She made noises he hadn’t heard it quite a while. When it was done, he was still aroused, but he didn’t want to touch her. And anyway, she was already asleep.\n The next morning he woke up to the smell of coffee and bacon. Sandra hung up the phone when he entered the kitchen, her eyes bright.\n “Giles broke up with Julie.” She shrugged. “About time. I never understood what he saw in her anyway.”\n She draped an arm over his shoulders, whispered in his ear. “But we’re so happy, aren’t we?”\n “Hmmm,” Coleman said. He opened the paper.\n A tentacle emerged from his ear and caressed her cheek. She giggled. He shuddered. Coleman tried not to think about the slithering sensation as he sipped his coffee.\n Coleman drank four martinis and then thought about making dinner for Sandra. When the tentacle emerged from his left nostril, weaving back and forth, trying to open the refrigerator door, he grasped it with both hands.\n He tugged. It resisted. He pulled and pulled and it stretched out long and thin. It hurt like nothing he had ever felt before as an amorphous sack squeezed out through his nose and plopped onto the kitchen table. It reformed into a translucent blob, pathetic and quivering. Coleman retched. He didn’t feel drunk anymore.\n He reached for the phone.\n Julie picked up on the third ring.\n “It’s me,” he said.\n “What’s wrong?” she said.\n “I’m an empty old man,” he said. “I’m going to die.”\n “You’re not old,” she said. “What are you talking about?”\n “I love you.”\n She was silent a moment. “Why don’t you come over?”\n He grabbed his acrylic heart from the mantel and hauled his caved-in body to the car. He managed it somehow, using his own hands and feet on the wheel and pedals, surprised that he still knew how, that he had the strength.\n He tried to imagine what would Sandra do when she got home and found the creature quivering on the kitchen table. Maybe she would let it go free. Maybe she would lay down her head and mourn its death. He decided he didn’t care.\n Julie met him outside her apartment, squinting through the rain at him.\n The rain dripped down his nose, under his collar.\n “Look at me,” Coleman said. “There’s nothing left but a hollow body. I don’t want to live anymore.”\n She put a hand on his arm. “What about your bookstore?” she said.\n “It’s an unrealistic dream,” he said.\n “Is that what Sandra told you?”\n He lowered his head.\n “I don’t think it is unrealistic,” she said.\n He felt the edges of his inside wound tighten just a little, start to pull together. Maybe it would fill in. Maybe the creature had not taken all of him. He stood up a little straighter.\n “You broke up with Giles,” he said.\n “He was a jerk.”\n “I could have told you that.”\n The rain pattered lightly on the leaves of the jasmine bush near the walk.\n “I’ve missed the rain,” he said.\n “I’ve missed the old Coleman,” she said. “That crazy guy who bought dusty old books and piled them all over his apartment.”\n “Did I really do that?” he said.\n He felt tears on his cheeks. He thought about saving and saving until he could afford the first few months rent on a store, about finding those books he had treasured so much as a child. Maybe Julie would want to help him with the bookstore. It suddenly didn’t seem so unrealistic anymore.\n She took the acrylic heart from under his arm. “I wish you could put it back in,” she said.\n He smiled at Julie, at the rain, at the city. “It will grow back,” he said. And he knew it was true.\n Corie Ralston has had an eventful year. She bought a house, got married just before Prop 8 passed, and sold a story to Clarkesworld! In the next few months she plans to relax by running a marathon. She generally works too much and daydreams too little, and she always wishes she had more time. She has been spotted in the pages of Strange Horizons, Lady Churchill's Rosebud Wristlet, and the She's Such a Geek anthology."}