{"fingerprint": "GPqbZIB7etFhhRlxxrioraaFUPY=", "sitename": "Clarkesworld Magazine", "title": "Worm Within by Cat Rambo", "author": "Cat Rambo", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/rambo_09_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Worm Within by Cat Rambo", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1720 words, short story\nWorm Within\nThe LED bug kicks feebly, trying to push itself away from the wall. Its wings are rounds of mica, and the hole in its carapace where someone has tacked it to the graying boards reveals cogs and gears, almost microscopic in their dimension. The light from its underside is the cobalt of distress.\nIt flutters there, sputtering out blue luminescence, caught between earth and air, between creature life and robot existence. Does it believe itself insect or mechanism? How can it be both at once?\nI glide past, skirting the edge of the light it casts, keeping my hood up, watching fog tendrils curl and dissipate. A large street, then a smaller one, then smaller yet, in a deserted quarter that few, if any, occupy. Alleys curling into alleys, cursive scrawls of crumbling bricks and high wooden fences. My head down, I practice walking methodically, mechanically until I find a tiny house in the center of the maze. Mine. Another LED bug is tacked beside the entrance, but this one is long dead, legs dangling.\nOnce inside, I linger in the foyer, taking off my cloak, the clothes that drape my form as though I were some eccentric, an insistent Clothist, or anxious to preserve my limbs from rust or tarnish. Nude, I revel in my flesh, dancing in the hallway to feel the body’s sway and bend. Curved shadows slide like knives over the crossworded tiles on the floor, perfect black and white squares. If there were a mirror I could see myself.\nBut after only a single pirouette, my inner tenant stirs. He plucks pizzicato at my spine, each painful twang reminding me of his presence, somewhere inside.\nHe says, They’ll find you soon enough TICK they’ll hunt you down. They’ll realize TICK what you are, a meat-puppet in a TICK robot world, all the shiny men and women and TICK in-betweens will cry out, knowing what you are. They’ll find TICK you. They’ll find you.\nI don’t know where he lives in my body. Surely what feels like him winding, wormlike, many-footed and long-antennaed through the hallways of my lungs, the chambers of my heart, the slick sluiceway of my intestines—surely the sensation is him using his telekinetic palps to engage my nervous system. I think he must be curled, encysted, an ovoid somewhere between my shoulder blades, a lump below my left rib, a third ovary glimmering deep in my belly.\nHe says, You could go out with TICK a bang, you could leap into TICK the heart of a furnace or dive TICK from a building’s precipice, before they put you TICK in a zoo with a sign on the wall TICK, “Last Homo Sapiens.” Last Fleshbag. Last Body.\nI do not reply. I gather my clothing back to myself and shrug my shoulders underneath the layers, hiding. He flows back and forth, like a scissoring centipede, driving himself along my veins.\nIn the kitchen, I stuff food in my mouth without thinking about it, wash it down with gulps of murky fluid from the decanter I fill each night from the river. The liquid glistens with oily putrefaction as it pours through my system.\nHe says, You disgust me. There are TICK hairs growing inside your body, there TICK are lumps of yellow fat, there are TICK snot and blood clots and bits of refuse TICK. Why won’t you die and set me free?\nIf only I could wash him away, I’d wallow by the riverside, mouth agape in the shallows, swallowing, swallowing bits of gravel and rusted bolts and the tinny taste of antique tadpoles.\nI can’t, but even so he doesn’t like the thought. He saws at the back of my skull with fingers like grimy glass, until the bare bulb shining above the kitchen table shatters, rains down in shards of migraine light, my vision splintering into headache.\nWhen I sleep, I lie down on a shelf beneath the window on the upper floor. I don’t know who used to live in this house—when I found it, the only closet was full of desiccated beetles and rows of blue jars. I fold the spectacles I wear—two circles of glass and brass that I found in a drawer. I set them on the windowsill with the drawing of a clock face I have made. I slide my eyelids closed.\nEven asleep, I can feel my parasite whispering to himself, thoughts clicking and ticking away. Turning the circuitry and gears of my brain for his own use.\nI dream that I am dreaming I’m not dreaming.\nThe morning sky unfolds in the window, mottled crimson and purple, like marbled bacon, speckled sausage. Brown clouds devour it to the sound of morning shuffling. I get up. I take the mass transit, I go to the store and buy replicas of food, the same pretense everyone else makes, mourning the regularities of a lost life. I stand on a street corner with a pack of robots, looking at a wall screen. A few are clothed, but most are bare, moisture beading on their chrome and brass forms. Some are sleek, some are retro. No one is like me.\nI walk in the park. Where did all these robots come from? What do they want? They look like the people that built them, and they walk along the sidewalk, scuffed and marred by their heavy footsteps. They pretend. That’s the only thing that saves me, the only thing that lets me walk among them pretending to be something that is pretending to be me.\nI sit on a bench by the plaza’s edge, a bend of concrete, splotched with lichen. Little sparrows hop along the back, nervous hops, turning their heads to look at me, one beady eye, then the other. I hold my hand out, palm upward. One hops closer.\nInside my ears, inside my lungs, vibrating inside my bones, I hear him whispering. He tells me where I could throw my body in front of a tram, where I could undermine a bridge, where I could leap in a shower of glass, where I could embrace a generator.\nThe sparrow lands popcorn-light on my palm. My fingers close over it. The other sparrows panic and fly away as my hand clenches tighter and tighter, latching my thumb over the cage my hand has become, feeling the crunch beneath the fluff.\nMy fingers spasm before my thumb swings away to let them open. Tiny gears fall and bounce on the concrete, and fans of broken plastic feathers flutter down. I stand and try to walk away, but he keeps talking and talking in my head.\nYou disgust me, he says, and then for once he is silent, as another presence intrudes, as something touches my arm. It is the creature that raised me, it is my mother robot, made of lengths of copper tubing and a tank swelling for a bosom. Carpet scraps are wrapped around its wrists and ankles. It says through the grillework, its beetle-like mouth hissing and crackling with static. You are not well, you must come home with me, won’t you come home with me? I worry about you.\nHow can robots worry? I shake my skull, I turn away so it won’t see the meat, the flesh, the body.\nYou don’t know what you’re doing, who you are, what you are, it says. The voice is flat, emotionless. It stops, then begins again. You are wrong, it says. Something inside of you is wrong.\nIt pulls at me again, but I brace myself and it cannot budge me. It walks away and does not look back. It will come tomorrow and say the same words.\nHe begins in my head again and I make it only a few steps before crouching down in the middle of the plaza, feeling the passing robots stare at me. I must master this, must master him before the Proctors come and discover me.\nI say to the insides of my wrists, the delicate organic bones of my wrists, clothed in blood and sinew, Listen to me, listen to me. Let me get home, home to safety and I’ll give you what you want, whatever you want.\nHe releases his grip on my sanity and we walk home quietly. I eat and drink and say What do you want?\nSleep, he says, and for once the voice is gentle. That’s all. Go to sleep. Things will be better in the morning.\nAt half past midnight, I open my eyes. On the floor are legs torn from an LED bug, dried shells, silver scraps. I watch and he lifts one, then another, drifts and clicks so quiet I cannot hear them. One, then another, and then both. As though he was practicing. As though he was getting better. Stronger.\nI didn’t know he could use his telekinesis outside my body. As the last shell falls, I feel him lapse, exhausted, into his own simulacrum of sleep.\nDownstairs there are no knives in the kitchen, but there is a piece of metal molding that I can peel away from the counter’s edge. Slipping and sliding across the floor and the fungus growing on the ancient bits of food scattered there, I go into the living room, an empty box like every other room here, but here the walls are red, red as blood. The blood I imagine, over and over, in my veins.\nI poise the knife before my belly and I say goodbye to my body, to the burps and the shit, to the unexpected moles and the cramps and the itches, and flakes of skin and hot sore pimples. To my good, hallucinatory-rich flesh. To my bones that have pretended to carry me for so long. To my delusive blood.\nHe wakes and says What are you doing? And No. Even as the length of metal slides into me, and I look down to see my foil skin sliding away, to reveal my secret’s secret to the world, to show my gears and cogs and shining steaming lunatic wires, and in the midst of it, the clockwork centipede uncoiling, he is my brain seeing itself uncoiling and recoiling and discoiling, my mechanical, irrational brain saying No and No and No again.\nCat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America."}