{"fingerprint": "TkjnCdcWyQEOG54GgKuYMG6wqxw=", "sitename": "Clarkesworld Magazine", "title": "The Mermaids Singing Each to Each by Cat Rambo", "author": "Cat Rambo", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/rambo_11_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Mermaids Singing Each to Each by Cat Rambo", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6200 words, short story\nThe Mermaids Singing Each to Each\nNiko leaned behind me in the cabin, raising his voice to be heard over the roar of engine and water, “When you Choose, which is it going to be? Boy or girl?”\nI would have answered, if I thought it really mattered to him. But we were off shore by then, headed for the Lump, and he was just making conversation, knowing how long it would take us to get there. He didn’t care whether I’d be male or female, I’d still be his pal Lolo. I could feel the boat listening, but she knew I didn’t want her talking, that I’d turn her off if she went too far.\nSo I kept steering the Mary Magdalena and said I didn’t know, and it didn’t matter, unless we did manage to cash in on the Lump before the corp-strippers got there. After that we were silent again, and everything was just the engine rumble moving up through my feet. Jorge Felipe turned over in the hammock we’d managed to fit into the cabin, hammering the nails into the paneling to hang the hooks. He let out something that was either snore or fart or maybe both.\nJorge Felipe was the one who had found out about the Lump. It was four or five kilometers across, the guy who’d spotted it said. Four or five kilometers of prime debris floating in the ocean, bits of old plastic and wood and Dios knew what else, collected by the currents, amassed in a single spot. All salvageable, worth five new cents a pound. Within a week, the corp-stripper boats would be out there, disassembling it and shoveling all that money into company machines, company mouths.\nBut we were going to get there first, carve off a chunk, enough to pay us all off. I wanted to be able to Choose, and I couldn’t do that until I could pay the medical bill. Niko said he wasn’t saving for anything, but really he was—there’d be enough money that he could relax for a month and not worry about feeding his mother, his extended family.\nJorge Felipe just wanted out of Santo Nuevo. Any way he could escape our village was fine with him, and the first step in that was affording a ticket. He wanted to be out before storm season hit, when we’d all be living on whatever we could manage until a new crop of tourists bloomed in the spring.\nWinter was lean times. Jorge Felipe, for all his placid snoring right now, feeling desperation’s bite. That’s why he was willing to cut me in, in exchange for use of the Mary Magdalena. Most of the time he didn’t have much to say to me. I gave him the creeps, I knew. He’d told Niko in order to have him tell me. But he didn’t have any other friends with boats capable of going out to carve off a chunk of the Lump and bring it in for salvage. And on my side of things, I thought he was petty and mean and dangerous. But he knew the Lump’s coordinates.\nI tilted my head, listened to the engines, checking the rhythms to make sure everything was smooth. The familiar stutter of the water pump from behind me was nothing to worry about, or the way the ballaster coughed when it first switched on. I knew all the Mary Magdalena’s sounds. She’s old, but she works, and between the hydroengines and the solar panels, she manages to get along.\nSometimes I used to imagine crashing her on a reef and swimming away, leaving her to be covered with birdshit and seaweed, her voice lasting, pleading, as long as the batteries held out. Sometimes I used to imagine taking one of the little cutting lasers, chopping away everything but her defenseless brainbox, deep in the planking below the cabin, then severing its inputs one by one, leaving her alone. Sometimes I imagined worse things.\nI inherited her from my uncle Fortunato. My uncle loved his boat like a woman, and she’d do things for him, stretch out the last bit of fuel, turn just a bit sharper, that she wouldn’t do for me or anyone else. Like an abandoned woman, pining for a lover who’d moved on. I could have the AI stripped down and retooled, re-imprint her, but I’d lose all her knowledge. Her ability to recognize me.\nI’d left the cabin the way my uncle had it: his baseball cap hanging on the peg beside the doorway, his pin-up photos shellacked onto the paneling. Sometimes I thought about painting over the photos. But they reminded me of my uncle, reminded me not to forgive him. You would have thought they would have been enough, but maybe they just egged him on. Some people claim that’s how it goes with porn, more and more until a man can’t control himself.\nI can’t say my experience has confirmed this.\nUncle Fortunato left me the Mary Magdalena from guilt, guilt about what he’d done, guilt that his niece had decided to go sexless, to put away all of that rather than live with being female. I was the first in the village to opt for the Choice, but not the first in the world by a long shot. It was fashionable by then, and a lot of celebrities were having it done to their children for “therapeutic reasons.” My grandmother, Mama Fig, said it was unnatural and against the Church’s law, and every priest in the islands came and talked to me. But they didn’t change my mind. There was a program funding it for survivors of sexual assault. That’s how I got it paid for, even though I wouldn’t tell them who did it.\nI couldn’t have him punished. If they’d put him away, my grandmother would have lost her only means of support. But I could take myself out of his grasp by making myself unfuckable. Neuter. Neuter until I wanted to claim a gender. They didn’t tell me, though, that getting in was free, but getting out would cost. Cost a lot.\nWhen I first heard he’d left the boat to me, I didn’t want her. I let her sit for two weeks gathering barnacles at dock before I went down.\nI wouldn’t have ever gone, but the winter was driving me crazy. No work to be found, nothing to do but sit home with my grandmother and listen to her worry about her old friend’s children and her favorite soap opera’s plotlines.\nWhen I did go to the Mary Magdalena, she didn’t speak until I came aboard. First I stood and looked at her. She’s not much, all told: boxy, thirty years out of date, a dumbboat once, tweaked into this century.\nI used to imagine pouring acid on her deck, seeing it eat away with a hiss and a sizzle.\nAs I made my way up the gangplank, I could feel that easy sway beneath my feet. There’s nothing like being on a boat, and I closed my eyes just to feel the vertigo underfoot like a familiar friend’s hand on my elbow.\nI used to imagine her torn apart by magnets, the bolts flying outward like being dismantled in a cartoon.\n“Laura,” a speaker said, as though I hadn’t been gone for six years, as though she’d seen me every day in between. “Laura, where is your uncle?”\nI used to imagine her disintegrated, torn apart into silent atoms.\n“It’s not Laura anymore,” I said. “It’s Lolo. I’m gender neutral.”\n“I don’t understand,” she said.\n“You’ve got a Net connection,” I said. “Search around on “gender neutral” and “biomod operation.”\nI wasn’t sure if the pause that came after that was for dramatic effect or whether she really was having trouble understanding the search parameters. Then she said, “Ah, I see. When did you do that?”\n“Six years ago.”\n“Where is your uncle?”\n“Dead,” I said flatly. I hoped that machine intelligences could hurt and so I twisted the knife as far as I could. “Stabbed in a bar fight.”\nHer voice always had the same flat affect, but I imagined/hoped I could hear sorrow and panic underneath. “Who owns me now?”\n“I do. Just as long as it takes me to sell you.”\n“You can’t, Laura.”\n“Lolo. And I can.”\n“The licenses to operate—the tourism, the sport-fishing, even the courier license—they won’t transfer to a new owner. They won’t pay much for a boat they can’t use.”\n“Oh, I don’t know,” I said. “You’d fetch a decent amount as scrap.”\nShe paused again. “Keep me going, Lolo, and you can take in enough to keep yourself and Mama Fig going. Your uncle had ferrying contracts, and every season is good for at least a couple of trips with very cheap or eccentric tourists.”\nShe had grace enough not to push beyond that. I didn’t have much choice, and it was the only way to support my grandmother and myself month to month. With the Mary Magdalena, I was better off than Niko or Jorge Felipe by far. I could afford the occasional new shirt or record, rather than something scavenged.\nAt the end of a year, we’d reached an agreement. Most of the time now the boat knew better than to talk to me. She could have been with me everywhere. Button mikes gleamed along the front railing, in the john, even in the little lifeboat that hugged the side. But she stayed silent except in the cabin, where she would tell me depths, weather, water temperature. I told her which way to go. Businesslike and impersonal.\nNiko went out on deck. I didn’t blame him. It was too warm in the cabin. I knew the Mary Magdalena would alert me if there was any trouble, but I liked to keep an eye on things.\nJorge Felipe stirred, stuck his head out over the hammock’s edge. His dark hair stuck out in all directions, like broken broom straws.\n“Morning yet?” he rasped.\n“Couple more hours.”\n“Where’s Niko?”\n“Went to smoke.”\nHe grunted. “Shit, it’s hot in here,” he said. He swung his legs out from under the blanket’s basketweave, thumped onto the floor. “We got soup left?”\n“Thermos in the cupboard.”\nBehind me the microwave beeped out protests as he thumbed its controls. The display was a steady, grainy green, showing me the surface far below the boat. Drifts and ridges. They said you could spot a wreck by the unnatural straightness of a line, the oddness of a corner. Unlikely, but it had been heard of, in that friend-of-a-cousin-of-a-neighbor’s sort of way.\n“Heat me one,” I said.\n“Soup or coffee?”\n“Coffee,” I said, and he clanked another mug into the microwave.\nNiko came into the doorway. “Mermaids out there,” he said. “Be careful if you swim.”\nJorge Felipe handed me my mug, so hot it almost bit into my skin as I cupped it.\n“Fucking mermaids,” he said. “I hate them even worse than sharks. One tangled with my sister, almost killed her.”\n“Everyone on the island’s tangled with your sister. I’m getting coffee and going back out,” Niko said, and did.\nJorge Felipe watched him go. “He’s fucking obsessed with those mermaids.”\nMermaids. Back before I was born, there were more tourists. There’s always tourists now, but not quite as many. Some of them came here specifically, even, for the beaches. Or for the cheap black-market bio-science. And one black-market bio-scientist specialized in making mermaids out of them.\nThey paid a lot for it, I guess. A moddie body that they could go swimming in, pretend like they were always sea creatures. It was very popular one year, Mama Fig said.\nBut the scientist, he wasn’t that good, or that thorough. Or maybe he didn’t understand all the implications of the DNA he was using. Some people said he did it deliberately.\nBecause mermaids lay eggs, hundreds at a time, at least that kind did. And the natural-born ones, they didn’t have human minds guiding them. They were like sharks—they ate, they killed, they ate. Most of the original human mermaids had gotten out when they found out that the seas were full of chemicals, or that instead of whale songs down there, they heard submarine sonar and boat signals. When the last few found out that they were spawning whether they liked it or not, they got out too. Supposedly one or two stayed, and now they live in the sea with their children, twice as mean as any of them.\nI said, “Watch the display for me” and went up on deck. The sun was rising, slivers of gold and pink and blue in the east. It played over the gouges in the Mary Magdalena’s railing where I’d picked at it with a knife, like smallpox marks along the boat’s face.\nNiko was watching the water. Light danced over it, intense and dazzling. Spray rode the wind, stinging the eyes. I licked salt from my drying lips.\n“Where are you seeing them?” I asked.\nHe pointed, but I didn’t see anything at first. It took several moments to spot a flick of fins, the intercepted shadow as a wave rose and fell.\n“You see them out this deep all the time,” I said. Niko hadn’t been out on the boat much. He got nauseous anywhere out past ten meters, but Jorge Felipe had enlisted him to coax me into cooperating, had supplied him with fancy anti-nausea patches. I looked sideways. One glistened like a chalky gill on the side of his neck.\n“Yeah?” he said, staring at the water. He wasn’t watching me, so I looked at his face, trying to commit the details to memory. Trying to imagine him as a photograph. His jaw was a smooth line, shadowed with stubble. The hairs in front of his ears tangled in curls, started to corkscrew, blunted by sleep. He had long eyelashes, longer than mine. The sun tilted further up and the dazzle of light grew brighter, till it made my eyes hurt.\n“Put on a hat,” I said to Niko. “Going to be hot and bad today.”\nHe nodded but stayed where he was. I started to say more, but shrugged and went back in. It was all the same to me. Still, when I saw his straw hat on the floor, I nudged it over to Jorge Felipe and said, “Take this out to Niko when you go.”\nLooking out over the railing, I spotted the three corp ships long before we got to the Lump. For a moment I wondered why they were so spread out, and then I realized the Lump’s size. It was huge — kilometers wide. The ships were gathered around it, and their buzz boats were resting, wings spread out to recharge the solar panels.\nThey must have seen us around the same time. A buzz boat folded its wings, shadows spider-webbed with silver, and approached us. As it neared, I saw the Novagen logo on its side, on its occupant’s mirrored helmet.\n“This is claimed salvage,” the logo-ed loudspeaker said.\nI cupped my hands to shout back, “Salvage’s not claimed till you’ve got tethers on it. Unless you’re pulling in the whole thing, we’ve got a right to chew on it, too.”\n“Claimed salvage,” the pilot repeated. He looked the Mary Magdalena up and down and curled his lip. Most of the time I liked her shitty, rundown look, but pride bristled briefly. “You want to be careful, kid. Accidents happen out here when freelancers get in the way.”\nI knew they did. Corp ships liked to sink the competition, and they had a dozen different underhanded ways to do it.\nJorge Felipe said at my elbow, “Gonna let them chase us off?”\n“No,” I said, but I nodded at the pilot and said, “Mary Magdalena, back us off.”\nWe moved round to the other side.\n“What are you going to do?” Niko asked.\n“We’re going to cut the engines and let the currents creating the Lump pull us into it,” I said. “They’re watching for engine activity. After it gets dark, they won’t notice us cutting. In the meantime, we’ll act like we’re fishing. Not even act, really.”\nWe broke out fishing gear. The mermaids had deserted us, and I hoped to find a decent school of something, bottom-feeders at least. But the murk around the Lump was lifeless. Plastic tendrils waved like uneasy weed, gobbling our hooks till the rods bent and bowed with each wave.\nI wanted the corp ships to see our lines. Every hour, a buzz boat would whoosh by, going between two of the larger ships.\nWhen the sun went down, I went below deck. The others followed. I studied the weather readout on the main console’s scratched metal flank.\nIt took longer than I thought, though. By the time we’d managed to cut our chunk free with the little lasers, draining the batteries, the sun was rising. Today was cloudier, and I blessed the fog. It’d make us harder to spot.\nWe worked like demons, throwing out hooks, cutting lumps free, tossing them into the cargo net. We looked for good stuff, electronics with precious metals that might be salvaged, good glass, bit of memorabilia that would sell on the Internet. Shellfish—we’d feed ourselves for a week out of this if nothing else. Two small yellow ducks bobbed in the wake of a bottle wire lacing. I picked them up, stuck them in my pocket.\n“What was that?” Jorge Felipe at my elbow.\n“What was what?” I was hauling in orange netting fringed with dead seaweed.\n“What did you stick in your pocket?” His eyes tightened with suspicion.\nI fished the ducks out of my pocket, held them out. “You want one?”\nHe paused, glancing at my pocket.\n“Do you want to stick your hand in?” I said. I cocked my hip towards him. He was pissing me off.\nHe flushed. “No. Just remember—we split it all. You remember that.”\n“I will.”\nThere’s an eagle, native to the islands, We call them brown-wings. Last year I’d seen Jorge Felipe dealing with docked tourists, holding one.\n“Want to buy a bird?” he asked, sitting in his canoe looking up at the tan and gold and money-colored boat. He held it up.\n“That’s an endangered species, son,” one tourist said. His face, sun-reddened, was getting redder.\nJorge looked at him, his eyes flat and expressionless. Then he reached out with the bird, pushed its head underwater for a moment, pulled it out squawking and thrashing.\nThe woman screeched. “Make him stop!”\n“Want to buy a bird?” Jorge Felipe repeated.\nThey couldn’t throw him money fast enough. He let the brown-wing go and it flew away. He bought us all drinks that night, even me, but I kept seeing that flat look in his eyes. It made me wonder what would have happened if they’d refused.\nBy the time the buzz boats noticed us, we were underway. They could see what we had in tow and I had the Mary Magdalena monitoring their radio chatter.\nBut what I hoped was exactly what happened. We were small fry. We had a chunk bigger than I’d dared think, but that wasn’t even a thousandth of what they were chewing down. They could afford to let a few scavengers bite.\nAll right, I thought, and told the Mary Magdalena to set a course for home. The worst was over.\nI didn’t realize how wrong I was.\nNiko squatted on his heels near the engines, watching the play of sunlight over the trash caught in the haul net. It darkened the water, but you could barely see it, see bits of plastic and bottles and sea wrack submerged underneath the surface like an unspoken thought.\nI went to my knees beside him. “What’s up?”\nHe stared at the water like he was waiting for it to tell him something.\n“It’s quiet,” he said.\nJorge Felipe was atop of the cabin, playing his plastic accordion. His heels, black with dirt, were hooked under the rungs of the ladder. I’d let the plastic fray there, and bits bristled and splayed like an old toothbrush. His music echoed out across the water for kilometers, the only sound other than splash or mermaid whistle.\n“Quiet,” I said, somewhere between statement and question.\n“Gives you time to think.”\n“Think about what?”\n“I was born not too far from here.” He stared at the twitch and pluck in the sun-splattered water.\n“Yeah?”\nHe turned to look at me. His eyes were chocolate and beer and cinnamon. “My mother said my dad was one of them.”\nI frowned. “One of what?”\n“A mermaid.”\nI had to laugh. “She was pulling your leg. Mermaids can’t fuck humans.”\n“Before he went into the water, idiot.”\n“Huh,” I said. “And when he came out?”\n“She said he never came out.”\n“So you think he’s still there? Man, all those rich folks, once they learned that the water stank and glared, they gave up that life. If he didn’t come out, he’s dead.”\nI was watching the trash close to us when I saw what had sparked this thought. The mermaids were back. They moved along the net’s edge. It shuddered as they tugged at it.\n“What are they doing?” I asked.\n“Picking at it,” Niko said. “I’ve been watching. They pick bits off. What for, I don’t know.”\n“We didn’t see them around the Lump. Why now?”\nNiko shrugged. “Maybe all that trash is too toxic for them. Maybe that’s why we didn’t see any fish near it either. Here it’s smaller. Tolerable.”\nJorge Felipe slid onto his heels on the deck.\n“We need to drive them off,” he said, frowning at our payload.\n“No,” Niko protested. “There’s just a few. They’re picking off the loose stuff that makes extra drag, anyhow. Might even speed us up.”\nJorge Felipe gave him a calculating look. The look he’d given the tourist. But all he said was, “All right. That changes, let me know.”\nHe walked away. We stood there, listening to the singing of the mermaids.\nI thought about reaching out to take Niko’s hand, but what would it have accomplished? And what if he pulled away? Eventually I went back in to check our course.\nBy evening, the mermaids were so thick in the water that I could see our own Lump shrinking, dissolving like a tablet in water.\nJorge Felipe came out with his gun.\n“No!” Niko said.\nJorge Felipe smiled. “If you don’t want me to shoot them, Niko, then they’re taking it off your share. You agree it’s mine, and I won’t touch a scale.”\n“All right.”\n“That’s not fair,” I objected. “He worked as hard as us pulling it in.”\nJorge Felipe aimed the gun at the water.\n“It’s okay,” Niko told me.\nI thought to myself that I’d split my share with him. I wouldn’t have enough for the Choice, but I’d be halfway. And Niko would owe me. That wouldn’t be a bad thing.\nI knew what Choice I’d make. Niko liked boys. I liked Niko. A simple equation. That’s what the Choice is supposed to let you do. Pick the sex you want, when you want it. Not have it forced on you when you’re not ready.\nThe Mary Magdalena sees everything that goes on within range of her deck cameras. It shouldn’t have surprised me when I went back into the cabin and she said, “You like Niko, don’t you?”\n“Shut up,” I said. I watched the display. The mermaids wavered on it like fleshy shadows.\n“I don’t trust Jorge Felipe.”\n“Neither do I. I still want you to shut up.”\n“Lolo,” she said. “Will you ever forgive me for what happened?”\nI reached over and switched her voice off.\nStill, it surprised me when Jorge Felipe made his move. I’d switched on auto-pilot, decided to nap in the hammock. I woke up to find him fumbling through my clothes.\n“What you pick up, huh? What did you find out in the water?” he hissed. His breath stank of old coffee and cigarettes and the tang of metal.\n“I didn’t find anything,” I said, pushing him away.\n“It’s true what they say, eh? No cock, no cunt.” His fingers rummaged.\nI tried to shout but his other hand was over my mouth.\n“We all want this money, eh?” he said. “But I need it. You can keep on being all freaky, mooning after Niko. And he can keep on his own loser path. Me, I’m getting out of here. But I figure you, you don’t want to be messed with. Your share, or I’m fucking you up worse than you are already.”\nIf I hadn’t turned off her voice, the Mary Magdalena would have warned me. But she hadn’t warned me before.\n“Are you going to be good?” Jorge Felipe asked. I nodded. He released my mouth.\n“No one’s going to sail with you, ever again.”\nHe laughed. “World’s a whoooooole lot bigger than this, freaky chicoca. Money’s going to buy me a ticket out.”\nI remembered the gun. How far would he go in securing his ticket? “All right,” I said. My mouth tasted like the tobacco stains on his fingers.\nHis lips were hot on my ear. “Okay then, chicoca. Stay nice and I’ll be nice.”\nI heard the door open and close as he left. Shaking, I untangled myself from the hammock and went to the steering console. I turned on the Mary Magdalena’s voice.\n“You can’t trust him,” she said.\nI laughed, panic’s edge in my voice. “No shit. Is there anyone I can trust?”\nIf she’d been a human, she might have said “me.”\nBeing a machine, she knew better. There was just silence.\nWhen I was little, I loved the Mary Magdalena and being aboard her. I imagined she was my mother, that when Mami had died, she’d chosen not to go to heaven, had put her soul in the boat to look after me.\nI loved my uncle too. He let me steer the boat, sitting on his lap, let me run around the deck checking lines and making sure the tack was clean, let me fish for sharks and rays. One time, coming home under the General Domingo Bridge, he pointed into the water.\nAt first it looked as though huge brown bubbles were coming up through the water. Then I realized it was rays, maybe a hundred, moving through the waves.\nGoing somewhere, I don’t know where.\nHe waited until I was thirteen. I don’t know why. I was as skinny and unformed that birthday as I had been the last day I was twelve. He took me out on the Mary Magdalena and waited until we were far out at sea.\nHe raped me. When he was done, he said if I reported it, he’d be put in jail. My grandmother would have no one to support her.\nI applied for Free Agency the next day. I went to the clinic and told them what had been done. That it had been a stranger, and that I wanted to become Ungendered. They tried to talk me out of it. They’re legally obliged to, but I was adamant. So they did it, and for a few years I lived on the streets. Until they came and told me my uncle was dead. The Mary Magdalena, who had remained silent, was mine.\nI could hear Jorge Felipe out on the deck, playing his accordion again. I wondered what Niko was doing. Watching the water.\n“I don’t know what to do,” I said to myself. But the boat thought responded.\n“You can’t trust him.”\n“Tell me something I don’t know,” I said.\nOn the display. the mermaids’ fuzzy shadows intersected the garbage’s dim line. I wondered what they wanted, what they did with the plastic and cloth they pulled from us. I couldn’t imagine that anyone kept anything, deep in the sea, beyond the water in their gills and the blood in their veins.\nWhen Jorge Felipe went in to make coffee, I squatted beside Niko. He was watching the mermaids still. I said, urgently, “Niko, Jorge Felipe may try something before we land. He wants your share and mine. He’d like the boat, too. He’s a greedy bastard.”\nNiko stared into the water. “Do you think my dad’s out there?”\n“Are you high?”\nHis pupils were big as flounders. There was a mug on the deck beside him. “Did Jorge Felipe bring that to you?”\n“Yeah,” he said. He reached for it, but I threw the rest overboard.\n“Get hold of yourself, Niko,” I said. “It could be life or death. We’ve got sixteen hours to go. He won’t try until we’re a few hours out. He’s lazy.”\nI couldn’t tell whether or not I’d gotten through. His cheeks were angry from the sun. I went inside and grabbed my uncle’s old baseball hat, and took it out to him. He was dangling an arm over the side. I grabbed him, pulled him back.\n“You’re going to get bit or dragged over,” I said. “Do you understand me?”\nJorge Felipe grinned out of the cabin. “Having a good time there, Niko? You wanna go visit dad, go splashy splashy?” He wiggled his fingers at Niko.\n“Don’t say that!” I said. “Don’t listen to him, Niko.”\nSomething flapped in the water behind us and we all turned. A huge mermaid, half out of the water, pulling itself onto the trash’s mass. I couldn’t tell what it was trying to do—grab something? Mate with it?\nThe gun went off. The mermaid fell back as Niko yelled like he’d been shot. I turned, seeing the gun leveling on Niko, unable to do anything as it barked. He jerked, falling backward into the cargo net’s morass.\nHis hands beat the water like dying birds. Something pulled him under, maybe the mermaids, maybe just the net’s drag.\nI tried to grab him, but Jorge Felipe’s hand was in my collar pulling me back with a painful blow to my throat. The hurt doubled me over, grabbing for breath through the bruise’s blaze.\n“Too bad about Niko,” Jorge Felipe said. “But I need you to keep piloting. Go inside and stay out of trouble.” He pushed me towards the cabin and I stumbled into it, out of the wind and the sound of the water.\nI stood, trying to catch my breath, my hands on the panels. I wondered if Niko had drowned quickly. I wondered if that was how Jorge Felipe intended to kill me. All around, the boat hummed and growled, mechanical sounds that had once felt as safe as being inside my mother’s womb.\nI waited for her to say something, anything. Was she waiting for me to ask her help? Or did she know there was nothing she could do?\nUnderneath the hum, I could hear the mermaids singing, a whine that echoed through the metal, crept into the Mary Magdalena’s habitual drone.\nWhen I said, “How much farther?” she didn’t pretend she didn’t understand the question.\n“Fifteen hours, twenty minutes.”\n“Any weapons on board I don’t know about?” I pictured my uncle having something, anything. A harpoon gun or a shark knife. Something wicked and deadly and masculine.\nBut she answered, “No.” The same flat voice she always used.\nI could have wept then, but that was girlish. I was beyond that. I was the master of the Mary Magdalena. I would kill Jorge Felipe somehow, and avenge my friend.\nHow, I didn’t know.\nOutside splashing, something caught in the netting. I pushed my way out the door as Jorge Felipe stared down into the water. I shoved my way past him, unsure for a moment whether or not he’d hinder me. Then his hands were beside me, helping me pull a gasping Niko onto the boat.\n“Welcome back, man,” he said as Niko doubled over on hands and knees, spewing water and bile across the decking.\nFor a moment I thought, of course, everything would be fine. He’d reconsidered killing us. We’d pull into port, sell the cargo, give him the money and go our separate ways.\nI saw him guessing at my thoughts. All he did was rest his hand on his gun and smile at me. He could see the fear come back, and it made him smile harder.\nBehind me, Niko gasped and sputtered. There was another sound beside the hiss and slap of the waves. Mary Magdalena, whispering, whispering. What was she saying to him? What was going on in his head, what had he seen in his time underwater? Had the mermaids come and stared in his face, their eyes as blank as winter, his father there, driven mad by solipsism and sea song, looking at his son with no thoughts in his head at all?\nI stood, Jorge Felipe looking at me. If I locked myself in the cabin, how long would it take him to break in? But he gestured me away as I stepped towards the door.\n“Not now,” he said, and the regret in his tone was, I thought, for the time he’d have to spend at the wheel, awake, more than anything else.\nShe was whispering, still whispering, to Niko. Why hadn’t she warned me? She must have known what was brewing like a storm beneath the horizon. I couldn’t have been the first.\nI started to turn to Jorge Felipe, Mary Magdalena’s voice buzzing under my nerves like a bad light bulb. Then weight shifting on the deck, Niko’s footprints squelching forward as he grabbed at Jorge Felipe, backpedaling until they fell together over the side in a boil of netting and mermaids.\nIn a fairytale, the mermaids would have brought Niko back to the surface while they held Jorge Felipe down below, gnawing at him with their sharp parrot beaks. In some stories, dolphins rescued drowning sailors, back when dolphins were still alive. And whales spoke to the fishing boats they swam beside, underneath clear-skied stars, in waters where no mermaids sang.\nBut instead no one surfaced. I turned the boat in great circles, spining the cargo net over and over again. Finally I told the Mary Magdalena to take us home. It had started to rain, the sullen sodden rain that means winter is at elbow’s length.\nI took the yellow ducks out of my pocket and put them on the console. What did Jorge Felipe think I’d found? I stared at the display and the slow shift and fuzz of the earth’s bones, far below the cold water.\n“What did you tell Niko?” I asked.\n“I told him that his father would be killed if he didn’t defend him from Jorge Felipe. And I activated my ultrasonics. They acted on his nervous system.”\nI shuddered. “That’s what I felt as well?”\n“There should be no lasting effects.”\n“Thanks,” I said. I stirred three sugar packets and powdered cream into my coffee. It was almost too hot to drink when it came out of the microwave, but I cupped it in my fingers, grateful for its heat.\nI could have slept. But every time I laid down in the hammock, I smelled Jorge Felipe, and thought I heard him climbing out of the water.\nFinally I went out and watched the water behind us. The Mary Magdalena played the radio for me, a soft salsa beat with no words I could understand. It began to rain, and I heard the sound of raindrops on the decking beside me, pattering on the plastic sheeting I drew over my head.\nBy the time I arrived back in port, the mermaids had plucked away all but a few tangles of seawrack from the netting. I’d be lucky to net the cost of a cup of coffee, let alone cover the fuel I’d used. Never mind. A few more seasons and I’d have the money I needed, if I was careful. If there were no disasters.\nNeither body was there in the net. Perhaps Niko’s father had reclaimed him.\nThe wind and rain almost knocked me off the deck as I stared into the water. The green netting writhed like barely visible guilt in the darkness.\nThe Mary Magdalena called after me, as she had not dared in years. “Sleep well, Lolo. My regards to Grandma Fig.”\nI stopped and half turned. I could barely see her lines through the driving rain.\nSometimes I used to imagine setting her on fire. Sometimes I used to imagine taking her out to a rift and drilling holes in the hull. Sometimes I used to imagine her smashed by waves, or an earthquake, or a great red bull stamping through the streets.\nBut the winter was long, and it would be lonely sitting at home with my grandmother. Lonelier than time at sea with her, haunted by the mermaids’ music.\n“Good night, Mary Magdalena,” I said.\nCat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America."}