{"fingerprint": "efIhSwZLHDAnAgwGQ4vKFvAAkBo=", "sitename": "Clarkesworld Magazine", "title": "Left Behind by Cat Rambo", "author": "Cat Rambo", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/rambo_05_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Left Behind by Cat Rambo", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6150 words, short story\nLeft Behind\nHer office doorway was one of the many things that annoyed Shi about her job. It wasn’t a proper door, one that could be closed, but an open arch. She’d complained about it more than once, but been told that doors were antithetical to the institute’s brand.\n“It signifies openness,” the director had said, smiling effulgently. It was a thin neuter with glossy hair and eyebrows that curled in elaborate patterns. Floral tattoos colored its pale brown skin, colored purple and blue that pulsed with the director’s heartbeat. An expensive body-mod, one that signaled the director’s financial status, in a way that Shi’s Business professors would have approved of.\nIt didn’t really matter how you presented, as long as it was costly enough to signal your status, they had said. You figured out a percentage of your budget—were you maintaining or actually trying to get ahead? And of course there were other investments you could—should—make, but none of that mattered if it was a dead end job, being phased out, with no lateral shifts available, only downward, if you didn’t have the initial dollars to invest. Time advances; adapt or be left behind.\nShi had put together a solid wardrobe a few years back but things were starting to fray. She caught the director eying her sleeve and folded her arms to hide the shirt’s cuff.\n“I have a new case for you,” the director said, tone as pleasant as a pastel.\nRelief made Shi realize she’d been holding herself stiffly upright in the director’s presence. That means I’ve made quota with still another week to go this month. Every month her clientele dwindled further, though. How will I manage when the inevitable moment comes and I fail to meet requirements three months in a row? She took a breath, and triggered calming agents in her bloodstream. They’d give me six months severance. All I have to do is figure out how to best use it.\nThe director was saying something about the client’s children. “They seem conflicted. They’ve agreed to it, but only if you can help their mother be more than a dumbship. Remember our work enables an entire industry.” They dropped a pad on her desk.\nThe director had transferable skills. And they were management. So they’d be among the last to go.\nShe smiled at them and nodded. “I’ll see what I can do.”\nShi was currently female. She had chosen to present as an eleven-year-old girl, a slim, short shape that she had found disarmed most older people. Although there was a small percentage who found it off-putting. “Creepy,” one had called it, trying to explain the aversion. “An adult mind in a kid’s body? You just know too much.”\nShe’d handed him off to another client. Most people were genderfluid, able to inhabit any sort of body, but changing was expensive. Not just the procedure, but maintenance, clothes, sometimes furniture and other necessities of life. More than just changing the uncomplicated pronoun to be used in day-to-day affairs or the much more complicated set to be used in intimate occasions, signaling sexual availability and preferences.\nThat was risky, establishing personal relationships manually. Easier to figure out what you wanted—which you knew intimately after first establishing a profile scan and diagnostic discussion, and which might actually be the opposite of what you thought you wanted. Imagine being someone who didn’t understand all of that internal stuff and just blundered along on gut feeling! The computers used DNA and personality tests and your social media presence and a barrage of other factors in order to figure things out, and while you could game the system by picking the right keywords, certainly, why would you ever want to do that and risk setting yourself up with a relationship that was doomed before it even started?\nIt might be different if you didn’t have choices. But that battle had been fought decades ago. You had a right to your own body, to make it take whatever shape you wanted (and could afford). At the highest and lowest levels, they went “natural” although at the high end of that it was a nature that was augmented with as much beneficial science as could possibly be crammed in a body without making it obvious.\nWhen the trio appeared in her door, she had the file open. Cianna Jones, age 98. The two adult children, Rick and Ruth, flanked their parent, who presented as an older woman. They had chosen to present genders themselves, one male, one female, though Shi wasn’t sure whether it was by preference or to keep their parent more comfortable. Each held their mother by the arm, steering her.\nCianna herself seemed adrift, a fluff of feathery white hair and vague blue eyes. She had undergone some minor cosmetics, but for the most part she seemed unaltered, which often happened with older citizens, ones who might even remember the early part of the century and the old ways there, that primitive time that seemed so obsessed with sex.\nIntroductions were made by the children, while the mother smiled vaguely at Shi from the seat they had pushed and tugged her into.\nShi didn’t address the group overall, though—just her client. There were important formalities to be observed.\n“You understand why you are here?” she asked.\n“I can have my mind wiped or else you can build me a palace,” the woman murmured. Her voice carried a slight natural drawl, somewhere between southern and Midwestern, probably uncorrected natural rather than a mod. She smiled sleepily at Shi, and Shi wondered briefly if she were drunk or stoned.\n“After a fashion, yes,” Shi said. “That’s one way people refer to them in the literature, mind palaces. It’s the virtual reality best suited to you. You can fill them with all sorts of things. All of your past, and the places you never got to but always wanted to.”\nShe projected a smile at the client, a barrage of white teeth intended to elicit confidence. But the smile that was returned was much harder to read. Did Ms. Jones actually understand what was happening? Shi eyed Rick and Ruth, sitting on the edges of their seats and occasionally shooting dagger-eyed glares at each other, before she continued.\n“Your children don’t want you to be a simple shipmind. That’s where I come in. I teach you how to keep part of yourself separate. To that part, the conscious part, it’ll feel like a life in virtual reality.” She didn’t add that the life depended on the quality of Cianna’s mind, how well she could summon up details. Constructing a mind palace was a collaborative effort whose ineffectual results were another thing she hated about her job.\nBut, oh, the good ones, the well-realized ones . . . those were her only chance to experience the sort of thing you usually had to pay an arm and a leg—sometimes literally—for.\nCianna stared off into space. Shi looked again at the children.\n“Your parent does understand what we are doing?”\n“She’s measured .9 on the Sati meter,” Ruth said. “She has been declared incapable of autonomy and this seemed best for her.” She smirked at Rick.\nShi looked at him, his hands clasped anger-tight in front of tensed torso. “You’re not comfortable with this decision?”\n“It’s the only choice,” he said stiffly. Shi sensed an echo in those words, that it was something that had been said to him over and over—probably by his sibling—until he was convinced by it. “But I don’t want her to go if she can’t . . . if she doesn’t understand what’s going on.”\n“She doesn’t, part of the time,” Ruth said. “She has episodes. She harmed someone during one. Not for the first time.”\nCianna stirred but Rick replied. “Don’t exaggerate. You’re making a lot out of a couple of shoves.”\n“Human beings,” Ruth said primly, “don’t resort to physical violence to get what they want. That sort of thing may have been in style when she was growing up, but it’s outmoded now. So let her go off, into a place where she can’t hurt anyone.” The look she gave her mother said that “hurt” encompassed a great many things. “The money’s great. I’d volunteer for it myself if I could.”\nThe automatic spiel spooled out of Shi’s mouth. “Younger brains like yours and mine—the ones that have lived all their lives with shunts—can’t adapt to the technology. You and I can inhabit the mind palaces, but our autonomic systems don’t interface with the system the way theirs do. We need them to drive the ships. To become them. That’s why the price the institute pays is so high.” She looked at Cianna again, trying to connect. “You’re a precious commodity.”\nThe mother sat silent, smiling vaguely, but something about the glitter of her eyes made Shi uneasy. Something off about the situation, something out of kilter in a way that she couldn’t exactly define but definitely didn’t like.\n“You can try,” Rick said grudgingly. “Then we’ll talk.”\nIn the chamber, the waiting couch smelled damply of antiseptic, freshly swabbed and ready, the plastic a soothing pinkish-gray that always made Shi think of uterine flesh. Muraled walls, confluences of pink and gray spirals, gauzily drawn in tiny tiles against a beige background, boxed in the chamber. The light calculated to the last lumen to provide just enough illumination to soothe, watery sunlight sifted through new leaves.\nBuckles clicked into place as she strapped the older woman into the plastic couch, explaining as she went. They were quieter and more docile if they understood what was happening.\n“We’re taking a brain scan,” she said. “In building the palace, we’ll use many of your memories, but we’ll also correlate them with the physical record, all the existing photos and videos, and use those to make details perfect. Think of all the wonderful places that are gone and that you would like to return to. They’ll all be back, there in your head, and you’ll be able to spend as much time as you like in them.”\nThe older woman made no response other than an acquiescent murmur. Was it odd for her to have an apparent child explaining the situation? Shi wished she had picked some different way to present for today. Once you had presented to a client, you were supposed to stay in that form, in order to give them a sense of security and continuity.\nNot to mention Shi couldn’t afford it right now.\n“It will feel as though you’re going to sleep,” she said. “You will be, in a sense. Would you like me to explain the science behind it?”\nCianna ignored her, stared off into space with an intensity that gave Shi pause. What was going on in the woman’s head? She watched the face slacken as the machine took hold and Cianna’s grip on consciousness was gently pried away, finger by finger, until she floated in the void, awaiting Shi.\nIt was always enjoyable, stepping into someone’s inner landscape for the first time, but she could tell from the first second that this one would be extraordinary. It took a high level of sensitivity and imagination to create a mindworld like this one, surgical sharp and vivid, down to the smell of the tiny coral-colored tea roses around her feet, the feel of a sea breeze tickling her cheek as it came from a sweep of vast blue that footed a long green slope broken with a tiny red brick building, and an enormous tree (her infochip murmured madrona, identifying it) in the center.\nThis would be Cianna’s core landscape. They differed from person to person, and usually you didn’t know what yours was. Shi did. Hers was an enormous skyscraper, resembling the one she’d grown up in, but with plenty of undiscovered halls leading in odd directions, and staircases of a kind that hadn’t existed in the actual building, long crawls of cement stairs that led downward, never upward, towards some menace that lurked at the foot of things. She had learned by now to break those dreams, to turn around and say determinedly not real not real loud enough to shatter the world around her but she had never done what her training suggested she should do: dig farther into the meaning and extract it, learn something about herself that she should—in theory—know.\nIf you understood your internal workings, you were more in control of your life, able to compensate for your foibles, but Shi thought that she wanted to leave herself some level of unexplainable mystery, of moments where she wondered at the motivations of her unconscious, where it was unknown why she had lost her keys or had a particular piece of music playing in her head.\nWhy she wasn’t preparing herself for the death of her profession. Cianna had to be one of the last. The competition was fierce. She’d been lucky to get it, the director had implied. The fact that they had felt the need to tell her that was alarming, had implications. Social networks were more important than luck in government work. You had to have influence to get a high-end job, one that came with good accommodations, even some luxuries.\nShe walked down over springy, damp grass, covered with dewdrops that threw up scintillations of light, spangles of color that danced in the air around them. Shi had rarely witnessed such intensity of mind. She certainly couldn’t think of any cases that had been stronger.\nCianna was there underneath the tree, but she didn’t greet Shi as she appeared, turned her face away. She was humming, a tune that Shi didn’t recognize, something slow and almost familiar.\n“Won’t you walk with me and tell me about things?” Shi said, but the other woman didn’t acknowledge her. Sometimes they weren’t capable of it, but Shi thought that she was perceived, simply that Cianna chose not to speak to her.\nAnd that was interesting in itself, because that spoke of an internal determination—perhaps even anger—that belied the vague smiles. Was it possible that Cianna didn’t want to retire to her memory palace? It would be—surely—a better existence than this one, with the two bickering children posing as adults.\nBut people resist change, inevitably, particularly the personalities that have throve in older times. A fading mindset. At some point all of the minds like this would be dead and they would have to turn to some other way to do it. Maybe Shi would be suited for that, but probably not. Nowadays the computers steered you into a particular career and while it might not be the one that you would have chosen for yourself, it would always turn out to be the one that you ended up sticking with, for one reason or another.\nShe set out. This initial session, she’d be sampling Cianna’s memories, building up an idea of what the ultimate structure would look like, how much it would hold. This brain would live for centuries, but it would always be confined by the limits of Shi’s creation. Part of her job was to gauge how narrow its confines could be, and with brutal efficiency, build not a step more.\nSometimes that resulted in very small spaces indeed, depending on the type of mind. That one a few months ago had chosen a world the size of a couch, an endless coupling with a variety of partners and an algorithm designed to ensure that fresh choices would always be available. That seemed like a very circumscribed existence, and yet they had been happy enough with it. An eternity of good sex didn’t sound all that bad, but you could achieve something very similar right now if you were willing to jack in.\nCyberlife was almost always more interesting than real life; it was designed to be, in a way that real life just wasn’t. So much advertising science had gone into its design that it was deeply compelling and every year you heard horror stories about people plugging in and never being heard from again—there was a brand of assisted suicide that specialized in it, in fact—either go into the virtual reality and live there until your body starved or actually seek out your death inside it while a watching attendant threw the kill-switch at the right time.\nSome wealthy people lived that way by choice, though. Enabled by vivid minds, the minds of artists. Cianna was that sort of mind, but she was also compatible with one of the great transport ships that carried colonists outward, able to serve as its heart, its lungs, its guts, as well as the mind that drove it forward. Shi’s job was only to prepare and reconcile her. It didn’t matter what artistry might be lost in the process.\nTo the left, white two-story buildings, old ones, surrounding a quadrangle of more deep green grass, five deer grazing there. She marveled at the depth as she moved closer to them, at the fuzzy ears on the half-grown fawn, the way they twitched. She studied a deer as it scratched its neck with a hind-hoof, twisting around to do so. This sort of detail meant this was a childhood landscape, something seen for the first time, observed with the grave intensity of a curious child.\nShe went up a set of concrete steps, their edges eroded by time and weather’s subtle grip, to the first house. She could see nothing through the windows, which were silvered by the sunlight coming from behind her. The wooden door swung inward, admitting her, when she knocked, and she stepped into a white-walled hallway, a woolen rug underneath her feet to soften the pine planking. At the end of the hall, a glimpse of kitchen, but to her right an archway into a parlor decorated with pine furniture and small candles along the red-brick fireplace.\nA girl and boy playing there. One would be Cianna. The other would probably be a sibling; she made a mental note to research them, taking a quick shot of the narrow, long-nosed face and the wealth of coal black curls, the thin quick smile and dark penstrokes of eyebrows. A beautiful boy, made even more beautiful by the particularly of the rendering. Cianna had an extraordinary mind, and surely that must make the memory palace even more appealing to her? The sort of world she could construct for this client would be the best that she’d ever done, she thought. A masterwork, of the sort that got commissioned by the wealthiest of clients.\nBut they didn’t have minds like Cianna.\nShe watched the children playing for a while before she moved along.\nShe drifted from house to house. Each held pieces of Cianna’s life: a childhood in Shelbyville, Indiana, then a move to the east coast and Baltimore as a teen, then college at William & Mary. Ambitions for a job, thwarted or at least stifled by marriage to a high school sweetheart.\nNot the boy with the black curls, but he remained in every scene, some childhood friend that Cianna had managed to retain, unlike most. A constant, even up to the present day, she realized, catching a passage that smelled of yesterday, where the two stood talking. In this memory, Cianna was animated, lively, almost a voluble chatterbox. Shi expected a conversation about the memory palace process, but they didn’t say a word about it, caught up in an argument that she didn’t entirely understand, about a movie with an unexpected ending and whether or not it was possible to see it coming.\n“It’s a matter of red herrings,” Cianna insisted, but the man, whose name she never spoke, laughed at her, saying it was more subtle.\nIt sounded a little like a meta-conversation, the sort of dream construction that can usually be peeled away into layers of meaning and signifiers, but though she listened for a few more minutes, she didn’t know how to read it. Perhaps she’d come back to this moment.\nAfter what felt like weeks, the hour timer on the machine dinged, and Shi pulled back, reluctantly, into the confines of her own head. She stretched and released Cianna from the machine, helping her stand up. The old woman’s hand was warm and leathery, but she only touched Shi as long as she needed to in order to keep her balance, then let go with a hastiness that Shi thought bordered on distaste.\nShe said to Cianna, “You could challenge the competency hearing.” Better to say it now, when there were no live recording devices and, if questioned, she could say that Cianna must have misunderstood her and heard what she wanted to hear.\nBut the old woman only blinked at her. Shi saw suspicion in the stare, and distrust. She said, “You have a remarkable mind. Surely it must . . . ”\n“The judge,” the old woman said, speaking clearly and not at all as though she had been silent till this point, “is a friend of Ruth’s.”\nThe implication was clear.\n“Another judge . . . ?” Shi said.\n“They’ll only find another place to put me,” the old woman said. She drooped as though suddenly tired, as though she had been walking along with Shi in the physical world. “I don’t know what I did to make them hate me so,” she whispered to herself. “I only tried to help them be all that they could be, and when they failed at that, they said it was all my fault.”\nShi kept silent. She had looked at the records. She didn’t like to be a bigot, but people who tended to keep a single gender often seemed to have other issues. Maybe she was misremembering or distorting that in her head, but it seemed true enough when she matched it against every client she had dealt with.\nShe was paid to analyze people, to understand why they did what they did, because it helped her construct alternate lives for them. Once this technology had been designed for nursing homes. Then the real breakthrough had come, and humanity realized how useful they were, these minds that were a diminishing quantity. Only a few more decades of them, perhaps, before that supply was exhausted by the depletions of time.\nBut she was not a family counselor, not trained to fix broken relationships. In fact, she’d been encouraged to help make things worse if she could, in order to encourage the older person to abandon their children and their own lives, in order to take on the existence that she offered them.\nShe crossed to the poster in her office. A spaceship, a vast colony ship ready to take its slumbering, frozen cargo out into the universe, a ship driven by one of these minds, the consciousness wandering its memory palace, living out a thousand lifetimes, while the unconscious systems, the autonomic ones, drove the important parts of the ship, just as they had once driven blood and breathing and balance, all automatic and unthought of.\nYears of life . . . centuries, really. A body that was virtual, that never tired, that could instantly fly or change or whatever without tiresome surgeries or modifications. Who could resist something like that?\nNo, the old woman would like it. And Shi would make sure that she had a memory palace that would keep her happy. She wouldn’t cut any corners with this one.\nShe sat down and began to mesh the memory notes with the other files, data pulled from all over, pictures, sound clips, video files, feelies.\nShe didn’t notice the lack for a little while, but the data felt incomplete somehow. Then she realized. No sign of the black-haired boy, even in later years.\nHad he died recently perhaps? But there was yesterday’s conversation. Odd.\nShe called the son. He answered without picture. “Yes?”\n“I’m trying to track down the name of one of your mother’s friends. Lifelong. A man her age, his hair once black, mostly silver now, dark hair, a little goatee?”\n“She doesn’t know anyone like that,” he said with flat finality.\n“But they spoke together yesterday afternoon, for some time.”\n“Yesterday she was at my house because my sister dumped her there. She spent the afternoon staring out the window, sipping chamomile tea, and eating crackers.”\nShi was silent for a second, trying to understand. Finally she simply said, “I must have misunderstood. I’m sorry to have wasted your time.”\nShe punched the call off and stared at the phone’s numbers. The man was too vivid to be a delusion, surely. Was the old woman truly mad? But if there was some chemical or neurological imbalance, they would have discovered that already in the medical exams.\nBut she couldn’t move forward until she knew what was happening. A mad shipbrain was prone to too much chaos, too much risk. Maybe Cianna’s brain was unsuitable. She couldn’t imagine either of the children being happy about it.\nShe couldn’t move forward on this before she cleared it up.\nCianna’s children did not agree. In private conference, Ruth came so far as to skirt the edges of bribery, mentioning considerations, perks, things that might come her way if only she could see her way clear to . . . then trailed off, leaving everything else unsaid.\n“Both of you must sign off, legally,” Shi said. “Let me see what I can construct, and if she’ll adapt to it.”\nAfter Ruth left, she pored through the files. She resorted to the government search, the one she, strictly speaking, was not supposed to have access to. Where was he? Who was he?\nAt night, staring up at the translucent ceiling tiles that showed murky moonlit clouds, she tried to fit her head around anything other than insanity. Conspiracies. Magic. Ghosts. Lost souls. Time travel. Alternate dimensions.\nBecause something about Cianna was so eminently sane, at the heart of it. Her mental landscape was so clear. Being in it was like being in a hyper-real version of the world. So alive.\nHow could insanity produce something like that?\nRequisitioning the brain exploration a second time was not unheard of but required special forms, part of her discretionary budget. Not something to be indulged in lightly and as a matter of fact, something that she’d always taken pride in not doing.\nOnly Ruth came this time. She said to Shi, “Is this really necessary? Why can’t you just sign the forms?” Her fingers twitched their way around each other; Shi saw with a twinge of pity that she’d already gnawed through what looked like freshly grown nails, blue and purple stripes echoing her wrist-insets.\nLiterally eating at herself. What will happen when Cianna is out of the mix?\nShe touched mental triggers, making sure her face showed no sign of her emotions and said, selecting gentle reassurance, “Perhaps you’d like to wait in the relaxation room we have upstairs. There’s a sunlight machine and several sound sculptures. Very pretty.”\nThe hands writhing, worrying at a loose cuticle. Then heels trit-trotting away without another word.\n“She doesn’t know how to be kind to herself,” Cianna said.\nThe words startled Shi. Cianna had been so silent that she’d fallen into a beginner’s trap, thinking her furniture rather than participant.\n“Who is the man, the dark-haired man?” she said.\nCianna’s lips slackened, went quiet with an almost malicious twist.\n“Ask him.”\nAgain the green quadrangle, the madrona at one end, the slope bordered by cliffs overlooking the ocean. This hadn’t appeared anywhere in Cianna’s childhood. But it seemed so real, surely it must be based in some place that was just as actual? She fumbled through neurons for the name. Port Townsend.\nThis time she chose the little chapel down at one end. She couldn’t remember if it had been there last time. Surely it must have been.\nThe world pressed in on her with maddening, dazzling intensity like noon sunlight at summer’s peak. When she slipped inside the white-painted doorway, she breathed a sigh of relief.\nInside, another sycamore tree. No Cianna, only the boy, the same body-age as Shi, perhaps a little older, sprawled on the green grass in shorts and blue striped shirt, his eyes closed as though he were dozing.\nSomewhere someone was mowing grass. The sharp scent bit her inner nose as she moved forward towards the boy, the blades springy under her slippers.\nHe didn’t move. She stepped beside him and knelt down, meaning to touch his shoulder.\nBut before she could do so, his eyes snapped open, dark and glaring at her.\n“What are you doing?”\nShe stumbled back, off balance, and fell on her ass in the green, that smell almost as overpowering as the external sunshine had been. As she thought external sunshine, the sunshine here intensified to match it. Her eyes watered. The boy, a little blurry, sat up.\n“What is your name?” she said.\n“Call me Hypothetical,” he said, and laughed. “Maybe Hi for short.”\n“You’re not real,” she said. That was the only possible explanation, but he seemed so animated. So three-dimensional.\n“I’m imaginary,” he admitted. “Cianna thought it would confuse and delay things.”\n“It did,” Shi admitted. “It certainly did.” She felt some tension drop away. It was not unusual for a candidate to resist the technology, and this was one of the cleverer attempts she had ever encountered. It must have taken a tremendous feat of imagination to strew this figure through the old woman’s thoughts to the point where Shi had thought him real.\nShe settled herself into the grass, enjoying the warmth of the sunlight, letting her eyelids droop. How often in her life would she get to experience something on this level? A realer than real version of a vanished age of sunlight and personal space and uncontrolled green things.\nWhat would someone pay for this kind of experience? Artists at this level commanded more than she’d make in a lifetime for a single performance. But her Sati rating meant she was incapable of making choices, except for that tiny part of her psyche that had been able to construct Hi.\nAnd Cianna’s daughter wanted her gone, wanted her off-planet.\nBetter just to enjoy this while it lasted. “She gave it a good try,” she said languidly. “But now we’re over.”\n“Indeed,” he said. “You are, at any rate.”\nHis hands closed around her throat.\nThere were net legends about this sort of thing, even a few movies. But the truth was, if you died in someone else’s mind, you simply emerged back in real life, shuddering and gasping, to see Cianna looking at you with disappointment, eyes glittering in the dim light.\n“It doesn’t matter,” Shi said. “You said it yourself. They’ll find somewhere to put you. Let me build you a wonderful palace to live in.”\n“Rick won’t let you do it.”\n“Not there, no. But nursing facilities are expensive. And it’s similar technology, being plugged in when no one is visiting you. The ship’s computer has thousands of times the processing power, though. You have to know what a gift you have. What it could be.”\nCianna’s face twisted, showing real emotion for the first time. “There has to be a way. A way that lets me stay real.”\nHer voice was loud and shrill and hurt Shi’s ears. This was naked emotion, unfiltered, unmuted, shocking in its exposure. In the 20th century people had hidden their flesh from exposure; in the 21st it was their minds. That was why appearance didn’t matter.\nNo one wore their heart on their arm anymore—was that how the old-fashioned expression had gone?\nShi’s overrides were going up, otherwise her heart would have been racing. This was unpleasant, so unpleasant.\n“You want to shoot me into space,” Cianna shouted. Shi could hear the rumbling of security coming, drawn by the noise. “Out into space, all alone, nothing but zombies for company!”\n“There are algorithms for randomness,” Shi said. “The people will feel real to you. As real as your creation, at least.” Her neck remembered his fingers, even though it had never felt that touch.\nSecurity bots in the room, columns and tentacles that paused at the sight of Cianna bound in the memory chair, screaming, swiveling to regard Shi.\n“It’s all right,” she told them.\n“It’s not!” Cianna screamed, and went on, high-pitched shrills of inarticulate rage until Shi pressed a console button and slid her into sedated silence.\n“Your mother is more than capable of being plugged into the ship and staying herself,” she told Rick. “She’ll be happier.”\nShi had called him before talking to Ruth. She knew what Ruth would say already.\n“The law trusts you and your sibling to make the right choice for her, or you wouldn’t have been given the decision to make.”\nHis head tilted from side to side, an uneasy, snakelike motion.\n“She has to agree,” he finally said.\nA third excursion was unheard of. But within reach, if she was willing to expend every iota of social capital, every scrap of influence asking fellow employees to like her project on the internal boards, swapping away vacation days and perks, even part of her vacation pay. Depleted her.\nCost-benefit analysis allowed her to compute the odds but she had to shut off all emotions in order for the equation to make sense. Otherwise it kept inexplicably tipping, kept summoning up Cianna’s indignant face, the drawn skin translucent as bone, but the eyes still alive, still full of purpose.\nShe filled herself with silent calm and re-evaluated a dispassionate formula. Yes.\nWind from the inland this time, sighing towards her full of pine. The deer were everywhere, as they always had been, nosing through blackberry vines with black tails flicking. Every house was deserted. She found Cianna alone, standing on the cement structure at the bluff’s end: a former military embankment, the guns stripped away long ago, the cement fuzzed with emerald green moss and rusty lichen.\nShe climbed up the narrow stairs. The wind hurled itself against her.\n“You don’t have to go alone,” she said. The wind slackened. Gulls hung overhead, wingtips wavering as they rode the wind. Cianna turned.\n“I’m going to branch. Make a recording of myself. It’ll go with you. Live with you in the memory palace.”\nCianna’s nose wrinkled. “A recording.”\nShi reached for the handrail to haul herself up the last steps and move to lean against the concrete blocks. “You know how it works. I’ll go with you. It’ll be me. It’s not cheap. I’ll have to bribe someone to slip the recording in the ship but I’ve got enough, I think.” She shrugged. “It’s in your hands. This is the best I can do. You know sooner or later Ruth will have her way.”\nAnd if the benefit of a lifetime, a retirement of the kind I’ve never dared dreamed of, falls my way in the process, well, who does that hurt, really?\nShe continued, “I don’t mean to be cruel, but do you want to stay here, neglected by your children? They don’t want you. I do.”\n“You have a choice. I don’t. They say I legally can’t make them.”\n“They’ll put you in the program, no matter what, yes. But if I help you—if you let me help you—you can prepare your mind, be more than just the thing that drives the ship. You’ll remember who you are.”\nThe wind whipped around them and a seagull wavered in the sky, a wispy cloud flowing to obscure then reveal then hide it again. Sunlight and windchill fought for supremacy on her uncovered skin and the dazzle on the waves made tears blur in her eyes as she swallowed against the earnest lump in her throat.\n“All right,” Cianna said, finally, wearily. “Where do we start?”\nShi woke slowly, swimming up through dream layers. She’d been so tired when she’d laid herself down to make the recording. She’d worked nonstop, night and day, to build the memory palace, to fill it with more than one had ever held before, a world of possibilities. A life that she and Cianna could inhabit.\nShe looked forward to it. Her own parents had been distant. And it wouldn’t be as though they had to continually interact if they turned out not to suit each other well. The world she had made from Cianna’s imagination was her masterwork, full of details. How often did you get to build your own Paradise, almost literally?\nNow here she was, light seeping under her virtual eyelids. All around her the hyper-real, the beautiful world that would be her home for centuries . . . longer. A world of possibilities and wonder.\nShe opened her eyes.\nBut the tiles overhead were the same as always. She sagged back into the mattress.\nShe wasn’t the recording. Only the original.\nStill left behind.\nCat Rambo lives, writes, and edits from atop a hill in the Pacific Northwest. Her most recent novel is Hearts of Tabat (Wordfire Press) but 2018 also sees the debut of her writing book Moving From Idea to Finished Draft (Plunkett Press). Information about her online school, The Rambo Academy for Wayward Writers (www.kittywumpus.net/blog/academy), along with links to many of her 200+ story publications can be found at her website (www.kittywumpus.net/blog). She has swum with sharks and ridden an elephant, performed the hula at the Locus Awards, danced with the devil in the pale moonlight, and is currently serving her second term as the President of the Science Fiction and Fantasy Writers of America."}