{"fingerprint": "LSUDrjErVczp9ZqfqgjE3tNGdyw=", "sitename": "Clarkesworld Magazine", "title": "The Universal Museum of Sagacity by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_05_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Universal Museum of Sagacity by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8700 words, novelette\nThe Universal Museum of Sagacity\nWalter Fitzgerald was a rising force in the insurance industry, living in faraway Boston when he met a lovely Bohemian girl named Madeline Furst. The one-week courtship led to a wedding officiated by an Episcopal priest, and the couple settled into an apartment near Beacon Hill. Maddy was my mother’s aunt, but only briefly. That adventure ended after a year, and besides tax records and snapshots, very little survives from those days. After that, Walter returned home to the Midwest, married a local girl, and had two children. Those were my mother’s cousins, and odd as it might sound, they knew Maddy. In a fashion. She was the very pretty lady who flew in for the holidays. But only when they were little, and for one reason or many reasons, their parents neglected to explain the woman’s significance.\nWhich is a story unto itself.\nMom was a decade older than her cousins, and she also didn’t know about “the Boston wife.” What she saw at the Christmas parties was a cosmopolitan lady whose life revolved around art. Maddy was said to be a genius with paint and with words, and there was considerable travel, complete with cocktails and cigarettes. It was hard to decide which part of that biography Mom found most appealing. But later, when she was told about the family secret wearing high heels, she had to marvel at the woman’s capacity to sit beside her ex-husband’s wife, the two of them happily discussing nothing, not a touch of jealousy on display.\nChristmas meant cameras, and I was eleven when I came across three of the surviving photographs.\n“Who’s this?” I asked.\nNobody can answer that question. Not about themselves, much less other people.\nAnd that was true a thousand times over for Maddy.\nI was sitting on the living room floor, and Mom was across the room from me. But it was easy to guess which face among the dozens of faces caught my interest.\n“Oh, that’s my Uncle Walter’s first wife.”\nThe time stamp on the white border claimed this was March of 1965. But that’s just the date when the film was developed. Those album pages were dedicated to Christmas in 1964. Some of the subjects were smiling for history, others ignored the camera. Then there was the lady who was posing and not posing. Who was smiling politely but a little fiercely. Her bent elbow was cradled in the free hand, a cigarette riding between two fingers. Even a boy who didn’t know much could spot the face that didn’t belong, and I mentioned that impression to my mother.\n“She’s different,” I said, or something along those lines.\nMom heartily agreed, and joining me, she shared a fresher piece of the saga. Her cousins lived elsewhere, but she met them for lunch last year, both of them home for a visit. The topic of Maddy came up, and trying to deliver a compliment, my mother applauded their mother for being so gracious and good. And why was that? Because she allowed Walter’s first bride to join in their celebrations.\nGuess where this story leads.\nYes, this was unexpected news. It was practically a thunderbolt, unanticipated and leaving everybody off-balance.\nYes, the cousins remembered the pretty lady. But Miss Furst was just a family friend. Nothing more. How could my mother get the story so wrong? Except she wasn’t wrong. My grandmother, Walter’s sister, had shared the history. But that admission happened years ago, and it wasn’t supposed to remain a secret. Not once the children were grown, and why didn’t anybody ever tell them?\nLunch ended with embarrassment, confusion, and a lot of anger trying to find any worthy target. The Fitzgeralds held an emergency family meeting. Mom didn’t witness any of that, but it was easy to imagine the conversations. Difficult questions led to belated confessions. “Except really, where’s the scandal?” she asked me. As if I were the jury, one eleven-year-old boy. Mom didn’t intentionally ruin anyone’s secret, and she refused to accept any blame. Every parent had the obligation to tell their children the truth, and since nobody else did their job, she did it for them. And really, the whole incident made her cackle, replaying the shock in the faces of those forever-younger cousins.\nThat was the first time I heard the story. But that day was just as important because of something I learned about myself: I had the capacity to become infatuated with a faded black-and-white photograph. Sure, Maddy was beautiful in the usual ways, looking at me from thirty-five years in the past. Her cigarette was ominous and sinful, and thus wonderful, and I imagined the moments after that picture was taken, smoke blowing out of that pretty smart, and very angular face. She had dark hair cut short and a small mouth, the chin pointed and eyes that held nothing but mystery. And making her even more astonishing was the ex-husband. Walter was a prematurely old man, bald and heavy, sitting passively beside Wife Number Two. Who was a pretty gal in her own right, I should add. Which was why later, as I began to understand people, I realized Walter must have had quite a lot to offer the pretty ladies of that other long-lost century.\nBut at that moment, I was just a kid sitting in our living room, struggling to make sense of faces and mysteries that keep their secrets even today.\nMom stopped talking at last.\nWhat was she telling me?\nNo matter. I asked, “So where is she?”\n“My aunt?”\n“Yeah.” I was bracing for a fresh photograph of an old lady, smoked out and drunk out and spent.\nBut no, Mom gave me the one answer guaranteed to make this apparition even more real. “Maddy died,” she said calmly, but not sadly.\nI noticed that tone.\n“In Turkey, in Istanbul,” was her follow up detail.\nFor the first time in several minutes, I looked up from that photograph of a dead woman and a lost day.\n“There was a car crash, Colin. In 1965.”\nWe were months away from a new century, and another forty years had to be crossed before that lie was revealed. But whatever my mother knew, and whatever she thought about secrets, it was best to keep that particular and very peculiar honesty out of my sight.\nBorn in 1988, my childhood was spent inside the soggy, slow days when the Internet was half-realized, when machines could only pretend to be smart and pretend to be our friends. For all of its noise and eager promise, science was accomplishing remarkably little. Fusion would always be twenty years in the future. Genetics were being manipulated, but only for disease-resistant wheat and prettier flowers. And the total invests into SETI were barely enough to run a few antennae watching the wrong parts of the universe.\nI married a pretty lady of my own, though she wasn’t mysterious or Bohemian and she never pretended to be artistic. The most ordinary couple in the universe, we had children and what felt like a very durable family, and then everybody was grown, including two middle-aged people who looked at each other for the first time, realizing that our best possible future involved a polite divorce.\nSingle again, hungry for change, I found a new job in a different state. PinPoint was the tech beast that ate Google and Apple, and PinPoint saw talent enough to hire me. To outsiders, everything about my employer sounds spectacular. But honestly, nothing about me is exotic or special. We happen to be the world’s largest corporation, worth trillions and possessing a chokehold on genius and a hundred new markets. But the bigger any company is, the more it needs a corp of dull experts who manage the kibblebucks and bitcoins and dollars. Which is not to claim that I’m an accountant. Bookkeeping is better done by AIs, and by AIs, I mean the intellectual servants buried inside my extended, effervescent nature. Which is the PinPoint system: A marvel of technology endlessly remaking humanity as well as this golden new world.\nWe aren’t the first company to tap into machine consciousness, but we have always been the pioneers who embraced machines hardest, and as a result, we delivered the most profound results: Fusion reactors pounded out like cookies; endless foodstuffs grown with bottled sunlight and air; prolonged lifespans; augmented intelligence; and the possibility of starships that could punch through the quantum nature of the universe—a universe proving to be both larger and quite a bit smaller than anyone had guessed.\nEverything was becoming possible in these last years, or so it seemed. And I was in charge of the brilliant machines that expertly herded the pennies.\nPeople always want to think they’re part of something special.\nAnd usually, we are so wrong.\nMy mother had a talent for repetition. I don’t know how many times I heard the Maddy story. Not often enough, she believed. But there were ways to shake the story, making it into something fresh.\nFor instance. As a young man, good with numbers and a little wise about human nature, I proposed two possibilities. Obvious scenarios, and well worth sharing.\n“Maddy needed money,” I said.\n“What are you talking about?” she asked.\n“Why she came to Christmas. It was Walter’s way of giving her an allowance for the next year.”\n“What? Like a divorce settlement?”\n“Why not?”\n“Because there wasn’t any alimony,” Mom said. “They parted on excellent terms, and she made her living from art.”\nHow many artists paid their rent, much less bought booze and plane tickets? But there was another possibility, sharp and obvious. “So they were still having sex,” I said. “A few days every year, and Walter paid her or he didn’t pay her.”\n“Oh God no,” she said.\nThis was a burdensome time for my mother, her grown son pushing through a phase of blunt honesty. Which isn’t the same as truth telling. If you think about it.\n“Or,” I said ominously.\nBristling, she asked, “Or what?”\n“The two wives liked each other too. If you know what I mean.”\n“Colin,” she said, preparing to say quite a lot more.\nBut no other words offered to help. And my mother turned and hurried out of the room.\nEmbarrassing lunches and bad afternoons: Every family suffers them. But eventually I decided there were boundaries worthy of respect, and I stopped making trouble. Which was when the Maddy stories returned to their traditional pattern, decade after decade, until my mother was living inside a tidy, very modern facility that catered to the dying.\n“Istanbul,” she said. “Did I tell you about Istanbul?”\n“Where your Aunt Maddy died,” I said.\n“So I told you that part?”\n“Once or twice.”\nAn odd, oversized grin emerged. “But I didn’t tell you the big secret, did I?”\n“I don’t know, Mom. What’s the big secret?”\n“The part Uncle Walter shared with me and nobody else.”\nThis felt new, or maybe I wasn’t paying attention earlier. “What did Walter tell you?” I asked, not quite sure where a secret would sit.\n“My aunt was exceptionally creative,” Mom boasted.\nI nodded. Waited.\n“Madeline was.”\n“Aunt Maddy. Yeah, you told me. She was some kind of artist.”\n“A brilliant soul. That’s what was most special about her. It doesn’t show in those old pictures. But how could it? She was an incredible person, and none of us realized it at the time.”\nMentioning the name was enough for me to remember Maddy’s face. A divorced man in his later years, and I still cherished my odd infatuation for a black-and-white image. And there were the alluring possibilities of inventive marital arrangements between three long-dead people.\n“I can’t say what was most incredible about the woman,” Mom continued. “And your uncle couldn’t explain it to me either.”\nWalter wasn’t my uncle. But I didn’t dare stop her.\n“I’m sorry. I’m not sure about dates. But Maddy was noticed. In the early 1960s, I think. For one painting, for all of her poems. I don’t know the particulars. But they singled her out, and that’s why she was granted a very rare honor.”\n“‘They singled her out,’” I repeated. Silly as hell, I imagined my dead great-aunt in Stockholm, wearing a robe and gold medal.\n“Just once, Walter said, ‘Very, very few of us are noticed.’”\nTrue words.\n“Walter had this wonderful rough voice,” Mom said. “Very manly, very smart. ‘But my Maddy,’ he said. ‘She was one of the fortunate ones.’”\n“Who noticed her?” I asked.\n“Oh,” Mom said. Then with a conspirator’s laugh, she said, “I can’t tell you that, Colin. I promised not to.”\nThe woman was very old, very frail. And there were moments when I wondered if senility was in charge.\nSo I said, “Oh Mom.”\nBut she was lucid enough to hear the tone in my voice. Then she put her hand on my wrist, saying, “Think of something you would never believe. That’s what happened to your lovely Aunt Maddy.”\nOld people are experts at shuffling through the past, and that’s one of the few blessings we are losing, living in this world increasingly free of illness and mortality.\nMy mother was dying. Every week brought medical wonders, but she was dying at a very particular pace. Another few days, another five years, and she would have been saved. But there had to be a funeral instead, shaking hands with surviving family and friends, and there was business involving Mom’s possessions. Except those final chores had to wait. One recent promotion had led to another, bigger promotion, and I had too many work responsibilities keeping me distracted and happy. It was half a year before I was inside an air conditioned locker, opening up boxes filled with more boxes, and waiting inside a shoebox were three photographs of Madeline Furst.\nTwo of the images weren’t particularly remarkable. Maddy was out of focus in one, badly lit the other. But I spent long moments with the image I remembered best, watching the woman stare back at me from that other century. And because it was so very easy, I fed those images into PinPoint’s in-house search engine, along with my narrow version of history.\nEvery visible photograph in the world was examined.\nAnd all of the public records too.\nTime barely passed before several thousand photographs were recovered, and with those images came a storyline that marched forwards until a spring day in 1965. In Istanbul. A British tourist took a snapshot of a street scene, and in the foreground, caught while sitting in a cafe, was an American lady doomed to die tomorrow in a car crash. Accounts of the accident were reported in newspapers as well as the police files, all translated into mid-21st Century American, and I read them while ten more minutes of superconductive labor revealed nothing else.\nBut the search engine asked the usual question: Should she continue pursuing images of the lady?\nMagic spells are powerful, in part because they are so easy to unleash.\n“Sure,” was my magic word, and having said that, I returned to sorting through my mother’s favorites and forgottens, certain in my mind that nothing more would come of this.\nLesser companies offer climbing walls where their people can embarrass one another while wrenching muscles.\nInstead of walls, PinPoint maintains a private mountain. But it isn’t a respectable peak in Colorado or Central Asia. PinPoint doesn’t accept the ordinary. The mountain is a marvel of algorithms and sculpted data, all tended by our in-house art department, with the collaboration with staff geologists. Peacefully scenic on its lower slopes, the virtual edifice turns steep and beautifully angry. Any employee is free to enjoy the mountain whenever he or she wishes. Exercise is a priority at PinPoint. Camaraderie with your fellow workers is another goal. The limits of lightspeed remain, but the new sub-mantle optic lines shave microseconds off transmissions. That’s why a member of the accounting department can drop onto a pine-shadowed trail, walking uphill for twenty minutes before reaching a favorite vantage point: Two kilometers above a winding river valley, and two kilometers below the blue ice and wreathing clouds worn by a nonexistent summit.\nI’d recently turned sixty-seven but was being dialed back physiologically, with the goal of making myself forty again. Though it was possible to shoot younger, if you were that kind of man. I’d made the hike a hundred times, and my habit was to stop at the overview and lay two fingers against my wrist, relishing an increasingly youthful heart. But that day strangers distracted me. Three of them were perched at the cliff’s edge, the air directly above them warped to form a lens. Instead of counting heartbeats, I joined them. Which is encouraged. We were colleagues in the same great venture, after all. By rights, we should stand beside one another, regardless of station or status or every well-deserved pride.\n“Too close,” one of the watchers said.\n“He won’t make it,” another said hopefully.\n“But he might,” the third warned. Then she lifted a slab of light, giving instructions to the algorithms responsible for the weather three kilometers above us.\nThe change wasn’t as abrupt as pushing a Kill button, but it might as well have been. Through the lens, I could make out a faceless human figure scrambling up snow-clad stone, using nothing but strength and fearlessness encased in gecko skin. The gentleman wasn’t a hundred meters below that fictional ground. Which is the mountain’s more impressive feature: Sierra PinPoint was designed to be unscalable, and what I stumbled across were three of the people who lost sleep worrying that some bold or lucky other would beat their baby.\nThe conjured storm came from nowhere, and the climber vanished behind gale-driven clouds.\n“Fell,” one person said gratefully.\nNobody died, of course. Which was another reason to maintain a fake mountain over the real sort.\nBut that left the trio with the urgent task of improving their mountain, and like any corporate problem, there were limits to what was possible. Two of them were artists, and the third was a PhD who looked at the world as a series of cross-bedded sediments and rift valleys. He made suggestions about how real mountains acted, and the artists struggled to weave their vision around rational rules as well as budgetary limitations. Data are not free. Even the smallest data occupy space and demand energy. In other words, numbers need to have homes, and every home costs money.\nI was eavesdropping, understanding almost nothing.\nAnd they ignored me in that non-insulting way people do when private problems consume them.\nThen I surprised all of us.\n“I can help,” I decided.\nThe geologist appeared older than me. Because he hadn’t dialed back his years, or because he wanted to wear the elder role? Whatever the reason, the gray fellow warned, “This isn’t just piling rocks on top of rocks.”\n“I understand that,” I said.\nBut he realized quite a bit too. “You work in Billing.”\nThe trio might have had hopes, but a quick scan washed that away. I was a bookkeeper, yes, which put me low on every scale.\nThen I offered them a number.\n“Excuse me?” said the woman artist.\n“What are you talking about?” asked her colleague.\n“Your mountain is an indulgence, not a priority,” I said. “But I have a pretty fair sense of what you need in terms of funding. There are departments with extra resources. Some of that fat is going to get eaten in another six hours. Which happens every day. And as it happens, the man you just threw off the mountain controls a division with enough capital to make everything possible. If you approach him now. If you promise him a higher peak and thinner air and far worse weather too.”\n“That’s going to make him happy?” the geologist asked skeptically.\n“Ignore his happiness,” I said. “He knows the rules and never planned to summit. But he expects you to keep him chasing what can’t be caught. So yeah, I believe you should meet with him. Right now. While the memory of his death is fresh in everybody’s head.”\nThe sculptors fell into private channels, discussing the possibilities.\nI stepped away, hoping for thanks and getting nothing but one more growl from the geologist. Then he left the mountain by the most direct route, stepping off the cliff to drop back into his office and most trusted chair.\nThe sculptors and I lingered in the clearing. But nothing was said between us. I watched the mountain below while their attentions shifted to an impromptu meeting with the mountaineer. Then a few minutes later, winning smiles appeared, and then some infectious, child-like giggling.\nWhich was when the new group arrived.\nOne glance told me everything. There was no reason to approach these intruders. PinPoint is a juggernaut for a lot of reasons, but particularly because we have a genius for finding genius. Half a dozen of our best were standing in the false sunshine. These people were brilliant at birth and every subsequent technology had added to their cognitive wonders, their insightful motors. They looked ordinary enough walking the mountain, but their true bodies were punctuated with every species of AI link and randomizing generators, plus devices still being tested by R-and-D.\nI have never liked PinPoint’s big guns.\nAnd that moment only made my biases worse.\nThey glanced at me and through me and gave up on me without bothering to learn anything about my little job.\nThen they examined my companions. The woman sculptor was still giggling, hands drawing sculptures in the air while her partner kept his eyes closed—a contrast of styles that made them even more obvious.\nOne of the geniuses sighed and said, “Artists.”\nThat was all she said.\nThen the others laughed. Not loudly and not cruelly, no. Just a shared little giggle of their own, probably adding to an old joke not worth repeating. And with that, these masters of Creation attacked the next slope, continuing a climb that would last as long as they wanted it to, and that would never be allowed to end.\nMultiple PinPoint divisions worked on SETI projects, each armed with distinct strategies and competitive ideals. But those watching the sky, in whatever capacity, were doomed. Theorists armed with faux-black-holes were first to realize that the universe wasn’t just thickly populated by other intelligences, but that seeing our neighbors and speaking to our neighbors could be as easy as talking to the person holding your hand.\nThe enormous news broke on a Monday morning.\nPeople from sixty busy years of life were instantly reaching out to me. Did I still work for PinPoint? And even if I didn’t, did I know anything? Most of the messages would never earn a personal answer, but everyone who got past the gauntlet of AIs and indifference posed the same question:\n“Do you get to talk to the aliens?”\nIf not those words, then at least by implication.\n“Sure, sure. Do you want to chat with them too?” I quipped.\nGood for a gasp and maybe some misplaced respect.\nBut I’m not much of a liar. “No, sorry,” I’d confess. “You’re talking to the wrong department.”\n“But you will eventually,” they insisted.\nI didn’t have the clearance to see that future or enough gossip to guess if our geniuses were trading words with anyone. But one technical trouble was obvious, and that’s what I tried to explain.\n“The inflow of data,” I said. “It’s enormous and PinPoint isn’t ready. Nobody could be ready. We’re downloading images and audio and long, long stretches of video, and it’s coming as ancient recordings as well as in real time. From trillions of worlds, close suns and distant galaxies, and despite what you hear about how smart we are and how much smarter our machines are . . . well, we aren’t. PinPoint is an elephant that can drink an entire river. But this is ten trillion oceans, and PinPoint is swimming a million kilometers from shore.”\nI liked that image of water. The first time I used it, and ever since.\n“Oh, but this is so exciting,” my ex-wife said.\nA lady who never got excited about much, I should mention.\n“Even if we can’t understand what they’re telling us,” she continued. “I mean, I love the pieces already posted. That alien with the wings. She’s such a beauty.”\nA million species had wings. So far. Counts were accelerating, and even among the ranks of bookkeepers, it was obvious that the scope and reach of this technology would never allow us to enjoy another lazy breath.\nSpectacles were wonderful, until the spectacles refused to end.\n“I’m proud of you,” my ex-wife said.\nAnother thunderbolt in a day of nothing else.\n“I have to get back to work,” I said.\n“Of course,” she said.\nThen as if I had any finger in history, she said, “Good job, Colin.”\nFor the next eighteen minutes, I was a marvel of cyborg brilliance, shifting funds where they begged to be, leaving people paid in exchange for their devotion to our corporation. And I would have finished my nineteenth minute. Except. Research budgets were suddenly frozen. Everywhere, everywhere. A thousand projects ripped from existence, not a shred of mercy shown. I was told to do nothing, which is an impossible trick for any creature with more than three neurons. This was a day of aliens, yet every starship program had been shelved, all of that frozen money assembled inside one account, access granted only to a freshly assembled team wearing a very peculiar name:\nThe Sagacities.\nI couldn’t guess what that name meant, but that didn’t stop me from trying. And in the midst of all that misplaced conjecture, I received word that the Sagacities were meeting at the corporate headquarters, inside our most secure room, and I was expected to join them as fast as humanly possible.\n“We found her,” one man said.\nTo me, apparently, and that’s all he said.\nBut the woman beside him refused to accept credit. “No, you’re responsible, Colin. Without you, we could have missed her entirely.”\nI counted faces. Twenty-three people and their perfumed beverages were sharing the conference room. The best minds straddling PinPoint, and everyone was staring at my idiot face.\n“Well good,” I offered.\nThen, “Glad to help.”\nJust before I asked, “So who exactly did I find?”\n“Your great-aunt,” the man said. A small fellow with a booming voice that delivered his news along with an uncomfortable twist of the shoulders. “In fact, we can see Madeline right now.”\n“How’s that?” I sputtered.\n“Live feeds from elsewhere,” was his cryptic reply. Then, “Would you like to see her?”\nI didn’t have time to answer. One long wall dissolved into a street scene. Except the “street” looked more like black satin carpeting than a roadway, and nothing about the native architecture was human. Structures were more grown than built, full irregular blobs and jumbled angles that made at least one man uneasy. A dwarf red star stood fixed to a sky thick with pink dust and glittering machines, and the carpeted street was jammed with aliens. Not one species or ten species, but countless shapes marching and dancing while producing all manner of purposeful noise. And deep inside that mayhem stood one very familiar figure: A woman presumed dead but now leaning against what resembled an upright badger. I spotted her hair, dark as always but longer. Age had done nothing to the pretty face. And with all of the surprises raining down, I was a little startled to find the lady acting chummy with an animal. Maddy never struck me as the sort to keep pets.\n“This is live,” I managed.\n“Not this particular view, no,” the woman offered.\nBut the man was in charge, glancing at his colleague with a narrow smile. Then looking at me again, he said, “You were hunting for this person.”\n“I wanted pictures,” I said. “The AIs offered to help, and I let them. But I haven’t heard anything from them in a very long while.”\n“Well, the hunt continued,” he explained. “Several AIs made themselves into experts in that one face, and when the floodgates opened, they were well-trained to find Ms. Furst.”\n“Maddy,” I said.\nEveryone was watching me, nobody talking.\nUtterly thrilled, I said, “So the aliens carried Maddy off to the stars.”\nMaybe these people were having a good day. Several of them laughed, though it wasn’t a joyful laughter, and meanwhile the small man in front preferred to curse, under his breath but with an extraordinary amount of enthusiasm.\nNobody took the trouble to educate the honored guest.\n“It’s time,” said the woman. She was rather pretty, particularly when she winked at me, saying, “Watch your Maddy now.”\nMy Maddy said a few words to her pet. I heard her. Somehow her voice was pulled out of the mayhem, and what I heard was as rich as I had imagined her voice had to be, and every word was incomprehensible. Then the beast lifted his hairless palm, presenting it to the human tongue that licked it twice and twice again. And then he did the same, caressing her hand with a piece of soggy blue flesh that sprang from his exuberant, tooth-rich mouth.\n“They’re kissing,” I guessed.\n“Who cares?” the man said. “But watch what happens next.”\nMaddy dissolved. Without sound or apparent effort, she turned into a puddle of water instantly absorbed by the black carpet. And accepting her absence, the pet that wasn’t any pet walked away on two stout legs.\n“Okay,” I muttered.\nI had nothing smarter to offer.\n“That scene was recorded this morning,” the man reported.\n“Did she just die?” I asked.\n“No, the body was temporary. Woven out of native ingredients. Her mind is somewhere else, presumably protected. And that’s how you travel in the universe. We know this. We’re very much sure. Life moves without going anywhere. By erecting bodies where and when you need them, and then tearing them apart when you decide to leave again.”\nI nodded, asking, “Can you see her now?”\n“Oh yes,” he said, waving a single finger. “This is her real-time feed.”\nThe sky turned to darkness punctuated with a few smudges of light, and beneath that emptiness lay a flat expanse of floor. Maddy was in the middle of the floor, wearing nothing. She was wearing clothes on the alien street, and to a fashion-impoverished man, they seemed like unremarkable clothes. But in her new location, wherever this was, she was naked. By the looks of it she was working, testing the bright colors of paint or dye or whatever that substance was that poured out of a thousand mechanical hands that seemed to be doing her bidding.\nI stared at the paint-splattered body until I embarrassed myself, and then I looked at the sky. “She jumped to her world’s night side,” I guessed.\n“No,” the man snarled, the rest of the room nodding in agreement.\nI looked at the prettiest genius. “I don’t understand.”\nWith a glance at her boss, she asked permission to explain.\nThe man offered a silent shrug.\n“Every feed comes to us wearing a label, a marker,” she said. “Imagine an address larger and quite a bit richer than the contents of every human library. Well, this particular feed is called ‘The Universal Museum of Sagacity.’ At least that’s what our translators have decided to call it.”\n“She was an artist,” I said, gawking at rivers of yellow and white paint wetly shining. “Maddy was Walter Fitzgerald’s first wife. She died in Turkey, supposedly. Except there was a secret about her life, and I don’t know what that secret was. Walter told parts of the story to my mother. Something about the best of us being noticed for our talents, and as a result, being rewarded.”\nI paused.\nNever in my life had so many people stared at me with such intensity.\nFinally I asked, “Why do you want me here?”\nMost of the faces looked at the man in charge.\nHe decided to say nothing.\n“It was an offhand comment,” I said. “I asked the engine for help, just once, and now she’s found.”\n“It seems so,” said the growly man.\n“What else can I add?” I began.\nThen before anyone could respond, I offered a second question. “So what other human faces have you found?”\nThe man straightened his back, irritation mixed with confession when he said, “None.”\nThat seemed unlikely, ridiculous. “Why not?”\nShrugs were the best response. I was sharing the room with frustrated little shrugs.\n“My mother’s uncle,” I began. “Walter implied Maddy earned an extraordinary honor, but he didn’t share anything about starships and aliens.”\nEye after eye went vacant. People were talking among themselves, on private channels. Deciding what to do next, maybe.\n“So the aliens liked her art,” I ventured. “They carried her off to their world, and she didn’t age much on board the starship, what with being frozen or having time slow. But she’s awake again, doing her big art projects in this big museum.”\nNobody seemed to hear me.\nI watched the naked woman throw rivers of ruddy brown across a gigantic floor/canvas.\n“Where is this?” I asked.\nA few looked my way.\n“She’s on a nearby planet,” I guessed. “Or the badger’s stardrive pushes way, way past the speed of light.”\nWith a cranky sneer, the top Sagacity said, “No to all of that.”\n“No?”\n“The museum doesn’t sit on any world,” he explained. “It’s a Dyson structure, and we’re estimating it’s a little more than one light-year in diameter.”\nI said, “Shit.”\n“According to navigational markers, what you see floats in a void far removed from every galaxy.”\n“Shit,” seemed like the perfect word. I offered it several more times.\n“A few hundred years of science,” the man continued, “and we finally realized that distance means nothing. People don’t need spaceships in the garage or transporters in the closet. Because every other world is in easy reach, if you know how.”\n“Do we know how?” I asked.\nNobody answered.\n“So where is my Maddy?”\n“Probably somewhere close,” he allowed.\nThen the woman jumped in. She was talking to me and everyone else too, promising, “When we find her, we can reverse engineer the technology. And after that, hopefully, we’ll be able to wrench open the sky.”\nThe old fellow was sitting upright in his exceptionally fancy, very busy hospital bed. I started to offer my name, but he remembered that and quite a lot more. “God, Colin, you look like your mom,” he said. “But I’m sure you get told that.”\n“And I see your dad,” I offered.\nBaldness is mostly derived from the maternal parent. So the patient’s mother must have granted him that gift, helping his resemblance to his twice-married father. Plus, he was named Walter the Second. “I wanted to go to her funeral, but I was in pretty miserable shape,” he said.\n“Not anymore,” I observed.\n“Isn’t that the truth?” Tubes and more tubes fed Walter’s stout body, surgical wands teasing aged genetics, and if these radical therapies continued unabated, my mother’s last living cousin eventually would be able to leap out of bed and cartwheel free of the room. That young, sturdier than ever, he would inhabit a life no reasonable mind would have dreamed for itself.\nAnd there I stood, thinking how my mother didn’t live long enough, and despite every goodness inside me, I was ridiculously angry with this lucky man.\nThe patient didn’t notice my pettiness.\nOr he politely ignored it.\nWith a gracious wave of a meaty hand, Walter said, “Sit, if you want. I’m guessing you’re here to talk about the lady.”\nThe bedside chair seemed too close. Better to claim the soft lounger.\n“I barely remember Miss Furst,” he said.\n“The artist,” I said.\n“Yeah, I didn’t know anything about that.”\n“Or that she was your father’s wife,” I said.\n“Because she wasn’t.” That brought a big, impressively testy laugh. “Not when I knew her, she wasn’t. They weren’t.”\nStaff psychologists had suggested strategies, but I was in charge of this little side operation. And that’s all it was. The highest technologies available were scouring the world, searching for a person who vanished decades ago. The Sagacities were convinced that AIs and algorithms would answer every mystery, but until then, they gave me enough authority to speak to one old man.\nI threw a recorded feed into the air. We watched Maddy on that cosmopolitan world. She was sitting in what might be a cafe, smoking a root or stick while sipping what looked like milk. This was the video released last night, in an effort to get people looking into drawers and attics. PinPoint was ready to pay fortunes for any item related to this suddenly famous lady, and that included the recollections of some very old people sitting happy on healing beds.\nI didn’t mention money.\nThe old man was nodding at the image, or at his own thoughts.\n“She eventually talks,” I said.\n“I’ve heard the voice.”\n“Is it her voice?”\nHe shrugged. “You remember how people sounded a lifetime ago?”\n“If they were important to me, yes.”\nMaddy crushed out the half-finished smoke while telling her companion something very casual. Unless it was the most important phrase ever uttered. Who knew? Sitting at her table was a small golden creature built more from light than flesh. What wasn’t a mouth answered with a similarly impenetrable phrase, and the two mismatched entities did nothing after that but sit quietly.\nShe would melt away in a few minutes. But PinPoint was keeping that piece of the story secret, at least for the time being.\nThe recording looped back to the arbitrary beginning.\nWe watched it all over again, and one or several Sagacities watched us. I felt them wishing for something more substantial than two old farts sitting in a hospital room.\nI was just as impatient as they were.\nThe increasingly young Walter noticed my feet dancing, and like any man with ten thousand years ahead of him, he said, “Relax, kid.”\n“I’d rather not.”\n“All right then. So what are you doing here?”\n“I came to ask for your permission,” I said.\n“To do what?”\n“Search your belongings. We want to hunt for anything that Madeline might have left in your family’s care.”\n“Like some old painting,” Walter said.\n“Do you remember anything like that?”\nHe shrugged, that one gesture dangling possibilities. But even as my hopes rose, he said, “You’re welcome to look. Yeah, I give you my permission. But there’s nothing to find.”\n“You’re certain?”\n“Everything was thrown after our parents died. Which was decades ago, and hell, I doubt there was anything to find in the first place.”\nA thought struck me.\nHe saw something in my face. A flash of excitement, maybe.\nSo I stiffened my mouth, saying, “Well, that’s disappointing.”\n“Yeah, it is too bad,” he said. Sarcastically. Obviously, he didn’t care one way or another.\nA final topic needed to be mentioned. “You didn’t throw out your memories,” I ventured.\nHe shrugged, saying, “I’ll tell you who Madeline was. To me, she was this person who hung around us at Christmas. That’s all. And in those days, believe me, Santa Claus was more real to me than she ever was.”\nBut that didn’t prove his ignorance. I cut the Maddy feed and then offered questions. My questions and others suggested by experts, each meant to trigger a rich trickle of details. But the increasingly young Walter surrendered nothing but vague recollections of plastic toys and Christmas hams and words said in public, with little kids watching.\nThe interrogation ended.\nLike Maddy and her golden friend, we sat together, saying nothing.\nWalter finally broke the silence. “So when do we launch our starships?”\n“We’re building stardrives right now,” I lied. “Fifty of them in a new factory on the back side of the moon.”\n“Okay then,” he said.\nI stood and thanked him for his trouble, and I left him.\nThe first time.\nStanding in the hallway, I endured one brief chat with brilliant people who didn’t see any more potential in Mr. Fitzgerald.\n“In another few weeks,” the top Sagacity suggested. “Rejuvenated minds have sharper memories, all in all.”\n“But I’m done for now,” I said.\n“Sure.” Then he was gone, probably chasing another useless thread.\nI’m not the brightest creature. But I appreciate how the world works and what it takes to gain an advantage. I severed every electronic connection between myself and PinPoint, and then my second visit began. With a loud knock, I strode back into the room. “Actually, Walter. Sir. There’s another memory I want to talk about.”\nThe man was tired of me. That much showed.\n“Years ago, you and your sister met a cousin for lunch. My mother, as it happens, and she said a few things that you hadn’t heard before.”\nThat earned a gruff, “Yeah?”\n“Well, from I was told, that lunch was followed by some sort of meeting with your lying parents.”\nThe face suddenly looked old, and exposed.\n“Yeah,” I said. “Just as I guessed.”\nIn the presence of scenery, people look down more than we look up. I’ve noticed this. Whether the peak behind them is going to be climbed or not, we want to see the world beneath us in all of its wonder, and it doesn’t matter if that world is total fiction. I studied the valley and the individual pines and what was meant to look like a condor working rising columns of dry crisp summer air. “We call them overlooks,” I said quietly. “Not underlooks. Which means something about us, I suspect.”\n“Excuse me,” my companion said. “What are you telling me?”\nNothing, so far.\n“Again, thanks for helping with our funding,” she said.\n“Glad to do it,” I said.\nA weak laugh. “Which makes you our patron, I suppose.”\nNot a bad title, and I laughed.\nOne hand lifted. Consciously or not, she drew a question mark in the air between us.\nShe wanted to know the reason for this meeting.\n“I’ve been studying your work,” I confessed. “Not with PinPoint, no. But the stuff you did before we hired you.”\nShe offered a guarded smile.\n“I don’t think I’ll ever understand your art, and it makes me breathless, trying to appreciate it.”\n“That’s the oddest compliment,” she said.\nThen my next guest walked out of the pines. He was two minutes early, which bode well for the future. Odd statements from an accountant had lured him here, and while neither of them knew it, the accountant mattered more to them than anyone else in their life.\n“I wanted to thank you person,” said my artist friend. “That’s why I came. But I do have quite a lot of work.”\n“Stay,” I insisted.\nShe glanced at the little man, dislodging the impressive beginnings of his biography.\n“I have to talk to him, but it won’t take long. And don’t worry. I’m going to help you again. So much so that you won’t be able to thank me, not in a thousand lives.”\nCuriosity fixed her feet to the fake ground.\nApproaching the top Sagacity, I said, “Thanks for taking the trouble.”\n“I’m barely here,” he warned.\nSure. This was a diluted avatar, most of his genius focused on a world of unanswered problems.\n“I found Maddy,” I said.\nHis presence didn’t grow. The technology didn’t work that way, and so no, I couldn’t feel his soul shutting down every distraction but me. What I saw was the clear gaze of steel-blue eyes, and a tight small voice say, “You have.”\nNot a question. Just a pair of doubtful words.\n“Have you found her yet? No?” I glanced at the artist, and when my companion followed my gaze, I said, “I discovered fire. Did you know that?”\n“What?”\n“I was four, and I decided to cook dinner for my family. With a microwave and Ramen noodles and celery stalks. I put the food on the carousel and programmed the machine to run for twenty minutes, on high, and the fire was impressive.”\n“What you’re telling me? That you’re crazy?”\n“No, I’m admitting that I didn’t discover fire. How could I? And I certainly wasn’t the first entity to tame it. And I didn’t figure out gravity or spacetime or the evolution of life, and neither did you. Other people did those things before us, and before people were scampering about, a multitude of other creatures and worlds made the same discoveries, endlessly and often feeling like they were the holy first.”\nThe man looked down the mountainside.\n“It bothers you, I think. A little bit, a lot. You and the others in the Sagacities. You possess these enormous gifts and the key of the universe is resting in your hands. All you have to do is learn how to turn the key inside the lock. But be honest now. In your life, what discovery have you made that no other organism in the universe has made? What principle have you identified first? And what relationship should be named after you? Nothing and nothing and nothing. Those are the only honest answers.”\nI could hear him breathing, steady and deep.\n“Of course you can be the wizard who opens up the universe for humanity,” I said. “Which will be a great accomplishment. No doubts there. But doesn’t it bother you that when you look at these trillion trillion feeds, you see just the one human face? Someone already out there, and she isn’t like you at all. Is she?”\n“But we have three faces now,” he told me.\n“Working at the Museum of Sagacity. Am I right?”\nThe nod was followed by a quiet, “They seem to be, yes.”\n“I have an idea where to find Maddy,” I said. “How you utilize my insight . . . well, I don’t know that. But if I help you, then I’m owed quite a lot of consideration for whatever comes next.”\n“Consideration,” he said.\nBefore I could respond, he said, “You want to go visit your aunt.”\nI shrugged. “I do want to walk on another world. Any world. But that’s not what I’m talking about here.” Pointing to the lady standing beside the fictional cliff, I said, “She should go. Artists as accomplished as her, and more so. They should be the first people to step out into the universe. And if they want me riding along with them, fine. And they can invite you too. But they matter a lot more than either of us.”\n“Either of us,” he repeated angrily.\n“You and me,” I said. “We’re just the competent people who put the numbers where they belonged from the beginning.”\nIn the end, Maddy wasn’t especially interesting. Lovely, yes. And talking to her gave me a vivid connection to the dead in my own family. But even when we sat together, discussing important matters, much of my left-behind head was busily absorbing the sights sounds and stinks of a wondrous place, a world full of life that had nothing better to do than shamble and dance its way past my place at the table.\n“So you’re the one who found me,” she said.\nNot true. But it was safe to claim, “I was just the first to realize what kind of lie you were.”\nShe acted more amused than impressed.\n“Tell me,” she insisted.\n“The best AIs on the Earth chased you,” I said. “Old photographs and a divorce decree were found, and rental contracts, old airline records. But nobody uncovered so much as a single doodle or piece of haiku with your name attached. Which is just about the damnedest thing. Great or not, every artist leaves behind a tangle of work.”\nThat earned an interested grin and a long draw on some smoldering piece of lumber.\n“Of course maybe the Museum of Sagacity claimed your work along with you. But we recovered photographs from your childhood, from classmates and people you never knew. And in all of that, there isn’t so much as one snapshot of Maddy Furst’s work in the junior high art show. And why? Because you and your art were claimed long before that point. In fact, we think the Museum claimed you sometime just after your sixth birthday.”\nWhenever I spoke, she looked away. When I paused, she turned to stare hard at me.\nI didn’t like those eyes. Not nearly as much as I imagined I would.\n“You graduated from high school, moved to Boston, and then you married my great-uncle. But at the same time, you were living this transformative, go-anywhere life. Acting like any other person of the time, except your mind had been recast as an ageless, enduring glass. And that glass was encased inside the machine we found churning away some two hundred meters under your childhood bedroom. A machine that my bosses found and eventually deciphered, and now we’re punching them out on an assembly line. I’m the tenth person to get this honor, by the way. Telecommuting in the Infinity. Anywhere I want to go, I go. A cage of wet meat is built from local ingredients. That cage lasts as long as I want it to last. Then I’ll give a command and this carcass falls to water, absorbed in the black carpet that civilized places use to keep the mess at a minimum.”\nShe puffed and glanced my way. “That’s all it took? I didn’t leave doodles, and you deciphered the rest?”\n“Hardly,” I said. I told her about my mother’s affections for the sophisticated older woman, and years later, the compliment delivered to her cousins. After that came the notorious meeting with parents who confessed just enough to a couple angry, disbelieving kids.\n“Walter and his second wife,” I said. “You told them everything, or enough. Didn’t you?”\nShe shrugged, saying, “I fell apart on their kitchen floor. Then three minutes later, I rang their doorbell.”\nWhen she talked, I stared at the amazing world.\nHow could you not?\n“The Universal Museum of Sagacity,” I said.\n“I was selected,” she said, her voice flat and a little hard. “I was six and nobody told my parents, because why would they? They came to my room at night, installed me in the Everywhere Chamber . . . ”\n“That’s the name?” I interrupted.\n“No, that’s just a miserably poor translation.”\n“And you’re still trapped there,” I said.\nWhich made her laugh. One hand and then the other crushed the burning log, and she admitted, “In me, they see potential. And for the sake of honesty, let’s just admit that I often have some very strong doubts about ever accomplishing any shit that will mean anything in the end. To the universe, or even to me.”\n“True for us all,” I said.\nThis time she stared at me when I spoke, and afterwards, quietly, she asked, “So what do you do for a living, Colin?”\nI confessed.\n“Well, you do remind me of my Walter,” she said. “He was passionate about numbers, and I bet you are too.”\nI never thought of it that way.\n“So yes, now humanity is free to roam the universe,” she said, breaking into a smug little laugh.\nNo, I didn’t like her that much.\n“Who built the first Everywhere Chamber?” I asked.\n“Nobody knows,” Maddy said.\nI sat there for a few moments longer, wondering how this conversation would end.\nThen she said, “I guess I must have met her.”\n“Who’s that?”\n“Your mom. When she was twelve or so, at the Christmas parties.”\n“All right,” I said.\n“But I don’t remember her. Sorry.”\nI looked at Maddy one last time. And then without another word, I made myself fall back into water and gas and all those other simple ingredients that mean nothing without Us inside.\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}