{"fingerprint": "3Pc4R6tvwY745cErFgqSMTlixC0=", "sitename": "Clarkesworld Magazine", "title": "Cremulator by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_09_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cremulator by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5820 words, short story\nCremulator\nMy hometown wasn’t much, but when I was fourteen I felt as if I lived in the busy center of all things interesting. Several thousand human mouths and who knows how many human urges, and there were no secrets. Three seniors were pregnant, two by the same boy. There was a snobby couple who drove Cadillacs but couldn’t get their checks cashed anywhere in the county. It was common knowledge that our local banker shotgunned cats for sport. And in a day when this kind of behavior mattered, my English teacher happened to have a girlfriend in the city.\nOf course the young lady never discussed sexual peculiarities. Paid to teach English, that’s exactly what she did, and what made her more intriguing, at least to one fourteen-year-old boy, was that she was pretty. I also liked her name, which was Gwen, and watching her move in front of class was a small, trusted pleasure. She had a pleasant strong, but very girly voice, and I particularly liked the big glasses that seemed too much for her little nose. I didn’t have a crush. Not really. But it’s fifty years later, and I’ll find myself thinking about the day a buddy of mine tried to do a wheelie with his desk. Got the front end up and then came the crash when the desk flipped, slamming the back of his head against the floor. Our teacher bent to help him or to punish him. I don’t remember her motives. But one of the buttons had come loose on her shirt, and her padded bra pulled away at the perfect moment. That was the second or third time in my life that I ever saw a woman’s breast. It’s my “girl in the white dress” moment. You know, that line from Citizen Kane. Half a century later, and I can’t count the times that image has gotten into my head, or how many times I’ve told the story to people who truly don’t care.\nBut I’m telling a different story now.\nThis was a different day. October in 1973, and I’m sure about that because of what was happening in the world beyond. And I know it had to be Monday because our English teacher had driven back from the city the night before. She told us that much. No, girlfriends weren’t mentioned, or what she might have been doing in the city. Maybe she didn’t realize what everybody knew. But my class was her first class of the day, and Miss Gwen was worked up enough to describe driving on the highway last night when the sky above suddenly got bright and beautiful.\nThose were her words. “Bright and beautiful.”\nThere weren’t any storms last night, were they? She asked us that. A room of fourteen-year-old meteorologists. No, we couldn’t remember lightning. But war was running wild in the Middle East. I remember that detail. People on the news and adults around town were talking about us getting swept into the big fight. Which I’m guessing is why my teacher was so keyed up. Late at night, driving home in a time of war, and she saw something huge and totally unexpected.\n“It was the most beautiful blue light,” she told us.\nShe did turn cagey when we fished for details. For instance, she wouldn’t admit the exact time. But I can imagine the circumstances. Abandoning the love of her life, she was returning to the inbred community where she had to feel trapped. And then a mysterious light poured across the world. Was this the big missile attack? Were the Soviets going to kill us all? But the light lasted only a couple seconds, bright enough to be seen over the countryside and maybe farther. Did anybody else notice it? None of us did, no. But I wished I had. And after the light faded, the young teacher, so impressed or so rattled, had pulled onto the shoulder to watch the otherwise empty autumn sky.\nAnd here comes the oddest part of her story.\nStanding on the highway’s shoulder, not a cloud in the world, and little bits of grit started falling. Started hitting her. It reminded her of sleet, except there wasn’t any ice. Using a couple index cards, she managed to sweep up a sampling of her mystery, and that’s what she brought out for us to observe. To interpret.\n“I don’t believe in flying saucers,” she told us.\nI once saw this woman’s breast and now she was telling me her disbeliefs. Kids didn’t usually get that familiar with teachers.\n“Pretend this is science class,” she said. “Your eyes are probably better than mine. Pass the sack and hand lens around, okay?”\nThis seemed like a wondrous day. Everybody ahead of me saw bits of sand and busted glass—the kinds of crap on every road’s shoulder. But I was going to do better. It was my mission. So while she was trying to teach us something useful about MacBeth, I squinted harder than I ever had in my life, and I found something new, something nobody could doubt if they took a second look.\n“I see a tooth,” I said.\nThat got people giggling.\n“A chip of a tooth, at least,” I said.\nMore laughing, and then she said, “Yes,” and everyone went quiet. “That’s what I thought I was seeing too.”\nI remember everything. I was watching those big glasses and the breath going in and out of her cute nose, and better than seeing any breast, those few seconds stuck in my head. Which made everything worse later.\nIn 1975, my English teacher was riding inside her girlfriend’s car. They were driving fast on a different highway, and they had been drinking, according to those who knew. The car was alone when it left the road and rolled, and one door came open and a body was thrown free and then crushed.\nNothing else mattered in the world. Make all the noise you want about gossips and narrow-minded farmers, but everybody liked Miss Gwen. School was let out so that her students could attend the service in the city. And to see the famous girlfriend. Several people claimed that she was a graduate student in math or something like math, and I know I had ideas about what she would look like. But no, Gwen’s lady proved to be big and plain and a little fat. Bruises and guilt didn’t help her appearance either, and it was impossible to miss her, sitting to one side and alone, openly drinking from a bottle now and again. Our teacher came from a gigantic family, I learned, and none of them wanted the girlfriend close. But they made a show of weeping and holding each other, and Miss Gwen’s students filled in the back rows, crying a little or more than than a little. I gave my tears to the show. Except I couldn’t figure out one part, and I couldn’t let it go.\n“Where’s the casket?” I asked.\n“Oh, they cremated her,” a classmate whispered.\nCremation happened on the banks of Ganges. Not in our part of the world, at least not in 1975.\n“Why’s that?” I asked.\n“Because, Walt,” he said, grimly happy to know things that I didn’t know. “She got torn to pieces under the car.”\nThat hard news was absorbed with a sob and a handful of unasked questions. Including me wondering whatever happened to that white chip of a tooth that rained down on her. That chip was suddenly important to me, and I don’t know why.\nThis is what life has taught me:\nPeople are peculiar.\nA person can spend every day of his life finding examples of our spectacular oddness, and if that’s what he likes to do, then his life is destined to be full and rich.\nReagan.\nI mean, really.\nWhere did we fail so spectacularly that we deserve to have Ronald Reagan on the news every night?\nNo, I’m not talking politics. This isn’t about Republicans, or even white male assholes. And despite what people think, I’ll never waste my breath talking about the man’s intolerance to people like us. Ask Melanie. We have friends who were hoping Reagan’s son would reveal a hunger for other men. Except that is a fool’s game. If you think Ronald Reagan would change his attitudes because of one dancing child, then you live in a simple and dangerously sentimental world—a world where every opinion and policy is ready for radical revision with every first shove.\nHonestly, I would hate that kind of world.\nMelanie says I’m cold, and she likes that about me.\nShe warns me that I’m fooling people, meaning everybody except her. But that’s how I survived four years in the boondocks, teaching future farmers how to read the works of dead men and a few women.\nI love Melanie, as best I can. But I know she gets tired of me.\nI get tired of me.\nBut Reagan, yeah. What makes me angriest about our President? He comes into office, and overnight our government’s official policy is to act brazen in the face of every trivial threat. Like the Soviets, who don’t look to me as if they’ve got more than a few years of life remaining. In Reagan’s world, we have to be geared up to fight a foe that could barely feed its own people. And meanwhile, our real troubles have to be mocked. Global warming. Nuclear proliferation. Corrupt governments supported by my tax dollars and everyone’s complacency. This is the mess that one arrogant man has stirred with his cock, and we’re into the second term of this bullshit, and I’m just hoping there’s still time to save the world before we have nothing but hope remaining.\nMelanie wants me to be calmer.\nExcept the storms are inside me. Most of the time, at least in public, I’m sporting the calmest face in the room.\nShe says she mostly agrees with me. In fact, with her mind and her skills, Melanie is in an even better place to comprehend the enormous risks standing before this world.\nPeople do ask about the two of us.\nAnd I’m talking about people who hold our ideals. Gay friends have questioned things, and my family never stops asking.\nI do prefer women.\nIt’s my wiring, my constitution. Some fundamental talent of DNA coupled with a superior aesthetic.\nI don’t know what it is.\n“But why her?” my sister can’t stop wondering aloud.\n“Because,” is never an adequate answer. Except that is the answer, of course. “Because.”\n“Oh, it’s not that I don’t like your friend,” my sister constantly tells me. Which underscores how little regard she has for Melanie. And that’s before she delivers all of the usual reasons.\n“The drinking,” says my sister.\nMy “friend” has a habit, yes. I see it and I can’t really approve, and sometimes, yes, the alcohol is in control.\n“Her appearance,” my sister mentions.\n“Appearance” can mean quite a lot. But my sister isn’t talking just about the disheveled clothing and her weight. That doesn’t cut to the heart of what’s wrong. Melanie isn’t pretty enough. That’s what she and probably the rest of my family believes. My brothers, for instance. All three of them would accept a starlet, high tits and a narrow waist. Or at least they could come to terms with my nature a little easier, seeing that at the family gatherings.\n“And besides,” my sister always says. “I don’t like . . . none of us enjoy . . . how your Melanie treats you.”\n“It’s none of your business how she treats me,” I have told her.\nA statement both true and useless.\nI have mentioned that my sister’s husband is a beery brute, and maybe she should take care of her own life before charging into mine.\nThat tactic never works, but it does spice up Thanksgiving.\nOn other occasions, I’ll say nothing. The cool, unreadable Gwen can nod in a way that’s both noncommittal and only a little bit angry. Because frankly, how often can I disagree with an opinion that I myself share?\nMelanie can be difficult.\nI admit that, yes.\nIf I dialed my life back to my twentieth birthday, then maybe I would avoid her and the nearly two decades that followed. I would fall in love with somebody else. Shit, maybe I’d surrender to convention, ending up with a heavy and often drunk man and three kids, and I’d be teaching my soul out in some boondock bend in the goddamn road.\nBut then I would have missed the rest of it.\nI’m smart and always have been. And my interests are broader than most people’s interests. For example, I happen to be one of the great scientists among Literature majors, and if it comes down to it, I can do a better job describing quantum mechanics and high-energy physics than a lot of the geniuses who work with nothing else.\nMelanie taught me.\nTalk about your gifts.\nShe drinks too much. No question about it. And her hygiene could be improved. And we’ve settled into that old-dyke mentality where sex is relegated to special occasions. But sex isn’t anyone’s business, and what I get seems to be enough for me, and I don’t hear her complaining much at all. And during all these years together, the woman has never stopped giving me the most amazing tales about space and time and that truer wonder called spacetime.\nI feel fortunate.\nAnd all my lady gets from me are angry words about an old man who might kill the world but hasn’t yet and has only two years left in his second term.\nAnyway, here’s my point in this roundabout story.\nThis winter, in Chicago. Melanie and I were attending one of her conferences, some of the big people in her business talking about neutrinos and Senators with pull and that huge underground ring they were building in Texas. Physicists wanted the ring finished, but there were a lot of complaints about the billions being spent. And I might have said a few carelessly skeptical words about the venture. But no, I really wanted the ring to happen, if only because my Melanie has assured me that we would learn a lot.\nExcept that’s not quite it.\n“I’ll learn a lot, and that’s what matters.”\nShe’s an arrogant broad. In every sense of the word, and she’d be happy to hear me say it.\nChicago.\nYeah, we were at the conference. A six-inch snow made the city prettier than it deserves to be. Fermi people and their wives, and by chance, I was standing outside waiting for the bus that was supposed to shuttle us to another event. And that’s when the blue light came. Brilliant and silent at first, but then we heard the crack of what wasn’t thunder and was definitely far from normal.\nI knew that instantly.\nAnd nobody debated my ignorant assessment.\nMaybe a dozen geniuses were gawking at a sky that made no sense, listening to that long odd roar. And then every light in the city went out. Power was down across all of northern Illinois, although we didn’t know it then. Maybe half of the scientists proposed that a suborbital nuke had generated some kind of blistering pulse. Except the glow didn’t come from one point but seemed to be generated everywhere, and this was strange as hell, and what impressed me most was how excited they became, these brilliant men and that one woman who happened to be standing beside me, giggling with nervous joy at the idea of something that they couldn’t quite explain.\nWhich would have been enough, obviously.\nI couldn’t have imagined anything stranger than that.\nBut then the little bits of teeth and bone began falling on us and on millions of other people, and later came the soft ash that was never thick but easy enough to see on the fresh snow. And the scientists collected up samples along with snowballs, and a day later someone came out with the news that the ash and those tiny bits of teeth were human.\nAnd again, foolish as can be, I told myself that the story couldn’t find a stranger gear.\nGrandparents wanted to see the kids. That’s why we came back.\nMy hometown lured us in because we were tired of dealing with renters from a thousand miles away. But selling Gwen’s old house meant cleaning it up first and probably seeing a new roof put on, and I would have preferred it if my folks could have volunteered to part of that work for us. That was my secret thought. But Gwen actually said it. She isn’t normally that mouthy, but the town and her still remembered each other, and I suppose it’s always going to be that way.\nAnd there’s another reason to return: My firm was sending me overseas, probably for the next several years, and what with time distance and the vagaries of health, there was a respectable chance that one of my parents would never see our kids again.\nVagaries. Gwen dwells on little else, some days.\n“I loved this place,” she confided to me.\nWe were standing in front of her former home. The last of the renters had vanished, evicted and possibly now being pursued by various authorities. And they had left behind exactly the kind of mess you’d expect.\n“You loved this place when?” I asked.\nKnowing the possible answers.\n“When I sat on this porch. Remember?”\n“Oh yeah.”\nI was home from college and she was sitting in the shade. The English teacher with a tragic past. She was looking at me as I strolled past. I have no recollection about where I was going. Probably down to the Sinclair for a Pepsi, and it was definitely summer, just like today. It was bright and hotter than normal for morning. Not unlike now. Which I suppose is why my wife brought up that critical moment in both of our lives.\n“You said my name,” I said.\nShe laughed and said, “No.”\n“Yes.”\n“You misheard me. I’ve told you that.” She kept laughing, looking for a place to sit again. Except there were no chairs, just black plastic sacks jammed with sour food and Walmart-crap toys. So she leaned against the railing, saying, “Water.”\n“Walter,” I said.\n“ ‘I could use some water,’ I mentioned.”\n“I heard Walter.”\nSome stories never get old. We shared the laughter and I touched her on the cheek, my wife and the mother of two kids that I adored nearly as much as this bright, taciturn lady.\nAnd just like that, she gave me the look.\nWe went inside, into that house that needed to be burned more than cleaned and sold. That big worn house with the wide porch and dark deep rooms, including the bedroom upstairs, hot then and hot now. But it didn’t slow us down any, neither time. And just like that, I felt like I was twenty again, screwing my English teacher, and her taking as much pleasure as any girl I would ever know.\nMaybe other women are more passionate with their men.\nI can’t say.\nA bold and worldly fellow would have bedded a hundred women before giving up. But then again, I’m not that way.\nWe finished and dressed, and Gwen asked, “Should we rescue your parents?”\n“Someday.”\nThen we walked back out onto the porch, ready to resume our cleaning.\nA pair of locals were strolling past. Older ladies, and I knew their faces if not either name. But they absolutely recognized us. One nudged the other, and then they looked away when we started offering our eyes.\nIt pissed me off, just enough.\nI didn’t live here anymore. And I sure as hell wasn’t the twenty-year-old kid sleeping with his ex-teacher. Who was twenty-nine at the time, I could have pointed out to those fine ladies. Who was nine years my senior, do the math, and Gwen was a hundred times better than either of them were on their best days.\nMaybe I would have shouted something like that.\nBut what was a bright day suddenly turned infinitely brighter, and every piece of machinery, car and generator and working radio, stopped working. And that scorching bright blue light turned into darkness just before the pulverized bits of enamel started raining down.\nFunny the ideas that come to you.\nWe were wading through teeth and then the soft bony ash, and I was actually a little bit happy. Some incredible volcano had come to life nearby. That was my only working theory, regardless how crazy it sounded. And now the town was going to be destroyed, and we’d just been saved from that awful business of cleaning out the filthy old house.\nExcept of course pretty much everybody else in North America was suffering nearly as badly as we were.\nIt was two weeks before life began to look normal.\nAnd another two weeks before our car was cobbled back together well enough to drive. The kids were in back. The radio was filled with news about the disaster and how President Gore was making new laws, keeping order over the mayhem. And that was the first time, a month after the nightmare began, when we heard the name Dr. Melanie Baxter.\nI was driving.\nGwen cranked up the volume, listening to something about a paper written back in the 70s.\n“The late Dr. Melanie Baxter,” the voice said.\nShouting, Gwen ordered me to pull over.\nI already was.\nWe happened to be in a low spot not many miles from town. What had been several inches of ash and bone was being worked by the wind, stripped away in places and drifting deep in other places, accenting just how strange and awful the disaster had been. Experts were definite, certain, convinced. Judging by the DNA, these were human remains that had tumbled from the sky. A phenomenal mass of material, by any measure. And the blue flash was some sort of high-energy discharge, not predicted by anybody except a woman from a quarter century ago—a suddenly famous doctoral student who was killed while driving alone one night.\nDrunk, Melanie had been.\nThey didn’t mention that fact, and/or that the fatal crash happened after a fight with my wife.\nThat’s why Gwen was crying now. I assumed. The memories of quite a lot were coming back. It sounds awful, but I have always been secretly glad that Gwen’s first love was utterly lost, and the shock and guilt of that car crash was what gave me everything that I enjoyed today.\nI patted my wife’s little hand, accomplishing nothing.\n“I remember that paper,” she muttered. “She told me . . . what did she tell me . . . ?”\nI wished for a second blast of light, our car radio dying all over again.\n“About spacetime,” she said. “About things bending until they break.”\nAnd I’m thinking: “Isn’t that true for all of us?”\nHere’s the joke:\n“What’s the difference between poets and physicists?”\nAnd the punchline:\n“Poets get two more productive years than physicists get.”\nNot true, of course. Yeats lasted for decades, if I remember. And bless his heart, Einstein kept trying. Although really, if you want to be honest, how many times can one person do the impossible?\nOnce is enough for most us.\nWhich is why poets and the rest of us usually give up so soon. Being smart, we know the odds, and why waste fifty years dancing with endless failure?\nNow ask me why I drink.\nI know what you’re thinking. You’re thinking, “She’s washed up and hates herself and her failed genius and why wouldn’t she drink?”\nIs that the true story?\nOr maybe . . . maybe there’s some sad tale at work. Emotional. Human. Nothing about mathematics or the deepest structure of our universe. That would help explain the old drunk, giving her that necessary human dimension. She had a love once, someone better than she deserved, but that woman left her for some sorry, ordinary reason, or worse, for no reason in particular. That’s a tale worthy of a poet, not a professor, and hearing it, people would feel sorry for me, explaining fifty years of failure under the light of pain.\nWhy does pain produce light?\nThat’s what I want to know.\nWe need a poet to explain this conundrum. Find a poet. Ask her, “Where’s the brilliance in misery?” Because I’ve known all kinds of hurt in life, too many to count, and even during the worst days, my pain has never shown me anything but hard cold blackness.\nThe blue light.\nYeah, that bastard was plenty bright.\nNot that I saw it, of course. I was comfortably done with my day. And regardless what you think, even if I had seen the event, I wouldn’t have guessed the source. That kind of knowledge took data and huge calculations that we wouldn’t be able to make anywhere in the world, at least for another half year.\nSad to admit, I don’t possess superhuman talents ready to unleash.\nIn fact, let me tell you this: On her finest day, the finest scientist doesn’t know shit about almost everything. But that’s the fun of it. That’s why people want to be scientists. It’s the dose of adrenalin that comes when you feel as lost as can be.\nDrunk, I happily slept through the blast and the first half hour of the emergency.\nI might have slept until dead, but neighbors remembered me and broke down my front door, dragging me out into the ash before the whole building came down. I don’t know about where you lived, but we had nearly six feet of human remains dropping out of that black pain-rich sky, and half the local buildings were flattened, and I don’t know how many died.\nWithout power or any infrastructure, being a scientist was tough. But I managed to work. It was easy to see the bits of teeth, and there was the rumor that these were human remains. Someone in Atlanta or Stockholm figured that out early, and I don’t know where I heard it. But right there, that was an astonishment. One cremated human body yields about five pounds of tooth and crumbled bone. But the entire population of the world, women and men and fat children, won’t render up more than forty billion pounds of nastiness. Which is nothing. Two million tons. That isn’t enough material to fill up an old strip mine in Wyoming.\nA lot more than that fell on our heads.\nFor a full year, I lived in one refugee camp after another.\nHonestly? I’ve never been happier. No drinking, mostly. And a lot of basic shit to get done. I’ve always been good at figuring out problems, and everybody in authority wanted help with the most basic water-food-shelter conundrums. Which makes me wonder: Is this what physicists did before we solved the universe? Did we just find new ways to clean old water and make plants grow in the graveyard?\nThe important people eventually found me in New Mexico. A team flew all the way from the provisional capital in Portland. They just wanted to talk. But nobody flies that far, not anymore, and certainly not because of the need to chat. Those visitors kept calling me, “Dr. Baxter,” and thanking me for my good work here and before. But I could see where they were heading, which is why I said, “Spacetime shattered on us. Didn’t it?”\nThere were five of them, but one man did most of the talking.\n“Why do you believe that?” he asked, sounding like a cop.\n“Nothing else explains it,” I said, stating the obvious. “The event took our entire planet, which is just one planet. But for an instant of an instant, we were linked with billions of other Earths.”\nEverybody nodded in agreement.\nExcept for the man in charge. “Billions,” he repeated, acting as if he wasn’t happy with that estimate.\nSo I gave him my true numbers.\nThen I said to them, “But you already know this. Plenty of others must have done the arithmetic.”\nThe man shrugged. Maybe yes, maybe no.\n“Of course we’re not just talking about Earths,” I added. “What we’re talking about is our Earth fusing with one tiny piece of ten trillion other Earths. The same piece repeated infinitely. And judging by the evidence, I’d say that what fell on us was the remains of one person ground halfway to dust inside a cremulator.”\nNobody spoke.\nEven my main interrogator knew to hold his thoughts inside.\nSo I added to my analysis, explaining, “If you find enough DNA, tracking down the dead person would be easy enough.”\nWhich was when the woman in back—the person who was really in charge of this vital, unthinkable mission—finally spoke out.\n“Perhaps that already happened,” she said.\nAnd I laughed, right up until I noticed fear inside those various stares.\n“It’s someone from our world,” I guessed.\nEyes were focused on nobody but me.\nSo I made the obvious guess. “These are my ashes.”\nWhich was when the man laughed, saying, “That’s an arrogant attitude.”\nAnd his boss said, “No. But according to records, back in college and for several years, you knew the lady in question.”\nI rarely get to meet legends.\nDespite a reputation for combativeness, this particular legend was nothing but pleasant. And even though we’d all heard stories about failing health and a lousy sense of dress, Dr. Baxter looked fit enough to run, and her clothes hadn’t been slept in more than one brief night.\nWe met her inside her office.\nSurrounding us were a million miles of tubes and tunnels, superconductive magnets and enough energy to make the Earth jump.\nThat’s what she wanted to make happen.\nWho else in the world could have asked for permission to make the Earth jump?\nI was the least important person in the room. A career lawyer, at the end of my days, I was part of a team trying to determine the liability of the latest experiment.\n“We want to send a message to a tiny fraction of our neighboring Earths,” Dr. Baxter was saying.\nFunny how easily you accept the amazing, particularly after reading a hundred briefings on the subject.\n“We’ll use diamonds,” she said. “Tiny and very pure and marked in a variety of ways.”\n“But you’re just sending a few grams of diamonds,” someone said.\nI was listening and I wasn’t listening. There was a picture frame on the woman’s desk, faces and places changing while the debate unfolded.\n“A few grams is all we can afford,” said Melanie Baxter. “The energy required is enormous enough as it is.”\n“But how could anyone notice us?” our doubter had to ask.\n“Because,” I interrupted. Surprising myself as much as the others.\nCoaxing me with a small, grim smile, the genius said, “Please, continue.”\n“We won’t be the only people sending diamonds,” I offered. “There’s an infinite number of Earths, and some infinite slice will run the same experiment at the same time.”\n“But we’re sending diamonds to just one other Earth,” the doubter continued. “And if there are infinite targets . . . ”\n“Randomized distributions,” said the genuine expert.\nAnd the rest of us fell into a studious silence.\n“Some Earths will receive two shares, some won’t get anything at all. But a few, a very few, are going to experience ten million shares. There’ll be a visible EM display in the sky, and then the diamond grit falls and gets collected and people who look similar to us or exactly like us are going to peer into their microscopes, finding delicate messages etched in languages that might or might not resemble their own.”\nIt was a fun moment, watching every face become awestruck.\nEven Melanie’s face.\nThen I remembered another piece of the story.\n“Time,” I blurted.\n“What’s that?” the doubter asked.\n“This is all going to be random in time too,” I offered. Then I looked at the woman behind the desk, wondering if I was totally wrong.\nBut I wasn’t, no.\n“We’ve worked out the distribution curve,” she said. “Earths occupying our moment are the most likely targets, but the curve isn’t particularly steep. That’s why there’s one chance in about five trillion chances that our diamonds will end up several years before today. And there are equal odds that they’ll travel ahead in time instead.”\n“And once in a great while, they get noticed,” I said.\n“Sending messages back in time,” the doubter said, except he was sounding more intrigued by the moment. “How far back in time will we reach?”\n“This is a distribution curve applied to infinities,” Melanie said. “When dealing with a trillion quadrillion zeros, things can turn fairly strange.”\nTo the best of our abilities, each of us wrestled with that notion.\nAnd then the genius looked off at the ceiling, her heavy old face changing. I don’t know how to describe it, except to say that she was suddenly sad enough to make me ache and happy enough to make me fly. That’s what I saw in that one face, and because of that stark show of emotion, everybody else grew uncomfortable.\nOur leader decided it was time to leave.\nExcept for me. I lingered at the office door. A couple people said, “Walt,” but I ignored them. Then Melanie shut her eyes and sighed and opened her eyes, finding me watching the young face filling the picture frame on her desk.\n“I knew your wife,” I said.\nThe next smile was brighter, fending off every misery.\n“My condolences,” I said.\nShe said, “Thank you.”\nThen after a moment, “How did you know Gwen?”\n“She taught me about Shakespeare during high school.”\nMelanie laughed and said, “Think of these odds.”\nIt was fun to see the coincidences, yes.\n“She was a good teacher,” said the widow.\n“Really good,” I agreed.\n“Six months gone, and it feels like zero time has passed,” she confided. Then she suddenly rose, saying, “Funerals.”\n“Excuse me?”\n“Gwen’s ceremony didn’t satisfy me,” Melanie confessed. “And I’ve been thinking about what else to do.”\nI nodded.\nThe woman leaned against her desk, lost in endless thought.\nNeeding something to break the silence, I said, “Yeah, Gwen was an excellent teacher.”\nThe woman looked at me for the final time.\n“Tell me about your class,” she said.\nWhat came to mind was spellbinding, but I couldn’t share that. So instead, I smiled in a wistful way, saying, “A friend of mine was playing around and then spilled his desk in class. And she instantly helped him.”\nAnother nod, and the eyes dropped.\n“No,” she said. “My Gwen would have kicked his ass for screwing around. And that’s the woman I loved.”\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}