{"fingerprint": "f+d9NFf+eefKq8wSe5Jjgi0wuzc=", "sitename": "Clarkesworld Magazine", "title": "Nameless He by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_08_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Nameless He by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8960 words, novelette\nNameless He\n1\nThere was no stepping inside until his caution was disabled.\nSo that was what he did to himself.\nThen, unburdened by worry, he made himself quite narrow in order to pass through what only pretended to be a conventional fuel line.\nQuality minds had studied the spherical artifact, but always from respectful distances. The reigning consensus was that he would find a frigid vacuum, and locked at its center, a primordial black hole. Which would be a delightful discovery, if true. Yet that possibility had been forgotten. In addition to abandoning caution, he had also purged his mind of every expectation, making him an innocent ready to embrace whatever was to come.\nA volume that felt infinite.\nInfinity jammed full of withering compressions of time and data.\nAnd inside that boundless relentless everywhere.\nMayhem.\nUndiluted.\nImpossible.\nMagnificent.\nLike any sphere, there was just one wall, but this was an unruly wall, bending everywhere at once before somehow twisting back on itself. Being exceptionally smart, he entertained some very serious contemplations about hidden dimensions, scalar fields, swarms of virtual particles, and complex numbers refusing to diverge. Although maybe he wasn’t smart enough. Drifting deeper into the unknowable, he realized that he was becoming lost. So no, maybe he was just a fool—one very grim possibility that couldn’t be discarded. Worst still, every sensation was wrong. Cold and hot didn’t exist here. Indeed, what passed for his fingers couldn’t decide what they were feeling and couldn’t offer guesses as to why they were so painfully confused. Color was another conundrum. EM frequencies were discrete, precise phenomena, and he had little patience for sloppy generalizations such as “orange” or “high ultraviolet.” Yet while the wall seemed to be radiating in every frequency, he saw nothing but a specific ginger gray—a shade so vivid and lovely that he felt blessed to have just this glimpse. Which was the last reaction he expected from himself, and with that, his conflicting, ever-shifting mind began drifting toward panic.\nMadness was a wondrous shock.\nHe promptly composed a note to himself:\n“Before the next time, if there is a next time, adjust your nature. Kill the childish wonder, magnify the skeptical and the sober.”\nBut would those qualities help with his work?\nHe went hunting for confidence, and finding none, quickly surrendered the note to his internal trash. And then, staring at the beautiful ginger gray, he finally recalled why he had come to this place.\n“She wants my first impression,” he said.\nHis first impression would be the same as his last: he would never experience anything so amazing as this infinite room.\nThe human was waiting where he had left her. Aasleen was a captain serving the Great Ship, and she always began their conversations by asking, “Have you settled on a name for yourself?”\nShe was teasing him. Names were heavy possessions, full of expectation and boundaries, and he had explained these feelings in the past.\n“The artifact is lovely,” was what he said.\n“‘Lovely,’” she repeated. “Not a word I expect from you.”\nYes, indeed. He was surprised to hear it rising from his many mouths.\nUncertain how to respond, he said nothing.\nAasleen deployed her own silence.\nStudying her, he noted a distracted attitude about her face and her posture. Captains wore endless responsibilities along with the mirrored uniform. This was a very high-ranking captain who had to monitor vital projects, oversee underlings, and all while working to make submasters and the Master Captain happy. And most important of all, Aasleen was responsible for the well-being of the Great Ship—an ancient, world-sized starship that was long ago found wandering empty between the galaxies.\nAssumptions were lazy guesses. But they were also inevitable, and if used properly, they could make a task easier.\nAasleen cared intensely about the artifact: that was his present assumption, and he clung to it tightly.\nAfter a few moments, he said, “Thank you.”\nA bright smile filled her face. “Thank you for what?”\n“This challenge.”\n“You are welcome.”\n“My existence.”\n“I didn’t build you,” she said.\n“You modified me. In profound ways, it seems.”\n“My work makes you grateful?”\n“Yes. Very.”\n“My work” began with Aasleen gathering up an army of mature AI savants. The artifact had been discovered, a special research project was underway, and after explaining costs and blessings, she asked for help. Perhaps he was first to volunteer, or out of a thousand eager souls, he was deemed to be the most fit or the most expendable. On these matters, he had no opinion. The work began by scraping away all of his memories and every habit. His oldest recollection was of Aasleen taking hold of him. She had offered a few words, but it wasn’t until later, when he learned language again, that he realized what she had told him.\n“Before pretending to be a Ship captain,” she said, “I was a rather talented engineer.”\nAasleen was a genius with machines, and that genius was what restructured everything about him. His mind and physical capacities were magnified, obscure alien technologies were grafted into his framework, and this was what he became: a singular machine not only infused with heightened talents, but also wearing the freedom and resources to tweak his nature again, however he wished.\n“So,” said Aasleen. “Tell me about your lovely artifact.”\nHe began with numbers, glorious numbers, while what passed for hands vibrated in the air, trying to embellish what he had seen, had touched, and in the most profound ways, what he had felt.\nEventually she said, “Stop.”\nHe couldn’t. Not instantly, and that lack of self-control troubled him.\nBut not Aasleen. She waited for the numbers and gyrations to end, and then, with a patient, slightly pitiful tone, she said, “Let’s go look at the beauty together.”\nShe walked and he followed, passing through hatches and demon doors before entering a workshop filled with simple types of light. A bubble of vacuum was suspended from the ceiling, and dangling inside the bubble was the corpse of a streakship. Or at least that was what it seemed to be. This was a partial corpse including two hyperfiber fuel tanks, each sphere three kilometers in diameter. One tank was empty, punctured at multiple points—presumably by relativistic impacts with deep space debris. But while the other tank was identical in size and construction, its surface was intact. Unblemished, mirror bright. Even the traces of cosmic radiation that streakships always endured were missing. That pristine shine was one of several compelling reasons why this flotsam, whatever it was, had been recognized as being wonderfully odd.\nThe rest of the original ship was lost. Crew quarters and hyperfiber shields, cargo holds and the fusion engines themselves—they were rumors waiting beyond the severed conduits, severed wiring, and mangled lengths of structural gemstones. Also lost was the ship’s original mission and course. Drifting at half light speed, it was passing through the galactic plane when it was discovered—after what might or might not have been a billion-year voyage from regions unknown.\nPerhaps this streakship once carried a rich machine soul. That was an idea worth considering, even though it made him quite sad.\nThe wreck’s discovery and recovery were interesting topics. But for now, all that mattered was following Aasleen into the vacuum. Glass stairs ended at the fuel line. Not many years ago, human hands had grabbed hold of that hyperfiber pipe, which was when a hidden capacitor discharged, abruptly, violently cutting both of those hands free.\nIn death, the hands still clung to the junction.\n“Why did she leave them here?” he asked.\n“She didn’t need them anymore,” said Aasleen.\nThe pragmatic answer. An engineer’s answer. Humans were immortal biological machines, and all but the most grievous damage was easily fixed.\nBut then Aasleen offered a second reason.\n“And as a warning to anyone who comes too close.” Her tone implied informed conjecture. A well-aimed guess. Aasleen knew the woman in question, at least enough to anticipate some portion of her mind.\nThe sentient machine didn’t know anyone well enough to achieve that trick.\nIncluding when talking about himself.\n“Freedom,” he said.\n“Yes?”\n“That’s your most generous gift for me. I’m free of the past and unburdened by timetables.”\n“You’re welcome, you’re welcome,” Aasleen said. “But if you really want to thank me, tell me what this artifact’s meant to do. Not immediately, and maybe not for a century or two. But as soon as you can, share your insights. Or even better, write the guidebook for using this peculiar apparatus.”\n“I will do all of that,” he said. “Or I’ll fail in places, or fail everywhere.”\nWhat other answer was possible?\nHe was dwelling on that puzzle when Aasleen said, “I’ll visit again in ten years. Unless you call out to me first, that is.”\n“The Intrigue,” he said.\n“What’s that?”\n“You like names. That’s the name I’ve chosen.”\n“For you, or for the wreckage?”\n“For the artifact,” he said.\nShe nodded.\n“But of course, we’re both wreckage,” he said. As a joke.\nThen he laughed and she quickly joined in, proving they were colleagues and perhaps friends too. And then, after some words of encouragement, the immortal human left the secure bunker where the AI first became conscious, and where, if his assumptions proved true, he would live out his grand good life.\n2\nWith every second, the Great Ship crossed another hundred thousand kilometers of vacuum and dust. Maneuvering was problematic, braking impossible. Hyperfiber armor helped protect the invaluable machine. Banks of mammoth lasers did the same. Yet most of the credit went to a multitude of eyes. Mirrors scattered across the spherical hull were able to peer across the light years, spotting the blackest cinder. Once seen, narrowly talented AIs used their own eyes, wringing free vectors, likely masses and compositions. The faintest hint of artificiality triggered another species of dedicated machines. Was this a starship, a deep space colony, or something rarer? News of functioning starships were sent to the captains’ eyes. Could these wandering strangers ever reach the Great Ship? And if so, would they make profitable additions to the ranks of immortal, exceptionally wealthy passengers?\nThe Intrigue was first tagged as a damaged streakship with zero chance of colliding with the Great Ship. Silent to the universe but perhaps worth salvage, its existence was offered to the usual markets. But the target was moving perpendicular to the shipping lanes, and no salvage team was willing to spend fuel and the years to make any kind of recovery.\nMere came to the story after that.\nA Ship officer blessed with a singular biography, she was only a fetus when her mother and the crew of a streakship were killed in a deep space collision. She was the lone survivor inside the mangled ship, cared for with every inadequate tool at the ship’s disposal. This was why Mere grew up stunted for nutrition and education, socialization and joy. But not only did she survive those miseries, she eventually made planetfall, and after being adopted by aliens, endured another several thousand years before reaching her original target: the Great Ship.\nIn her present life, Mere was an exobiologist with an understandable passion for abandoned streakships. To find them, an AI associate did nothing but scan the newest star charts, pulling out the best candidates. This particular wreck deserved special mention. Its slashing path through the Milky Way meant that it could be a visitor, an intergalactic wanderer. Gazing back along its present vector, the AI determined the most likely starting point was a remote spiral galaxy known for laser beacons—life signs distorted by distance and time, yet hauntingly beautiful nonetheless.\nThis AI began his work with Mere’s research. Absorbing every word, every data point, he took copious notes that he always set aside before erasing the experience, rebuilding his innocence, and then beginning again. And after a thousand efforts, he wove his notes into an intricate summation.\nMere borrowed various telescopes and linked them together, creating a single giant eye to give her that first hard look. But the relic wasn’t as unusual as she had hoped. Indeed, a local species, the Countereaters, built streakships with the same configuration and materials. Maybe this was a mission to deep space, its crew killed by extragalactic tragedies, and some conspiracy of gravity wells had recently brought it back inside the Milky Way. That wouldn’t leave much of a mystery, would it?\nBut that hypothesis didn’t explain those mismatched fuel tanks, which was why Mere broadened her search.\nEvery starship docking on the Great Ship had to share its logs. Unfortunately no recent travelers had noticed the wreck, and no registered vessel had ever approached it, even by accident. But then her AI colleague discovered an automated tug that recently passed within a few billion kilometers of the dead streakship. Mere shouted out for help. Several years passed, and then the AI captain responded: Yes. On several occasions, on a semi-regular basis, she heard weak, unintelligible chatter. Listening to the recordings, Mere heard a dead language tied to the Bakers—an ancient, long-extinct species who were famous for building the most amazing, enduring machines ever conceived.\n“I am here. I am ready.”\nThat was the best available translation.\nThis was enough to earn Aasleen’s full cooperation. A large streakship was retrofitted and fueled. At maximum acceleration, Mere’s tiny skeleton was shattered, recovering only when her velocity matched her target’s velocity. But hopes of finding a Baker relic gave way to a collection of scraps assembled by what could have been a recent, very ordinary species. The Intrigue still didn’t exist. Mere was approaching a thoroughly depleted ruin. But she was approaching too quickly, which was when she realized that the mass of a respectable moon was somehow shoved inside the peculiar fuel tank.\nAn electrically charged black hole held in place by charged hyperfiber scaffolds: that’s what neutrino scans and hammer taps promised. But knowing more meant better facilities and more appropriate geniuses. The prize needed to be secured inside one of her streakship’s much larger, thoroughly emptied fuel tanks. Mere was doing routine chores when she grabbed the conduit with both hands. The only warning of trouble was a white flash that removed her hands at the wrists. Then a creature who had endured much, much worse drifted backward, and while waiting for fresh hands to grow, she reconsidered everything she thought she had known about this piece of ruined machinery.\nWhat if there was a black hole on board? And what if that gravitational monster escaped while Mere was approaching the Great Ship?\nA resident AI was given total authority. At the first sign of a breach or malicious act, her streakship would change course, aiming for the emptiest regions of space. Dooming itself as well as its one human crew member.\nYet, thankfully, the journey home was utterly routine.\nBut just the idea of secret dangers . . . that fragrant notion had consequences. On a thousand occasions, taking his careful notes, he had used different words to pose the same questions:\n“What is the Intrigue’s true age?\n“What is its purpose?\n“What if it did originate in another galaxy?\n“And what if its builders, astonishing as they must have been, threw the Intrigue out of their realm? Not as a blessing for the universe, no. But in a desperate bid to protect their guilty souls?”\n3\nHome was a purpose-built bunker wrapped inside Faraday cages, hyperfiber sleeves, and vacuum. Its location had never been mentioned to him, but so much was obvious. The subdued local gravity meant he was buried far beneath the hull and every inhabited region. Furthermore, whenever the Ship’s vast engines fired, the acceleration struck him sideways. So he was under the equator, the same as Great Ship’s fuel tanks—six moon-sized orbs aligned with precision around a core of impenetrable iron and stone.\nWith every decision, the captains had to safeguard the Great Ship. That’s why they’d never place a high-density mass inside the metallic hydrogen fuel. The easy and obvious location was an adjacent mixing chamber—one of the vast hyperfiber caverns where pressurized fuel was always waiting on the other side of the valves. If the artifact broke containment, frigid hydrogen could freeze it in place. And if it grew wings and tried to fly, a ferocious stream of gas could push it thousands of kilometers, depositing it inside one of the Ship’s engines. And if it still insisted on acting like a threat, then the engine would light, plasma flinging the hazard back into the void.\nPinpointing which chamber this was would be an easy chore, likely requiring nothing but the equipment on hand. Yet he set that temptation aside. Because he was strong. Because he was loyal to Aasleen and loyal to her trust. But mostly because more interesting, far more vital work was waiting, and that’s why his rebellion didn’t move beyond the sweet hypothetical.\nInside the bunker was a machine shop rivaling the best on board the Great Ship. He also possessed every species of effervescent knowledge: histories of lost races, research into exotic materials, starship schematics, treatises about cosmology and mathematics—the accepted schools as well as every renegade idea. But even those resources weren’t adequate. That’s why a secretive procurement system was in place, and within that first year the nameless AI had ordered up many one of a kind sensors, stacks of more powerful reactors, plus raw materials by the ton and by the gram—all to feed his increasingly sophisticated investigations.\nBy and large, every effort led to frustration and fresh puzzles. Which was never the same as disappointment. The surest way to the truth was to narrow the distractions to the richest few avenues, and after a decade spent doing else, he had reached what felt like a critical moment.\nIn his fashion, he stood at attention, and waited.\nThe captain hadn’t visited since their walk to the artifact, and as promised, she hadn’t distracted him with questions or praise. But Aasleen would arrive in the next little while. Today, perhaps. Definitely within the month. That’s why he was so still and so happy. Enthusiasm was a very useful impulse. Again and again, he practiced what he would tell her, guessing how she would react, and then he would speak again, adding details about a project that was constantly growing more impenetrable, more lush, and undeniably perfect.\nHe was born to do this work.\n“Thank you again, madam. For this life of wonder, bless you.”\nThat’s how his lecture would begin.\nA few conclusions were ready to be admired. There was a massive machine waiting inside the bright fuel tank—a machine completely dissimilar from every other known device. He was quite certain about that. Something massive was roiling at its center, but with multiple structures reaching to within micrometers of the hyperfiber shell. Wielding equations and hands, he intended to describe a fractal built from myriad spheres, all nested within its globular mother. The Apollonian sphere was a very reasonable model. Except this infinite machine was more complicated than that, and despite his talents and Aasleen’s generous resources, he’d barely made progress into mapping these quixotic realms.\nAbout the machine’s composition, there was exactly one viable candidate. The highest grades of the hyperfiber were lightweight and stubborn, their resilience stolen from the hyperfiber existing inside myriad alternate universes. But there was even more impressive material: ultimate hyperfiber. It existed as theory and as tiny samples found scattered about the galaxy. How was ultimate hyperfiber built? Antimatter hammers and black hole anvils were envisioned, accompanied by some very careful pounding. Pushing the purest, highest grades of armor into denser configurations was essential, insulted bonds shortened while their strength increased, and the result was a product as dense as a neutron star, but more durable.\nAnd if that material could be shaped with precision . . . ?\nHypotheses and some peculiarly fascinating mathematics might lead to epiphanies.\nAasleen would interrogate the AI about all of this. And for the fun of it, he imagined her voice and her skepticism wrapped inside thousands of reasonable inquiries.\nIn every scenario, he was the sober expert calmly guiding her to his present work and outlooks for the future. And because he was disciplined, every lecture ended with the same possibility: he was growing comfortable with the possibility that the Intrigue wasn’t just inside one false fuel tank. The true machine was the complete wreck, unsuspected systems and capacities wearing more than enough camouflage to fool the cleverest humans as well as most AIs.\nWhich, of course, was exactly what would be expected from entities who built marvels from ultimate hyperfiber.\n“So I have much more work to do,” he said.\nIn his mind.\nAnd with various mouths.\nAlways speaking to Aasleen, yes.\nExcept she still didn’t arrive today, and another seventy days of conscientious hope didn’t produce her either. Which was why he finally risked interrupting the captain’s critical work, reaching for her on their secure, never-used channel.\n“I have found wonders,” he called out.\nBut the only response offered from Aasleen was centuries upon centuries of rigid, unexplained silence.\n4\nHonestly measured, passengers were the least consequential portion of any streakship. One rather tiny bioceramic brain made the human, and if she insisted on traveling in some self-aware state, then salted water, muscle, bone, and grease were woven around a respectable assemblage of biomachinery. Living, respiring passengers preferred cabins and an atmosphere, making for a far more massive vessel burrowing its way through the universe. The hyperfiber prow and comet-killing lasers were essential protection, while weapons, life support, and every other ship system had to be fed by redundant reactors. Add a wide stern jammed with engines and nozzles—power enough to accelerate that vivid mass to relativistic speeds. Yet even then, only half of the streakship existed. Only half. Because fusion engines were thirsty monsters, and even the smallest streakship required rivers of fuel. Hydrogen, mostly. Stored under extraordinary pressures, often in the metallic state.\nLook at a streakship with innocent eyes, and the easy, reasonable assumption was that the machine loved its fuel more than anything else.\nHe was stretched between the two fuel tanks. One or both of these spheres once could have served as hydrogen reservoirs. On that topic, he held every opinion; with the same open-minded spirit, he believed every assessment about his chances for success today. This particular moment was rich with confidence. Grasping hands were connecting hundreds of leads. Diagnostic tools were calibrating themselves, with a tokamak ready to apply variable power loads. Here was the most reliable pleasure: routine actions built on calculation and guesswork, hope and disappointment. The guesswork might seem chaotically pointless, but progress was being made. He understood more now than he understood an hour ago, and in another hour, without doubt, he would become an even greater master in this arcane, one-entity profession.\nThese tanks once held pure hydrogen, or they never did.\nThey were bought as scrap and retrofitted, or inventive hands manufactured them for entirely different purposes.\nWriting their history might be interesting work. But for others, not him. What mattered was the massive puzzle filled with ultimate hyperfiber, while its mate pretended to be emptiness brought from the depths of intergalactic space. It wasn’t an accident that these spheres were perfect opposites. He accepted that one insight more than he believed anything else. And when he spliced the spheres together, in the proper manner, some fabulous new mystery was certain to emerge.\nYet success remained the most unlikely scenario. There were thousands of severed conduits, pipes and electrical lines that could be knitted together in endless configurations, and that’s without considering hardware and power. Every easy, obvious choice had already failed. Regret and despair: those were the only reliable results. Weak entities would have given up by now. Others would be waiting to grab any excuse to surrender. Yet he pressed on. Nobody was better at applying habit before intuition, relishing the rituals, making himself stubborn and joyous every moment of every day.\nThis next test would be pivotal.\n“I am certain,” he promised himself.\nAs he always did.\nSensors announced full calibration and eagerness, while the tokamak procured just last year started to push current into a twisted mass of electricals. The immediate result was a small, lovely harmonic. Which had happened before, though never quite this soon. So he eased more power into the system, and more, and those linked spheres began to vibrate—a reaction observed only forty thousand and ninety-nine times before today.\nHope retreated, letting Doubt do its work.\nThe massive tank might be perfect as it was. But that didn’t matter if its mate was a battered shell badly needing to be healed. Maybe this failure would convince him to change tactics. Maybe in another hour, he would start patching the impact craters, patching the fractures, and then begin polishing out the radiation tracks too.\nPushing those options aside, he embraced the empty tank. With eyes and with fingers, and then a single busy finger slipped inside one of the larger craters.\nFuel tanks for streakships were always crafted from nested balls of hyperfiber. This particular tank sported two distinct layers, and between them, a narrow gap always filled with a near-perfect vacuum.\nUntil now.\nThe tanks began shaking faster than ever, and from nothingness, a force field roared into existence.\n“Demon walls.”\nThat’s what humans called barriers like this.\nExcept that demons weren’t involved, of course, and these fields were usually far weaker than any load-bearing wall.\nYet these phenomena proved to be something else. Sharp and vicious, the field happened everywhere and inside the same moment. A diamond fingertip was lost, and a brilliant surprise was won. Then with the power levels surging beyond what his little reactor could provide, he began to laugh.\nThe energy source? Critical but not obvious, and that narrow question had to be set aside.\nCharting what had never happened before . . . that’s all that mattered now. Sensors were mapping events that wouldn’t end today or for ages to come. Apparently on its own initiative, the tokamak dropped into a diagnostic mode. Which may or may not have caused the two mighty spheres to shiver even harder. For barely nine seconds, they vibrated so rapidly and violently that they would have blurred in a human’s slow eye. Then the gemstone housings crumbled, and like magnets, like lovers, they flung themselves together.\nThree-kilometer balls merged at a point smaller than one human palm.\nThen inside the next moment, the battered tank healed every wound, the hyperfiber rendered as bright as the day of its birth.\nWhat had no name stared at his own distorted reflection.\n“Spellbound” was a weak word for what he felt.\nHe was so happy that he forgot to celebrate. And all he could say was, “My. My oh my.”\n5\nA voice called out.\n“You have a visitor,” it claimed.\nAasleen always had a different voice, and the “visitor” had arrived without sharing warnings or a name—strong reasons to presume that this wouldn’t be the missing, much-loved captain.\n“Welcome,” was the polite response. Then he added, “Wait patiently, if you can.”\nDisengaging from his work involved time and considerable care. Seconds. Minutes. More than an hour, in the end. Considering the interruption and the lack of manners, he prepared a variety of mild reprimands. But finally emerging from the Intrigue, he discovered the Master Captain waiting impatiently, wearing a decidedly angry face.\n“I want my captains,” she said.\n“I don’t understand,” he confessed.\n“Aasleen and the others. They’ve gone missing.”\n“About Aasleen, I agree.” He counted the decades since he’d seen his associate. “About your other officers, I am sorry. I can offer you nothing but my ignorance and empathy.”\nThe Master Captain wasn’t physically present. A sensory drone had slipped inside the facility, and this was a projection. Yet the experience was intimidating all the same. A towering figure swollen by the constellations of implanted nexuses, here stood the only entity capable of steering the Great Ship, and more than anyone else, she had the power to influence crew and passengers alike.\nIt was an honor to meet the creature, yet he kept wishing she would leave.\n“No, I don’t think they’re hiding here,” she said.\n“I don’t believe so either, madam.”\n“Of course I might be wrong.”\n“Both of us might be,” he offered amiably.\nThe lack of latency was interesting: the Master Captain was physically close. No more than fifty kilometers from this spot, by his measure.\nShared silence ended with the question, “Do you want my help?”\nSurprise claimed the globoid face. “Your help?”\n“I assume that’s why you’ve come here.” He had every intention of sounding proud. “I have skills. Not for the tasks you need, perhaps. But I can acquire new strengths, and with time—”\n“No. Thank you.”\nEmbarrassment was interesting. The next moments were spent letting a new emotion rule his nature.\nThen she said, “You’re doing interesting work here.”\n“Thank you. I am.” His mood shifted. “What do you know about my work?”\n“The essentials.”\nEverything was essential. “What do you mean, madam?”\nWhen stressed, the false face became more convincing, more alive. “Oh, I know quite a lot about Aasleen’s machines. That two-orbed peculiarity, and you too.” A fat human hand gestured at him. “There are dozens if not thousands of unique technologies inside that peculiarity, and my research bureau would love me if I was to drop it into their laps . . . ”\nEmbarrassment proved to be a soft emotion. Facing this would-be thief, anger blossomed, bright and clear.\n“You don’t have my resources,” he said.\n“If I took everything that’s here, I would.”\nDid his appearance grow more vivid with stress? He hoped so.\nThen she said, “Except I don’t have time or the need. So I won’t do that.”\nRelief blossomed.\nShe said, “I came to meet with you directly, and to give you fair warning. Your access to the outside will be restricted. Effective immediately.”\nThe Master Captain proved her honesty. The supply and communication avenues were being closed down now. Suffocated, extinguished.\n“And too, I wanted to see for myself if my captains had been hiding here all along.” The giant woman laughed with force but little joy. “Aasleen isn’t lurking inside one of those balls, is she?”\n“I don’t know how that could be possible, madam.”\n“Ultimate hyperfiber.”\n“Yes, madam.”\n“The perfect medium for data storage,” she said.\n“That’s one of its potential uses. Yes.”\n“The archival densities . . . at least in theory . . . ” The Master Captain hesitated, then said, “I’m looking at your reports right now.”\n“Of course, madam.”\n“It’s just a lot of emptiness in there. You claim.”\n“I would be searching now, but my work has been interrupted.” He rather liked this voice of his. Brittle. Injured.\n“Nothing but vacant storage, unutilized hardware,” she said.\n“And no living beings,” he added.\nShe said the word, “Interesting.”\nHe allowed himself one substantial guess. The Master Captain was a creature who feared novel propositions. Which was entirely sensible, considering her career. Her station. Wearing vast responsibilities, she didn’t dare risk distractions from the remarkable and the odd.\n“I call it the Intrigue,” he said.\nShe said, “Yes. I know.”\n“I have no name for myself.”\nHer mouth opened and froze.\nHe waited.\nPerhaps she was speaking with invisible others.\nHe waited a long while, then interrupted her work. “The Intrigue is quite enormous, madam. There could be galaxies of data hiding inside the next chamber, waiting to be found.”\n“Well,” she said, “you’re welcome to keep hunting.”\n“Without external resources.”\n“It’s necessary, isolating this place. I don’t want to have to come back here again, wondering if my captains slipped in here while I was blinking.”\nCourage was necessary, and he summoned more than enough. “If I may ask, how many of your officers are missing?”\n“Hundreds,” she said.\nIt was a startling admission.\n“So many of your best,” he said. “That baffles me. How does the Master Captain lose track of so many?”\nHis visitor had a harsh stare aimed at the nearest pieces of him. Yet this was a moment shared just by the two of them. The spirit of confession took hold, and she said, “Obviously, I’m not entirely excellent at my job.”\nAnd with that, she disappeared.\n6\nThe work continued.\nGathering supplies from beyond the Faraday cages was impossible, so existing stockpiles had to serve multiple roles. Materials were rationed, and where possible, recycled. Finished machines, the ordinary as well as the exotic, were used sparingly. In special circumstances, they were dismantled to create parts that waited to be cobbled together, becoming fresh innovations that, in turn, deserved to be babied.\nEvery moment was busy, but since fresh minds did better work, he often coaxed portions of himself to rest. To sleep, after a fashion. Dreams were welcome, but always following pleasant narratives sure to linger when he woke. And when insights were especially scarce, he would abuse his highest functions, achieving states where hallucinations dominated. Those experiments led to few revelations, but those doses of insanity proved valuable later, when he had to absorb the odd revelations that kept boiling out from the Intrigue.\nFrom the beginning, he had collected oceans of data, keeping them safeguarded inside superconductive servers. With a nanosecond’s effort, he could drink from everything that was known about ultimate hyperfiber and its less spectacular siblings. Every accepted theory, principle, and philosophical truth about the cosmos was eager to explain itself to him, whenever he wished. He could and often did throw selected ideas into contests with one another—a universal war already billions of years old and still without a winner. (It was unnerving that the Creation and its mother, the multiverse, were far too stubborn or too incoherent to be fully explained.) The Great Ship’s official star chart was a staggeringly huge file, including past alignments of every celestial body, every projected future motion, as well as accounts of the known species, intelligent and otherwise. And all of that data was dwarfed by official records about the Ship’s known layout, its crew and passengers, plus diaries and published histories and fictional works, along with images and videos culled from sources both public and deeply private.\nWhy keep these final prizes? Because he had the power and the will to do just that, at least in the early decades. Because doing so was very, very easy. If an authority pressed for explanations, he would reply by asking, “Do you know which passenger’s most average day contains the fulcrum clue . . . that miniscule event that explains the Intrigue?” No lucid mind could give an answer, of course. But the blunt truth was that he simply found it all so appealing, possessing a virtual Great Ship, then stowing inside a bottle belonging to Nameless He.\nAnd of all the possessions, what was the most treasured?\nThe mathematics.\nSo critical were numbers and their relationships that he carried the entire subject inside himself. These were the guiding principles built by ancient Bakers and ancient Greeks. In addition, he was an expert with all kinds of numerological systems devised by living species, by dead species, and by AIs built for no purpose but to test the boundaries of hardened belief. There was even a pair of hyperfiber cysts that had arrived inside a long-ago shipment of machine parts. Their origin was another mystery, but when inserted into his mind, each gladly offered up conjectures that had always been useless. Which was why he kept them close, and when nothing else was succeeding, he let them whisper their nonsense all over again.\nAgainst these relentless labors, the Intrigue remained unimpressed. There were little events that might resemble success, if he let them. And that had to be enough for a long while. Then a pair of triumphs arrived, and not even a century apart. Which was heartening, yes. And all of the slow progress was done, and he was given a spectacular decade when rich new options seemed to fall at his myriad feet.\nThe Intrigue had control mechanisms always waiting to be found.\nBetter yet, the levers and buttons seemed happy to be mastered, at least well enough to accomplish a few new wonders.\nStanding inside his workshop, Nameless He built what could only be described as children’s toys. Simple. Predictable. Fun.\nEach of these delights was powered by wandering photons.\nThen he duplicated them by the billions, as data. And gathering them up, he slipped inside a tiny sphere of ultimate hyperfiber, and under a light that resembled no existing star, he cast all of that vivid data into what was only pretending to be bright, bright water.\n7\nA single investigation was underway. There was nothing else to be done until there were outcomes and joy, or outcomes and despair.\n“Nothing else” meant inactivity across his body and through vast portions of his mind. It meant cold darkness everywhere, and a counting of seconds. Days. Decades. Eventually, he reached the moment when his investigation was halfway complete. Perhaps. More seconds and days followed. Most of a full decade. Then the silence ended with a shudder and the hiss of hatches opening and closing again, resealing. Demon doors were pierced without complaint. A body of unfamiliar proportions was leaving the invisible world outside, and Nameless He roused himself inside the next second, asking, “Who are you?”\n“Look at me, and guess,” said the visitor.\nHis available rosters were dated. But he found a narrow human face tied to the name, “Miocene.”\nHe said the name.\nShe said, “Yes.”\nHer mirrored uniform offered much more. “Your insignia, your epaulets. Am I right to assume that you’re the Master Captain?”\n“I am.”\n“You were the First Chair before this.”\nMiocene was always tall and thin, but her flesh had acquired an unexpected shade. Deploying sensors, he found curiosities and questions, particularly in the odor that clung to her—fragrant markers implying a strict diet of alien flesh.\n“You were one of the missing captains,” he guessed.\n“I was never missing,” she said, her tone sharp, yet amused.\nHe liked Miocene. Instantly, without doubts.\n“Where’s your predecessor?” he asked.\n“Stuffed inside a suitable drawer,” she said.\nThose unexpected words wrung a long laugh out of him.\nMiocene had brought companions. Drones tied to remote AIs scampered out of a satchel riding on her hip, and flying where they were told to fly, they surrounded Nameless He.\n“The Intrigue is more interesting,” he claimed.\nThe human offered silence and a doubting tilt of the head.\nScans were made. Then a security system came alive, and he was suddenly powerless. It was amazing and embarrassing, being so frail. When Aasleen built him, she must have created a backdoor, presumably to regain control of a broken or traitorous AI. Through that door, a sequence of dense emotions entered his mind, and only afterward did he realize that the hatred, fear, and every surge of love were tools. Emotions were chisels used to gain access over a soul that was nearly as invisible to him as it was to the new Master Captain.\nOnce he could speak again, he asked, “Am I trustworthy?”\nMiocene smiled. “You might be the first ever. I’ll concede that.”\nHe returned to his library, studying accounts of every captain. Miocene and Aasleen, and many others too.\n“I’m entitled to my concerns,” she continued. “You’re a talented entity left alone here, sharing your existence with a mysterious, presumably powerful alien contraption. Quite a lot has been accomplished. At least that’s how it looks in your reports. I see successes, and I see what you’re trying to do now. In time, I hope to open your facility to the outside again. Soon, maybe. But before that happens, I need a level of comfort. Your investigations of the Intrigue might be what’s happening here. But the Intrigue could be investigating you too. Or, perhaps, it’s doing quite a lot more than research.”\nHe said nothing.\n“Now don’t those seem like responsible worries?”\nHe said, “Yes.”\nAnd, “No.”\nThen after hard contemplation, he said, “I’m worried about me too.”\n“Good. Perhaps that’s all I want from you now.”\nThe drones returned to her, and with that, those long legs carried the Great Ship’s leader out the way she had come.\n“You will visit again,” he said hopefully.\n“Soon,” she promised.\nBut unfortunately, he would never see Miocene again.\n8\nThe project had already claimed more of his mind than it rationally deserved, as well as resources and far more years than he had ever intended. Yet the results—self-centered and contrived—became the great delight of his intense little life.\nFirst, he immersed himself inside the Great Ship’s data, focusing on every human face, every name and truncated biography, including who was related to whom, and in the broadest strokes, how they moved and spoke and what they did in public and whatever he could see of their private lives. From that magnificence, he selected one married couple. Why them? Because they appeared to be in love. Because they were dissimilar people, yet their relationship was ancient and stable, and happy. Because few humans enjoyed wealth and adventure as much as they enjoyed it. Because the woman was pretty, and the man was pretty too, and obviously they would make lovely children. Except they were childless, at least so far as this distant AI could see, and that absence was another reason to take Quee Lee and Perri as his subjects.\nHe gave them a son. The boy’s lovely face and strong immortal body were drawn with data, with a date of birth not too recent but not deep in the past either. Plus a name. Humans insisted on names, and what he devised was massive and useless and lovely. From there, he added details to a biography that he always intended to finish today. Except the work refused to be done, and that was another unsolvable mystery: when did a Creator stop describing his subject’s years and moments, urges and failures? It was a trap, this responsibility for making one man real, and Nameless He finally had no choice but to accept his limitations.\n“I am done,” he declared, moving to the next stage.\nThe Intrigue waited, as always. Its control systems were partly native, mostly provisional, and never comfortably familiar. That was one of the odd joys about this machine. Every visit felt like the first. Even though he knew what to touch and what words to use, it was as if others had done this work before. Older siblings and parents and ancestors from a billion years ago. But not him. Such a peculiar sensation, and it made him smile, after a fashion.\n“Agenda?” asked the Intrigue.\n“A visit,” he said.\n“Destination?”\n“Where I always go.”\nYet nothing about this visit was typical. His intentions were more ambitious, including the new body wearing a voice as well as the mirrored uniform of a high-ranking Ship captain.\nFive intense hours were spent making ready for the next tiny step.\nThe beautiful gray wall embraced him, and passing through a pinprick hole, he enjoyed a long walk on new legs. What pretended to be glass stairs led him down to what wasn’t an ocean, under a sun that made his new eyes blind with pain.\nWhat wasn’t an atmosphere filled his lungs.\nTo everything, he said, “Hello.”\nIn multiple languages, a trillion mouths said, “Hello,” to him.\n“Who are you?” they asked.\nHe began with that wondrously long name. Then he added, “I’m a captain of the Great Ship, and I’m here to offer you friendship and cooperation, from now until the End of All.”\n9\nMiocene visited and then left him, and not long after, Aasleen returned.\n“Nameless He,” was what she called him.\nThat had been his de facto name for some while now. In his official updates, and in his thoughts about himself too.\nAasleen was accompanied by strangers. One tall woman wore the First Chair’s uniform. He wanted to be polite, and polite meant opening many hands while saying, “Madam Washen. It is an honor to welcome you into my home.”\n“The honor is entirely mine,” she said.\nThe next captain was a human male—the first man that Nameless He had ever seen—and he was a particularly homely fellow at that.\n“You are Pamir. Am I right?”\n“Or you’re a lucky guesser,” said the visitor.\nThe host laughed. Humans appreciated laughter, particularly when their jokes fell short. Then with that courtesy finished, he said, “You vanished, sir. Long before I was built, you lost your command, lost your name. But my impression is that you must have remained on board the Great Ship. Hiding.”\n“Did you spot me in the security logs?” Pamir asked.\n“I didn’t, but I never bothered trying to either. Sir.”\n“So where’s this insight come from?”\n“I had a project, and to help my research, I studied all of the captains. You were particularly interesting, sir. Your career, your multiple skills, and your basic nature. My intuition is that yes, you would always remain on board. Because you would never abandon this vessel.”\n“Not willingly, I wouldn’t,” Pamir said.\n“Well, I’m glad to be right, sir.”\n“Glad to be your role model.”\nNameless He laughed again. Then for honesty’s sake, he added, “No, sir. I’m sorry if you heard any praise. Because I consider your career to be a rather significant disaster.”\nThe humans laughed, Pamir leading the chorus.\nThen the host turned to the tiny lady. “Mere. I have your hands, if you want them returned.”\nThe exobiologist was impressed. “Still enjoying their death grip, are they?”\n“No, madam. They were in my way and had to be removed. But I fabricated a rather handsome coffin, and they’re waiting for you.”\n“That’s gracious of you. I’ll take them.”\n“Good,” he said. “That makes me happy.”\nHe was studying his guests, including the distorted reflections inside the twin spheres. To Aasleen, he said, “I am so very curious, madam. Where have you been?”\nThe captain stepped up. Fingers touched some of his fingers, and she began with an apology. “I’m so sorry, my friend. I was ordered to another world, marooned there for centuries, and returning to you was simply impossible.”\nDeploying the enormous star chart, Nameless He asked what should have been an easy question. “Which world is it, madam? Please tell me.”\n“Marrow,” she said.\nHe saw no object bearing that name.\nAnd then all of his guests were talking. Which was a perfectly acceptable way to address AIs of his caliber. After all, he could follow a multitude of overlapping voices, and it should be easy to distill their explanations and passion into a respectably coherent account.\nThe trouble was that their words were ridiculous.\nAll of his hands lifted, begging for silence.\n“‘An entire world hiding at the Great Ship’s core,’” he quoted.\nPerhaps someone would tell him, “You have misunderstood us. You must be an idiot.”\nUnfortunately, nobody insulted him, and nobody denied the insanity.\nThe fantastical story continued: lost captains, a civilization built on fire and iron, children born without any sun, and then a tower rising from the iron, bringing Miocene back to the Great Ship.\nHe interrupted, saying, “She was the Master Captain. At least while she stood here with me.”\n“And for a little while longer than that,” said Washen.\nThe First Chair looked quite sad.\nNameless He built lists of respectable questions, but his guests insisted on talking. They described Marrow as a Martian-sized body composed of metal and air, impossible buttresses and black foliage, plus pseudo-insects unrelated to every other known lifeform. And amidst the splendor, there was a malicious voice or force that had urged the children into rebellion. This was a very painful story for Washen and Aasleen, but not so much for the failed captain or Mere. The famous tower was built. Miocene conquered the Great Ship, and then she lost it again. And she died. The original Master Captain had returned to her station, except Washen seemed to wield most of the power, and the host listened carefully to every spoken word. But only because it was such an easy chore. His interests were far away when the three captains and Mere fell into a busy silence—the natural state of humans who were possessed by ageless, overwhelmed brains.\nHe let them have their quiet.\nThen, when he was finished being polite, he said, “You are wrong, wrong, wrong.”\nAasleen asked, “Why is that?”\n“The Intrigue.” In case anyone should forget, he pointed at the treasure dangling overhead. “The Intrigue is infinitely more interesting than any world or Master Captain. It’s certainly more important than your ugly Marrow. And frankly, I’m warming up to the opinion that none of you are smart enough or special enough to understand what I know.”\nThere. That earned cutting stares.\nThen Aasleen stepped closer to him, and when he felt a finger against one hand, the supply avenues opened up to him again.\n“I’ve studied your reports,” she promised. “You might be right about the Intrigue. I won’t deny that. But I want to see everything for myself. Find the means to carry me inside this world you’ve built. Can you do that?”\n“I can or cannot,” he admitted.\n“The only reasonable answer,” she allowed.\nMuch more was said, the day filled with questions and partial answers, and then, grand promises of returning visits.\nThe others left, but at least Aasleen returned. Every year, she came to check on his miserable progress. Opening a doorway wide enough to allow a human inside the Intrigue . . . that would require the most extraordinary magic. “Because you’re enormous,” he explained. “Not physically, but as data. One hundred thousand years of life experience bottled inside a bioceramic brain. That’s what needs to be replicated. And that’s the conundrum.”\n“The Intrigue relishes data,” she pointed out. “Pick a sphere adjacent to your world, then reformat it to handle the load.”\n“Yes, I’m attempting every obvious strategy.” That was his prickly response. Then he added, “There’s an equally apparent work-around.”\n“Which is?”\n“Send a child in your place. Newborn and simple.”\n“If there’s no other way,” she said.\nYear after year, Aasleen walked into the bunker, smiling at the Intrigue before she smiled at him. Then he would talk about the possibilities that he was chasing, proving his value as well as his failures, and then she would leave him alone. Which was how he preferred to be.\nOne day, he belatedly thanked her for telling him about Marrow.\n“You’re welcome, and why?” she said.\n“Because,” he said. “Marrow shows me what’s genuinely possible in this universe.”\n“What is possible?” Aasleen asked.\nHe offered the most obvious scenario.\nShe grimaced, arms crossed on her chest. “No,” she said. “I can’t believe we’re just numbers swimming through numbers.”\nHe had said quite a lot more than that. But there was no winning the argument. Engineers and captains shared the same failure: they fell in love with one principle, one kind of machine, and every other invention was less good, less true.\nHe stopped talking.\n“Keep working,” she urged.\n“I will.” As if he had any choice in the matter.\nThen as she left once again, Aasleen gave him an offhanded warning. “We’re going to be passing through some rough space,” she said. “I won’t be able to give you my full focus, if you happen to call out to me.”\n“Thank you for the warning, madam. Good day.”\nNot long after that, the Great Ship was battered. Not a single strike, but thousands of massive impacts. His connections with the outside were severed once again. And some days later, the gigantic starship began to accelerate like never before—but apparently without using any of its existing engines.\nVarious explanations offered their madness.\nOf course he called out to Aasleen. To anyone. He begged the universe for the opportunity to help.\nNo one responded.\nWhich was, after everything, exactly as it should be.\n10\nThis new silence was different from every other silence. He sensed it. Entirely on his own, freed of every duty, pledge, and calling, he carefully disabled the fail-safe systems hiding inside him. The bunker’s security gave him more of a battle, but he won that after just a few busy years, and then for the first and final time in his life, Nameless He climbed outside his home.\nCenturies ago, he had mapped his location to the millimeter. The mixing chamber was an unlit labyrinth offering conduits to every other chamber as well as each of the Great Ship’s engines. Moving such a massive facility would take extraordinary efforts. But Nameless He had the intelligence and the focus, as well as the hoarded machinery and mountains of raw materials. So he selected a new hiding place, and seventy years later he successfully put the bunker on his back, ready to embark.\nBut before that, he intended to leave behind a simple handwritten message. For Aasleen, perhaps. Or whoever else might come looking for the Intrigue.\nHis intention was to explain what the Great Ship was, what Marrow was, and how very careful everyone needed to be.\nBut when the mind was ready, the hand refused.\nHe was staring at the Intrigue, staring at himself, when a whispering voice said, “Hurry. Hide. And leave nothing behind.”\nIt was his voice, or another’s. Both interpretations felt valid, the advice felt wise . . . and after picking up everything with meaning, the nameless soul quickly slipped away into the smothering dark . . .\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}