{"fingerprint": "BjE7tl+d7cYw+a7UnWrAEXFA+20=", "sitename": "Clarkesworld Magazine", "title": "Conversations in the Dark by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_12_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Conversations in the Dark by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "13920 words, novelette\nConversations in the Dark\n1\nAn absence of visible light: that was the first goal and easily accomplished. But true darkness—profound; enduring; seamless—meant excluding the rest of the electromagnetic spectrum, or masking it, or otherwise rendering it inconsequential. Windowless walls, ceiling, and floor were built from plates of radiologically stable graphene. Hyperfiber boxes and long reaches of frigid vacuum further isolated the chamber, while multiple faraday cages killed the influx of long-wave radiation. And the little dribbles that seeped past those barricades were artfully poisoned with a stew of EM antinoise, creating a faint gray Nothing.\nAll this was a worthwhile beginning.\nBut echolocation couldn’t be allowed. Or touching surfaces, since subtle vibrations might give the occupant clues about the interrogators. To solve those challenges, perfluorocarbon was mixed with synthetic bloods inspired by cetacean-class aliens. The result was a blackish fluid, where density and thermal properties could be adjusted as needed. Set adrift, the creature would be steered to the center of the chamber and made to hover in place. If oxygen was necessary for life, the gas would be dissolved in the perfluorocarbon and then delivered to the lungs or gills or an intricately folded rectum. To maintain the metabolism, wide varieties of foodstuffs could be synthesized on-site, then injected. There would be no flavor, no joy. In effect, they wanted to build the most elaborate sensory deprivation chamber in human history.\nYet grand accomplishments meant little if outside eyes could observe the facility. And layers of camouflage, inert as well as active, would accomplish only so much. That’s why obscure, hard-to-reach locations were identified, then rejected. The logic was that potential adversaries would build similar lists, and that’s why every obvious candidate had to be avoided.\nLowering the benchmarks. That was the only workable answer.\n“Smarter to do the unexpected,” was the more hopeful logic.\nA billion subpar hiding locations were put into a common pool, the final choice made by random means.\nNext, purpose-built drones began construction, which was finished in a mere thirty years.\nFrom outside, there was nothing to see but a pillar of structural hyperfiber, unblemished and as old as the Great Ship.\nWhile inside, pure perfect darkness waited.\n2\nVoussoir and her squad were walking the F’Tar District. The populace was mostly KillarTwos, nocturnal as well as instinctively allergic to authority, which was why the bright midday avenues were largely empty. Boredom was the enemy today, and being experienced soldiers, the eight of them cherished the drudgery while hoping for something bright and violent around the next bend.\nWhat came for them were encrypted commands from the high echelons. The squad was to disarm itself immediately, disable every nexus and blind the sensors woven into their uniforms, then climb inside a waiting cap-car.\nThe subsequent journey should have proved quick, except random turns and security portals meant that a full hour passed, and that’s why the squad napped in shifts, four at a time.\nVoussoir woke up male.\nThis seq-herm’s shifting of sex began in adolescence, one hundred and six centuries ago, and not once had that celebration of potential repeated itself precisely. Body mass was constant, minus what was lost to satisfy the fierce metabolic demands. But the face always shifted features around the appealingly androgynous template. Height varied a little or quite a lot, while muscle and fat shifted proportions and placement. And though the skin was a constant blue-black, the scalp grew a different crop of hair ranging from snow to anthracite, downy fine to bristly thick.\nThis day’s transformation proved exceptionally lean, powerful, and swift. And because instinct occasionally shaped the next body, Voussoir tugged at the new blonde curls, joking about how he must be getting ready for war.\nThe squad laughed with their lieutenant while silently battling superstitions.\nThe cap-car finally arrived at its berth inside a secure garage, opening up to reveal, of all people, the head of Ship Security. Marshall G was a robust figure, stern mannered but loved by his soldiers for not being the considerable asshole that his predecessor had been. He had a square face and a pale purple cast to the skin, one natural eye that saw quite a lot, while the augmented eye was rumored to peer deep into his soldiers’ souls.\nG stared only at the lieutenant.\nSalutes were offered and roundly ignored, as were quizzical gazes and a thousand obvious questions floating silently about them. Then the moment was done, and both the black uniform and the purple man turned and walked away, no words worth saying to lowly troops.\nVoussoir and his squad marched behind their superior. The garage was part of an expansive field station that felt new, yet was neglected by names or a posted location. Pulses of radiation kept pouring through their bodies, searching . . . for what? Guarded hatches led deeper into a sequence of nested faraday structures, and then this crazed security culminated with a final sealed chamber where no guard stood.\nTouching the last door, Marshall G stepped back again.\n“Not us,” he said. “Just you.”\nVoussoir, he meant.\nOne last glance was offered to his comrades. “Better you than me,” was what the familiar faces said to him. Then that warrior’s body summoned the courage to take the next few steps.\nThe room beyond smelled of smoke, which was entirely reasonable, lit as it was by a few dozen tall wax candles. Several Submasters were seated in a row, while the infamous First Chair, Miocene, stood before them. Everything about the scene was surprising, borderline crazy, and would the lords of the Great Ship mind if Voussoir burst into laughter? He was ready to out-and-out giggle. But then he noticed the bulky object to his left, and turning just his head, he saw the Master Captain stretched out on a mattress. Sleeping, by the looks of it. Unless she was dead.\nBut no, those ancient lungs were breathing just fine.\nAll at once, Voussoir wished he was even stronger and faster. As if that might help with whatever was about to transpire.\n“Where you are,” Miocene began.\nThen she paused.\nVoussoir took a stance that could be held for days. Feet apart, forearms horizontal at the waist, elbows cradled by the opposite hands.\nThere was a barracks joke where the First Chair began existence as an old-fashioned surgical knife, but then an evil doctor made the knife live, though neglecting to add kindness or any passion. That’s why Miocene looked like she did, narrow-faced and ready to cut. That’s why every member of the Ship’s crew feared her gaze or the sound of their names riding her voice. Yet in that curious human manner, people often craved attention from the Great Ship’s immortal second-in-command.\n“The Vermiculate,” said Miocene.\n“That’s where we are,” Voussoir presumed.\n“Do you know it?”\n“Never been stationed here, madam. But I’ve hiked a few rooms while on leave. Desiccated, dark, unpopulated. And huge. With all its twists and cubbies, no other labyrinth inside the Great Ship is half as complicated. Or so I understand.”\nWhile Voussoir spoke, Miocene offered nods. Then as soon as he stopped, she asked, “Are you aware? Several belief systems claim that the Vermiculate isn’t just a random mess of spongelike stone and hyperfiber. Some local minds insist on believing that these knotted up tunnels and odd rooms create an alien text. A topological language is at work here, and if you can look at the Vermiculate in the proper manner, clarity waits beyond the randomness. Deep meanings want to be found inside the chaos. At least that’s what the enthusiasts promise.”\n“I’ve heard the claims,” he said. “But I don’t believe any of it, madam.”\n“No?”\n“Metaphysical thunder,” he said, laughing scornfully. But that wasn’t enough of a dismissal. “It’s my basic policy, madam. Respect no voice that lacks the courage to step up and make itself heard clearly.”\nThat wrung laughter out of the First Chair. “A fair point,” she conceded, glancing at the slumbering bulk warmed by candlelight.\n“I assume the Master is healthy, madam.”\n“Our subject is the Vermiculate,” Miocene replied. Then she stared at the soldier, black eyes catching the dancing candle fires. “Officially, this region was successfully mapped, as was the rest of the Great Ship, and that happened at the very beginning. Self-cloning scouts crawled through every entranceway, memorizing surfaces while probing hidden chambers. Wherever a tunnel split, they reproduced. Bodies grew smaller but the army became ever larger, fifty generations relentlessly sharing data with one another. Nothing was missed here, certainly nothing of consequence, and that’s why we remained confident. But as I’ve mentioned, certain passengers and a few gullible crew members regard this grotto as a mystery. A challenge. Then add to the chorus some persistent AI voices who live for no reason but to distract the Master with unlikely unpalatables.”\nMiocene paused, stepping closer to Voussoir. “Of course, the unlikely does love to become real, at least now and again. For example, some recently massaged data convinced our mapmakers that a miniscule portion of the Vermiculate had evaded detection. Some intriguing factors suggest why this had happened. But you don’t need to know the reasons. The critical point is that a tiny problem existed, and to cure it, I ordered advanced, highly competent scouts set into motion.\n“Most returned with news about little rooms, all empty. But one scout managed to lose its way—an astonishing development for a device designed for no purpose but cartography.\n“In the end, disgusted engineers recovered the machine and tore it apart. And nothing was wrong. Not physically, not with its resident software. No, the only oddity was its failed job, and too, a foreign item found inside the machine’s body, placed there by unknown hands.\n“There’s no good reason to share the technical peculiarities with you. A thorough briefing would take far too much time. All you need to know is this: inside the machine, we found a babble-pocket of an entirely unfamiliar design. Despite multiple attempts, the pocket refused to open for us. But it helpfully explained itself. ‘I have words for the Master Captain,’ it claimed. The voice was human, male, and it used the Ship’s standard tongue. ‘I demand an audience with the Master Captain.’ And that’s why after considerable analysis and several layers of additional security, I personally carried the troublemaker to the Master, and she said to it, ‘I’m here, now tell me what’s so important.’\n“The same voice that spoke to us spoke to the Captain. But instead of ship standard, it used an archaic, entirely unexpected language.”\nAnd with that, Miocene fell silent.\n“Madam,” said Voussoir.\nToday’s voice was rumbling and slow.\n“Yes, Lieutenant?”\n“This is ridiculously interesting. But I fail to see why we’re here, madam.”\nHis tone was assertive and prickly, and in other circumstances that might earn a reflexive dressing down from superiors. But Miocene was one the rulers of the Great Ship. To her, everyone else was tiny, complaints were harmless noise, and Voussoir felt protected by his utter lack of station.\n“You’ve been ordered here,” she said, “because the Master has been invited to meet with someone. Or nobody will be waiting for her, and a joke is being played on us. Either way, a small chamber waits half a kilometer from us. To our knowledge, the chamber has never been physically entered. Not by humans or our scouts, or any other species or machines. But we have studied the site from a distance. Nothing is inside it, and we have zero evidence that any creature will appear there. Yet the Master has been summoned, and in the best spirit possible, the Master will make her appearance.”\n“My squad supplies security,” Voussoir said doubtfully.\n“If guards had been invited, she’d bring women and men already known to her. But no, the babble-pocket had instructions to share. Nobody but the Master Captain will be welcome.”\nOnce more, Voussoir looked at the sleeping woman. An enormous human, physically as well through her considerable reach, her rounded body held fleets of nexuses, each one of those sophisticated machines constantly absorbing data and churning out instructions. Which made her a target to all of the Ship’s enemies, naturally, and that’s why she had to be protected at all costs.\nVoussoir was far from an expert in this rarified paranoia, but one response was obvious.\n“Someone has built an obvious trap,” he stated. “So why the hell bother?”\n“Let me reiterate,” Miocene said. “The chamber and its surroundings have been studied. Sonics. Gamma blades. Neutrino pulses and gravimetric maps. If an entity waits there, we cannot see it. And if it hides that well, it could be anywhere else. For instance, standing between us right now, invisible and wickedly amused.”\nEver so slightly, Voussoir flinched.\n“Multiple precautions are in place,” Miocene promised. “We’re ready to abuse but never entirely break the terms of this meeting. For example, the rest of your squad will be armed with kinetics and shock weapons, and they’ll escort the captains’ captain to her destination, deploying in depth. The chamber has a single entrance. Unless a second tunnel hides, but let’s ignore that impossibility. Your squad’s assignment will be simple. Should anyone other than the Master follow them into the hole or try to escape from the hole, they will maim the creature without killing it, or they’ll die trying to halt its progress.”\nA silent moment passed.\nThen the long back straightened even more than normal, and with appealing certainty, Miocene said, “Everything is unknown, including the specific hazards. But this day may help the Great Ship, perhaps in some essential, unexpected way, and that’s why the mission is necessary.”\nThe other Submasters climbed to their feet.\nBefore all of those gods of authority, Lieutenant Voussoir bowed deeply. Then to the First Chair, he said, “My apologies, madam. But I don’t understand.”\n“What confounds you, my boy?”\n“My squad guards the doorway, but what am I to do?”\nDisappointment arrived with a sigh and a slow shake of the face. Then Miocene walked over the sleeping Master, and with one captain’s boot, she kicked that huge belly.\nUntroubled, the carcass continued breathing.\n“Oh shit,” Voussoir said. “Oh goddamn shit.”\n3\nWhile the babble-pocket and Master spoke, Marshall G stood at a respectful distance. His presence had been deemed crucial, but not for security concerns, since the captains already had every tool and instinct available to their warriors. No, as the ranking security officer, G served as one more precaution and a very generous nod to tradition. The Great Ship had always been a civilian vessel. That was why mirrored uniforms would forever outrank black uniforms. The Marshall’s office was reserved for those who had served the Master with quiet distinction, and the symbolic honor rarely lasted more than five or six centuries.\nG had been briefed about the plan to remap the Vermiculate, and later, when the babble-pocket was discovered, the Submasters included him in the investigations, inviting insights and recommendations.\nAfter which they acted exactly as they wanted to act all along.\n“I am here,” the Master Captain declared. “Now tell me what’s so important.”\nThe babble-pocket had a pleasantly masculine voice—one detail that may or may not have been calculated to win over the ancient lady. But instead of using the Ship’s standard tongue, as before, it employed obscure, long-dead human phonetics: Khoisan from southern Africa, with modifications to allow for modern terminology. Clicks and pops came from what pretended to be a human tongue and human throat, and a linguistic AI fed translations to the wary audience.\n“Ah, the grand mistress of us all,” the little machine began. Then it laughed in the most impolite way, the tone neither comforting nor friendly.\nWhen the laughter ceased, the voice returned.\n“I am here to tell you about some grave dangers thriving under your foolish toes.”\nIn the standard tongue, the Master said, “My toes are interested in whatever you have to share.”\nThe babble-pocket responded with a story about Pcici traders smuggling antimatter slivers. Captains and Marshall G knew about the situation, but the mechanical informant added several helpful details, including the present whereabouts of the operation’s leader.\nThe Marshall dispatched troops to the dragnet.\nNoticing those orders, Miocene said nothing to G, thus giving her full blessing.\n“Thank you for that news,” the Master was saying. Then with a put-upon tone, she added, “How many more hazards are there?”\n“Two that I am free to mention,” it promised.\nFirst came tales of a multispecies cult that was plotting to hijack a district and form its own nation. Captains and Security alike were disgusted, and combing reconnaissance logs, Miocene found enough evidence to order the Marshall to prepare strike forces.\nThrough two nexuses, G gave the go-aheads for a micro-war while also insulting certain talents inside his Intelligence services.\n“Make up for this blunder,” he demanded from his trip wires. “Find me ten more plots. By tomorrow.”\nThen the third hazard was offered, which proved much, much worse than the others. An AI savant had secretly gone mad, broken its safeguards, and its genius was now planning the murder of every other savant serving the captains’ ranks.\nThe Master interrupted.\n“I don’t believe you.”\nBabble-pockets were far more than audio files. Reactive and astute, this device giggled as it said, “But you do believe me. Being human, you have no other choice but accept every word that is absorbed, and only afterward, if you remember to, will you unleash your doubts.”\nGlancing at her First Chair, the Master said, “Let me examine this trouble.”\n“You will find it valid. But yes, grand mistress. I will wait here while appropriate inquiries are made.”\nInquiries led to incontrovertible evidence. Yet this unfolding disaster was aimed at the captains, and no one considered the Marshall’s help. On an encrypted river, Miocene called to a captain who had been one of the Ship’s sterling engineers, giving her authority and nearly infinite resources. G’s only role was to help search for signs that the disembodied voice might have been involved in any these schemes. But nothing was found. The Ship was already full of smugglers and cults, and dangerous AIs certainly didn’t need any help from simple babble-pockets.\nIn prudence, G advised Miocene to pause the interview for a day or a few years.\nThe First Chair listened to him or ignored him. Either way, she nodded to the Master, the gesture meaning, “Go on.”\n“All right,” said the captains’ captain. “Continue.”\n“But I have so little left to share,” it said. “There is just one more hazard, a fourth treachery that is infinitely larger than any sabotage or genocide. But I can’t share any of the specifics.”\n“Why not?”\n“Because I know nothing.” The mocking laugh returned. “He who made me made me ignorant.”\n“You said, ‘Infinitely larger,’” the Master quoted.\n“The foe is that, yes.”\n“So you’re assuming that much. And maybe you hold an intuition or instinct about what this means.”\nThe pocket made agreeable sounds.\n“What I assume,” it said, “is that the Great Ship is the warning’s subject. My intuition thinks that after all these years of criminal ignorance, you are about to see your vast machine with new eyes. And most importantly, instinct keeps insisting that you need to hear why your species controls the most valuable property in the universe.”\nOver the last few centuries, Marshall G had spent much time with the Master Captain, and his impression was that few creatures were more immune to surprise or less likely to act impressed than she was.\nYet at that point, the Master sighed. Shivered. Then she seemingly misplaced her voice.\n“Much needs to be learned,” said the pocket. “But you gain these lessons only if you, the present ruler of the Great Ship, can make yourself walk into a specific hole. Which is here.”\nA precise location was delivered.\nAnd detailed instructions about what was permitted and what was forbidden.\nAfter which, the babble-pocket never spoke again.\nMarshall G never agreed to this mysterious meeting. He spoke against it at the outset, in every available public way. “The captains’ captain remains on the bridge, and we send an AI facsimile,” he proposed to the Submasters. “Or one of you goes in her place. Or we melt the Vermiculate and bottle up the slag wreckage. Though the best solution, I’d argue, is ignoring, denying, forgetting, and moving on.”\n“Perhaps you should be the one to meet our mysterious informant,” Miocene mentioned.\n“If ordered, I’ll go,” he replied.\nAn obvious bluff, and it served its purpose. Public debates were declared finished. The First Chair and the Master spoke privately to one another—a never-ending conversation already a thousand centuries old. Then that vast, ancient, and often wise mind uttered the command it always intended to give.\n“I will go into that empty room and say ‘Hello,’” she declared.\nMost of the Submasters squirmed with pain.\nOnly Miocene smiled. Then turning, focusing on the Marshall, she said, “But we have a work-around. There’s another possibility . . . that I neglected to mention to you, somehow . . . ”\n4\nChanging gender took no time. Everyone born into the Family of Perpetual Renewal had that talent. Restructuring the body was much more involved and expensive, but then again, modern tissues were immortal, and with energy reserves and its native powers of healing, the healthy body could do considerable work in just twenty furious minutes.\nAmong the first human passengers to board the Great Ship, the Family of Perpetual Renewal were committed to spreading their goodness across the Milky Way. But terraforming worlds required wealth and sacrifice, and when those blessings were exhausted, the Family lost their calling and quit living together as organized communities. Many customs died, but “Voussoir” was a name still bestowed to every generation. This particular Voussoir was born in an obscure district. Childhood was full of concessions and tempered aspirations, but the poverty wasn’t nearly enough to make anyone bitter. Home was only forty rooms, but they were comfortable rooms. Human mouths were scarce along the local avenues, and that was why this Voussoir grew up accustomed to alien bodies and biologies, including a mating ensemble of Jick’ick’mee—half a hundred bipeds with little money, no significance to the Ship, and a history of intraspecies violence.\nVoussoir was still a genderless child when they saw their first corpse. The victim—a Jick’ick’mee male—had died inside an alcove where the young human often built forts and starships. Voussoir discovered the corpse but didn’t understand what they had found. They were that young, that ridiculously innocent. Because the fellow was lying on his back, breathing slowly, he had to be asleep or enjoying a drugged state. The neighbor most certainly looked the same as he did just yesterday. Jick’ick’mee were beautiful creatures, orange fur tipped with snow, long faces and long eyes and voices that sang best in their own language, which they preferred over the Ship’s standard tongue.\nVoussoir often played alone, but this day had delivered a companion who didn’t care what the human child did or said, and that was a blessing. All morning, Voussoir pretended they were the captain of a streakship and the alien was their crew. Orders were given. Intricate scenarios were built on top of one another. Not one but several attacks were made against the streakship, but Voussoir and their loyal crew fended off a sequence of fierce, poorly defined enemies.\nEventually their father came looking for them.\nFather was a woman that day.\nShe began by asking, “What are you two doing?”\nThen in the middle of the explanation, she called out the man’s name.\nBut sleep was too precious, it seemed. Their beautiful neighbor left his eyes closed, refusing to wake.\nFather kneeled, and for the third time in Voussoir’s brief, amazing life, they saw one of their parents praying.\nThat alone was reason to ask, “What’s wrong, my ancestor?”\nHow to explain murder to a child? That was a question asked behind sad eyes. Then the day’s voice told a lie. “Your friend isn’t here, Voussoir. Someone stole away his mind, as a joke.”\nExcept this wasn’t a theft or joke. An illegal plasma torch had vaporized flesh and skull and the bioceramic machinery inside, after which the immortal body did its best to heal the wound, producing an empty but otherwise flawless head. But parents were to be believed, and that’s why the child accepted the explanation. Several confusing, embarrassing days passed before they finally learned the truth, and that was one of many reasons why Voussoir despised anyone who hid behind soft words and hopeful lies.\nModern human minds were built on a nearly universal template, their perfection delivering relentless memories that could reach across ten thousand years.\nThe grown security officer stared at the Master Captain’s body, muttering, “Oh shit. Oh goddamn shit.”\nAnticipating one train of thought, Miocene said, “But this isn’t Her. The Master Captain is healthy and whole.”\nIn other words, “I haven’t murdered my superior, and you’re not entangled in mutiny.”\nBut even so, the situation was extraordinary. Stealing away the Master Captain’s mind meant disabling or fooling every native security system, and that was just the first hurdle. Outside eyes couldn’t notice the work occurring, and presumably that’s why the carcass was still full of busy nexuses spitting out commands. What’s more, the intricate work had to be finished quickly, with only a tiny few people in-the-know.\nOf course if anyone could manage that impossible task, it was the Master’s loyal First Chair.\nVoussoir knelt. The sleeping face was exactly like the Master’s old face. Minus personality, presence, or even the beginnings of a voice.\nSubmasters gathered behind him, no doubt trading opinions through shielded nexuses.\n“Timetable?” Voussoir asked.\nMiocene offered several hours for the surgery and minimal adjustments.\n“You’re assuming I’ll respond better than most,” the lieutenant guessed. “Since I change bodies daily and all.”\n“One positive trait among several, yes,” Miocene said.\n“What else?”\n“Your natural voice is blunt. Rather like hers.”\nVoussoir rose and turned, very slightly bowing to his superiors. “And you noticed this when, madam? A few days ago?”\n“No, there’s always been a stand-in scenario, and you topped the candidate list several thousand years ago.”\nVoussoir managed a tight laugh.\n“One duty of the First Chair,” said Miocene, “is to make ready for the unlikely, the barely imaginable.”\nAnother glance at the empty carcass seemed like enough.\nThen staring at the chamber’s gray ceiling, Voussoir asked, “Does Marshall G know what you’re planning?”\n“Yes. But no one else in Security.”\nOf course not. Captains trusted captains with their secrets, and almost nobody else. “If this is a trap, and there’s an assassination attempt, I’ll likely be dead in another few hours.”\n“Almost certainly so.”\nNo, Miocene never softened her messages.\nVoussoir bowed low, and with honest respect, she said. “No more talking, madam. Bring in an autodoc, and let’s get the hacking done.”\n5\nVoussoir had been swallowed up by candlelight, and turning to the rest of the squad, Marshall G gave explicit orders: they would never speak about this place or this day, and that included casual words shared between one another. Rare punishments were promised, obscure laws quoted, face and voice delivering the news with a rich mixture of duty and disgust. Then with that necessary housekeeping finished, the briefing finally began.\nExcept what they were told proved so slender, so totally inadequate, that every soldier asked, “Who the hell is telling this joke?”\nThey asked the question with offended faces, offended stances, the doubled-up fists. But never words.\nOn its surface, the assignment couldn’t have been simpler. Their lieutenant wasn’t here because he had a separate job, undefined, but the easy assumption put Voussoir inside a secure bunker, watching over them with extra ordnance. Which was a soothing image. Without their lieutenant, the rest would take posts inside a very ordinary passageway, watching the most important creature on the Ship march out of sight. After that, some alien or ghost or nothing at all would speak to the old lady. Every soldier took “nothing” as the only viable option. The mysterious chamber had never been seen or touched, but that didn’t make it invisible. Exceptional sensors had surrounded the pit and found nobody lurking inside, and that had to be the truth. Otherwise a soldier’s imagination might lead to monsters—organic creatures, untethered AIs, or some wicked hybrid of the two. Imagination was a tireless enemy. Imagination invited distraction and surprise, and suppose that every sensor was wrong. Suppose a physical entity lurked inside that nameless hole. Then when trouble comes, the soldier reacts with useless expectations, slowing her reaction times.\nEvery soldier wore battle armor with cannons on hips, and towing sensors and camouflage arrays, they assembled before a freshly constructed hatchway. Then they waited, and waited. The notoriously punctual Master arrived several minutes late, and not only that, she seemed peculiarly distracted.\nWithout Voussoir, Sister-Witch held command. With a respectful but serious voice, she begged the Master to step back please, allowing her and two of her people to take the lead. And not only did she do as told, but with a nervous nod, as if saying, “Whatever you think best.”\nSister-Witch wasn’t the most experienced soldier here, but she was twice the age of the next oldest. That’s why Voussoir made her his Second. “You had careers and lives before this career and life, and that’s perfect training for walking corridors with every kind of everyone.”\nRelishing responsibility, Sister-Witch deployed a diamond shield and fed it orders, and when the shield advanced, she followed in its wake. Cumbersome gear demanded considerable room. The shield was fifty meters down the passageway before the Master finally stepped past the hatchway, and then the final four soldiers followed with their munitions, armor, and paranoid sensors. Every sentient weapon knew its stopping point. The winding tunnel was saturated with antinoise and a wicked super-mint odor designed to baffle average nostrils. Native granite formed the walls and the rolling floor and a rather low ceiling. Humans had never come this way before. Only microchine scouts had been sent, and according to a ghost’s strict rules, those scouts moved only so far. But there were so many ways to make rock transparent. Not one flake of left-behind skin had been discovered, not one spent breath lingered against the ceiling, and the thin dust introduced by billions of years of neglect was undisturbed even by the feet of a harum-scarum flea.\nSister-Witch had never knowingly visited such pristine ground, and when her anxieties ebbed, she found herself feeling honored.\nOne hundred meters walked, and then another hundred, and two of her people stopped walking, setting up barricades and all-spectrum eyes while the rest of the squad continued into the dark little hole.\nThis had to be the most ludicrous day in Creation. What began as unlikely mutated into the ridiculous, with insanity happy to rear its grinning face. How could the Master agree to this crap? And why wouldn’t Miocene—a notoriously competent officer—forbid this “meeting” from occurring? Indeed, why not lock up the Vermiculate, fill it with poisons, then for extra measure, throw the troublesome babble-pocket into a blazing Ship engine?\nThe second pair of soldiers deployed.\nThen the third, but only after allowing the Master to squeeze past them.\nSensible reasons put Sister-Witch on point, prepared to take the forward post or the last post. Her duty was to cripple whatever was hiding beyond, should it try to escape, or if some malevolence approached from outside, show it a last-ditch fight after the rest of her people were dead.\nHer working plan was to stop on one stretch of stone rock, exactly where the tunnel began a last soft turn. But reaching that point, the squad leader thought again. Three steps beyond felt better. Who the hell knew why?\nStopping there, she stepped out of the way, beckoning to the giant who was slowly approaching from behind.\nJust then, the Master Captain hesitated. A bioluminescent torch floated before her, revealing the famous face, dark smart eyes almost lost against rounded flesh and bone.\n“The shield stays with you,” said Sister-Witch.\n“Thank you,” the famous voice replied.\n“You’re welcome, madam. The best fortune to you.”\nThe diamond shield had gone ahead, and the torch seemed eager to do the same.\nAgain, the Master said, “Thank you.”\nThen she walked past.\nToo late, Sister-Witch thought of touching the ancient, oversized lady. On the wrist, perhaps. Or patting her broad back. Either gesture would have made this remarkable day even better, enjoying some small but friendly contact, bare fingers against the mirrored uniform that every captain wore in official circumstances.\nBut the ancient woman and her light were already vanishing into the black ink, and concluding once more that nobody was waiting inside the hole, Sister-Witch promised herself that the Master Captain would soon return, and regardless of the lady’s response—elation or despair or any state between—this loyal warrior would grab her with both hands, if only just to know how it feels to be so close to such vast, enduring power.\n6\nA difficult surgery was finished, and not only that, it had been done in a rush, needing only a few intense, remarkable hours.\nFirst, Voussoir was shoved into dreamless sleep, then his mind was knitted into the empty body. Cold pain woke him next, and feeling male again, he thought of apologizing and tried to sit up. The giant body refused to obey, but one arm let itself rise off the operating table. Eyes not as sharp as his old eyes examined the hand’s wide palm and fat fingers. Fingers moved as he willed, which might be a good sign. But he still couldn’t sit upright, and while his mouth opened and closed again, it refused to say sensible words. Which was why he shoved two fingers and the thumb between the jaws, yanking at the useless tongue.\nSomeone grabbed the wrist.\nMiocene said, “Sleep again.”\nNext time, Voussoir woke as a female.\nBut something else was amiss, or unfinished, and she was forced back under as the work progressed.\nTwenty-three naps; twenty-three instantaneous transformations.\nThen she was completely awake, and standing beside the surgical table, Miocene said, “All right. Try the voice.”\n“You planned this doppelgänger bullshit,” said Voussoir.\n“As an emergency measure. As I mentioned—”\nVoussoir interrupted. “With me. Me. Centuries and centuries ago, you stuck me in your plans. Just in case.”\nDelight emerged as a fleeting smile, sharp and then gone again. “Maybe, yes. Maybe I found you earlier than implied. And maybe that’s why Security recruiters approached you even before you were grown.”\nThe revelation deserved silence and some hard considerations.\n“Sit up,” the First Chair urged.\nBetter than that, Voussoir threw the giant legs over the table’s edge, then stood tall.\nMiocene was tiny beside her.\nThe Master’s body was a graceful mass. Bending at the waist, Voussoir grabbed the First Chair’s hands and kissed their backs lightly. Then with a quiet voice, she said, “I apologize to you, madam.”\n“For what?”\n“I’ve heard that you’re a marvel of frigid genius. A puppet master of the highest order. But I never appreciated your magnificence, madam . . . ”\nA briefing about practical matters included what to expect inside the never-seen chamber, and Voussoir was given a few minutes to practice with the new body, achieving some sense of normalcy. A second, much more thorough briefing offered goals if this “meeting” became real. What to ask, what to watch for and learn. Likely subjects, less likely subjects, and what issues to avoid by every possible means. All of those instructions came inside a rush of moments and deep breaths, and Voussoir was left more alert than she had ever felt before . . . besides those few times of honest combat.\nShe’d rather fight war than endure this crap again.\nShe asked a few obvious questions, breaking the briefings’ momentum, and when they were well behind schedule, Miocene said, “We’re done. Go.”\nWith the Master’s borrowed voice, Voussoir said, “You should have allowed for more minutes, madam.”\n“Next time, I will.”\nWhat followed was painfully long and banal. Voussoir walked with her unaware squad, or the seven of them had been briefed in full and were pretending ignorance. Or maybe they could see through the subterfuge, and on their own, they were doing a stellar job of maintaining the lie.\nRegardless, she was proud of them, so much so she ached.\nThen Sister-Witch was standing guard, and Voussoir walked alone until the tunnel decided to end its existence, opening into a hollow space that looked exactly as expected: a volume not much bigger than a comfortable bedroom, the space defined by ordinary granite, ordinary air. There was silence when she was silent, and besides herself, nobody else was present.\n“Of course nothing’s waiting for me,” she told herself.\nShe filled the Master’s lungs and held that breath, exhausting the oxygen, letting modern anaerobic metabolisms come online. Most of the nexuses inside her—armies of self-absorbed talent—had been disabled or dropped into diagnostic modes. The exceptions served as eyes and ears absorbing every input. That’s what the genuine Master Captain would have done in these circumstances. This was reasonable security coupled with heightened senses. Voussoir’s only companion was the silent torch, and for twenty minutes, nothing changed. For another thirteen seconds, nothing changed. Then following Miocene’s script, she used the Master’s voice to say, “Enough,” and took one long step backward.\nThe torch went out. Or perhaps, her new eyes were stricken blind.\nEither way, Voussoir was immersed in seamless black ink, and she breathed again, out of surprise. And that was when the man’s voice came for her, beginning with a name.\n“Liza,” he said.\nWhich happened to be the Master’s rarely used birth name.\nThen the man broke into loud laughter. The tone might have been joyous, might have been teasing. Either way, the cackling soon trailed away into a rough snort, and then the voice returned.\n“Oh, it must be such a pleasure, Liza,” he said. “You at last enjoying the honor of meeting me . . . ”\n7\n“My name is Voussoir.”\nThe words were spoken, but only as thought. Only in that remote portion of the mind where people are free and true. The rest of her considerable focus was shuffling instructions and the Master’s biography as well as her native pissed-off sensibilities. Then the borrowed mouth repeated one critical word.\n“‘Honor.’”\nNo reaction.\n“Who am I honored to meet?”\nSilence.\n“Share your name,” she insisted.\n“Oh and I would, if I had any to surrender,” the voice replied. “But my attitude is that names are useless. Nothing but arbitrary noise flung against indifferent baryons and energy.”\n“My baryons are interested,” she said.\nHis response was a soft, mocking laugh.\n“Screw you,” she thought, in secret.\nThe voice came closer, became louder.\n“Consider the galaxy,” he said. “A mighty whirlpool of dust and suns, and it wants no name. It needs nothing of the kind. Yet millions of living worlds hang labels upon this magnificence. Gifts of diction and history and hubris. And be honest now, Liza. Please. Can you genuinely believe that your Earth, the sphere on which you were conceived, understands what you intend when you point to the sky, talking fondly about a Milky Way?”\nShe gave him a hard laugh. “I’m standing with a philosopher,” she said. “Fair warning, I have little patience for your species.”\n“I agree,” he said. “You do rather despise intellectuals.”\nVoussoir offered her own stubborn silence.\n“So let’s dance with less obtuse concepts,” he continued. “Gravity. Magnetism. Metabolic fire, and the fierce press of time. Unlike fanciful names, these are hard principles. These are features not only shared by every portion of the galaxy, but also help define the universe we see today and saw yesterday too.”\n“Who the hell are you?” she asked.\nLaughter exploded—a cackle both charming, and in the same moment, unnerving.\nVoussoir tried to step away. Except her new feet were swollen fiftyfold, or she was rooted directly into the granite. Or maybe the nerves between wishes and motion had been severed.\n“Time,” said the nameless companion. “Thoughtful life often holds to one broadly popular model of time. Though there are exceptions, and maybe we should list them. Just to prove how well-informed we are.”\n“No thank you,” she said.\n“Perhaps later,” he said.\nThen, “Standard counts of time place Homo sapiens among the exceptionally young. Not half a million Earth-years ago. That’s when your faces and hands emerged. What’s more, half your history was spent squatting beside dirty fires, eating feral meats, carving animal teeth, happily sharing tales about all manner of tiny subjects. Then, as often happens with busy hands, the stone and ivory gave way to iron and diamond, and your conversations became more expansive, more durable. And after only a few millennia, you transformed your cradle world. Tritium bombs and those early spacecraft were ready to save humanity, or destroy you. Look at your history honestly. Look at your life, Liza. There had to be one day when both those grand possibilities were equally eager to come true. And how would that story have ended . . . you don’t know. You can never know. Because there was another day when one of your orbiting telescopes happened to see a rich flash of laser light. An alien beacon was enjoying an intense conversation with a very distant mate, in a language built to be understood, and on that momentous afternoon, a nameless ball of metal rock water and oxygen—the place where you happened to live—passed through the beacon. Purely by chance. And that’s when humanity found herself suddenly holding the tools for ageless life, for starships, and for world-scale terraforming.\n“All at once, the universe lay in your reach.”\nA pause arrived, lingered.\n“I remember,” Voussoir lied. “I was there.”\n“But where could you travel inside those fine new starships, those sturdy ageless bodies? Older, more capable aliens had already given the galaxy better names than your lactation nonsense. Every rich easy world knew the faces and hands of other creatures. What’s more, broad customs and some stubbornly inflexible galactic laws kept your treachery to a minimum. Humans had little choice but make the best of sunless worlds, ill-suited moons, and solar systems on the fringes of what is normally regarded as respectable space.”\nOffended, Voussoir muttered, “‘The vigorous limp makes the other leg strong.’”\n“Ah, a harum-scarum proverb.” The voice retreated slightly. “Yes, let’s pay tribute to that ancient, prosperous species. Harum-scarums were exactly that. Early to the stars. Aggressive, risk-embracing natures, but with a survivor’s laudable skill to know when to slink away. The Clan of the Many Clans has wandered across much of the galaxy, including some intriguing visits to your cradle. What passes for their empire is stable and happily rich, making both of their legs feel strong. Perhaps that success was why they maintained only a cursory watch over the deep dark beyond the galaxy.\n“Crippled little humanity didn’t have that luxury.\n“And now, a second telescope demands mention. Drifting in the intergalactic cold, a human-built array of mirrors was tasked with finding incoming objects. The vast majority were natural, and that included some very substantial bolides. Sunless worlds often get flung out of galaxies. Asymmetric supernova and well-placed neutron stars do the same. After all, this is a universe built on compelling forces, and that means the occasional Uranus-class mass being accelerated to one-third light speed.\n“Your telescope found such an object. Bigger and much faster than most, yes. But with cosmic dust and cometary ice laid over the hyperfiber hull, the invader didn’t appear special. Truth demanded a better look, and that’s why the nearest humans built and launched a tiny probe, kicking it to near-light velocities, and that’s why it was the probe’s resident AI who had the honor of peering behind the leading face, discovering a forest of giant rocket cones looming over a hull already billions of years old.\n“The ultimate derelict. That was the Great Ship. No traces of crew, no legal mark of ownership, and according to the galaxy’s ancient laws, ready to be owned by whoever stood first on its hull.\n“And that’s how one infantile chimp—a beast with little history and an uncommon amount of luck—won the universe’s most wondrous prize.”\n8\nAgain, Voussoir tried to move.\nBut not with the legs. She had given up on those limbs. This time it was the right arm and its meaty hand, and against expectations, both of them easily lifted up, the Master’s fingers clumsily sweeping through the blackness, feeling nothing. But the voice had come from a rather different direction, and like a navigator with only one point to steer by, Voussoir stabbed at a mouth that could only be imagined.\nHer reach was met with heat and damp breath, and then pain, bright swift and done, leaving two fingertips suddenly stolen away.\nStartled, embarrassed, then nothing but furious, Voussoir pulled back the hand, contemplating violence and violent words before falling back on safer tactics.\n“‘The universe’s most wondrous prize,’” she quoted. “Is that what the Great Ship is?”\n“As true as any statement ever made,” the voice replied. “Inarguable and safe from fools.”\nA stranger’s hand, human in feel and size, took hold of the wounded fingers, then an irresistible power pulled them away from her body while a second hand caressed the forearm. Then the severed fingertips were returned, set on top of the clotted blood, both beginning to splice themselves back into familiar flesh.\nAnger fell into an equally useless gratitude.\nVoussoir attempted to regain the conversation. “Your babble-pocket promised news about my ship.”\n“That’s the impression I hoped to give, yes.”\n“And a looming danger.”\n“That the Master should hear about, yes.”\nShe took a breath, holding it deep.\n“Yes, Liza?”\n“The old language you used . . . ”\n“Not old at all. Except in human terms.”\n“Why Khoisan?”\n“You assume I have reasons. Instructive, illuminating reasons. And insights might spring from this personal information.”\n“You’re very old,” she said.\n“Is that what you guess?”\n“But I don’t know which species you are.”\n“A word I work to avoid . . . ”\n“‘Species?’”\n“Live long enough, my dear, and you become a species of one.”\nShe said nothing.\nHe matched her silence.\n“You’re at least as old as humanity,” she finally said. “But I’m not impressed. I’ve met a few passengers who claim to have been born before the mammalian line.”\n“Most are lying to you,” the voice said.\n“Presumably.”\n“Do you wish to know who tells the truth?”\n“Yes.”\n“No, I don’t believe you.” The tone was sharp, words delivered by a mouth that had suddenly circled behind her. “I will admit this much: I carry an extraordinary amount of time. Massively ancient, I was, when I first arrived on your homeworld. And there you were, Liza . . . squatting by the fire, telling fables to one another.”\n“You’re harum-scarum,” she said.\nHe laughed again, seemingly roaring his approval, and all the while she heard the mouth working, the jaws hard and sharp. A mock-bird’s beak, or maybe a giant insect’s mandibles. Voussoir imagined her neck bitten, the entire head sliced from these shoulders. Two decapitations in one day . . . and that’s why she straightened her back, ready to endure the insult.\nSomething about the situation amused her companion.\nThen his chuckling faded away.\nShe was alone.\nFor an hour, perhaps. Voussoir tried to count moments, count breaths, but her internal clock was peculiarly confused. The silence might have been much longer than an hour, or nothing passed but the illusion of breath and numbers, heartbeats and the swing of a pendulum.\nWhen the voice returned, it began by quietly saying, “Apologies, Liza. I was needed elsewhere.”\n“Doing what?” she asked.\nShe expected no answers.\nBut what felt very much like a human mouth was pressed near an ear, and a whisper both slow and quite loud said, “You know what it is to rule, Liza. The demands never end.”\n“And what do you rule?” she asked.\n“One small maelstrom of stars,” he said. “Named for a fluid that has never flowed from your breasts. That’s what I hold in my grip. Or at least some significant portion of that wonder.”\n“You rule the galaxy,” she said.\nAnd she made a point of laughing at him.\nHe answered with a put-upon snort. Nothing more.\nShe let a bold mood take hold, saying, “It’s such an honor to meet you, my Lord Gravity. A wondrous force such as yourself, given this voice and made tiny enough to stand beside spellbound me.”\nShe said, “Truly, the Master Captain has never enjoyed a greater honor.”\nAt which point, he touched her face.\nA long and frigid claw was slowly dragged across the lips.\n“What is your name, little girl?”\nThe question came from no mouth. Welling up from her blood, those irresistible words demanded an answer, and the same blood surrendered.\n“Voussoir,” she said.\n“That I did not know,” he said in turn.\nThen he laughed with patience and warmth, adding, “Perhaps you don’t realize how much of joy it is, Voussoir . . . these endless moments when the universe reminds me that I understand only a little more than what all of you can ever know.”\n9\n“Soldiers are currency, and every captain keeps us inside a favorite purse.”\nThat was one version of the barracks maxim. G heard the words after putting on the recruits’ gray uniform, and repeating them with enthusiasm proved his place in the ranks. But embracing the cynicism came later, after graduation and a few centuries of competent service, and particularly after his first genuine war. Several dozen colleagues died during the fights, which might not make an impressive stack of bodies. But that was forty-nine millennia ago, and if all of those men and women had survived—if they were standing inside the bunker today, lined up beside the former Lieutenant G—they would be carrying more years of happy life than all the troops who ever marched into any of the famous old wars.\nEvery good soldier needed to be scared of death, but G had a rare capacity to ignore nonexistence, focusing only on his immediate work. That certainly helped explain his persistent rise through an organization that lost few bodies in the average decade. Becoming the Ship’s Marshall was one ambition fulfilled, and he intended to hold this office until scandals in the ranks or a tragedy in battle forced the Master Captain to find her scapegoat. And then, because he was a good soldier, G would resign in some public manner, convincing passengers and crew alike that She was in charge and She had zero patience for any shade of incompetence.\nAnd then?\nRetirement, perhaps. Though G often dreamed about little posts and low profiles, ignored by the captains through the next fifty scandals. That’s how you survived in this realm. Wait and wait, and eventually the Master would need another new Marshall, and their G would be a reliable agent ruling some sleepy district. That’s how he would rise again, eventually finding himself standing inside another hardened bunker, shoulder to shoulder with hundreds and thousands of ghost soldiers, while Miocene stood before him, in all her glacial majesty.\nG watched the First Chair with his living eye while its mechanical partner absorbed torrents of data and virtual videos. The nearby chamber had proved as unremarkable as everyone hoped it would be. No entity or sentient device had appeared inside it, and nothing within a hundred kilometers acted even remotely interested in what was happening here. Playing her part in the game, Voussoir stood in the middle of that stone chamber, crossing time until she was free to turn and leave again. Then the moment arrived, and the soldier attempted to leave, but the little lamp was turned off or it failed, or perhaps it was stolen away, and that’s when the Vermiculate suddenly reclaimed its night.\n“Well,” seemed like too little to say. But that’s exactly what Miocene offered, with a tight quiet voice.\n“Shit,” was the Marshall’s addition to that potent dialogue.\nNo sound emerged from the chamber. Not breathing or curses or even the steady thrumming of one ageless heart. Sensors continued to peer inside the stone cubbyhole, and maybe Voussoir was there. Or maybe not. Neither of G’s eyes were sure what they were witnessing. The only authority full of confidence was one AI savant designed for this single contingency.\n“I still see the Master’s body,” the machine stated.\nIts tone was intrigued, excited. Giddy.\n“And I see someone invading the body, subverting nexuses and resident safeguards.”\nA primary fear, always.\n“Failure is imminent,” it warned.\nWhich was when Miocene, the ultimate survivor, did as she had done so many times in the past.\nWith a glance, she told her Marshall, “The responsibility is yours.”\nG opened a shielded nexus while burying his natural sympathies, and then he gave seven camouflaged blinds permission to unholster their weapons, then fire.\n10\nFor some soldiers, wounds were a reliable delight. Severed limbs, shattered faces, intestines dangling pink and slick outside the eviscerated body cavity. Insults like that became a warrior’s drama that deserved to be told again and again. With drink and with lovers. Or when alone, entirely sober. Battlefield mayhem needed to be described in detail, including your own calm mind and the rapid, equally violent healing process. The grateful leg was always shoved back into its socket, arteries and nerves rebuilt in minutes. New eyes emerged from the gore, along with a mouth spitting the worst alien curses. And what to do with the dangling guts? Folding them back inside the body took too long, which was why field blades sliced and hands tugged, the intestines abandoned so that the fight could press on.\nBut Voussoir despised being wounded. Injuries were embarrassments that proved sloppy work, and worse, sour luck. No matter how tough the body or how quickly flesh and skeletons regrew, injuries always surprised Voussoir. Like the night when a fat uranium slug punched through her chest, removing the heart and a long piece of spine. That disaster came at the end of the battle, and because the bioceramic brain was practically infinite, Voussoir could recall every detail: the feel of the ground beneath her ass; the stink of ozone and enemy pheromones; sirens telling the F”foon civilians to remain in their burrows; and how her entire squad filed past their lieutenant’s helpless body, shoving a few fingers inside the gaping hole while sharing the usual rough-natured insults.\nVoussoir was being wounded now.\nWorse than ever before, she realized.\n“The fingertips you gave me,” she began.\n“Yes?”\n“Aren’t mine.”\n“But they are the same fingers, Voussoir. Augmented to help with their critical work.”\n“You’re attacking my nexuses.”\n“Machines that don’t belong to you either, do they?”\nA tentacle or animated rope claimed the Master’s wrist, locking it in place, while a furnace surrounded the hand, cooking its flesh.\nShe said, “I’m not the Master Captain.”\n“On that, we agree.”\n“Buffers. Isolators. Embedded mandates.”\n“Safeguards protecting the nexuses and shielding the Great Ship too. Yes, these precautions are doing their heroic work.”\nFire shot through the forearm, finding her chest.\nVoussoir tried to collapse but couldn’t. Except then the granite floor rose up, slamming against her back.\nShe gasped, retrieving a breath or two.\n“You promised to tell,” she said.\nFrom the darkness above, her torturer replied with a hard click of the tongue.\nShe said, “The Great Ship is threatened . . . by you . . . ?”\n“That’s what you believe?”\n“Yes.”\n“Then you are mistaken.”\nFlames leaped out of her and then returned as ice. Suddenly every tissue attached to her was transformed into a glassy solid. Yet Voussoir still had enough voice to beg. “Please,” she said. “Tell me one true thing.”\n“Just one? Oh, very well.”\nWhat was bizarre only grew more so. Her captor carefully stretched out on the floor beside her, and what felt like a human arm was eased between stone and skull, giving her a pillow to rest against.\nShe imagined a powerful man’s arm and matching body.\n“Lord Gravity,” he said.\nThen, “In this universe, that particular god is inevitable.”\nVoussoir’s frozen face couldn’t move, much less speak. Yet the Master’s voice rose out of her, asking, “What the hell are you saying?”\n“Gravity is fundamental to nature,” he said. “Electromagnetism and quantum mechanics too. A weave-work of relationships involves mathematics, energy, and particles, each relationship emerging at the beginning of the beginning, or shortly thereafter.”\n“Granted,” she managed.\n“But much else is inevitable. Life, for example. And in countless places, there is intelligent, self-aware thought.”\nStaring into the ink, Voussoir considered too many questions.\n“Now answer this,” he continued. “When did intelligence first emerge from the young Creation?”\nSchool-learned dates offered their advice.\nVoussoir shared a few numbers.\n“Whose civilization was first?”\nCandidates lined up for her, and she said, “The Bakers.”\n“Why them?”\n“I like their name,” she admitted. “When I was little, they fascinated me.”\n“Why?”\n“Because they built incredible machines. The best machines ever, maybe. Dead for several billion years, but the galaxy is littered with their creations, many of them still capable and eager to work.”\nWith that, a lovely whistle fell from everywhere. Then the mouth beside her explained, “Of course they never referred to themselves as ‘Bakers.’ That’s just an inadequate translation shoved through human expectations. Yet as ancient as the Bakers were, they were far from the first creatures to stand in sunlight, admiring their own short shadows.”\n“Who was first?” she asked.\nNo answer.\n“You?”\nLaughter rolled over her, warm again, and soothing.\nVoussoir enjoyed that sound far too much.\n“Let me share this much, my friend. No portion of your sky is special. Every nameless whirlpool of dust and fusion produces an initial crop of life. Watery organics. Wise crystals. Structured plasmas found nowhere but on the edges of newborn black holes. The specific path to consciousness and civilization hardly matters. Results are always the same. The First emerge from every newborn galaxy, and that includes the trillions of galaxies beyond the edge of the visible universe. Gravity reigns and so do they, spreading fast, and after a few aeons, those fortunate creatures will have answered every question worth asking.\n“As fundamental as protons,” he said. “Every First Generation is that.”\nHe paused.\n“So where are they today?” she asked.\n“Lying down beside you in the dark, obviously.”\nAnother pause arrived, and it felt long.\nThough it wasn’t.\nVoussoir gathered up more questions. But as soon as she spoke, the voice cut her off.\n“Oh, I am prepared to tell you everything,” he promised. “But a problem has emerged. Your superior officer is attempting to cripple me or murder me. Which is quite unfortunate since you are the only one in danger, and that leaves you with an exceptionally difficult choice, Voussoir.\n“Hear the truth about everything, but die.\n“Or we stop now, inside this moment, and I save you as you are . . . a beautiful soul wandering through this frail universe of mine . . . ”\n11\nSeven whisks of antimatter iron rode inside magnetic fields, each wrapped within hair-thin jackets of hyperfiber and iridium, and at nearly two percent light speed, those jackets were spat down seven holes that had been carved by X-ray lasers and some exceptionally delicate harmonics.\nMonuments to cleverness and calculation, the weapons were also burdened with rich opportunities for error.\nSister-Witch was standing tall on her piece of granite, defending the tunnel and the Master Captain, and if possible, protecting her own life too. Field sensors had consistently reported what she expected to see, which was nothing. For more than twelve hundred seconds, the Master had stood just out of reach of eyeballs, partly filling the most insignificant room in the universe. “Thank the spirits that Voussoir watches over us,” she kept thinking. Then the Master’s lamp was extinguished. Sister-Witch knew nothing about any attack on the nexuses or the Marshall’s violent response. Yet if she had known, nothing would have changed. Her stance was comfortable, but not too comfortable. That’s how she kept herself alert and ready. Her only failure was not being able to fend off the imaginary foes. Bioceramic brains had too much capacity, and few soldiers were as creative as Sister-Witch, and that’s why a broad slice of her mind was dedicated to a pretend battle between her rail gun and the furious beast charging from behind, razored scales and one gaping mouth facing for her.\nSeven distant weapons fired one round each.\nThree cartridges reached their target, intersecting at a point just above the chamber and the helpless body.\nThree more rounds detonated early, while the fourth somehow managed to arrive nanoseconds late, and deflected by one miniscule thermonuclear event, it was flung straight up the tunnel where Sister-Witch was standing.\nShe didn’t feel the impact, didn’t register the exceptionally narrow wound or its subsequent healing. That cartridge continued on its way, detonating a few hundred meters farther along, and while native rock absorbed the blast, the bunker’s floor shook hard enough to make every eye open a little wider than before.\nThe united three-cartridge blast was larger and much closer to Sister-Witch, and since every explosion is lazy, the plasma bloom tried to flow through the only available exit. Sensors screamed with a data-rich panic, and she saw the flash, and then she was on her ass, a minor diagnostic tool warning her that her hyperfiber armor was pierced through the chest and the back, and how did she feel?\nPissed.\nAlive.\nFucking glorious.\nThen she was standing again. An atmosphere of oxygen and gloom had been replaced with atomized rock and a nearly perfect silence. Designed for fighting in alien environments, her helmet built a faceplate that sealed tight, then fed her chest cold bottled oxygen. But breathing was only a habit at this point. Someone was trying to murder the Master Captain, and existence had no purpose but to push ahead, testing armors and life-support systems until they failed, then discovering that she was still a few steps short of her goal.\nThe Master Captain lay on the soft floor, the uniform incinerated along with most of the body inside. What remained was an enormous silhouette of soot driven into the flowing stone, arms held at their sides as if utterly relaxed, the one-time head waiting at Sister-Witch’s feet.\nNexuses and voices were shouting.\nCommands, overlapping and obvious.\nShe shut all of them down and raised her rail gun. Dislodging the bioceramic brain took moments and too much time, but at least the Master was cradled in her arms, and turning, the would-be savior attempted to escape the room on feet that were beginning to burn.\nLava fell from the ceiling, striking her shoulder.\nThe pain was set aside.\nThen it began to rain molten rock. Her armor was breached, her body was burning, and she ran on her ragged knees until she fell over. Then, on the premise that the rest of the squad was waiting inside the tunnel, she tried tossing the mind to them. But her arms were useless too, what with the muscle gone and the blood turned to steam. It was all that Sister-Witch could manage, curling up around the Master Captain, protecting her with those final kilograms of skeleton and hyperfiber.\nThis inferno was so much worse than any monster she had imagined.\nThat was Sister-Witch’s final thought before Death took hold, then set about deciding what to do with her next.\n12\nGray twilight ruled the hallway and presumably every room beyond. Facing her many guests, the apartment’s sole tenant greeted them with a wave of the hand and the words, “Come. Be with me. Everyone.” Then with majestic grace, that newly conjured body turned and quickly strode away.\n“Of course, madam,” said Miocene, following the Master Captain through the gloom.\nMarshall G was last inside. Overlapping doorways sealed while the resident surveillance system spoke only to him. “Wait, sir. Wait.” Electric fingers began to massage his frame, and with nowhere to go, G considered how more sensitive individuals might take offense. After all, the heightened alerts had been allowed to expire. And he should know, being the Head of Security and all.\n“Thank you so much, sir,” the system offered. “You may go wherever you wish.”\nEven by Ship standards, the Master’s apartment was extravagant: One cubic kilometer filled with thousands of rooms, many of them defined by towering walls, arched ceilings, and a hectare of floor, or more. Every room was littered with ornate furnishings and the rarest artwork, diamond biospheres filled with exotic life, plus baubles and quirky marvels—one-of-a-kinds given by all manner of grateful passengers. Yet very few rooms were used on a regular basis, and some may never have been seen by the Master Captain. Famously immune to snobbery, she craved familiar food and familiar comfort. Standing anywhere, armed with nexuses and habit, she was also everywhere else inside a singular starship, and how could a thousand pretty paintings compete against that?\nThe Master led her guests to a modest parlor. Marshall G had been in this room many times before. A living couch always stood near the doorway, waiting to serve. Woven from three unrelated beasts of burden, none of them sentient, the organism had three pampered mouths and one shared anus, fur and fat and firm muscle creating a platform just smart enough to always make itself comfortable for its owner.\nThe Master Captain reached the couch and spun about. But then the knees locked. She didn’t sit.\nAs if startled, the couch twitched.\nNo one spoke, not with mouths or nexuses. The Master had just today recovered her bulk, her nexuses replaced and rapidly returning to work. In that dim light, she towered over her audience. Every face appeared simple and every sound felt enlarged, vivid and close. A dozen Submasters were present, Miocene standing in front of her subordinates. The guest of honor stood closest to Marshall G, but not close enough to touch. Her body was a full day younger than the Master’s body, making it newborn. Cultured from the resident genetics, unfinished legs shook whenever they did too much work, and standing seemed especially taxing at the moment.\n“You should sit,” was the Master’s advice.\n“Thank you, madam,” said Voussoir, and ignoring various chairs, she dropped to the harum-scarum rug that covered the local floor. And again, the soldier said, “Thank you, madam.”\nThe Master glanced at her First Chair.\nMiocene was ready to wait forever, feigning patience.\nBut there was no need. “I have a confession to share,” said the Master.\n“And that would be?”\n“I just discovered an unexpected, wondrous joy.”\nWith that news, Miocene nodded, eyebrows raised.\nA broad hand was lifted high, and that captains’ captain swept it back and forth before her round face. “The most intense pleasure that I have ever known.”\nMarshall G saw a duty to fill. “How intriguing, madam.”\nThe Master glanced at him, halfway smiling. “You see, my hands lost their grip on the helm. I felt like a youngster again, without talent, without responsibility. For several hours, I had nothing to occupy my sanity but small thoughts about my very few needs.”\n“And that’s what made you happy,” G began.\n“Oh, goodness, no.” The hard laugh signaled disgust, disappointment. Perhaps the Master would dress G down now, as a warning. But she couldn’t shake what had made her so happy, and as she smiled again, hands closing into fists, the First Chair answered for her.\n“When you took back the helm,” said Miocene.\n“Exactly,” the Master Captain said. “I have always assumed that I knew what ecstasy is. But obviously I didn’t. Not until I took back the Great Ship, I didn’t.”\nA brief silence was allowed.\nThen the Great Ship’s ruler turned to the fellow who presently served as the Marshall. “So what have we learned today, G? Tell me.”\nOne thousand centuries wasn’t enough time to populate more than a sliver of the Great Ship. The interior was still jammed of wilderness, unlit and uninhabited, and only mapping savants could count the places that had never been modified by busy tools. Most of the Vermiculate fell into that category. But not the one room where Voussoir had gone. Nanological tools had converged on that tiny space, and setting to work, they moved every silicon and oxygen aside before slathering the gaps with all manner of camouflage. Then the original atoms were set back in place. That’s how the trap had been built. Atom by atom, over quite a few careful centuries, the conspirator had presumably done little else, and except for a few tweaks from rare and expensive technologies, nothing about the project was amazing.\n“What impresses is the commitment of time and intricacy,” Marshall G offered. “As much as ten thousand years chasing this one narrow venture.”\nThe Master already knew the verdict, but it was important to hear the synopsis aloud, absorbing the lessons in a public way. A major portion of her job was stagecraft, and she knew how to wear a concerned face, knew how many times to nod, and recognizing the perfect moment, she subsequently turned to her First Chair, calmly asking, “And what about our enemy?”\nAnother mystery resolved.\nMiocene shared what might be the most complete study ever made of a blast site. Megawatts were on display, radioactive tracks radiating out through stone, and under the magma rain, the Master’s former body: charred tissue and bone shards punctuated with a few hundred nexuses as big as pepper grains, and thousands more that were exponentially smaller. Not one of those critical machines had survived the blast—as planned, yes, and thank goodness. An eddy inside the flowing plasma was what saved Voussoir’s brain, and then Sister-Witch chiseled her free and carried her just far enough to save both of them from the searing heat.\nAt that point, Voussoir interrupted Miocene.\n“How is she?”\nThe First Chair’s gaze remained fixed on the Master Captain. “She might be healthier than you, as it happens. But we don’t need to hurry her recovery. So the surgeons are taking their time.”\n“Of course, madam. Thank you.”\nOnly Marshall G watched his soldier. By logic or chance, the newest body resembled a half-finished adolescent, very tall but slight, thin legs crossed, ankles and long feet resting against the silver and blue harum-scarum rug.\nVoussoir’s face was pointed downward, fingers playing with the glass weave.\nMiocene continued. “This is the attacker. Here.”\nTwo of the Master’s fingers had been removed, replaced by what looked like an interrogation device, but was really much more. Ages ago, a species of AIs known as Brink Riders had boarded the Great Ship, traveling from their supercooled homeland to another sunless Pluto-class body. All but one had disembarked at the proper point and time. Remaining behind, in secret, the tiny stowaway busied itself by refashioning a portion of the Vermiculate, and when the opportunity arrived, it contrived a way to grab hold of the Master’s hand.\n“And it might have won,” Miocene allowed. “If winning meant gaining control of the Ship and every major system onboard, then yes, there was a real danger. If we had allowed you to stroll into the trap, only routine security in place, there would have been a one-in-eleven-hundred chance of success. Which to a Brink Rider is an exceptionally enticing promise.”\n“But with precautions in place . . . ” G began to ask.\n“One chance in an ocean of failure,” was how Miocene settled the matter. “But again, Brink Riders have a courage that humans rarely understand.”\nSmall dangers or not, the attacker had been killed.\nMarshall G absorbed that verdict while staring at his soldier, trying to read expressions on a face that was always a little new.\nThe Master Captain said, “Voussoir.”\nUp went the eyes, then back down again. “Yes, madam.”\n“Your name. It’s rather popular with the Family. Am I right?”\n“Yes, madam.”\n“It means—?”\n“‘The wedge that holds high the arch,’” she replied.\n“Interesting,” the Master offered. Such a perfect word that it needed to be said twice again. “Interesting, interesting.”\nVoussoir’s eyes were closed tight, skeletal fingers moving faster through the harum-scarum weave.\n“Your report, Voussoir. It’s detailed, very thorough. But tell it to me now, as if I know nothing.”\nThe fingers grew still.\n“Voussoir?”\nEyes lifted, and it seemed as if all of the face opened wide. “I walked to where I was ordered to walk, stood where I was supposed to stand, waited the proper time, then turned to leave again.”\n“And?”\n“Nothing.”\nThe lords of the Great Ship stared at the soldier who was folded up and sitting at their feet.\nAgain, Voussoir said, “Nothing.”\nThen before more questions were asked, she added, “Oh, I’ve tried to remember. I do want to help you. But except for sharp teeth biting off the fingers, I have nothing to offer you . . . ”\n13\nEventually there was a morning when Voussoir woke up to find the same powerful build and identical blonde curls that he had worn a little more than a century ago. Yes, the hands were smaller than they had been, and the genitals sported their own structural quirks. But there were too many similarities to count, and even though Voussoir didn’t want to believe in signs, a portion of him had no choice but to think, “Today has to be the day.”\nHis spouse woke up female, and they shared the bed for a little while before she decided, “You’re distracted.”\n“Rather so,” he admitted.\n“Is something wrong?”\n“Somewhere, yes. But not here.” Then he focused on the work until both were happy, and while clothes adjusted to their new frames, Voussoir mentioned that he had to leave on an errand.\nShe eyed him and then looked elsewhere.\n“All right then,” she said.\nThree decades of marriage, with considerable talk of making a child. But each of them still kept secrets, and they had never agreed about whether or not to raise the progeny in the Family of Perpetual Renewal. Both of them held strong opinions on this critical matter, and as often happens with functional immortals, both were prepared to wait another thousand years to win the argument.\nAlone, Voussoir left the little apartment, walking to the nearest public cap-car, and after a short ride to an adjacent district, he took a second, much quicker car, paying the premium to obscure his route and destination. Yet even then, he ran the final kilometers, and that’s why it was late in the day when he reached an enclave that had been declared Forbidden by the Master herself.\nTwo black-garbed soldiers recognized something in Voussoir’s face or gait. One nodded warily, and the other asked, “Off duty?”\n“Retired,” he said. “Sixty years, nearly.”\n“You like civilian life?” she asked.\n“Only when I’m not being shot,” he said.\nThey shared a good laugh, then the wary soldier mentioned that it was time for one of them to walk on.\n“G,” Voussoir said.\nThey stared at him.\n“Tell him that I’m here.”\n“And who are you?”\nVoussoir offered his name and former rank.\n“The Admiral’s awfully busy with his little war,” the woman warned. But barely ten seconds passed before orders arrived, and not only was the retired soldier given full access, but the suspicious guard was told to bring the honored guest directly to the command bunker.\n“Who are you?” both soldiers asked again.\nBut Voussoir had already told them as much as he was comfortable with, and that was why he refused to offer any more words, including, “Thank you.”\nOnly the two men stood inside the bunker. On the walls, shifting portals gazed out across a heavily urbanized district. Local humans were on the march, hordes of them, competing banners held high, kinetic weapons in every hand’s reach. This city was ruled by cults and old grievances. This was an Archaic community, meaning that the residents were human but not immortal. A realm of soft tissue souls, brains wet and temporary, this was very much like a tiny slice of Old Earth. Voussoir was fascinated with what he saw, what he heard, and in particular, one barely adult man who lay dead in the middle of a crossroads. A lead bullet had punched two holes in his skull, one hole tiny and the other quite huge, and Voussoir was wondering if the corpse was being left as a message or a warning. Or maybe the boy had been forgotten for the time being. Which would be the worst possible circumstance, and maybe someone who could ignore bullets would walk down there and take care of this little problem.\nG watched his companion for some patient while. Then he made a reasonable guess. “You managed to remember something. Didn’t you?”\n“Oh, I never forgot any of it,” Voussoir confessed.\nThe two of them traded glances, careful smiles. Then the former Marshall said, “I had a feeling. When you sat on the Master’s floor like you did . . . I assumed you were pissed about being used as bait and nearly killed.”\n“Except I would have taken that trade,” said Voussoir. “My life in order to save the Great Ship, and helping kill an enemy in the process . . . ”\n“Is that what happened? Did we execute the attacker?”\n“I’d like to think so.”\nG said nothing.\n“This is what I remember,” Voussoir said. Then after one deep breath, he spoke with precision, reproducing every word and the exact pauses between, ending after he reached the moment when the stranger’s voice said, “Or we stop now, inside this moment, and I save you as you are . . . a beautiful soul wandering through this frail universe of mine . . . ”\nWith one silent command, G closed down the portals, and with a quiet word, he filled the bunker with the yellow-white light of Sol, midday and brilliant. Then he sat on the hard floor, legs crossed, and Voussoir did the same, facing him, close enough that it wasn’t much of a reach for them to hold hands.\nFor one man, an hour of hard concentration brought up many possibilities. But the other man had a century of reflection to offer up. Yes, the AI mastermind might be dead, and the First Civilization and humanity’s guided luck were nothing but noise flung against gullible baryons and energy. But what if the story was true? What if ancient entities knew every important answer but were now hiding out of sight? And if all that was so, what careful next step might be worth the expense and the risks?\nG mentioned the obvious duty: approach Miocene or even the Master Captain. “I could certainly earn their attention, if I wanted that.”\n“But I don’t want that,” Voussoir said.\n“So. You’re afraid they belong to the First.”\n“Oh, no. Never.” Feeling a little sickened by the suggestion, Voussoir spent a moment shaking his head and wiping his mouth hard. With the day getting long, he contemplated a little dose of sleep, reasoning that changing his voice might make him sound a little less paranoid.\n“Why don’t you want to warn them?” G persisted.\n“Because,” Voussoir began.\nThen he hesitated. This was so much harder than he had imagined . . .\nG’s living eye grew larger, brighter. “Wait. You stopped telling the story, but the story didn’t stop. Did it?”\nA slow nod. Then, “‘This frail universe of mine,’ he said. Which was when I told him, ‘I’m not all that frail, and we’ll probably never talk again. So go on. Share a little more, and maybe I’ll get out here just fine.’\n“Very well,’ he said.\n“He said, ‘They are coming.’\n“‘They? You mean the First Generation.’\n“‘To take what they want.’\n“‘The Great Ship,’ I said.\n“They’ll take it for reasons. Honorable reasons and very selfish reasons, and every cause in between.’\n“‘But you’re already here,’ I pointed out.\n“‘Except I don’t want them to take the Ship.’\n“‘You want it for yourself,’ I said.\n“‘For honorable and selfish reasons, I do.’\n“‘That is interesting to hear.’\n“Then his voice got faster, and he told me, ‘Make ready. When they come for you, and they will come for you soon, you must be ready.’”\nVoussoir paused.\nG shifted his rump against the hard floor.\n“That’s when your three bullets came for me,” Voussoir said. “And I heard nothing else. Not the voice, and not the explosion.”\n“I gave the order to fire,” G said.\n“I know.”\n“Maybe I’m one of the First.”\n“Actually, I’m rather hoping you are. Someone who knows something, hiding among us while wearing the perfect disguise.”\n“Shit, I wish I was someone else. About every day, I do. But as far as I can tell, I’m nothing but another ex-Marshall struggling with an endless and thankless shit assignment.”\nVoussoir shrugged. “Well, I knew that was too much to hope for.”\nG waited a long moment, then recrossed old ground. “And you don’t want to tell this story to the Master.”\nHe shook his head.\n“Because the voice in the dark might be our friend . . . ?”\n“Ally or enemy, it doesn’t matter.” Voussoir retrieved his hands, drying them against his trouser legs. “The more I think about his talents, his genius . . . and even if only half of what he said is halfway true . . . believing that the captains could ever fool someone like him becomes more and more ludicrous. Which means that he must have known what sort of stooge would be sent to meet him, and the whole extraordinary show was intended for one lieutenant standing deep in the ranks.”\nG nodded slowly, then said, “So you didn’t come here to confess. A hundred years to make ready, and I imagine—tell me if I’m wrong—I can see you bringing along a battle plan or two.”\n“Of course,” Voussoir said.\n“And the plan is?”\nThe man who once wore the Master’s body and then spoke to a god had to summon up the energy to stand. Then with a shrug of the broad shoulders, he said, “As a high-ranking officer serving the most powerful military machine in the known universe . . . sir, I assume you have a few tools and leftover powers that you might want to share for a good cause . . . ”\n14\nThousands of years passed, and all that time, the interrogation chamber remained black and empty. Empty and invisible. Those who had so carefully fabricated it were elsewhere. Some died when the Troubles came, and quite a few more were lost after the Great Ship was stolen. But enough had survived in the shadows, and more good souls were brought into the secret works, leading to the moment when all that perfect darkness suddenly came to an end.\nA simple light no brighter than a weakly burning candle took life.\nFrom the darkness on one side, a woman’s voice said, “All right now. Come close.”\nThe old soldier stepped into the glow, dragging the manacled prisoner by one of its jointed limbs.\n“Sister-Witch,” said the woman’s voice.\nSister-Witch made certain that she trusted her grip. Then she reached out, ready for any hand that came out to meet hers.\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}