{"fingerprint": "NlXyxUJsE1jQDD993lroyhlcoFQ=", "sitename": "Clarkesworld Magazine", "title": "Two Ways of Living by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_03_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Two Ways of Living by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3610 words, short story\n Two Ways of Living\n I’ve eaten everything inside my kitchen, and that’s not enough. That’s barely a beginning. A brightly lit all-night restaurant stands across the street, promising broiled-this and boiled-that. Chasing the next feast, I shuffle to the elevator, dropping four floors before staggering into the hallway. That’s where the woman is. She’s standing in my path, and beside her, sniffing the world, is this busy little sheltie dog.\n The dog is what trips me. I don’t see it and suddenly I’m falling, somebody saying, “Bad bad,” and then I’m lying limp on the floor.\n “Sorry bad sorry,” her dog says.\n More and more animals are wearing AIs. That’s some of the current news that found me during breakfast.\n “Are you hurt?” the woman asks.\n That’s what I’m trying to decide. It wasn’t a huge fall, and thankfully my major bones are off-limits. Like the heart and liver, key portions of my skeleton are kept sound during the long fast.\n “I’m all right,” I venture.\n But she isn’t paying attention to me. “Are you okay?”\n “I sorry feel guilty,” the dog says. Not with its mouth, but from somewhere on its broad metal collar. “Guilty sorry bad.”\n “Don’t be,” the woman says. “It wasn’t your fault.”\n Okay. Now I understand.\n The woman finally looks at me. At a moment like this, most people would make tender sounds. But she’s not one of those people, snapping like a gym coach. “Can you stand up?”\n Gym coaches intimidate me. I sit up too soon, and the world spins.\n “Do I need to call somebody?” she asks. Plainly wanting me to say, “No.”\n I shake my head, making the vertigo worse.\n “Where do you live?”\n “Here,” I mutter.\n Narrow-faced and pretty. Both of my companions can be described that way. The dog smells my hands. The woman stares at my face. At my sharp cheeks, the sunken eyes. “I’ve never seen you before,” she warns, full of suspicion.\n I could tell her the truth. Which impresses and offends almost everybody. But I want to avoid long conversations. So I say, “I travel for work.”\n “Really,” she says. The way people do when they don’t believe what they’ve been told. “You look like you’re sick.”\n “I had a bug,” I lie.\n “Cancer, judging by appearances.” Turning to her dog, she asks, “Do you recognize the man?”\n That dark, bright, and very wet nose works its way down my leg. “Old old stinks in elevator, in floor,” says the expert. It sounds like a six-year-old talking. Maybe a boy’s voice, maybe not.\n This isn’t helping. I’m an innocent man, starving but being interrogated by nobodies. Fighting to stand, I tell them, “I have somewhere to be.”\n The woman hears a terminally ill patient. And crabby as can be, she says, “I suppose you need a ride to the hospital.”\n “No, I’m just crossing the street,” I say.\n She says nothing.\n “To eat,” I explain.\n And she smiles, glad for that answer. This is where everything should end, and now both of us are satisfied.\n Except the dog has a different opinion. “Glory cooks,” it says.\n “No,” the woman says.\n The dog says, “Yes.”\n “Shut up.”\n The dog looks at me. “Glory cooks big dinners.”\n “I won’t,” the narrow-faced woman says.\n Whose name is Glory, I realize.\n “Meat and cheese,” the dog suggests.\n Actually, that sounds wonderful.\n “Shut up, you,” says Glory.\n Sounds wonderful, but life is small. I learned that lesson long ago, and I refuse to waste more of what little I have with these two. Skinny legs and skinnier arms push against the floor, then the wall. Standing again, ignoring the rolling of the floor, and with more energy than I’d have guessed possible, I break into a quick saunter.\n “He goes,” says the dog.\n “He wants to leave,” she says. “Let him leave.”\n “We are bad.”\n The dog sounds miserable.\n “We are not bad,” Glory says. “And you’re being exceptionally silly.”\n My building’s security door recognizes my starved face, opens, and then locks behind me, and I can’t hear the others anymore. I survive the hike across the street and order three meals, eating every sugar packet while I’m waiting. Strangers are talking. They look at me and they ignored me. I look at them, measuring all those intangibles that imply happiness and despair. Despite assumptions, I enjoy human company. I like new faces and voices and how smoothly busy each person seems to be, occupying his little life. The first meal arrives, genuine pancakes and cultured sausage. Feasting, I admit to myself that this is the worst up-time so far. Obviously, I reached too far. More reasonable goals are needed. That’s the lesson here. Life is tiny but full of huge choices, and I make a few of those before the Reuben sandwich arrives.\n Three meals total and then a big dessert, and while eating an entire apple pie, I use my ancient phone to call the usual service.\n The limousine is parked outside, waiting for me. Grocery shopping used to be a chore for me, but starvation changes a person. The long aisles are an absolute joy tonight, each one filled with treasures, and despite being weaker than ever, I have such fun loading my groceries into the carts and pushing each cart out to my ride, then ordering the limousine to pull around the back of my building.\n I want to avoid the woman. Her dog seems fine, but she isn’t. I load my feasts into the freight elevator, taking everything back into a kitchen that will be very busy for the next ten days.\n Eat, nap, and eat again. When this began, I assumed that I’d be spending my active days mastering current events and culture. But I never do. Why learn about fads that will just pass away? Endless meals; that’s my life. And injections, and the essential pills. I also VR with my doctor and other experts, tweaking the next stage of this constantly evolving business. Which means a fresh crop of pills and protocols as well as software updates.\n Ten days of feasting become twenty. Everyone, including me, agrees that I need to be fatter than ever.\n Leaving my condo serves no purpose, so I don’t. The final stage, the polishing, is especially arduous. A huge quantity of Soylent has to wash down cans of cultured blubber, and then comes a spectacular purging of the bowels before bed. Which isn’t a bed, of course. And I’m not going to sleep. But passing out of consciousness, I’m able to guide my dream-like thoughts. My cold body is flying naked to the moon. Space is cold like me but the sun is hot and the rocky dead moon of my youth floats green before me. I feel myself growing warm and happy, and just as I’m about to touch down in the new forest, injections wake me. Bright light washes over my naked shriveled body, and the usual sick shivering commences, my metabolism trying to remember how to do its job.\n I wake up starving. My old phone has updated its guts and mind in my absence. Sugar and injections and Soylent and more injections. That’s what happens first. Then my head clears, and I’m sitting in my kitchen, waiting for ten pot pies to cook. Only then do I risk looking at the news. The world seems healthy enough, thank goodness. But on the other hand, the moon is as barren as always.\n I don’t want to linger in this boring, pedestrian world.\n Stronger than last time, I step outside to find fresh air and food. To look at all of the faces in the restaurant. I never see the woman, but I can’t stop watching for her and her generous dog. Then full of meat and cheese, I climb into the waiting limousine and go shopping before coming home again, ready to eat like a shrew.\n I’m on my floor, stepping out of the freight elevator, when the woman ambushes me.\n Quite a lot has changed in twenty-six months.\n She says, “Hi,” and smiles. In a big way, smiles.\n I say, “Hello.”\n With a mocking tone, she asks, “So where do you go on these travels?”\n “Wonderful places,” I tell her.\n Her sheltie sits behind her. “Leave the man alone,” says the dog. The collar is thinner, the voice fuller, older and far more mature.\n The AI has been improved, I assume.\n “So I know what you’re doing,” says the woman. Says Glory. Her voice is so quick that the words crowd close together. “It was what? Ten, twelve years ago when hibernation became possible? Suspending the aging process and all that. I read about it and thought it sounded neat but not for me. And then later, what did I hear? That everybody who went into the program quit after the first sleep or two.”\n “It’s not sleeping,” I say. “And it’s not for just anybody either.”\n “Well, I know that.”\n She knows quite a lot, I’m thinking. At least she believes that she does.\n “Glory,” the dog says.\n Glory ignores her companion. “How many times have you gone under?” she asks me.\n Six times, and that’s none of her business.\n “To do nothing but sleep,” she says. “Hibernate, I mean. That has to cost a lot of money. So you must be very, very rich.”\n Here we go, I’m thinking.\n And I’m not the only one to see troubles looming. “Leave our neighbor alone,” says the dog.\n “And he is our neighbor,” she says smugly. “Mr. Artemus Tenor lives directly above us. In 4C.”\n I need a distraction. For the first time in my life, I throw a question at a dog and expect an answer. “What’s your name?”\n “Salvation,” the sheltie tells me.\n “Really?”\n “Not that I got to pick,” he complains.\n And Salvation is a “he.” I take the trouble to look this time.\n Glory says, “When we saw you that other time, when you kicked my friend—”\n “I tripped,” I say.\n “Before I realized who you were,” Glory continues. “He and I had just moved into this building. So of course I didn’t know what you were doing. But honestly, you looked like you were trouble.”\n “In trouble,” her roommate suggests. “In trouble.”\n “Oh, don’t be that way.” She says that to him but doesn’t stop staring at me. I don’t think it’s possible for two eyes to focus any harder. The woman has done research, I’m guessing. She knows about the trust funds, the lack of family. For all I know, she also found the manifesto published when I was twenty. On Facebook and eternal because of that. “I want to live in an age of easy interplanetary flight.” That’s what I wrote then, and I believe it now. “The solar system will be terraformed, and I can live as the ultimate tourist.”\n This is fourteen years later. Although my appearance and DNA imply that I’m barely mature enough to buy drink or weed.\n “I really need to get home,” I tell my neighbor.\n “Let the man eat,” Salvation says.\n The intense smile vanishes, replaced by a fierce dose of something much, much worse.\n Glory says, “I have a sense about people.”\n Words that cause any sensible person to step back.\n “You and I are very much alike,” she promises.\n “Glory,” her dog says, sounding sad. “We’ve talked about this.”\n “The two of us are dreamers,” she assures me. “And dreamers deserve to be with one another.”\n Salvation runs between us. Which is welcome, at least on my part. The boy is twenty pounds of sleek fur, but I have a comrade here.\n I hope he shouts her down.\n Or nips her on the calf.\n But no. Those dog eyes look up at me. “Go home and eat,” he says. “And while you eat, study this world carefully. Will you please? Learn how we treat our self-absorbed, sociopathic citizens. Not that I can share anything specific. There are privacy laws and professional standards, after all.”\n With that, Glory becomes angry. During my brief life, I’ve never seen anyone leap from loving to furious this quickly.\n “Shit, stop that,” she warns, fists swinging at the air. “You have no fucking right, you little brat.”\n “Hit me,” says the dog. “Then we can stop pretending that this treatment is succeeding.”\n “I should kick you,” she agrees.\n He turns sideways. “Have at it, honey.”\n Balancing sacks of groceries, I shuffle towards my apartment.\n “Thank you,” I shout to the dog.\n Who apparently isn’t a dog at all. Is he?\n I go down and then come up again, forty pounds lighter and moving on tiptoes. Cooking and eating without making any sound. That’s my goal. I don’t want to alert my downstairs neighbor to my presence. Drinking cold oyster stew, I read the latest news from space. Which is good news, for a change. A consortium of tech companies and emancipated AIs are planning the conquest of Venus. That’s the way they describe their venture. A “conquest.” Mars has its own life, microbial but complicated, which is why the UN has declared the world permanently off-limits to earthly settlements. But new technologies have made it possible to pave Venus with bubble cities and artful clouds, and the invasion will cost only a tenth of our wealth and half a century of unrelenting focus.\n The oyster stew is gone, and now I’m a firm believer in Venus.\n Two in the morning is when I finally leave home. But someone anticipated that cleverness. Someone left a note stuck to my door. “Come downstairs when you have the chance,” the slim lady hand has written on paper yellowed with age. “Please,” she added below. Then, “Glory and Salvation,” with her name underlined a self-obsessive twice.\n No restaurant tonight. I want to shop quickly and get home, and it helps that robots have conquered the grocery industry. By dawn, I’m back inside my condo. Eating and eating, and finally, happily, using my toilet again. But the plumbing makes too much noise, or maybe my neighbor is even more compulsive than I realized. Either way, she knocks at my door. She doesn’t knock every hour, but it feels that often. Day or night, it doesn’t matter, and when I am strong or especially angry, I take the trouble to study her through the security camera.\n Glory has grown older, which I expected. But the woman has changed in other ways too. She looks sorry and maybe a little desperate. She doesn’t smile when she hits the door. Even looking up at the camera lens, she won’t pretend to be what she isn’t. “Be a man and talk to me,” says that increasingly severe face.\n Glory always stands alone in my hallway. Her therapist has been replaced or is at home, locked inside a kennel. Unless the dog has died. That final possibility works on me. But man or not, I never respond, not even to ask about Salvation, and after getting fat and drinking a small of pond of Soylent, I check my locks and alarms before going down again.\n Thinking of Venus this time. But not bubble cities or invented clouds. No, my Venus is a realm of acid and fire, and I have the wings of a golden phoenix.\n And with that, I’m awake again, after a fashion.\n Someone is inside my room, standing beside me. Glory is. She says, “Look how skinny you are. How can you do this to yourself?”\n It’s too soon to talk. I can’t even move my mouth. But I see the bedroom door standing open, and beyond that, my apartment door too. The locks have been beaten, and the alarms, and as soon as I’m strong enough, I intend to become very scared.\n “You were so pathetic,” she says. “When I met you. You were this sickly, desperate looking creature. Then I realized that you were hibernating.”\n I don’t hibernate. We’ve talked about this. What I do isn’t sleep or any other process found in nature.\n “How stupid,” she says.\n I close my eyes.\n Out of the darkness, her voice asks, “What if the world ends while you’re down?”\n “We’re dead anyway,” I manage.\n She makes a disagreeable sound.\n I focus on my deep breathing.\n “Eventually I got greedy,” she continues. “I realized that you’re rich and spoiled and crazy, and I wondered if maybe I could get something out of you.”\n I open my eyes, too frightened to make any sound, and this crazy woman is standing over me. “We’re dead anyway,” might be my last words.\n But Glory doesn’t kill me. Not for the next few moments. Both of us remain quiet, waiting for my sugar injections to help. Then very slowly, carefully, I sit up. She doesn’t try to help me. I’m thankful for that, and I’m angry at her too. Both ways. Then my left hand falls off what isn’t a bed, and something wet touches my fingers. That’s when I discover a middle-aged sheltie watching me.\n The dog says nothing. He isn’t wearing a collar or anything else mechanical. Salvation might as well be dead, not having a voice anymore.\n “There’s two ways of living,” Glory says.\n “Just two?” I ask.\n “That’s how simple things are,” she tells me. Then she decides that she’s said enough and falls silent.\n I grab my phone from its cradle. “I’m calling the police,” I announce.\n Glory has a brave face when she wants. Just from the way she stands there, she’s ready for almost anything. “You can’t scare me,” says her body, her eyes. “Do your worst.”\n My worst is this:\n “I’ll press charges against you for breaking in, and I intend to have you thrown in prison. It won’t take many years for you to become an old woman. That’s when I’ll come see you. Before I fly off to Venus, and I’ll still be young man. How’s that going to make you feel?”\n Courage melts. Glory sobs.\n Her dog sniffs at the carpet, at my hand. Nothing in those dark eyes gives any sign of intelligence.\n I want to shove him away. But I don’t.\n “Not prison,” she mutters.\n I throw my legs towards the floor.\n Her skinny hands hold each other, and she watches me.\n “There’s a grocery list on my phone,” I finally tell her. “You’re going to pull the list and buy everything for me. You’ll pay for the food yourself, and you’ll bring everything back here and fix any locks you broke, and I won’t press charges. Probably.”\n She nods and then smiles, liking some part of this.\n “Hurry,” is my advice.\n She puts the grocery on her palm. Which is where modern phones live, it seems. Inside your hand. Then she pulls a short leash from a pocket. A flick of the phone hand causes the leash to wrap around the skinny dog neck, tying itself, and then the woman starts to tug, half-strangling the sheltie as she walks and he fights the tugging.\n “No,” I say.\n She hesitates.\n “Leave the dog with me.”\n The smile stiffens, and she glances down at the sheltie.\n “Go on,” I say.\n Glory looks back at me. She says, “Goodbye,” and I don’t know why. It’s not her words, but it’s the tone. Bittersweet, complicated. I’d ask but I don’t want to dwell on this woman’s peculiar moods. I’m so deep into starvation that I can’t think about anything but the ten thousand calories waiting in my kitchen.\n “And shut the door on the way out,” I warn her.\n The front door closes almost too softly to make sound.\n Ignoring me and ignoring the dropped leash, the dog spends a few moments idly sniffing at the floor, at an empty pill jar, and then, forgetting me completely, wanders into the other rooms.\n I follow when I’m strong enough.\n Oyster stew is a joy, and every bowl of ice cream is slathered in fudge. I eat everything that’s worth eating, and I have a little too much Soylent. I feel gassy. I feel old. The dog watches me now and again, and I finally talk. Just to test him. But he doesn’t show any inkling of comprehension, much less the talent to respond.\n One long trip to the bathroom, and now I’m out of food.\n Glory still hasn’t returned.\n I look at the dog, stare at my phone. Then stepping to the window, I ask the outdoors, “Where is that bitch?”\n “Most likely on her way home,” says the dog.\n I can’t tell where that voice comes from. From inside his mouth, maybe.\n “You mean downstairs,” I suggest.\n Salvation shakes his head, which is strange to see from any dog.\n “What are you talking about?”\n “Glory moved away,” he says. “Eleven months ago, she found a new home and job. In a completely different city.”\n “She’s not coming back to get you?”\n “I’m not hers to ‘get,’” he says, the voice prickly and proud. “I’m a fully emancipated entity, Mr. Tenor.”\n I stare at him.\n He does nothing.\n “Leave me,” I say.\n He sits.\n I walk to the apartment door and open it. “You seem smart. Get out of here now, and leave me alone.”\n “You know, there are two ways of living,” the dog says.\n “So I’ve heard,” I offer.\n “You can live inside yourself,” he says. “As an antisocial, self-absorbed fool.”\n I look out into the empty hallway. I look back at him.\n “Or what?” I ask.\n “How the hell would I know?” he says.\n Then he laughs at me. With his mouth, his eyes. Everything about him is laughing, and I can’t describe what that does to a man.\n Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}