{"fingerprint": "TEw1k9RYXoVIfL5URjvx8Ya6vRo=", "sitename": "Clarkesworld Magazine", "title": "Guest of Honor by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_04_13_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Guest of Honor by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11770 words, novelette, REPRINT\n Guest of Honor\n One of the robots offered to carry Pico for the last hundred meters, on its back or cradled in its padded arms; but she shook her head emphatically, telling it, “Thank you, no. I can make it myself.” The ground was grassy and soft, lit by glowglobes and the grass-colored moon. It wasn’t a difficult walk, even with her bad hip, and she wasn’t an invalid. She could manage, she thought with an instinctive independence. And as if to show them, she struck out ahead of the half-dozen robots as they unloaded the big skimmer, stacking Pico’s gifts in their long arms. She was halfway across the paddock before they caught her. By then she could hear the muddled voices and laughter coming from the hill-like tent straight ahead. By then she was breathing fast for reasons other than her pain. For fear, mostly. But it was a different flavor of fear than the kinds she knew. What was happening now was beyond her control, and inevitable . . . and it was that kind of certainty that made her stop after a few more steps, one hand rubbing at her hip for no reason except to delay her arrival. If only for a moment or two . . .\n “Are you all right?” asked one robot.\n She was gazing up at the tent, dark and smooth and gently rounded. “I don’t want to be here,” she admitted. “That’s all.” Her life on board the Kyber had been spent with robots—they had outnumbered the human crew ten to one, then more—and she could always be ruthlessly honest with them. “This is madness. I want to leave again.”\n “Only, you can’t,” responded the ceramic creature. The voice was mild, unnervingly patient. “You have nothing to worry about.”\n “I know.”\n “The technology has been perfected since—”\n “I know.”\n It stopped speaking, adjusting its hold on the colorful packages.\n “That’s not what I meant,” she admitted. Then she breathed deeply, holding the breath for a moment and exhaling, saying, “All right. Let’s go. Go.”\n The robot pivoted and strode toward the giant tent. The leading robots triggered the doorway, causing it to fold upward with a sudden rush of golden light flooding across the grass, Pico squinting and then blinking, walking faster now and allowing herself the occasional low moan.\n “Ever wonder how it’ll feel?” Tyson had asked her.\n The tent had been pitched over a small pond, probably that very day, and in places the soft, thick grasses had been matted flat by people and their robots. So many people, she thought. Pico tried not to look at any faces. For a moment, she gazed at the pond, shallow and richly green, noticing the tamed waterfowl sprinkled over it and along its shoreline. Ducks and geese, she realized. And some small, crimson-headed cranes. Lifting her eyes, she noticed the large, omega-shaped table near the far wall. She couldn’t count the place settings, but it seemed a fair assumption there were sixty-three of them. Plus a single round table and chair in the middle of the omega—my table—and she took another deep breath, looking higher, noticing floating glowglobes and several indigo swallows flying around them, presumably snatching up the insects that were drawn to the yellow-white light.\n People were approaching. Since she had entered, in one patient rush, all sixty-three people had been climbing the slope while shouting, “Pico! Hello!” Their voices mixed together, forming a noisy, senseless paste. “Greetings!” they seemed to say. “Hello, hello!” They were brightly dressed, flowing robes swishing and everyone wearing big-rimmed hats made to resemble titanic flowers. The people sharply contrasted with the gray-white shells of the robot servants. Those hats were a new fashion, Pico realized. One of the little changes made during these past decades\n . . . and finally she made herself look at the faces themselves, offering a forced smile and taking a step backward, her belly aching, but her hip healed. The burst of adrenaline hid the deep ache in her bones. Wrestling one of her hands into a wave, she told her audience, “Hello,” with a near-whisper. Then she swallowed and said, “Greetings to you!” Was that her voice? She very nearly didn’t recognize it. A woman broke away from the others, almost running toward her. Her big, flowery hat began to work free, and she grabbed the fat, petalish brim and began to fan herself with one hand, the other hand touching Pico on the shoulder. The palm was damp and quite warm; the air suddenly stank of overly sweet perfumes. It was all Pico could manage not to cough. The woman—what was her name?—was asking, “Do you need to sit? We heard . . . about your accident. You poor girl.All the way fine, and then on the last world.Of all the luck!”\n Her hip. The woman was jabbering about her sick hip.\n Pico nodded and confessed, “Sitting would be nice, yes.”\n A dozen voices shouted commands. Robots broke into runs, racing one another around the pond to grab the chair beside the little table. The drama seemed to make people laugh. A nervous, self-conscious laugh. When the lead robot reached the chair and started back, there was applause. Another woman shouted, “Mine won! Mine won!” She threw her hat into the air and tried to follow it, leaping as high as possible.\n Some man cursed her sharply, then giggled.\n Another man forced his way ahead, emerging from the packed bodies in front of Pico. He was smiling in a strange fashion. Drunk or drugged . . . what was permissible these days? With a sloppy, earnest voice, he asked, “How’d it happen? The hip thing . . . how’d you do it?” He should know. She had dutifully filed her reports throughout the mission, squirting them home. Hadn’t he seen them? But then she noticed the watchful, excited faces—no exceptions—and someone seemed to read her thoughts, explaining, “We’d love to hear it firsthand. Tell, tell, tell!” As if they needed to hear a word, she thought, suddenly feeling quite cold. Her audience grew silent. The robot arrived with the promised chair, and she sat and stretched her bad leg out in front of her, working to focus her mind. It was touching, their silence . . . reverent and almost childlike . . . and she began by telling them how she had tried climbing Miriam Prime with two other crew members. Miriam Prime was the tallest volcano on a super-Venusian world; it was brutal work because of the terrain and their massive lifesuits, cumbersome refrigeration units strapped to their backs, and the atmosphere thick as water. Scalding and acidic. Carbon dioxide and water made for a double greenhouse effect. . . . And she shuddered, partly for dramatics and partly from the memory. Then she said, “Brutal,” once again, shaking her head thoughtfully. They had used hyperthreads to climb the steepest slopes and the cliffs. Normally hyperthreads were virtually unbreakable; but Miriam was not a normal world. She described the basalt cliff and the awful instant of the tragedy; the clarity of the scene startled her. She could feel the heat seeping into her suit, see the dense, dark air, and her arms and legs shook with exhaustion. She told sixty-three people how it felt to be suspended on an invisible thread, two friends and a winch somewhere above in the acidic fog. The winch had jammed without warning, she told; the worst bad luck made it jam where the thread was its weakest. This was near the mission’s end, and all the equipment was tired. Several dozen alien worlds had been visited, many mapped for the first time, and every one of them examined up close. As planned.\n “Everything has its limits,” she told them, her voice having an ominous quality that she hadn’t intended. Even hyperthreads had limits. Pico was dangling, talking to her companions by radio; and just as the jam was cleared, a voice saying, “There . . . got it!”, the thread parted. He didn’t have any way to know it had parted. Pico was falling, gaining velocity, and the poor man was ignorantly telling her, “It’s running strong. You’ll be up in no time, no problem. . . . ”\n People muttered to themselves.\n “Oh my,” they said.\n “Gosh.”\n “Shit.”\n Their excitement was obvious, perhaps even overdone. Pico almost laughed, thinking they were making fun of her storytelling . . . thinking, What do they know about such things? . . . Only, they were sincere, she realized a moment later. They were enraptured with the image of Pico’s long fall, her spinning and lashing out with both hands, fighting to grab anything and slow her fall any way possible—\n —and she struck a narrow shelf of eroded stone, the one leg shattered and telescoping down to a gruesome stump. Pico remembered the painless shock of the impact and that glorious instant free of all sensation. She was alive, and the realization had made her giddy. Joyous. Then the pain found her head—a great nauseating wave of pain—and she heard her distant friends shouting, “Pico? Are you there? Can you hear us? Oh, Pico . . . Pico? Answer us!”\n She had to remain absolutely motionless, sensing that any move would send her tumbling again. She answered in a whisper, telling her friends that she was alive, yes, and please, please hurry. But they had only a partial thread left, and it would take them more than half an hour to descend . . . and she spoke of her agony and the horror, her hip and leg screaming, and not just from the impact. It was worse than mere broken bone, the lifesuit’s insulation damaged and the heat bleeding inward, slowly and thoroughly cooking her living flesh.\n Pico paused, gazing out at the round-mouthed faces.\n So many people and not a breath of sound; and she was having fun. She realized her pleasure almost too late, nearly missing it. Then she told them, “I nearly died,” and shrugged her shoulders. “All the distances traveled, every imaginable adventure . . . and I nearly died on one of our last worlds, doing an ordinary climb. . . . ”\n Let them appreciate her luck, she decided. Their luck.\n Then another woman lifted her purple flowery hat with both hands, pressing it flush against her own chest.\n “Of course you survived!” she proclaimed. “You wanted to come home, Pico! You couldn’t stand the thought of dying.”\n Pico nodded without comment, then said, “I was rescued. Obviously.” She flexed the damaged leg, saying, “I never really healed,” and she touched her hip with reverence, admitting, “We didn’t have the resources on board the Kyber. This was the best our medical units could do.” Her mood shifted again, without warning. Suddenly she felt sad to tears, eyes dropping and her mouth clamped shut.\n “We worried about you, Pico!”\n “All the time, dear!”\n “. . . in our prayers . . . !”\n Voices pulled upon each other, competing to be heard. The faces were smiling and thoroughly sincere. Handsome people, she was thinking. Clean and civilized and older than her by centuries. Some of them were more than a thousand years old.\n Look at them! she told herself.\n And now she felt fear. Pulling both legs toward her chest, she hugged herself, weeping hard enough to dampen her trouser legs; and her audience said, “But you made it, Pico! You came home! The wonders you’ve seen, the places you’ve actually touched . . . with those hands. . . . And we’re so proud of you! So proud! You’ve proven your worth a thousand times, Pico! You’re made of the very best stuff—!”\n —which brought laughter, a great clattering roar of laughter, the joke obviously and apparently tireless. Even after so long.\n They were Pico; Pico was they.\n Centuries ago, during the Blossoming, technologies had raced forward at an unprecedented rate. Starships like the Kyber and a functional immortality had allowed the first missions to the distant worlds, and there were some grand adventures. Yet adventure requires some element of danger; exploration has never been a safe enterprise. Despite precautions, there were casualties. People who had lived for centuries died suddenly, oftentimes in stupid accidents; and it was no wonder that after the first wave of missions came a long moratorium. No new starships were built, and no sensible person would have ridden inside even the safest vessel. Why risk yourself? Whatever the benefits, why taunt extinction when you have a choice.\n Only recently had a solution been invented. Maybe it was prompted by the call of deep space, though Tyson used to claim, “It’s the boredom on Earth that inspired them. That’s why they came up with their elaborate scheme.”\n The near-immortals devised ways of making highly gifted, highly trained crews from themselves. With computers and genetic engineering, groups of people could pool their qualities and create compilation humans. Sixty-three individuals had each donated moneys and their own natures, and Pico was the result. She was a grand and sophisticated average of the group. Her face was a blending of every face; her body was a feminine approximation of their own varied bodies. In a few instances, the engineers had planted synthetic genes—for speed and strength, for example—and her brain had a subtly different architecture. Yet basically Pico was their offspring, a stewlike clone. The second of two clones, she knew. The first clone created had had subtle flaws, and he was painlessly destroyed just before birth. Pico and Tyson and every other compilation person had been born at adult size. Because she was the second attempt, and behind schedule, Pico was thrown straight into her training. Unlike the other crew members, she had spent only a minimal time with her parents. Her sponsors.Whatever they were calling themselves. That and the long intervening years made it difficult to recognize faces and names. She found herself gazing out at them, believing they were strangers, their tireless smiles hinting at something predatory. The neat white teeth gleamed at her, and she wanted to shiver again, holding the knees closer to her mouth.\n Someone suggested opening the lovely gifts.\n A good idea. She agreed, and the robots brought down the stacks of boxes, placing them beside and behind her. The presents were a young tradition; when she was leaving Earth, the first compilation people were returning with little souvenirs of their travels. Pico had liked the gesture and had done the same. One after another, she started reading the names inscribed in her own flowing handwriting. Then each person stepped forward, thanking her for the treasure, then greedily unwrapping it, the papers flaring into bright colors as they were bent and twisted and torn, then tossed aside for the robots to collect. She knew none of these people, and that was wrong. What she should have done, she realized, was go into the Kyber’s records and memorize names and faces. It would have been easy enough, and proper, and she felt guilty for never having made the effort.\n It wasn’t merely genetics that she shared with these people; she also embodied slivers of their personalities and basic tendencies. Inside Pico’s sophisticated womb, the computers had blended together their shrugs and tongue clicks and the distinctive patterns of their speech. She had emerged as an approximation of every one of them; yet why didn’t she feel a greater closeness? Why wasn’t there a strong, tangible bond here?\n Or was there something—only, she wasn’t noticing it?\n One early gift was a slab of mirrored rock. “From Tween V,” she explained. “What it doesn’t reflect, it absorbs and reemits later. I kept that particular piece in my own cabin, fixed to the outer wall—”\n “Thank you, thank you,”gushed the woman.\n For an instant, Pico saw herself reflected on the rock. She looked much older than these people. Tired, she thought. Badly weathered. In the cramped starship, they hadn’t the tools to revitalize aged flesh, nor had there been the need. Most of the voyage had been spent in cold-sleep. Their waking times, added together, barely exceeded forty years of biological activity.\n “Look at this!” the woman shouted, turning and waving her prize at the others. “Isn’t it lovely?”\n “A shiny rock,” teased one voice. “Perfect!”\n Yet the woman refused to be anything but impressed. She clasped her prize to her chest and giggled, merging with the crowd and then vanishing.\n They look like children, Pico told herself.\n At least how she imagined children to appear . . . unworldly and spoiled, needing care and infinite patience. . . .\n She read the next name, and a new woman emerged to collect her gift. “My, what a large box!” She tore at the paper, then the box’s lid, then eased her hands into the dunnage of white foam. Pico remembered wrapping this gift—one of the only ones where she was positive of its contents—and she happily watched the smooth, elegant hands pulling free a greasy and knob-faced nut. Then Pico explained:\n “It’s from the Yult Tree on Proxima Centauri 2.”The only member of the species on that strange little world.“If you wish, you can break its dormancy with liquid nitrogen. Then plant it in pure quartz sand, never anything else. Sand, and use red sunlight—”\n “I know how to cultivate them,” the woman snapped.\n There was a sudden silence, uneasy and prolonged.\n Finally Pico said, “Well . . . good . . .”\n “Everyone knows about Yult nuts,” the woman explained. “They’re practically giving them away at the greeneries now.”\n Someone spoke sharply, warning her to stop and think.\n “I’m sorry,” she responded. “If I sound ungrateful, I mean. I was just thinking, hoping . . . I don’t know. Never mind.”\n A weak, almost inconsequential apology, and the woman paused to feel the grease between her fingertips.\n The thing was, Pico thought, that she had relied on guesswork in selecting these gifts. She had decided to represent every alien world, and she felt proud of herself on the job accomplished. Yult Trees were common on Earth? But how could she know such a thing? And besides, why should it matter? She had brought the nut and everything else because she’d taken risks, and these people were obviously too ignorant and silly to appreciate what they were receiving.\n Rage had replaced her fear.\n Sometimes she heard people talking among themselves, trying to trade gifts. Gemstones and pieces of alien driftwood were being passed about like orphans. Yet nobody would release the specimens of odd life-forms from living worlds, transparent canisters holding bugs and birds and whatnot inside preserving fluids or hard vacuums. If only she had known what she couldn’t have known, these silly brats . . . And she found herself swallowing, holding her breath, and wanting to scream at all of them. Pico was a compilation, yet she wasn’t.\n She hadn’t lived one day as these people had lived their entire lives. She didn’t know about comfort or changelessness, and with an attempt at empathy, she tried to imagine such an incredible existence. Tyson used to tell her, “Shallowness is a luxury. Maybe the ultimate luxury.” She hadn’t understood him. Not really. “Only the rich can master true frivolity.” Now those words echoed back at her, making her think of Tyson. That intense and angry man . . . the opposite of frivolity, the truth told. And with that, her mood shifted again. Her skin tingled. She felt nothing for or against her audience. How could they help being what they were? How could anyone help their nature? And with that, she found herself reading another name on another unopened box. A little box, she saw. Probably another one of the unpopular gemstones, born deep inside an alien crust and thrown out by forces unimaginable . . . There was a silence, an odd stillness, and she repeated the name.\n “Opera?Opera Ting?”\n Was it her imagination, or was there a nervousness running through the audience? Just what was happening—?\n “Excuse me?” said a voice from the back. “Pardon?” People began moving aside, making room, and a figure emerged. A male, something about him noticeably different. He moved with a telltale lightness, with a spring to his gait. Smiling, he took the tiny package while saying, “Thank you,” with great feeling. “For my father, thank you. I’m sure he would have enjoyed this moment. I only wish he could have been here, if only . . .” Father? Wasn’t this Opera Ting?\n Pico managed to nod, then she asked, “Where is he? I mean, is he busy somewhere?”\n “Oh no. He died, I’m afraid.” The man moved differently because he was different. He was young—even younger than I, Pico realized—and he shook his head, smiling in a serene way. Was he a clone? A biological child? What? “But on his behalf,” said the man, “I wish to thank you. Whatever this gift is, I will treasure it. I promise you. I know you must have gone through hell to find it and bring it to me, and thank you so very much, Pico. Thank you, thank you. Thank you!”\n Death.\n An appropriate intruder in the evening’s festivities, thought Pico. Some accident, some kind of tragedy . . . something had killed one of her sixty-three parents, and that thought pleased her. There was a pang of guilt woven into her pleasure, but not very much. It was comforting to know that even these people weren’t perfectly insulated from death; it was a force that would grasp everyone, given time. Like it had taken Midge, she thought. And Uoo, she thought. And Tyson.\n Seventeen compilated people had embarked on Kyber, representing almost a thousand near-immortals. Only nine had returned, including Pico. Eight friends were lost. . . . Lost was a better word than death, she decided. . . . And usually it happened in places worse than any Hell conceived by human beings. After Opera—his name, she learned, was the same as his father’s—the giving of the gifts settled into a routine. Maybe it was because of the young man’s attitude. People seemed more polite, more self-contained. Someone had the presence to ask for another story. Anything she wished to tell. And Pico found herself thinking of a watery planet circling a distant red-dwarf sun, her voice saying,\n “Coldtear,” and watching faces nod in unison. They recognized the name, and it was too late. It wasn’t the story she would have preferred to tell, yet she couldn’t seem to stop herself. Coldtear was on her mind.\n Just tell parts, she warned herself.\n What you can stand!\n The world was terran-class and covered with a single ocean frozen on its surface and heated from below. By tides, in part.And by Coldtear’s own nuclear decay. It had been Tyson’s idea to build a submersible and dive to the ocean’s remote floor. He used spare parts in Kyber’s machine shop—the largest room on board—then he’d taken his machine to the surface, setting it on the red-stained ice and using lasers and robot help to bore a wide hole and keep it clear.\n Pico described the submersible, in brief, then mentioned that Tyson had asked her to accompany him. She didn’t add that they’d been lovers now and again, nor that sometimes they had feuded. She’d keep those parts of the story to herself for as long as possible.\n The submersible’s interior was cramped and ascetic, and she tried to impress her audience with the pressures that would build on the hyperfiber hull. Many times the pressure found in Earth’s oceans, she warned; and Tyson’s goal was to set down on the floor, then don a lifesuit protected with a human-shaped force field, actually stepping outside and taking a brief walk.\n “Because we need to leave behind footprints,” he had argued. “Isn’t that why we’ve come here? We can’t just leave prints up on the ice. It moves and melts, wiping itself clean every thousand years or so.”\n “But isn’t that the same below?” Pico had responded. “New muds rain down—slowly, granted—and quakes cause slides and avalanches.”\n “So we pick right. We find someplace where our marks will be quietly covered. Enshrouded.Made everlasting.”\n She had blinked, surprised that Tyson cared about such things.\n “I’ve studied the currents,” he explained, “and the terrain—”\n “Are you serious?” Yet you couldn’t feel certain about Tyson. He was a creature full of surprises. “All this trouble, and for what—?”\n “Trust me, Pico. Trust me!”\n Tyson had had an enormous laugh. His parents, sponsors, whatever—an entirely different group of people—had purposefully made him larger than the norm. They had selected genes for physical size, perhaps wanting Tyson to dominate the Kyber’s crew in at least that one fashion. If his own noise was to be believed, that was the only tinkering done to him. Otherwise, he was a pure compilation of his parents’\n traits, fiery and passionate to a fault. It was a little unclear to Pico what group of people could be so uniformly aggressive; yet Tyson had had his place in their tight-woven crew, and he had had his charms in addition to his size and the biting intelligence.\n “Oh Pico,” he cried out. “What’s this about, coming here? If it’s not about leaving traces of our passage . . . then what?”\n “It’s about going home again,” she had answered.\n “Then why do we leave the Kyber? Why not just orbit Coldtear and send down our robots to explore?”\n “Because . . .”\n “Indeed! Because!” The giant head nodded, and he put a big hand on her shoulder. “I knew you’d see my point. I just needed to give you time, my friend.”\n She agreed to the deep dive, but not without misgivings.\n And during their descent, listening to the ominous creaks and groans of the hull while lying flat on their backs, the misgivings began to reassert themselves.\n It was Tyson’s fault, and maybe his aim.\n No, she thought. It was most definitely his aim.\n At first, she thought it was some game, him asking, “Do you ever wonder how it will feel? We come home and are welcomed, and then our dear parents disassemble our brains and implant them—”\n “Quiet,” she interrupted. “We agreed. Everyone agreed. We aren’t going to talk about it, all right?” A pause, then he said, “Except, I know. How it feels, I mean.” She heard him, then she listened to him take a deep breath from the close, damp air; and finally she had strength enough to ask, “How can you know?”\n When Tyson didn’t answer, she rolled onto her side and saw the outline of his face. A handsome face, she thought. Strong and incapable of any doubts. This was the only taboo subject among the compilations—”How will it feel?”—and it was left to each of them to decide what they believed. Was it a fate or a reward? To be subdivided and implanted into the minds of dozens and dozens of near-immortals . . .\n It wasn’t a difficult trick, medically speaking.\n After all, each of their minds had been designed for this one specific goal. Memories and talent; passion and training. All of the qualities would be saved—diluted, but, in the same instant, gaining their own near-immortality. Death of a sort, but a kind of everlasting life, too. That was the creed by which Pico had been born and raised.\n The return home brings a great reward, and peace.\n Pico’s first memory was of her birth, spilling slippery-wet from the womb and coughing hard, a pair of doctoring robots bent over her, whispering to her, “Welcome, child. Welcome. You’ve been born from them to be joined with them when it is time. . . . We promise you . . . !” Comforting noise, and mostly Pico had believed it.\n But Tyson had to say, “I know how it feels, Pico,” and she could make out his grin, his amusement patronizing. Endless.\n “How?” she muttered. “How do you know—?”\n “Because some of my parents . . . well, let’s just say that I’m not their first time. Understand me?”\n “They made another compilation?”\n “One of the very first, yes.Which was incorporated into them before I was begun, and which was incorporated into me because there was a spare piece. A leftover chunk of the mind—”\n “You’re making this up, Tyson!”\n Except, he wasn’t, she sensed. Knew. Several times, on several early worlds, Tyson had seemed too knowledgeable about too much. Nobody could have prepared himself that well, she realized. She and the others had assumed that Tyson was intuitive in some useful way. Part of him was from another compilation? From someone like them? A fragment of the man had walked twice beside the gray dust sea of Plicker, and it had twice climbed the giant ant mounds on Proxima Centauri 2. It was a revelation, unnerving and hard to accept; and just the memory of that instant made her tremble secretly, facing her audience, her tired blood turning to ice.\n Pico told none of this to her audience.\n Instead, they heard about the long descent and the glow of rare life-forms outside—a thin plankton consuming chemical energies as they found them—and, too, the growing creaks of the spherical hull. They didn’t hear how she asked, “So how does it feel? You’ve got a piece of compilation inside you . . . all right! Are you going to tell me what it’s like?”\n They didn’t hear about her partner’s long, deep laugh.\n Nor could they imagine him saying, “Pico, my dear. You’re such a passive, foolish creature. That’s why I love you. So docile, so damned innocent—”\n “Does it live inside you, Tyson?”\n “It depends on what you consider life.”\n “Can you feel its presence? I mean, does it have a personality? An existence? Or have you swallowed it all up?”\n “I don’t think I’ll tell.” Then the laugh enlarged, and the man lifted his legs and kicked at the hyperfiber with his powerful muscles. She could hear, and feel, the solid impacts of his bootheels. She knew that Tyson’s strength was nothing compared to the ocean’s mass bearing down on them, their hull scarcely feeling the blows . . . yet some irrational part of her was terrified. She had to reach out, grasping one of his trouser legs and tugging hard, telling him:\n “Don’t! Stop that! Will you please . . . quit!?”\n The tension shifted direction in an instant.\n Tyson said, “I was lying,” and then added, “About knowing. About having a compilation inside me.” And he gave her a huge hug, laughing in a different way now. He nearly crushed her ribs and lungs. Then he spoke into one of her ears, offering more, whispering with the old charm, and she accepting his offer. They did it as well as possible, considering their circumstances and the endless groaning of their tiny vessel; and she remembered all of it while her voice, detached but thorough, described how they had landed on top of something rare. There was a distinct crunch of stone. They had made their touchdown on the slope of a recent volcano—an island on an endless plain of mud—and afterward they dressed in their lifesuits, triple-checked their force fields, then flooded the compartment and crawled into the frigid, pressurized water.\n It was an eerie, almost indescribable experience to walk on that ocean floor. When language failed Pico, she tried to use silence and oblique gestures to capture the sense of endless time and the cold and darkness. Even when Tyson ignited the submersible’s outer lights, making the nearby terrain bright as late afternoon, there was the palpable taste of endless dark just beyond. She told of feeling the pressure despite the force field shrouding her; she told of climbing after Tyson, scrambling up a rough slope of youngish rock to a summit where they discovered a hot-water spring that pumped heated, mineral-rich water up at them.\n That might have been the garden spot of Coldtear. Surrounding the spring was a thick, almost gelatinous mass of gray-green bacteria, pulsating and fat by its own standards. She paused, seeing the scene all over again. Then she assured her parents, “It had a beauty. I mean it. An elegant, minimalist beauty.” Nobody spoke.\n Then someone muttered, “I can hardly wait to remember it,” and gave a weak laugh. The audience became uncomfortable, tense and too quiet. People shot accusing looks at the offender, and Pico worked not to notice any of it. A bitterness was building in her guts, and she sat up straighter, rubbing at both hips.\n Then a woman coughed for attention, waited, and then asked, “What happened next?” Pico searched for her face.\n “There was an accident, wasn’t there? On Coldtear . . . ?”\n I won’t tell them, thought Pico. Not now. Not this way.\n She said, “No, not then. Later.” And maybe some of them knew better. Judging by the expressions, a few must have remembered the records. Tyson died on the first dive. It was recorded as being an equipment failure—Pico’s lie—and she’d hold on to the lie as long as possible. It was a promise she’d made to herself and kept all these years.\n Shutting her eyes, she saw Tyson’s face smiling at her. Even through the thick faceplate and the shimmering glow of the force field, she could make out the mischievous expression, eyes glinting, the large mouth saying, “Go on back, Pico. In and up and a safe trip to you, pretty lady.” She had been too stunned to respond, gawking at him.\n “Remember? I’ve still got to leave my footprints somewhere—”\n “What are you planning?” she interrupted.\n He laughed and asked, “Isn’t it obvious? I’m going to make my mark on this world. It’s dull and nearly dead, and I don’t think anyone is ever going to return here. Certainly not to here.Which means I’ll be pretty well left alone—”\n “Your force field will drain your batteries,” she argued stupidly. Of course he knew that salient fact. “If you stay here—!”\n “I know, Pico. I know.”\n “But why—?”\n “I lied before. About lying.” The big face gave a disappointed look, then the old smile reemerged. “Poor, docile Pico. I knew you wouldn’t take this well. You’d take it too much to heart . . . which I suppose is why I asked you along in the first place. . . . ” and he turned away, starting to walk through the bacterial mat with threads and chunks kicked loose, sailing into the warm current and obscuring him. It was a strange gray snow moving against gravity. Her last image of Tyson was of a hulking figure amid the living goo; and to this day, she had wondered if she could have wrestled him back to the submersible—an impossibility, of course—and how far could he have walked before his force field failed. Down the opposite slope and onto the mud, no doubt.\n She could imagine him walking fast, using his strength . . . fighting the deep, cold muds . . . Tyson plus that fragment of an earlier compilation—and who was driving whom? she asked herself. Again and again and again.\n Sometimes she heard herself asking Tyson, “How does it feel having a sliver of another soul inside you?” His ghost never answered, merely laughing with his booming voice.\n She hated him for his suicide, and admired him; and sometimes she cursed him for taking her along with him and for the way he kept cropping up in her thoughts. . . . “Damn you, Tyson. Goddamn you, goddamn you . . . !”\n No more presents remained.\n One near-immortal asked, “Are we hungry?”, and others replied, “Famished,” in one voice, then breaking into laughter. The party moved toward the distant tables, a noisy mass of bodies surrounding Pico. Her hip had stiffened while sitting, but she worked hard to move normally, managing the downslope toward the pond and then the little wooden bridge spanning a rocky brook. The waterfowl made grumbling sounds, angered by the disturbances; Pico stopped and watched them, finally asking, “What kinds are those?” She meant the ducks.\n “Just mallards,” she heard. “Nothing fancy.”\n Yet, to her, they seemed like miraculous creatures, vivid plumage and the moving eyes, wings spreading as a reflex and their nervous motions lending them a sense of muscular power. A vibrancy. Someone said, “You’ve seen many birds, I’m sure.”\n Of a sort, yes . . .\n “What were your favorites, Pico?”\n They were starting uphill, quieter now, feet making a swishing sound in the grass; and Pico told them about the pterosaurs of Wilder, the man-sized bats on Little Quark, and the giant insects—a multitude of species—thriving in the thick, warm air of Tau Ceti I.\n “Bugs,” grumbled someone. “Uggh!”\n “Now, now,” another person responded.\n Then a third joked, “I’m not looking forward to that. Who wants to trade memories?” A joke, thought Pico, because memories weren’t tradable properties. Minds were holographic—every piece held the basic picture of the whole—and these people each would receive a sliver of Pico’s whole self. Somehow that made her smile, thinking how none of them would be spared. Every terror and every agony would be set inside each of them. In a diluted form, of course. The Pico-ness minimized. Made manageable. Yet it was something, wasn’t it? It pleased her to think that a few of them might awaken in the night, bathed in sweat after dreaming of Tyson’s death . . . just as she had dreamed of it time after time\n . . . her audience given more than they had anticipated, a dark little joke of her own. . . . They reached the tables, Pico taking hers and sitting, feeling rather self-conscious as the others quietly assembled around her, each of them knowing where they belonged. She watched their faces. The excitement she had sensed from the beginning remained; only, it seemed magnified now. More colorful, more intense. Facing toward the inside of the omega, her hosts couldn’t quit staring, forever smiling, scarcely able to eat once the robots brought them plates filled with steaming foods. Fancy meals, Pico learned.\n The robot setting her dinner before her explained, “The vegetables are from Triton, miss. A very special and much-prized strain. And the meat is from a wild hound killed just yesterday—”\n “Really?”\n “As part of the festivities, yes.” The ceramic face, white and expressionless, stared down at her. “There have been hunting parties and games, among other diversions. Quite an assortment of activities, yes.”\n “For how long?” she asked. “These festivities . . . have they been going on for days?”\n “A little longer than three months, miss.”\n She had no appetite; nonetheless, she lifted her utensils and made the proper motions, reminding herself that three months of continuous parties would be nothing to these people. Three months was a day to them, and what did they do with their time? So much of it, and such a constricted existence. What had Tyson once told her? The average citizen of earth averages less than one off-world trip in eighty years, and the trends were toward less traveling. Spaceflight was safe only to a degree, and these people couldn’t stand the idea of being meters away from a cold, raw vacuum.\n “Cowards,” Tyson had called them. “Gutted, deblooded cowards!” Looking about, she saw the delicate twists of green leaves vanishing into grinning mouths, the chewing prolonged and indifferent. Except for Opera, that is. Opera saw her and smiled back in turn, his eyes different, something mocking about the tilt of his head and the curl of his mouth. She found her eyes returning to Opera every little while, and she wasn’t sure why. She felt no physical attraction for the man. His youth and attitudes made him different from the others, but how much different? Then she noticed his dinner—cultured potatoes with meaty hearts—and that made an impression on Pico. It was a standard food on board the Kyber. Opera was making a gesture, perhaps. Nobody else was eating that bland food, and she decided this was a show of solidarity. At least the man was trying, wasn’t he? More than the others, he was. He was.\n Dessert was cold and sweet and shot full of some odd liquor.\n Pico watched the others drinking and talking among themselves. For the first time, she noticed how they seemed subdivided—discrete groups formed, and boundaries between each one. A dozen people here, seven back there, and sometimes individuals sitting alone—like Opera—chatting politely or appearing entirely friendless.\n One lonesome woman rose to her feet and approached Pico, not smiling, and with a sharp voice, she declared, “Tomorrow, come morning . . . you’ll live forever . . . !” Conversations diminished, then quit entirely.\n “Plugged in.Here.” She was under the influence of some drug, the tip of her finger shaking and missing her own temple. “You fine lucky girl . . . Yes, you are . . . !” Some people laughed at the woman, suddenly and without shame.\n The harsh sound made her turn and squint, and Pico watched her straightening her back. The woman was pretending to be above them and uninjured, her thin mouth squeezed shut and her nose tilting with mock pride. With a clear, soft voice, she said, “Fuck every one of you,” and then laughed, turning toward Pico, acting as if they had just shared some glorious joke of their own.\n “I would apologize for our behavior,” said Opera, “but I can’t. Not in good faith, I’m afraid.” Pico eyed the man. Dessert was finished; people stood about drinking, keeping the three-month-old party in motion. A few of them stripped naked and swam in the green pond. It was a raucous scene, tireless and full of happy scenes that never seemed convincingly joyous. Happy sounds by practice, rather. Centuries of practice, and the result was to make Pico feel sad and quite lonely.\n “A silly, vain lot,” Opera told her.\n She said, “Perhaps,” with a diplomatic tone, then saw several others approaching. At least they looked polite, she thought. Respectful. It was odd how a dose of respect glossed over so much. Particularly when the respect wasn’t reciprocated, Pico feeling none toward them. . . . A man asked to hear more stories. Please?\n Pico shrugged her shoulders, then asked, “Of what?” Every request brought her a momentary sense of claustrophobia, her memories threatening to crush her. “Maybe you’re interested in a specific world?”Opera responded, saying, “Blueblue!”\n Blueblue was a giant gaseous world circling a bluish sun. Her first thought was of Midge vanishing into the dark storm on its southern hemisphere, searching for the source of the carbon monoxide upflow that effectively gave breath to half the world. Most of Blueblue was calm in comparison. Thick winds; strong sunlight. Its largest organisms would dwarf most cities, their bodies balloonlike and their lives spent feeding on sunlight and hydrocarbons, utilizing carbon monoxide and other radicals in their patient metabolisms. Pico and the others had spent several months living on the living clouds, walking across them, taking samples and studying the assortment of parasites and symbionts that grew in their flesh. She told about sunrise on Blueblue, remembering its colors and its astounding speed. Suddenly she found herself talking about a particular morning when the landing party was jostled out of sleep by an apparent quake. Their little huts had been strapped down and secured, but they found themselves tilting fast. Their cloud was colliding with a neighboring cloud—something they had never seen—and of course there was a rush to load their shuttle and leave. If it came to that.\n “Normally, you see, the clouds avoid each other,” Pico told her little audience. “At first, we thought the creatures were fighting, judging by their roaring and the hard shoving. They make sounds by forcing air through pores and throats and anuses. It was a strange show. Deafening. The collision point was maybe a third of a kilometer from camp, our whole world rolling over while the sun kept rising, its bright, hot light cutting through the organic haze—”\n “Gorgeous,” someone said.\n A companion said, “Quiet!”\n Then Opera touched Pico on the arm, saying, “Go on. Don’t pay any attention to them.” The others glanced at Opera, hearing something in his voice, and their backs stiffening reflexively. And then Pico was speaking again, finishing her story. Tyson was the first one of them to understand, who somehow made the right guess and began laughing, not saying a word. By then everyone was on board the shuttle, ready to fly; the tilting stopped suddenly, the air filling with countless little blue balloons. Each was the size of a toy balloon, she told. Their cloud was bleeding them from new pores, and the other cloud responded with a thick gray fog of butterflylikesomethings. The somethings flew after the balloons, and Tyson laughed harder, his face contorted and the laugh finally shattering into a string of gasping coughs.\n “Don’t you see?” he asked the others. “Look! The clouds are enjoying a morning screw!” Pico imitated Tyson’s voice, regurgitating the words and enthusiasm. Then she was laughing for herself, scarcely noticing how the others giggled politely. No more. Only Opera was enjoying her story, again touching her arm and saying, “That’s lovely. Perfect. God, precious . . . !” The rest began to drift away, not quite excusing themselves.\n What was wrong?\n “Don’t mind them,” Opera cautioned. “They’re members of some new chastity faith. Clarity through horniness, and all that.” He laughed at them now. “They probably went to too many orgies, and this is how they’re coping with their guilt. That’s all.”\n Pico shut her eyes, remembering the scene on Blueblue for herself. She didn’t want to relinquish it.\n “Screwing clouds,” Opera was saying. “That is lovely.” And she thought.\n He sounds a little like Tyson. In places.In ways.\n After a while, Pico admitted. “I can’t remember your father’s face. I’m sure I must have met him, but I don’t—”\n “You did meet him,” Opera replied. “He left a recording of it in his journal—a brief meeting—and I made a point of studying everything about the mission and you. His journal entries; your reports. Actually, I’m the best-prepared person here today. Other than you, of course.” She said nothing, considering those words.\n They were walking now, making their way down to the pond, and sometimes Pico noticed the hard glances of the others. Did they approve of Opera? Did it anger them, watching him monopolizing her time? Yet she didn’t want to be with them, the truth told. Fuck them, she thought; and she smiled at her private profanity.\n The pond was empty of swimmers now. There were just a few sleepless ducks and the roiled water. A lot of the celebrants had vanished, Pico realized. To where? She asked Opera, and he said:\n “It’s late. But then again, most people sleep ten or twelve hours every night.”\n “That much?”\n He nodded. “Enhanced dreams are popular lately. And the oldest people sometimes exceed fifteen hours—”\n “Always?”\n He shrugged and offered a smile.\n “What a waste!”\n “Of time?” he countered.\n Immortals can waste many things, she realized. But never time. And with that thought, she looked straight at her companion, asking him, “What happened to your father?”\n “How did he die, you mean?”\n A little nod. A respectful expression, she hoped. But curious.\n Opera said, “He used an extremely toxic poison, self-induced.” He gave a vague disapproving look directed at nobody. “A suicide at the end of a prolonged depression. He made certain that his mind was ruined before autodocs and his own robots could save him.”\n “I’m sorry.”\n “Yet I can’t afford to feel sorry,” he responded. “You see, I was born according to the terms of his will. I’m 99 percent his clone, the rest of my genes tailored according to his desires. If he hadn’t murdered himself, I wouldn’t exist. Nor would I have inherited his money.” He shrugged, saying, “Parents,” with a measured scorn. “They have such power over you, like it or not.” She didn’t know how to respond.\n “Listen to us. All of this death talk, and doesn’t it seem out of place?” Opera said, “After all, we’re here to celebrate your return home. Your successes.Your gifts. And you . . . you on the brink of being magnified many times over.” He paused before saying, “By this time tomorrow, you’ll reside inside all of us, making everyone richer as a consequence.”\n The young man had an odd way of phrasing his statements, the entire speech either earnest or satirical. She couldn’t tell which. Or if there was a which. Maybe it was her ignorance with the audible clues, the unknown trappings of this culture. . . . Then something else occurred to her.\n “What do you mean? ‘Death talk . . .’“\n “Your friend Tyson died on Coldtear,” he replied. “And didn’t you lose another on Blueblue?”\n “Midge. Yes.”\n He nodded gravely, glancing down at Pico’s legs. “We can sit. I’m sorry; I should have noticed you were getting tired.”\n They sat side by side on the grass, watching the mallard ducks. Males and females had the same vivid green heads. Beautiful, she mentioned. Opera explained how females were once brown and quite drab, but people thought that was a shame, and voted to have the species altered, both sexes made equally resplendent. Pico nodded, only halfway listening. She couldn’t get Tyson and her other dead friends out of her mind. Particularly Tyson. She had been angry with him for a long time, and even now her anger wasn’t finished. Her confusion and general tiredness made it worse. Why had he done it? In life the man had had a way of dominating every meeting, every little gathering. He had been optimistic and fearless, the last sort of person to do such an awful thing. Suicide. The others had heard it was an accident—Pico had held to her lie—but she and they were in agreement about one fact. When Tyson died, at that precise instant, some essential heart of their mission had been lost. Why? she wondered. Why?\n Midge had flown into the storm on Blueblue, seeking adventure and important scientific answers; and her death was sad, yes, and everyone had missed her. But it wasn’t like Tyson’s death. It felt honorable, maybe even perfect. They had a duty to fulfill in the wilderness, and that duty was in their blood and their training. People spoke about Midge for years, acting as if she were still alive. As if she were still flying the shuttle into the storm’s vortex.\n But Tyson was different.\n Maybe everyone knew the truth about his death. Sometimes it seemed that, in Pico’s eyes, the crew could see what had really happened, and they’d hear it between her practiced lines. They weren’t fooled. Meanwhile, others died in the throes of life.\n Uoo—a slender wisp of a compilation—was incinerated by a giant bolt of lightning on Miriam II, little left but ashes, and the rest of the party continuing its descent into the superheated Bottoms and the quiet Lead Sea.\n Opaltu died in the mouth of a nameless predator. He had been another of Pico’s lovers, a proud man and the best example of vanity that she had known—until today, she thought—and she and the others had laughed at the justice that befell Opaltu’s killer. Unable to digest alien meats, the predator had sickened and died in a slow, agonizing fashion, vomiting up its insides as it staggered through the yellow jungle. Boo was killed while working outside the Kyber, struck by a mote of interstellar debris. Xon’slifesuit failed, suffocating her.\n As did Kyties’s suit, and that wasn’t long ago. Just a year now, ship time, and she remembered a cascade of jokes and his endless good humor. The most decent person on board the Kyber. Yet it was Tyson who dominated her memories of the dead. It was the man as well as his self-induced extinction, and the anger within her swelled all at once. Suddenly even simple breathing was work. Pico found herself sweating, then blinking away the salt in her eyes. Once, then again, she coughed into a fist; then finally she had the energy to ask, “Why did he do it?”\n “Who? My father?”\n “Depression is . . . should be . . . a curable ailment. We had drugs and therapies on board that could erase it.”\n “But it was more than depression. It was something that attacks the very old people. A kind of giant boredom, if you will.”\n She wasn’t surprised. Nodding as if she’d expected that reply, she told him, “I can understand that, considering your lives.” Then she thought how Tyson hadn’t been depressed or bored. How could he have been either?\n Opera touched her bad leg, for just a moment. “You must wonder how it will be,” he mentioned.\n “Tomorrow, I mean.”\n She shivered, aware of the fear returning. Closing her burning eyes, she saw Tyson’s walk through the bacterial mat, the loose gray chunks spinning as the currents carried them, lending them a greater sort of life with the motion. . . . And she opened her eyes, Opera watching, saying something to her with his expression, and her unable to decipher any meanings.\n “Maybe I should go to bed, too,” she allowed.\n The park under the tent was nearly empty now. Where had the others gone?\n Opera said, “Of course,” as if expecting it. He rose and offered his hand, and she surprised herself by taking the hand with both of hers. Then he said, “If you like, I can show you your quarters.” She nodded, saying nothing.\n It was a long, painful walk, and Pico honestly considered asking for a robot’s help. For anyone’s. Even a cane would have been a blessing, her hip never having felt so bad. Earth’s gravity and the general stress were making it worse, most likely. She told herself that at least it was a pleasant night, warm and calm and perfectly clear, and the soft ground beneath the grass seemed to be calling to her, inviting her to lie down and sleep in the open.\n People were staying in a chain of old houses subdivided into apartments, luxurious yet small. Pico’s apartment was on the ground floor, Opera happy to show her through the rooms. For an instant, she considered asking him to stay the night. Indeed, she sensed that he was delaying, hoping for some sort of invitation. But she heard herself saying, “Rest well, and thank you,” and her companion smiled and left without comment, vanishing through the crystal front door and leaving her completely alone. For a little while, she sat on her bed, doing nothing. Not even thinking, at least in any conscious fashion. Then she realized something, no warning given; and aloud, in a voice almost too soft for even her to hear, she said, “He didn’t know. Didn’t have an idea, the shit.”Tyson. She was thinking about the fiery man and his boast about being the second generation of star explorers. What if it was all true? His parents had injected a portion of a former Tyson into him, and he had already known the early worlds they had visited. He already knew the look of double sunrises on the desert world orbiting Alpha Centauri A; he knew the smell of constant rot before they cracked their airlocks on Barnard’s 2. But try as he might—\n “—he couldn’t remember how it feels to be disassembled.” She spoke without sound. To herself.“That titanic and fearless creature, and he couldn’t remember. Everything else, yes, but not that. And not knowing had to scare him. Nothing else did, but that terrified him. The only time in his life he was truly scared, and it took all his bluster to keep that secret—!”\n Killing himself rather than face his fear.\n Of course, she thought. Why not?\n And he took Pico as his audience, knowing she’d be a good audience. Because they were lovers. Because he must have decided that he could convince her of his fearlessness one last time, leaving his legend secure. Immortal, in a sense.\n That’s what you were thinking . . .\n . . . wasn’t it?\n And she shivered, holding both legs close to her mouth, and feeling the warm misery of her doomed hip.\n She sat for a couple more hours, neither sleeping nor feeling the slightest need for sleep. Finally she rose and used the bathroom, and after a long, careful look through the windows, she ordered the door to open, and stepped outside, picking a reasonable direction and walking stiffly and quickly on the weakened leg.\n Opera emerged from the shadows, startling her.\n “If you want to escape,” he whispered, “I can help. Let me help you, please.” The face was handsome in the moonlight, young in every fashion. He must have guessed her mood, she realized, and she didn’t allow herself to become upset. Help was important, she reasoned. Even essential. She had to find her way across a vast and very strange alien world. “I want to get back into orbit,” she told him, “and find another starship. We saw several. They looked almost ready to embark.”Bigger than the Kyber, and obviously faster. No doubt designed to move even deeper into the endless wilderness.\n “I’m not surprised,” Opera told her. “And I understand.” She paused, staring at him before asking, “How did you guess?”\n “Living forever inside our heads . . . That’s just a mess of metaphysical nonsense, isn’t it? You know you’ll die tomorrow. Bits of your brain will vanish inside us, made part of us, and not vice versa. I think it sounds like an awful way to die, certainly for someone like you—”\n “Can you really help me?”\n “This way,” he told her. “Come on.”\n They walked for an age, crossing the paddock and finally reaching the wide tube where the skimmers shot past with a rush of air. Opera touched a simple control, then said, “It won’t be long,” and smiled at her. Just for a moment. “You know, I almost gave up on you. I thought I must have read you wrong. You didn’t strike me as someone who’d go quietly to her death. . . . ”\n She had a vague, fleeting memory of the senior Opera. Gazing at the young face, she could recall a big, warm hand shaking her hand, and a similar voice saying, “It’s very good to meet you, Pico. At last!”\n “I bet one of the new starships will want you.” The young Opera was telling her, “You’re right. They’re bigger ships, and they’ve got better facilities. Since they’ll be gone even longer, they’ve been given the best possible medical equipment. That hip and your general body should respond to treatments—”\n “I have experience,” she whispered.\n “Pardon me?”\n “Experience.” She nodded with conviction. “I can offer a crew plenty of valuable experience.”\n “They’d be idiots not to take you.”\n A skimmer slowed and stopped before them. Opera made the windows opaque—”So nobody can see you”—and punched in their destination, Pico making herself comfortable.\n “Here we go,” he chuckled, and they accelerated away.\n There was an excitement to all of this, an adventure like every other. Pico realized that she was scared, but in a good, familiar way. Life and death. Both possibilities seemed balanced on a very narrow fulcrum, and she found herself smiling, rubbing her hip with a slow hand.\n They were moving fast, following Opera’s instructions.\n “A circuitous route,” he explained. “We want to make our whereabouts less obvious. All right?”\n “Fine.”\n “Are you comfortable?”\n “Yes,” she allowed. “Basically.”\n Then she was thinking about the others—the other survivors from the Kyber—wondering how many of them were having second or third thoughts. The long journey home had been spent in cold-sleep, but there had been intervals when two or three of them were awakened to do normal maintenance. Not once did anyone even joke about taking the ship elsewhere. Nobody had asked, “Why do we have to go to Earth?” The obvious question had eluded them, and at the time, she had assumed it was because there were no doubters. Besides herself, that is. The rest believed this would be the natural conclusion to full and satisfied lives; they were returning home to a new life and an appreciative audience. How could any sane compilation think otherwise?\n Yet she found herself wondering.\n Why no jokes?\n If they hadn’t had doubts, wouldn’t they have made jokes?\n Eight others had survived the mission. Yet none were as close to Pico as she had been to Tyson. They had saved each other’s proverbial skin many times, and she did feel a sudden deep empathy for them, remembering how they had boarded nine separate shuttles after kisses and hugs and a few careful tears, each of them struggling with the proper things to say. But what could anyone say at such a moment?\n Particularly when you believed that your companions were of one mind, and, in some fashion, happy. . . . Pico said, “I wonder about the others,” and intended to leave it at that. To say nothing more.\n “The others?”\n “From the Kyber.My friends.” She paused and swallowed, then said softly, “Maybe I could contact them.”\n “No,” he responded.\n She jerked her head, watching Opera’s profile.\n “That would make it easy to catch you.” His voice was quite sensible and measured. “Besides,” he added, “can’t they make up their own minds? Like you have?” She nodded, thinking that was reasonable. Sure.\n He waited a long moment, then said, “Perhaps you’d like to talk about something else?”\n “Like what?”\n He eyed Pico, then broke into a wide smile. “If I’m not going to inherit a slice of your mind, leave me another story. Tell . . . I don’t know. Tell me about your favorite single place. Not a world, but some favorite patch of ground on any world. If you could be anywhere now, where would it be? And with whom?”\n Pico felt the skimmer turning, following the tube. She didn’t have to consider the question—her answer seemed obvious to her—but the pause was to collect herself, weighing how to begin and what to tell.\n “In the mountains on Erindi 3,” she said, “the air thins enough to be breathed safely, and it’s really quite pretty. The scenery, I mean.”\n “I’ve seen holos of the place. It is lovely.”\n “Not just lovely.” She was surprised by her authority, her self-assured voice telling him, “There’s a strange sense of peace there. You don’t get that from holos. Supposedly it’s produced by the weather and the vegetation. . . . They make showers of negative ions, some say. . . . And it’s the colors, too. A subtle interplay of shades and shadows.All very one-of-a-kind.”\n “Of course,” he said carefully.\n She shut her eyes, seeing the place with almost perfect clarity. A summer storm had swept overhead, charging the glorious atmosphere even further, leaving everyone in the party invigorated. She and Tyson, Midge, and several others had decided to swim in a deep-blue pool near their campsite. The terrain itself was rugged, black rocks erupting from the blue-green vegetation. The valley’s little river poured into a gorge and the pool, and the people did the same. Tyson was first, naturally. He laughed and bounced in the icy water, screaming loud enough to make a flock of razor-bats take flight. This was only the third solar system they had visited, and they were still young in every sense. It seemed to them that every world would be this much fun.\n She recalled—and described—diving feet first. She was last into the pool, having inherited a lot of caution from her parents. Tyson had teased her, calling her a coward and then worse, then showing where to aim. “Right here! It’s deep here! Come on, coward! Take a chance!” The water was startlingly cold, and there wasn’t much of it beneath the shiny flowing surface. She struck and hit the packed sand below, and the impact made her groan, then shout. Tyson had lied, and she chased the bastard around the pool, screaming and finally clawing at his broad back until she’d driven him up the gorge walls, him laughing and once, losing strength with all the laughing, almost tumbling down on top of her.\n She told Opera everything.\n At first, it seemed like an accident. All her filters were off; she admitted everything without hesitation. Then she told herself that the man was saving her life and deserved the whole story. That’s when she was describing the lovemaking between her and Tyson. That night. It was their first time, and maybe the best time. They did it on a bed of mosses, perched on the rim of the gorge, and she tried to paint a vivid word picture for her audience, including smells and the textures and the sight of the double moons overhead, colored a strange living pink and moving fast.\n Their skimmer ride seemed to be taking a long time, she thought once she was finished. She mentioned this to Opera, and he nodded soberly. Otherwise, he made no comment. I won’t be disembodied tomorrow, she told herself.\n Then she added, Today, I mean today.\n She felt certain now. Secure. She was glad for this chance and for this dear new friend, and it was too bad she’d have to leave so quickly, escaping into the relative safety of space. Perhaps there were more people like Opera . . . people who would be kind to her, appreciating her circumstances and desires . . . supportive and interesting companions in their own right. . . .\n And suddenly the skimmer was slowing, preparing to stop.\n When Opera said, “Almost there,” she felt completely at ease. Entirely calm. She shut her eyes and saw the raw, wild mountains on Erindi 3, storm clouds gathering and flashes of lightning piercing the howling winds. She summoned a different day, and saw Tyson standing against the storms, smiling, beckoning for her to climb up to him just as the first cold, fat raindrops smacked against her face. The skimmer’s hatch opened with a hiss.\n Sunlight streamed inside, and she thought: Dawn. By now, sure . . .\n Opera rose and stepped outside, then held a hand out to Pico. She took it with both of hers and said,\n “Thank you,” while rising, looking past him and seeing the paddock and the familiar faces, the green ground and the giant tent with its doorways opened now, various birds flying inside and out again . . . and Pico most surprised by how little she was surprised, Opera still holding her hands, and his flesh dry, the hand perfectly calm.\n The autodocs stood waiting for orders.\n This time, Pico had been carried from the skimmer, riding cradled in a robot’s arms. She had taken just a few faltering steps before half-crumbling. Exhaustion was to blame. Not fear. At least it didn’t feel like fear, she told herself. Everyone told her to take it easy, to enjoy her comfort; and now, finding herself flanked by autodocs, her exhaustion worsened. She thought she might die before the cutting began, too tired now to pump her own blood or fire her neurons or even breathe. Opera was standing nearby, almost smiling, his pleasure serene and chilly and without regrets. He hadn’t said a word since they left the skimmer.\n Several others told her to sit, offering her a padded seat with built-in channels to catch any flowing blood. Pico took an uneasy step toward the seat, then paused and straightened her back, saying, “I’m thirsty,” softly, her words sounding thoroughly parched.\n “Pardon?” they asked.\n “I want to drink . . . some water, please . . . ?”\n Faces turned, hunting for a cup and water.\n It was Opera who said, “Will the pond do?” Then he came forward, extending an arm and telling everyone else, “It won’t take long. Give us a moment, will you?” Pico and Opera walked alone.\n Last night’s ducks were sleeping and lazily feeding. Pico looked at their metallic green heads, so lovely that she ached at seeing them, and she tried to miss nothing. She tried to concentrate so hard that time itself would compress, seconds turning to hours, and her life in that way prolonged. Opera was speaking, asking her, “Do you want to hear why?” She shook her head, not caring in the slightest.\n “But you must be wondering why. I fool you into believing that I’m your ally, and I manipulate you—”\n “Why?” she sputtered. “So tell me.”\n “Because,” he allowed, “it helps the process. It helps your integration into us. I gave you a chance for doubts and helped you think you were fleeing, convinced you that you’d be free . . . and now you’re angry and scared and intensely alive. It’s that intensity that we want. It makes the neurological grafts take hold. It’s a trick that we learned since the Kyber left Earth. Some compilations tried to escape, and when they were caught and finally incorporated along with their anger—”\n “Except, I’m not angry,” she lied, gazing at his self-satisfied grin.\n “A nervous system in flux,” he said. “I volunteered, by the way.” She thought of hitting him. Could she kill him somehow?\n But instead, she turned and asked, “Why this way? Why not just let me slip away, then catch me at the spaceport?”\n “You were going to drink,” he reminded her. “Drink.” She knelt despite her hip’s pain, knees sinking into the muddy bank and her lips pursing, taking in a long, warmish thread of muddy water, and then her face lifting, the water spilling across her chin and chest, and her mouth unable to close tight.\n “Nothing angers,” he said, “like the betrayal of someone you trust.” True enough, she thought. Suddenly she could see Tyson leaving her alone on the ocean floor, his private fears too much, and his answer being to kill himself while dressed up in apparent bravery. A kind of betrayal, wasn’t that? To both of them, and it still hurt. . . .\n “Are you still thirsty?” asked Opera.\n “Yes,” she whispered.\n “Then drink. Go on.”\n She knelt again, taking a bulging mouthful and swirling it with her tongue. Yet she couldn’t make herself swallow, and after a moment, it began leaking out from her lips and down her front again. Making a mess, she realized. Muddy, warm, ugly water, and she couldn’t remember how it felt to be thirsty. Such a little thing, and ordinary, and she couldn’t remember it.\n “Come on, then,” said Opera.\n She looked at him.\n He took her arm and began lifting her, a small, smiling voice saying, “You’ve done very well, Pico. You have. The truth is that everyone is very proud of you.”\n She was on her feet again and walking, not sure when she had begun moving her legs. She wanted to poison her thoughts with her hatred of these awful people, and for a little while, she could think of nothing else. She would make her mind bilious and cancerous, poisoning all of these bastards and finally destroying them. That’s what she would do, she promised herself. Except, suddenly she was sitting on the padded chair, autodocs coming close with their bright, humming limbs; and there was so much stored in her mind—worlds and people, emotions heaped on emotions—and she didn’t have the time she would need to poison herself.\n Which proved something, she realized.\n Sitting still now.\n Sitting still and silent. At ease. Her front drenched and stained brown, but her open eyes calm and dry.\n Originally published in The Magazine of Fantasy and Science Fiction, June 1993.\n Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}