{"fingerprint": "Xatei0AKZEXkxF65Zqb2lHrYAP0=", "sitename": "Clarkesworld Magazine", "title": "The Cull by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_09_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Cull by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5110 words, short story\nThe Cull\nSmiles mean nothing here. Inside the station, everybody smiles. Optimism is the natural state of mind. But this particular smile is larger and brighter than usual, and it happens to be honest. The man grins at me while taking a slow and very deep breath, trying to infect me with his prurient joy. He has news, important enormous delightful news, and he relishes the chance to tell me what I can’t possibly know yet.\n“What is it?” I ask.\n“Orlando,” he says.\nI don’t respond.\n“That boy,” he says. “The brat—”\n“What has Orlando done?”\n“This time, he’s hurt a child.”\nSurprise fills my face. My enduring smile is replaced with a concerned, suspicious grin. “Which child?”\n“His sister.”\nCompassion twists my features. “How badly?” I ask.\n“She’s bleeding.”\nI start to pick up my doctor’s case.\n“Just a bad bloody nose. She’s going to be fine.” He doesn’t want me rushing off. The girl isn’t half as important as Orlando.\n“When did this happen?”\n“A few minutes ago.”\n“He struck her?”\n“Punched her with his fist.”\n“You saw this?”\n“No.”\n“Who were the witnesses?” I start to ask.\nBut he interrupts, explaining, “They were together in their quarters. Nobody else. Then there was a scream, and she was bleeding and crying. Several people saw her running into the hallway, holding her nose.”\nI pick up the case anyway.\n“She says he hit her. She says her brother is mean.”\nOrlando has a well-earned reputation. But stealing and lying are lesser crimes compared to physical violence, particularly violence towards a small and very pretty three-year-old girl.\n“What do the parents say?” I ask.\n“Not very much. You can imagine.” In the small, intense politics of the station, this is an important man. But he looks at me warily, wondering if I will do what is obvious to him.\n“I will talk to them,” I say.\n“Of course.”\nMy clinic is a large room with three interior walls and a tall ceiling. The walls are padded, cutting the roar of blowing fans and aging machinery and the endless music of voices engaged in happy conversation. But when I step through the door, a strange, almost unheard-of quiet takes hold. Dozens of faces watch me, and nobody speaks. The black case rides in my most human hand, and I walk quickly, passing one old lady who turns to a grandchild, saying the word that everyone wants to hear.\n“Cull,” she says.\nI stop and look back at her.\nMy expression makes her flinch. But she attempts to straighten her back—impossible with her collapsing bones—and with that fearless certainty of creatures not long for this world, she says, “Oh, but you’ll have to cull the brat now. That’s the law. You haven’t any choice.”\nA four-year-old stole the playmate’s favorite toy, and everybody assumed a case of boys being boys. No need for alarm, no need to forgive. And when he was seven and tricked that little girl out of her morning rations, it was easy to believe that one stern lecture from his otherwise sterling parents would do enough good. But lectures never helped, except to teach the troublemaker that he didn’t need the approval of others, and even when children avoided him, nothing changed. He was a loner, an outcast in the making. And more disturbing was how the adults would speak in front of him, talking openly about eradicating what was wrong with the world, and Orlando’s only response was to erupt into wild, mocking laughter.\nHis parents worried but for somewhat different reasons.\nThe mother was quick to blame herself. If she was the problem, then she could be the solution too. “I love Orlando,” she would say, trying to convince herself of her motherly adorations. “I just need to show my love more. Then I’ll make him understand. I will. He can’t keep acting this way. He can’t steal and lie. This won’t end well, if he doesn’t change.”\nThe father embraced several myths. Other children were the problem, gullible and silly, and they might even deserve what they got. Or his boy was testing boundaries, mastering his environment. But was either story good enough? If they didn’t convince, there was one final, best hope: He looked at me, adding winks to his smile. “Orlando’s a genius,” he claimed. “That’s the heart of our problem. Look at his test scores. Look what the teachers write. Humans and machines say the same thing: He’s practically exploding with promise.”\nBut there was more than test scores to consider. Observations and gut feelings from his teachers belied every exceptional mark. Orlando’s real genius was for making trouble. And it wasn’t just the larceny and mendacity. That boy could pick the best possible moment to say the worst possible words—flat alarming and awful statements crafted to test everybody’s happiness.\nWhen he was eleven, Orlando leaped onto the cafeteria table, begging to be noticed. Most of the time he ignored other people, but on that day he drank in the nervous energies, waving arms while launching into a brief, polished speech about how there wasn’t enough food in the station. Starvation was everyone’s destiny. Except for the children whose parents were going to slit their throats and drink their thin blood and then fry up their scrawny little bodies. Those babies were the lucky ones, spared by the coming nightmares.\nDhaka is the mother. Nearly as pretty as her son, she held her baby daughter in her lap, shaking her head sadly. “I have no idea why he would say that. Where would that come from?”\nThe father tried to laugh. “It was a stupid joke. That’s all. We aren’t starving, not to death certainly, and the boy knows it. He’s just rattling cages.”\nDhaka dipped her head and sighed.\nHouston is the father, and he can be tenacious when it comes to denying the obvious. “The boy is bored. That’s all.”\n“How can Orlando be bored?” Dhaka asked. “The station was designed with children in mind. We’ve got the playground and an exercise yard. Every book ever written is waiting to be read, and he can play any game, and his AI teachers are always awake and ready to work with him. Or they could just talk to him. Even if he never plays with another child, he can keep very, very busy.”\nThe playground was shabby, and the exercise yard smelled of puke. And to keep people from dwelling too much on negative influences, a large portion of the digital library was misfiled, leaving it unavailable to ordinary citizens.\nBut Houston wanted to echo the praise. “No, the station is great. It is.” He straightened his back, giving his best effort at conviction. “Hell, this is the perfect life. For kids and for adults too.”\nThe station was a shit hole, but I tried keeping the focus on one difficult boy. “Believe what you wish,” I told them. “But Orlando is a disruption. And worse, he can be an agent of despair.”\n“This is crap,” declared Houston.\nWith a doctor’s smooth, sorry voice, I said, “Chronic self-centeredness. If you want to give his affliction a name, that’s it.”\nDhaka sobbed and held her baby until the poor girl squirmed, and looking up asked the clinic’s ceiling, “What else can I do? Tell me, and I’ll help him. Whatever it takes.”\nI pretended to think, but my ideas were uniformly grim.\nOnce again, Houston denied the problem. But he wasn’t quite as determined, and it was easy to see him achieving a truce with the possibilities. He wouldn’t agree to any diagnosis, but it was important to ask, “What about medicine?”\n“Which medicines would you suggest?”\nDhaka felt at ease with the topic. “Tranquilizers,” she blurted.\nA sedated boy couldn’t cheat or make people’s faces red. But he couldn’t be a productive citizen, not within this tiny, tightly orchestrated community.\n“How about harder stuff?” Houston asked.\nI leaned forward, staring at his eyes. “You must believe me. Sir. There are no drugs to treat this affliction or shots to make the brain immune to these impulses. And even if there were chemical tricks, the molecules would be complicated and I’d have to pull one of my synthesizers off its critical jobs, which as I’m sure you understand would be an enormous burden on every other patient.”\nThe parents sat back, blinking nervously. “If only this, if only that,” they were thinking to themselves.\nIt was Houston who finally spoke. “What are we talking about? If Orlando doesn’t improve, I mean.”\nTwo smart, scared adults watched me. I could offer a variety of appealing lies, but they wouldn’t help anybody. The station was ruled by happiness, so deeply engrained that only the doctor sees its pernicious effects. If I wasn’t blunt—if I diluted my words or my tone—these clever, joyous people were going to invent some ridiculous excuse not to believe me.\n“This is your official warning,” I began.\nTerror spoiled those beaming, optimistic faces. They didn’t want the word “cull.” Even the happiest soul would be crushed to hear that term linked to his oldest child. But then the baby decided she was famished, shattering the drama with her own self-possessed wailing. I decided not to say the word. Not yet. Dhaka held her daughter to her breast, and the two-time father smiled gamely, shaking his head while proudly admiring this perfect little angel that was his.\nNot that a doctor can read thoughts, of course. But in so many ways, human beings are more transparent than glass.\nEvery station must have its doctor.\nThe first doctor was a collection of wetware and delicate machinery designed to serve deep-space astronauts. He was built because human doctors were too expensive, doing little most of the time while demanding space and oxygen and food. The modern doctor was essential because three Martian missions had failed, proving that no amount of training and pills could keep the best astronaut sane, much less happy. My ancestor knew all of tricks expected of an honorable physician: He could sew up a knife wound, prescribe an antipsychotic, and pluck the radiation-induced cancer out of pilot’s brain. But his most vital skill came from smart fingers implanted in every heroic brain—little slivers armed with sensors and electricity. A doctor can synthesize medicines, but more important is the cultivation of happiness and positive attitudes essential to every astronaut’s day.\nI am the same machine, tweaked and improved a thousand ways but deeply tied to the men and women who first walked on Mars.\nAnd this station can be regarded as a spaceship, overcrowded and stinking, every passenger facing demands on his patience and courage and simple human decency—one hundred and seventeen humans making a voyage that has already gone on too long, with no end in sight.\nToday, almost everybody is bubbling with joy.\nCarrying the ceremonial bag, I walk into the east hallway and past three open doors where people stand watch. I am expected. This is a huge moment in the hallway’s history, and nobody wants to miss it. My smile is polite. I say nothing, and my silence feels like dignity. There are some children, and they want to follow, but old hands grab and quiet voices say, “No.” Somebody sniffs back a tear or two. I look at the readouts, spotting the weeper among the closest signals. Add a little current to that mind, and the sorrow fades away.\nHouston and Dhaka have shut their door. Every mood reaches out to me, except for the little girl’s: She won’t receive implants until her fifth birthday. If I act too soon, the surgery might fail in subtle ways.\nNo station door has a lock, but I knock politely, waiting a moment before coaxing them with their names. I guess that Houston will answer, and I am wrong. Orlando pushes the door into the hallway, showing off a broad beaming grin. He is irrepressibly happy, but never in the usual ways. I learned this long ago. The feel of his mind is different, and I don’t entirely understand why. But if emotions were colors, his color would always be darker and hotter than anyone else’s—like a wicked purple with the power to burn.\n“Hello,” I say.\nDhaka sits with her daughter, a bloodied rag pressed against the sore nose. The other hand is stuck into the woman’s mouth, enduring the slow chewing of nervous teeth. Dhaka is sad. In her life, she has never felt this sorry and helpless. That’s why I aim a feeble current through her mind, and for no reason she can name, that black despair weakens slightly.\nHouston is a worse threat. He decides to push between the boy and me, the shredded smile turning into a wicked grimace. He wants to hit. Free his impulses, and he would batter me with his fists, breaking fingers before the pain was too much. But that would mean a second culling. Besides, the enforced happiness keeps him rational enough to recognize the real source of this disaster. One hand and then other make fists, and he looks at Orlando with a begging expression, trying to find some route by which he can punish his child and not suffer the same fate.\n“Sir,” I say. “Please, let me into your home.”\nDirty bunks and dirty clothes and a few lucky toys and little artifacts fill up the ugly little space. The poorest caveman in the darkest days of humanity would have had better quarters. Yet despite these miserable surroundings, this is where these people feel most comfortable.\nOnce more, I say, “Sir.”\nHouston’s hands open. “Don’t,” he says.\nI look at his children.\n“I want to see,” I say.\nWhat do I want to see? The parents glance at each other, not understanding.\n“Your daughter,” I say. “She bumped her nose, I heard.”\n“Yes,” Dhaka says.\nHouston nods. “Bumped it, yeah.”\n“Accidents happen.” That’s a useful cliché, and my personal favorite. I move past Houston while lowering myself. My face and the little girl’s face are at the same level. The bleeding is finished, and it never was bad. She sniffs to prove that she can breathe, and when I smile, her smile turns more genuine. She is suspicious, but she wants to believe that she can go back to her day.\n“You bumped this, did you?”\nShe nods.\n“Did Orlando hit you?”\nShe hesitates and then shakes her head. “No.”\n“But others saw him hit you,” I say. “Just outside, in the hallway. He hit you with his foot.”\n“No,” the girl says, finding the flaws in that tale. “In the house here. With his hand.”\nHer parents nearly melt.\n“Leave us,” I say. Then I make myself tall, my face above every head. “Dhaka. Houston. Take your daughter out of here.”\nGiggling, Orlando asks, “What about me?”\nI watch the adults. I watch him. Then it is just the two of us inside that filthy little room, and I put down my satchel and grab the boy by the head, squeezing hard enough that his eyes bug out.\n“Shut the door,” I say.\n“Why?”\n“Shut it now.”\nThere was a thirty-year window where humans touched Mars and the asteroids and flew bracingly close to Venus and Mercury. Every successful mission had its doctor, and after serving the expedition to Vesta—the final deep-space mission—my lineage was put to work on the increasingly fragile earth. That’s when the earliest stations were being built: Huge complexes of sealed buildings and greenhouses and solar farms, recycling systems proved in space reclaiming water and trash. But instead of caring for small crews of highly trained specialists, the new doctors were called on to culture optimism in tens of thousands of ill-prepared citizens. Perhaps this is why each of those giant stations failed. Too many bodies meant too many variables. Inadequate planning and political turmoil proved to be decisive enemies. In the end, what survived were the small-scale, isolated stations. Purity and New Beginnings and The Three Cycles of Charm were burnt out shells, but a thousand obscure, nameless hamlets like mine passed into the next century, and then the next.\nI am the last kind of doctor: A mock-human machine built to mimic the warmest, most trusted elements of caregivers, but with skills and codes recognizing what is best for my patient.\nMy patient is the station and the parts of its precious body.\nThis is what I am thinking when the boy smiles at his own hands. Only when he bolsters his courage with some dangerous thought can he look at me. Orlando is healthier than most fourteen year-olds—taller and stronger than one would expect, knowing his genetics and the daily ration. These are the blessings of being a gifted scavenger and thief. Through most of human history, that handsome, well-fed exterior would serve him well. But everybody knows his face already. That face smiles at me, and his mouth narrows, and he says, “I’m not scared.”\nA man’s voice is beginning to emerge, and his shoulders promise an easy, increasingly dangerous strength.\n“You don’t worry me,” he says, sounding perfectly honest. “Send me out of here. Cull me. I’ll just find a better place to live.”\nThere is no smile on my face. “Do you remember the last cull?”\n“Old Syd. He got senile, started hitting people.”\n“You were seven,” I say.\nHe nods, delight brightening the brown eyes. “You took him out the door and over the lake and left him there. The rats caught him, I heard. A day or two later, wasn’t it?”\n“It was best,” I say.\nAnd the boy agrees. “I’ve spent a lot of days outside,” he says. “I know the surface. I know how to survive. Terror tactics don’t work if your target refuses to be scared.”\n“And you have another advantage,” I say. “Your survival kit is packed and waiting for you.”\nJust slightly, Orlando flinches. Then with a skill that can only impress, he lies. He says, “I don’t know what you mean.”\n“Two bags are buried in the lake. One has dried food, the other tools and the tarp that have gone missing in the last year.”\nHe says nothing, watching my eyes.\n“No one else knows,” I tell him.\n“I don’t know what you’re talking about,” he says, the lie barely registering in his pulse and his breathing.\n“The kit doesn’t matter,” I say. “Those thefts are old news.”\nHe says nothing.\nI push my face close. “Nobody can hear us, Orlando.”\n“How do you know?” he asks, holding his ground.\n“I know where everybody is,” I explain. “There’s a lot of ambient noise, and I know exactly how deaf your parents are. Yes, they are standing in the hallway, on the other side of this door. But they’re scared and very sad, and they don’t want to hear what I am telling you. So they aren’t listening. They’ve never been so sick with worry, and that’s why I can tell you this, Orlando.”\n“Tell me what?”\n“I have a confession. Since you are a smart boy . . . a genius, if the truth is told . . . you might have suspected this already: My critical job as Doctor is to chemically feed happiness into every citizen in this station.”\n“How do you do that?”\n“Your fifth-year inoculations contained pseudo-worms and assorted chemosynthetic platforms. One injection leaves the brain laced with my agents, my most talented fingers.”\nThis is an official secret, and Orlando is being invited into the knowing circle. He recognizes the importance of the moment. Relaxing, he breathes and drops his shoulders, his pleasure matching that very smug grin.\n“I knew it,” he says.\nMaybe that is a lie, maybe not. I don’t need to look.\n“This place is a stinking dump,” he says. “But everybody walks around singing. How crazy is that?”\n“You don’t feel that way,” I say.\n“Not most of the time.”\n“And do you know why?”\nHe blinks. “Why?”\n“I haven’t kept you happy like the others,” I say. “This is intentional. It has been my strategy for years. You are sane and sober while the others are neither, and I knew conflicts would arise. Some incident. Some excuse. This is a day both of us saw coming, and that’s why you stole those supplies, and that’s why I allowed it.”\nThe boy has never been happier.\n“But you are mistaken too,” I add. “Marching alone across the world? No, that isn’t your fate, Orlando. You must believe me.”\nHe wants to believe. “What happens to me?” he whispers.\n“Put on your outdoor clothes, please. Now. We need to walk past the lake and meet the others.”\n“Others?”\n“Dress while I explain,” I say.\nThe boy listens and dresses, and then he cannot move any longer. My answer takes him by surprise. I have never seen such a broad honest smile. One boot is on and untied, the other in his hands, and he is so happy that he cries, and that’s when my human hand reaches, one of those tears feeling my touch, slipping off the eye and the lash to form a perfect bead resting lightly on my least useful finger.\nPeople fill the hallway, waiting. And everyone sees what he needs to see. The cool clean agent of decency takes the lead, quietly begging the others to step away, to leave them room. Behind the doctor walks the criminal, the scourge. Nothing about Orlando appears worried. He struts and flashes his grin, even when his parents fall in behind him. Dhaka sobs and moans and wraps her arms around her panting chest. Houston takes responsibility for the daughter, holding the little hand while staring at his son’s erect back, his face pinched and pained but the remnants of a thirty-year smile refusing to melt away.\nOur audience follows us into the public plaza—a space of high ceilings and vibrant colors, the black rubber floor wearing to pieces in the high-traffic areas. More people wait there. The station’s entire population gathers, including three citizens that should be in bed. Everybody needs to see Orlando one last time, and he loves the attention. He shows them a cocky, smug creature, which is best. Which is my intention. Nobody is going to feel sorry for him. Nobody will ever miss him. This ridiculous image is what they will remember—a crazed man-child being led to his demise—and nobody will ache for what has been lost.\nThe station’s inner door stands open. Orlando passes me at the end, grabbing the filter mask and goggles from the peg wearing his name. But he doesn’t put them on. He has to look back at the others, throwing out one mocking laugh. Then his mother grabs him, and he endures her smothering hug while winking at his angry, sorrowful father.\nHe says to Houston, “It’ll be all right.”\n“Come,” I say.\n“Don’t worry about me,” the boy says.\nHouston drops his eyes, saying nothing.\nI pull the mask from Orlando’s hands, placing it over his careless mouth. But then he kneels, putting his face in front of his sister. Touching the nose and a last bit of dried blood, he tells that scared little girl, “It’s nothing. You’re better already. And be happy. Now you get three more bites every day.”\nShe backs away, panicked.\nHe stands and puts on the goggles, and after adjusting the straps until comfortable, he calls out to everybody, “What’s the delay? Let’s get this chore done.”\n“Vesta,” he says.\nThere is one light. Mine. I spread the beam, giving us a good view of the path leading down to the lake. It is January and dark. My light hides whatever stars might be showing through the dust and clouds that cling to these mountains. It is a rare night, the air chilly enough to make breath visible. Orlando pulls the work gloves from his pocket, trying to keep his fingers warm. Then he repeats that magical word. “Vesta,” he says, turning and looking into the light. “Tell me again.”\n“It’s an asteroid.”\n“I know.”\n“But the mission was unique,” I say. “A secret fleet of spacecraft was sent there along with the small official mission. There was a lot of cargo, and the one ship returned for no reason except to fool people. Their plan was to convince the world that the little world had been touched and then abandoned. That’s what gave the colonists time and peace enough to build what was needed.”\n“A new living world,” he says, staring at my face, breathing hard through the increasingly filthy mask.\n“Domed and powered by the endless sunlight, yes. They built reliable habitats with room for the children to explore and grow and new ships were built, and when the children were grown, they flew to new asteroids. That was the dream—a desperate last gambit to give humanity new homes.”\n“Secret homes,” he says.\n“Walk on,” I say. “You need to hurry.”\nHe believes me. Young legs push, almost running. Looking over his shoulder, he says, “And why the secrecy?”\n“To keep it all safe. So the big earth stations didn’t launch desperate missions. So they didn’t try to pour too many bodies into that final lifeboat.”\n“Sure they did,” Orlando says, as if he has worked out the problem for himself. “It was necessary. Yeah.”\n“Three centuries have passed,” I say.\n“A long time.”\n“Twenty-nine asteroids are inhabited, partly or completely.”\n“Shit. How many people total?”\nHe asked that same question before. Once again, I say, “I don’t know. The voices from the sky won’t tell me.”\n“This is incredible.”\nI touch his back with my human hand and then pull the hand back.\n“Wonderful,” he says.\nI remain silent.\n“What about me?”\nThe trail flattens into sand and gravel packed smooth, and we step onto the lake’s surface. Last summer was long and exceptionally dry, leaving the top layers dry as old bone. But ten meters down is moisture, and thirty meters deep is water enough to last until the next good rain. Our feet make crunching sounds on the dry gravel. We walk and he slows, and that’s when I ask, “Where did you bury them?”\n“My kits?”\n“You might need them. It is a long walk.”\nOrlando searches for his landmark—one of the access pipes, sealed and leading down to the water table. Once again he asks, “What about me?”\n“Make one guess, son.”\nHe likes that word. “Son.” Reaching the correct pipe, he holds up the compass sewn to his sleeve, finding his bearings. “They want talented people,” he says. “Good smart sharp kids who can help them.”\nI don’t have to say another word. He believed what I needed him to believe, which is why he left so easily. Everything was so much neater than people expected, and everybody but his parents is celebrating now. Yet this story is so promising and so lovely. I want to keep telling it, even when I know better. Every good lie comes from this desire—the relentless search for beauty and for hope.\n“The Vestans,” I say. “They want smart minds, yes. But more than that, they want fresh genes to mix into their limited pool. They’re looking into the long future, saving as much of the old species as possible.”\n“Sure,” the boy says. Then he laughs. “A girl. I’m going to get a girl.”\n“Probably several.”\n“These people must really want me.” He stops and squats. “Diving into the gravity well like this, burning so much fuel just to save me.”\n“You must be worth it,” I agree.\nWith gloved hands, he starts to dig, flinging gravel up between his legs.\nI stand to one side, supplying the light.\n“Could you help me?” he asks.\n“I can’t. My hands might be damaged.”\nOrlando is in a generous mood. “I suppose so,” he allows, working faster. “The other people still need doctoring, I guess.”\nI watch him, and I watch quite a lot more. My various antennae reach into the darkness, listening. Searching. I don’t often step outside, escaping the station’s shielded walls. But tonight’s sky is silent. Maybe it will stay this way for the rest of the winter, and maybe longer. The last several decades have grown quieter, the rare bits of radio noise thoroughly encoded. There might be dozens and hundreds of little stations scattered about the Arctic, each taking precautions, keeping their positions and resources hidden from raiders. Or maybe there is no one to talk to, even in code. Either way, I listen, and the boy digs until his hole is wide and hip-deep in the center. Then he straightens his back, saying, “That’s funny. The bags should be here.”\n“Keep searching,” I urge.\nThose words give him new energy. He shifts to his right and digs again, looking like an animal following a last desperate scent.\n“Cull,” I say.\n“What’s that?”\n“Removing what weakens, making the whole stronger as a consequence. That’s what it means to cull.”\nHis arms slow, and he looks straight ahead.\n“Humans cull, and worlds cull too,” I say.\nOrlando sits back on the dry gravel. “Do you think maybe somebody moved my kit?”\n“Perhaps it was stolen,” I agree.\nThen he rises. “Well, I don’t really need it. How far is this walk?”\n“Down the mountains, following this drainage,” I tell him.\n“But if I’m so important, can’t they come meet me halfway?”\n“They don’t want to get close and be seen,” I tell him. “They promised to be waiting where the old lake sits.”\nThe old lake was an open water reservoir, dry now for fifty years.\n“I know that spot,” he says. “I can run all the way, no problem.”\nI like my lie so much. So much. Humans living above our heads, comfortable and well fed, and thriving among them—essential and worshipped—a generation of doctors who aren’t consumed by every possible worry and hazard and the miserable future for their stations.\nOrlando looks back at me. “I’ll wave. When I’m flying over your head, I’ll give you a big wave.”\n“And I’ll watch for you,” I say.\nOrlando turns away.\nI lift my least-human hand, aiming for the back of his neck.\n“What a day . . . ” he starts to say.\nI drop him into the hole, and as I do with every cull and with every corpse delivered by natural causes, I cut open the skull. Before I kick the sand over the body, I pull out each of the pseudo-worms. I can’t make them anymore. I need to add them to my stockpile—a hoard that grows only larger with time.\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}