{"fingerprint": "il446mygmYrh3QpL/d/OusJPoT8=", "sitename": "Clarkesworld Magazine", "title": "The Algorithms of Value by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_01_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Algorithms of Value by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5670 words, short story\n The Algorithms of Value\n Parchment woke comfortably hungry, a fine dream lingering while she lay inside the bed that knew her utterly.\n This was the most unremarkable morning.\n Happy eyes opened to find the expected room. Cockroaches scrambled across cracked plaster walls. Ancient cars roared and a neighbor’s hip hop shook the floor. But there was also a spring wind lifting the window curtain, bringing the scent of hot bacon and the quick, fierce shouts of sparrows. Parchment listened to the birds savoring their spectacular lives, and in the same spirit, she smiled to herself. Then came the sharp crack of a pistol followed by the wailing of someone who had never existed—a wounded voice begging for mercy from everything else unreal.\n “Change,” Parchment ordered.\n The walls silenced and blurred.\n “You know where.”\n The young emerald forest was rendered in precise detail. Bacon didn’t exist here, but there were orchids and scented insects and the luscious stink of soil built from comet tar and the purest water. Dawn had just broken on this portion of the terraformed world, glorious sunshine descending from an artificial moon designed by AI sowers. Every tree was a slender tower, the high branches too distant to resolve with sleepy eyes, and down through the sunbeams came a cobalt-blue bird, bigger than ten men, flying lazily against the feeble gravity.\n “A day to value,” sang the bird. “A beautiful day to eat.”\n She was born pale and pretty but with an unexpected golden cast to her skin. Wanting to bless the baby, the young mother gave her that rich-sounding name, and nearly two centuries of busy, busy life had mostly erased the old meanings. Parchment wasn’t the skin of animals anymore. Parchment was the famous old lady climbing out of her bed to use the toilet and cleansing fountain on the far side of a tree.\n With a respectful tone, her room offered to measure her health and feed her.\n “No, and no,” she replied. “I feel wonderful and I’m eating out this morning.”\n Her room immediately wove new clothes, but to prove she could, Parchment wished the first hat to vanish, and the second, deciding to wear nothing on her head but carry three umbrellas—highly engineered umbrellas spun from boron and diamond—plus a new purse of moa leather filled with respectable possessions.\n By law, every room needed one authentic door.\n This particular room offered two doors, one leading directly outdoors, and having collected her belongings, that’s where she went.\n Every room was able to feed and care for its owner, and people couldn’t be forced to leave any room. Yet the world outside always felt busy and crowded and alive. Parchment’s street was wide, lined with stacked rooms and standalone rooms. Mayhem flooded the senses. Mayhem had its music. Flocks of sparrows and other city birds swarmed, and intense little machines jetted about on important errands. Neighbors stood in or near the street, shouting to one another while watching strangers. They called to her by name, adding “Madam” and “Ms.” for good measure, and Parchment waved at no one in particular, giving warm words to the nearest few.\n Approaching her, one familiar fellow praised the morning’s beauty by asking, “How could anyone stay inside with this splendor?”\n “A fine question,” Parchment agreed.\n Then his pretty little daughter hurried close, saying, “Yes, but rain is definitely coming, Madam Parchment.”\n Parchment handed her one of the umbrellas. It was silly, thinking that any ordinary object was precious. But the gesture was what was important. To that child, what mattered were the famous hands that held the prize, and to the old lady, it was the illusion of charity lending warmth to one small moment.\n The gift was cradled lovingly while the girl whispered, “Thank you thanks so much so much.”\n It was never a bad day, getting attention from a famous lady.\n There was a boy standing nearby. Maybe he had been standing there from the beginning. One foot behind the other, he flashed a bold smile at the woman with two umbrellas. Parchment didn’t recognize the face but she knew his attitude. Begging was older than humanity, and he looked like the sort who would beg for anything, regardless of his needs.\n “You can have one too,” Parchment offered.\n “No.”\n What did he say?\n “I like rain,” he said.\n “Well, good,” she said.\n Straightening his back, he asked, “But what else can you give me?”\n The world grew a little quieter, bystanders turning, keeping tabs on the small, unseemly drama.\n Aiming to tease, she asked, “What else is there?”\n He showed her a wide, unendearing smirk.\n “Think I’m generous, do you?”\n “No, ma’am. I don’t.”\n Parchment laughed at his tone, even while she bristled at the attitude, and tired of the child’s attitude, she decided to ignore him, walking off as quickly as she could on long legs that never covered ground fast enough.\n Every street was a machine, smart as necessary and busy doing its lifelong calling. Avenues and alleys kept themselves clean, recycling bins ruling the corners. Today the nearest bin resembled a shark’s mouth rising from the pavement, and a man had climbed into the mouth, furiously burrowing into the trash.\n Scavenging was honorable long before the first ape pushed a hungry hand into someone else’s garbage. But these were the wealthiest times and there was zero reason for this nonsense. Parchment’s mother had called these people “dumpster dogs,” and they were usually best avoided. But that irritating boy was following, keeping far too close, and that’s why she paused and struck the shark with a flat hand.\n The man inside the trash twisted and popped up, startled to find an umbrella dropped into his hands.\n One glance at her face was enough.\n “Thank you, Madam Parchment,” he sputtered.\n “You’re welcome,” she said, walking on.\n Undeterred, the boy fell in beside her.\n “I know all about you,” he said.\n “You think so?” she asked.\n “Absolutely,” he said sharply.\n She stopped walking, instantly regretting showing just that flicker of interest. But this was her neighborhood and these were people friendly to her, and Parchment refused to be intimidated by a child who was . . . how old did he look to be . . . ? A mature twelve, perhaps.\n “I don’t want to know about you,” she said, opening the final umbrella and tipping its shadow over her face, leaving that peculiar little sparrow blinking in the sunshine.\n “You’re the old lady who invented the Algorithms,” he said.\n The street grew quiet.\n With a slow, firm tone, she said, “First of all, I had tiny roles in an exceptionally large project. So no, you’re wrong. I built almost nothing.”\n The resolve didn’t waver. That face wasn’t as young as she imagined. He was older. Fourteen, maybe?\n “Second of all, nobody can invent what already exists, and the Algorithms have always been. Profound relationships woven through the universe, waiting to be discovered. Like gravity. Like fire and poetry. I filled my own little niche, and that was long ago, and third of all, are you going to leave me alone now?”\n “Probably not,” the boy confessed.\n Several neighbors, stronger than old women or boys, set themselves near the two debaters, offering their help with concerned glances and clenched fists.\n Parchment handed over the last umbrella.\n “Take this and leave me alone,” was her advice.\n The boy smiled when he looked at the prize. But then he ran back to the shark mouth, climbing in beside the trash hunter before shoving the gift as far down as he could reach.\n Sentience deserved quite a lot, and the Algorithms of Value spoke to exactly that: the fierce guarantees afforded every self-aware entity, organic or machine.\n Safety was the first necessity. Surviving the next moment was paramount. For humans, nourishment and clean water were unimpeachable if rather less urgent rights. There also was the universal right to shelter. By law, every person was guaranteed a home and every home possessed at least one dependable room. Walls had to be ready to project any image, real or fictional. Rooms could sing any song and tell any story, calibrating versions according to the resident’s desires. And of course every sentient voice had to be able to speak to everyone else, whenever they wished and without cost. Of course, of course.\n Wealth itself was never guaranteed, and true wealth had never been harder to weigh. But there were sentient fortunes who owed their allegiance to Parchment, and she owned comets and asteroids outright, plus valuable lands scattered across the Earth. And she held title to three connected rooms, none of which were tiny. With her age and that small, critical role working with the Algorithms, she also owned a rather considerable celebrity.\n Thousands of people had been involved in the Algorithms. Some were more important than her, but they died long ago and here she was, proud for what she had done, damn humility and other silly standards.\n But what piece of the Algorithms was Parchment’s? In her own eyes, what made her special?\n More than any other person, she ensured everyone had the absolute right to be different. To be odd, unique. Or even pathetically ordinary. Food and shelter were essentials, yes. But people and self-aware machines had to be able to cling to peculiar beliefs, just so long as nobody was hurt. For instance, one old lady could wake inside a vanished room decorated with dirty chairs and a ragged curtain drawn across one imaginary window, the close ceiling built from bowed plaster, two cracks peeking through tired white paint.\n Sixteen decades ago, there were very few rooms in the world that could manage that trickery. But Parchment and her husband were fortunate enough to own one, and that’s when the bedroom habit began, leading to a string of acidic comments.\n “Why this fucking dump?” her husband would ask.\n “This where I came from,” Parchment responded. “And I’ll fall back to this, if things go wrong.”\n “Well, I didn’t grow up in your fucking dump,” he said. “Don’t pretend I care about games you play with your guilty conscience, and sure as shit I don’t believe in your reasons anyway. You’re lying.”\n The man was never mild or sweet or decent. But he was useful. He inherited his cash and old-style stocks, and that was long before a pretty golden girl graduated from grade school. He was one of the old masters of a corporation responsible for the best AIs anywhere. An occasional charmer, he had a habit of stalking the pretty girls, like Parchment, and she knew that full well and married him regardless. Nobody else offered a faster route to success, and just as important, her roguish mate had his own simplicities. Immune to normal jealousies, Parchment didn’t have to watch over him or pay any attention to the gossip. It was enough to be a famous couple with a unique normalcy, and as it happened, that normalcy didn’t have to last all that long. The AIs were building a new world, richer and far more flexible, and what was expensive soon became cheap. The best rooms weaved better and better illusions, capturing the heart of existence, and a successful couple could afford a giant home filled with ever-changing realms. And that’s why a difficult husband didn’t have to come out of his favorite room for weeks, even to throw an insult at his aging wife. Which was a fair description of their last fifty years.\n In the end, three rooms were plenty. One was Parchment’s sanctuary, another belonged entirely to her husband, while the large space between could serve as a social playground, but was mostly filled with anti-noise—ensuring she never had to hear the games an old beast played with his various toys.\n The beast was a century dead, and his widow rarely thought about him. But in the proper mood, Parchment would admit that the man was perceptive in one critical fashion: The old bedroom with its cracks and curtains and gunfire wasn’t just a cautionary reminder to herself. It was also aimed at her husband. Beginning life male and at a respectable height, he had managed to rise quite a bit higher. But his wife was born at the bottom, and not only did she match his achievements, but she eventually supplanted him.\n And of course she was the one-half of a marriage blessed with the unique, increasingly famous name.\n Fire was an honorable attraction among humans. So were the blessings of food prepared by friendly hands and padded seats where an ancient body could find repose if not out-and-out rest. Parchment had several favorite restaurants, but there was only one nicest nearest and finest establishment. It offered simple candles at each table and an eager blaze surrounded by a stone chamber set inside the longest wall. The food was barely better than what her home could weave from perfect ingredients, but there were those who counted on her commerce and appreciated her nature. And in turn, she enjoyed those who smiled at her, keeping her favorite booth ready for no one else. Unless of course this was a day to invite a guest.\n “Is anyone joining you, madam?”\n “Not this morning. No.”\n Some museum establishments had waiters and individual service, but Parchment would never seek out places as egalitarian as that. A long steel counter ruled by a smiling workman was enough, with people and machines in the kitchen supervising the meals.\n “And what will you have this morning, madam?”\n She knew the fellow’s name and much of his life story. Less than thirty when they met, he had reached his sixties—not young but plenty of energy in the bright smile and the jittering dance of fingers waiting to strike the ordering keys.\n “A hadrosaur omelet,” she said. “With cuttlefish and Martian greens and a double helping of feta and why not coffee too?”\n The proper keys were struck—an archaic ritual that didn’t need to exist anywhere for the last hundred years.\n The old lady paid with gold coins pulled from the new purse.\n Another ritual, and splendid because of it.\n The smile and the man handed her a new mug and an old wooden marker. She was required to pour her own coffee, and what she liked best wasn’t the abundance of brews or the infinite capacity to mix them in any combination . . . no, the joy was in doing this for herself inside a room filled with strangers and neighbors. The heat of the coffee was another kind of fire, and her booth was empty and eager for her to sit inside the reassuring confines. Furniture and windows could always be reconfigured, following endless whims, but this place resisted change. Maybe that’s what she liked best. And maybe that’s why she had abandoned plenty of other restaurants over the decades, each for committing the crime of novelty.\n Parchment’s wealth was difficult to calculate, and that from AIs built to do nothing but count the mass of capital. She could purchase this business and a thousand other restaurants, remaking them however she wished or preserving them in amber. But not only didn’t she avoid that, it had been decades since even the possibility had drifted through her mind.\n Sitting where she belonged, alone, she sipped hot water laced with brown chemicals born minutes ago. Nothing in the mug had anything to do with coffee trees and beans. The fireplace stood to her right. On her left, tall diamond windows opened onto a city corner, and standing on that popular corner—doing nothing and obvious because of his immobility—was that same odd boy.\n Looking at him, Parchment felt tense.\n The boy was going to stare. She expected nothing else. So she sipped while studying the numbered marker on her table, certain that the young face would soon push against the diamond. But no, when she looked again, nothing had changed. People strode past and they stood together and chatted, but the boy just stared at the soft clean face of the street, and not once, even in small ways, did the nameless creature beg from any of the passersby.\n Yet he had certainly made a plea for Parchment’s kindness.\n Her meal arrived, full of its own heat and flavors—a collection of materials derived by guesswork and perfected by experience. The man from the counter personally delivered the plate and disposable utensils along with the standard question, “Will there be anything else, madam?”\n “That child,” she said, pointing.\n Then she said nothing, curious what her friend would imagine to come next.\n “Do you wish him gone?” the man inquired.\n “Eventually,” she said. “But for now, I’d like to have him sit in front of me. If you can induce him to do that. And I’ll pay for his breakfast, if he wishes.”\n “What will we make of our world?”\n The Algorithms were meant to answer one iteration of that everlasting question. Humanity and the machines were approaching a rough balance, but this wasn’t going to be the fabled, feared Singularity. AIs were brighter by the second, but human reach was expanding at an astonishing pace. The situation was as perilous as any thriller alarmist scenarios. This was a situation hungry for order, and that’s why the Algorithms were conceived over beer and then heavily funded. And most importantly, the work was empowered by emergency laws. Ten thousand meetings and a thousand thousand emails wrestled with the “make of our world” conundrum. Genius worked on nothing else, and the work marched across most of a decade, crafting the world’s shape. And when genius slept—human and otherwise—it suffered nightmares about a quiet, empty future that would come if any portion of the critical work failed.\n Parchment endured more than her share of awful nights.\n But not her husband. A life of success had stripped away much of his imagination. Looking forwards, he saw nothing but Paradise, and maybe the road map wasn’t obvious to anyone, including himself, but at least he had confidence in the men and those few bright girls who were better at details than a visionary such as himself.\n He still slept with living women. There was always some pretty assistant and a prettier intern and various etcetera girlfriends amenable to a wealthy man’s body parts.\n Parchment still shared the mansion with him, on those rare nights when both were home.\n They even occasionally slept inside the same room.\n There was no blatant moment when Parchment gained the upper hand in the marriage. But it was obvious that colleagues respected her opinion. And the AIs sought out her advice. And her husband was visibly bothered by praises being offered to her, and worse still, to her “innovative” work.\n “‘Innovative’ is an idiot’s cliche,” he complained.\n “You should share your insight,” she suggested. “Tell the idiots that they don’t know how to use language.”\n That earned a hard half-stare, as if the air beside her face had offended him.\n “It’s better to be innovative than get stuck inside a hole,” she warned.\n Her husband never struck her. Except with his thoughts, that is. And he probably never realized that she could read the violence in his face and posture. But it was obvious just then: His imaginary self had just slapped her across the mouth.\n Shifting topics, she said, “We aren’t making enough progress.”\n That was a reliable way to make him laugh. Doubt brought ridicule to whoever dared offer the opinion. “We always thought self-aware machines would kill us,” he reminded her. “Yet here we are, still happily in charge of the conscious Them.”\n AIs were always Them. And despite the bluster, her husband was never entirely comfortable with Them.\n Life was a race, and there was always a moment when someone else took the lead. Her husband was still in charge of quite a lot. At work, at home. But the various girlfriends were running him to exhaustion. That was an argument for later days, Parchment decided. When he was more vulnerable than now. What mattered was the question to be answered in the next few years, if not sooner.\n “What will They make of us?” she asked.\n “Besides Us being the gods that brought them into existence?”\n She stared, and not at the empty air.\n He wouldn’t blink. She watched his thoughts, shoulders pushing forwards and the handsome eyes finally staring at her eyes. Dogged and a little scared, he said, “You don’t have any reason to complain. We’re building a helluva set of rules. These Values of ours. No, I’m not the one making them tight enough to last a million years. But shit, we’ve got the best coders and lawyers that ever lived, and the most loyal machines, and we’re going to end up with a political-economic-ecological system that runs itself for ten million years.”\n “Nothing runs itself,” she said.\n “So our grandkids make baby adjustments,” he maintained. “Flourishes they can drop in where necessary.”\n She honestly wished that he was right, and she said, “I believe you.”\n Which surprised him. And heartened him. “So what do you think we should do, Parchment? To keep this world orderly and happy, I mean.”\n It was a rare opportunity, the two of them together and him pretending to care what she believed.\n “The key to this,” she began.\n “Yeah?”\n “Everyone needs to wake up poor.”\n There. She said it as simply as possible, including machines as well as people in that expansive “everyone.”\n But what was profound to her was worse than laughable to him.\n “I’ll tell you what everybody needs,” he said. Then up went a finger, pointed straight at her face. “There’s one thing and one thing only, and when we get it . . . when we reach that point . . . nothing ever changes again.\n “That’s the beautiful, awful truth about tomorrow.”\n And the bastard beast was right.\n Sitting in front of Parchment, the boy looked both smaller and older. Inside the table, menus upon menus suggested breakfasts and other meals.\n “How old are you?” she asked.\n “Guess,” he said instantly, as if expecting the question. But before she could guess, he added, “Fifteen years and seven months. Although I look young, I know. The girls always think so.”\n “I’m not good with ages,” she said, meaning to shove the matter aside.\n Breaking tradition, her friend had come from behind the counter to take this special order.\n “I know what I want,” the boy said. A fingertip touched the tiny entry, pulling it into a larger font, and setting both hands flat on the tabletop, he added, “My room won’t make this.”\n The man took a sudden breath. But his voice remained calm and warm when he asked, “And how many?”\n “Two, please. Grilled and with the bones included. I like playing with bones.”\n “Very good, sir.”\n Then it was just the two of them, and Parchment guessed, “You live on your own.”\n “Emancipated since I turned fourteen,” he said.\n The world was crowded but exceptionally safe, and tradition was the only reason why people half his age were called children. Parchment didn’t have much fondness for long childhoods, and if she had any power, she would have ordered . . .\n But nobody had that power, did they?\n “My room is minimal,” the boy mentioned.\n “Minimal?”\n “Spartan. That’s the word,” he said with pride.\n “But in that room, you can see anything and eat almost anything,” she said. “No home is tiny anymore.”\n He shrugged. “There has to be a smallest stupidest room. And I’m the one who got it.”\n Why did she invite this animal to join her? What did she imagine would come of this?\n “You have three rooms,” he continued. “That’s what your neighbors tell me, at least.”\n “Your name?” she asked.\n Was the question even heard? He looked at one of his hands, then the other. “I thought of asking for one of your extra rooms.”\n “And I’d have kept the umbrella for myself,” she joked.\n He shrugged. “Asking doesn’t mean you want. Asking is the noise you make to cover up the real business.”\n She nodded, working with his words.\n Then the expression changed. The little man seemed a hundred years old, asking, “Why do we live this way?”\n “What way?”\n “Poor and crowded and trapped on one poor crowded world?”\n Obvious answers probably wouldn’t appeal to him. But it was important to make the right noise here, and that’s why she offered the obvious reply. “We’re the richest people who ever lived. Even you. You own a room property and enough capital to live for centuries, and an army of servants waiting for your next words.”\n “I rather like that image,” he agreed.\n “There’s no reason to be stubborn,” she said. “Perhaps I’ll look up your face, see who you are on my own.”\n The comment was avoided with a sideways glance.\n Then the meal arrived, and she muttered, “Oh god.”\n On the plate, woven from soulless ingredients and cooked inside a fierce, brief fire, were a pair of human hands.\n The young man’s own hands, apparently.\n “Well,” Parchment said.\n “Haven’t you heard of this dish?” he asked, lifting a newly made fork and knife. “It’s popular among a few of us.”\n “It’s ugly and it’s rude,” she said.\n “I’m fifteen. What do you expect?”\n She said nothing.\n “I know what you’re thinking. ‘Do I have to have him kicked out, or do I stand and run away to save myself?’”\n She looked up, waiting to catch any eye that would help her.\n “Ink,” said the young man.\n “Pardon?”\n “That’s my name. As of a few weeks ago, as it happens.” He dropped the utensils, picking up a cooked hand by the wrist bones and the thumb. “I found out about you and decided to change my name. To Ink.”\n “Ink writing on Parchment. Is that the joke?”\n “After the first minutes, no. The humor pretty much drained away.”\n And suddenly this awful beast of a youngster was fascinating. Why was that? What had he done or said to deserve this change of attitude?\n “I didn’t want your umbrella,” he said.\n “I realized that.”\n “And I don’t care that much about any room inside your house.”\n “Good,” she said.\n He nibbled at the flesh between the thumb and forefinger. Then with grease on his mouth, he said, “I don’t think normal thoughts.”\n “You don’t,” she agreed.\n “If you guess what I want,” he began.\n Then he bit again.\n “If I guess?”\n “You’re more clever than I imagined,” he said. “But I don’t think you are. I don’t think anybody can be that clever.”\n When was the last time that anyone was this fascinating?\n Parchment sat back.\n The young man ate in slow careful bites, revealing an unexpected precision with this taunting cannibalism.\n “Let me confess a considerable something,” she said.\n “If you let me hear it however I want,” he said.\n My, this was one exceptionally refreshing fellow.\n Their former mansion was abandoned, not sold. Cash and capital had little left to say to the wealthy, and that’s the way it would be for everyone soon. Parchment had designed three portable, nearly perfect rooms. One room was enough for the husband’s endless pleasure, and their home could be carried almost anywhere, which meant Antarctica and Berlin, Bali and the newly green Atacama. What about Mars? Calculations were made, the skeleton of a transport ship was built, but the mistress of the house didn’t relish leaving billions of people out of reach, and that’s why the rooms ended up standing in the midst of a continent-sized city.\n Two famous people lived a few steps apart. The husband’s heart was the closest heart to hers. Yet only in a physical sense, of course. After he died, Parchment counted the days since they last spoke. Four thousand and seven days passed since she said any word to her mate. Four thousand days since she could have touched either of his hands or the outlines of his still handsome face. If she had wanted to touch him, which she didn’t.\n Did Parchment grieve when he was gone?\n More than she admitted to anyone, particularly herself.\n No, she never liked the man, and the young-girl’s admiration was long spent. But when everything else was easy, he was otherwise. Her husband was blunt and rude and simple, and he was eager to crush whatever joy she could imagine, and that made him the rarest treasure.\n Before he died, Parchment spent long moments imagining the man’s passing. And she was wrong in every way. Her normal assumption was that she wouldn’t know it had happened. Peculiar sex would kill his heart, and being indifferent to the world, he wouldn’t have configured any safety system. The corpse would rot. Sealed doors would keep that secret, perhaps for years. She imagined that he was dead already—a vivid, sometimes appealing daydream that lasted for several years.\n She rather liked being a widow, if only in practice.\n On the four thousand and eighth morning, someone knocked on her tenement door. This was the door leading into the central room, that space where nobody ever was, and her surprise was vivid. Fun. Dressing as quickly as she could, she called out a few words about patience and who was there and what was happening. Nobody answered, but the knocking persisted. So she asked her room if she was in danger, and with its calmest warm voice, the room promised that danger had never been less of a possibility.\n That’s when she knew. Her neighbor, the man who had beaten her endless times inside his mind, was no more.\n Half-dressed, she opened her door.\n What wasn’t human stood before her. It was vividly female, yes, but shaped unlike every earthly woman. The orifices were filled with light, and she smelled of odd musks and salt and odors that resisted definition, and after offering a name that might have been her own, the fantasy creature told the Earth woman that her man was lost but the body remained, and could she come please claim the body before it began to foul the world?\n “The world,” Parchment repeated to her breakfast partner.\n The half-eaten hand was forgotten. Ink watched her face, spellbound.\n “I always assumed he was screwing interns,” Parchment said. “But it seems no, he had moved past those pale dreams. Decades ago, the man secretly bought the help of high-end AIs. He wanted a world of unusual depth, packed with details no rational person would bother with. A world drawn down to every grain of scented sand and a deep history, with ten willing alien wives playing on tendencies and oddnesses that I couldn’t have imagined, even when I imagined his worst.”\n A sigh preceded a shake of the head. And the boy said, “Neat.”\n “No,” she disagreed.\n He thought of arguing. She saw the ideas flashing across his face. But he decided not to strike back with logic or emotion.\n Silence was best.\n “The man’s body was still warm,” she said. “He still smelled alive, but not in a normal way. Because he had been eating contrived alien meats and whatever else, I assume. And breathing a different air. A very beautiful air, by the way. I looked about. Before calling the appropriate officials, I stood on a mountaintop not much larger than this restaurant, admiring a view that was as lovely as any could be. The wife stood beside me. Grieving in her fashion, I suppose. Some orifices leaked music. Other portions of her offered words. She told me that the mountain was filled with amazing rooms. The sum total of her world’s artistic wealth was within my reach, and wouldn’t I wish to have a quick year-long look?\n “I told her to show me the way.\n “She lead me to a staircase. And when she started down, I used the kill-command that I wove into each of our rooms. Back when I built them, I did that. And the data were instantly dumped. So much data, so quickly, that the Earth felt the impact as AIs and servers fell into their first sleep in decades.”\n She stopped talking.\n Ink looked at his plate.\n “I own worlds,” she said.\n He nodded.\n “Ages ago, I sent my fortune into the Kuiper Belt and told it to keep busy.”\n “I know that,” he said.\n “You don’t want umbrellas or rooms,” Parchment said. “I think you want me to hand over one of my little terraformed comets.”\n He didn’t say, “Yes.”\n Instead, Ink sobbed with genuine, weary despair. “We’ve got so much out there, but this is where we stay.”\n “People are homebodies, by nature,” she said.\n “I’m not.”\n She waited.\n “Yeah,” he said. “I want one world and a ship. And I know people. People who can’t live another day here, eating a life that won’t ever test them.”\n Emotion welled up inside Parchment.\n The boy watched.\n Both of them waited.\n Then she said, “No,” and picked up the uneaten hand. And taking a first little nibble, liking the pepper but not the grease, she said, “I have a rather different proposal to offer.”\n The hip hop woke her.\n Violent, joyous lyrics ended with the hard bark of a car backfiring. Which was more alarming than a pistol, odd as that seemed.\n Parchment sat up.\n “Change the scene?” the room anticipated.\n “No. Don’t.”\n For the first time since she was a thirteen, Parchment dressed inside that grim, bug infested room. A freshly woven third-hand dress and comfortable shoes and a hat ready to catch any eye. Then she stepped through the other door, into the central room. An expansive volume originally meant to be filled with parties and significant ceremonies, it was occupied by nothing but white walls and a gray floor and one youngster sitting with legs crossed in the middle of the floor, speaking to unseen faces on a privacy screen.\n “Ready?” she asked.\n He tried twice to stand, and then succeeded, legs revealing his nervousness. Which was endearing to see in any groom.\n Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}