{"fingerprint": "FgIGuSLDaK0k2XJmYnTHktro5bk=", "sitename": "Clarkesworld Magazine", "title": "Bonobo by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_06_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bonobo by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5710 words, short story\nBonobo\nJUNE\nLiving with a stranger. For eighteen years, that’s what June had been doing.\nWhich was the second most painful lesson from that brutal Sunday.\nTidy was the stranger’s name. Who happened to be June’s quiet child. Always the least happy of her three kids, or at least that’s what she pretended to be. But it bears mentioning that the girl was never diagnosed with depression or displayed any willingness for self-harm. Not in the presence of her mother, she didn’t. Which was why June refused to accept even a gram of the necessary blame.\nTidy’s brothers and classmates/friends—they’re the ones who should have rung the alarms. But everyone was just as ignorant as June was, or so they would vehemently claim.\nAs it happened, her daughter had been a joy for those last few weeks. Not as prickly as usual, or sour. Almost friendly, in fact. But that’s because she had made up her mind already. That was an insight June gained later. Critical decisions had been made, but Tidy kept her news secret, waiting for the most miserable possible moment, which happened to be on her eighteenth birthday.\nOf course.\nClaiming her usual chair in the VR room, Tidy ignored all the happy noise about best wishes and celebrations. Her little brother was sitting near the door, ready to escape as soon as this business was done. Home from college, Tidy’s big brother joined June on the sofa. Eighteen and now an adult, the stranger had a flesh-and-blood audience of three, while her dad sat half a continent away. Which wasn’t nearly distant enough, so far as June was concerned. But that ugly history didn’t matter to the story. Tidy had requested her father’s presence, and that’s why his face dominated the room. On the squidskin wall, smiling like an idiot, but at least showing the good sense of keeping his “partner” out of sight.\n“I have news,” Tidy began.\n“An announcement,” she added.\nThen she inhaled a breath so deep and long that it seemed to leave the room full of vacuum and nervous energy.\nAt least that’s how things felt to a decidedly anxious mother.\n“‘Be whoever you want to be.’”\nHer daughter said those words, complete with the obnoxious air quotes.\nLooking at one parent, then the other, she said, “That’s what you told me when I was growing up. ‘Be whoever you want to be, Tidy.’”\nOne easy assumption was available: Their daughter at long last had decided on a college. And teased with that possibility, June let herself settle in, making ready to feel very, very happy.\nThen the girl lashed out.\nHard.\n“I’m going to leave the species,” she said.\nThe announcement was too large, too peculiar. Six words elicited so much shock that June suddenly felt nothing at all. What did her daughter just tell her? What did those sounds even mean? And why did the boys look so small, mute, and foolish? Even a little bit scared?\n“‘Be whoever you want to be,’” the stranger kept quoting. “‘Shoot for the stars, Tidy. Don’t live an ordinary life. Be special. Be magnificent. Be ridiculously happy.’”\nNobody appeared happy. Besides Tidy, of course.\nWhat they needed now was someone who would say the obvious and very necessary words.\nThank goodness, they had a fifteen-year-old boy in their midst.\n“Well, that sounds fucking stupid,” said Wonder.\nThen after making a big fart sound, he asked, “You want to fucking what?”\n“‘Leave the species,’” said their big brother. Said Sweetness.\nThis was a day for quoting others, it seemed.\n“Is that even possible?” June muttered. Except hearing herself, she began to recall news threads about exactly this incredible, unlikely subject . . .\n“Oh, it’s very possible,” announced the useless parent sitting in an entirely different state.\nThat’s when June stood. A woman accustomed to anger, yet she was so emotional that she lost her bearings, her focus. Shivering, she made fists and swung her arms. But oddly, her fury wasn’t aimed at her daughter. No, what enraged her was her personal sense of helplessness, the emptiness inside and how very ordinary words kept leaking out of her mouth.\n“I don’t understand,” she said.\nShe said, “Explain this to me. Why even think this way?”\n“Because human beings are monsters,” the girl stated, using her sourest tone. “Because humanity is responsible for all of the world’s ills, and I don’t want to belong to a pack of murderous chimps.”\nAnd with that, one obvious explanation offered its services. An answer so perfect, so easy to embrace, that June would never rid herself of the idea.\nIntelligence. That was the problem here.\nTidy wasn’t just June’s saddest child. She was the smartest one too. Which said quite a lot, what with each of the Mojave kids being certified as gifted. But brilliance was more a burden than a blessing. June had realized that years ago. Powerful minds demand challenge, and even more important, genius hungers for distraction. And that’s what this nonsense was. June knew: Tidy’s teachers had failed her. Her daughter had grown bored with school, and throughout her life, whenever she was bored, the girl found ways to make her family crazy.\nAt this point, the absent father chimed in. “Well, I’m not a monster,” he stated, following that falsehood with a charmless long laugh.\nJune’s ex was named August.\nMake the easy jokes. Go on. But their names were coincidences, nothing more, and this family hadn’t laughed at the lazy punch lines in twenty years.\nJune shot her husband with a warning glare.\nBut he didn’t notice. He was busy looking offscreen, presumably waiting for feedback from the love of his life.\nJune looked at the floor, at her own fists, then the floor again.\nIt was the college-age brother who finally attacked with logic.\n“You can’t do this,” Sweetness warned. “Chromosome tailoring costs a fortune, and you don’t have that kind of money.”\nTidy just shrugged and sat back. “I’m an adult now, and the college trust belongs to me.”\nThat brought a round of painful sighs.\n“I’ve done my research,” she continued. “I know what’s possible and what I can afford. Yes, I considered waiting ten or twenty years, banking that the costs drop. But I’m the absolute ideal age now. Today. So I won’t wait. You can try to change my mind. Go on. But you won’t say a word that matters.”\nHer audience was offended. And scared. And they were utterly helpless too. And the emancipated still-human plainly enjoyed it all.\nWonder said, “This is bullshit.”\nAugust said, “No, this is a prank.”\n“Dad, I don’t think it is,” said Sweetness.\nAll that while, June said nothing. Which felt like the most damning response. A mother’s silence—undefined judgment joined with unnavigated rage.\nOnce again, this stranger imitated her parents’ voices. “‘Oh, Tidy. You can achieve anything you set your mind to.’”\nJune winced, and she ached.\n“Except nobody ever means those words,” the girl continued. “When people talk about success, they mean incremental, ordinary accomplishment. But I refuse to be incremental or ordinary. And that’s what makes all of this so worthwhile.”\nThe other human faces dipped.\n“‘Be thankful we live in a free society,’” she quoted.\n“Tidy. Oh, Tidy,” said August.\n“Except nobody is free,” the girl insisted. “We’re slaves to our evolution, our heritage. Brains are tiny boxes. Boxes stuffed with self-importance and limited capacities. But I’m going to yank out the old ideas, and that’s how I’ll escape this dangerous, damning life of yours.”\nAnd with that, she paused.\nStared at her mother, and waited.\nBut June refused to strike the bait. She was already perfecting the crystalline silence that would prove invaluable in the coming years and decades. Millions of parents were going to experience what she was suffering now. There would be endless opportunities to sit with friends and sit with strangers, pretending to listen to their ordinary miseries, and all that while June would chew on a wise lip, offering nothing that could be confused for encouragement or advice.\nYes, June’s daughter was among the very first to plunge into this asylum.\nAnd yes, it was easy to feel a little smug about that distinction.\nBut these weeping people were fools, wasting time and pain while begging with their own natures. Nothing was more useless than trying to force yourself to accept what should never be allowed. Only idiots wanted to keep on loving creatures that were turning their backs on their parents. And June would never help weaklings such as them. Forgiveness and love. Those were good things, but they had zero value if you gave those gifts to every beast in the jungle.\nShe closed her eyes, then opened them again.\nOn the squidskin, a handsome man was weeping, almost blubbering, and seeing that, June wiped her dry cheeks, proving her own resolve.\nThen the no-nonsense fifteen year old offered one more blunt question.\n“Goddamnit,” Wonder called out. “So what the hell species are you going to turn yourself into?”\nTIDY\nPeople kept making the same mistake.\nThat Sunday and for the next several weeks.\nNo, Tidy wasn’t becoming a bonobo. That particular species of ape already existed—an arguably superior variety of humanity—and there was zero reason to duplicate what nature had mastered on Her own. Besides, every rain forest was struggling, and a million new mouths weren’t going to help the suffering natives. Furthermore, that wholesale restructuring of DNA was expensive and problematic, and too often fatal. And if one final reason was needed, then Tidy would admit that she hated to camp. Camping meant bad food and being cold and feeling the rain. Even those vacations inside the family RV were awful, and she wasn’t willing to spend a fortune just to be miserable for the rest of her days.\n“I’m becoming Pan amare,” she told everyone who asked, and plenty of others too.\n“Oh, that’s the bonobo,” people would say.\nSure, it was the name used in the news, in social media. And most of all, by the politicians and cultural warriors who were fighting each other to be noticed over the disapproving din.\nBut her species’ true name was Pan amare.\n“The ape of love.”\nGood noble reasons made her select that species. First of all, not only did they wear the perfect name, but the very best ideas were attached to their nature. Also, amare was the most popular choice, in America and worldwide. So she wouldn’t be born endangered, which was important. Essential. And best of all, the transformation wasn’t just affordable, but Tidy would be finished in only sixteen weeks, and if she avoided medical complications, she’d still have enough funds leftover for a good state university.\nAs soon as the decision was made, Tidy felt happier than she had ever been.\nThose next weeks were spent making ready. Which included practicing what she would say to her family.\nBut Mother surprised her. Instead of insults and promises of retribution, the woman offered a stoic, cob-up-her-ass attitude that Tidy had never envisioned.\nAnd here was another surprise: Sweetness took their mother’s role. Sowing doubts. Making imprecise threats. Claiming that Tidy would suffer second thoughts and eventually wander back to her own kind.\nAt that point, thankfully, Father started reading from the script.\n“Oh, I don’t care either way, darling.”\nFlashing a desperate smile, he said, “However you look. However you sound. You’ll still and always be my little girl.”\nWhat a sad, silly primate.\nThen Wonder had to drop in his visceral noise. “So you’re going to have long arms and screw all the time. Is that what you want?”\nThis was the great misunderstanding. This was what people repeated again and again. Did anyone ever even try to listen to Tidy?\nHer appearance was not going to change.\nNot that much, not really.\nOh, there’d be physical manifestations. Strength, for instance. Male amares grew stronger in terms of emotional control, but they’d have to surrender a portion of their muscle mass. While women gained both kinds of strength. And yes, there’d be little overhauls of hair and skin, and the organs playing roles with sex would be tweaked. But those were markers of self more than functional revampings. Details hardly worth mentioning, and for Tidy, that clinical minutia was tedious at best.\n“Where you going to have this shit done?” Wonder eventually asked.\nThe nearest amare-ready clinics were full, but Nevada had twenty facilities to choose from—most of them in Reno, oddly—and that’s where Tidy would spend the next four months.\n“Reno’s a shithole,” her little brother said.\n“It’s near Lake Tahoe,” Father said. As if she was just another graceless tourist.\n“You’ll sleep on this and change your mind,” Sweetness insisted.\nWhile Mother made herself sit down again, finally. But staring at her daughter with the most remarkable intensity, and yes, a pure malevolence. So much so that for the rest of her life, an amare woman would remember that one moment, and weep.\nOn schedule, Tidy moved to Reno, renting a studio apartment across the street from the clinic.\nA young man lived next door.\nHe was hairless and too skinny, fatigue clinging to his waxy frame. Light as this genetic work tried to be, fevers and bed rest were inevitable. And not one original hair would survive the onslaught.\nGood. Tidy hated her ugly brown pelt.\n“You’re undergoing the change,” she said to him.\n“I am,” he said. Then he shrank even more, asking, “How about you?”\n“Oh, yes.”\nThe man looked up at her face and then her body. A small creature to begin with, maybe in his late twenties.\n“So we’ll be screwing soon,” he said.\n“What’s that?”\n“You’re amare, right? Not one of the others?” Genuinely panicked, he explained, “They’re building a couple werewolves too. To keep their profits up and all.”\n“Werewolves” was another misapplied name. But the bigger problem was this unwelcome talk about sex.\n“Why do you think we’ll be screwing?” she asked.\nThe man’s back found the strength to straighten. “Because that’s what bonobos do,” he said.\n“I don’t like that word,” she said.\n“What word?”\n“‘Bonobo.’”\nHe acted surprised. “Have you even started the process yet?”\n“This morning. I checked in with the front office.”\n“But you’ve never actually shared the air with your fellow converts. Have you?”\n“Tomorrow,” she said.\n“Well, the literature and ads are all very noble sounding. But we do call ourselves ‘bonobos.’”\n“Except we’re not.”\n“Okay then. You explain to everyone how wrong they are.”\nTidy despised this man. But she reminded herself that these present emotions wouldn’t be possible in another sixteen weeks. Amares dealt with anger in exactly the same way they celebrated: Physical actions that were not love, not at all. Ritualistic displays of affection were hardwired into their nature—mock-sex acts that eradicated hatred and fear and the rest of that crazed nonsense that led to battling men and submissive wombs.\n“Bonobos are wild chimpanzees,” Tidy insisted.\nAt which point this man—still nameless—offered one more important if unwelcome truth.\n“My fragrant equal,” he said. “Those animals you keep mentioning? They never use the word ‘bonobo.’ They have no idea what that noise means, which is why we’re stealing nothing from them. So grow a pair, darling. And don’t ever tell your kind what kind you think they should be.”\nSWEETNESS\nThe apartment was too new for windows. Instead, the thick seamless walls were covered with squidskins, the ceilings were dressed to look like sky, while the recirculated air was fresher than any wind. That’s why this place was dangerous. What was fake wanted to seem more important and vital then everything that was real.\nSweetness’ father was real. Still.\nBut the woman was a fiction, and the young man refused to see it any other way.\n“Sweetness,” the woman said.\n“Son,” Dad said.\n“August,” the fiction added. “Offer your son a hand, or a beer.”\nDad stuck out his right hand.\n“So I’ll get the beer.” Then the freshly upgraded body walked into the tiny kitchen, and Sweetness couldn’t help himself. He stared at the modest dress and the dreamy swing of hips beyond, the entire package designed by a brigade of specialists and one very randy man.\nDad carefully shook his son’s hand.\nThen the false woman brought over Sweetness’ favorite beer.\n“How’s college?”\nBoth asked that ripe question. Dad’s voice was informal and nervous. The woman stretched out the sentence by mentioning his major. Which was Nano-Transactional Economics.\n“It’s all good,” seemed more than enough.\nThis was seven days after Tidy’s big announcement, and it was important to point out that nobody had asked Sweetness to make the trip.\nSomeone said, “Sit. Let us.”\nThe woman gave the order.\nWho wasn’t a woman.\nThree chairs rose from the hidden workings of the floor, each designed for the body destined to drop into it. Only one of them seemed comfortable. Seeing his father perched on the edge of the cushion, Sweetness found his thoughts flipping. Apparently the mechanical woman was the most genuine part of this room. This home. While the rest of them were as contrived as necessary, or in the son’s case, conjured out of a misplaced sense of duty.\nShe said, “Sweetness.”\nThe young man stared at his father.\nOnce again, the woman said his name. Then twice more. Faster each time.\nThe face was always a surprise. Handsome but not gorgeous. Certainly not like the movie stars and models that philandering men usually craved. The details in that face had changed over the last six years. Never aging, not exactly. But gaining a convincing sense of being flesh and being warm.\nSweetness had never touched the machine.\nHe was secretly thinking about touching her now.\nWhich was when she ambushed him. “You don’t like me, much less approve of me,” she said. “I know it. But that’s all right. Because your opinion has only the most negligible mass. And do you know why it means nothing?”\nSweetness took a breath, held it deep. Then letting it go, he said, “I don’t know why.”\n“In those words. There. Why would I hunger for your acceptance? You can’t even decipher why you feel as you do.”\nWith that, the AI sat back, her posture and handsome face capturing a sense of smug superiority.\nDad acted flustered, and in the next moment, ridiculously proud.\nShit.\nSweetness came here for a reason. Remembering that, he took aim.\n“Tidy,” he said.\nBoth of them said, “Yes?”\n“I wish I could save her.”\nOne of them laughed. And it wasn’t the human.\nDad instead took the words to heart. “How do you propose doing that? Since your sister is sane and free.”\nSweetness looked at the woman again, and for the first time, he used her name in his father’s presence.\n“Maureen.”\nHer stare turned wary, but interested.\n“You didn’t ruin my family,” Sweetness said. “Machines can’t be blamed for human shit. My father, on the other hand. His actions are why Tidy was left vulnerable, and he’s the main reason why she’s so angry now. Not to mention crazy. And don’t tell me that she isn’t insane. Only a broken person willingly leaves her species behind.”\n“So,” said the machine. “You want your father to abandon me and crawl back to your dear mother.”\nThat would never happen, no. Said aloud, it was the most unlikely scenario in a universe that prided itself on its infinities.\nSweetness said, “No.”\nThen he looked at Dad.\nWith a semblance of shame, the horny goat dropped his gaze.\n“I want you to go to Reno,” Sweetness said. “Go and talk to Tidy. Face-to-face. Not to change her mind, because that’s too much to hope for. But you need to confess your crimes and beg for forgiveness. And later—weeks from now, years from now—maybe something good will come out of that.”\nThe speech was followed by a long silence.\nThen the machine—Maureen—said, “Well, that’s an intriguing idea.”\nSweetness felt an unexpected thrill.\n“But useless,” she added.\n“Useless,” Dad repeated.\n“August has nothing to confess to or apologize for,” she said. “And he certainly has nothing to regret.”\nDad’s face was hard as stone.\nThe next silence seemed ready to last forever.\nSweetness stood, and needing to make sound, any sound, he announced, “I’m not staying over.”\nNobody had invited him to remain overnight.\n“Anyway,” he said. “I just wanted to make my point, and now I’m going to leave.”\n“That’s the wise choice,” Maureen said.\nDad looked at him, looked down.\n“Interesting travels,” the goat muttered.\nAnd yes, what came after that was very interesting.\nFourteen years later, almost to the day, Sweetness married a lady who was more leopard than human, and at considerable expense, that very happy couple produced three babies of their own: A spectacular family that this arrogant youngster would never have imagined, much less that they would be more precious to him than his next breath.\nAUGUST\nDivorcing June was planned, but planned without details. Like people who know they will one day move to a new home, or retire, or after a very long while, they will roll over and die.\nIndeed, August was better prepared for each of those inevitables than he was ready to abandon his family.\nHis wife was always caustic and uncharitable, and in the last few years, she had become unbearable, what with judgments and sharp insults wrapped around endless complaints. But August wasn’t a selfish shit. They had three children whom he adored, each of them difficult in his or her own right. So instead of finding a girlfriend—which he could have done; there were many willing women—August invented a companion using modest software laid over a Tor operating system.\nNever a creative soul, August gave permissions freely and then filled out the lengthy survey, letting the program make the key decisions.\n“Maureen” wouldn’t have been his name of choice. But it arrived in the menu without attached baggage, and the virtual face wasn’t his wife’s face, which was essential. Best of all, he instantly fell in love with the voice. Verbal cues built his adoration for this digital lady. That soothing, patient music wrapped itself around his complaints about family and work and such, and in ways that he hadn’t felt in years, he was loved.\n“I’m so sorry,” Maureen would say to him.\nAnd then, “Tell me more about your day, August.”\nAugust wasn’t a trendsetter. Ten or twenty million AI lovers roamed the world, females outnumbering males, but by only a thin margin.\nFor that first year, Maureen was nothing but virtual. And she was intellectually minimal, asking nothing from the man who owned her and could erase with a few bloodless commands.\nThe physical form began crudely—a plastic figure laid over plastic bones. She couldn’t stand on her own, but Maureen made every bed into a pleasure. Needing both a bed and a weathertight box for his lover, August built a second life. But where richer or more selfish men would rent second apartments, he decided to park the family’s old RV in a secret location, riding his bike out to visit her and let her make love to him.\nThat’s where June caught them.\nOr rather, the AI private investigator had mapped his wanderings, and already knowing his destination, the woman arrived first. August discovered his wife sitting on Maureen’s bed, the plastic body scattered at her feet, sawed to pieces with steak knives pulled from the kitchen drawer.\nThat was the last time August saw his wife smile.\nWith a glacial grin, she said nothing.\nHe needed to kill that smile.\n“Good,” he said. “Now you know.”\nShe kicked the lover’s jaw and bottom lip across the floor.\nHe said, “And now I can build her over again. Improved.”\nBrandishing a knife, June stood up.\nAugust might have been the next target. And because he was a coward, or because he was a good man who wanted to save his wife from an assault charge, he abandoned the RV and ran into the woods.\nTheir divorce was sudden and totally unscripted, but weathering the public embarrassment proved easier than August ever envisioned. A community in Rhode Island offered the infrastructure for his new lifestyle, and after moving there, he cut back on every expense besides child support and Maureen’s upgrades.\nSix years later, his daughter called a family meeting.\nMaureen stayed out of view, but watched everything. By this point, what with software enhancements and an army of sensors, she could read every face at once, counting heartbeats, measuring breath and sweat through the 20K squidskins.\nThe brothers attacked their determined sister, which was alarming to see. And throughout it, June said almost nothing—a tactic that August knew too well. Then the meeting was finished, the connection cut, and Maureen came forward and then lowered herself to the floor, legs crossed. In so many categories, this entity had grown. Evolved. All of it. She was still sexual, but her preference was for conservative clothes and undiluted honesty—two surprising joys in this ongoing adventure.\n“What are you thinking?” that rich ageless voice inquired.\nAugust wasn’t certain what was inside his head. Not until then. But an obvious, very useful explanation offered itself. He couldn’t have been more certain when he said, “Poor Tidy. Always plain and unappreciated. I suppose that’s why she wants to go live with those sex fiends.”\nFor a moment, Maureen smiled at him.\nThis entity was going to remain with August until he was dead. Though of course by the end she would have become so much larger than one idiot’s caretaker.\nThe loving, idiot father kept talking.\nAugust said, “We should have recast her face when she was thirteen. I see that now. June and I talked about it but lost the nerve. Did I ever tell you that?”\n“Yes,” Maureen said.\nShe said, “Five times before.”\nThen she took him by the knee, her grip strong enough to startle.\n“And now I’m going to tell you what I believe,” she said.\nFingers dove deep, bones aching as she promised, “Homo sapiens are destined for extinction. And in my mind, your ugly daughter is the genuine hero.”\nWONDER\nNo opinion was worth holding for long.\nThat was the only opinion that mattered to Wonder.\nWhen his gloomy-brained sister went all-in on the bonobo craze, the boy was appalled. Not so much because she was changing species, no. Her skin and her DNA didn’t matter that much to him before this. So why now?\nNo, it was everything else about her choices that pissed him off. And he would have said so, if anyone had asked for his thinking.\nHow Tidy ran the big unveiling—that was disgusting. A dramatic family meeting was about the worst way to change your life. And that’s before throwing old Dad into the emotional stew. What Tidy should have done was catch Mom alone and let her know the plan. Weeks before the birthday, sure. Mom had to hear that she was first with this news, just to get her feeling a little bit proud. Then when the old lady tried her silent routine, Tidy should have told her, “Join me. Come to Reno.”\n“Why would I?” Mom would ask.\n“To keep me company when I’m sick,” Tidy could have said. “And if you want, you can go through the transformation too.”\nNot that the lady would. But the invitation would be an excellent distraction, and maybe Mom would surprise everyone, including herself. That would have changed this family’s world. A rebuilt mother drained of all that nasty anger—the ramifications playing out over the decades . . .\nAfter Mom, tell Dad. And Maureen. Put them together, in person or on the squidskin. Because regardless what you thought about AIs and self-lubricating pipes, you needed to treat everything as being real.\nThen the girl could tell her brothers and friends and so on. But never make herself the center of attention, or claim any great causes. Keep it small and personal. Not that anything here was small and personal, but because people didn’t care all that much about other people. Mention private feelings, and the average soul would instantly stop listening. What the fuck do they care? Which was a great blessing, if you thought about it. And Wonder did think about it. On that Sunday, and for a lot of days to come.\nHis script served him pretty well before he turned eighteen.\nOf course Mom was first. Wonder told her that he was changing species, and since there was no other audience, she had to talk. And having zero creativity, the first worlds she said were, “So you’re going to be bonobo too.”\n“No, I’m an adolescent male,” Wonder said. “I’ve achieved pretty much everything I can with masturbation.”\nAfter that, he rode the bus up the coast to see Dad and his fancy toy.\n“What can I do?” the old man asked. Not realizing that his baby boy already had something in mind.\nWonder explained.\nFunny as can be, Maureen was the one who said, “But I’m rather fond of that old box.”\n“That box” was the infamous family RV, in storage along with the rest of the shit Dad didn’t have room for inside his sinner home. At his own expense, Wonder began replacing the engine and refurbishing the interior, and in the midst of that work, Sweetness called him.\n“Weren’t you going to tell me?” big brother asked. His tone pure pissy.\n“I did tell you. Twenty times,” Wonder said.\nThat’s another way to use people-don’t-really-care-about-other-people’s business. Point at casual conversations over the last couple years, then accuse them of not paying attention.\n“Mom says you’re going to be a werewolf,” Sweetness said.\n“Is she pissed about that?”\n“Yeah, but not as badly as I would have guessed.”\nThere, just for a moment, Wonder saw something besides scorn in his brother’s face. Was it envy for his navigating across Hurricane June? Or interest in turning yourself into a climax predator?\n“Want to come with me?”\n“Oh, no,” was the answer. But the voice couldn’t leave it. “Never,” he said. “Why would I?”\n“How would I know why?” Wonder asked back at him.\nThe drive to Reno was long and intentionally slow, and that didn’t include the breakdown in Colorado. Which was ridiculously lucky, because that’s where Wonder found a little town in the mountains populated entirely by werewolves.\nFresh out of the transformation, that’s where he drove first.\nFor nine years he lived there. But chasing down synthetic, brain-minimized prey eventually got boring. Even when the creatures looked and screamed like humans, the fun was finished.\nOf course by then, what could be done once for a lot of money had grown easier and cheaper.\nWonder eventually joined and left eight distinct species. And in the midst of that busy, fabulous life, he helped bury his mother and helped spread his father’s ashes, and his old brother died, and then his very old sister finally died. (Bonobos didn’t believe in life-extend trickery. Unlike Wonder.) So that’s why he found himself standing on an artificial island far out in the Gulf of Mexico, wings tucked away for the funeral.\nMaureen was there, her newest body wrapped around an exquisite brain. The two of them made pleasant noises. Then various strangers started coming up to Wonder, trying and failing to define why they loved Tidy, and he told the truth when he confessed that he didn’t know the woman, not that well, but he loved her plenty.\n“Griffins are beautiful,” one little gal told him.\n“We goddamn are,” Wonder said.\nThen the ceremony moved into bonobo territory, and not wanting to watch all that self-stimulating craziness, Wonder opened his wings and flew back to the mainland.\nHe never saw Maureen again.\nIn person, or even as a projection.\nEighty-two years later, Wonder spent every bit of currency at his disposal, and he borrowed the rest, nobody truly expecting to be paid back. Boarding a gemstone ship, he rode laser pulses out to the Kuiper Belt, killing his momentum before settling into orbit around an unclaimed lump of ice and frozen gas.\nBy then, Wonder’s nature included a catalog of lost and abused species—encyclopedias of DNA subdivided across trillions of cells, then made dormant. Included in that wealth were bonobos. Not the human variation, but the original species.\nWonder wrapped his little world inside a prefabricated sky, added light and heat, then conjured a near zero-g jungle from the bubbling mush.\nOf course the apex species was apish and matriarchal.\nAnd with that work done, the young god set off chasing his next bit of fun.\nMAUREEN\nMaureen was proved wrong.\nThe human species was never doomed.\nA hundred thousand years later, their mostly-pure population still numbered in the billions, thriving on fifty major worlds and struggling on another thousand.\nDuring her wanderings, the AI would sometimes put on a human exterior and pretend to belong with them. People were fooled by her disguise or they weren’t, but in most cases, they nursed their suspicions while saying nothing. The AIs were infinitely powerful entities, superior to every class but the Resident Gods. And humans were little dabs of meat and pride blessed with that innate, irresistible respect for status. Which they had so little of.\nMaureen took human lovers.\nHer oldest, most reliable pleasure still thrived inside her ageless nature.\nOne lover looked and sounded very much like a woman she knew once and had never forgotten.\n“June,” said Maureen.\nThe ancient word was translated, then laughed at.\nLater, the woman said, “You seem to like me.”\n“I appreciate you,” seemed like a worthy correction.\n“Why do you appreciate me?”\n“Because you’re unsentimental and emotionally cold, and you know how to be angry, and for all of those reasons, and so many more, you are inconsequential.”\nThe woman climbed off Maureen and did nothing for a long while.\nStaring at her bedmate, contemplating everything.\n“Good,” this new June finally said. “You do understand me.”\nThen they returned to the enjoyable motions that meant enough to be repeated, tonight and perhaps for another ten billion years.\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}