{"fingerprint": "5A9tq8XfPhIjx5uNs3Dbt4NflDI=", "sitename": "Clarkesworld Magazine", "title": "Pernicious Romance by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_11_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pernicious Romance by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5860 words, short story\n Pernicious Romance\n There are no suspects.\n We know the vehicle was serviced by the school motor pool, but there were numerous locations and intervals where clever hands could have added a malicious device. Subsequent investigations have exonerated university employees as well as the student programmer responsible for the custom software piloting the giant football helmet. Investigations continue, but authorities no longer issue reports, claiming undiminished interest even as the work thins to fewer agencies and skeletal crews.\n Even in retrospect, nothing about the football game appears out of the ordinary. Fiercely contested and low scoring, the battle matched every expectation up until halftime. Then the marching band played three numbers—a solid performance, perhaps even inspired. Once the band relinquished the field, the stadium lights were set low, and that was when the giant football helmet, lit up with the school colors, sprinted across the darkened turf, deploying an LED hose in its wake. The tradition was three years old. The competitive game and mild October weather insured that the stands were nearly full. With a flowing, artistic script, the home team’s name was being written with the hose. Onlookers assumed a simple malfunction when the helmet stopped on the fifty-yard line. Perhaps seven seconds passed. Unfortunately there is no video recording of the event. A significant EMP event came with the attack, destroying the data from security cameras as well as amateur videos. The entire campus and half of the city were plunged into a prolonged blackout. But using the scorched rubber turf as a marker, it appears that the device, whatever its nature, was set near the back of the helmet, and its detonation consumed both the helmet and golf cart, leaving behind dust but almost no shrapnel.\n As a rule, the first victims to “recover” were located in the most distant portions of the stadium. People high above the south end zone were two hundred and twenty yards from the device, give or take. Most would have been watching the darkened field and the progress of their school’s helmet. Many would have been yelling out letters. Witnesses willing to discuss the event claim one of two scenarios: A bolt of light fell from the cloudless, moonless sky. “Lightning” is the most common word. “A laser beam” is also popular. But there are other accounts, equally certain, describing a flame or beam leaping up from the ground, presumably when the cart and helmet were vaporized.\n Regardless of perpetrators, the attack was immediately blamed on terrorists.\n That opinion hardened too quickly and too deeply, we believe.\n These were enormous energies on display. There is no question about that. Which leaves us to wonder how any terrorist group could have mastered what appears to be a new technology—a set of tools that nobody else understands.\n Cold as it sounds, we should feel thankful. In the end, only fifty-eight people were killed directly by the blast, while another thirty-nine succumbed to falls and head wounds. If casualties were the goal, these high-tech murderers could have ignited their weapon late in the first half, while the helmet was parked on the crowded sidelines. Unless of course the device was a demonstration event or a spectacular dud. Numerous public voices have made those bold claims, ignoring the absence of evidence. What is known is that nearly seventy thousand people were inside the stadium. Every survivor lost consciousness, some remaining that way until this day. And as a direct result, our country hasn’t seen a major sporting event for sixteen months, and it is the same across most of the world. Nobody wants to risk a repeat of that terrible Saturday night.\n Except for a large portion of the victims, that is.\n Case Study:\n Today MK is a thirty-one-year-old woman, single and employed. As an undergraduate, she played in the school band, and that’s why the halftime show was her primary focus. But her little brother waited too long to purchase tickets, and that’s why they had the worst possible seats, and that’s why they were standing high up in the southern end of stadium, two hundred and twenty-three yards from the blast site.\n MK remembers the band’s three songs and then the helmet writing PANTHERS across the unlit field. The vehicle stopped while it was crossing the T, which wasn’t right, and she immediately turned to her brother. She recalls laughing, telling him that this sort of shit wouldn’t have happened when Dr. Kalin was in charge of the band.\n MK had played the snare drums, as did her brother after her.\n Her brother turned toward her, presumably to respond.\n Both saw a brilliant flash of golden light.\n Yes, she was sure. The light was definitely gold.\n Panther Stadium is a bowl of concrete and steel with oak boards for seats and numerous steel railings. The stadium is quite steep near the top. Several people close to MK fractured their skulls when they collapsed. But in general, surprisingly few of the victims were injured. Evidence shows that the lowest rows felt the effects first, and like a wave dispersing across water, the people above collapsed in a very orderly fashion, falling on the bodies before them.\n Intentional or not, that was another factor in the paucity of deaths.\n People outside the stadium, including a small portion of the campus police and ambulance attendants, suffered moments of vertigo but never lost consciousness. After perhaps thirty seconds of confusion, those few hundred people entered to discover thousands of motionless, apparently helpless bodies. Yet these victims weren’t unconscious, not in any normal sense. Every living person was breathing quickly and deeply, as if doing considerable labor. Some of those early responders reported a smell like perfume. But not everyone. The scope of the disaster and the total blackout led to panic, even among those with emergency training. But one campus police officer, armed with a working flashlight, climbed to the top row of the southern end of the stadium, and that’s why she was first to come across a victim who was regaining consciousness.\n MK has that distinction.\n The officer kneeled over the young woman. MK remembers her rescuer. In fact, she has talked at length about the pain and terror in that stranger’s face.\n “Are you okay?” the officer asked.\n “Yeah,” MK said.\n In fact, she felt perfectly fine.\n The officer held up a hand.\n “Three fingers,” MK answered, before the question was asked.\n Then she sat up on her own power, lightheaded but not disabled. There were thousands of bodies below, not one of them moving. Yet she heard a peculiar sound, diffuse and gray and not quiet, and after a moment she realized how hard everybody was breathing.\n “Something’s happened,” she said calmly.\n “A bomb went off,” the officer said. “You were knocked unconscious.”\n “No,” MK said.\n “Yes,” the officer told her. She was still holding up the three fingers, and the hand was trembling. “Every last one you . . . knocked out.”\n MK said, “No.”\n “You were,” the officer insisted.\n “For how long?” MK asked.\n The officer tried to make that calculation. But her cellphone was dead, and fear had distorted her sense of time.\n “It’s been a week,” MK guessed.\n “A week? Since you fell over?”\n “Yes.”\n “No. It’s been fifteen minutes, tops.”\n MK’s brother, BK, was unconscious like the others, and then his breathing slowed. With a sigh, he opened his eyes. His forehead was scraped, but otherwise, he was unharmed and remarkably alert, sitting up beside his sister.\n MK touched his wound.\n “I didn’t see you,” she said.\n BK agreed. “I didn’t see you either.”\n The officer watched the conversation.\n “This cop says fifteen minutes passed.”\n “That can’t be,” he began.\n “It’s been seven days. Almost to the minute, right?”\n “No,” said BK. Then he closed his eyes, presumably making his own count.\n “What happened to the two of you?” the officer asked.\n Neither answered.\n The officer started to repeat her question.\n “Nine days,” BK interrupted. “That’s how long it was for me.”\n “Are you certain?” asked the officer.\n “Positive,” BK said.\n Then MK said, “Huh. I wonder why the difference.”\n But the problem had an easy enough answer. “I was down longer than you,” her brother pointed out.\n In frustration, the officer snarled, “But what in hell happened to you?”\n The siblings glanced at one another.\n Then they looked up, and they spoke the same words.\n “Love happened,” they said.\n Elaborate graphs have been produced. Recorded testimonials and secondhand numbers have been plotted against axes that might be useful. Seventy thousand points in space and time will create pictures. For instance, there is a strong inverse correlation between the distance from the bomb and the duration spent being helpless. Spectators in the high seats generally woke that evening, while those closer to the field remained unconscious for days and often far longer. Being inside a restroom or otherwise shielded by concrete reduced the effects, but not as much as we might have guessed. Victims in the lowest seats, particularly those at the fifty-yard line, were slowest to wake. Yet their experiences pale next to the poor souls standing on the field itself—the band members and grounds crew, two teams and coaching staffs. Plus alumni and benefactors who had been given space on the sidelines. Those victims received the full onslaught of a very peculiar weapon, and several dozen died from brain hemorrhages, while others survived but have yet to open their eyes.\n On the matter of correlations: There is a weaker but persistent positive correlation between how long someone was senseless and their perception of time.\n Five days is the minimum “imaginary” time, while the record holder to date, if believed, is fifty-eight years.\n Liquor consumption has no proven role in duration of helplessness or the depth of the experience. And despite rumors, cannabis had at most a minimal negative influence.\n But judging by family reactions, genetic components can matter.\n At this point, it bears stating that every number is just a number. Mathematical figures seem precise and cleanly rendered, yet in its nature, each number wants to mislead. Tidy graphs belay the scarcity of real data. Seventy thousand subjects were thrown into the same ad hoc experiment. No operative plans were made beforehand. No logistics were set in place. A college city with two major hospitals and minimal equipment for deep-brain analysis was trapped in the most unlikely scenario. Add to that the confounding facts of a wide-scale power outage and the substantial numbers of medical people—first responders and local physicians—trapped with the other victims inside the stadium. Also many key government people were struck down. The state’s second-term governor was enjoying one of the luxury booths, which gave him valuable distance. But he was standing over the forty-five-yard line and as a result was left unconscious for many days.\n A genuine bomb would have left corpses and living people who knew what to do with corpses.\n Broken bones and burns respond predictably to medical tools.\n But what can be done with tens of thousands who are incapable of reacting to light or pain, or human voices, or any other reasonable treatment?\n What city in this world could handle the crush of so many patients, each wrapped in a condition that doesn’t resemble known comas or dream states?\n The tragedy is still emerging.\n What amazes us, writing from the midst of history, is the heroism of ordinary citizens facing an unexpected foe.\n Case study:\n SZ is a youthful fifty, a man who enjoyed prestige and responsibility in his lifelong profession. At the time of the attack, he was positioned high above the north forty-five-yard line, apparently standing at the back of a luxury box. State troopers found him within the first hour, and because of his job and important friends, SZ was carried past other victims and placed inside a helicopter that whisked him to the state’s premier neurological-care facility.\n SZ was the first patient to receive full batteries of tests, including blood work and EEGs and several thorough PET scans.\n As such, he enjoys a singular value among his peers.\n SZ wasn’t comatose or asleep, but characteristics of both states were observed. His body was limp, immune to mild pain and tickles. Loud sounds didn’t rouse him. The voices of his wife and children had no visible effect. There was a persistent erection, but it wasn’t associated with any normal REM sleep. If not for his arousal and rapid breathing, the man might have appeared dead, but the reality is that he was very far from death.\n It bears repeating: Every victim’s brain was at work. Trained athletes and world-class dancers make huge metabolic demands on their minds, but SZ’s brain consumed more sugar and more oxygen than any brain studied before. No portion of his neurological system was at rest. Each breath supplied just enough air to maintain that fantastic storm of electricity, and because of fears that this middle-aged man would be overtaxed, SZ’s breathing was augmented with an oxygen mask.\n The treatment may or may not have had a role in his experience.\n Frankly, nobody knows what his experience was.\n For three weeks, the patient’s condition held steady—no improvements or variations in his status. He was made comfortable, his body was hydrated, and once it was shown to be essential, he was fed sugar and proteins. (Starvation was and is an ongoing concern with every victim.) There was no reason to expect SZ to awaken, even after others from the same luxury box had opened their eyes. Three weeks had taught the doctors that they knew very little. After three weeks, even the most rational voice was speculating that a person didn’t wake until he was ready.\n Twenty-four days after the football game, SZ was ready.\n Unless of course he just simply woke up.\n His wife was in the room, and by chance, his oldest child. Like every other patient, SZ was lost to the world, attached machines measuring the quick vitals, and then he was back again. This was not the same as waking from deep sleep. His mind was alert, and then he and his body were alert in a different fashion. The only major physical problem were his atrophied muscles. According to a nurse present, SZ tried to sit up but couldn’t. Then he spoke to his wife by name, and he smiled at the teenage daughter, and the girl responded by blurting out, “So who did you sleep with?”\n By then, the world had learned what happened inside those raging minds—if not in detail, at least as a general rule.\n Patients were meeting imaginary lovers and undergoing intense, soul-shaking affairs.\n According the nurse, the girl’s combative attitude startled SZ’s wife.\n “Honey,” she said.\n “I know you were cheating on Mom,” the girl said.\n SZ tried again to sit up.\n The nurse attempted to help him.\n “Get your hands off my father,” the girl shouted.\n “Leave us, please,” the wife begged.\n Standing in the hallway, the nurse overheard portions of a very difficult conversation. Her sense was that the girl was only voicing her mother’s deepest concerns. For years, there had been stories of infidelity involving this very important man. But rumors didn’t matter as much as the certainty that his mind—struck helpless by a terrorist attack—was happily engaged in a relationship that had no connection to real people and genuine events.\n Beds were still at a premium at that stage in the crisis.\n SZ was discharged as quickly as possible, and after several days of rest, appeared in public. His family stood beside him when he thanked the state troopers and hospital and the many subordinates who did his job in very trying times. Every observer was struck by the man’s graciousness and his smile. There are people with famous smiles, and SZ’s was one of those. But the expression was different than before. The audience saw a transformative joy, not only in how he grinned but how that joy seemed to make him lighter and younger than any man in his fifties should be.\n The rumors had already begun by then. Which makes it doubly disappointing that we don’t have SZ’s account about his time as an invalid. Yet the patients are rarely willing to speak about these personal experiences, and our subject was even more circumspect than the norm.\n Whispers claimed that he lived twenty years in as many days.\n That would put him at the high end of the charts.\n Voices that might know the story claim that SZ enjoyed a torrid affair with a living actress—that is, an imaginary version of an Academy Award winner. But that is the kind of rumor that spreads. Because it is compelling and obvious, and a portion of those who are doing the telling wish they could have dreamed about sleeping with a woman like that.\n Another story is that SZ had a twenty-year relationship with a youngster. The girl was only eleven at the beginning, and by the end, the dreaming man was sleeping with her as well as his various daughters.\n That is the kind of story told by enemies and believed by only a few of them. Yet from what is known, pedophilia is unlikely but never impossible.\n A third version exists. There was a large Christmas party where SZ had one drink too many and then confided to the wrong person. He claimed that the woman he loved for twenty-one imaginary years was as exotic and beautiful as any woman could be. But there was more than just that one woman in the other realm. He had lived inside a fully realized world, sharp and honest. A man who had never built anything with his hands built the house where he and his common-law wife lived together. They had several children. SZ mentioned names and grieved that he didn’t have pictures of their little ones. He was that proud of them. Actual specifics were few, but the witness had the impression that this nonexistent mother and family lived in another age, perhaps inside a fantasy world—a world of grand beauty where everybody shared a crushing, relentless poverty.\n SZ’s wife filed for divorce shortly after New Year’s.\n He didn’t contest her when she took their three children.\n Rumors of depression seem to be untrue, but those same rumors led to talk about removing him from his post. SZ didn’t give anyone that chance. He resigned on a Friday afternoon, slipping out of his office and then out of the country. The last credible sighting came from the border of Uganda and South Sudan. A white man matching SZ’s description was seen walking alone into the bush, wearing tattered clothes and an enormous smile that washed away his miserable circumstances.\n Certain categories make easy statistics, and perhaps these numbers have real significance.\n But statistics are a game for bolder souls than ours.\n Yes, there has been a strong rise in separations and divorces. The largest upticks come from males married for seven to twelve years and whose spouses weren’t affected. And inside that group, the most susceptible are young men who experienced only a year or two of pernicious romance. (PR is the latest term for the condition. Will it last? Who knows?) Perhaps this says something about human nature. You spend two years with the girl of your dreams, and that’s both too long and too short. Coming back into the old world, you look at your legal mate as an embarrassment or disappointment, or boring. Because your dream mate and you were still fresh to each other, and everything ended too soon.\n Couples that collapsed together are less likely to divorce. Though their numbers are still higher than normal, and substantially so.\n Older couples are most resilient.\n Indeed, if a husband and wife fell into a stupor for just a few hours, and if they woke at nearly the same time, they often use the event as a bonding agent, revitalizing marriages that perhaps weren’t as strong as they might have been.\n Books are being written on the psychological effects.\n Careers and entire new industries are being nourished.\n One category that receives remarkably little attention: The effects on children and young teenagers. From what has been observed, young children always experienced a love affair, but non-sexual and with a parental figure. In their dream, some disaster had swept away life as they knew it, and they found an adoptive adult who led them through a series of great adventures, sometimes spanning decades of life and growth.\n Those children are as profoundly changed as anyone. “Baby adults,” they have been dubbed by observers and the occasional news feature.\n And what other changes have been wrought?\n Today, several thousand patients remain scattered in various facilities. They demand an expensive level of care, and if they don’t wake in the next few months, their bodies will require new and aggressive interventions. And there are the social ramifications to a world making ready for the next attack—even if the first attack wasn’t terroristic in nature. The health industry is devising huge, largely unworkable plans in case crowds and entire cities are rendered helpless. Billions are being spent on facilities that will wait in stasis for the next wave of casualties, giving us the chance to study them in detail. And there is the simple, relentless problem that comes from one difficult evening in October: Tens of thousands of people are awake today, dealing with lives that were never lived, and from all accounts those other lives seem to be as genuine and as thoroughly recalled as any.\n How can so much human experience, sitting outside normal life, not have a significant impact on all of us?\n What ideas did our neighbors and friends bring back from the other world?\n And how will the echo of romance play, now and for the next thousand years?\n Case study:\n EL is a physical therapy major and a member of the football trainer’s corp. That’s why she was standing near the twenty-five-yard line, fully exposed to the blast. Among her peers, EL has various distinctions. As a patient, she was cared for at home by her mother and stepfather. That wasn’t particularly unusual. There was a rampant shortage of hospital beds, particularly in those first three months, and many families took up the burden. But EL was a different kind of patient. Everyone had elevated breathing rates, but she was at the high end of the continuum. Perhaps youth and physical fitness made that possible. Or there were random or unknown factors. What is known is that she spent seventeen weeks in her own bed, cared for by people who had the resources and energy to meet her extraordinary needs. EL sounded like a sprinter when she breathed. Her mouth and nostrils became chapped, and she lost weight despite constant feedings through IVs, and later, tubes pushed down her throat. Twenty pounds evaporated from a frame that didn’t enter that state overweight, and just before she woke, EL’s mother was considering transferring her to an expensive care facility.\n But her daughter woke before she starved. Perhaps because her body was suffering, it has been suggested. But only a handful of cases resemble hers, and those patients emerged long before the body failed.\n Another distinction is that EL is easily the most forthcoming about her case. She began blogging immediately. The wasted body wouldn’t let her sit up, but she wrote her first entries on her back, on a tablet held by her dutiful mother.\n One might expect that her seventeen weeks would translate to an impressive stretch of illusionary years. But that isn’t the case at all. EL felt that only nine years had passed, which again puts her at the tip of a bell curve. And where most dream lovers were idealized, hers seems to have been a more fully rounded individual.\n Heather was the lover’s name.\n Is her name.\n She was an older woman, beautiful and possessive and sometimes cruel, at least in an emotional sense. EL writes that she and Heather fought often and about every possible topic. They lived together for seven years, off and on. EL was working as a trainer for the Minnesota Vikings, and her lover held and lost an assortment of jobs.\n In her blogs, EL duplicates long stretches of dialogue.\n Of course their authenticity can’t be determined. But EL’s words match the tone and vocabulary that she prefers, and her lover is nothing if not consistent.\n EL loved Heather despite or because of the flaws.\n She loves her now.\n This is perhaps the most intriguing and potentially disturbing part of this case: Awake again, EL is using every spare moment of her life to explain what happened to her inside a dream. And she claims that she does this because Heather is real, and Heather returned to this world with her. There is a second mind, vivid and pissed, smoldering inside a bored skull.\n Subsequent PET scans have shown interesting abnormalities.\n And EL still consumes more food than before, feeding a mind that insists on running faster than average.\n Everyone with an interest in the outcome is watching, wondering if and how the parasite will try to take hold of its host.\n Speculation is easy, and done properly, calm speculation might help our adaptations to the ongoing challenges.\n But we continue to dismiss the terrorism theory, and for good reasons. What political movement has the requisite technical skills? Whatever the device’s source, it was a high-end technology wielding powers born out of the most rarefied strata of theory, and these tools were used in a very unterroristic fashion. Few deaths. No claim of credit. Seventy thousand cases of love-sick revery, and no second attack either.\n But that leaves a very important question:\n Who are the reasonable suspects?\n Exclude one word from that question, and quite a lot becomes possible.\n Foreign governments were testing a new weapon.\n Or perhaps our own government was.\n A small, portable device that drops thousands into a helpless state. That would be an excellent way to cripple your enemy while leaving his infrastructure intact. That is an unreasonable scenario with considerable appeal. But the first complaint is to point out the scope of the test and the dozens dead. Wouldn’t that bring too much notoriety? Unless that was the goal, of course. An unexpected nightmare delivered to the unwary world. But if this was and is an experimental weapon, then there is a slightly less unlikely explanation.\n We call it the Castle Bravo scenario.\n Castle Bravo was one of the first thermonuclear tests in the Pacific. The bomb’s yield was two-and-a-half times larger than predicted, and the blast and fallout effects caused years of misery.\n Perhaps our tragedy was the result of similar mistakes.\n But if a government agency isn’t to blame, then who?\n A cult, perhaps. Although that perches close to the terrorist assumptions, with the added problem that no known cult carries any interest in pushing thousands into the arms of imaginary lovers.\n Perhaps a major corporation was testing a new product, and its calculations were a thousandfold wrong.\n Unlikely, but not impossible.\n Even less likely explanations include aliens operating our midst, time travelers from some far human/machine future, and the utterly random hand of some capricious or incompetent god.\n And waiting beyond the impossible:\n The unthinkable.\n Case study:\n Tenured professors are allowed to purchase season tickets, though they are relegated to some famously poor locations. BB and his wife had seats high in the southwestern portion of the stadium. These were fit people but far from young. They left for the restrooms before the first half ended, and they were slowly climbing the steps when the stadium fell into darkness. Probably neither noticed the helmet and golf cart stopping in the middle of the field. BB does recall his wife hesitating in the gloom above him. He speaks affectionately about touching her back, trying to reassure her with his presence, and then came the flash that transported him to another world where he lived and loved for three alien days—long days which would translate to perhaps two weeks by the human count, he estimates.\n To an accomplished physicist, that alternate world appeared perfectly credible.\n Twenty-three minutes after the blast, BB woke to find himself lying on top of his wife. To his horror, he realized that she had fallen hard, driven in part by his own body. Her forehead sharp struck the edge of a concrete step. BB tended to the bloody wound as best he could, and then this man in his late seventies tried to lift his wife, and failed, before screaming as loudly as he could, begging for anyone’s help.\n Sitting nearby were a brother and sister, alert and conversing with one campus police officer. All three came to the rescue, and despite his own head wound, the brother carried the dying woman across other bodies and out into the nearest parking lot. But the medical personnel were elsewhere, lucid or otherwise, and this spouse of fifty-eight years died in the back of a useless ambulance.\n BB’s subsequent depression was prolonged and useful.\n Two months after the funeral, he began working on an explanation for his wife’s murder and the transformation of so many innocent lives. Those efforts led to a series of dense, harshly reasoned papers that have mostly gone unpublished. But the professional indifference hasn’t kept his conclusions from being shared by others, both within his field and far beyond.\n BB claims that what happened isn’t possible. Not according to natural laws, and not according to any compilation of wild hypotheses.\n Impossibility is itself a clue, says BB.\n He has written nothing about his fictional love affair, but the alien world is a different subject. Thoroughly rendered, complete with estimates of size and mass, apparent history and harsh climate, he argues that the world was too intricate and perfect for even an expert to dream up. That means that his vision had to be the work of another mind, a much more competent and relentless mind. According to the old professor, each of us exists inside the dreams of someone greater, and what happened on that October evening was an accident, a sorry mistake.\n The universe is a cosmic fiction.\n That fiction is run by mathematics and vast, unseen machines.\n Some tiny piece of the machinery failed. Which must happen from time to time, as every device has its limits.\n BB argues that there was no bomb or other device inside that football helmet. The golf cart failed because of the initial surge of uninvited energies, and like a fuse popping inside a circuit box, the event came and went quickly enough. But there was leakage from the higher mind, and the professor has both equations and options for experiments that might someday prove him right.\n As mentioned, BB has not published these results in any responsible journal.\n Some of his peers want him to retire finally.\n But the old man refuses. He likes to teach and do research. Those are the only blessings left for him, now that his wife is dead. But he remains confident that the woman lives on, probably somewhere in the higher mind, and death will come soon enough, freeing him for a long, joyous chase.\n What constitutes reasonable answers?\n We can’t say. Months of study and endless discussion has left us with no clear options. But we have cobbled together a variety of stories that capture the elements of what we consider workable, sane explanations.\n Remember the reported scent of perfume.\n Maybe that’s a key.\n And the fifty-yard line too.\n The incident was devised as a study, and the football field supplied a workable transect. Again, think of Castle Bravo. Consider the possibility that the effects far outweighed every projection. The EMP blast wasn’t the first stage. The incident began when someone released a powerful chemical into the atmosphere. The chemical came from the giant helmet or from the hose being towed along, and it migrated inside everyone, brought to the lungs and blood where it had powerful hallucinogenic effects. Perhaps the electrical jolt was meant to height the drug’s effects, or it was a substantial malfunction in an untested system.\n The culprit here would be a major pharmaceutical corporation or a bioengineering start-up.\n What was being tested was a genuine love potion.\n Again, think of the nuclear blast that worked too well.\n The event was meant to be both an experiment and a social event, and only the people on the field should have been infected.\n Horrified by the aftermath, the guilty parties have destroyed their work and gone into hiding.\n And no, we won’t suggest that this is the genuine answer.\n There is zero evidence backing up this story or any other. What we are proposing—indeed, what we insist is true—is that no answers will be forthcoming. Something large did happen. Nothing like it has happened before or since. And so it’s reasonable, even responsible, to claim that we won’t ever learn the truth, and that’s the conundrum we need to deal with today.\n Case study:\n RL is a twenty-year-old woman. A cheerleader before the event, she woke only last week. After more than fifteen months of lying in various beds, in hospitals and then at home, she reports having spent fifty-eight years elsewhere.\n Her fiance was her only visitor when she woke.\n When told of the circumstances, RL appeared calm, even amused by what had to be unexpected news. This wasn’t the shallow young woman who tumbled and waved pom-poms on the sidelines. She was composed, eerily so. The man whom she was supposed to marry was weeping, telling her about that awful night and the wild theories explaining what had happened. Tech wizards; evil governments; high minds; satanic spells. Then he grabbed one of her skeletal hands, describing how he had watched over her as much as anyone, that he always had been devoted and faithful, and he didn’t care what she did inside that silly dream world. Dreams didn’t matter. What mattered was that God had placed him into her life, here and now, giving him the strength to greet her return to what was real.\n That rush of words and pent-up emotion finally ended.\n A brief, wary silence followed.\n And then the young/old woman laughed. It was a bittersweet sound—profound and hopeless, revealing the enormous gap between the two of them. Her fiance felt the hope draining out of him. His grip weakened. She retrieved her hand and then pointed at him, saying a few words in a language that he didn’t know.\n He eased away.\n And then quietly, in the language she had barely used in half a century, she said, “The last thing I remember . . . ”\n “What is that?” he asked.\n “His hand,” she said.\n “Whose hand?”\n The laughter returned, even sadder.\n Then she grabbed hold of herself, arms crossed on her starved chest, and she said, “My husband was behind me on the steps, in the dark. And he put his hand on my back, and just for a moment, just that last moment . . . I felt young again . . . ”\n Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}