{"fingerprint": "Qo77yJ/1bQyx+R0e7E1tfUyRSPo=", "sitename": "Clarkesworld Magazine", "title": "Kingfisher by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_08_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Kingfisher by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11930 words, novelette\n Kingfisher\n 1\n And then there was quite a long time with nothing to chase. No suggestive tracks in the ice, no hopeful stories told by misinformed strangers. The air didn’t hold any name glancingly resembling her name, and there weren’t even rumors about intriguing places beyond the endless horizon. Without direction, only random motion was possible, and a miserable expanse of empty moments and boredom, and of course he considered stopping. Any sane mind would want to quit. Except he was far more than just another sane mind. No, he was also strong and disciplined, and most important, ridiculously stubborn: these were the attributes that he had always cultivated, and that’s why he kept wandering the ice for many more useless centuries.\n But even the stubbornness of gods has limits. So when the nothingness didn’t end and the urge to be done didn’t end, there came that moment when, at last, he paused. Yes, he gave up the chase. The best place among a thousand random places was selected, and he inhabited one patch of ice for a long quiet. This was rest. He was cultivating his energies. That’s what he needed most desperately. And since every rest demands shelter, he built a little home that gradually grew larger, but he always lived simply, and what followed was a very long interval when he did quite a lot but always in the same place.\n The truth was, doing nothing had happened before. There were seven interludes before this one, according to his count, and each of those intervals had felt permanent. But endless life always invited monotony, and there was always the temptation to fall back on the habit of relentless motion. And that’s what happened this time. A passing traveler supplied both a rumor and a name, and the hunter once again boarded his skimmer, setting out across the shifting pack ice, crossing a chain of days and ages, accomplishing nothing besides convincing himself that the chase remained useless and nothing would change. So yes, he stopped once more. Except this interlude felt different. Not only did he build a fine house, the best of the nine, but he also wooed a wife who could share his bed and make conversation, and in the darkness, she sounded just human enough to make him forget Her.\n For seventeen centuries and one thousand days, that was his life.\n Except nothing had changed, of course. He was a searcher and it was his nature to pursue, and the inevitable found him standing outdoors. Which was or was not an important detail. The incident was so ordinary, so pathetically simple, that there was no point claiming that being indoors would have saved him. No, he simply let himself become careless. Standing on the roof of his fine house, looking across the endless ice, the habit of searching for an emerald skimmer ambushed him. Of course there was nothing to see, certainly no skimmer or any other machine in motion, or even a sound that might be confused for blades biting into the white face of the world. But there was still enough imagination inside his soul to trigger ancient habits. He looked for Her and too many memories woke up, and he couldn’t stop them or blunt them, and that’s why he dropped to his knees and wept, and then as a distraction, in despair, he chopped off one hand and stared as the hot blood splattered and froze. There was a battle inside him, and it wasn’t profound or even a little noble. Just a cluster of fond moments with the only woman who had ever mattered to him. That’s what ambushed him, and that’s why he was left in such a desperate state.\n Stack the moments of this man’s life on top of one another, and he was left kneeling and bleeding before a looming, precarious mountain. How could any woman’s face or voice or her simple name mean so much after so long?\n Yet they did.\n If guilt was a liquid, it would be black, and its bitterness was inside his mouth, crawling down his miserable throat. Yet even this ambush of guilt should have done no worse than deliver a few years of gloom. So maybe something else brought him to his feet again. A premonition, a hope. Stupidity, most likely. And standing again, flexing that partially regrown hand, he understood what would happen next and didn’t even pretend to resist.\n The ninth house was abandoned.\n He told the wife everything. Because he was never a creature of secrets and she knew him well enough, he didn’t need to explain for long. She had always understood what was probable, and nothing could be earned by fighting him physically or trying to bury these fossil urges with fresh, sordid emotions. No, the wife simply wished him a long voyage ending in disappointment and oblivion, and she avoided using his name, which was another kind of curse. Then he walked to the berth where his skimmer waited, sleeping inside a helium bath, and while the trustworthy machine woke from hibernation, the man did what he always did, facing the chase without direction: He picked up a straight tool and flung it over his back, as hard and far as possible, and then he walked across smooth ice and broken ice to where the tool was waiting. Its straightness offered two directions. That was critical. Infinite choice was reduced to its minimum, and having made his selection, he fueled and provisioned his skimmer, stubbornly ignoring his house or any quasi-face that might show itself.\n He was climbing aboard when the wife emerged long enough to repeat one of her curses.\n “A long journey and then Death,” she said.\n But in the end, with surprising tenderness, she spoke his name.\n “Kingfisher,” she said.\n Then he left her and he cried about it, out-and-out sobbed, and three days later, still weeping, Kingfisher came across just enough rumor to begin the chase all over again.\n 2\n The face of this world was nearly infinite, and its skin was ice. The deep waters froze and sharp frost came with every fog and hard deep unpredictable snows descended where they wanted. Seams and pressure ridges were common features, and bergs standing like mountains. Every portion of the world’s face had been shattered. Impacts or wind or upwellings of oxygen might tear apart the whiteness, leaving open water. But those oceans were temporary. The atmosphere was many thousands of kilometers deep, thick to the top, layers held aloft by a sequence of demon roofs. That wondrous, abiding cold always rebuilt the ice and sent more snow falling, and there was always too much ice for the infinite world, and when he did nothing, a man could stand beneath the starless sky, listening to the roar as the ice fought against itself, feeling the tremors passing through his ageless bones.\n The chosen direction had to be followed, but Kingfisher’s skimmer was too smart to obey simple lines. Artful little swerves let it attack each ridge at an angle, and where possible, the machine opened the jets full, launching its body on long airborne arcs. These were normal tricks, and Kingfisher didn’t bother to worry, much less steer. He occupied his mind by scanning for skimmer tracks, and nearly as important, watching for trash or broken machines that might bring a price to the right buyer. Two days of that, and nothing was seen. Then on the third day, shortly after waking, he spied a small ark straddling pontoons. The ark’s inhabitants had also seen him, and chattering among themselves, they wondered if that flying man was bound for the city.\n “Which city do you mean?” asked Kingfisher, ready to pin a name to his inadequate, forever changing maps.\n But arks were usually prickly and self-contained, and this particular example was worse than most. It decided to say nothing, not one mouth speaking until after the interloper had fallen out of sight.\n Midday brought a muncher chewing up ice by the megaton, filtering out the salts and metals and rarer elements too. Kingfisher offered polite greetings, and the machine reacted with the question, “What kind of hurry takes you, human?”\n “I’m searching for a craft like mine, but larger and swifter,” Kingfisher explained. “Lovelier and better piloted too.” Then he gave every old tag-number, none of which were likely to be valid anymore.\n Giant munchers rarely pay little attention to those things that weren’t vanishing into their gaping maws. Knowing nothing about any skimmer, that machine preferred to complain about how the ice was both too thick and too poor. The world’s cold was only growing and the treasures from the sky were far too rare anymore. “I am concerned about the future for us all,” said the muncher.\n “Be concerned for me too,” said the human. “Because I don’t have time to worry.”\n Then later on that arbitrary day, just as Kingfisher was thinking about dinner and sleep, he passed close to a blue-sturdy. Like every other ark or machine or indifferent citizen, that creature had no memories of any other human skimmer, much less one woven from emerald and elegance. Through a second-rate translator, using a female voice, the blue-sturdy asked how this human knew that this other vehicle had come this way.\n “I had help,” Kingfisher said. “A tool I trust pointed me along this line.”\n Living within a pressure ridge, the creature stole its life energies from rubbing plates of ice. What appeared at the surface was a tiny fraction of the gigantic entity—a ten-kilometer-long forest of heads and temporary limbs and one voice and various machines built to serve many roles, including talking to the human monsters. The blue-sturdy claimed that she had seen everything and everyone that had passed in this darkness for the last twenty thousand years, and no skimmer like that had ever shown itself.\n “I am sorry to hear so,” Kingfisher allowed. But he intended to press on, loyal to his latest guess.\n “And you won’t find anything else beyond,” the beast added. “Not for another million kilometers, at least.”\n Blue-sturdies reached deep under the ice, and they had amazing ears. With his little mouth, Kingfisher asked those ears, “Where should I aim?”\n “Toward the city, I should think.”\n “Which city is that?”\n What translated as laughter washed over him. “Only the greatest city left in the great endless world, and how can you not know it is here?”\n “Because I am an idiot,” he said.\n Talking down to humans was a blue-sturdy pleasure. And that was the best way to charm them—invite their feelings of superiority.\n “I will give you another line to follow,” the voice said. Then most of those temporary limbs as well as every flexible machine pointed in an entirely new direction.\n “You say this city is near?”\n “Not that, no.” With considerable precision, the blue-sturdy told Kingfisher how far he would need to travel.\n “And there are humans in this city?”\n “Many or none. I would have no way to know, if I cared. But maybe you will find some other voice, and it will speak to you, and you will believe what you hear and give up this pursuit.”\n “Oh, that will not happen.”\n Kingfisher told his skimmer to turn, and it obeyed in its own fashion.\n Then the voice was falling behind him. “How long have you been following this gemstone craft?” asked the blue-sturdy.\n Kingfisher told. Or at least he surrendered the best of the various estimates, which happened to be the most extreme.\n “I do not believe you.” But having dismissed the impossible number, she asked, “And why are you are searching for this other human?”\n With force, Kingfisher said, “It is love.”\n Blue-sturdies had no use for bonding with any creature, particularly their own independent kind. But the human concept was strange enough to earn several days of silent respect. Then as Kingfisher’s skimmer left the reach of her transmitter, the alien pointed out the obvious: “But you have the slower craft. According to your own calculations, this is a race you must lose.”\n “It is mine to lose,” he said.\n “And even if the city welcomes you, your love will be elsewhere.”\n “She probably will be.”\n “You are uncommonly foolish,” said the translated voice. “You have missed her before and will miss her again, and where is the good?”\n Kingfisher laughed.\n “Don’t forget,” he said. “Humans never grow old.”\n Sentient life was always immortal. The blue-sturdy’s response was decanted into the bluntest of questions, “So what?”\n “And this ice, big as it seems, is only so big.” Then Kingfisher laughed louder, adding, “Give me a little less than forever, and my love and I will eventually find ourselves inside the same space, inside the perfect moment. I promise it.”\n 3\n “The world is simple until you put your nose down close to it.”\n She had said those words. She. The ageless lady who piloted that lovely emerald skimmer. In this memory, she was holding him by the back of his bare head. He would never forget the amusement in her voice followed by laughter that wasn’t amused. She was a powerful creature, though he wasn’t certain if she pushed him down or if he had fallen willingly. Either way, his nose was pressed against the frigid ice, and then she said his name.\n “Kingfisher.”\n He loved to hear his name. Always. But particularly from her mouth, the sound of it wrapped happy inside all that history.\n “What does the ice show you, Kingfisher?”\n She must have been furious with him; that was the only reason to play the bully. And there would have been good and justified reasons for her rage. Though he couldn’t manage even weak guesses about what he might have done or not done to deserve this abuse.\n “You know what the ice shows me, Kingfisher.”\n “Trash,” he said into the world’s face.\n She let him go.\n But he kept that nose down, and the eyes. “The rubbish that falls and the rubbish that floats up from below,” he said.\n She said, “No, that’s not what I see.”\n “You see me,” he said. “I’m ugly trash lost in the ice.”\n Exasperated, her anger shifted directions.\n That was one of Kingfisher’s talents. The woman was a great pilot, but he was the master who knew how to steer the pilot, using nothing but careful phrasing and some play-acting.\n “No, you aren’t trash,” she said.\n She said, “What ice is . . . ice is the promise of perfection.”\n That was an old speech being repeated, or it was brand new to the moment. Kingfisher didn’t have enough memory to feel certain either way.\n “Done properly, the marriage of cold and hydrogen bonds allows a crystalline purity that doesn’t need to end. Ice to the bottom of the sea. Ice to the ends of this body. Ice white under the stars, unbroken and smooth and strong enough to hold onto many worlds, if need be.” The great pilot was never sentimental, unless she was. “Now look up at the stars, Kingfisher. Gaze at my sky.”\n He rolled over and blinked two times. At least in the memory, that’s what happened. Two blinks, and he looked.\n Then she told her little man, “The sky is complicated until you pull back your nose. And what do you see then?”\n “Empty cold beauty.”\n “Blackness,” she corrected. “The perfect opposite of ice, yes.”\n By itself, none of this made for lasting memories. Not him being flung down, not her lecturing about grand meanings. What happened next was what fixed these moments into the most trustworthy places inside his skull. The woman laid down beside him. She was larger than Kingfisher, and not just a little larger. She had a splendid body and a mind already ancient and well-traveled, and she was wise in more ways than a foolish man could count. And she was naked.\n “I want you, Kingfisher.”\n She had never said those words, or made any sign that she desired him. This was the first time.\n “While we rest between perfections, take me,” she ordered.\n That is what he did.\n There were other occasions when they coupled, many times. One hundred and two blisses more, according to his best count. Which might not be an accurate tally, since the eons wore away at even the sharpest memory, and he never had the finest recall. Without question, she was the smarter one.\n “I love you.”\n There were long, long intervals when he spoke to nothing but that one recollection. The cracked and filthy, profoundly imperfect ice stretched towards the false promise of a horizon. The starry sky had been replaced by blackness encircling blotches and wisps of bluish light. His skimmer stole hydrogen from the ice, feeding its reactors, and he stole fuel from the skimmer to synthesize his meals, and there was nothing else to do but watch the past and every imaginary future.\n Then came a momentous day when three distinct entities were met, and one of the strangers had genuine news, and that excitement made Kingfisher miss the singular woman more than ever.\n “This time will be different,” he told himself.\n A city floated directly ahead of him, and he knew with absolute certainty that he would eventually find it.\n “This time will be different,” he repeated.\n Except that second time, he barely recognized his own voice, each word sliced apart by the consuming fear that against the miserable odds, he would be right.\n 4\n The city was twenty years and thirty-seven days in the future. Great reaches of ice had to be crossed, delays brought by trash hunting and half-kilometer snows. But tracking the target was easy enough. Cities were slow and massive, and as promised, his quarry was an absolute giant. The ice before it had to be shattered and melted, taken into the reactors and retrofitted stardrives to be used as propellant for the jets. And an open ocean was born in its wake, much of that liberated water close to boiling. But water quickly forgets, and that ocean soon forgot the city, growing chill while every little current played out, the stillness taking hold before the freezing began. That’s when Kingfisher was doubly certain that he was on the right course. He came to a plain of pure hard ice, frozen deep and pretty. Sometimes he paused to lay down microphones and listen with their ears. He couldn’t hear the city’s engines, not like the blue-sturdy could. What he heard and weighed was the music of new water freezing directly ahead of him. Then other tools looked deep into the water, reaching down five hundred kilometers of liquid and various high-pressure species of ice—a sum that was too thin by quite a lot. And he knew what that meant.\n His skimmer didn’t need to adjust its course. Straight on, as fast as possible, and to make the journey quicker, Kingfisher synthesized drugs that brought sleep for days and days, all of it free of dreams.\n Three years to go, and the ice ended. The skimmer reconfigured its hull, sprouting sleek pontoons while its jets made bubbles of gas and roaring noises. But that flat-out racing didn’t last long. Waves appeared, peaceful and scattered to begin with, steam rising from the cooling water. Again, Kingfisher stopped to listen, and that’s when he heard the powerful stardrive jets thrusting hard and steady. So now he began taking samples of the water, pulling out rare ions and lost nano-trash and those tiny furious organisms that existed only in the sewers of cities and the guts that emptied themselves into a city’s sewers.\n Human shit was dissolved in the water.\n The human wanted to fly the rest of the way, but the skimmer refused. Its AI was too old and stubborn in its own ways, forbidding wings in place of pontoons. In fact, it made itself go slower than necessary, and that caution was met with increasingly rough seas and wild blizzards that would have tossed it from the sky. A pilot can demand courage, but the machine had enough imagination to scare itself. What if there was a big piece of trash floating ahead of them, unseen? Or worse, what if the city’s inhabitants were hostile or violent or insane, littering their wake with fusion mines, or worse?\n Four months out, and the ocean was a maelstrom that couldn’t be avoided. Skimmer and man both tried to steer out of its wake, but the city was so broad and destructive that there was no escaping it. Both of them agreed to give up, retreat, and find new ice and then try to flank the slower target. But as if hearing that threat, the city decided to show itself. The entire horizon was covered with its marvelous light, radiant curtains rising into places that had no stars and very little trash, every possible color abundant and swirled together into one grayish whiteness that pretended to shimmer happily when the man stared at it for too long.\n There were days when progress was slow and ugly. The furious ocean wanted to keep them back, and they were sunk ten times every minute. But the gigantic city also reached deep, its jets twenty kilometers below them, and that’s why the final week was the easiest of all. Traveling in the slipstream, the scalding water lay calm on the surface, and Kingfisher decided to slow down quite a lot. He wanted the best place to dock. Studying the architecture of alien buildings and the machines flying above and listening to a multitude of languages, only some of which could be translated, he achieved one critical insight. This was not a city. This was a continent—an ancient word brought out of storage and misused—and gazing at that floating wonderland, Kingfisher said to himself, “She must, must be here.”\n And that’s when he gave up searching for the best berth, silencing the skimmer’s doubts and turning both of them for shore.\n 5\n There was no first moment, no word or glance that came before any other, and no happenstance collision between the mismatched bodies of strangers. For Kingfisher, he had always known the woman and they were always accustomed to one another, if not yet lovers. In those earliest memories, he couldn’t even recall romantic feelings towards the beauty. Because they seemed to be colleagues. Because she was his ranking superior, and untouchable. Traveling together, they were doing work full of critical details, chasing goals that had long ago escaped his understanding. But their lives must have been vital. How could it be otherwise? There were arks and floating villages where they stopped to rest, to speak to the locals, although that didn’t seem to be their normal, official job. Kingfisher remembered very few specifics, except for being certain that he enjoyed being social. And one clear memory involved a young ark that didn’t know enough about the world where it had been born.\n “What you see is not endless,” the giant woman explained to the ark. “But the seemingly endless water and ice that surrounds us . . . all of this is just the tiniest, least important piece of the world.”\n Arks used to fall from the sky with the trash. They usually came as eggs, totipotent envelopes meant to bring the best of an alien world. Never much bigger than a big skimmer, each contained a complicated stew of instructions and stored genetics and just enough machinery to build a large-enough habitat. Every ark was a complete world sitting inside a bottle, enclosed and eternal. A little drip of power from the outside; that was all they needed. And some of these arks weren’t just born ignorant, but they refused to learn anything what was beyond their own diamond wall.\n “The Beltrami pseudosphere,” the woman said.\n Kingfisher must have known those words and what they meant. Except they were only random noise now.\n “We are riding on a starship shaped like a Beltrami pseudosphere,” the woman said. “The world we know is the ship’s bow, round and flat. Our ship began its journey with the helpful shove from an exploding star, and ever since, whatever stands in our way is absorbed. Interstellar hydrogen gas collides with the deep atmosphere and the demon roofs, and then moving slower, it combines with the air’s oxygen to make water. To build snow. That falls and becomes the ice, and the ocean grows deeper, and the water that’s pressed against the ocean floor is torn apart for its hydrogen, as a fuel, while the liberated oxygen bubbles back up to the air. But helium is different. Helium doesn’t play with any element, including itself. The demon roofs slow it, and the gas mixes into our breaths, and then helium scrubbers pull it free with laser light and zero-degree traps. Because helium is a worthy starship fuel too. And so is everything else, by the way. The dust between stars collides with us and is absorbed. Comets and lost machines and clumsy starships and arks that aren’t as good as you. Anything with mass that comes into our path is essential to powering the world’s single rocket engine.”\n She was trying to teach the ark to see its extraordinary luck. That was every teacher’s job, trying to make the student appreciate what couldn’t be seen. And unknown to her, she was also delivering the lecture to the innocent idiot that was Kingfisher today.\n “Hyperfiber,” she said.\n That word he could never forget.\n “The pseudosphere is built from hyperfiber. The highest grades, thousands of kilometers thick and pure. And we are barnacles riding the hull.”\n Whatever “barnacles” meant.\n “I am one very important crustacean,” she said, “and the remarkable hull hides under this little endless ocean of ours. The hull’s mass gives us much of our weight. The ocean gives us a little more. If we drained the ocean, you’d find your bottle resting on a gray plain that is just slightly, so imperceptibly, less than flat. You see, the bow tilts towards its center, and it grows steeper as you move inwards. And if you rolled to the middle, what would you discover? A bottomless hole capped with machines and demon floors and protocols and repair systems. The pseudosphere becomes a magnificent column that perpetually narrows as it reaches far behind us. And all of these machines and demons and systems and rules constantly sort out the captured grit and shit. Helium is squeezed into Bose condensates, and the hydrogen is yanked from the oxygen, then compressed into metal. Every fuel is shoved into that magnificent mouth. Then trickery and crude physics, plus bracelets of degenerate matter, trigger all recipes of fusion.\n “A quasar. One narrow and spectacularly tamed quasar, self-contained and relentless. That’s what drives us between the stars and beyond the stars. The engine’s acceleration is another part of what we feel when we stand and when we sleep. Be aware: Every piece of this ship serves the ship. I am here to do just that. And my Kingfisher too. Ocean and atmosphere are here to slow what falls on us, and to let us do our work more easily. We are generous creatures, let me tell you. Warn you. You exist because of our considerable kindness. Do not forget that. One unkind impulse and the flip of a switch . . . that is all that it would take for this icy watery world of ours to be drained away, roaring down that endless hole, then transformed into the purest fire.”\n There was a pause, long or brief. Kingfisher could remember the silence either way.\n Then the ark asked its only question. A mishmash of dense, interwoven bodies and species and genetics generated a child-human voice that wanted to know, “And who holds this awful switch?”\n “I do,” said the giant woman. “I am this ship’s pilot, and I am your future.”\n Then she laughed, enjoying some or all of this teaching business.\n 6\n Rules could be ignored, laws subverted, and every code was subject to slow erosions. But a skimmer owned by a human was always secure from theft or abuse, and the way it had always been was the only way it could be.\n Kingfisher found and claimed an empty berth.\n “Boundless storage,” he wanted.\n These docklands were owned and managed by an AI with one thousand bodies and some very clear ideas about the value of its services. “One sum for every three point nine days in cold storage.”\n “No,” the human said.\n “Leave and find better,” the machine suggested.\n Find better first, then leave. That’s what Kingfisher attempted, but every other facility was more expensive or offered inferior services.\n “Very well,” he agreed.\n Contracts were etched in digital realms and on the skimmer’s belly. If nothing changed, his existing funds would be drained before the next century. Watching liquid helium pour over his old friend, Kingfisher asked about the city’s name.\n “It has no name but the City,” he was told.\n So the full name was forgotten or left behind. Then he asked the AI about a skimmer rather like his, but different.\n “Never here,” the machine answered.\n “Anywhere else?”\n “A thousand sums for my Citywide inquiries,” it said.\n “Fifty and my universal praise of your skills,” he said.\n They settled for two hundred and no praise. Then after a lengthy search—so long that Kingfisher had time to fill a sack with trinkets that might be sold, then walk to the edge of the docklands—the machine reached out to say, “Emerald and with two of the proper codes, yes.”\n “Where is it?”\n “On the other side of the City, before. But it has vanished from its berth.”\n “She left,” he said.\n The machine couldn’t agree or disagree. “This was long ago, and the records have been corrupted. But no, it appears as if the skimmer you want has not been sold and not been taken away either. ‘Vanished’ is the word that I see.”\n “And how long ago?”\n “Are you able to envision one million years?”\n “Of course.”\n “That is a beginning,” the voice said. “Now count another nine million years, and fifty million more after that.”\n 7\n First moments didn’t exist, but the last instant remained vivid. Yesterday was never as real as that final day with Her.\n The one-hundred-and-third coupling and a quick feast of electrified fats led to the woman’s marching orders. They were on their way to a city called Between Here and Nowhere. Someone needed help or advice with difficult tasks that the two of them could manage, if inspired by suitable money. The job’s specifics were always lost, but not the taste of the meal, which was ordinary, or the taste of the cold air between her palatial skimmer and his relatively simple vehicle. A considerable amount of helium was mixed with the oxygen, and there were too many stars to remember all of their names, and Kingfisher breathed because he liked the action, even though humans had already adapted to anaerobic metabolisms. He sucked at the cold thin pleasure of the still air and listened to his boots on the ice and to the ice grinding so that his bones carried that noise to the ears, and then stepping aboard his skimmer, he felt something. Not a premonition, because premonitions would have changed his behavior. No, he felt the very slight wobble of ice that was at least half a kilometer deep, and eons of reflection and doubt had proved to him that some little bolide must have struck near enough to make the ice cap ripple like a drumhead.\n He could have measured the disruption but didn’t. She was already underway, and the odds of trouble seemed too slight to calculate.\n Her skimmer was so quick and powerful, and she was the same. It was always a chore to keep as close as he wanted to be. Every day was a chase. She claimed to enjoy winning every day’s race, and there was considerable evidence that she being honest. Pride and a self-absorbed soul and status and wealth. Each was a quality that she had in abundance, and Kingfisher was chasing what he had to catch, thinking about nothing else. Which very likely explained everything else that had ever happened to him, and ever would happen too.\n The next bolide was not little and not distant. The ice and the water beneath Kingfisher didn’t just exist for the convenience of life. They served as buffers to everything that fell onto the ship. In that distant age, sometimes the sky brightened when the largest objects were inbound. Defensive arrays could split apart the invading comet or some mountain of cold iron, lessening the risk to the hyperfiber below. That was what happened that day. Kingfisher saw the flares above and considered doing the very unusual, reaching out to the starship’s central communication system. Which was still operational, yes. But first he shouted to his lover, telling her to be careful. “Rough weather,” he said, which wasn’t adequate as anyone’s final words.\n Then she called back to him, saying, “Hurry,” and maybe quite a lot more.\n But the impact was close and not far behind him, and the flash turned the world to steam. Kingfisher’s skimmer rose high and came down spinning and temporarily dead, and Kingfisher was dead inside it. Those two factors would have normally amounted to very little. But the dead skimmer let its hull get breached, and boiling water poured into the cabin and took both of them under. For eighty-eight years, they lay on the bottom of the ocean, inside the Ganymede ice, waiting for the repair team to find them and give just enough aid to leave them despondent on the still-liquid, still-warm surface of a shrinking ocean.\n “There was a woman with me,” he told the robots, the AIs. But neither group knew anything about any women. Then he spoke to the engineers in charge of the project. “She was ahead of me, and the impact was behind, and she should have survived.”\n “She should have.” The ranking engineer was a towering alien, a harum-scarum, speaking through his breathing mouth.\n “Where is she?”\n A scaled hand reached for Kingfisher, twin thumbs turning his head one direction, then the next.\n “Search for her please,” he said.\n Then the harum-scarum said, “We have searched without realizing it. Since the repairs started farther from the blast zone, and we’ve been working our way inwards ever since.”\n “So she escaped,” said the human.\n “Unless there’s another explanation,” his companion warned.\n “As in?”\n “Do you know what hyperfiber is?”\n “Of course I know. Why ask such a thing?”\n The engineer said, “We were hammered by a moon-sized object. Our ocean barely slowed its descent. You don’t want to hear how much of the hull was damaged. Let’s focus on a shard that wasn’t much larger than your tiny hand, intact and accidentally sharp as only hyperfiber can be. That razor shard crossed hundreds, maybe thousands of kilometers at a fraction of light speed. And judging by the evidence, it’s only purpose was to catch you below your monkey jaw, cutting through the skull and your bioceramic brain, and then happily flying on.\n “You have healed remarkably on your own, sir. But some wounds won’t ever repair themselves.”\n “What are you telling me?”\n “What are you asking me?”\n “I know what hyperfiber is,” Kingfisher repeated. “I know what my name is, I know how to pilot my skimmer and speak to you in full, compelling sentences. And I understand that you think that I’ve been left an imbecile.”\n “Not an imbecile, no.” The harum-scarum let him go. “But about this woman of yours. I wonder. Is she real in every way, or real only upon this torn-apart mind of yours?”\n 8\n Ice and the cold were lost. The City That Needed No Other Name was vast enough to make its own weather under a shimmering sky full of flyers and song. Broad slow filthy rivers drained the distant interior, and keeping to the shadows, keeping alone for as long as possible, Kingfisher walked to a river pier and boarded the first swift liner heading upriver. Then sitting as far from the other passengers as possible, he woke the last of his working nexuses.\n Linking to agreeable channels, he announced, “I have items to sell. Rare treasures from the far reaches of the world.”\n A multitude replied, and where he saw promise, he surrendered details and a plea for bids.\n The long cabin was filled with aliens. He recognized a young Sun-of-Need, three Pilldogs, and one Janusian couple. But unfamiliar species dominated, and he had no urge to approach any of them. Yes, it was disappointing to hear about the millions of years between him and his lover. But this was undeniable progress. A slow, methodical search would give him results, maybe some rich clues, and best of all, centuries filled with promising work. Kingfisher wanted to roam the City, and for far longer than just a hundred years. That’s why he needed to sell the trash acquired on the ice, and that’s why he was disappointed when no substantive bids arrived. What if his valuables were true garbage? That was another question to be delayed. Another tough decision was delayed, and after paying passage to the river’s source, he bathed himself in security and fed himself his finest sedative, passing across those next thirty hours in one spectacular blink.\n He woke abruptly.\n A woman was holding his hand.\n She was human. Maybe. But then she let that warm human hand change its nature, and he didn’t know what she was.\n Kingfisher pulled back.\n She laughed at him, at his fear and disgust. Then she was purely human again, smiling as she said, “Panwere.”\n “What’s that?”\n “My species’ name.”\n Kingfisher didn’t care about alien names. His security bath was inoperable. That’s all that mattered now.\n “I protected you,” she said.\n Or left him exposed. But at least his sack of treasures remained sealed and encrypted, dangling from his young left hand.\n “Do you need a guide?” she asked.\n “When I don’t know where I’m going,” he said. “But I always know, so I don’t help.”\n “Fair enough.”\n Kingfisher shifted his rump, creating distance.\n She laughed at that too.\n The river liner was approaching its final destination, the long cabin empty of passengers, everyone below, ready to disembark.\n “So where are you going?” she asked.\n Kingfisher refused to answer.\n She refused to drop the topic. “Because there’s no City like the City, and someone as old and innocent as you are—”\n “How do you know what I am?”\n “You’re the man who made a public call about artifacts and then left your position exposed. You’re the man who sounds and acts and smells like someone who has wandered the wastelands until there’s nothing but pack ice and solitude inside your skull. And in the City, that sorry kind of entity will be mistreated and abused until he hovers near death.”\n “Maybe that’s my goal,” he said.\n The false face was watching him. She wasn’t laughing now.\n Horns roared, the liner grabbing the final pier, and Kingfisher picked up his body and his bag, walking fast until she caught up to him. Then he stopped, hoping she would pass him and move on.\n But the panwere creature just stood beside him.\n “Here,” she said.\n Six objects that belonged inside his bag rode inside her cupped hands.\n “These are the only valuable items. Null-cores and nonfunctional quagmires from unknown aliens. They fell on your faraway ice, and you thought they looked neat or pretty, and that’s why you foolishly brought them along, exposed. But I kept them safe and you safe when the thieves came sniffing.”\n “What thieves?”\n “The ones you slept through.”\n He unsealed his bag. Its familiar weight came from slugs of iron and one dense bone stolen from an alien finger.\n She asked, “Why do I want to help you?”\n “I don’t know why,” he said.\n “No,” she said. “The correct response is, ‘I don’t care about reasons. But I am thrilled that you are here, looking out for me.’”\n Kingfisher started to walk again, reaching the ramp leading down to the pier, and the alien was close beside him, deftly slipping those six stolen items back where they belonged.\n They were the last two passengers to leave. “I know a responsible buyer,” she said. “Offer those six baubles now, with proper documentation, then ignore the curses and settle for the buyer’s third and last final offer. I’ll show you how to stow them inside an approved locker, waiting for their new owner. And as soon as that’s done, you’ll have funds enough to fly both of us to ten thousand destinations, in luxury.”\n Kingfisher stopped under the brightest lamp.\n She stood beside him, close but not close. An hour passed, and another hour. Not one word was spoken.\n At last, he asked, “What sort of payment do you want?”\n “Stories,” she said, the smile returning again. “Tell me where you have been and what you have seen and what you know for fact and by legend.”\n “You want to hear about the ice?”\n “Yes,” she said.\n Then she laughed once more, saying, “Plus my gracious help deserves one sum every five point five days. And with that rate, there are no negotiations.”\n He made a face.\n The human hand touched him softly. “Did you really believe you can win anyone with just your words?”\n Kingfisher stepped back, but he already missed the feel of those fingers against his lonely cheek.\n Maybe that was why he agreed to her terms.\n More likely, it was greed.\n The relics were sold, the transaction happening exactly as promised. Then trying to shepherd his modest wealth, Kingfisher booked passage for both of them on a slow public cap-car. There was no conversation. No stories or questions and certainly no explanations about the alien’s nature. Silence seemed like the most natural state between them. But he finally made himself say, “You must have a name.”\n “I most certainly do.”\n “What do I call you?”\n “Whatever you wish to call me.”\n “And do you want to know my name?”\n “If it helps,” she said, laughing hard. “Particularly if it helps you tell these extraordinary, fascinating tales of adventure. Why not?”\n 9\n The emerald skimmer had vanished. That’s what the AI dockmaster had told Kingfisher, and there was no reason to assume otherwise. But Kingfisher needed to see where the machine was once stowed, and he was compelled to stand exactly where his love stood, staring out across the ancient, doomed ice. The City of Thieves. The City of Monsters. The City Ploughing Straight Ahead. Hyperfiber prows and picks were far below his feet, chiseling into the frozen whiteness, creating pockets where sonic drills and superheated rivers could enlarge the fractures. But the simple relentless mass of this huge metropolis did most of the work. Newborn crevices reached a thousand kilometers ahead. Kingfisher felt certain about the number, though he couldn’t say why. Tearing ice had a predictable thunder, which he knew quite well, and he watched thick wedges rise sideways and lengthwise, standing ten kilometers tall before shattering along every weak line. Which resulted in a different, more musical roar. Then those little cubic-kilometer bits were shoved on top of one another, fighting to avoid the City of Annihilation. Slush and ice and sound were wrapped around complex mathematics, creating a temporary wall that kept the bow submerged. Kingfisher was standing on a seawall made from hyperfiber. The silvery wall rose two kilometers tall, and every sliver of shattered ice and every agitated drop of meltwater was pushed under the bow, sliding down to places where the City of Heavy Engineering could swallow everything inside a sequence of gigantic mouths.\n “This was my job,” he said.\n His guide couldn’t hear him over the thunder, and he didn’t show his lips to her. That’s why he made the confession.\n “I was an engineer before I was mutilated,” he whispered. “A great expert in hydraulics, with a specialty in a certain line of pumps.”\n The panwere was standing on his left, watching someone else approach.\n An antinoise screen was deployed, and inside that abrupt, perfect quiet, a new voice whispered, “May I help?”\n A human male stood on Kingfisher’s right. He could be any age, but ancient was most likely. It was the way that he did nothing but stand, perfection mastered by the infinitely patient legs.\n “This used to be docklands,” Kingfisher said.\n “And it will be again, whenever the City makes a significant change of course.”\n Every city coastline bristled with intakes and engines, helping to make these vast creations simpler to steer. Not gracefully easy, no. But at least you didn’t have to pull on a wheel and force a five-hundred-kilometer rudder into some new direction.\n “Was this dock your facility?”\n “Yes, sir. And it still is.”\n “The berths are mothballed?”\n “Under the hull over here. As soon as we reverse course, the ocean falls away, and I leave my retirement behind.”\n Kingfisher glanced at his alien guide. Did she have questions for this man, or perhaps insights for her new employer?\n Apparently not.\n “An emerald skimmer,” said Kingfisher. He started to give codes and details, but the man interrupted.\n “I know it well, sir.”\n Which was puzzling. “You know it yet you lost it.”\n “Who claims that I lost anything?” The ageless fellow couldn’t straightened his back anymore. “‘Reliable as the day is long.’ Have you heard that expression, sir?”\n “I think I have, yes.”\n “That is me, sir. ‘Reliable as the day is long.’”\n “But that cliché makes no sense to me,” said Kingfisher. “Days aren’t long. Years aren’t long. Centuries are little more than nothing.”\n “But every good day is exceptionally long, sir. If you allow it the chance.” The retired dockmaster spent a good moment studying the panwere guide, making assessments. Finding no reason for caution, he said, “The concept ‘lost’ is popular with AIs and other machine minds. Objects thinking about objects. That’s what they are. And objects always crave to be labeled and properly stowed. But we humans, we understand . . . something can be out of sight, and maybe something vanishes in one manner or many others . . . but that is nothing like being truly lost.”\n Kingfisher was ready with one question, but another confession fled from him instead.\n “I feel lost.”\n An honest assessment, and what could be said?\n The dockmaster shrugged.\n Again, one question was ready. But the lost man couldn’t make himself ask it. Turning, he watched that wilderness of shattered ice and the distant towering peaks. Without noise, the majesty had been transformed. Free of thunder, every watered face of ice became lovely and weak.\n “Where is this City heading?” asked Kingfisher.\n “I am not our captain. I can only guess.”\n “So guess.”\n “To the end of the world, or nearly so.”\n The guide saw some reason to laugh, and she didn’t pretend to sound human. It was a chittery giggle, and the two humans looked at each other.\n “The emerald skimmer,” Kingfisher said again.\n “Yes, sir.”\n “Is it still stowed in its berth?”\n “A berth paid for from now until the end of the universe. Yes, sir.”\n Kingfisher entered this moment expecting bliss. All of these ages, all the relentless endless thankless chasing, had come to this. But the opposite emotion was what arrived, ambushing him, the surprise nothing but cruel. Legs that had held him upright for millions of years failed him. No time had passed and he was sitting on the walkway, stricken and cold. Every human had his heart. In easy times, the organ helped the blood move, and that four-chambered muscle was a useful marker proving that its owner was a member of an ancient, wondrous species. But the organ served mostly as a gauge of emotions. Its beat and the pain inside the chest told quite a lot, and this particular roaring heart threatened to burst, promising to kill itself just to accent the man’s utter misery.\n Kingfisher’s guide knelt first.\n The touch of three fingers was welcome.\n Then the dockmaster knelt, putting his face level with Kingfisher’s face. “I believe you,” he said. “I have never seen any creature more lost than you, sir.”\n The pounding heart did not slow.\n But Kingfisher’s voice sounded remarkably calm. “So she stowed her craft and left the City by other means,” he said.\n “No,” the man said.\n “But she eventually left you. Correct?”\n “Hardly.”\n Then the guide spoke, her mouth changing shape to accommodate a string of chirps and pops.\n With his human tongue, the dockmaster said one name.\n Kingfisher watched the two of them nodding, exchanging some vast understanding coupled with surprise.\n “So my love is still here,” Kingfisher decided.\n But the City of Nightmares was vast, and there must be millions if not tens of billions of humans scattered among the aliens, and that meant more years of searching before the end.\n “Here, yes,” said the man.\n Then the panwere touched Kingfisher with hands and lips, his forehead receiving those small affections while the mouth once more became human. And quietly, tenderly, she told him, “She is our City’s captain. She is the Master steering us on this course, as she has since the day after the day she arrived.”\n 10\n “Before this existence, I had the most splendid life.”\n Those words. She often said those precise words, and then after some delay, more words obediently followed behind. His lover had many, many tales about terrible loss and tragic suffering, as well as passionate, inventive curses directed at long-ago foes. But Kingfisher never put his arms around those words. He might be standing beside her on the ice or sharing the air inside her palace of a skimmer. Sometimes he was inside her bed, laying quiet while she sat beside him, looming over him, screaming about the unfairness and idiocy of a universe that would allow her to be cheated out of everything that she cherished. But there wasn’t one memory where Kingfisher gave a good shit about what the woman had suffered or what was stolen or the color of her grief or the darkness inside her dreams. He worshipped her present life, which was still magnificent. And yes, his brain was mutilated, forgetful and leaky and odd, but he was quite certain that he never felt anything but utterly jealous towards the so-called splendid life that cursed her existence, and his.\n They coupled one hundred and three times. She said Kingfisher’s name ninety-two thousand and nine occasions, by his count. That feminine voice was rich and booming, exactly suited to giving orders, and it was the sound and the energy of her voice that he focused on whenever she roared. The passions of a god were washing over little Kingfisher, but the words didn’t give a shit if they were understood. Words were practiced noise, none of them possessing a soul, and indifference was Kingfisher’s secret skill. This was why he could remain beside her for so long. Woeful tales about impossible places, duty orders and criticisms, plus the silences that sometimes stretched ahead for years. That was what he endured. Nearly a thousand times, he was invited into her bed, which meant that most occasions brought nothing but poor sleep and pretending to listen. He never touched what wasn’t offered, and he was exceptionally good at remaining still, careful to nod and careful to say, “That is sad,” or, “I wish it wasn’t so.” The lies of every devoted lover, and the man never felt wrong or foolish. Or vindicated. Or reliably happy either.\n Then there was a very different aeon, and another bed.\n Kingfisher’s own skimmer was a sleek machine spun from diamond webs, holding twin reactors than never failed. The best repair AIs, the finest recyke systems. And an automated pilot incapable of mistakes. But no system was eternal. The skimmer announced that it couldn’t continue. Too many portions of its elderly body needed fixing, and after a decade of dedicated searching, Kingfisher found a village capable of the work, and at a reasonable cost.\n The village called itself Gracious, and for three years and thirty-eight days, he lived nowhere else. But because every roof sported sails, the community was always sliding along the ice with the prevailing winds, moving in a direction not too different from how he wanted to move. That’s why Kingfisher felt that the chase was still on. Any progress meant that he slept well, and he ate every meal with strangers who turned into friends, and there even a few humans among the citizenry.\n These new friends had no choice but to learn a lot about Kingfisher. Never a creature to hide emotions or his goals, he asked each about the giant human woman and the emerald skimmer. Had they seen both or heard stories about either? They hadn’t and they hadn’t, but maybe they knew about other villages or little cities where a devoted man could corner the amiable, better traveled citizens, pumping them for valuable information.\n Every hour, without fail, some smiling voice would ask, “Is success even possible, so much time has passed?”\n Almost every day, some elder would touch the traveler gently, then a wise voice would suggest, “Maybe, sir, you need a different quest. Maybe you need to forget more of your murky past. Maybe you deserve better for your life, sir. Maybe the one you chase is not the one you deserve.”\n That talk meant nothing. More practiced, soulless words. That’s how Kingfisher felt then and always. Each of those possibilities was easy to spot and just as easy to set aside. No, he remained a creature of focus and endless resolve.\n There was one unattached human woman, and he eagerly slept with her. There was no reason to count the times, much less chisel the details into his brain. This was biology. This was warmth and companionship that was finer than what machines and imagination could render for a man, but not markedly superior. This wasn’t a tenth as fine as the very strange wife Kingfisher would take with his tenth long-term pause in the search. This happened between his third pause and his fourth, and during their last night together, his bed partner made it her mission to stop him from leaving.\n Obvious old tactics failed in succession. But then again, she was just trying to numb him to her true plan.\n She repeated several of his favorite stories, and then invoking logic, she said, “You don’t love the mystery woman. You love the chase.”\n Not untrue, and why would admitting that stop him?\n “I can imagine loving you,” she promised.\n “Can you?” he asked.\n She said nothing. Then she said, “Yes.” Then she silently watched her bedroom ceiling. A picture of stars taken in a much different age was on display, and the best she could offer then was, “I’ll love you better than she loves you, you idiot.”\n The idiot had to laugh at that.\n He thought that he was strong and smart, but no, he had fallen into her trap. The woman turned her face to look at him, and then her entire body spun about, and with a strength normally kept hidden, she took hold of Kingfisher’s wrists and pulled the forearms together, her face dipping until she could suck on the tips of each of his fingers and then both thumbs. Then she sat up again, and with a sadness that would ache inside him for eons, she said, “You know. You do. That you have forgotten so much, what with time and that accident.\n “But has that broken head ever asked you this question:\n “‘What compels a man to cross the infinite ice, seeking out the lady who left him for dead . . . the lady who has spent a hundred million years conspicuously and forever leaving him behind?’”\n 11\n Two companions accompanied the hunter to meet his destiny. They shared one fine reason, which was curiosity. How often did this kind of situation arise? Not just in the City of Magnificent Coincidences, no. But onboard this marvelous pseudosphere starship, or anywhere inside the universe where it roamed? This was an event without precedence, and if either one of them was a social creature, he or she would have brought a crowd of friends and tag-alongs on this sudden journey to the City’s bridge. But it was just the two of them, and it wasn’t just curiosity that they shared, but also a measure of tenderness. Who couldn’t feel sorrow for this broken, lost, and very odd human pursuing ends that made so little sense?\n The Master was on the bridge, as she always was.\n And she was guarded by security troops and munitions, and more dangerous by far, a cadre of machines and machine-like organics whose existence was wrapped around the Master’s well-being.\n Public offices led to quieter offices, and then a sequence of waiting rooms and cavernous lobbies where underling after underling would emerge long enough to ask the same questions and record the some variation of the same responses before retreating for realms that no ordinary creature would ever see.\n The obvious took an embarrassingly long while to be seen. But Kingfisher finally realized that these workers were deeply curious about the mysterious visitor. The story that he needed to tell more than once had already been retold by others many thousands of times. Kingfisher was the unexpected dressed in novelty. He was the most unique event to come into these busy important but generally changeless lives, at least since these creatures were children and delightfully innocent. Even the name, Kingfisher, was a subject of considerable interest. One nobody with minimal clearances and zero authority knelt before him, and proud about his talents, he showed the hunter and his two partners an image pulled from the most ancient database. A blue monster called a kingfisher stood in brilliant sunshine, bright amoral eyes gazing across generations and millions of lightyears, decidedly unimpressed by whatever it happened to see.\n The second to the last interviewer was a soldier, a harum-scarum trained and happy in his duties supplying protection to a woman who needed no protection. That’s why he was charmed when the traveler asked to see his ornamental sword. And then this Kingfisher mentioned that he liked the blade and the feel of its weight, and could he hold it until the end of the work day? Its presence made him happy.\n Here was an emotion every harum-scarum would understand. “I will return at the end of my shift,” the alien promised. “Hold it tight and be strong, sir.”\n Another underling emerged from the main bridge, but this was not a small creature pretending importance. She was the last wall between him and her Master, and since every decision had been made, every permission already granted, her only duty was to stand at a distance, reminding each of the three entities that they were in the presence of a busy soul who was giving them too much time and they should be pleased for this honor, and they needed to be polite, and if her Master wished, the conversation might, but only might, continue into a quick dinner. But nothing more. “And you should expect quite a bit less,” she said.\n She was a panwere, like Kingfisher’s guide.\n Then her mouth changed, insect creaks and pops emerging and then fading again.\n The two aliens might have been laughing.\n The retired dockmaster understood enough to join in with soft chuckles.\n And Kingfisher sat with the sword, making ready. Many times today, during conversations but particularly during the quiet times, he had realized the truth. This journey, his great chase, had never been about love, of course. No, he had traveled halfway across the universe and across billions of kilometers of ice in order to murder the woman who abused him and then left him and presumably forgot him many times over. But until now, that reason was lost. Lost because he was damaged, yes. But more importantly, lost because the blunt fact couldn’t be confessed to anyone. Nobody would help an assassin, even if his cause was just. So Kingfisher had invented his devotion, and the lie took hold inside him. Words never had souls, but with the ages, the man making those practiced noises had no choice but to believe what he said, claiming to All that the hard beating of his heart was linked to a great enduring love.\n Too many times today, Kingfisher had decided to kill the woman. Except the security was heavy, and his hands were empty. So no, his first plan was say the expected words and smile and maybe weep a little, then retreat, going off to make slow, delicious plans, using his fresh little wealth to buy weapons or build traps that would bring revenge.\n But was murder best?\n The sword was acquired through a fluke. This weapon was intended for show, all but harmless even to weakest immortal. But what Kingfisher decided next was to rush the awful woman, using steel to carve out her heart and then somehow carry that muscle away. As a trophy, as a hostage. Maybe as a warm salty dinner. That kind of insult would kill no one, but it would be satisfying. Wouldn’t it be?\n Surely, yes.\n But no.\n Then the panwere arrived and spoke, and then she returned to the bridge, promising the Master’s appearance inside the next few moments. And with the calmest voice inside the calmest of skulls, Kingfisher said, “No, I’ll cut out my own heart. That I can do easily enough. Slice it from the rib cage and fling it at her face. She will remember that. They will all remember that. And best of all, it’s something that I won’t ever forget.”\n Then the giant doorway opened.\n Patient slow feet approached.\n Kingfisher gripped the sword with both hands, practicing the surgery in his head, making himself an expert.\n The Master came into the room alone.\n She looked at the three visitors, and with a perfect memory woven from a multitude of nexuses and linked AIs, she said, “I know two of you.”\n But not the man in the middle, she implied.\n Which was very reasonable, since Kingfisher had never seen this woman before in his life.\n 12\n Midway through the tenth pause, when Kingfisher felt as happy as he could ever feel going nowhere, a world came to visit. The ark was small and ancient, and more than most of its kind, it was wrapped tight around its own existence. The last long ages had been spent in the ocean below the ice. An upwelling of oxygen and several equipment failures lifted into a fissure within an easy walk of Kingfisher’s front door. He ignored its presence until the fissure closed and froze hard, and what else was possible? Kingfisher put on heated clothes and came out to sit beside this little mountain of diamond and vacuum floats and dense organic matter meant to replicate an entire biosphere. But as usually happens with arks, the world had one voice and a single attitude honed by living forever in the pressurized cold far below.\n What must have been eyes watched him and watched the sky.\n “To where are we traveling?” asked that shared voice.\n “Nowhere from what I can tell,” he said. “But the ice is trying hard to shift, and you’ll get torn loose. In another few years, with luck.”\n The voice said, “No.”\n Sexless and quiet and a little sad, perhaps, it said, “You misunderstand.”\n Then every eye stared at the perfect blackness above, and those little blemishes of blue light clustered closer to the sky’s heart. And the same question was asked. “To where are we traveling?”\n Kingfisher decided to say nothing.\n Then the ark said, “We were told where. A human once explained quite a lot to us, and would you like to hear?”\n “No,” he said.\n But they told it anyway. They claimed that there was a time when the human species was still quite young and a cold machine of endless worth was found abandoned and taken by human hands. But other creatures stole the treasure and then flew it far away, and this galactic ship, this vast pseudosphere astonishment, was built to give chase. Passing worlds were invited to send arks to the ship, which was a superior means of building diversity while acquiring every sort of the strength. This ark claimed that somewhere in that blueness was the only treasure worth possessing in the universe, and one day it would be found and recovered, and it was such a comfort for a soul, knowing that there was purpose to life and an end was coming.\n Somewhere inside that telling, Kingfisher stood and walked away.\n The human-voiced wife spoke as he entered his home. She said his name twice and asked what the ark wanted, and he picked up one tool and then asked for an item that wasn’t in the first locker or the second. But here it was, hiding in the third locker, and he thanked her for her help, and she said in her very pleasant way, “I didn’t help at all and be careful.”\n The ark watched him return.\n That shared voice asked, “Is that a bomb?”\n A uranium bomb with a heated sheath, yes. Which they recognized and there was no reason to say anything else.\n Kingfisher engaged the device and set it down, and as soon as it had vanished into the ice cap, he put the plasma drill against the smallest of the ark’s vacuum floats. The hyperfiber was stubborn but not invincible. He quit working only when the ark mentioned violence, and only to tell it, “This will put you back at neutral buoyancy. I think. And don’t dare threaten me again, or I’ll blow the bomb early and your voyage comes to an end.”\n There was a long, frightened pause.\n Or maybe the ark was calm or at least resigned to its fate. Who knew with such a strange amalgamation of genetics?\n When Kingfisher was finished, stowing the drill back into its box, the ark repeated what it said earlier. “A human told us where we are going.”\n “Was this human female?”\n “No.”\n “Was she a giant female?” he asked.\n The voice said, “No, and no. The human was masculine and not large.”\n The nuclear charge was deep enough now. A signal arrived, and the expectations of an order.\n Kingfisher gave no instructions.\n Then the ark said, “This was so long ago. Memory is a fluid and fills any bottle it’s given and we are a bottle in every sense. But the male human that we remember had your face and your voice.”\n “You’re right,” he told the ark.\n “Yes?”\n “Memory is water, and water flows where it wants.”\n Then he retreated just far enough and set off his very expensive bomb, for no reason but to make the ark leave him alone, and the ice was still shaking when he returned to the house and the woman and the darkness inside every silent room.\n 13\n A day like none other mercifully found its end, and another fifty-eight days followed, quieter by comparison but never easy or small or quick to finish. A giant human lady had been charmed by this stranger, and because of that or because it was so very easy, she gave Kingfisher access to old records that might not be more than a little corrupted. There were three emerald skimmers registered in the central files, he learned. The tag-numbers that he assumed were important were exactly that. But each of the three vehicles wore the same numbers, and there was no way to know where the other two were just now. But because it might help to learn about their whereabouts, the Master ordered her emerald skimmer taken out of storage and transported back across the City Pushing to the Edge of the World.\n “You need a better vehicle for your chase,” she told Kingfisher through a messenger. “Find the lady you want so much or my colleague with the third skimmer. Then send me word, if you can. This voyage has pushed on far longer than anyone imagined, and every big thing is a mess, obviously, and I could use any help before trying to bring order to this big stupid nearly useless ship of ours.”\n The emerald skimmer was exactly the same as the one he remembered, except when he stared for too long at any wall or doorway, and then every tiny detail proved that this wasn’t his enemy’s at all.\n Sometimes he cried while walking those long hallways.\n But mostly, he trembled with excitement for the coming voyage.\n His guide remained with him to the end, paid her fee and a bonus too. Kingfisher had considerable money, most of it in the form of gifts from wealthy aliens that had too much of everything but novelty.\n Kingfisher and the AI dockmaster stood watching the quiet water behind the City That Never Rested, and then the human turned to the panwere. She had been his companion for fifty-nine days, which was no time at all. They had touched on five occasions since the first day, none of those gestures important. Yet he remembered each time and smiled for good reasons, and after a little while he said to her, “I have met your kind before. I’m assuming.”\n “There are a few of us, yes.”\n “Can you really take any form you want?”\n “What I want is too much, so no.” She laughed with that insect voice, then returned to tongue and lips. “But I enjoy quite a range of possibilities, yes. Within the limits of mass and energy and imagination and decency, yes. Everything is possible.”\n “I have had three ideas,” Kingfisher said.\n She waited.\n “The first idea was that you follow me inside my old ship.”\n She showed him nothing with her face, but the voice said, “I won’t.”\n “My second idea is to invite you to ride with me across the ice,” he offered. “This wonder of a skimmer would be a comfortable home for us and anyone else we find along the way.”\n She began to say, “No.”\n But Kingfisher already put his finger on her mouth, feeling teeth and heat and spit too.\n “No, the third idea is what I will do,” he said. “I will go alone into my voyage, because that’s the way it should be.”\n Down came his hand.\n She said nothing.\n “You are free,” he said. “Go find another traveler to show around this City of Shifting Faces.”\n She said, “All right.”\n Again, he said, “I will go alone.”\n Then Kingfisher turned to the AI. “Sell my old skimmer. Then apply that money and whatever else you think is fair. Boundless storage for the emerald skimmer. That’s what I am purchasing. I want the machine ready for me at a moment’s notice, but that may not happen for a long while.”\n “Yes, sir. Very good.”\n Then alone, Kingfisher began to walk along the dirty slow dark river that kept pouring from the City’s interior, and he was alone for exactly ninety-nine heartbeats. Then a hand took his hand, and looking nowhere but straight ahead, he said, “But whatever you do, never let yourself resemble Her.”\n Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}