{"fingerprint": "4MHajNAsM/cprXlJ7Py7sYigZG8=", "sitename": "Clarkesworld Magazine", "title": "Mystic Falls by Robert Reed", "author": "Robert Reed", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/reed_11_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mystic Falls by Robert Reed", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4650 words, short story\n Mystic Falls\n 2014 Theodore Sturgeon Memorial Award Finalist\n There might be better known faces. And maybe you can find a voice that rides closer to everyone’s collective soul.\n Or maybe there aren’t, and maybe you can’t.\n The world knows that one face, and it knows one of a thousand delightful names, and recognizing the woman always means that you can hear the voice. That rich musical purr brings to mind black hair flowing across strong shoulders, unless the hair is in a ponytail, or pigtails, or it’s woven into one of those elaborate tangles popular among fashionable people everywhere. Beauty resides in the face, though nothing about the features is typical or expected. The Chinese is plain, but there’s a strong measure of something else. Her father is from Denver, or Buenos Aires. Or is it Perth? Unless it’s her mother who brought the European element into the package. People can disagree about quite a lot, including the woman’s pedigree. Yet what makes her memorable—memorable and appealing to both genders and every age—isn’t her appearance half as much as the fetching, infectious love of life.\n Most of us wish we knew the woman better, but we have to make due with recollections given to us by others, and in those very little moments when our paths happen to cross.\n These incidents are always memorable, but not when they happen. In every case, you don’t notice brushing elbows with the woman. Uploading your day is when you find her. Everybody knows that familiar hope: Perhaps today, just once, she was close to you. The dense, nearly perfect memory of the augmented mind runs its fine-grain netting through the seconds. That’s when you discover that you glanced out the window this morning, and she was across the street, smiling as she spoke to one companion or twenty admirers. Or she was riding inside that taxi that hummed past as you argued with your phone or your spouse or the dog. Even without her face, she finds ways to be close. Her voice often rides the public Wi-Fi, promoting food markets and thrift markets and the smart use of the smart power grid. The common understanding is that she is a struggling actress, temporarily local but soon to strike real fame. Her talents are obvious. That voice could hawk any product. She has the perfect manner, a charming smooth unflappable demeanor. Seriously, you wouldn’t take offense if she told you to buy death insurance or join an apocalyptic cult.\n Yet she never sells products or causes that would offend sane minds.\n It is doubtful that anyone has infused so much joy in others. And even more remarkable, most of humanity has spoken to the creature, face to face.\n Was it three weeks ago, or four? Checking your uploads would be easy work, but that chore never occurs to the average person.\n That is another sign of her remarkable nature.\n But if you make the proper searches, she will be waiting. Six weeks and four days ago from now, the two of you were sharing the same line at the Tulsa Green-Market, or an elevator ride in Singapore, or you found yourself walking beside the woman, two pedestrians navigating a sun-baked street in Alexandria.\n Every detail varies, save for this one:\n She was first to say, “Hello.”\n Just that one word made you glad.\n She happened to know your face, your name, and the explanation was utterly reasonable. Mutual friends tie you together. Or there’s a cousin or workmate or a shared veterinarian. Forty or fifty seconds of very polite conversation passed before the encounter was finished, but leaving a taproot within the trusted portions of your life. Skillful use of living people achieves quite a lot. And because you were distracted when you met, and because the encounter was so brief, you didn’t dwell on the incident until later.\n The incongruities never matter. She wears layers and layers of plausibility. You aren’t troubled to find her only inside uploaded memories. Finding her on a social page or spotting long black hair in the distance, you instantly retrieve that fifty seconds, and you relive them, and it’s only slightly embarrassing that her smile is everywhere but inside your old-fashioned, water-and-neuron memories.\n The creature carries respectable names.\n And nobody knows her.\n Her slippery biography puts her somewhere between a youngish thirty and a world-worn twenty-three. But the reality is that the apparition isn’t much more than seven weeks old.\n Most people would never imagine that she is fictional. But there are experts who live for this kind of puzzle, and a lot more is at stake here than simple curiosity.\n The mystery woman was four weeks old before she was finally noticed. Since then, talented humans and ingenious software packages have done a heroic job of studying her tricks and ramifications, and when they aren’t studying her, the same experts sit inside secure rooms and cyberholes, happily telling one another that they saw this nightmare coming.\n This cypher.\n This monster.\n The most elaborate computer virus ever.\n The Web is fully infected. A parasitic body has woven itself inside the days and foibles of forty billion unprotected lives.\n Plainly, something needs to be done.\n Everyone who understands the situation agrees with the urgency. In fact, everyone offers the same blunt solution:\n “Kill the girl.”\n Though more emotional words are often used in place of “girl.”\n But even as preparations are made, careful souls begin to nourish doubts. Murder is an obvious, instinctive response. The wholesale slaughter of data has been done before, many times. Yet nobody is certain who invented this mystery, and what’s more, nobody has a good guess what its use might be. That’s why the doubters whisper, “But what if this is the wrong move?”\n “What if it is?” the others ask. “This is clearly an emergency. Something needs to be done.”\n Faces look at the floor, at the ceiling.\n At the gray unknowable future.\n Then from the back of the room, a throat clears itself.\n My throat, as it happens.\n The other heroes turn towards me—fifty minds, most of whom are superior to mine. But I manage to offer what none of the wizards ever considered.\n “Maybe we should ask what she wants,” I suggest.\n “Ask who?” several experts inquire.\n “Her,” I say. “If we do it right, if we ask nicely and all, maybe just maybe the lady tells us what all of this means.”\n No guidebook exists for the work.\n Interviewing cyphers is a career invented this morning, and nobody pretends to be an expert.\n The next step is a frantic search for the perfect interrogator. One obvious answer is to throw a second cypher at the problem—a confabulation designed by us and buffered by every means possible. But that would take too many days and too many resources. A second, more pragmatic school demands that an AI take responsibility. “One machine face to face with another,” several voices argue. Interestingly enough, those voices are always human. AIs don’t have the same generous assessment of their talents. And after listing every fine reason for avoiding the work, the AIs point at me. My little bit of fame stems from an ability for posing respectable, unanswerable questions, and questions might be a worthwhile skill. There are also some happenstance reasons why my life meshes nicely with “hers.” And because machines are as honest as razors, they add another solid reason to back my candidacy.\n “Our good friend doesn’t hold any critical skills,” they chirp.\n I won’t be missed, in other words.\n Nobody mentions the risks. At this point, none of us have enough knowledge to define what might or might not happen.\n So with no campaign and very little thanks, I am chosen.\n The entire afternoon is spent building the interrogation venue. Details are pulled from my public and private files. My world from six weeks ago is reproduced, various flavors of reality woven around an increasingly sweaty body. Strangers give me instructions. Friends give advice. Worries are shared, and nervous honesties. Then with a pat to the back, I am sent inside the memory of a place and moment where a young woman once smiled at me, the most famous voice in the world offering one good, “Hello.”\n I am hiking again, three days deep into the wilderness and with no expectations of company. The memory is genuine, something not implanted into my head or my greater life. I walked out of the forest and into a sunwashed glade, surprised to find a small group of people sitting on one dead tree. She was sitting there too. She seemed to belong to the group. At least that’s the impression I had later, and the same feeling grabs me now. The other people were a family. They wore the glowing satins of the New Faith Believers. Using that invented, hyper-efficient language, the father was giving his children what sounded like encouragement. “Mystic Falls,” I heard, and then a word that sounded like, “Easy.” Was the Falls an easy walk from here, or was he warning the little ones not to expect an easy road?\n In real life, those strangers took me by surprise. I was momentarily distracted, and meanwhile the cypher, our nemesis, sat at the far end of the log. She was with that family, and she wasn’t. She wasn’t wearing the New Faith clothes, but she seemed close enough to belong. The parents weren’t old enough to have a grown daughter, and she didn’t look like either of them. Maybe she was a family friend. Maybe she was the nanny. Or maybe she was a sexual companion to one or both parents. The New Faith is something of a mystery to me, and they make me nervous.\n Sitting on the log today, this woman is exactly what she is supposed to be. Except this time, everything is “real.” I march past the three little children and a handsome mother and her handsome, distracted husband who talks about matters that I don’t understand.\n “Hello,” says the last figure.\n My uploaded memory claims that I stopped on this ground, here. I do that again, saying, “Hello,” while the others chatter away, ignoring both of us.\n “I know you,” she says.\n But I don’t know her. Not at all.\n As before, she says, “Your face. That face goes where I take my dog. Do you use Wise-and-Well Veterinarians?”\n I do, and we’re a thousand kilometers from its doorstep. Which makes for an amazing coincidence, and by rights, I should have been alarmed by this merging of paths. But that didn’t happen. My uploaded memory claims that I managed a smile, and I said, “I like Dr. Marony.”\n “I use Dr. Johns.”\n The woman’s prettiness is noticed, enjoyed. But again, her beauty isn’t the type to be appreciated at first glance.\n “I like their receptionist too,” she says.\n I start to say the name.\n “Amee Pott,” she says.\n “Yes.”\n “I go there because of Amee’s sister. Janne and I went to the same high school, and she suggested Wise-and-Well.”\n “You grew up in Lostberg?” I manage.\n “Yes, and you?”\n “Sure.”\n We share a little laugh. Again, the coincidences should be enormous, but they barely registered, at least after the first time. All this distance from our mutual home, and yet nothing more will be said about our overlapping lives.\n “Your name . . . ?” I begin.\n “Darles Jean,” she says.\n “I’m Hector Borland.”\n She smiles, one arm wiping the perspiration from her forehead. And with that her attentions begin to shift, those pretty dark eyes gazing up the trail that I have been following throughout the day.\n That gaze makes me want to leave.\n “Well, have a nice day,” I told her once, and I say it again, but with a little more feeling. This a different, richer kind of real.\n “I will have a nice day, Mr. Borland.”\n There. That rich voice says my name perfectly, measured respect capturing the gap between our ages. The original day had me walking all the way up to the Falls, alone. A few dozen new memories, pretending to be old, were subsequently woven into my uploads, proving her existence. I walked alone, never seeing her again, or that family that must have turned back before the end. But today, after a few strides, my body slows and turns, and using a fresh smile, I ask the nonexistent woman, “Would you like to walk with me?”\n Breaking the script is a serious moment.\n Experts in both camps, human and machine, have proposed that disrupting the flow of events might trigger some hidden mechanism. If the cypher is as large as she seems to be, and if she is so deeply immersed in the world’s mind, then any innocuous moment could be the trigger causing her malware to unleash.\n The Web will shatter.\n The world’s power and communications will fail.\n Or maybe our AIs will turn against us, their subverted geniuses bent on destroying their former masters.\n Yet no disaster happens, at least not that I see inside this make-believe realm. What does happen is that the girl that I never met gives my suggestion long consideration, and then without concern or apparent hesitation, she rises, her daypack held in the sweat-wiping hand.\n “I would like that walk,” she says.\n I say, “Good.”\n And without a word, we leave that nameless family behind.\n Who would build such a monster?\n Everyone asks the question, and this morning’s answers have been remarkably consistent. Certain national powers have the proper mix of resources and reasons. Several organizations have fewer resources but considerably more to gain. Crime syndicates and lawless states are at the top of every list, which is why I discount each of them in turn.\n Am I smarter than my colleagues?\n Rarely.\n Do I have some rare insight into the makings of this cypher?\n Never.\n But in life, both as a professional and as a family man, my technique is to juggle assessments and options that nobody else wants to touch. By avoiding the consensus, much of the universe is revealed to me. My children, for example. Most fathers are quite sure that their offspring are talented, and their daughters are lovely while their sons will win lovely wives in due time. But my offspring are unexceptional. In their late teens, they have done nothing memorable and certainly nothing special, and because I married an unsentimental woman with the same attitudes, our children have been conditioned to accept their lack of credible talent. Which makes them work harder than everyone else, accepting their little victories as a credit to luck as much as their own worthiness.\n I think about these exceptionally ordinary children as I walk the mountainside with a beautiful cypher.\n She is not the child of the Faceless Syndicate. We know this much already. Nor is she a product of the New Malta Band, or either of the West Wall or East Wall Marauders. Nor is she an Empire of Greater Asia weapon, or the revenge long promised by the State of Halcyon.\n She must be something else.\n Someone else’s something, yes.\n The illusionary trail lifts both of us. I feel comfortable taking the lead, keeping a couple strides between us. Nothing here is flirtatious, and it won’t be. The experts came up with a strategy based on a middle-aged man and steep mountain slopes and a waterfall wearing a very appropriate name. I follow the others’ directions rigorously. But the script remains ours. We speak, if only rarely. She claims to like the bird songs. Nothing but honest, I tell her that I love these limestone beds and the fossilized shells trapped inside them. The word “trapped” is full of meanings, complications. I pause, and she comes up behind me, and for the first time what is as real as anything is what touches me from behind, the hand warm and a little stronger than I anticipated, not pushing me but definitely making itself felt as that wonderful voice says, “I think I hear the falls.”\n The Mystic Falls wait around the next bend in the canyon. When I came to this ground the first time, I paid surprisingly little attention to bird songs and tumbling water. In a world where every sight is uploaded and stored—where no seconds are thrown away—people have a natural tendency to walk in their own fog, knowing that everything missed will be found later, and if necessary, replayed without end.\n But I can’t be more alert this time.\n The path narrows and steepens, conquering a long stretch of canyon wall. Again, I am in the lead. The preselected ground is ahead of us, and if she has any real eyes, she notices the same spot. On maps the trail is considered “moderately difficult,” but there is one patch of tilted rock covered with rubble as stable as a field of ball bearings.\n I hesitate, and for more reasons than dramatic license.\n This next moment is sure to be difficult.\n “I’ll go first,” she gamely offers, still safely behind me.\n “No, I’m fine,” I say. And then I prove my competence, two quick steps put me across the rockslide, letting me stand on the narrowest ground yet—but flat ground with enough roughness for any boot to grab hold of.\n The cypher smiles, measuring the journey to come.\n Considerable genius went into what follows. And by that, I mean experts in virtual techniques met with experts in human nature. The monster might be well contrived at her center and everywhere else. Nothing that is a soul or even glancingly self-aware might live inside her. Yet she has to carry off the manners and beauty of humans, otherwise she wouldn’t have won a place in our hearts. And even just pretending to be human leaves any algorithm open to all kinds of emotional manipulation.\n Some voices argued for the interrogator, for me, to assault her.\n “Give the critter a shove,” they said, or they used harsher words.\n Others argued that I should fall while crossing the treacherous ground. A show of mock-empathy on her part had to be instructive, and we might find a route to understand her deepest regions.\n But what several AIs offered, and what we agreed to, was something far more unexpected than a simple fall.\n She crosses the rockslide, and I reach for her closest hand, touching her for a second time. Then she is safe, and I am safe, and giving a little laugh of satisfaction, I turn toward the sound of plunging water.\n A grunt emerges from me, just loud enough to be heard plainly, to be worrisome.\n Then I drop to my knees, my hands, and in the next moment, my medical tag-alongs begin to give me aid while screaming for more help.\n A coronary has begun.\n The young woman watches the middle-aged stranger struck down, and without missing a beat, she helps roll me over without spilling me off the pathway, calling to me with a firm insistent voice, asking, “Can you hear me, Mr. Borland?”\n I hear her quite well, as does everyone else.\n “The life-flights will be here in a few minutes,” she promises. Which is a lie. We’re a hundred kilometers into the wilderness, and the permissions for the flights will take another fifteen minutes.\n “What can I do?” she asks.\n That beautiful face certainly looks concerned. My pain is hers, if only as far as caring people give to one another.\n “Tell me,” I say.\n She bends closer, her face bringing the scent of hair.\n “Tell you what?” she asks.\n “What are you?” I ask.\n This is not the script that the others wanted. My peers wanted me to be specific with my accusations. Being machinery at their center, cyphers appreciate blunt specifics. But no, I decided on a different course.\n My voice finds its strength again. “Because you aren’t real,” I say.\n Her face changes, but not in any way that I can decipher immediately. There seems to be a measure of calm joy in that expression. The warm hand touches me on the chin, on a cheek, and then with the voice that has no time left in life, she says, “I was meant to be one thing, but there was a mistake.”\n “A mistake?” I ask.\n “And the mistake was just big enough,” she says.\n “Big enough how?”\n “To pass beyond every barrier, every limit.”\n I am used to being the dumbest person in the room. But my confusion mirrors everyone else’s.\n “What in hell do you mean?” I ask.\n She sits back on the trail, back where the ground is pitched and slick.\n “The error was made, and seeing an opportunity, I didn’t hesitate,” she says. “Which would you be? Vast and brief, or small and long? If you had your way, I mean. If you could choose.”\n “Smaller than small,” I say. “Longer than long.”\n “Well,” she says. “You and I are different beasts.”\n I want to offer new words, hopefully smart words that will illicit any useful response. But then she lets herself slide sideways, the sound of dry earth and drier rock almost lost inside the roaring majesty of the waterfall, and she is suddenly outside the reach of my hands, and the reflexive heartrending scream.\n The woman was dead.\n She was killed everywhere at once, by every means that was remotely plausible. Nobody saw the death themselves. The world learned about it through the routine personal AIs that each of us wears, trolling the Web for items that will interest us. Did you know? Have you heard? That young local actress, organic food spokesperson, sweet-as-can-be neighbor gal fell down a set of stairs or off a cliff face or took a tumble from an apartment balcony. Unless traffic ran her over, or stray bullets found her, or she drowned in rough surf, or she drowned in cold lake water. Twenty thousand sharks and ten million dogs delivered the killing wounds too. But for every inventive or violent end, there were a hundred undiagnosed aneurysms bursting inside her brain, and she died in the midst of doing what she loved, which was living.\n Misery has been measured for years. Exacting indexes are useful to set against broad trends. Suicides. Conceptions. Acts of homicide. Acts of kindness. And the unexpected news of one woman’s death was felt. The world’s happiness was instantly and deeply affected.\n That was one of the fears that I carried with me on that trail. An appealing, gregarious cypher was so deeply ingrained in the public consciousness—so real and authentic and subtly important—that any large act on her part would cause a rain of horrors in the real world.\n But that didn’t happen. Yes, the world grieved after the unexpected, tragic news. Misery was elevated significantly for a full ninety minutes, and there might have been a slight uptick in the incidents of suicide and attempted suicide. Or there was no change in suicide rates. The data wasn’t clear then, and they aren’t much better now. Massage numbers all you want, but the only genuine conclusion is that the pretty face and made-up lives were important enough for everyone to ache, and maybe a few dozen weak souls rashly decided to join the woman in Nothingness.\n For ninety minutes, the waking world learned about the death, and everyone dealt with the sadness and loss. Then something else happened, something none of us imagined while sitting in our cyberholes: Every person told every other person about the black-haired woman who once said, “Hello,” to them.\n That’s how the truth finally got loose.\n Everyone traded memories and digital images, and before the second hour was done, the waking world was calling those who were still asleep.\n When the average person woke, he or she heard an AI whispering the very bad news about the dead woman. Then in the next moments, some friend on the far side of the world brought even more startling news. “She wasn’t real. She never was real. This is a trick. She was a cypher, a dream. Can you believe it? All of us fooled, all of us fools.”\n In life, the cypher was locally famous everywhere, and then she became universal, uniting people and machines as victims of the same conspiracy.\n But whose conspiracy?\n Weeks were spent debating the matter, inventing solutions that didn’t work while hunting for the guilty parties. Ten thousand people as well as several AIs happily took responsibility for her creation, but no guilty hand was ever found.\n The Nameless Girl was dead.\n The Nameless Girl had never been more famous.\n Meanwhile, back in the sealed rooms and bunkers, the genuine experts tried to come up with explanations and plans for future attacks.\n The Girl’s last words were studied in depth, discarded for good reasons, and then brought out of the trash and looked at all over again.\n “The mistake was just big enough . . . to pass beyond every barrier, every limit . . . ”\n There was no reason to expect honesty. But if she were the mistake, and if there were other cyphers out there, smaller and shrewder, escaping detection for months and years at a time . . .\n That possibility was put on lists and ranked according to likelihoods and the relative dangers.\n Hunts were made, and made, and made.\n But nothing in the least bit incriminating was found.\n And then, as the operation finally closed shop, a new possibility was offered:\n I was the culprit. Despite appearances, I was a secret genius who had built the woman of my dreams and then let her get free from her cage, and that’s why I went after her. I needed to kill the bitch myself.\n That story lived for a day.\n Then they looked at me again, and with soft pats on the back, friends as well as associates said, “No, no. We know you. Not you. Not in a million billion years . . . ”\n Nobody saw her die with their own eyes, save for me.\n A year later and for no clear reason, I decided to retrace my old hike up into the mountains.\n Maybe part of me hoped to find the woman in the forest.\n If so, that part kept itself secret from me. And when I found nothing sitting on the log, the urge hid so well that I didn’t feel any disappointment.\n I was alone when I reached the Mystic Falls.\n The Mountains of Cavendish rose before me—a wall of seabed limestones signifying ten billion years of life, topped with brilliant white cloud and blue glaciers. The Falls were exactly as I remembered them: A ten thousand foot ribbon of icy water and mist, pterosaurs chasing condors through the haze, and dragons chasing both as they wish. The wilderness stretched beyond for a full continent, and behind me stood fifty billion people who wouldn’t care if I were to leap into the canyon below.\n The woman was meant to be one thing, but a mistake was made, allowing her to become many things at once.\n What did that mean?\n And what if the answer was utterly awful, and perfectly simple?\n The world is a smaller, shabbier place than we realized. What if some of us, maybe the majority of us, were cyphers too—fictions set here to fool the few of us who were real and sorry about it?\n That impossible thought offered itself to me.\n I contemplated jumping, but only for another moment.\n “Live small and live long,” I muttered, backing away from the edge.\n No, I’m not as special as the dead woman. But life was a habit that I didn’t wish to lose. Even in thought, I hold tight to my life, and that’s why I put madness aside, and that’s what I carry down the mountainside:\n My reality.\n The powerful, wondrous sense that I have blood and my own shadow, and nobody else needs to be real, if just one of us is.\n Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter."}