{"fingerprint": "IhE42v27qP6+TSLckr+urpaENZY=", "sitename": "Clarkesworld Magazine", "title": "Two Spacesuits by Leonard Richardson", "author": "Leonard Richardson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/richardson_04_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Two Spacesuits by Leonard Richardson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4540 words, short story\nTwo Spacesuits\nA four-hour drive between me and my parents is a distance that works well for everybody. I can come back for a weekend, but they don’t call me back for every little thing. So when Mom did call me at work in the middle of the day and said, “Your father is acting weird,” I feared for the worst.\n“Nursing home, power of attorney weird?” I said. “What kind of weird?”\n“He’s building something in the backyard,” said Mom. “I can see it now through the window. It’s like a hobbit hole with a little wooden door. And he won’t admit that it’s not a normal thing to be building.”\n“Is he working on it right now?”\n“No, he’s out on a job, but the hobbit hole is out there, staring at me like a thing of evil.”\n“Can you send me a picture?”\nAfter three minutes of Mom mobile-phone fumbling I received a picture taken through the kitchen window. The back lawn was completely torn up, and the yard now dominated by a mound of earth, given structure by plastic netting and chicken wire. The concrete walkway leading out of the laundry room, which I’d helped Dad lay when I was a kid, went right to a wooden door in the mound and disappeared. The mound stretched across the yard to abut the old tire swing/piñata tree. The uprooted sundial leaned against the wall of the garage.\n“That is really ugly.”\n“He says it’ll look okay once the grass seed grows. I just want to know why he’s doing this. He didn’t consult me, and he won’t talk about it. He didn’t get it from a magazine.”\n“Just ask him.”\n“He changes the subject.”\n“Don’t let him change the subject.”\n“I have to live with him, Carlos.”\nI zoomed in. “Is that thing hollow?” I tried to imagine the structural mechanics.\n“Yeah, hobbit hole, like I said. You could crawl inside.”\n“I’ll come down tonight and work from your place tomorrow.”\n“Saturday’s fine, why rush it? Frodo’s house isn’t going anywhere.”\nI got in Saturday afternoon and was finishing off some still-warm lunch leftovers when Dad came in from an emergency call. “Hey, Carlos, let’s hit the Home Depot, whaddaya say?” were his first words to me.\n“Stuff for the . . . mound?” I said. I could see it from the table, the packed dirt muddy from a morning shower.\n“The electric drill needs a new battery pack,” he said. “I want to mount the new TV up on the wall.” The “new” TV dated from the previous Black Friday, and I’d seen it on the way in, overflowing the VHS-era TV stand.\n“If you just need one thing, let’s order now and do curbside pickup.”\n“Come on, son. I’ll be in the car.” Mom gave me a conspiratorial glare: you’ll see. As soon as I clicked my seat belt, Dad gave me the exact same look. He leaned over as if about to impart to me one of his big secrets of being a man.\n“Carlos, I’m glad you came down this weekend, because I want to talk to you about something.”\n“This is about the mound, right?”\n“This is about your mother, who has been doing weird Internet searches.” We pulled out of the driveway and headed for the freeway.\n“Like ‘How to kill your husband because he won’t talk about the mound he’s building’?”\n“She’s searching for videos,” said Dad. “She leaves them open on the computer. They have these weird titles, symbols instead of letters. I don’t even know how she types the symbols to do the searches. And, she’s started making weird noises when she thinks I can’t hear her.”\n“Are the ‘noises’ Chinese?” I asked. “Is she learning Chinese?”\n“No! They’re like dog noises. And when I mention it to her, she acts like it never happened.”\n“Nobody likes being told they’re making weird noises.”\n“We’ve been married for thirty years! If I say she’s making some noises, she should be able to handle it. When you got out of your diaper and shit on the kitchen floor, I said, ‘Your son shit on the floor,’ and she said, ‘He’s your son, clean it up.’ She didn’t change the subject.”\n“Do you have a recording of the noises?”\n“I have to live with her, Carlos. If I record her, then it becomes all about ‘why did you do that?’”\nDad took a breath and started to scheme. “Here’s what we do. Around five p.m. she’ll start making dinner. You get on the computer and figure out why she’s searching for these videos.”\n“Did you watch any of the videos?” I said.\n“These fucking weekend drivers, man.” Dad honked the horn. “Hey!”\nYou can get a battery pack for an electric drill at Home Depot. They try to make it easy. But the battery pack has to be your actual goal, and for Dad it was more of a pretext. He grabbed hold of a big orange jungle gym cart and pushed it over to the outdoor gardening annex, where he took his time choosing between different types of fiberboard planks. Then six cubic feet of a steer manure/compost blend, to improve the soil atop the mound.\n“I thought we were just here to get a battery,” I said.\n“Since you’re here, you can help me with the heavy stuff,” said Dad.\n“Dad, this is bullshit.”\n“We call it steer manure.”\n“I know what you’re doing. This is for the mound.”\n“Help me load up!” He’d heard me, but he was ignoring what I said. He’d done this my whole life, but never about something so obvious.\nOn the way back, the pickup loaded up with lumber and plastic sheeting and bagged bullshit, I looked through old family texts. A couple weeks earlier Dad had posted something to our WhatsApp group that seemed weird in retrospect:\nCarlos, is there a site where you can draw a shape and see the emoji that looks like that shape?\nAttached was a photo of a piece of paper on which Mom had drawn an alphabet of slightly different circles. Some had a protrusion sticking out at one angle or another, like a clock with only one hand. Others were circles that overlapped or enclosed in some way.\nI’d assumed it was a craft project. I’d poked around the Internet, sent them a link that let you search for characters that couldn’t be typed on a keyboard, and that had been the end of it.\nMy parents had always been passive-aggressive, but this took it to another level. Why had Dad used the family chat to ask me to help Mom figure out how to type in the symbols for the weird video searches he was now asking me to investigate?\nDad was tapping the steering wheel and singing under his breath. I shifted my eyes, not looking up from my phone. “Two spacesuits . . . da-dadada cata-catalyze two spacesuits . . . ”\n“What is that?” I asked.\n“Oh?” Dad blinked at the sun a couple times like I’d startled him out of falling asleep at the wheel. “Johnny Cash song.”\n“Johnny Cash wrote a song about spacesuits?”\n“He did a lot of weird songs in the seventies. Did you ever hear the one where he steals a Cadillac?”\n“Yes, I heard it one million times growing up.” Needless to say, there is no Johnny Cash song about spacesuits. Dad had told me an obvious lie about something trivial.\nDad backed the pickup into the garage driveway. He opened the driver’s side door and swung out, grabbing the little Home Depot bag that held our small items: the battery pack and some boxes of screws. Dad walked around to the front door of the house, ignoring the back gate (which would have taken us past the Mound That Must Not Be Named) and leaving everything sitting in the bed of the pickup, waiting to be stolen by some larcenous neighbor.\nI scampered after Dad. In the living room he pointed at the big flat-screen teetering on its stand and said, “You’re goin’ on the wall!” in a John Wayne voice. Then he walked all the way through the house and out the laundry room into the backyard, still holding the little plastic bag.\n“Dad?” I said. I shut the front door behind me.\n“Come in here, Carlos, quick!” Mom called me from the kitchen. Through the window she pointed at Dad, who’d walked around the mound and out the back gate, right back to the pickup. He opened the tailgate and started unloading the lumber into the garage, where he kept the woodshop.\nI washed my hands in the sink. “Why did he take that weird path?” I asked. “Like he was going to mount the TV and just decided not to.”\n“Yeah, he’s going to work on his hobbit hole the rest of the weekend,” said Mom. Mushrooms sizzled in the frying pan. Chicken breasts sat on paper towels.\n“Should I not have gone with him? Am I enabling him?”\n“You did the right thing. You need to see what’s going on. He won’t talk about it with you either?”\n“Yeah, I’d bring it up, and he’d jump the conversation somewhere else. What’s inside the hole?”\n“I don’t know. Dirt? Gross things?”\n“What are you making?” I asked her. “Chicken stew?”\n“Chicken risotto. It’s easy, I don’t have to concentrate.”\n“You hate risotto.”\n“No, I got tired of making it because you wanted it all the time,” said Mom. “I can do it once in a while.”\n“Okay, I’ll do some phone calls in the study and ask around about this mound thing.”\n“If you’re going to take over the study, let me get my book out first.”\nAlthough I allowed my mother to imagine that I could pull some strings and contact top psychologists who studied abnormal male mound-building, I had no strings to pull and no intention of making any calls. Instead, after closing the study door, I quietly opened up the family web browser and, with a certain amount of guilt, started spying on my parents’ search history. They shared a Google account, so everyone’s search results were mixed up: moisture sensor app and is Mary Kay a scam? and oldest possible scotch and how to catalyze two spacesuits and Sidney Center performances Zoom and ⊶⊚∷⊶0∘⊚∝⊶∘οº∘•∝⊘Ο and anniversary songs.\nDad is wrong about a lot of things, but he wasn’t making up the searches. I reran the search for ⊶⊚∷⊶0∘⊚∝⊶∘οº∘•∝⊘Ο. I got zero web results and twenty-three video results, all with that exact title.\nThe previews showed what you’d expect in a YouTube video: poorly lit people in bland suburban houses facing the camera, about to tell you something generic. I clicked on a representative thumbnail. A white man in his forties was showing me around his garage. Plastic sheeting and fiberboard planks leaned against the wall—apart from the steer manure, the same things in the same quantities Dad had just bought at Home Depot. The man spoke in disjointed sentences about the “habitat” he was building. His voice was quiet and gentle, mismatched against his mustache and his beer gut.\nAfter counting off his fiberboard planks, the man in the video dropped a Lowe’s bag onto his workbench and started pulling out screws of different sizes, counting them out into five different piles. At this point it became obvious that unlike most YouTube videos, ⊶⊚∷⊶0∘⊚∝⊶∘οº∘•∝⊘Ο had a camera operator. The camera operator wasn’t exactly helping, mind you. They were making low growling noises, distracting noises that made it hard to hear the clink of the screws and the muttered counting of the man with the mustache.\nIt was a freaked-out dad version of a YouTube haul video. I’ve been known to flop on the couch and watch some bro open a dozen blind-bags of anime figurines. It helps me feel better about not being able to afford all the crap that goes along with modern life. But Dad had seen this haul video and treated it like a shopping list. You’re not supposed to buy this stuff yourself. Watching the video is supposed to scratch the itch.\nIt was pretty short for a haul video, about three minutes, and of course once it was over, YouTube really wanted me to launch right into another, similar video. About half of the recommended videos had titles in the weird circle language, but the other half were in English:\n- HOW TO SEARCH FOR CATALYST AND HABITAT VIDEOS—TUTORIAL\n- Sex Will Catalyze Two Spacesuits!\n- Typing the symbols on human keyboards (ENGLISH/USA)\n- This Chemical Gel Will Catalyze Two Spacesuits—No Fail!\n- My Other Spacesuit Died! HELP!!!!\n- MIT Grad Shows How To Catalyze Two Spacesuits\n- BEWARE OF SCAMS!—Only Completion Of The Habitat Can Catalyze Spacesuits\n- CATALYZE WITH SURGERY—DIY—STEP BY STEP—PART 1/4\nSwallowing both guilt and horror, I clicked into my parents’ shared email account. There were hundreds of unread messages from stores and mailing lists, which I’d been expecting, but the draft folder was also full of unsent emails. I clicked through; Mom and Dad had been using the drafts folder to send video links to each other. Dozens of them.\nDad’s messages to Mom had the somewhat stilted air he used when writing Post-it notes. He’d never really gotten used to email:\nM,\nI think we should try sex. It makes logical sense.[link to “Sex Will Catalyze Two Spacesuits!” video]\nWith love,\nP\nThat one I didn’t need to see, but you can’t blame me for stumbling on it. Dad had never sent an email that didn’t look like this: a comment, a link, a profession of love. The other messages—presumably the ones from Mom to Dad—had no text, just a bare link to a video on YouTube or Youku.\n“Are you on the computer?” Mom put her hands on my shoulders, and I jumped out of my skin. “Come in and help with the salad.”\n“Mom, what is this? Why do you have all these unsent emails?”\nThe confused look on Mom’s face made it completely clear she hadn’t known you could write an email and not send it. “There must be spyware on the computer,” she said. “Do you remember when you helped us?”\n“I helped you by installing a bunch of things that stop spyware from getting on the computer.”\n“Maybe tomorrow you could take another look?” It was the same kind of bald-faced lie Dad had come up with in the car . . . but it was also the honest best she could do to make sense of what she was seeing. “C’mon. Salad.”\nI followed Mom into the kitchen and sliced cucumbers while she kept a stir going on the risotto. I heard her humming in time to my knife chops, the endless pleasant tune she’d improvise when occupied in the kitchen, and then the humming became a little scratchy and stopped being humming at all.\nI glanced over. Mom was still stirring the rice, still wearing her pleasant Resting Mom Face, but the growling noises she was making didn’t sound like they came from human vocal cords. They were the noises from the YouTube video, from the unseen person holding the camera. They were the dog noises Dad had complained about.\n“Do the carrots if you’re done,” said Mom, seemingly on top of her growling noises.\n“What?”\n“You stopped chopping,” she said without turning around. The growling stopped.\nI looked down. I had half a cucumber left. “Sorry, I zoned out.”\nMom snorted. “Welcome to kitchen life.”\nDinner was the weirdest, most passive-aggressive experience of my life. Each of my parents was aware that the other was acting strangely, but when I’d confronted them about their own behavior, they became evasive and pulled rank. That trick worked on me, but they couldn’t intimidate each other. Each had thirty years of practice in marital sparring. Each was full of the righteous sense that the other one was being unreasonable, and that by refusing to come down hard I was only prolonging the problem.\n“How is the hobbit hole coming along?” said Mom sarcastically.\n“If you can clean off the TV stand, Carlos and I can finally hang it up,” said Dad.\nMom made an exasperated gesture at me with her fork.\n“What?” said Dad. “Speak up!”\n“I didn’t say anything,” said Mom. “Why are you . . . ?”\n“Finish your sentence! Stop mumbling!”\nI could not deal with this. If this didn’t stop, I would have to put another four hours between them and me and only show up for Christmas. I looked down at my risotto and tried to think of a plan.\nWhatever strangeness was inside my parents only came out when they were on autopilot, driving the car or stirring the rice. I needed a way to get them in the same room and distracted at the same time.\n“How about some UNO after dinner?” I said.\nMy parents are nuts about UNO. They wear out decks, playing so quickly they barely look at the cards. Their serious game is contract bridge, a game where the ability to passive-aggressively manipulate your partner is an asset, but UNO is what they play to unwind, five or ten games a night.\nI hate UNO. There’s very little skill in it. When you’re playing, your brain goes on autopilot. It was the perfect tool for what I needed.\nMy parents divided the unwieldy deck between them and started shuffling. Almost immediately the growling noise started again from Mom, and Dad began muttering:\n“It’s right over there, and I can’t do a thing about it. Damn shame, ending up like this.” Mom’s growl ran underneath his words like a carrier wave.\n“What’s right over there?” I asked him.\n“The other spacesuit,” said Dad. He stacked his cards and pushed them across the table. Mom cut and began to deal.\n“Who are you?” I tried to say. There was no way back to normalcy from here, but I must have said it, because Dad responded. I wanted so badly to hear some smart-ass comment, but he casually picked up his cards and said: “Just a stranded traveler.” As he spoke, Mom’s throat made guttural noises that went on just a little longer.\n“Do you have a name?”\nDad turned over the first card of the round: a red three. “Not anymore.”\nHe put a red six down onto the three, and Mom immediately tossed a yellow six on top of that. In five seconds, play had come to me. If I didn’t keep the game going, my parents would start complaining that I was dragging down the game, and I’d lose contact with the things that lived inside them.\nI steadied my hand enough to put down a yellow Draw Two. “Who’s in the other spacesuit?”\nDad took his cards. “I’m in both, you see?” he said. “Our tourist group was flung through space, flailing for receivers. This unlucky place was in the way. Things live here. Two different spacesuits that look like one. Now I’m split between the two. The part that plans is separated from the part that speaks.”\nWe’d gone ’round the UNO table twice more while the thing inside Dad was telling its sob story. Then Dad took a breath. Mom’s growling changed its tenor, and in response Dad’s mood became a little less maudlin.\n“All of us are looking for the catalyst that can fuse two spacesuits back together,” said Dad.\n“It’s your turn, honey,” Mom told me. I dropped a card without looking.\n“Green!” Mom chided. “We’ve gone green. Try to keep up, baby boy.”\nI couldn’t have this conversation and play cards at the same time. Besides, I had nothing I could play. I drew a card and realized I didn’t have to play competitive UNO. I could draw a card every time and pass. As long as I looked like I was following the rules, Mom and Dad would stay on autopilot.\n“It is not possible,” I told the thing inside my parents. “There is no way to do what you need. You cannot fuse two human beings together.”\n“I have done it. Fused the two spacesuits. It was right: they felt incredible pleasure at being joined. I only need to find the catalyst that makes it permanent.”\nEven with everything that had happened this day, I was not expecting to have this conversation. “When we join . . . ” I said, “we do not stay stuck together. Instead we make a new person. My parents fused, and they created me.”\n“So you’re just a third spacesuit,” said Dad, like he’d just lost all hope. “Alone. Half of a person.”\n“I really don’t need this from you,” I said. “I get enough of it from my parents. By the way, these are my parents. They are people. Not spacesuits.”\n“I would never hurt them,” said Dad. “They are all that protects me.”\n“They’re not your spacesuits. There is no catalyst. The thing you’re looking for doesn’t exist, and you need to just fling yourself right out of here.”\n“Had I that power, why would I not have done so already?” It was the most complex sentence I’d ever heard in Dad’s voice.\n“UNO!” shouts Mom.\n“Stop her, Carlos!” exclaims Dad. His tone of playful panic couldn’t be further from the sadness and vulnerability he’d just been showing.\nI had so many cards by this point, I surely could have stopped Mom, but I didn’t want to, and Dad couldn’t. She won the game and made sarcastic jokes at Dad’s expense, and the thing that was using them as spacesuits went back into hiding.\nMaybe I should have left. Said I’d only come for the day and driven back home. Let them start ignoring my weird behavior. But I said good night, brushed my teeth, and climbed into my childhood bed. I tried, and then pretended, to sleep, in a house where my parents were no longer my parents.\nExcept they were my parents, most of the time. This thing was only filling in the cracks. It came out when they did something they’d done a million times before. Each could only see it in the other, because it only happened to you when you weren’t paying attention.\nI stayed because I had to see what was inside the mound Dad was building. I imagined a crashed spaceship buried under a tarp, some hard physical evidence that my parents weren’t literally driving each other insane.\nSo I dozed in and out, and around midnight I tiptoed through the minefield of creaky boards in the hallway, through the laundry room, and out into the yard.\nIn front of the door were two sets of pajamas neatly folded on a plastic sheet. The sort of thing you’d do before drinking the poison. The metal latch on the door was popped and the door itself was ajar. From inside I heard uncomfortable groaning noises like someone being slowly digested.\nShivering I brought up the brightness on my phone, pulled the door silently open, and shone the light into the depths of the hobbit hole.\nMy mother screamed.\n“What the!” my father barked. “Carlos? Are you filming us?”\n“No, it’s a . . . what are you doing in there?”\nDad crawled bare-chested into the light of my camera and shielded his eyes. He was hairy all over. His skin was goose-bumpy from the chill, smeared with dirt and some kind of oil.\n“What the hell do you think we were doing?” he said.\n“Oh, God, why?”\n“It likes for us to be together,” said my mother’s voice. I couldn’t see her because I had turned away from the hole in the mound and was shining my phone in the other direction, trying to think of anything else. “We like it, everyone’s having fun, what’s the problem?”\n“So you know about . . . the thing,” I said. “In your brains. We’re not pretending anymore.”\n“Yeah, duh,” said Mom, “we knew it the whole time, since it happened!”\n“You did not! You called me here to investigate Dad, and then he asked me to investigate you.”\n“Can I not want my son to come visit once in a while?\n“You’re still doing it! Oh my God! You make up these stories to explain your behavior to yourselves. When one story falls apart you just switch to another one.”\n“Be quiet!” Dad hissed. “You’ll wake up the neighbors.”\n“I’m not the one who put an alien sex mound in the backyard!”\n“It’s a habitat.” Dad rapped at the wooden door with the pride of ownership. “It needs a certain environment to be comfortable. It’s not hostile. In fact, it’s really improved our relationship.”\n“You know what?” I turned around and shone the light into the mound without actually looking myself. “I am going to film this.”\n“Carlos, no!” they both snapped.\n“See, that panic you’re feeling because your son is about to ruin your life for absolutely no reason?” I said. “Hold on to that, because that’s what you have put me through today. I am terrified that you’re going to freeze to death, or burn yourself with some kind of chemical gel, because, hostile or not, this thing in your brains doesn’t understand how your bodies work. And you will not even admit that something is wrong!”\n“Carlos has a good point,” said Dad. “A lot of people are in this situation.”\n“Yes, indeed,” said Mom, “Not everyone is going to handle this as well as we did.”\n“Will you at least admit this is weird?” I demanded.\n“You are pushing it, mister!” said Mom.\nOn YouTube there’s a video called ⊶ο•⊘ο•⊘0⊚∘∝∝∘⊘ ⊖⊚∘⊶0⊚⊘ ⊷ο⊘∝00Ο∷ ∷οΟ∷ο⊚•⊶⊚⋅⊙⊗, which in the language they use a couple galaxies over means There Is No Way To Catalyze Two Spacesuits. I filmed the video, and my parents speak in it: Dad uses English and Mom speaks simultaneously in the other language.\nThe video is short and to the point. My parents and the thing inside them explain that there is no way to merge two human beings together. You can’t do it with sex, or drugs, or glue, or amateur surgery. Maybe it would be possible with the technology we have back home, but anyone who says they can do it on Earth is lying or deluded.\nYou are watching this because you have found yourself spread across two individuals. You need to accept this and make the best of it. Ask the bodies you’re trapped inside to take you on. What happened to you, happened because your hosts are exceptional. They have a love so strong and stable that its memetic structure formed a suitable habitat for your projected mind.\nThe thing that trapped you inside these two spacesuits is the relationship between them. You’ll be safe as long as they stay alive and stay in love.\nThe video only has twelve views. Two of them are mine.\nIt’s just not what people want to hear."}