{"fingerprint": "VVPYOF02K7395yL+fcgpt1QPKjw=", "sitename": "Clarkesworld Magazine", "title": "The Magician's Garden by Paul Riddell", "author": "Paul Riddell", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/riddell_03_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Magician's Garden by Paul Riddell", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n The Magician's Garden\n It’s a very old trope in fantasy stories and games: the wizard or healer who needs an incredibly rare, delicate, or deadly flower, leaf, root, or bark for a critical bit of magic, and the plant from which it grows may only be found an inconvenient distance away. It may be that the spell is so rarely used that nobody keeps a stockpile, or the plant’s location or guardians are so dangerous that the spell’s infrequent use makes sense in retrospect.\n Either way, it has to be done now, as the wizard or healer doesn’t have other options, so it’s time to gather a motley crew to get the plant before time runs out. In between, the party will most likely deal with brigands, monsters, or competing wizards who want to stymie the spellslinger’s intentions or steal the plant for themselves. Or they may run into competing gathering parties who will race to the plant and lay waste to its only native habitat, or kings and governors who want their cut. By the end of the quest, everyone’s exhausted but happy, and one enterprising character thought to bring back seeds in order to grow more. And it’s all happily ever after, right?\n If only that were the case.\n Starting those seeds requires lots of specialized knowledge and skills that the wizard may or may not have the time or inclination to learn, which means they are going to need assistants and a growing area. Any wizard with a regular demand for that specific plant figures that other magically valuable herbs and trees are worth growing, and the wizard now has a garden. That requires both general and specialized gardeners who are used to dealing with specific plant growing conditions and pests, and apprentices set with the tasks of watering and fertilizing.\n There’s knowing what kind of water is best, what growing medium works, at what time seeds or spores are ready to plant and how they need to be treated beforehand, and which plants will respond to different propagation methods. There are the plants with seeds that only germinate when exposed to smoke and flame, and the ones that have to be overwintered in colder and darker conditions than what is commonly available in the immediate area if they’re going to bloom in spring.\n Even if the plants grow and thrive, there’s preparation, preservation, and storage of the final crop, and knowledge concerning whether the plant dies at the end of the season, dies after going to seed, or comes back every year with appropriate care.\n Figuring on the cost of staff, land, and incidentals, as well as the time taken to mess with weeding and watering that the wizard could better use for study or spellcasting, it makes sense why so many wizards in fiction work for kings and sovereigns, because royals might be the only people with the money and authority to make any of this happen. (It also explains why so many wizards get out of their towers for quests and adventures: as any garden center manager will tell you, Gandalf’s motivation in The Hobbit was centered on the idea that getting a significant chunk of Smaug’s hoard was the only way he could afford his orchid habit.)\n Alternately, and this is barely touched upon in fiction, at what point does an unlikely pro- or antagonist realize just how much money is bouncing around the wizarding community from plundered crypts and grateful dragon-spared cities where they decide to do all of the hard work instead?\n A sorcerer’s garden business in a fantasy setting has a lot of reasons for its establishment, and the history of kitchen and medicinal gardens in reality and fiction is instructive.\n For instance, Ellis Peters’ Cadfael Chronicles mystery novels went into detail on how the monk grew opium poppies in England. By growing them against a stone wall that both reflected heat during the day and slowly released that energy at night, that method fulfilled the poppies’ love of warmth and thereby extended the poppies’ growing season.\n This is an extreme example, but look at chef and bartender gardens used to grow commercially unavailable herbs for specific recipes, producing everything from lime leaves to Bhut Jolokia peppers. Basic medicinal gardens depend upon the needs of the individual or the community, but tend to concentrate on plants either eaten fresh, steeped as tea or soaked in vinegar or alcohol as a tincture, or applied as a poultice, along with plants with pest-repelling or antiparasitic properties.\n In some wizard’s gardens, some plants will go together more readily than others. Throughout Mesoamerica, cacao beans were simultaneously a religious symbol (as an aside—the word “chocolate” is a corruption of the original word “xocolatl,” which means “blood of the gods”) and a currency, with the rich being able to demonstrate their faith by literally drinking their wealth. The limited shelf life of cacao beans and the fact that they were regularly consumed discouraged both inflation and counterfeiting.\n Until DNA analysis of wild cacao trees in 2018, cacao was thought to be indigenous to Mexico and Central America, but the trees were originally native to South America, meaning that cacao beans were transported and deliberately planted throughout their current range. This may be tied to the fact that vanilla orchids are native to Mexico. Until the invention of artificial pollination for vanilla orchids, vanilla seedpods would only be available within a limited area, and vanilla was an essential flavoring in traditional xocolatl pretty much from the beginning. Even today, chocolate and vanilla go together so well that “pure” chocolate still contains a significant amount of vanilla for a truly memorable flavor.\n And on the subject of vanilla, another precedent for the importance of sorcerer’s gardens comes from that example’s propagation outside Mexico. The native insect pollinators of vanilla orchids are still widely disputed, so vanilla orchids were grown throughout the world purely as ornamental plants until a slave on the French-occupied island of Réunion discovered how to pollinate them by hand. To this day, almost all of the world’s supply of vanilla flavoring comes from orchid blooms pollinated by hand and must happen under a very tight time frame as the blooms only remain viable for hours after opening—with 95 percent of today’s total vanilla production coming from Madagascar. Additionally, so-called “French vanilla” refers to vanilla produced from orchids grown on Réunion and the Comoro Islands, and Tahitian vanilla comes from a naturally occurring hybrid orchid that was transported from western Mexico to Tahiti for unclear reasons. This doesn’t even get into the proper drying, curing, and extraction of vanilla flavoring from the resultant seedpods or “beans” in order to get the best flavor.\n Fun fact: when people refer to “just vanilla,” they’re usually talking about the horribly overused component vanillin, which can be extracted from a multitude of plants and even from cow manure. The magic of real vanilla flavoring comes from the other chemical components of vanilla flavor, most of which either evaporate or are destroyed by heat.\n A factor for a particular location or locale for a wizard’s garden may also involve the French wine-making term “terroir,” which officially refers to the climate and soil in an area that contributes to a wine’s taste and aroma. Commonly used for wine grape production—with plenty of discussion on soil trace elements and wind patterns through valleys contributing toward making a particular grape variety jump from average to spectacular—terroir is used for crops as diverse as tobacco (thus explaining the particular appeal of Cuban and Nicaraguan cigars to smoking enthusiasts), chocolate, and apples. While some debates about terroir may be subjective, others are blatantly obvious, with clones of the same grapevine producing drastically different wine when grown in adjoining valleys.\n Now, there’s always the possibility that an introduced plant may do better in propagation than it would in the wild, or even thrive among the smoke and disturbance of urban civilization.\n An excellent example is the ginkgo tree: Ginkgo biloba was the last species of a once wide-ranging family of trees with worldwide distribution, and its survival was partly due to Chinese monks who raised the trees for its edible and medicinal nuts. G. biloba is a very popular urban tree as it survives high levels of air pollution that normally kills other trees, and grows straight and tall. (About the only issue with it involves using female instead of male trees for landscaping, as the smell of ripe ginkgo fruit is best described as “cat shit on a stem.”)\n Some species may become weeds or even invasive: the angel trumpet (Datura stramonium), has spread so far by humans on both sides of the Pacific Ocean that their area of origin is highly debated, and it readily grows atop rubbish piles and in vacant lots throughout the world. Some of these introduced plants become established because they’re no longer subject to pests and diseases, and some just because growing conditions are better in the new locale than in their original habitat. The obvious examples of these in commercial applications are pineapple (Ananas spp.) and red and white dragon fruit (Hylocoerus spp.) —two Central American natives that grow larger and more enthusiastically in Hawaii and Vietnam respectively.\n Datura species also illustrate the problems with drug strength and intensity. All parts of a Datura plant contain the hallucinogen scopolamine, which is intensely toxic. Through the American Southwest, D. wrightii was traditionally a shamanistic drug intended to produce intense visions; in India, the seeds of D. stramonium were mixed into meals to incapacitate and rob travelers; in Haiti, D. stramonium and its cousin D. metel are commonly described as “zombie cucumber,” where the seeds were fed to zombies to keep them in a constant disassociated state.\n Even though despite of or possibly because of Datura’s reputation for bad trips (Charles Manson advocated its use among his cult in the California desert because he wanted them all to be in a state of perpetual fear), it still attracts drug explorers. But parts on one plant that provide a reasonable experience (because there’s apparently no such thing as a “good” experience on Datura) can be lethal on a neighboring plant. As with opium poppies and morning glories, though, D. stramonium is a common garden flower, albeit with warnings about keeping children and pets away, because of its gigantic white flowers and its disease resistance.\n A wizard garden involves a specialized skill that gets nowhere near enough respect in our world: grafting. Grafting involves attaching branch segments (known as scions) or buds to an established plant or rootstock and then protecting the incision until the cambium, the layer of bark that transfers nutrients and water, merges.\n Grafting’s most commonly known application is with roses and fruit trees, where disease-resistant rootstocks are grafted to scions without that disease resistance, or to propagate trees and varieties that cannot be grown from seed. (For example, the Buddha’s Hand citron, Citrus medica var. sarcodactylis, produces a distinctive cephalopod-shaped fruit commonly nicknamed “Cthulhufruit,” and since the fruit never produce seeds, the only way to grow more is through grafts and cuttings.)\n Now, rootstock grafts are common through the citrus industry and almost essential with most vineyards. European and Asian wine grapes are susceptible to an American grape root disease accidentally introduced in the 19th century, and pretty much all of the vineyards in Europe today use grapevines grafted to American grape rootstocks.\n This method is also very popular with propagating cactus as well. Garden centers and nurseries often sell brilliantly colored cactus grafted onto long cactus stems: the coloring is natural, as these are mutants that don’t produce chlorophyll, and grafting them to a standard cactus stem allows them to survive off nutrients provided by the stem.\n Grafting is also done purely for aesthetics, with the most famous example being “The Tree Circus” of Axel Erlandson, containing trees shaped over decades into exotic and unnatural forms. Some grafters even experiment with repeated grafts of more and more distantly related trees: the “fruit cocktail trees” offered by horticulture catalogs are trees with apple, pear, cherry, peach, and even grapefruit scions grafted onto one trunk. Grafting can be performed with nonwoody plants as well: tomato grafting has a long history, and hot pepper grafting is catching up.\n While grafting has centuries of beneficial use, it still has dangers. With the aforementioned tomato grafting, it should be noted that tomatoes easily graft onto rootstocks from other members of the family Solanaceae, which include potatoes, eggplant, and nightshade.\n The Solanaceae also include our old friend Datura, and Datura roots are often grafted onto tomato plants for composites that grow well in alkaline soils. The danger is in making absolutely sure that the Datura portion is kept from light and any root offshoots are cut off immediately: such grafted plants concentrate scopolamine in the tomato fruit, and searching through horticulture literature for cases of gardeners incapacitated or even killed by eating inadvertently poisonous tomatoes is both instructive and terrifying.\n With all of this in mind, things get even more complicated when adding magic. Which seeds will germinate only after being left in a bonfire, and which ones require passing through a dragon’s gizzard first? Will grafting two magical plants cancel each other out, intensify the intended results, or produce something completely unexpected? Does that plant absolutely require Pegasus manure for fertilizer, will cheaper analogue get the job done, and will spells go awry if someone slips in hippogriff manure by mistake?\n What about herbs that repel beneficial animals or attract harmful ones, including ones big enough to eat cities? Which plants require specially gathered or blessed water, and which ones could be planted directly atop an outhouse? What liability does the garden staff have if triffid or Pink Bunkadoo seeds get out and the resultant pests decimate the countryside? Is the garden staff loyal only to a direct employer, loyal to the community or country in which they reside, or loyal only to the plants?\n Considering the deleterious effects of some of the plants in the garden if they were to get out, what kind of protection and defense does the garden have should someone decide to help themselves? What happens when that prize orchid or mint was once pilfered from someone else, possibly centuries before, and the original owners don’t take kindly to cultural appropriation and blatant theft? Also considering the effects of other plants, what happens if one of the staff decides to go horticultural Robin Hood and grow hidden patches of particularly beneficial or useful plants that just anybody can use, thereby undercutting their perceived rarity?\n With all of this to think about, it’s no wonder so few wizards talk about their horticultural proclivities: if they’re smart, they’ll let someone else do all of the work and send in orders via catalog.\n As for the plant hunters, growers, processors, and accountants necessary to get all this together, good luck to them. They’re looking at years of wannabe Elrics and Ningaubles screaming at them “250 florins for a black orchid? Why don’t you just yell ‘Stand and Deliver’ when you bring the bill?”\n Through the 1990s, Paul Riddell contributed articles and essays to a wide range of now-long-forgotten science fiction magazines before quitting professional writing in 2002. Yes, this is a relapse. He currently owns and operates the Texas Triffid Ranch (www.txtriffidranch.com), Dallas's pretty much only carnivorous plant gallery. The author wishes to thank Saladin Ahmed and Ernest Hogan for vital inspiration in developing this concept, and anybody else who decides to run with the concepts presented herein."}