{"fingerprint": "Vzlm9vG0cQMeYsyxqvP3v0N+yQE=", "sitename": "Clarkesworld Magazine", "title": "Sour Milk Girls by Erin Roberts", "author": "Erin Roberts", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/roberts_01_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sour Milk Girls by Erin Roberts", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6430 words, short story\n Sour Milk Girls\n The new girl showed up to the Agency on a Sunday, looking like an old dishrag and smelling like sour milk. Not that I could really smell her from three floors up through the mesh and bars, but there’s only three types of girls here, and she was definitely the sour milk kind. Her head hung down like it was too much work to raise it, and her long black hair flopped around so you couldn’t see her face. I’d have bet a week’s credits she had big ol’ scaredy-cat eyes, but she never bothered to look up, just let Miss Miranda lead her by the elbow through the front doors. Didn’t even try to run. Sour milk all the way.\n Even sour milk new girls were good, though; anything new was good. The last one, Hope, might have been dull as old paint, but at least she’d been something different to talk about. I’d even won a day’s credits from Flash by betting the girl wouldn’t make it to fourteen without some foster trying her out and keeping her. Anyone could tell Hope smelled like cinnamon and honey, same as those babies on the first floor and the second-floor girls with their pigtails and missing-tooth smiles. Sure enough, only took six months before the Reynolds came and took Hope off to their nice house with the big beds and the white fence and those stupid yapping dogs, leaving just me and Whispers and Flash to stare at each other and count all the months and years ’til we’d finally turn eighteen. Flash should’ve known it would go that way—cinnamon and honey’s something fosters can’t resist.\n Whispers said this new girl was officially called Brenda, but that was just as stupid as all the other Agency names, and the girl wouldn’t remember it after Processing anyway. At first I said we should call her Dishrag or Milkbreath, but even Flash thought that was too mean, and Flash is as nasty as hot sauce and lye. She’s the one who named me Ghost, on account of I’m small and shadow-dark and she thinks I creep around too much in the night. She got her name ’cause that’s how fast fosters send her back after their cat turns up dead and they realize the devil has blond hair and dimples.\n “What’s in her file?” I asked Whispers, who was still leaned up against the wall by the window. She never bothered to look out anymore. Not even for new girls.\n “I’m just supposed to clean the office,” she said. “Files are confidential.”\n “Must be good if you’re holding back,” said Flash, blowing out air as she tried to whistle.\n “Maybe,” Whispers said, with a lopsided shrug. Then she murmured something nobody could hear while staring down at her shoes. That meant we weren’t getting any more from her for at least an hour, not even if Flash threatened to throw her out the window or hang her with the sheets from one of the empty beds. No use pushing her ’til she started banshee-screaming, so Flash just practiced whistling and I played around some with our crap computers and we let Whispers go all sour milk and talk to her invisible friends.\n By the time Flash got a half-whistle half-spit sound to come out of her mouth and I’d finished up my hack of the first-floor baby cams for when things got boring, new girl was being led off the elevator by Miss Miranda, head still down. Flash and I lined up in front of the room same as always—hands behind our backs, chests up and out, heads forward, eyes wide. Even Whispers came out of her murmuring and straightened up against the wall. Agency folks didn’t care about much as far as us third-floors were concerned, but they were total nuts for protocol.\n Miss Miranda started by doing her normal speech-troduction. This is Brenda, she’s fifteen years old, and she’s going to stay with us for a while. These are the girls, they’re all trying to get new homes too. And we just know it’ll work out for you all any day now. When she said that last bit, her voice always got real high, like someone talking after they took a gulp of air from a circus balloon.\n We ask you to stay on the third floor when you’re in the building unless you’re doing chores downstairs or get called to the office. But don’t worry—there’s so much to do up here, you won’t even notice. Her voice went even higher for that part, ’cause even an idiot could see there wasn’t anything on the floor but twenty empty beds, two long white lunch tables, a couple of old computers on splintery desks covered with the names of old third-floors, and the door to the world’s grimiest bathroom.\n As long as you maintain good grades and proper behavior in school, you’re free to come and go as you please until seven PM curfew. You’ll get a few credits each day for transit and meals. If you need additional learning help or assistance with your homework, the computers in the back row have plenty to offer. Age-appropriate stuff only, of course. She looked straight at me when she said it, like it was my fault the security on the things was shit and I’d figured out a way to order vapes and liquor pops and get R-rated videos.\n Now you girls get along, and try not to kill each other. She looked at Flash for that one, even though Flash hadn’t really tried to kill anyone for at least a year. She’d barely even talked to Hope. Either she was getting soft now that we were in high school, or she was gonna burn the whole place down someday. Maybe both.\n As soon as she got the last words out of her mouth, Miss Miranda spun around on her high heels and got out of there as fast as she could. I thought the new girl would fall over as soon as Miss Miranda left, but she put her hands behind her back and stuck her chest out same as the rest of us. Her eyes weren’t nearly as scaredy-cat as I thought they’d be. She smelled like sour milk for sure, but hot sauce and honey a little bit too.\n “I’m Brenda,” she said. “Brenda Nevins.”\n “That’s a stupid name,” said Flash.\n “It’s what my daddy called me,” said new girl, thrusting her chest out even more, like it would cover the way her voice got all wobbly.\n “Yeah? Well where’s your daddy now?” Flash asked. The new girl’s head dropped forward. We hadn’t made a bet on whether someone could make her cry, but there were some things Flash would do for free.\n “She doesn’t remember,” I told Flash. “You know that.”\n “I remember fine,” said the new girl. “It’s just that . . . it just happened. He just died, I mean.”\n Flash rolled her eyes.\n “No way you remember that shit,” she said. “Not anymore.” She put on her best Miss Miranda impression, high pitched and piercing. “Your memories of your time before joining the Agency are being held for safekeeping until you reach adulthood and can properly integrate them into your daily life.”\n “What are you talking about?” new girl said. “I remember my dad. He was a—”\n “Spare me the bullshit,” Flash said, voice back low. “Miss Miranda tell you how in your file it says your daddy was a famous reccer? Or a Wall Street corp? Or a doctor? Bet if you looked in the ’grams she took from you, you’d find out he left you chained up in the basement. Or he liked to beat on your mama. Or maybe you ain’t never had no daddy at all.”\n I felt my eyes get hot, just a little, but new girl didn’t blink.\n “My daddy was a good man,” she said. “Not my fault if yours wasn’t worth shit.”\n I backed up two steps so as not to get hit when the fists started flying. A fight was gonna mean discipline and lights-out and early curfew for at least two weeks. Nothing worse than that and having a black eye. But Flash just laughed.\n “Damn, girl,” she said. “You got balls. Gonna be hard coming up with a name for you.”\n “My dad—”\n “Your dad won’t know any different.” I tried to stare some sense into the girl before Flash flipped back to serious and threw her across the room, or started working out how to smother her in the middle of the night. “Leave his name for him and ours for us. I’m Ghost. She’s Flash. That’s Whispers. We’ll figure something out for you.”\n It took two weeks, but in the end, we called her Princess. Flash said it was from some fairy-tale book she’d read as a little kid, but I’d been to the Reynolds’ for a tryout same as she had, and Princess was the name of the dumb fat poodle they all fed under the table. Plus Flash said it like a curse, with a sparkle in her eye that any idiot could tell meant trouble. I told Princess not to worry, though; I’d watch her back. Not sure why. Maybe ’cause if Princess turned up dead it was back to just Whispers and Flash to talk to. Maybe ’cause I used to be a bit of a sour milk girl too.\n Me and Princess almost pinky-swore on the whole thing, but I told her that was just for little kids and losers. Even if you were too poor to get wired up soon as you turned fourteen so you could swap ’grams of every stupid thing you did with all your besties in the school cafeteria, anybody could put together the credits for a memory share at one of the public booths. Sure, all the MemCorps signs said with adult supervision only, ’cause fooling around in your head like that could mess you up when your brain was still growing, but I just told the guy at the front we were over eighteen and gave him a two-cred tip. And Princess let him look down her shirt a little when he asked to see our pretty little smiles.\n We got hooked up to our chairs in one of the side-by-sides. They were sticky, but it felt like old candy, not blood or anything, so I locked in. I had to show Princess how, but she caught on quick—straps on, headset up, earpieces in. I didn’t get into all the MemCorps does this and your brain cells do that and then you see the memory clear as if it happened to you part, ’cause Princess might have been a little sad looking, but she didn’t seem dumb.\n “Your session has begun,” said the booth voice, all high and cool, like if Miss Miranda had turned into a robot.\n I started first, since I knew how to work the thing. Shared my memory of the time I pulled some stupid rich girl’s chair out at school and she fell back and her legs went one way and her arms went another and her mouth made a big O shape and I laughed for about an hour. Princess giggled right along with me, but there was no way to tell how much of that was real and how much was the machine—easy enough to get swept away in a share without halfway trying.\n “That’s all you got, Ghost?” she said, when we were finished laughing. “Some girl falling over?”\n “It’s funny.”\n “Yeah, but you said we’re supposed to be swapping something real.”\n “It’s a memory booth, dumbass,” I said, smiling so she knew I didn’t mean something by it like Flash would. “Of course it’s real.” And it was, even if I didn’t share the part where Miss Miranda found out and made my head ache for a week. I liked Princess fine, but you couldn’t give everything to some new girl in one go.\n “Not real like true,” she said, rolling her eyes. “Real like important. Like my daddy.”\n “I’m sick of hearing about your damn daddy all the time.”\n “That’s ’cause you didn’t know him the way I did,” she said. “He was real.”\n And then she shared him with me—one ’gram after another. The way he half-smiled when she walked in the house, how it sounded when he called her Brenda, how she found him dead in his rocking chair and didn't tell anyone for a whole day even though it started to stink. The public booths were old and ragged, but I could still smell the rotten and taste the tang of garbage in my mouth and feel the pound pound of her heart thinking it was the Agency every time a car drove by. Whole thing made my eyes sting and my throat itch.\n “Real like that,” Princess said, voice all whispery. I just shook my head. No thinking about what my daddy could’ve looked like and what he might’ve called me. Needed to clear everything out and get back on even ground.\n “’Cmon. Just show me something,” she said, and for a second, I wished Flash was there, just to tell her to shut the hell up and leave me alone.\n “Maybe next time,” I said instead, taking the straps off of my legs clip by clip, telling my hands not to shake. “We’re out of time anyways.”\n Princess flipped her hair back with her hand, turned her head, and looked me straight in the eyes. “You think that guy out there’s gonna mind if we go over?”\n “No. I just . . . ”\n “Don’t want to share something real,” she said, ripping her straps off and throwing her goggles back on the shelf, acting like sour milk and hot sauce had a baby. “I get it.”\n “You really fucking don’t,” I said. “Me, Flash, Whispers . . . we don’t have something real to share. All those cute, sweet memories of being a kid? Snatched off us when we got to the Agency and locked away where we can’t get ’em. All we know is school and the third floor and a few fosters who couldn’t be bothered to keep us. That’s it. That’s all we fucking got.”\n Princess stared at me for a second, eyes wide, then walked out, saying I didn’t know and Sorry under her breath like she was doing a Whispers impression. I stayed for a while, playing back the couple of half-decent memories I did have, like the day I figured out how to get the computers in the back to do what I wanted, like a real hacker, or the times the Agency let us go down to the first floor and play with the babies, and then the ones that made my neck shiver, like all the times fosters sent me back ’cause I didn’t fit into any of the smiling family photos—too old, too dark, too “hard to handle.”\n But none of my memories were real the way Princess wanted. They didn’t make my blood jump or my hands get all shaky or my mouth go dry. Not even the bad ones. Not the Reynolds’ dog Butch chasing me ’round their big house, growling and smelling like death and scaring me more than Flash ever had. Not little Bitsy Reynolds laughing and telling me how I seemed nice enough for a dark girl, but Butch hated who he hated and you couldn’t tell a dog any different. Not Mrs. Reynolds looking anywhere but at my face when she brought me back to the Agency, telling Miss Miranda she’d tried but I didn’t know how to fit in and I was riling up the animals and after all, they’d been there first. Not even the day I woke up in the Agency with a throbbing skull and a big ol’ hole of nothing in my head and Miss Miranda telling me I was eight years old and my parents were dead but I’d get a new family by the time I turned ten if I just tried hard enough. Not one goddamned thing.\n I got back after curfew. Miss Miranda gave me a lecture about rules and responsibilities over the pounding in my head—a small physical reminder of the way we expect you to behave here, she said, smiling down at me. I hope I won’t have to speak to you about this again.\n At least the pain made it easy enough to ignore everyone once I was off the elevator. Flash rushed up to find out where I went off to and if I did anything fun, Whispers told stories about my day to her make-believe friends, and Princess acted like the back wall was the most interesting thing in the room. Took her half an hour to slink her way over to where I sat on the edge of my bed in the fourth row, swinging my feet in the air and ignoring every one of Flash’s ten thousand questions. Her hair hung down in her face again, like on her very first day, and she looked like one of those trained puppies the homeless men use for begging, ready to pant and collapse at your feet the minute you look like you’ve got a few credits to spare.\n “I’m sorry,” she said. She sat on the floor in front of my feet like she thought I wouldn’t kick her. “Didn’t realize the way things went around here.”\n I shrugged and said, “It’s okay, you’re new.” Even though it wasn’t. Anything to get her to shut it and go away. But of course Princess was too sour milk to get any hints, just kept sitting there and staring and asking stupid things.\n “How long you been here, anyway?”\n “Six years. More or less. Agency said they got a bunch of us after the last big quake.”\n “A bunch? They on another floor we can’t go to?”\n “Nah. They all got kept by fosters whose kids got smashed up or killed same as our parents,” Flash said. “Everybody but us lifers and the lucky ones.”\n “Lucky ones?” Princess’ face stayed scrunched.\n “The ones who got old and got out. Hit eighteen, got their memories, never looked back.”\n “Got their memories from where?” Princess asked. Flash rolled her eyes.\n “From wherever they fucking keep them after Processing,” she said. “Hurts like a bitch when they rip the ’grams out, too. Like someone stabbing you through your eye. ’Course they let you remember that part. Fucking Agency.”\n “It only hurts for a minute, wuss,” I said, sticking my tongue out at Flash. Normally I wouldn’t dare, but one of the good things about the way she looked at Princess, like some puppy she half-wanted to cuddle, half-wanted to kick, was that she didn’t have so much nasty left for the rest of us.\n “So how come I remember everything?” Princess asked, like there was any way we’d know.\n “They probably screwed up,” Flash said. “Or you’re an Agency spy. Or your brain’s so weak that it would mind-wipe you altogether.” She pointed over at Whispers, who was playing with her fingers like she’d never seen them before.\n “You wish,” said Princess, flipping her hair in Flash’s general direction like she was trying to get killed. Flash ignored it. She really was getting soft.\n “Only way to find out is to get into Miss Miranda’s files,” Flash said. “She’s got ’em all locked up down in the office on cube drives or something. Right, Whispers?”\n “I’m just supposed to clean the office,” Whispers said, to nobody in particular.\n “Fine.” Flash walked over to Whispers’ corner of the room to get her attention. “Simple question. You ever see a whole bunch of little glowy cubes in a drawer or something?”\n “Leave her be, Flash,” I said. My head still hurt from Miss Miranda’s warning, and nothing got Whispers shrieking louder than getting too comfortable over in her corner of the room. The first time, she’d hollered for a good hour ’til the Agency folks figured she wasn’t gonna stop, but even now it took about ten minutes before she got dragged down to the medic and brought back passed out cold.\n “I’m just asking a question, Ghost,” Flash said, leaning against the wall near Whispers’ bed. “C’mon, Whispers. I promise I’ll leave you alone if you tell.”\n “The memories aren’t in the office,” Whispers said. “They’re in the cloud.” I felt my cheeks get a little hot. Stupid. I was supposed to be the big bad hacker; I should’ve guessed.\n “That means we can get ’em with the computers up here, right Ghost?” Flash asked. “Like you did when you got the booze-flavored candy?”\n “That was before they added all kinds of security,” I said.\n “So you can’t get in?”\n “Didn’t say that.”\n “Then shut up and do it already,” Flash said. “I want to know why she gets to hold on to all her stupid little ’grams and they won’t let us remember shit ’til we get out of here.”\n “Can’t tonight,” I said. “They’re gonna be watching the floor.”\n “Yeah, ’cause you decided you had to come in late, and for no good reason either. Didn’t even bring us shit.”\n “It’s not her fault,” Princess said, still lounging on the floor near my bed. “I—”\n “Doesn’t matter,” I said. “They’re gonna be looking close for a couple days. We’ll have to try another time.”\n “Or we could just distract ’em,” Flash said. Then she went and sat down, right on the edge of Whispers’ bed.\n It took fifteen minutes of screams that I could feel all the way back behind my eyeballs, but eventually one of the overnight Agency guys, the one Flash thought had nice hair, came up and dragged Whispers away.\n “You shouldn’t have—” I started.\n “Yeah yeah,” Flash said, shrugging. “Just do it already. Before they finish drugging her up.”\n I looked at Princess, but she just flipped her hair again and walked over to the computers. She had a little more hot sauce in her than I thought. Couldn’t tell yet if that was a good thing.\n “Go ’head,” Flash said. “Thought you were supposed to be some kind of super-hacker.”\n My head was still throbbing, worse than ever, and I knew Flash was just trying to get to me, but truth was truth. I sat down and got to typing—no way the Agency would spring for touch screens or one of those fancy robot lady voices—and was in quicker than I thought. Miss Miranda had locked down all the “bad influence” stuff pretty tight, but getting the Agency files wasn’t much harder than getting the cam feed from downstairs and watching the babies play.\n “Brenda Nevins,” I read from the screen. “Resident at the Agency for the Care of Unassociated Female Minors.”\n “Blah blah blah,” said Flash from across the room. She was on lookout by the elevator for when Mr. Nice Hair came back with Whispers. “Get to the good stuff.”\n “It doesn’t say anything really,” I said. “Just a bunch of big words.” The whole thing was reports and warnings and psychology mumbo-jumbo. Nothing ’til I got down to the engrams section. It was a list of ’grams with titles like Discovery of Father’s Body and Trip to Percy Park on May 7th. I recognized a couple from in the booth earlier, but most I’d never even heard of, and just about all of them had the same big bold flashing letters on the far right. Not to Be Removed. See Explanation.\n “‘Explanation,’” Princess read from over my shoulder, finger tracing along the screen like some little kid trying to figure out how words work. “‘To date, Miss Nevins has shown none of the aberrant or destructive behavior of many of the Agency’s other older residents. As the trauma from the loss of her father has not led her to behave negatively, we recommend that she be able to keep the majority of her memories at this time. Moreover, it can be noted that Agency resident Becky Ann Ross has shown no significant behavioral improvement since memory removal, and it is possible that the procedure itself had a negative impact on the development of Samantha Lee, leaving her prone to delusions and outbursts. While Destiny Ward has demonstrated some positive behavior changes and remains difficult to place primarily due an unfortunate lack of demand, a better form of control therapy than memory removal may need to be implemented in the future.’” Princess faked her way through most of the big words and probably wasn’t saying half of them right, but I knew what “lack of demand” meant.\n “Destiny? That’s you?” Princess asked. I shut down the machine and pushed her out of my way as I headed back to my bed. She followed. Of course.\n “You’re Destiny Ward,” she said again, right behind my ear. “Right?”\n “I’m Ghost, you fucking idiot,” I said. Ghost who was too old and too ugly to be in demand. Ghost who didn’t smile right, who dogs couldn’t help but want to kill. Ghost who had a hole in her mind instead of whatever it was that would get Princess and all those little first-floor babies and second-floor sweethearts tried out and kept by fosters, far away from the damn third floor. Ghost who knew how to fix it.\n I got up from the bed so fast that Princess jumped back a good foot. Even Flash flinched a little bit over by the elevator. Fuck the Agency; I could find my ’grams right now, maybe even get them put back in early. There were people who would do that if you paid them well enough. I was a hacker; I could figure it out.\n I got back into my file and scrolled down. Visit to the Ferris Wheel with Parents, Earthquake and Aftermath, Petty Larceny #1,2,3.\n And in the rightmost column of each—Permanently Deleted. Not held for safe-keeping until you can integrate them into adult life. Not get them back when you turn eighteen. Just gone. Totally and forever gone.\n I picked up the stupid machine to throw it down on the floor, break it open like a water balloon, but Princess caught my arm.\n “You don’t want to—”\n “You don’t know what the hell I want,” I said, brushing her off and heading over to the elevator. “Agency lied to us, Flash. They fucking lied. They took all our memories and said they were giving them back but they—”\n “Shut it,” Flash said. “They’re coming up.”\n She was right. I could hear the whirring of the gears as the elevator climbed. This time of night, Agency bastards would want us all lying down. Proper bedtime protocol and all that bullshit. Leave us flat on our backs while they told us their lies.\n I got back to my bed just in time for Mr. Nice Hair to step off, carrying Whispers in his arms. He put her down on the closest bed, nowhere near her little corner, which was how I knew she was really knocked out. Otherwise she would’ve started screaming all over again. Then he turned around and left without a word. Just like Miss Miranda. No time for the third-floor rejects. We probably wouldn’t remember it anyway.\n “Let’s move her back,” said Flash. Nobody moved. “You want her to start up again when she wakes up?”\n I didn’t care what the hell happened when she woke up, but I didn’t feel like fighting. I grabbed her bony ankles while Flash took hold of her arms and Princess kept a hand under her back. Once she was passed out on her own bed, legs sprawled one way and arms another, mouth hanging open like she was a clown in a carnival game, Flash patted me on the arm. If it had been Princess, I probably would have slapped her in the face, but instead I turned my face away.\n “They really wipe our stuff completely?” she asked. I nodded. “No way to hack it back?”\n “Don’t think so.”\n “I’m sorry,” Princess said. When I didn’t answer, she crept over to her bed and laid down, her head thudding onto the hard pillow. Flash didn’t move. Just leaned in close so her mouth was right by my ear.\n “I’ve got an idea,” she said. Her voice turned from whisper to giggle.\n I could almost smell the hot sauce in the air.\n “Wanna go to the booth again?” I asked Princess a few days later, after school. She looked at me and nodded like I’d asked if she wanted a million bucks. With me giving her the silent treatment, all she’d had to talk to was Flash and Whispers, and that wasn’t much to live on.\n “Is it gonna make you mad again?” she asked, her face back in that little half-scrunch.\n “Nah, I’m over it,” I said. “Plus, I figured out how to share something real. You’re looking at an A-plus hacker, remember?”\n “Yeah, I remember.” She smiled bright for the rest of the walk over to the booth. I nodded at the front desk guy as we came in, sent a whole mess of credits his way.\n “Break time, right?” I said. He just raised his chin in a half-nod, then looked over at Princess’s shirt like he could see through the fabric. She caught on quick and bent over again, enough for him to smile and head off. Then she went straight for the side-by-sides.\n “You coming, right?” she said.\n “Yeah,” I said. “Go ahead and strap in. I have to hack something back here for this to work.”\n “Okay.” Princess put on the headphones and straps and all that. The goggles covered her eyes up tight, but I turned the booth lights off too, made sure she couldn’t see Flash tiptoeing in.\n I called up one of the memories on the list I’d pulled from the Agency. Brenda and her Father at her fifth birthday.\n “Hey,” Princess said, “Something’s off. This is one of mine.”\n “Not anymore,” I said. Her body jerked up as my code hit the booth and she clutched her head like someone was knifing her in the eye. Princess screamed and tried to tear the straps off, to run away, but Flash held her arms down, giggling under her breath. I’d offered her a few credits to help out, but some things Flash would do for free.\n “Don’t worry.” Flash’s hands tightened against Princess’ arms as Princess’ hair flipped back and forth. “It only hurts for a minute. You’ll barely remember.”\n When the twitching and moaning stopped, we unhooked Princess from the booth and Flash walked her out, steadying her like she was an old drunk. I told Flash I’d be along soon, that I needed to check everything was clear so we wouldn’t get caught. But after she was out of sight, I went in for a half hour in my own booth instead. Any good thief’s gotta check the merchandise. Plus I didn’t like looking at Princess all limp and sad, worse than sour milk even. That was more of a Flash kinda thing. She’d said I should erase every memory Princess had forever, put us all on even ground, but I didn’t want to be that way about it. I was gonna give Princess the memories back at eighteen anyway. Sooner, maybe. Once I was living with a foster in some big house with nice kids and no dogs.\n Princess was long-haired and cinnamon pretty; she’d find a foster with her memories or not. Just like Hope and the rest. Just like I was gonna. With Princess’ memories filling up that hole in my head, I’d be set. I’d know just how to smile with the fosters and laugh and make ’em like me—even if I didn’t fit in the pictures, I’d know how to be part of a family. I’d smell like cinnamon and honey and babies and home.\n I cued up the first string of memories in watch mode, so I wouldn’t get too caught up in the share ’til I found the right ones. I could tell Princess was a little girl right away ’cause of how big everyone looked through her eyes, like friendly giants. There were tons of them, coming and going and bringing her things, but only two were really important—Mom and Dad, happy and smiling. I tried smiling back, giggling like she giggled when Dad picked her up to pretend fly or when Mom played peekaboo. But I couldn’t get the feel of it right without going all the way in. I could hear myself through the earplugs, a high-pitched cross between a scream and the hiccups. I needed something better.\n I skipped through the memories, playing a few seconds if something looked good and then moving on, looking for something like the ones that Princess had showed me before, the ones that made my hand shake and my breath skip.\n But all I saw was how, each time I stopped, there were half as many people, that the presents were gone and then the toys too, that the rooms were smaller and dingier, that Mom left on a rainy day and never came back, that Princess didn’t seem to care. She still had her Daddy and he always always held her tightly, close enough that even on watch I could smell the liquor on his breath—just like those booze pops I’d ordered. I still felt a little of the way she’d felt when he called her Brenda, all lit up from inside like candles on a birthday cake, but this time I wasn’t swept up in the share—she was just some sad little girl wearing grimy clothes, living in a dirty room with an old man who finally died in a rocking chair. Some girl who leaned over and let a perv at a front counter see down her shirt. Some girl too dumb to figure out her own stupid memories.\n I left the booth before the half hour was up, still trying to get the stink of Princess’ dirty life out of my nose. Pervy was back on duty and waved me over from the front counter as I passed by.\n “Your friend gonna be alright?” he said. “Seems like a sweet girl.” He licked his skinny lips and I had to try not to shiver. Princess would end up swapping more than ’grams with him one of these days.\n “Leave her alone,” I said.\n “I’m just a concerned citizen.” He lifted a bushy eyebrow in a way that was probably supposed to make me feel something. “Maybe I should be concerned about what you were doing during my break.”\n “Just making a back up,” I said. “In case there’s another quake or she gets hit by a truck or something.” Pervy leaned forward a little.\n “I’ve got an extra,” I said. “You want it?”\n Pervy had his hands out before I could blink. They looked pale and clammy, like a piece of gum stuck under a chair too long. I fished the cube with Princess’ memories out of my pocket. It was the only one I had, but she’d be better off without it. Who wants to find out at eighteen that their life has been so fucking pathetic? Screw having something real.\n “I give you this, you leave her alone, alright?”\n Pervy nodded. I handed the cube over, making sure not to touch his sweaty hands. Fifty-fifty chance he’d try to pull some double-cross, but if I needed to, I could take care of his memories as easy as I had Princess’, so I just smiled and walked out. Can’t hurt somebody you can’t remember.\n This time, I made curfew. I could tell by the way Miss Miranda stared me down that she couldn’t wait to have some reason to give me punishment, but she was gonna have to. I smiled right at her and headed up to the third floor like I had a mouth full of cotton candy. Soon as I got off the elevator I saw Princess lying in the bed she liked, hair spread out on the pillow like a pool of old soda. Flash sprang up soon as she saw me, with that big smile she got like she was either gonna hug you or eat you.\n “It’s all gone,” she said. “All that shit about her daddy and her perfect life? Wiped just like if the Agency got her.”\n I smiled back, but it felt weird, like baring fangs.\n “I thought you were bullshitting about the hacking part, but you give good, Ghost,” Flash said. “Maybe next you can reboot Whispers so she won’t talk so damn much, right? Or creep up on Miss Miranda and take everything she’s got?” She laughed hard, and I knew not to tell her anything about how it really was with Princess, ’cause then she’d be mad I gave all the good stuff away.\n “The rest of her okay?” I said, like I didn’t care too much really.\n “Yeah, she’s good. Not like Whispers or anything. Just less annoying. Cuter too.” Flash glanced over at Princess like she was sizing her up in a prize booth at a fair.\n “Yeah, but fosters’ll probably get her soon.” She’d be fine. Just like Hope. Better than her memories.\n “Maybe,” Flash said, “If she figures out how to keep her mouth shut.”\n “Fifty credits says she’s gone in a month.”\n Flash shook her head. “She’s not that cute.”\n “You said that with Hope.” I shrugged and hoped my palms wouldn’t be too sweaty.\n “Fine.” Flash grabbed my hand tight with her cold one. “But make it sixty. And when she starts blabbermouthing again, I’m gonna laugh at the both of you.”\n “We’ll see,” I said, and started over for Princess. I thought Flash might follow, but she just went back to practicing whistles like always. Princess wasn’t doing much, didn’t even look at me as I walked over and sat down right by her ear. Just stared up at the ceiling like any other new girl who got wiped and dumped on the third floor. Sour milk squared. But that was okay. You didn’t have to stay a sour milk girl forever.\n “I’m Ghost,” I said, low and quiet so only she could hear. “You know Flash and Whispers. And we call you Princess, but your daddy, he called you Brenda.”\n Erin Roberts is a writer and communications consultant who somehow found a way to be a storyteller when she grew up. Her fiction has been published or is forthcoming in Podcastle and The Dark, and her non-fiction has appeared in venues including Tor.com and People of Colo(u)r Destroy Fantasy. She is a graduate of the Odyssey Writing Workshop and Stonecoast MFA program, an Associate Editor for Escape Pod, and the winner of the Speculative Literature Foundation's 2017 Diverse Worlds and Diverse Writers Grants. She can be found on Twitter at @nirele."}