{"fingerprint": "qcKu5cQDX/CKrnpDRyIfpOS8OTE=", "sitename": "Clarkesworld Magazine", "title": "Hair by Adam Roberts", "author": "Adam Roberts", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/roberts_07_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Hair by Adam Roberts", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10040 words, novelette, REPRINT\nHair\n1\nIt seems to me foolish to take a story about betrayal and call it—as my sponsors wish me to—“The Hairstyle that Changed the World.” All this hairdressing business, this hair-work. I don’t want to get too worked-up about all that. Like those massed strands of electricity shooting up from the bald pate of the Van de Graaff machine. And whilst we’re on the subject of haircuts: I was raised by my mother alone, and we were poor enough that, from an early stage, she was the person who cut my hair. For the sake of simplicity, as much as economy, this cut would be uniform and close. To keep me quiet as the buzzer grazed, she used to show me the story about the mermaid whose being-in-the-world was confused between fishtail and feet. I’m sure she showed me lots of old books, but it was that one that sticks in my head: the singing crab, more scarab than crustacean; the wicked villainess able to change not only her appearance but, improbably, her size. I used to puzzle how she was able to generate all her extra mass when at the end she metamorphosed into a colossal octopus. Mostly I remember the beautiful young mermaid, a girl with the tempestuous name Ariel. The story hinged on the notion that her tail might vanish and reform as legs, and I used to worry disproportionately about those new feet. Would they, I wondered, smell of fish? Were the toenails actually fish-scales? Were the twenty-six bones of each foot (all of which I could name) formed of cartilage, after the manner of fish bones? Or human bone? The truth is, my mind is the sort that is most comfortable finding contiguities between different states, and most uncomfortable with inconsistencies. Hence my eventual choice of career, I suppose. And I don’t doubt that my fascination with the mermaid story had to do with a nascent erotic yearning for Ariel herself—a very prettily drawn figure, I recall.\nThis has nothing to do with anything. I should not digress. It’s particularly vulgar to do so before I have even started; as if I want to put off the task facing me. Of course this account is not about me. It is enough, for your purposes, to locate your narrator, to know that I was raised by my mother alone; and that after she died (of newstrain CF, three weeks after contracting it) I was raised by a more distant relative. We had enough to eat, but nothing else in my life was enough to. To know that my trajectory out of that world was hard study, a scholarship to a small college, and the acquisition of the professional skills that established me in my current profession. You might also want to know where I first met Neocles (long final e) at college, although what was for me dizzying educational altitude represented, for him, a sort of slumming, a symptom of his liberal curiosity about how the underprivileged live.\nAbove all, I suppose, you need to know that I’m of that generation that thinks of hair as a sort of excrescence, to be cropped to make it manageable, not indulged at length. And poverty is like the ore in the stone; no matter how you grind the rock and refine the result it is always poverty that comes out. Thinking again about my mother, as here, brings her colliding painfully against the membrane of memory. I suppose I find it hard to forgive her for being poor. She loved me completely, and I loved her back, as children do. The beautiful mermaid, seated on a sack-shaped rock, combing her long, coral-red hair whilst porpoises jump through invisible aerial hoops below her.\n2\nTo tell you about the hairstyle that changed the world, it’s back we go to Reykjavik, five years ago, now: just after the Irkutsk famine, when the grain was devoured by that granulated agent manufactured by—and the argument continues as to which terrorists sponsored it. It was the year the World Cup descended into farce. Nic was in Iceland to answer charges at the PPC, and I was representing him.\nA Product Protection Court hearing is not much different than any other court hearing. There are the rituals aping the last century, or perhaps the century before that. There’s a lot of brass and glass, and there is a quantity of waxed, mirror-like darkwood. I had represented Nic at such hearings before, but never one quite so serious as this. And Nic had more to lose than most. Because I had itemized his assets prior to making our first submission before the Judicial Master I happened to know exactly how much that was: five apartments, one overlooking Central Park; a mulberry farm; forty assorted cars and flitters; more than fifty percent shares in the Polish National Museum, which although it didn’t precisely mean that he owned all those paintings and statues and whatnots at least gave him privileged access to them. The Sydney apartment had a Canova, for instance, in the entrance hall, and the Poles weren’t pressing him to return it any time soon.\nHe had a lot to lose.\nIn such circumstances insouciance is probably a more attractive reaction than anxiety, although from a legal perspective I might have wished for a more committed demeanor. He lounged in court in his Orphic shirt—very stylish, very Allah-mode—and his hair was a hundred years out of date. It was Woodstock. Or English Civil War aristocrat.\n“When the JM comes in,” I told him, “you’d better rise up off your gluteus maximus. Stand yourself straight.”\n“You’re not the boss of me,” he said, indulgently.\nJudicial Master Paterson came in, and Nic got to his feet smartly enough and nodded his head, and then sat himself down perfectly properly. With his pocketstrides decently hidden by the table he looked almost respectable. Except for all the hair, of course.\n3\nI saw him only twice again after that—after, I mean, the afternoon in the PP courtroom painstakingly picking my way through the brambles of intellectual property legislation. Once, and then once again. But that day went better than I had hoped. I see-you-tomorrowed him on the steps of the courthouse, but he was staring at the sky. The bobble-layer of clouds on the horizon was a remarkable satsuma color. Further up things were cyan and eggshell. The surface of the icebound estuary, which had looked perfectly smooth and flat in daylight, revealed under the slant light all manner of hollows and jags. Further out at sea, past the iceline where waves turned themselves continually and wearily over, a fishing platform sent a red snake of smoke straight up from the fakir’s basket of its single chimney. The ocean had lain a sheet of firework sparkles over the profound dark of its depths.\n“Tomorrow,” he replied absently. He seemed hypnotized by the view.\n“Don’t worry,” I told him, mistaking (as I now think) his distraction for anxiety about the prospect of losing some of his five apartments or forty cars and flitters. “The JM said he recognized that some individuals have a genius for innovation. That was a good sign. That’s code for: geniuses don’t need to be quite as respectful of the law as ordinary drones.”\n“A genius for innovation,” he echoed.\n“I’m not saying scot-free. Not saying that. But it won’t be too bad. You’ll keep more than you think. It will be fine. Don’t worry. Yes?”\nHe suddenly coughed into his gloves—yellow, condom-tight gloves—and appeared to notice me for the first time. God knows I loved him, as a friend loves a true friend, but he bore then as he always did his own colossally swollen ego like a deformity. I never knew a human with so prodigious a self-regard. His selfishness was of the horizoning, all-encompassing sort that is almost touching, because it approaches the selfishness of the small child. His whim: I shall be humanity’s benefactor! But this was not an index of his altruism. It was because his ego liked the sound of the description. Having known him twenty years I would stand up in court and swear to it. He developed the marrow peptide-calcbinder treatment not to combat osteoporosis—the ostensible reason, the thing mentioned in his Medal of Science citation—but precisely because of the plastic surgical spinoff possibilities, so that he could add twenty centimeters to his own long bones. It’s not that he minded people using his treatment to alleviate osteopathologies. With a sort of blithe single-mindedness, he was pleasantly surprised at other useful applications.\nAccordingly, when he did not turn up in the courtroom the following day my first thought was that he had simply overslept; or gotten distracted by some tourist pleasure, or that some aspect of his own consciousness had intruded between his perceiving mind and the brute fact that (however much I tried to reassure him) a JM was gearing up to fine him half his considerable wealth for property-right violation. It did not occur to me that he might deliberately have absconded. This possibility evidently hadn’t occurred to the court either, or they would have put some kind of restraint upon him. You would think (they thought, obviously) that the prospect of losing so many million euros of wealth was restraint enough.\nThe shock in court was as nothing, however, to the fury of the Company: his employer, and mine. I want to be clear: I had been briefed to defend Nic in court, and that only. I made this point forcefully after the event. My brief had been courtroom and legal, not to act as his minder, or to prevent him from boarding a skyhop to Milan (it turned out) in order immediately to board another skyhop to—nobody was quite sure where. “If you’d wanted a minder you should have hired a minder,” I said. I was assertive, not aggressive.\nThe court pronounced in absentia, and it went hard on Nic’s fortune. But this did not flush him out.\nHis disappearance hurt me. I was sent to a dozen separate meetings in a dozen different global locations within one week; and in the same timeframe I had twenty or so further virtual meetings. Flying over Holland, where robotically tended fields shone greener than jade, and the hedges are all twenty feet tall, and the glimmering blue rivers sined their paths towards the sea.\nAt Denver airport I saw a man with Parkinsonism—not old, no more than forty—sitting in the café and trying to eat a biscuit. He looked as though he was trying to shake hands with his own mouth.\nThe news was as full of people starving, as it always is. Images of a huge holding zone in Sri Lanka where people were simply sitting around waiting to die. That look of the starving: hunger has placed its leech-maw upon their heel and sucked all their fluid and solidity out, down to the bones. The skin tautly concave everywhere. The eyes big as manga, the aching face.\nOn Channel 9 the famine clock, bottom left corner, rolled its numbers over and over. A blur of numbers.\nI flew to Iceland.\nI flew back to Denver,\nI was acutely aware that Neocles’ vanishment put my own career at risk. Had I always lived amongst wealth, as he had, I might have floated free above the anxiety of this. It’s easy for the wealthy to believe that something will turn up. But I had experienced what a non-medinsure, hardscrabble life was like, and I did not want to go back to it.\nHe’s gone rogue, I was told. Why didn’t you stop him? The Company, which had been (to me) a dozen or so points of human contact, suddenly swelled and grew monstrously octopoid. A hundred, or more, Company people wanted to speak to me directly. This is serious, I was told.\nHe has the patent information on a dozen billion-euro applications, I was told. You want to guarantee the company’s financial losses should he try and pirate-license those? I thought not.\nI thought not.\nNot everybody scapegoated me. Some departments recognized the injustice in trying to pin Nic’s disappearance on me. Embryology, for instance; a department more likely than most to require expert legal advice, of the sort I had proved myself in the past capable of providing. Optics also assured me of their support, though they did so off the record. But it would have required a self-belief stronger than the one with which providence has provided me to think my career—my twenty-year career—as staff legal counsel for the Company was going to last more than a month. As it was, the elegant bee-dance of mutual corporate espionage continued to report that none of our competitors had, yet, magically acquired any of the intellectual property Nic had in his power to dispose. I had a meeting at Cambridge, in the UK, where late winter was bone-white and ducks on the river looked in astonishment at their own legs. I flew to Rio where the summer ocean was immensely clear and beautiful: sitting on the balcony of our offices it was possible, without needing optical enhancement, to make out extraordinary levels of detail in the sunken buildings and streets, right down to cars wedged in doorways, and individual letters painted on the tarmac.\nI flew to Alaska. I flew to Sydney, where the airport was a chaos of children—a flash mob protest about the cutbacks in youth dole.\nIn the midst of all this I somehow found time to begin, discreetly, to make plans for a post-Company life. My ex-wife was more understanding than I might have expected, more concerned to maintain medinsure for our two children than for herself. I scouted, gingerly, secretly, for other employment; but even with the most optimistic assessment it was going to be hard to carry five lots of medinsure on my new salary. I could not of course deprive the children, and I did not wish to deprive Kate. That left my ex-wife and myself, and—truthfully—I decided to give up coverage for myself and leave my ex’s in place.\nThen, from the blue, news: Neocles had gone native in Mumbai, of all places. I was called once again to Denver and briefed face-to-face by Alamillo himself, the Company enforcer and bruiser and general bully-fellow. It was not a pleasant tete-a-tete. At this meeting, emphasis was placed on the very lastness of this, my last chance. The word last as conventionally used was insufficient to convey just how absolutely last this last chance was, how micron-close to the abyss I found myself, how very terminal my opportunity.\nThe very severity of this interview reassured me. Had they not needed me very badly they would not have worked so hard to bully me. For the first time since Nic had so thoughtlessly trotted off—putting at risk, the fucker, not only his own assets but my entire family’s well-being—I felt the warmth of possible redemption touch the chill of my heart.\n“My last chance,” I said. “I understand.”\n“You go to him,” said Alamillo. “You have a fucking word, yes?”\nI understood then that they were sending me because I was a friend, not because I was a lawyer. They already knew that money was no longer going to provide them with any leverage with Nic—that he had renounced money. He was easing himself into his new role as Jesus Christ, the redeemer of the starving. What can you do to a person who won’t listen to money? What else does Power have, in this world of ours?\n“I’ll talk to him. And?”\n“What does and mean?”\n“I mean: what else?”\n“Nothing else,” said Amarillo, vehemently.\n“Bring him home?”\n“No, that’s not what we’re sending you to do. Listen the fuck to me. I don’t give a fucking pin—just, just. Look. We’re sending you to talk to him.”\n4\nI was flown out on a gelderm plane, its skin stiffening with the frictive heat of a high-inset aerial trajectory. I ate little medallions of liquorish bread, with shark caviar and Russian cheese pâté; and then authentic sausages lacquered with honey, and then spears of dwarf asparagus, and then chocolate pellets that frothed deliciously inside the mouth. I drank white wine; a Kenyan vintage. The toilet cubicle of this plane offered seven different sorts of hygiene wipes, including a plain one, one that analyzed your stool as you wiped to check for digestive irregularities, and several that imparted different varieties of dotTech to your lower intestine to various ends.\nI watched a film about a frolicsome young couple overcoming the obstacles placed in the way of their love. I watched the news. I watched another film, a long one this time—fifteen minutes, or more—based on the historical events of the French Revolution.\nThe tipping point of our beginning our descent registered in my viscera, like a Christmas-eve tingle of excitement.\nWe plummeted to Mumbai.\nArriving at Chatrapati Shivaji was like travelling back half a century in time: the smell; the litter; the station building’s silver-painted curved ceilings on their scythe-shaped supports. An all-metal train, running on all-metal rails, trundled me from the terminal to the departure room. Then it was a short hop in a Company flicker to Jogeshwari beachfront—seconds, actually: a brief elevation over the peninsular sprawl of the city, its bonsai skyscrapers like stacked dishes, the taller curves and spires further south. The sky was outrageously blue, and the sea bristled with light. And, really, in a matter of seconds we came down again. I could have walked from airport to seafront, is how close it was. But better to arrive in a flitter, of course. When I’d called Nic he’d been gracious if laid-back in reply: no Company men, just you, old friend. Of course, of course.\nOf course.\nThere was a flitter park on the Juhu dyke, and I left the car, and driver, there, and started walking. Forty degrees of heat—mild, I was told, for the season. The sky blue like a gemlike flame. The sun poured heat down upon the world. The air smelled of several things at once: savory smells and decaying smells, and the worn-out, salt-odor of the ocean.\nI don’t know what I expected. I think I expected, knowing Nic, to find him gone hippy; dropped-out; or a holy hermit chanting Japa. I pictured him surfing. But as I walked I noticed there was no surf. The bay harbored the poking-up tops and roofs of many inundated towers, scattered across the water like the nine queens in the chessboard problem, preventing the build-up of rideable waves. These upper floors of the drowned buildings were still inhabited; for the poor will live where they can, however insalubrious. Various lines and cables were strung in sweeping droops from roofs to shore. People swam, or kicked and splashed through the shallower water. On the new mud beach a few sepia-colored palm trees waved their heavy feathers in the breeze. There were people everywhere: a rather startling profusion of humanity, lolling, walking, rushing, going in and out, talking, singing, praying. It was an enormous crush. The sound of several incompatible varieties of music wrestled in the background: beats locking and then disentangling, simple harmonic melodies twisting about one another in atonal and banshee interaction. Everybody was thin. Some were starvation thin. It was easy enough to pick out these latter, because they were much stiller: standing or sitting with studied motionlessness. It was those who could still afford to eat who moved about.\nSweat wept down my back.\nAnd then, as arranged, there was Nic: lying on the flank of the groin with his great length of hair fanned out on the ground behind him. The first surprise: he was dressed soberly, in black. The second: he was accompanied by armed guards.\nI sat beside my friend. It was so very hot. “I think I was expecting beach bummery.”\n“I saw your plane come over,” he said. “Made quite a racket.”\n“Airbraking.” Like I knew anything about that.\n“I’m glad you’ve come, though,” he said, getting up on his haunches. His guards fidgeted, leaning their elbows on their slung rifles. They were wearing, I noticed, Marathi National Guard uniforms. “Good of you to come,” he clarified.\n“People in Denver are pretty pissed.”\n“There’s not many I’d trust,” he said. He meant that he did, at least, trust me.\n“These boys work for you?” I asked.\n“Soldiers. They do. The Marathi authorities and I have come to an understanding.” Nic hopped to his feet. “They get my hairstyle, and with it they get the popular support. Of the poor. I get a legal government to shelter me. And I get a compound.”\n“Compound?” I asked, meaning: chemical compound? Or barracks? The answer, though, was the latter, because he said:\n“Up in Bhiwandi. All the wealth has moved from the city, up to the mountains, up East in Navi Mumbai. The wealthy don’t believe the sea has stopped coming. They think it’ll likely come on a little more. The wealthy are a cautious lot.”\n“The wealthy,” I said.\n“So you can come along,” he said. “Come along.”\nI got to my feet. “Where?”\n“My flitter’s back here.”\n“Are you allowed to park a flitter down here? I was told flitters had to be parked in the official park, back,” I looked around, vaguely. “Back up there somewhere.”\n“I have,” he said, flashing me a smile, “special privileges.”\n5\n“What is it we do?” he asked me, a few minutes later, as the flitter whisked the two of us, and Nic’s two soldiers, north-east over the Mumbai sprawl. He had to raise his voice. It was noisy as a helicopter.\n“Speaking for myself,” I said, “I work for the Company. I do this to earn enough to keep the people I love safe and healthy. I include you in that category, by the way, you fucker.”\n“And,” he said, smiling slyly, “how is Kate?”\nI’ll insert a word, here, about Kate. It is not precisely germane, but I want to say something. To try, at any rate. I love her, you see. I’m aware of the prejudice, but I believe it goes without saying that she is as much a human as anybody. She has a vocabulary of nine hundred words, and a whole range of phrases and sayings. She has a genuine and sweet nature. She has hair the color of holly berries. You’d expect me to say this, and I will say this: it is a particularly strange irony that if the same people who sneer at her personhood post treatment had encountered her before treatment, it would never occur to them to deny that she was a human being. In those circumstances they would have gone out of their way to be nice to her. And if before, why not afterwards? Kate is happier now than she ever was before. She is learning the piano. Of all the people I have met in this life, she is the most genuine.\nI don’t intend to defend my love to you.\n“She is very well,” I said, perhaps more loudly than I needed to. “Which is more than I can say for your portfolio.”\n“A bunch of houses and cars and shit,” he shouted, making a flowing gesture with his right hand as if discarding it all. His was, despite this theatricality, an utterly unstudied insouciance. That’s what a lifetime of never wanting for money does for you.\n“We could have saved more than half of it,” I said, “if you hadn’t absented from the court the way you did.”\n“All those possessions,” he said. “They were possessing me.”\n“Oh,” I said. I could not convey to him how fatuously this struck me. “How very Brother Brother.”\nHe grinned. “Shit it’s good to see you again.”\n“Now, now, this hair thing of yours,” I asked him, guessing it was some nanopeptide technology or other that he had developed. “Is that a Company patent?”\n“You know?” he said, his eyes twinkling and his pupils doing that peculiar cycling moon-thing that they do, “it wouldn’t matter if it were. But, no, as it happens, no. As it happens.”\n“Well,” I said. “That’s something.”\nHe was the hairstyle man, the savior of the world’s poor. “I’m a benefactor now,” he boomed. “I’m a revolutionary. I shall be remembered as the greatest benefactor in human history. In a year I’ll be able to put the whole Company in my fucking pocket.”\nThe flitter landed: a little series of bunny hops before coming to rest, that tell-tale of an inexperienced chauffeur. This was Mumbai after all, not Stockholm.\nWe were inside his compound: a pentagon of walls clustered about with brambles of barbed wire. A central tower shaped like an oil derrick with a big gun at the top—impressive looking to a pedestrian, but like a cardboard castle to any force armed with modern munitions. It was spacious inside the walls, but it was enormously crowded nonetheless; and everybody there without exception—men women and children—had long, ink-black hair. People were lying flat on the floor, or lolling upon the low roofs, or sitting in chairs, all of them sunbathing, and all with their hair spread and fanned out. Nic led me along a walkway alongside the central atrium, and the ground was carpeted with supine humanity. They were so motionless that I even wondered whether they might be dead: except that every now and then one would pat their face to dislodge a fly, or breathe in and out.\n“Sunbathers,” I said.\nAnd then, just before we went in, Nic stopped and turned to me with a characteristically boyish sudden spurt of enthusiasm. “Hey, I tell you what I learned the other day?”\n“What?”\n“Crazy that I never knew this before, given all the work I’ve done. Discovered it quite by chance. Peptides—I mean the word, peptides—is from the Greek πεπτίδια and that means little snacks. There’s something you never knew. Means nuts, crisps, olives stuffed with little shards of sundried fucking tomato. Peptides means scoobysnacks.”\n“Extraordinary,” I deadpanned. “And you with your Greek heritage,” I said, knowing full well that he possessed no Greek language at all.\nAt this he became once again solemn. “I’m a citizen of the world, now,” he said.\nWe went through: up a slope and into a seminar room. Inside was a horseshoe-seating grid with room for perhaps sixty people. The space was empty except for us two. The room put a single light on the front of the room when we came in.\nI sat myself in a front row seat. Nic stood before the screen, fiddling with his hair, running fingers through it and pulling it. “Why do you think you’re here?” he asked, without looking at me.\n“Just to talk, Nic,” I said. “I have no orders. Except to talk. Man, we really ought to talk. About the future.”\n“Hey,” he said, as if galvanized by that word. He flapped his arm at the room sensor and the screen lit behind him: the opening image was the Federal flag of India. “OK,” he announced.\nThe image morphed into diagrams of the chemical structures of self-assembling peptides, filling the screen: insectile wriggles of angular disjunction wielding hexagonic benzene rings like boxing gloves.\n“Wait,” said Nic, looking behind him. “That’s not right.” He clicked his fingers. More snaps of his molecular tools-in-trade faded in, faded out.\n“They go for this sort of Barnum-Bailey, in this part of the world, do they?”\n“Calmodulin rendered in 3D,” he said. “I always think they look like party streamers. Although, in Zoorlandic iteration, they look like a starmap. There’s just so much empty space at the molecular level; our representational codes tend to obscure that fact. There, that there’s lysine.” He danced on the spot, jiggling his feet. “Lysine. A lot of that in your hair. NH2 sending down a lightning-jag of line to the H and H2N link, and O and OH looking on with their mouths open.” Images flicked by. “One of the broken-down forms of lysine is called cadaverine, you know that? The molecule of fucking decay and death, of putrefying corpses. Putrescine. Cadaverine. Who names these things?”\n“Something to do with hair?” I prompted.\n“Lysine,” he said. “Hair.” He held his right hand up and ran his thumb along his other four fingers: the display flicked rapidly through a series of images. “What is it we do?”\n“You asked that before,” I said.\n“Innovations, and inventions, and brilliant new technological advances.”\n“I’m just a lawyer, Nic,” I said. “You’re the innovator.”\n“But it’s the Company, isn’t it? The Company’s business. These technological advances to make the world a better place.”\nI suppose I assumed that this was another oblique dig at Kate; so I was crosser in response than I should have been. “So they do,” I said. “Don’t fucking tell me they don’t.”\nHe looked back, eyes wide, as if I had genuinely startled him. “Of course they do,” he said, in a surprised tone. “Man, don’t misunderstand. But think it through. That’s what I’d say. This is me you’re talking with. Technological advance and new developments and all the exciting novelties of our science-fiction present. It’s great. You get no argument on that from me.”\n“I’ve just flown from Denver to Mumbai in an hour,” I said. “You’d prefer it took me three months sailing to get here?”\n“You have grasped the wrong stick-end, chum,” he said. “Really you have. But only listen. Technological advance is marvelous. But it is always, always, always a function of wealth. Poverty is immiscible with it. People are rich, today, in myriad exotic and futuristic ways; but people are poor today as people have always been. They starve, and they sicken, and they die young. Poverty is the great constraint of human existence.”\n“Things aren’t as bad as you say,” I said. “Technology trickles down.”\n“Sure. But the technology of the poor lags behind the technology of the rich. And it’s not linear. There are poor people on the globe today who do not use wheels, are still dragging their goods on sledges or hoiking them about on their backs. Some armies have needleguns and gelshells; and some armies have antique AK-47 guns; and some people fight with hoes and spades.”\n“This is how you got the government of Marathi to give you this little castle and armed guard?\n“The hairstyle stuff,” he said.\n“And that? And that is?”\nAbruptly, either because Nic had summoned it (although I didn’t see a gesture) or because the program had some other prompt, or because it was buggy in some way, a Nic-avatar popped onto the screen. Quite a realistic animation. “So,” boomed the avatar, beaming down upon his non-existent audience, “cysteine-lysine block copolypeptides that can replicate the propsilicate insilicatein protein, which in turn can generate structures in silica structures—”\n“Quiet!” said Nic, to himself.\nThe animation froze.\nThere is a particular variety of silence I always associate with the insides of high-tech conference rooms. An insulated and plasticated silence.\n“It’s a clever thing,” he said to me, shortly.\n“Of course it is.”\n“It is a clever thing. That’s just objectively what it is. Works with lysine in the hair, and runs nanotubes the length of each strand. There’s some more complicated bio-interface stuff, to do with the blood vessels in the scalp. When I said that none of this utilized Company IP I was, possibly, bending the truth a little. There’s some Company stuff in there, at the blood exchange. But the core technology, the hair-strand stuff, is all mine. Is all me. It’s all new. And I’m going to be giving it away. Pretty soon, billions will have taken the starter pills. Billions. That’s a big . . . ” He looked about him at the empty seats. “Number,” he concluded, lamely.\n“Hair?” I prompted.\n“I’m genetically eradicating poverty,” he said. And then a gust of boyish enthusiasm filled his sails. “All the stuff we do, and make? It’s all for the rich, and the poor carrying on starving and dying. But this—”\n“Hair . . . ”\n“Food is the key. Food is the pinchpoint, if you’re poor. Hunger is the pinchpoint, and it’s daily, and everything else in your life is oriented around scraping together food so as not to starve. The poor get sick because their water is contaminated, or because their food is inadequate and undernourishment harasses their immune system. The future cannot properly arrive until this latter fact is changed.”\n“So what does the hair—” I asked. “What does. Does it, like, photosynthesize?”\n“Something like that,” he said.\nHis avatar, frozen with his smiling mouth half-open, like a twenty-foot-tall village idiot, lowered over us both.\n“And you—what do you do, then? I mean what does one. You lie in the sun?”\n“The energy you previously got from the food you eat. Well you get that from the sun.” He did a little twirl. “It’s a clever thing,” he said. “Actually the hair less so: that’s easy enough to engineer. Peptide sculptors generating photoreceptive structures in the hair, and spinning conductors down to the roots. The clever stuff is in the way the energy is transferred into the—look I don’t want to get into the details. That’s not important.”\nI looked up at giant 2D Nic’s goofy face. I looked at human-sized 3D Nic’s earnest expression and fidgeting hands. “You don’t need to eat?”\n“No.”\n“But you can?”\n“Of course you can, if you want to. But you don’t need to. Not once I’ve fitted the . . . fitted the . . . and I’m giving that away free.”\nI tried to imagine it. All those supine bodies, laid like paving stones across Nic’s courtyard outside. “Lying all day in the sun?”\n“They don’t have to lie there. They can walk about with their hair out, if they like. But it’s better to stay still, and spread your hair out as widely as possible. At these latitudes, four hours a day does most people.”\n“And what about, say, Reykjavik?”\n“The sunlight’s pretty weak up there,” he said. “You’d be better off in the tropics. But that’s where most of the world’s poor are.”\n“And,” I said. “Vital amines?”\n“Water, more to the point. You still need to drink, obviously. Ideally you’ll drink water with trace metals, flavorsome water. Or gobble a little clean mud from time to time. But vitamins, vitamins, well the tech can synthesize those. Sugars, for the muscles to work. You’d be surprised by how much energy four hours sunbathing with my hair generates. I mean, it’s a lot.”\n“Phew,” I said. The vertiginous ambition of the idea had gone through my soul like a sword. “You’re not kidding.” This was no question.\n“Imagine, in a few years,” he said, “imagine this: all the world’s poor gifted with a technology that frees them from food. Frees them from the need to devote their lives to shit-eating jobs to scrape together the money to eat.”\n“But they still can eat?” I repeated. I don’t know why this stuck in my head the way it did.\n“Of course they can, if they want to. They still have,” very disdainfully inflected tone of voice, “fucking stomachs. But if they don’t eat they don’t starve. Contemplate that sentence and what it means. Don’t you see? All the life that has ever lived on this planet has lived under this precariously balanced axe, all its life. Eat or die. I shall take that axe away. No more famines. No more starvation.”\n“Jesus,” I said. I was going to add: I can see why the Marathi authorities would seize on such an idea as a means of galvanizing political support amongst the mass. I understood the guards, the compound. And from Nic’s point of view too: I could see why he might want this over a position as well-paid Company genemonkey.\n“Why am I here, Nic?” I asked.\n“I need a lawyer,” he said, simply. “Things are going to change for me in a pretty fucking big way. I will need a team I can trust. I’m going to be moving in some pretty high-powered circles. Finding a lawyer I can trust—that’s easier said than done.”\nThis I had not expected. “You’re offering me a job?”\n“If you like. Put it like that, OK.”\n“What—what. To come here? To come and live here? To work in Mumbai?”\n“Sure.”\n“You’re serious?”\n“Why not?\nI didn’t say: Because in three weeks’ time, the army of the Greater Kashmiri Republic is going to come crashing in here with stormtroopers and military flitters and crabtanks and many many bullets, to seize this extraordinary asset that the Marathi junta has somehow acquired. I didn’t say, What, come and work here and get very literally caught in the crossfire? I didn’t say that. Instead I said: “Bring Kate?”\nHe assumed a serious expression, rather too obviously deliberately suppressing a mocking smile. “I’ve always had a soft spot for Kate.”\n“The kids?”\n“Surely. The ex too, if you like.”\n“I can’t bring the kids here. I can’t bring Kate here.”\nHe caught sight of his onscreen image from the corner of his eye. He turned, flapped a hand as if waving at himself, and the screen went blank. Then he turned back and blinked to see me sitting there. “Well,” he said, vaguely. “Think about it.”\nLater, as he escorted me back across that courtyard, so unnervingly full of motionless bodies, he said, “It’s not about my ego, you know.” Oh but it was. It was always about Nic’s ego.\n6\nIt’s just being. It is not striving. Striving, you understand, is the opposite of being. It is restless fighting and earnest labor and testing and retesting and making. Being has nothing of that about it.\nIt’s a striking thing, in retrospect, how slowly things moved at first. I flew back to the US and reported. The Company did not send me again; fearful, I daresay, that I would defect. But neither did they fire me. I picked up my new contracts and got back to work. Kate was deliciously pleased to see me. She’d picked up a new phrase: long time no see! She had learned the first portion of a Mozart sonata, and played it to me. I applauded. “Long time no see,” she said, hugging me.\n“I missed you,” I told her. I tickled her feet.\n“Long see, long time!”\nThings were volatile in Western India. The Federal assembly broke up in acrimonious disharmony. That was hardly news. But I didn’t have much time free for idle speculation.\nThere was a good deal of militia hurly-burly, and then the Southern Indian Alliance launched a proper, fuck-you invasion. The news was full of images of armored troops dodging from doorway to street corner, firing their baton-rifles. Old-style tanks, with those conveyor-belt wheel arrangements, scooting across scrub and drawing comet-tails of dust behind them. Planes spraying Mumbai harbor, passing and repassing at great danger to themselves from ground fire, so as to lay a gelskin over the water thick enough to allow foot soldiers to advance. Then it was all over, and the old government was gone, and a new one installed, and when things settled the news was that Nic had managed to absent himself in all the chaos.\nFootage of people lolling in the sun with their hair fanned and spread behind them. In the first instances it was a case of reporting a new religious cult. The New Ascetics. The Followers. Suneaters. It took a while for the outlets to realize they weren’t dealing with a religion at all; not least because many of the new hair-wearers adopted spiritual or mystical attitudes when interviewed.\nThe rumor was then that he’d reappeared in the southeast of the subcontinent.\nHis followers went about the whole Federation—and went into the further East, and went up into the Stans—disseminating his technology. He himself was posted on a million slots; although never very cannily viralled, which meant either he could not afford to hire the best viral seed people, or else he was too forgetful to do so. Or conceivably he disdained to do so; because the content of these casts were increasingly clumsily preachy: the authenticity and validity of poverty. Wealth had wrecked the world; poverty would save it. The rich would retreat to virtual lands, or hide away in materially moated and gated maison-kingdoms. The poor, freed from the shackles of their hunger, would sweep—peacefully but inevitably as the tide—away the rich and finally inherit the Earth. There was a good deal more in this vein. Sometimes I detected the authentic tang of Nic’s rhetoric in this, but more often than not it was tediously ordinary revolutionary boilerplate, projected on a screen for him to read by whichever government or organization was sheltering him—or, latterly, holding him captive. He was in Africa, or he was in China, or he was far beyond the pale horizon, someplace near the desert sands. God knows I loved him, as a friend loves a true friend, but I could hardly bear to watch any of it.\nI rationed myself, to preserve my sanity. I had him at the top of my feed, and before settling down to my work in the morning I would take half an hour to catch up on all the stories posted that concerned him. At the end of the day, before I left to go home to Kate (“home again home again,” she sang, “splitted alick”) I’d run through anything new that came up.\nOne week he was one oddball news story amongst many. Here his disciples, the natural ascetic skinnies like a drumskin stretched on a coat-rack. Some of his followers were very political, and some were wholly apolitical, interested only in being able to emulate Jesus’s forty-day fast without dying.\nThen another week went by and suddenly he was Big News. My feed could no longer keep up with it. And, another week, and I no longer needed a feed, because suddenly he was all over the majors. Everyone was taking notice. His followers, interviewed now very frequently, seemed less like the flotsam and jetsam of a cruel world and more like a core new class of people. Homo superior. The numbers were growing across southern Asia. Nic sang the superman, and the superman was going to overcome us. He was in Morocco (“north Africa” was the most we knew), but then he was seized by an Equatorial States strike force in a daring operation that left forty dead. He was held against his will, but seemed—in interview—perfectly blithe. “I have a new vision of the world,” said his face. “The world will change.” He said that more and more real people—code for “the poor”—were taking to his treatment. He said it was becoming an unstoppable force.\nWhen word got out that the Equatorial States were trying to ransom him back to the USA for a huge sum of money there were riots. He was broken out of the building in which he was being held—a few minutes of jittery footage of him, his face bloody, being carried bobbing across a sea of humanity, and grinning, and grinning—and disappeared. He later reappeared in Malaysia, an official guest of the Malay Republic.\nI watched the feed when Foss was flown out, and put through all the rigmarole of secrecy, to interview him. It really seemed to me the old Nic was trying to break out of what must have been an increasingly rigid carapace of popular, proletarian expectation. He cracked jokes. He talked about his plans. “This is the future,” he said, in a twinkly-eyed voice. “I’ll tell you. My technology is going to set humanity free from their starvation. I’ll tell you what will happen. The poor will migrate; there will be a mass migration, to the tropics—to those parts of the world where sunlight is plentiful, but where food is hard to come by. Some governments will be overwhelmed by this new exodus, but governments like the, eh,” and he had to glance down at his thumbback screen to remind himself which radical government’s hospitality he was currently enjoying, “People’s Islamic-Democratic Republic of Malaysia, will welcome the coming of a new age of popular empowerment.”\n“What about the rest of the world?” Foss asked.\n“The rich can have the rest of the world. The cold and sunless northern and southern bands. The rich don’t need sunlight. They have money for food. The whole global demographic will change—a new pulsing heart will bring life and culture and prosperity to the tropics. Over time the north and the south will become increasingly irrelevant. The central zone will be everything—a great population of real people, sitting in the sun for four hours a day, using the remaining twenty to create greatness for humanity.”\n7\nBut what can I say? It was a fire, and fire, being a combustion, is always in the process of rendering itself inert. I did consider whether I needed to include, in this account, material about my motivation for betraying my friend. But I think that should be clear from what I have written here.\nThe Company persuaded me. A message was conveyed that I wanted to meet him again. A meeting was arranged. I flatter myself that there were very few human beings on the planet for whom he would have agreed this.\nI had to pretend I had taken up dotsnuff. This involved me in actually practicing snorting the white powder, though I hated it. But the snuff was a necessary part of the seizure strategy. It would identify where I was; and more to the point it was programmed with Nic’s deener-tag (of course the Company had that on file). That would separate us out from all other people in whichever room or space we found ourselves—let’s say, soldiers, guards, captors, terrorists, whomsoever—and in which the snuff would roil about like smoke. When the capture team came crashing in with furious suddenness their guns would know which people to shoot and which not to shoot.\nHe was back in the Indian Federation now: somewhere near Delhi.\nI was flown direct to Delhi International. And we landed at noon. And I was fizzing with nerves.\nFrom the airport I took a taxi to an arranged spot, and there met a man who told me to take a taxi to another spot. At that place I was collected by three other men and put into a large car. It was not a pleasant drive. I was bitter with nerves; my mind rendered frangible by terror. It was insanely hot; migraine weather, forty-five, fifty, and the car seemed to have no air conditioning. We drove past a succession of orchards, the trunks of the trees blipping past my window like a barcode. Then we turned up a road that stretched straight as rail, or as a thermometer line, towards the horizon. And up we raced until it ended before a huge gate. Men with rifles stood about. I could see four dogs, tongues like untucked shirt-tails. And then the gate was opened and we drove inside.\nI was shown to a room, and in it I stayed for several hours. My luggage was taken away.\nI could not sleep. It was too hot to sleep anyway.\nMy luggage was brought back, my tube of dotsnuff still inside. I took this and slipped it inside my trouser pocket.\nI informed my guards of my need to use the restroom—genuinely, for my bladder was fuller, and bothered me more, than my conscience. I was taken to a restroom with a dozen urinals at one wall and half a dozen sinks at another. A crossword-pattern of gaps marked where humidity had removed some of the tiny blue tiles covering the walls. The shiny floor was not as clean as I might have liked. I emptied my bladder into the white porcelain cowl of a urinal, and washed my hands at the sink. Then, like a character in a cheap spy-story book, I peered at myself in the mirror. My eyes saw my eyes. I examined my chin, the jowls shimmery with stubble, the velveteen eyebrows, the rather too large ears. This was the face that Kate saw when she leaned in, saying either “a kiss before bedtime,” or “a bed before kisstime,” and touched my lips with her lips. I was horribly conscious of the flippant rapidity of my heart, the vulgar insistence of blood perked with adrenaline.\nA guard I had not previously encountered, a tall, thin man with a gold-handled pistol tucked into the front of his trousers, came into the lavatory. “The Redeemer will see you now,” he said.\n8\nHad he come straight out with “Why are you here?” or “What do you want?” or anything like that, I might have blurted the truth. I had prepared answers for those questions, of course, but I was, upon seeing him again, miserably nervous. But of course he wasn’t puzzled that I wanted to see him again. He took that as his due. Of course I wanted to see him—who wouldn’t? His face cracked wide with a grin, and he embraced me.\nWe were in a wide, low-ceilinged room; and we were surrounded by gun-carrying young men and women: some pale as I, some sherry- and acorn-colored, some black as liquorish. A screen was on in the corner, but the sound was down. Through a barred-window I could see the sepia plain and, wavery with heat in the distance, the edge-line of the orchards.\n“Redeemer, is it?” I said, my dry throat making the words creak.\n“Can you believe it?” He rolled his eyes upwards, so that he was looking at the ceiling—the direction, had he only known it, of the Company troopers, sweeping in low-orbit with a counter-spin to hover, twenty-miles up on the vertical. “I try to fucking discourage it.”\n“Sure you do,” I said. Then, clutching the tube in my pocket to stop my fingers trembling, I added in a rapid voice: “I’ve taken up snuff, you know.”\nNic looked very somberly at me. “I’m afraid you’ll have to go outside if you want to snort that.”\nFor a moment I thought he was being genuine, and my rapid heartbeat accelerated to popping point. My hands shivered. I was sweating. When he laughed, and beckoned me towards a low-slung settee, I felt the relief as sharply as terror. I sat and tried, by focusing my resolve, to stop the tremble in my calf muscles.\n“You know what I hate?” he said, as if resuming a conversation we had been having just moments before. “I hate that phrase body fascism. You take a fat man, or fat woman, and then you criticize them for being fat. That makes you a body fascist. You know what’s wrong there? It’s the fascism angle. In a fucking world where one third of the population hoards all the fucking food and two thirds starve—in a world where your beloved Company makes billions selling antiobesity technology to people too stupid to understand they can have antiobesity for free by fucking eating less—in that world, where the fat ones steal the food from the thin ones so that the thin ones starve to death. That’s a world where the fascists are the ones who criticize the fatties? Do you see how upside-down that is?”\nI fumbled the tube and sniffed up some powder. The little nanograins, keyed to my metabolism, thrummed into my system. Like, I suppose, fire being used to extinguish an oil well blaze, the extra stimulation had a calming effect.\nThe talcum-fine cloud in that room. I coughed, theatrically, and waved my hand to dissipate the material.\n“So you’re free to go?”\n“I’m not in charge of it,” he said brightly. “Fuck, it’s good to see you again! I’m not in charge. I’m being carried along by it as much as anybody. It’s a tempest, and it’s blowing the whole of humanity like leaves in autumn.”\n“Some of it was Company,” I said. “The ADP to ATP protocols weren’t, legally speaking, yours to give away, you know.”\n“The hair stuff was mine,” he said.\n“I’m only saying.”\n“Sure—but the hair stuff.”\nI thought of the troops, falling through the sky directly above us, their boot-soles coming closer and closer to the tops of our heads.\n“The photovoltaic stuff, and the nanotube lysine fabrication of the conductive channels along the individual strands of hair—that was you. But that’s of no use without the interface to do the ATP.”\nHe shrugged. “You think like a lawyer. I mean, you think science like a lawyer. It’s not that at all. You don’t think there’s a moral imperative, when the famine in the southern African republics is killing, how many thousands a week is it?” Then he brightened. “Fuck it’s good to see you though! If I’d let the Company have this they’d have squeezed every last euro of profit out of it, and millions would have died.” But his heart wasn’t really in this old exchange. “Wait till I’ve shown you round,” he said, as excited as a child, and swept his right hand in an arc, lord-of-the-manor-wise.\nSomewhere outside the room a siren was sounding. Muffled by distance, a warbling miaow. Nic ignored it, although several of his guards perked their heads up. One went out to see what the bother was.\nI felt the agitation building in my viscera. Betrayal is not something I have any natural tolerance for, I think. It is an uncomfortable thing. I fidgeted. The sweat kept running into my eyes.\n“All the old rhythms of life change,” Nic said. “Everything is different now.”\nI felt the urge to scream. I clenched my teeth. The urge passed.\n“Of course Power is scared,” Nic was saying. “Of course Power wants to stop what we’re doing. Wants to stop us liberating people from hunger. Keeping people in fear of starvation has always been the main strategy by which Power has kept people subordinate.”\n“Don’t know if I ever told you,” I said, squeakily, “how much I love your sophomore lectures on politics.”\n“Hey!” he said, either in mock outrage, or in real outrage. I was too far gone to be able to tell the difference.\n“The thing is,” I started to say, and then lots of things happened. The clattering cough of rifle fire started up outside, in the courtyard beyond the walls. There was the realization that the high-pitched noise my brain had been half-hearing for the last minute was a real sound, not just tinnitus, and then almost at once the sudden crescendo or distillation of precisely that noise; a great thumping crash from above, and the appearance, in a welter of plaster and smoke, of an enormous metal beak through the middle of the ceiling. The roof sagged, and the whole room bowed out on its walls. Then the beak snapped open and two, three, four troopers dropped to the floor, spinning round and firing their weapons. All I remember of the next twenty seconds is the explosive stutter-cough and the disco flicker of multiple weapon discharges. And then the stench of gunfire’s aftermath.\nA cosmic finger was running smoothly round and round the lip of a cosmic wineglass.\nI blinked, and blinked, and looked about me. The dust in the air looked like steam. That open metal beak, rammed through the ceiling, had the disconcerting appearance of a weird Avant-art metal chandelier. There were half a dozen troopers; standing in various orientations and positions but with all their guns held like Dalek-eyes. There were a number of sprawling bodies on the floor. I didn’t want to count them, or look too closely at them. And, beside me, on the settee, was an astonished-looking Neocles.\nI moved my mouth to say something to him, and then either I said something that my ears did not register, or else I didn’t say anything.\nHe didn’t look at me. He jerked forward, and then jerked up. Standing. From a pouch in his pocketstrides he pulled out a small Γ-shaped object which, fumbling a little, he fitted into his right hand. The troopers may have been shouting at him, or they may have been standing there perfectly silently, I couldn’t tell you. Granular white clouds of plaster were sifting down.\nNic levelled his pistol, holding his arm straight out. There was a conjuror’s trick with multiple bright red streamers and ribbons being pulled instantly and magically out of his chest, and then he hurtled backwards, over the top of the settee, to land on his spine on the floor. It took a moment for me to understand what had happened. I was a little stunned by the whole sequence of events.\n9\nHe may have been thinking, either in the moment or else as something long pre-planned, about martyrdom. Perhaps the Redeemer is not able to communicate his message in any other way. It’s also possible that, having gone through life protected by the tight-fitting prophylactic of his unassailable ego—and, I suppose, having watched too many rubbishy Thriller and Action-Killer books—that he may have genuinely believed that he could single-handedly shoot down half a dozen troopers, and emerge the hero of the day.\nI honestly do not know.\nWhat’s not moot is the violence that followed his death. It was extraordinary. Riots and demonstrations, calls for International Courts and military interventions. My involvement in the assassination (as it was styled—assassination!) leaked out. Many accused my employers of planning to murder him. As if the Company benefited in any way from Nic dead! As if they wouldn’t have paid billions to recover him alive! At any rate, I was forced to leave my home, to live in a series of hideouts. Of course a Judas is as valuable and holy figure as any other in the sacred drama. But religious people (Kate kneeling beside the bed at night-time, praying to meekling Jesus gent and mild) can be faulted, I think, for failing imaginatively to enter into the mind-set of their Judases. Nobody loved Nic as deeply as I. Or knew him so well. But he was rich, and not one motion of his liberal conscience or his egotistical desire to do good in the world changed that fact, or changed his inability to enter, actually, into the life of the poor. The poor don’t want the rich to save them. Even the rioters in the Indian Federation, even the starving Australians, even they—if only they knew it—don’t want to be carried by a godlike rich man into a new realm. What they want is much simpler. They want not to be poor. It’s at once very straightforward and very complicated. Nic’s hair was, in fact, only a way of making manifest the essence of class relations. In his utopia the poor would actually become, would literally become the vegetation of the Earth. The rich would reinforce their position as the zoology to the poor’s botany. Nothing could be more damaging, because it would bed-in the belief that it is natural and inevitable that the rich graze upon the poor, and that the poor are there to be grazed upon. Without even realizing it Nic was laboring to make the disenfranchised a global irrelevance; to make them grass. I loved him, but he was doing evil. I had no choice.\n10\nLast night, as we lay in bed together in my new, Company-sourced secure flat in I-can’t-say-where (though I’m the one paying the rent) Kate said to me: “I am cut in half like the moon; but like the moon I grow whole again.” I was astonished by this. This really isn’t the sort of thing she says. “What was that, sweet?” I asked her. “What did you say, my love?” But she was asleep, her red lips were pursed, and her breath slipping out and slipping in.\nOriginally published in When It Changed: Science Into Fiction, edited by Geoff Ryman, 2009.\nAdam Roberts is the author of sixteen novels, many short stories and various works of academic criticism. Recent works include The Palgrave History of Science Fiction, 2nd edition and his latest novel, The Real Town Murders. He lives a little way west of London, with his wife and two children."}