{"fingerprint": "YAAy5oJxVRBPIyrIrMB4Y6vtzc4=", "sitename": "Clarkesworld Magazine", "title": "Thing and Sick by Adam Roberts", "author": "Adam Roberts", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/roberts_04_17_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Thing and Sick by Adam Roberts", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9830 words, novelette, REPRINT\n Thing and Sick\n It started with the letter.\n Roy would probably say it started when he solved the Fermi Paradox, when he achieved (his word) clarity. Not clarity, I think: but sick. Sick in the head. He probably wouldn’t disagree. Not with so much professional psychiatric opinion having been brought to bear on the matter. He concedes as much to me, in the many communications he has addressed me from his asylum. He sends various manifestos and communications to the papers too, I understand. In all of them he claims to have finally solved the Fermi Paradox. If he has, then I don’t expect my nightmares to diminish any time soon.\n I do have bad dreams, yes. Intense, visceral nightmares from which I wake sweating and weeping. If Roy is wrong, then perhaps they’ll diminish with time.\n But really it started with the letter.\n I was in Antarctica with Roy Curtius, the two of us hundreds of miles inland, far away from the nearest civilization. It was 1986, and one (weeks-long) evening and one (months-long) south polar night. Our job was to process the raw astronomical data coming in from Proxima and Alpha Centurai. Which is to say: our job was to look for alien life. There had been certain peculiarities in the radioastronomical flow from that portion of the sky, and we were looking into it. Whilst we were out there we were given some other scientific tasks to be keeping ourselves busy with, but it was the SETI business that was the main event. We maintained the equipment, and sifted the data, passing most of it on for more detailed analysis back in the UK. Since in what follows I am going to say a number of disobliging things about him, I’ll concede right here that Roy was some kind of programming genius—this, remember, back in the late ’80s, when “computing” was quite the new thing.\n The base was situated as far as possible from light pollution and radio pollution. There was nowhere on the planet further away than where we were.\n We did the best we could, with 1980s-grade data processing and a kit-built radio dish flown out to the location in a packing crate, and assembled best as two men could assemble anything when it was too cold for us to take off our gloves.\n “The simplest solution to the Fermi thing,” I said once, “would be simply to pick up alien chatter on our clever machines. Where are the aliens? Here they are.”\n “Don’t hold your breath,” he said.\n We spent some hours every day on the project. The rest of the time we ate, drank, lay about, and killed time. We had a VHS player, and copies of Beverly Hills Cop, Ghostbusters, The Neverending Story, and The Karate Kid. We played cards. We read books. I was working my way through Frank Herbert’s Dune trilogy. Roy was reading Immanuel Kant. That fact, right there, tells you all you need to know about the two of us. “I figured eight months isolation was the perfect time really to get to grips with the Kritik der reinen Vernunft,” he would say. “Of course,” he would add, with a little self-deprecating snigger, “I’m not reading it in the original German. My German is good—but not that good.” He used to leave the book lying around: Kant’s Critique of Pure Reason, transl. Meiklejohn. It had a red cover. Pretentious fool.\n “We put too much trust in modern technology,” he said one day. “The solution to the Fermi Paradox? It’s all in here.” And he would stroke the cover of the Critique, as if it were his white cat and he Ernst Stavro Blofeld.\n “Whatever, dude,” I told him.\n Once a week a plane dropped off our supplies. Sometimes the pilot, Diamondo, would land his crate on the ice-runway, maybe even get out to stretch his legs and chat to us. I’ve no idea why he was called “Diamondo,” or what his real name was. He was Peruvian I believe. More often, if the weather was bad, or if D. was in a hurry, he would swoop low and drop our supplies, leaving us to fight through the burly snowstorm and drag the package in. Inside would be necessaries, scientific equipment, copies of relevant journals—paper copies, it was back then, of course—and so on. The drops also contained correspondence. For me that meant: letters from family, friends, and above all from my girlfriend Lezlie.\n Two weeks before all this started I had written to Lezlie, asking her for a paperback copy of Children of Dune. I told her, in what I hope was a witty manner, that I had been disappointed by the slimness of Dune Messiah. I need the big books, I had said, to fill up the time, the long aching time, the (I think I used the phrase) terrible absence-of-Lezlie-thighs-and-tits time that characterized life in the Antarctic. I mention this because, in the weeks that followed, I found myself going back over my letter to her—my memory of it, I mean; I didn’t keep a copy—trying to work out if I had perhaps offended her with a careless choice of words. If she might, for whatever reason, have decided not to write to me this week in protest at my vulgarity, or sexism. Or to register her disapproval by not paying postage to send a fat paperback edition of Dune III to the bottom of the world. Or maybe she had written.\n You’ll see what I mean in a moment.\n Roy never got letters. I always got some: some weeks as many as half a dozen. He: none. “Don’t you have a girlfriend?” I asked him, once. “Or any friends?”\n “Philosophy is my girlfriend,” he replied, looking smugly over the top of his copy of the Critique of Pure Reason. “The solution to the Fermi Paradox is the friend I have yet to meet. Between them, they are all the company I desire.”\n “If you say so, mate,” I replied, thinking inwardly weirdo! and loser and billy-no-mates and other such things. I didn’t say any of that aloud, of course. And each week it would go on: we’d unpack the delivery parcel, and from amongst all the other necessaries and equipment I’d pull out a rubberband-clenched stash of letters, all of which would be for me and none of which were ever for Roy. And he would smile his smarmy smile and look aloof; or sometimes he would peer in a half-hope, as if thinking that maybe this week would be different. Once or twice I saw him writing a letter, with his authentic Waverley fountain pen, shielding his page with his arm when he thought I wanted to nosy into his private affairs—as if I had the slightest interest in fan mail to Professor Huffington Puffington of the University of Kant Studies.\n He used to do a number of bonkers things, Roy: like drawing piano keys onto his left arm, spending ages shading the black ones, and then practicing—or, for all I know, only pretending to practice—the right-hand part of Beethoven sonatas on it. “I requested an actual piano,” he told me. “They said no.” He used to do vocal exercises in the shower, really loud. He kept samples of his snot, testing (he said) whether his nasal mucus was affected by the south polar conditions. Once he inserted a radiognomon relay spike (looked a little like a knitting needle) into the corner of his eye, and squeezed the ball to see what effects it had in his vision “because Newton did it.” He learned a new line of the Aeneid every evening—in Latin, mark you—by reciting it over and over. Amazingly annoying, this last weird hobby, because it was so particularly and obviously pointless. I daresay that’s why he did it.\n I read regular things: SF novels, magazines, even four-day-old newspapers (if the drop parcel happened to contain any), checking the football scores and doing the crosswords. And weekly I would pull out my fistful of letters, and settle down on the common room sofa to read them and write my replies, whilst Roy pursed his brow and worked laboriously through another paragraph of his Kant.\n One week he said. “I’d like a letter.”\n “Get yourself a pen pal,” I suggested.\n We had just been outside, where the swarming snow was as thick as a continuous shower of woodchips and the wind bit through the three layers I wore. We were both back inside now, pulling off icicle bearded gloves and scarfs and stamping our boots. The drop-package was on the floor between us, dripping. We had yet to open it.\n “Can I have one of yours?” he asked.\n “Tell you what,” I said. I was in a good mood, for some reason. “I’ll sell you one. Sell you one of my letters.”\n “How much?”\n “Tenner,” I said. Ten pounds was (I hate to sound like an old codger, but it’s the truth) a lot of money back then.\n “Deal,” he said, without hesitation. He untied his boots, hopped out of them like Puck and sprinted away. When he came back he was holding a genuine ten pound note. “I choose, though,” he said, snatching the thing away as I reached for it.\n “Whatever, man,” I laughed. “Be my guest.”\n He gave me the money. Then, he dragged the parcel, now dripping melted snow, through to the common room and opened it. He rummaged around and brought out the rubberbanded letters: five of them.\n “Are you sure none of them are addressed to you?” I said, settling myself on the sofa and examining my banknote with pride. “Maybe you don’t need to buy one of my letters—maybe you got one of your own?”\n He shook his head, looked quickly through the five envelopes on offer, selected one and handed me the remainder of the parcel. “No.”\n “Pleasure doing business with you,” I told him. Off he went to his bedroom to read the letter he had bought.\n I thought nothing more about it. The four letters were from: my Mum, my brother, a guy in Leicester with whom I was playing a tediously drawn-out game of postal chess, and the manager of my local branch of Lloyd’s Bank in Reading, writing to inform me that my account was in credit. Since being in Antarctica meant I could never spend anything, and since my researcher’s stipend was still going in monthly, this was unnecessary. I’m guessing it was by way of a publicity exercise. It’s not that I was famous, of course; even famous-for-Reading. But it doubtless looked good on some report somewhere: we look after our customers, even when they’re at the bottom of the world! I made myself a coffee. Then I spent an hour at a computer terminal, checking data. When Roy came back through he looked smug, but I didn’t begrudge him that. After all, I had made ten pounds—and ten pounds is ten pounds.\n For the rest of the day we worked, and then I fixed up some pasta and Bolognese sauce in the little kitchen. As we ate I asked him: “so who was the letter from?”\n “What do you mean?” Suspicious voice.\n “The letter you bought from me. Who was it from? Was it Lezlie?”\n A self-satisfied grin. “No comment.”\n “Say what?”\n “It’s my letter. I bought it. And I’m entitled to privacy.”\n “Suit yourself,” I said. “I was only asking.” He was right, I suppose; he bought it, it was his. Still, his manner rubbed me up the wrong way. We ate in silence for a bit, but I’m afraid I couldn’t let it go. “I was only asking: who was it from? Is it Lezlie? I won’t pry into what she actually wrote.” Even as I said this, I thought to myself: pry? How could I pry—the words were written to be read by me! “You know,” I added, thinking to add pressure. “I could just write to her, ask her what she wrote. I could find out that way.”\n “No comment,” he repeated, pulling his shoulders round as he sat. I took my bowl to the sink and washed it up, properly annoyed, but there was no point in saying anything else. Instead I went through and put Romancing the Stone on the telly, because I knew it was the VHS Roy hated the most. He smiled, and retreated to his room with his philosophy book.\n The next morning I discovered, to my annoyance, that the business with the letter was still preying on my mind. I told myself: get over it. It was done. But some part of me refused to get over it. At breakfast Roy read another page of his Kant, and I saw that he was using the letter as a bookmark. At one point he put the book down and stood up to go to the loo, but then a sly expression crept over his usually ingenuous face, and he picked the book up and took it with him.\n It had been a blizzardy few days and the dish needed checking over. Roy tried to wriggle out of this chore: “you’re more the hardware guy,” he said, in a wheedling tone. “I’m more conceptual—the ideas and the phil-os-o-phay.”\n “Don’t give me that crap. We’re both hands-on—the folk in Adelaide, and back in Britain, are the actual ideas people.” I was cross. “Philosophy my arse.” At any rate, he suited-up, rolled his scarf around his lower face, and snapped on his goggles, zipped up his overcoat. We both pulled out brooms and stumped through light snowfall to the dish. It took us half an hour to clear the structure of snow, and check its motors hadn’t frozen solid, and that its bearings were ice-free. Our shadows flickered across the landscape like pennants in the wind.\n The sun loitered near the horizon, a cricket-ball frozen in flight.\n That afternoon I did a stint testing the terminals. With the sun still up, it was a noisy picture; although it was possible to pick up this and that. At first I thought there was something, but when I looked at it I discovered it was radio chatter from a Spanish expedition on its way to the Vinson Massif. I found my mind wandering. Who was the letter from?\n The following day I eased my irritation by writing to Lezlie. Hey, you know Roy? He’s a sad bastard, a ringer for one of actors in “Revenge of the Nerds.” Anyway he asked for a letter and I sold him one. Now he won’t tell me whose letter it is. Did you write to me last week? What did you say? Just give me the gist, lover-girl. But as soon as I’d written this I scrunched it up and threw it in the bin. Lez would surely not respond well to such a message. In effect I was saying: “hey you know that love-letter you poured your heart and soul into? I sold it to a nerd without even reading it! That’s how much I value your emotions!”\n Chewed the soft-blue plastic insert at the end of my Bic for a while.\n I tried again: Hi lover! Did you write last week? There was a snafu with the package and some stuff got lost. I looked over the lie. It didn’t ring true. I scrunched this one up too. Then I sat in the chair trying, and failing, to think of how to put things. The two balls of scrunched paper in the waste-bin began, creakingly, to unscrunch.\n Dear Lez. Did you write last week? I’m afraid I lost a letter, klutz that I am! That was closer to the truth. But then I thought: what if she had written me a dear-john letter? Or a let’s-get-married? Or a-close-family-member-has-died? How embarrassing to write back a jaunty “please repeat your message!” note. What if she hadn’t written at all? What if it were somebody else?\n This latter thought clawed at my mind for a while. What if some important information, perhaps from my academic supervisor at Reading, Prof Addlestone, had been in the letter? Privacy was one thing, but surely Roy didn’t have the right to withhold such info?\n I stomped down the corridor and knocked at Roy’s room. He made me wait for a long time before opening the door just enough to reveal his carbuncular face, smirking up at me. “What?”\n “I’ve changed my mind,” I said. “I want my letter back.”\n “No dice, doofus,” he replied. “I paid for it. It’s mine now.”\n “Look, I’ll buy it back, alright? I’ll give you your ten pounds. I’ve got it right here.”\n When he smiled, he showed the extent to which his upper set of teeth didn’t fit neatly over his lower set. “It’s not for sale,” he said.\n “Don’t be a pain, Roy,” I said. “I’m asking nicely.”\n “And I’m, nicely, declining.”\n “What—you want more than a tenner? You can go fish for that, my friend.”\n “It’s not for sale,” he repeated.\n “Is it a scam,” I said, my temper wobbling badly. “Is the idea you hold out until I offer—what, twenty quid? Is that it?”\n “No. That’s not it. It’s mine. I do not choose to sell it.”\n “Just tell me what’s in the letter,” I pleaded. “I’ll give your money back and you can keep the damn thing, just tell me who it’s from and what it says.” Even as I made this offer it occurred to me that Roy, with his twisted sense of humor, might simply lie to me. So I added: “show it to me. Just show me the letter. You don’t have to give it up, keep it for all I care, only—”\n “No deal,” said Roy. Then he wrung his speccy face into a parody of a concerned expression. “You’re embarrassing yourself, Anthony.” And he shut his door.\n I went through to the common room, fuming. For a while I toyed with the idea of simply grabbing the letter back: I was bigger than Roy, and doubtless had been involved in more actual fist-flying, body-grappling fights than he. It wouldn’t have been hard. But instead of that I had a beer, and lay on the sofa, and tried to get a grip. We had to live together, he and I, in unusually confined circumstances, and for a very lengthy period of time. In less than a week the sun would vanish, and the proper observing would begin. Say we chanced upon alien communication (I told myself)—wouldn’t that be something? Might there be a Nobel Prize, or something equally prestigious, in it? I couldn’t put all that at risk, even for the satisfaction of punching him on the nose.\n Maybe, I told myself, Roy would thaw out a little in a day or two. You catch more flies with honey than vinegar, after all. Maybe I could coax the letter out of him.\n The week wore itself out. I went through a phase of intense irritation with Roy for his (what seemed to me) immensely petty and immature attitude with regard to my letter. Then I went through a phase when I told myself it didn’t bother me. I did consider returning his tenner to him, so as to retain the high moral ground. But then I thought: ten pound is ten pound.\n The week ended, and Diamondo overflew and tossed the supply package out to bounce along the snow. This annoyed me, because I had finally managed to write a letter to Lezlie that explained the situation without making it sound like I valued her communiques so little I’d gladly sold it off to weirdo Roy. But I couldn’t “post” the letter unless the plane landed and took it on board, so I had to hang onto it. I couldn’t even be sure, I reminded myself, that the letter Roy had bought from me had been from her.\n On the fifth of July the sun set for the last time until August. The thing people don’t understand about Antarctic night is that it’s not the same level of ink-black all the way through. For the first couple of weeks, the sky lightens twice a day, pretty much bright enough to walk around without a torch—the same dawn and dusk paling of the sky that precedes sunrise and follows sunset, only without actual dawn and dusk. Still, you can sense the sun is just there, on the other side of the horizon, and it’s not too bad. As the weeks go on this gets briefer and darker, and then you do have a month or so when it’s basically coal-colored skies and darkness invisible the whole time.\n Diamondo landed his plane, and tossed out the supply package, but didn’t linger; and by the time I’d put on the minimum of outdoor clothing and grabbed a torch and got through the door he was taking off again—so, once again, I didn’t get to send my letter to Lez.\n That was the last time I saw that aircraft.\n There were two letters in this week’s batch: one from my old Grammar School headmaster, saying that the school had hosted a whole assembly on the “exciting and important” work I was doing; and the other from my Professor at Reading. This was nothing but a note, and read in its entirety: “Dear A. I often think of Sartre’s words. Imagination is not an empirical or superadded power of consciousness, it is the whole of consciousness as it realizes its freedom. Where is freer than the very bottom of the world? Nil desperandum! Yours, A.” This, though slightly gnomic, was not out of character for Prof. Addlestone, who had worked on SETI for so long it had made his brain a little funny. No letter from Lez, which worried me. But, after all, she didn’t write every week. I re-read the Professor’s note several times. Did it read like a PS, a scribbled afterthought? Did it perhaps mean that the letter Roy bought had been from Addlestone? Maybe. Maybe not.\n We got on with our work, and I tried to put the whole letter business behind me. Roy did not help, as far as this went. He was acting stranger and stranger; simpering at me, and when I queried his expression (“what? What is it?”) scurrying away—or scowling and saying, “nothing, nothing, only . . . ” and refusing to elaborate.\n The next thing was: he moved one of the computer terminals into his room. These were 1980s terminals; not the modern-day computers the size and weight of a copy of Marie-Claire; so it was no mean feat getting the thing in there. He even cut a mousehole-like n in the bottom of his door, to enable the main cable to come out into the hall and through into the monitor room.\n “What are you doing in there?” I challenged him. “That’s not standard policy. Did you clear this with home?”\n “I’m working on something,” he told me. “I’m close to a breakthrough. SETI, my friend. Solving Fermi’s paradox! You should consider yourself lucky to be here. You’ll get a footnote in history. Only a footnote, I know: but it’s more than most people get.”\n I ignored this. “I still don’t see why do you need to squirrel yourself away in your room?”\n “Privacy,” he said. “Is very important to me.”\n One day he went out on the ice to (he told me) check the meteorological datapoints. It seemed like an odd thing—he’d shown precious little interest in them up to that point—but I was glad he was out of the base, if only for half an hour. As soon as I saw his torch-beam go, wobbling its oval of brightness away over the ice, I hurried to his room. I wasn’t doing anything wrong, I told myself. I was just checking the identity of the letter’s author. Maybe have a quick glance at its contents. I wouldn’t steal it back (although, I told myself, I could. It was my letter after all. Roy was being an idiot about the whole thing). But once my itch was scratched, curiosity-wise, then everything would get easier about the base. I could wait out the remainder of my stint with equanimity. He need never even know I’d been poking around.\n No dice. Roy had fitted a padlock to his door. I rattled this uselessly; I could have smashed it, but then Roy would know what I’d been up to. I retreated to the common room, disproportionately angry. What was he doing, in there, with a whole computer terminal and my letter?\n I had enough self-knowledge to step back from the situation, at least some of the time. He was doing it in order to wind me up. That was the only reason he was doing it. The letter was nothing—none of my letters, if I looked back, contained any actual, substantive content. They were just pleasant chatter, people I knew touching base with me. The letter Roy bought must be the same. He bought it not to have the letter, but in order to set me on edge, to rile me. And by getting riled I was gifting him the victory. The way to play this whole situation was to be perfectly indifferent.\n However much I tried this, though, I kept falling back. It was the not knowing!\n I tried once more, during the week. “Look, Roy,” I said, smiling. “This letter thing is no big deal, you know? None of my letters have any really significant stuff in them.”\n He looked at me, in a “that’s all you know” sort of way. But this was, I decided, just winding me up.\n “I tell you what I think,” I said. “You can, you know, nod, or not-nod, depending on whether I’m right. I think the letter you bought was from my girlfriend. Yeah?”\n “No comment,” said Roy, primly. “One way or the other.”\n “If so, it was probably full of inane chatter, yeah? Fine—keep it! With my blessing!”\n “In point of fact,” he corrected me, holding up his right forefinger, “I do not need your blessing. The transaction was finalized with the fiduciary transfer. Contract law is very clear on this point.”\n I lost my temper a little at this point. “You know how sad you are, keeping a woman’s letter to another man for your own weird little sexual buzz? That’s—sad. Is what it is. I don’t think you realize how sad that is.”\n “Oh Anthony, Anthony,” he said, shaking his head and smirking in that insufferable way he had. “If only you knew!”\n I swore. “Suit yourself,” I said.\n Then the airstrip lights failed. I assumed this was an accident, although the fact that every one of them failed at the same time was strange. Diamondo came through on the radio: “fellows!” he declared, through his thick accent. “I cannot land if there are no lights to land!”\n “Don’t know what’s happened to them,” I replied. “Some manner of malfunction.”\n “Obviously that!” came Diamondo’s voice. “Can you fix? Over.”\n Roy suited up and went outside; he was back in minutes. “I can’t do anything in the dark, with a torch, in a hurry,” he complained. “Tell him—no. Tell him to toss the package out and we’ll fix the lights for next time.”\n When I relayed this message, Diamondo said “breakables! There are breakables in the package! I cannot toss! Over.” Then, contradicting his last uttered word, he went on. “I can take out the breakables and toss the rest. Wait—wait.”\n I could hear the scrapy sound of the plane in the sky outside. Then, over the radio: “is in chute.”\n “Wait,” I said. “Where are you dropping it? If there’s no lights—I mean, I don’t want to go searching over a wide area in the dark with . . . ” There was a terrific crash right overhead, as something smashed into our roof.\n “You idiot!” I called. “You could have broken our roof!”\n Static. And, through the walls, the sound of the plane’s engines diminishing. Roy looked and me, and I at him. “I think it rolled off,” Roy said. “You go out and get it.”\n “You’re already suited!”\n “I went out last time. It’s your turn now. Fair’s fair.”\n It was on the edge of my tongue to retort: stealing my letter—is that fair? But that would have done no good; and anyway I was hoping that there would be a new letter from Lezlie in the satchel, and if so I certainly wanted to get to that before Roy did. So I pulled on overclothes and took a torch and went outside.\n It was extraordinarily cold—sinus-freezingly cold. The air was still. The sound of Diamondo’s plane, already very faint, diminished and diminished until it vanished altogether. Now the only sound was the whir of the generator, gently churning to itself with its restless motion. I searched around in the dark outside the main building for ten minutes or so, and spent another five trying to see into the gap between the main prefab and the annex, which was half-full of snow. But I couldn’t find it.\n When I went back to the main door it was locked. This was unprecedented. For a while I banged on the door, and yelled, and my heart began blackly to suspect that Roy was playing some kind of prank on me—or worse. I was just about to give up and make my way round to try the side entrance when Roy’s gurning face appeared in the door’s porthole, with the graph-paper pattern woven into the glass. He opened it. “What the hell were you playing at?” I demanded, crossly. “Why did you lock the door?”\n “It occurred to me that the lights might have been sabotaged,” he said, not looking me in the eye. “I thought: security is valor’s better part. Obviously I was going to let you back in, once I was sure it was you.”\n “Have you had a nervous breakdown?” I yelled. “Are you high? Who else could possibly be out there? We’re three hundred miles from the nearest human settlement. Did you think it was a ghost?”\n “Calm down,” Roy advised, grinning his simpering grin and still not looking me in the eye. “Did you get the package?”\n I sat down with a thump. “Couldn’t find it,” I said, pulling off my overboots. “It may still be on the roof. Seriously, though, man! Locking the door?”\n “We need to retrieve it,” said Roy. “It has my medication in it. My supplies are running low.”\n This was the first I had heard of any medication. “Seriously? They posted you down here, even though you have medical problems?”\n “Just some insomnia problems. And some allergic reaction problems. But I need my sleeping pills and my antihistamines.”\n “You’re kidding,” I said. “What is there to be allergic to, down here?”\n He gave me a pointed look. But then he said: “come and have a drink. I’ve got some whisky.”\n Now, I knew the base was not supplied with whisky. Beer was the most they allowed us. I should, perhaps, have been suspicious of Roy’s abrupt hospitality, doubly so since I knew he hardly ever drank. But I was cold, and cross, and a whisky—actually—sounded like a bloody good idea. “How have you got any of that?”\n “I brought it with me. My old tutor at Cambridge gave it to me. Break it out when you’ve solved the SETI problem, he said. He never doubted me, you see. And solve it, I have.”\n And then a second thought occurred to me. It came to me like a flash. I could get Roy drunk. Surely then he would be more amenable to telling me what was in the letter he’d snaffled from me. I couldn’t think that I’d ever seen him drunk; but my judgment was that he would hold his liquor badly. He’d be a splurger. OK, I thought: butter him up, some, and get some booze in him.\n “I’ll have a dram,” I told him. Then: “kind of you to offer. Thanks. I didn’t mean to . . . you know. Yell at you.”\n He ignored this overture. “You didn’t go to Cambridge, I think?” he asked, as we went through to the common room. “Reading University, isn’t it?”\n “Reading born and bred,” I replied, absently. I half-leaned, half-sat on one of the heaters to get warmth back into my marrow whilst Roy went off to his room to get the whisky. He was gone a while. Finally he came back with a bottle of Loch Lomond in one hand and a bottle of beer in the other. He handed me the former.\n I retrieved two tumblers from the cupboard, but Roy said: “I’ll not have the whisky, thank you anyway. I don’t like the taste.”\n This was about par, I thought, for the weirdo that he was—bringing a bottle of scotch all the way to the end of the world, only not even to drink it. On the other hand the seal was broken, and about an inch was missing, so perhaps he had tried a taster and so discovered his animadversion. I honestly didn’t care. I poured three fingers, and settled myself in one of the chairs.\n “Cheers!” I said, raising a glass.\n “Good health,” he returned, propping his bum on the arm of the sofa.\n “So,” I said, smacking my lips. “The fact that we’re drinking this means you’ve solved the Fermi paradox?”\n “We’re not drinking it,” he said, with a little snorty laugh of self-satisfaction. “You are.”\n “You’re such a pedant, Roy,” I told him.\n “Take that as a compliment,” he said, smirking, and making odd little snorty-sniffy noises with his nostrils.\n “So? Does the fact that I’m drinking this mean you’ve solved it?”\n “The answer to your question is: yes.”\n “Really?”\n “Absolutely.”\n I took another sip. “Congratulations!”\n “Thank you.”\n “And?”\n He peered blankly at me. “What?”\n “And? In the sense of: what’s your solution?”\n “Oh. The Fermi Paradox.” He sounded almost bored. “Well, I’ll tell you if you like.” He seemed to ponder this. “Yeah,” he added. “Why not? It’s Kant.”\n “Of course it is,” I said, laughing. “You complete nutter.”\n He looked hurt at this. “What do you mean?”\n “I mean—the best part of a year of our lives, millions of pounds sunk into this base, probably billions spent worldwide on SETI, and all we needed to do was open a seventeenth-century book of philosophy!”\n “Eighteenth-century,” he corrected me. “And the kit, here, certainly has its uses.”\n “Glad to hear it! But—Kant? Really?”\n Roy took the smallest sip from his beer bottle, and then rubbed his own chin with his thumb. “Hard to summarize,” he said. “Start here: how do we know there’s anything out there?”\n “What—out in space?”\n “No: outside our own brains. Sense data, yes? Eyes, ears, nerve-endings. We see things, and think we’re seeing things out there. We hear things, likewise. And so on. But maybe all that is a lie. Maybe we’re hallucinating. Dreaming. How can we be sure there’s anything really there?”\n “Isn’t this I think therefore I am?”\n “The cogito, yes,” said Roy, with that uniquely irritating prissy inflection he used when he wanted to convey his own intellectual superiority. “Though Kant didn’t have much time for Descartes, actually. He says I think therefore I am is an empty statement. We never just think, after all. We always think about something.”\n “You’re losing me, Roy,” I said, draining my whisky, and reaching for the bottle. Roy’s eyes flashed, and I stopped. “Do you mind if I have another?”\n “No, no,” he urged me, bobbing forward and back in an oddly bird-like way. “Go right ahead.”\n “So,” I said. “You’re saying: we can’t be sure if the cosmos is a kind of hallucination. Maybe I’m a brain in a vat. So what? I’ve got to act as if the universe is real, or,” I directed a quick look at Roy, “they’d lock me in the loony bin. So? Does this hallucination also include ET, or not?”\n “Quite right. Well, Kant says: there is a real world—he calls it the ding-an-sich, the thing as it really is. There is such a reality. But our only access to that real world is through our perceptions, our senses and the way our thoughts are structured. So, says Kant, some of the things we assume are part of the world out there are actually part of the structure of our consciousness.”\n “Such as?”\n “Quite basic things. Time and space. Causality.”\n “Wait, Kant is saying that time, space, and causality aren’t ‘really’ out there? They’re just part of our minds?”\n Roy nodded. “It’s like if we always wore pink-tinted contact lenses. Like we’d always worn them, ever since birth. Everything we saw would have a pink tint. We might very well assume the world was just—you know, pink. But it wouldn’t be the world that was pink, it would be our perception of the world.”\n “Pink,” I repeated, and took another slug. I was starting to feel drowsy.\n “We’re all like that, all the time, except that instead of pink contact lenses on our eyes, we’re wearing space-and-time contacts on our minds. Causality contacts.”\n “Space and time are the way the universe is. Just is.”\n “That’s not what Kant says. He says: we don’t really know the way the universe just is. All we know is how our perceptions and thoughts structure our understanding.”\n “Wait,” I said. “Kant says that cause and effect are just in our heads?”\n “That’s right”\n “That’s nonsense,” I said. “If space and time and causality are just inside my head, then what’s my head in? It takes up space, my brain. It takes time to think these thoughts.”\n “There’s something out there,” Roy agreed. “But we don’t know what it is. Here’s a thought-experiment, Kant’s thought-experiment. You can imagine an object in space, can’t you?”\n I grunted.\n “OK,” said Roy. “And you can imagine the object being taken away. Yes? Then you have empty space. But you can’t imagine space and time being taken away. You can’t imagine no space, no time.”\n I grunted again.\n “That shows that space, time, causality, and some other things—they’re part of the way the mind perceives. There’s no getting behind them. Is the ding-an-sich itself structured according to that logic? We cannot know. Maybe, maybe not.”\n “Ding,” I said, my eyelid slipping down my eyeballs, “like a microwave oven?”\n “We’re looking for aliens with visual telescopes and radio telescopes,” said Roy, standing up and putting his beer bottle down. “But whatever tools we use, we’re looking for aliens in space and time, aliens that understand causality and number. But maybe those things are not alien. Those things are the way our minds are built. And that means we’re looking in the wrong place. We should not be looking in space, or time. We should be looking in the ding-an-sich.”\n “Sick,” I said, My eyes were shut now. I didn’t seem to be able to open them. Such muscular operation was beyond my volitional control. “I feel a bit sick, actually.”\n “Ding,” I heard him say, at the other end of a very long corridor. “You’re done. Let’s open the microwave door, now, shall we?”\n I suppose I was asleep. I tried to shift position in bed, but my arms were numb. Sometimes you lie on an arm and it goes dead. But this was both my arms. They were up over my head. A scraping sound. Distantly. I tried to pull my arms down but they were already down. This is the chance, somebody was saying, or muttering, or I don’t know. Perhaps I was imagining it. We’ve never had this chance before. Because although human consciousness is structured by the Kantian categories of apperception, there’s nothing to say that computer perception needs to suffer from the same limitations. It’s all a question of programming! A program to sift the Centauri data so as to get behind the limitations of consciousness.\n I was moving. Everything was dark, dark, dark. My arms were trailing behind me, I thought; and something was pulling my legs, I thought; and I was sliding along on my back. Was that right? Could that be right?\n We look out from our planet and see a universe of space, and time, of substance and causality, of plurality and totality, of possibility and probability—and we forget that what we’re actually seeing are the ways our minds structure the ding-an-such according to the categories of space, and time, of substance and causality, of plurality and totality, of possibility and probability. We look out and we see no aliens, and are surprised. But the real surprise would be to see aliens in such a vista, because that would mean the aliens are in our structures of thought. Sure there are aliens. Of course there are! But they don’t live in our minds. They live in the ding-an-sich.\n The motion stopped, but I was still too sluggish to move, or speak, or even open my eyes. The next thing I knew, somebody was kissing me on the lips. Goodbye, was a word, and it floated around. Then nothing.\n O dark, dark, dark, they all go into the—\n Or.\n Or something. It came upon me slowly. It, as it were, crept up on me. I couldn’t as yet put a name to it. Let me think through the necessary and contingent possibilities, I thought to myself. It could have been a letter from my Mum, in which case it was full of family trivia and Roy’s just yanking my chain for the hell of it. He’s certainly capable of that. The thing, whatever it was, was closer now, or larger somehow, or in some sense more present, although I still couldn’t put a name to it. It could have been a letter from a friend, or from Leicester Lenny, but if so it would only say Q-B4 ch! or Kn-R7 or something, and that could mean nothing at all to Roy. Or it could have been a letter from Professor Addlestone of Reading University, blathering on about something. Or it could have been, the thing was all around me now, or all within me, or otherwise pressing very imminently upon me. Or it could have been from Lezlie. But then, what? It was full of the usual blandishments? In which case Roy’s hoarding of it is creepy but, in the larger scheme of things, unimportant. That’s not what I’m afraid of though, is it? I’m afraid the letter says: I’m leaving you, I’ve found someone else. But but but, if it is, then I’ll find out eventually—won’t I. I just need to be patient. I’ll find out in time. Assuming I have time—\n Cold. That was the thing.\n That was what had crept up on me.\n I sat up. I was outside, in the darkness, in my indoor clothes. Scalded with the cold. My whole body shook with a Parkinsonian tremor. I angled my head back and the stars were all there, the Southern Fish, the Centaur and the Dove; the Southern Cross itself; Orion and Hydra low in the sky; Scorpion and Sagittarius high up. Hydra and Pegasus. I breathed in fire and burned my throat and lungs. It was cold enough to shear metal. It was cold enough to freeze petrol.\n I got to my feet. My hands felt as though they had been dipped in acid, and then that sensation stopped and I was more scared than before. There was nothing at the end of my arms at all. I tried rubbing my hands together, but the leprous lack of sensation and the darkness and my general sluggishness meant I could not coordinate the action. My hands bounced numbly off one another. I became terrified of the idea that I perhaps knocked one or more fingers clean off. It looks ridiculous as I write it down, but there, in the dark, in the cold, the thought of it gripped my soul horribly.\n I had to get inside, to get warm. I had to get back to the base. I was shuddering so hard I was scared I might actually lose balance with the shivering and fall down—in which case I might not be able to get back up again. Ghastly darkness all about. Cold beyond the power of words to express.\n I turned about, and about again. Starlight in the faintest of lights. I could see my breath coming out only because of the vast ostrich-feature-shaped blot that twisted in my field of vision, blocking out the stars. I needed to pick a direction and go. But I couldn’t see any lights to orient me. What if I stumbled off in the wrong direction? I could easily stagger off into the wilderness, miss the base altogether. I’d be dead in minutes.\n I addressed myself: take hold of yourself. You were dragged here—Roy dragged you here. Runty Roy; he couldn’t have removed me very far from the base. Presumably he figured I wouldn’t wake up; that I’d just die there in the dark.\n “OK,” I said, and took another breath—knives going down my throat. I had to move. I started off, and stumbled over the black ground through the black air. I began to fall forward—my thigh muscles were cramping—and picked up my pace to stop myself pitching onto my face. My inner ear still told me I was falling, so I ran faster. Soon I was sprinting. It’s possible the fluids in my inner ear had frozen, or glued-up with the cold, I don’t know. It felt as if I were falling, but my feet were still pounding over the ice, invisible below me. I felt like a diver, tumbling from the top board.\n And then I saw the sea—I was at the coast. Obviously I wasn’t at the coast because that was hundreds of miles from the base. But there it was, visible. There was a settlement on the shore, a mile below me, with yellow lights throwing shimmery ovals over the water. There was a ship, lit up like a Christmas decoration, balanced very precisely on top of its own lit reflection. I must have been ten degrees of latitude, or more, further away from the pole, enough to lift the moon up over the horizon. The texture of the sea was a million burrin-marks of white light on a million wavelets, like pewter. There was no doubting what I was seeing. My whole body trembled with pain, with the cold, and I said to myself I’m dying, and I’m hallucinating because I’m dying. I must have run in the wrong direction. I felt as if I’d been running all my life, all my ancestors’ lives combined.\n There was a weird inward flip, or lurch, or clonic jerk, or something folding over something else. I was conscious of thinking: I’ve run the wrong way. I’ve missed the base.\n And there was the base. Now that I was there, I could see that Roy had covered the common room window on the inside with something—cloth, cardboard—to make a blackout screen. He had not wanted me to see the light and follow it as a beacon. Now that I was there, I could just make out the faint line of illumination around the edges. I couldn’t feel my hands, or my feet, and my face was covered with a pinching, scratchy mask—snot, tears, frost, whatever, frozen by the impossible cold to a hard crust.\n I slumped against the wall, and the fabric of my shirt was so stiffened it snapped. It ripped clean away when I got up.\n The door. I had to get to the door—that was when I saw . . . ” I was going to say when I saw them but the plural doesn’t really describe the circumstance. Not that there was only one, either. It is very hard to put into words. There was the door, in front of me, and just enough starlight to shine a faint glint off the metal handle. I could not use my hands, so I leaned on the handle with my elbow, but of course it did not give way. Locked, of course locked. And of course Roy would not be opening for me this time. Then I saw—what I saw. Data experiences of a radically new kind. Raw tissues of flesh, darkness visible, a kind of fog (no: fog is the wrong word). A pillar of fire by night, except that “it” did not burn, or gleam, or shine. “It” is the wrong word for it. “It” felt, or looked, like a great tumbling of scree down an endless slope. Or rubble gathering at the bottom and falling up the mountain. Forwards, backwards.\n It was the most terrifying thing I ever saw.\n There was a hint of—I’m going to say, claws, jaws, a clamping something. A maw. Not a tentacle, nothing so defined. Nor was it a darkness. It made a low, thrumming chiming noise, like a muffled bell sounding underground, ding-ding, ding-ding. But this was not a sound-wave sort of sound. This was not a propagating expanding sphere of agitated air particles. It was a pulse in the mind. It was a shudder of the soul.\n I could not get inside the base, and I was going to die. I felt the horrid cold in the very core of my being. Then “it,” or “they,” or the boojummy whatever the hell (I choose my words carefully, here) it was, expanded. Or undid whatever process of congealing that brought it—I don’t know.\n Where I stood experienced a second as-it-were convulsive, almost muscular contraction. Everything folded over, and flipped back again. “It,” or “they” were not here any longer. In fact they had been here eons ago, or were not yet here at all.\n I was standing inside the common room.\n Do not demand to know how I passed beyond the locked door. I could not tell you.\n The warmth of the air burned my throat. I could no longer stay standing. I half slumped, half fell sideways, and my arm banged against one of the heaters—it felt like molten metal, and I yelled. I rolled off it and lay on the floor, and breathed and breathed.\n I may have passed out. I have no idea how I got inside. I was probably only out for a few moments, because the next thing I knew was that my hands were in agony. Absolute agony! It felt like the gomjabbar, like they had both been stuffed into a tub of boiling water. Looking back I can now say what it was: it was sensation returning to my frostbitten flesh. But by God I’ve never felt such pain. I screamed and screamed like the Spanish Inquisition had gone to work on me. I writhed, and wept like a baby.\n Somehow I dragged myself into a sitting posture, with my back against the wall and my legs straight out on the floor. Roy was standing in the common room doorway. In his right hand he was holding what I assumed was a gun, although I later realized it was a flare pistol.\n “You murdering bastard,” I said, “have you come to finish the job? You going to shoot me down like a dog?” Or that’s what I tried to say. What came out was: “yrchyrchorchorchorch.” God, my throat was shredded.\n “The thing-in-itself,” he said. There was a weird bend in his voice. I blinked away the melting icicles from my eyelashes and saw he was crying. “The thing-as-such. The thing per se. I have experienced it unmediated.” His face was wet. Tears slippy-sliding down, and dripping like snot from his jowls. I’d never seen him like that before.\n “What,” I croaked, “did you put in my whisky?” Oh God, the pain in my hands! And now my feet were starting to rage and burn too. Oh, it was ghastly.\n He stopped crying, and wiped his face in the crook of his left arm. “I’m sorry,” he said. Even at this juncture he was not able to look me in the eye. He lifted his right hand slowly, holding the flare pistol, until he was holding it across his chest, like James Bond in the posters.\n I was weeping—not because I was scared of dying, but just because my hands and feet hurt with such sharp and focused intensity.\n Roy took a breath, lifted the flare pistol to his own head, and pulled the trigger. There was a crunching bang, and Roy flopped to the ground. The common room was filled with fluorescent red-orange light and an extraordinarily loud hissing sound. For a moment we were in a luridly lit stage-set of Hades.\n What had happened was this: the tip and fuse of the flare projectile had lodged itself in Roy’s skull, and had ejected the illumination section and its little asbestos parachute at the ceiling, where it snagged against the polystyrene tiles and burned until it was all burned out.\n I sat in that ferociously red-lit room, with molten chunks of polystyrene dripping onto the carpet. Then the shell itself burned free and fell to the ground, where it fizzled out.\n Roy was not dead. Nor was I, amazingly. It took me a while, and an effort, and the whole way along I was sobbing and begging the cosmos to take the pain away; but I got to the radio, and called for help. They sent an air ambulance, which laid a pattern of flares on the unlit runway during their first flyby and landed alongside them on their second. It took four hours, but they got to us, and we did not die in the interval.\n I crawled back to Roy, unconscious on the floor, and pulled the shell-tip from the side of his head. There was no blood, although the dent was very noticeable—the skin and hair lining the new thumb-sized cavity all the way in. There was little I could do, beyond put him in the recovery position.\n Then I clambered painfully on the sofa, my hands and feet hurting a little less. Then, surprisingly enough, I fell asleep—Roy had dissolved a sleeping tablet in the whisky, of course, to knock me out; and when the pain retreated just enough the chemical took effect. I was woken by the sound of crashing, and crashing, and crashing, and then one of the ambulance men came through the main door with an axe in his hand.\n We were flown to Halley, on the coast—the subject of my vision, or whatever that had been. We were hospitalized, and questioned, and my hands were treated. I lost two fingers on my left hand and one on my right, and my nose was rescued with a skin graft that gives it, to this day, a weird patchwork-doll look. I lost toes too, but I care less about those. Roy was fine: they opened his skull, extracted a few fragments of bone, and sewed him up. Good as new.\n I don’t think they believed his version of events, although for myself I daresay he was truthful, or as truthful as circumstances permit. The official record is that he had a nervous breakdown, drugged me, left me outside to die, and then shot himself. He himself said otherwise. I’ve read the transcript of his account. I’ve even been in the same room with him as he was questioned. “I saw things as they really are, things per se, I had a moment—that’s the wrong word, it is not measured in moments, it has always been with me, it will always be with me—a moment of clarity.”\n “And your clarity was: kill your colleague?”\n He wanted the credit all to himself, I think. He believed he was the individual destined to make first contact with alien life. He wanted me out of the way. He didn’t say that, of course, but that’s what I think. His explanation was: my perceptions, my mental processes and imagination, would collapse the fragile disintermediating system he was running to break through to the thing-as-such. I confess I don’t see how that would work. Nonetheless: he insists that this was his motive for killing me. Indeed, he insists that my reappearance proved the correctness of his decision, the necessity for my death—because by coming back at the time I did, I broke down the vision of the ding-an-sich, or reasserted the prison of categorical perception, or something, and the aliens fled—or not fled, because their being is not mappable with a succession of spatial coordinates the way ours are. But: I don’t know. Evaporate. Collapse away to nothing. Become again veiled. He wrote me several long, not terribly coherent letters about it from Broadmoor. I still prefer the earlier explanation. He was a nerd, not right in the head, and a little jealous of me.\n So, yes. He happened to buy Lezlie’s Dear John. She couldn’t cope with the long-distances, the time lags between us meeting up, she’d met someone else . . . ” the usual. After he drugged me and left me outside to die, Roy left the letter, carefully opened and smoothed out, face up on the desk in my room. It was going to be the explanation for my suicide. People were to believe: I couldn’t handle the rejection, and had just walked out into the night.\n His latest communication with me from Broadmoor begged me to “go public” with what I had seen; so that’s what I’m doing. You’ll grasp from this that I don’t know what I saw. I suppose it was a series of weird hallucinations brought on by the extreme cold and the blood supply intermitting in my brain. Or something, I don’t know. I still dream about them. It. Whatever. And the strange thing is: although I know for a fact I encountered it (them, none, whatever) for the first time in Antarctica, in 1986, it feels—it feels deep in my bones—as if I have always known about them. As if they visited me in my cradle. They didn’t, of course.\n I saw the John Carpenter film The Thing for the first time recently. That wasn’t one of the VHS tapes they gave us, back then, to watch on base. For obvious reasons. That’s not what it was like for me at all. That doesn’t capture it at all. They, or it, or whatever, were not thing-y.\n They are inhuman. But this is only my dream of them, I think. But it is not a dream of a human. It is not a dream of a thing. Or it is, but of a sick kind of thing. And, actually, no. That’s not it.\n He keeps writing me. I wish he’d stop writing.\n Originally published in Solaris Rising 3: The New Solaris Book of Science Fiction, edited by Ian Whates.\n Adam Roberts is the author of sixteen novels, many short stories and various works of academic criticism. Recent works include The Palgrave History of Science Fiction, 2nd edition and his latest novel, The Real Town Murders. He lives a little way west of London, with his wife and two children."}