{"fingerprint": "V66N2uhnM4TGfvRJztxD1njTLqM=", "sitename": "Clarkesworld Magazine", "title": "A Study in Oils by Kelly Robson", "author": "Kelly Robson", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/robson_09_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Study in Oils by Kelly Robson", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "11950 words, novelette\nA Study in Oils\nHalfway up the winding cliffside guideway, Zhang Lei turned his bike around. He was exhausted from three days of travel and nauseated, too, but that wasn’t the problem. He could always power through physical discomfort. But the trees, the rocks, the open sky above, and the mountains closing in—it was all too strange. He kept expecting something to drop on his head.\nHe pinged Marta, the social worker in Beijing Hive who’d orchestrated his escape from Luna seventy-two hours earlier.\nForget Paizuo, he whispered as his bike coasted the guideway’s downslope. This is too weird.\nTurn that bike back around or I’ll hit your disable button, Marta whispered back.\nYou wouldn’t.\nHe turned the bike’s acceleration to maximum.\nI would. You can spend the next two weeks lying at the bottom of a gully while the tribunal decides what to do with you. Turn around.\nNo, I’m going back to the Danzhai roadhouse.\nWhen she scowled, her whole face crumpled into a mass of wrinkles. She didn’t even look like a person anymore.\nI’d do anything to keep you alive, kid, and I don’t even like you. She jabbed at him with an age-spotted finger, as if she could reach across the continent and poke him in the chest. Turn back around or I’ll do it.\nHe believed her. Nobody had hit his disable button since he’d left Luna, but Marta was an old ex-Lunite and that meant she was both tough and mean. Zhang Lei slowed his bike, rotated back to the guideway’s uphill track, and gave the acceleration dial a vicious twist.\nYou don’t like me? he asked.\nMaybe a little. Marta flipped through the graphs of his biom. She had full access to that too, and could check everything from his hormone levels to his sleep cycle. You’re getting dehydrated. Drink some water. And slow your bike. You’re going to make yourself puke.\nI feel fine, he lied.\nMarta rolled her eyes. Relax. You’ll love Paizuo. Nobody wants to kill you there.\nShe slapped the connection down, and the image of her elderly face was replaced by steep, verdant mountainside. Danzhai County was thick with an impossible greenness, in layers of bushes, trees, grasses, and herbs he had no name for.\nEverything was unfamiliar here. He knew he was deep in southwestern China, but that’s about all. He knew he was surrounded by mountains, with Danzhai’s transit hub behind him. It was a two-pad skip station, the smallest he’d ever seen, next to a narrow lake surrounded by hills, everything green but the sky—which actually was blue, like everyone always said about Earth—and the buildings. Those were large, brown, and open to the air as if atmospheric weather was nothing.\nAn atmosphere people could breathe. That was Earth’s one unique claim. Unlike Luna, or Venus, or Mars, or any of the built environments in the solar system, here in Danzhai and a few other places on Earth, humans lived every day exposed to weather. It was traditional, or something.\nWeather was overrated, Zhang Lei decided. The afternoon was so humid, he’d sweated through his shirt. And the air wasn’t clean. Bits of fluff floated in it, and it smelled weird, too. Birds zipped through the air like hovertoys launched from tree limbs—were they even birds? He’d seen so few on Luna.\nAt least he was alone. A year ago, he would have hated not having anyone to goof around with or show off for. No coach, no team, no fans. Now he was grateful. Marta was watching out for him, always on the other end of a ping if anything went wrong. It was a relief not having to stay ultra-alert.\nHe pinged Marta.\nHow long do I have to stay in Paizuo?\nHer face appeared again. She was shoveling noodles into her mouth with a pair of chopsticks. The sight of the food made his stomach heave.\nAt least two weeks. More if I can wrangle an extension. Ideally, I’d like you to stay until the tribunal decides your case.\nOkay.\nTwo weeks. Fine. He’d keep doing what she said, within reason. Drinking water, yes. Slowing the bike down, no. He wasn’t going to toil up the mountain like some slack-ass oldster.\nWasn’t long before he regretted that decision. The nausea wouldn’t be denied any longer. He shifted on the bike’s saddle and hung his head over the edge of the guideway. His mouth prickled with saliva until his guts heaved, forcing what was left of his luxurious, hand-cooked Danzhai lunch—black fungus, eggplant, cucumbers, and garlic with pepper, pepper, and more pepper—up, out, and over into the green gulch below. The nausea eased.\nWhen he got to the Paizuo landing stage, the guideway came to a dead end. He couldn’t believe it. Just a ground-level platform with a bike rack on one side and a battery of cargo floats on the other. Zhang Lei had never even seen a landing stage with only one connection, not even in the bowels of Luna’s smallest hab. Everywhere was interconnected. Not Paizuo, apparently.\nHe hooked his bike on the rack, shouldered his duffle bag, and wiped his mouth on his sleeve, flicking away a few stray pepper seeds. His lips burned.\nI said you’d puke, Marta whispered. No visual this time, only a disembodied voice. Bet you feel like shit.\nYeah, but you look like shit.\nIt was the traditional Lunar reply. Marta laughed.\nDon’t pull that lip here, okay? You’re a guest. Be polite.\nHe shifted his bag from one shoulder to the other. Nobody seemed to be watching, aside from Marta. Behind the trees, a few brown houses climbed the side of the mountain. Where was the village? A few people were visible through the trees, but otherwise, Paizuo was a wilderness—a noisy wilderness. Wind in the leaves, birds chirping, and buzzing—something coming up behind him.\nZhang Lei spun, fists raised. A cargo conveyor zipped up the guideway. It slid its payload onto a float and slotted itself into place on the underside of the landing stage. The float slowly meandered up a leafy path.\nA hospitality fake showed him the way to the guest house, where he stumbled to his room, fell on top of the bed, and slept fourteen hours straight. If someone had wanted to kill him then, they easily could have. He wouldn’t have cared.\nThe other three artists in the guest house were pampered oldsters from high-status habs. They made a big show of acting casual, but Zhang Lei caught each of them exchanging meaningful looks. They were probably pinging his ID to ogle his disable button, marveling at the label under it that said KILLER—FAIR GAME, and discussing him in whispers.\nDuring lunch, Zhang Lei ignored them. Instead of joining their conversation, he watched a hygiene bot polish the floor.\n“The wood bothered me at first,” said Prajapati, gesturing with a beringed hand at the guest house’s wooden walls, floor, and ceiling. She looked soft, her dark skin plush with fat and burnished with moisturizers. Her metadata identified her as a sculptor from Bangladesh Hell. “But organic materials are actually quite hygienic, if treated properly.”\n“I don’t like the dirt,” said Paul, an ancient watercolorist from Mars. “It’s everywhere outside.”\n“It’s not dirt, it’s soil,” said the sculptor. She picked a morsel of flesh out of the bubbling pot of fish soup in the middle of the table.\n“People from the outplanet diaspora forget that soil is life,” said Han Song, a 2D photographer from Beijing Hive.\n“Yes, we’ve all been told that a thousand times,” replied the watercolorist with a smile. “Earth thinks very well of itself. But I have to say, I like Paizuo. The Miao traditional lifestyle is extremely appealing.”\nA woman shuffled into the dining room bearing plates of egg dumplings and sweet millet cake. The oldsters smiled and thanked her profusely. The woman wore a wide silver torque around her neck, hung with tiny bells and charms. They tinkled as she arranged the dishes. She was slender, but the profile of her abdomen showed a huge tumor under her colorful tunic.\n“What a waste of billable hours,” the watercolorist said once the chef was gone. “Couldn’t they task a bot with the kitchen-to-table supply chain? I know tradition is important to the Miao, but the human ability to carry plates is hardly going to die out.”\nThe chef had tagged the food with detailed nutritional notes, and it said millet was good for digestive upset. After vomiting his Danzhai lunch yesterday, he couldn’t face more peppers. But the millet cake was good—honey-sweet and crunchy. The egg dumplings were delicious, too. He could eat the whole plate.\nMarta pinged him.\nI thought you’d never wake up. Listen, don’t worry about the other guests, okay? We’ve had them investigated. They’re all nice, quiet, trustworthy people. They agreed not to ask too many questions.\nHe shoved another dumpling in his mouth. Zhang Lei knew he ought to be grateful but he wasn’t. The three oldsters were getting something out of the deal, too. They would be able to tell stories about him for the rest of their lives. I once shared accommodations with a murderer. Well, not a murderer, I suppose, not exactly, my dear, but a killer. No, I never asked him what happened but you should have seen the disable button on his ID. It said KILLER right under it. I couldn’t help but stare.\nZhang Lei finished the dumplings and claimed the rest of the millet cake. He left the table still chewing, and slammed the front door behind him.\nWhat did you tell them about me? he asked Marta.\nNot much. I said you weren’t responsible for what happened and we’re working to have the disable button removed.\nI was responsible, though.\nZhang Lei, we’ve discussed this. Do you want to ping a peer counselor? Talk therapy is effective.\nNo. I hate talking.\nThe guest house was part of a trio of houses, fronted by a cabbage patch. Large birds—domestic poultry he guessed—pecked at the gravel walkway that led to the guest house’s kitchen door. Nearby, a huge horned mammal was tethered in the shade, along with a large caged bird that stalked back and forth and shrieked.\nZhang Lei trudged toward a peak-roofed pavilion. The midday sun stood high over the valley, veiled by humid haze. Not at all hot, but in the unfamiliar atmosphere, sweat beaded on his scarred forearms.\nThe pavilion overlooked the terraced fields descending the valley and the hazy fleet of mountains on the horizon. No blue sky today. He might as well be in a near-Sun orbit greenhouse hab, deep in the eye of its dome, every sprout, bud, and bloom indexed and graphed. The locals probably used the same agricultural tech here. Each of the green-and-yellow plants in the terraces below was probably monitored by an agronomist up the mountain, watching microsensors buried in the soil and deploying mineral nutrition with pinpoint accuracy.\nZhang Lei pinged one of the plants. Nothing came back, not even an access denial. He tried pinging one of the farmers working far below, then a nearby tree. Still nothing. Frantic, he flung pings across the valley.\nAll of the Paizuo guest houses answered immediately. A map highlighted various routes up and down the valley. The guideway landing stage sent him the past two days of traffic history and offered average travel times to various down-slope destinations. A lazy stream of ID information flowed from the guest artists, thirty in total.\nSeveral hazard warnings floated over their targets: Watch for snakes. Beware of dog. Dangerous cliff. But no pings from the locals, or any of the crops, equipment, or businesses. Not even from the wooden hand-truck upended over a pile of dirt at the side of the path. But no way this village ran everything data-free.\nHis pings summoned the hospitality fake. It hovered at his elbow, head inclined with a gently inquiring look.\n“Why can’t I get a pingback from anything here?” he demanded.\nIt gave Zhang Lei a generic smile. “Paizuo data streams are restricted to members of the Miao indigenous community.”\n“So I can’t find out anything?” His face grew hot with anger. Stuck here for weeks or more, totally ignorant, unable to learn anything or find out how the village worked.\nThe fake nodded. “I’ll be pleased to answer your questions if I’m able.”\nZhang Lei wasn’t in the mood for crèche-level games. He slapped it down, hard. The fake misted away, immediately replaced by Marta in full length. She had her fists on her hips and didn’t look pleased.\nFeeling a little aggressive, Zhang Lei? You didn’t say two words to your fellow guests, and now you’re getting testy with a fake.\nI’m sorry, okay? Embarrassing. He should have controlled himself. I hate this place.\nNo, you don’t. You’re out of your element. Nothing here is any threat to you. She grinned. Not unless you have a phobia of domestic animals.\nHah, he grumbled.\nGo for a walk. Do a little sketching. Get familiar with the village. There’s lots to see, and it’s all gorgeous. There’s a reason why artists love Paizuo.\nOkay. He booted up his viewcatcher. Marta gave him an approving nod and dissolved.\nTrue, Paizuo was beautiful. From the pavilion, mountains thick with trees stretched sharp and steep over the valley, where green and yellow terraced fields stepped up and down the lower slopes, punctuated by small groups of wooden houses under tall trees. He framed the composition in his viewcatcher. It was perfect, pre-chewed—the whole reason the pavilion had been built there in the first place. The fang-like form of the tallest mountain clutched in the spiral fist of the golden mean. Nice.\nEven though the view was prepackaged, framing it in his viewcatcher was satisfying. And what a relief to be able to do it openly. Back on Luna, he had to be careful not to get caught using the viewcatcher, or he’d get smacked by one of his teammates or screamed at by his coach. Zhang Lei was allowed to draw cartoons and caricatures, but everything else was a distraction from training and a waste of time and focus.\nTotal commitment to the game, that’s what all coaches demanded.\n“What do you love better, hockey or scribbling on little bits of paper?” Coach had demanded, and then smacked him on the back of the head when he hesitated.\n“Hockey,” he answered.\n“Right. Don’t forget it.”\nSo he drew cartoons of his teammates, their rival teams, and stars from the premier leagues they all wanted to get drafted into. He got good. Fast. Accurate. In thirty seconds, he could toss off a sketch that got the whole team hooting. Coach liked it, said it was good for morale. But quick, sketchy work didn’t satisfy. Neither did the digital-canvas painting he snuck past Coach on occasion, but both were better than nothing.\nHe padded down a trail to the first terrace, flipping his viewcatcher through its modes—thirds to notan to golden mean to phi grid—as he strode along the edge. The earthen berm bounding the terrace was less than a meter wide, and seemed to be made entirely of dirt. The next terrace was ten meters below on his left.\nHe blacked out edges of the view, widened the margins until nothing was visible outside his constantly expanding and contracting search for a composition. He swept back and forth across the landscape. Then he slipped and fell. The viewcatcher framed a close-up of green plants in brown water.\nZhang Lei lurched sideways, regaining his footing, the right leg of his pants wet to the knee and slimy with mud. He dismissed the viewcatcher and stared incredulously around him.\nThe matrix of the terraces was liquid, not soil. Water and mud. He’d seen it glinting between the greenery, but he hadn’t realized it was water. And now he was covered in it.\nA fleeting thought—I’m going to die here—easily dismissed. All he had to do was watch where he put his feet as he explored.\nPaizuo wasn’t what Zhang Lei expected. The village wasn’t all one piece like ancient towns in crèche storybooks. It was spread thin, covering the whole valley, the houses clustered in groups under the trees and separated by fields and paddies. The Miao didn’t build on flat or even sloping land—those areas seemed dedicated to crops. Instead, they chose the precipitous and rocky landscape for their multilevel wooden homes. Each house stood on stilts over the canted landscape, the weight of the structures leaning back on the mountainside. Livestock sheltered in the shade beneath, some tethered or penned, some roaming free.\nActual live animals, like the ones behind the guest house, and a lot of them. With humans living literally on top of them.\nA deep voice knocked Zhang Lei out of his thoughts. Unfamiliar syllables. When he turned to look, the translation word balloon hung over the man’s head:\n“Hello, can I help you?”\nNo ID accessible, but the balloon was tagged with his name: Jen Dang. Not tall, but broad-shouldered and athletic, with skin deeply burnished by the sun and a wide, strong face. Old, but not an oldster.\nZhang Lei switched on his translation app.\n“I arrived yesterday,” Zhang Lei said. “Trying to get used to everything.”\nJen Dang scanned the balloon overhead.\n“Are the insects troubling you?”\n“Insects?” Zhang Lei frowned and scanned the ground. “I haven’t seen any yet.”\n“Right there.” Jen Dang pointed at one of the fluttering creatures he had no name for.\n“Oh, I thought insects lived on the ground. I’m from—” He almost said Luna but caught himself in time. “I’ve never been on Earth before. It’s different.”\n“Most of our guests use seers to help them identify plants and animals. Paizuo is a biodiversity preserve, with thousands of different species.”\n“I’ll do that, thanks.”\nJen Dang fell silent. Zhang Lei could feel himself warming to the stranger. Lots of charisma and natural authority. He’d do well on Luna.\n“The food is really good here,” he said.\nA shadow of a smile crossed Jen Dang’s face.\n“Jen Dla is my daughter. She’s an experienced chef.”\n“I’m sorry,” Zhang Lei said, and other man squinted at him. “I couldn’t help but notice she’s sick.” He gestured vaguely in the region of his stomach.\nJen Dang shook his head. “You’re a guest. There are lots of things guests can’t understand. Would you like to see another?”\nTwo large baskets lay under a tree. Jen Dang plucked them from the ground and led Zhang Lei down a tree-lined path, the slope so extreme the route soon turned into uneven stairs, cut into the dirt and haphazardly incised with slabs of rock. Mammals grazed on either side, standing nearly on their hind legs while cropping the ground cover.\nThey descended five terrace levels before Zhang Lei’s thighs started getting hot. Stairs were a good workout, mostly cardio but some leg strength, and uneven steps were good balance training, too. For a moment he lost himself in the rhythm of their rapid descent. It was enjoyable. He could run the stairs in morning and evening before doing his squats and lunges—but then he remembered. He wasn’t an athlete anymore. And with the disable button on his ID labeling him a killer, nobody in Danzhai, Miao or guest, needed to wonder what he was training for, or if he was chasing someone.\nHe slowed, letting the distance widen between himself and the farmer. If someone got worried and hit the button, he’d roll right down the mountain.\nJen Dang shucked his shoes and rolled up his trouser legs as he waited for Zhang Lei at one of the lower terraces.\n“Many guests are squeamish of the rice paddies, but it’s only water and mud,” he said when Zhang Lei joined him. “And worms. Bugs of course. A few snakes. And fish.” He hefted the large basket. It was bottomless—an open, woven cylinder.\n“Not a problem.” Zhang Lei pulled off his shoes, but didn’t roll up his pant legs. One was still damp. The other might as well get wet, too.\nJen Dang handed him the smaller basket and waded into the sodden paddy, bottomless basket clutched in both hands.\n“Step between the rice plants, never on them. Try not to stir up too much mud, or you can’t see the fish.”\nJen Dang demonstrated, moving slowly and looking at the water through the basket. Zhang Lei followed. The mud was cool. It squelched through his toes.\n“Use the basket to shade the water’s surface,” the farmer said. “Look for movement. A flash of scales or the flick of a tail.”\nAs Zhang Lei followed the farmer through the paddy, he took care to keep his feet away from the knee-high rice plants. Each one was topped by knobby spikes—the grain portion of the crop, he assumed. Some of the grain was coated with a milky substance, and some was turning yellow.\nJen Dang plunged the bottomless basket in the water and said, “Come look.”\nA fish was trapped inside. Jen Dang reached into the water and flipped it into Zhang Lei’s basket. It struggled, thrashing.\n“That’s one, we need six. You catch the rest.”\nZhang Lei made several tries before he trapped a fish large enough to meet Jan Dang’s standards. Catching the rest took a full hour. The sky cleared and turned Earth-blue. The older man betrayed no trace of impatience, even though it was a ridiculous expenditure of effort to procure basic foodstuffs when a nutritional extruder could feed hundreds of people an hour, with personalized flavor and texture profiles and optimal nutrition.\nWhen they finished, Zhang Lei’s eyes ached from squinting against the flare of sun on water. He wiped his fish-slick hands on his pants and followed the farmer up the stairs.\n“Why do you do this?” he asked.\nJen Dang stopped and eyed the word balloon over Zhang Lei’s head.\n“Stubbornness. That’s what my wife says. She’s a orthopedic surgeon, takes care of all the Miao in Danzhai county. She won’t farm. Says her hands are meant for higher things. She loves to cook, though. She taught all our daughters.”\n“But why do manual labor when you could use bots?”\n“We use some, but we’re not dependent on them. If we don’t do the work, who will?”\n“Nobody.”\n“Then nobody will know how to do it. All traditional skills and knowledge will be lost, along with our language, stories, songs—everything that makes us Miao. We do it to survive.”\n“You could write it down.”\nJen Dang laughed. He lifted the fish basket to his shoulder and ran up the stairs two at a time. His word balloon blossomed behind him.\n“Some things can only be mastered with constant practice.”\nThat was true. Nobody could learn to play hockey by watching a doc. Or learn to draw or paint without actually doing it.\nAn insect landed on a nearby plant. Its wide, delicate wings had eyelike patterns in shades of gold and copper. Zhang Lei framed it in his viewcatcher, then panned up to include the mountains in the composition. Gold wings and green slopes, copper eyes and blue sky. Perfect.\nAnother insect hung in the sky, hovering motionless, shaped like a half circle and very faint. Zhang Lei stared for a whole minute before realizing what he was looking at.\nThe moon. Luna itself. The home of everything he knew, and everyone who wanted to hurt him. Watching.\nOver the next week, the moon turned its back on him, retreating through its last quarter to a thinning sickle. In the morning, when he ventured onto the guest house’s porch for a stretch, there it was, lurking behind the boughs of a fir tree, half-hidden behind mountain peaks, or veiled in humid haze to the east. Sometimes it hid on the other side of the globe. Then the next time he looked, it was right overhead, staring at him.\nNight was the worst. The lights of the habs glared from the dark lunar surface aside the waning crescent—the curved sickle of Purovsk, the oval of Olenyok, the diamond pinpoint of Bratsk, the five-pointed star of Harbin.\nA few years back, an investment group had tried to float a proposal to build a new hab on Mare Insularum, its lights outlining a back-turned fist with an extended middle finger. Zhang Lei and his teammates had worn the proposed hab pattern on their gym shirts for a few months, the finger mocked up extra large on a dark moon, telling Earth and all its inhabitants what Lunites thought of them.\nHe could stay inside at night, but he couldn’t hide from the moon during the day. It watched him with a sideways smile. We see you—we’re coming to get you.\nHe tried not to think about it, and concentrated on finding compositions with his viewcatcher. He made sketches and studies, and looked up plants and animals with his seer, and tried to learn their names. When he ran into artists from the other guest houses, they were friendly enough, but all much older than him.\nAt night, he worked on studies and small canvases in his room, door closed and windows dark. They were disasters: muddy greens, lifeless brushwork, flat compositions. He tried all the tricks he’d learned in the crèche—glazing, underpainting, overpainting, scraping with a palette knife, dry brush, but nothing worked.\nWhy don’t you try some familiar subjects? Marta suggested. Limber up first, then branch out into new things.\nIf you say so.\nHe was so frustrated he’d try anything. He lugged his easel and kit up to the guest house’s communal studio and set up in his own corner of the work space.\n“I was beginning to think we’d never see you up here,” said Paul. “Welcome.”\n“The light’s especially good in the afternoon,” said Prajapati.\nHan Song paused his hands over his work surface for a moment and nodded.\nNothing motivated Zhang Lei like competition. He would destroy the watercolorist with his superior command of light and shadow, teach the sculptor about form, show the photographer how to compose a scene.\nHis old viewcatcher compositions and stealthily-made reference sketches were gone forever, so he worked from memory. He attacked the canvas with his entire arsenal, blocking out a low-angle view of Mons Hadley and the shining towers of Sklad, with the hab’s vast hockey arena in the foreground under a gleaming crystal dome. The view might be three hundred and eighty thousand kilometers away, but it lay at his fingertips, and he created it anew every time he closed his eyes.\nThe paint leapt to Zhang Lei’s brush, clung to the canvas, spread thin and lean and true exactly where it should, the way it should, creating the effects he intended. After a week of flailing with sappy greens and sloppy, organic shapes, he finally had a canvas under control. He worked late, muttering good night to the other artists without raising his eyes from his work. When dawn stretched its fingers through the studio’s high windows, the painting was done—complete with a livid crimson stain spreading under the arena’s crystal dome.\nHe didn’t remember deciding to paint blood on the ice, or putting crimson on his palette. But the color belonged there. It was the truth. It showed what he did.\nZhang Lei lowered himself to the floor, leaned his back against the wall with his elbows on his knees, and rested his head in his hands. He pinged Marta. She blinked blearily at him for a few seconds, her eyes swollen with sleep. He pointed at the canvas.\nHave any of the other artists seen this? she whispered.\nI don’t know. I don’t think so.\nIt’s important they don’t. Okay? Do you understand why?\nBecause people are looking for me.\nNot only that. She scrubbed her eyes with the heels of her hands. The Lunite ambassador is trying to block your immigration application. She made an official information request. If the media gets interested we’ll have to move you, fast. And yes, people are searching. Three teams of Lunite brawlers have been skipping all over the planet, asking questions. They found someone in Sudbury Hell who remembers you getting on a skip bound for Chongqing Hive. That’s too close for comfort.\nI can destroy the canvas, he said, voice flat and scraped clean of emotion. It was the first real painting he’d done since he left the crèche. But he couldn’t look at it. When he did, his flesh crawled.\nNo. Don’t do that. Hide it.\nHe nodded. It’s a decent painting.\nYeah. Not bad. You worked out the kinks.\nHe knocked his head against the wall behind him. Wood was harder than it looked. He swung his head harder.\nStop that.\nThere’s no point, Marta. Those brawlers are going to find me.\nNo, they won’t. And chances are good the tribunal will rule in your favor. We have to be patient.\nEven if I get to live in Beijing, people will still find out what I did.\nThey’ll assume you had no choice. Everyone knows Luna is the most dangerous place in the solar system.\nI did have a choice—\nMarta interrupted. It was a mistake. An accident. It could happen to any hockey player.\nI aimed for Dorgon’s neck.\nYou did what you were taught, and so did Dorgon. Playing hockey isn’t the only way to die on Luna. If you live in a place where getting killed is accepted as a possible outcome, then you also accept that you might become a killer.\nBut we don’t understand what it means.\nNo. Marta looked sad. No, we don’t.\nThe day after he’d killed Dorgon, Zhang Lei’s team hauled him to a surgeon. Twenty minutes was all it took to install the noose around his carotid artery, then two minutes to connect the disable button and process the change to his ID. His teammates were as gentle as they could be. When it was all done, the team’s enforcer clasped Zhang Lei’s shoulder in a meaty hand.\n“We test it now,” Korchenko said, and Zhang Lei had gone down like a slab of meat.\nWhen he woke, his friends looked concerned, sympathetic, even a little regretful.\nThat attitude didn’t last long. After the surgery, the team traveled to a game in Surgut. Zhang Lei’s disable button was line-of-sight. Anyone who could see it could trigger it. He passed out five times along the way, and spent most of the game slumped on the bench, head lolling, his biom working hard to keep him from brain damage. His teammates had to carry him home.\nFor a few weeks, they treated him like a mascot, hauling him from residence to practice rink to arena and back again. They soon tired of it and began leaving him behind. The first time he went out alone he came back on a cargo float, with a shattered jaw and boot-print-shaped bruises on his gut. That was okay. He figured he deserved it.\nThen one night after an embarrassing loss, the team began hitting the button for fun. First Korchenko, as a joke. Then the others. Didn’t take long for Zhang Lei to become their new punching bag. So he ran. Hid out in Sklad’s lower levels, pulling temporary privacy veils over his ID every fifteen minutes to keep the team from tracking him. When they were busy at the arena warming up for a game, he bolted for Harbin.\nHe passed out once on the way to the nearest intra-hab connector, but the brawler who hit his disable button was old and drunk. Zhang Lei collected a few kicks to the ribs and one to the balls before the drunk staggered off. Nobody else took the opportunity to get their licks in, but nobody helped him, either.\nBoarding the connector, he got lucky. A crèche manager was transferring four squalling newborns, and the crib’s noise-dampening tech was broken. The pod emptied out—just him and the crèche manager. She ignored him all the way to Harbin. He kept his distance, but when they got to their destination, he followed her into the bowels of the hab. She was busy with the babies and didn’t notice at first. But when he joined her in an elevator, she got scared.\n“What do you want?” she demanded, her voice high with tension.\nHe tried to explain, but she was terrified. That big red label on his button—KILLER—FAIR GAME—didn’t fill people with confidence in his character. She hit the button hard, several times. He spent an hour on the floor of the elevator, riding from level to level, and came to with internal bleeding, a cracked ocular orbit, three broken ribs, and a vicious bite mark on his left buttock.\nHe limped down to the lowest level, where they put the crèches, and found his old crèche manager. She was gray, stooped, and much more frail than he remembered.\n“Zhang Lei.” She put a gentle palm on his head—the only place that didn’t hurt. “I was your first cuddler. I decanted you myself. I won’t let anyone hurt you.”\nIf he cried then, he never admitted it.\nZhang Lei watched Jen Dla carry a pot of soup into the dining room. She moved awkwardly, shifting her balance around that bulbous gut. He couldn’t understand it. Why hadn’t she had an operation to remove the tumor? Her mother was even a surgeon.\nTerminal, he guessed, and then realized he’d been staring.\nJen Dla nestled the pot on the stove in the middle of the table, and lit the flame. He caught the chef’s eye as she adjusted the temperature of the burner.\n“Your father must be an important man here in Paizuo,” he said.\nJen Dla laughed.\n“He certainly thinks so.” She laid her hand on the embroidered blouse draped over her bulging abdomen. “Fathers get more self-important with every new grandchild.”\nShe tapped her finger on her stomach. Zhang Lei sat back in his chair, abruptly. She wasn’t sick, but pregnant—actually bearing a child.\n“Are all Miao children body-birthed?” he blurted.\nShe looked a little offended. “Miao who choose to live in Paizuo generally like to follow tradition.”\nAbrupt questions leapt behind his teeth—does it hurt, are you frightened—but her expression was forbidding.\n“Congratulations,” he said. She smiled and returned to her kitchen.\nAfter talking to Marta, he’d taken the painting down to his room and hidden it under the bed, then collapsed into dream-clouded sleep. The arena at Sklad, deserted, the vast spread of ice all his own. The blades of his skates cut the surface as he built speed, gathered himself, and launched into a quad, spinning through the air so fast the flesh of his face pulled away and snapped back into place on landing. He jumped, spun, jumped again.\nDreams of power and joy, ruined on waking. He’d pulled the painting from under his bed and hid it behind the sofa in the guest house lounge.\nJen Dla’s soup began to bubble. Tomatoes bobbed in the sour rice broth. Zhang Lei watched the fish turn opaque as it cooked, then pinged one word at the three artists upstairs—lunch. They clattered down.\n“Looked like you were having a productive session yesterday,” Prajapati said. “Good to see.”\n“Don’t stop the flow,” Han Song added.\nPaul grinned. “Nothing artists love more than giving unwanted advice.”\n“It’s called encouragement,” said Prajapati. “And it’s especially important for young artists.”\n“Young competitors, you mean.”\n“I don’t see it that way.” She turned to Zhang Lei. “Do you?”\nAll three artists watched him expectantly. Zhang Lei stared at his hands resting on the wooden tabletop. He’d forgotten to roll down his sleeves. His forearms were exposed, the scarred skin dotted with pigment. He put his hands in his lap.\n“I think the fish is ready,” he said.\nAfter lunch, while exploring for new compositions, he found Jen Dang behind the guest house. The water buffalo—one of the first creatures he’d looked up on his seer—was tethered to a post by a loop of rope through its nose. It was huge, lavishly muscled, and heavy, with ridged, back-curving horns, but it stood placidly as Jen Dang examined its hooves.\n“Stay back,” Jen Dang said. “Water buffalo aren’t as friendly as they look. He’s not a pet.”\n“Yeah, I know,” said Zhang Lei. When he’d sketched the water buffalo, a stern warning had popped into his eye: Do not approach. Will trample, gouge, and kick.\nHe lifted his viewcatcher and captured a composition: Jen Dang stooping with his back turned to the water buffalo, drawing its massive hindquarter between his own legs and trapping the hoof between his knees.\n“All he has to do is back up, and you’ll get squashed,” said Zhang Lei.\n“He knows me.” Jen Dang dropped the hoof and patted the animal’s rump. “And he knows the best part of his day is about to begin.”\nThe farmer untied the rope from the post and led the animal up the narrow trail behind the houses. Zhang Lei followed. A bird stalked from between the trees, its red, gold, and blue body trailing long, spotted brown tail feathers. His seer tagged it: Golden Pheasant, followed by a symbol that meant major symbolic and cultural importance to the indigenous people at this geographical location. Which was no different from most of the plants and animals the seer had identified.\n“So, I’ve been using a seer,” he said, as if his rice paddy conversation with Jen Dang had happened that morning instead of days ago. “It doesn’t explain anything. Why is every butterfly important to Miao but not the flies? Why one species of bee but not the other?”\n“The butterfly is our mother,” Jen Dang said.\n“No, it’s not. That’s ridiculous.”\n“I might ask you who your mother is, if I were young and rude, and didn’t know better.”\n“I don’t have a mother. I was detanked.”\n“That means you’re the product of genetic advection, from a tightly edited stream of genetic material subscribed to by your crèche. How is that less strange than having a butterfly mother?”\n“Is the butterfly thing a metaphor?”\nJen Dang glanced over his shoulder, his gaze cold. “If you like.”\nThe water buffalo lipped the tail of Jen Dang’s shirt. He tapped its nose with the palm of his hand to warn it off. The trail widened as it began to climb a high ridge. The water buffalo was heavy but strong. It heaved itself up the slope, like a boulder rolling uphill. Jen Dang ran alongside to keep pace, so Zhang Lei ran after. The exertion felt good, scrambling uphill against the full one-point-zero, with two workout partners. So what if one of them was an animal? Zhang Lei would take what he could get.\nWhen the trail widened, he took the chance to sprint ahead. He made it to the top of the ridge a full ten seconds before the water buffalo. Jen Dang looked him up and down.\n“Not bad. Most guests are slow.”\nZhang Lei grinned. “I train in the dubs.”\n“Dubs?”\n“Double Earth-normal gravity. You know. For strength.”\n“I never would have guessed.”\n“I know,” Zhang Lei said eagerly. “I look bottom-heavy, right? Narrow above a wide butt and thick legs. That’s what makes me a good skater.”\nShut up, Marta hissed in his ear. But he couldn’t stop. Finally a real conversation.\n“I train for optimal upper body flexibility, like all center forward play—”\nOne twinge in his throat, that’s all it took to send Zhang Lei plummeting to the ground. He twisted and rolled when he hit the dirt—away from the edge of the hill, and then the world faded to mist.\nZhang Lei clawed his way to consciousness.\nYou’re fine, you’re fine, nobody’s touched you.\nOkay, he mumbled.\nYou’ve only been down five minutes, Marta added. Tell him you have a seizure disorder and your neurologist is fine-tuning your treatment protocol. Say it.\nZhang Lei struggled to focus. His eyelids fluttered as he tried to form the words.\n“I get seizures.” He licked his lips. “Doc’s working on it.”\nJen Dang said something. Zhang Lei forced his eyes to stay open. He was collapsed on his side, cheek pressed to the dirt. Three ants crawled not ten centimeters from his eye. He flopped onto his back to read the farmer’s word balloon.\n“Your medical advisory said it wasn’t an emergency, and I shouldn’t touch you.” Behind Jen Dang, the water buffalo cast a lazy brown eye over him and shook its head.\nTell him you’ll be fine, Marta demanded. Ask him not to mention it to anyone.\n“I’m fine.” Zhang Lei pushed himself onto his elbows, then to his knees. “Don’t talk about this, okay?”\nThe farmer looked dubious. He gathered the water buffalo’s lead rope.\n“I’ll walk you back to the studio.”\n“No.” Zhang Lei jumped to his feet. “There’s nothing wrong with me. It won’t happen again.”\nBetter not, Marta grumbled.\nZhang Lei led the way up the trail. Jen Dang followed. The water buffalo wasn’t dawdling anymore, it was moving fast, nearly trotting. The track converged on a single-lane paved road, which snaked up the valley in a series of switchbacks. They were higher now, the guest houses far below, and everywhere, rice terraces brimmed with ripening grain yellow as the sun. He could paint those terraces with slabs of cadmium yellow. Maybe he would.\n“Which way?”\nZhang Lei needn’t have asked. The water buffalo turned onto the road and trundled uphill. Before long, the slope gentled. Houses lined the road, with gardens and rice paddies behind. The road ended at a circular courtyard patterned with dark and light stones and half-bounded by a stream. At the far end, a footbridge arched over the water, leading to more houses beyond.\nThe animal’s tail switched back and forth. It trotted toward the water, splayed hooves clopping on the courtyard’s patterned surface. A hygiene sweeper darted out of its path. At the stream’s edge, where the courtyard’s stone patterns gave way to large, dark slabs, the water buffalo paused, lowered its head, and stepped into the water.\nA man called out from one of the houses across the bridge. Jen Dang shouted a reply. No word balloon appeared.\nJen Dang offered the lead rope to Zhang Lei.\n“He’ll stay in the water. I’ll only be a few minutes.”\nZhang Lei leaned on the bridge railings, flipping the rope to keep it from tangling in the animal’s horns as it luxuriated in the water below. The stream wasn’t deep, only a meter or so, but the beast lay on its side and rolled, keeping its white beard, eyes, and horns above water.\nWhen Jen Dang returned, the water buffalo was scratching its long, drooping ear on a half-submerged rock. Zhang Lei kept the rope.\n“It’s fun,” he said. “Best part of my day, too.”\nThe farmer sauntered across the courtyard and joined a pair of friends working in the shade of a mulberry tree.\nZhang Lei composed a series of canvases. The water buffalo with its eyelids lowered in pleasure, lips parted to reveal a gleaming row of bottom teeth. Three women in bright blue blouses weaving in an open workshop, their silver torques flashing. A man in deep indigo embroidered with pink and silver diamonds, sorting through a table piled with feathers. Jen Dang leaning on a low stone wall, deep in conversation with two friends using gleaming axes to chop lengths of bamboo. A white-haired woman in an apron stirring a barrel of viscous liquid with a wooden paddle. A battery of pink-cheeked, scrubbed children racing across the courtyard as a golden pheasant stalked in the opposite direction. A row of cabbages beside the road. Herbs clinging to a slate outcropping. A dragonfly skipping over the water. The tallest peak puncturing the western horizon like a fang on the underjaw of a huge beast.\nAesthetically pleasing, peaceful, picturesque. But all communities had tensions and contradictions. Only a Miao could identify the deeper meaning in these scenes. Only a great artist could paint the picturesque and make it important. He wasn’t Miao and he was no great artist. Could he capture the water buffalo’s expression of ecstasy as it pawed the water? Not likely. But he could paint the mountain. Nothing more banal than another mountain view. But he loved that unnamed peak. He’d loved Mons Hadley, too.\nJen Dang waved. A word balloon blossomed over his head: Let’s go.\nHe jiggled the rope. The water buffalo ignored him. He flapped it, then gave the gentlest of tugs. The buffalo snorted and heaved itself out of the water. It stood there dripping for a moment, then its skin shivered. It lowered its head, shaking its great bulk and coating Zhang Lei in a local rainstorm.\nZhang Lei wiped his face on his sleeve. The men were still laughing when he joined them. Nothing more fun than watching a rookie fall on his ass.\nJen Dang was still chatting. Zhang Lei waited nearby, in the shade of a house. Along the wall was a metal cage much like the one behind the guest house. A rooster stalked back and forth, its face, comb, and wattle bright red, its bare breast and scraggly back caked with clean, healing sores. It stared at Zhang Lei with a malevolent orange eye, lifted one fiercely-taloned yellow leg, and flipped its water dish.\n“Stupid bird,” Zhang Lei muttered.\nAround the corner was another cage, another rooster in similar condition, its comb sliced in dangling pieces. When it screamed—raucous, belligerent—the other bird answered. Zhang Lei knew an exchange of challenges when he heard it.\n“Are these fighting cocks?” he asked when Jen Dang joined him.\n“You don’t have them on Luna?” he answered.\nShit, whispered Marta. Tell him you’re from the Sol Belt. You’ve never been to Luna.\nWhy don’t you hit my disable button again? Load me on a cargo float and stick me in a hole somewhere? Or better yet—a cage. Evict one of the birds and get me my own dish of water.\nI might have to do that. Listen kid, it’s never been more important for you to be discreet.\nWhy? Are they coming for me?\nSilence.\nThey are, aren’t they? Answer me.\nA Lunite team tracked you to the Danzhai roadhouse, but don’t worry. We’ve got people on the ground, planting rumors to lure them to Guiyang. Even if they don’t take the bait, Danzhai County has lots of towns and villages. You’re still safe.\n“I’m from the Sol Belt,” he told Jen Dang. “I’ve never been to Luna.”\nThe farmer didn’t look convinced.\nZhang Lei’s hand stole up to his throat. Under his jaw, where his pulse pounded, the hard mass of the noose waited to choke off his life.\nWhen Zhang Lei got back to the studio, the other three artists were upstairs. He shoved the sofa aside. The painting leaned against the wall, facing out, a layer of breathable sealant protecting the drying oil paint. He was sure he’d turned it to face the wall, but apparently not. It didn’t really matter. He wanted it gone.\nHe sprayed the canvas with another layer of sealant, trying not to look at the thick wet bloody gleam on the arena’s ice. He wrapped it in two layers of black polymer sheeting, and requested a cargo wrap to meet him at the guideway landing stage.\nWhen he got there, the area was packed with Miao arriving on sliders and bikes, whole families crowded onto multi-seat units, laughing and talking. He edged his way to the cargo drop, slid the cargo wrap around it, addressed it to Marta, and shoved the painting inside the conveyor. Done. He’d never have to think about it again.\nThe Miao were on holiday. Women wore their blue blouses with short skirts trailing with long, flapping ribbons, or ankle-length red and blue dresses. All the women’s clothing was dense with colorful embroidery and tinkling with silver, and all wore their silver torques. The younger women pierced their topknots with flowers. Mothers and grandmothers layered their torques with necklaces, and wore tall silver headdresses crowned with slender, curving horns. Silver everywhere—charms in the shape of flowers, bells, fish, and butterflies dangled from their jewelry, sleeves, sashes, and hems.\nThey were, in a word, gorgeous. Happy-laughing, leading children, carrying babies, holding hands with their friends, and among them, men of all ages in embroidered black, blue, and indigo. The men were also happy, also laughing, also embracing their friends, helping their children and elders. But the young women—ah. They caught his eye.\nZhang Lei retreated to the side of a corn patch, capturing compositions while watching the steady flow of arrivals. Some pinged for mobility assistance, and rode float chairs up the road, but most walked. Some eschewed the road, and ran uphill toward the guest house, making for the steep shortcut up the ridge. Zhang Lei followed.\nPaul, Prajapati, and Han Song watched from the studio porch. Zhang Lei joined them.\n“Jen Dla told me we can go watch the festival after supper,” Prajapati said. “It’s called Setting Free Your Daughter, or something like that.”\n“Setting them free from what?” asked Han Song.\nSix young women ran toward them, through Jen Dla’s cabbage patch.\n“Family control, I would imagine,” Paul answered.\nThe girls didn’t even glance up. At home, he never had to work to get a girl’s attention—nobody on the team did. Unless coach called a ban for training reasons, sex was on offer everywhere he looked. Here, he might as well be invisible. But then, he hadn’t exactly been making himself available. If the girls were being set free, and he was in the right place at the right time, maybe one of them would land in his lap. All he had to do was get them to notice him.\n“I’m going to the festival,” Zhang Lei said.\n“I’ll go too,” said Han Song. “I haven’t done enough exploring.”\n“We’ll all go,” said Prajapati. Paul nodded.\nAfter Jen Dla served them an early supper, Zhang Lei led the oldsters up the winding road to the village center. They admired the views from every switchback as if they hadn’t already had a week to explore, and examined every clump of flowers as if Paizuo wasn’t one big flower garden. Guests from the other studios joined them, which made the whole group even slower.\nZhang Lei was tempted to leave them all behind, run to the village center and see if the girls had been set free yet. He jogged up a few switchbacks, and then thought the better of it. Even the most adventurous girl would flee from a lone man bearing a disable button labeled KILLER. If he wanted someone to take a chance on trusting him, he’d better stick with the group.\nZhang Lei sat on a boulder at the side of the road and waited for the oldsters to catch up. They weren’t bad people. All three were kind and clever in their own ways. And patient. He’d been unfriendly but they hadn’t taken offence.\n“We should really walk faster,” Prajapati told the other two when they caught up. “We don’t want Zhang Lei to miss his chance with the girls.”\nZhang Lei grinned. “I could ping you a cargo float.”\nShe laughed and took his arm.\nThe roadside floating lights winked on, turning their route into a tunnel of light snaking up the mountainside. When they got to the village center, night had fallen. The courtyard was lit with flaming torches and in the middle of the crowd, a bonfire blazed, sending up a column of sparks to search the sky. Faces flickered with shadows. Silver glinted and gleamed. Laughter pealed. A singer wailed.\n“I don’t know when I last smelled something burning,” said Han Song.\n“Is that what the stench is?” asked Paul.\n“Wood smoke is the most beautiful scent,” said Prajapati. “Primal.”\nMost of the guests stayed on the courtyard’s edge. They joined a group under the mulberry tree, a gender-free triad of performance artists from Cusco Hab. Zhang Lei had seen them around the village. They always looked like they were in a meeting—heads down, conferring, arguing, making notes.\n“Have the daughters been set free yet?” Han Song quipped. “Asking for a friend.”\nThe triad laughed.\n“Apparently it’s only one daughter, and no, the ceremony hasn’t begun yet,” said Aiko, the tallest of the three.\n“Just one girl?” Zhang Lei said. “Then what’s the point?”\n“Shakespeare! One performer, one night only. The complete works.” Aiko was obviously joking but their face was perfectly sober.\nPrajapati grinned. “Don’t tease the boy.”\nAnother pair of artists joined them, a cellist from Zurich and an opera singer from Hokkaido. They seemed to know more about the festival than anyone else.\n“We won’t catch much of the performance unless the girl throws the switch on her translation balloon,” the cellist said in a low voice. “The one last year didn’t.”\n“Someone told me they translate in Kala, for the tourists visiting from Danzhai Wanda Village,” said Aiko.\n“Paizuo is more traditional than Kala. Which is why we come here.” The cellist shaded her eyes against the torches’ flare and scanned the crowd.\n“It’s better they don’t translate,” the opera singer said. “What the girl says won’t make sense if you don’t know the context. It’s more meaningful to watch the reactions of the Miao.”\nWith so many people in the square, Zhang Lei could only catch glimpses of the action. He put his viewcatcher on full extension, sent it a meter overhead, and switched its mode to low lux. Much better. The musicians were at the far end of the courtyard, near the bridge, playing drums and tall, upright bamboo flutes. The singer stood with them, wearing her silver headdress like a crown. Jen Dang and his family didn’t seem to be around. But he spotted the girl—the one who was being set free. She was alone. No friends, no fussing parents, no little siblings hanging on her arms.\nShe wore hoops of silver chain around her torque, a blue blouse and short black skirt embroidered with butterflies, and a woven sash around her waist. A deep red flower pierced her topknot. Her hands rested at her sides. She didn’t pick at her nails or play with her jewelry like Lunite girls. She looked prepared, like a goalie in a crease, waiting for the game to begin.\nHe zoomed in on her face. His age or a little younger. Pretty, like all the Miao girls. Tough, too. What would a girl like her think of him?\nNot much, he suspected.\nThe music stopped, the crowd hushed. The girl’s lips thinned in concentration. She stepped toward the bonfire and the circle of elders welcomed her into their arms. No drums this time, no bamboo flutes, no practiced wail from a powerful throat. The elders sang softly, their song a hum in the night, drowning under the buzz of the cicadas and crickets.\nNear the artists at the back of the crowd stood a mother with a baby clutched to her chest. She wore little silver, and looked upset.\n“Poor thing,” said Prajapati.\nThe woman scowled at her and made a hushing motion.\nZhang Lei waited for something to happen, some reason why the Miao were paying such close attention. The girl wasn’t doing anything, just standing in the circle of softly singing elders, eyes closed, face tight with concentration. Maybe nothing would happen—that was the point? Perhaps it was a test of her patience. It certainly was a test of his.\nAs he was considering sneaking away, the girl began singing along. Her voice was high, with an eerie overtone that pierced the sky. She sang higher and higher, drowning out the elders’ voices. The Miao were rapt, breathless. When she spoke—loud as if amplified—the crowd exhaled a collective sigh of wonder.\n“No translation balloon,” Aiko breathed. “Damn.”\nZhang Lei expected the crying mother to turn and scold them again, but she was pushing through the crowd, sobbing and holding her baby out like an offering.\n“Must be her dead husband,” said the cellist, quietly. “You see? They set the girl’s soul free to visit the spirits, and now she’s bringing messages back.”\n“Messages?” said Zhang Lei. “What kind of messages?”\n“Every kind. Instructions. Admonitions. Warnings. Blessings. What kind of messages would you send from beyond if you could?”\n“I don’t know, maybe something the girl could easily guess?” said Han Song.\n“Hush,” said Prajapati. “This is serious.”\nIt was serious. Zhang Lei didn’t even have to look up to know the new moon was watching him, the lights of its habs inscribed like a curse on the sunless black disc punched through the middle of the Milky Way.\nOn Luna, hockey was a blood sport. Lunar hockey was played at one-sixth gravity on a curved surface, with a Stefoff field to keep the puck low and snap players back to the ice. One of the major defensive moves was to disable the other team’s players. Clubbing with weighted carbon fiber hockey sticks resulted in a penalty, though all referees were selectively blind. Slashing with skate blades, however, was a power move. An overdominant team could cut their way through their opponents’ starting lineup, into the benched players and fourth-rates, and by the end of the fourth quarter stage an assault on an undefended goalie.\nDeaths were rare. Heads, legs, torsos, and groins were armored. Arms and throats were not. Medical bots hovered over the ice, ready to swoop in for first response, but rookies from the crèches quickly picked up scars, even playing in the recreational leagues. Anyone who remained unscarred was either a goalie or a coward.\nZhang Lei’s crèche manager had tried to do right by him, direct his talents so he’d have choices when he left the crèche. She nurtured his talent for drawing and painting as much as possible. But she was practical, too. Luna had far more professional hockey teams than artist collectives. All her children were on skates as soon as they could walk.\nWith powerful legs and a low center of gravity, Zhang Lei could take a hit and keep his speed. He could jump, spin, and kick. He could slice an opposing defenseman’s brachial artery, drag his stick through the spurting blood, and spray the goalie as he slid the puck into the net. The fans loved him for it. His teammates too.\nIt made him a target, though. He spent more time on the bench than anyone else on the team, healing wounds on his forearms. No matter. The downtime gave him the opportunity to perfect the rarest of plays—jump and spin high enough to slice a blade through an opponent’s throat. He practiced it, talked about it, drew cartoons of it. He gave up goals attempting it, which got him a faceful of spittle whenever Coach chewed him out.\nThen finally he did it.\nDorgon wasn’t even Zhang Lei’s favorite proposed target. He was just a young, heavy-duty defenseman with a loud mouth who wasn’t scared of Zhang Lei’s flying blades.\nHe should have been.\nDorgon bled out in ten seconds. The medbot wrapped him in a life support bubble and attempted a transfusion right there on the ice, but stumbled over the thick scars on the defenseman’s arms. When it searched for alternate access, Dorgon’s coach was too busy screaming at Zhang Lei to flip the master toggle on his player’s armor.\nWhose fault was it, then, that Dorgon died?\n“Your fault, Zhang Lei,” the Miao girl said. “You opened a mouth in my throat and my whole life came pouring out.”\nShe pointed to him, standing under the mulberry tree with the other guests. Heads turned. He should have ran but he was frozen, breathless as if in a vacuum. He might have collapsed without the tree trunk behind him.\nMarta? he whispered. Help.\nNo answer. Prajapati grabbed his arm.\n“Ignore her, it’s a trick,” she said. And then louder: “That’s not funny.”\nThe crowd parted to allow the girl a clear sight of him.\n“There’s nowhere you can go that I won’t follow. I’m inside your mattress when you sleep. Behind the door of your room, inside the closet. When you painted the Sklad arena, who do you think put the blood on the canvas? It was me.”\nShe raised her fists and swung them toward him, as if shooting a puck with a phantom hockey stick.\n“You’re fair game.”\nThe girl’s head snapped back. She coughed once, and began speaking her native language again. The crowd turned away.\nMarta? Answer me.\nPrajapati tugged on his sleeve. “It’s late. Walk me home. We’ll take the shortcut.”\nShe took his arm again, pretending to need it for balance on the rocky path, but in truth she was holding him up. Han Song and Paul trailed behind, talking in low voices.\nMarta? Marta!\nShe answered before they got to top of the ridge.\nSorry, kid. I was in a closed-session meeting. Total privacy veil.\nAre they coming for me?\nWhat? No. Is there a problem in Paizuo?\nZhang Lei groaned. Prajapati looked at him sharply. Worry lines creased her plump face.\nThey know who I am. What I did.\nWho knows?\nEveryone. And all their relatives. From all over. Dorgon told them.\nThat’s impossible.\nHe grabbed his viewcatcher, pinched off the last ten minutes of data, and fired it to her.\nWatch this.\nThe path descending the ridge was treacherous, lit by nothing but stars. If he’d been alone, Zhang Lei would have ran down the ridge. If he fell and broke his neck, he deserved it. But the oldsters needed his help.\nHe took Prajapati’s hand—warm, dry, strong—and used the fill flash on his viewcatcher to light each step while Han Song shone the brighter light from his camera down the trail. The two oldster men helped steady each other, Paul’s hand on the photographer’s shoulder. When Han Song slipped, Paul caught him by the elbow.\nYeah, okay, Marta whispered. Someone figured out who you are and told the girl. I’ll talk to the security team. Don’t do anything stupid, okay? We’re on this.\nWhen they got to the studio, Paul fetched a bottle of whiskey from his room. He poured four glasses and handed the largest one to Zhang Lei.\n“I found the news feed from Luna a couple days ago,” Paul said. “But I didn’t tell anyone.”\n“I found the painting,” said Prajapati. “I wasn’t looking for it, but the sofa was in the wrong place. I showed it to Paul and Han Song. It’s effective work, Zhang Lei. Palpable anguish.”\n“If you want to keep something private,” said Han Song, “don’t put it in the common areas.”\n“None of us told anyone,” Prajapati added.\n“So, how did the story get to the Miao girl?” Paul asked. The other two oldsters shook their heads.\n“Jen Dla?” Han Song ventured.\n“I’ll ask her in the morning.” Prajapati patted Zhang Lei’s knee. “Try to get some sleep.”\nThe whiskey burned Zhang Lei’s throat and filled his sinuses with the scent of bonfire. What kind of messages would you send from beyond if you could? Vengeance. Dorgon had watched and waited for his opportunity. The news would travel fast. Brawler teams were searching the county for him.\nZhang Lei poured the rest of the whiskey down his throat.\n“When they come for me, keep hitting my disable button,” he said.\nThe three oldsters exchanged confused looks. A whirring sweeper bot bumped Zhang Lei’s foot. He nudged it away with his toe and headed for the stairs.\nDon’t be so dramatic, Marta whispered.\n“When who comes for you?” Prajapati asked.\n“Let them do whatever they want to me,” he said. “Don’t put yourself in danger. But if you can, keep knocking me out. Please.”\nMarta sighed. Honestly.\nYou, too. Keep hitting the button. Whatever they do to me, I don’t want to know about it.\nHe climbed the stairs two at a time. If his life was about to be crushed under the boots of a Lunite brawler gang, there was only one thing he wanted to do.\nThe scarred face of the new moon glared through the high windows of the communal studio. Zhang Lei chose the largest of his prepared canvases and flipped through his viewcatcher compositions. The water buffalo lying in the stream. Jen Dang catching a fish. Ripening rice terraces under golden mist. Jen Dla carrying a pot of sour fish soup, a lock of hair stuck to the sweat of her brow.\nThe fighting cocks in their cages, separated by the corner of a house, their torn flesh healing only to be sliced open another day.\nHe flipped the canvas to rest on the long side and projected the composition on its surface. How to make the three-dimensionality of the scene clear in two dimensions—that was the main problem. Each cock knew the other was just out of sight. If they could get free, they would fight to the death.\nIt’s in their nature, he whispered.\nWhat nature? Marta asked. Oh, I see. Are you going to paint all night?\nI’ll paint for the rest of my life.\nOkay, ping me if there’s a problem.\nFirst, he drafted with a light pencil, adjusting the composition. The corner of the house dividing the canvas into thirds, with one caged brawler directly in front of the viewer and the other around the corner. It was a difficult compositional problem—he had to rub out the draft several times and start again. Then he began a base layer in grays, very lean and thin. What the old masters called en grisaille. Solve the painting problems in monochrome before even thinking about color. The texture of the wooden walls of the house, the figures of the birds filling the canvas with belligerence. It took all night.\nA few hours before dawn, Han Song brought him a cup of tea.\n“That’s good,” he said, squinting at the canvas. “I’ve got some pictures of those birds, too.” He settled at his workstation and sipped his own tea as he ruffled through his files. “You can use them for reference if you want.”\nA package hit Zhang Lei’s message queue—the only communication he’d received since leaving Luna that didn’t relate to his immigration status. The photos were good. Details of the cocks’ livid faces and dinosaurian legs, the pinfeathers sprouting from their bald backs, the iridescent sheen of their ruffs.\nHe added crimson and madder to his palette and used Han Song’s photo of the cock’s flayed wattle to get that detail exactly right, then moved on to the next problem. He thinned the paint with solvent to make a glaze. No time to wait for fat oils to oxidize, for thick paint layers to cure. In places, the paint was so thin the texture of the canvas showed through. That was fine. He would never be a master painter, but this would be the best painting he could make.\nHis friend’s photos helped. Gradually, color and detail began to bring the painting to life.\n“Thank you,” Zhang Lei said, hours later. Han Song didn’t hear him. Prajapati smiled from across the studio, her hands caked with clay to the elbow.\n“Don’t skip lunch,” she said. “Even painters need to eat.”\n“And sleep,” Paul added.\nSleep. He had no time for it. And Dorgon was in his mattress, behind his door, in his closet. He would join Dorgon soon enough, and next year, when Paizuo’s rice crop had turned yellow, they could scream public challenges at each other through a Miao girl.\nUntil then, there was only the work. Work like he’d never known before. As an athlete, he practiced until instinct overtook his mind. On the ice, he didn’t think, he just performed. In the studio, he used his whole body—crouching, stretching, sweeping his arms—continuing the action of his brush far off the canvas like a fighter following a punch past his opponent’s jaw. And then small, precise movements—careful, considered, even loving. But his intellect never disengaged. He made choices, second-guessed himself, took leaps of faith.\nIt was the most exhausting, engrossing work he’d ever done.\nThe eye of the cock flared on the canvas, trapped in the pointlessness of its drive to fight and fight and die. Zhang Lei hovered his brush over that eye. One more glaze of color, and another, and another, over and over until nobody looking at the painting could misunderstand the meaning of that vicious and brainless stare.\nPaul put his arm around Zhang Lei’s shoulders.\n“Come on down to lunch. The painting is done. If you keep poking, you’ll ruin it.”\n“Ruin yourself, too,” said Han Song.\n“He’s young, he can take it,” said Prajapati.\nThey fed him rice and egg, bitter green tea, and millet cake. No fish soup. No Jen Dla.\n“She’s giving birth,” Prajapati explained. “Went into labor last night. Brave woman.”\n“We should break out Paul’s whiskey again,” said Han Song. “Drink a toast to her.”\nPaul laughed. “Maybe. We have something else to celebrate, too.”\nThey all looked at Zhang Lei. His mouth was crammed with millet cake.\n“I don’t know. What?” he said though the cake.\n“Your button is gone, dear,” Prajapati said gently.\nHe swallowed, pinged his ID. Zhang Lei, Beijing resident. No caveats, no equivocations. And no button.\nMarta, he whispered. Is it done?\nThe notice has been sitting in your queue for half an hour. I pinged you when it came through. Looked like you were too busy painting birds to notice.\nAre the brawlers gone? he whispered.\nThey’re on their way home. They can’t touch you now and they know it. I don’t recommend going to Luna anytime soon, but if you did and there was a problem, at least you could fight back.\nZhang Lei excused himself from the table and stumbled out of the guest house. He skirted the cabbage patch and followed the trail to the pavilion, with its perfectly composed view. Up and down the valley, farmers walked the terraces, examining the ripening rice.\nHow? You said it would be weeks, at least. Maybe never.\nI took your painting directly to the tribunal.\nThat made no sense. His painting was upstairs in the studio, on his easel.\nThey were impressed, Marta added. So was I.\nI don’t understand.\nThe wet blood. Smart move. Visceral. The tribunal got the message.\nBlood?\nOn the ice. They brought in a forensic expert to examine and sequence it. That gave me a scare because I had assumed the blood was yours. Didn’t even occur to me it might be somebody else’s. If it had been, things wouldn’t have turned out so well.\nMy blood?\nI guess the tribunal wanted to be convinced you regretted killing Dorgon.\nZhang Lei leaned on the pavilion railing. A fresh breeze ruffled his hair.\nI do regret it.\nThey know that now. I’ll keep the painting for you until you get a place of your own. So keep in touch, okay?\nI will, he whispered.\nOn the terrace below, Jen Dang walked along the rice paddy with four of his grandchildren. The farmer waved. Zhang Lei waved back.\nThe author acknowledges the generous support of the Future Affairs Administration and Danzhai SF Camp.\nKelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica."}