{"fingerprint": "2D7T+C+WsXCQrZ+kYvGUAA0PfJY=", "sitename": "Clarkesworld Magazine", "title": "And Then, One Day, the Air was Full of Voices by Margaret Ronald", "author": "Margaret Ronald", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ronald_06_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: And Then, One Day, the Air was Full of Voices by Margaret Ronald", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5230 words, short story\nAnd Then, One Day, the Air was Full of Voices\nIt’s near the end of the first day of the conference when Randall shows up. I’m in the middle of the “End of a Zeitgeist” panel, waiting for one of the other panelists to wind up an interminable digression about SETI, when I see him at the back of the room, checking his glass. I meet his eyes, just long enough to acknowledge that he’s there, and he nods. He’s wearing a badge; he must have paid the money for a one-day pass, even though he can’t stand Coronal academics and the fringe element even less. Got enough of one from me, and enough of the other from Wallace, I’d guess.\nThe other panelist—I’ve forgotten his name—isn’t winding up, and because he’s remoting in he doesn’t notice the moderator casting irritated glances at him. “The mistake we’ve always made, it seems to me, is that we have always assumed that communication must be the same no matter whether human or xenosapient. The Corona Borealis informational space proved the exact opposite.”\n“That isn’t exactly true,” I interrupt. The panelist blinks; he must have assumed that I was zoning out. Safe assumption, these days. “The actual transmissions found in Coronal infospace are remarkably similar to what you’d find in a thirty-year slice of human broadcast media—in fact, what we find in most recorded communication: lists, transactions, announcements, stories. The context is different, but the content is similar. It was the method that was opaque.”\nHe splutters, ready to argue. But the moderator’s still young enough to be nostalgic, and she doesn’t like him any more than I do. “Speaking of opacity, Dr. Kostia, it’s really been your metaphor that’s driven most of our understanding of Coronal transmissions. Would you care to recapitulate it?”\nI glance at Randall and decide against drawing it out. “You’ve got to leave me something for the closing keynote,” I say, and get a chuckle from somewhere in the audience. “It’s a story for another time.”\nWrong choice of words. I can see that in the faces of the front row. The stories have all been told. The stories are all gone now.\n“Imagine a man in a bright room,” I say. It’s two days later, I’m giving the ending keynote, and bright room is a little too on-the-nose for where I am currently standing. I can barely see the edge of the stage past the lights, and I can only assume my images are up on the screens. “He wanders around the room, calling out, and wonders why there is no answer from outside. On that basis, he assumes that outside must be empty.”\nRandall isn’t here. I hope he’s home, with Brendan and the girls. I hope he’s had the sense to ignore all of this. I know I don’t have to hope, because Randall has always been the quietly sensible one of us, the one who empathized and cared and knew that the best thing to do was to steer his own ship. The Coronals had heroes like him, I know.\nMy breath catches in my throat. “Imagine that man,” I say again, and swallow. “And then, imagine his realization that if he stands close to the glass of his walls, blocking the glare of his lights, he can see through them. And there is someone on the other side, waving.”\nRandall waits for me to make my way to him through the departing audience. “Hello, Randall,” I say, and reach out for a hug.\nHe pulls me in, almost off my feet. “Hi, Ma.” It feels like hugging a cinderblock in a sweater.\n“Oof. Give me my ribs back, won’t you? How’s Brendan? How are the girls?”\n“He’s fine. Sinny made a picture for you—I should have brought it, I wasn’t thinking.” He shoves both hands in his pockets, checks his glass again. “Ma, have you heard from Wally at all?”\n“I’m rarely in touch with Wallace,” I say breezily, and it doesn’t even begin to mask the sting. “I’d hoped we’d see him at Thanksgiving this year.”\n“Yeah, that’s—I’d hoped so too, but he’s . . . ” He raises both hands as if to offer me something, then lowers them. “You know he’s with one of the—these groups.” He nods to some of the one-day attendees, two wearing carefully reconstructed Coronal jewelry, one with her ears pinned forward in what some idiot has claimed must be some resemblance to the Coronal cranial shape. There are always a few at any conference, but these are as hollow-eyed as the rest of us, their hope as extinguished as the empty lanterns some carry (a reference to a Coronal song cycle, and likely mistranslated). “Like the ones he was with in high school. And college.”\nI take a long, slow breath and let it out. College was news to me; I thought he’d gotten away from the cults when he left high school. “You think I’m likely to see him here? That’d be lovely. I mean it; I’d love to see him before November.”\n“No, I mean—not like the dress-up-and-sing-songs people. The group he’s with sounds, well, kind of scary-intense.” He lowers his voice. “Ma, he asked me if I had any access to Granma’s old cloud. I mean, I get descendant-right requests all the time, but they’re all from, you know.” He nods to the girls and to the man behind them holding a mandala-patterned banner. I think of Virginia and Denmark, and shiver. “And if he’s asking me, it has to be something that he doesn’t have first full descendant-right to, so it’s probably one of the ones Granma shut off from immediate request. Like the, the original Coronal code.”\nI do the thing with the breath again. “That’s . . . not good.”\n“Even if it’s nothing, I think—he sounded down, Ma. Real depressed, like back in high school. And I think about the, the news out of Virginia—”\n“Hush.” I put my fingertips to his lips. The room’s emptied out, but more people will be coming in shortly, and right now no one wants to think about mass suicides. The fringe because they want to distinguish themselves from that level of crazy; the academics because we’re guiltily aware we’ve contributed to it. “You really think he might?”\n“I don’t know. I’ve never been able to tell, with him.” Poor sensible Randall, beset on either side by the Coronals. “I know you can, though.”\nTo my shame, I think seriously about telling him I can’t go. It’s the middle of the conference, after all, and I have two more panels in the next couple of days, never mind the closing keynote. And it’s not like this conference will be happening again. “Where is he?” I finally ask.\n“On the coast.” I feel my glass twitch with the information he’s sent over. “It’s about a day’s drive. I’d go, but you know he doesn’t listen to me. Well, he listens, but it’s not like he lets it make a difference.”\nI can make it there and back before the closing keynote. Assuming nothing goes wrong. Assuming it’s not too late already. “Come on. Help me check my car back out.”\n“For those of you who were around for the initial signal—that’s, what, half of us?—you remember how much of a shift it was. Here we were, going along in our bright room, and suddenly this signal from ADS 9731 in Corona Borealis starts rewriting an entire high performance computing center.” I’ve told the story about that day so many times, and I’m suddenly tired of telling it. It’s the embellished version, anyway; I mostly knew something was up because the power went out in the base and I couldn’t play Puppy Duel on my dad’s tablet until it recharged. But the story made a good introduction, and I could still remember Mom’s face when she came out of lockdown.\n“Danforth and Rajasthani were the first ones who realized that the initial signal wasn’t an attack. It was, and is, the closest thing we have to semisapient code. When the signal came in contact—and by which I mean when it was recorded, replayed, and analyzed in an appropriately complex context—it did exactly what it was supposed to do. It changed our world, though that was really more of a side effect.”\nSomeone laughs, nervously. I ignore it. “What it did was to rewrite its surroundings—the computing center—and turn it into a receiver for Coronal infospace.” And then go dormant, for which my mother was grateful every day of her life. The signal in its dormant form was usable, understandable, replicable to the point that just about anyone could make their own access to infospace—and it didn’t go trying to rewrite anything. Mom once told me that some idiot had attempted to encode the Coronal signal into human DNA to see if it would perceive that as an informational context. Lucky for us all, either the semisapient code deemed it not complex enough or detected significant harm done in potential rewrite, so it just fizzled. But it gave her, and then me, nightmares.\n“There was one metaphor—I’m glad it wasn’t mine—that it was like giving a radio to a ‘savage.’ Strip away the racism, and there’s a grain of truth: because we had never known about infospace, we’d assumed there was nothing to hear. But now we switch that radio on, and we find that what was silence is now chatter. The air is full of voices. Strange voices, from four hundred light-years away.”\nThey’ve heard this before. Those voices are why they are here.\n“Incomprehensible voices, mind you. Do any of you remember those first few translations? I think someone set them to a dance remix when I was in junior high. But the second genius of the initial transmission was that it didn’t just convert itself into an infospace receiver; it made itself a translator for whatever linguistic context it was in. All of the Coronal communications—all of the drama, news, bulletins, pleas, shopping lists, everything that went out into their infospace—was so much clearer when viewed through multiple translations.\n“With every language I learned, I was able to focus my understanding of Coronal broadcasts, get a better sense of their original meaning. I would imagine the same holds true for most of us in this room. For decades, we have had the entire infospace of an alien civilization to investigate. And look at all the things we found!”\nI hold up the program, read a few names of papers. It’s a cheap trick, meant to make people feel as if their work hasn’t been for naught. I’d planned to say more about the smaller discoveries, the paths that Coronal Studies have made, as if I were pleading before the university trustees again not to disband the department. I don’t have it in me, now. My joints hurt from travel; my throat from shouting, even now; my eyes just hurt. I drop the program, and it slides off the stage. Somewhere behind me, I can almost hear the conference organizers frowning.\n“And yet there’s so much we don’t know.” And won’t, now. “We do not know what it means that so many of their family sagas ended mid-childbirth scene. Nor why their military might was measured in what translated to most Earth languages as moons. I personally have always wondered why in the Interleaf broadcast, the speaker repeats You are my taste, my tongue, my scenting organ. It obviously meant something. But like an inscription in a secondhand book, that meaning is lost.”\nSo much of what I’ve had from my second son has been secondhand. So much lost.\nRandall apologizes again for not bringing Sinny’s drawing, asks what I’m going to do now that the department is closing. I haven’t told him my real plans. I think once he finds out, he’ll be just as worried about me on some level as he is about Wallace. We make our way out, through the protests, the crowds, the gawkers, and I give Randall a goodbye kiss.\nI start driving up the coast. I used to drive this way with the boys on vacation. And earlier, coming up this way with Mom and Dad, hearing them argue about infospace, whether it could be anything but a hoax, how much work it would take to make such a hoax, why her computing cycles had been co-opted by Danforth and Rajasthani and why was Rajasthani such a bitch anyway. (They were colleagues, not friends.)\nThis far off the interstates, there are still billboards: Cathedral Mountain Retreat/Divinity Center (with Coronal Meditation removed so recently the shadow of the letters is still there); Legal Advice? You Deserve More; Samaritans—We’re Here to Listen; Apple Picking and Hayride—You Just Missed Us. Book for Family Events! Next Exit! It’s Not Too Late!\nIf I were on the interstate, I could pull down a screen to block those advertisements from view; as it is, I read each as it goes by. After a while, I make myself spell out alphabets from them, one by one. Another game from those long drives.\nI’m doing that breath thing again. It’s not as if I have to psych myself up to say this. It’s nothing new. “About sixteen, seventeen years ago, I noticed something off about Coronal infospace. I didn’t point it out at the time mainly because I thought I was projecting. Coronal communications are so easy to reinterpret to fit the details of whatever the interpreter is concerned with, and right then I was very concerned with death.”\nSilence. The organizers are probably in the wings now, trying to figure out whether to cut my mike; I must sound like I’m going confessional. Well, so I am. “Both of my parents were dying at the time, Dad from a slow-escalating kidney failure, Mom from ovarian cancer that threatened to overtake Dad’s timeline. I had doctors’ appointments and hospice preparation and PTA and soccer and meetings and meetings and meetings . . . and whenever I reviewed infospace, I kept seeing the same things.\n“The official broadcasts had shifted a little, more reassurance that all was well, that citizens should be aware of their risks, that all was well. It’s just a stomach cramp, don’t worry. No, I don’t need to get it checked out. I’m fine.\n“Local transmissions were less sanguine, sometimes directing emergency services, sometimes eliminating entire subjects or regions from their discussions. I don’t want to talk about it. I’m seeing a doctor, and that’s all you need to know.\n“Occasionally there would be sudden bursts of frantic activity, calls for help. We’d gotten used to that, but these—there wouldn’t be any follow-up. No answer to those calls. This is a lot to put on you, but here’s what’s happening. I’m sorry. I’m sorry.\n“The music and art had always been diverse in subject and style, but there seemed to be a melancholic, pensive tone to much of it now. Well, you get to a certain point, and you know there’s fewer days ahead than behind. How does that one poem go, the one about regret?\n“Individual communications had always been a very minor subset of the transmissions, but the few I followed seemed to be Coronals reaching out for each other, trying to find each other, holding on. Sit with me here a while. This is nice, isn’t it? I’ve always been so proud of you.”\nMy eyes are watering. “I was, at the time, very aware that I was reading my parents’ deaths into infospace. I hoped it was just me.”\nHalf of the conference is on flow; I tune the car’s glass to mine and let presentation after presentation eat the road. “Linguistic Difference in a Cross-Section of the Early Conquest Dramas” derails pretty quickly, assuming that the Conquest Dramas are a purposeful corpus rather than a loose grouping of similar works. I can’t watch the visuals on a road like this—I have to keep watch on the road—but I can imagine the expressions of the attendees. “Infospace as Archive? The Purpose of Coronal Transmission” tries to claim that infospace was meant as a sacred repository, rather than what they had available—like assuming we used radio out of worship of a sky-deity.\nI pull into a rest stop after the day closes with “Marking Time: Signatures in Coronal Rhythm-Intensive Music,” and none too soon; Coronal music does not translate well, and it’s always made me drowsy. My glass wakes me before dawn, and after I return from a trip to the restrooms the early-morning presentations have begun with “Fear of the Other and Governmental Responses to the Initial Signal.” My bones hurt even more now, and it takes me a couple of minutes to fold myself back into the car, more to make myself eat a breakfast muffin from the vending machines.\nI reach the address Randall sent just after noon. The sign used to read COSMIC ILLUMINATION MEDITATION RETREAT, but it’s been papered over poorly with a crude poster of a hand holding a torch. I don’t know which worries me more.\nIt’s a small cluster of houses, close to the ocean, probably once a little resort before its cosmic phase. There’s a big, bare circle in the middle, not a parking lot as I first think. I get out and see it’s a sand painting, or rather dirt painting, gravel raked into a crosshatch pattern that I recognize. Infospace didn’t have visuals for the most part, but many broadcasts described mandalas like this.\nI think of the images from Virginia, the painted mandala on the concrete and the bodies laid out carefully around it, the similar images from Malawi, from Honduras, from Denmark. There are people walking around the houses, some talking expressively, waving their hands; some pumping water; one or two regarding me with curiosity.\nI march up to the women at the pump, absently identifying the language they’re speaking as Finnish. “I’m looking for Wallace,” I say. “Estin Wallace.”\nOne of them has the pinned-ear look; the other is wearing a gauze skirt and blouse, what my mother would have called another goddamn hippie and my father tried to capture in paint. Both of them wear glass, though, and they don’t bristle at my presence. The End of Speech cult, the one that Wallace got involved in when he turned seventeen—they scorned anyone who actually knew Coronal studies instead of “sensing their way through them.”\nPinned-ears looks me up and down. “Main house. Top floor.” She adds as I start to walk, “You look like him.”\nI don’t know what I’m expecting inside the house. There’s what looks like another mandala in the foyer, this time in brightly colored sand that’s been tracked over several times, and a rack of servers in the dining room, with fans running next to them. I step around the mandala, thinking that the one rack probably has all the computing power of my mother’s old research center. Changes, not all driven by the Coronals.\nTwo people are arguing in Urdu on the second floor. I catch the gist of it: wide-band transmission versus focused, which way to point. One of them sees me and waves absently, as if I belong here. In another life, I might have. But not now. And not Wallace.\nI pause halfway up the last set of stairs to catch my breath. Someone’s painted in straggling letters: WE REMEMBER WHAT HAS BEEN FORGOTTEN. I can’t carry him out of here; haven’t been able to pick him up since he was six. I could, I suppose, call the authorities and try to have him involuntarily committed, try to have them all committed. Better that than the quiet circle of poisoned bodies. I tell myself that, and know I’m rationalizing whatever unforgivable action I’ll take.\nI can’t stop crying. It’s a gift, I suppose, that I can do it without my voice going all to pieces, but it’s noticeable, and the audience’s silence has an embarrassed, horrified quality to it. “It became clear what was happening soon enough. Even if we denied it. And now we were stuck behind the glass, watching this new civilization, this new contact, these new friends we’d come to study and mimic and love—watching them die.\n“And we could do nothing. We weren’t just separated by some metaphorical glass. We were separated by time. Everything that had happened had happened four hundred years ago. Scream and cry and pound on the glass as much as we tried, the Coronals were already dying. Already dead. And we heard every moment of their deaths. The wars. The plagues. The pleas for help that never came. The litanies of the dead.”\nSomeone in the back of the auditorium makes a sound like a sob. I blow my nose, but my eyes are still streaming. “I still remember when one idiot physicist made a comment that, well, at least the Fermi Paradox still held; it’s just that sapient races kill themselves off before they develop space travel. Gallows humor, but he still took quite the hit from that, professionally speaking. But he wasn’t wrong.”\nMy son is alive when I see him. He’s also wearing only pajama bottoms, hunched over a keyboard on his lap, typing with one hand and eating cold scrambled eggs off a scratched camp plate with the other. He must have shaved his head not long ago; it’s all bristly now, like when I gave the boys buzz cuts after their brush with head lice in elementary school.\nHis entire back is covered with mandalas, one after another, all the different interpretations of the Coronal descriptions. Burned—branded—on top of them is a hand holding a torch.\nMy step creaks the floorboards, and he waves one hand behind his back, scrambled eggs falling from his fork. “Harris, can you tell Zahra that I’ve almost got the reambiguation figured, if she’ll just give me another week?”\n“Wallace,” I say. I don’t even have to take a deep breath to do it.\nHe drops the fork and spins around, kicking aside plate and keyboard alike. He stares at me for a moment, then scrambles upright. He’s not as tall as Randall, never has been, but they’re both taller than me. “Ma.”\nI’m too worried to smile. “Yes,” I say, and stop. What do I say? I’m here? I found you? Please don’t go, the Coronals aren’t worth it?\nHis shoulders go down, just a little bit. “Randall told you I was here, didn’t he?”\n“He did,” I say. “He worries.”\nWallace shrugs. “It’s what he does.” He bends and sorts through the mess at his feet, finding a shirt with TOUCH THE STARS—8TH ANNUAL silkscreened onto it. “I think he thinks we’re some kind of death cult.”\nHe straightens up as he says the last, and he sees my face. “You’re not?” I manage, because he’s already seen as much in my expression. “The mandalas—”\n“The mandalas are important, Ma. That we may remember what has been forgotten.” The last has the sound of catechism, and I can’t help rolling my eyes. He looks up at the ceiling, and I think of far too many Thanksgivings where we talked past each other. This is going to be another one of those fights. “You seem so determined to forget that you’re willing to let them close the department.”\n“I don’t see how that’s relevant,” I say, but it’s a sore point, and I take the bait. “Besides, it’s not about forgetting.”\n“Then what’s it about? You’re just turning your back on what we have of the Coronals? You’re letting the university—”\n“There are other Coronal Studies departments.” Withering, yes, but holding on in the same way that departments allow specialized study of Ottoman textiles or obscure Scottish poets. “And don’t change the subject. My job is my own. This—” I gesture at the mess, “—is, I’m assuming, your new job.”\nHe glares at me, nudges the plate of eggs away with one foot. “Yeah. So maybe it is.” I brace for the defense, but he doesn’t bother with it, instead straightening up as if he were giving a presentation. “Ma, I need a favor. I need access to Granma’s cloud.”\n“There’s nothing in it. Nothing that isn’t public.”\n“No, there is. I need the initial signal. The originating one, the one that rewrote her research center, before it went dormant.”\nI think of my mother, of the cancer rewriting her DNA. “There’s nothing there.”\n“That’s only what you say because you don’t see.”\n“I don’t need to see! There’s nothing to see! You can re-run the translator as many times as you like, and it’s not—”\n“Ma—”\n“It’s not going to show you anything new! It’s just going to give you the same old signal, the same things we heard, the same things that aren’t there any more!” Now I’m shouting. Guess it was my turn to start this time. “You can’t tune it, you can’t adjust it—it’s done, Wallace. It’s done, and maybe your friends here with their mandalas and their slogans, they can screw around with their cosmic bullshit, but you are better than that! I will not let you waste yourself like that!”\n“It’s not a waste, Ma!” He puts his hands to his head. “It’s never a waste! Jesus, why is this so hard to understand?”\n“There’s no one there!” The words come out, and I put both hands to my mouth, as if I’ve said something obscene. The argument downstairs has stopped; I’m pretty sure they’re listening. “No one,” I repeat. “It’s all silence now.”\nWallace shakes his head, slowly, the way I would when I was sick of the arguments. His turn, now.\nI make myself stop, make myself draw a new breath. “Could someone shut off the slides? Thank you.” One nervous laugh, somewhere at the front. Everyone else is silent. They don’t like seeing someone cry in public. Nobody does.\nI think about what I want to say, what I’ve said already elsewhere. “It’s all silence now,” I say. Somewhere in the auditorium, I’m certain people are shaking their heads, not quite the way Wallace did but with the same determination.\n“The air is no longer full of voices.\n“Or, rather, not the same voices.\n“This is the one thing the Coronals did for us that we don’t even think about any more. Every one of you, every one who has bothered to do more than a cursory study of Coronal infospace, is a polyglot. We had to be.\n“This is the gift they gave us. Not the knowledge that we were not alone. We have never been alone. To understand them, we had to understand each other.”\nWallace shakes his head, slowly. “It doesn’t have to be silent.”\nI’m about to snap at him, to tell him that I have spent my life on the Coronals and if anyone would know silence, it is me. But I don’t. I don’t know why I don’t. Maybe I’m just tired from the drive. “There aren’t any other transmissions in infospace,” I finally say. “I know whole arrays that have been searching for anything since before the Coronal collapse. There’s nothing.”\n“Not from them. From us.” He nudges the keyboard with his feet. “We’re—all of us, here, we’re trying to repurpose the original code. So we can send out our own into infospace.”\nIt takes me a moment to realize that he’s not talking about every other attempt to use the code, to strengthen it or tune it or seek out more information, more voices in the static. “You want to broadcast,” I say slowly.\n“Not quite. We want to repurpose their tool and make it ours, and then broadcast. I mean, they’re dead, and we signed on much too late, but if we—if there’s someone else out there too, maybe they can hear us.”\nI stand very still for a long moment. Below us, I hear the Urdu argument start up again, not nearly so vehement now. “Have you thought about the entity extraction issue?” I say finally.\n“It’s not as much of a problem as you might think. Here, take a look.” He picks up the keyboard, pulls down a screen, and code fills the air. “The original signal was expansive-reductive, taking one set and expanding it to many. We think if we can train it another way, it can work with many sets at once, so we don’t have to restrict our infospace broadcasts to one language. It’s semisapient, so it really is like training, but the base code . . . ”\nHe goes off, and I think about my mother staring at her own lines of code, convinced it was all a hoax but one she’d go along with for now. It’s opaque to me, but Wallace swims in it.\n“We’re getting close—well, closer. Beatriz thinks we have only ten years to go, instead of twenty. But if we had Granma’s records, it’d give us a clearer idea of how the signal is supposed to behave when it’s active, instead of its dormant state, which is all we have to work with now. It’s only a, a receiver. We need to make it a transmitter again. A whole technician, if we train it right.”\nHe looks alight, the same way Randall does when he’s with Brendan. I step back. “I’ll deed you the cloud access,” I say. For a moment I consider inviting him to drive back with me, but eight hours in the car are pretty much guaranteed to destroy any détente we currently have. “Let me know if you need anything else.”\nWallace stops abruptly, as if he’s just remembered who he’s talking to. “You don’t have to go.”\nI smile at him. “Did Randall tell you what I’m doing, now that the department’s closing down? I’m going back to school. For a fine arts degree. Poetry.”\n“That’s . . . not what I would have expected.” He stops, takes a deep breath, lets it out. “Good luck.”\n“I’d like to speak to the other half of the audience now. Those of you who grew up in a world where we knew for a fact we were not alone.”\nRandall, Brendan, and their girls. Abrams and Lucienne from the department, Sadako who is our last Ph.D. student and has still soldiered on, Martinez with the giant paintings, and Park with the Opera based on Coronal texts. All the ones who passed through my hands, who went on, who continue on without me.\nWallace, my Wallace, so sad and determined. I am so proud of you, of all of you.\n“You have never known a world in which Earth held the only life in the universe. Everywhere, you have heard the voices of a world far away. Now you have to hear the nearer voices. I want you to hold on to that knowledge, that certainty that we are not alone. We have never been alone.\n“We will never be.”\nI step down, out of the light. My glass vibrates, and I check it to see a set of messages turn up.\nW: good speech ma randy sent me the flow\nR: did not. the girls got to listen. Sinny drew a new picture for you.\nW: i have some old antholgies if you need textbks\nIt’s a start. I lower my glass and let the organizers walk me back out on stage."}