{"fingerprint": "7AgM72OuepQE0h6mLVAYd00kmFs=", "sitename": "Clarkesworld Magazine", "title": "Sunlight Society by Margaret Ronald", "author": "Margaret Ronald", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ronald_03_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sunlight Society by Margaret Ronald", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4470 words, short story\n Sunlight Society\n When the Fourth Street biolab went up, I didn’t think of Casey right away. I was working in the far side of the complex, which meant I was one of about four hundred people who got to see the entire dome rise up off its foundations, rotate counterclockwise ninety degrees, and shoot up into the sky. My immediate reaction followed the same pattern as everyone else: first What the hell, then, just before a needle of light vaporized the biolab, Are those people up there?\n I could hazard a guess at the second question; I’d gotten that far into the shadow organizations, even then. I knew enough to guess at the identities of some of the blurry shapes darting through the smoke, shapes that official press releases would call confabulation and that the conspiracists would call aliens or Muslims or Freemason-built androids. The shadow orgs had been sloppy that time; usually they didn’t like to be seen at their work, but there’d been so little warning that they’d had no choice but to break out the big guns. Literally, in this case.\n But that wasn’t what came to mind as I stared up into the sky, the glare of that solar blast fading bit by bit from my retinas, my nethead links relating the intensity of that blast, the projected knock-on effects on the rest of the Niobe web, the first stirrings among the dataminers. Instead, I just thought Casey would love this. I kept coming back to that thought over the next few weeks, even after word got out about the low-rent terrorists who’d gotten so close to taking over the biolab that vaporizing the whole place was the only alternative. Even after the arrests started.\n I still think it’s true.\n Today marks the first time I’ve been allowed into the Albuquerque facility. My credentials have been checked and re-checked so many times that they could probably tell you the weight and density of my last three bowel movements. Even so, they’ve been cutting corners on security, just so they can get me in here.\n I fully expect that within twenty years, someone will have figured out a way to install nethead technology in anyone regardless of individual brain structure. But until they do, I’m pretty much guaranteed work wherever I go. And there’s even fewer of us netheads with the proper security clearances to get into the Madison facility, let alone Albuquerque. I’m a valuable commodity.\n The facility isn’t much to look at: any decent biolab would have more apparent security. My nethead links are telling me otherwise, though; streams and warnings buzz against my skull so hard I can almost feel my teeth rattle. It unnerves me in a way that Madison didn’t, and Madison’s where they keep the host site for the Niobe satellite web. Enough solar power to—well, to blow up a biolab, for instance—focused onto the energy collectors for five dozen countries, and it’s still less well protected than this place.\n It’s cool and dark inside the guard shack, and the back of my neck prickles after the blazing heat outside. The guard’s got a laser sight wired into his left eye; the silver tracery of it fades into his pale complexion much more smoothly than the similar patterns on my own skin. He gestures to the marks while the machines verify my ID. “Looks nice.”\n “Thanks.” It’s striking, or so the nethead PR department says. They claim that’s why they want my image for their publicity stills, not just to provide the illusion of diversity. Some days I think they even believe it.\n “Been here before?” The guard knows I haven’t—a glance at the screens could tell him as much and more—but sometimes courtesy trumps efficiency.\n I shake my head. “I’ve been to Madison.”\n “Madison, pfft.” He grins. “That’s nothing to what we got—” He stops and turns red, as if he can’t quite believe what he’s saying. I used to have that reaction, way back when I was sharing what I knew with Casey, when I tried to tell her that the comics we’d read were—well, not true, not close to true, but had some basis in reality.\n “Got what?” I ask, as the computers spit out my ID and agree that yes, my fingers and retinas appear to be my own.\n “Well, you know. Them.” He opens up the doors, and the flickering readouts in my periphery flare and scramble into new configurations. “The heroes.”\n The official story of Casey and me is that we were kids together, grew apart, came back together, screwed around, and then split up for good once I realized how crazy she was. Both times it was the heroes that brought us together, the first time through the comics that had come out in the wake of Maxentius sightings and the rumors about the Sixth Seal group. We read them all, regardless of quality, lying on our backs in the vacant lot behind her house, ink on our fingers and intent discussions of whether Mistress Fivepoint could beat Jack o’the Green or if they’d just team up against Memetek. The second time it was because in my first months as a full nethead I learned so much about the shadow organizations, the reality behind all those rumors, and I could only think of one person I wanted to share that with—Casey, who could rattle off the Liberty League’s oath or Red Knight’s transformation mantra as easily as the Pledge of Allegiance.\n Both times it was her head, or what was wrong with it, that split us up.\n It’s a useful official version. But one thing you learn when you start getting involved in the shadow orgs is that the official version means very little. After all, none of them show up in any official version, except in the records of what didn’t happen, the plots that failed, the disasters averted.\n Or, sometimes, in the lists of people who’ve disappeared.\n The transport behind those metal doors takes me maybe eight floors down, with that bone-twitching stutter you only get from passing through negation fields. I don’t notice it; I’m too busy dealing with the sudden silence in my head. I can handle it—mental stability is one of the most important factors that they test for in determining nethead fitness—but that doesn’t mean I enjoy it. Particularly because the one link that does remain is the one that got implanted when I started working for the shadow orgs. For insurance, they told me. The Niobe GPS link.\n I remember the Fourth Street biolab, and the back of my neck goes abruptly hot again.\n When the doors open again, though, all thoughts of the world outside vanish. The visual input’s bad enough: between the scream of light on my right from what might be a laboratory and the dizzying drop twenty feet ahead of me, I can barely register mundane details like the polished-glass sheen of the floor, the central spindle of memory staves, the man waiting for me just to the side.\n But all that’s nothing compared to the chatter of computers on every side, the information in patterns I’ve never seen before. It’s like being picked up from one set of rapids and dropped into another, and it takes all of my concentration not to drown.\n The biggest difference is that there’s not much trace of nethead work. It’s tradition to leave our marks on the usernodes, stegans encoded into the streams of data like graffiti in a canal, but here there’s only two: Klaatu Barada Nikto! from the designer of the Niobe web, and Welcome to Olympus (plus a handy map) from a woman who’s now on permanent detail with the Secret Service. If this were a normal job, I’d be tempted to add my own mark to the tabulae, but right now I don’t trust what I’d leave.\n A permanent link unscrolls with the boxy look of official work. IN RESIDENCE: Kazemusha/Lady Nettle/Oculus/Matthew Glendower/Maxentius . . . The list goes on, code names and real names (not that it matters which is which, this far in) and designations I’ve only seen in the most hidden records. Names to conjure with.\n And finally I recognize the man who’s been standing just to the side of the entrance. They’ve sent the shining face of the org to meet me.\n He’s just like Casey and I always imagined, resplendent in ivory and gold, and while he doesn’t have the red cape the comics gave him, I get the sense he’d like one. Barrel chest, brilliant smile, voice with enough bonhomie for a tri-state area. “Bit overwhelming, eh?” Maxentius says.\n “A bit,” I agree weakly.\n “It does that to me too, sometimes.” No it doesn’t, I think, but he’s not talking about the information overload. He gestures to the vista behind him: dozens of circular floors leading off a central shaft, lifts and elevators between for those who can’t just fly. “This sight—when I tire of it, then I’ll know the skein of my days has run out. Good to meet you, Seth.” He clasps my hand and shakes it vigorously.\n “Good to meet you.” I’ve read papers on how much force that hand can exert, how many diamonds it can crush into powder.\n “And you’re here to see Glendower. Splendid.” He turns and strides forward across the gleaming floor. I follow, and if it looks like I’m not gawking, that’s because I’m only doing so in my head. Of the levels I can see, some are sterile white and glassed in; some hold weapons and implements I can only guess at; a few look inhabited, homes for those who can’t or won’t stay outside in the world they claim to protect. A blur on the next floor up, across from us, resolves into a sparring match between two figures I’ve only heard rumors of, and even then I have to slow the visual down by a factor of ten to get a glimpse.\n At the far end of the walkway, Maxentius glances over his shoulder. “Come along, lad! Mustn’t keep him waiting!”\n Of all the members of the shadow organizations, Maxentius has read too much of his own press. He really does talk like a comic book; ‘lad’ is nothing to worry about.\n Still, it bothers me, and not just because I can remember one too many cops calling my father ‘boy’ on one too many late-night drives.\n There are some things I know for sure about Casey: she loved superhero comics; she didn’t keep in touch with her family after graduating; she wrote pamphlets for the Oakland Anti-Gnosis society; she couldn’t keep a job for more than six months at a time; she could make fantastic biscuits out of damn near any ingredients she had at hand. When her parents moved away the first time, when we were in school, it was because the first round of mandatory testing had come through. I was on the track to being a fully-functional nethead; Casey had tested positive for a number of dysfunctions, including predisposition to schizophrenia.\n There are things I wonder about—whether the chemical imbalances in her brain were caused by her father’s exposure to some of the nastier weapons of the Second Chinese War, whether she knew what a risk I was taking associating with her, whether we should have gone ahead and slept together after all.\n There are things I’ve been told about her in the wake of Fourth Street, about her mental state and the company she kept. These are things I will never believe about her.\n Maxentius leads me around one side of the silo shaft, through what looks like a trophy room (it’s not, according to the nethead stegans). He’s rapidly figured out that I’m not listening to him, but that doesn’t stop him; in fact, I think he’s taken it as license to ramble on.\n I catch a glimpse of someone I think is Pale Rider down one hallway. If it is him, that means this particular shadow organization has gone global. Most of them have; a few nationalists cling to their identity in places like Turkmenistan and France, and somehow I’d always assumed the U.S. shadow orgs would be the same way.\n Of course, they have the Niobe web. That automatically makes them global; I’ve got the reminder in my skull if I ever forget that.\n We walk past cases holding remnants of past work, plots unraveled, events that were hushed up and now only remain as a footnote to history. Still talking, Maxentius gestures vaguely at what looks like a giant pair of shears. “ . . . didn’t tell us that the phase shift had affected only half of her, and the other half was stuck in another dimension entirely!” He chuckles, and I remember to smile. “Down this way. Glendower, are you there?”\n A gray-haired man in a white shirt and bow tie—there’s even a tweed jacket, the kind with the elbow patches, tossed over a chair—waves back without looking. He’s talking to a woman I don’t recognize. I wouldn’t know her if we met on the street; I’d only know her if she wore her mask. She folds up her clipboard, nods to Maxentius, and fades into invisibility with a faint scent of calla lilies.\n Glendower’s in his late fifties but looks older. He walks with a cane, and while he doesn’t have the same build as Maxentius, he’s not a small man either. His gray hair is still thick, but there are autofocusing spectacles perched on his nose, and when he pulls a chair over and sinks into it, it’s clear that standing for so long was a strain for him. He’s the one who pushed through my security clearance, since the virus affected the orgs’ datalogs and he’s the one who has to work with them. Bookkeeper to the gods. “Well, Mr. Carson, what do you think of our little home?”\n “It’s amazing,” I say, truthfully, and then a touch of the perverse prompts me to add, “if a little rough on visitors.”\n To my surprise, it’s not Glendower who answers, but Maxentius. “The price of our work,” he says with a regretful sigh. Maxentius doesn’t hide his feelings much; the man’s all surface, glossy and deep as a four-color page spread. “These days, to defend the innocent requires one to have a home of which all are innocent.” He sees my expression and shakes his head. “I assure you, lad, we’re all on the same side here. We are protectors of the world we love, sworn to defend it.”\n He’s entirely serious, and of all the members of the shadow orgs, he embodies those values the most. And yet I can’t help myself. “’To protect the weak, the innocent, and the defenseless from the indignities, wrongs and outrages of the lawless, the violent and the brutal,’” I quote. Glendower shoots me a sharp look.\n Maxentius, though, hasn’t noticed. “Yes! Exactly.” He shakes my hand a second time, beaming, and nods to Glendower. “I must be off. Good luck—I hope we’ll see you here again.”\n I watch him go. He rescues kittens; that much is a matter of record. It’s part of why there’s now a cleanup detail assigned solely to him. The shadow orgs may prize their secrecy, but Maxentius does make a useful distraction. And, after all, they are all on the same side.\n I shouldn’t have made fun of him. It’s not his fault he’s an innocent.\n Glendower’s watching me, but unless he’s a nethead—and I know he’s not—he can’t see everything I’m doing. “I’ve set up a contact terminal for you,” he says. “We’d been meaning to change out our security, but good netheads with clearance are few and far between, and I’m afraid we were caught with our trousers down. The virus doesn’t seem to be actively hostile, but my projections show it stopping work outright if it overloads any more of our systems. At the moment it’s benign, just irritating.”\n “I can imagine.” Twenty years ago, we’d have been fine with a microsecond lag; forty years, and a five-second lag was nothing. But technology spoils us—I should know, I’ve got a few dozen terabytes’ worth of it in my head. I switch from wireless to node work, and put my hands on either side of the contact terminal, relying on the points wired into my fingertips to carry me in. “I can upgrade some of your security while I’m here, but it’ll just be a patch-up job till I can come back, and I don’t yet have clearance for a second visit. You sure you couldn’t fix it yourself?”\n Glendower shakes his head. “It’s rapidshift. I just don’t have the speed to keep it from mutating as I’m working on it. That’s nethead work.”\n Of course it is; I created the damn virus. My consciousness is already split between the terminals that dot the base; I damp wireless input to make up for it and start searching.\n Glendower waits for a response from me, then shakes his head and laboriously gets up from the chair. He’s got a pacemaker; I can sense the pulse of it like a cricket in the room. “It’s rare to have a nethead down here,” he says, opening a cabinet and pouring a glass of tonic water. “I had to argue just to get the first few working on our security.”\n “You’ve got failsafes in place, though.” Those failsafes gave me nightmares for weeks, after I first found out that the Niobe web wasn’t just for solar energy.\n “True.” He pours a second glass and sets it on the shelf next to me. I nod my thanks but don’t take it. We’re both silent a moment; realtime maybe ten seconds, wiretime much longer, long enough for me to cordon off my virus and distinguish the main archives from what I’m looking for. They don’t let these out to the general public; they don’t even have access through the Madison facility. The Oculus records.\n “You didn’t need to tease Max like that,” Glendower says quietly.\n “Probably not.” I’m sorting through records, searching by time, date, subject, even setting aside a part of my brain to flash through random stills, looking for Casey. Oculus’ uploads take up entire spindles; I’ve heard that no one knows why it records everything it sees, but they don’t want to upset it by asking. “It just bothered me.”\n “When he finds out you quoted the mission statement of the Klan at him, he’ll be a mess. Max doesn’t work well when he has a crisis of conscience.” He settles back into his chair with a grunt, and tonic water splashes over the back of his hand.\n “Then he’ll only be saving the world eighty percent of the time. I’m sure the rest of you can cover the remaining twenty percent.” Something about the virus cordon is bothering me, but I’m so close—and there she is, Casey’s face blurring by, the brief video record categorized with about four hundred others, each no more than a couple of minutes.\n “Would you be willing to help out with that twenty percent?”\n I stop, sliding Casey’s record into my personal memory like a shoplifter sliding a necklace into his pocket, and turn to face him, keeping one hand on the contact terminal. “Sorry?”\n Glendower smiles and thumps his cane on the floor. He needs that cane, I know; an accident when this place was being built wrecked his right foot, and he hasn’t had it replaced. “If nothing else, this incident highlights our need to have a nethead on the team. You’re the best, you’ve got the offline intelligence we need, and you’ve shown great discretion in your work for us here and in Madison.”\n Discretion. Right. Which is why I’m now fixing a problem I created. It’s tempting, though—I can imagine Casey saying Who wouldn’t jump at a chance to be a superhero? Or is it only that I want her to say that?\n I unpack Casey’s record for later viewing, thinking of the smell of hot dirt in the vacant lot and four-color ink smudged across my fingers. “Let me think about it.”\n “Well.” Glendower sighs, then leans over and sets his glass down on the far terminal. “I understand, you’ve got doubts. After all—” the screen behind him lights up, “—I think I know why you’re here.”\n Casey stares down at me from Glendower’s screen, twenty times larger than life, and I finally recognize what the virus report is telling me: someone, probably Glendower himself, got to it first. I stare at Casey’s image on the screens—an ID photo, not a mug shot. They’d only had mug shots for the ones who’d gotten arrested, and Casey didn’t even make it that far.\n Glendower nods. “She was important to you.”\n “She was.” I open the video record that I went through so much to find. It’s only about twenty seconds’ worth of Oculus’ point-of-view, showing a door bursting open. Casey crouches at the far end of the room, frizzy hair tied up in a bright red cloth, eyes wide and dark.\n She’s just as I remember her.\n The record shows her turning and reaching for something—a gun? a phone? a vial that could be her medicine and could be something else entirely? All of them are on the same table. She never even touches it before a flash of light from the door cuts her down.\n I close my eyes, then open them to face Glendower, and behind him, Casey. “You knew?”\n “We’re everywhere, Mr. Carson. We knew.” He looks over his shoulder, at the image of a smiling dead girl. “She’d been part of the Fourth Street terrorist cell. We got to the lab first, but when we came to apprehend her—”\n “Don’t.” I can see what happened. I take another look back into the Oculus records; someone’s lumped all of the recorded deaths together, whether criminal or civilian or just plain dumb luck. Glendower’s assembled them for his own penance, I guess. He doesn’t let himself forget either.\n It’s not enough.\n “My offer still stands.” He props his hands on his cane and gazes at me. Casey does the same, over his shoulder. “You wouldn’t be the first to forsake vengeance and turn your considerable talents toward a good cause. Or—” he sits back a little “—you can take that vengeance on me. I won’t stop you.”\n My breathing slows, and the hand that isn’t on the terminal curls into a fist. I could do it. I could kill him in any number of ways—stop the pulse of his pacemaker, use the autofocus in his spectacles as a link into his optical nerve and burn his skull from the inside out, scramble his neurons till he’s a drooling vegetable—and walk away. I might even get out of here unscathed, depending how what method I chose.\n But kill him, and there’ll be another just as certain that they’re justified in their actions. Because it’s their job to save the world. They’re everywhere already, and so many of them wear masks. They say it’s to protect their identities, but it’s also so that we’re never sure who’s one of them, who’s watching. They’re always anonymous again in daylight.\n Who was that masked man? I don’t know, but there’s twenty more of them outside.\n Or join them. That’s the logical ending for a nethead; most of us find one big project and stick with it, and this would be in a good cause. If the terrorists had gotten their hands on the Fourth Street biolab, the result could have killed thousands. How many lives could I save that way, how many Caseys could I save . . .\n I snip the virus out of the system with an absent thought and take my hands from the terminal, switching back to wireless. “Let me think about it,” I say again, and this time I’m not stalling, I’m pleading.\n Glendower nods. “I’m sorry,” he says, bowing his head. “About your friend’s death—I’m sorry.”\n And that decides it. Not I’m sorry we killed her, but I’m sorry about her death. Sidestepping the responsibility. Making it an act of God.\n I take a few steps toward the exit, hesitant and unsteady. It’s not acting; I have to retract some of my motor skills to handle the download, the massive quantity of Oculus records pouring into my head. But Glendower sees it as the agony of indecision, and he lets me pass. He’s a good man; he wouldn’t deliberately hurt someone like me.\n I find my way to the exit unhindered—I think Maxentius, or maybe one of his cleanup crew, waves to me as I go by. As the doors close, I wonder with the portion of my brain that isn’t unpacking records if I’ll make it out of here at all. If the shadow orgs wanted, they could kill me right here, and I couldn’t do a thing about it.\n But these are the good guys.\n In the silence of the transport I have time to craft the message that will go out with each clip. It’s not much, just a few lines for each record, an autovoice that’s recognizably my own. And links, archives, paths to data that isn’t shared or acknowledged, not even by netheads. Even crafting this, having a message like this unsent in my skull, is punishable by federal law.\n The guard waves me through, and I step out into blinding sunlight. The world of data flows around me again—and this time I leap into it, sending out into all nodes, the conspiracists and the news media and the archives. The Niobe GPS activates, and above me the satellite web moves, shifts, focuses.\n It’s not enough to stop me.\n These people have died because of the shadow organizations, I say over each clip, each death, each victim of the shadow orgs. The desert sunlight shifts, shading from yellow-white to blazing, bright enough to hurt my eyes. They were deemed guilty and executed without trial. The guard is yelling, first running after me and then, as he realizes what’s happening, back to the shade and safety of his bunker.\n They were unlawfully executed. And links, lists, the shadow orgs and all their work, thrown open to the world they claim to protect. If they can’t take the scrutiny, they don’t deserve to last.\n I turn my face to the incandescent sky and smile, racing to meet the sunlight."}