{"fingerprint": "IcTwy3eNBnLawcR0KlKitXrKGn8=", "sitename": "Clarkesworld Magazine", "title": "Everything's Surprising: A Conversation with Lev AC Rosen by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/rosen_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Everything's Surprising: A Conversation with Lev AC Rosen by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nEverything's Surprising: A Conversation with Lev AC Rosen\nIn All Men of Genius by Lev AC Rosen, Violet Adams doesn't necessarily want to be a man, but she does want to attend the prestigious, all-male Illyria College. Denied what she desires by social convention, she does what Viola in Shakespeare's Twelfth Night and the male leads in Wilde's The Importance of Being Earnest do: she changes her external identity in order to get what she wants.\nIn the process, Violet learns about herself, the society she lives in, and the way that society attempts to define her. At its heart, you see, All Men of Genius is a book about identity.\n\"Identity,\" said Rosen, \"how it's formed, what it means, how it shifts and how we feel about the labels put on us. It's also about invention — of identity, of course, but also of art and science and what it means for us, as people to create. Yeah, that sounds crazy-pretentious enough, I think.\"\nAs you can imagine, there is nothing simple about Violet—her character or her situation—and there lies the beautiful heart of this book: the lead character.\n\"The truth would come out sooner or later,\" Rosen writes early in the novel, \"[Violet] just needed to make sure it was later, after she had made her genius so clear that the world could no longer scorn or punish her for what lay between her legs.\"\nRosen captures Victorian England and academia with elegance, with plenty of stained glass, gears, and arched ceilings; mistaken identity, alter egos, and love triangles; human ambivalence, murderous automata, and mad science.\nThrough all this dances Violet and a charming ensemble of characters. And they, like Rosen, dance with great elan, plenty of gracefulness with just enough reckless abandon to keep each other and readers off-balance. The truth, the novel promises, will come out sooner or later.\nBelow, Rosen and I talk about style, gender roles, and the joy of writing about a large ensemble cast and the ways they are shaped by their world.\nHow would you describe your style?\nThis is hard one. I like to say every book writes itself. In All Men of Genius, I very consciously imitated a Victorian Style while still trying to stay true to my own voice and keeping it accessible to a modern audience. And I also tried to stay true (or at least lovingly pay homage to) the voices of Shakespeare and Wilde (although I also lovingly mocked their voices in the form of two rabbits, but that's another story...).\nBut now, I'm working on a noir, and I'm trying to stay true to that hardboiled, pulpy noir style/voice. It's extremely different from All Men of Genius, because the story is so different that the style is has to be told in has to be different, too. The story tells itself, and shapes its own style. That said, I like to think that I have some sort of style and it is present in everything I write. But if you asked me to pin down what that was, I don't know if I'd be able to. I think someone else is going to have to come along and say what the Lev AC Rosen Style is.\nWhere did you start with All Men of Genius? What came first—image, character, situation, something else all together?\nAn image of the wall of gears in Illyria. I'm a big fan of the aesthetic of gears, though I couldn't say why. But I especially love them en masse, huge clanking arrays of them, and when I first set out to write something Steampunk, this image of a wall of rotating gears was the first thing that came to mind. It was almost like a church in my mind, with spots where the gears parted for stained glass, and huge arched ceilings. I think that image pretty much stayed the same in the book.\nWhat is the secret to writing such beautiful descriptions?\nHa. Thank you for saying that the descriptions are beautiful. As for how to write them, I think you have to find those images beautiful first and just keep writing and rewriting them until you feel like you've done as best credit as you can to what's in your head. Not everyone is going to think they're beautiful — the key is that you think they're beautiful.\nHow closely does the book follow Twelfth Night?\nWell, the inclusion of The Importance of Being Earnest as another inspiration does create some deviations — though not very many, as both plays have similar themes. There's cross-dressing, though this time to prove something, as opposed to doing it for a job, and there's a love triangle, of course... it's difficult to answer this one without spoiling the book, since the changes I made primarily effect the ending. But there are more characters, and the more minor characters from Twelfth Night get more screen time, as it were. Sorry, I don't think I'm answering this one very well — I really don't want to give too much away.\nIs there a moment in the book that stands out for you?\nA moment? I love the parts where Miriam stands in the rain. Miriam was inspired by Mary, from Twelfth Night, but I decided to really expand her character because I wanted to explore women's roles in Victorian London — not just the upper classes, but the lower classes and outsiders as well. Miriam is a Persian Jew, so she's visibly \"other\" and culturally \"other\" and I really enjoyed writing her and her place in society.\nMiriam's scenes in the rain started out as my wanting to make sure there was some reference to the Wind and the Rain song that Feste sings in Twelfth Night, but when I did some research on Jews in mid-19th-century Persia, I came across an actual, historical law that forbade Jews from going out in the rain. Which, of course is terrible, but it opened up a lot for me to do with Miriam. So I loved writing these rain scenes for Miriam, because the mere act of her being outside in the rain is this act of intense rebellion and freedom. Which is what a lot of Miriam's character is about.\nI'm also really proud of the tiny things that people might not notice — little links between smaller characters, like which professor is sleeping with which other professor's mother, and who Fiona's first client was when she was a prostitute. I love little links like that.\nWhat makes for a compelling protagonist in general and in a speculative fiction in particular? Can you talk a little about creating Violet or another character?\nI don't know if there's a good answer to that question, because not all characters are compelling to all people. I know readers who refuse to read anything with female or queer protagonists, because as straight men, they feel they just can't relate to anyone else who isn't a straight man. This might be more a limited mindset, but it's an extreme example of the idea that not all characters appeal to all people. That said, I think what's important is making sure your characters are complete, and well-rounded. That means that while Ashton is a bit of a flamboyant dandy gay-man-stereotype, I tried to make him more than that — he worries about his sister, keeps things from his family, he has contradictory motivations and doesn't always know why he feels a certain way — that's human. Were he just a flouncing stereotype, or merely had a nod to humanity by giving him some secret sadness that pops out for one scene, he would be doing a great disservice to the reader.\nIn the case of Violet, it would have been easy to fall into the super-girl trap, where she had no flaws and way amazing in every way and never doubted herself, etc. etc. etc. But doubt makes a person real. Flaws make people real. Violet is flawed — she's massively overconfident, judges people fairly quickly, and often times doesn't really know what she's feeling because she's so focused on her inventions. But she's also amazing. I love her because of her flaws, not in spite of them, and I think that's how you make characters that people really love — no matter the genre — by making them human.\nWhat does having a character disguise her gender allow you to do?\nIt lets you talk openly about gender. \"Oh you do things this way\" and such. Essentially, for those of us who are cisgendered, we grow up conditioned and socialized a certain way based on our sex (even your super-liberal hippie families can't keep a child from seeing the pink and blue differentiations at some point. I mean, maybe if they were raised in a cult-situation, cut off from the rest of the world... but I digress). When you have a character who switches the outward appearance of her sex (I won't speak to writing a trans-character, I think that's probably very different as it's about physically changing into what the character already is on the inside), you get to examine that socialization from the point of view of someone outside that socialization. So, things that are taken for granted about the way a man behaves might be questioned by a woman disguised as a man.\nI think about that Simpsons episode a lot. The one where the school gets divided up by gender, and Lisa disguises herself as a man to joins the boys section. She does this because in the girls side she finds the math to be nonsense and soft (\"what does a four feel like?\"), so the implication is that she thinks \"like a man\" (although the episode is simultaneously mocking the idea that genders think specific ways) — but she doesn't know how to \"act like a man.\" I think having a character disguised as the opposite gender is great, because you get to explore the performativity of gender. It's not about how people think or look or any of that — it's how they behave without thinking. Which is fascinating stuff.\nWhat spin have you put on this classic situation?\nI think the academic setting is a new one — so often you see women disguised as men to go to war, or travel alone, but it's not usually a \"for academic achievement\" scenario. But also I really tried to explore not just what it means to dress up as a dude in Victorian London, but what it means to be a woman — how does Cecily, who gets to go to the school as a woman, compare to Violet, in terms of how they think about their situations. And what about Miriam, who is there, but not as a student? Or Fiona, who is completely outside it? I tried to really deconstruct so much of what gender meant back then. How's that for a tedious, academic answer?\nDid it ever get hard juggling such a large ensemble of characters?\nI love large ensembles. They're not hard for me to keep track of because every character is totally human in my mind — what's hard is cutting. Just because I know a thousand different things about each character and wrote more detailed backstories and scenes doesn't mean they belong in the book. But when I cut parts of their story, it feels like I'm hurting friends. But you have to do it. Not every piece of information is relevant. Fiona, especially, got a lot of her scenes and story cut, and I had to fight my agent to keep what is there. She was almost totally done away with. But I think she's important because she's the only really lower-class woman in the book. She's the one who has to fight to survive and do whatever she can, no matter how mercenary it might seem, and she's the one who can call Violet on her BS, and also the one Violet turns to when she wants to know what behaving like a woman should look like (which gets us back to gender performance).\nBut back to your question — like I said, I had to cut a lot. That's the hardest part of writing a large cast. To give you an idea, the book was over 100 pages longer before we gave it to my publisher. That's over 100 pages I essentially cut from my characters lives. But the cuts had to be made. Otherwise there'd be a 30 page stall in the middle of the action to talk about Bracknell's childhood. And while that might be interesting, it isn't necessary for the book.\nThat said, I also know reading a large ensemble can be hard for some folks. But I wasn't trying to write a big action adventure here. I was trying to write something about people in a place and time and how they are shaped by the world and shape it in return. This goes back to your question about style: Were I trying to write a fast-paced gunslinger, there wouldn't have been a large ensemble to begin with. The book writes itself and it creates exactly the right amount of characters.\nDid the cast and crew ever get out of hand in the writing of this? Did they surprise you?\nI'm not a writer who \"shows up to the page\" and sits in front of a blank screen waiting for the next word to come. I respect that technique but it doesn't work for me. I'm a lie-in-bed-staring-at-the-ceiling-thinking writer. I don't sit down at the computer until I know the next scene I'm going to write and then it flows out very quickly. I go back and fiddle with language as I'm writing it, of course, but overall, when I sit down at the keyboard, I know what's going to happen. So the characters never surprise me as I'm writing. Sometimes, when I'm doing the thinking part, one of them will suddenly smack me upside the head with what should have been an obvious choice, but when you're just lying there thinking the characters and story have such free reign that there are no surprises, because everything is a surprise.\nWhat's next for you? You mentioned writing a noir novel. Can you talk a little more about that?\nI only just finished a rough draft, and it needs some serious work before I even show it to my agent, but it's a futuristic noir, a sort of Bladerunner with climate change sort of thing. The central character is a detective named Simone Pierce, and she gets caught up in what first appears to be a cheating husband case, then an art heist, but in the end is something stranger than all that. Again, I'm playing with gender a bit as I am familiar with noir themes and archetypes and I've switched around the genders while trying to keep the old-school noir feel alive. So we have a female detective with men constantly fawning over her, and a possible homme fatale, plus a female nemesis and a female partner-figure. So it's classical noir, but with science fiction and with plenty of gender bending, which changes how the classical noir elements come across.\nMy agent and I are also hoping to try to sell my first novel, which is a magical realism-y novel about seven interconnected people in NYC who don't realize how connected they are. I'm also working on a YA and I have a rough draft of a sequel to All Men of Genius finished. But I put it aside for a while because I was feeling a little steampunked-out. I should be going back to it soon, though.\nOh, and the German version of All Men of Genius comes out in the spring. I don't speak German, but I'm looking forward to seeing the book in German. It's being translated by someone named Hanne Hammer, which is possibly one of the best names ever.\nWait, did you say a sequel? To All Men of Genius? What's it about?\nI did! It takes place two years later and opens with Jack and Cecily's wedding, which is interrupted by the sudden appearance of Cecily's long-lost father, who says he's promised her hand to the prince of Lemuria and promptly kidnaps her. Jack and his friends, of course, then begin a search for Illyria so they can rescue her. The book focuses more on Jack and Cecily, but it also shows how Illyria has changed in the past few years, since Violet's plan, and also how Violet and Earnest have adjusted to married life — Violet, after all, is a Duchess now, and the standards of gender conformity are much higher than they were when she lived at home and had only Mrs. Wilks to deal with. Now she has all of society to deal with, and she's too famous to just go out in drag again.\nThis one is inspired by An Ideal Husband and The Tempest, and I'll be frank, I sometimes wonder if The Tempest, being a problem play, was the best choice. It's leaning more adventure-y than comedy of errors-ish. It's also somewhat darker. A character from the first book dies, in fact (at least in the current draft). But as I said, it's only a rough draft. It needs a lot of work before we show it to my editor and ask her to give me money for it.\nAny parting words?\nIs it appropriate to say \"buy my book\" here? Like ninety times in a row? No? Ah, well. But I will say that people can visit my webpage, LevACRosen.com for the usual blogging, news and such, but also for reading group questions, and this amazing lockpicking game my friend Sam made, which unlocks passwords to deleted scenes from the book. It's also unnervingly addictive.\nAnd thank you, Jeremy. This was a really fun interview.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}