{"fingerprint": "3gq+MaJKAMXTQqWvS6BzQvjhT0M=", "sitename": "Clarkesworld Magazine", "title": "Reclamation by Ryan Row", "author": "Ryan Row", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/row_08_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Reclamation by Ryan Row", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4030 words, short story\nReclamation\nThe stars change. One cycle they are fine and dense, and she sifts them between her fingers like sand. One cycle they are fireflies, and she’s back on Earth, sipping a beer and sweating poetry in the Mojave, where she’s from. One cycle they are open mouths crying the future in unison. Space is all prophecy, as far as she can tell. Space is all future, all drift and slide.\nShe is Drift now by any definition. If she survives this, she will make people call her that. She slides through space. It’s a fall toward nothing. The stars, this cycle, are little hearts that beat slow in time with her breath.\nDrift is an asteroid miner. A comet tale girl. An outer space surfer, a drill-head, an ore babe. An oily corpse floating in a ZY-MK.XII mining armor built for long term excursion. How long? Oxygen to carbon dioxide. Carbon dioxide to oxygen. Piss to water. Water to piss. Stars to silver bees stinging her all over her body. And vice and versa.\nThis is slow-death. This is drift-death. This is death without weight. There’s a little life in her jets still, but her UPS was busted by whatever loose rock had knocked her off asteroid 488392, Perdio back at the beginning of the age of Drift. So her jets would just take her nowhere faster. Her beacon’s on, blinking out its radio smoke signals, but so what? Two weeks before her contractors swing by Perdio to pick her up. And that space junk had knocked her clean out for hours and set her on a slow drift for the heavy center of the universe.\nI beseech thee, oh little human, wander the empty places for 30,000 cycles of asleep and awake. I baptize thee in piss and disintegrating air. I christen thee, Drift.\nThe stars are braille that she can’t quite touch. She runs in place. Tries to sweat out the need to understand, though she knows she’ll be drinking it back up in a day or two. It’s called reclamation. Also, she fears she is becoming too loose under her skin, and needs to move. The fine whir of the ZY as it auto-assists her. All she’s heard for weeks. The music of her breath and her blood and her mining armor. Her breath sounds like an ocean, and the heated suit is indistinguishable, at this point, from her skin. She’s going to die in the clothes she’s wearing now. Bummer. She keeps running without moving. It’s all very meaningful.\nShe struggles to read the stars with her hands. There’s a dark blotch in them that keeps getting bigger. Maybe she’s going blind. That would be a blessing.\nShe crawls through the stars as through cobwebs. She can feel them clinging to her skin in long ribbons of flimsy light. The dark spot is real. No cataract or blob of wishful thinking. A body of dark, solid matter. Crooked but oddly geometric, like long blocks fitted together. But so what? Another space rock. Mostly iron, probably, and nickel. Maybe iridium, or palladium. Platinum, gold, magnesium. Or even the rare trace metals, osmium, ruthenium, rhodium. But can you breathe iron? Can you eat iridium? Can magnesium take you home? In a way it can, but that’s nothing to her now.\nShe’s close to it, a few hundred yards. They slide past each other on the black whims of inertia. On the theories of gravity and motion themselves. An object in motion tends to remain in blah and blah and blah. And who is Drift to fight all that? She is only Drift. She will let it pass her. She can hear the ocean in her breath. The heavy waves of the Pacific or the soft touch of the moon beaches. The water, on the moon, as cobalt and swirling and light as gas.\nWhat cycle is this? Asleep, awake. Asleep, awake. And vice and versa. Her HUD tells her it’s CY 92, meaning her contractors have found her missing by now. What kind of search can she expect? Asteroid mining is dangerous. People disappear. People die. The company she was signed on with is huge and anonymous. She can expect the kind of search that is tired, and not hopeful. The halfhearted kind. The one-eyed kind. Space is hole that she just keeps falling into.\nSuddenly, light fries her eyes. Her pupils disappear and bolts of pain ram through her whiteout eye sockets and deep into her brain. Her armored hands smack her faceplate as she tries to cover her eyes, already tightly shut. She’s screaming. Light is everywhere.\nShe cracks her eyes like seashells. Where did that image come from? She half remembers picking fossils and shells out of the sand in childhood. Time is slipping around her. She shakes slightly, but she forces herself to stop. Anyway, through her tears, she sees the ship.\nIt’s a damaged mishmash of black metal. The light comes from glowing veins in the Rubik’s cube hell of its hull, very straight, crisscrossing lines of light. Part of it is bashed open, but the rest is a random stacking of long rectangles of metal and light. Like a downtown skyline scrambled by a broken mirror.\nWho made it? And for whom? And what is it? A ship? A satellite knocked loose like a cosmic tooth? Drift can’t say. For a moment, she has forgotten how to speak. All she can do is cry silent at it, and kick her jets wide open. The stars fade all around her in that washout light.\nShe was further away than she thought. Up close, it’s as big as a city.\nWhose city?\nShe feels tiny, but that’s how she always feels. The surface rushes at her like the bottom of the universe. The sound, when she crashes into it, is softer than she expects.\nMaybe she’s dying and this is a dream. Nutrient cubes and recycled air equals a shrinking brain, she recalls from nowhere. She calls for a cube now, falling down a long, glowing hallway, and one pops out of a compartment in the ZY’s helmet. Tastes like yellow moss and crushed cypress bark. The water from the nub straw at her shoulder tastes like swamp, thick and warm. It reminds her of the glass glades of her cadet training. Yes, yes, she’s there now. The polished surface of the water. The insect hum and nasal cry of egret or heron. The scent of dry grasses and river silt. The insane blue of the sky, and the skinny cypress shivering. The Florida heat that she wore on her bare arms and legs like a second skin.\n“Is it lonely up there?” she asked an older cadet. The atmosphere on earth was so heavy and pleasant. Like sleeping next to someone. There was sunlight through a classroom window. The smell of deodorant and hair gel, intoxicatingly human.\n“No,” the faceless cadet said. Or had Drift said that in response to another, younger cadet’s question? It’s all tangled in Florida haze, and lost behind the lens flare quality of memory.\n“Because the stars are always there with you,” someone says.\nSpacesuit fever. Drift shakes her head. She feels limp. She reaches out and touches the wall, softly beating with light. She hears the metal clink in the vibration of her suit. Drift’s inside the thing. She’d drifted in through the hole, which was ragged and huge and made her think of the exit wound of a bullet. She’d been searching for hours, but nothing yet. No UPS, no LR comm’s. No tech of any kind that she recognizes. No rooms even or doors. Just square hallways in every direction. The construction of the thing makes her think of the human brain. Chaotic. Organic. Snarled. A maze in which navigation is impossible for lack of destination. No beginnings. No ends. Everything’s made of the same dark metal and arrow-straight, blue-white light veins. Crystal and fractal inside. Again, like her brain.\nShe’s starting to get cold, and her breath is slow. And even though she can no longer see them, she can feel the little eyes of the stars all watching and circling her like glass-eyed, desert birds. Dark in the sky.\nDrift throws herself softly down a hall. She’s making a map with the ZY’s built-in software, and she should be able to find her way out by markers, but she has troubling making sense of it. She is very cold now, despite turning up the heat in the suit, and her breaths, she’s noticed, are getting very far apart. Also, her brain is melting, and she tastes metal and tequila.\nThe laws of drift and slide are at play here, she guesses as she snags a crack and swings herself around a corner. More delicate iron, and a graceful play of light on metal. She falls and falls through it.\nWhen was the last time she had tequila? She tries to fight down the association, but the memory boils up and leaks out of her head.\nShe’s on the moon. She’s younger, and feels very strong and beautiful in a black bikini. Her toasted almond skin glints in the bare sun. She has recently left the Engineer Corps for the solitary work of private sector mining, and she feels rich, and between jobs she stays at a resort in the Lunar Caribbean Dome.\nShe sips a chlorine margarita, and the lake laps gaseous and blue metallic at the silver moon dust of the beach. The Earth is rising, fragile on its string. Oh blue marble. Oh cradle of all men. Oh origin of all truth and lies.\nI will always be grateful, Drift thinks at it between ice green sips of margarita that make her teeth sing. But I will never return.\nShe’s a bit drunk. And her swimsuit is chaffing at the wrist where the controls for the drill wrap around her hand. Drill?\n“You look like somebody dreamed you up,” someone says, an old girlfriend in the moon dust sand beside her. A bad pickup line. She’s got a tinfoil voice.\nAn iron sound vibrates through the suit as her limp body, wrapped in the ZY, collides softly with the wall of God’s Brain. Yeah, that’s what she’s calling the manic structure. She is starting to see space as full of the drifting body parts of God. What are the stars but the silver drops of His blood? This cycle anyway. And the hole she entered through? Surely the bullet hole where God was shot.\nFlecks of rainbow float in her helmet. Droplets of salt and water glinting in time with God’s neurons firing, slow and regular. She’s crying silently. Why? Because she can’t remember tequila. Or being drunk, or swimming on the moon in water as light as air. She grabs at a crack in the wall and pulls herself against it. Halting the drift, if only in her head. She presses her faceplate against the dark metal of the wall. There’re vibrations in there like a birth. Something is shifting.\nShe can no longer remember what tequila tastes like, or even what it is. That vision of the rising earth is gone from her. She knows there was a vision of earth, but not what it was. There is a vision-of-earth-shaped hole in her. And soon even the memory of the memory will be gone. Something’s punched a hole right through her. She feels as if a child is growing in her, and it’s slowly suffocating in the frail grasp of all this starlight. And that child, stillborn in her gut, is herself.\nShe’s losing it. It being the world. The invisible stars are a million little copies of herself, screaming silently very far away. She has to remind herself to breathe, otherwise she’ll stop. The cold is a high sound ringing inside her. Her skin is a bell. Maybe this is what dying is like.\nWhat is happening to her? This is more than drift-death. The running lights on the walls are crazy now, like the twisted roots of a plant or the network of veins under her skin. The hallways that she drifts through now curve or end abruptly.\nMore terrifying than this, this rearranging around her, she’s losing her self. Memories, important memories buried in her personality, are floating to the surface of her mind like bloated corpses. And she relives them with such vivid sensation. She lives them. And then, that part of herself is gone. Some scavenger has picked it apart.\nSomething is ripping the memory right out of her head. The memory of her self.\n“Why are you doing this to me?” she says to God, or to no one, or to herself. Her voice bounces in her helmet, dry and huge, like the desert. The pulse of light in the walls is a language the way the beating of a heart is a language. This is the reverse of being born. This is being unborn. Her brain is unraveling like string.\nAnother memory rises in her like bile. She tries to choke it down, to keep is safe in her guts, but it’s like trying to hold light in her hands.\nShe had eventually returned to earth, modestly rich from several successful contracts. She had even bought a small house back in the Mojave, which she lives in with her mother. She only had to work a few months a year to live, but she worked more because she loved being that close to the stars.\nNot this, Drift thinks, desperately clawing the wall of God’s Brain with weakening fingers. The sound, in the vibration of ZY, is very muted and distant. Like a voice through a wall. This one is mine. This one is me. Take something else, but not my mother. Not my desert.\nHer father is buried under that sky. That wisp of cloud. That buzz of sage and cottonwood and Joshua tree sifting the air. It’s a complex smell of juniper and silver sage and ripe dust in the sun, a little lighter than her skin. A dust devil swirling in a dirt road.\nSometimes she catches her mother speaking to her father through a window or in an empty chair. She pretends not to notice. At night, Drift and her mother sit on the back porch and watch the stars cascade out of the wild blue a fistful at a time. Everything cools. They are friends now, Drift and her mother, and she enjoys this much more than she’d expected to in her comet tail youth, hopping rockets and chasing the stars and telling herself she would never go home.\n“Another job in two weeks,” Drift says. Ice shifts in her glass, which, in this memory, is empty.\n“So soon?” her mother says.\n“Yeah.”\nThey watch the stars in silence. Coyotes howl in a pack, and it sounds like terrible fun. The moon is cheese yellow. The desert goes on and on. Drift takes a sip from her empty glass and can’t taste anything. It’s a margarita glass, though she doesn’t know what that means now. The stars are as numerous and gritty as grains of Mojave sand.\n“What are you always running from, little girl?” her mother says.\n“Nothing, Mom,” Drift says. Starlight slips through her fingers and all around her like a current in which she is being carried. “Nothing.”\nNow she’s bawling like a baby. The ZY feels slimy, like a skin that isn’t hers. The light veins are chaotic and angry on the wall. Pulsing like a frenzied clot of snakes. There’s a mom-shaped hole in her now. But give it a few minutes, and that’ll be gone too.\nThis cycle the stars have burrowed under her eyes, and she sees them when she blinks. She sees them very little.\nWhat is the point of survival? She’s having trouble recalling. The fragments of Drift are few and sharp inside her, like the remnants of a broken mirror. The halls, which swallowed her at first, are getting thinner. Her shoulders and her toes often scrape the sides, and the walls are dense with swirls of light. It’s hypnotic, and she’s turned up the light filter on the ZY. Some paths are too narrow to follow, and she has to turn around. She spends some time trying to stuff herself down one of these paths, which recedes into a vanishing point of light that she thinks is a star, but then gives up without much disappointment. The map she made is a total scramble. It tells her there are paths behind her where there are only walls.\nLater, she feels like an old photograph of herself in which she looks like someone else. She tries to drill a hole in the wall with the auxiliary stashed in the right arm of the ZY. Before she’d been afraid that whatever internals were making that light might fry her if she broke into them, but now she feels weirdly immortal, in a soulless way. The little drill turns, she works the rpms, and the wall gives a bit. The grinding has high, metallic notes in it, which used to signify stashes of precious metal, and the sound, vibrating all around her, is quietly soothing.\nThe metal is softer than it looks, and she makes progress. But an hour later and five feet in it’s just more wall. She understands. It’s wall all the way down to the bottom of the universe. The same way a person is masks all the way through.\nAnother hour, and she’s dug right through to another shrinking hallway. Huzzah.\nMore halls. The growing randomness of the lights and the turns reflecting the growing fragments and fissures inside her brain.\nDrift senses something malicious in the metal of the walls, which she now suspects are anything but inert. They’ve been changing around her. She feels betrayed.\nIt’s not malicious like a person. More like a storm or a sickness. Or a wildfire tearing apart the night. This is an alien artifact. Why dance around it? Or perhaps, Drift thinks, not an artifact, but an alien itself. And she, her self, the psychic parasite slowly being fought off, and destroyed.\nThe walls make her dizzy. The light is thick and hurts her eyes. She’s numb all over, can’t feel the heat of the suit at all, though it’s turned up all the way. Her chest is very still. None of this concerns her greatly. She wonders what the stars look like this cycle. She’s lonely for the stars. She looks inside herself.\nWhen Drift was very young, she would sometimes sneak out of the house after dinner and lay flat in the coarse sand out in the Mojave’s rocky planes. The shadows were deep and hot. Cottonwood. The thumping of a jackrabbit. The sky floated above her like the inner skin of a giant hot air balloon in which she rode. The stars fell like snow. She felt them on her tongue and all over her young body, keen and delirious. Someday, she would become those stars. Infinity was singing in her head and it wouldn’t ever stop. Her paradise was the desert sky. Swarming with the lunatic stars.\nHe father eventually came looking for her. He called her name, and she felt it floating up out of his lungs and into the air. Tangling with all the nothing in the sky. He’d find her, she never went far, and pick her up onto his shoulder. She played dead, wanting just a little more time with the stars.\n“Little girl,” he said, the stubble of his cheek tickling her neck. “I thought we’d lost you.”\nShe felt his heartbeat. It was like thick static in her ear.\nDrift comes wildly back to herself. She feels scrapped inside, and there’s an echo in ear of nothing.\nThe stars are all haze and absence. There’s a million little holes in her body. She tries to scream, but there’s no air in her lungs. She can’t remember the last time she took a breath.\nHer comm’ crackles in her ear, and a soft male voices says something in the edges of it that she can’t quite grasp.\nA voice?\nUnholy starlight, she is being rescued.\nShe inhales enough to laugh weakly, deliriously. It tastes rotten. The quality of the signal is poor, they must still be far off, or God’s Brain is interfering with the signal somehow, but if she can receive them, they must be reading the distress signal from her beacon loud and furious. She waits, making an effort to breathe. Her lungs feel like metal.\nThe crackle comes again, clearer.\n“This is the ship serial 009548221, The St. Michael. If you do not respond, we will assume you are disabled, and will rendezvous with your quadrants.” The voice is so human and soft that she barely understands it.\nShe almost responds, starts screaming her head off in fact, but something stops her. When was the last time she ate? Or drank? And who is she again? She is Drift. Just Drift. The walls around her, crooked and curving, pulse as if waiting for something. She can’t feel anything but a metallic sort of cold, and her thoughts are sluggish and fractal, but part of her brain, she can feel, is buzzing with a foreign light.\n“HUD,” she says. Her voice is crinkled steel and harsh, living smoke. “Self-facing camera.”\nA square image of her face appears on the side of her HUD.\nShe’s the wire frame of a person. Her eyes are huge and blind. Her skin is a deep black, much darker than normal, and it’s hard, and her veins, showing through her skin and spider cracked all across her face and eyes, glow a liquid blue-white that is a dull kind of familiar. Her glowing veins pulse blankly as if there’s still a heart beating somewhere in the collapsed spaces of her chest.\nShe looks like a metal zombie. Exaggerated and more than a little ridiculous. She realizes she hasn’t blinked in several hours, and her eyes are dry and look like milky glass. She feels infectious. She realizes, softly, inside the tender egg of her skull, that she is patient zero.\nThe ZY is airtight, of course. It’s also shielded against all known radiations, within a certain level of tolerance. But God’s Brain had almost instantly infected her. She’s been leaving behind bits of herself like bread crumbs even before she entered it. Back when it was just a dark spot on the edge of her eye. And she has the sinking suspicion, deep in her new metal skin and in her white blood, that it would be even more efficient now. That it’s now tuned to the human brain, her brain, with all its wild curves of light.\nIf The St. Michael comes for her, it will be infected. She has to assume this.\nAnd yet, the stars are calling her. And they spit the future into black holes everywhere. Apocalypse is written all across her skin. The stars are the only parts of her that remain. Jangling loose inside her like a million tiny hearts.\nAll she needs to do is wait, and they’ll come. All she needs to do is drift, and she will be saved.\nShe should turn off her communications, in case she accidentally can’t control herself, and responds automatically to the voice of humanity.\n“Communications,” she says, and then, for no reason she understands. “Link on.”\nThere’s a thick silence, warm with static. The walls swirl with light in a pattern that, she now recognizes, mimics the flowing cycles of her thoughts.\n“Hello?” the soft voice says in her ear. “Are you there?”\nThe stars change inside her. They are the fireflies trapped in her loose, child’s hand. They are the lights of a wild city. They are going out like prayer candles in wisps of delicate smoke. There’s nothing left of her but the fine smoke of the stars.\n“Are you there?” the human voice repeats in her ear. Seeking, in its way, to reclaim her.\nRyan Row lives in Oakland California with a beautiful and mysterious woman. His short fiction has appeared, or is forthcoming, in Shimmer Magazine, Daily Science Fiction, Quarterly West, and elsewhere. He is a winner of The Writers of the Future Award and holds a B.A. in Creative Writing from San Francisco State University."}