{"fingerprint": "vePqay/z7t59JLD7IBI3q/qLso4=", "sitename": "Clarkesworld Magazine", "title": "The Last Surviving Gondola Widow by Kristine Kathryn Rusch", "author": "Kristine Kathryn Rusch", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/rusch_02_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Last Surviving Gondola Widow by Kristine Kathryn Rusch", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5870 words, short story\nThe Last Surviving Gondola Widow\nI slipped in for the motion picture. Regalese had set up a private screening in a tiny little theater near 19th and Dearborn, on the other side of the street from Bed Bug Row. I felt itchy just being there, and not only because of the proximity to the vice clubs, but also because I felt obviously out of my element.\nStill, I dressed for the neighborhood. I wore my bobbed hair under an engineer’s cap I confiscated from one of the Gondola widows when I found her years before. My baggy shirt and filthy overalls hid my assets, such as they were, but one of the other Pinkertons told me—kindly, he thought—that it was impossible to hide the female nature of my backside.\nThe memory of his comment always reminded me to wear everything baggy except my steel-toed boots. I would put a little bit of char on my face, and I’d learned to grunt low and hard whenever I wanted to say hello or good-bye or get the hell out of my way. I kept my head down a lot too.\nNot that it mattered much in this theater. Designed for burlesque shows mostly, the theater had a red velvet curtain that pulled back to reveal a real silver-painted screen. The screen was the fanciest thing about the place.\nRegalese sat on benches with straw scattered across the floor beneath to absorb the crap on the patrons’ foul-smelling boots. The straw hadn’t been changed in weeks, if ever. Even though Regalese and I were the only two people in here, besides the projectionist and the organist, the place still stank of tobacco, sweat, and human fluids of a kind I didn’t want to contemplate.\nRegalese had told me to come for the motion picture, but hadn’t told me how he’d first seen it. I wasn’t sure I wanted to know, either. I worked with men who patronized the Levee District, but I liked to pretend they didn’t.\nThe gaslights dimmed, and the motion picture started up. The organist started blaring some mock Sousa march, which besides being deafening was just damn offensive, given the nature of the images we were about to see.\nSome so-called director had taken stereoscopes, still photographs, and silver addies, and had somehow—Using His Own Magical Abilities! the poster in the lobby blared—combined them into a herky-jerky semblance of a real film.\nI didn’t need to see the pictures, even speeded up. I’d been on Michigan Avenue the day the Gondolas died, and what was flickering on that screen was nothing like what really happened.\nWhen I tell that story, I leave out most of the details. Like the way Chicago smelled before the attack. The city smelled new. The recently completed buildings were made of terracotta, marble, brick, and limestone. When the downtown air wasn’t smelling like Lake Michigan fish, it smelled of newly milled stone dust. After the Great Fire, the city fathers had mandated all new construction—especially downtown—be made of fireproof stone.\nI’d moved to the city five years after the fire, and had fallen in love immediately. The day the Gondolas died hadn’t changed my love affair with the Windy City. In some ways, that day had reinforced it.\nThat day, I’d been on the job. I was the third woman Allan Pinkerton had ever hired in Chicago. The other two no longer worked for him. One had died—murdered horribly—and the other had fled when she realized what the job entailed.\nMe, I found freedom in investigations. The role-playing, the games, that tiny bit of magic I could use to add a luster to everything, all combined to make me one of the city’s greatest detectives. When no one could figure out what happened, the Pinkertons got called in. When no Pinkerton could figure out what happened, they called me.\nWhich was why I was just outside Cook County Bank & Trust that spring morning, dressed like a proper woman on a hot day. Shirtwaist, skirt with bustle, long auburn hair pinned to the top of my head, parasol to keep out the sun, and (for my sins) a corset, cinched so tight I hoped like hell I wouldn’t have to run after anyone. The high-button shoes I wore with enough heel to help me pass for five-seven wouldn’t have made it easy either.\nI was supposed to determine bank balances by portraying the young wife of our target, an elderly millionaire who claimed he no longer had the funds to pay us. I’d been fighting to close the parasol before going inside, which was why I was on the sidewalk when someone gasped and pointed. Gondolas covered the sky over Lake Michigan like multicolored storm clouds. The whirring sound of their spiky engines sounded like heavy rain on water.\nWe’d heard about the Gondolas, but most of us hadn’t believed they existed. Not in America anyway, and certainly not made by the South. Reconstruction had ended the year before, and everyone knew the South was bankrupt. How it could afford not one, not two, but several fleets of Gondolas stretched the imagination.\nOnly later, we learned that Great Britain supplied much of the material in exchange for cotton. Britain really didn’t want the cotton as much as it wanted to see the Gondolas in action—\nAnd it got to. The day the Gondolas died was the reason Britain stopped nurturing its own Gondola fleet and started building more ironclads instead.\nBut that switch was years away. We had to go through the horrors of that day, the death, the destruction, and what some call the Second Great Chicago Fire, before we came out the other side.\nOr before some came out the other side.\nThe rest of us remained enmeshed in the War of Southern Aggression, even though the battlefield had emptied.\nThe motion picture captured none of that day’s essence, although it had much of the day’s symbolism. The Sousa march didn’t help. All that happy brass music, with a parade beat, made me want to steal Regalese’s pistol and shoot the organist in the back of his pomaded head.\nInstead, I sat on my bench, hands clasped, watching moving images I’d seen before as photographs. The images didn’t move naturally or even well, which was good, since I probably would have run screaming out of the theater if the motion picture had been anything close to accurate.\nThe motion picture was set up well. First, the Gondolas appeared, their artistic sphere-shaped balloons hovering over Chicago, perilously close to the great stone buildings on Michigan Avenue. Then the images became distant, showing the clouds gathering over Lake Michigan. The images clicked and clicked and it became clear that those clouds weren’t clouds at all, but hundreds more Gondolas, coming in from the South, ready to rain hell on the Midwest’s greatest city.\nThen the sparks, like tiny fairy creatures, spread out across the sky, looking like flaws in the photographs, followed by the next series of images—fires erupting on all of the Gondolas, smoke pluming, the sky alternating dark and light.\nFinally, the motion picture focused on the destruction: the Gondolas breaking apart, falling to the buildings below—shattering the Tiffany skylight of the Cook County Bank & Trust—and landing, in flaming pieces, on the streets and Grant Park and into the lake itself.\nI shuddered. I couldn’t help it. That day, the stupid parasol had saved me. If I had gone up the marble steps and through the brass handled double doors, I would have been one of those pathetic creatures burned alive inside Cook County Bank & Trust, after being showered with expensive glass and pelted with flaming Gondola parts.\nNo one had survived the inferno inside that bank.\nNo one.\nWhen I had realized what was happening, I had run up the bank stairs. I had figured we had to pull people out before the situation got worse (I had no idea how bad it was) but as I reached the top of the steps, the windows exploded outward\nI ducked, covered my face, and screamed as shards penetrated the back of my hands and arms. My black skirt, shirtwaist, and corset protected me from damage anywhere else, although I did spend the evening trying to clear slivers from my waist-length auburn hair.\nThat was the night I bobbed my hair, not because I was making a political statement years before the rest of America’s women would, but because I couldn’t get all of the glass out.\nThat day was more than images. It was smoke so black and smelly that anything it touched had to be destroyed. It was the stench of burning canvas and searing flesh. It was heat so intense that skin dried and turned red blocks away from the flames.\nIt was—and I can attest to this—hell on earth.\nThe motion picture made the disaster look small. Tiny Gondolas, sparks like fireflies, smoke rising from the multicolored balloons—and the silence, always the silence, because the images made no noise.\nOr maybe I couldn’t hear anything. The organist was supposed to have been playing, but I didn’t hear it. I got lost in the memories.\nThat day had been filled with noise, noise that still woke me from a sound sleep. Screams and cries for help, sirens and the roar of flames, explosions and more explosions, followed by even more explosions.\nMy hands are still scarred from the burns I received as I grabbed a metal doorknob, as I tried to put out burning clothing before it seared flesh. My own magic, a little tiny bubble of protection, protected my skirts from catching fire. Still, like so many others, I ran to Lake Michigan. I plunged my arms into water—frigid despite the burning bits of debris on its surface—and that, doctors later said, prevented loss of motion.\nI clenched my scarred hands as the images continued. Up—the burning sky; down—the fleeing and injured humans. Up—the debris falling off terra cotta roofs; down—the smoldering pieces of Gondola lying in the street.\nThe motion picture ended with a snap-snap-snap of the projector, and the bright silver light of an empty screen.\n“See her?” Regalese asked.\nI frowned at him. Regalese was fifteen years older than I was, a wanderer who had come to Chicago for the hunting after the day the Gondolas died. He freelanced for the Pinkertons. They didn’t like his trigger-happy nature, even as they relied on it.\n“Her?” I asked.\n“Run it again,” he said to the projectionist. I started to protest, but he grabbed my hand in his own. I knew he felt the crabbed, scratchy quality of my damaged skin, and I knew he didn’t care.\nThe organist sat up, hands over the keyboard.\n“Without music,” Regalese added.\nThe motion picture started again. I wanted to close my eyes against the images, but I didn’t. I made myself watch.\nRegalese hadn’t let go of my hand. I think he had expected me to look away, because he shook my fingers as one of the Gondolas toppled onto State Street.\n“See her?” he asked again.\nI squinted. The imagery had changed, away from the Gondolas and onto the poor unfortunate souls burning, and dying, their bodies littering the streets of this great city.\n“See?” he asked, still shaking me.\nThe images were overlaid on each other. I had no idea how the compiler had done this, made it all look like it was actually moving, but when I stared I could see the different photographs, and this series had been taken in sequence.\nDebris fell. People injured. Some looked up. Gondola basket toppled off the rooftop. People fled.\nA woman fled.\nShe was thin and dressed in an oilskin coat with a matching cap, a bandana, and engineer’s goggles around her neck.\nA Gondola widow, big as day, escaping south.\nA lot of Gondola widows escaped that day. Gondola wives as they still thought of themselves that afternoon. Widows only came later, when it became clear they would be considered heroes if they managed to get back to the South.\nWarriors all of them, defending God and country—the Unrepentative Confederate States of America. Feted, celebrated, protected.\nUntil Reconstruction began anew in the aftermath of the attack, shoved down the throats of the unreformed Rebels by the dogged determination of the Congressional delegation of the Great State of Illinois.\n“What’s so special about her?” I asked.\n“You don’t recognize her?” He turned toward me.\nI squinted, waved my hand, made the projectionist run the damn motion picture again. There she was, running, a half-turn toward the camera, a shot of fear. I was about to ask for the actual photograph when my brain supplied the answer Regalese was seeking.\n“Oh, my god,” I said. “That’s Maizy Farmington.”\nFirst Lady. Wife of the current Governor of the Great State of Illinois.\nIt’s bad form to accuse the wife of the Governor of treason against the Republic without some kind of proof. Especially in an election year. Proof wasn’t hard to get against Gondola widows, but making proof stick, making it seem like it wasn’t a dirty trick played by Governor Farmington’s opponent—that was a little harder.\nWe needed witnesses other than ourselves. And that wasn’t the usual way Regalese or I worked.\nWe’d caught dozens of Gondola widows in the aftermath of the day the Gondolas died. Gondolas, married to their female engineers, responded to the engineer’s voice and the touch of her hand. First the voice. Then the Gondola would locate its engineer—its wife—and fly toward her.\nWhat Regalese and I did was gather up the remaining pieces of the Gondolas and take them to potential widows. The pieces would respond to the voice, and float to the engineer, identifying her as a Gondola wife/widow.\nOnce the women were identified by the remains of their Gondolas, most of the women broke into tears. They mourned the loss of their great flying warships as if mourning the loss of an actual spouse.\nMany of the women believed their lives were no longer worth living, and gave up without a fight. The rest attacked us as if we personally had destroyed their ships.\nWe hadn’t destroyed their ships. I couldn’t have, and Regalese hadn’t been here.\nThe real heroes of that day had been coalburners, most of whom had died for their bravery.\nAs the Gondolas gathered over the Mississippi, telegraph operators tracked them, growing alarmed at the increasing numbers of ships and the fact they had come from the Deep South. Messages about this impending crisis didn’t come to the authorities; they traveled north through the coalburner network, tracking the ships.\nCoalburners have a sparking magic, dangerous and hard to control. They use bits of the Earth—not just coal, but flint as well—to spark fires. Coalburners often have to live underground or on lakes, just to prevent fires.\nAnd after the Great Chicago Fire, coalburners were banned from the city proper, although they snuck in to fight the Gondola attack. No one ever discovered who helped the coalburners onto the roofs of the city, and no one knew how they managed to coordinate the release of sparks, but everyone agrees that the coalburners saved us—even though all of the Chicago area coalburners had died that day.\nI hadn’t even noticed the coalburners, but I had seen some of the newly created widows pull themselves from burning Gondolas. The women tried to flee, but most were too injured to get away.\nThose that did get away hid in flophouses south of the Loop. It took little to track them down, and even less to identify them.\nRegalese had joined our search in the weeks after the crisis, when it became clear that a handful of women had escaped the city. He and I partnered to find them—he often playing a jilted husband, and me a heartbroken sister as we enquired about lost loved ones.\nWe thought we’d caught all of them, until this motion picture showed up and revealed an even greater perfidy than we had realized. What was she planning for the Great State of Illinois?\n“It shouldn’t be hard to trap her,” Regalese said to me as the moving images ended for a third time. “All we need are the Gondola pieces.”\nI bowed my head. He had moved to other jobs, including one investigating the magic behind moving images. That had been how he had discovered this bit of ephemera in the first place.\n“Right?” he asked, his hand still holding mine.\nI didn’t want to speak in front of the projectionist or the organist. Instead, I thanked them both, stood, adjusted my overalls, and headed outside, blinking in the pale sunlight of the afternoon.\nWe stood alone on the sidewalk. The Levee didn’t come alive until twilight.\n“What am I missing, Lou?” he asked. He almost never used my name. No one in the Pinkertons did. It was too dangerous. But he caught my mood, and he then needed my attention. My name was the only way to do so.\n“We destroyed them,” I said softly.\nHis eyes narrowed. He lived for the job, the hunt, the search for the next great magical threat. He stopped in Chicago only when he was in the area, when he needed the work, or when he had something to share with our version of the local constabulary.\n“Destroyed what?” he asked, even though his tone told me he suspected what I was about tell him.\n“Every last bit of the Gondolas,” I said.\n“Because . . . ?” he asked.\n“Because they started to reassemble, and we had no engineers that we trusted,” I said.\nHe looked away. He knew I had just lied. We had an engineer, trustworthy and capable. She just wasn’t willing. She had declined to bond with any kind of vessel, and she would continue to do so for the rest of her natural life.\nI knew that for a fact—because that particular engineer was me.\nLarge magics, small magics, we all have a mix of them. My largest reservoir of magical talent fell into the engineering category. I could make machinery dance, and if I wanted to become part of it, let it chew a bit of my soul, I could make it do my bidding as long as it (and I) existed.\nBut I had embraced my small magic, the glamour that got people to talk to me, the tiny glow that made the casual observer look away unable to remember exactly what my voice sounded like, and what my face looked like. Perfect for detection. Less dramatic, and less emotionally exhausting than engineering magic.\nAt least, it had been until the day the Gondolas died. Then I had to go after women just like me, women who had made a different choice, women who had decided to give up their entire lives, their entire beings, to a ship and someone else’s dream.\nIn the case of these Gondolas, the dream had been a second Civil War. It had failed so far, although many of us believed a third Civil War might flare up if the Federal Government ever did away with the Second Reconstruction. I tried to ignore the punishing cruelty of that new system, which had started as retaliation for the near-loss of my city, by staring at my hands, and realizing that so many Chicagoans never came home the day the Gondolas died. All those people had done was go to work, visit a bank, or sit on a park bench, enjoying an afternoon by the lake.\n“A new Gondola won’t do, will it?” Regalese asked.\nI shook my head. “She simply could refuse to ignite her magic.”\nI had done that countless times.\n“We need her ship,” I said.\nHer ship from years before. Her ship from the attack. Her ship, which I knew, had already been destroyed.\nIt took planning to approach her. I couldn’t do it alone without revealing myself as engineering/magical. Regalese needed to be there to interrogate.\nBut we both knew that interrogations wouldn’t work, at least in this instance. We would have to find another way to work.\nI contacted the head of the detective agency, Allan Pinkerton, and asked him to use his contacts. Allan knew everyone who was anyone, and he’d lost a lot of personal friends on the day the Gondolas died. In fact, he’d lost so many friends that he hated the way the news rags had labeled the day, thinking the label should be closer to the day Chicago died. So many elites died in the firestorm because they’d been at their banks or their high-class offices or tending their high-class hotels.\nThey—or what was left of them—were all buried at Graceland Cemetery, so that Chicago’s royalty could stride into the afterlife together.\nI planned to use Chicago’s royalty, which was something I didn’t tell Allan. Because he was going to be appalled.\nBut my initial plan—using survivors of the attack—hadn’t just been cruel; it had been heartless. Because there had been a good chance they could have died.\nSo once I formulated that plan, I tossed it without telling Regalese.\nI came up with another plan. One I thought more benign.\nSomehow, Allan convinced the head of the War Widows and Orphans Fund to hold a ceremony honoring the war dead. The Governor, a Union veteran, loved those kinds of events. He had a series of speeches that somehow roused the crowd, and made everyone decide to vote for him. He even made cemeteries feel like the appropriate place to hold a rally.\nI’d seen him speak several times, but I’d never heard his wife talk. The newspapers claimed Illinois’ First Lady was shy and retiring, standing beside her man, but never speaking for him—the way a proper woman should.\nSuch a vision of womanhood.\nSuch a lie.\nI made sure that Allan insisted the only way the Governor could talk was if Maizy laid a wreath on the monument to the Gondola dead. Maizy had to give a small speech before she set the wreath down. She couldn’t have the Governor do it for her.\nFor a few days, the Governor’s office tried to negotiate the conditions—apparently Maizy claimed she got ill whenever she had to address a crowd. But someone—Allan, the head of the fund, someone convinced Maizy (or, more likely, convinced the Governor) that to lay a wreath without comment would be a slap in the face to the entire city.\nI had chosen that location inside Graceland carefully. It was in the center of the elite row, where so many of the wealthy dead from that day rested.\nWhat I had forgotten until I approached the crowd that stormy afternoon was that the monument to the Gondola dead wasn’t far from Lorado Taft’s sculpture, Eternal Silence, which some wag had named “The Statue of Death.” The creepy thing was as tall as a person, and was faceless, with an arm raised over the empty hood, blocking the place where a mouth would be.\nI saw more than one attendee stop in surprise as they saw the statue. Even Regalese stopped, eyes wide as he looked at me.\n“Wow,” was all he said.\nWow, indeed.\nThe Gondola Dead monument paled in comparison. It had taken the city years to decide what to do. So many locals wanted a memorial downtown, but the businessmen and Governor Farmington (under the influence of his wife?) did not want reminders near the heart of the city. So the monument got shuffled to Graceland, and became smaller and less ornate as the designs went through various stages.\nNow it was just a bronze spire, with a square base embossed with that day’s date and some pious statement I had forgotten the wording of, and couldn’t currently get close enough to see. Not that it mattered. What mattered was the wreath, the podium, and the fact that Maizy Farmington had arrived.\nAppropriately, Maizy Farmington wore black. The outfit almost looked like widow’s weeds, but was a bit too fashionable for that. The skirt was short enough to show her ankles (appropriately covered in well-worn high-button shoes) and the blouse was covered with a gray shawl that seemed somber but didn’t make Maizy Farmington look like she was mourning.\nAbout a hundred people showed up on this fine morning. More than I would have expected, given the haphazard nature of the invitation to this event. Surprisingly, to me at least, a goodly number of the crowd were women even though we weren’t allowed to vote. I suspected most of them had husbands or male family members they thought they could influence.\nInfluence. I didn’t exactly know her agenda, but I knew that Maizy Farmington was like all the other wives out there. She did what she could to influence her husband.\nHeaven knew what kind of subtle damage her whispers in his ear had done. The power behind the throne—and he probably hadn’t even realized it.\nI stood at the back of the crowd, behind two women with hats that had more feathers than half the birds in the state. I didn’t want my magic to be obvious to Maizy, and I achieved that at this distance.\nRegalese stood behind the people who had gathered closest to the podium. I warned him that he needed to stay away from Maizy. He was clearly trying to stay close but far away at the same time.\nHe knew what was coming.\nOr what I hoped was coming.\nI also hoped that Maizy didn’t know. She had fled that day; she had no idea what people had died of. She probably thought everyone died of burns.\nIn fact, I had thought that too, until I focused some while thinking of that initial plan. Initially, I had thought to use survivors to reveal Maizy’s treachery. Most of those survivors still had Gondola fragments stuck inside their bodies. The burning fragments had gone in, cauterized the wounds, and had somehow prevented gangrene or other horrid deaths.\nBut, I realized, many of the dead also had Gondola shrapnel in their bodies. Most of the dead had died of something else—flames, falls, too many wounds. Still, I was counting on that shrapnel to make my case.\nAnd if Maizy Farmington actually knew how people had died, she never would have shown up.\nBut she was here, fidgeting beside her husband, clutching a mourning wreath in her black-gloved hands. A phalanx of women from the War Widows and Orphans Fund stood behind her, as if being close to her conferred some validity upon them.\nThe Governor stood beside her. He had pushed his hat back from his face, and he kept looking sideways at her as if he expected her to bolt. Twice he leaned over and squeezed her arm.\nEveryone said he loved her. And if I had learned anything in this job, love was a treacherous thing.\nFinally, the ceremony started with the head of the fund—a stout woman whose gray hair suggested her status as a Civil War widow—giving an interminable speech about what we owed our honored dead.\nAs she spoke, my cheeks heated. I had just found another flaw in my plan. I wasn’t honoring the dead—at least in the way that their widows and children would want to see. It wouldn’t mean much to catch a Gondola widow, not with the horrors these women were about to endure.\nI needed to abort the plan.\nI moved away from the women in the back, starting to thread my way to the front of the crowd. The only way I could stop Maizy from speaking would be to make my presence known.\nI was halfway to the front when the head of the fund finished her interminable talk. She turned, and loudly introduced the First Lady of Illinois.\nFor a moment, Maizy looked terrified. Then she nodded and headed toward the monument. Even though the organization had insisted she speak, she clearly wasn’t going to.\nThen a man yelled, “Speech!”\nAs others took up the cry, I realized that the first shout had come from Regalese. I hadn’t had a chance to warn him about the flaw in our plan.\n“Speech! Speech! Speech!”\nShe headed doggedly toward the monument, and her husband trod after her. He caught her arm. She shook her head, and he smiled at her, a pleading little smile that told me more about their relationship than I wanted to know.\nThen he led her back to the podium.\nShe glanced at him, looking trapped. The shouters grew quiet. She whispered something.\n“Speak up!” Regalese shouted.\n“Can’t hear in the back!” one of the women shouted.\nMaizy closed her eyes, then squared her shoulders. “Ten years ago,” she said, “a group of Rebels tried to reignite the flames of our late war . . . ”\nPopping sounds echoed all over the graveyard, followed by banging and thudding. I saw bits of wood propel themselves from belowground. Other pieces—some larger than I wanted to think about—slammed out of nearby crypts, making gigantic holes in the stone.\nPeople screamed, and several men dropped to the ground, hands over their heads. Veterans, still reliving the war.\nMaizy looked horrified. She raised a hand, and all of the wood gathered around her.\n“Go away!” she screamed, waving her hand. “Go away! You’ll ruin everything!”\nI stepped over the prone bodies of the men, saw the sobbing women around me, and noted how many graves had burst open.\nMaizy pivoted so that she could run away, but the wood itself trapped her. It was trying to rebuild itself into her Gondola—and there were a lot of charred and goo-covered pieces, so that it could probably make a small replica of itself.\nThe Governor’s face had gone white. His hat had fallen to the ground, revealing his bald head. The wood shoved its way around him as if he hadn’t existed, and had gathered around her.\n“Maizy,” he said, trying to get close to her. “Maizy, what is this?”\nBut the wood pushed him away. Besides, it was pretty clear what this was: he’d been sleeping with the enemy, and he had just realized it.\nStill, he tried to get close, only to be pushed away.\nI passed the Governor, saw even more pieces of wood approaching from farther away in the cemetery, along with bits of the metal gears.\nMaizy was shaking her head, and muttering, “No, no, go away,” over and over again, as if she had forgotten how to control her Gondola.\n“Take off your gloves,” I snapped in the same tone my mentor had used as she trained me on magical equipment.\nMaizy stopped muttering. Her gaze met mine, and her mouth fell open as she understood I had a similar magic.\n“You can control your Gondola with your hands,” I said. “You know that.”\n“You do it,” she said softly, so only I could hear her. “You know how. For the Cause. We’ve got to try again. You know that. You need to help me.”\n“I don’t need to help you, you traitor,” I said.\nMy words carried over the panicked screams of the crowd. Everything grew quiet, and everyone was suddenly watching me.\nI didn’t want them to look at me. I wanted them to see her.\n“I’m not a traitor,” she said to me. “I’m loyal to my country.”\n“The Confederate States of America,” I said.\nShe glanced around the wood, still trying to reassemble, but she probably couldn’t see how many people were actually watching us. The wood had almost completely encircled her.\n“Like you,” she said.\n“I’m no Rebel,” I said.\n“Maizy.” The Governor sounded heartbroken. “Maizy, what’s going on?”\n“Let me tell you, Mr. Governor,” I said. “You married the Last Surviving Gondola Widow.”\nAt that moment, screams echoed around me. Women streamed forward, grabbing at Maizy, clutching her, pulling at her. The Governor took a step back, then nearly fell as Regalese yanked him out of the way.\nThe wood was trying to form a protective shield, but the shield wasn’t being designed by Maizy so it had no real shape. Or maybe she really had forgotten how to use her magic effectively. She still wore her gloves.\nThen the women of the Widows and Orphans Fund behind her tackled her and threw her to the ground.\nThe shrieks and cries and shouts of fury did not rival the sounds I heard on the day the Gondolas died, but they were hideous all the same.\nRegalese covered the Governor’s face as they both turned away. More widows and veterans ran to the podium and piled on the woman they had only moments before honored.\nThe Governor shook off Regalese and ran back to the mess, trying to pull people away. The wood remained gathered in a circle. Then it confusedly reassembled into the places that the pieces had probably held when they were part of the Gondola.\nRegalese pulled me away from the melee.\n“You don’t want to see this,” he said.\nBut, weirdly, I did. I didn’t want to climb into the pile and take my revenge. I had taken my revenge by arresting the Gondola widows, and making cases against them that then led to the arrest of the traitors who had masterminded this attack all over the South.\nClearly they were planning a new attack, and Maizy had been in position to prevent a response to it. Or channel information to the attackers. Regalese and I would inform the Pinkertons, and they would inform the government. The United States Government.\nNot that they’d miss this event. It was hideous.\nThe wood wobbled in place, and then the pieces toppled to the ground. I let out a small sound, and realized what that meant.\nMaizy Farmington was dead.\nMy heart twisted for a moment. Was I responsible for that? I had orchestrated this event, after all.\nThen I realized that all it would have taken was one mistake on her part, one softly spoken word, one laugh at a rally, and shrapnel from any survivors in the audience would have come toward her, just like it had here.\nShe had managed for four years to remain silent. But those first words, spoken almost like a confession, had condemned her.\nRegalese almost put his arm around me, then thought the better of it. He nodded, I nodded, and we left the cemetery, walking past the Statue of Death, past the entrance, and onto North Clark.\nTo our south, the city rose. The tall stone buildings, castles near the lake, dominated the downtown skyline.\nThey had survived the day the Gondolas died, a testament to the vision of the post-Fire leaders. The city—the state—would survive this as well.\nJust like the country had survived the attempt at a Second Civil War.\nJust like it would survive a third.\nI squared my shoulders and glanced over at Regalese. Somehow we had stopped something big. And only because we’d been doing our job.\nWe’d found the last of the Gondola widows.\nAnd I hoped to God we would never see any more.\nKristine Kathryn Rusch is a Hugo-award winning editor and writer. Her novels have hit bestseller lists around the world, including USA Today, The Wall Street Journal, and The Times of London. Although she's best known for her science fiction and fantasy, she's also an award-winning bestselling novelist under two other names, Kris Nelscott (mystery) and Kristine Grayson (paranormal romance). She's recently returned to editing with the critically acclaimed anthology series, Fiction River, where she acts as series editor with her husband Dean Wesley Smith, and as project editor on several volumes. Her latest project is a doozy. In partnership with WMG Publishing, she's putting out the last six books in her Anniversary Day Saga in 2015. The saga, a story told inside her Retrieval Artist universe, was already two novels long when the third, A Murder of Clones, appeared last month. This month, Search & Recovery appears. One more novel will appear each month until the final book in the saga, Masterminds, appears in June."}