{"fingerprint": "1gPNhNyxDTxL5Gk0CrKflocqaD4=", "sitename": "Clarkesworld Magazine", "title": "Warmth by Geoff Ryman", "author": "Geoff Ryman", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ryman_09_17_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Warmth by Geoff Ryman", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6570 words, short story, REPRINT\n Warmth\n I don’t remember the first time I saw BETsi. She was like the air I breathed. She was probably there when I was born.\n BETsi looked like a vacuum cleaner, bless her. She had long carpeted arms, and a carpeted top with loops of wool like hair. She was huggable, vaguely.\n I don’t remember hugging her much. I do remember working into that wool all kinds of unsuitable substances—spit, ice cream, dirt from the pots of basil.\n My mother talked to BETsi about my behavior. Mostly I remember my mother as a freckled and orange blur, always desperate to be moving, but sometimes she stayed still long enough for me to look at her.\n “This is Booker, BETsi,” my mother said at dictation speed. “You must stay clean, BETsi.” She thought BETsi was stupid. She was the one who sounded like a robot. “Please repeat.”\n “I must stay clean,” BETsi replied. BETsi sounded bright, alert, smooth-talking, with a built-in smile in the voice.\n “This is what I mean, BETsi: You must not let Clancy get you dirty. Why do you let Clancy get you dirty?”\n I pretended to do sums on a pretend calculator.\n While BETsi said, “Because he is a boy. From the earliest age, most boys move in a very different, more aggressive way than girls. His form of play will be rougher and can be indulged in to a certain extent.”\n Booker had programmed BETsi to talk about my development in front of me. That was so I would know what was going on. It was honest in a way; she did not want me to be deceived. On the other hand, I felt like some kind of long-running project in child psychology. Booker was more like a clinical consultant who popped in from time to time to see how things were progressing.\n You see, I was supposed to be a genius. My mother thought she was a genius, and had selected my father out of a sperm bank for geniuses. His only flaw, she told me, was his tendency towards baldness. BETsi could have told her: baldness is inherited from the maternal line.\n She showed me a picture of herself in an old Cosmopolitan article. It caused a stir at the time. “The New Motherhood,” it was called. Business women choose a new way.\n There is a photograph of Booker looking young and almost pretty, beautifully lit and cradling her swollen tummy. Her whole face, looking down on herself, is illuminated with love.\n In the article, she says: I know my son will be a genius. She says, I know he’ll have the right genes, and I will make sure he has the right upbringing. Cosmopolitan made no comment. They were making a laughingstock out of her.\n Look, my mother was Booker McCall, chief editor of a rival magazine company with a £100 million-a-year turnover and only fifteen permanent employees of which she was second in command. Nobody had a corporate job in those days, and if they did, it was wall-to-wall politics and performance. Booker McCall had stakeholders to suck up to, editors to commission, articles to read and tear to pieces. She had layouts to throw at designers’ heads. She had style to maintain, she had hair to keep up, shoes to repair, menus to plan. And then she had to score whatever she was on at the time. She was a very unhappy woman, with every reason to be.\n She was also very smart, and BETsi was a good idea. I used to look out of the window of the flat and the outside world looked blue, gray, harsh. Sunlight always caught the grime on the glass and bleached everything out, and I thought that adults moved out into a hot world in which everybody shouted all the time. I never wanted to go out.\n BETsi was my whole world. She had a screen, and she would show me paintings, one after another. Velasquez, Goya. She had a library of picture books—about monkeys, or fishing villages, or ghosts. She would allow me one movie a week, but always the right movie. Jurassic Park, Beauty and the Beast, Tarzan on Mars. We’d talk about them.\n “The dinosaurs are made of light,” she told me. “The computer tells the video what light to make and what colors the light should be so that it looks like a dinosaur.”\n “But dinosaurs really lived!” I remember getting very upset, I wailed at her. “They were really really real.”\n “Yes, but not those, those are just like paintings of dinosaurs.”\n “I want to see a real dinosaur!” I remember being heartbroken. I think I loved their size, their bulk, the idea of their huge hot breath. In my daydreams, I had a dinosaur for a friend and it would protect me in the world outside.\n “Clancy,” BETsi warned me. “You know what is happening now.”\n “Yes!” I shouted, “but knowing doesn’t stop it happening!”\n BETsi had told me that I was shy. Did you know that shyness has a clinical definition?\n I’d been tested for it. Once, BETsi showed me the test. First she showed me what she called the benchmark. On her screen, through a haze of fingerprints and jam, was one fat, calm, happy baby. Not me. “In the test,” BETsi explained, “a brightly colored mobile is shown to the child. An infant who will grow up to be an outgoing and confident adult will tend to look at the mobile with calm curiosity for a time, get bored, and then look away.”\n The fat happy baby smiled a little bit, reached up for the spinning red ducks and bright yellow bunnies, then sighed and looked around for something new.\n “A shy baby will get very excited. This is you, when we gave you the same test.”\n And there I was, looking solemn, 200 years old at six months, my infant face crossed with some kind of philosophical puzzlement. Then, they show me the mobile. My face lights up, I start to bounce, I gurgle with pleasure, delight, spit shoots out of my mouth. I get over-excited, the mobile is slightly beyond my grasp. My face crumples up, I jerk with the first little cries. Moments later I am screaming myself purple, and trying to escape the mobile, which has begun to terrify me.\n “That behavior is hardwired,” BETsi explained. “You will always find yourself getting too happy and then fearful and withdrawn. You must learn to control the excitement. Then you will be less fearful.”\n It’s like with VR. When they first started making that, they discovered they did not know enough about how we see and hear to duplicate the experience. They had to research people first. Same here. Before they could mimic personality, they first had to find out a lot more about what personality was.\n BETsi had me doing Transcendental Meditation and yoga at three years old. She had me doing what I now recognize was the Alexander Technique. I didn’t just nap, I had my knees up and my head on a raised wooden pillow. This was to elongate my back—I was already curling inward from tension.\n After she got me calm, BETsi would get me treats. She had Booker’s credit-card number and authorization to spend. BETsi could giggle. When the ice cream was delivered, or the new CD full of clip art, or my new S&M Toddler black leather gear, or my Barbie Sex-Change doll, BETsi would giggle.\n I know. She was programmed to giggle so that I would learn it was all right to be happy. But it sounded as though there was something who was happy just because I was. For some reason, that meant I would remember all by myself to stay calm.\n “I’ll open it later,” I would say, feeling very adult. “It’s ice cream, you fool,” BETsi would say. “It’ll melt.”\n “It will spread all over the carpet!” I whispered in delight.\n “Booker will get ma-had,” BETsi said in a sing-song voice. BETsi knew that I always called Booker by her name.\n BETsi could learn. She would have had to be trained to recognize and respond to my voice and Booker’s. She was programmed to learn who I was and what I needed. I needed conspiracy. I needed a confidant.\n “Look. You melt the ice cream and I will clean it up,” she said.\n “It’s ice cream, you fool,” I giggled back. “If it melts, I won’t be able to eat it!” We both laughed.\n BETsi’s screen could turn into a mirror. I’d see my own face and inspect it carefully for signs of being like Tarzan. Sometimes, as a game, she would have my own face talk back to me in my own voice. Or I would give myself a beard and a deeper voice to see what I would look like as a grown-up. To have revenge on Booker, I would make myself bald.\n I was fascinated by men. They were mythical beasts, huge and loping like dinosaurs, only hairy. The highlight of my week was when the window cleaner arrived. I would trail after him, too shy to speak, trying to puff myself up to the same size as he was. I thought he was a hero, who cleaned windows and then saved people from evil.\n “You’ll have to bear with Clancy,” BETsi would say to him. “He doesn’t see many men.”\n “Don’t you get out, little fella?” he would say. His name was Tom.\n “It’s not safe,” I managed to answer.\n Tom tutted. “Oh, that’s true enough. What a world, eh? You have to keep the kiddies locked in all day. S’like a prison.” I thought that all men had South London accents.\n He talked to BETsi as if she was a person. I don’t think Tom could have been very bright, but I do think he was a kindly soul. I think BETsi bought him things to give to me.\n “Here’s an articulated,” he said once, and gave me a beautifully painted Matchbox lorry.\n I took it in silence. I hated myself for being so tongue-tied. I wanted to swagger around the flat with him like Nick Nolte or Wesley Snipes.\n “Do men drive in these?” I managed to ask.\n “Some of them, yeah.”\n “Are there many men?”\n He looked blank. I answered for him. “There’s no jobs for men.”\n Tom hooted with laughter. “Who’s been filling your head?” he asked.\n “Clancy has a very high symbol-recognition speed,” BETsi told him. “Not genius, you understand. But very high. It will be useful for him in interpretative trades. However, he has almost no spatial reasoning. He will only ever dream of being a lorry driver.”\n “I’m a klutz,” I translated.\n Booker was an American—probably the most famous American in London at the time. BETsi was programmed to modulate her speech to match her owners. To this day, I can’t tell English and American accents apart unless I listen carefully. And I can imitate neither. I talk like BETsi.\n I remember Tom’s face, like a suet pudding, pale, blotchy, uneasy. “Poor little fella,” he said. “I’d rather not know all that about myself.”\n “So would Clancy,” said BETsi. “But I am programmed to hide nothing from him.”\n Tom sighed. “Get him with other kids,” he told her. “Oh, that is all part of the plan,” said BETsi.\n I was sent to Social Skills class. I failed. I discovered that I was terrified without BETsi, that I did not know what to do or say to people when she wasn’t there. I went off into a corner with a computer screen, but it seemed cold, almost angry with me. If I didn’t do exactly the right thing it wouldn’t work, and it never said anything nice to me. The other children were like ghosts. They flittered around the outside of my perceptions. In my mind, I muted the noise they made. They sounded as if they were shouting from the other side of the window, from the harsh gray world.\n The consultants wrote on my first report: Clancy is socially backward, even for his age.\n Booker was furious. She showed up one Wednesday and argued about it.\n “Do you realize that a thing like that could get in my son’s record!”\n “It happens to be true, Miss McCall.” The consultant was appalled and laughed from disbelief.\n “This creche leaves children unattended and blames them when their development is stunted.” Booker was yelling and pointing at the woman. “I want that report changed. Or I will report on you!”\n “Are you threatening to write us up in your magazines?” the consultant asked in a quiet voice.\n “I’m telling you not to victimize my son for your own failings. If he isn’t talking to the other children, it’s your job to help him.”\n Talking to other kids was my job. I stared at my shoes, mortified. I didn’t want Booker to help me, but I half wanted her to take me out of the class, and I knew that I would hate it if she did.\n I went to BETsi for coaching.\n “What you may not know,” she told me, “is that you have a natural warmth that attracts people.”\n “I do?” I said.\n “Yes. And all most people want from other people is that they be interested in them. Shall we practice?”\n On her screen, she invented a series of children. I would try to talk to them. BETsi didn’t make it easy.\n “Do you like reading?” I’d ask a little girl on the screen.\n “What?” she replied with a curling lip.\n “Books,” I persisted, as brave as I could be. “Do you read books?”\n She blinked—bemused, bored, confident.\n “Do . . . do you like Jurassic Park?”\n “It’s old! And it doesn’t have any story.”\n “Do you like new movies?” I was getting desperate.\n “I play games. Bloodlust Demon.” The little girl’s eyes went narrow and fierce. That was it. I gave up.\n “BETsi,” I complained. “This isn’t fair.” Booker would not allow me to play computer games.\n BETsi chuckled and used her own voice. “That’s what it’s going to be like, kiddo.”\n “Then show me some games.”\n “Can’t,” she said.\n “Not in the program,” I murmured angrily.\n “If I tried to show you one, I’d crash,” she explained.\n So I went back to Social Skills class determined to talk and it was every bit as awful as BETsi had said, but at least I was ready.\n I told them all, straight out: I can’t play games, I’m a klutz, all I can do is draw. So, I said, tell me about the games.\n And that was the right thing to do. At five I gave up being Tarzan and started to listen, because the kids could at least tell me about video games. They could get puffed up and important, and I would seep envy, which must have been very satisfying for them. But in a funny kind of way they sort of liked me.\n There was a bully called Ian Aston, and suddenly one day the kids told him: “Clancy can’t fight, so don’t pick on him.” He couldn’t stand up to all of them.\n “See if your Mum will let you visit,” they said, “and we’ll show you some games.”\n Booker said no. “It’s very nice you’re progressing socially, Clancy. But I’m not having you mix just yet. I know what sort of things are in the homes of parents like that, and I’m not having you exposed.”\n “Your Mum’s a posh git,” the children said.\n “And a half,” I replied.\n She was also a drug addict. One evening she didn’t collect me from Social Class. The consultant tried to reach her PDA, and couldn’t.\n “You have a Home Help, don’t you?” the consultant asked.\n She rang BETsi. BETsi said she had no record in her diary of where Miss McCall might be if not collecting me. BETsi sent round a taxi.\n Booker was out for two weeks. She just disappeared. She’d collapsed on the street, and everything was taken—her handbag, her shoes, her PDA, even her contact lenses. She woke up blind and raving from barbiturate withdrawal in an NHS ward, which would have mortified her. She claimed to be Booker McCall and several other people as well. I suppose it was also a kind of breakdown. Nobody knew who she was, nobody told us what had happened.\n BETsi and I just sat alone in the apartment, eating ice cream and Kellogg’s Crunchy Nut Cornflakes.\n “Do you suppose Booker will ever come back?” I asked her.\n “I do not know where Booker is, kiddo. I’m afraid something bad must have happened to her.”\n I felt guilty because I didn’t care. I didn’t care if Booker never came back. But I was scared.\n “What happens if you have a disc fault?” I asked BETsi.\n “I’ve just renewed the service contract,” she replied. She whirred closer to me, and put a carpeted arm around me.\n “But how would they know that something was wrong?”\n She gave me a little rousing shake. “I’m monitored, all day so that if there is a problem when your mother isn’t here, they come round and repair me.”\n “But what if you’re broken for a real long time? Hours and hours. Days?”\n “They’ll have a replacement.”\n “I don’t want a replacement.”\n “In a few hours, she’ll be trained to recognize your voice.”\n “What if it doesn’t work? What if the contractors don’t hear? What do I do then?”\n She printed out a number to call, and a password to enter.\n “It probably won’t happen,” she said. “So I’m going to ask you to do your exercises.”\n She meant to calm me down, as if my fears weren’t real, as if it couldn’t happen that a machine would break down.\n “I don’t want to do my exercises. Exercises won’t help.”\n “Do you want to see Jurassic Park?” she asked.\n “It’s old,” I said, and thought of my friends at Social Class and of their mothers who were with them.\n There was a whirring sound. A panel came up on the screen, like what happened during a service when the engineers came and checked her programming and reloaded the operational system. CONFIGURATION OVERRIDE the panels said.\n When that was over BETsi asked, “Would you like to learn how to play Bloodlust Demon?”\n “Oh!” I said and nothing else. “Oh! Oh! BETsi! Oh!” And she giggled.\n I remember the light on the beige carpet making a highway towards the screen. I remember the sound of traffic outside, peeping, hooting, the sound of nightfall and loneliness, the time I usually hated the most. But now I was playing Bloodlust Demon.\n I played it very badly. I kept getting blown up.\n “Just keep trying,” she said.\n “I have no spatial reasoning,” I replied. I was learning that I did not like computer games. But for the time being, I had forgotten everything else.\n After two weeks, I assumed that Booker had gotten bored and had gone away and would never be back. Then one morning, when the hot world seemed to be pouring in through the grimy windows, someone kicked down the front door.\n BETsi made a cage around me with her arms.\n “I am programmed for both laser and bullet defense. Take what you want, but do not harm the child. I cannot take your photograph or video you. You will not be recognized. There is no need to damage me.”\n They broke the glass tables, they threw drawers onto the floor. They dropped their trousers and shat in the kitchen. They took silver dresses, Booker’s black box, her jewelry. One of the thieves took hold of my Matchbox lorry and I knew the meaning of loss. I was going to lose my truck. Then the thief walked back across the carpet towards me. BETsi’s arms closed more tightly around me. The thief chuckled under his ski mask and left the truck nearby on the sofa.\n “There you go, little fella,” he said. I never told anyone. It was Tom. Like I said, he wasn’t very bright. BETsi was programmed not to recognize him.\n So I knew then what men were; they could go bad. There was part of them that was only ever caged up. I was frightened of men after that.\n The men left the door open, and the flat was a ruin, smashed and broken, and BETsi’s cage of arms was lifted up, and I began to cry, and then I began to scream over and over and over, and finally some neighbors came, and finally the search was on for Booker McCall.\n How could an editor-in-chief disappear for two weeks? “We thought she’d gone off with a new boyfriend,” her colleagues said, in the press, to damage her. Politics, wall to wall. It was on TV, the Uncaring Society they called it. No father, no grandparents, neighbors who were oblivious—the deserted child was only found because of a traumatic break in.\n Booker was gone a very long time. Barbiturates are the worst withdrawal of all. I visited her, with one of the consultants from my Class. It got her picture in the papers, and a caption that made it sound as though the consultants were the only people who cared.\n Booker looked awful. Bright yellow with blue circles under her eyes. She smelled of thin stale sweat.\n “Hello, Clancy,” she whispered. “I’ve been in withdrawal.”\n So—what? Tell me something I didn’t know. I was hardhearted. I had been deserted, she had no call on my respect.\n “Did you miss me?” She looked like a cut flower that had been left in a vase too long, with smelly water.\n I didn’t want to hurt her, so all I said was: “I was scared.”\n “Poor baby,” she whispered. She meant it, but the wave of sympathy exhausted her and she lay back on the pillow. She held out her hand.\n I took it and I looked at it.\n “Did BETsi take good care of you?” she asked, with her eyes closed.\n “Yes,” I replied, and began to think, still looking at her fingers. She really can’t help all of this, all of this is hardwired. I bet she’d like to be like BETsi, but can’t. Anyway, barbiturates don’t work on metal and plastic.\n Suddenly she was crying, and she’d pushed my hand onto her moist cheek. It was sticky and I wanted to get away, and she said, “Tell me a story. Tell me some beautiful stories.”\n So I sat and told her the story of Jurassic Park. She lay still, my hand on her cheek. At times I thought she was asleep, other times I found I hoped she loved the story as much as I did, raptors and brachiosaurs and T. Rex.\n When I was finished, she murmured, “At least somebody’s happy.” She meant me. That was what she wanted to think, that I was all right, that she would not have to worry about me. And that too, I realized, would never change.\n She came home. She stayed in bed all day for two more weeks, driving me nuts. “My life is such a mess!” she said, itchy and anxious. She promised me she would spend more time with me, God forbid. She raged against the bastards at BPC. We’d be moving as soon as she was up, she promised me, filling my heart with terror. She succeeded in disrupting my books, my movies, my painting. Finally she threw off the sheets a month early and went back to work. I gathered she still went in for treatment every fortnight. I gathered that booze now took the place of Barbies. The smell of the flat changed. And now that I hated men, there were a lot of them, loose after work.\n “This is my boy,” she would say, with a kind of wobbly pride, introducing me to yet another middle-aged man with a ponytail. “Mr. d’Angelo is a designer,” she would say, as if she went out with their professions. She started to wear wobbly red lipstick. It got everywhere, on pillows, sheets, walls, and worst of all on my Nutella tumblers.\n The flat had been my real world, against the outside, and now all that had changed. I went to school. I had to say goodbye to BETsi, every morning, and goodbye to Booker, who left wobbly red lipstick on my collar. I went to school in a taxi.\n “You see,” said BETsi, after my first day. “It wasn’t bad was it? It works, doesn’t it?”\n “Yes, BETsi,” I remember saying. “It does.” The “it” was me. We both meant my precious self. She had done her job.\n Through my later school days, BETsi would sit unused in my room—most of the time. Sometimes at night, under the covers, I would reboot her, and the screen would open up to all the old things, still there. My childhood was already another world—dinosaurs and space cats and puzzles. BETsi would pick up where we had left off, with no sense of neglect, no sense of time or self.\n “You’re older,” she would say. “About twelve. Let me look at you.” She would mirror my face, and whir to herself. “Are you drawing?”\n “Lots,” I would say.\n “Want to mess around with the clip art, kiddo?” she would ask.\n And long into the night, when I should have been learning algebra, we would make collages on her screen. I showed surfers on waves that rose up amid galaxies blue and white in space, and through space there poured streams of roses. A row of identical dancing Buddhas was an audience.\n “Tell me about your friends, and what you do,” she asked, as I cut and pasted. And I’d tell her about my friend John and his big black dog, Toro, and how we were caught in his neighbors’ garden. I ran and escaped, but John was caught. John lived outside town in the countryside. And I’d tell her about John’s grandfather’s farm, full of daffodils in rows. People use them to signal spring, to spell the end of winter. Symbol recognition.\n “I’ve got some daffodils,” BETsi said. “In my memory.”\n And I would put them into the montage for her, though it was not spring any longer.\n I failed at algebra. Like everything else in Booker’s life, I was something that did not quite pan out as planned. She was good about it. She never upbraided me for not being a genius. There was something in the way she ground out her cigarette that said it all.\n “Well, there’s always art school,” she said, and forced out a blast of blue-white smoke.\n It was BETsi I showed my projects to—the A-level exercises in sketching elephants in pencil.\n “From a photo,” BETsi said. “You can always tell. So. You can draw as well as a photograph. Now what?”\n “That’s what I think,” I said. “I need a style of my own.”\n “You need to do that for yourself,” she said.\n “I know,” I said, casually.\n “You won’t always have me to help,” she said.\n The one thing I will never forgive Booker for is selling BETsi without telling me. I came back from first term at college to find the machine gone. I remember that I shouted, probably for the first time ever, “You did what?”\n I remember Booker’s eyes widening, blinking. “It’s just a machine, Clancy. I mean, it wasn’t as if she was a member of the family or anything.”\n “How could you do it! Where is she?”\n “I don’t know. I didn’t think you’d be so upset. You’re being awfully babyish about this.”\n “What did you do with her?”\n “I sold her back to the contract people, that’s all.” Booker was genuinely bemused. “Look. You are hardly ever here, it isn’t as though you use her for anything. She’s a child-development tool, for Chrissakes. Are you still a child?”\n I’d thought Booker had been smart. I’d thought that she had recognized she would not have time to be a mother, and so had brought in BETsi. I thought that meant she understood what BETsi was. She didn’t and that meant she had not understood, not even been smart.\n “You,” I said, “have sold the only real mother I have ever had.” I was no longer shouting. I said it at dictation speed. I’m not sure Booker has ever forgiven me.\n Serial numbers, I thought. They have serial numbers, maybe I could trace her through those. I rang up the contractors. The kid on the phone sighed.\n “You want to trace your BETsi,” he said before I’d finished, sounding bored.\n “Yes,” I said. “I do.”\n He grunted and I heard a flicker of fingertips on a keyboard.\n “She’s been placed with another family. Still operational. But,” he said, “I can’t tell you where she is.”\n “Why not?”\n “Well, Mr. McCall. Another family is paying for the service, and the developer is now working with another child. Look. You are not unusual, OK? In fact this happens about half the time, and we cannot have customers disturbed by previous charges looking up their machines.”\n “Why not?”\n “Well,” he chortled; it was so obvious to him. “You might try imagining it from the child’s point of view. They have a new developer of their own, and then this other person, a stranger, tries to muscle in.”\n “Just. Please. Tell me where she is.”\n “Her memory has been wiped,” he said, abruptly.\n It took a little while. I remember hearing the hiss on the line.\n “She won’t recognize your voice. She won’t remember anything about you. She is just a service vehicle. Try to remember that.”\n I wanted to strangle the receiver. I sputtered down the line like a car cold-starting. “Don’t . . . couldn’t you keep a copy! You know this happens, you bastard. Couldn’t you warn people, offer them the disc? Something?”\n “I’m sorry sir, but we do, and you turned the offer down.”\n “I’m sorry?” I was dazed.\n “That’s what your entry says.”\n Booker, I thought. Booker, Booker, Booker. And I realized; she couldn’t understand, she’s just too old. She’s just from another world.\n “I’m sorry, sir, but I have other calls on the line.”\n “I understand,” I replied.\n All my books, all my collages, my own face in the mirror. It had been like a library I could visit whenever I wanted to see something from the past. It was as if my own life had been wiped.\n Then for some reason, I remembered Tom.\n He was fat and 40 and defeated, a bloke. I asked him to break into the contractor’s office and read the files and find who had her.\n “So,” he said. “You knew then.”\n “Yup.”\n He blew out hard through his lips and looked at me askance.\n “Thanks for the lorry,” I said, by way of explanation.\n “I always liked you, you know. You were a nice little kid.” His fingers were tobacco-stained. “I can see why you want her back. She was all you had.”\n He found her all right. I sent him a check. Sometimes even now I send him a check.\n Booker would have been dismayed—BETsi had ended in a resold council flat. I remember, the lift was broken and the stairs smelled of pee. The door itself was painted fire-engine red and had a non-breakable plaque on the doorway. The Andersons, it said amid ceramic pansies. I knocked.\n BETsi answered the door. Boom. There she was, arms extended defensively to prevent entry. She’d been cleaned up but there was still rice pudding in her hair. Beyond her, I saw a slumped three-piece suite and beige carpet littered with toys. There was a smell of baby food and damp flannel.\n “BETsi?” I asked, and knelt down in front of her. She scanned me, clicking. I could almost see the wheels turning, and for some reason, I found it funny. “It’s OK,” I said, “you won’t know me, dear.”\n “Who is it, Betty?” A little girl came running. To breathe the air that flows in through an open door, to see someone new, to see anyone at all.\n “A caller, Bumps,” replied BETsi. Her voice was different, a harsher, East End lilt. “And I think he’s just about to be on his way.”\n I found that funny too; I still forgave her. It wasn’t her fault. Doughty old BETsi still doing her job, with this doubtful man she didn’t know trying to gain entry.\n There might be, though, one thing she could do.\n I talked to her slowly, I tried to imitate an English accent. “You do not take orders from someone with my voice. But I mean no harm, and you may be able to do this. Can you show me my face on your screen?”\n She whirred. Her screen flipped out of sleep. There I was.\n “I am an old charge of yours,” I said—both of us, me and my image, his voice echoing mine. “My name is Clancy. All I ask you to do is remember me. Can you do that?”\n “I understand what you mean,” she said. “I don’t have a security reason not to.”\n “Thank you,” I said. “And see if you can program the following further instructions.”\n “I cannot take instruction from you.”\n “I know. But check if this violates security. Set aside part of your memory. Put Bumps into it. Put me and Bumps in the same place, so that even when they wipe you again you’ll remember us.”\n She whirred. I began to get excited; I talked like myself.\n “Because they’re going to wipe you BETsi, whenever they resell you. They’ll wipe you clean. It might be nice for Bumps if you remember her. Because we’ll always remember you.”\n The little girl’s eyes were on me, dark and serious, 200 years old. “Do what he says, Betty,” the child said.\n Files opened and closed like mouths. “I can put information in an iced file,” said BETsi. “It will not link with any other files, so it will not be usable to gain entry to my systems.” Robots and people: these days we all know too much about our inner workings.\n I said thank you and goodbye, and said it silently looking into the eyes of the little girl, and she spun away on her heel as if to say: I did that.\n I still felt happy, running all the way back to the tube station. I just felt joy.\n So that’s the story.\n It took me a long time to make friends in school, but they were good ones. I still know them, though they are now middle-aged men, clothiers in Toronto, or hearty freelancers in New York who talk about their men and their cats. Make a long story short. I grew up to be one of the people my mother used to hire and abuse.\n I am a commercial artist, though more for book and CD covers than magazines. I’m about to be a Dad. One of my clients, a very nice woman. We used to see each other and get drunk at shows. In the hotel bedrooms I’d see myself in the mirror—not quite middle-aged, but with a ponytail. Her name is some kind of mistake. Bertha.\n Bertha is very calm and cool and reliable. She called me and said coolly, I’m having a baby and you’re the father, but don’t worry. I don’t want anything from you.\n I wanted her to want something from me. I wanted her to say marry me, you bastard. Or at least: could you take care of it on weekends? Not only didn’t she want me to worry—it was clear that she didn’t want me at all. It was also clear I could expect no more commissions from her.\n I knew then what I wanted to do. I went to Hamleys.\n There they were, the Next Degradation. Now they call them things like Best Friend or Home Companions, and they’ve tried to make them look human. They have latex skins and wigs and stiff little smiles. They look like burn victims after plastic surgery, and they recognize absolutely everybody. Some of them are modeled after Little Women. You can buy Beth or Amy or Jo. Some poor little rich girls start dressing them up in high fashion—the bills are said to be staggering. You can also buy male models—a lively Huckleberry, or big Jim. I wonder if those might not be more for the Mums, particularly if all parts are in working order.\n “Do you . . . do you have any older models?” I ask at the counter.\n The assistant is a sweet woman, apple cheeked, young, pretty, and she sees straight through me. “We have BETsis,” she says archly.\n “They still make them?” I say, softly.\n “Oh, they’re very popular,” she says, and pauses, and decides to drop the patter. “People want their children to have them. They loved them.”\n History repeats like indigestion.\n I turn up at conventions like this one. I can’t afford a stand but my livelihood depends on getting noticed anyway.\n And if I get carried away and believe a keynote speaker trying to be a visionary, if he talks about, say, Virtual Government or Loose Working Practices, then I get overexcited. I think I see God, or the future or something and I get all jittery. And I go into the exhibition hall and there is a wall of faces I don’t know and I think: I’ve got to talk to them, I’ve got to sell to them. I freeze, and I go back to my room.\n And I know what to do. I think of BETsi, and I stretch out on the floor and take hold of my shoulders and my breathing and I get off the emotional roller-coaster. I can go back downstairs, and back into the hall. And I remember that something once said: you have a natural warmth that attracts people, and I go in, and even though I’m a bit diffident, by the end of the convention, we’re laughing and shaking hands, and I have their business card. Or maybe we’ve stayed up drinking till four in the morning, playing Bloodlust Demon. They always win. They like that, and we laugh.\n It is necessary to be loved. I’m not sentimental: I don’t think a computer loved me. But I was hugged, I was noticed, I was cared for. I was made to feel that I was important, special, at least to something. I fear for all the people who do not have that. Like everything else, it is now something that can be bought. It is therefore something that can be denied. It is possible that without BETsi, I might have to stay upstairs in that hotel room, panicked. It is possible that I would end up on barbiturates. It is possible that I could have ended up one of those sweet sad people sitting in the rain in shop doorways saying the same thing in London or New York, in exactly the same accent: any spare change please?\n But I didn’t. I put a proposition to you.\n If there were a God who saw and cared for us and was merciful, then when I died and went to Heaven, I would find among all the other things, a copy of that wiped disc.\n Originally published in Interzone, October 1995.\n Born in Canada, Geoff Ryman now lives in England. He made his first sale in 1976, but it was not until 1984, with the appearance of his brilliant novella \"The Unconquered Country\" that he first attracted any serious attention. \"The Unconquered Country,\" one of the best novellas of the decade, had a stunning impact on the science fiction scene of the day, and almost overnight established Ryman as one of the most accomplished writers of his generation, winning him both the British Science Fiction Award and the World Fantasy Award; it was later published in a book version, The Unconquered Country: A Life History. His novel The Child Garden: A Low Comedy won both the prestigious Arthur C. Clarke Award and the John W. Campbell Memorial Award; and his later novel Air also won the Arthur C. Clarke Award. His other novels include The Warrior Who Carried Life, the critically-acclaimed mainstream novels Was, Coming of Enkidu, The King's Last Song, Lust, and the underground cult classic 253, the \"print remix\" of an \"interactive hypertext novel\" which in its original form ran online, and which, in its print form won the Philip K. Dick Award. Four of his novellas have been collected in Unconquered Countries. His most recent books are the anthology When It Changed, the novel The Film-Makers of Mars, and the collection Paradise Tales: and Other Stories."}