{"fingerprint": "AIIZGz2/wU9mFu8wIsVZ9YWTHWU=", "sitename": "Clarkesworld Magazine", "title": "Have Not Have by Geoff Ryman", "author": "Geoff Ryman", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/ryman_06_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Have Not Have by Geoff Ryman", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8180 words, novelette, REPRINT\n Have Not Have\n Mae lived in the last village in the world to go on line. After that, everyone else went on Air.\n Mae was the village’s fashion expert. She advised on makeup, sold cosmetics, and provided good dresses. Every farmer’s wife needed at least one good dress. The richer wives, like Mr. Wing’s wife Kwan, wanted more than one.\n Mae would sketch what was being worn in the capital. She would always add a special touch: a lime green scarf with sequins; or a lacy ruffle with colorful embroidery. A good dress was for display. “We are a happier people and we can wear these gay colors,” Mae would advise.\n “Yes, that is true,” her customer might reply, entranced that fashion expressed their happy culture. “In the photographs, the Japanese women all look so solemn.”\n “So full of themselves,” said Mae, and lowered her head and scowled, and she and her customer would laugh, feeling as sophisticated as anyone in the world.\n Mae got her ideas as well as her mascara and lipsticks from her trips to the town. Even in those days, she was aware that she was really a dealer in information. Mae had a mobile phone. The mobile phone was necessary, for the village had only one line telephone, in the tea room. She needed to talk to her suppliers in private, because information shared aloud in the tea room was information that could no longer be sold.\n It was a delicate balance. To get into town, she needed to be driven, often by a client. The art then was to screen the client from her real sources.\n So Mae took risks. She would take rides by herself with the men, already boozy after the harvest, going down the hill for fun. Sometimes she needed to speak sharply to them, to remind them who she was.\n The safest ride was with the village’s schoolteacher, Mr. Shen. Teacher Shen only had a pony and trap, so the trip, even with an early rise, took one whole day down and one whole day back. But there was no danger of fashion secrets escaping with Teacher Shen. His interests lay in poetry and the science curriculum. In town, they would visit the ice cream parlor, with its clean tiles, and he would lick his bowl, guiltily, like a child. He was a kindly man, one of their own, whose education was a source of pride for the whole village. He and Mae had known each other longer than they could remember.\n Sometimes, however, the ride had to be with someone who was not exactly a friend.\n In the April before everything changed there was to be an important wedding.\n Seker, whose name meant Sugar, was the daughter of the village’s pilgrim to Mecca, their Haj. Seker was marrying into the Atakoloo family, and the wedding was a big event. Mae was to make her dress.\n One of Mae’s secrets was that she was a very bad seamstress. The wedding dress was being made professionally, and Mae had to get into town and collect it. When Sunni Haseem offered to drive her down in exchange for a fashion expedition, Mae had to agree.\n Sunni herself was from an old village family, but her husband Faysal Haseem was from further down the hill. Mr. Haseem was a beefy brute whom even his wife did not like except for his suits and money. He puffed on cigarettes and his tanned fingers were as thick and weathered as the necks of turtles. In the back seat with Mae, Sunni giggled and prodded and gleamed with the thought of visiting town with her friend and confidante who was going to unleash her beauty secrets.\n Mae smiled and whispered, promising much. “I hope my source will be present today,” she said. “She brings me my special colors, you cannot get them anywhere else. I don’t ask where she gets them.” Mae lowered her eyes and her voice. “I think her husband . . . .”\n A dubious gesture, meaning, that perhaps the goods were stolen, stolen from—who knows?—supplies meant for foreign diplomats? The tips of Mae’s fingers rattled once, in provocation, across her client’s arm.\n The town was called Yeshibozkay, which meant Green Valley. It was now approached through corridors of raw apartment blocks set on beige desert soil. It had a new jail and discos with mirror balls, billboards, illuminated shop signs and Toyota jeeps that belched out blue smoke.\n But the town center was as Mae remembered it from childhood. Traditional wooden houses crowded crookedly together, flat-roofed with shutters, shingle-covered gables and tiny fading shop signs. The old market square was still full of peasants selling vegetables laid out on mats. Middle-aged men still played chess outside tiny cafes; youths still prowled in packs.\n There was still the public address system. The address system barked out news and music from the top of the electricity poles. Its sounds drifted over the city, announcing public events or new initiatives against drug dealers. It told of progress on the new highway, and boasted of the well-known entertainers who were visiting the town.\n Mr. Haseem parked near the market, and the address system seemed to enter Mae’s lungs, like cigarette smoke, perfume, or hair spray. She stepped out of the van and breathed it in. The excitement of being in the city trembled in her belly. As much as the bellowing of shoppers, farmers and donkeys; as much as the smell of raw petrol and cut greenery and drains, the address system made her spirits rise. She and her middle-aged client looked on each other and gasped and giggled at themselves.\n “Now,” Mae said, stroking Sunni’s hair, her cheek. “It is time for a complete makeover. Let’s really do you up. I cannot do as good work up in the hills.”\n Mae took her client to Halat’s, the same hairdresser as Sunni might have gone to anyway. But Mae was greeted by Halat with cries and smiles and kisses on the cheek. That implied a promise that Mae’s client would get special treatment. There was a pretense of consultancy. Mae offered advice, comments, cautions. Careful! she has such delicate skin! Hmm, the hair could use more shaping there. And Halat hummed as if perceiving what had been hidden before and then agreed to give the client what she would otherwise have given. But Sunni’s nails were soaking, and she sat back in the center of attention, like a queen.\n All of this allowed the hairdresser to charge more. Mae had never pressed her luck and asked for a cut. Something beady in Halat’s eyes told her there would be no point. What Mae got out of it was standing, and that would lead to more work later.\n With cucumbers over her eyes, Sunni was safely trapped. Mae announced, “I just have a few errands to run. You relax and let all cares fall away.” She disappeared before Sunni could protest.\n Mae ran to collect the dress. A disabled girl, a very good seamstress called Miss Soo, had opened up a tiny shop of her own.\n Miss Soo was grateful for any business, poor thing, skinny as a rail and twisted. After the usual greetings, Miss Soo shifted round and hobbled and dragged her way to the back of the shop to fetch the dress. Her feet hissed sideways across the uneven concrete floor. Poor little thing, Mae thought. How can she sew?\n Yet Miss Soo had a boyfriend in the fashion business. Genuinely in the fashion business, far away in the capital city, Balshang. The girl often showed Mae his photograph. It was like a magazine photograph. The boy was very handsome, with a shiny shirt and coiffed-up hair. She kept saying she was saving up money to join him. It was a mystery to Mae what such a boy was doing with a cripple for a girlfriend. Why did he keep contact with her? Publicly Mae would say to friends of the girl: it is the miracle of love, what a good heart he must have. Otherwise she kept her own counsel which was this: you would be very wise not to visit him in Balshang.\n The boyfriend sent Miss Soo the patterns of dresses, photographs, magazines, or even whole catalogs. There was one particularly treasured thing; a showcase publication. The cover was like the lid of a box, and it showed in full color the best of the nation’s fashion design.\n Models so rich and thin they looked like ghosts. They looked half asleep, as if the only place they carried the weight of their wealth was on their eyelids. It was like looking at Western or Japanese women, and yet not. These were their own people, so long-legged, so modern, so ethereal, as if they were made of air.\n Mae hated the clothes. They looked like washing-up towels. Oatmeal or gray in one color and without a trace of adornment.\n Mae sighed with lament. “Why do these rich women go about in their underwear?”\n The girl shuffled back with the dress, past piles of unsold oatmeal cloth. Miss Soo had a skinny face full of teeth, and she always looked like she was staring ahead in fear. “If you are rich you have no need to try to look rich.” Her voice was soft. She made Mae feel like a peasant without meaning to. She made Mae yearn to escape herself, to be someone else, for the child was effortlessly talented, somehow effortlessly in touch with the outside world.\n “Ah yes,” Mae sighed. “But my clients, you know, they live in the hills.” She shared a conspiratorial smile with the girl. “Their taste! Speaking of which, let’s have a look at my wedding cake of a dress.”\n The dress was actually meant to look like a cake, all pink and white sugar icing, except that it kept moving all by itself. White wires with Styrofoam bobbles on the ends were surrounded with clouds of white netting.\n “Does it need to be quite so busy?” the girl asked, doubtfully, encouraged too much by Mae’s smile.\n “I know my clients,” replied Mae coolly. This is at least, she thought, a dress that makes some effort. She inspected the work. The needlework was delicious, as if the white cloth were cream that had flowed together. The poor creature could certainly sew, even when she hated the dress.\n “That will be fine,” said Mae, and made move toward her purse.\n “You are so kind!” murmured Miss Soo, bowing slightly.\n Like Mae, Miss Soo was of Chinese extraction. That was meant not to make any difference, but somehow it did. Mae and Miss Soo knew what to expect of each other.\n “Some tea?” the girl asked. It would be pale, fresh-brewed, not the liquid tar that the native Karsistanis poured from continually boiling kettles.\n “It would be delightful, but I do have a customer waiting,” explained Mae.\n The dress was packed in brown paper and carefully tied so it would not crease. There were farewells, and Mae scurried back to the hairdresser’s. Sunni was only just finished, hair spray and scent rising off her like steam.\n “This is the dress,” said Mae and peeled back part of the paper, to give Halat and Sunni a glimpse of the tulle and Styrofoam.\n “Oh!” the women said, as if all that white were clouds, in dreams.\n And Halat was paid. There were smiles and nods and compliments and then they left.\n Outside the shop, Mae breathed out as though she could now finally speak her mind. “Oh! She is good, that little viper, but you have to watch her, you have to make her work. Did she give you proper attention?”\n “Oh, yes, very special attention. I am lucky to have you for a friend,” said Sunni. “Let me pay you something for your trouble.”\n Mae hissed through her teeth. “No, no, I did nothing, I will not hear of it.” It was a kind of ritual.\n There was no dream in finding Sunni’s surly husband. Mr. Haseem was red-faced, half-drunk in a club with unvarnished walls and a television.\n “You spend my money,” he declared. His eyes were on Mae.\n “My friend Mae makes no charges,” snapped Sunni.\n “She takes something from what they charge you.” Mr. Haseem glowered like a thunderstorm.\n “She makes them charge me less, not more,” replied Sunni, her face going like stone.\n The two women exchanged glances. Mae’s eyes could say: How can you bear it, a woman of culture like you?\n It is my tragedy, came the reply, aching out of the ashamed eyes. So they sat while the husband sobered up and watched television. Mae contemplated the husband’s hostility to her, and what might lie behind it. On the screen, the local female newsreader talked: Talents, such people were called. She wore a red dress with a large gold broach. Something had been done to her hair to make it stand up in a sweep before falling away. She was as smoothly groomed as ice. She chattered in a high voice, perky through a battery of tiger’s teeth. “She goes to Halat’s as well,” Mae whispered to Sunni. Weather, maps, shots of the honored President and the full cabinet one by one, making big decisions.\n The men in the club chose what movie they wanted. Since the Net, they could do that. It had ruined visits to the town. Before, it used to be that the men were made to sit through something the children or families might also like, so you got everyone together for the watching of the television. The clubs had to be more polite. Now, because of the Net, women hardly saw TV at all and the clubs were full of drinking. The men chose another kung-fu movie. Mae and Sunni endured it, sipping Coca-Cola. It became apparent that Mr. Haseem would not buy them dinner.\n Finally, late in the evening, Mr. Haseem loaded himself into the van. Enduring, unstoppable, and quite dangerous, he drove them back up into the mountains, weaving across the middle of the road.\n “You make a lot of money out of all this,” Mr. Haseem said to Mae.\n “I . . . I make a little something. I try to maintain the standards of the village. I do not want people to see us as peasants. Just because we live on the high road.”\n Sunni’s husband barked out a laugh. “We are peasants!” Then he added, “You do it for the money.”\n Sunni sighed in embarrassment. And Mae smiled a hard smile to herself in the darkness. You give yourself away, Sunni’s-man. You want my husband’s land. You want him to be your dependent. And you don’t like your wife’s money coming to me to prevent it. You want to make both me and my husband your slaves.\n It is a strange thing to spend four hours in the dark listening to an engine roar with a man who seeks to destroy you.\n In late May, school ended.\n There were no fewer than six girls graduating and each one of them needed a new dress. Miss Soo was making two of them; Mae would have to do the others, but she needed to buy the cloth. She needed another trip to Yeshibozkay.\n Mr. Wing was going to town to collect a new television set for the village. It was going to be connected to the Net. There was high excitement: graduation, a new television set. Some of the children lined up to wave good-bye to them.\n Their village, Kizuldah, was surrounded by high, terraced mountains. The rice fields went up in steps, like a staircase into clouds. There was snow on the very tops year round.\n It was a beautiful day, cloudless, but still relatively cool. Kwan, Mr. Wing’s wife, was one of Mae’s favorite women; she was intelligent, sensible; there was less dissembling with her. Mae enjoyed the drive.\n Mr. Wing parked the van in the market square. As Mae reached into the back for her hat, she heard the public address system. The voice of the Talent was squawking.\n “ . . . a tremendous advance for culture,” the Talent said. “Now the Green Valley is no farther from the center of the world than Paris, Singapore, or Tokyo.”\n Mae sniffed. “Hmm. Another choice on this fishing net of theirs.”\n Wing stood outside the van, ramrod straight in his brown and tan town shirt. “I want to hear this,” he said, smiling slightly, taking nips of smoke from his cigarette.\n Kwan fanned the air. “Your modern wires say that smoking is dangerous. I wish you would follow all this news you hear.”\n “Ssh!” he insisted.\n The bright female voice still enthused. “Previously all such advances left the Valley far behind because of wiring. This advance will be in the air we breathe. Previously all such advances left the Valley behind because of the cost of the new devices needed to receive messages. This new thing will be like Net TV in your head. All you need is the wires in the human mind.”\n Kwan gathered up her things. “Some nonsense or another,” she murmured.\n “Next Sunday, there will be a test. The test will happen in Tokyo and Singapore but also here in the Valley at the same time. What Tokyo sees and hears, we will see and hear. Tell everyone you know, next Sunday, there will be a test. There is no need for fear, alarm, or panic.”\n Mae listened then. There would certainly be a need for fear and panic if the address system said there was none.\n “What test, what kind of test? What? What?” the women demanded of the husband.\n Mr. Wing played the relaxed, superior male. He chuckled. “Ho-ho, now you are interested, yes?”\n Another man looked up and grinned. “You should watch more TV,” he called. He was selling radishes and shook them at the women.\n Kwan demanded, “What are they talking about?”\n “They will be able to put TV in our heads,” said the husband, smiling. He looked down, thinking perhaps wistfully of his own new venture. “Tut. There has been talk of nothing else on the TV for the last year. But I didn’t think it would happen.”\n All the old market was buzzing like flies on carrion, as if it were still news to them. Two youths in strange puffy clothes spun on their heels and slapped each other’s palms, in a gesture that Mae had seen only once or twice before. An old granny waved it all away and kept on accusing a dealer of short measures.\n Mae felt grave doubt. “TV in our heads. I don’t want TV in my head.” She thought of viper newsreaders and kung fu.\n Wing said, “It’s not just TV. It is more than TV. It is the whole world.”\n “What does that mean?”\n “It will be the Net. Only, in your head. The fools and drunks in these parts just use it to watch movies from Hong Kong. The Net is all things.” He began to falter.\n “Explain! How can one thing be all things?”\n There was a crowd of people gathering to listen.\n “Everything is on it. You will see on our new TV.” Kwan’s husband did not really know either.\n The routine was soured. Halat the hairdresser was in a very strange mood, giggly, chattery, her teeth clicking together as if it were cold.\n “Oh, nonsense,” she said when Mae went into her usual performance. “Is this for a wedding? For a feast?”\n “No,” said Mae. “It is for my special friend.”\n The little hussy put both hands either side of her mouth as if in awe. “Oh! Uh!”\n “Are you going to do a special job for her or not?” demanded Mae. Her eyes were able to say: I see no one else in your shop.\n Oh, how the girl would have loved to say: I am very busy—if you need something special come back tomorrow. But money spoke. Halat slightly amended her tone. “Of course. For you.”\n “I bring my friends to you regularly because you do such good work for them.”\n “Of course,” the child said. “It is all this news, it makes me forget myself.”\n Mae drew herself up, and looked fierce, forbidding, in a word, older. Her entire body said: do not forget yourself again. The way the child dug away at Kwan’s hair with the long comb handle said back: peasants.\n The rest of the day did not go well. Mae felt tired, distracted. She made a terrible mistake and, with nothing else to do, accidentally took Kwan to the place where she bought her lipsticks.\n “Oh! It is a treasure trove!” exclaimed Kwan.\n Idiot, thought Mae to herself. Kwan was good-natured and would not take advantage. But if she talked! There would be clients who would not take such a good-natured attitude, not to have been shown this themselves.\n “I do not take everyone here,” whispered Mae. “Hmm? This is for special friends only.”\n Kwan was good-natured, but very far from stupid. Mae remembered, in school Kwan had always been best at letters, best at maths. Kwan was pasting on false eyelashes in a mirror and said, very simply and quickly, “Don’t worry, I won’t tell anyone.”\n And that was far too simple and direct. As if Kwan were saying: fashion expert, we all know you. She even looked around and smiled at Mae, and batted her now huge eyes, as if mocking fashion itself.\n “Not for you,” said Mae. “The false eyelashes. You don’t need them.”\n The dealer wanted a sale. “Why listen to her?” she asked Kwan.\n Because, thought Mae, I buy fifty riels’ worth of cosmetics from you a year.\n “My friend is right,” said Kwan, to the dealer. The sad fact was that Kwan was almost magazine-beautiful anyway, except for her teeth and gums. “Thank you for showing me this,” said Kwan, and touched Mae’s arm. “Thank you,” she said to the dealer, having bought one lowly lipstick.\n Mae and the dealer glared at each other, briefly. I go somewhere else next time, Mae promised herself.\n There were flies in the ice cream shop, which was usually so frosted and clean. The old man was satisfyingly apologetic, swiping at the flies with a towel. “I am so sorry, so distressing for ladies,” he said, as sincerely as possible knowing that he was addressing farm wives from the hills. “The boys have all gone mad, they are not here to help.”\n Three old Karz grannies in layers of flower-patterned cotton thumped the linoleum floor with sticks. “It is this new madness. I tell you madness is what it is. Do they think people are incomplete? Do they think that Emel here or Fatima need to have TV all the time? In their heads?”\n “We have memories,” said another old granny, head bobbing.\n “We knew a happier world. Oh so polite!”\n Kwan murmured to Mae, “Yes. A world in which babies died overnight and the Red Guards would come and take all the harvest.”\n “What is happening, Kwan?” Mae asked, suddenly forlorn.\n “The truth?” said Kwan. “Nobody knows. Not even the big people who make this test. That is why there will be a test.” She went very calm and quiet. “No one knows,” she said again.\n The worst came last. Kwan’s ramrod husband was not a man for drinking. He was in the promised cafe at the promised time, sipping tea, having had a haircut and a professional shave. He brandished a set of extension plugs and a coil of thin silky cable rolled around a drum. He lit his cigarette lighter near one end, and the light gleamed like a star at the other.\n “Fye buh Ho buh tih kuh,” Wing explained. “Light river rope.” He shook his head in wonder.\n A young man called Sloop, a tribesman, was with him. Sloop was a telephone engineer and thus a member of the aristocracy as far as Mae was concerned. He was going to wire up their new TV. Sloop said with a woman’s voice, “The rope was cheap. Where they already have wires, they use DSL.” He might as well have been talking English for all Mae understood him.\n Wing seemed cheerful. “Come,” he said to the ladies. “I will show you what this is all about.”\n He went to the communal TV and turned it on with an expert’s flourish. Up came not a movie or the local news, but a screen full of other buttons.\n “You see? You can choose what you want. You can choose anything.” And he touched the screen.\n Up came the local Talent, still baring her perfect teeth. She piped in a high, enthusiastic voice that was meant to appeal to men and bright young things.\n “Hello. Welcome to the Airnet Information Service. For too long the world has been divided into information haves and have-nots.” She held up one hand toward the heavens of information and the other out toward the citizens of the Valley, inviting them to consider themselves as have-nots.\n “Those in the developed world can use their TVs to find any information they need at any time. They do this through the Net.”\n Incomprehension followed. There were circles and squares linked by wires in diagrams. Then they jumped up into the sky, into the air, only the air was full of arching lines. The field, they called it, but it was nothing like a field. In Karsistani, it was called the Lightning-flow, Compass-point Yearning Field. “Everywhere in the world.” Then the lightning flow was shown striking people’s heads. “There have been many medical tests to show this is safe.”\n “Hitting people with lightning?” Kwan asked in crooked amusement. “That does sound so safe.”\n “Umm,” said Wing, trying to think how best to advocate the new world. “Thought is electrical messages. In our heads. So, this thing, it works in the head like thought.”\n “That’s only the Format,” said Sloop. “Once we’re formatted, we can use Air, and Air happens in other dimensions.”\n What?\n “There are eleven dimensions,” he began, and began to see the hopelessness of it. “They were left over after the Big Bang.”\n “I know what will interest you ladies,” said her husband. And with another flourish, he touched the screen. “You’ll be able to have this in your heads, whenever you want.” Suddenly the screen was full of cream color. One of the capital’s ladies spun on her high heel. She was wearing the best of the nation’s fashion design. She was one of the ladies in Mae’s secret treasure book.\n “Oh!” breathed out Kwan. “Oh, Mae, look, isn’t she lovely!”\n “This address shows nothing but fashion,” said her husband.\n “All the time?” Kwan exclaimed and looked back at Mae in wonder. For a moment, she stared up at the screen, her own face reflected over those of the models. Then, thankfully, she became Kwan again. “Doesn’t that get boring?”\n Her husband chuckled. “You can choose something else. Anything else.”\n It was happening very quickly and Mae’s guts churned faster than her brain to certain knowledge: Kwan and her husband would be fine with all this.\n “Look,” he said. “You can even buy the dress.”\n Kwan shook her head in amazement. Then a voice said the price and Kwan gasped again. “Oh, yes, all I have to do is sell one of our four farms, and I can have a dress like that.”\n “I saw all that two years ago,” said Mae. “It is too plain for the likes of us. We want people to see everything.”\n Kwan’s face went sad. “That is because we are poor, back in the hills.” It was the common yearning, the common forlorn knowledge. Sometimes it had to cease, all the business-making, you had to draw a breath, because after all, you had known your people for as long as you had lived.\n Mae said, “None of them are as beautiful as you are, Kwan.” It was true, except for her teeth.\n “Flattery talk from a fashion expert,” said Kwan lightly. But she took Mae’s hand. Her eyes yearned up at the screen, as secret after secret was spilled like blood.\n “With all this in our heads,” said Kwan to her husband. “We won’t need your TV.”\n It was a busy week.\n It was not only the six dresses. For some reason, there was much extra business.\n On Wednesday, Mae had a discreet morning call to make on Tsang Muhammad. She liked Tsang, she was like a peach that was overripe, round and soft to the touch and very slightly wrinkled. Tsang loved to lie back and be pampered, but only did it when she had an assignation. Everything about Tsang was off-kilter. She was Chinese with a religious Karz husband, who was ten years her senior. He was a Muslim who allowed, or perhaps could not prevent, his Chinese wife from keeping a family pig.\n The family pig was in the front room being fattened. Half of the room was full of old shucks. The beast looked lordly and pleased with itself. Tsang’s four-year-old son sat tamely beside it, feeding it the greener leaves, as if the animal could not find them for itself.\n “Is it all right to talk?” Mae whispered, her eyes going sideways toward the boy.\n Tsang, all plump smiles, nodded very quickly yes.\n “Who is it?” Mae mouthed.\n Tsang simply waggled a finger.\n So it was someone they knew. Mae suspected it was Kwan’s oldest boy, Luk. Luk was sixteen but fully grown, kept in pressed white shirt and shorts like a baby, but the shorts only showed he had hair on his football-player calves. His face was still round and soft and babylike but lately had been full of a new and different confusion.\n “Tsang. Oh!” gasped Mae.\n “Ssssh,” giggled Tsang, who was red as a radish. As if either of them could be certain what the other one meant. “I need a repair job!” So it was someone younger.\n Almost certainly Kwan’s handsome son.\n “Well, they have to be taught by someone,” whispered Mae.\n Tsang simply dissolved into giggles. She could hardly stop laughing.\n “I can do nothing for you. You certainly don’t need redder cheeks,” said Mae.\n Tsang uttered a squawk of laughter.\n “There is nothing like it for a woman’s complexion.” Mae pretended to put away the tools of her trade. “No, I can affect no improvement. Certainly I cannot compete with the effects of a certain young man.”\n “Nothing . . . nothing,” gasped Tsang. “Nothing like a good prick.”\n Mae howled in mock outrage, and Tsang squealed and both squealed and pressed down their cheeks, and shushed each other. Mae noted exactly which part of the cheeks were blushing so she would know where the color should go later.\n As Mae painted, Tsang explained how she escaped her husband’s view. “I tell him that I have to get fresh garbage for the pig,” whispered Tsang. “So I go out with the empty bucket . . . .”\n “And come back with a full bucket,” said Mae airily.\n “Oh!” Tsang pretended to hit her. “You are as bad as me!”\n “What do you think I get up to in the City?” asked Mae, arched eyebrow, lying.\n Love, she realized later, walking back down the track and clutching her cloth bag of secrets, love is not mine. She thought of the boy’s naked calves.\n On Thursday, Kwan wanted her teeth to be flossed. This was new; Kwan had never been vain before. This touched Mae, because it meant her friend was getting older. Or was it because she had seen the TV models with their impossible teeth? How were real people supposed to have teeth like that?\n Kwan’s handsome son ducked as he entered, wearing his shorts, showing smooth full thighs, and a secret swelling about his groin. He ducked as he went out again. Guilty, Mae thought. For certain it is him.\n She laid Kwan’s head back over a pillow with a towel under her.\n Should she not warn her friend to keep watch on her son? Which friend should she betray? To herself, she shook her head; there was no possibility of choosing between them. She could only keep silent. “Just say if I hit a nerve,” Mae said.\n Kwan had teeth like an old horse, worn, brown, black. Her gums were scarred from a childhood disease, and her teeth felt loose as Mae rubbed the floss between them. She had a neat little bag into which she flipped each strand after it was used.\n It was Mae’s job to talk: Kwan could not. Mae said she did not know how she would finish the dresses in time. The girls’ mothers were never satisfied, each wanted her daughter to have the best. Well, the richest would have the best in the end because they bought the best cloth. Oh! Some of them had asked to pay for the fabric later! As if Mae could afford to buy cloth for six dresses without being paid!\n “They all think their fashion expert is a woman of wealth.” Mae sometimes found the whole pretense funny. Kwan’s eyes crinkled into a smile. But they were also moist from pain.\n It was hurting. “You should have told me your teeth were sore,” said Mae, and inspected the gums. In the back, they were raw.\n If you were rich, Kwan, you would have good teeth, rich people keep their teeth, and somehow keep them white, not brown. Mae pulled stray hair out of Kwan’s face.\n “I will have to pull some of them,” Mae said quietly. “Not today, but soon.”\n Kwan closed her mouth and swallowed. “I will be an old lady,” she said and managed a smile.\n “A granny with a thumping stick.”\n “Who always hides her mouth when she laughs.”\n Both of them chuckled. “And thick glasses that make your eyes look like a fish.”\n Kwan rested her hand on her friend’s arm. “Do you remember, years ago? We would all get together and make little boats, out of paper, or shells. And we would put candles in them, and send them out on the ditches.”\n “Yes!” Mae sat forward. “We don’t do that anymore.”\n “We don’t wear pillows and a cummerbund anymore either.”\n There had once been a festival of wishes every year, and the canals would be full of little glowing candles, that floated for a while and then sank with a hiss. “We would always wish for love,” said Mae, remembering.\n Next morning. Mae mentioned the candles to her neighbor Old Mrs. Tung. Mae visited her nearly every day. Mrs. Tung had been her teacher, during the flurry of what passed for Mae’s schooling. She was ninety years old, and spent her days turned toward the tiny loft window that looked out over the valley. She was blind, her eyes pale and unfocused. She could see nothing through the window. Perhaps she breathed in the smell of the fields.\n “There you are,” Mrs. Tung would smile underneath the huge spectacles that did so little to improve her vision. She remembered the candles. “And we would roast pumpkin seeds. And the ones we didn’t eat, we would turn into jewelry. Do you remember that?”\n Mrs. Tung was still beautiful, at least in Mae’s eyes. Mrs. Tung’s face had grown even more delicate in extreme old age, like the skeleton of a cat, small and fine. She gave an impression of great merriment, by continually laughing at not very much. She repeated herself.\n “I remember the day you first came to me,” she said. Before Shen’s village school, Mrs. Tung kept a nursery, there in their courtyard. “I thought: is that the girl whose father has been killed? She is so pretty. I remember you looking at all my dresses hanging on the line.”\n “And you asked me which one I liked best.”\n Mrs. Tung giggled. “Oh yes, and you said the butterflies.”\n Blindness meant that she could only see the past.\n “We had tennis courts, you know. Here in Kizuldah.”\n “Did we?” Mae pretended she had not heard that before.\n “Oh yes, oh yes. When the Chinese were here, just before the Communists came. Part of the Chinese army was here, and they built them. We all played tennis, in our school uniforms.”\n The Chinese officers had supplied the tennis rackets. The traces of the courts were broken and grassy, where Mr. Pin now ran his car repair business.\n “Oh! They were all so handsome, all the village girls were so in love.” Mrs. Tung chuckled. “I remember, I couldn’t have been more than ten years old, and one of them adopted me, because he said I looked like his daughter. He sent me a teddy bear after the war.” She chuckled and shook her head. “I was too old for teddy bears by then. But I told everyone it meant we were getting married. Oh!” Mrs. Tung shook her head at foolishness. “I wish I had married him,” she confided, feeling naughty. She always said that.\n Mrs. Tung even now had the power to make Mae feel calm and protected. Mrs. Tung had come from a family of educated people and once had a house full of books. The books had all been lost in a flood many years ago, but Mrs. Tung could still recite to Mae the poems of the Turks, the Karz, the Chinese. She had sat the child Mae on her lap, and rocked her. She could still recite now, the same poems.\n “Listen to the reed flute,” she began now, “How it tells a tale!” Her old blind face swayed with the words, the beginning of The Mathnawi. “This noise of the reed is fire, it is not the wind.”\n Mae yearned. “Oh. I wish I remembered all those poems!” When she saw Mrs. Tung, she could visit the best of her childhood.\n On Friday, Mae saw the Ozdemirs.\n The mother was called Hatijah, and her daughter was Sezen. Hatijah was a shy, flighty little thing, terrified of being overcharged by Mae, and of being under-served. Hatijah’s low, old stone house was tangy with the smells of burning charcoal, sweat, dung, and the constantly stewing tea. From behind the house came a continual, agonized lowing: the family cow, neglected, needed milking. The poor animal’s voice was going raw and harsh. Hatijah seemed not to hear it. She ushered Mae in and fluttered around her, touching the fabric.\n “This is such good fabric,” Hatijah said, too frightened of Mae to challenge her. It was not good fabric, but good fabric cost real money. Hatijah had five children, and a skinny shiftless husband who probably had worms. Half of the main room was heaped up with corn cobs. The youngest of her babes wore only shirts and sat with their dirty naked bottoms on the corn.\n Oh, this was a filthy house. Perhaps Hatijah was a bit simple. She offered Mae roasted corn. Not with your child’s wet shit on it, thought Mae, but managed to be polite. The daughter, Sezen, stomped in barefoot for her fitting. Sezen was a tough, raunchy brute of girl and kept rolling her eyes at everything: at her nervous mother, at Mae’s efforts to make the yellow and red dress hang properly, at anything either one of the adults said.\n “Does . . . will . . . on the day . . . ,” Sezen’s mother tried to begin.\n Yes, thought Mae with some bitterness, on the day Sezen will finally have to wash. Sezen’s bare feet were slashed with infected cuts.\n “What my mother means is,” Sezen said. “Will you make up my face Saturday?” Sezen blinked, her unkempt hair making her eyes itch.\n “Yes, of course,” said Mae, curtly to a younger person who was forward.\n “What, with all those other girls on the same day? For someone as lowly as us?”\n The girl’s eyes were angry. Mae pulled in a breath.\n “No one can make you feel inferior without you agreeing with them first,” said Mae. It was something Old Mrs. Tung had once told Mae when she herself was poor, hungry, and famished for magic.\n “Take off the dress,” Mae said. “I’ll have to take it back for finishing.”\n Sezen stepped out of it, right there, naked on the dirt floor. Hatijah did not chastise her, but offered Mae tea. Because she had refused the corn, Mae had to accept the tea. At least that would be boiled.\n Hatijah scuttled off to the black kettle and her daughter leaned back in full insolence, her supposedly virgin pubes plucked as bare as the baby’s bottom.\n Mae fussed with the dress, folding it, so she would have somewhere else to look. The daughter just stared. Mae could take no more. “Do you want people to see you? Go put something on!”\n “I don’t have anything else,” said Sezen.\n Her other sisters had gone shopping in the town for graduation gifts. They would have taken all the family’s good dresses.\n “You mean you have nothing else you will deign to put on.” Mae glanced at Hatijah: she really should not be having to do this woman’s work for her. “You have other clothes, old clothes. Put them on.”\n The girl stared at her in even greater insolence.\n Mae lost her temper. “I do not work for pigs. You have paid nothing so far for this dress. If you stand there like that I will leave, now, and the dress will not be yours. Wear what you like to the graduation. Come to it naked like a whore for all I care.”\n Sezen turned and slowly walked toward the side room.\n Hatijah the mother still squatted over the kettle, boiling more water to dilute the stew of leaves. She lived on tea and burnt corn that was more usually fed to cattle. Her cow’s eyes were averted. Untended, the family cow was still bellowing.\n Mae sat and blew out air from stress. This week! She looked at Hatijah’s dress. It was a patchwork assembly of her husband’s old shirts, beautifully stitched. Hatijah could sew. Mae could not. Hatijah would know that; it was one of the things that made the woman nervous. With all these changes, Mae was going to have to find something else to do beside sketch photographs of dresses. She had a sudden thought.\n “Would you be interested in working for me?” Mae asked. Hatijah looked fearful and pleased and said she would have to ask her husband.\n Everything is going to have to change, thought Mae, as if to convince herself.\n That night Mae worked nearly to dawn on the other three dresses. Her racketing sewing machine sat silent in the corner. It was fine for rough work, but not for finishing, not for graduation dresses.\n The bare electric light glared down at her like a headache, as Mae’s husband Joe snored. Above them in the loft, his brother and father snored too, as they had done for twenty years.\n Mae looked into Joe’s open mouth like a mystery. When he was sixteen Joe had been handsome, in the context of the village, wild, and clever. They’d been married a year when she first went to Yeshibozkay with him, where he worked between harvests building a house. She saw the clever city man, an acupuncturist who had money. She saw her husband bullied, made to look foolish, asked questions for which he had no answer. The acupuncturist made Joe do the work again. In Yeshibozkay, her handsome husband was a dolt.\n Here they were, both of them now middle-aged. Their son Vikram was a major in the Army. They had sent him to Balshang. He mailed them parcels of orange skins for potpourri; he sent cards and matches in picture boxes. He had met some city girl. Vik would not be back. Their daughter Lily lived on the other side of Yeshibozkay, in a bungalow with a toilet. Life pulled everything away.\n At this hour of the morning, she could hear their little river, rushing down the steep slope to the valley. Then a door slammed in the North End. Mae knew who it would be: their Muerain, Mr. Shenyalar. He would be walking across the village to the mosque. A dog started to bark at him; Mrs. Doh’s, by the bridge.\n Mae knew that Kwan would be cradled in her husband’s arms and that Kwan was beautiful because she was an Eloi tribeswoman. All the Eloi had fine features. Her husband Wing did not mind and no one now mentioned it. But Mae could see Kwan shiver now in her sleep. Kwan had dreams, visions, she had tribal blood and it made her shift at night as if she had another, tribal life.\n Mae knew that Kwan’s clean and noble athlete son would be breathing like a moist baby in his bed, cradling his younger brother.\n Without seeing them, Mae could imagine the moon and clouds over their village. The moon would be reflected shimmering on the water of the irrigation canals which had once borne their paper boats of wishes. There would be old candles, deep in the mud.\n Then, the slow, sad voice of their Muerain began to sing. Even amplified, his voice was deep and soft, like pillows that allowed the unfaithful to sleep. In the byres, the lonely cows would be stirring. The beasts would walk themselves to the town square, for a lick of salt, and then wait to be herded to pastures. In the evening, they would walk themselves home. Mae heard the first clanking of a cowbell.\n At that moment something came into the room, something she did not want to see, something dark and whole like a black dog with froth around its mouth that sat in her corner and would not go away, nameless yet.\n Mae started sewing faster.\n The dresses were finished on time, all six, each a different color.\n Mae ran barefoot in her shift to deliver them. The mothers bowed sleepily in greeting. The daughters were hopping with anxiety like water on a skillet.\n It all went well. Under banners the children stood together, including Kwan’s son Luk, Sezen, all ten children of the village, all smiles, all for a moment looking like an official poster of the future, brave, red-cheeked with perfect teeth.\n Teacher Shen read out each of their achievements. Sezen had none, except in animal husbandry, but she still collected her certificate to applause. And then Mae’s friend Shen did something special.\n He began to talk about a friend to all of the village, who had spent more time on this ceremony than anyone else, whose only aim was to bring a breath of beauty into this tiny village, the seamstress who worked only to adorn other people . . . .\n He was talking about her.\n . . . one was devoted to the daughters and mothers of rich and poor alike and who spread kindness and good will.\n The whole village was applauding her, under the white clouds, the blue sky. All were smiling at her. Someone, Kwan perhaps, gave her a push from behind and she stumbled forward.\n And her friend Shen was holding out a certificate for her.\n “In our day, Lady Chung,” he said, “there were no schools for the likes of us, not after early childhood. So. This is a graduation certificate for you. From all your friends. It is in Fashion Studies.”\n There was applause. Mae tried to speak and found only fluttering sounds came out, and she saw the faces, ranged all in smiles, friends and enemies, cousins and no kin alike.\n “This is unexpected,” she finally said, and they all chuckled. She looked at the high-school certificate, surprised by the power it had, surprised that she still cared about her lack of education. She couldn’t read it. “I do not do fashion as a student, you know.”\n They knew well enough that she did it for money and how precariously she balanced things.\n Something stirred, like the wind in the clouds.\n “After tomorrow, you may not need a fashion expert. After tomorrow, everything changes. They will give us TV in our heads, all the knowledge we want. We can talk to the President. We can pretend to order cars from Tokyo. We’ll all be experts.” She looked at her certificate, hand-lettered, so small.\n Mae found she was angry, and her voice seemed to come from her belly, an octave lower.\n “I’m sure that it is a good thing. I am sure the people who do this think they do a good thing. They worry about us, like we were children.” Her eyes were like two hearts, pumping furiously. “We don’t have time for TV or computers. We face sun, rain, wind, sickness, and each other. It is good that they want to help us.” She wanted to shake her certificate, she wished it was one of them, who had upended everything. “But how dare they? How dare they call us have-nots?”\n Originally published in The Magazine of Fantasy & Science Fiction, April 2001.\n Born in Canada, Geoff Ryman now lives in England. He made his first sale in 1976, but it was not until 1984, with the appearance of his brilliant novella \"The Unconquered Country\" that he first attracted any serious attention. \"The Unconquered Country,\" one of the best novellas of the decade, had a stunning impact on the science fiction scene of the day, and almost overnight established Ryman as one of the most accomplished writers of his generation, winning him both the British Science Fiction Award and the World Fantasy Award; it was later published in a book version, The Unconquered Country: A Life History. His novel The Child Garden: A Low Comedy won both the prestigious Arthur C. Clarke Award and the John W. Campbell Memorial Award; and his later novel Air also won the Arthur C. Clarke Award. His other novels include The Warrior Who Carried Life, the critically-acclaimed mainstream novels Was, Coming of Enkidu, The King's Last Song, Lust, and the underground cult classic 253, the \"print remix\" of an \"interactive hypertext novel\" which in its original form ran online, and which, in its print form won the Philip K. Dick Award. Four of his novellas have been collected in Unconquered Countries. His most recent books are the anthology When It Changed, the novel The Film-Makers of Mars, and the collection Paradise Tales: and Other Stories."}