{"fingerprint": "zLL1Cj+pxHY5GvKpZSv7mxM5Nig=", "sitename": "Clarkesworld Magazine", "title": "The Cedar Grid by Sara Saab", "author": "Sara Saab", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/saab_04_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Cedar Grid by Sara Saab", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4890 words, short story\nThe Cedar Grid\nJassim is giving chase and he shouldn’t be.\nBeneath the flapping robes of Jassim’s running target, a deadly corset bristling with titanium circuitry flashes into view. He catches an unmistakable mineral scent with its nose of vanilla sponge coming off the attacker—not a human odor, nowhere near the vinegar of his condemned-man’s sweat.\nSprinting footfalls judder in his knees. His panicked brain has yet to quell this bodily compulsion to pursue, to defend. Out-of-place thoughts burst to salience: his mother’s proud profile on a poster, conversations with his elder brother Majd late into the night.\n“It’s an attack! Catch them! Stop them!” Jassim shouts, frightened by his own voice, but he sees that everyone is moving away, swiftly away.\nHe shouldn’t be doing this. He shouldn’t be chasing off an attacker who’s wearing a bomb.\nDoctor, Professor, Shaikh, mender of hearts, cobbler of souls: these are the titles Jassim would choose. Martyr was never one of them, never a word he imagined huddled against his forename, his tribesname, his planetsname. In the dry-mouthed beating of this moment, other moments rising towards it like waves coaxed by a tidal force, Jassim knows hotly and darkly that Martyr will be his title.\nThat’s when he tries it on his lips: The Young Martyr Jassim Kawakby Auroron-Hexler, he of the planets, he of the stratosphere, and the taste of it is salt and tang and the burn of lye.\nMajd steps out, achy, onto streets yellow with artificial light on wet paving. The rainshower was artificial too, of course, cloud puffed out of a craft and seeded. He ups the heat inside his Skin and his mouth quirks with some ancestral nostalgia. It’s not bad, the duplicity, the made weather. It evokes hand-me-down memories of Earth.\nFlask in hand, he trundles towards the ka’ak lady’s cube, rolling his gait to shake out his lower back. She’ll fill the flask with spiced lentil soup, delicious and cheap. The tip he received from the Noni for the back massage will cover it. The Noni always tips, but Majd isn’t sure it’s worth the trouble. His fingertips smart with splinters from the frills of their carapace despite the handling gloves.\n“Hi, Auntie,” he says and seals the door of the modest cube behind him. Inside it’s bright and warm. He takes the breathing visor off.\n“Majd Kawakby, how’s your mother?” The old lady is watching an Earth serial, staticky against one of the active walls of the cube. It’s dubbed in Hexler pidgin. He’s sure she would prefer it in Arabic.\n“She’s fine, Auntie. She’s running as an independent in the Planetary Commune elections in a few months. So, busy-busy.”\nAt the talk of politics, the ka’ak lady wills the channel over to the news. The newscaster’s perfect posture alerts Majd to the bow of his own spent shoulders. He straightens up.\n“The Commune should be ashamed to put someone like your mother through that process. Like a nobody!” she admonishes him, lifting a loop of fresh ka’ak bread from the hook they’re stacked on. “The Kawakby tribe ruled across the Auroron network for two generations—”\n“—Actually, just soup today,” Majd interrupts. “And there’s nothing wrong with running as an independent. The Kawakby politicos have always believed in the democratic process.” He puts the flask on the counter.\n“Kawakby politicos,” says the old lady. “What a clever mouth on you.” She gives him a genuine smile, full of restored teeth.\n“Not as clever as my hands when it comes to unraveling knotty problems, luckily.”\nShe ladles and the smells of cumin and lemon zest make Majd’s mouth water. He watches the news. The program cuts to a home planet segment; there’s a stock photo of Baalbek in northeast Lebanon on Earth. Majd recognizes it instantly for the Roman pillars and the fact that Jassim is stationed there on Earth-exchange. It’s the Kawakby ancestral city.\n“Can you turn the volume up, Auntie?” Majd asks. “My brother’s out there.”\n“Jassim’s in Baalbek?” she asks. Sound rises from the cube.\nMajd nods, but his neck clenches rigid. He’s watching a video now, the aftermath of an explosion,\n“ . . . at least two Amoya revolutionaries participated in the coordinated attack, which is thought to have targeted a satellite office of the Planetary Comrades, the Commune’s cadet division. Four have been confirmed dead by the local ministry. Witnesses say one human victim may have died pursuing the attackers . . . ”\nA rose of worry blooms in the pit of Majd’s gut. Stop. There are 200,000 humans in Baalbek.\n“God protect the boy,” says the ka’ak lady, and Majd wishes she hadn’t.\n“One second.”\nHe wills on his Device, contacts his mother, splinter-studded fingers rapping testily on the counter.\nThe sound transitions from the soft murmur of the connecting signal to his mother’s wail—a wail so long and loud and animal that something breaks in Majd then, maybe his bones, maybe his ligaments, because he turns to jelly and drops to his knees in the cube.\nThe keening words are worse to hear than the wail: “They killed him. They killed my son.”\n“No,” says Majd. “No.”\nBecause how could the truth hurt more than being speared in the chest? How could words bash into his brain, concussive?\nAnd Jassim’s face, why can’t he call to mind Jassim’s face? Instead, Majd remembers the face of the sweet-smelling Amoya he massaged that morning, their forced propriety, their awkward politeness.\nHe is on his back, the ceiling of the cube a blurry geometry. He convinces himself to breathe the way he’s always breathed, the way his brother no longer will.\n“Mama,” Majd says when Raneem steps off the planet-hopper, and impulsively reaches for her. Her Skin darkens as she heats it against the cold of Auroron-Hexler’s seeded wet season. The wind off the hopper’s engines lifts her hair, fanning it out. It is as glossy as he remembers, and smells as clean, but Raneem has dyed it in mourning. It is the white of the chalk mines on Auroron-Pallazk.\nFinally Raneem pulls away. There are no platitudes she can offer him, he knows, but it hurts a little that she doesn’t try. Her eyes are bruised-looking above the cliff of her breathing visor.\n“A security aide from Earth called this morning. Said there won’t be enough recovered of his body to warrant shipping the remains to Hexler.” She chokes on the word ‘body’, and Majd feels acid well in his tear ducts again.\nIt isn’t right. Bodies are something you wear, something you knead, give pleasure to, maintain. How could a body be what remained of his brother? Not even that.\n“Mama. I—” Majd takes a huge, shuddering breath. “I’ve hired a Physical on Earth.”\n“What the hell for, Majd?” Raneem snaps.\n“I need to see for myself. Where it happened.” And how. And why. “There’s a big fleet of multisensory bots at Baalbek, high-quality ones. For all the distance tourists.”\n“And the risk of a PDE? You want me to lose another son?” The betrayal in her voice is a vice.\n“It’s a small risk. Jassim would have done it for me.”\nRaneem shakes her head. “Your brother has never been a thrill-seeker.”\nMajd is doubly wounded. It isn’t thrills he’s after. And Jassim and Jassim’s big dreams—no matter how many verbs his mother uses to tug him into the present—Jassim is gone.\n“Mama, I thought, I hired—” Majd feels his teeth begin to chatter from cold or nerves, raises the heat in his own Skin, “I actually hired two Physicals. I thought you might want to come, too.”\nHis mother walks straight past him in the direction of the terminal building. Her form is sleek and dark in the suit, capped with the glacier of her hair. Her step, as ever, is sure and practiced.\nIt’s six AM, Auroron-Hexler still in darkness, two hours till star rise. Majd comes to himself in fetal position in his own bed. He’s covered in a thin sweat, blankets kicked to the floor. His hearing undulates. The bedroom smells like cheap joss sticks and Mint. Majd fights the urge to sneeze, his eyes scrunched painfully tight. If he sneezes he’s sure he will vomit.\n“What did—?” He over-articulates the words, any words, to reassure himself that he’s human, and alive.\nMint. Mint.\nMajd swings around to survey the bed behind him. It’s empty; the only impression that of his own damp body. His stomach lurches at the movement.\nThe last drug trip he’d had on a dissociator like Mint he picked up a Kawakby groupie, blessedly human, and brought her home. He’s since sworn off self-pity fucks, is extra-extra prudent while Raneem is running for office and all manner of eyes—compound, binary, olfactospatial, whatever—are on his tribe.\nIn scraps, memories of the night float to him. He’d dissociated to a mental construct of the Earth his great-great-grandparents knew. Common to Mint highs, Majd remembers the smells best: the antique fog of synthetic diesel, the fatty miasma of trapezoids of shawarma on the spit, the reaching scent of the soil, pervasive and dirty and burdened. Hexler’s soil, by contrast, is an inorganic-seeming silicate.\nAnd there were cedar trees in his dreams, row after row of them, precious emblems of the Lebanese Republic, extinct in the wild then reintroduced a hundred years later from hardy saplings engineered off-planet and brought back to Earth. This variety had lasted longer before succumbing; two generations, three. Majd’s grandmother has image archives of a cedar-lined Baalbek of the twenty-second century. A tree at every street corner, a meticulous grid. Majd can view the images at the end of a thought should he will it.\nStill—home planet feels impossibly distant, farther than all the light-years between Earth and Hexler.\nMajd switches his Device on. He’s got clients to see, but not for a few hours. He rises to groom, stumbles on the swirl of blankets, feels ill again for a cresting instant.\nUnder crossbursts of warm antimicrobial cleanser, he flips through his diary again.\nNoon, Thati. They’ve been working on the niggling pinched nerve in her shoulder.\nTwo o’clock, Raptaph. This time with doubled-up handling gloves.\nFour, Amalyy Amotupannak Amalyy, old back injury. The Amoya. Again.\nMajd’s annoyed, then suddenly hit by a grief so cruel he gapes in the flow of antimicrobial, feels it dribble into his eyes and past his lips. His brother is dead.\nHarsh, to forget that, and have to remember.\n“Cancel,” he breathes, spitting fluid. “Cancel four o’clock.”\nHis Device speaks back economically, in the voice of his inner thoughts. Sending cancellation to Amalyy Amotupannak Amalyy.\nMajd counts his breaths. Cleanser fizzes gently against the clear snot on his hands.\nMessage from Amalyy Amotupannak Amalyy: Please do not cancel today. I am in pain. Let me pay you double to honor the slot.\nOne Kawakby blown apart in the street. Another Kawakby letting pocket money decide his course.\n“Don’t cancel. Rebook four o’clock.” His words echo in the shower. On the second word, his Device nudges a silent acknowledgement against his mind.\nHexler is a small rock by home planet standards—it boasts one big, cosmopolitan city, self-named, and a couple of functional outpostings, research camps or relay towns. Majd has lived in Hexler City all his life, although he was born off-planet on Auroron-Pallazk while his mother held a post in the Planetary Commune. Today he navigates the streets with less ease than usual, avoiding silty puddles contracting like irises under the hot daylight of their star.\nHe heads for unfamiliar Phoros Lane, where his Physical booking is waiting.\nThe rentals cube meets the strict hygiene and upkeep standards, but it all feels forced, dust encroaching from the seams of the place. Rows of bodyfoam seats are arranged by species, poised to mold to variations in individuals’ shapes and sizes. Gunmetal scaffolding around each seat holds straps of tubing arrayed by color—nutrition, hydration, waste, anti-inflammatories, and sedatives. For proprioception, electrodes; for sound, bone conduction headphones tailored to various skulls. And just before it begins, there’ll be a little hit of Mint to make the taste buds and nose suggestible.\nThe human clerk finds his booking and sends it to Majd’s Device for review. “You’re just using one of the two today?”\n“Just one today.” My mother wouldn’t come. My mother won’t bear witness.\nThe actual headsets are too expensive to leave out. The clerk digs one out from behind the counter, cradles it with both arms onto the desk.\n“Your Physical’s proxy body is ready to go. It’s a model fifty-five full articulation bot and is set to start in front of the Roman ruins in . . . ” the clerk reads out, “Baalbek, Lebanon, Earth. 34.0069° N, 36.2039° E. Is that right?”\n“Yes,” says Majd.\nHe rattles on through his list. “It’s extra for the non-depot starting location. Are you happy for us to invoice your Device?”\n“Go ahead.”\n“And confirm you’re aware, sir, of the dangers of a Physical Dissociative Event, which can lead to temporary or permanent impairment or death. You waive Phoros Physicals of liability if you acknowledge this with your Device recording.”\n“Understood,” says Majd.\nMinutes later, he is in the Physical, intubated, cocooned, gently tripping on Mint, but he is also light-years away, his arms suggesting themselves over articulated robot arms, his eyes looking out in high-definition, the road beneath his feet sun-warmed and pocked.\nHe looks up and sees Baalbek’s Roman ruins. The thought of Jassim passing the ruins daily is sharp and definite.\nMajd can only stand it for a few minutes. When he comes back to Hexler, he is shaking with emotions he cannot name.\nThe next day, at the Amoya’s third massage appointment inside a week, Majd finds himself unable hold his tongue.\n“You know, it’s rare that I get Amoya clients.” He’s got Amalyy front-down, is pressing thumbs into the soft muscle between their backplates. It’s ticklish, the little hook-hairs scrabbling against the tender meat of his palms. Majd breathes all the way out, stops his inhalations short. The smell, heavy and sensual like cake and stalagmites, will take a day to fully dissipate. He’ll catch it on his skin tonight when he undresses.\n“We have not learned the joys of massage,” Amalyy says in Hexler pidgin.\n“Mm.” The relaxation music in the background repeats a lilting refrain. Majd thinks about kicking the wall speaker in. “Is that allowed for you people? To strive for joy? What about sacrifice? Self-actualization through warfare?”\nThe Amoya’s back spiracles shrink shut, a defensive reflex. They slowly twist onto their back, lower amazingly human-like legs to the floor. Their footpads palpate the ground. “Is there a problem today, Majd Kawakby Auroron-Hexler?”\nMajd raises useless fingers to a blaring headache. His face has stiffened with stoicism these last two weeks. “There’s no problem, Amalyy. Lie back. I apologize.”\n“Not all of us are born to carry weapons. And not all humans are targets for our fight.”\nMajd wishes the Amoya had faces he could read, something in the twitch of a cheek or the slant of an eye that he might latch onto. Instead, two primary eyes like wet lead blink at him; two secondary eyes, rusted copper rivets, track the most indiscernible of his movements. The shoulders, though, the torso, the chest—like the legs, these are almost too human.\nWhy did you do it? he wants to ask the Amoya. That was my baby brother.\n“Have I dishonored myself?” Amalyy asks.\nMajd chuckles, hears an awful keening escape his throat. “No. Lie back. Please.”\nThe Amoya does not. They reach forward, touch Majd’s forearm with their pronged, plated hand, a gentle suction in the pads. They tug softly on his forearm, an Amoya gesture of camaraderie.\n“If another Amoya were to see you do that . . . ” Majd says, aghast.\n“There are many things I would do, Majd Kawakby Auroron-Hexler.” They let go. “Many things that are forbidden, but not wrong.”\nMajd is in the Physical for the second time. It’s near midnight in Baalbek. Apart from the proxy body’s occasional lag, it’s almost as good as being there. Transport carriages dot the sky, oblong, lit to glistening between their wires, liquid in a straw.\nMajd crosses a street. In his great-great-grandparents’ time there would have been a cedar at every corner. Now there are marble urns on elaborate stands. Each bulbous urn carries a dedication from an off-planet benefactor, a famous daughter or son of Baalbek. The urns line up along the city grid then fan out into the distance as Majd moves past. The recreated scent of cedar wood pours from vents in the marble.\nMajd stops between lanes to survey his surroundings; traffic splices around his bot with the neat dexterousness of machine intelligence, but car horns low deeply with the passengers’ irritation. He spots the famous Temple of Bacchus, four thousand years young, shimmering, upright, gilded by holograms that mend its cracks, plump its facade.\nMajd uses the Physical’s local Device to pull up the set of coordinates and wills the proxy body into navigation mode.\nThe spot’s not far away.\nJassim would have seen the ruins one last time, depending on which way he was facing—they might have towered in the distance like a symbol emptied of meaning, or stood to his right, casting a long shadow like a rescue line. Majd feels a gong of sorrow.\nThe Physical is incapable of sprinting, though Majd wants it, wants to replay the chase, craves every one of his brother’s last sensations.\nThe Physical is also incapable of transmitting bodily pain, but Majd feels it anyway, though not through the electrodes, not the Mint, not the bodyfoam: the impossible pain of being ripped bodily to shreds. It annihilates him, this abrupt conclusion to a life. It leaves nothing intact except a hard pit in the middle of his heart.\nHe’s back in Hexler, heading home from Phoros Physicals, when Raneem contacts him.\n“Majd. I have an Auroron-wide prospective leaders’ debate tonight,” she says. No hello. No how are you.\n“On Hexler?” he asks. He hasn’t seen her since that night at the terminal.\n“Right,” Raneem says. “Listen—your father and sister are out-system and I need a family member there.”\nShe doesn’t have to say the rest: that all the political players—not only the humans but the Noni, the Amoya, the minority Ka’tanni—expect displays of generational strength, showcases of the fecundity and prosperity of a prospect’s tribesname.\n“You know I don’t do politics.”\n“Habibi, none of us ‘do’ politics for the sake of it. Is that what you think?”\n“Mama.”\n“Majd. I don’t have a choice. Jassim was my . . . ” her voice goes. “Jassim used to be . . . ”\n“Mama,” Majd says again. Guilt presses on him, a knuckle into a knot. He’s starving, feeling the aftereffects of the Physical—that his eyeballs are a foot in front of his face, that his legs won’t move along the correct vector to propel him forward. He saws around unsteadily in the street, lowers the temperature in his Skin.\n“My son. It’s for your brother we do this. It’s for the dead. It’s to fix the calamities of Auroron. For everybody’s salvation. My God.”\nMajd relents. A sloppy Mint comedown nap is his one private act of rebellion. When he wakes he shaves his head and beard to stubble, pulls on a species-neutral ceremonial gown, masks his scent with something respectful to all Auroron’s noses.\nAt the prospective leaders’ debate, he tails his mother’s Ka’tanni campaign partner, Pbaa, at a noncommittal distance.\nOnly when cornered by politicians or journalists does he recite the Kawakby tribe’s promises: an Amoya home state on Hexler, respiration-safe dwellings for people of all species, economic regeneration for outpost towns, a species-integrated government.\nNo, my mother has not broken with the Planetary Commune—both parties benefit from aligned objectives. However, the affiliation is no longer financial.\nYes, it’s true that my younger brother was killed serving with the Planetary Comrades on Earth. Thank you for your condolences. Yes, his final act was brave and honorable. Thank you.\nThere are questions that dig like burrs into the details of Majd’s own life. A Noni journalist stammers with excitement, breath buzzing, as they relate that the Amoya frontrunner has alleged that Raneem Kawakby’s surviving son is a degenerate and a wastrel.\nMy mother will not be discredited by unfounded personal attacks.\nPbaa wants to know why Majd has never made an appearance at a political event before.\n“You are a well-made son.”\n“Thank you,” Majd says.\n“Even if you are not as well-groomed in morality as Jassim was,” Pbaa adds.\nMajd nods, excuses himself to take a seat.\nRaneem’s opening speech is fiery and articulate. The incumbent Noni leader fires back, accusing her of human-centrism and of siphoning money to Kawakby interests on Earth. Majd stops listening eventually, nods blankly at Pbaa’s hushed commentary, poses for photographs with his mother at the end. The smile feels horrible on his face.\nIt’s Fifthday, the busiest day, and when the Amoya returns, Majd is expecting them.\nHe’s courteous. He offers sap tea. He selects a reel of Amoya music, orchestral and melancholic. Raneem was wrong: the world is too delicate a political jumble considered from the above. Everything’s sturdier, more fixable, from the ground up.\n“Your problem has passed today, Majd Kawakby Auroron-Hexler,” says the Amoya.\n“My forename is good enough among acquaintances.”\nAmalyy purrs beneath his massaging hands. Majd knows from Species Integration lectures at the Collegiate that the shivering membrane beneath their skin is for generating body heat or expressing pleasure. The purring raises goosebumps on his own arms, reflexes in communion.\n“My problem is passing too,” Amalyy adds. “Now the pain is not so bad. Next week I will not need to come here.”\n“But you should come,” says Majd. “For more tea.”\nWhen a famous Amoya revolutionary song comes on, Majd whispers, “Why don’t you fight us, like the others? Don’t you care about freedom? Don’t you want Auroron back?”\nAmalyy considers, facedown. Their backplates accordion with breath. “I heard about your brother’s martyrdom,” their voice is muffled by the massage bench. “I am happy for the release of his soul.”\nThey’re words of condolence. Majd stops kneading.\n“My brother is not a martyr.”\n“He died for his cause.”\n“He died for nothing. Jassim was fifteen.”\nAmalyy turns onto their back. The soft humanness of their front strikes Majd again, the scoop of the abdomen, the smooth cinnamon flesh like human skin.\n“I am not a fighter, but I believe in our fight. These planets are ours. Majd.”\nMajd puts his hands at his sides, but the skin-scent still fogs his thinking. “You kill human civilians on Hexler. Throughout the system. On Earth—”\n“We all die. Dying a martyr is better.”\n“You’re wrong,” Majd says. “Not if you don’t want to die a martyr. Not if you’re fifteen. If you’re just doing what’s asked of you by your family.”\n“We all die,” says the Amoya.\nThe Temple of Bacchus. Giving chase. Uncertain. Torn apart. “Not like that.”\nThe expression is not human, but Majd thinks he sees something like a smile in the lift of Amalyy’s face-flanks. “But death is death.”\nMajd steals a glance down the alien body on his massage bench. The Amoya only don clothing for warfare and ceremonies.\nAmalyy sees him look, registers every flitting saccade of his eyes. Their face lifts higher.\nMajd remembers this from the Collegiate too: that the Amoya don’t have external sex organs, reproduce asexually, but engage in elaborate coupling rituals to promote social bonding.\n“And life is life,” they say. “And there are no dictates but freedom.”\nMajd returns to Phoros Physicals. He can’t stay away.\nThis time it’s a dry weekend in Baalbek. Human and non-human tourists grip charred corncobs and cones of roasted chickpeas and seethe over the quietude of the ruins. Majd exits the cadet office of the Planetary Commune, passes the tiny memorial to his brother beside the fountain in the courtyard. He leaves behind the bright-smelling jasmine chain he bought from a hawker, draping it over Jassim’s nameplate.\nThe path to the Baalbek burial grounds throws up dust under his proxy body’s feet. On Hexler or on Earth or nowhere at all, Majd licks over chapped lips.\nHe’s been in the Physical a while, because he can’t remember what the interior of the Phoros cube looks like. He does remember Jassim quite clearly now: massive eyes shaped like unshelled almonds, white teeth, close-cropped hair and the scar on his crown from when a malfunctioning drone clipped him with a propeller. But Jassim’s eyes are wrong, molten, and another set of eyes—Amoya eyes—are brass buckshot pellets in his brow.\nMajd sits beside the fresh earth of his brother’s grave. He recites ancestral poetry under his breath, words he’s never uttered outside of the Collegiate. They are verses about freedom, the yearning of all the oppressed people of his land. The slaves who raised the Temple of Bacchus. The shipbuilders who built Muawiyah’s navy. Muslims under the Crusaders, Maronites under the Mamluks, Levantines under the Ottomans, then generation after generation oppressed by war and strife and sent fleeing by the threat of planetary collapse. Spacefaring humanity subjugated first by the Noni, then the Amoya.\nHe imagines that every verse is about the Kawakby tribe, crushed beneath the heel of grief.\nAnd he recites for Amalyy, for the eventual annexation of the Amoya home planets.\nHe goes through each verse tens of times, hundreds of times. When he is done, at the fresh grave of his little brother, Majd Kawakby Auroron-Hexler cannot recall how he arrived at this moment. Cannot recall how to move on to the next moment, how to keep going.\nSo he does what’s easiest. He lies back flat and goes to sleep.\nThe universe is an emptiness that balloons around the irritation of life just the way a pearl envelops a grain of sand.\nMajd wakes up to his mother’s face shrouded in white.\nHe thinks a moment later that he is not supposed to be here.\n“Habibi, are you awake?” she asks. She has not spoken so tenderly to him in years, and this is how he is sure that he has nearly died.\n“Was it a PDE?” he asks. His voice doesn’t sound like it’s emerging from his own skull.\nRaneem nods. “You wouldn’t come back when they tried to disconnect you.”\n“How many days has it been?”\n“Four.” Raneem puts a hand on his arm. It’s warm, or his own skin is ice cold.\nIt’s another three days before Majd’s sensations are moored enough to his skeleton that he can stand and pace the hospital cube. When he does, a Noni nurse brings him his belongings and his Device.\n“You can go home tomorrow, Mr. Kawakby. Your Device creds have been broadcast to the Physicals on Auroron-Hexler—I’m sorry, but that’s the last time you’ll be able to use one.”\n“So if I want to go to Earth again, I’d better pack?”\nThe nurse’s breathing sounds like cog teeth snapping an elastic band. “I’m afraid the doctors are worried about a relapse of your dissociative event if you visit a supra-c location. Stasis pods are a lot like Physicals.”\nThis takes a moment to mean anything. “No Earth?”\n“No, sir. Anywhere in marvelous Auroron is fine.”\nIt feels like the syringing of a dense and heavy ichor from the depths of his gut, some ballast that had held him inside himself.\n“Earth is my home.”\nThe nurse is gathering up his used gowns. “I thought the Kawakby children were born in Auroron?” they ask in Hexler pidgin.\n“That’s not what ‘home’ means in our language,” says Majd.\nHe wills a connection to his mother’s Device, leaves a note. There’s still a Physical available. Paid for. You should go. For Jassim.\nThen he contacts Amalyy and asks them over. There’s the thing they have been dancing towards.\nMajd considers taking two doses of Mint, decides against it. He doesn’t want to protect his thoughts from their transgressions, not really. In Auroron, political congress is a fragile and new thing, sexual congress well outside the bounds of coexistence even to the most liberal of policymakers.\nRaneem is not a liberal policymaker. Raneem would withdraw his tribesname. The world is too delicate a jumble considered from above.\nJassim, he thinks, would have grown up to understand.\nAmalyy, too, understands. The two of them might stay combatants—enemies—in some sense, but not in all senses. That is the important part.\n“He’d have been a doctor or a scholar,” says Majd, fingers tracing the hook-hairs between Amalyy’s backplates. “Or, to be honest, a politician. Fast wit. Politician’s voice—this loud honeyed voice. And a whip of a tongue. Even an Amoya would have fallen for him.”\n“He was many things, this young Jassim Kawakby Auroron-Hexler,” says Amalyy. Majd winces at his brother’s full name.\nAmalyy pitches their body closer on Majd’s bed, their purring a gentle vibration against Majd’s ribs. “Perhaps too much life in him to call him a martyr. As you said.”\n“More life in him than in me,” Majd says, shifting away.\n“Life is life, Unraveler,” Amalyy says, and shifts closer, and pulls Majd near, and holds him. “Death is death, and life is life.”\nFor A. and M., who might’ve chosen other titles.\nSara Saab was born in Beirut, Lebanon. She now lives in North London, where she has perfected her Resting London Face. Her current interests are croissants and emojis thereof, amassing poetry collections, and coming up with a plausible reason to live on a sleeper train. Sara's a 2015 graduate of the Clarion Writers' Workshop. You can find more of her on Twitter as @fortnightlysara."}