{"fingerprint": "0kbIEc5dcxrX5ZjQzA9rVlhV+7Q=", "sitename": "Clarkesworld Magazine", "title": "Honey Bear by Sofia Samatar", "author": "Sofia Samatar", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/samatar_08_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Honey Bear by Sofia Samatar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4060 words, short story\n Honey Bear\n We’ve decided to take a trip, to see the ocean. I want Honey to see it while she’s still a child. That way, it’ll be magical. I tell her about it in the car: how big it is, and green, like a sky you can wade in.\n “Even you?” she asks.\n “Even me.”\n I duck my head to her hair. She smells fresh, but not sweet at all, like parsley or tea. She’s wearing a little white dress. It’s almost too short. She pushes her bare toes against the seat in front of her, knuckling it like a cat.\n “Can you not do that, Hon?” says Dave.\n “Sorry, Dad.”\n She says “Dad” now. She used to say “Da-Da.”\n Dave grips the wheel. I can see the tension in his shoulders. Threads of gray wink softly in his dark curls. He still wears his hair long, covering his ears, and I think he’s secretly a little bit vain about it. A little bit proud of still having all his hair. I think there’s something in this, something valuable, something he could use to get back. You don’t cling to personal vanities if you’ve given up all hope of a normal life. At least, I don’t think you do.\n “Shit,” he says.\n “Sweetheart . . . ”\n He doesn’t apologize for swearing in front of Honey. The highway’s blocked by a clearance area, gloved hands waving us around. He turns the car so sharply the bags in the passenger seat beside him almost fall off the cooler. In the back seat, I lean into Honey Bear.\n “It’s okay,” I tell Dave.\n “No, Karen, it is not okay. The temp in the cooler is going to last until exactly four o’clock. At four o’clock, we need a fridge, which means we need a hotel. If we are five minutes late, it is not going to be okay.”\n “It looks like a pretty short detour.”\n “It is impossible for you to see how long it is.”\n “I’m just thinking, it doesn’t look like they’ve got that much to clear.”\n “Fine, you can think that. Think what you want. But don’t tell me the detour’s not long, or give me any other information you don’t actually have, okay?”\n He’s driving faster. I rest my cheek on the top of Honey’s head. The clearance area rolls by outside the window. Cranes, loading trucks, figures in orange jumpsuits. Some of the slick has dried: they’re peeling it up in transparent sheets, like plate glass.\n Honey presses a fingertip to the window. “Poo-poo,” she says softly.\n I tell her about the time I spent a weekend at the beach. My best friend got so sunburned, her back blistered.\n We play the clapping game, “A Sailor Went to Sea-Sea-Sea.” It’s our favorite.\n Dave drives too fast, but we don’t get stopped, and we reach the hotel in time. I take my meds, and we put the extra in the hotel fridge. Dave’s shirt is dark with sweat, and I wish he’d relax, but he goes straight out to buy ice, and stores it in the freezer so we can fill the cooler tomorrow. Then he takes a shower and lies on the bed and watches the news. I sit on the floor with Honey, looking at books. I read to her every evening before bed; I’ve never missed a night. Right now, we’re reading The Meadow Fairies by Dorothy Elizabeth Clark.\n This is something I’ve looked forward to my whole adult life: reading the books I loved as a child with a child of my own. Honey adores The Meadow Fairies. She snuggles up to me and traces the pretty winged children with her finger. Daffodil, poppy, pink. When I first brought the book home, and Dave saw us reading it, he asked what the point was, since Honey would never see those flowers. I laughed because I’d never seen them either. “It’s about fairies,” I told him, “not botany.” I don’t think I’ve ever seen a poppy in my life.\n Smiling, though half-asleep,The Poppy Fairy passes,Scarlet, like the sunrise,Among the meadow grasses.\n Honey chants the words with me. She’s so smart, she learns so fast. She can pick up anything that rhymes in minutes. Her hair glints in the lamplight. There’s the mysterious, slightly abrasive smell of hotel sheets, a particular hotel darkness between the blinds.\n “I love this place,” says Honey. “Can we stay here?”\n “It’s an adventure,” I tell her. “Just wait till tomorrow.”\n On the news, helicopters hover over the sea. It’s far away, the Pacific. There’s been a huge dump there, over thirty square miles of slick. The effects on marine life are not yet known.\n “Will it be fairyland?” Honey asks suddenly.\n “What, sweetie?”\n “Will it be fairyland, when I’m grown up?”\n “Yes,” I tell her. My firmest tone.\n “Will you be there?”\n No hesitation. “Yes.”\n The camera zooms in on the slick-white sea.\n By the time I’ve given Honey Bear a drink and put her to bed, Dave’s eyes are closed. I turn off the TV and the lights and get into bed. Like Honey, I love the hotel. I love the hard, tight sheets and the unfamiliar shapes that emerge around me once I’ve gotten used to the dark. It’s been ages since I slept away from home. The last time was long before Honey. Dave and I visited some college friends in Oregon. They couldn’t believe we’d driven all that way. We posed in their driveway, leaning on the car and making the victory sign.\n I want the Dave from that photo. That deep suntan, that wide grin.\n Maybe he’ll come back to me here, away from home and our neighbors, the Simkos. He spends far too much time at their place.\n For a moment, I think he’s back already.\n Then he starts shaking. He does it every night. He’s crying in his sleep.\n “Ready for the beach?”\n “Yes!”\n We drive through town to a parking lot dusted with sand. When I step out of the car the warm sea air rolls over me in waves. There’s something lively in it, something electric.\n Honey jumps up and down. “Is that it? Is that it?”\n “You got it, Honey Bear.”\n The beach is deserted. Far to the left, an empty boardwalk whitens in the sun. I kick off my sandals and scoop them up in my hand. The gray sand sticks to my feet. We lumber down to a spot a few yards from some boulders, lugging bags and towels.\n “Can I take my shoes off too? Can I go in the ocean?”\n “Sure, but let me take your dress off.”\n I pull it off over her head, and her lithe, golden body slips free. She’s so beautiful, my Bear. I call her Honey because she’s my sweetheart, my little love, and I call her Bear for the wildness I dream she will keep always. Honey suits her now, but when she’s older she might want us to call her Bear. I would’ve loved to be named Bear when I was in high school.\n “Don’t go too deep,” I tell her, “just up to your tummy, okay?”\n “Okay,” she says, and streaks off, kicking up sand behind her.\n Dave has laid out the towels. He’s weighted the corners with shoes and the cooler so they won’t blow away. He’s set up the two folding chairs and the umbrella. Now, with nothing to organize or prepare, he’s sitting on a chair with his bare feet resting on a towel. He looks lost.\n “Not going in?” I ask.\n I think for a moment he’s going to ignore me, but then he makes an effort. “Not right away,” he says.\n I slip off my shorts and my halter top and sit in the chair beside him in my suit. Down in the water, Honey jumps up and down and shrieks.\n “Look at that.”\n “Yeah,” he says.\n “She loves it.”\n “Yeah.”\n “I’m so glad we brought her. Thank you.” I reach out and give his wrist a squeeze.\n “Look at that fucked-up clown on the boardwalk,” he says. “It looks like it used to be part of an arcade entrance or something. Probably been there for fifty years.”\n The clown towers over the boardwalk. It’s almost white, but you can see traces of red on the nose and lips, traces of blue on the hair.\n “Looks pretty old,” I agree.\n “Black rocks, filthy gray sand, and a fucked-up arcade clown. That’s what we’ve got. That’s the beach.”\n It comes out before I can stop it: “Okay, Mr. Simko.”\n Dave looks at me.\n “I’m sorry,” I say.\n He looks at his watch. “I don’t want to stay here for more than an hour. I want us to take a break, go back to the hotel and rest for a bit. Then we’ll have lunch, and you can take your medication.”\n “I said I’m sorry.”\n “You know what?” He looks gray, worn out, beaten down, like something left out in the rain. His eyes wince away from the light. I can’t stand it, I can’t stand it if he never comes back. “I think,” he tells me, “that Mr. Simko is a pretty fucking sensible guy.”\n I lean back in the chair, watching Honey Bear in the water. I hate the Simkos. Mr. Simko’s bent over and never takes off his bathrobe. He sits on his porch drinking highballs all day, and he gets Dave to go over there and drink too. I can hear them when I’ve got the kitchen window open. Mr. Simko says things like “Après nous le déluge” and “Keep your powder dry and your pecker wet.” He tells Dave he wishes he and Mrs. Simko didn’t have Mandy. I’ve heard him say that. “I wish we’d never gone in for it. Broke Linda’s heart.” Who does he think brings him the whiskey to make his highballs?\n Mrs. Simko never comes out of the house except when Mandy comes home. Then she appears on the porch, banging the door behind her. She’s bent over like her husband and wears a flowered housedress. Her hair is black fluff, with thin patches here and there, as if she’s burned it. “Mandy, Mandy,” she croons, while Mandy puts the stuff down on the porch: liquor, chocolate, clothes, all the luxury goods you can’t get at the Center. Stuff you can only get from a child who’s left home. Mandy never looks at her mother. She hasn’t let either of the Simkos touch her since she moved out.\n “I’m going down in the water with Honey,” I say, but Dave grabs my arm.\n “Wait. Look.”\n I turn my head, and there are Fair Folk on the rocks. Six of them, huge and dazzling. Some crouch on the boulders; others swing over the sea on their flexible wings, dipping their toes in the water.\n “Honey!” Dave shouts. “Honey! Come here!”\n “C’mon, Hon,” I call, reassuring.\n Honey splashes toward us, glittering in the sun.\n “Come here!” barks Dave.\n “She’s coming,” I tell him.\n He clutches the arms of his chair. I know he’s afraid because of the clearance area we passed on the highway, the slick.\n “Come here,” he repeats as Honey runs up panting. He glances at the Fair Folk. They’re looking at us now, lazy and curious.\n I get up and dry Honey off with a towel. “What?” she says.\n “Just come over here,” says Dave, holding out his arms. “Come and sit with Daddy.”\n Honey walks over and curls up in his lap. I sit in the chair next to them and Dave puts his hand on my shoulder. He’s got us. He’s holding everyone.\n Two of the Fair Folk lift and ripple toward us through the light. There seems to be more light wherever they go. They’re fifteen, twenty feet tall, so tall they look slender, attenuated, almost insect-like. You forget how strong they are.\n They bend and dip in the air: so close I can see the reds of their eyes.\n “It’s okay,” Dave whispers.\n And it is, of course. We’ve got each other. We’re safe.\n They gaze at us for a moment, impassive, then turn and glide back to their comrades.\n Honey waves at them with both hands. “Bye, fairies!”\n On my first visit to the clinic, I went through all the usual drills, the same stuff I go in for every two weeks. Step here, pee here, spit here, breathe in, breathe out, give me your arm. The only difference the first time was the questions.\n Are you aware of the gravity of the commitment? I said yes. Have you been informed of the risks, both physical and psychological? Yes. The side effects of the medication? Blood transfusions? Yes. Yes. The decrease in life expectancy? Everything: yes.\n That’s what you say to life. Yes.\n “They chose us,” I told Dave. Rain lashed the darkened windows. I cradled tiny Honey in my lap. I’d dried her off and wrapped her in a towel, and she was quiet now, exhausted. I’d already named her in my head.\n “We can’t go back,” Dave whispered. “If we say yes, we can’t go back.”\n “I know.”\n His eyes were wet. “We could run out and put her on somebody else’s porch.”\n He looked ashamed after he’d said it, the way he’d looked when I’d asked him not to introduce me as “my wife, Karen, the children’s literature major.” When we first moved into the neighborhood he’d introduce me that way and then laugh, as if there was nothing more ridiculous in the world. Children, when almost nobody could have them anymore; literature when all the schools were closed. I told him it bothered me, and he was sorry, but only for hurting me. He wasn’t sorry for what he really meant. What he meant was: No.\n That’s wrong. It’s like the Simkos, hateful and worn out with saying No to Mandy, saying No to life.\n So many people say no from the beginning. They make it a virtue: “I can’t be bought.” As if it were all a matter of protection and fancy goods. Of course, most of those who say yes pretend to be heroes: saving the world, if only for a season. That’s always struck me as equally wrong, in its own way. Cheap.\n I can’t help thinking the absence of children has something to do with this withering of the spirit—this pale new way of seeing the world. Children knew better. You always say yes. If you don’t, there’s no adventure, and you grow old in your ignorance, bitter, bereft of magic. You say yes to what comes, because you belong to the future, whatever it is, and you’re sure as hell not going to be left behind in the past. Do you hear the fairies sing? You always get up and open the door. You always answer. You always let them in.\n The Fair Folk are gone. I’m in the ocean with Honey. I bounce her on my knee. She’s so light in the water: soap bubble, floating seed. She clings to my neck and squeals. I think she’ll remember this, this morning at the beach, and the memory will be almost exactly like my own memory of childhood. The water, the sun. Even the cooler, the crumpled maps in the car. So many things now are the way they were when I was small. Simpler, in lots of ways. The things that have disappeared—air travel, wireless communication—seem dreamlike, ludicrous, almost not worth thinking about.\n I toss Honey up in the air and catch her, getting a mouthful of saltwater in the process. I shoot the water onto her shoulder. “Mama!” she yells. She bends her head to the water and burbles, trying to copy me, but I lift her up again. I don’t want her to choke.\n “My Bear, my Bear,” I murmur against the damp, wet side of her head. “My Honey Bear.”\n Dave is waving us in. He’s pointing at his watch.\n I don’t know if it’s the excitement, or maybe something about the salt water, but as soon as I get Honey up on the beach, she voids.\n “Christ,” says Dave. “Oh, Christ.”\n He pulls me away from her. In seconds he’s kneeling on our towels, whipping the gloves and aprons out of the bag. He gets his on fast; I fumble with mine. He rips open a packet of wipes with his teeth, tosses it to me, and pulls out a can of spray.\n “I thought you said it wasn’t time yet,” he says.\n “I thought it wasn’t. It’s really early.”\n Honey stands naked on the sand, slick pouring down her legs. Already she looks hesitant, confused. “Mama?”\n “It’s okay, Hon. Just let it come. Do you want to lie down?”\n “Yes,” she says, and crumples.\n “Fuck,” says Dave. “It’s going to hit the water. I have to go make a call. Take this.”\n He hands me the spray, yanks his loafers on and dashes up the beach. There’s a phone in the parking lot, he can call the Service. He’s headed for the fence, not the gate, but it doesn’t stop him, he seizes the bar and vaults over.\n The slick is still coming. So much, it’s incredible, as if she’s losing her whole body. It astounds me, it frightens me every time. Her eyes are still open, but dazed. Her fine hair is starting to dry in the sun. The slick pours, undulant, catching the light, like molten plastic.\n I touch her face with a gloved hand. “Honey Bear.”\n “Mm,” she grunts.\n “You’re doing a good job, Hon. Just relax, okay? Mama’s here.”\n Dave was right, it’s going to reach the water. I scramble down to the waves and spray the sand and even the water in the path of the slick. Probably won’t do anything, probably stupid. I run back to Honey just as Dave comes pelting back from the parking lot.\n “On their way,” he gasps. “Shit! It’s almost in the water!”\n “Mama,” says Honey.\n “I know. I tried to spray.”\n “You sprayed? That’s not going to do anything!”\n I’m kneeling beside her. “Yes, Honey.”\n “Help me!” yells Dave. He runs down past the slick and starts digging wildly, hurling gobs of wet sand.\n Honey curls her hand around my finger.\n “Karen! Get down here! We can dig a trench, we can keep it from hitting the water!”\n “This is scary,” Honey whispers.\n “I know. I know, Hon. I’m sorry. But you don’t need to be scared. It’s just like when we’re at home, okay?”\n But it’s not, it’s not like when we’re at home. At home, I usually know when it’s going to happen. I’ve got a chart. I set up buckets, a plastic sheet. I notify the Service of the approximate date. They come right away. We keep the lights down, and I play Honey’s favorite CD.\n This isn’t like that at all. Harsh sunlight, Dave screaming behind us. Then the Service. They’re angry: one of them says, “You ought to be fucking fined.” They spray Honey, right on her skin. She squeezes my finger. I don’t know what to do, except sing to her, a song from her CD.\n A sailor went to sea-sea-seaTo see what he could see-see-seeBut all that he could see-see-seeWas the bottom of the deep blue sea-sea-sea.\n At last, it stops. The Service workers clean Honey up and wrap her in sterile sheets. They take our gloves and aprons away to be cleaned at the local Center. Dave and I wipe ourselves down and bag the dirty wipes for disposal. We’re both shaking. He says: “We are not doing this again.”\n “It was an accident,” I tell him. “It’s just life.”\n He turns to face me. “This is not life, Karen,” he snarls. “This is not life.”\n “Yes. It is.”\n I think he sees, then. I think he sees that even though he’s the practical one, the realist, I’m the strong one.\n I carry Honey up to the car. Dave takes the rest of the stuff. He makes two trips. He gives me an energy bar and then my medication. After that, there’s the injection, painkillers and nutrients, because Honey’s voided, and she’ll be hungry. She’ll need more than a quick drink.\n He slips the needle out of my arm. He’s fast, and gentle, even like this, kneeling in the car in a beach parking lot. He presses the cotton down firmly, puts on a strip of medical tape. He looks up and meets my eyes. His are full of tears.\n “Jesus, Karen,” he says.\n Just like that, in that moment, he’s back. He covers his mouth with his fist, holding in laughter. “Did you hear the Service guy?”\n “You mean ’You ought to be fucking fined’?”\n He bends over, wheezing and crowing. “Christ! I really thought the slick was going in the water.”\n “But it didn’t go in the water?”\n “No.”\n He sits up, wipes his eyes on the back of his hand, then reaches out to smooth my hair away from my face.\n “No. It didn’t go in. It was fine. Not that it matters, with that giant dump floating in the Pacific.”\n He reads my face, and raises his hands, palms out. “Okay, okay. No Mr. Simko.”\n He backs out, shuts the door gently, and gets in the driver’s seat. The white clown on the boardwalk watches our car pull out of the lot. We’re almost at the hotel when Honey wakes up.\n “Mama?” she mumbles. “I’m hungry.”\n “Okay, sweetie.”\n I untie the top piece of my suit and pull it down. “Dave? I’m going to feed her in the car.”\n “Okay. I’ll park in the shade. I’ll bring you something to eat from inside.”\n “Thanks.”\n Honey’s wriggling on my lap, fighting the sheets. “Mama, I’m hungry.”\n “Hush. Hush. Here.”\n She nuzzles at me, quick and greedy, and latches on. Not at the nipple, but in the soft area under the arm. She grips me lightly with her teeth, and then there’s the almost electric jolt as her longer, hollow teeth come down and sink in.\n “There,” I whisper. “There.”\n Dave gets out and shuts the door. We’re alone in the car.\n A breeze stirs the leaves outside. Their reflections move in the windows.\n I don’t know what the future is going to bring. I don’t think about it much. It does seem like there won’t be a particularly lengthy future, for us. Not with so few human children being born, and the Fair Folk eating all the animals, and so many plant species dying out from the slick. And once we’re gone, what will the Fair Folk do? They don’t seem able to raise their own children. It’s why they came here in the first place. I don’t know if they feel sorry for us, but I know they want us to live as long as possible: they’re not pure predators, as some people claim. The abductions of the early days, the bodies discovered in caves—that’s all over. The terror, too. That was just to show us what they could do. Now they only kill us as punishment, or after they’ve voided, when they’re crazy with hunger. They rarely hurt anyone in the company of a winged child.\n Still, even with all their precautions, we won’t last forever. I remember the artist in the park, when I took Honey there one day. All of his paintings were white. He said that was the future, a white planet, nothing but slick, and Honey said it looked like fairyland.\n Her breathing has slowed. Mine, too. It’s partly the meds, and partly some chemical that comes down through the teeth. It makes you drowsy.\n Here’s what I know about the future. Honey Bear will grow bigger. Her wings will expand. One day she’ll take to the sky, and go live with her own kind. Maybe she’ll forget human language, the way the Simko’s Mandy has, but she’ll still bring us presents. She’ll still be our piece of the future.\n And maybe she won’t forget. She might remember. She might remember this day at the beach.\n She’s still awake. Her eyes glisten, heavy with bliss. Large, slightly protuberant eyes, perfectly black in the centers, and scarlet, like the sunrise, at the edges.\n Sofia Samatar is a fantasy writer, poet, and critic, and a PhD student in African Languages and Literature at the University of Wisconsin-Madison. She studies twentieth-century Egyptian and Sudanese fiction, and is writing a dissertation on the uses of fantasy in the works of the Sudanese writer, Tayeb Salih. Sofia's fiction has appeared or is forthcoming in a number of places, including Ideomancer, Expanded Horizons and Strange Horizons. Her poetry can be found at Stone Telling, Bull Spec and Goblin Fruit, among others; one of her poems was reprinted in the anthology The Moment of Change. Her debut novel, A Stranger in Olondria, is forthcoming from Small Beer Press in 2013."}