{"fingerprint": "Z49nLA2lCrzWd7rfAYrIJNGP0NY=", "sitename": "Clarkesworld Magazine", "title": "The Last Civilian by R. P. Sand", "author": "R P Sand", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sand_01_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Last Civilian by R. P. Sand", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7590 words, novelette\nThe Last Civilian\nYou, on the day of your birth.\nYou blink into existence, and the first thing you hear is: We are at war with the Uilai. The Uilai must be eliminated.\nWell, “hear” is an understatement, for the sentiment is injected through multiple channels: auditory, visual, synaptic. These words are your prime truth.\nYou are carte blanche but for a moment; there’s an urgency to the stream of information swallowed by your neurons. The topology of the crashed-starship-turned-station, comprehension of the fur-feathered locals, the terrain of Uiloolea, your assignment—your stream is that of Infantry, your expertise melee. And stances, strikes, and parries, from the upreared Cobra Clears the Veranda intimidation posture to the fluidic Falcon Feather Rides a Wind avoidance of blows.\nYou are of the Sixth generation, so you are called Zeta, followed by a unique number. Yours: 73.\nThe dual-wielded daggers 3D printed directly into your palms feel like they belong, an extension of your arms, as does the polymer uniform feel like an extension of your stretchy skin. At an equivalent of twenty-five Earth-years of age, you are now ready.\nThe reduplication cell doors open. You step out, newly born, raring to fight.\nYou, meeting her.\nUiloolea is a fertile planet, abounding in wet jungles, tumbling hills, spirited waters. A dominion primed with vibrant, cool colorings from greens to blues to an ensemble of purples. Certain angles under the sun reveal luminescent teal and lime highlights, and those very highlights read silver under two moons.\nWe of the Uilai share much the same coloration. “Peacock-kirin,” the first humans called us before they learned to pronounce Uilai with its breathy “ui,” marveling at our towering antlers, dark furs, biofluorescent feathered tails.\nThird Maternal Uncle, Rheal the biologist, believes our blues, greens, purples, and iridescent highlights that have us blend flawlessly with our surroundings are not an evolutionary necessity, but a reflection of our synchronicity. Take for instance the way we build: our collectives trace the sinews of our densely forested land, our structures boast an entanglement of earth and metal. We function in tandem rather than opposition; even our electricity draws breath from iyaewah vines.\nAs apex of the food chain, Rheal would tell me. What need have we for camouflage?\nNo, we had no need to blend in. Well, not ’til now.\nContrarily, your kind are fairly dull with your gradient of browns in hair and skin, your steel-gray jumpsuits, the only color to offer being the piping along your shoulders and necks.\nYou are human, of course. Bipedal, intelligent, spongy, featherless. And you like sweet things. You adapt quickly to your life: barracks, canteen, drills on the days there are no skirmishes, skirmishes on the days there are no drills, and back to the barracks until the sun rises again.\nThe days become indistinguishable, unless you injure yourself, then your schedule detours to the infirmary where a pleasant soldier of the Medic stream pokes and prods until you are better, usually within minutes. For larger scrapes you’re popped into a cylindrical healing tube within which EM fields repair your tattered cells.\nAt each meal you gravitate to the third dispensation window in the canteen where a Fifth from a Service maniple doles out generous servings. He calls himself Tree and he always adds extra eovh spice to the protein stew and extra lei honey to the pudding.\nYou do not realize you gravitate to this window until you bump into a soldier as you pull your tray from it two weeks after your birth.\nThe tray jolts and stew splashes on your uniform. A few ever-purple eovh needles stick to your jumpsuit.\n“Merde! Sorry, sorry,” says the soldier, grabbing a napkin from the counter. The piping at her neck and shoulders is the red of Command, distinct from your teal of Infantry and Tree’s green of Service. Her shoulder patch reads “Eta.” How odd. Had the Seventh generation already been born, then?\n“Apologies, Sen. My fault, really,” you say in a tone deferent to the red, frustrated at your clumsiness. An imbalanced soldier will surely be defeated rings in your head, a synaptic mantra. You reach for the napkin in her hand, but she insists and dabs at your uniform.\n“Thanks . . . ah, Sen, you didn’t need to line up,” you say; you may be deferent, but you are also bold, blunt—soldiers have no time for circuitousness. The other dispensation windows are free and without wait, you notice.\n“I was curious,” she says with a flicker of a smile. “You’ve come to this window the past three meals, even if there’s a queue.”\nHuh. You’d never really thought about it, but even as she mentions it you know it for truth, and you promptly recall tasting foods less toothsome from other windows during your early days. You simply shrug; there’s no need to insult the other servers, you are cogs in the same machine, after all.\nAs her smile deepens, you are unable to look away. Her teeth are white and well cared for, as are yours, as are any soldiers’, and her hair is pulled into a precise regulation bun. But there’s something about her smile you cannot quite put a finger on, there’s a gleam to it, a magneticity. Though her skin holds a dark hue similar to yours, it is somehow brighter, and she stands a good five inches taller than you. More than that, she seems almost . . . familiar. You idly wonder if all Sevenths were made with such perfection. It is of no matter, however; Idle speculation does not a good soldier make.\nWhen were you born? You want to ask, but you say instead: “Enjoy your meal, Sen,” with a nod and make to leave.\nBefore you can join the cacophony of lunching soldiers she says, “Wait for me.”\nSo you do. Tree supplies to the Seventh generous helpings of stew and pudding before you both make your way elbow-to-elbow to an unoccupied table in a corner. It has a view of the concentrated greenery and purplery outside, a pleasant contrast to the drab white and gray of the station. You’ve always enjoyed windows.\nEnjoying a view, preferring one server over another, choosing a name. These little quirks and inclinations manifest unbidden among your kind, despite the imprinted panoply of dogma, which, after all, makes you human.\nBut you are one of those who have opted not to select a name; the lot of you are of the opinion that names are redundant and unnecessary; Zeta73 is your unique identifier and serves you just fine. You wonder if this Seventh is more like Tree or more like you.\nAs though she reads your thoughts, the Seventh asks, “Do you have a name?” She wiggles a spoon between two fingers, deciding whether to begin with savory or sweet.\n“No. Do you?”\nSavory it is. She cools a spoonful of stew with a soft blow before answering: “Of course not. I was born only yesterday.”\n“I hadn’t realized Sevenths were birthed already.”\n“Too many losses at West Wind,” she sighed, which was enough by way of explanation. You’d been there. The Battle of West Wind was a monumental disaster, a massacre you reckoned as horrific as the Battle of Kai Springs was rumored to have been. Her tone was doleful, capped by a head bow—of course she would have been born with intimate knowledge of the wretched event that took place just a few days prior, and she could easily identify your participation. It affected her as it did you.\nAt West Wind, you’d nearly lost a limb and you suffered extensive internal bleeding, so the medics had fussed over you for hours. You were one of the lucky ones, one of three to survive; the Sixth’s Infantry maniples were largely wiped out by the barbarous Uilai.\nYour heart is heavy with the loss, of course, but this is the mantle you accepted simply by being born. You had been fond of your comrades, in the way trees are fond of growing together into a forest. Not attached, though. You didn’t even know whether most of your comrades had names.\nHowever, you have to admit the stew suddenly tastes different at her words. Bleaker. Generations are being sped up. At this rate in one Earth-year there could be dozens of human generations. Where does that leave you?\n“How many of you are there?” you ask.\n“As of now twenty-five. I’m the first.” You choke on the now-bleak stew, but you mask the movement with a cough. The first of the Seventh generation? So, Eta1. How does she sit here with you? You’d suspected she was among the first few, seeing her red—the first batch of a generation is usually Command. But to be lunching here with the likes of you?\nYou gape at her, but your stare is interrupted by a hush rippling through the canteen. Chairs scrape as soldiers scramble to their feet.\nGeneral Volantius, the sole survivor of the First generation, commander of the entire human population—all soldiers—parades through the bulkheads, her face radiant and scarred and unsmiling, trailed by stone-faced high Command officers belonging to the Second and Fourth generations—there are no Thirds left alive today. Two at her side wear the three gold stars of Intelligence at their lapels. Seeing them up close is a sight even rarer than Volantius.\nVolantius has a limp, but she limps as though she chooses to limp.\n“At ease, soldiers,” she says in her flinty voice. Her eyes flicker momentarily to Eta1, the Seventh you lunch with, before resuming her pace. At once the familiarity that tickled at your ears when you met Eta1 clicks into recognition.\n“You are a . . . clone,” you whisper as the canteen reverts to mayhem, and a corner is sectioned off for the general and her retinue. The word “clone” tastes like taboo.\nIn truth you are all duplicates of some sort, using native Uilai reduplication technology for breeding purposes, technology originally designed to maintain balance on Uiloolea, flora and fauna, no one species out-thriving another.\n“Gods!” the Progenitors spat in accusation. “The Uilai play at gods.”\nBut you are not clones.\nThe Firsts were all identical, but it took only a single generation to learn that no matter how hardwired the emotional capacities of a soldier, humans carry an inherent ache to be unique despite the uniform. The war is as much inward as it is outward. And so, cloning was fast abolished and now soldiers are birthed with random genomic perturbations. You share many similarities with your generation, but you are the only you in all of Uiloolea. It is why naming oneself is not quite encouraged but not exactly discouraged either. A soldier at odds with themself is already defeated.\n“Ja,” Eta1 says with a nod, eyes glimmering like diyas at your dropped jaw. “But only me.”\nYou, on a journey.\nCamaraderie is not alien to you, with how you inquire after injured soldiers, or navigate with your maniple through the dense terrain as one, or occasionally copulate with an arbitrary barrack-mate as an energy release—after which the deed is reported, documented, nutritional supplements consumed, per regulation. But friendship is an altogether different matter, and it is not something you immediately identify; over a short span of time and for reasoning beyond your comprehension, you find yourself consistently seeking out the company of Eta1.\nThe two of you spend on-base “free time” practicing forms in the area flattened behind the station for such purposes, framed by purple trees and blue-green barnacled bushes.\nThe sun shines a colorful checkerboard through the leaves across the stone courtyard and across Eta1’s face as her Heron Beak Cracks Still Water, a single impact blow, is countered by your crossed Elk in the Snowy Glade. She wields a staff, you dual-wield daggers.\nYou lunge with Lion Feasts in the Tall Grass Kingdom, and she leaps, avoiding the blows with a flawed Peacock Dances on Monsoon Grass—you nip her at the end.\n“Nicely done,” you say, catching the half of your breath that slipped away during the parry. “But bend your knees a little more for better balance.”\nEta1 is a younger incarnation of General Volantius and is being groomed as her replacement. When she’s not doing whatever it is she does with the general, she’s encouraged to shadow soldiers from different streams; imprintation at birth is well and good, but just as fighting forms require practice to build muscle memory, so would activity-based learning make her a better leader.\nYou are her choice from Infantry, and though she’s never confirmed it you suspect she spends more time with you than the others, and this pleases you.\nThis has provided ample pockets of time over a few days for you to reach the conclusion that she differs from anyone else you’ve ever met, more emotive, for one. Fidgety. Must be her genetic makeup, you think; the First generation was the first iteration after the Progenitors, who were far from soldiers. Eta1, being a clone of a First and unblemished by generations of soldiering, would naturally be different. This is all speculation on your part, of course, for your stream is not Engineering and you are no geneticist.\nYou also speculate that you’ve been rather prone to nonsensical speculation after having met her. This doesn’t hamper your want to spend time with her, of course.\n“Once more,” she says with a determined frown.\n“Let’s take five, we’ve been at this awhile.” You toss her a hydration pack and she gulps generously.\n“Omega,” she says after a pause, then offers you the pack.\n“Hmm?”\n“Omega! As a name. Can you say it? I want to see how it feels.”\nYou titter. “What will you call yourself when the twenty-fourth is birthed?”\nShe tugs an earlobe. “Hmm ah. I suppose you’re right . . . but who knows the future? I doubt I’ll be around for so long.”\n“Considering the general can apparently last generations, I don’t see why you’d be any different. You’ve got strong genes.”\n“Well, by then I’d be general, and I’d be able to call them whatever I want. Rollers. Pipes. Sleepless Nights.” You chuckle in spite of yourself.\n“Plus I like the sounds of the syllables,” she continues. “Try it, no?”\n“Alright. Omega. Hello. Um. How do, Omega?”\nShe beams and twirls her staff. “Ja, I think I like it. Now let’s think of something for you. How about Stinky?”\nBefore you can protest the utter ridiculousness of her proposal, she comes at you with Cat Flicks a Diya Flame.\nEta1 does not remain Omega for long, and it is Purple who you spar with a couple days later—a nod to the local flora, perhaps? Purple, you notice, has bruises under her eyes and on her neck of the same color.\nBut any attempts to ask after her well-being—is she not sleeping well? Surely this can be easily treated?—are thwarted by what she deems more important matters. She covets the gold stars of Intelligence and longs to impress the general, and these ambitions drive her to pursue her study aggressively and rather unconventionally.\nThis leads to the occasional uncomfortable encounter, and though you are fast-becoming used to Purple’s unorthodox remarks and questions, it is another matter altogether for your comrades.\nAt dinner, still soaked in sweat from sparring, you and Purple are joined at your table by the two other surviving Infantry Sixths, a narrow-shouldered Zeta47 and a brawny fellow who calls himself Strike.\n“You two were at West Wind as well, weren’t you?” Purple asks, puncturing a fhoda leaf pakora in the stew; the mushrooms inside release a ribbon of steam and a whiff of Tree’s extra eovh spice.\nYour comrades prickle at the question; not only was the Battle of West Wind a humiliating disaster, it unleashed the wrath of General Volantius. The Command officers involved who survived were publicly executed for their failure.\n“Aye, Sen,” Zeta47 says quietly.\n“Did you know it was a trap?” The two stop chewing, Strike even sputters and chokes a little. You hide a smile. Ah, Purple.\nShe’d asked you the very same thing, and more: Why do you think the Uilai attacked unprovoked? Why didn’t you retreat when it was obvious humans were being slaughtered?\nYou not only prickled at the audacity of the questioning, you became angry. Surely she knew that to admit even a hint of knowledge of the trap would imply a soldier deeming themself more intelligent than their late commanding officers? That the Uilai are monsters sans motivation to attack? That to retreat without order is disobedience, and more than that, utter cowardice? It is the burden of Command to strategize, and not the soldier to question orders.\nShe took your retorts in stride as she did your swooping strikes of Magpie on the Oak by tactfully rolling around them with Hedgehog Caught in Summer Sun. She continued to pry, and after a time you began to chime in to the spiral of speculations yourself. Why do the Uilai not want to share this world? Why are they so greedy? Are they hiding something? Something cool perhaps—do they falsely dye their furs and feathers and are afraid of being discovered? Why are these boring old gray jumpsuits the best Engineering could come up with? Perhaps humans should make dresses from purple leaves and build homes in the trees. To which you both collapsed together in roaring laughter.\nThe reactions of Strike and Zeta47 are as defensive as your initial response had been: “It is done now, why are you even speculating such things?”\nPurple did not press them as she had pressed you, though after a couple more questions they ask permission to be dismissed through gritted teeth, clearly battling the urge to storm off. She waves them away.\nIn any case, Purple already knows what you are all born knowing: that we of the Uilai are primarily bipedal, but quadrupedal when haste is needed. That we speak with our minds through mind-talk and choose not to with our mouths. That we are communal and creative and harbor technologies you cannot fully comprehend.\nAnd that every time humans push westward—in the direction of Kai Springs, the location of the battle that started the war ages ago—they are met with more aggressive opposition than from any other direction.\nGeneral Volantius wanted to put an end to that.\nThe Battle of West Wind is so called because a song was carried on the wind that drew the attention of the Infantry maniples the general had deployed westward.\nThe soldiers followed the song and stumbled upon a clearing in which an Uilai behaved rather oddly—she appeared to be asleep but standing on her head, antlers driven deep into the ground. She also appeared to sing in her sleep.\nNot one to pass up an opportunity to gather information, and perhaps greedy in their own ambitions to impress the general, the Command officers ordered the maniples to inspect the clearing and the lone Uilai, who remained unmoving even as they approached. Know your enemies as you know yourself and you are already victorious.\nWhat they hadn’t noticed were the Uilai camouflaged in the trees, waiting.\nYour kind underestimated us in your assumptions about our “savagery” and “predictability.” Having no term for the word “war” until we encountered humans, we made infantile mistakes at first, engaging in battle when clearly outnumbered, not regulating and securing supply lines, falling prey to easy ambushes. With every defeat we learned and adapted. What you Sixths encountered in the clearing was utterly nonsensical, as it was designed to be.\nWe do not walk on our heads or sing in our sleep, but you will believe anything simply because you assume we have nothing in common.\nOh but we do have more things in common than you know.\nYou are the descendants of the ESS Orion, the sole colonial starship to survive the disaster that demolished its fleet only to plummet into the jungles of Uiloolea. You cling to a precarious thread, the crash having destroyed any chance of flight, many human technologies, advanced weaponry.\nThousands of years of history weigh on your collective shoulders.\nYou fight for the preservation of the human race.\nA fight that is, at the end of the day, not dissimilar to the secret in the west we so fiercely protect.\nYou, caretaker of kittens.\nA crackle in your ears snatches you from dreams of musical greens, playful waters, and the one who now calls herself Petal. Soldiers never remove their ear comms, not while showering, not while sleeping.\nYou leap from your bunk and with practiced ease slip into boots and gear. In your half-sleep it takes you a moment to register that you are the only one doing so; the barracks are still dark. And that there’s a whisper in your ear through the hazy crackle.\n“Stinky? Wake up, Stinky!”\n“P-petal?” you hiss. This is most unprecedented and as fond as you are becoming of her, not only do you grimace at the obnoxious breach of protocol—the comms are not for personal use; what need of personal use communicators have soldiers, anyway?—you hardly appreciate being awoken so gratingly.\n“I require assistance. Report to the Via Sacra immediately. Bring water.” You suck in a breath. Outside Volantius’ compartment? What is Petal playing at?\n“On my way . . . Sen. Zeta73 out.” The crackle fades.\nYou scamper through the halls gripping a hydration pack tighter than necessary, crossing bulkheads and the two courtyards it takes to reach the shuttle-pod-turned-housing-unit of Volantius’ compartment. The compartment is dark, but the road leading to it that cuts right through the wet trees are flooded with bright lights, and there are guards stationed out front.\nYour eyes catch a spark; a shadow obscured in bushes along the road up ahead flashes a small mirror in your direction.\nWith a hefty sigh you skulk across the road, giving the guards a wide berth.\n“Here,” whispers Petal. She pulls you into the bushes, though you don’t really need her help, and you stumble at the unwanted extra force. Oh this girl does make you clumsy.\nWhen you crouch beside her, hidden by the bushes and trees, your eyes take a moment to adjust, so you hear the chirps and mews before you can see their source.\nWhat come into focus are tiny tottering balls of moss, with squinched eyes and naked rubbery tails.\n“The eff is that?”\n“They’re babies . . . orphans. Volantius’ cruiser hit what I think was the mother on our way in this evening. Tried to save her, but I couldn’t.” It is then that you become aware of a large unmoving mossy mound just beyond the scraggy pakoras, the focus of their agitation. They try to climb it but they climb over each other instead, and their mouths seek teats that will never offer milk again.\n“The water,” Petal says, coaxing the bottle from your clamped fingers; you’re suspended in incredulity—had Petal really breached protocol for this? If you are caught you will be heavily reprimanded, maybe flayed, or even worse: stripped of your station and sent . . . wherever those who had the misfortune to display even the slightest weakness of mind were sent. You never saw them again. Any deviation from protocol weakens the military machine.\nThe right thing to do would be to leave immediately and report her. Instead, you watch as she rolls a thick leaf to drip water into their mouths.\nProtesting your own passivity, you decide right then that you don’t like her very much, that you will stop seeing her, curse the day you first met her . . . even as you note how gracefully her limbs move, how tenderly she cradles the little things. Have you ever witnessed such softness before? No, no, you don’t think that you have.\nYour body doesn’t seem to agree with your decision to dislike her, and you find yourself leaning in to help when a particularly jumpy one fights against her gentle grip. Feisty little thing.\nAs Petal drips water into its mouth, you notice that the joints of her fingers are at odd angles, as though they’d been broken, and the repair process had not quite put them back together correctly.\n“What in the name of Old Earth happened to you?”\nPetal doesn’t answer, of course, and instead coos over their mossy features, their little mouths, their furless tails that coil and whip every time they mew.\n“They aren’t exactly cats, are they? The ones in the forms. They’re the closest we have, though, look they’ve even got little whiskers and ears. Let’s call them kittens.”\nAfter a befuddled pause, you catch yourself agreeing not only to the nomenclature, but that together you’d find a dense bush nearby and check on them in alternating shifts each day, bringing food and water and all else they could need to flourish and grow without a mother.\nMerde. What are you getting yourself into?\nBut you see the bruises on Petal’s face and her broken fingers, a change in her dark eyes, the way she buries the dead mother, and in that moment you find yourself wanting to give her everything her heart desires.\nYou, irrevocably human.\nThe kittens yawn and stretch and twitch as you nuzzle their ears. Their bedding of shredded linen tucked within a turquoise barnacled bush is freshly replaced and they aren’t hungrier than usual, so Petal has definitely visited. You, however, haven’t seen her in three days.\nEven though you know A soldier who delves more in thought than action is already defeated, your thoughts race a deleterious marathon. Why is she avoiding you? You were too easy on her the last time you practiced forms. No, you were too hard on her. You chided her for calling you Stinky, even though you secretly adore her carrying a name just for you on her lips. Why hadn’t you told her that? Did you forget to wait for her at a meal?\nYou find excuses to pass her private quarters—more closet than quarters, really—taking long detours from one duty to another, hoping to catch a glimpse of her. You continue to check on the kittens once a day as promised, but the visits take on a whole new meaning: they’re your one connection to Petal and on a whim you leave a note, a simple, “Talk soon?”\nThe note is nowhere to be found on your next visit, but lacks a response.\nIt is during an early dinner when General Volantius enters the canteen with her retinue that you spot Petal among them, one gleaming gold star at her lapel. At first, your heart leaps—she’s worked hard for this!—but your exultation rapidly recedes when the reason for her distance occurs to you. Intelligence is sequestered from the rest to avoid contamination. You had hoped that would happen only after she’d earned all three stars.\nYou position yourself at your usual table hoping to catch her eye, but she drifts like a dead leaf on a harsh wind, following without expression. She seeks food from the nearest window, not from Tree, and barely touches it throughout the meal, simply punctuating whatever the general has to say with a nod. She doesn’t look at you, but the general’s eyes flicker in your direction for a brief moment, and there’s something in that look that makes your skin tighten.\nThe shadow on her face makes you wonder if Eta1 is still Petal at all—she wears a new name so frequently, by now she must have had at least two. Or none. It makes you feel distant from her, more distant than the spans of dining soldiers between you.\nYou stir your spiced stew absentmindedly, ignoring any attempts at conversation from your comrades.\nAfter dinner you pass her quarters, and you hear a wail. It is a disquieting sound, something you’ve never heard before. Alarmed, you push open the door and find Petal crumpled under a bookshelf, hands wrapped around her knees, rocking, rocking. The quiet, cutting wail makes you sweat; you want to run, but find your arms instinctively reaching to her instead.\nA moment of hesitation passes before you settle your arms around her. You’ve never touched her before . . . well, not like this.\nShe sinks into your chest, drawn like dew to petals. She fits well. Her wail subdues to a succession of choked sobs that shake your body.\n“Tighter.” The voice is weak, though provides the sobs a brief, broken respite. And once more: “Tighter, not tight enough.”\nShe’s angry for some reason as the demands for an ever-tighter embrace grow stronger and you squeeze as hard as Tree once did while demonstrating juicing some citrus fruit. You worry for a moment whether you’ll hurt her, whether her insides will turn to juice as well. The silliness of that thought strikes you shortly after. Juice? Really?\nThe two of you are so entwined for what feels to be hours, but the light from the window above remains unchanged. The sobs diminish into sniffles and then there’s a silence that you don’t know how to break.\nEventually, Petal speaks: “It’s only been one year.” . . . What?\n“I can’t do this, this thing,” she continues in fragments. “Can’t be her, she doesn’t get it.” You are confused at these words. Of course Petal can’t be General Volantius, wasn’t that the whole problem with the First generation? You are no geneticist, but you know, as all soldiers do, that those clones had been expected to not only look identical, but act identically. That failed, obviously. Volantius wouldn’t expect that of her, would she? While it is true that certain inclinations are genetically encoded during the reduplication process—an enhancement of traits more suited to a soldier’s stream—personalities emerge on their own.\n“You can’t . . . ” you begin to say, grappling for the right words. “You aren’t . . . ”\nLuckily Petal finds her tongue before you do and words tumble from her mouth, slowly at first, then with more abandon.\nVolantius is dying. There is friction between the general and her replacement, expectations not being met. Petal questions when she shouldn’t, and Volantius accuses her of being too soft.\nToo soft. Merde. You’ve heard those words before. In whispers in the corridors and out on the field. Of the occasional soldier considered “faulty,” unsuitable for the military. Usually identified soon after birth and then never seen again.\nYou never gave them much thought, but you also did not know them the way you know Petal.\nAt once it hits you that this woman you hold has a target on her back. When you peer down at her, study her more carefully, pressed into you, you notice cakes of blood and even more broken bones badly repaired.\nWhen she grows silent, you ask delicately, “What did you mean by ‘it’s only been one year’?’” She raises her wet eyes to you.\n“Orion? It crashed last year.” You stiffen. Huh?\n“We’ve only been at war for a few months,” she continues. “The fighting hasn’t been going on for years. It’s the comms in our ears, they do more than relay orders, they . . . make us believe.”\n“But . . . that would mean Kai Springs—”\n“Last month. The Battle of Kai Springs was last month. It’s why you were born. It’s why the Uilai fought so hard a few days later at West Wind.”\nThe world lurches but you shake it off, no, no, Petal is obviously distressed. Perhaps she suffers a neurosis? Irrespective of what ails her, she still has a target on her back, and desperation begins to coalesce in your throat.\nWhat . . . what if she disappears? A world without her smile and her changing names and the way she makes you see things you wouldn’t have otherwise noticed. A lackadaisical world devoid of color no matter how vivacious the local flora and fauna.\nNo. No, you would rather die than live in a world without her—the thought surfaces from the depths of your desperation. You have to pause for a moment. For many moments. This is too much.\nWhat could you possibly do?\nAfter eons you say, “Let’s leave,” so softly you are unsure the whisper reaches her ears. “There’s ample food and cover out there. I’ll protect you.”\nShe laughs, but it is more pathetic shake than laugh, really, too soft. Yes, she is too soft. And in danger.\nThe sound emboldens you. “I’m serious,” you say. “We’ll leave. Find an abandoned cave.”\n“The planet’s small. They’ll find us.”\n“It’s not that small. We can hardly track beyond a few kilometers anyway with the humidity and rains and trees, do you really think they could find a pair of smart pakoras like us?”\nHer face brightens a little, a hint of the day you first laid eyes on her. She studies your face as you study hers, and your pulse quickens.\n“Alright,” she finally says.\nYou fix a time to depart at night and leave her tucked in bed for a short rest, feeling lighter on your feet than you ever have.\nWith your head whirling with fancies of the joyful life you will live, and the minutes not moving fast enough, you find a welcome distraction in keeping yourself physically busy before lights out by driving rollers away from underneath your bunk.\nRollers: tiny marsupials a deep plum in color with eyes so dark a blue to be nearly black. Their weakness is the assortment of protein bars in the soldiers’ packs under the bunks. An occasional, reprimandable sight is a smattering of rollers snoring on their backs amid empty wrappers, bellies amply thickened by gluttony. You marvel at their contentment, even as you thwack them away from your pack, and marvel that you will soon join them in their contentment.\nJust as you rid yourself of the last roller, a bell tolls. What is odd about the sound is that you can’t tell whether it comes from outside or from within your head. Either way, the sound penetrates your nerves. Along with vibrations, words pour into your ear.\nYour barrack-mates are struck as you are, frozen in place for a split second. They consume the words they hear as truth, and the words threaten to ring true for you as well. If you did not feel as deeply as you do, you’d ingest them and then forget the bell had ever tolled at all.\nThe words?\nEta1 was never born. Eta1 does not exist.\nYou, on fire.\nThe world leaks as though it’s been turned on its head and gravity’s crime is to push and not pull. Your chest convulses with gulped half-breaths as though your lungs are stone and not flesh. Your gut grows leaden, your limbs cold.\nPetal—wait, was her name still Petal, anyway? Why in the name of Old Earth hadn’t you asked her?? Petal. Petal is dead, and you are the only one who can remember her. Her quarters are empty and clean, there is not a single speckle of dust to betray someone had ever occupied this space.\nYour surroundings are dulled and muted. Somehow you manage to stumble your way to an exit and gasp for the clarity of the night’s air outside. The violent shades of Uiloolean colors that once thrilled you seem now a pompous barrage, too loud, too loud. How could the world boast its colors with Petal gone?\nThe kittens have disappeared and even as you frantically overturn rocks and part bushes in search of their wrinkled faces you are unsurprised. Of course they knew. Of course she knew, and now she’ll come after you, that woman who dared share Petal’s face.\nBioflourescent succulents splatter beneath your boots and you run even before you become aware of your movement. Run and run and run, ripping off the comms in your ears. The moons bounce silver off leaves and moss and petals, guiding your way. Branches tear at your jumpsuit and your skin, and you bleed a little but the stings outward are inconsequential compared to those within.\nIt occurs to you after some time that you head westward.\nWestward. Kai Springs.\nWhere it all began, or so General Volantius had led you all to believe. You stumble as nausea threatens, but keep pushing forward, ever forward.\nIf Kai Springs had in actuality happened only a month before, why did Petal say the war had been going on for a few months? Petal. Petal again. No, no you cannot bear to think about her. You lose yourself for a while, even as your feet carry you forward.\nWhen you return to your awareness, you are no longer running because your legs smart. You still move westward though, limping and staggering, yes, but still westward. The richness of the raw spice in the air, the dew on the leaves, and the chirps and chatters of insects flood your senses. The silver highlights of the jungle wash into teals and limes as the sun peeks over the horizon.\nI feel the stir in the leaves even before I hear footfalls, crunches, rustles, snaps.\nA human approaches, I send through mind-talk to the two who share my petrol duty this night: willowy Third Maternal Uncle, Rheal, and spritely Second Paternal Cousin, Ilya. We circle but a few spans outward from our collective nestled alongside Kai Springs. A lone human, I reassure when they project their alarm and make to join me. I will take care of it, though stay you close.\nAs I move to intercept you, my thoughts are slammed with a swift wave, a wash of careening emotions from your direction. Oh hmm. Well. This is unexpected. I’ve seen this before, from others who have opened their minds and feel.\nIn this moment I make a decision; I lower my locked arrow, return the bow to my back.\nYour eyes are blurred, so it takes a moment for you to realize that what you’ve run into is no tree. You back up slowly, instinctively draw your daggers, and crouch.\nI open my palms, show them empty, and slowly lower myself onto all fours. Slowly, slowly. I can only imagine how startling it is to stumble upon a creature twice as tall, made even taller by looming antlers. As my hoofed fingers sink to the ground, you rise from your crouch into an intimidatory stance, meeting me eye to eye, emboldened by my apparent show of deference and peace.\n“We . . . not so different . . . you and I,” I say, slowly, haltingly, for it has been weeks since I’ve spoken aloud. I pause. Taking a chance on you has to be the right decision.\nYou frown, run your eyes along the feathers down my spine to where they end in an abundant tail, the thick muscles under navy-purple fur, teal-lime highlights in the dawn’s light. My undrawn bow, the necklaces I wear at my neck, the embroidered cloth wrapped around my waist.\nThe decision you make after a considerable pause mirrors mine: you sheath your daggers and shrug off your stance.\nAs if on cue a wail pierces our silence and I tense.\nIt is a sound you’ve never heard before, and very different from Petal’s wail, higher in pitch and very strange. It unnerves you, triggers your primal instincts.\nShhh, I send to my collective. The wail only grows louder in defiance.\nDo you understand?\nNo, I can see that you do not.\nAh, well. It would take much too long for me to explain aloud.\nMy thoughts trickle toward you, tentative prods against the wall that is your mind, and when I find insubstantial resistance I pour open. Human-Uilai mind-talk is not truly mind-talk, but a somewhat rudimentary variant. Sufficient, however. You gawk as we connect.\nI will not cause you harm, I think to you. And you to me: I believe you.\nYou have lost something.\nI’ve lost everything.\nYour mind is erratic, undisciplined; memories course into our connection. That is when I see. You, on the day of your birth. You, meeting her. On a journey. Caretaker of kittens. Irrevocably human. And finally, you, here, on fire.\nI motion for you to follow me and you seem baffled that you do.\nThough we are not far from our destination, it is the nature of mind-talk that allows me to convey so much in such a short interval:\nWe were not always at war, the humans and Uilai. The first humans crashed onto our world, blown off course when the rest of their fleet was demolished by a phenomenon in the stars they’d never encountered before. We were angered and dismayed at the injury to our jungles and the loss of animal life. But it was soon made clear that they arrived by accident, that they suffered severe losses themselves; most of those who had not died in the crash perished soon after through radiation poisoning from whatever cosmic storm had flung them our way. We grieved with the survivors, exchanged foods and ornaments, gifts upon gifts. We attempted to repair the starship so they could resume their journey to find a new home.\nAlas, star flight requires materials we don’t have here on Uiloolea.\nAt first the contact was amiable. They watched curiously as we rapid-reduplicated flora and fauna to compensate for the damage, eager to learn of our ways. Then came dangerous, desperate dreams. Knowing that it wouldn’t be long before they succumbed to the poisoning themselves, they envisioned rapid-building great cities, populating through reduplication, creating a third Earth. We pushed back, refused to let them cut trees and industrialize. We urged them to build constructively, following the land as we do, and not destructively and upward. The thought of caves and tunnels, however, seemed repellent to them.\nMost of the first humans reluctantly conceded and elected to live their last days in the ship-turned-station, but there was a small group that refused to relinquish the dreams. It was led by a psychophysicist who had at first been the warmest of allies, ever intrigued by our technology.\nJayne, she was called. You know her as General Volantius.\nAt this you stumble, and I steady you before your head hits a swooping branch.\nYes, Volantius is a Progenitor. She is not of the First generation, though it was her DNA that birthed them.\nThe wail dissipates abruptly, its source as erratic and undisciplined as your thoughts. At the entrance of my collective, a compact network of alcoves and tunnels, we are met by Rheal and Ilya. They reach for their weapons, but I think to them, Ease. I believe this one can help.\nRheal narrows his amber eyes, questioning the judgment of someone who will always be a child to him. Ilya is more forgiving and steps aside easily.\nTrust in me. I maintain my posture, drawing inspiration from the Raven Soars in the Moonlight you attempted to intimidate me with just moments before. Rheal looks from me to you and back, then with a sigh keening on the dramatic, joins Ilya to the side.\nWe enter the main tunnel and I direct you upward, through metal-earth stairs leading to the sky window at the peak of the first hill. You gape at the walls inlayed with lit panels webbed with iyaewah vines that guide our way. Rheal and Ilya trail behind us, and you know as well as I that a single wrong move on your part would be the end of you. An extraneous precaution; I will kill you myself, if it comes to that.\nWe emerge under the stars where Ilya’s mother, Ayaal, cradles a bundle amidst gifted diyas.\nThis is, I begin to tell you, but you don’t hear me: you are transfixed by what Ayaal holds. It is something that is very obviously human to you, with smooth skin and wispy follicles, ten fingers and ten toes, a mouth, two eyes, a nose. But it is tiny. You have never seen a human child before.\n“How—how is this possible?” you say aloud, forgetting our connection in your confoundment.\n“There was . . . a family,” I say. “More than one. That broke . . . from you. Bellies swole with love. We found them. We nearly killed them.”\nBut when it was obvious they wanted peace, to harvest the land, drink the waters, and to just live, simply live under the sun and sky, we protected them as they shed their mantles as soldiers to build a civilian life in Kai Springs. We shared meals and stories around communal fires in much the way we did with the first humans.\nWhen Volantius discovered the deserters, we were no match for her focused force . . . not with your generation of Sixths freshly-birthed in internecine fury.\nWe could only save this smallest one, whose existence remains unknown to her.\nHowever . . . I fear we do not know how to care for it; we’ve provided iya milk and lei honey, which appear to have nourished it for a time, but it weakens now and needs something more.\n“Yes . . . something more . . . ” I continue aloud as you fall to your knees. “Why . . . why do you so weep?”\nI touch your shoulder and squeeze, mimicking a movement I had witnessed in Kai Springs.\n“I cannot,” you say in spasms. “Not after what I’ve done.”\nOh, oh but you can.\nYou see, I know you now. I know what your heart holds; I know what you are capable of—can you not see? This is a fortuitous, beautiful thing. A child who needs to be loved. And a you who needs to love.\nIt needs you."}