{"fingerprint": "6aZ2t9tUYoIe2NvMLB5NAEY50vw=", "sitename": "Clarkesworld Magazine", "title": "Automatic by Erica L. Satifka", "author": "Erica L Satifka", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/satifka_01_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Automatic by Erica L. Satifka", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1520 words, short story\nAutomatic\nHe rents his optic nerve to vacationers from Ganymede for forty skins a night. She finds him in the corner of the bar he goes to every night after work and stays in until it’s time to go to work again, sucking on an electrical wire that stretches from the flaking wall.\n“That’s not going to kill you any more,” she says.\nHe ignores her, grinding sheathed copper between brown-stained molars.\n“My name is Linda Sue. I want to make babies with you.”\n“That rhymes,” he says.\n“Will you do it or not?”\n“Or not.”\nLinda Sue stamps her foot. “Come on.”\n“I’ll take you out first. Then we’ll see.” He takes her by the hand and leads her out of the bar, out into the heart of downtown New York City.\nNew York City, population three hundred and twenty.\nHe guides her to a restaurant he knows where the food is stacked in piles on hygienic white counters and the electricity works. She has two eyes and two hands and one set of lips, which means she is pretty. They each take a few slabs of food—the food here is free—and sit on the ground. He tells her about his life and her eyes open wide as headlights.\n“I’ve never known anyone who had a job before.”\n“It’s not a job. It’s a career.” He works at a factory, pouring liquid plastic into molds shaped like four-tined forks. “I have a quota to fill.”\n“Why don’t you just ask the Ganys for plastic forks? Why does someone need so many plastic forks anyway” She tears off a corner of her foodslab; it comes off onto her fingers like cotton candy. Or insulation.\n“They’re not for me, they’re for people.”\n“I don’t have to work. I don’t like to. I just ask the Ganys for everything. They like to give us stuff.”\n“Well, I don’t ask them.” He doesn’t think about the creatures dancing spider-like on his nerve. “I’m self-sufficient.”\n“Are we going to fuck or what?”\n“Later, later. If you’re good.”\nIn Central Park they walk past a rusted-over carousel. She’s drunk from the amber-colored alcohol-infused drinkslab she’s consumed, and he’s propping her up, forcing her to walk straight.\n“I think I’m in love with you,” she slurs.\n“You don’t know what that word means.”\nThey pass a pair of Ganys wrapped in the form of two wall-eyed Jamaican teenagers, humans whose bodies were either sacrificed to or commandeered by the intelligent energy beams. The girls giggle and point as they pass. He flips them off.\n“That wasn’t very nice.”\n“They patronize us. Don’t you see how they patronize us? There’s too many of them in this city. I want to get away from here, out into the country. Will you come with me?”\n“Nobody lives in the country.”\n“Exactly.” But he knows it is pointless; nobody lives in the country because there is no way to live in the country. The farms are all poisoned and the shadow of the plague still lingers. The Ganys, knowing this, constructed an invisible olfactory wall, to keep humans and germs from mingling.\nHe will never leave New York City. Always a hotel, never a tourist.\nThe story of the plague goes like this:\nOnce you could be certain that you would not spontaneously grow legs from your shoulder blades and arms from your buttocks. You could be reasonably sure that ears would not sprout on your cheeks overnight. Then the plague happened, and you couldn’t take that for granted anymore.\nUntil the Ganys came.\nThey get back to the bar and she takes off her clothes. Her ribs stick out like a xylophone. The foodslabs keep them alive, but they aren’t the right kind of nourishment. But you couldn’t expect intelligent energy beams to understand food.\nLinda Sue’s body is fuzzy and indistinct, a peach-colored blur. His vision is cloudy from the tourists in his head. He crawls back to his corner.\n“Aren’t you going to fuck me now? Aren’t you going to give me my babies?”\n“No, I’m still not ready.”\n“Oh, screw you! You’re crazy. Why don’t you get the Ganys to fix that for you? They fixed it for me.”\nNow all you want to do is mate, he thinks. Not make love, you can’t love anymore. Mate with the last members of your species so you can bring us back from the brink of extinction. That’s all it is.\n“I can’t.”\nShe shakes her head. “I’m leaving. I can find some other male to give me my babies. I don’t need you.” She slams the lockless door behind her. He hunkers down in the corner.\nHe awakes to unclouded vision. The vacationers checked out of his optic nerve as he slept. He rubs his empty eyes and stumbles to the corner market, where he throws down a few skins and picks up some foodslabs.\n“You don’t have to pay for those,” the Gany monitoring the electricity says.\n“Yes, I do.”\nIt would be so easy, he thinks sometimes, to go down to the place where the Ganys congregate, the place where you can go rent your body for a day or a lifetime to their volunteers, and just turn yourself over. Shut off your brain for as long as you wanted, and you’d get a nice pile of goodies when your assignment was over. But he’d never done that. Renting his eyes was as far as he’d go. And even that was done not out of love for the aliens or the desire for material objects but the knowledge that, if he did not do it, he would be marked a traitor and slated for commandeering.\nThe Ganys have taken a special interest in humans. They had cordoned them off in cities with invisible olfactory walls, so that the remaining humans would be able to find one another more easily. And of course, they had brought The Cure. All of it was done for our—no, he thinks, their—own good.\nHe takes a dramatic bow, as if addressing a live audience. And in a way, he is.\nHe’s leaving the city today. He crams a stack of foodslabs into a looted knapsack and heads north on foot. He walks until the sun is directly overhead and then stops by a river to eat.\nThe river is contaminated; he can smell the plague in it, festering. But there are drinkslabs in his pack, too. He tears off a few chunks of the tasteless foam and presses on.\nA half hour later he is halted by a smell halfway between burning plastic and dog shit. I’ve reached it, he thinks. The wall between New York City and the rest of the world. He holds his breath and trudges through the wall, but it in no use. He can’t hold his breath forever. His chest deflates and the putrescent odor fills his nose and lungs, as if the dog shit is being shoveled into his mouth by the handful. He gags, and vomits up a piece of semi-digested foodslab. Choking, he runs out of the wall, and takes a whiff of pure air.\nHe didn’t even make it past the fifty yard line.\nPlunging back in, he finds the smell has changed. Now it’s the scent of burning tires. He moves to the right and hits a wall of solid rotting flowers. Moving forward, there is a stench like fish guts being baked in the sun. He stumbles backwards, and falls into the strong arms of a stranger.\n“Hello there, little guy,” a park ranger says. He looks into the ranger’s crossed and clouded eyes. A Gany.\n“I couldn’t get past the wall,” he says. His eyes are running with tears and there is vomit on his chin.\n“You shouldn’t be out here all alone.” The ranger gestures at his vehicle. “C’mon, let me give you a ride back home.”\nHe doesn’t want to take charity from a Gany, but he doesn’t like the prospect of walking three and a half hours either, especially since he still can’t breathe in all the way and his stomach feels swollen and fluttery. He gets in the vehicle.\n“You have a mate back at home?” Of course, that’s the first thing the ranger would say.\n“No.”\n“Human beings should be fruitful and multiply. It says so in your holy book.” The Gany speaks with the friendly, homey Upper New York accent that was the ranger’s voice when he was in control of the body, but he can sense the cold analytical tone of the intelligent energy beam guiding it.\nHe grunts and turns back to the window. Less than twenty minutes later the four-wheel-drive all-terrain vehicle pulls up in front of his bar. That fucking Gany read his mind.\n“You be safe now, partner.”\nHe slams the door.\nIn the apartment building across the street two humans are mating. For a moment, he wonders what it would be like to forget everything, become a creature of instinct, every moment of your life unscripted and so automatic.\nThen he goes back into the bar.\nErica L. Satifka's work has appeared in Clarkesworld, Shimmer, Intergalactic Medicine Show, and Lightspeed's Queers Destroy Science Fiction special issue. When not writing, she works as a freelance editor and writing instructor. She lives in Portland, Oregon with her spouse Rob and three needy cats."}