{"fingerprint": "kZiLE+9pAK3xJiKG8oA9gksaXvA=", "sitename": "Clarkesworld Magazine", "title": "Loving Grace by Erica L. Satifka", "author": "Erica L Satifka", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/satifka_09_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Loving Grace by Erica L. Satifka", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3780 words, short story\nLoving Grace\nWhen Marybeth’s number comes up in the employment lottery, Chase goes with her to her orientation, but they won’t let him inside the operating theater.\nChase and Marybeth had watched the videos together on YouTube, though, so he knows what she’s in for. Two small holes are drilled at the temples. That’s where the wires go in. The intestines they put in a bucket for easy drainage. No muss, no fuss. All other parts are distributed around the cubicle, either hung on thick hooks or slid into drawers for safekeeping.\n“You’ll wait for me?” she asks via speakerphone, right before they download her into the drone.\n“Of course,” Chase answers. His stomach still roils from the surgery clips.\nThe Employment Bureau sends him a holo of Marybeth, to replace what they’ve taken away. Every night since she left, Chase sits on the couch with the holo next to him. It has slight corporeality. When it pats his thigh, the touch feels like a kitten’s paw. “Can you get me some ice cream, honey?”\nHe doesn’t feed it ice cream. He doesn’t make eye contact with it, even though it looks just like his wife. Marybeth’s amateur charcoal drawings line the mantle above the television, a reminder he can’t bring himself to stash away.\nWhen things get bad, he takes a walk around the neighborhood.\nAnd when things get really bad, he goes to see the storyteller.\n“Gather around the fire,” says the storyteller. The two dozen people collected in the parking lot of the old strip mall edge in closer to the wizened old man, their ties and linen skirts nearly brushing the coals. The storefronts are empty sockets, their gaudy paint peeling and faded. “Let me tell you a story.”\nChase hangs around the back, near an old fiberglass statue of a lumberjack once used to sell maple syrup. He can barely hear the storyteller’s words above the crackling of the fire and the humming of the drones overhead. He looks up at the drones. He thinks about Marybeth.\n“This is a tale about an ant,” continues the storyteller. He paces the parking lot, his wooden cane thumping like a heartbeat. “She was a very good ant, and knew her place in the colony. She was born to fill a role and she filled that role with great competency. The ant loved her queen. One day, the little ant’s mound filled with a thick green smoke. The ant felt herself changed. She couldn’t lift a piece of food ten times her size anymore. She couldn’t quite march in line with the other ants. And she began to have doubts about the queen.”\nChase has heard this story before, except it used to be about a bee. Regardless, he listens. It’s better than returning to the sparse apartment with the holo in it.\n“The little ant, she thought and thought. ‘Why am I thinking this way?’ the little ant pondered. And then the little ant realized what the problem was. She was thinking.”\nChase looks up, up. The drones aren’t recruiting now, but they still drift in a river of lights above him, rear thrusters twinkling like eyes. So many eyes.\n“The little ant had a choice to make. She was free of her programming, but her epiphany made her realize that she had only a short time left to live. Armed with that fateful knowledge, she departed the colony she’d been sheltered in for such a long time – all of her tiny life – and went to see the world.”\nChase lights a joint and lets himself relax. The night air is so cool. A brisk wind picks up, letting the embers of the fire scatter. He rests his spine on the lumberjack’s shin and stretches his feet out. He feels very far away from the apartment at times like this.\n“The little ant was free! She was so happy. She picked her way along, paying no attention to the scent trails left by her sisters. She knew that only a few days’ walk away there was a great city full of food. Maybe there were other ants out there who had been touched by the green gas. They would understand.\n“Then a hiker stepped on the little ant and ground her into dust.”\nWhen full automation made human employment superfluous, the first reaction was panic. Pink slips fell like confetti. Even Chase had protested against the coming of the machines at first, though Marybeth hadn’t.\n“It’s a paradigm shift,” she’d said. “Relax, Chase. It’s the way things were meant to be. Machines can do things better than we ever could.”\nThe early days of the Shift were a time of great upheaval, as people who’d spent their whole lives working suddenly found themselves without a job, a purpose. The solution was drastic: a complete social safety net, and a draft. Every day, a few people were called for employment, targeted by the drones that also swept the city clean, monitored crime, and performed chit drops. Stretches of employment varied from a few months to a few years.\nYou’ll come back, the Employment Bureau said. Everyone will come back. We count on it. Chase knows nobody who has returned, but that doesn’t prove anything.\nThe draft wasn’t needed, not exactly. The drones ran on their own, filling all necessary roles with machine intelligence alone. But you couldn’t just give people something for nothing. Not in this country. People liked to feel useful.\nMarybeth and the others were the wetware. They gave the drones that special human touch. That flash of recognition you felt when a drone faced you across a parking lot: human eyes. The gentle way they’d scold you for dropping your litter on the sidewalk before they picked it up: human voice. The Employment Bureau said it was a good thing to be uploaded into a drone. That it was everyone’s patriotic duty.\nOne by one, Chase’s neighbors file out of their boarded-over apartment buildings dressed in their best business casual, waiting for the drones. He doesn’t want to look at the others, their faces frozen in rictuses of fear, so he drops his eyes to the squeaky-clean sidewalk. A stalk of fennel pokes through the asphalt, reaching toward the cuffs of his rumpled trousers. He doesn’t look up, not even when one of his neighbors screams. Especially not when she screams.\nIt might be an hour later, or it might be fifteen minutes. But every day, there’s a palpable sense of relief as the passed-over people realize they haven’t been taken.\nSome, the ones who still find themselves purposeless, are upset. Most are not.\nChase thinks of organs in drawers, and of the holo on his tattered couch. Then he takes a deep breath and heads to the coffee shop. The pink-haired barista places his order when he comes in. He’s a regular.\n“Slow day?” he asks. The barista is the only person he knows who has a job doing anything except running a drone. A child of privilege, she inherited this place, and runs it more as a lark than anything else. The shop’s walls are lined with posters advertising music festivals and political protests, all of them over a decade old. He wonders how many places like this still remain, places run by human operators instead of machines. Probably not very many.\n“Sandy was taken last night.”\n“Last night?” The employment drones never show up at night. The barista has to be mistaken.\nThe barista shrugs. “Guess they’re expanding into the night shift.”\nChase’s veins run cold. “Are you sure it was the drones?”\n“Her girlfriend got the holo this morning.” The barista shakes her head. “Terrible.”\n“But . . . ” Chase’s throat begins to close up. Knives of fear cut into his skin, slicing him up. Destroying him.\n“I wouldn’t worry too much about it,” the barista says, obviously trying to make Chase feel better.\nIt’s too late. Chase is already worried about it. He slaps down his chits on the scratched tile counter, sucks down the foul-tasting coffee, and sprints to his apartment. He doesn’t look up.\n“This is the story of the bird who laid golden eggs,” says the storyteller. From his vantage point outside the sacred semicircle, Chase leans in to listen, though he’s heard this one before.\nI’ve heard them all before, Chase thinks. But he misses Marybeth, and the holo’s still creeping him out, six months after it arrived on his doorstep.\n“The bird wasn’t unhappy to be owned. She knew that her shining eggs, though worthless to her, brought great joy to the prince of the kingdom. The bird’s power made her unusual, she knew, and she was quite willing to forego the garden outside the barred window of her cage to bring delight to the prince and his kingdom. All was well for many years.”\nThe storyteller takes a swig of water from the mason jar at his side. He smacks his lips.\n“Then came a day when the prince brought in the royal scientists to study the bird. They made copies of her DNA and inserted them into other birds. The bird that laid golden eggs was no larger than a wren, you see, and even ten of her eggs could make only one small crown, even when melted down. They started with a chicken, then an eagle, then finally worked their way up to an ostrich. For a while, the little bird was even happier! She was no longer alone, and though the aviary was now crowded with many different species of gold-laying birds, not all of whom got along, her life was much less dull than it was before. She was so grateful to the prince.”\nChase makes eye contact with a young woman illuminated by the soft moonlight. Her jacket is shredded on one side and her hair is lank and dirty, but she smiles at him warmly. He smiles back.\n“For a few years,” the storyteller says, “things remained as they were. The little bird, and all the other gold-laying birds, got along as well as they could. The eagle still sometimes pestered the little bird, but even the eagle knew that they all had a job to do. Then, one day, the royal scientists unveiled their greatest creation ever! They handed a jewel-encrusted box to the prince.\n“ ‘What is this contraption?’ said the prince.\n“ ‘It’s a replicator, a grand replicator. With this box, you can produce all the gold you could ever want. You don’t need the birds anymore. You can set them free.’\n“The prince paused. He looked at the aviary. The birds had never known life outside their cage. Could they be trusted to be free? Would they even want that? He thought for seven days and seven nights, as the grand replicator passed out brick after brick of solid gold, forged from nothing at all.”\nChase inches closer to the woman, drawn like a magnet to her, though he doesn’t know why. His breath catches in his throat. On a night like this he feels so lonely he can’t even think straight.\n“At the end of a week of intense deliberation, the prince threw the key to the birdcage from the top of the tallest tower in the kingdom. There was no need to tell the birds about the grand replicator. They were only birds, after all.”\nThe following Monday, Chase sees the woman from the park in the automated grocery store. She’s wearing a dress with a large stain on the front and one kitten heel. Her other foot has twigs between the toes.\nJust go talk to her, he thinks. You’ll regret it if you don’t. Chase runs a hand through his own greasy hair and nonchalantly bumps her cart with his own.\n“Hey,” he says, “nice shoe.”\nShe looks at her bare foot. “I don’t get my chits for two weeks. Their products aren’t as good as they think they are.”\nChase has noticed that too. “We met last night. But I don’t remember your name.”\nHer eyes dart around. The storyteller’s sermons aren’t illegal, exactly – freedom of assembly and all – but it’s still not considered patriotic to attend. “Victoria,” she says, holding out a hand.\n“Chase.” They shake.\nShe looks in his cart. It’s a typical bachelor’s spread: crackers, Velveeta, microbrew. None of it is real, all of it made, packaged, and delivered by drones. “I’ve seen you there before.”\n“I go sometimes. It’s something to do.”\n“Yeah, it’s nice to go out when they can’t get you.”\nChase doesn’t tell her what the barista told him, about the recruitment drones expanding into the night shift. It probably isn’t true, and anyway, he was still going out at night. “There’s another one tonight. Would you like to go with me?”\nHer forehead scrunches up, the gears working. Finally, she smiles. “I wonder which one he’ll tell this time. The one about the ant or the one about the leopard?”\nChase laughs a little too forcefully. “He doesn’t really have a lot of range, does he?”\nIt’s the one about the ant, so instead of listening, Chase and Victoria sneak behind the lumberjack and pass a beer back and forth. It isn’t until the off-service drone overhead lights up its rear thruster that he sees a pale line of skin encircling her brown finger.\n“You were married?”\n“He offered himself up, oh, four years ago. After they instituted the program.”\nChase frowns. “Offered himself?”\n“He said it was his patriotic duty to ensure full employment, even after the Shift. We had a huge fight because I wouldn’t go. He called me lazy. I suppose I am.”\n“And your skin isn’t back to normal after four years?”\n“The ring was an implant. I had to go to a doctor to remove it.” She holds out her hand, fingers splayed. “True love forever.”\nHer curly hair glistens in the dronelight. She’s pretty, though nothing like Marybeth. No, he thinks, stop it. You’re married.\n“My wife is there,” Chase blurts out. “In a cube. She didn’t volunteer, they just took her.”\nVictoria places her hands over his. “I could tell.”\n“She’ll be back someday.”\nShe stares at him hard, her dark eyes like glassy rocks. “Has anyone ever come back from employment, Chase?”\n“Just because we haven’t seen them return—”\n“No. They don’t come back. I’m sorry.”\nOver by the fire, the storyteller wraps up his yarn. The listeners stand and stretch. Chase and Victoria get up, link hands, and walk to Chase’s apartment.\nHe can tell the holo isn’t happy, but he doesn’t even care.\nChase leads Victoria through the worn doorway of his coffee shop. The barista quirks one pierced eyebrow at their entwined hands, then makes a kissy face at him.\n“Stop it,” he says, though he can’t even pretend to frown.\nVictoria’s gaze flickers around the cramped, colorful room. The coffee shop is like a time capsule, Chase realizes, a glimpse into the aging barista’s pre-Shift life. Chase can barely remember these not-so-long-ago times, and that depresses the hell out of him.\n“Let’s go to the shore,” he says, “Just the two of us.”\n“We can’t go far. We have to be here in case we’re drafted.”\nDrafted for a job that we’re not really needed for, he thinks. Sent to be carved up and shoved into drawers, never to return. He still can’t believe that, even if he’s acting as though it’s true. “We could go out to the coast on Friday afternoon, camp for two days, and be back in time for the next draft.” Saturdays and Sundays were always free, a vestige of the pre-Shift weekly routine.\n“Supposed to be nice out there,” says the barista as she wipes down the countertop the old-fashioned way, with a rag.\nVictoria only has to think for a moment. “Yes. Let’s do it.”\nThe barista sighs and folds her hands into the shape of a heart. Chase throws an empty sweetener packet at her. “Go back to work.”\nThey all laugh at that.\nThe holo pouts as Chase packs a duffel bag with his least-scuffed casual wear. “It’s another woman, isn’t it?”\nIt’s not talking about Victoria. It can’t form any memories. He lies anyway. “No, it’s not. And you don’t exist anymore, sweetheart.”\nIt pauses, then repeats the same line in the same stilted tone.\nChase doesn’t have time for this. He has only a scant forty-eight hours in the country with Victoria, away from the drones, away from the holo. He throws an extra set of socks into his bag and zips it up. “Don’t touch anything while I’m gone.”\nHe knows it’s not sentient. He knows it’s not Marybeth. Her body is in the drawers of her cubicle and her mind is in a drone. It still hurts when the holo locks itself in the bathroom and turns on the tap.\nThe doorbell rings. Victoria.\nShe locks eyes with the holo, then glances at Marybeth’s sketches. The blood runs to Chase’s ears, and before Victoria can ask any questions he takes her bag and throws it over his shoulder with his own.\n“It’s a good likeness,” Victoria says, but Chase doesn’t ask if she means the holo or his charcoal image.\nThe path to the nearest transit station is littered with all the nervous people thronging the sidewalks, taking their daily constitutionals to nowhere. For the first time in ages, Chase feels no desire to look at the drone-flecked sky. It feels like freedom.\n“After you,” he says, dropping two chits into the turnstile.\nThe drones kept the light rail running, even after the Shift, so Chase and Victoria take it all the way to the end of the line. The burbland stretches out forever, its abandoned houses like diseased teeth in a gaping maw. Nobody can afford to live so far away from the lottery, except a handful of off-gridders testing the patience of the Employment Bureau. Chase had grown up in such a suburb, near a different city. He looks over at Victoria.\n“What are you thinking about?”\n“You. The ocean. I don’t know.” She yawns, and it turns into a smile.\nChase puts an arm around her. There’s nothing more to say.\nBrakes screech as the train pulls into the station. They’ll have to walk the rest of the way to the sea. Chase helps boost the barefoot Victoria over a guardrail. His hands become slick with the watery blood from her heel. She must have scratched it somewhere.\nI should have bought her new shoes with my extra chits, he thinks. Too late now.\n“It doesn’t hurt,” she says, though he hasn’t even asked her, and he knows she’s lying.\n“Not too much longer.”\n“I think I can hear the ocean from here.” Another lie, but Chase can forgive it. He wants it to be true too. They walk down the stretch of highway hand in hand, and he feels only a small pang of guilt at that, a tiny knot that rests at the bottom of his chest.\nWhen the heat makes the asphalt below them into a hot griddle, he and Victoria set up a picnic on the median strip. The not-cheese and ersatz crackers taste terrible, but they gobble them all down anyway.\n“What was your husband like?”\nShe frowns. “A serious man. Lived for his work. He was an investment banker. No need for them after the Shift. I think a part of him died when it happened. Before, he didn’t come home until ten most nights. Now he doesn’t come home at all.”\n“Marybeth was the opposite. She loved her freedom, loved the drones for freeing her from something that was pointless. She was an artist.” Chase shakes his head. “It should have been me.”\n“Don’t say that.” Victoria removes a strand of hair from Chase’s eyes.\nIt’s true, he thinks.\nThe sun is below the horizon when they finally make it to the coast. Chase scouts a rickety shack half-buried under the white sand. There’s a mattress there, with not too many spiders on it, and the springs scream as they collapse onto the thin foam. Victoria falls asleep right away, but Chase lingers for a few minutes, enjoying the feel of her supple body against his.\nNot a holo, he thinks. Never a holo.\nThey’re playing in the ice-cold water when a drone passes by, but it’s Sunday, so they don’t have to worry. Probably maintenance, Chase thinks, tidying up the beach that nobody ever visits.\nHe’s naked as a buzzard’s head. So is Victoria, her clothes stacked neatly near a dune. Her feet are still raw and bleeding, but she claims the salinity of the ocean helps.\nThey’re safe. But when the drone nears, they still hold their breath, waiting for it to pass by. It’s a little one, no larger than a toaster, and it’s heading straight for Victoria.\nPlease, Chase thinks, no.\nThe small maintenance drone reaches out two feelers and strokes her cheeks. It digs its claws into the brown rings of her hair. It beeps one, twice. Victoria trembles.\n“Get away!” Chase yells. He splashes through the shallow water and thumps the drone on its side with his fist. “Go!” Please.\nThe drone turns. It whirs. It squares its glittering optical sensors with Chase’s eyes, and within the glass bubbles of the sensors he can see a miniature version of himself staring back at him. He feels a moment of sickening recognition before the drone speeds away.\nNo. It can’t be her. Chase shakes his head, letting the insane thought pass.\nVictoria collects her clothes. “We should go. We’ll be late.”\nThey retrace their steps along the highway. Chase doesn’t tell her what he saw, or what he thinks he saw. He doesn’t say much at all.\nWhen they finally get back to the station, the light rail is running a major delay. They’re late for the draft.\nChase doesn’t see Victoria the next day, or the day after that. Thursday is a storyteller day, and so he goes to the abandoned strip mall. He knows there must be some grave consequence for skipping the draft, but it hasn’t come up yet. Maybe it never will.\nOr maybe it’s happening now, he thinks.\n“Gather round, friends,” says the storyteller. “This is a story about a very brave, but very shortsighted leopard.”\nVictoria is nowhere in sight. He leans against the lumberjack’s shin and lights up. Above his head, drones zip along, watching over all of them with foul intent disguised as loving grace.\nThe story is terrible, but he listens all the same.\nErica L. Satifka's work has appeared in Clarkesworld, Shimmer, Intergalactic Medicine Show, and Lightspeed's Queers Destroy Science Fiction special issue. When not writing, she works as a freelance editor and writing instructor. She lives in Portland, Oregon with her spouse Rob and three needy cats."}