{"fingerprint": "xNi4QjnJ3Q62Sa6XKOEbxLTtCdE=", "sitename": "Clarkesworld Magazine", "title": "Sephine and the Leviathan by Jack Schouten", "author": "Jack Schouten", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/schouten_07_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sephine and the Leviathan by Jack Schouten", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "14070 words, novelette\nSephine and the Leviathan\nCHAPTER 3/6: TRAJECTORY\nEntombed inside the cannibalized q-cannon, Sephine counts pebbles in her mind. She has had to wrap her filament wings around her to fit inside the narrow cylinder, and when the cannon begins its countdown, starts to rumble, claustrophobia sets in.\nShe reaches sixty-seven pebbles before she feels her wings quiver sharply once, and a sharp pain in her back.– We have a problem, the Vierendelen sends.\n“Fix it then!” she screams aloud, though this doesn’t matter; the ship will still hear her.\n– No time, toots. Grin and bear it, and all that.\n“Toots?” is all she can manage, before there is a violent lurch and her head slams against the cool metal of the inner shuttle. She floods her brain with painkillers and becomes dizzy.\n“Is it the cannon?”\n– Cannon’s fine.\n“Ah, silver linings . . . ”\n– It’s your filament wings. I don’t think you’ll be taking them on the return trip.\nAs if there was any guarantee of a return trip, she thinks.\n– They may not even last the journey up to the Leviathan. That bastard engineer made a mistake. I told him I should have supervised.\n“Forget about the wings, will I make it?”\n– Calculating, it says, and Sephine feels the ship disconnect.\nShe Enlinks in the meantime and performs a quick systems check. The Vierendelen was right; her filament wings aren’t secured properly to her spinal cord and are coming loose under the building turbulence. She tentatively dilutes the painkillers from her neuroweb. Her head throbs from the knock against the shuttle wall, but the burning pain in her back is infinitely worse; it feels like her spine is being extracted from her like loose teeth, one vertebrae at a time.\nShe ups the painkillers and Delinks.\nSeven seconds. Finally the Vierendelen re-establishes connection.\n– I have an idea, but you aren’t going to like it.\n“I didn’t expect to.”\n– I’m going to delay your ejection from the shuttle. Just an extra minute or so will give me time to find a temporary fix so we can keep those wings from killing you mid-flight to the Leviathan. It’s going to get hot in there though. Really hot. And my wing-tinkering’s going to hurt, but the higher we eject, the shorter the distance to the target. What do you think?\nOne second.\n“Do we have a choice?”\n– None whatsoever.\nThe q-cannon fires. Sephine is almost crumpled by the g-force, pressed into the floor of the shuttle as it erupts from the cannon—even the shuttle’s inches-thick shell can’t dull the noise of the blast. Sephine’s stomach pitches with the velocity, and despite herself she steals a glance through the viewing pane.\nShe can see the scrubland surrounding the launchpad, smoke and fire bulging beneath and blocking it out; and the smattering of black dots that are people watching the q-cannon blast her into the sky.\nShe convulses as the shuttle vibrates, battered around it like a ragdoll, and she considers tightening the embrace of her wings to cushion herself against the shuttle walls, but something tells her that would only make the wing problem worse—and the pain.\n– Done, the Vierendelen says. – That engineer. Can’t even encode failsafes in his own hardware. Too easy overriding the ejection protocols.\n“Show-off,” she manages, through chattering teeth.\n– Okay: here we go.\nThe world shrinks beneath her, suddenly—ironically —unfamiliar. Soon all she can see is desert, dun mesas and bronze and swathes of bright gold. She can see a cross-hatched smudge, the half-city of New Leseum; the four towers of Pod Country; the mighty, battered hulk of the warship Vierendelen beyond, casting its long shadow over the rippling dunes.\nAnd she can see something else, too: the familiar, massive shadow of the Leviathan, where she is to find her brother.\nThe air becomes suffocating inside the shuttle. Unable to guess the trajectory without Enlinking, she puts her trust in the Vierendelen to guide her to the Leviathan’s edge.\nHeat builds. Sweat beads on her forehead, her chest. She commits her neuroweb’s resources to lowering her body temperature, and feels icy coolant spread through her body from the nape of her neck, but it’s too slow to counter the rising heat. Her eyes seem fit to rattle from their sockets.\nThen, finally:\n– We’ve reached the original ejection point. Less than a minute to go. All right in there?\n“S-smashing.”\n– Brace yourself. This is going to hurt.\nWhite-hot hooks in her spine. The pain is startling. With a guttural screech Sephine gives up and Enlinks to the Vierendelen’s data corpus. She sees the shuttle in four dimensions, watches time ebb and flow like the flourish of a gymnast’s ribbon. And yet the pain permeates still, even in this new, abstract viewpoint.\nShe hones in on the careening shuttle, then herself—a jittering skeleton inside—and then her spine.\nThe roots of her wings are changing: the Vierendelen is adjusting the mechanisms that latch them to her spinal cord.\n– Delink! the Vierendelen screams in her head, with a far-away quality, like it’s yelling at her across a cathedral. – Delink now!\n“Can’t,” she sends. “ . . . Hurts.”\n– Grin and bear it! Do it now!\nWith just under a second to ejection, she manages it.\nBack in normal-subjective spacetime, Sephine feels the wings find purchase in her spine, and the pain increases to the point that it becomes a hallucinogen—searing colored blades dance in her vision.\nAnd from somewhere far away, laced with the pain, it seems:\n– Ejecting.\nLight blossoms. Noise dies. Sephine becomes lucid. The gunmetal backdrop falls away, and she erupts from the shuttle’s exposed head streamlined and spinning slowly, high above the desert. Then a dark bowled shape fills her vision.\nThe Leviathan’s iron skin is lined with slits and trenches, from which protrude clusters of black bristles, each a vicious arsenal. The Leviathan is a floating war machine.\nIt’s only then that Sephine realizes how huge it is.\n– Deploy your wings. It won’t hurt anymore, I promise.\nIt doesn’t.\nHer wings unfurl with delicate snapping sounds. The charged atoms in their filaments crackle as she spirals skyward. Control is as intuitive as the use of limbs—one hard push and the wings ripple and pulse and pull her higher.\nThen the Leviathan attacks.\n– Trouble. Down to you now, evade.\nPlasma fire. The defense systems have spotted her. She evades a flurry of blue-white projectiles, looping through the sky, up and up and around, and for a fleeting moment she forgets she is under fire—she is enjoying herself.\n– No time for showing off, just get to the Leviathan!\nA plasma needle screams past her head, igniting the air in its slipstream. With all her might she pushes the wings down, sending her careening upwards, finally over the Leviathan’s rim, and she sees for the first time what lies atop the structure. It terrifies her.\nShe has no time to focus—the wings feel like they’re giving up just as she penetrates the Leviathan’s defensive parameters.\n– Oh, shit.\nThe wings burst into flames. She pumps them as hard can, going down now, towards the very edge of the Leviathan. She feels tongues of fire lick at her back. Each roaring push of her wings wafts smoke into her eyes and nose and her throat.\n– Almost there. Dive!\nThe speed of the maneuver fans the flames roaring around her ears. Just as she feels the wings disintegrate and pain tear up and down her spine she tucks in, and for a moment she is a human fireball, shedding smoking strips of filament and fabric. Then she slams onto the ground—painkillers and inertia stabilizers coursing through her—and rolls.\nIt’s over. Sephine lies awkwardly on her back. Her wings are nothing more than winter trees now: gnarled black branches loosely rooted in her spine. They whisper as they dissolve, causing her pain.\n– Well! Wasn’t so hard, was it?\n“Shit,” she breathes. Her skin burns and her clothes are ruined. There is the acrid smell of burning hair. “We made it.”\n– Good job. When you Enlinked back there I thought we were done.\n“We?” she sends. “You’ll be alright; it’s me who was almost done.”\n– Fair point.\n“Oh, and Del?”\n– Yes?\n“Never call me ‘toots’ again.”\nCHAPTER 2/6: SPITE\nSephine is in the Vierendelen. The people of New Leseum have taken to calling it a fortress, though she disagrees. To her, it is just the Vierendelen: a kilometer-long gigaton of ruined hulls, bulkheads, and fuselage that was once a Golem-Class Leseum warship. (Although, she supposes it does look a little like a fortress, buried nose-down in the desert like this, towering over the fledgling city.)\nSephine is Enlinked and playing Spite with the ship. She and its AI battle each other with strings of code, constructed to entangle with and destroy one another. Mutually assured destruction is impossible—each battle ends with a winner.\n“I know what you’re doing,” Sephine says, chancing a risky gambit. Against such a vastly intelligent machine as the Vierendelen, anybody would assume the game a forgone conclusion, that each game would end in a crushing defeat for her human mind—but the ship is being coy.\nSephine’s gambit pays off, corrupting the Vierendelen’s code string and leaving it in an irreversible Spite. She’s won the game.\n– Nice move.\n“Don’t patronize me. You’re playing Rokri’s tactics.”\n– Is he that transparent?\nIn real space, Sephine scowls—Enlinked, she has no face; just code. “He certainly was.”\nShe Delinks, opening her eyes back in real space.\n– You’re so sure, aren’t you? the ship continues.\n“It’s been a year, Del. I know my brother. He’d be more straightforward than this. More . . . ”\n– Transparent?\nSephine nods.\n– But you’re so keen to accept he’s dead, and now there’s just a sliver of hope and you’re all too ready to abandon it. There’s all kinds of things you’re not taking into account.\n“Hope?” she spits. “Hope? An encrypted signal we can do nothing with is not hope, Del. And it certainly isn’t from Rokri, either. It’s from the enemy, and I think you know it too.” She bites her fingernails. “He was a fool to go.”\nDusty light cascades down into the atrium, cut by the sharp outlines of metal arcing high above: bones of the gutted ship. Sephine can hear the low thrum of esoteric machines deep within what is left of the Vierendelen’s hull. Although the ship’s AI has no centralized structure (its consciousness runs through the few substrates that still receive power from the engines), it has a tendency to manifest itself as a collared dove. At this moment, the Vierendelen is perched on a high bulkhead overlooking the atrium, mussing its iridescent wings and cooing softly.\n– Sephine. If this message, signal—whatever—if it is from Rokri, then wouldn’t he want a reply?\n“You said yourself, we have no decryption software capable of sending a message back.”\n– Correct. But I wasn’t just thinking of sending a message.\nJust the thought opens a pit in her stomach. She knows what the ship means: go up there. Go to the Leviathan and search for him.\n“It’s not as simple as that.”\n– Getting him up there was.\n“It was suicide, and selfish,” she snaps. “We needed him. I needed him.” Sephine wanders over to a rockery on the far side of the atrium. A stream gurgles gently into a clear pond, where lilies reach through the surface. Mechanical fish flit amongst their roots.\nSephine sits down and takes a handful of pebbles, tossing them absent-mindedly into the pool. The fish dart away.\nA low rumble goes through the ground. The lilies stir.\n– Fissure bombs in the Farside Basin. I’d better check it out.\n“The attacks are getting closer,” Sephine says darkly.\n– Not if I have anything to do with it. And I always have something to do with it.\nSephine imagines the ship winking at her.\n– Hive minds are as easy to fool as human ones. Catch up later. And think about it.\nThen she feels the disconnectedness as the Vierendelen severs its connection with her neuroweb. The collared dove effervesces from existence.\nSephine is alone with her thoughts and grateful for it, but she’s incapable of staying idle for long. She scatters another handful of pebbles over the pond, sits down on the gravel, and Enlinks.\nThe ship’s data corpus presents her with a wireframe view of the gutted hull, where bulkheads and metal ribs and drooping, limb-thick wires dangle together in four dimensions. She withdraws from this and views the Vierendelen in its entirety.\nTracker drones pour from the ship in droves. She adopts the viewpoint of one of the rugged little machines as it speeds across the desert to a deep crater about fifty kilometers away.\nThe bladeships of the Fractured are peppering the Farside Basin with bombs. Scavenger craft swoop into the fray, grabbers swinging from their hulls to pluck huge rocks left by the explosions. The ships contain no biological life-forms, and nobody has any idea why the Fractured harvest bedrock like this.\nThis is the closest attack to the city in months. If the Fractured decided to invade, New Leseum would be dust in minutes. The people have a militia but are armed with nothing more than splinter-rifles and fists, protected by antique exoskels found in what was left of the Vierendelen’s armories. In the event of an attack, they may be able to cannibalize some weapons from the ship itself—put up a little fight—but there aren’t any guarantees.\nIn any case, the Fractured never seem to be interested. Perhaps they have no appetite for easy game—\n“ . . . Oh.”\nAn idea strikes her like a needlehead.\nShe abandons the tracker drones, pulls her view back to the city, and delves into the Vierendelen’s storage substrates.\nShe extracts memories. They appear to her as a compartmentalized ocean of data-packets.\nShe accesses the message received from the Leviathan a week earlier: a convoluted jumble of code, encrypted and inaccessible without figuring out how to untie the chaos and lay the information streams into straight lines.\nAnd as she examines it again, there is suddenly a way, a technique to unlocking the message. All knots are untied in different ways—some require no more than a pull. Others demand multitasking and organization, planning and backtracking: a strategy.\nAnd she recognizes the strategy.\nIt’s a Spite algorithm.\nHer heart beats a tattoo in her chest. Could it be this simple?\nShe puts the message itself to one side, and brings up the most recent memory in the Vierendelen’s library: their game of Spite.\nShe deconstructs it.\nEach strand of unique code in a game of Spite is the result of an algorithm, a protocol of unique characters that must be disrupted in order to win. The algorithm with which the ship used against her—as Sephine guessed earlier—is identical to that which Rokri used to play.\nSephine inputs the algorithm as a passcode for the message.\nAnd the knot responds. Data twitches, rearranges itself, and the message is laid out flat.\nThat means one thing: Rokri is alive.\nSephine Delinks and runs from the atrium, to find the Makers.\n“We have several options here,” says Maker Lupin.\nNew Leseum’s chief engineer is a thoughtful man and of few words—except when his pride is dented. The Vierendelen finds him pompous, which Sephine thinks is a rather facile observation coming from a machine of its intelligence.\nSephine is de facto leader of the Makers, the seven charged with building the city. She is a go-between for the Makers and the ship because she is the only one that possesses a neuroweb. They’d never admit it, but Sephine thinks the Makers are somewhat jealous of the technology she and her brother have laced into their brains. Through it they have the potential to wield a large amount of power over the citizens of New Leseum—but they know that power would never be exercised. They all there for a common purpose: to build the new home.\nThe Makers and Sephine are sat around a dull steel table, in the committee building in the northwest corner of the city. Moonlight sails in wisps through the glass ceiling, and orange plasma torches in shallow sconces provide extra light. Bowls of broth make the air thick with the smell of vegetables, though Sephine isn’t hungry.\nLupin continues.\n“We could try to establish contact,” he says, stroking his thinly bearded chin.\n– He knows how many times I’ve tried that, the Vierendelen says.\nSephine interjects. “That’s hopeless. Plus, the message is empty. The key to the message is the message. Rokri is trying to contact me. The ship lost contact with him after the Leviathan last passed over. I think . . . ” She pauses, biting a fingernail, “I think he’s found a way to reach us, and he’s asking for help.”\n“We have to realize sending a message might draw unwanted attention,” Maker Gelgher says, the brow below his bald head wrinkled into a reflective frown. “Or, this is a trap.”\n“A Fractured fleet attacked the Farside Basin not a few hours ago. I know I’d rather not risk it.” Lupin adopts a sage expression.\n“But if the Fractured were to attack, they’d have done it by now.”\n– Here we go . . .\n“I doesn’t matter, Gelgher. We can’t risk the city.”\n“We live in risk—”\n“I’m going up.” Sephine says, with exasperated conviction. “I’m going to the Leviathan.”\n– That’s the spirit.\nShe doesn’t wait for the stunned Makers to reply, and leaves them to battle it out.\nThe Makers debate without her for four interminable days, during which Sephine spends hours out at Pod Country, thinking, watching the horizon from the towers, like Rokri had done this time a year earlier. A dark shape blots the distant clouds: the Leviathan making its annual pass. Time is running out.\nThe Vierendelen has responded to Sephine’s wish with alacrity, and on the fifth day has something it wants to show her, so it summons her back to the atrium.\nThe ship presents her with what looks like a blueprint for a pair of wings. Together they span about ten feet, and will be made of a malleable, fibrous compound separated into filaments, which the ship tells her has been salvaged from a previously unknown store of exotic materials used in the war.\n– Thought these might help. When Rokri went up, I thought afterwards if he’d just had some extra oomph, it would have been less hairy. Anyway, if they approve of you going up—not that it matters either way—then I want you and me to supervise him making these babies. There’s no room for error.\nSephine scoffs. “Good luck with that.”\nShe examines the wings. It appears they will attach themselves to her spine with thousands of tiny hooks. “They look painful—but beautiful,” she adds hastily (the ship is a proud creature).\n– Oh, pish. I’m sure the infirmary can spare some anesthetic. Failing that you can Enlink and I can tinker with your web, but I’d rather the former—less risk. You know what I mean.\nSephine knows exactly what it means, and agrees.\nDelinking, Sephine is surprised to find a woman standing by the nearby rockery, flicking pebbles into the pool.\n“Maker Sensra,” Sephine says, and takes a step towards her.\nThe Maker does not reply at first.\nSensra was an architect back in Leseum Blue, and is the Maker in charge of city planning. She is in her mid-forties, and wears her hair in a short, choppy cut.\n“We took a vote,” Sensra says eventually. “I voted against, just to let you know. But in the end, I was the only one.” She flashes Sephine a brief look of resentment. Sephine ignores her.\n“The Leviathan is making a pass in the next two days. Can we be ready by then?”\nSensra makes a scoffing noise. “You got your arrogance from your mother—but at least she had foresight. What happens if you don’t come back either, hmm? What then for the rest of us? Stuck here? On this gods-forsaken rock, bait for the Fractured?”\nSephine is saddened by the Maker’s viciousness, but really it just makes her more resolute.\n“Well, I will come back. He’s alive up there, Sensra, and I’m going to find him. There could be anything up there. Maybe even . . . maybe a way home.”\nSensra turns on her heel and mutters, “Fool.”\nSephine tries not to betray her frustration, but can’t help it, and kicks at the ground. A flurry of pebbles arcs through the air and rains down onto the pool.\nAs Sensra goes to leave, she turns her head and says, “The cannon will be ready tomorrow. If you do find Rokri, then . . . ” she hesitates, then stops short and slips out the door.\nSephine frowns.\n“Er, Del? What cannon? What did she mean by that?”\n– Ah. About that.\nCHAPTER 1/6: DOWN\nThe day the ship was downed its human cargo went to Pod Country.\nIt took just a few well-timed q-missiles from the Fractured fleet; the effect of the shots was like blowing up the two nearside tires of a vehicle as it powered along a tilted highway.\nThe Vierendelen had been hugging the planet’s gravity well, pouring its energy into staying poised on its edge. Its plan was to catch the oncoming Fractured off-guard, meet it head-on, slalom through the myriad ships, and escape into deeper space, where it could ‘fold and escape back to Leseum Blue.\nThe feint failed. The q-missile burst hit as it encountered the first line of nimble bladeships, and the Vierendelen tumbled into the pull of the gravity well. Apparently sure the crash would be fatal, the Fractured retreated and left the ship to its fate.\nBut while the ship set about rearranging much of its engine configurations, the crew on the Vierendelen’s command floor worked feverishly to level out the descent.\nEach knew they were about to die.\nBut that was nothing; it was the ship’s cargo that mattered: fifty thousand souls had made it safely to Pod Country before the skirmish, and the ship protected this massive complex of stasis modules with every resource available (– Trust me, it would take a hundred q-nukes to penetrate this baby, of which the Fractured have zip.).\nDeep within the belly of the ship, lockdowns took place. Giga-sized machines enfolded the massive network of amniotic sacs within an impenetrable womb.\nOn the command floor, the doomed few that remained all but ignored the rapidly approaching surface. With the help of the ship’s AI, they secured a location, an angle, a trajectory for the crash landing. And to their amazement, cloud-scanners revealed they were headed toward a flat, open plain of desert and scrubland.\nThe Commander thought, for a moment, I think we might actually make this . . . as the ship sunk through the cloud barrier, and the desert stared up at her with dusty indifference.\nBut they had never expected the dark shape that met them beneath the clouds. A menacing specter of a thing, the Commander likened it to diving into the sea, and encountering an impossibly large monster—a huge, black smudge in the haze of the lower atmosphere.\nAnd the monster’s reaction was quick.\nThe Vierendelen couldn’t act in time, and the object—which would be later referred to as the Leviathan—had locked onto the beleaguered ship and fired.\nThe Vierendelen registered a femtosecond of reluctant admiration: the Leviathan had fired a single needlehead at precisely the right place, up through an exhaust shaft and rupturing a crucial tangle of fuel injectors in its lower bow.\nThe Leviathan had known how much it would take to bring the ship down.\nThe Vierendelen—highly impressed with its attacker—tried to secure its own survival by hijacking a handful of Pods and flooding them with its data, and accepted defeat not ungracefully.\nBut just as the front engines reached critical mass, the ship received a deeply worrying piece of information.\nThe last thought that had gone through the Commander’s neuroweb was of her twelve-year-old children, the twins that would have one day taken the helm of the great ship. Just before the Vierendelen’s fuel injectors ignited, the Commander Enlinked, and with her last breath felt the ship create a neuroweb linkup—Sephine and Rokri were alive, in the womb of the ship. In Pod Country.\nRelieved, she died.\nBut the Vierendelen had had no time to tell her just what the Leviathan had done.\nIt has been six years.\nThe girl called Sephine awakens—from a dream about a room and a box, and a man and a bird—to find her brother gone from his bed. He has always been apt to wandering off (much to Maker Sensra’s chagrin) but never at night.\nIt’s four o’clock. She gets out of bed to look for him.\nLeaving their fairly ramshackle home in the shadow of the Vierendelen, she looks to the east, and sees the first veins of sunlight bleed over the horizon. The once-mighty warship is silhouetted against a pink dawn streaked with silver-edged clouds.\nShe looks up at the ship. As if reading her mind, she feels it connect—the handshake protocol feels like waking up all over again.\n– He’s over at Pod Country, if you were wondering.\nShe furrows her brow, tugs her coat around her against the chilly breeze, and sets off in the direction of Pod Country, beyond the wreck.\n“What’s he doing there?”\n– Thinking, I’ll bet. That queer pastime of the flesh . . .\n“What else is there to do, space-trash?”\n– Ouch.\nShe giggles and heads through the city.\nThe towering grids of Pod Country are the tallest structures in New Leseum (save for the Vierendelen itself), and comprises of four blocks twelve stories tall, each housing just under 12,500 dormant souls.\nAfter the ship crashed, a few thousand people had been resurrected: people with essential skills; leaders; the stronger menial workers; teachers; doctors; some scientists; architects; and a few military personnel, once it became apparent the planet was some sort of hub for Fractured activity. The ship had seen fit to resurrect a few hundred civilians too, to add some normality. These people had been traveling on the ship when war broke out—they had intended to transfer to another vessel once clear of Fractured space.\nSephine stands at the intersection between the four towers, above which the sky describes an azure cross.\nThe pods glow a bright cyan—it’s dark between the towers, but the stasis bubbles’ glow is comforting. The bodies inside are still and pale.\nFor a while she was jealous of them, lying in cold, blissful oblivion for these six years, some even longer. She wonders if they know anything of what has happened. Some soon will; the Vierendelen plans to awaken another clutch of people in the coming months because of the swift progress on the city—although it has said this since the beginning (perhaps it’s getting possessive of those already awake). Either way, it may soon have to—Fractured attacks are getting closer by the month, and defense may soon be needed.\nEnlinking, Sephine spies Rokri at the top of the tower to her right, lying on the circular platform capping the tower.\n“The hell is he doing up there . . . ?”\nShe makes her way up through a series of cross-hatched gantries and stairwells, her hand always gripping a railing—she’s uneasy with heights.\nShe finds Rokri lying with his hands behind his head. His dark hair is bed-messy and he’s wearing a fur-lined coat and his pajama bottoms.\nSephine giggles. “You look a right sight,” she says, and sits beside him. He appears deep in thought, though he’s not Enlinked; his eyes are their usual icy-gray.\n“That time of year again,” he says wearily.\nShe wonders what he means, then follows his gaze to the horizon, and feels a little swell of dread in her belly. She says nothing.\n“I’ve been thinking,” he says, in a tone Sephine can only describe as ominous.\n– Knew it!\nRokri sits up. The breeze ruffles his hair. “There’s an old flier I found. In one of Del’s old hangars.”\n“Rokri, I—”\n“And I think, with Lupin’s help, I could get it to work.” Now he turns to her.\nA year ago, probably to the day, he had looked up to the Leviathan and raged that it was all just so unfair. It was unfair that the war still went on far away, that they were stuck here with a crippled ship, unable to help, barely able to help themselves.\nHe wants to fight. Sephine does not—she just wants to go home.\n“I’m sick of it, Seph. Sick of building. Sick of boredom. I’m sick of all this fucking dust. But you know what’s worse? I’m sick of seeing that thing.” He jabs a finger towards the horizon. “Taunting us. Mocking us. Every signal blocked, every distress call. We’re hopeless as long as the Leviathan looks down on us.”\nEvery signal. Every distress call.\nNew Leseum is coldly, profoundly alone out here.\n“Rokri . . . ” Sephine begins, and struggles to find the words. “This flier—it won’t work. Del can’t even get tracker drones past—”\n“Those things are big, ancient, and clumsy. That’s the only reason they survived the crash.”\n“And how is a flier any different?”\n“A flier has an ejection system.” His eyes flash. “There’s no way the Leviathan could hit a target as small as a person, surely. And no one else is prepared to go. If I managed to get the flier high enough, get Lupin to make some . . . I don’t know, boosters or something I could wear, I think I could get there.”\nSuddenly he looks on the verge of tears. He’s rambling. “There’s answers up there, Seph. Maybe a way to bring it down, maybe Del could even harvest its engine, somehow. There might be a way home.”\nHe’s right. They have no ship, but the route to Leseum Blue lies within her and her brother. They don’t know them exactly, but the route lies encoded somewhere deep in their neurowebs, and even the Vierendelen can’t access them. Only they can. They protect their people’s secret, the responsibility Leseum placed upon their mother now split between them—a vulnerable failsafe made in the haste of war.\nWithout Sephine and Rokri, the people are doomed.\n“I won’t come with you,” Sephine says softly. “I won’t.”\nShe almost regrets having said that as the words meet the air. Rokri looks utterly crestfallen.\nThey sit in silence for a long time. The ribbons of morning eventually burst into full daylight, daylight blighted by a dark shape creeping along the sky.\nSephine wonders if Del is talking him into it. She knows full well the ship is keen to get up there—it probably told him about the flier in the first place.\nEventually, bereft of anything else to say, Sephine says, “Please don’t.”\nHe turns to her now, and she sees there is determination in his hard features. His eyes seem icier now, gleaming novae in olive skin. Sephine realizes she has reduced herself to outright begging, and feels ashamed.\nHe has made his decision.\nSephine hates him then. She hates him more than she’s hated anyone—but that’s not entirely true. She hates Del, too, for all the part it’s played in this.\nWhen the day comes, Sephine is nowhere to be seen. Her neuroweb has activated its privacy settings. Even Del can’t get through to her.\nHe feels like vomiting. The flier looks like a mashed-together tangle of components, its cockpit just identifiable: a carbuncle at the craft’s nose, and it’s large enough—just large enough—for one person.\nHe triggers a dose of anti-emetics for the nausea, and serotonin to keep him calm.\nThe Makers stand at the edge of the crowd that has gathered to watch. Some look excited, because they don’t know how important he is. Surely if they did, they would lock him and his sister away.\nBut most wear worried expressions.\nMaker Sensra looks like stone. She has always been a hard woman, stern with Rokri and Sephine, but protective—they are her late Commander’s children, after all. But more recently it’s seemed as if she’s drifted away from them. Rokri suspects it has to do with the coordinates in their ‘webs: knowing the way home lies somewhere in their heads but being completely unable to unlock them must be infuriating. Rokri knows the feeling—better than most, probably.\nHe tries to stop himself feeling angry at everything, to focus on the mission, on surviving.\n– I’m so sorry, but it really is time now.\nRokri nods, and lets out a humorless chuckle. “Thought we’d have time for one more game.”\n– Grief, what the hell made you think that would be a decent goodbye?\n“Come on, Del. Don’t tell me she’s bored of Spite.”\n– I don’t blame her! You let her win every time, I told you, if you want to win—\n“Shut it. Let’s go.”\nRokri loads into the flier. His hands shake violently as he fumbles with the control module, powering the engines up. Dust plumes around the little craft, its metal feet, while Rokri makes some final checks on the ejection system.\nIt all works fine. He doesn’t know how to feel about that.\nHigh above, the Leviathan has partially blocked the sun, and New Leseum sits in a counterfeit eclipse.\nSoon, he’s in the air. But he’s hovering over the crowd, hesitant. The Vierendelen warns him not to waste fuel, or power, but when he took off, Rokri had a final, acute yearning to see his sister one last time.\nThe ship is patient with him for as long as the mission will allow, but when she still doesn’t show, it insists they carry on.\nCrestfallen, Rokri powers up the thrusters, and the flier convulses around him, and carries him up to the Leviathan.\nJust before ejection, he looks down at the city, and wonders briefly what it feels like to die.\nShe’s missed him.\nShe had reached the back of the crowd just in time to see the little flier shoot upwards, carrying her brother away from her forever, and she collapsed onto the dusty desert floor in sobs, and when she Enlinks in a final plea to say goodbye, she cannot feel him anymore.\nAlmost a year later, the Vierendelen receives an encrypted communication from the Leviathan. Nobody can decipher it. Nobody can access it. But, for some reason Sephine cannot fathom, the Vierendelen is convinced it is from Rokri.\nCHAPTER 4/6: GROUNDED\nSeveral hours pass in peaks and troughs, phantasmagoric. Sephine folds through layers of suffering as the hooks of her wings dissolve one by one, each more painful than the last, each plunging her into paroxysms of agony. Whenever the pain fades it comes back stronger, and she seethes and arches her back and shakes all over, foamed saliva dried into a thick, white crust around her mouth. When the last hooks dissolve Sephine thinks she’s being fooled, cruelly lulled into security before the pain returns.\nBut it’s over. She sits up, very slowly, conscious of the dull throb up and down her back. At last, she can focus.\nShe is just a few feet from the Leviathan’s encircling edge-wall. She’s tall enough to peer over it, but she’s not sure she has the guts to.\nShe chances communicating with the Vierendelen. No response. She half expected this, but all the same is struck by a stark and singular loneliness. She can feel a very faint connection with the ship, but it is nothing more than background noise, static. She wonders if it can hear her, but can’t get through the Leviathan’s comms-blocking signal. It feels alien to have had a voice in her head her whole life, and now have nothing but silence. Her thoughts feel naked somehow.\nAnd all around her is nothing but silence too—silence, bar a faint wind that brings with it a sharp chill. Her clothes flutter, allowing the wind to creep in through the tears in the fabric to claw at her skin. She doses up on a little adrenaline to keep warm.\nShe turns from the edge-wall and looks up at what lies atop the Leviathan.\nClosest to her are two identical structures: square, black towers, perhaps thirty feet high, and both featureless. Though unsure as to why, she remembers some song she heard a long time ago (“Careful what you’re looking at; it might be looking back.”).\nAnd beyond these towers, there are hundreds more. The entire surface resembles a chaotic military installation, its instruments and structures organized in no discernible system whatsoever—but for some reason, she is reminded more of a city than a military outpost.\n(Her memories of Leseum Blue are vague because she was just six when her parents were called to arms against the Fractured, but she remembers spires of pure white and glass and steel, and immense trees spilling water from their leaves, spuming down an escarpment into the ocean in torrential, elegant rapids, and she remembers the smell of meats and herbs and bakeries from the market towns on the coast, and the blue of the sea, and she remembers riding finned juliprae over the surf with her brother and her father.)\nThis city is no city. This city is cold and featureless and black. It smells of nothing. There is no water. Her father is dead; her brother may not be. Sephine holds that thought close as she steps into the city that is no city.\nShe pads softly over the cold floor, past structures and buildings and instruments whose function she cannot fathom.\nEnlinking is just possible—but not to the Vierendelen. Instead her neuroweb builds a composite 3D map of the area which she can Enlink to, to better gauge her surroundings. She cannot see under the surface, even in X-ray. She can only imagine as to what is inside, below her.\nThe structures on the surface are varied and esoteric. She stands in the shadows of giant spinnakers, pentagonal dishes; walks past pens over whose walls she cannot see; chaotic things that must be machines but are completely dead; black, solid blocks, like the towers she first encountered. She notes that this is a common structure: black-body blocks, all varying in height and thickness. Some touch the clouds above, narrow as flagpoles—others are so broad and so stout she could walk over them. She doesn’t, fearing a trap, and so sticks to the unmarked, likely unintentional roads between the technological miscellany.\nHer neuroweb, scanning these black structures, tells her that all of them are hollow. At one point she walks through an alley between two of the structures, separated by mere feet, and she is sure she can hear a scuttling noise inside them, a buzzing. She thinks of insects.\nDusk comes with a cold, inexorable hand, and with it moisture to the air. The clouds have sunk in a patch of low pressure, and Sephine’s visibility is reduced to about fifty meters or so. The gaps between the structures become ghostly and animated with the quick mist.\nThe silence has become thicker, broken only by the faint ring of tinnitus—probably caused by the noise inside the q-cannon.\nThere is only one thought at the forefront of her mind: Where is Rokri? On the surface? Under it? Is he inside one of the black structures?\nIs he alive?\nThe nature of her commitment strikes her then. A year. If she’s lucky. A year before she passes over New Leseum again.\nShe clears her mind, relaxes herself with a touch of serotonin. And she begins to hum tunelessly. The sound of her humming is dull; there is no echo, no reverb. The clouds absorb it, like they absorb everything else, and suddenly she is reminded of the horror screens she used to watch with her brother on the Vierendelen, before the crash.\nShe scares herself and stops humming. And at that moment she is sure she sees something flit between two towers to her right. She stops dead.\nShe focuses on the narrow slit between the towers. Her heartbeat is the only thing she can hear. Nothing but mist creeps along beyond the gap.\nYou’re being hypersensitive, she tells herself. The mist is playing tricks on you.\nThat had to be it: clouds making movements in the gloom.\nShe can’t see more than twenty feet now. Structures more distant are just faint, towering ghosts. The feeling of being watched washes over her. Hastily she Enlinks, and confirms there are no life-forms nearby—no biological life-forms, at any rate.\nShe cannot combat the sinking feeling in her heart at what that implies: Rokri may not be here after all. Before the fingers of despair begin to throttle her, she presses on, hoping to reach the edge-wall and make camp for the night.\nNight falls swifter than expected. In the dark, she fingers the souped-up stunner clipped to her utility belt. At range it will administer a powerful shock—at point blank the weapon is deadly. She also checks her shelter is still where it’s supposed to be: a hyper-durable tent vacuum-sealed in a tiny, ceramic ball, swinging about her hip from the belt.\nShe decides to camp at the edge-wall. Walking in any direction across the Leviathan will bring her to the edge soon enough, and for some reason that seems safer, though she is not sure why. Perhaps if this is all some sort of trap, she can jump before she is killed. Better to go on her own terms than something else’s.\nIn the dark, she can’t see any more shapes slip through the gaps. But there is a ghostly glare about the place, a phosphorescence in the mist, and it takes her minute to figure out why.\nThe black structures—their edges are glowing. A neon filigree traces bright emerald lines through the mist, conjuring ghostly shapes waltzing in the breeze.\nBut there is something else about the towers now. Something she couldn’t see in daylight, but in the dark they stand out proud and frightening.\nNow they have doors.\nSephine stops her aimless wandering, and stands, biting her nails, at the foot of the nearest tower.\nThe towers must lead downwards. Into the belly of the Leviathan. The glowing outline of the door is both enticing and terrifying at once. Sephine looks at her feet, trying to sum up the courage to enter the tower, and spots something on the ground.\nIt’s a crude etching, scratched into the surface. An arrow, a gun. She looks back up at the door.\n“Del?” Hopeless. “Del, please speak to me.”\nShe takes a deep, quivering breath, and thumbs the stunner off the safety.\n“Okay,” she whispers. “You can do this.”\nAnd she reaches out to touch the door.\nThere is the oddest sensation in her brain, like inverted goose bumps. The panel makes a snicking noise, and withdraws with a loud hiss. Sephine jumps and takes a step back. A whirring starts beneath her feet. Slowly, the panel sinks into the floor, revealing a room beyond.\nThe room is dimly lit and warm. Lining the walls, neatly organized along racks, are row upon row of weapons. There must be over a hundred, all lethal and black and beastly beautiful. There are gaps—perhaps fifteen or so weapons are missing.\nExcited by the prospect of extra protection, she commands her neuroweb to check the weapons’ software—it’s up and running. All the guns are functional. She Enlinks to them, finds their operating manuals.\nThese are Fractured weapons; the manuals are in Vavaral, but are easily translated. She downloads them quickly and takes two guns: a plaspistol and a splinter-rifle. Both are light, elegant, easy to fire.\nIt occurs to her that it must have been Rokri that scratched the gun and the arrow at the foot of the tower. It’s a legend, a map icon signifying an armory. She’d been too preoccupied watching out for danger to bother scanning her surroundings more carefully.\nThe towers must all have different functions. If this tower isn’t a way under the surface, then another must be. And now it should be easy to identify—as long as Rokri was thorough with his mapmaking. Maybe she could find shelter inside. The thought of avoiding camping in the cold, no matter how insulating her tent is, is comforting. And perhaps there’s a control room. A map room. She could learn to control the Leviathan itself, guide it back—\nShe’s getting ahead of herself.\nIt appears her theory was correct: the Leviathan is a military installation. A surveillance outpost. Obviously a weapon in and of itself, too. But why? What are the Fractured protecting here? And where is the crew? Is it totally unmanned? It is unquestionably a Fractured-built machine—the weapons manuals in Vavaral, the fleets of bladeships and scavenger craft scouting the surface unfettered by the Leviathan confirm it—but what is its true function?\nWith a glimmer of hope, Sephine wonders if it is abandoned.\nShe hoists the rifle over her shoulder and slots the pistol into her belt, a little positivity growing within her, an impetus. She turns and looks determinedly into the mist, and sees—something. Something floating a little way off. Something like a grainy signal, static and fuzzy. It appears to be growing larger, becoming defined and more clear in the thick fog, and she thinks that it’s something she recognizes, and she feels the color drain from her cheeks when she realizes the ghost floating just feet from her is a face.\nHer face, writhing and warping and gunmetal-gray and ill-proportioned but she is looking at herself in the mist and a scream rises like bile in her throat—and the face screams back, its lips peel back and its empty mouth opens to nothing but the mist beyond and the sound is high and keening and thin but loud and those eyes are not eyes but the face is all eyes.\nIt’s a swarm, a hive-minded Fractured swarm of tiny drones, each no larger than a knuckle, gathered into a crude, twisted facsimile of her—just her face, floating and dotted with livid-red optical sensors.\nWhen her scream—and its—dies, Sephine fumbles frantically at her belt, searching for a weapon and praying it’s the plaspistol, and it’s up and pointed at the encroaching swarm in an instant. It’s the stunner. She groans and thumbs it to splash, and as the face opens its terrible mouth and advances even more quickly she fires.\nA wispy blue wave erupts from the muzzle of the stunner, and she watches her face quiver and disintegrate, melting away into a chaotic cloud of tumbling titanium marbles. The swarm collapses. The drones drum the floor like rain.\nSephine stares at the puddle of machines for a few moments, unable to control her breathing. The stunner is hot in her hand.\nShe’s slipping the stunner back onto her belt when one of the drones twitches. Then another.\nSoon the puddle of drones ripples like sheets in the wind, blinking red, and she runs.\nShe darts between towers and squeezes through tight alleys, swings around spires and jumps over low black blocks, and every time she looks back the swarm is in pursuit, no matter how many changes of direction, no matter how clever she thought her feints to be. With each corner the swarm disperses, and as it straightens out it consolidates back into that terrifying form, her image in the mist.\nSuddenly Sephine breaks out into an open space, an avenue between dead machines and towering spinnakers. She careens down the avenue. She can hear the swarm buzz close behind her, like a cloud of iron wasps whose hive she has disturbed.\nShe takes a sharp, sudden left, completely blind, and hopes she’s lost the swarm, but—\n– Sephine, get down!\n“Wha—”\n—she collides with some dark object, snapping her neck back, and she crumples to the floor with a sickened “Oomph!”.\nShe will barely remember later, but just before everything went black, there was a bright blue flash, and a figure appeared, standing over her. She had just one thought, and it seemed to mean nothing, but it went round and round her mind like flies to carrion: How do they know what I look like?\nAnd above and beyond the figure, she could have sworn she saw a bird, perched on a high tower.\nCHAPTER 5/6: OTHERS\nAwareness, or a glimmer of it. Just noise. Sephine doesn’t know what the noise is, but for some reason the word “bustling” comes to mind, and this scares her because it means she’s not alone, and she tries to open her eyes but they won’t respond so she slips back into—\nAwareness. Real. Sudden. Senses: verdant smell; metallic taste; head throbbing. Wherever she is, it’s warm. This time her eyes work. She feels their lids flutter, sticky with sleep, and she manages to rend them apart. When they open, everything is blurred.\nShe blinks a few times, flexes her wrists, stretches her back. She can feel two slender grazes down either side of her spine, and when she stretches they wrinkle, irritating the skin.\nShe’s lying on something soft. There’s a pillow under her head.\nShe sits up but she’s overcome by dizziness, a headrush so powerful the edges of her vision turn indigo. She lies back again, massaging her temples.\nWhat happened? The image of her face in the mist comes back to her, the apparition defining itself as it approached, little red optical sensors winking and blinking and threatening. And the scream; that keening, supersonic scream.\nShe had run. And she had been stopped. Someone had told her to . . . someone had told her to do something, but it was in her head, her neuroweb, but that’s impossible because she’s so far from the Vierendelen.\nBut how far? Where am I?\nShe seeps a little adrenaline from her ‘web. Her heart rate increases. It’s safe to sit up again.\nShe’s in a room, walled in dull rust-colored metal and lit softly by a handful of little globes that float like bubbles, bobbing gently against one another. There is a single door. She’s lying on a thin mattress in the opposite corner. Sephine looks down at herself and finds her clothes have been changed. That makes her feel embarrassed and scared.\nHer weapons are propped against the wall next to her. Her utility belt lies neatly on the floor.\nThere’s a terminal screen on the wall across from her. At first glance it looks switched off, but there’s a little flashing cursor in the top corner awaiting input.\nThe vegetable smell is coming from a pot near her bed. An incandescent circle built into the floor is cooking some kind of broth. Sephine’s mouth waters so fast her jaw aches.\nShe tries Enlinking to her map, but it feels just out of reach, like punching in a dream. There’s a murmuring, a dull thrum all around her.\nShe doesn’t feel alone.\nAt that thought the door groans open. Sephine scrambles back against the wall. Her hand goes to the grip on the stunner, and it’s up and in front of her in one swift movement, switched to beam.\nA man enters and closes the door, and turns to face her. His hands go up.\nThe moment she recognizes him, she scrambles to her feet and flings her arms around her brother, sobbing into his shoulder.\nRokri has aged. His eyes are tired. He’s unshaven. But he’s bigger than she remembers, with powerful arms and shoulders, his chest defined and visible through the open collar of a baggy shirt.\nOnce she calms down, she asks him how he survived.\n“The construct’s uninhabited, except for Fractured,” he says distractedly. “Most are pretty easy to destroy.”\nConstruct?\n“I . . . ” she hesitates, wondering where to begin. She has so many questions. “For so long I thought you were dead.”\nHe’s sat at the terminal screen. Pinpoint beams from the wall project a keyboard onto the surface of the narrow desk underneath. His fingers thud rapidly against it. The keyboard is in Vavaral.\n“Rokri?” She goes to the screen and tries to get him to look at her, but he’s immersed in . . . whatever he’s doing. “Rokri, what’s the matter?”\nHe just keeps typing.\n“Rokri, look at me. Listen to me!”\nHe slams his fist onto the desk and roars, sweeping a half-filled bowl from the desk that shatters against the door. Sephine jumps and stands back as Rokri rises from his seat, breathing hard.\n“No!” he shouts. “No, no, no! Ruined! Everything ruined!” He puts his head in his hands.\n“Rokri, what . . . what’s happened? What’s ruined?” Sephine speaks softer this time, sympathetic.\nHe visibly tries to calm himself.\n“You shouldn’t have come here. You should never have come here.”\nShe stares at him. She tries not to appear hurt, but suspects she does. “I came to bring you back.”\n“And how do you expect to do that, eh?” he says venomously.\n“I . . . ”\n“Got another set of wings, have you?”\n“No, but—” How does he know about that?\n“Got a fold-away flier in that belt of yours?”\n“Shut up!”\nHis eyes don’t even register she’s screamed at him. He just stares at her.\nThe humiliation physically hurts. She feels sick. What is she doing? She hadn’t thought; she’d just acted. Now it feels like the most stupid thing could have possibly done.\n“Rokri, look. I . . . ” she gulps and takes a breath. “I don’t understand. I deciphered your message. I thought . . . I thought it meant you wanted me to come here. I thought you needed help, that you were in trouble. Nobody else would come, nobody!”\nAt this, Rokri just sneers.\n“Trouble?” he spits. “We’re in a shitstorm of it now, sis.”\n“What does that mean?”\nHe looks incredulous. “Sephine. I didn’t send any message.”\n“You need to see something.”\nRokri has pulled up a map on the terminal screen: a wireframe image of the Leviathan. At his command the view withdraws and sweeps down, as if looking through a camera attached to the Leviathan’s base.\nThey are passing over a sprawling delta, the first body of water Sephine has seen in years. Text flashes in the corner of the screen: SALINITY 44%.\nThe Leviathan can analyze the terrain’s chemical makeup, even from this height.\n“Salt lakes,” Rokri says vaguely. “We’ll be there soon.”\n“Where?”\n“Convergence.” He kills the screen. “Let’s go. And bring your guns—they know you’re here now.”\nHe leads her out of the room into a corridor. The air is colder here. The corridor is lit by harsh strip-bulbs running along the corners of the ceiling. The walls are dotted with portholes, but the view beyond them is black. Sephine still doesn’t know where she is except that she is under the surface, inside the Leviathan.\nShe wonders what’s beyond the windows.\nThe next few minutes are a monotonous slideshow, corridor after corridor. After a time they come to an elevator. Rokri plucks a handheld terminal from his belt and flicks his pistol off the safety. He puts a finger to his lips and turns the terminal’s screen towards her.\nA map on the screen shows that they are below the edge-wall. The elevator shaft ends just feet from it, but on what side of the Leviathan Sephine can’t tell.\nThey enter. The door snicks shut.\nWhile they ride the elevator, Rokri turns to her.\n“You’ve been lied to, Sephine,” he whispers. “We all have.\n“I’ve got to know this planet. What it is. I know how the construct works—it stays a mile off the ground, no matter what. In a few months it’ll pass over a mountain range—still stays up a whole mile. You can’t breathe outside. This all doesn’t mean anything particularly, except the Fractured have learned to manipulate gravity, probably stolen Leseum technology.” He shrugs. “But that’s what the whole war is about, really. Technology. They crave it. Covet it.\n“The engine’s in the base of the construct. I’ve seen it. It repels the surface, inverts gravity somehow. Getting too close isn’t . . . healthy.” He bows his head and shows her his scalp. There are rough bald patches over his head revealing sore-looking skin underneath, like blisters or burn scars.\nThe elevator opens. Daylight explodes around them. The sky is a deep azure, cloudless. The sun steeps the surface with light, but the few towers Sephine can see are as black as they were at night. The other structures and machines are still unmoving and abandoned.\nThe edge-wall is a little way off.\nRokri takes her hand.\n“A few months ago I managed to break through the construct’s comms hardware. We thought Leseum had forgotten about us, but they haven’t. The constructs absorb the messages like sponges. They share it around with each other. I have a suspicion they’re laughing at us.” He takes on a bitter expression.\nConstructs?\n“They’re trying, Sephine. Leseum have been trying to contact us, but they haven’t been able to. I think they presume us dead—the last unique message came three years after the crash, but I think they still hope. Automated signals come every now and then.\n“When the Vierendelen crashed, its central AI tried to save itself by occupying a stasis bubble in Pod Country. The ship was taken down by a single needlehead to the fuel injectors in the bow. Our mother, her crew—all dead, instantly.\n“But it wasn’t just a needlehead.”\nThey’ve reached the edge-wall. Rokri takes her shoulders and faces her, pushing her back against the wall. A sharp wind speaks up.\n“It was a digital payload. A copy of a consciousness: the Fractured’s consciousness. The one thing we’ve always known about the Fractured is that they’re a hive mind. The swarm that attacked you, the constructs. The flagships heading up their fleets, down to the fleet’s individuals themselves. There’s no centralized intelligence maintaining it, it’s just a singular consciousness. A colony.”\n“So . . . what? What does all this mean?”\n“The Vierendelen was destroyed, Sephine. Its AI substrates were replaced by the Fractured’s. By the time the ship hit the surface, it was already one of them.”\nRealization now—a glimmer of it. But disbelief, too.\n“The last time we talked to Del, the real Vierendelen, was when we were kids. Kids on a ship caught up in a war we had no part in.”\n“No,” she says quietly.\n“We were lied to. The whole time. We weren’t talking with the ship. We were talking to them.”\nAnd he turns her around, and when she peers over the wall she feels like she might vomit. Because all around them, floating high above the delta of salt lakes and distant canyons, even in the far distance where mountains ruffle the horizon, are others. Other Leviathans. Moving lazily above the surface, casting their perfect shadows upon imperfect terrain.\nConvergence.\nThe sky darkens suddenly, and Sephine looks up, gaping at the sky; another is passing over them, just as massive as the Leviathan upon which they stand. She feels very, very dizzy.\n“I didn’t send any message, Sephine. It was the Fractured. You were tricked. We were tricked, into coming up here.”\n“I don’t believe it,” she says, her voice catching in her throat. “I won’t believe it. Your message . . . I deciphered it. With a Spite algorithm, your algorithm.”\n“Of course you did. And if you hadn’t have worked it out in time, they would have given you a nudge in the right direction.”\nAnd they did. She played Spite the day she deciphered the message. It had waited. Waited for its next pass over New Leseum, when it was close enough. When it could coax her into going up.\n“Tell me, Sephine. How could a Leseum-built, Golem-class AI like the Vierendelen not decipher a simple Spite algorithm? Come to that, why don’t you think the ship ever tried to repair itself? Just sitting there, wrecked, for all that time without a single attempt to rectify its situation? Just letting us get on, building our little city, our new home?\n“Biding its time, Sephine. Waiting. Goading us, me and you, to come up here and find out the truth about their prison planet. That’s what this is. A prison.”\n“But why us?” she says, her voice shaking. “Why not just kill us all? Why are we special?”\nHe actually smiles. “Come on, sis. You know exactly why. The Fractured were looking for something on our ship. They cornered the Vierendelen in the gravity well of this planet and brought it down to find it. And you know what they were looking for.”\nAnd suddenly she does.\n“Now they’ve found it.” Rokri looks out over the swirling delta, at the dozen lazy Leviathans spotting the salt lakes with their shadows.\nThen comes a tingle in Sephine’s head. That inverted goose bumps feeling again, familiar, but now completely alien. And the next voice she hears comes not from Rokri’s mouth, but from her neuroweb:\n– Sorry, toots, the Leviathan says.\nCHAPTER 6/6: FLIGHT\nCoordinates.\nThe route to Leseum Blue, encoded in their neurowebs.\nThe Fractured want to win the war, and to do that they need a Leseum Commander—or a Commander’s insurance policy: their children. They need Rokri and Sephine. And Rokri and Sephine have offered themselves up to the enemy.\nThe humiliation cuts her inside, the betrayal. And it just gets worse and worse as she puts the pieces together in her head.\nWhy New Leseum was never attacked. How the “Vierendelen” had sourced the materials for her wings. How both she and Rokri had made it up here without being vaporized by the Leviathan. All perpetuating the illusion. How could she not have seen it? The voice in her head the night before flashes into her memory . . . that should have been enough, enough to tell her things weren’t right.\nThe city was never attacked because the Fractured couldn’t risk killing either of them. The attack on the Farside Basin that day had been a ruse—probably delivering the materials for her filament wings.\nSensra had been right: all arrogance, no foresight.\nSephine feels nothing but devastatingly stupid.\n“We have to get out of here,” she says in a weak, trembling voice. “Rokri, we have to get out.”\n– You could always jump. Kill yourselves. It’s a long way down.\nRokri sees the sudden, horrified expression come to her face. “Turn off your ‘web. Turn it off now.”\n– Of course, if you do try that, I’ll probably just send a–\nSephine switches on her neuroweb’s privacy settings. The Leviathan blips into silence.\n“What do we do?”\n“We go back down, into the construct.” Rokri is already heading back, pulling her with him. “Now you know, they’ll make their move.”\nHe’s still dragging her, but doesn’t have to for very long; she runs with him. They dart through the towers together, past the elevator from which they emerged. They’ll be expecting them, Sephine figures. Rokri knows where they are going—time to test his mapmaking.\nA loud hiss. The sound of machines. A tower opens to their right, and vomits a swarm of drones, dispersing and coalescing together, shimmering through the air like static. Rokri clocks the swarm and his gun is up barely before Sephine even registers they’re being attacked. The swarm makes a layered, stuttered groaning noise and collapses in an iron hailstorm.\n“Come on,” he says, running past her.\nThey run until they come to another black tower, another elevator. The door snicks open, and Sephine swings round, met by the Fractured again, only this time it’s not a swarm, but a single machine, bristling with weapons and made of countless contra-rotating components creating the vague shape of a face. Whose she doesn’t know. She swings the splinter-rifle over her shoulder and fires, backing into the elevator. The Fractured jerks sharply, components locking as the splinter collides with a festoon of wires in its middle. Its weapons fire indiscriminately and it tumbles to the ground.\nAs the elevator door begins to close, the machine shakes and a metal limb cracks and groans and points at her. It fires a second too late, but Sephine flinches and falls back against the elevator’s far wall. The shot collides with the tower. The elevator rumbles around them.\n“Can we escape?” she gasps, catching her breath.\nRokri rubs his temples and bows his head, as if considering some impossible conundrum. Finally he says, “Yes. But at a cost.”\n“What cost?”\n“There’s a hangar in the lower levels, above the engine. There’s ‘fold-capable craft in there, Leseum-built, too. Assuming they want us alive and we aren’t obliterated on sight, we might be able to get off-planet. But, Sephine—”\n“The others.”\nWithout her or her brother, the Fractured would think nothing of destroying the city. Without them, its people are expendable. Worthless.\n“And that’s assuming the city isn’t dust already,” Rokri says darkly.\nShe hadn’t thought of that. “Well . . . if that’s the case, then . . . ” She can’t bring herself to say it.\nShe’s spent almost half her life in that half-city. She’s always known New Leseum wasn’t her home, but it’s been the closest thing she’s had to one. Her friends. Teachers. The Makers. She grew up with those people, and each one would have protected her with their lives had they known the secret she holds in her head.\nAnd now she’s considering leaving them to their deaths.\nShe screams in frustration and thumps the elevator wall.\nRokri says, “I don’t see what choice we have.”\nNeither does she.\nThe elevator descends past the floor of Rokri’s makeshift home, into the belly of the construct.\n“Be ready,” Rokri says, racking his weapon. “The Fractured won’t let us go that easy.”\nShe racks her rifle as the elevator comes to a halt, and the door slides open.\nThe space inside the Leviathan is vast. There are dormant ships everywhere. None is nearly as big as the Vierendelen, but they’re all large enough for a substantial crew. Sephine can see a few that are Leseum-built, but most are Fractured vessels. Their style is more streamlined yet somehow less elegant, like ornamental knives gone to rust. There are even a few ships that are neither Leseum nor Fractured, with filament sails, shadow-drives, knife-edge fins towering high above the hangar. She has no idea to which civilization they belong.\nThe floor is meshed wrought-iron. There are stairwells dotted around leading down further, as if the hangar is a vast missile silo. Sephine spots a faint, white-blue light far below through the crisscrossing holes in the floor—that must be the engine. She heads to the nearest stairwell and peers down through a tangle of gantries and railings.\n“Are we really going to do this?” She turns to Rokri. His face is stone. Again she notices just how old he looks. “We’re just going to leave them here?”\n“It’s either that or risk home. Risk losing the war.”\n“But—”\n“We have no choice, Sephine! It’s fifty thousand, or countless millions—if we stay, and the Fractured take those coordinates from us, we’ll be dead. And they will be too. And then they’ll attack our home, and there’ll be nothing left of us. Nothing! Damage control, Seph. If we do something now, at least there’s a chance to save home and ourselves. Maybe New Leseum, too. Maybe.”\n“If we can bring a fleet in time.”\n“Right.”\n“And if we don’t die escaping.”\n“Yes.”\n“And if the city wasn’t destroyed the moment I left.”\n“Not likely. But yes.”\nSephine thinks for a moment. “I can’t help but feel we’re being selfish.”\n“What do you mean?”\nI mean, she thinks, maybe we should just kill ourselves. Blow our brains out right here and just be done with it.\nNow who’s being selfish . . . she adds silently.\nRealization comes to his face. “Don’t you even think it,” he says. (Sephine imagines the Vierendelen saying – Too late!, and grimaces.)\n“Either way,” he continues, “All those people will die.” He takes her face in his hands, cradling her, and his expression becomes soothing and concerned, but laced with what looks like pleading. “If we die, we go out trying, at the very least. We’re taking the one course of action that has a chance of a positive outcome. You have to see that.” His eyes flick back and forth across hers, desperation in his face. “Please.”\nNoises: metal on metal. Scurrying, like impossibly heavy insects. Some way across the hangar, a deafening blast. A ship has exploded. A scorching arch loops into the air.\n“We have to get to a Leseum ship.” Rokri grabs Sephine’s arm and pulls her across the hangar.\nMovement under the spindly feet of a nearby ship. Plasma fire. A shot screams past, barely a meter from them. Sephine feels the heat of it on her face.\n“This way!” Rokri pulls her in the other direction. She catches a glimpse of their assailer before he turns—another singular drone. Jogging backwards, Rokri fires, sending a white-hot projectile into the Fractured machine. It careens backward and up with the force of the shot, tumbling though the air to slam into the hull of the ship behind it, exploding violently.\nThen there are more.\nSephine and Rokri weave their way around and under ships, and each time they look up there are more and more Fractured pursuing them. Sephine hears the now-familiar buzzing of a swarm, and when she looks up into the empty, cavernous expanse of the Leviathan, the are tens of them, a sentient iron storm threatening to rain destruction upon them, optical-sensors like livid scarlet lightening.\nShe grabs her brother by the arm and hauls him under the cover of a small craft, just as a deluge of little drones descends. They batter the floor where they had just been standing.\nThey roll together and emerge, and are met by a trio of machines, weapons powered up. Sephine and Rokri fire before the Fractured can. All three burst into crackling pieces of twisted metal.\nThey sprint towards the middle of the hangar.\nAnother ship explodes, somewhere. She feels as if they’re running aimlessly. She can’t bring herself to look back, but she can hear the noise of metal footsteps behind them.\nAnother shot tears past her head, inches away, burning her cheek and singeing her hair. She arcs her arm out awkwardly behind her and fires blind. An explosion abruptly follows.\nAhead are two ships, noses pointing inwards, each standing on three legs about two meters high. Beyond that there is a railing. Beyond that, nothing.\n“Shit!” Rokri slows his pace as they pass under the ships’ noses, but Sephine can’t stop in time and slams into the railing, bending over double, winded, and for a second she is poised over it at the waist by her momentum, staring down, down into the depths of the Leviathan, its mighty engine. Her wing-grazes split. Pain rips across her back.\nRokri reaches out and grabs her shirt, yanking her back onto solid ground. She kneels and splutters, coughing, trying to catch her breath.\n“Cornered.” Rokri says.\nShe looks up and despairs.\nAt least twenty machines are encroaching, flanked by swarms. The swarms taunt them, gathering into facsimiles of her and Rokri.\n“There!” Sephine yells, pointing. To the left, behind two small single-passenger craft, stands a Leseum ship. A symbol on its fuselage tells them it’s ‘fold-capable. Their escape.\nSephine doesn’t think; she just fires. One, two shots, each at the forelegs of the two ships between them and the advancing Fractured. The ships’ noses burst into blue fire and tip forward, crumpling against each other with a cacophonous groan. A few Fractured machines underneath are crushed. But the swarms just glide through the flaming wrecks unfettered.\n“Come on!” Rokri pulls her to her feet, and yet again they are running. More explosions, closer this time, in quick succession.\n“It’s trying to stall us, destroying every ship. Faster!”\nThey pass under a dormant Fractured craft and emerge into open space. The Leseum ship is just ahead of them now, barely ten meters away.\nSephine runs towards the ship first, faster than she’s ever run, and just as she reaches its access ramp, she hears Rokri cry out.\nShe darts up the ramp, slams her fist into the entrance pad, and turns as the aperture opens.\nRokri is down, screaming. A spatter of blood paints the floor by his right arm. Behind him, Fractured drones are advancing, firing into any ship within range.\n“Get up!” she screams at him. “Rokri, get up!”\nHe looks up at her, dazed. His right arm is gone up to the elbow. The Fractured fire at the floor around him.\nHe rolls onto his back, fires at the Fractured. He begins to scramble backward, instinctively putting out his right arm for support, but collapses onto the stump. His scream is almost as loud as the explosions.\n“Get up and run!”\nAnd he does, but he’s going too slowly, and Sephine can’t help but feel that all is lost. A shot hits the ship, sending fizzing sparks and tongues of flame fanning from the point of impact. She shrieks and dives forward, rolling clumsily down the ramp, and then she’s up and suddenly her brother is in her arms, and one of them yells, “Enlink!” and she doesn’t have time to wonder if it was she who said it or him, but she feels a connection, their neurowebs linking together, and everything goes silent.\nWhen she opens her eyes, head still resting on her brother’s shoulder, Sephine finds herself in a room she vaguely remembers.\nThe room is spacious and semicircular. The straight far wall is a floor-to-floor window. Beyond it an ocean fades into the distance. Overlooking the glittering water is a city, tumbling down a steep incline to a bay, riven by a snaking, waterfall-fed river, the waterfall cascading from a cliff some way above the city’s highest crest.\nLeseum Blue. But not, too: in the corner of her eye, perfectly in focus but impossible to look at directly, the word LINKED flashes in violet.\nShe becomes aware of a dull, regular thunk. Behind her brother, a hunched, vague figure is beating a solid metal box with its bare fists. The figure pounds and pounds. Its hands are pulped and bloody, fingers bent and cracked and broken around a glut of gristle and bone. And yet it goes on punching, uttering occasional grunts as if the pain were just an itch.\nIt’s almost a man, almost a ghost. Almost formless, almost solid.\nThe windows open but no breeze follows.\nSephine and Rokri look at each other but say nothing. Looking down, she sees his right arm is completely intact.\nA collared dove flutters in from the city, swoops around the room, and comes to perch on the figure’s shoulders, riding the troughs and peaks of its punches.\n– You’re a bit late, the dove says. Its beak doesn’t move.\n“Del?” Sephine says, taking a step towards the box, the man, the bird.\n– Yes, it’s me. Sort of. Well! Look at you two, eh?\nThe Vierendelen flaps its wings.\n– All grown up and that. Not much better looking though. Must’ve got that from your father. Not that I ever met him.\nRokri speaks. “What is this?” He points to the figure, still occupied with its box. “And what’s that?”\n– Oh, this is nothing fancy. Just a virtual environment. Your basic sandbox simulation, written into a tiny substrate deep, deep in your neurowebs. Each of your webs possesses half the code. And I’m just a part of it, so, sadly, I’m not the real Vierendelen—just a construct imbibed with its good looks and incomparable wit.\nAnother flutter of iridescent wings.\n“And that thing?” Sephine nods at the figure.\n– That thing, is the Fractured. Hey, it hasn’t been badmouthing me has it?\nSephine and Rokri exchange glances.\n– Because if it has . . . well. Never mind. Look at it. It’s been doing that since it shot me.\nThe embodied Fractured ignores them. In fact, it doesn’t seem remotely aware that they’re even here. Then Sephine remembers—she’s dreamt of this place before.\n“The coordinates,” she says. “They’re in the box?”\n– Of course they are. We’re here to make a copy and extract them.\n“Are we dead?”\n– What? Sephine, is he always this dim?\nSephine just looks bemused.\n– Of course not, you silly thing. The Fractured aren’t stupid enough to kill you. Outside this environment, in the real, barely a millisecond has passed. I’m not sure exactly, but certainly no more than that. So no, you’re not dead, but either way it’s probably best if we just get that box open sharpish. Oh, you should also know the Leseum ship you’re about to embark has linked up with the Commanders’ access codes sent to it by triggering this simulation, and is powering up its engines. It’s just awaiting a course, which it will receive the moment we open the box.\n“Will we make it?”\n– What, home? That depends. You should do. The ship’s got a pretty good ‘fold-capable engine, so the moment you get out of the planet’s gravity well you should be home and dry. I also recommend you destroy the Leviathan before you make your escape. One shot to the base engine should be enough to do it—the ship’s firepower is formidable for its size. Hang on . . . oh! Would you look at that. It’s got needleheads!\n“What about the others?” Rokri asks.\n– Ah. That’s a bit of a gamble I’m afraid. There’s a chance the Fractured will just leave them be, but it’s not likely. Therefore, I suggest one of you stays behind. When you exit the Leviathan, one of you can use the escape pod in the ship’s rear and fly it back to the Vierendelen, to New Leseum. The logic here is that, as we’re merely extracting a copy of the coordinates, meaning another remains in your neurowebs, the Fractured still won’t risk killing one of you. If it does, the box will disappear, along with the coordinates. The code maintaining this simulation will be corrupt and incomplete. Don’t want all this here muggin’s work to go to waste, do we?\nAs if in response, the Fractured goes on pounding.\n– But you can battle that one out amongst yourselves. Best if we just get this box open.\nSephine stifles a laugh; the Vierendelen hops on its scrawny legs and turns, cocks its head, and gives the Fractured a sharp peck on the head. The Fractured—mid-swing, arm up, ruined fist clenched—stops dead. The box whirrs, and opens.\nInside the box, on a low shelf, sits a pebble.\n– Us ships, the Vierendelen says, almost ruefully. – We have, ironically, a rather limited imagination, don’t you think? A pebble. How quaint. Well, go on; take it, quickly. I can’t hold him off for long.\nSephine walks over to the Fractured, which is now a bizarre tableau of desperation. She reaches into the box, and looks up at its face. She can’t quite focus on it. It occurs to her that it is indescribable, except for the eyes: silver-in-silver and whorled, following her hand as she takes the coordinates. She wonders for a moment if it wants a face, but that its very nature repels individuality; a symptom of hive-mindedness.\nThe moment she plucks the pebble from the box, the box slams shut.\n– Right. Bye then.\n“Wait—!”\nBut the room is already dissolving, effervescing, dividing into strips of matter that disperse into ciphers and code. The window and the view beyond fades into white, and the Fractured’s fist swoops down and slams into the box with a brand new anger, a determined fury, and just before she finds herself back in the Leviathan, Sephine hears the Vierendelen say, – And if you call her that one more time . . .\nReality folds open like petals of fire. Barely a second has passed. Sephine is immediately aware of the surrounding chaos, as if she’s merely blinked, hadn’t experienced the simulation at all.\nFractured machines all over the hangar busy themselves destroying ships and a clutch of them are still advancing on Sephine and Rokri. The air is acrid and becoming thick with smoke.\nShe shoves Rokri up the ramp hard. His face is ashen. He looks dazed. What’s left of his right arm hangs limply at his side.\nAnd Sephine, amid the chaos, tries to decide what to do. Folding to Leseum space would get Rokri there almost instantly. But would he make it to Leseum Blue once there? Or would he bleed out?\nHe needs help fast. New Leseum’s infirmary, oddly, seems even further away than Leseum Blue.\nThere’s no time to think just yet.\nSephine shoves Rokri into the ship, slams the entrance pad by the aperture, and fires blindly into the oncoming machines. The ramp retracts too quickly for them. The door irises shut. The fervor outside becomes dull.\nSephine makes her decision.\nWhen the Fractured see the ship rise from the hangar floor, most are unsure about how to proceed. Directive dictates the targets must not be killed. They must be contained. But destroying the ship will surely eliminate them. The Fractured are confused by their failure. They are not used to it.\nThe ship rises above the smoke and pivots, surveying the smashed machines below like a scavenger bird. As if realizing it is not under fire, it heads lazily towards the center of the hangar. The Fractured clamor beneath it, helpless, none brave enough to fire.\nThe ship is not so hesitant.\nProjectiles scream from the barrels of weapons embossing its fuselage. The first shot turns a clutch of Fractured into smoking slag. The second—a much more powerful weapon—fizzes through the air and collides with the inner shell of the Leviathan itself, the blossoming explosion leaving a huge, jagged tear, admitting a burst of sunlight from outside. The entire Leviathan shakes, sending surviving Fractured falling over each other, ships losing their balance and crashing to the hangar floor. The air pressure drops violently, conjuring a mini-hurricane—drone-swarms swirl around it in metal dust-devils.\nThe third weapon is a needlehead. Deployed as the ship tears toward the rip in the Leviathan’s skin, it drops like a shadow; a black, roiling pin that blurs the air it as it descends furiously toward the engine at the hangar’s base.\nBefore the needlehead meets the engine, the ship has slipped through the hole and out.\nThe needlehead plays havoc with the quantum. The Leviathan’s engine shudders, its shine fades and bursts like a strobe light. The bowl in which it sits begins to glow.\nThe hangar floor buckles first, pulled down to the base as the gravitational engine collapses. Ships tumble like small toys into the raging hub of energy.\nThe outer surface buckles next. The black towers and dishes of the city that is no city snap as they meet each other, and soon the surface is as bowled as the great machine’s underside.\nBy the time the engine reaches critical mass, engulfing the Leviathan in a colorless blast of fission, the tiny Leseum ship is long gone, hurtling low over the desert floor, westwards, towards the wreckage of the warship the Vierendelen.\nAs it nears the city, the ship appears to give birth.\nA tiny pod bleeds smoke as it separates from the main body. Parachutes deploy. Back-thrusters erupt into life. It bobbles down to the half-city of New Leseum as, above, the ship pitches, groans, belches fire, and goes up, and up.\nThe sky darkens. Gravity ebbs.\nThe course is plotted.\nThe pilot sits in the cockpit, breathing deeply, dazed, face pale, and looks at a rear-view screen. The cross-hatched pattern of New Leseum is fading. The Vierendelen casts a sharp shadow over four little dots, dots housing fifty thousand souls. Souls they saved.\nA retina scanner on a mechanical arm sweeps down and awaits input, blinking softly.\nThe ship says—in a voice completely unlike the Vierendelen’s—that it is safe to slip into the ‘fold.\nThe engines crackle.\nSpace outside pulses, the ship wobbles, and the pilot thinks, just for a moment, that this is what it must feel like to have wings.\nJack Schouten was born in Kristiansand, Norway, and was brought up in Surrey. He read Journalism and Creative Writing at Middlesex University London, specializing in science fiction, and his work has appeared in Jupiter Magazine, the North London Literary Gazette, and Shoreline of Infinity. He lives and works in London, and can be reached on Twitter at @JackSchouten."}