{"fingerprint": "IxvWF7Bo7HVtXQOSAt29bFIrLV0=", "sitename": "Clarkesworld Magazine", "title": "Bradbury, Lake, and The Named Lands: A Conversation with Ken Scholes by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/scholes_interview_2017/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bradbury, Lake, and The Named Lands: A Conversation with Ken Scholes by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nBradbury, Lake, and The Named Lands: A Conversation with Ken Scholes\nWorlds encompassed in books often extend past the pages. Rivers and mountain ranges spill over the margins slipping through gaps in fingers as they make their way through a reader’s mind. Worlds built over the course of a book series breathe and expand with the lives and machinations of characters and civilizations. Even when series comes to an end, the world lives on long after in the mind of the reader. No better is this illustrated than the world created by Ken Scholes in The Psalms of Isaak.\nReaders were first introduced to the world of The Psalms of Isaak with Lamentation. Over the course of the series, the universe encompassing The Named Lands and the Moon have grown complex, multilayered, and more populous with a fascinating cast of characters. In the final volume of The Psalms of Isaak, Hymn, Scholes concludes the five-book epic in spectacular fashion. Battle for the Named Lands rages, family members are pitted against one another, and a Younger God takes power on the Moon.\nKen Scholes is the multiple award-winning author of The Psalms of Isaak and numerous works of short fiction. He has won the Writers of the Future Award, France’s Prix Imaginales, the Endeavour Award, and others. Hymn, the conclusion to The Psalms of Isaak series, will be available from Tor Books on December 5th.\nWhen was the first time you realized that you wanted to be a writer?\nI started stapling pages together into little books sometime in first grade but things really stuck once I read Ray Bradbury’s essay “How to Keep and Feed a Muse” in an old textbook around age thirteen or fourteen.\nWhat drew you to short fiction when you started writing?\nInitially, it was Bradbury’s essay and his own focus on short fiction. And a lot of my other heroes from the pulp era also started with short stories. It seemed to me that was the path—start small and then go big as the writing muscles developed. But over time, it became comfortable and I found myself really nervous about writing anything longer than 10,000 words. Still, I’m glad I put my time in there because all those sheds I built seemed to have helped me build some mansions.\nHas the world you’ve created surprised you with how it has evolved over The Psalms of Isaak series?\nAbsolutely. Initially, I had just enough world for a short story. But as I started expanding, the world very quickly took on its own life. I discovered hidden civilizations and forgotten spaces in the world as I wrote, right up to the last book.\nHow do you combine your science and fantasy? Do you have a special formula for which aspects of the world get the sci-fi treatment or vice versa?\nI don’t have a formula. And I accidentally backed into being lauded as “seamlessly mixing science fiction and fantasy” but really, all I’ve done is only reveal to the reader what the POV characters believe about themselves and their world. Since prior to the first book’s launch, there’s been some back and forth about whether the series was one or the either or both. In the truest sense, it’s fantasy in the way that The Martian Chronicles is fantasy but it’s dressed up as SF . . . which looks at least through the first few books like epic(ish) fantasy.\nThere’s a quote from Hebda in your newest novel that reads “What is and isn’t possible is being redefined daily.” What is something you’ve discovered recently that you previously thought impossible?\nSo many things. I think the biggest is that I didn’t believe I would be able to have a life free of the PTSD that’s dogged me since age two. And yet I’m now nearly three years in remission thanks to the miracle of modern science and a little-known psychological framework born out of BC in the ’70s that has reshaped my cognitive approach to life in general. I’ve had more peace of mind than I can remember ever having previously which has meant a much nicer, quieter life in general.\nWho is one author that influenced the Psalms of Isaak series?\nThere would be no Psalms of Isaak without Jay Lake. His friendship led directly or indirectly to most of my body of work. His dare to go write Lamentation, his introduction to my first agent and my editor at Tor, his deep love for the series, and his support of me as I wrote it—these things all came together in powerful ways in my life.\nHow does it feel to finish the series?\nIt feels fantastic. It’s been nearly two years now since I typed “END” and now, watching it finally come out gives me a sense of accomplishment. These five novels were the hardest bit of writing I’ve ever done in my life partly because I had to write them through such tough circumstances.\nWhat is your next project on the horizon?\nI have no idea. I’ve been on sabbatical largely since finishing Hymn. Before that I had a PTSD book in development and since, I’ve thought I might move to YA and I’m researching another non-fiction book at the moment but I have no idea when I’ll start drafting it. I’ve said yes to some short stories after the first of the year but to be honest, I’ve really enjoyed the break and feel no burning need to put more Ken Scholes stories into the world.\nDo you plan to revisit this world again or do you feel like you’ve completed what you’ve set out to do?\nI’ve left that up to the audience and to Leroy, my inner redneck muse. I have many more stories in that world buried in the basement of my brain, set both before and after this particular series. And I’ve also thought about telling some of those stories through Tor.com’s novella line. We’ll see how much demand there is for more.\nHow much of the series did you have planned before writing the first book?\nVery, very little. I’m a discovery writer who writes by the seat of his pants. So, there are very few notes and even in the last book, I was surprised by the new bits I discovered about my world and characters.\nThe depth of the characters in your new novel really struck me. What does your process look like when developing a character?\nI just know them and write them the way they “seem” to me. And I learn more about each character as I write them. It’s instinctive and I always lock up a little when I try to describe the process because it lives beyond my power to describe.\nWhy do you sometimes refer to yourself as “Trailer Boy”?\nI grew up in a double-wide at the edge of the woods and at the foot of Mt Rainier. It was a Trailer Boy childhood with car parts in the yard and tires stacked against the various sheds. And it was a dark childhood—the kind that gives kids PTSD at a very young age—full of all kinds of icky things like racism, sexism, xenophobia, homophobia. So, it’s a reminder to me of where I come from and what our capacity is to grow beyond our origin stories.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}