{"fingerprint": "ogk5oSkkqu7ZJFQgNiABFBb2nGw=", "sitename": "Clarkesworld Magazine", "title": "Cheer Up Emo Kid: Being Depressed (or Gay) is Not All in Your Genes by Ekaterina Sedia", "author": "Ekaterina Sedia", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sedia_06_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cheer Up Emo Kid: Being Depressed (or Gay) is Not All in Your Genes by Ekaterina Sedia", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nCheer Up Emo Kid: Being Depressed (or Gay) is Not All in Your Genes\nIn recent years, popular science journals have been full of articles excitedly reporting “genetic markers” for depression, sexual orientation, alcoholism, IQ, and any number of other behavioral traits. The scientific journals cheerfully publish heritability statistics, which are often mistaken for estimates of genetic contributions to behavior, and used as justification to start looking for genes. And the common assumption is that there is a gene (or several) for just about everything.\nGenetic explanations are a double-edged sword—on one hand, they remove the stigma sometimes attributed to a choice of an unpopular behavior; on the other, they have been used to justify mandatory sterilizations and other violations of human rights. The current fashion for uncovering genes underlying everything from alcoholism to schizophrenia is not exactly new, but quite pervasive. Without much proof, a sizeable chunk of the population is branded as “hardwired” for depression and other mental illness, and most of the population is convinced that genes affect human behavior in a straightforward way. They are wrong.\nSorry, but your depression is probably not due to your genes. It is a popular view seemingly substantiated with many news articles, but the evidence for this is a lot less impressive than what popular media would have you believe.\nBehavior Genetics—History and Methods\nUntold sums of money have been spent on research designed to demonstrate that complex human behaviors, be they alcoholism, depression, schizophrenia or even homosexuality (which, tellingly, has been mostly studied in the same manner as the aforementioned mental health conditions) are genetically predetermined or, at the very least, have a genetic component, and considering the investment, the results to date are slim to nonexistent. Moreover, the methodology of such studies is flawed beyond repair, since the main tools have not changed since the 19th century when Francis Galton, Darwin’s half-cousin, set out to prove that “eminence” is a trait that runs in families. To no one’s surprise, he demonstrated that relatives of well-known people also tended to be successful.\nOne obvious criticism of Galton’s studies is that they confound inheritance (“nature”) with environment (“nurture”), and to remedy the situation Galton sought to employ tools such as twin studies, and some very troubling mathematical models to separate the influences of genes and environment. The long-since discredited science of eugenics was founded on these. So why, even though eugenics was abandoned long ago, due primarily to its association with Nazi ideology (one of the largest twin studies was conducted by Mengele in Auschwitz, who personally experimented on, examined, and murdered close to 3,000 twins), do its methods still persist? Short answer: psychologists, who do a good proportion of these studies, tend to confuse “heritability’”(a statistical variable which basically measures how well a given trait would respond to selection in a given environment, useful for agriculture) with “inherited”—determined by genes. (Lush, 1949) It is not shocking when news reporters confuse the two, producing gems like “Intelligence is 60% Genetic!” It is much more troubling when the scientists performing the studies do the same. Really, no sane person should ever bother calculating the ever-evasive “heritability.”\nThere are two heritabilities—the broad and the narrow. Broad sense heritability (H) describes the total percent of the phenotypic variability (V) determined by genetic variability (G). So, we have H=G/V. The problem, of course, is that G is not simple—there are additive alleles (A), which exist for continuous traits, such as height. There’s also interactions between genes—epistasis (E) (when one gene masks or modifies the expression of another), and dominance effects (D) (when alleles of the same gene do not contribute equally). So, total genetic variability thus becomes G=A+D+E. Now, total variability includes G, environmental effects (N), and the interaction between them (I). So, H=(A+D+E)/(A+E+D)+N+I. Got all that?\nThe only thing scientists can actually measure are additive effects, as epistasis is virtually intractable and dominance effects are subtle enough not to be reliably measurable. So what do scientists do? They ignore both E and D, as well as the covariance between environment and genotype. For example, a musically gifted child of well-off parents would have his or her talent nurtured and will benefit from the parental affluence in form of music lessons. In the future, wealth will allow this person to select the environment that would continue to nurture the genetic predisposition—an advantage an equally gifted child from poor background may not have.\nIf that wasn’t good enough, we then apply this formula reduced to the point of idiocy to twins—fraternal or dizygotic (DZ—share half genes, all environment) and identical or monozygotic (MZ—share all genes, all environment.) Any difference we observe between the two is attributed to genetics. The worst assumption here, of course, is that twins share all their environment. Environment is largely self-selected, and any differences between the twins of either variety will cause them to exacerbate those differences by seeking out different environments—or conversely to exaggerate their similarities. We never see headlines like “Twins Separated at Birth Are Nothing Alike!” because twins who receive media attention usually do so because of their similarities. Not all separated MZ twins are doppelgangers of one another.\nAnd this is the broad sense heritability, so carelessly thrown about by people who do studies on human behavior. This concept is so flawed that I’m shocked that anyone still uses it.\nNow, narrow sense heritability is a bit more empirical—it measures the response of a population to artificial selection. Basically, we have a population with some mean (M) for a trait—say height. Or milk yield. Or quality of wool. You select your best specimens, which will have a higher mean (M1) by virtue of being the best. You then breed them and measure the mean of their progeny (M2). You then compare M2 to M and M1. If it close to M, it tells you that selective breeding is futile. If it shifted closer to M1, breed away! Caution: it only applies to a particular population in a particular environment, and makes no claims about genetic or non-genetic contribution. Just that the response shifted—it could be just the better quality of parental care or fetal nutrition. It is also worth noting that in both cases we are dealing with variable traits. Most of human traits are genetic but show little variability—such as the basic human design of having two arms and two legs.\nThe concept of narrow sense heritability is what they use for adoption studies—comparing the mean response (depression, mental illness, weight) to the means of adoptive and biological parents. Any difference between adoptive parents and progeny is attributed to genes—not intrauterine environment, or early childhood experience. And certainly not to the fact that people who are allowed to adopt are screened very thoroughly, and fall far above the mean of general population in terms of income, education, and mental health. Or to the fact that studies in schizophrenia were performed in countries where forcible sterilization of mental patients was legal, and therefore adoptive children from such homes were marked for life.\nSo armed with this statistical approach flawed beyond belief, behavioral geneticists calculate heritability for everything under the sun—intelligence, depression, schizophrenia, homosexuality, you name it.\nIs Homosexuality Genetic?\nThe studies of homosexuality are especially egregious in regard to the methodology and overreaching conclusions. Search for biological basis of homosexuality started back when it was still considered a disease to be “cured.” Current studies shifted in their ideological underpinnings but not their methodologies or general claims, as McGuire (1995) pointed out in his comprehensive paper.\nAt first, much of homosexual behavior was attributed to paternal alcoholism and maternal hormones; both theories neglected to define what constituted homosexuality as a trait. (It is a frequent problem with studies that focus on outcomes, such as sexual attraction or IQ scores, rather than behaviors—such as distinct sexual acts and, say, problem-solving strategies.) This lack of definition led to an interesting situation where a male rat treated with feminizing hormones and behaved as a female rat, posturing for coitus, was considered homosexual, but a male rat that mounted this homosexual male was not. Secondly, many of these studies hopelessly confounded sexual orientation and gender, oftentimes conflating heterosexuality with heteronormative behaviors, and vice versa. We still get headlines about how brains of homosexual men are more similar to female brains—regardless of the fact that the male-female brain differences are small to nonexistent to begin with.\nThe Kinsey scale was (and still is) used as a self-assessment tool, and a sexuality rating is determined by answering five to ten However, the Kinsey scale was meant to be descriptive, the questionnaire is administered by a trained researcher, and an entire sexual history is supposed to be obtained to arrive at the rating. Even more inappropriately, the ratings are often obtained by interviewing family members about the deceased or inaccessible. In case of twin studies, still a popular tool of behavior genetics, the situation is even worse.\nBecause of the commonly held belief that sexual orientation is genetic, samples tend to contain many twins that are alike, and very few that are different, due to a strong self-selection bias. Moreover, much of the recruitment is not random, but occurs through GLBT publications, further biasing the sample. Finally, assignment of twins to MZ or DZ class is usually self-reported, and the error rate in those cases is close to 10%—that is, MZ twins who look different often think that they are DZ, and vice versa. The sample size usually tends to be too small as well—the sample size to produce a reliable twin study is 2,500 twins.\nHamer et al (1993) is considered a breakthrough paper—it discusses the genetic markers that were found in X chromosome and that gave start to the now famous “Hey Mom, Thanks for the Genes” t-shirt. The study focused on gay men (who received their only X-chromosome from their mothers). However, considering a small sample size involved, a correlation would not be difficult to find, considering that there are thousands of markers found in the human genome, and at least some of them are bound to correlate with pretty much anything—I could easily find a marker that would correlate with liking of color red or wearing of high-heeled shoes. Correlation itself is meaningless, and it only makes sense if the analysis is backed up by some other evidence—which is not the case here.\nIt is important to mention that I am not arguing that homosexuality or any other sexual orientation is chosen (although it can be), but rather that any simple explanation, such as a gene on X-chromosome, is likely to be at the very least incomplete. Also, nature versus nurture argument misses the point that much of human development is guided by idiosyncratic processes, which are biological but not genetic (i.e., they happen due to random events during development rather than to any specific genes)—and this component that is commonly overlooked when discussing human behavior.\nIf you consider the lack of consistent definition of homosexuality from one study to the next, built-in bias, and small sample size, throw in the untenable quality of “heritability”, problems with twin method and family studies, and the fact that correlation is not causation, it becomes clear that the confidence in genetic basis of homosexuality and many other complex human behaviors is not only misguided, it is downright foolish. When one looks at the history of biological research of human behavior, it becomes clear that the temptation to assign simple causes to complex phenotypes is as strong as it is destructive.\nReferences:\nBailey, M.J. and Pillard, R.C. (1991) “A Genetic Study of Male Sexual Orientation” Archives of General Psychiatry 48: 1089-1096\nGalton, F. (1869) Hereditary Genius. London: Macmillan and Co.\nHamer, D.H.. Hu, S., Magnuson, V.L., Hu, N. and Pattatucci, A.M.L. “A Linkage Between DNA Markers on the X Chromosome and Male Sexual Orientation,” Science 261 (1993): 321-327\nJoseph, J. (2004) The Gene Illusion: Genetic Research in Psychiatry and Psychology Under the Miscroscope. Algora Publishing.\nLeVay, S. (1991) “A Difference in Hypothalamic Structure Between Heterosexual and Homosexual Men.” Science 258: 1034-1037.\nLush, J. L. (1949) “Heritability of Quantitative Characteristics in Farm Animals.” Hereditas (Suppl.), G. Bonnier and R. Larsson, Eds., pp. 356-375\nMarcus, G. (2004) The Birth of the Mind: How a Tiny Number of Genes Creates the Complexities of Human Thought. Basic Books.\nMcGuire, T. (1995) “Is Homosexuality Genetic? A Critical review and Some Suggestions.” in: Sex, Cells, and Same-Sex Desire: The Biology of Sexual Preference. J. P. De Cecco and D. A. Parker, Eds. Haworth Press, pp. 115-146\nMoore, D.S. (2003) The Dependent Gene: The fallacy of ’Nature vs. Nurture’. Owl Books, NYC.\nOudshoorn, N. (1995) “Female or Male: The Classification of Homosexuality and gender.” in: Sex, Cells, and Same-Sex Desire: The Biology of Sexual Preference. J. P. De Cecco and D. A. Parker, Eds. Haworth Press, pp. 79-86\nEkaterina Sedia resides in the Pinelands of New Jersey. Her critically-acclaimed and\naward-nominated novels, The Secret History of Moscow, The Alchemy of Stone, The House of Discarded Dreams, and Heart of Iron, were published by Prime Books. Her short stories have sold to Analog, Baen's Universe, Subterranean, and Clarkesworld, as well as numerous anthologies, including Haunted Legends and Magic in the Mirrorstone. She is also the editor of the anthologies Paper Cities (World Fantasy Award winner), Running with the Pack, and Bewere the Night, as well as forthcoming Bloody Fabulous\nand Wilful Impropriety. Her short-story collection, Moscow But Dreaming, will be released by Prime Books in December 2012."}