{"fingerprint": "QSQd/qoMN7A4bTS5XLBtu9Gr1xw=", "sitename": "Clarkesworld Magazine", "title": "The Taste of Wheat by Ekaterina Sedia", "author": "Ekaterina Sedia", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sedia_08_07/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Taste of Wheat by Ekaterina Sedia", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3400 words, short story\n The Taste of Wheat\n Dominique came from solid peasant stock, not frequently given to fancy; still, in the privacy of the thick bones of her skull, she dreamt of an Asian gentleman who insisted on being called Buddha, and small dogs with sharp white teeth.\n The heavy sleep descended unannounced, smothering her with dreams in the middle of dinner with her family, or in the wheat fields while she was threshing. Any blink could turn into a jumble of images and voices, and then someone would shake her shoulder and say, “Dominique, wake up.”\n Sometimes the dreams stopped before she was forcefully pulled away from them, and then she would hear what they said. “What is wrong with her?” and “You’d never think looking at that girl.” Then she blushed, and let the world in shyly, through the slightest opening of her lashes. The sun was fuzzy in their frame, and the faces—soft, undefined, kind. Then she would get up, smoothing down her skirt around her wide hips.\n “You seem so healthy—milk and blood,” people said. They kept the second part of their comments silent, but Dominique knew what it was. She was defective, and no man would take a wife with falling sickness, no matter how well-fed and ruddy-cheeked. Her family thought that it ought to bother her, but it did not. She only shrugged and went about her business, ready to be assaulted by dreams with every step she took.\n She worked in the fields with the rest of her compatriots, from the time when the sun rose to the sunset. But at midday she left the merry din of people laughing and talking, children squealing, oxen lowing, and went home to tend to her grandfather. He was too feeble to venture into the fields, and she took it upon herself to make sure that he was fed and attended to.\n The old man looked at her with his colorless rheumy eyes that had seen so many harvests come and go, and she almost wept with pity. He was the only person she had ever known who understood what it was like to inhabit a body ready to betray him at any moment.\n “Don’t worry, grandpa,” Dominique said, blinking hard to cool her suddenly hot eyes. “Maybe some day you’ll be born as a butterfly, alive for just a day, your life short and painless and beautiful.” She spoke in a hushed voice; even though she knew that her parents and siblings were in the fields, she worried about being overheard. Sometimes (more often as the time wore on) she intentionally garbled her words, so that only her grandfather could understand. She rather liked appearing as a large, mumbling thing, half-witted from her fits.\n She fed her grandfather, pushing an awkward spoon between his gums, pink like those of an infant. His skin seemed simultaneously translucent and tough, like the wings of a dragonfly, with quartz veins intersecting under its pale, downy surface. His hooded eyelids stood like funeral mounds over his dead eyes, the coarse salt of his eyebrows casting a deep shadow over them.\n “Grandpa,” Dominique said, “you are so good, you deserve to be a butterfly.” She thought for a bit, the wooden spoon in her red idle hand dripping its grey gruel. “They say being a dog is pretty good, but I’m not so sure—all you get is yelling and kicking. Unless, of course, you are Buddha’s dog. Perhaps a bird . . . the kind nobody hassles. Like a hawk; just promise you’ll stay away from the chicken coups, or people will throw stones at you. Promise me.”\n Grandpa nodded, in agreement or in encroaching sleep, she couldn’t tell. She wondered if her grandfather was afflicted by the same visions as her, if he too dreamt of the stocky Asian gentleman and his dogs, adorable and vicious. Before she could decide one way or another, they all stood around her, and she lay on the earthen floor of a dark cavern. The dogs snarled, showing their needle teeth.\n “What we think, we become,” Buddha said, with his habitual feeble smile.\n Dominique sat up, despite the snarling dogs, and nodded.\n “Be grateful you didn’t die today,” he said.\n The dogs growled deep in their throats but settled down.\n Buddha shifted on his feet, with a look of consternation showing on his moonlike face. “Words have the power to both destroy and heal. When words are both true and kind, they can change our world.”\n The dogs barked and leapt, and Dominique woke up with a start.\n She collected herself off the floor, smoothing her skirt and blushing. “Sorry, Grandpa,” she said.\n The old man did not answer. His body pitched forward in his chair, and a thin streak of gruel hung off the corner of his lips. With a sinking heart, Dominique realized that he was dead, dead on her watch, dead because the dreams stole her attention away from him. She fell to her knees, grabbing the cold hands with blueing fingernails, and keened.\n Her wails brought people from the fields. They came running and hushed when they saw the dead man. After a few seconds of respectful silence, they talked about the funeral arrangements, while Dominique still keened, her cries hanging over the thatched rooftops of the village like tiny birds of prey.\n They buried Dominique’s grandfather two days later. The frost came early that year, and the ground grew hard. The diggers’ hoes struck the dirt with a dull thump-thump-thump. The diggers sweated as Dominique’s family clustered about shivering, drawing their warm clothes tighter around them.\n Dominique never looked at the diggers, and let her gaze wander over the bare fields and the grey hills that lined the horizon. She searched for her grandfather, and worried that she would not recognize him in his new form. Was he a leaf blowing in the wind, a tiny calf that followed its mother on rubbery, slick legs, a sparrow perched on the roof? Life of all persuasions teamed about her, and Dominique despaired to find him. “I’m so sorry, Grandpa,” she whispered into the cutting wind as it singed her lips.\n After the funeral, Dominique walked home among the neighbors and relatives who filled her house with their heat and loud voices. She made sure that everyone’s mugs were filled with mulled wine, and that everyone had plenty of cracked wheat and raisins. It was for her grandfather. Buddha’s words buzzed in her ears like flies tormenting dogs on hot summer afternoons, “To be idle is a short road to death and to be diligent is a way of life.” Dominique did not want to die—not until she found out what happened to her grandfather.\n Then it occurred to her that the nights were growing longer and colder, and many woodland creatures must be feeling hungry and alone. Quietly, she picked up the bowl with wheat and raisins and stepped outside. No one noticed either her presence or departure, just like they didn’t notice their own breathing.\n The wind whipped her hair in her face, as she peered into the freezing darkness, her eyes watering in the cold. She thought about the moles that burrowed through the ground, and the little field mice that skittered across its surface on nervous light feet, of the weasels that eyed the chicken coups when no one was watching, and the shrews that stalked millipedes. There were too many to feed, to many to search through. How could even Buddha hope to recognize one soul among the multitude?\n She set the bowl a few steps away from the porch and tightened her shawl around her shoulders, shivering, listening to the quiet life that teemed about her. She was too large, she realized, too lumbering to ever hope to find her grandfather. She needed to be smaller. And she needed a better sense of smell.\n She thought of the tales the old women told around the fire, about the mice who decided to become human, and crawled into the pregnant women’s wombs, to gnaw at the growing child and to displace it; they grew within the women, shed their tails and claws, and were born as human children. One could only recognize them by the restlessly chewing teeth and the dark liquid eyes. Surely there must be a way for a woman to become a mouse.\n The winters were always long, with nothing to do but tell stories. Dominique withdrew more, and gave herself to her sleeping fits with zeal, like a soldier throwing himself onto the bristling pikes to aid the cavalry charge. Dominique tried to aid Buddha’s visit, so he would answer her questions.\n One day, he appeared. His dogs were subdued and teary-eyed, shivering and sneezing in small staccato bursts. The winter was not kind to them.\n “Are your dogs all right?” Dominique asked.\n Buddha looked up, into the dripping ceiling of his cave. “A dog is not considered a good dog because he is a good barker.”\n “I cannot find my grandfather,” Dominique said, the fear of waking up lending her voice urgency.\n “All things appear and disappear because of the concurrence of causes and conditions,” Buddha replied.\n “I have to find him though,” she said. “I think I need to become a mouse, or another small creature, so I can search better.”\n “He who experiences the unity of life sees his own Self in all beings, and all beings in his own Self, and looks on everything with an impartial eye.”\n “Just tell me,” she begged. “Without riddles.”\n Buddha finally turned his empty eyes to her. “People create distinctions out of their own minds and then believe them to be true. You are no different than a mouse; you just think you are.”\n Before Dominique could thank him, the walls of the cave melted around her, and she came awake on the floor of the barn, in the warmth of steaming, sleepy breath of sheep and chickens. It was clear to her now—she created the world with her thoughts, and she could alter it just as easily. At this moment of enlightenment, Dominique’s clothes fell on the floor, and a small brown mouse skittered away.\n Soon, the little mouse discovered that her new mind could not hold as much thoughts as the human one, and it worked hard to hold onto its single obsession: find an old man who was now something else. But first, she needed to eat.\n Dominique the mouse remembered that the granary was close to the barn, and hurried there, her little brain clearly picturing the earthen jugs overflowing with golden grain. She made it there safely, avoiding the prowling cats and the eyes of the humans, and ate her fill of crunching, nourishing wheat. After that, she was ready to go.\n She let her nose lead her—it twitched toward the wind, sorting through many smells, some comforting, some exciting. She noticed the smell that mixed familiarity with strangeness, fear with solace, and decided to follow it.\n The fields lay barren, and the mouse squeaked in terror as it ran between the frozen furrows of the fallow field, vulnerable in the open ground with no cover. Her little heart pumped, and her feet flew, barely touching the ground, until the dry grass of the pasture offered her its comfort. She dared to stop and catch her breath, and realized that the smell grew stronger.\n She found an entrance to an underground burrow, and followed the long and winding tunnel. White hoarfrost covered its walls, and the anemic roots extended between earthen clumps, as if reaching for her. The mouse shivered with fear and cold, but kept on its way until she saw the pale light, and heard soft, high-pitched singing echoing off the white burrow walls. Dominique the mouse entered the large area in the end of the tunnel, and stopped in confusion.\n The candles cast the silhouettes of the gathered field mice, making them huge and humped. The mice were serving the Mass. Their voices rose in solemn squeaks, and their shadows swayed in a meditative dance, rendering the walls of the cave a living tapestry of black, twisting darkness and white frost, glistening in the candlelight. The mice prayed for sustenance.\n Dominique stayed in the back of the crowd, too shy to come forth and ask her questions. Even her desires grew clouded, and for a while she could not remember why she was there. Snatches of thoughts and images floated before her dark beady mouse eyes: a jug of grain, the thick arm of her father clutching across his wife’s pregnant stomach as they slept, a stretching neck of a new chick. An old man with the eyelids like funeral mounds.\n The mice stopped their chanting, and lined up to partake of the Eucharist. The mouse who was a priest by all appearances held up a thimble Dominique recognized as her own, lost some time ago, and let all the mice sip from it. Dominique joined the line. Several altar voles helped with the ceremony, distributing grains of wheat and helping the feeble with the sacrament.\n Dominique shuffled along, and waited for her turn. No one seemed to notice that she didn’t quite belong there, and the vole shoved a sliver of grain into her mouth. She chewed thoughtfully, as her eyes sought to meet the gaze of the priest.\n Finally he turned to her, his work completed. “What do you want, daughter?”\n Dominique found that she could communicate with the mouse priest easily. “I’m looking for an old man.” She stopped and wrinkled her face, trying to remember. “He died, and become someone else. I have to find him.”\n The mouse priest moved his sagging jowls with a thunderous sigh. “We dreamed of the others coming into our midst, and we prayed for signs . . . none came.”\n “But I smelled him here!”\n The priest turned away, mournful. “It was God you smelled.”\n Dominique sighed and followed the mice, who filed out of the main chamber into a complex system of burrows. She found a tunnel that led upward, and enticed her with the smell she sought.\n The snow had fallen while she was underground, and she sputtered and shivered as the white powder engulfed her, its freezing particles penetrating between hairs of her coat. She half-struggled, half-swam to the surface.\n Buddha was outside with his dogs, running weightlessly across the moonlit snow. His dogs preceded him, their noses close to the ground. They followed a chain of danger-scented footprints. A fox, Dominique guessed, mere moments before seeing the fox.\n It looked black in the moonlight, and it dove into the snow, coming up, and diving again. It seemed puzzling at first, but then Dominique heard muffled squeaks, pleas, and cries of pain. The fox was hunting mice, too busy to notice that Buddha’s dogs were stalking it.\n The fox sniffed the air, and turned its narrow muzzle toward Dominique. Her heart froze in terror, and her feet screamed at her that it is time to run, run as fast as possible. But she remained perched on two hind legs, looking the fox straight in the eye. “Have you seen my grandfather?” she asked the fox.\n The fox stopped and tilted its head to the shoulder.\n “He’s not a mouse,” Dominique explained. “At least, I don’t think so. He died and was born as someone else.”\n “Ask the mice,” the fox suggested, yawning. Its teeth gleamed in the moonlight. “They would know—they get everywhere.”\n “I tried. But they are only praying, and—”\n The dogs she had forgotten about pounced. The fox shrieked, trying to shake two small dogs that latched onto the scruff of its neck.\n “All things die,” Buddha commented.\n The pale petals of the stars came out and the moon tilted west. Dominique alternated between burrowing under the snow and running on the surface. She followed the trail of the fox who ate so many of her brethren.\n Dominique did not need to sleep; her dream fits were but a distant memory. She wondered if all mice were sleepless, and realized that she had never seen a sleeping mouse. She also wondered whether they spurned Buddha because he only came to those who slept.\n As she contemplated, she realized that the smell that was urging her on was growing weaker. She turned her snout back, and caught it again—back where the fox full of mice was being rend to pieces by Buddha’s dogs.\n The old mouse told her that it was smell of God, and she turned back to the mouse burrow, to the church. To her horror, she found the burrow desecrated, dug up, and the surviving mice huddled in the ruined passages.\n The old mouse priest was among them. He shook and cried. When he saw Dominique, he hissed. “It was all your fault; you brought the fox to our church.”\n Dominique shrugged, unsure if she was able to take on a burden of another responsibility. The smell of her dead grandfather was overpowering around her, emanating from all the mice, and especially the old priest. Even her own breath carried the scent of him. “You told me that was the smell of God,” Dominique told the priest. “But where is it coming from?”\n The priest still wept. “His flesh was made grain, and this is what we take as our Eucharist. The flesh of God.”\n Dominique remembered the taste of the grain sliver on her tongue, and squeaked with frustration. Why did she think an old man would come back as a mouse or a bird? What better destiny was there than to be wheat?\n She remembered the golden expanse of the ripe ears of wheat, the singing of women, the even thumping of the threshers. She thought of her grandfather, when he could still leave the house, walking behind the reapers, picking up stray ears fallen to the ground, smelling them, chewing their milky softness with his toothless mouth. And then, she missed home.\n She comforted the mice the best she could, telling them of Buddha and his protective dogs, but she never told them that the flesh of the grain was her grandfather’s, that he came back to her in the taste of wheat and the communion of mice.\n She spent the night and the next day digging new burrows, and collecting what grain was left in the field, so her mouse brethren could have shelter and the Eucharist. But her heart called for her to go home, until she could resist the urge no longer.\n Dominique was tired. Her small feet screamed with pain as she crawled back into the village. She wanted to be human again. She remembered vaguely the words of a round gentleman, punctuated by sharp barking sneezes of his small needle-teethed monsters. But she could not recall their meaning, she could not remember how she became a mouse, her feeble memory overpowered by the taste of wheat.\n The only recourse left to her was to do what all mice did in a situation like that. She skittered along the row of straw-thatched houses, listening, looking. A sharp, salty smell attracted her attention, and she circled a small house, its doorway decorated with wilting, frosting garlands of wheat and oak boughs. Newlyweds.\n She found a narrow slit between two planks by the door, and squeezed inside. It was warm and the house was filled with smoke from the dying embers in the woodstove. Two people lay in the bed, asleep, naked.\n Dominique’s nose twitched as the smell grew stronger, and she followed it up onto the bed, light on her feet, scampering across the folds of the sheepskin covers.\n The sleeping woman shuddered but didn’t wake up as the tiny mouse claws ran along her thigh.\n The smell was overwhelming now, and the mouse closed her eyes, and squeezed into a narrow, moist passage that smelled of sea. The woman moaned then, and the soft walls that surrounded Dominique shuddered.\n She reached a widening of the burrow, and entered a warm, unoccupied cave. There, she curled into a fetal ball, tucking her long tail between her legs. Soon, her tail would fuse with the walls of her fleshy cave, and she would become a small person, with the black liquid eyes and restless jaws of a mouse.\n Ekaterina Sedia resides in the Pinelands of New Jersey. Her critically-acclaimed andaward-nominated novels, The Secret History of Moscow, The Alchemy of Stone, The House of Discarded Dreams, and Heart of Iron, were published by Prime Books. Her short stories have sold to Analog, Baen's Universe, Subterranean, and Clarkesworld, as well as numerous anthologies, including Haunted Legends and Magic in the Mirrorstone. She is also the editor of the anthologies Paper Cities (World Fantasy Award winner), Running with the Pack, and Bewere the Night, as well as forthcoming Bloody Fabulousand Wilful Impropriety. Her short-story collection, Moscow But Dreaming, will be released by Prime Books in December 2012."}