{"fingerprint": "Nb+QFtb7zUm5MSSmu8QXKCGjBFo=", "sitename": "Clarkesworld Magazine", "title": "How Candle Girl and V Took On 2MB by Gord Sellar", "author": "Gord Sellar", "date": "2008-04-29", "source": "https://clarkesworldmagazine.com/sellar_10_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: How Candle Girl and V Took On 2MB by Gord Sellar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nHow Candle Girl and V Took On 2MB\nIt was two long months of candlelight demonstrations in Seoul.\nThey began on May 2nd. The only blockage the police erected then was a flimsy perimeter round the protest area. But soon, downtown Seoul would fall into a nightly ritual of lockdown at sunset: the adjacent road leading to the Presidential Blue House were blockaded with dozens of grill-windowed “chicken cage” buses from around sundown until early morning. The day protests peaked, on June 10th1, they switched to stacks of greased and sand-filled shipping containers, but this overt symbol of economic globalization egged some protesters on, and waves of ridicule convinced them to switch back to using buses the next day.2 Riot police—mostly college boys doing mandatory military service—were constantly present: holed up in or behind the buses, marching in phalanx, sometimes being pummeled by protesters, and more often doing the pummeling.3 (And sometimes, during lulls, meeting their girlfriends in nearby coffeeshops.) Decontextualized images appeared online, fruiting memes: rampant police brutality, radical demonstrator violence.4\nIt’s harder to describe the protesters. The rallies varied, sometimes utterly different from day to day, but they began gently. The evening of May 2nd felt like a street festival, a lively crowd chanting and singing with chotbul—candles shrouded in paper cups—in hand. Immediately, left- and right-wing media alike exaggerated the involvement of children in the movement, spinning fantasies of cynical child-exploitation or precocious futurist heroism. In reality, people from all walks of life, and of all ages—grandparents, office workers, pregnant women, and, yes, teenagers—had gathered, even on that first night. The crowds had chanted denunciations of the Korean media and their new President—beseeching both to “wake up,” and decrying both as “garbage”—but they seemed less enraged or frightened than determined and optimistic, and hopeful that their President might listen to what they were saying.\nThey were talking about beef imports, and concessions he’d made regarding U.S. beef import regulations. Mad cow disease was a focal concern. “You eat madcow!” they ordered the President. It had the look of something bound to fizzle out in a week or two, one among many such protests here. Nobody guessed it would last over two months, paralyzing the government, that sometimes hundreds of thousands would march, that Catholic clergy, urging nonviolence, would lead Buddhists and Protestants into the fray, or that the discussion would dominate news, the Korean Internet, and classrooms.\nIt wasn’t just about beef, though. This stew roiled and bubbled with political frustrations and fears. Also, certainly, a dash of nostalgia for the thrill of mass solidarity: hordes of red-clad Team Korea supporters had flooded the very same streets5 during the World Cup soccer tournament of 2002 to cheer, chant, and synchro-dance to looping techno too—though, this time, the lyrics were taken from the National Constitution, repeatedly declaring: “South Korea is a democratic nation . . . ”\nAnd another, subtler ingredient distinctly flavored this stew: a blend of SF and fantasy tropes, retooled for Korean society, which defined the rise and fall of this movement.\nMichin So\nIf you want a picture of what terrified Koreans about US beef, imagine a nation with a hoof stomping on it—forever.\nAnd then picture a manically-grinning Korean politician riding on the back of that stomping michin so (“mad cow”), wearing a cowboy hat. It’s oddly cartoon-like, this image, but it drew thousands onto the streets.\nFood is a huge deal in Korean society. People talk about food all the time. How hungry or full they are; whether this or that is delicious or not; what and when and where they’re craving. One common greeting in Korean is, “Have you eaten?” Food shows are popular on TV, and no Korean film is complete without characters sharing a meal.\nTraditional, essentially magical, concepts still linger. “Long” foods, like eel, are considered good for men’s sexual “stamina.” Kids are given sticky foods before tests so memorized answers will “stick” in their minds. News reports routinely boast of “scientific proof” that kimchi, the emblematic Korean side dish, can fend off everything from SARS and bird flu to stomach cancer. Part of this mythology dictates that locally-produced foodstuffs are somehow healthier for Koreans than imports. Although not universal, this belief is widespread enough to help keep Korean foodstuffs on the market despite cheaper competition, like imported Australian beef.\nMy point isn’t how wacky those gosh-darned Koreans are. It’s just that food has a special importance in Korean culture, one unparalleled in America. Between food and politics, there’s no contest: political apathy has spread like crabgrass since democracy supplanted dictatorship in the late 1980s. Participation in the last election was among the lowest of any since democracy was achieved here.\nSoon after Lee Myung Bak was inaugurated as President of South Korea, his approval ratings collapsed. One reason (of many) was a decision he’d made as the Seoul’s mayor—not to bother with proper security—contributed to the incineration of a major, treasured national monument called Namdaemun (“The Great South Gate”)6 by a madman, only a week before Lee took office. His characteristically callous response didn’t help matters.\nAs the monument goes, so goes the nation. Korean society takes inauspicious metonymy seriously. The national mood darkened; doom lurked on the horizon. Still, even then, only one thing could overcome the apathy and launch a sudden, mass political movement . . . a narrative about food.\nMad Cow, Mad Science, & Mad Scientists\nPD Diary is a tabloid TV show, specializing in moral panic over “illicit” foreigner-Korean sex, territorial disputes with Japan , ridiculous urban legends like “fan death.”7 Sometimes, they get things right: PD Diary outed Dr. Hwang Woo-Suk, Korea’s fraudulent stem-cell researcher. But often, it’s just tabloid TV.\nOn April 29th, 2008, PD Diaryaired an episode8 that was a recipe for panic, combining dystopianism, SF and fantasy tropes, and urban legends to get the political stew roiling furiously. After building a (sham) case upon mistranslations and outright deceptions “proving” a BSE epidemic among American cattle, and a hidden epidemic of variant Creutzfeld-Jakob Disease (vCJD) in America, they unveiled their last, horrifying piece of “evidence.” It was a scientific paper by Korean researchers led by Hallym University’s Dr. Jeong Byeong Hun that they claimed “proved” that 94% of Koreans were especially vulnerable to vCJD, because of a genetic predisposition determining how most Koreans synthesize amino acids.\nIt may sound bizarre, but it caught on for a reason: when Korean education was being rebuilt after the Japanese occupation, a new national consciousness was created upon a myth of racial identity.9 To this day, it echoes in classrooms: We Koreans are of one blood. We have withstood foreign invasions since time immemorial. Little surprise that the idea of a racial susceptibility to distinctly foreign contagion resonated so powerfully.\nBy the time Dr. Jeong’s criticism of the misrepresentations came to light, it was too late: many imaginations, and protest-candles, were already aflame. Horrific visions of an insidious plague haunted the nation, sickness hibernating not only in meat, but in anything made with meat byproducts: choco-pies, tampons, soda-crackers, donuts. Slow death, invited by government policy! It was like something out of a dystopian SF movie . . .\nV for . . . Victory?\nOn June 5th, about a month into the demonstrations, a group of my media students presented their final course-project: a clever mashup juxtaposing clips from the Wachowski Brothers’ film V for Vendetta widely circulated protest footage shot by demonstrators.10\nPresident Lee was recast as Chancellor Sutler, and Korean protesters merged with the crowd of masked citizens at the film’s climax. Hilarious at moments—the parody of Lee’s haughty dismissal of public criticism is priceless—the overall effect turns chilling with footage of police violence in late May: water cannons slamming people onto the ground (causing skull fractures and brain hemorrhages, injuries the chief of police declared were “impossible”).11 Injured students. A boot stomping a girl’s head.\nV was in the air; my fiancée had noticed the film cropping up in netizen discussions of the protests even in late May—a pattern that continues even now. By July 5th, the last big demonstration, two groups showed in costume—one in plastic Guy Fawkes masks, the other wearing paper printouts held up with string. By all accounts—even unsympathetic ones—their approach was dramatic, as with participants in the recent, well-publicized protests of the Church of Scientology by “Anonymous.”12\nV was not received by these protesters as the anarchist figure of the Moore comic (which has not, anyway, been translated into Korean), but as the romantic, anti-Bush, and clearly anti-authoritarian Hollywood hero. Lee is no dictator, but for many his political party’s genealogy leads back to South Korea’s brutal past; Lee’s direct competition for the Korean Grand National Party’s 2007 presidential nomination was none other than the daughter of Park Chung-Hee, dictator of South Korea from 1961-1979. Lee’s patronizing demeanour did nothing to dispel the link between him and the film’s dictator, Chancellor Sutler.\nIt’s not even V himself that captured protesters’ imaginations: rather, it was the film’s climactic moment when the frightened, apathetic public finally rose up, donned Guy Fawkes masks, and marched to the British Parliament. It’s ironic: in V, the dictator manufactured public fear of a plague to take control of his nation. In Korea, fear of foreign contagion mobilized people, politicized them and got them out into the streets.\nMore ironically, members of this nationalist protest movement consciously adopted iconography from another American import—a Hollywood SF film. They could instead easily have referenced images from the 2006 Korean blockbuster The Host, which told the story of a poor family fighting an all-consuming mutant monster and a lying, deceitful government intent on keeping up appearances. Or they could have referenced last year’s political-tearjerker May 18, about the 1980 Kwangju Massacre of pro-democracy protesters. Yet, to articulate their criticisms, young demonstrators turned to specifically American pop culture, as if to reiterate what many individuals told me, assuming I was American: it’s not about your country, and it’s not really just about beef either.\n2MB vs. Candle Girl\nAll told, V remained a minor character. If the protests in Seoul were a video game, the iconic protagonist was Candle Girl, a cute little-kid mascot in a blue school uniform with a protester’s candle gripped in one hand.13 And the Megaboss she battled against was 2MB, the grinning Korean President, riding upon a pale madcow.\nThe nickname “2MB” appeared online long before the protests, but was popularized on the street. In Korean, the words for “two” and “Lee” are homophones, so 2MB is a pun on Lee’s initials, disparaging his mental “disk space.”\nIt’s a cyber-putdown for a cyber-generation, a part of Korea’s first technoprotest ever: from an impeachment poll launched by a teenager before the protests began14, to the mass-emailed and phone-texted messages that facilitated demo-flashmobs, Korea’s considerable wireless and internet telecom infrastructure defined these protests. Literature and poster icons were disseminated online; decentralized websites hosted debates, organization discussions, and advertised plans and organization15; protesters relied on online newsreports; events were webcast live to audiences of millions thanks to college kids armed with laptops and videocams; online photography clubs volunteered to document police brutality; online fund-raising drives self-organized to feed demonstrators; at one point, hackers even defaced Lee’s GNP website with a picture of a dancing cat, a reference to another of Lee’s epithets, jwi—“rat.”16\nEverywhere—on T-shirts, posters, banners, and signs—was the slogan “LEE MYUNG BAK OUT.” (Often, as “2MB OUT.”) It was a call for impeachment . . . sort of. Some people earnestly demanded impeachment, but others seemed to be using a tactic common to Korean culture, one I learned haggling in street markets: ask for more than you can really get. Many I talked to considered impeachment unrealistic, or at least highly unlikely. What they said they wanted was for Lee to take public opinion seriously.\nUnderstandably so, considering Lee’s response to criticism: queried by journalists about his beef policy changes, he joked at one point that he “must’ve done it in his sleep.” He seriously asked of demonstrators, “Who paid for the candles?”17 But, then, the Korea he’d been working on constructing was one where common people probably couldn’tafford candles; a nation gutted of public services, thoroughly privatized, a relentlessly neoliberal Korea.\nThe wealthy ex-CEO Lee was elected because people hoped he would “save the economy.” Yet even many Lee supporters were dubious about his project proposals: switching public education over to English-language instruction; privatizing health insurance and water; building a transpeninsular transport canal bound for economic and ecological disaster. Many felt Lee’s governing style was toomuch like a CEO’s,. By June, his approval ratings had dropped to 17%18.\nBack when he was mayor of Seoul, Lee decided—apparently without consulting the millions of Buddhists, atheists, and other non-Christians in the city—to “dedicate” the city to God and declare its citizens “God’s People.”19\n2MB’s opponents, obviously, held no monopoly on grandiose fantasy.\nThe Aftermath\nThe roads are now clear of all but a small core of diehard activists, and though they continue to gather semi-regularly, the mass movement behind the anti-2MB demonstrations has dissolved . . . for now. Legal proceedings have begun20, concessions have been made, and the streets are (mostly) quiet. No longer do young women joke about trying the “chotbuldiet” plan. The food stands and devil-horn vendors have moved on, and the candles have mostly been extinguished. Fear of US beef is waning, and the masses have gone back to their daily lives.\nProtest organizers have been accused of manipulating public fears. However true this is, it smacks of the pot calling the kettle black. Public fear of U.S. beef were exacerbated, from the beginning, but the protest organizers weren’t the only manipulators. Protesters denounced Korea’s biggest newspapers as manipulative “trash.” Within a week of the last big rally, two major newspapers were forced to apologize for staging photos that accompanied stories claiming the tide of US beef fears having turned already.21 There’s blame enough to go around: Lee’s patronizing attitude, police violence, a minority of violent, extremist radicals, and corrupt media across the political spectrum.\nKorean SF fans are, predictably, seeing things a little differently. The “Politique” column of Korea’s biggest SF magazine, Fantastique22, was abuzz this summer, ranging from discussions of the use of “zombie” imagery to describe both protesters and the threat of vCJD, exploring the dangers of an Avian Influenza H5N1 pandemic23, and stressing the positive power of “rumors” or “fears” to awaken and overcome “blind” government-urged complacency and raise public concern over other potential disease outbreaks like SARS and H5N1.\nPerhaps it’s no accident that the National Film Archive recently ran a retrospective on Korean gwaesu (giant monster) movies. Watching gargantuan monstrosities attack both Seoul and tiny villages, images of the protests ran through my mind. The threat posed by the rampaging horrors in all of these films seemed to be exacerbated by the inept, stupid, or arrogant government and military officials “handling” the situation.\nMost resonant with the protests was the conclusion of the Korean monster movie The Host. The scene set up a sequel—though apparently the upcoming 2009 release will be a prequel set during Lee’s stint as mayor of Seoul24—but it also captures the mood of many who participated in the biggest mass demonstrations. After the rampaging monster has been taken down, the protagonist goes on with his life, but remains wary, staring out into the gloomy darkness of the river from which the beast once emerged. President Lee may not (quite) be a mutant horror risen from the Han River, but many, though once again at home and relaxing, are even now gazing out their windows toward the Blue House with similar wariness.\nWill there be a sequel to 2MB vs. Candlegirl? In the immediate future, it seems unlikely: the weather’s terribly hot these days, and other political crises loom, especially the current flare-up of a long-running territorial dispute with Japan. The masses seem critical of the hardcore protesters who remain active. Still, if Lee does risk another round at the joystick, we can be sure he’ll have new tricks up his sleeve.\nThough he may not realize it, so will the people. They’ve beaten harder games than this before, taken down a much worse megaboss than Lee. And if there’s one thing I’ve learned in all my visits to PC-bangs here, it’s that when they play a game, Koreans play to win.\nENDNOTES:\n1. Police estimated 80,000 participants, while organizers estimated half a million. Neither number is reasonably reliable, though perhaps the average of the two estimates might be closer to the truth.\n2. The shipping containers were dubbed Myungbaksanseong—“[President Lee] Myung Bak’s Fortress” by netizens, and the term was popularized in newspapers soon after.\n5. Indeed, these same streets have been the site of many important social and political events for more than a century. See here for more: http://populargusts.blogspot.com/2008/06/protests-public-space-in-seoul-and.html\n6. Namdaemun’s proper name, Sungnyemun, suddenly was in vogue, but only after its incineration. http://www.nowpublic.com/world/south-koreas-top-national-treasure-was-burnt-down\n9. See Chapter 2 of Michael J. Seth’s Education Fever: Society, Politics, and The Pursuit of Schooling in South Korea (Honolulu: University of Hawaii Press, 2002).\n11. An M.D. friend of my fiancée treated one of water cannon victims for brain hemorrhage, and when she reported it online, the story was widely read and taken by many as a refutation Seoul Police Chief’s claims. Many more people suffered from ruptured tympanic membranes, and video documentation and eyewitness testimony suggest that the water cannons were sometimes improperly used. Online fundraising began immediately to help pay for those protester surgeries, especially for teenagers who could not afford it. Angry protesters and netizens responded to the Chief of Police’s claim that the water cannon could not cause serious harm by suggesting that he ought to use one as a bidet.\n17. When the protests began, Lee was visiting China. When he returned home and government officials attempted to inform him of the situation, he reportedly said, “I know, I know, I use the Internet too. But tell me one thing: who bought all the candles?” Protestors replied with retorts such as, “Sure! It’s the candle manufacturers that are behind us!”\n19. Indeed, many have argued that one reason Lee won the Presidency was his mobilization of Protestant Christians in his favor. Lee has associated with those who pray for the Buddhist temples in Korea to crumble (http://en.wikipedia.org/wiki/Lee_Myung_Bak#Christianity), and indeed a newer map of Seoul issued by his government has, bizarrely, omitted all references to Buddhist temples (http://english.chosun.com/w21data/html/news/200806/200806240026.html). Few believe this was really a “mistake.” Buddhist participation in the protests surged toward the end of June, and, indeed, unlike in the democracy movement of 1987—where organizers took sanctuary in Myeongdong Cathedral—those facing arrest in 2008 took refuge in the nearby Chogye Buddhist Temple. (http://www.ahrchk.net/ua/mainfile.php/2008/2924/)\n22. “Politique.” Fantastique, Vol 14-16 (June-August 2008). Excerpts are currently available online, in Korean, for June and July (http://fantastique.co.kr/issue/issue_special_view.asp?num=83).\n23. Understandably so: just in May 2008 there were indeed two major outbreaks among poultry of Avian Influenza H5N1 in the area of Seoul. http://www.cidrap.umn.edu/cidrap/content/influenza/avianflu/news/may1208seoul.html\n24. As reported at ScifiJapan, the scriptwriter is a famous Korean webcomic artist known as Kangfull, among whose works is a comic titled 26 Years that imagines a group of assassins who seek to avenge democracy protesters (and presumably loved ones) killed in the Kwangju Massacre by killing the dictator of the time, Chun Doo Hwan. (Incidentally, Chun is still alive in Seoul today, but with considerable security expenses.) The script, reportedly set in the same place as the first 2MB demonstrations were held—an urban stream that Lee “revivified” rapidly, and thus turned into an artificial, electricity-consuming, ecological mess, ostensibly for the sake of his political legacy – may well be less than generous with the President’s political legacy.\nGord Sellar was born in Malawi, raised in Canada, and has lived in South Korea since 2002, where he has taught at universities, played saxophone in an indie-rock band, and worked as a writer, editor, and co-translator. He attended Clarion West in 2006, was nominated for the John W. Campbell Award for Best New Writer in 2009, and his fiction has appeared in Asimov's SF, Analog, Interzone, Clarkesworld, and several best of the year anthologies."}