{"fingerprint": "rviSNnWB+u/BFgPfpe5OkqKcxOo=", "sitename": "Clarkesworld Magazine", "title": "Alone With Gandhari by Gord Sellar", "author": "Gord Sellar", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sellar_03_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Alone With Gandhari by Gord Sellar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6880 words, short story\nAlone With Gandhari\nAnd the wailing chief of the cowherds fled, forlorn and spent,\nSpeeding on his rapid chariot to the royal city went,\nCame inside the city portals, came within the palace gate,\nStruck his forehead in his anguish and bewailed his luckless fate.\n—from The Mahabharata, trans. Romesh C. Dutt (1898)\nShe was out there, serene in the mists, waiting for him, and Ron was coming to her. With the whole of his mind, he willed himself to see her: her immense walnut eyes, slightly alien; her long, regal nose with its flaring nostils; her long, elegant legs.\nAnd then, suddenly, there she was in all her natural glory: no genetic engineering or hormonal tinkering had been performed upon her, and as such, she was a precious rarity. A creature of such loveliness, a sight for bruised and red-veined eyes. She eyed him calmly as he hurried toward her across the field of endless green and softly swaying daisies, under a sky so blue it would have made you weep if only it were real.\nA memory of Kenny stirred—that poor, sad, dead glob of pudge he’d once been, that Ron had murdered in an empty field one night near Fort Worth with four Brother Ronalds. The ghost of a dead lardass grasping at his spirit’s throat, trying to haul itself back up through the greasy lips of oblivion.\nRon ignored it. The remnant artifacts of Kenny Jameson’s pathetic life—an army-green trash bag full of oversized clothes and whimpering regrets—had been left to rot in a shallow hole in the ground behind a shopping mall. With Guru Deepak’s help, he’d long ago learned how to deal with Kenny’s ego, the remnants of the man Ron had been before his rescue. He slowed his pace as he approached Gandhari, savoring the scratchy caresses of the high blue grass against his naked legs.\nWhen he reached her side, he patted her twice upon the hip, with all the gentleness of a tender lover. “Namasté, Gandhari. Now, look at me,” he said with a smile. “Look at my body.” He glanced down at his own taut gut, the thin threads of wasted muscles beneath his somehow-clean skin. He had become somehow translucent, and could see the his own knobby, badly-carved kneecaps, the weary veins in his legs, the clutching bones of his ribcage, and even the curve of his pelvic bones through his patchily tanned, hairless hide.\nGandhari turned her head, lazily surveying his physique. She belched, and a heavenly draught bathed his face. He was suddenly moved by his passion for her, great Gandhari, gods-kissed blindfolded mother of a hundred sons from the Great Book, who had long ago attained her true and perfect form. He touched his lips to her forehead, between her eyes, and in response, she lovingly swished her tail over her back, an ancient gesture that meant nothing but pure bovinity in this world where flies buzzed no more.\nHeart swooning, he made his way to her rear, and as he did so, she steadied herself, bracing. Gently, and with the greatest of reverence, he stuck a hand into her, and then another. He pried her open, drew a deep breath, and slid headfirst into the peace of the divine mother-cow’s womb.\nWithin her, there were others. The sounds of breathing and mumbled prayers and mantras. And Guru Deepak, preaching off in the distance, his voice muffled but undeniably musical.\nRon ignored the others. He relaxed, breathing mother Gandhari’s life-giving uterine fluids into his lungs, leaning back against the soft, warm walls of her womb. He was alone with Gandhari, within her. He was home, again. Nothing else mattered.\nThen she spoke to him. Close by, tender yet clear, it was her womb-voice speaking to him alone, and he dreamed the most loveliest visions: of broken buildings, smoke and flames, and a endless, rising wave of liberation sweeping the earth entire.\n“Listen, Kenny,” Mr. Paul said to him one day, in the staff room during his lunch break. “I’m gonna have to let you go.”\n“Why?” Envelopes with little plastic windows filled Kenny’s mind. Bills inside them, and sternly worded final notifications. Without Prejudice.\n“You really wanna know?”\n“Uh . . . yeah?”\n“Because you’re a fat fuckin’ pig, Kenny,” his boss said. “People don’t wanna see you servin’ their french fries and deep-fried, greasy chicken, Kenny. It reminds them of why they shouldn’t be eating it in the first place. It’s bad for our image.”\nKenny wanted to shout, to punch Mr. Paul in the stomach, to tell him to go screw himself, shove the job up his ass sideways. He knew his rights! He didn’t have to take this! He wanted to chuck his soda onto Mr. Paul’s shirtfront and tell him to ram his shitty job up his skinny little ass. But he just retreated inside himself, and began thinking again about how to check out of hotel butterball.\nPills, Kenny decided, but he lowered his head, and just mumbled his response.\n“What?” Mr. Paul sounded defensive, as if he expected a lawsuit or an outburst or something. But Kenny wasn’t going to sue. He’d grown accustomed to maltreatment. That was just how fat people lived: obesity was the new leprosy. People even avoided your touch, like it was catching or something.\n“Should I finish out my shift?” he asked again, louder. It was a bad time to be out of a job, with talk of another war in the air. Though at least he was too fat to be drafted. They’d never send him to Venezuela, let alone North Korea.\n“Nah, just go on home,” he said, stealing one of Kenny’s fries and shoving it into his mouth. “We’ll mail your last paycheck to you.”\nKenny nodded, defeated, and turned to leave. Pills.\n“And Kenny . . . don’t come back here again till you lose a couple of belt notches, you hear me?” Mr. Paul said, half-smirking.\nKenny never did go back there, though it’d be the first place Ron would attack, a few months later.\nMeditations always ended, but today, they faded out too soon, and Ron found himself back in the claustrophobic hell of a media helmet that stank and was stuffy with desert heat. No matter how necessary the return to the world was, it always deadened him a little to leave behind the soft electromagnetic massage of the helmet and his brief audience with ultimate reality.\nHe removed the helmet carefully, wrapping it again in an old patchwork quilt, and rose to stow it for the day. All around him, other Ronalds were doing the same thing. There were so many of them: Mexican, black, gringo like himself, female and male alike. Some were wrapping their helmets, and others, that task completed, were sleepily ruffling their dyed-scarlet afros, slipping into their grungy yellow jumpsuits.\nGuru Deepak, shirtless in his golden dhoti, stood beside the storage shelving units in the back of the decrepit U-Haul trailer behind one of the campers. He smiled toothily and mouthed encouragements to them as they stowed the VR gear safely away. To Ron, he said, “Mother Gandhari has blessed you specially,” and set his broad hand on Ron’s shoulder.\nRon didn’t know what to say. He hadn’t spoken to Guru Deepak in days. Not out of any animosity: it was just one of his silence kicks, the sort of habit Deepak indeed praised and tended not to interrupt.\n“Why?” Ron asked, after a moment’s dazed thought.\n“Later,” Deepak said with a small shrug of his powerful shoulders, and showed him his beautiful white teeth through a grin. They were perfectly straight, a show of dental perfection that could only be divine in nature.\nBreakfast always followed meditations, so Ron made his way to the kitchen. A big vat of greenish dhal was bubbling in a cookpot on the ground, and a huge tray of breads—naan, loaves, buns—sat together in a big assortment. Bean soup again, he moaned inwardly. But immediately, he caught himself, seized his own disappointment, and pinned it to the wall of his mind as one might a live frog for dissection. He jabbed his resentment with harshness he’d once reserved for lily-livered politicians and hardened criminals.\nBless Gandhari, his craving for meat hadn’t returned. His self-control was always greater after a few hours in Her womb. A few minutes later, a bowl of dhal and a few hunks of bread in his possession, he sat down in his usual place, among usual faces. “Namasté, Ronald,” they all greeted him in something too jumbled to be called unison.\n“Namasté, Ronalds,” he said. “What’s up?”\nRon had meant nothing by it, but it seemed to him that, unlike most days, something was indeed up. They regarded him with careful, awkward eyes, blinking silent and waiting for someone to spill the proverbial beans.\nFinally, the Mexican Ronald spoke up and said, with his familiar, heavy accent: “Guru say something t’you, don’t he?”\n“How’d all y’all know about that?”\n“In Gandhari’s womb,” the bony, flat-chested Ronald chick whispered, “I heard something. You know how it is.”\nRon did. Visions and whispers sometimes came. Prophecies, gleanings of Deepak’s wisdom. Burning visions of the future.\n“Last time I had a vision like this one . . . ” she said, leaning forward. “Well, there was a Mac Attack coming up soon, and that Ronald, Gandhari said the same words to . . . ” She glanced down into her bowl of dhal, dipping a chunk of whole-wheat bread into the slop, and chewed noisily, as if she had no intention of finishing the sentence.\nRon kept his eyes on her as he expertly tore a piece of bread off and used it to spoon up some dhal without looking into the bowl. When she was about to dip her naan into her dhal again, he hissed, “What?”\n“Listen,” she said. “If you’re lucky, you’ll be drinking mother Gandhari’s pure milk today. In heaven,” she added, as if the euphemism hadn’t been clear enough, and dropped the bread into her dhal. Her eyes softened a little, the tattooed-red tip of her nose wiggling as she sniffed, and with a lowered voice she added, “If you want, we can go out behind the storage sheds and I’ll give you a . . . you know.” She jerked a grubby fist up and down suggestively, one gaunt cheek propping outward by her tongue as she gave him a ghastly wink. “Just in case. Nothing more, though. I don’t wanna get pregnant before It happens. He feeds on childrens’ minds; they make Him stronger,” she droned, intoning the familiar mantra that Ronalds chanted to fend off carnal temptation. “But I’ll get you off, one last time before . . . ”\n“No thanks,” Ron said, and filled his mouth with hot, flavorless green bean mush. It wasn’t much of an act of will: she wasn’t his type, her breath stank, she was missing half her teeth, and anyway, he didn’t believe he was going to be a martyr. He’d done nothing to distinguish himself or earn such an honor. And even if Gandhari had chosen him to lead a mission, it didn’t mean he was going to die.\n“Are you sure?” she said and licked her bright-red lips, her eyes slightly narrowed. He realized that she wasn’t being generous: she really wanted to do it. He wondered how many other martyrs she’d led off the path, the same day they were supposed to drink straight from Gandhari’s udder, and sent them spiraling back into the samsaric rut of reincarnation and flesh-addiction.\nWho hungers for flesh of one kind, hungers for all, went Guru Deepak’s motto.\nWas it jealousy, that Mother Gandhari always chose men to lead the Mac Attacks? Or some vestigal human instinct, half-dessicated lust? He imagined the Ronalds he’d admired: those he’d seen shot to death in the parking lots of ghastly eateries, and those whose bodies had been charred by fires or clapped in irons and shipped to reprogramming facilities, their animal bodies trapped and ensouled once again by the System. He imagined himself out behind the storage sheds, or huddled in the cab of a truck, or somewhere behind a clump of bushes, with her rancid breath wafting hot across his skin. Thick, acidic bile scoured its way up his throat.\nStop, he commanded himself, and he stepped back from all of these overwhelming emotions that had welled up within. From a slight mental distance, his envy and desire looked pathetic. His own disgust peered back at him impishly. They had fused, and sang in one voice. But when he looked deeper, he found sorrow and disdain, braided into one single wormlike creature and wriggling within his mind. He looked upon his flat-chested Ronald Sister and abjured that strange sadness-and-dislike emotion, struggling for compassion.\n“No thank you,” he said with a smile, and admonished her with a mantra of his own. “After a Single Sip, Only a Big Gulp Can Follow.”\n“Yes, true,” she said, nodding, and attacked her food. She tried to look relieved, but refused to meet his gaze again the whole meal. That didn’t surprise him; what surprised him was that none of the other Ronalds caught his eye again, either.\nThe first time he had seen a Mac Attack, he’d almost pissed in his size-52 pants. He’d been standing in the usual burger joint when suddenly they’d burst in, yelling through the speakers mounted on the fronts of their gas-masks.\n“Killers! Murderers!” they’d screamed, those freaks. They had looked like Holocaust victims done up in soiled yellow clown costumes, red grins tattooed onto their faces, red curly wigs slapped onto their bald crowns. “You’re filthy! You’re insane!” Even in his panic, he’d thought, Look who’s talking. He remembered that, the way one remembers being a heartbroken teenager, or remembers the panic of holding a steering wheel for the first time: the memory of another person altogether, was what it now felt like to Ron.\nBut he hadn’t yet become a Ronald, then. He had been a different kind of human. No, not human, either. A man, maybe, but not human. He’d been a mere scraping beast. A herd man. Kenny the flabby herd man.\nSeeing the Ronalds in action, he’d seen not their liberation from mediocrity, but only the dirt clinging to their faces, the blood and grime ground into the fabric of their costumes, the dung clinging to their floppy red shoes. They’d been liberated from the trap of ego and identity, and attained McMoksha, but through the thickening haze of the gas bombs they’d set off, he’d stared into their eyes behind their gas-masks and seen only one thing: crazy.\nLittle had he known, as he’d stumbled out the side door, through the parking lot, coughing and sputtering on the fumes, that he was the crazy one. He’d staggered past the rear bumper of his second-hand jalopy of a truck, its bumper crusted in consumers’ rights bumper stickers with blinking mottoes like: “Hands off my fried chicken!” and, “My lard, my life.”\nHe’d burned the last reserves of his energy hoisting himself up into the seat of his truck, squeezing in sideways, getting his foot onto the gas pedal. Still choking and coughing, he’d started the pickup truck’s engine, and, not bothering with the seat-belt—it didn’t fit him anyway—he’d slammed his foot down onto the accelerator.\nHe’d managed to cling to consciousness long enough to get down the road and slam his truck into a traffic-light pole in front of a gas station. Someone had already called 911 by then, and when the ambulance had shown up, they’d just given him an injection and a coffee and made him sit by the gas station and wait for the cops to come and take his statement. They’d even let him drive himself home an hour or two later.\nHis truck had been seriously dented, but his mind had been damaged far worse. The attack had hit him harder than the last international foreign terrorist attacks all rolled into one. It took him a week before he went to a burger joint again.\nNo other week in his life had ever felt as much like forever.\n“My dear, brave Ronnies!” Guru Deepak declared to the eager assembly of the faithful.\nThey paused, setting their preparations aside, and turned to face their guru, settling on their backsides in the hot sand. White face-paint set off the black crusts beneath their fingernails, and excited gap-toothed smiles lit up their pimpled, scarred faces.\n“Today, we launch a very important assault,” Guru Deepak declared, his head wobbling side to side insistently. “All our past struggles have led up to this. Yes, this is very-very important! Today, we end our endless attacks on the lowest levels of the death chains. The world has heard our message, and had many chances to heed it. The willing have already joined us.”\n“And those who have chosen to ignore us . . . it is a tragedy, my Ronnies. It is heartbreaking. Every one of you knows what it was like to be a carnivore, to feast on the blood and bodies of poor animals. Every one of you, until you joined us, turned a deaf ear to the screams of murdered beasts suffering in your own flabby bellies. You thought you were punished for it, when being fat was almost a crime, but no punishment ever stopped you. Who aided you? Yes, I did . . . in Gandhari’s name.”\nRonald felt a tear in his eye. It all came back to him now, the people had stared at him. Their hissing whispers, as he’d gone by, echoed in his tortured soul. He remembered catching eyes with other fat people, obese women who’d looked at him with those wide, sorrowful eyes. I know, their looks had said, and he’d avoided their gaze. He hated those looks. Pious, hopeful pity. He had pitied those women back, who were surely as lonely as he was, but nonetheless he’d seen them as bulbous hags he would never stoop to touching. He’d never made one fat friend, ever. He’d hated fat people with a passion most people never experience in their happy, healthy lives.\nAnd now, he looked down at himself, and he could see the bones within his arms; he could bend and touch his toes without any trouble; he hadn’t had a backache in months, though his muscles still twitched and shuddered every once in a while, and some of his teeth were coming loose. He never felt lonely anymore, though he didn’t feel the opposite of lonely, either. He wasn’t sure, even, what the opposite of lonely was.\n“It was no sin. Being fat was a symptom. Not of your glands, my Ronnies, for none of you is fat now, and we have not changed your glands. Not of symptom of weakness: you are not weak people, and the world shudders when we attack. It was a symptom of your society. We know what it was a symptom of, don’t we?”\nThen the Ronnies began to recite the mantra together, Ron’s voice one of dozens. They chanted this mantra together whenever a craving for fries or a burger hit one of their group:\nRavenous mouths, ravenous heads,\nDevouring bodies and the earth,\nThe sickness of the living dead,\nEternal death, empty rebirth.\nThey repeated it over and over, faces turned skyward and eyes closed heavenward. After three, maybe four dozen repetitions, Ron felt a firm hand on his shoulder.\nHe opened his eyes, and standing above him was Guru Deepak. The Indian gestured with his eyes toward the center of the crowd, from where he’d been speaking, and whispered, “Come on.”\nRon rose on wobbly legs and followed him to the elevated platform at the crowd’s center, and just as he reached it, a few Ronalds—those in Deepak’s inner circle, clown-masked female eunuchs who went about with their beautiful bodies nude, clean and smooth and white as a millionaire’s finest dishplates—led a blotchy-coated, thin brown cow out onto the platform. Deepak tried to keep Ron distracted, but he glimpsed a muzzle on her nose, holding her mouth shut. The eunuchs slid it off quickly once they got her onto the platform, and after a few moments, she let out a loud, insistent moo.\nThe chanting stopped. Eyes bloomed slowly open, heads nodded downward from blind sky-gazing, and they caught sight of the cow.\n“It is Gandhari!” Deepak hollered, and the Ronalds howled back with ecstatic joy. The cow flicked her tail listlessly, and farted. “She has chosen a Ronald to lead the mission!” he cried out, and Ron felt the guru’s hand clap him on the shoulder.\nThe joyous screams grew louder still as the Ronalds surged toward him and the cow. Their tattooed red mouths and noses, their teary eyes, blurred before Ron, and he turned to the cow. With all his might, he fought the ghostly poison of Kenny’s illusions, and willed himself to see not the sickly Jersey cow before him, but instead the true, beautiful, utter Gandhari.\nAnd then it was effortless, seeing ultimate reality: she was standing right there before him, eyes burning with divine love as she chewed her timeless, life-giving cud. She exuded holiness, contentment. The cow radiated ineffable hope.\nRon felt a boundless joy he’d never felt before.\nThe meeting had been held in a small room in the downtown Fort Worth YMCA. Corpulent men and women had sat in a circle, talking about their addictions. A.A. for the Obese, the counselor had said. It was the only way the hospital had let him go, after he’d failed to kill himself with painkillers one Sunday afternoon.\nRon had found the rules were insulting. A higher power? You had to believe in God to stop pigging out? Ten steps, twelve steps . . . whatever. That last night at the Y, he’d made up his mind not to come back.\nBut at the end of the meeting, the counselor, a gaunt Yankee with a shaved head and some kind of certificate from a nothing college in Vermont, had caught his arm and said his name softly. “Kenny,” he’d said.\n“Yeah?” Kenny had said, trying not to let on that he’d given up on the support group.\n“I can see what you’re thinking. That this group isn’t going to help you.”\n“Naw, it ain’t that.” Kenny had been like that, then—so terrified of the truth: frightened to say it, frightened even to acknowledge it. “I’m just having an off day, and . . . ”\n“No, you’re right to think it. This group isn’t going to help you. But I know someone who can. I know someone who can free you. You know, I used to be . . . ” He paused, a droplet of sweat on his brow sliding softly down in the harsh fluorescent light.\n“What?”\nThe group facilitator had reached into his wallet, and pulled out a picture of an enormous man. A man so heavy it was difficult to imagine him walking, seated at a cheap diner table with a burger meal set in front of him, smiling.\n“That’s what I look like five years ago,” he’d said.\n“Well, lucky you,” Kenny had said, eager to flee his chance at liberation. “So for you it was just diet. Not glandular, or . . . ”\nKenny had tried to push past him, but the man had stopped him, and said, “You know, people have glandular problems all over the world. But there is nobody this fat in Myanmar. There’s almost nobody this fat in Uzbekistan, either.” He lowered his voice when he said the names of those countries, looking around anxiously. What, was he paranoid too? As if any government department—even Homeland Security—would plant someone in a fatties’ support group! “It’s an excuse, and you know it.”\n“So what am I supposed to do?”\nThe guy lowered his voice a lot, then, practically to a whisper, as he suggested, “Why not come with me and find out?”\nKenny had noticed a few locks from the red wig in the backseat of the man’s car, just barely peeking out from under a magazine, but he hadn’t put two and two together until much later. He’d been too busy feeling mortified at how the car’s seatbelt hadn’t fit around his torso.\n“Don’t worry,” his counselor had said, nodding in that encouraging way he always did. “I’ve been there myself. It’ll get better. I promise,” he’d whispered, turning his head to scan the parking lot one more time. Then they’d pulled out just a little too fast and sped off into the night.\n“What are you doing here?” the man in the suit screamed.\nRon smiled silently, crossing the room slowly and carefully while the man scrambled with the drawers of his desk. Glass crunched beneath his feet, and somewhere in the building, an alarm wailed. He could hear the fluttering of bodies in motion, and terrified cries outside the man’s office. Fools, resisting the Ronalds who were trying to save them. He ignored all of that, and stared into the man’s eyes.\nThis was the right guy. His face had been burned into Ron’s mind during his last meditation session, within Gandhari’s womb. Ron raised his taser.\nThe man drew a pistol out from a drawer, and had it halfway up to Ron’s face when the needles slammed into his chest, through his fine tailored shirt.\n“Don’t,” Ron said, a tiny smile curving within the thick red smile tattooed into the skin of his face.\nThe man pulled the trigger. Nothing happened. He’d panicked, forgotten about the safety. That was enough time for Ron. He thumbed a button, and pain swept down the taser wires, through the needles and into the man.\nWho then howled.\n“Drop it,” Ron ordered him.\nThe man didn’t obey. His clumsy hands fiddled with the gun, and then he tried to raise it toward Ron again.\nRon increased the voltage, and the man howled again,louder, dropping the gun involuntarily. Ron’s heart flooded with sorrow and sympathy. That such a powerful minion of the death-chains could fall to the ground and suffer, writhing pathetically—he needed to be liberated as much as anyone.\nRon slipped a paper bag over the man’s head and hauled him up, still shivering, to his unsteady feet.\n“Congratulations,” he said. “You’ve just been rescued.”\nThe back of the van was crammed with people, their ruddy-cheeked faces terrified. They weren’t fat, like the death-eaters Ron had seen walking the streets earlier in the day, on the way to the offices. These were kind of people whose daily schedules allowed for an exercise regimen, for occasional liposuction when necessary, for dietary restrictions. They could afford to eat well, and . . .\nRon sighed. He had to admit it to himself: they probably were not addicted as he had been, when his name had been Kenny. They would be almost impossible to liberate. They liked living in this evil, awful world they’d built.\n“Where are we going?” shouted the CEO from under his paper bag.\n“This is just routine inspection procedure, sir,” Ron said. “We want to see the state of your cattle.”\n“You’re crazy! You asshole! We can’t go to every . . . ”\n“We don’t need to,” snapped Ron. “Y’all got an indoor ranch set up under San Marcos, don’t you?”\n“What? How do you . . . ?” One of the men reached for the paper bag on his head.\nThe wiry, half-Japanese Ronald chick from Oklahoma slapped his hand, and in her high-pitched voice, she said, “Don’t even try it, Mac!” All the other Ronnies burst out into laughter at her clever pun.\n“You’d be surprised how much we know, Mr. Dalton,” Ron said once they had stopped guffawing. He let the man stew in that the rest of the way out to San Marcos.\nIf you want to imagine the future they want to build, Guru Deepak had preached once, imagine a boot stamping on a cow’s face, forever. Ron could see the boot before him, a big black industrial jackboot made from cow’s leather. It was stomping and stomping, brutal and incessant.\nHe comforted himself with another Guru Deepak’s teachings: I am a cow. You are a cow. We are all cows. We have been, and will again be, cows. We shall graze on green fields, and somewhere, sometime else, we are cows and bulls grazing on green fields. There is a calm and beautiful cow within every one of us. Namasté: the cow within me greets and salutes the cow within you.\nThat was the message of Guru Deepak, the whole of it, the heart and soul of it, and it comforted Ron as the van rolled out along the highway towards horrors unimaginable.\nThe people had met him with smiles and encouraging looks.\n“My name is Kenny, and I’m a fast-food addict,” he’d said. They’d all sat there quietly, listening to his story. Which had been nothing special, just extra portions and aunts and uncles telling him to finish this or that so they wouldn’t have to take it home. School dances sat skipped out on, and the looming threat of diabetes. Bottles of cola every day, and the antidepressant effects of fries, burgers, desserts, and more burgers. How he’d finally tried to kill himself, and found he was too fat to die on a mere half-bottle of painkillers.\nThey’d smiled and nodded, listened generously. He’d felt weird telling them this, all these slim people, but they’d looked at him with what had felt, for the first time in years, like genuine respect.\n“So,” he’d finished off, “I’m looking at all of you, and you’re all so slim. Skinny, even. I kinda can’t believe that y’all used to be big like me. But that gives me hope. I can change, you know?”\nThey’d clapped, and one of them, an Indian wearing a long golden shirt, had nodded as the clapping petered out and the others had looked at him. Dude looks like Gandhi, Kenny thought to himself for a moment. But with muscles and more hair.\n“Oh, yes, Kenny,” he’d said with a wide, reassuring smile, his head nodding sideways. “I can help you change yourself. If you want it badly enough. But changing yourself isn’t enough. If we want to change ourselves, we must also change the world.”\nKenny had remembered, then the image he’d seen in the mirror a few days before, puke all down his undershirt, on that day he’d tried to die. Sagging man-tits under his thin yellow-stained undershirt, useless nipples as wide as silver dollars. All those eyes on him, the years and years of eyes focusing the way they do when people look at lizards and snakes. Then there had risen ache inside him, deep down at his core. He’d wanted to sleep with someone before he died. Someone real. Someone shaped like a woman—like a cello, not a pear or a watermelon. He’d wanted to run again, in this life.\n“Sign me up,” Kenny had said, and then he noticed that one of them was fidgeting with a hypodermic needle in her hand.\nRon inhaled deeply. The bovoid stench was incredible, like a million tons of rank milk and blood and the faintest hint of corn-syrup in the air. Sweet, not disgusting the way he’d expected.\nThe hairless thing’s meters-long torso hung in a tickle-harness, for all the world like an immense caterpillar shuddering reflexively from the automated stimulation. Dozens of “legs” hung floppily from its side, squirming occasionally. They looked more like enormous fins of boneless meat, each bearing only a tiny black nail—the vestige of a hoof—at its tip. Stumps of other legs, still regenerating from the last meat-harvest, were visible.\nFood and waste plumbing penetrated every natural orfice and a few artificial ones, as well. A series of udders, a dozen at least, hung from its underside, through the netting of the harness that suspended it. Pipe-feeds attached to each one. Ron could not tell whether the end he was looking at was the mouth or the ass, because the heads had been engineered out of these beasts. Superfluous, brains and faces. Not even eyes. Just tubes going in one end and out the other.\n“This isn’t a cow,” Ron said. “It shits liquid fuel and it pisses sugar water and secretes two hundred liters of milk a day. It regrows its . . . legs . . . a hundred times before they give out. It has, what, sixteen or twenty wombs? And not one brain. This thing is not a cow.”\n“Yes it is,” Mr. Dalton said, his dull eyes defiant. “According to the FDA . . . ”\n“Fuck the FDA! Screw ’em in the throat with a chainsaw!” Ron howled. “Look at that thing . . . it doesn’t even look like a land animal!”\n“What the hell do you think you look like?” Dalton snapped, and then winced in sudden fear.\nRon wiggled the tip of his tattooed-red nose and jammed one finger of his grimy white-gloved hand into Dalton’s chest. “Look who’s talking,” he said.\nFrom the corner of his eye, he glimpsed a movement. A ranch worker had lunged at him with a rifle. The gunshot blast sent all the hostages flat to the floor, Dalton included, but a thick, white-gloved hand clubbed the rancher flat onto the floor, unconscious.\nRon turned to New York Ronald—a tall guy with an Italian-looking face under his white paint and clownface tattoos. He was the one who’d taken out the would-be hero, and he kicked the gun from the rancher quickly, before turning to see if Ron was okay.\n“Thanks, Ronald,” he barked. His savior acknowledged it with a nod.\nThe ranch-monsters hung row on row, oblivious in their harnesses, deaf as fingers and thumbs cut from a body and thrown to the ground. Looking upon them, rage boiled up within Ron. He could feel Gandhari within him, weeping for the fate of her brothers and sisters, these perverted things that should have been cows.\nWhile some of the Ronalds chained up the farm-workers and office slugs together in manacles, Ron turned to his second in command—a big black Ronald who was blind in one eye—and muttered, “Little change of plans, Ronald. We’re bringing the boss man with us . . . ”\n“You sure, Ronald?” Worry was visible in the man’s sunken, bloodshot eye.\n“Yeah, no problem. Let’s do this, everyone. Hurry up!”\nThe Ronalds howled, hoisting their jerry cans and chanting all the way.\nAn hour later, the silent writhing of bovoid horrors aflame still screaming through their minds, the Ronalds shoved their prisoners out of the back of their truck, still chained together, out into the desert heat. They begged to be dropped off in the city, but the Ronalds knew better than that: Homeland Security—or, well, someone hired temporarily by DHS, anyway—would be on top of them within ten minutes of the first phone call. Faraway in the distance, thick black smoke seethed up out of the ground and poisoned the desert air.\n“We’ll drop your phones off a few miles up the road, beside the road. Someone will come and get you,” Ron said, and the door slammed, leaving them on the highway like ghosts in the sandy nothingness, the towering shadows of wind turbines slashing across the road behind them. There they left them.\nAll but Dalton, whom they drugged and shoved into a corner of the van.\n“We can save him,” Ron said, his eyes fervid, lit by the remembered flames, now distant. Eyes dark with the smoke that filled the distant air. Eyes gleaming unnaturally with a bloody passion. The others said nothing, but their eyes avoided him as the truck tore down the dirt roads, back to camp, shaking them as they sat silent, waiting.\nGuru Deepak streaked the thick red pooja paste up between Gandhari’s eyes, to the top of her head. The assembled Ronalds tossed flowers into the air, adorning her with necklaces of blossoms.\nShe mooed.\nDalton sat nearby, handcuffed. He oozed disdain. From a distance, Ron had watched Deepak argue with him until, suddenly, the shouting had cooled and Deepak had left the man sitting in the sand.\nRon’s hope refused to wither. A man like Dalton coming into the fold would be an absolute coup, a portent of worldwide victory. His gaze drifted back to Gandhari, who was being led close to him, so he cast his blossoms up into the air and cried out in joy and boundless, ecstatic praise.\nAn hour later, he huddled down to the floor in Guru Deepak’s private trailer.\n“It’s alright,” he said.\n“What?” Guru Deepak wore an incongruous frown upon his face.\n“It’s alright. I didn’t do it for any reward. I just was inspired . . . by Her—Mother Gandhari. I knew in my heart that she wanted him brought to our camp.”\n“Really,” Deepak muttered. It wasn’t a question. Ron carefully searched his guru’s face, surprised, until Deepak snapped, “How do you know what Gandhari wants? How do you know what I want?”\nRon gasped, panic shivering alive in his guts. Had he really made a mistake?\n“I . . . I just felt . . . when I saw all those . . . things . . . ”\n“I know,” Deepak said, suddenly quiet, but very, very cold. “I know who you are, Kenny,” he said, his eyes narrowing.\n“What? No . . . I’m not Kenny anymore . . . ”\n“You think I’m so naïve?” Deepak asked, a little harshly. Ron’s heart began to thump.\n“What are you talking about?”\n“You’re the fifth plant they’ve sent,” Deepak said, his accent much less pronounced than usual, and his scowl luminous. “I thought you bunch might start finding some other way to spend all those bloody taxes. Don’t play dumb with me. You know very well how Dalton’s involved. What bringing him here is going to jeopardize. You know exactly what you’re doing.” Deepak’s accent had disappeared, and with it his beatific smile. The man looked like any old business captain, suddenly, even in his long golden kurta and brand-name sandals.\n“Involved? What? What are you . . . I don’t understand, Guru,” Ron said, and he dropped to his knees. “Please . . . whatever I’ve done . . . ” Tears streamed down his cheeks, and he touched his master’s feet.\nGuru Deepak stared at him for a moment, cautiously, and then his expression brightened. “Could you really not be . . . ?” he asked. “I want you to go meditate in Mother Gandhari’s womb.”\n“Thank you,” Ron whispered, touching Deepak’s feet again, and he hurried out of the trailer to the trunk containing the VR gear.\nAs he slid headfirst into the great cow’s womb, Ron’s heart was full of fear and confusion. He trembled in the darkness, and she said nothing to him for what felt like many days. The silent darkness was bisected by the pinprick sensation of an intravenous feed being inserted into the faraway arm of Ron’s faraway body, and still, he waited, as desert heat grew and subsided, like tides on the shore.\nWhen she finally spoke to Ron, his faraway body—all but abandoned, that stinking flesh—was stretched out across the dusty ground, the helmet too heavy to support any longer. What she whispered to him was terrifying. Promises of plagues. Deadly cows wandering, dazed, through the smoldering ruins of shopping malls, speaking a language no human ears had ever heard, exhaling deadly contagion scented as sweet as wildflowers. Millions of their two-legged oppressors dead and left to rot, the meat in their bellies burning its way through them, unleashing wracking, fatal sicknesses. It was the end of the human world, the end of that long, hard, ceaseless fouling of the earth. It had come already, she told him, this end. It could never, ever be undone, she told him. She was elated, and his exhausted body bubbled with glee, knowing the plague would claim him, soon, too.\nShanti, shanti, he reminded himself. Peace, peace. Rebirth, he knew, would eventually come. He meditated, and he prayed, and it felt as if yet more months passed. Distant voices muttered somewhere over the virtual horizon, all of them too faint for the words to reach him. Rumors of a war. The gossip of an enemy, of government agents shouting, searching his body, rifling through the dreams in Gandhari’s womb.\nRon desired nothing more than to be born, in his next life, as a calf. Not as a man, at least: as something other—finer—than a human being. He yearned for his true, eternal form. To be a silent bull grazing the weeds of the remade earth. The image sang to him of the voices of choirs, the dung of the world, worms in the soil. An endless chorus of low, undulating moos.\nAnd at the far end of that eternally warm and wet silence, a ripple surged through the womb shrouding his body—still the body of a man, though he was certain it would be transformed at any moment into his true four-legged form—and with a gentle quiver, he was pushed from dark, warm, sludgy comfort toward the dry dust and cold, once again out into the frightening nighttime of the world.\nGord Sellar was born in Malawi, raised in Canada, and has lived in South Korea since 2002, where he has taught at universities, played saxophone in an indie-rock band, and worked as a writer, editor, and co-translator. He attended Clarion West in 2006, was nominated for the John W. Campbell Award for Best New Writer in 2009, and his fiction has appeared in Asimov's SF, Analog, Interzone, Clarkesworld, and several best of the year anthologies."}