{"fingerprint": "5hsWk0UF3jFYThlfJ4S9T5XNoxU=", "sitename": "Clarkesworld Magazine", "title": "Supernatural Brontës by Carrie Sessarego", "author": "Carrie Sessarego", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sessarego_05_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Supernatural Brontës by Carrie Sessarego", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Supernatural Brontës\n Jane Eyre and Wuthering Heights are classic novels that can be reasonably placed in many different areas of the library. They contain within their pages romance, mystery, coming of age stories, and morality tales. They could also belong in the speculative fiction section, due to their reliance on supernatural elements in Charlotte Brontë’s Jane Eyre and in Emily Brontë’s Wuthering Heights. In regards to another sibling, Anne, there is a deliberate absence of these elements within her works. The presence or lack of supernatural and fantastical elements displays a choice on the part of these authors and creates a specific effect on the mind of the reader—even though these books are not generally regarded as fantasy or horror novels.\n The Brontë children were Maria, Elizabeth, Charlotte, Branwell, Emily, and Anne. Their mother died in 1821 and Maria and Elizabeth died of tuberculosis aggravated by neglect at school in 1825. In addition to more formal schooling, the surviving siblings were given unfettered access to their father’s library and developed a great admiration for the poetry of Lord Byron, which was full of fantasy and supernatural elements. As part of their art studies, they admired the fantastical imagery of painter John Martin. They also relied on their housekeeper, Tabitha Aykroyd, for legends, folklore, and fairy-tales.\n As children, the siblings created vast worlds, most notably Angria and Gondal. The stories began in 1826, when Branwell was given a set of toy soldiers and Charlotte, Branwell, Emily, and Anne created an imaginary world for the soldiers called the Glass Town Confederacy. In 1827, Charlotte suggested that each sibling create their own island within the Confederacy.\n Eventually Emily and Anne, who often felt left out by their older brother and sister, created Gondal, while Branwell and Charlotte focused on the world of Angria. Stories about Angria and Gondal included not only prose fiction but also maps, illustrations, and poems. Many modern critics view the works that the siblings created about these worlds as early examples of fan fiction, science fiction, and fantasy.\n Both Emily and Charlotte wrote journal entries and letters in which they demonstrated an ability to switch their mental states from the Glass Town Confederacy to real life and back again. Charlotte eventually gave up her dream world of Angria, afraid that it was holding her back from an actual life and from artistic accomplishment. However, that fascination with fantasy appears again in Jane Eyre.\n Charlotte’s masterpiece, Jane Eyre, is told in first person narration from the point of view of a poor girl who, through sheer stubbornness, survives a traumatic childhood and becomes a governess. Jane falls in love with her mysterious employer, Mr. Rochester, and wins his heart, only to discover that he already has a wife, Bertha, who is insane and whom Rochester keeps locked in an attic room. Jane flees from Mr. Rochester and finds her long-lost cousins and, eventually receives an inheritance that makes her self-sufficient. While her cousin, St. John, entreats her to come with him to India as a missionary, she eventually returns to Mr. Rochester and finds that Bertha is dead. She and Rochester marry at last.\n Just as the Brontë sisters moved between fantasy and reality in life, Jane shows a similar ability to move back and forth between fantasy and reality. Her narration is full of metaphors and references to fantastical creatures and stories. On first meeting Rochester, she thinks of the gytrash (a legendary black dog that roams the moors). Rochester, in turn, thinks of Jane as a fairy, and at one point promises to steal her away to live on the moon. On seeing Bertha in her room, Jane thinks of “The Vampyre.” Most of these comparisons come to naught—Rochester is not a gytrash, nor does one accompany him. He’s a grumpy man with a large dog. Bertha is also not a vampire—she’s a very real woman. Jane herself is quick to disabuse Rochester of the notion that she is a fairy.\n The inclusion of these moments and other instances of fantastical imagery establish a tone in which anything might happen, and nothing can be trusted. Jane is almost always wrong about events being supernatural, but she’s correct in her feeling that she’s in a kind of a fairy-tale akin to Cinderella/Beauty and the Beast. She’s also correct when she says that Thornfield Hall reminds her of Bluebeard’s Castle, a reference to the fairy-tale in which a man has a room that must not be opened because it holds the dead bodies of his previous wives.\n Rochester really does have a previous wife hidden behind a forbidden door, and although the wife is physically alive, she is ‘dead’ in the sense that she is lost to madness and isolated from the world. Jane’s interest in fantasy helps her to keep her guard up, but it also blinds her to the real dangers that surround her. Jane’s intuition can’t be fully trusted, but neither can it be fully ignored.\n Some moments in Jane Eyre appear to be legitimately supernatural, or at least stem from Jane’s deepest subconscious. In Jane’s view, these are moments in which God works through the forces and imagery of nature to speak the truth to her. These moments push the plot forward whenever Jane is stuck in a particular place or when she has to make a life-changing decision.\n As a child, Jane essentially is a captive at her abusive aunt’s home. When her aunt locks her in the ominously named “red room” as a punishment, Jane claims to see the ghost of her uncle there. It is this vision that prompts her aunt to send Jane to Lowood School. As an adult, Jane is able to leave Lowood School thanks to some advice from an inner voice or a “kind fairy” who provides her with information she doesn’t consciously have about how to look for a job. She hears the instructions on how to write and post an advertisement in her head.\n Jane’s next major transition comes after she learns the truth about Rochester’s first wife. Jane must choose between staying with Rochester as his mistress and leaving Thornfield Hall for a lonely and uncertain future. She is guided by a “trance-like dream”:\n \n I dreamed I lay in the red-room at Gateshead; that the night was dark, and my mind impressed with strange fears. The light that long ago had struck me into syncope, recalled in this vision, seemed glidingly to mount the wall, and tremblingly to pause in the center of the obscured ceiling. I lifted up my head to look: the roof resolved to clouds, high and dim; the gleam was such as the moon imparts to vapours she is about to sever. I watched her come—watched with the strangest anticipation; as though some word of doom were to be written on her disk. She broke forth as never moon yet burst from cloud; a hand first penetrated the sable folds and waved them away; then, not a moon, but a white human form shone in the azure, inclining a glorious brow earthward. It gazed and gazed on me. It spoke to my spirit: immeasurably distant was the tone, yet so near, it whispered in my heart—\n “My daughter, flee temptation.”\n “Mother, I will.”\n \n And eventually, Jane must make a final choice—whether or not to follow her cousin, St. John, to India as his wife. Just as she is about to consent to St. John’s proposal, Jane hears the voice of Rochester calling for her. “Down, superstition!” Jane declares. “This is not thy deception, nor thy witchcraft: it is the work of nature. She was roused and did—no miracle—but her best.” Jane believes that this moment reveals what God really wants for her: “I locked myself in; fell on my knees; and prayed in my way . . . I seemed to penetrate very near a mighty spirit.”\n Jane Eyre is not usually thought of as a supernatural or fantasy novel. However, all the pivotal moments of Jane’s life are accompanied by either fantastical ideas that turn out to be mundane, or supernatural visitations. Jane Eyre is a fantasy in the sense that it represents a hope that some might hold but few attain—the hope of rising from being “poor, obscure, plain, and little,” to being wealthy, popular, and beloved. It is also a fantasy in the sense that magical events move the plot forward whenever it is at a tipping point.\n Wuthering Heights, by Emily Brontë, is explicitly framed as a ghost story. This book, narrated by several different unreliable narrators, tells the story of the doomed relationship between Cathy and her adopted brother (and possibly half-brother), Heathcliff. While Wuthering Heights is often remembered as a love story, it’s actually a horror story, permeated with the supernatural. It is about traps of class, gender, and race and the way addiction and abuse is passed down through the generations, although it ends on a note of hope that the cycle can be broken.\n The book opens with the appearance of ghosts. Our first narrator, Mr. Lockwood, passes a terrifying night at Heathcliff’s home, Wuthering Heights, when Cathy’s ghost comes to his window, entreating, “Let me in—let me in!” The book closes with the reputed sight of Heathcliff and Cathy, now both ghosts, walking the moor together. In between, the story deals with specific supernatural incidents, or incidents that are believed to be so by the characters. At the close of the book, though Mr. Lockwood refuses to believe it, local people swear that the ghosts of Heathcliff and Cathy walk the moors:\n \n The country folks, if you ask them, would swear on the bible that he walks. There are those who speak to having met him near the church, and on the moor, and even within this house. Idle tales, you’ll say, and so say I. Yet that old man by the kitchen fire affirms he has seen two on ’em, looking out of his chamber window, on every rainy night since his death.\n \n Meanwhile, images of demonic nature and demonic possession pervade the book. Heathcliff is repeatedly described as a devil, a demon, a fiend, and a monster. Heathcliff’s wife, Isabella, seriously wonders whether he is human or a “devil.” His color, described as “black” and “dark,” may also be a marker of race. In the book, it’s suggested that he might be fully or partially Spanish, Indian, or Romani. However, his coloring is more explicitly and frequently referred to by characters as a sign of his demonic nature which is inherently problematic given the ties to his implied ethnicity.\n Images of possession are also all through Wuthering Heights. Cathy has tantrums so violent that they resemble spirit possession and ultimately cause her death. On her deathbed, Heathcliff asks her, “Are you possessed with a devil to talk that way to me when you are dying?” Hindley, an alcoholic, is possessed by “the demon drink,” as alcohol was commonly referred to at the time. Charlotte even described Emily’s creative process in terms of possession:\n \n Whether it is right or advisable to create beings like Heathcliff, I do not know: I scarcely think it is. But this I know: the writer who possesses the creative gift owns something of which he is not always master—something that, at times, strangely wills and works for itself.\n \n The use of supernatural imagery and occurrences in Wuthering Heights accentuates the often forgotten fact that this is a horror story, not a romance. However, the true horror lies not in the ghostly occurrences, but in the inexorable legacy of child abuse, sexism and classism, and alcoholism. Only when Cathy’s daughter and Heathcliff’s adopted son, Hareton, find new ways to interact is the cycle broken. Whether Cathy and Heathcliff sleep soundly in their graves or roam the moor as ghosts remains conjecture, but we know that the generational horrors that plagued them have not endured to haunt the new generation.\n Anne Brontë was still a baby when her mother died. She was especially close to her aunt, since she had no memory of her mother, and in childhood was very attached to Emily since their ages were so close. While Charlotte, Emily, and Anne all spent periods away from home as adults, Anne stayed away the longest, finding work as a governess first at a miserable situation that inspired Agnes Grey but later in a more satisfactory position at Thorp Green Hall. For three years, Branwell worked there as well, as a tutor. Both lost their jobs when Branwell was discovered to be having an affair with his employer’s wife.\n The novels of Anne Brontë (The Tenant of Wildfell Hall and Agnes Grey) are notable for their stark lack of fantasy. Anne dealt with similar subjects as her sisters: lonely governesses, abused women, the traps of class and gender. However, Anne keeps the narration strictly realistic, and puts a great deal of focus on alcoholism and other addictions. Anne was just as passionate about Gondal as Emily, but she strips her stories of fantasy. Because of this, people in her books can’t blame anything but themselves for their bad behavior and they can’t turn to anything but themselves for redemption or rescue. While religion plays a strong role, it’s in the “God helps those who help themselves” mode. The stories she tells aren’t romantic or glamorized or wrapped in mystery—are unvarnished.\n In Jane Eyre, forces intervene to help Jane when she needs guidance or prompting. In Wuthering Heights, one might take some kind of comfort in thinking that maybe all this “nurture” discussion is unimportant—after all, Heathcliff’s experiment into “nurturing” Hareton into villainy fails. Maybe Heathcliff really is a devil, and maybe Cathy really is possessed.\n Agnes Grey and The Tenant of Wildfell Hall offer neither recourse nor excuses to their characters or, for that matter, their readers. Branwell died young of tuberculosis and alcoholism and was addicted to laudanum. Caring for Branwell caused an enormous amount of upheaval and grief for Charlotte and Emily; however, Anne was hurt more directly by Branwell, losing a job she had fought very hard to obtain and was unlikely to replace. Perhaps this is why her books are so stark in presenting what happens to women when men behave badly.\n In his essay, “Supernatural Horror in Literature,” H.P. Lovecraft refers to Wuthering Heights as a “piece of terror-literature.” To remove the supernatural from Wuthering Heights would be to remove the sense of inescapable doom and remorseless evil that fills the novel. Jane Eyre relies on the supernatural to create a mood in which anything can happen but no one can be trusted. On the other hand, if one were to add supernatural elements to the novels of Anne Brontë, her realism and uncompromising insistence on individual responsibility would be fatally diluted. While the books seem wild and fiery, they are crafted with precision. It is this precision, this mesmerizing use of the supernatural in some cases and withholding of it in others, which gives the books their timeless, haunting quality.\n Carrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats."}