{"fingerprint": "eEmIqQACeUSKI4hFkvA/5xzTB4w=", "sitename": "Clarkesworld Magazine", "title": "Retro Heroines: Bella, Buffy, and Katniss by Carrie Sessarego", "author": "Carrie Sessarego", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sessarego_08_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Retro Heroines: Bella, Buffy, and Katniss by Carrie Sessarego", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nRetro Heroines: Bella, Buffy, and Katniss\nThe first decade of the 2000s was dominated by three groundbreaking heroines: Buffy Summers, of the television show Buffy the Vampire Slayer, Bella Swan from the Twilight series, and Katniss Everdeen from The Hunger Games. These three heroines exercised power in ways consistent with their personalities and had different levels of success in reaching their goals. Since their franchises peaked, they have been examined and reexamined, and new and arguably better ways of portraying heroines have been explored. Still, these fictional teens remain relevant as portraits of young women who struggle to achieve goals against a set of spoken and unspoken rules that set the world against them.\nBella Swan of the Twilight franchise has a very simple goal—live with Edward in romantic bliss, forever. This single-mindedness is her greatest vulnerability but also her greatest strength.\nBella is subject to parental edicts, curfews, and school requirements. To be with Edward, she must operate within the strictures of the supernatural world. The explicit and implied rules of Bella’s world are:\n- You can’t outfight a vampire. There is no question of a human defeating a vampire, even with a weapon.\n- Vampires may choose to refrain from drinking human blood, but they will not try to get other vampires to stop drinking human blood, although they may protect their territory.\n- Vampires are superior. They are more beautiful, more brilliant, more brainy, and more sparkly than any human could ever be. The bad ones are more vicious than any human, but the good ones are more heroic.\nBella is fine with breaking rules that keep her away from Edward, but in all other respects, Bella is a rule-follower. She is the responsible daughter of two divorced parents who can’t even feed themselves. She gets good grades and is a careful driver. Bella isn’t interested in stopping vampires from killing humans or otherwise being what they are. Such an attempt, in her mind, would be both silly (vampires are natural predators, after all) and futile (you can’t make a vampire do anything). Bella does not concern herself overmuch about vampire politics—she is not out to challenge The Way Things Are.\nIn addition to being outpowered by both human and vampire society, Bella is outpowered by her boyfriend and her best friend. Edward spies on her, stalks her, breaks into her house, sabotages her car, lies to her, leaves her with no word or explanation, threatens to eat her, announces that if they ever part he will commit suicide, and uses sex as a bargaining chip. At one point, Edward seriously considers drugging a pregnant Bella into unconsciousness and having his vampire father, Carlisle, perform an abortion on her while she is unconscious.\nBella has only two sources of power: she is persistent in wanting what she wants, and everybody likes her. Bella is the queen of making allies even though there’s nothing specific about her actions or her personality that would seem to inspire this. She is special just because she exists, not because of any particular quality or action. Within minutes of her first day of school, she has acquired new group of friends, a human boy who is smitten with her, and the eternal love of a vampire. By the end of the series, Edward’s family and the Quileute tribe are willing to die for her. Bella doesn’t do anything to become so adored. In fact, she considers herself to be a misfit and yet her mere existence wins her protectors.\nBella also excels at persistence. Unlike Buffy and Katniss, Bella develops one goal early on and never wavers. That goal is to live forever happily with Edward. The only variation on this goal is when she becomes pregnant, and her goal expands just enough to include the baby. It’s not that Bella doesn’t care about other people. She agonizes over the safety and emotional welfare of her parents and of course Jacob, her werewolf best friend. But Bella will sacrifice anything, do anything, risk anything, to be with Edward.\nBella is most successful when she stays focused on her relatively simple goal. She is the only one out of our three heroines to get an unambiguously happy ending, and that’s because Bella is the only one with a simple, achievable goal. Buffy and Katniss can’t possibly get everything they want, but Bella can, and she does. She doesn’t care about spending the rest of her life challenging the corrupt and terrifying political system the vampires live under, and she doesn’t care about stopping vampires from killing people. She just wants Edward (and ultimately, their child) to be in her life, and through an almost supernatural ability to charm everyone she meets, and a refusal to just walk away, she gets what she wants.\nBuffy Summers of Buffy the Vampire Slayer lives in a version of our own, contemporary world, only with the addition of supernatural creatures and forces. She is also under the control of her mother, her school principal, and her Watcher (and, by extension, the Watcher’s Council). Buffy’s struggle for autonomy dominates the series. She is juggling the rules below along with the constraints of the mundane world that orders her to obey her mom and show up for class even when an apocalypse is brewing.\n- In every generation there is one Slayer.\n- No one ever refuses to be the Slayer, or quits, or retires.\n- The Slayer is supposed to keep her identity secret and devote her life to slaying.\n- The Slayer is alone.\n- The Slayer must obey the Council and her Watcher, the Council’s representative.\nLike Bella and Katniss, Buffy begins her story with a single desire—in this case, to live a normal life. In the course of seven seasons, Buffy’s goals become more complex. She gradually shifts from wanting to be normal to accepting her reality as a slayer. Like Bella, she wants romantic happiness. Like Katniss, she wants to protect her sister, Dawn. Buffy’s goals become increasingly complicated, as with each new apocalypse it is clearer that Buffy will eventually be defeated unless the rules she lives under change. Her goals become both broader (save the entire world) and narrower (defeat one apocalypse at a time).\nBuffy is consistently more successful when she works with others, despite the pressure of tradition. As the series progresses, she continues to resent being isolated, but also takes a certain pride in it. When she uses her status as Slayer to act alone, she almost always fails. Yet when she accepts help from her friends and her family, she succeeds. According to Spike, a vampire who has killed Slayers in the past, Buffy’s refusal to give up this support sets her aside from all previous Slayers and tethers her to the world, making her harder to kill.\nAt the end of her journey, she defeats her enemies by realizing that there is no reason why there must only be one Slayer, and by asking her friend, Willow, to use a spell to give all potential Slayers full powers. By breaking the first rule, she surrenders any concept that she is “better,” or that she is “alone.” It’s significant that she doesn’t become less powerful herself when there are other Slayers. She can still fight evil all she wants, but because many other people will do so as well, it’s now her choice, and doing so without dooming thousands of people to death should she wish to take a vacation. By accessing the resource of her community of friends and family, she is able to create and become a member of an even larger one, ending both her isolation and her submission to the rules of others. Her ending is a relatively happy one, as she contemplates (facetiously) going to the mall with her friends—the normal girl ending that she was hoping for.\nKatniss Everdeen also starts her story with a single goal. She is not interested in rebellion or romance. She just wants to take care of her sister, Prim. However, Katniss’ story becomes more and more complicated as she extends her protection to other people—to Rue, to Peeta, her District, and finally, to all the people of Panem.\nWhile Bella is the definition of passivity, and Buffy just wants to be normal, Katniss is the definition of “action girl.” When it comes to physical power, Katniss is able to use a combination of being fit from years of hunting to hold her own. Her most obvious source of power is her skill at combat and wilderness survival, but it turns out that her ability to think and act outside the box, both in and out of the arena, is her greatest asset.\nFinally, here are Katniss’ rules, explicit and implicit, that she must live under:\n- The Capitol is unbeatable and bad.\n- Every District must send two tributes to the arena. It’s implied that refusal would bring complete destruction—which turns out to be true.\n- In the arena, only one person can survive.\n- The person who survives the arena once is safe forever.\n- The Revolution is Good. Katniss must do what the Revolution says to survive and to protect her family.\n- You can only be romantically attached to one person at a time. (While many YA books of this era, including The Hunger Games, could have found resolution through a happy triad relationship, that is not presented as a possibility in Katniss’ world.)\nKatniss is terrible at making friends, but she’s ruthless enough to play up the romance angle that Peeta (who is great at making friends) initiates. When it comes to physical survival, Katniss is in jeopardy repeatedly, but saving herself is not the biggest challenge. As time goes on, in addition to protecting her sister, Katniss develops a desire to protect Rue and Peeta, both of whom are her competitors. Since only one person can survive the arena according to the rules, this makes her life more difficult.\nBy threatening to end the game with no survivors (by threatening to not only eat poisonous nightlock berries but have Peeta eat them as well in a double suicide), Katniss uses her greatest skill—finding an option that no one has even considered.\nKatniss’ life becomes even more complicated when she realizes that as long as the Capitol is in power, Prim’s life is in danger. If Katniss is going to protect Prim, then she will have to seek systemic change. She will have to alter the political power structure so that Prim will not be in constant threat of physical deprivation and potential death in the arena or at the hands of Peacekeepers. By the second book Katniss is learning that the whole world is the arena, and to protect Prim she must actually make life better, not just survivable.\nKatniss faces overwhelming physical danger, but her greatest peril does not come from combat. Her biggest problem is that she is always a player in other people’s games. Sometimes she’s a pawn in the games of the Capitol, and she has to fight her fellow tributes in the arena and act as a tool of propaganda outside the arena. She can’t break free of the games and launch a rebellion on her own, so instead she takes advantage of opportunities to subvert the games and break the rules.\nOther times, Katniss is a pawn of the rebellion. She has no say in how the rebellion functions. She’s not even an effective pawn: When the rebellion tries to script her, she’s utterly wooden. They have to give her opportunities to be spontaneous, because that’s the only time that Katniss shines.\nKatniss wins freedom for the Districts from the Capitol by continually rallying support for the rebellion. She fights in the battle in the Capitol, but her acts of combat are not what wins the war—what stops the war and saves the Districts is an act of atrocity that kills Prim, the one individual that Katniss has sworn to protect above all else. Katniss succeeds in all of her foals except for saving Prim—her first, and most consistent, goal.\nKatniss wins real freedom for the Districts when she is told to shoot President Snow and she shoots President Coin. As in all of Katniss’ most powerful moments, this is one that cannot be scripted, although it is implied that Katniss planned it once she realized that President Coin is showing the same dictatorial streak as President Snow. Katniss seizes a chance to break the world wide open. Katniss never succeeds in destroying the games she must participate in, but she breaks the game apart enough for new options to become possible.\nWhat Katniss can’t do is win freedom for herself. She is a prisoner in exile for the rest of her life. She can’t escape the scars on her body or the nightmares that make mothering children an exercise in terror. It is here that Katniss makes use of another one of her powers—endurance, and the ability to attract allies. It’s true that Katniss melts down on a regular basis, but it’s also true that Katniss always pulls herself back from despair and inaction. It’s also true that although Katniss often perceives herself as isolated by her responsibility and trauma, she’s surrounded by found family who help her heal.\nOne may think of Bella, Katniss, and Buffy as variations on a theme of “thinking outside the box.” Bella accepts the box, as long as she can live in it with Edward. She has no interest in overthrowing anything. She just wants happiness with her lover and her family.\nKatniss shoves the box into another shape, opening the lid and letting well-needed light shine in. She overthrows first the games, then the Capitol, then the authoritarian direction of the Districts, but she is never fully empowered or fully safe herself, and her ending is bittersweet.\nBuffy destroys the box. By eliminating one critical rule, she creates a new a new paradigm under which she is no longer isolated. Her world is not perfect, friends have died, and her future is uncertain, but it is hopeful. She is empowered and freed, as are countless other young women.\nIn recent years, new franchises have taken the limelight and the old have been reexamined. Bella’s story, the simplest and the most beholden to the rules, has been justly criticized because her arguably abusive relationship is romanticized. Buffy the Vampire Slayer, always justly criticized for flaws, including a lack of inclusiveness, is being reexamined in light of revelations about showrunner Joss Whedon’s behavior on and off set. A prequel movie is contemplated for The Hunger Games franchise as its relevance continues to grow in countries flirting with authoritarianism.\nThese heroines deserve to be examined in terms of how they fight for autonomy in the face of a world that does not respect them. Bella is passive, with a total fixation on achieving a romantic happy ending. Buffy rebels against her status as “The Chosen One,” ultimately changing the rules of her world forever. Katniss begins her journey with a single goal, to protect her sister; however, as her story continues, her goals become more broad and thus more difficult to achieve. In a time of social upheaval and while on completely different terms, Bella, Buffy, and Katniss may present us with different options to survive it all.\nCarrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats."}