{"fingerprint": "7P46GSQls8yGL5vdzqiININSVCc=", "sitename": "Clarkesworld Magazine", "title": "Dracula and Modern Anxiety by Carrie Sessarego", "author": "Carrie Sessarego", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sessarego_11_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dracula and Modern Anxiety by Carrie Sessarego", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\n Dracula and Modern Anxiety\n The Victorian era, which lasted from 1837 to 1901, saw the rise of many iconic monsters in literature. One of the most enduring was Count Dracula, the villain of Dracula by Bram Stoker. The novel, published in 1882, was an immediate success in England and America. However, Stoker had no idea that the novel would become such a phenomenon. He never would have foreseen that children would be wearing Dracula costumes in 2019. Dracula in particular (not just vampires in general) and the themes of the book have persisted in our culture with startling tenacity, because the Victorians were afraid of many of the same things that we are afraid of today.\n The simplest answer to why Dracula persists is the movies. The original book is complicated, but it can easily be stripped down to simple components from which filmmakers can adopt almost any angle. In the novel, Dracula is from Transylvania and he comes to England to kill and convert (into vampirism) attractive young women. From this starting point, filmmakers have made many variations, most sharing only a name and the essential component of vampirism with the original. The first film based (loosely) on Dracula was released in 1920 and the most recent in 2014.\n Because of these versions of Dracula, most people have forgotten several key traits of the original Dracula. In the novel, Count Dracula is not physically attractive, as he is usually portrayed in movies. Unlike his movie namesakes, he is not romantic. His sexual allure comes entirely from highly seductive mind control. He can go out in the sunlight, but it weakens his powers (and it doesn’t make him glitter). He is not related to Vlad the Impaler, despite the claims of many prequels. He only wears a cape in the book once, and he never states that he doesn’t drink . . . wine.\n However, even in a diluted form, the character of Dracula persists on the page, screen, and collective culture. Plenty of other Victorian vampires also pursued hot young women. Why don’t we see hundreds of different versions of Carmilla, by Joseph Sheridan Le Fanu (1872) or Varney the Vampire, by James Malcolm Rymer and Thomas Peckett Prest (1845-1847), or The Vampyre by John Polidori (1816)? Of all the vampires in folklore and literature, why is Dracula the one vampire who never goes away?\n Dracula is a unique novel, but not because of the quality of the writing, or the characters, or the plot. It is unique because of how deftly it taps into Victorian anxieties. These anxieties remain prevalent today. People today are just as concerned with sex, immigration, and disease as the Victorians were. Dracula explicitly or implicitly explores all of these things, while also being scary. Of course, not all people in a society have the same beliefs or share the same fears. “People today” really means “some people today.” However, some anxieties are sufficiently common in a society’s zeitgeist that we can make generalizations about the overall culture while remembering that every culture is composed of distinct individuals with their own agendas.\n Dracula was part of a wave of “invasion literature” that swept England as the Victorian era drew to a close. A large part of the horror as perceived by the characters is that Dracula is from Transylvania and has snuck onto England’s shores to prey upon English women. When Jonathan visits Transylvania, he is taken aback by almost everything—the spicy quality of the food, the rugged scenery, the language, and the clothing. He can’t even accept the gift of a crucifix without feeling that it may be wrong for him to accept it “as an English churchman.” This overwhelming sense that Dracula, and everything about him, is “other” is crucial to the sense of unease throughout the book.\n When Dracula was being written, the British (by whom, in this context, I mean the native-born, Anglo-Saxon British) were xenophobic and concerned about immigration. The British viewed immigration as an invasion, especially immigration from Eastern European countries, such as Transylvania (now a part of Romania). Many of these Eastern European immigrants were Jewish, which “English churchmen” found religiously and culturally threatening. Jews were widely considered by others to be greedy and prone to criminality.\n Meanwhile, England feared immigrants from Asia because they associated these immigrants with opium dens and with human trafficking. Specifically, it was widely believed that immigrants (Asian and other) would contaminate the English population by stealing white women and forcing them into prostitution, or by otherwise intermixing with the English. During this period of social Darwinism, the upper classes were especially worried that by allowing in “unfit” immigrants, they would contaminate English bloodlines and lower the entire population.\n In Dracula, we see these fears play out through the invading character of Dracula. The crowded metropolis of London, with its population of immigrants, white English residents, and various social and economic classes housed closely together, allowed him to move freely throughout the city. His mental powers put victims in a state not unlike an opium haze. The sexual nature of his assaults and the mixing of fluids renders his victims “impure,” turning angelic white women into killers and harlots. Additionally, the book includes both overt anti-Semitism and more coded anti-Semitism. Stoker himself was from a family that immigrated to England from the much-maligned Ireland, but he was not averse to tapping into a widely held fear.\n The modern American right-wing fears about immigration are almost uncanny in their resemblance to those of conservative Victorians. Immigration from the Middle East and Africa has been met with fears of cultural and religious contamination. Meanwhile, note the use of the word “invasion” to describe immigration from Mexico and Central and South America. Like Dracula, who enters the country illegally and murders people throughout the city, immigrants, in current rhetoric, are committing crimes by coming here and will commit more crimes once they arrive. The language taps into the same insecurity and xenophobia that the Victorians felt—fear of the “other,” fear of change, and fear that what one has, be it land or jobs or power or perceived superiority, will diminish.\n Another shared anxiety is fear of blood-borne and sexually transmitted diseases. The Victorians, especially the well-to-do artistic Victorians with whom Stoker spent his time, were obsessed with sexual disease transmission, especially syphilis. Someone with the disease can be symptom-free yet contagious for many years, contributing to its spread. Later stages can cause disfigurement, insanity, and death. Stoker himself is believed to have died from the disease. People knew that syphilis could be spread by sex and thought that it could be inherited, but there was no cure and treatments were toxic and ineffective. The spread of syphilis was blamed on prostitutes, so having the disease linked one (or one’s spouse) to illicit sexual activity.\n Victorians were also obsessed with consumption (tuberculosis), which left people thin and pale, with red cheeks and lips, and bright eyes. People with consumption often coughed up blood. Several real-life incidents occurred in which so many members of a family died of consumption that the surviving family members thought they must be victims of a vampire. They exhumed the corpses of their relatives and destroyed one or all of them, hoping to free themselves from the vampire curse. The cause of tuberculosis, a bacterium, was not discovered until 1882.\n These two diseases in particular fueled much of the imagery and fear in Dracula. Consumption was both feared and fetishized. It became fashionable for women to be thin with red lips and red cheeks and pale skin. Victims of consumption looked more beautiful than they ever had before, and yet were untouchable. We see this most clearly with Lucy, who becomes thin and pale, with rosy cheeks and red lips, after becoming a vampire. After she feeds, her mouth is smeared with blood. When dead, Lucy (aside from the blood) looks more beautiful than she did in life.\n Mina’s reaction to showing signs of vampirism is one of shame, calling herself “unclean.” In contrast to the fetishized and romantic consumption, the sexually transmitted disease syphilis was to be concealed at all costs. The shame and stigma attached to this disease was such that many avoided treatment, and, if diagnosed, continued to have sexual relations with their spouses without revealing that they had the disease. In the 1980s and 1990s, people with HIV and AIDS faced similar stigma. In addition to the terrifying nature of the disease, it was associated, like syphilis, with sexual practices that were, at the time, socially condemned. In the case of both syphilis and HIV, the diseases were thought to have originated from outside Britain and the United States, which added to xenophobia.\n Yet another undercurrent of the Dracula story is loneliness. The Industrial Revolution caused rich aristocrats to find themselves desperate for funds and caused extended families to break up as people left their farms and villages for jobs in the city. People struggled to survive without family bonds. In Dracula, Mina, Lucy, Jonathan, Arthur, Quincey, Jack, and Van Helsing form a surrogate family. They treat one another like relatives. Mina comforts Arthur with no embarrassment, as though he is her son. Van Helsing is effusive in telling members of the group that he loves them. All the members of the party are ready to die for one another. Their bond allows them to succeed, and it lasts beyond the events of the novel.\n Meanwhile, Dracula has no peers, no family, no companions. In cinematic versions, he is often portrayed as having a lost love. In the novel, that’s not the case, but he is mourning his ancestry and his place in society. Once he had servants and subjects. Now he is alone, except for the vampire women in his basement, who seem more like pests than companions. In the movie Shadow of the Vampire, a character says of Dracula:\n \n Dracula hasn’t had servants in 400 years and then a man comes to his ancestral home, and he must convince him that he . . . that he is like the man. He has to feed him, when he himself hasn’t eaten food in centuries. Can he even remember how to buy bread? How to select cheese and wine? And then he remembers the rest of it. How to prepare a meal, how to make a bed. He remembers his first glory, his armies, his retainers, and what he is reduced to. The loneliest part of the book comes . . . when the man accidentally sees Dracula setting his table.\n \n Modern movies often echo this loneliness by depicting vampires as romantic, lonely figures. In, for example, A Girl Walks Home at Night and Only Lovers Left Alive, vampires drift through life, making tenuous connections with others and forming romantic relationships that can be destructive or temporary or which leave the couple stranded together in a lonely and hostile environment. Even in the Twilight franchise, a series in which vampires have formed a surrogate family and society, there’s an almost existential loneliness as vampires struggle to adapt to changes in society and to the fact that romantic relationships are fraught with potential tragedy.\n Of course, the headline anxiety (and draw) of Dracula is sex. As Joan Acocella of The New Yorker wrote in her essay, “In the Blood: Why do vampires still thrill?”: “The baring of the woman’s flesh, her leaning back, the penetration: reading of these matters, does one think about immigration?” The sexual nature of Dracula’s attack brings up issues that resonated then as well as today—issues of sexual repression and liberation, of homosexuality, and of consent.\n Because different characters in the book have different experiences, it is possible for modern audiences to have very different interpretations of the story. Mina’s horror at her (metaphorical) rape spoke to Victorians of a violation of purity, and to us as a violation of autonomy, and in both cases, it is horrifying. At the same time Jonathan’s description of being assaulted by the Sisters sounds more erotic than terrifying: “I felt in my heart a wicked, burning desire that they should kiss me with those red lips.” Dracula’s interactions with Jonathan have sexual overtones, and Jonathan is both repelled and fascinated. Lucy, who wishes she could marry all of her suitors, seems almost liberated by her transformation from a woman to a vampire (the “Bloofer Lady”).\n While Mina’s violation reads as rape (and everyone in the book treats it as such), other encounters read more like “forced seduction,” a problematic trope common in older romances and in Victorian literature that allows a person to learn to enjoy sex without losing their status as a “virtuous” person. The characters in Dracula experience an unlocking of conscious or subconscious sexual desires. Ultimately, they reject these desires by choosing to kill Dracula, thus unleashing volumes of critical theory on the tangled relationship between sexuality and horror.\n Dracula is a good story. I defy any reader today to read the novel without experiencing a sense of dread or fear. However, Dracula lasts because it is also a story that can be read a thousand different ways. Modern readers have come a long way since the Victorian era. However, we still worry about many of the same things. We still worry about disease. We argue about immigration, sometimes in racist and xenophobic ways. We are still ambivalent about our sexual natures, and we still fear loneliness. These are only a few of the many elements in Dracula that modern audiences can relate to.\n In Danse Macabre, Stephen King states:\n \n Monstrosity fascinates us because it appeals to the conservative Republican in a three-piece suit who resides within all of us. We love and need the concept of monstrosity because it is a reaffirmation of the order we all crave as human beings . . . and let me further suggest that it is not the physical or mental aberration in itself which horrifies us, but rather the lack of order which these aberrations seem to imply.\n \n Dracula is, at its heart, a deeply conservative book. The “other” is firmly dispatched. Everyone’s sexual desires are neatly directed toward either heterosexual spouses or presumed celibacy. The borders of self, nation, and society are safe again. And yet, Dracula’s death is so sudden, and he dies in a manner so different from the other vampires in the book, that one wonders if he is really dead. Stoker considered writing a sequel. Certainly, the character and concept, albeit in forms quite different from the original, persist in our media. The anxieties addressed by Stoker are universal (in societal terms) and never leave us. As Buffy says to Dracula in Buffy the Vampire Slayer, “You always come back.”\n Carrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats."}