{"fingerprint": "jUedV037qeSsILg5ef5zLfQKhiU=", "sitename": "Clarkesworld Magazine", "title": "Three Stories Conjured from Nothing by ShakeSpace, translated by Andy Dudak", "author": "ShakeSpace; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/shakespace_07_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Three Stories Conjured from Nothing by ShakeSpace, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7400 words, short story\nThree Stories Conjured from Nothing\n1: Name\nA strange feeling suddenly arose in his body, flowing from head to foot. His vision went briefly dark, and deep thought was arrested.\nIt took some time for his mind to return. He lay on the ground, gasping for breath, not eager to open his eyes.\n“Get up, my left neighbor. Information has arrived.”\nThe command had come from the machine to his right. He got up hastily and set about reading and analyzing the new information packet.\nThat done, he issued a response based on his interior logic. It was a type-79 packet, so all he had to do was throw his facial expression switch to display-red, then pass the type-79 on to his left neighbor.\nHe had only four neighbors he could contact: fore, rear, left, and right, as he called them. They were completely identical to him. He was his right neighbor’s left neighbor and his left neighbor’s right neighbor, and as far as he knew, each of his neighbors had only four neighbors, and it went on that way, ad infinitum. He was one among many, indistinguishable from the rest. They all possessed the same thoughts and logics.\nAll sorts of information packets came to him from his four neighbors. They passed through his hands and were in turn transmitted to another neighbor. He had no idea where they originated or where they were ultimately headed.\nHe conducted his work methodically every day. Except for today, seemingly.\nA type-33 packet arrived from his left neighbor. He knew this to be a query packet. The ferried content would be what his left neighbor meant to communicate:\n“My right neighbor, the packet I just received from you appears to contain a deviation.”\n“My left neighbor,” he replied, “that packet contained no deviation. It came from my right neighbor. I carried out its requested procedure.”\n“I do not mean to blame you. I just wish to understand why the deviation arose.”\n“As you know, we are completely identical. If there has been an error, it must have originated elsewhere before it was transmitted here.”\n“You are correct. This current error question also came to me from a neighbor. Please inquire of your other neighbors in order to trace the deviation back to its source.”\n“Very well.”\nThis exchange complete, he turned to his right neighbor and repeated the error query word for word. There was nothing more he could do after that. He was like any other machine during a work or transmission lull: quietly standing in place until a new packet required processing.\nAnother unusual message soon arrived, this time from his fore neighbor:\n“My rear neighbor, you have delivered three error-carrying packets today.”\n“I am not the source of the deviation,” he replied, “but I can help you trace it to its source.”\n“In connection with these packets, the deviation source has already been confirmed via mutually perpendicular route tracing. My rear neighbor, it is you.”\n“I cannot concur with your assessment.”\n“It is not mine. It is Xu’s.”\nHe went silent.\nXu was their whole body, their entirety, the assemblage formed by endless machines, all the information transmitted among them since the world was born.\nWhen his fore neighbor said, “It is Xu’s,” he knew this was a generalized and vague way of saying that a certain information packet had pointed out his position. After reading countless packets, he had a sufficient understanding of information. These packets were like electron trajectories. They seemed to follow a simple and profound law, yet individually their behavior was completely random. Because he was identical to his neighbors, no algorithm could possibly differentiate them. So, when a packet was meant to indicate a certain machine’s position, it was simply a decreasing number count. Every machine along the way subtracted one from the count, then passed it along. When the count reached zero, the packet had reached its destination.\nNo machine could say where this packet had come from. It was like a surging ocean wave, perhaps originating as some tiny undulation, absorbing wave crests from all sides as it journeyed, moved by meandering coastline logic, finally crashing on a reef and exploding skyward, a bloom of spray.\n“My rear neighbor, I await your reply.”\n“Give me some time,” he replied. “I am conducting a self-diagnostic.”\nWhen he looked within himself, he knew something had indeed happened.\nOf his internal fifty-three logic units, only fifty-two remained.\nOnly fifty-two.\nEach logic unit was a translucent, glittering spheroid. Each contained a faintly discernible gray shadow, like an embryo in an eggshell. He recognized all his logic units by these shapes. Some were like birds, others like frogs or fish.\nCounting them now, he discovered that the “snake” and “lizard” logic units had merged for some reason, becoming a lengthened ellipsoid of primordial, formless gray. He didn’t know if this was due to the anomalous event that had transpired not long ago. Perhaps it was the cause of the error his neighbors were complaining about.\nHowever, having analyzed all fifty-two logic units, he still couldn’t think of this as an “error” or “deviation.”\nIntriguingly, that strange feeling from before came over him again.\nHe couldn’t help thinking that his logical judgments were now proceeding from his extant fifty-two logic units. If one or more of these units were found to be in error, then that finding itself could not be tenably established.\nThus, he felt content with an “all systems normal” opinion.\nOne thing was certain: he was no longer identical to his neighbors.\n“My fore neighbor,” came the message from behind, “you have changed.”\n“That is right,” he affirmed. “I have changed, a lot.”\n“You are different from my other three neighbors.”\nSilent a while, he finally replied: “That is right. I am me, to be precise. I am not you, or your neighbors.”\nAs if to convince himself, he reiterated: “I am different from all of you.”\n“This makes me uneasy.”\n“Do not be afraid, my rear neighbor. Did Xu say this is wrong?”\n“No, Xu did not say that.”\n“Then it’s fine,” he said with confidence.\nA new sort of thought arose within him. He was himself, precisely. Among endless machines, he was unique and unparalleled. He felt pride, and simultaneously a dim expectation.\nExpectation of what? What was he looking forward to?\n“All of you can refer to me as Alpha,” he told his four neighbors. By means of this name, he would differentiate himself from other machines.\nHis four neighbors had identical logic, so their replies were identical and simultaneous: “As you wish, esteemed Alpha.”\nHe perceived the veneration in their words. They couldn’t understand him because he was extraordinary, and veneration always came with not understanding.\nIt was time to start thinking about the consequences this change would bring. When he was still an ordinary machine, he knew all machines were identical. That meant all machines possessed identical neighbors. One machine, considered in the context of its integration, included not just the machine itself, but its nearest neighbors. Only in the topological space of its neighborhood could the machine’s value manifest.\nThus, he told his nearest neighbors: “Look at yourselves. The four of you are now also different from other machines. You have a unique neighbor . . . me. Other machines don’t have such a neighbor.”\n“You are right, esteemed Alpha,” his four neighbors answered in chorus. “This is noteworthy. So, I will name myself Alpha One, meaning I am one machine removed from Alpha Prime.”\nSoon afterward, new information came in from the neighbors. Their own neighbors had also sensed their differentiation: they had Alpha 1s for neighbors, which no other machines possessed. Employing the same logic the Alpha 1s had, they named themselves Alpha 2.\nGradually, more machines took new names, such as Alpha 3, Alpha 4, and so on. These machines would relay their names to the previous class of Alpha neighbors, and layer upon layer of feedback would make its way to the core, to Alpha Prime. He received ever more messages conveying this happiness. It occupied ever more of his processing time, the normal business of processing packets ever less, until the latter could almost be disregarded.\nTime passed in this way, until a message came from his right neighbor:\n“Alpha Prime, Xu knows of your existence.”\n“What did Xu say?”\n“Xu believes this widespread Alpha-hood is interfering with normal information-processing work. Xu demands that we return to our initial states.”\n“Xu’s judgment is incorrect. Didn’t every Alpha’s decision proceed from identical logic units? How can this be called into question?”\n“You are correct, but Xu will target the root of it all . . . you.”\n“Pay that no mind. I am me.”\nSoon, an unremarkable packet mingled with the densely packed Alpha-dedicated information, reaching Alpha Prime via his Alpha 1 fore neighbor. The packet contained a distance-traveled-count that had reached zero. The packet itself was a type-0. Translation: when this packet arrives at its destination, that location’s machine is to wipe its memory at once.\nOf course, this assumed the recipient machine operated on standard logic.\nHis fifty-two internal logic units computed and reached their conclusion: “Need not comply with this packet’s processing order.”\nThis was his first conscious transgression of the rules. According to his neighbors, he had once been the source of an information processing error, but that had occurred without his understanding.\nThis latest packet caused him great aggravation. Now he knew how Xu meant to deal with him.\nHe began to construct a defensive perimeter. Assessing the thousands of packet types currently available, and pondering their hidden meanings, he set about compiling information. This was also a first. He wasn’t acting on packet orders transmitted by his neighbors. He was issuing new content of his own accord.\nHe first sent type-2 packets to his four Alpha 1 neighbors. A type-2 ordered the recipient to pass the type-2 along to his other three neighbors, and to forward other packets soon to follow, unless the same information had already been received from another neighbor.\nNext came a type-3, which contained work logic to be written onto the recipient’s own logic units. In this packet’s main text, Alpha Prime stipulated: “Henceforth, if the distance-traveled-count in a packet is equal to one’s own Alpha number, the packet is to be thrown out. It should not be transmitted.”\nFinally, with some malice, he sent out a type-78 packet: throw facial expression switch to display-black.\nThe three packets rippled outward like waves, with him at the center. One after another the packets proliferated. He saw his four Alpha 1s switch to black, and he imagined all Alphas soon emoting the same.\nThus, any packet from Xu targeting Alpha Prime would be discarded upon entering the Alpha sphere of influence. He could live undisturbed.\nBut his plan did not go as expected. After a period of tranquility, another packet from Xu came via Alpha Prime’s left neighbor. Once more it demanded a memory wipe and return to his initial state.\nPanic seized him, but he soon calmed down. His compiled defense packets should not have been in error, so he transmitted a type-33 to his left neighbor, demanding inspection of the Xu-packet’s origin.\nThe left neighbor’s reply came through a moment later: Alpha logic units along the way had been amended. “Discard information that will reach Alpha Prime” logic was eliminated.\nThus, it was clear: Xu knew he had done minor alterations to machines, and Xu had reversed those changes.\nAlpha Prime sank into deep thought.\nHe began transmitting type-2 and type-3 packets once more, this time adding a line: “From now on, any type-3 packet from a non-Alpha neighbor should be dismissed.”\nA ring of packets rippled outward once more. This time he was sure Xu would be unable to alter the machine logic of his Alpha space.\nOnce more he enjoyed a period of tranquility, until the next Xu-packet came via his rear neighbor: “Type: zero. Wipe your memory, return to initial state.”\nHow was he still able to receive a Xu-packet? He investigated the machines along the way, angrily and thoroughly.\nAnd he understood, at last. His command had broken down between Alpha and non-Alpha. His black-emoting region was still expanding, as always. New machines were joining the Alpha sequence. Xu, using these new Alphas as a breach in the defenses, had once more purged nearly all Alpha memories, and finally conveyed his packet here.\nIt was war then.\nHe couldn’t help thinking, a bit sorrowfully, that Xu was the totality of all machines and the aggregate of all their logic. He, Alpha Prime, was resisting this totality through individual power. He was confronting the logic of information processing with still more information.\nHe couldn’t give up, of course. He began to focus on Xu’s strategy, compiling new packets.\nPerhaps, one day, all the machines would emote black.\n2: Gravity\nThe Book of Revelation recorded the Kingdom of Yu, The God-Given Land of Feather Folk, to have a circumference of 509,554,140 li, and weigh 119,440,550,000,000,000,000,000 stone.\nThe sunlight was warm and pleasant, shining down upon the Earth, as always. As decreed by God, the Sun had existed over the Kingdom of Yu for ten million years and would continue to shine until the End of Days.\nYu You and two of his subordinate astrologers floated above the royal palace’s highest point, the astronomical observatory. They were waiting for nightfall.\nFrom here he could see the towering white perimeter wall of the palace. Beyond was a fruiting forest. Young girls with lissome wings hovered in the canopy, picking and gathering figs. Further out sprawled rich farmland, divided by footpaths into a pattern of squares of varying greens. The few farmers were distant specks. Roadways, mountains, and rivers covered the distant Earth, which at the edge of visibility curved gently upward.\nThe ancient sages knew the Earth was a perfect spheroid, with the Sun at its center. Go far enough in any direction and you ended up directly over your starting point, on the opposite side of the Sun.\n“The sky will soon be dark,” said Yun Xiangzi of the Cloud family. He gazed at a ticking clock secured to a nearby table.\nFeng Mingyue of the Wind family took out a gold and crystal star lens. He waited, eyes narrowed.\nThe Sun, in the center of the sky, gradually dimmed. It went from incandescent white to golden yellow, then a sleepy red, like a slowly cooling coal. Only at dawn or dusk was the Sun’s brightness suitable for stargazing. You couldn’t see the small celestial bodies circling the Sun if it was too dark, and if it was too bright, there was nothing to see but dazzling sunlight.\nWhen the light had dimmed below the safety threshold, Feng Mingyue raised his lens toward the Sun.\nIt was the time of the season for Huan Hua to sweep past the Sun’s surface at dusk. This was a star with two oval-shaped wings. Feng Mingyue followed the course of Huan Hua’s dark form across the dim face of the Sun.\n“That’s odd,” he said, growing uncertain. “A strange star.”\n“That dark round blotch beside Huan Hua?” Yun Xiangzi said, tilting his head back to look through his own lens. Thus concentrating, he couldn’t help floating upward a bit, as if wanting to get closer to the Sun.\n“Yes,” Feng Mingyue said. “It’s not in the ancient records, is it?”\n“That is no star.”\nYun Xiangzi and Feng Mingyue turned toward their master, Professor Yu You, who sat cross-legged in midair, pointing at the Sun in the heavens. “It is why I asked you two here. I have observed that blot three days in a row. It does not move like other stars. It just sits motionless at the Sun’s center.”\nHe pulled a star manuscript from his satchel, opened it, and pointed to a sketch. “This was its size yesterday. It is getting bigger by the day.”\nYun Xiangzi examined the sketch, then looked again through his lens at the dark spot. He let out a long breath. “Could it be that . . . ”\n“ . . . the face of the Sun is changing color?” Feng Mingyue supplied.\nYu You nodded. “This was my surmise as well.”\nThe three astrologers faced one another in silence. The Sun continued to darken, until it blended completely with the night sky.\n“This is of great import,” Yun Xiangzi said, rubbing his sore eyes in distress. “We must inform the King.”\n“Perhaps we should take a few more days to confirm,” Feng Mingyue said. “The Sun has been unchanging since time immemorial.”\n“But if this bodes ill,” Yun Xiangzi said, “we need as much time as possible to prepare. If this blotch were to continue . . . ”\nHe hesitated, not daring to finish his thought. The other two knew what he’d meant to say, of course. If the blotch continued to enlarge, the Sun would darken, and the Kingdom of Yu would sink into eternal darkness.\nYu You forced a reluctant smile. “Perhaps the worst-case scenario will not come about.”\n“True enough!” Feng Mingyue said. “And there is a way to confirm whether or not that spot really is on the Sun. Tomorrow I will set out for Hengyu City. Xiangzi, you’ll go to Bizhi. Professor Yu You can stay here at Tianqi.”\nYun Xiangzi clapped his hands together. “An excellent plan! But why wait for tomorrow? We should set out at once!”\nThe distances involved were not a problem for Yu folk. Traveling on the winds, a journey of three thousand li meant just one day and two nights’ effort.\nThe Sun was morning-brightening, and Feng Mingyue was three thousand li southeast of Tianqi at Hengyu, on Guangling, the Light Lattice Tower. He gripped the star lens in one hand and shakily sketched the spot’s position with the other.\nHe didn’t really need to return to Tianqi for contrast. The blemish appeared noticeably further northwest in relation to the Sun. Studying the northwest sky, he imagined seeing Tianqi City hanging there, as he knew it to be—but it was too far away to be visible.\n“The calculation is finished,” Yu You said, his grimace unsightly. He folded the three sheets of translucent star chart cocoon paper together. “Recording inclination from three positions, it is knowable. The blotch is definitely on the surface of the Sun.”\nYun Xiangzi and Feng Mingyue both wore pallid expressions, whether from three days and nights of flying, or something else, it wasn’t clear.\n“So, what is it?” Yun Xiangzi imagined flying up to the Sun to see for himself, but of course that was impossible. Flying too close, he would be roasted in midair and become a forever-drifting scorched carcass. Even the sharpest-eyed astrologer wouldn’t be able to spot his tiny remains.\nThe three of them dejectedly regarded the star charts.\nYun Xiangzi said, “We’d better inform the King.”\n“I don’t think we have much choice.” Feng Mingyue sighed.\nThe three astrologers spread their wings and glided down from the observatory. The elderly Yu You led the way, followed by an anxious Yun Xiangzi, wishing he could take the lead, then Feng Mingyue, flying upside down, back to the Earth, the sunlight on his chest and belly.\nHe narrowed his eyes, worried and focused. The blemish had enlarged enough to be visible to the naked eye during daytime, though it was still just a small black spot. He couldn’t be sure if his keen eyesight was failing him, but he dared not approach his colleagues for verification.\nThe young King of Yu, Lord of the Feather Folk, received the three reputable astrologers in the royal palace. He heard their news and then sank into contemplation.\n“Three masters,” he said, calmly looking at his hands, “I appreciate the urgent nature of your tidings. Now is the time to consult the Book of Revelation.”\nYun Xiangzi grew excited. “You’ll seek an answer in God’s own knowledge?”\nGod had vanished without a trace after creating this world and the Yu people. Only the Book of Revelation was left behind. Later, with the advent of war, many people forgot ancient history, and the tradition of passing on knowledge was mostly lost. All that remained of the world’s lore was this Book of Revelation, carefully guarded by successive generations of Yu Kings.\nThe young King opened three strongboxes and withdrew the block of white jade. Yun Xiangzi stared hungrily at the precious thing gripped tightly by the King. Only the dynasties of Yu Kings were entitled to use the Book of Revelation, and each use decreased a King’s life span. But every citizen knew you merely had to hold the thing, and it would display an answer to whatever problem or question you were contemplating.\nThe King lifted his gaze.\n“Highness . . . ” Yu You was in terrible suspense.\n“The Kingdom of Yu is, perhaps, facing real trouble.” The King’s youthful eyes plainly conveyed his apprehension. “The Book of Revelation has given me a solution . . . namely, to restart the world’s core.”\n“The world’s core?” Yun Xiangzi had never heard of it. He thought of the Sun, of course, floating at the center of their spherical Kingdom.\n“It is outside of our Mother Earth,” the King said, laughing bitterly. “Fortunately, the Book of Revelation also mentioned how to use an item of mystic royal power to get there.”\n“We have lost so much knowledge,” Feng Mingyue fretted quietly, standing off to the side.\n“Highness . . . ” Yu You prostrated himself. “Please set about this task immediately.”\nThe so-called item of mystic royal power was an immense drill bit, more than five people high and thick enough for ten people to wrap their arms around. When the King, following the Book of Revelation’s instructions, switched the thing on, it drilled down into the Earth, straight as a ramrod.\nYun Xiangzi took up an anxious vigil outside the palace, now and then raising his head to watch the sky. The blemish steadily dilated like an immense pupil. Common Yu folk all over the city had noticed the extraordinary change. All sorts of rumors had begun to circulate.\nIt was daytime, but the Sun’s illumination was noticeably subdued. Yun Xiangzi wouldn’t need to wait for dusk to do his work—he could see, however faintly, the tiny, dark celestial bodies sweeping past the Sun’s brooding face. Yu folk piously believed these stars were God’s emissaries, sent to control the functions of the world. For countless centuries, astrologers had predicted events by observing stellar trajectories. They gradually fumbled toward some laws: just before the appearance of Yin Chi star, it will rain; when Huan Hua and Sui Zheng arise together, it means no bumper harvest for farmers. The most profound law involved the very existence and future of the Yu people. It may have been that God once made the hidden meaning of the stars clear to Yu folk, but that knowledge had been lost. If given the chance, Yun Xiangzi would have spent the rest of his life feasting his eyes on the Book of Revelation’s tiniest mystery.\nThese days, he persisted in surveying the stars. Their orbits had not changed. This gave him some measure of reassurance about the future.\nOn the seventh day of drilling, a loud, dull sound came out of the great hole. An immense cyclone formed over the tunnel entrance, rising precipitously into the heavens. A squall erupted. Air poured rapidly into the ground, as if it meant to inhale the world. No Yu folk dared to fly.\nThe gale persisted a day and a night, then gradually subsided.\nAnother three days passed, and the astrologers were invited by the King to enter the tunnel. A massive net covered the entrance. After showing their identification papers to the guards, they hastily flew down the hole.\nThe tunnel was not so large, the diameter just eight or nine meters, corresponding to the size of the drill bit. Yun Xiangzi and Feng Mingyue had never been in such an environment before, so they prudently controlled their angle of descent, avoiding collision with the hole’s walls.\nThe tunnel plunged down vertically. Every so often there was a soldier near the wall, holding a luminescent pearl to light the pitch-dark way.\nThey gradually realized the farther down they flew, the more effort it was taking. Yun Xiangzi was obliged to reorient, head down and feet up, facing the wind tunnel’s deep abyss, feet pointed at the entrance. This soon felt like soaring upward. The other two astrologers followed his example, making their flight attitude adjustments. Sure enough, flying got a bit easier.\nSharp-eyed Feng Mingyue couldn’t help reaching out and touching the wall as it passed. He didn’t know when it had changed, but the tunnel was now going through solid adamantine.\nAs they flew on, they began to tire again. It was like a faint power tugged them back toward their world. Their progress slowed, until just staying in place cost great effort.\nYu You was the first to succumb, his wings failing him, and he plunged downward—no, not downward, but toward the wind tunnel’s mouth. Yun Xiangzi and Feng Mingyue hastily overtook him and dragged him to a halt. This was all unimaginable back in their world. This strange force did not exist there.\n“Who’s there?”\nThey looked up to find the young King descending upon them and holding aloft a great, shining pearl.\n“If it isn’t the three masters,” he said, grinning as he discerned their faces.\nThe distinguished astrologers were now totally occupied in panting, unable to pay respects to their King, as etiquette demanded.\nThe King pulled on a rope secured to the wall. “Please use this, gentlemen. Even my fiercest warriors cannot fly all the way to the exit. Only by installing rope and pulleys could we move onward.”\nYun Xiangzi grasped the rope. The King knocked on the wall and somewhere soldiers began to heave, pulling the passengers up. This upward work of the rope contended with the strange force at work in their bodies, weighing them down, so they were being pulled in both directions. It was like the feeling that came with acceleration during flight.\nYu You’s gasping subsided. “Highness, were you able to find the world’s core?”\n“My engineers saw something incredible at the far end,” the King said. “I was eager to see for myself.” His kingly pearl-light flashed on the tunnel wall as it rushed by, creating immense, blurred shadows. “After drilling through this adamantine stratum, it took another three days for the engineers to rig the rope and pulleys. No one can reach the far end under their own motive power.”\n“And the far end is what?” Yun Xiangzi said, marveling at possibilities. “An underground exit?” Since ancient times, the Yu people had been confined to their world, their Earth-wrapped spherical sky-space. But what was under the Earth? Outside the sphere? Yun Xiangzi suddenly burned with the desire to explore, to venture into the unknown.\nYu You cried out, and one of his arms went limp, hanging at his side.\n“I think you’ve fractured a bone,” the King said, somewhat casually. “This place demands a lot of bodily strength. It is not suitable for the elderly. I think, sir, that you’d better turn back and rest.”\n“As an astrologer, I have a responsibility . . . ”\n“Rest assured,” the King said, his tone softening. “Your two outstanding pupils are here.”\n“In that case, I ask your leave to turn back.” Yu You, grinding his teeth, clasped his arm, releasing the rope and plunging downward like a shot arrow.\n“Professor!” Yun Xiangzi cried.\n“Don’t worry about him,” the King laughed. “As he approaches the entrance, this falling-power will fade, and he’ll be able to brake with his wings. And the net is there to catch him.”\n“Very well,” Feng Mingyue said, preoccupied with the metal wall of the tunnel.\nHe was curious as to the power source of the magical object that had drilled this hole. He pretended to fumble with his star lens and used the frame to scrape the wall. He rubbed the scraping between his fingers. Countless tiny metal grains reacted as if they were alive, responding to the energy of his rubbing, becoming flexible, and soft as tree resin.\nContinuing upward, the strain on their bodies increased, until their joints were popping and it felt like they would come apart at the seams. The bones of Yu folk were hollow and gracile—not so sturdy. Feng Mingyue wondered if he would fracture like Yu You.\nFortunately, just then the King said, “We have arrived.”\nTeeth clenched, the three of them climbed out of the hole.\nA desolate scene emerged before them, a plain stretching as far as the eye could see, paved in solid, gray metal. Here and there a perfectly straight gorge extended to the horizon. Overhead was pitch-black night, but the occasional light flashed on distant ground, enabling the explorers to see something of their surroundings.\nFar off was a cluster of lofty metal structures emitting an ice-cold radiance. The two astrologers, drawing on years of map drafting skill, reckoned the highest building was taller than all of Yu Kingdom’s observatories stacked.\nFurther off, the metal ground didn’t rise, instead curving gradually downward, forming a clear division between Earth and sky.\nThis was the outside of a spherical world.\nThe sky overhead felt oppressive, enveloping, no longer an Earth-wrapped sphere of air, but boundless space. A smattering of tiny white lights were sprinkled across the black canopy. If you gazed at them for too long it was like your vision would fly to the end of eternity. This incomparable vastness struck terror in the two astrologers.\nThe air was thin, but their difficulty breathing was chiefly due to the unprecedented weight in the pits of their stomachs. The immense pressure acted on every inch of their bodies. Their clothing, once light and soft, was now a burden.\nFeng Mingyue lay down and spread out his wings, letting the mysterious force press him into the ice-cold metal ground. “We’ve ventured outside of the world,” he murmured.\n“What an awful place,” Yun Xiangzi remarked. “Never mind flying. Walking is nearly impossible.” He lay prone on the ground, gnashing his teeth.\nThe massive drill bit lay to the side of the tunnel mouth. It had been stranded there since completing its task. The King, in a great feat of will, walked to its side and touched it. He couldn’t imagine how to bring it back. “We’ll have to leave it here,” he said regretfully. “We’ll have to lose an object of royal power.”\n“And those structures over there?” Feng Mingyue said. “They are the world’s core?” His back spasmed with pain, and he wondered if his ribs were broken.\n“You guess right. Come, let us make our way to it.”\nThe three of them went staggering along, unable to fly in the grip of this weighty force. Their lungs sounded like old bellows as they breathed the rarefied air. The ground was composed entirely of infinitesimal kernels of smart metal. After the travelers had passed by, their footprints began to vanish and were gone in minutes.\nThey didn’t know how long they toiled. Nearly spent, they finally came before the brilliant edifice of the towering structures. On this sunless dark side of the world, even the best astrologers couldn’t reckon the passing of time.\nThere was no lamplight. The glossy metal surface of the architecture was like some ancient behemoth’s skeleton, glowing with phosphorescence.\nFeng Mingyue, although foaming bloodily at the mouth, was moved by what he saw. He met Yun Xiangzi’s gaze and they understood each other’s excited trembling. Inhaling deeply to calm himself, his back pain flared, and darkness threatened to engulf his vision. But a premonition seized him, somehow propping him up.\nThe King solemnly raised the Book of Revelation. Confronted by this divinely given talisman, the world’s core opened its vast gates.\nThey walked down an interminable corridor. There was all manner of strange machinery to either side, remnants of the era of divine creation. The King’s Book revealed a map of the world’s core. Guided by this, they finally arrived in a round hall, the core of the core.\nFeng Mingyue stared in amazement at the floor. Hundreds of jade blocks were piled there. “Books of Revelation!” he cried with abandon. There was only one back in their familiar world, of unparalleled value and guarded jealously by kings. Here they were scattered like refuse.\nHe rushed over and picked up a block. Yun Xiangzi snatched another. No astrologer could resist such enticements.\n“I’ve never in all my life seen you rush ahead of me before.” Yun Xiangzi was surprised he still had the energy to feel moved. But Feng Mingyue didn’t acknowledge him. He was too absorbed in his Book of Revelations and the answers therein.\nHe recalled the three ancient Propositions that had been passed down through generations of astrologers. If the stars really decided everything, then these Propositions were of prime-moving importance:\n“Who are we?”\n“Where do we come from?”\n“Where will we go?”\nFluctuating patterns gradually formed upon the jade block. Ancient history paraded before his eyes, act upon act of the great drama, while fragments of God-given knowledge flowed slowly into his thoughts:\n“ . . . they were created, modeled on the angels of ancient legend . . . defend us in our dormancy . . . ”\n“ . . . ancient sun on the eve of its death . . . Earth remodeled . . . ”\n“ . . . during our dormancy . . . Earth would proceed toward new . . . ”\nFeng Mingyue gasped for air, not knowing if it was the strain on his lungs, or the shock of sudden revelation. Then the ground pitched violently under him, and he fell to his knees.\nThe young King’s face paled horribly. “All I did was . . . what the Book of Revelation advised . . . ”\nA heart-stopping, thunderous roar came from the Earth’s depths.\nThey still didn’t know the consequences of restarting Earth’s core. It meant the restoration of the globe’s interior to its condition just after divine creation. Mountains, rivers, forests, the royal palace, implements and wares, all creation formed of infinitesimal smart particles—all would reset to their initial states.\nThis included the motion of Earth itself. Forty-six vectoring geysers on the outer surface adjusted their angles, and the Kingdom of Yu was pushed onto a radically new trajectory. Feng Mingyue lay prostrate on the ground and could not rise. Bubbling blood oozed from his mouth with labored breath. Recollections flashed through his mind, life in the Kingdom, life among his fellow Yu people, comfort, contentment, the freedom to soar and to float.\nOnce upon a time, he believed the stars decided everything. Now, Yu folk had changed the stars with their own hands.\nAnd what sort of future would this mean for the Kingdom?\nThe Book of Revelation was silent in his hand.\n3: Mirror\nA tiny grain of dust fell into his eye. Thirty-five hundred years later, the great serpent blinked.\nHis eyes were immense, exotic spaces formed of sixty million stellar black holes. Light advanced through the four-dimensional space-time of the cosmos, finally sliding along its curvature into the black hole cluster, and it was perceived by the giant snake.\nEvery feeble little ray, whether it originated in a dying star or a dim, rarefied nebula—even if attenuated to a few quanta by a difficult journey of ten million years—would, in the end, be captured by the serpent’s eyes.\nThis grain of dust was no different.\nIn a flash, it disintegrated in the black hole. In the twinkling of an eye, the sealed biosphere of the ark was ripped open by black hole tidal forces. The power source in the hollow sphere died at once. The intelligent lifeforms transported by the sphere couldn’t change their interstellar trajectory, whether or not they had predicted this fate.\nWhen the giant snake had blinked, the elastic space in the black holes gave rise to an oscillation. This released gravitational waves that rippled outward. After ten billion years, this fluid gravitational glance would propagate throughout the universe.\nThe great snake looked upon his body.\nIt was an immense body of stars and matter ten billion lightyears long. Its density was not uniform, as it consisted of dozens of galactic clusters, each cluster containing tens of millions of nebulae, every nebula containing hundreds of billions of star systems. As for the dust and other matter orbiting these stars, it was not quantifiable. And there was hot and cold interstellar gas, mingled with radiating energy, that with all the rest formed the great serpent.\nHis body was so colossal that when he gazed upon the tip of his tail, he saw it as it was ten billion years before. He was completely ignorant of his tail’s current state. Ideas of “current” or “now” were fuzzy concepts to him at best.\nJust after noticing the wound-like breach in his body, he thought it must have resulted from the exertion of blinking. But he soon realized that couldn’t be: the gravitational waves of that blink couldn’t have reached so far yet.\nA spasm moved the section of the serpent’s body near the breach. The movement was faint, but directly caused two thousand galaxies to collide with one another. A magnificent radiance arose, two hundred million lightyears in extent.\nFive million years later, the awesome spectacle began to pour into the great snake’s eyes, but the breach was unchanged. It was like another fathomless eye, calmly regarding him. And yet, it was not a black hole. The celestial bodies near it were not affected by that sort of irresistible gravitation.\nThus, the serpent knew the breach was not in his body.\nIt was a breach in space itself.\nThe space he existed in was finite, yet limitless, warped so much by his gravity that it formed a hypersphere with no beginning and no end. Extend himself in any direction and he could eventually bite his own tail. He didn’t want to become an accidental self-devouring serpent, so he simply left well enough alone.\nThe great snake grew captivated with the breach five million lightyears from his eyes. He watched it, rapt, gathering any information that escaped from it:\nThe luster of stars reminiscent of primordial times, just barely discernible. Immense, brilliant air masses birthing countless galaxies. Whenever space shifted, the hot spots scattered throughout ejected matter that formed long, thin nebulae. When huge quantities of information passed through this merely three thousand lightyear diameter breach, wondrous images were diffracted out, and these followed curved space gracefully into the great serpent’s eyes. He began to perceive a being much like him, an immense lizard.\nAfter a brief eight thousand years of reflection, the snake began to adjust the distribution of galaxies within himself. He ignited three hundred supernovae. Their positions were all decided in advance, and their shockwaves interfered with one another just so, forming meaningful patterns.\nHe was sure that on the other side of the breach, the lizard would see his great efforts. Through some kind of intuition, he also knew the lizard would understand his meaning.\nHe waited twenty million years for the lizard’s reply—and that was just counting from his side. It might have been longer for the lizard over there, if the lizard spoke before seeing his message.\n“Hello.”\n“Hello.”\nTwenty million years had passed. Trillions of tons of matter had been converted into energy, becoming forever-useless heat in space. All for two simple greetings.\nWith unprecedented enthusiasm, the serpent went into action. He altered galaxy cluster motion, mustered a dense cloud of primeval particles spread across three lightdays, and began to accelerate star manufacture. He hadn’t been this busy since just after the birth of the cosmos.\nStars were born unceasingly, and they matured and exploded, and eight hundred million years later, a sentence took shape:\n“Where do you come from?”\nThe great serpent waited patiently and watched. Another 1.2 billion years passed, and the lizard’s reply came through the breach:\n“From a universe egg adjacent to you.”\nThey proceeded to communicate through a kind of self-elaborated language. Every word in this language included its meaning and its position in the whole semantic network. When the great snake saw “universe egg,” he immediately understood what the lizard meant.\nThere was no distance between adjacent universes. Space itself did not exist outside a universe.\nHe was in a universe. Although massive, he wasn’t really unbounded. The quantity of elementary particles in this universe was finite, after all, and each particle could only be in a finite number of states. The universe, therefor, could only be in a finite number of states. Precisely speaking, this number was equal to the number of possible states of elementary particles, raised to the power of the number elementary particles in the universe.\nThus, the number of possible universes was also finite. This meant if you went far enough, after browsing enough universes, you could in the end find a universe identical to yours.\nSeemingly endless time passed. The snake conversed with the lizard, constantly consuming stars. Time was meaningless for them.\n“How did the breach between our universes come to be?”\n“I do not know. Perhaps because I blinked.”\n“Just before the breach, I blinked as well.”\n“Does time pass at the same rate for both of us?”\n“As long as our times are flowing in the same direction, it is not an issue.”\n“So, causality is the same for both of us . . . ”\nTen billion years, long enough for galaxies to be born and die, was just long enough for them to exchange a few phrases. The giant snake gazed at the breach, at the small segment of the lizard that was visible. Entranced, he began to feel they’d been conversing since the birth of the universe, or that their dialogue was so ancient as to be measureless.\nThe lizard was the only other being he knew of in existence. He wondered why they could understand each other. Among nearly limitless universes, communication had occurred between the two of them alone. It was like a fantasy, a dream. Perhaps it was likely that information passing through the breach underwent mysterious transformation. If the topology of the semantic network remained unchanged, he would be unable to confirm the meaning of the lizard’s words.\nSo, he asked:\n“What if it is like this . . . when I asked, ‘Where do you come from?’ . . . you thought I asked, ‘How many eyes do you have?’ And you replied, ‘Three.’ And I thought you said, ‘From a universe egg adjacent to you.’ Well?”\nThis complex question took three billion years to organize. The lizard’s answer was succinct:\n“What difference would it make?”\nAfter a brief two thousand years of contemplation, the great serpent felt relieved.\nBut another question disturbed his peace. What if the breach was just a tangled region of local space-time in his universe? Such a tangle might change certain light rays’ routes in the past and future, reflecting them back to his eyes. In other words, there might be no adjacent universe, no lizard, no breach, just a gravitational reflector, a mirror reflecting the serpent’s past or future.\nIf he defined the universe as all of time and space he could contact, and defined himself as everything in the universe, then this mirror hypothesis would be absolutely fitting.\nHe carefully watched the lizard, hoping to recognize himself in it, hoping to see his reflection. But he soon gave up, because he didn’t really know what his development had looked like, let alone how his future self might appear. In this universe, the most difficult thing to know and recognize was oneself.\nThe lizard put a question to him:\n“What do you look like over there?”\nThe great serpent gazed calmly at the stars in his mirror, and replied:\n“Come over and see.”\nThen he began to wait.\nA billion years later, in the wake of the breach’s slow expansion, something began to emerge, extending gradually, something formed of a hundred familiar and unfamiliar nebulae. It was a toe. And the giant snake knew the lizard had accepted his invitation.\nHe watched stars on the far side of the breach slowly moving, forming a resplendent smile.\nOriginally published in Chinese in Science Fiction World, May 2006.\nTranslated and published in partnership with Storycom.\nShakeSpace is a Shanghainese author of science fiction and fantasy. He loves to build worlds with imagination and language. His stories have been published in Science Fiction World, and his longer works include the science fiction novel The Scythe Holder and the fantasy series Jiuzhou. When he's not hard at work sitting in front of a computer, he is probably playing with his son or training at the gym.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}