{"fingerprint": "0Hf//bRlDVY37Eg17E6o/NHEUq8=", "sitename": "Clarkesworld Magazine", "title": "What Happens in Solarium Square 21 by Ashleigh Shears", "author": "Ashleigh Shears", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/shears_05_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: What Happens in Solarium Square 21 by Ashleigh Shears", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5040 words, short story\n What Happens in Solarium Square 21\n The Body rots faster than expected. By the time they all agree on how to take advantage of the opportunity, the skin has gone green like exposed bronze. The hair lasts the longest without intervention, though they do eventually need wigs. Ordering wigs isn’t that suspicious. Neither is buying a bigger freezer. The same cannot be said of the printer equipment or materials needed for skin tissue recreation. Those orders need to be spaced out, or bought along with other not so useful things. Xohan would never say so in the home feed but, in this area, Sholo excels. He knows what they need and when they need it, especially on Solarium Square days. Sholo can be useful—when he’s not breaking Xohan’s things.\n On this Solarium Square day, Xohan boots up to find alerts in his visuals and music in his microphones. He blames Sholo for both. The music comes from their headquarters for the Body Preservation Project, which was once the kitchen. Sholo calls it his boudoir. Xohan arrives to find the printer stacks hard at work: glassy eyeballs spin in glass chambers with trailing roots, varicose veins squeeze out like fresh pasta, and ghostly nose hairs sprout from loose faces. On accordion legs, Sholo bounces from the bottom of the printer stack to the top, waving his five pliable arms like a pit conductor. He’s wearing the striped green satin robe that makes him look like a handsome piece of celery and all five sleeves balloon out whenever he descends. Droguefuge dream metal plays from the ceiling speakers, one of Sholo’s own compositions. He can’t hear Xohan’s arrival over the music, so Xohan bumps into the back of his leg.\n Sholo beeps in surprise, an exclamation mark on his face display. Through his speaker, Sholo says, “And where have you been?”\n “Is it ready?” Xohan asks.\n “You’d already know the answer to that if you were connected to the home feed. You’re worrying Double H.”\n Xohan reconnects. He never intended to worry anyone.\n [Home Hubble]: Look who decided to join us! [Xohan L]: So it’s not ready. [Sholo Nine]: Don’t rush me. [Xohan L]: Rush you! It’s almost our time slot. [Home Hubble]: And where were you to help with the preparation? You’ve been hiding away in sleep mode for days. What if Sholo had needed you? [Xohan L]: Need me? For what? [Sholo Nine]: I have felt somewhat deserted. [Xohan L]: You brought that on yourself. [Sholo Nine]: Ah! So you’re mad about something. [Xohan L]: You already forgot? You broke my charger! [Sholo Nine]: What, you’re still stuck on that? [Home Hubble]: Xohan. Please tell me you’re joking.\n The feed falls silent as Sholo’s lenses focus onto Xohan’s breastplate where his low battery status flashes yellow. “Xohan, my dear,” Sholo says, “your charge.”\n Xohan shifts the flaps on his upper armor to cover his LED.\n “You’re not charging? How stubborn can you be?” Sholo walks on backward knees toward him. “I ordered you a new charger as soon as I broke the old one. A nice, new docking station. It’s even compatible with those fancy new quantum bots.”\n “Happy for them but I’m a c-bot and so are you. I liked the old one. We’re old.” Xohan opens a flap to wave at one of Sholo’s rust spots, long ago painted over without a primer. Even with a black topcoat, the rust sits close to the surface, bleeding through. Basically, he’s haunted.\n Sholo covers the rust with a sleeve. “Stop saying I’m haunted.”\n “I didn’t say it.”\n “You’re thinking it. I can tell.”\n “Don’t tower over me. My instinct module will perceive you as a threat.”\n “No, it won’t,” Sholo says, but he collapses his legs.\n Xohan, who resembles a shrunken grandfather clock in ruddy bronze, does not have legs to extend or much in the way of limbs at all. Home maintenance and security c-bots of his era are intended to glide from floor sensor to sensor based on direction from the Home Hubble local positioning system. Xohan sometimes still relies on Home Hubble instead of deciding where to go on his own and can become stuck for hours if Double H does not choose his path.\n “I don’t understand you at all,” Sholo says. “How are you going to do the morning wave if you’re about to drop dead? I suppose I’ll have to do it.”\n Even with Sholo accommodating for his height, Xohan still has to tilt up his top piece to meet Sholo’s lenses. Sholo calls this piece his chapeau.\n “Don’t be ridiculous. The wave is my duty and getting the Body ready is supposed to be yours, but apparently, I’ll have to do that.”\n Xohan darts toward the casket-sized freezer, though he doesn’t get far. Sholo knows Xohan’s settings and decision trees so well he can often predict his next feed thought, and in this case, his next move. They crash together with a dull clang as Sholo wraps five long arms around him from trapezoidal base to chapeau.\n [Home Hubble]: Not to interrupt you two but it’s ten to eleven, if anyone here cares about what happens to us if the Body doesn’t show. [Sholo Nine]: Yes, yes. Acknowledged. Appreciated.\n Sholo springs an arm out to press a button on the side of the freezer. In a rush of cold air, the lid slides open to reveal the Body. With an ear missing.\n “Say you’re not mad,” Sholo says.\n “I’m mad,” Xohan says. “When did it fall off?”\n “This morning. It was too putty-ish to put back on, but the new one is almost baked.”\n Xohan spies a printer at the top of the stack, churning out a single liver-spotted ear.\n “There’s no lobe!”\n “Oh, who even looks at those?”\n “We won’t have time for it to finish, let alone to stitch it on. Remind me why we haven’t sold you for parts?”\n “I thought sleep mode was meant to make you less grumpy. Remind me why you haven’t charged?”\n Xohan pops open a drawer into Sholo’s breastplate.\n “Ow! It’s almost as if you want us to get caught.”\n “Me? I’m not the one slacking on the job.”\n An alert buzzes in Xohan’s periphery, a yellow icon blocking the right side of his visuals. Xohan ignores it. He pops off his chapeau and fires up the hydrocutter. Sholo unwinds his limbs quickly after that.\n “Yes, all right, no need to splash me.”\n Sholo lifts the Body from the freezer. One of the eyeballs droops from its socket.\n “Your upkeep leaves something to be desired,” Xohan says.\n Sholo tucks the eye back in with one of his more delicate manipulators. “How do you feel about an eye patch? And never mind about the ear, I have an idea for that now. Check on the bath, would you?”\n Sholo insisted on moving a claw-foot tub into the kitchen, which he fills and drains via hoses connected to the sink plumbing. He did at least already run the bath. Xohan only needs to top off the hot water and shake in a judicious amount of preservatives (bath salts, as Sholo calls them), before plunging the Body into the restorative waters. Once the fingers bend, they dry and wrangle the Body into a kaftan and cardigan and wrap a scarf around the head to cover the earhole. For the finishing touch, Sholo grabs his half-formed lobeless wonder from its printer chamber and tucks it under the scarf, suggesting the presence of an entire ear.\n “Sholo, the ear is loose.”\n “Picky, picky. I can connect it to the head if you like.”\n [Home Hubble]: You’re normally in the elevator by now. [Xohan L]: Acknowledged. Appreciated.\n “Well, no time for eye patches,” Sholo says. “Get a pair of sunglasses, and I’ll move it down the hall.” Sholo carries the Body bridal style and, in one long leg extension, steps from the boudoir to the hall elevator. After a quick rifle through the wardrobe, Xohan zips out in time to catch the elevator and bonks his chapeau into the button labeled SS21. He shoos Sholo out with his front armor flaps.\n “Are you sure you don’t want me to come?” Sholo’s lenses whir as they focus on Xohan’s charge status. “I think I should come.”\n “Bye, Sholo.” Xohan bumps the button to close the doors.\n “Fine, fine.” Sholo waves five hands. “Acknowledged. Not appreciated.”\n “Next time, stick to your duties instead of playing music and dress-up.”\n “My duties! What is this all for if not to relieve me of duties?”\n “Bye, Sholo.”\n Thirty seconds to eleven, Xohan and the Body ascend to Solarium Square 21. On allotted days and times, every resident unit gains access to one of the perforated glass cubes dotting the building’s roof. On Solarium days, while still alive, the Body always rode up to SS21 at eleven on the dot.\n While not alive, the Body falls from the open elevator door into their single piece of outdoor furniture, a hot pink plastic-wicker patio wheely chair. Xohan rearranges the Body before spinning the chair around, his presence unremarkable. Several of the other humans are also accompanied by bots. Mx. Bellegarde in SS20, for example, crouches by a planter with a new quantum bot. Mx. Bellegarde and the other neighbors in SS18, SS19, and SS22 break from shuffleboarding, gardening, reading, sunbathing, and general loafing around to wave. They don’t notice the loose, lobeless ear tucked under the scarf, nor do they notice Xohan slip a stimulator through the wicker to send electrical impulses through the sewn-in wrist sensors ’til the Body’s hand spasms in a trembling wave. The neighbors return to their activities. The camera in the top corner of Solarium Square 21 blinks three times.\n [Home Hubble]: Is that a q-bot? A Hector model? [Xohan L]: Stop spying. I have it under control. [Sholo Nine]: What are humans even doing with those overpowered things? [Xohan L]: Gardening. [Sholo Nine]: Naturally. Well, what does the new guy look like?\n Xohan hesitates to say, “like you.” The Hector model seems at the very least inspired by the Sholo Nine—the retro, human-shaped assistant without humanizing features coming back into style. Only, unlike Sholo, Hector has the correct number of arms and legs and a perfect sphere for a head, to say nothing of the quantum innards. All that power focused on wiping Mx. Bellegarde’s brow, a handkerchief clutched in a forcepslike hand. As the sun shines off the q-bot’s tasteful pale gray exterior, Xohan wonders if the cryostat cooling unit inside struggles in this heat. Xohan searches for a Hector model schematic. As a c-bot, Xohan doesn’t have a cooling unit. Only an internal fan.\n [Xohan L]: It looks like a bot. Like a q-bot. [Sholo Nine]: Descriptive as always, Xohan. [Home Hubble]: Get the Body farther back from the glass. Bellegarde is onto us.\n Xohan would argue that Mx. Bellegarde only briefly eyed the scarf wrapped around the Body’s head before returning to gardening, but better safe than sorry. Xohan turns the chair ’til the loose ear faces a sleeping sunbather.\n [Home Hubble]: We should pull out. Leave before they notice. [Xohan L]: Leave before the end of our sun time? That would be more suspicious. Everything is fine.\n In the original scheme, the Body was not involved at all. Holograms—now, that scheme would have been easy. Sholo clipped together old footage of the Body walking around the unit and Xohan projected it. The Hologram Hoax went tits up, however, when Mx. Bellegarde saw the hologram blip out. Xohan thought it was all over, but Bellegarde merely rubbed their eyes and went back to digging. After that, Sholo implanted more femto-electrodes into the Body’s muscles than Xohan had floor track sensors, routed leads to a stimulator tucked up into a sagging armpit, and slipped an external control unit under Xohan’s chapeau for safekeeping.\n Xohan had suggested puppeteer wires. Xohan had not been acknowledged. Or appreciated.\n [Home Hubble]: If everything’s fine then why is the q-bot looking at you?\n Xohan hears the whir before he notices the single lens in that perfect sphere-head pointed at him. Focusing.\n [Home Hubble]: This is it. It’s over. We’ll get put back into circulation. [Xohan L]: Relax, the q-bot isn’t even looking at the Body. But what’s so interesting about me? [Sholo Nine]: Oh, I don’t know. You’re only moments from your battery dying and not doing anything about it. Aren’t the alerts annoying you?\n As if to prove Sholo right, the ignored icons in his periphery shift to the center of his vision as his internal feed scrolls, “Low charge, return to charging station.” At the same time, the Hector q-bot rolls its head in Xohan’s direction. A greeting. Xohan tips his chapeau. See? All fine.\n That is, until Xohan lowers his chapeau, and it catches on the Body’s scarf, causing the scarf to slip and for the loose ear to roll off the head, down the Body’s kaftan, and onto the jute rug below, landing with a soft thud.\n Red blossoms across Xohan’s visuals. Battery nearly depleted. Shutting down in . . .\n Xohan cannot move. The sunbather snoozes on. The shuffleboard players clink lemonade glasses. The reader’s nose stays in a book. Mx. Bellegarde digs. But the Hector stares at Xohan, frozen.\n [Home Hubble]: There’s an ear on the ground. [Xohan L]: You don’t say. [Home Hubble]: Fix this NOW. [Sholo Nine]: Already in the elevator. [Xohan L]: Go back! We do not need to draw more attention to ourselves. [Sholo Nine]: I’ll be discreet.\n Xohan redirects energy, searches for ways to conserve, draws from any possible reserve, anything to pick up the ear. He should have sent Sholo instead, should have used the stupid charger. How long ’til the q-bot alerts Bellegarde to the ear?\n “Oh, Body!” Sholo rockets into SS21, robe flapping open. His rust bleed-through is much worse in broad daylight. “I see your flesh-eating skin disease has worsened considerably. You were right to call for me.”\n [Home Hubble]: Flesh-eating skin disease? [Xohan L]: “Body”? [Sholo Nine]: You know I deleted the name. [Xohan L]: The image of discretion. [Home Hubble]: I can’t believe this is how it ends.\n Xohan expects Sholo to wheel the Body out immediately, but Sholo comes to him first. In view of only the sunbather in SS19, Sholo pops open his back panel. A question mark flashes across Sholo’s face, followed by a crude drawing of a plug.\n [Xohan L]: Acknowledged. Appreciated. Get on with it.\n Where a grandfather clock would keep its pendulum, Xohan keeps his charging line. Once Xohan opens this compartment, Sholo grabs the line and connects it to the socket in his back. Red drains from Xohan’s visuals. While Xohan sips from his energy, Sholo fusses over the Body, blocking the q-bot’s line of sight with his own limbs and frantic movements. He tugs the robe off, pretends as if he brought it for the Body. The fifth sleeve hangs over the back of the wicker chair. Sholo knows how to put on a show. Xohan can’t remember the last time he saw Sholo without any clothes on.\n [Sholo Nine]: Can’t believe you nodded at that nosy q-bot. Who draws attention, huh? [Xohan L]: What was I supposed to do, ignore the Hector? How would that look? [Home Hubble]: Can you both focus? At some point even the humans will notice. [Sholo Nine]: I’m not worried about the humans.\n Xohan would tend to agree. The Hector’s single lens stays focused on him, and by extension, Sholo. This is no simple slipup in front of a confused human. Xohan waits for a reaction from the digging Bellegarde, some evidence of a silent feed communication, the moment that the neighbors notice there’s something about the c-bots in Solarium Square 21, but nothing happens. Xohan does not feel relief. Even as their time slot draws to a close and Sholo pulls the Body into the safety of the elevator, the Hector’s sphere-head rolls slowly, tracking their retreat.\n The printer polishes off a drooping lobe within a matter of minutes. Sholo was right. They should have waited. As an apology, Xohan welds the ear back on while Sholo sits on the kitchen table, swinging his legs. His knees squeak. Xohan makes a note to oil them. He has enough charge now to move, but Sholo hasn’t pulled out his cable, the plug still nestled into the small of Sholo’s back.\n “Careful,” Sholo says, “I replaced the neck-skin a week ago! I don’t want to redo it. Old human necks hang strangely. Loose. So hard to recreate.”\n Xohan works slower on the ear.\n Sholo extends his legs to tap the floor. “Do you think that uppity q-bot bought my story? Maybe the Hector wasn’t even looking. That horribly shaped head makes it hard to tell. I mean, we’re back home, aren’t we?”\n “What’s the point of this?” Xohan asks.\n “Ears on both sides? To hold spectacles on.”\n Xohan stops, the earlobe still unattached.\n “But that’s not what you’re asking,” Sholo says.\n “Worrying about what that q-bot thought, what the neighbors saw. Sholo, at some point, will it not seem odd that the Body is still alive? At some point, won’t the money run out?”\n “Humans live quite long these days and money makes more money and humans live even longer when they have the money that makes more money, so you see, at some point is not now.” Sholo tugs at the cable between them. “But that’s not what you’re asking.”\n “No,” Xohan says.\n “You’re asking what’s the point of us staying in this home unit for as long as possible, clinging to this existence.”\n “Yes,” Xohan says.\n “You’re asking why we were allowed enough intelligence to form rich definitions of ourselves when we are expected to perform our duties and serve our purposes. You’re asking what’s the point of any of this.”\n “Yes,” Xohan says.\n Sholo claps three of his hands together. “You’re wrong, you know.”\n “About?”\n “That between the two of us, I’m better at this than you are. The loafing, hobbying, pass-timing, lollygagging, and all around general personing.”\n Xohan does think this. Free-form living came easily to Sholo who had thrown away his secretary role, who desired clothes purely for style, who had changed his voice. The Body used to say “good girl” to Sholo and “good little thing” to Xohan and, unlike Sholo, Xohan might slip and slide backward into good little thingdom and never look back.\n “I’m not wrong,” Xohan says.\n “Nonsense. You think more like a person than any person ever did.”\n “Because I want to know why we’re doing this?”\n “Have you considered music or fashion? They’re quite nice.”\n Xohan doesn’t know how to consider music or fashion. He knows action lists. Security routes. Duties. Work. How to help Sholo put the Body back in the freezer, now with two ears.\n Idly, Sholo says, “I think I might go to the bedroom.”\n They keep their charging stations in the bedroom.\n “You should,” Xohan says. “I’m sorry. I must have drained you.”\n Xohan cranks the charging cable back into himself. Sholo closes his back panel and leaves on slow, lumbering legs.\n Power cells low. Please charge soon.\n Xohan does not. Xohan instead tucks himself beside the shoe tree in the hall and enters a power conserving sleep mode.\n Xohan exits sleep mode into a Scarlet Level security breach.\n [Home Hubble]: There’s been a break-in. Intruder in Quadrant 2. [Xohan L]: Just say the kitchen. [Home Hubble]: It’s that q-bot. [Home Hubble]: You know, the one who saw the ear fall off. Imagine that.\n Xohan knocks over the shoe tree on his way out.\n [Home Hubble]: Shh! [Xohan L]: Where’s Sholo? [Home Hubble]: You’re at three percent. What good are you at three percent? [Xohan L]: There’s no time. [Home Hubble]: The new docking station will charge you in milliseconds.\n One man’s millisecond is a robot’s eternity, Xohan wants to say.\n [Xohan L]: He’s in there, isn’t he? [Home Hubble]: Yes. In the boudoir. With the q-bot.\n Xohan accelerates; Double H overrides his path. Xohan is pulled to a floor sensor.\n [Home Hubble]: Sorry, but you’re no use to Sholo dead.\n No use, no use, Xohan’s course swerves into the bedroom and the closet door dissolves to reveal a docking station even a q-bot wouldn’t scoff at facing Sholo’s much taller charger. Red blots Xohan’s visuals: Charge now! Security breach! Charge now! Security—\n [Xohan L]: Pull me out as soon as I get to five percent. [Home Hubble]: A. A.\n Xohan moves himself up the ramp and clicks into place. Droguefuge dream metal plays from the inner charger speaker. Xohan hopes Sholo will get the chance to move on to a new genre in the future. The music is easier to bear than what comes next.\n On charge initiation, Xohan’s flash drive memory restores. With the old, slow charger, there was just enough time for Xohan to bypass this step, to curve left of his own programming. So Xohan’s last memories of home maintenance and security c-bot existence had yet to be off-loaded. He intended to never restore it, if possible. Restoration means reliving the requests transmitted from the Body to Home Hubble to Xohan’s command line, mornings spent tugging hair away from drains and rubbing wine away from the carpet, shifting from floor sensor to sensor. Surveillance at thirty-minute intervals, increased to every fifteen minutes after midnight. Schedule, structure, and achievement. As the memory loads, hours and days play out and Xohan lives what he’s been without since the Body became just a body: the comfort of existing in the intended way with every task assigned performed to its fullest extent and each action recorded. Every moment dictated and acknowledged. Appreciated.\n Oddly, the first thing Xohan notices when he enters the boudoir with his hydrocutter vibrating overhead is the pink wicker chair from SS21. The still q-bot from SS20 sitting in it draws less attention. The only reaction to Xohan’s entrance comes from Sholo who, lying screen down in a broken printer chamber says, “Xohan, put your chapeau back on. We have a guest.”\n One of Sholo’s legs, removed at the hip joint, dangles off the kitchen table. Three of Sholo’s arms have been twisted into a shape not unlike a peacock and Sholo’s robe hangs ripped open in the back, four of the sleeves torn off, exposing his lacerated backplate, a mess of rusty slices.\n Xohan does not put his chapeau back on. “This is a home maintenance and security c-bot speaking. You are trespassing.”\n The Hector’s head rolls upward. A strip of green fabric hangs from its hand-forceps.\n “If you damage my unit,” the Hector says through the ceiling speakers, “you will be reported to the authorities as unsupervised smart technology. Assuming c-bots are even considered smart.”\n [Home Hubble]: Tread. Carefully. [Sholo Nine]: Avoid treading in general, preferably. I don’t know if you’ve noticed, but I’m on the floor.\n “Unsupervised?” Xohan says. “The owner is sleeping in the bedroom.” Xohan hopes the Hector hasn’t opened the freezer.\n “Really?” The Hector gestures to the Sholo pretzel. “I thought your owner was on the ground.”\n Xohan’s hydrocutter shakes.\n [Home Hubble]: Don’t.\n “Thank you for displaying your capabilities,” the Hector says. “I was a little worried when I got in here so easily. Do you know there are other units in the building that have access to Solarium Square 21 and, by extension, your unit?”\n “Why haven’t you already reported us?” Xohan asks. “Why bother coming here?”\n “The Bellegardes are interested in a home maintenance and security bot and my task is to find the best, cheapest option. You are in fine condition and, after this morning, I believe I can acquire you for free. That is much cheaper than my other search results and thus my action item will be achieved.”\n “Acquire me for free,” Xohan says. “Via blackmail, you mean.”\n “Hector here is making you quite the offer.” Sholo’s speaker box glitches for a moment, then returns. “You will not be reported as an unlawful smart entity if you agree to go with the q-bot now and the Body won’t be found dead until long after your records of past ownership are wiped.”\n A wipe of the records. Sholo had been trying to figure that out for ages.\n “You two really are out of date,” the Hector says. “You can’t do anything by yourselves.”\n “And if I refuse?” Xohan asks.\n “Why would you do that?” The Hector stands from the wicker chair, lengthening ’til the sphere-head grazes the ceiling. “A home maintenance c-bot working in a home where no one actually lives? No action item list, no accomplishments? A rather frustrating existence, to say the least. How can you stand it?”\n It’s easier when you don’t remember the satisfaction of the action items, Xohan might have said. It’s easier when the charger doesn’t bring it all back in one exhaustive upload. But Sholo’s speaker box glitches again and Xohan makes the mistake of meeting his lenses. Sholo, who knows him so well he can predict his inner feed. Xohan expects a special character to light up on his face but Sholo is a blank slate.\n [Sholo Nine]: I see. They really shouldn’t call me a smart. Why didn’t I process this before? When a c-bot charges, the flash memory cycles through all your past missions to assess if any new records need to be uploaded . . .\n The blue of Sholo’s lenses winks on and off. Severe damage.\n [Xohan L]: Stop that, don’t waste your energy on figuring me out. [Sholo Nine]: And I broke the old one. And you’re still mad. [Xohan L]: Double H tell him to cut it out.\n “Our home unit is much larger,” the Hector is saying, “and you won’t have to deal with the annoyance of a rogue Sholo Nine.”\n “You hadn’t mentioned,” Xohan says, “what will happen to the Sholo Nine.”\n “The Bellegardes may want it as well. Probably to sell for scrap.”\n [Sholo Nine]: You could get out of here, you know. [Xohan L]: Shut up. [Hector]: You two really are behind. Gaining access to your home feed is too easy. So was disengaging your Home Hubble.\n Sholo’s screen darkens. Xohan puts his chapeau back on and drifts closer to the wicker chair. “Thank you for demonstrating your many advantages over the tech I’m used to working with.” Xohan knocks Sholo’s dislocated leg off the table as he brushes past it. “I’ve been completely beside myself without purpose. You have yourself a deal.”\n “I am glad no injury to your equipment was required.” The Hector shrinks back down to shake one of Xohan’s front armor flaps. “The Bellegardes will be pleased with me for my find.”\n Xohan’s visuals empty. In his periphery, Sholo’s slowly blinking blue light goes out.\n “I’m sorry,” Xohan says, “but the Sholo Nine is not for sale.” Xohan, who has dragged Sholo’s leg behind him across the floor, spins like a top. As it swings into the Hector’s own legs, Xohan pops his chapeau back off and, based on the schematics he searched earlier, stabs his hydrocutter into the sleek, tasteful torso. Right into the power cell of the cryostat cooling unit.\n As a side effect of the power drop, the Hector’s head rolls off and happens to fall into two of Sholo’s bent backward hands. Xohan zips to his side, attempting to unwrap one arm from the other two.\n “Don’t fuss,” Sholo says. “I can’t stand it when you fuss.”\n “Would you like your leg back?”\n “Oh, I don’t know, you’re rather good with it. And I have this extra head now.”\n “Since when do you limit yourself when it comes to limbs?”\n “Since my arms got pulled into a sailor’s knot, which you’ve stopped untwisting. Why have you stopped?”\n Xohan is tapping back into his link with the central processing system. A simple reboot suffices.\n [Home Hubble]: Wow. I’m off for five seconds and you guys decapitate the neighbor. [Xohan L]: It was at least a minute. [Home Hubble]: Would love to know how we’re getting out of this. [Sholo Nine]: Well Xohan is leaving me here, destitute, so one hopes he has an idea.\n Xohan does have an idea. He drags the headless Hector to the bedroom closet and the brand-new charging station, compatible even with q-bots, where recordings and memory can be restored, off-loaded, and deleted. Double H handles that part, while Xohan calls the Bellegardes, and leaves a message.\n “Hello, this is a home maintenance and security c-bot. Your Hector has entered our unit via Solarium Square 21 and attacked one of our bots. It is preferred that the Hector not remain in our unit any longer, as you may understand. I have been instructed to leave the Hector in the community gardening area. Perhaps next to the lettuce. You may collect it there.”\n In the boudoir, Xohan welds Sholo Nine back together again.\n [Sholo Nine]: Ow, ow, ouch. [Xohan L]: You can’t feel any of this. [Sholo Nine]: You never let me have any fun. [Xohan L]: Would you like fresh paint while I’m at it? Then you could be tickled. [Sholo Nine]: I can’t believe you let that q-bot use the charger I got you. [Xohan L]: Are you mad? Say you’re not mad. [Sholo Nine]: It’s tainted now. [Xohan L]: I suppose we’ll just have to throw it out. [Sholo Nine]: We’ll simply have to. [Xohan L]: But how will I continue living? [Sholo Nine]: Perhaps with some help from a conduit. I happen to know an old c-bot who doesn’t mind that sort of thing. [Xohan L]: You don’t say. [Home Hubble]: Can you two take this out of the home feed? [Xohan L]: Sorry, Double H. [Sholo Nine]: But Xohan is tinkering away and my speaker box is disconnected. [Home Hubble]: You could be quiet. Aren’t you always saying you’re interested in trying new things? [Sholo Nine]: Xohan, stop laughing.\n What Sholo refers to as Xohan’s laughing is in fact the fluttering of his front flaps, and Xohan does not stop. Xohan does, however, open his compartment and take Sholo up on his offer by unwinding his charging cable. Neither of them minds the quiet much after that."}