{"fingerprint": "MHRdtewfyG7XipNaMHMK9f4tpQ0=", "sitename": "Clarkesworld Magazine", "title": "Lucius Shepard: An Expatriate Writer of Exotic Tales by Jason S. Ridler", "author": "Jason S Ridler", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/shepard_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Lucius Shepard: An Expatriate Writer of Exotic Tales by Jason S. Ridler", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Lucius Shepard: An Expatriate Writer of Exotic Tales\n There's an old saw about writers, are you a Hemingway or a Faulkner? Do you travel the world to write, or hunker down and find the secret language of one place like no one else? Lucius Shepard's work ignores such binary sound bites. Instead, his fiction carries the weight of a scavenging world traveler accustomed to the jungles of Honduras as much as the underbelly of America, and imbues it with the lush language of magic realists by way of the southern Gothics and classics, all with a distinctly dark timber. A graduate of the Clarion writing workshop in 1980, Lucius Shepard won the John W. Campbell Best New Writer Award in 1985, and his short fiction, novellas and novels have continued to amass a heady collection of Hugos, Nebulas, International Horror Guild, Locus, and World Fantasy Awards. His work often builds on his extensive travels and journalism work, interests in fringe art, all infected with a savage view of modern American culture and politics. Shepard's work is rich and sharp with both smooth and rough edges, stories that traverse genres as easy as a vagrant jaywalking on Christmas Eve. The result has been some of the wildest tales of the fantastic of the past thirty years.\n During your 2007 interview with Jeffrey Ford at Readercon, you dismissed the value of many of the current labels of fiction as they applied to your work (slipstream, interstitial, etc.). How would you best describe your work to someone who had not read it?\n I guess I'd say that I tell stories that are exotic in character. Some are science fiction, some darkish fantasy, some mainstream that read like fantasy, many set in foreign lands, but all set in environments given an exotic feel by the exactness of the details chosen to evoke that setting. That might translate into \"interstitial\" or \"slipstream,\" but every place I go seems alien to me.\n Although I've felt comfortable in various sections of Latin America, I've never felt at home anywhere, especially in the United States, which strikes me as an extremely odd place rife with insanities and the insane. When I'm overseas and I think about America, a phrase from an old Doors' song often occurs to me: \"...weird scenes inside the gold mine...\" The baroque madness that phrase evokes is expressive of my early adult impressions of my country, and nothing I've experienced in the decades since has done other than bolster those impressions. Of course people everywhere are functionally insane—if a quick scan of the world and local news isn't proof of that, then a close listen to a snatch or two one's inner dialog should state the case quite clearly. We're mad as birds, we just do a better job than the other species at aping common sense and a knowledge of the divine. So what I'm saying essentially is that I'm more in harmony with the delirium of the tropics than with dementia of the northern regions.\n I imagine this viewpoint (as regards America) derives at least partly from growing up in a town (Daytona Beach, FL) whose business was tourism, that really wasn't a place but rather a stage set into which a different crowd was moved every couple of weeks. For whatever reason, in my own country I feel like an foreigner, so I suppose another word I'd accept would be \"expatriate.\" Thus my answer would be, \"I'm an expatriate writer of exotic tales.\"\n You led a full and interesting life before making a commitment to writing fiction in the early 1980s, and attended the Clarion Writing Workshop at the age of thirty-three when most workshop attendees tend to be in their twenties. What made you decide to go, and how do you think your experiences up until that point had an impact on your work you did there?\n I didn't have anything else to do. My band had broken up and I was feeling depressed and listless. My wife at the time read about the workshop and persuaded me to submit a story to Clarion, so I wrote half a story, fifteen pages, and sent it in. That's the simple version of what happened—the novel-length version is a veritable saga of me fucking up in various ways and somehow landing on my feet at Clarion.\n As far as the age thing goes, I came to Clarion at the perfect time. Damon and Kate told us that Clarion seemed to work best for people who were ready to make significant changes in their lives, and that was precisely my mental state, though I wasn't aware of it then. Accordingly, I think my life up until Clarion, being hot-housed by my father, given a thorough background in classic English lit by the time I was 12, rejecting that education, dropping out of high school and later college, and running around the world...all that was an excellent preparation for a writing life. By the time I arrived in East Lansing I knew how sentences were made and had stories to tell. This put me ahead of most of my fellow students, the majority of whom still had yet to discover what their materials—the stuff from which mature stories are woven—would be.\n Having taught at a number of Clarions since, I think many people go to Clarion too early, before they're capable of benefiting from it fully...but maybe that's not it. One of most under-sung virtues of Clarion is that the workshop will let you know whether or not you really, really want to write, and that lesson is imparted in the negative to a large number of students every year.\n Kate Wilhelm recalled you being a great talent but something of a walking disaster area at Clarion (she mentions this in Storytellers, an informal history of the workshop). What were the most important moments from the Clarion experience?\n A walking disaster area, huh? I was having some crises in my personal life—music career winding down, marriage on a ventilator—and those problems came to a head at Clarion, but...well, I'll have to read what Kate said. I don't doubt she knows more about it than I do.\n The most important Clarion moments were probably, in retrospect, the feedback I received from professionals, especially since I received good feedback from such a diverse group of writers: Damon and Kate, AJ Budrys, Avram Davidson, Kit Reed, etc. That gave me the confidence to think that I could have some sort of career as a writer...and it also gave me a couple of places I could crash when I left home. But truthfully it's not that I can separate out any particular moments from that experience and say that was what did it for me. The entire experience was turbulent—emotionally, existentially, physically, every way—and served me like a slap in the face. It snapped me out of the funk I had been in for several years, and set me on a new path.\n Much of your work evokes the world in very vivid and often telling detail. You noted in a Locus interview that in your fiction there is a distinct relationship between the character and landscape. Steve Tem has argued that in some fiction, particularly horror and surreal stories, every part of the story is a representation of the main characters psyche. Can you see this in your own work?\n I think it's more complex than that. Yes, no doubt every element of a story is in some way a representation of psyche or a reflection of mood, but ideally it should also be itself. I mean, if you're going to have a barbershop in a story, it should exhibit a distinct particularity—it has to be a real barbershop and only secondarily should you be concerned with its relation to character. That's the most important thing—the reality of the thing described has to be there, has to be firmly established, or that section of one's story won't be capable of representing anything else. Actually this is the sort of thing that writers probably shouldn't concern themselves with at all, or—if they do—only in the most peripheral way, otherwise they'll start over-analyzing their work.\n Joe Lansdale argued that knowing an environment, region, or place was one route to finding your voice as a writer. Would you concur and how have the landscapes you've experiences shaped your own voice? If so, how?\n Yeah, I think that's sort of true. As a kid, growing up in a beach town, I always took the ocean for granted and the place that fascinated me was the Florida jungle—I saw a panther out in the wild when I was about five. Probably the last panther in Florida. That hooked me on jungles. Later in my childhood, doubtless because it was so radically opposed to my father's intellectual world, I became fascinated with pool halls and bars and the entire spectrum of the lowlife landscape. It follows that I've written quite a bit about lowlifes and jungles.\n With me, however, I don't know if it's as much a matter of landscape helping me find a voice—my father shaped my voice before I knew any better, loading my brain with iambic pentameter and certain tonalities. I think rather that landscapes have shaped my imagination and continue to do so. For instance, I recently spent seven months in Switzerland (mostly in Switzerland, some in northern Italy) and now the stories springing from that experience are starting to come, basically a series of stories set in a town called Syritis Sentrilla, a town that could be on Earth or off-planet. That's left to the reader's imagination. But the thing that's relevant here is that having barely dipped my toe into those materials, I can already see that these stories are going to have a much different feel from my previous stories—a different kind of architecture, different types of characters, a cooler spectrum of emotions.\n You were also the recipient of the 1985 Campbell Award for Best New Writer, five years after attending Clarion and having a string of publishing successes. Were you surprised by the win and how did it change your career or your perceptions of your work?\n I was in New York City and the convention where the award was handed out was in Australia, so I didn't take much notice of it. As to its effect on my work and my perceptions of my work, I suppose it validated it to an extent, but the effect was minimal.\n Awards are nice to win—for a day or so, they add a bit of glow to your sun. But in the end you always have to sit down in a front of a blank page or screen and do the work. I know this is a cliché, but getting to do the work has to be its own reward. Sometimes I hate the thought of waking up and writing, but then after a few minutes I'm totally engaged. I love my job.\n Your novel A Handbook of American Prayer plays off a number of themes, including the cult of celebrity. Wardlin's discomfort and intrigue with his growing success and apparent power is one of his central conflicts. I wondered if any of this was based on your own feelings in the wake of the Campbell Award or any other award you've received?\n I've never achieved enough celebrity to make a ripple in a birdbath, so the answer would be, No, not really. Wardlin Stuart, the main character, is partly me and what little I know about celebrity went into the book, but so did what I know about prison, Arizona, movie criticism, et al. The novel, for me, was about this specific guy who came up with a way to survive in prison and more-or-less accidentally became famous and was enough of an operator to parley it into bigger things and finally it went out of control. Celebrity was just where the novel went, the natural outcome of his character arc. I was mainly interested in him, only peripherally in the theme.\n I have about forty-five pages of notes for the novel that I didn't use, that I want to turn into a short novel called \"The House of Everything and Nothing,\" but they have nothing to do with celebrity whatsoever. I guess that shows that I realized the novel was about celebrity at some point and thus didn't use this material; but I was originally much more interested in Wardlin and his various predicaments.\n Much of your fiction has combined your interests and journalism work in a number of fields, from Latin American political and cultural history and issues, obscure rock and roll bands, to the Freight Train Riders of America. \"Over Yonder,\" which won the Theodore Sturgeon award, is one of my favourites, based on your articles on modern day hoboes for Spin Magazine and collected in Two Trains Running (Golden Gryphon Press). Can you walk us through the process of this story, from research, to the essays, to the story?\n I went out riding the trains for about six weeks, following a route that took me from the big rail yard in Roseville, California to Salt Lake City and Tucson, then north to Kalispell and Missoula. I slept in freight yards, in empty cattle pens, in hobo jungles. I froze my ass off and lived in filth and traded stories and drank fortified wine with grizzled men who had 10 percent liver function. It was interesting, colorful, and extremely uncomfortable—I've never endured more for a story than I did for that piece. I interviewed hobo murderers and the cops who'd caught them, and I made several visits to the supermax prison in Florence, CO. All in all, despite the hardships, it was a lot of fun.\n I was searching for the FTRA, an organization purported to be the hobo mafia, but that turned out to be more-or-less a bunch of drunks with attitude that a cop, one Robert Grandinetti, had tried to build into the hobo mob in hopes of selling a book about their miscreance and his heroic efforts to bring them down. In reality, the original FTRA were a small group of hobos, mostly Vietnam vets. They were sitting around beside the tracks in Kalispell one day when an XTRA container car passed, and one of them suggested that they should call themselves the FTRA, Fuck The Reagan Administration. Since that day, others had joined, but it was far more of a social thing, a fraternity, a brotherhood, than organized crime. There were crimes, killings, etc. as you'd find among any group, but nothing that would raise an alarm. When I found out that the hobo mob was Grandinetti's wet dream, I became less tense—the rails are a dangerous environment. Everyone that rides on a regular basis has stories about violence eluded or confronted, but not having to worry about a possible mob hit allowed me to relax.\n I returned home, wrote and turned in the article, and started thinking about all the different people I'd met out there—carnies, Native Americans, crusty punks, yuppie riders (people who made great money and took their vacations on the rails), migrant workers, hardcore hobos, etc. I'd run into this one hobo, an old Vietnam vet, Joshua Long Gone, who was sharper than most—he impressed me as someone who should have a story written about them, so I changed his name to Billy Long Gone and started writing.\n I'd gathered so much material out there, I could have written fifty stories. I wrote another and started a third, a companion piece to \"Over Yonder,\" but something came up and I set it aside and eventually let it lapse. I collected the article, two stories and an essay about the process of writing fiction from a non-fiction assignment, and thought that would be it. The material was so unique, however, that I never completely let go of it—it continued to have a hold over my imagination. Now I'm using that material to develop a TV series, a dark fantasy in some ways related to \"Over Yonder,\" for a Hollywood production company.\n You've written a lot if fiction concerning modern armed conflict, much of it based on the tragic military affairs in Central and South America, including US involvement. However, you also wrote one of the most graphic and gripping Vietnam stories I've read, \"Delta Sly Honey.\" What was the genesis of this story and do you know how it was received from any veterans who read it? Indeed, what reaction has there been in the US and South America to your war fiction?\n Back in the day, I was sitting around baked and listening to this Mexican guy calling out over the radio, trying to get in touch with a platoon, and I misheard his call. I thought he said \"Sugar Pie Honey,\" you know, like the old Four Tops song, \"Sugar Pie Honey Bunch.\" And it got me thinking about call signs, wondering why there wasn't more creativity shown in coming up with them, why they couldn't make up something better than Alpha Tango Bravo and like that. So I made up a few: Lobo Angel Silver, Delta Sly Honey, and so forth. Thereafter, whenever I heard \"Sugar Pie Honey Bunch\" I used to sing along with it in my head, saying Delta Sly Honey instead of Sugar Pie Honey. Years later sitting in a Greenwich Village bar near the corner of Charles and Hudson, waiting to meet my girlfriend, I started thinking about those call signs again, and it struck me that a ghost patrol with a weird call sign could work in a story. A few weeks later I sat down and wrote the first line.\n In that story I was trying to capture a little something of how eerie it is to be sitting around in the midst of a war, with people dying just over the hill, the various dementias that come to the fore, the subtle violence with which men and women torment one another when they themselves are under tremendous strain. As to reactions to this and other of my war stories, I've received generally favourable reaction from vets—no one's expressed any strong dissatisfaction, though I've had occasional quibbles with minor points.\n It seems the form best suited to your voice and stories is the novella. What do you think are the strengths and limitations of this form, and how do you find the market for novellas now compared to when you started out?\n I don't know if novellas suit me or if I'm just lazy. I suspect I'll find out this next year, as I'm starting a long novel.\n Novellas, to my mind, aren't a template for fiction, a form that has certain specific virtues. I believe they can do most things that a novel can do—in fact, I'm of the opinion that most novels would make good novellas or, at the least, short novels. I will say that the form encourages experimentation and that writing novellas and short novels has had the benefit of helping me compress my writing. Hopefully that will enable me to write a dense longer novel in which few words are wasted.\n The market for novellas is a little different today than in the 80s, but I think in a good way. The proliferation of the small press, publishers like Nightshade, Subterranean, PS, Small Beer, et al, have widened the market place for the novella. Anthologists like Ellen Datlow provide another market, though online publishing has also helped—\"Over Yonder\" was published online by Ms. Datlow and Sci Fi, and was the first online publication to win the Sturgeon. Most online venues, however, have length restrictions that are too short to do me any good. I have a novella coming out from Subterranean, one I'm writing for PS, and a couple more for the digests, and I have more on the to do list that I believe will find a home.\n While an often severe film critic, you've often shown an unabashed love for gutter fun films such as action movies (including the much anticipated Stallone throwback flick The Expendables) or parodies of such films (The Foot Fist Way). Are these just guilty pleasures, or do you find other values in such entertainment?\n What I don't like in movies is empty pretence. All art is pretension, but when there's a shoddy script, desultory acting and directing, and almost everything good about the picture falls under the umbrella of production values, you have a basic Hollywood movie: pretension without substance; thrillers in which there is no suspense, and the only thrills are jump scares.\n I have an honest affection for many types of films that aspire to be no more than what they are: farces, romantic comedies, martial arts flicks, etc. I like combat sports, so any picture that focuses on aspects of the martial arts or mixed martial arts has an appeal to me. As with anything, for every Ong Bak there are dozens of crapfests—I won't watch everything, but as a friend of mine said, I'd watch a knife fight in an alley, so I tend to be less judgmental as regards this sort of film. I'd much rather watch a movie like Office Space or The Hangover or Hard Times than have to sit through five minutes of a piece of dreck like, say, American Beauty.\n Your recent retrospective, The Best of Lucius Shepard (Subterranean Press), catalogues much of your career thus far. Looking back at the collection, your career seems to have changed in terms of landscape focus, from outside the US, towards the inside. Was this trajectory natural or considered? (or am I off base here?)\n Well, I did have a big short story collection in 2004 entitled Trujillo that incorporated close to a 100,000 words of Latin American material. The last five years, I've spent less time down there, though. Some of that's due to the death of Robert Izdepski, an activist who operated in Honduras and Nicaragua, and who I counted as a friend and by whom I was inspired to lend my efforts to various projects in the region. No one has come along to fill his shoes, and I simply don't have the connections to act on my own down there. My new collection contains one new Latin American story, however, and I'm planning to do some traveling in 2010 and 2011, again, though perhaps toward the Far East. Hopefully that area of the world will start appearing in new stories soon.\n While best known for novellas, you've also had early and current success with novels such as Louisiana Breakdown and Softspoken, both with very different female protagonists. Did you finding writing a novel from a female POV challenging?\n Not particularly. I have no trouble writing characters based on women I know, women who've been part of my life—I've concentrated on them and likely know them better than I know my male friends. If I had to make up a female character out of whole cloth, that might be a challenge—I haven't yet tried that. Still, I've had enough close relationships with women that I feel comfortable writing American and Latin female characters of various sorts. We'll see. I'm fussing with a novella called The Iron Shore that features a female protagonist quite different from the run of my other female characters.\n The publishing world and genre worlds have changed since you started publishing in the early 1980s. From the horror boom and bust of the late 1980s, to the rise of online markets and the death of many traditional avenues for print publishing. What's the biggest change in publishing now from when you started out, and do you think things are better or worse or just different now?\n Oh, I don't know. I'm not the person to ask about this, because I've never concentrated on career concerns. I'm not saying that's a good thing—on the contrary—just that it's true. I suppose things used to be better for writers, at least as far as the illusion of publishing went. Even when I started publishing, though, I heard constant proclamations of doom, and I never bought into the idea that publishers and editors were your BFFs.\n I'm somewhat excited by the advent of companies that don't adhere to the old publishing model, like OR Books, that intend to publish small print runs, invest heavily in advertising and concentrate on ebooks and POD. That model seems more author-friendly. But to tell the truth, I'm clueless about the situation and always have been.\n Where can folks find your most recent work, and what future projects can we expect?\n I have a short fiction collection that's due out any day (it's now Dec 14th) from PS Publishing called Viator Plus, which contains the rewrite of Viator, now a work of some 65000 words. I suffered a breakdown (clinical depression) while finishing the book, and did not complete it as I would have had I been healthy. So this is a make-up call, with 20 plus thousand words added. I also have a Dragon Griaule novella, The Taborin Scale, out from Subterranean in February, and a novella collection from Golden Gryphon, Five Autobiographies, out in late 2010, early 2011. I'm currently engaged in writing two novels, Piercefields, the long genre novel I mentioned earlier, and a slipstreamish YA novel, as yet untitled.\n Jason S. Ridler is a writer, improv actor, and historian. He is the author of A Triumph for Sakura, Blood and Sawdust, the Spar Battersea thrillers and the upcoming Brimstone Files series for Night Shade Books. He's also published over sixty-five stories in such magazines and anthologies as The Big Click, Beneath Ceaseless Skies, Out of the Gutter, and more. He also writes the column FXXK WRITING! for Flash Fiction Online. A former punk rock musician and cemetery groundskeeper, Mr. Ridler holds a Ph.D. in War Studies from the Royal Military College of Canada. He lives in Berkeley, CA."}