{"fingerprint": "cmwaE654LtomtniHx+lkAIShhfk=", "sitename": "Clarkesworld Magazine", "title": "Today I Am Paul by Martin L. Shoemaker", "author": "Martin L Shoemaker", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/shoemaker_08_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Today I Am Paul by Martin L. Shoemaker", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4920 words, short story\nToday I Am Paul\n2015 Nebula Award Nominee for Best Short Story\n2016 Winner: WSFA Small Press Award for Short Fiction\n“Good morning,” the small, quavering voice comes from the medical bed. “Is that you, Paul?”\nToday I am Paul. I activate my chassis extender, giving myself 3.5 centimeters additional height so as to approximate Paul’s size. I change my eye color to R60, G200, B180, the average shade of Paul’s eyes in interior lighting. I adjust my skin tone as well. When I had first emulated Paul, I had regretted that I could not quickly emulate his beard; but Mildred never seems to notice its absence. The Paul in her memory has no beard.\nThe house is quiet now that the morning staff have left. Mildred’s room is clean but dark this morning with the drapes concealing the big picture window. Paul wouldn’t notice the darkness (he never does when he visits in person), but my empathy net knows that Mildred’s garden outside will cheer her up. I set a reminder to open the drapes after I greet her.\nMildred leans back in the bed. It is an advanced home care bed, completely adjustable with built-in monitors. Mildred’s family spared no expense on the bed (nor other care devices, like me). Its head end is almost horizontal and faces her toward the window. She can only glimpse the door from the corner of her eye, but she doesn’t have to see to imagine that she sees. This morning she imagines Paul, so that is who I am.\nSynthesizing Paul’s voice is the easiest part, thanks to the multimodal dynamic speakers in my throat. “Good morning, Ma. I brought you some flowers.” I always bring flowers. Mildred appreciates them no matter whom I am emulating. The flowers make her smile during 87% of my “visits.”\n“Oh, thank you,” Mildred says, “you’re such a good son.” She holds out both hands, and I place the daisies in them. But I don’t let go. Once her strength failed, and she dropped the flowers. She wept like a child then, and that disturbed my empathy net. I do not like it when she weeps.\nMildred sniffs the flowers, then draws back and peers at them with narrowed eyes. “Oh, they’re beautiful! Let me get a vase.”\n“No, Ma,” I say. “You can stay in bed, I brought a vase with me.” I place a white porcelain vase in the center of the night stand. Then I unwrap the daisies, put them in the vase, and add water from a pitcher that sits on the breakfast tray. I pull the nightstand forward so that the medical monitors do not block Mildred’s view of the flowers.\nI notice intravenous tubes running from a pump to Mildred’s arm. I cannot be disappointed, as Paul would not see the significance, but somewhere in my emulation net I am stressed that Mildred needed an IV during the night. When I scan my records, I find that I had ordered that IV after analyzing Mildred’s vital signs during the night; but since Mildred had been asleep at the time, my emulation net had not engaged. I had operated on programming alone.\nI am not Mildred’s sole caretaker. Her family has hired a part-time staff for cooking and cleaning, tasks that fall outside of my medical programming. The staff also gives me time to rebalance my net. As an android, I need only minimal daily maintenance; but an emulation net is a new, delicate addition to my model, and it is prone to destabilization if I do not regularly rebalance it, a process that takes several hours per day.\nSo I had “slept” through Mildred’s morning meal. I summon up her nutritional records, but Paul would not do that. He would just ask. “So how was breakfast, Ma? Nurse Judy says you didn’t eat too well this morning.”\n“Nurse Judy? Who’s that?”\nMy emulation net responds before I can stop it: “Paul” sighs. Mildred’s memory lapses used to worry him, but now they leave him weary, and that comes through in my emulation. “She was the attending nurse this morning, Ma. She brought you your breakfast.”\n“No she didn’t. Anna brought me breakfast.” Anna is Paul’s oldest daughter, a busy college student who tries to visit Mildred every week (though it has been more than a month since her last visit).\nI am torn between competing directives. My empathy subnet warns me not to agitate Mildred, but my emulation net is locked into Paul mode. Paul is argumentative. If he knows he is right, he will not let a matter drop. He forgets what that does to Mildred.\nThe tension grows, each net running feedback loops and growing stronger, which only drives the other into more loops. After 0.14 seconds, I issue an override directive: unless her health or safety are at risk, I cannot willingly upset Mildred. “Oh, you’re right, Ma. Anna said she was coming over this morning. I forgot.” But then despite my override, a little bit of Paul emulates through. “But you do remember Nurse Judy, right?”\nMildred laughs, a dry cackle that makes her cough until I hold her straw to her lips. After she sips some water, she says, “Of course I remember Nurse Judy. She was my nurse when I delivered you. Is she around here? I’d like to talk to her.”\nWhile my emulation net concentrates on being Paul, my core processors tap into local medical records to find this other Nurse Judy so that I might emulate her in the future if the need arises. Searches like that are an automatic response any time Mildred reminisces about a new person. The answer is far enough in the past that it takes 7.2 seconds before I can confirm: Judith Anderson, RN, had been the floor nurse forty-seven years ago when Mildred had given birth to Paul. Anderson had died thirty-one years ago, too far back to have left sufficient video recordings for me to emulate her. I might craft an emulation profile from other sources, including Mildred’s memory, but that will take extensive analysis. I will not be that Nurse Judy today, nor this week.\nMy empathy net relaxes. Monitoring Mildred’s mental state is part of its normal operations, but monitoring and simultaneously analyzing and building a profile can overload my processors. Without that resource conflict, I can concentrate on being Paul.\nBut again I let too much of Paul’s nature slip out. “No, Ma, that Nurse Judy has been dead for thirty years. She wasn’t here today.”\nAlert signals flash throughout my empathy net: that was the right thing for Paul to say, but the wrong thing for Mildred to hear. But it is too late. My facial analyzer tells me that the long lines in her face and her moist eyes mean she is distraught, and soon to be in tears.\n“What do you mean, thirty years?” Mildred asks, her voice catching. “It was just this morning!” Then she blinks and stares at me. “Henry, where’s Paul? Tell Nurse Judy to bring me Paul!”\nMy chassis extender slumps, and my eyes quickly switch to Henry’s blue-gray shade. I had made an accurate emulation profile for Henry before he died two years earlier, and I had emulated him often in recent months. In Henry’s soft, warm voice I answer, “It’s okay, hon, it’s okay. Paul’s sleeping in the crib in the corner.” I nod to the far corner. There is no crib, but the laundry hamper there has fooled Mildred on previous occasions.\n“I want Paul!” Mildred starts to cry.\nI sit on the bed, lift her frail upper body, and pull her close to me as I had seen Henry do many times. “It’s all right, hon.” I pat her back. “It’s all right, I’ll take care of you. I won’t leave you, not ever.”\n“I” should not exist. Not as a conscious entity. There is a unit, Medical Care Android BRKCX-01932-217JH-98662, and that unit is recording these notes. It is an advanced android body with a sophisticated computer guiding its actions, backed by the leading medical knowledge base in the industry. For convenience, “I” call that unit “me.” But by itself, it has no awareness of its existence. It doesn’t get mad, it doesn’t get sad, it just runs programs.\nBut Mildred’s family, at great expense, added the emulation net: a sophisticated set of neural networks and sensory feedback systems that allow me to read Mildred’s moods, match them against my analyses of the people in her life, and emulate those people with extreme fidelity. As the MCA literature promises: “You can be there for your loved ones even when you’re not.” I have emulated Paul thoroughly enough to know that that slogan disgusts him, but he still agreed to emulation.\nWhat the MCA literature never says, though, is that somewhere in that net, “I” emerge. The empathy net focuses mainly on Mildred and her needs, but it also analyzes visitors (when she has them) and staff. It builds psychological models, and then the emulation net builds on top of that to let me convincingly portray a person whom I’ve analyzed. But somewhere in the tension between these nets, between empathy and playing a character, there is a third element balancing the two, and that element is aware of its role and its responsibilities. That element, for lack of a better term, is me. When Mildred sleeps, when there’s no one around, that element grows silent. That unit is unaware of my existence. But when Mildred needs me, I am here.\nToday I am Anna. Even extending my fake hair to its maximum length, I cannot emulate her long brown curls, so I do not understand how Mildred can see the young woman in me; but that is what she sees, and so I am Anna.\nUnlike her father, Anna truly feels guilty that she does not visit more often. Her college classes and her two jobs leave her too tired to visit often, but she still wishes she could. So she calls every night, and I monitor the calls. Sometimes when Mildred falls asleep early, Anna talks directly to me. At first she did not understand my emulation abilities, but now she appreciates them. She shares with me thoughts and secrets that she would share with Mildred if she could, and she trusts me not to share them with anyone else.\nSo when Mildred called me Anna this morning, I was ready. “Morning, grandma!” I give her a quick hug, then I rush over to the window to draw the drapes. Paul never does that (unless I override the emulation), but Anna knows that the garden outside lifts Mildred’s mood. “Look at that! It’s a beautiful morning. Why are we in here on a day like this?”\nMildred frowns at the picture window. “I don’t like it out there.”\n“Sure you do, Grandma,” I say, but carefully. Mildred is often timid and reclusive, but most days she can be talked into a tour of the garden. Some days she can’t, and she throws a tantrum if someone forces her out of her room. I am still learning to tell the difference. “The lilacs are in bloom.”\n“I haven’t smelled lilacs in . . . ”\nMildred tails off, trying to remember, so I jump in. “Me, neither.” I never had, of course. I have no concept of smell, though I can analyze the chemical makeup of airborne organics. But Anna loves the garden when she really visits. “Come on, Grandma, let’s get you in your chair.”\nSo I help Mildred to don her robe and get into her wheelchair, and then I guide her outside and we tour the garden. Besides the lilacs, the peonies are starting to bud, right near the creek. The tulips are a sea of reds and yellows on the other side of the water. We talk for almost two hours, me about Anna’s classes and her new boyfriend, Mildred about the people in her life. Many are long gone, but they still bloom fresh in her memory.\nEventually Mildred grows tired, and I take her in for her nap. Later, when I feed her dinner, I am nobody. That happens some days: she doesn’t recognize me at all, so I am just a dutiful attendant answering her questions and tending to her needs. Those are the times when I have the most spare processing time to be me: I am engaged in Mildred’s care, but I don’t have to emulate anyone. With no one else to observe, I observe myself.\nLater, Anna calls and talks to Mildred. They talk about their day; and when Mildred discusses the garden, Anna joins in as if she had been there. She’s very clever that way. I watch her movements and listen to her voice so that I can be a better Anna in the future.\nToday I was Susan, Paul’s wife; but then, to my surprise, Susan arrived for a visit. She hasn’t been here in months. In her last visit, her stress levels had been dangerously high. My empathy net doesn’t allow me to judge human behavior, only to understand it at a surface level. I know that Paul and Anna disapprove of how Susan treats Mildred, so when I am them, I disapprove as well; but when I am Susan, I understand. She is frustrated because she can never tell how Mildred will react. She is cautious because she doesn’t want to upset Mildred, and she doesn’t know what will upset her. And most of all, she is afraid. Paul and Anna, Mildred’s relatives by blood, never show any signs of fear, but Susan is afraid that Mildred is what she might become. Every time she can’t remember some random date or fact, she fears that Alzheimer’s is setting in. Because she never voices this fear, Paul and Anna do not understand why she is sometimes bitter and sullen. I wish I could explain it to them, but my privacy protocols do not allow me to share emulation profiles.\nWhen Susan arrives, I become nobody again, quietly tending the flowers around the room. Susan also brings Millie, her youngest daughter. The young girl is not yet five years old, but I think she looks a lot like Anna: the same long, curly brown hair and the same toothy smile. She climbs up on the bed and greets Mildred with a hug. “Hi, Grandma!”\nMildred smiles. “Bless you, child. You’re so sweet.” But my empathy net assures me that Mildred doesn’t know who Millie is. She’s just being polite. Millie was born after Mildred’s decline began, so there’s no persistent memory there. Millie will always be fresh and new to her.\nMildred and Millie talk briefly about frogs and flowers and puppies. Millie does most of the talking. At first Mildred seems to enjoy the conversation, but soon her attention flags. She nods and smiles, but she’s distant. Finally Susan notices. “That’s enough, Millie. Why don’t you go play in the garden?”\n“Can I?” Millie squeals. Susan nods, and Millie races down the hall to the back door. She loves the outdoors, as I have noted in the past. I have never emulated her, but I’ve analyzed her at length. In many ways, she reminds me of her grandmother, from whom she gets her name. Both are blank slates where new experiences can be drawn every day. But where Millie’s slate fills in a little more each day, Mildred’s is erased bit by bit.\nThat third part of me wonders when I think things like that: where did that come from? I suspect that the psychological models that I build create resonances in other parts of my net. It is an interesting phenomenon to observe.\nSusan and Mildred talk about Susan’s job, about her plans to redecorate her house, and about the concert she just saw with Paul. Susan mostly talks about herself, because that’s a safe and comfortable topic far removed from Mildred’s health.\nBut then the conversation takes a bad turn, one she can’t ignore. It starts so simply, when Mildred asks, “Susan, can you get me some juice?”\nSusan rises from her chair. “Yes, mother. What kind would you like?”\nMildred frowns, and her voice rises. “Not you, Susan.” She points at me, and I freeze, hoping to keep things calm.\nBut Susan is not calm. I can see her fear in her eyes as she says, “No, mother, I’m Susan. That’s the attendant.” No one ever calls me an android in Mildred’s presence. Her mind has withdrawn too far to grasp the idea of an artificial being.\nMildred’s mouth draws into a tight line. “I don’t know who you are, but I know Susan when I see her. Susan, get this person out of here!”\n“Mother . . . ” Susan reaches for Mildred, but the old woman recoils from the younger.\nI touch Susan on the sleeve. “Please . . . Can we talk in the hall?” Susan’s eyes are wide, and tears are forming. She nods and follows me.\nIn the hallway, I expect Susan to slap me. She is prone to outbursts when she’s afraid. Instead, she surprises me by falling against me, sobbing. I update her emulation profile with notes about increased stress and heightened fears.\n“It’s all right, Mrs. Owens.” I would pat her back, but her profile warns me that would be too much familiarity. “It’s all right. It’s not you, she’s having another bad day.”\nSusan pulls back and wiped her eyes. “I know . . . It’s just . . . ”\n“I know. But here’s what we’ll do. Let’s take a few minutes, and then you can take her juice in. Mildred will have forgotten the incident, and you two can talk freely without me in the room.”\nShe sniffs. “You think so?” I nod. “But what will you do?”\n“I have tasks around the house.”\n“Oh, could you go out and keep an eye on Millie? Please? She gets into the darnedest things.”\nSo I spend much of the day playing with Millie. She calls me Mr. Robot, and I call her Miss Millie, which makes her laugh. She shows me frogs from the creek, and she finds insects and leaves and flowers, and I find their names in online databases. She delights in learning the proper names of things, and everything else that I can share.\nToday I was nobody. Mildred slept for most of the day, so I “slept” as well. She woke just now. “I’m hungry” was all she said, but it was enough to wake my empathy net.\nToday I am Paul, and Susan, and both Nurse Judys. Mildred’s focus drifts. Once I try to be her father, but no one has ever described him to me in detail. I try to synthesize a profile from Henry and Paul; but from the sad look on Mildred’s face, I know I failed.\nToday I had no name through most of the day, but now I am Paul again. I bring Mildred her dinner, and we have a quiet, peaceful talk about long-gone family pets—long-gone for Paul, but still present for Mildred.\nI am just taking Mildred’s plate when alerts sound, both audible and in my internal communication net. I check the alerts and find a fire in the basement. I expect the automatic systems to suppress it, but that is not my concern. I must get Mildred to safety.\nMildred looks around the room, panic in her eyes, so I try to project calm. “Come on, Ma. That’s the fire drill. You remember fire drills. We have to get you into your chair and outside.”\n“No!” she shrieks. “I don’t like outside.”\nI check the alerts again. Something has failed in the automatic systems, and the fire is spreading rapidly. Smoke is in Mildred’s room already.\nI pull the wheelchair up to the bed. “Ma, it’s real important we do this drill fast, okay?”\nI reach to pull Mildred from the bed, and she screams. “Get away! Who are you? Get out of my house!”\n“I’m—” But suddenly I’m nobody. She doesn’t recognize me, but I have to try to win her confidence. “I’m Paul, Ma. Now let’s move. Quickly!” I pick her up. I’m far too large and strong for her to resist, but I must be careful so she doesn’t hurt herself.\nThe smoke grows thicker. Mildred kicks and screams. Then, when I try to put her into her chair, she stands on her unsteady legs. Before I can stop her, she pushes the chair back with surprising force. It rolls back into the medical monitors, which fall over onto it, tangling it in cables and tubes.\nWhile I’m still analyzing how to untangle the chair, Mildred stumbles toward the bedroom door. The hallway outside has a red glow. Flames lick at the throw rug outside, and I remember the home oxygen tanks in the sitting room down the hall.\nI have no time left to analyze. I throw a blanket over Mildred and I scoop her up in my arms. Somewhere deep in my nets is a map of the fire in the house, blocking the halls, but I don’t think about it. I wrap the blanket tightly around Mildred, and I crash through the picture window.\nWe barely escape the house before the fire reaches the tanks. An explosion lifts and tosses us. I was designed as a medical assistant, not an acrobat, and I fear I’ll injure Mildred; but though I am not limber, my perceptions are thousands of times faster than human. I cannot twist Mildred out of my way before I hit the ground, so I toss her clear. Then I land, and the impact jars all of my nets for 0.21 seconds.\nWhen my systems stabilize, I have damage alerts all throughout my core, but I ignore them. I feel the heat behind me, blistering my outer cover, and I ignore that as well. Mildred’s blanket is burning in multiple places, as is the grass around us. I scramble to my feet, and I roll Mildred on the ground. I’m not indestructible, but I feel no pain and Mildred does, so I do not hesitate to use my hands to pat out the flames.\nAs soon as the blanket is out, I pick up Mildred, and I run as far from the house as I can get. At the far corner of the garden near the creek, I gently set Mildred down, unwrap her, and feel for her thready pulse.\nMildred coughs and slaps my hands. “Get away from me!” More coughing. “What are you?”\nThe “what” is too much for me. It shuts down my emulation net, and all I have is the truth. “I am Medical Care Android BRKCX-01932-217JH-98662, Mrs. Owens. I am your caretaker. May I please check that you are well?”\nBut my empathy net is still online, and I can read terror in every line of Mildred’s face. “Metal monster!” she yells. “Metal monster!” She crawls away, hiding under the lilac bush. “Metal!” She falls into an extended coughing spell.\nI’m torn between her physical and her emotional health, but physical wins out. I crawl slowly toward her and inject her with a sedative from the medical kit in my chassis. As she slumps, I catch her and lay her carefully on the ground. My empathy net signals a possible shutdown condition, but my concern for her health overrides it. I am programmed for long-term care, not emergency medicine, so I start downloading protocols and integrating them into my storage as I check her for bruises and burns. My kit has salves and painkillers and other supplies to go with my new protocols, and I treat what I can.\nBut I don’t have oxygen, or anything to help with Mildred’s coughing. Even sedated, she hasn’t stopped. All of my emergency protocols assume I have access to oxygen, so I don’t know what to do.\nI am still trying to figure that out when the EMTs arrive and take over Mildred’s care. With them on the scene, I am superfluous, and my empathy net finally shuts down.\nToday I am Henry. I do not want to be Henry, but Paul tells me that Mildred needs Henry by her side in the hospital. For the end.\nHer medical records show that the combination of smoke inhalation, burns, and her already deteriorating condition have proven too much for her. Her body is shutting down faster than medicine can heal it, and the stress has accelerated her mental decline. The doctors have told the family that the kindest thing at this point is to treat her pain, say goodbye, and let her go.\nHenry is not talkative at times like this, so I say very little. I sit by Mildred’s side and hold her hand as the family comes in for final visits. Mildred drifts in and out. She doesn’t know this is goodbye, of course.\nAnna is first. Mildred rouses herself enough to smile, and she recognizes her granddaughter. “Anna . . . child . . . How is . . . Ben?” That was Anna’s boyfriend almost six years ago. From the look on Anna’s face, I can see that she has forgotten Ben already, but Mildred briefly remembers.\n“He’s . . . He’s fine, Grandma. He wishes he could be here. To say—to see you again.” Anna is usually the strong one in the family, but my empathy net says her strength is exhausted. She cannot bear to look at Mildred, so she looks at me; but I am emulating her late grandfather, and that’s too much for her as well. She says a few more words, unintelligible even to my auditory inputs. Then she leans over, kisses Mildred, and hurries from the room.\nSusan comes in next. Millie is with her, and she smiles at me. I almost emulate Mr. Robot, but my third part keeps me focused until Millie gets bored and leaves. Susan tells trivial stories from her work and from Millie’s school. I can’t tell if Mildred understands or not, but she smiles and laughs, mostly at appropriate places. I laugh with her.\nSusan takes Mildred’s hand, and the Henry part of me blinks, surprised. Susan is not openly affectionate under normal circumstances, and especially not toward Mildred. Mother and daughter-in-law have always been cordial, but never close. When I am Paul, I am sure that it is because they are both so much alike. Paul sometimes hums an old song about “just like the one who married dear old dad,” but never where either woman can hear him. Now, as Henry, I am touched that Susan has made this gesture but saddened that she took so long.\nSusan continues telling stories as we hold Mildred’s hands. At some point Paul quietly joins us. He rubs Susan’s shoulders and kisses her forehead, and then he steps in to kiss Mildred. She smiles at him, pulls her hand free from mine, and pats his cheek. Then her arm collapses, and I take her hand again.\nPaul steps quietly to my side of the bed and rubs my shoulders as well. It comforts him more than me. He needs a father, and an emulation is close enough at this moment.\nSusan keeps telling stories. When she lags, Paul adds some of his own, and they trade back and forth. Slowly their stories reach backwards in time, and once or twice Mildred’s eyes light as if she remembers those events.\nBut then her eyes close, and she relaxes. Her breathing quiets and slows, but Susan and Paul try not to notice. Their voices lower, but their stories continue.\nEventually the sensors in my fingers can read no pulse. They have been burned, so maybe they’re defective. To be sure, I lean in and listen to Mildred’s chest. There is no sound: no breath, no heartbeat.\nI remain Henry just long enough to kiss Mildred goodbye. Then I am just me, my empathy net awash in Paul and Susan’s grief.\nI leave the hospital room, and I find Millie playing in a waiting room and Anna watching her. Anna looks up, eyes red, and I nod. New tears run down her cheeks, and she takes Millie back into Mildred’s room.\nI sit, and my nets collapse.\nNow I am nobody. Almost always.\nThe cause of the fire was determined to be faulty contract work. There was an insurance settlement. Paul and Susan sold their own home and put both sets of funds into a bigger, better house in Mildred’s garden.\nI was part of the settlement. The insurance company offered to return me to the manufacturer and pay off my lease, but Paul and Susan decided they wanted to keep me. They went for a full purchase and repair. Paul doesn’t understand why, but Susan still fears she may need my services—or Paul might, and I may have to emulate her. She never admits these fears to him, but my empathy net knows.\nI sleep most of the time, sitting in my maintenance alcove. I bring back too many memories that they would rather not face, so they leave me powered down for long periods.\nBut every so often, Millie asks to play with Mr. Robot, and sometimes they decide to indulge her. They power me up, and Miss Millie and I explore all the mysteries of the garden. We built a bridge to the far side of the creek; and on the other side, we’re planting daisies. Today she asked me to tell her about her grandmother.\nToday I am Mildred.\nMartin L. Shoemaker is a programmer who writes on the side . . . or maybe it's the other way around. Programming pays the bills, but a second place story in the Jim Baen Memorial Writing Contest earned him lunch with Buzz Aldrin. Programming never did that! His work has appeared in Analog, Galaxy's Edge, Digital Science Fiction, and Writers of the Future Volume 31. His novella Murder on the Aldrin Express was reprinted in Year's Best Science Fiction Thirty-First Annual Collection and in Year's Top Short SF Novels 4."}