{"fingerprint": "mlXOdqfcW/jDan+RGmsMUfuGZbg=", "sitename": "Clarkesworld Magazine", "title": "More Complex Than Caricature: A Conversation with Alex Shvartsman & Tarryn Thomas by Arley Sorg", "author": "Arley Sorg", "date": "2022-03-31 00:00:00", "source": "https://clarkesworldmagazine.com/shvartsman-thomas_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: More Complex Than Caricature: A Conversation with Alex Shvartsman & Tarryn Thomas by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nMore Complex Than Caricature: A Conversation with Alex Shvartsman & Tarryn Thomas\nAlex Shvartsman was born and grew up in Odesa, Ukraine, “or Odessa, USSR back then, the different spelling is not a typo.” He lived there for about fourteen years, then immigrated to New York City. He has lived in Brooklyn since 1991, and still lives there with his family, including a cat and a dog.\nShvartsman studied computer science in college but became disillusioned with the program. Instead, he excelled at the card game, Magic: The Gathering. He played competitively from the mid-1990s to early 2000s and at one point was ranked third in the world. He traveled to over thirty countries to play, and even after quitting the game, for about a decade he held a record for most Grand Prix championship top eight finishes ever. Toward the end of his Magic career, in 2002, he founded Kings Games, “Which, I suppose, makes me the cliché retired D&D adventurer who opens a tavern. It has been going strong for twenty years and remains the largest game store in NYC.”\nWith English as his third language and despite having little relevant education or training, Alex Shvartsman started writing fiction. His first sale was “Good Advice” to Every Day Fiction, published in 2010. This was followed by several publications in 2011—including “Spidersong” at Daily Science Fiction—and a slew of short fiction sales in 2012. That year, he attended the Viable Paradise workshop.\n2012 was also the year that Shvartsman published his first anthology: Unidentified Funny Objects. This book featured his first translation, Sergey Lukyanenko’s “If You Act Now.” It was also the beginning of many editorial efforts via his new venture, UFO Publishing. A fair number of them, such as the Unidentified Funny Objects anthology series itself (number eight came out in 2020), focus on humorous speculative fiction. In May of 2018, Shvartsman launched Future Science Fiction Digest, a magazine “with a strong focus on translation and international fiction.”\nAlex Shvartsman was a finalist for the Canopus Award for Excellence in Interstellar Writing in 2015 and 2017, and he won the WSFA Small Press Award for Short Fiction in 2014. To-date, over one hundred and twenty of Shvartsman’s short fiction works have appeared in numerous venues, including Nature: Futures, Analog, Galaxy’s Edge, and many more. His translations from Russian have appeared in venues such as The Magazine of Fantasy & Science Fiction, Apex, Asimov’s, and more, including a recent publication in Clarkesworld. He has also translated two novels, several scripts for TV and film, and some video game content.\n“I never set out to be a translator, editor, or publisher. I just sort of grew my hat collection as I went. Writing is still the aspect of this entire thing I’m most passionate about.” Shvartsman published his debut novel, Eridani’s Crown, in 2019 and his most recent novel, The Middling Affliction, is due from Arc Manor imprint Caezik in May 2022.\nIn February of 2022, he published anthology The Rosetta Archive: Notable Speculative Short Fiction in Translation with coeditor Tarryn Thomas.\nTarryn Thomas has lived in East London, South Africa all her life. She started reading at an early age. “I remember clear as day; I was about six years old. I had been given simple words and of course the letters of the alphabet first, and I sat down with a chapter book—you know, the ones with pictures—and puzzled out the first page by sounding out the letters. By the end of the page, I was reading by myself, and I remember the feeling of elation that came to me.” In high school she was in the top one hundred in the nationwide English Olympiad, and she won the National English Challenge. She graduated from Rhodes University, Grahamstown (East London Campus) in 2006, majoring in economics and information systems, with a minor in English. Instead of following her major, she ended up at a nationally distributed magazine. She also volunteered to proofread for Project Gutenberg via Distributed Proofreaders and helped run a vintage gaming website, editing reviews.\nA few years later, Tarryn Thomas started slush reading for Flash Fiction Online as well as UFO Publishing. Thomas turned the opportunity with Shvartsman into a remote internship at UFO, as well as a copyediting gig, and eventually began her own business doing freelance editing on the side.\nIn her free time, Thomas makes chain mail jewelry as a hobby: “I find weaving jump rings to be extremely soothing. Well, I suppose I have spent most of my life buried in a book, whether Ancient China or on some far planet, so I’m not that interesting really.” Tarryn Thomas is currently an associate editor at Future Science Fiction Digest and managing editor at Nightshade and Moonlight Publishing, which is trying to bring German mysteries to English audiences. “Cozies are my favorite genre, and I get to read them for free, so it’s a win!”\nWith a host of copyediting and proofreading credits to her name, as well as two associate editor credits for Unidentified Funny Objects anthologies, Tarryn Thomas stepped into her first coeditor role with Alex Shvartsman for The Rosetta Archive: Notable Speculative Short Fiction in Translation.\nHow did you first get into reading speculative fiction, and what were some of the works you read back then that stand out as important to you?\nAlex Shvartsman: My love affair with science fiction began when I was about ten years old. I discovered a few anthologies of translated science fiction short stories (mostly from English) and devoured them, then went looking for more. My earliest SF influences included Robert Sheckley, Robert Silverberg, Fredric Brown, Harry Harrison, and Kir Bulychev.\nAs the works available in translation were aggressively censored, readers like myself in the Soviet Union mostly had access to fiction that at least appeared to criticize Western and capitalist systems. For example, I could read Asimov’s Three Laws of Robotics stories, but not the Foundation series, which didn’t make it past the Soviet censors. Also, most available works were older (due to the peculiarities of copyright treaties signed by the USSR) so most of my US/UK reading were somewhat-older books. Soviet readers missed out on the New Wave, more experimental fare, and all of the fantasy genre almost entirely.\nTarryn Thomas: As a child I read obsessively. My school librarian, Mrs. Crous, really took me under her wing, and it was she who first introduced me to the works of C. S. Lewis.\nLater, I read and reread everything speculative, both fantasy and SF, starting with Anne McCaffrey, Raymond Feist, and Janny Wurts. I loved Pern and the Kelewan Cycle. I sampled Robert Jordan and Isaac Asimov, Jack Vance and A. E. van Vogt, although I was constrained by what my local library had available.\nThese days, I gravitate more toward C. J. Cherryh and Terry Pratchett, although I haven’t yet read The Shepherd’s Crown. I think once I read it, I have to face the fact that there won’t be any more Discworld, and that will be a very sad day.\nAlex, you’ve been in the US a long time, but you were born in Ukraine and do a significant amount of translating from Russian. Tarryn, you’re from South Africa, and your projects include translations from Germanic languages. What are some of the key differences in perspectives that these backgrounds give you?\nTarryn: I think it makes you humble, in that you have less of a desire to impose your viewpoints on others. Especially as a South African, coming from a country with eleven official languages and myriad cultures, you learn to appreciate people as individuals and evaluate what they have to say through fewer lenses of interpretation.\nAlso, I have worked with authors from many countries. I find that the differences in perspective have stretched me as an editor, because one really has to preserve the author’s voice without putting too much of one’s own style into the piece. It’s been like a trip around the world, all without leaving my own hometown.\nAlex: For me the secret sauce is the ability to read a lot more widely. I can read Russian as fluently as English, and can sort-of, kind-of read Ukrainian (enough to get by; not enough to perform translation). Not only does this allow me to keep up with the literature of “back home” but also offers a much-wider view of global speculative literature.\nThe culture of translation and importing international fiction is far better developed in the Russian language; growing up I read French and Polish novels widely, as well as a plethora of material translated from other languages. There are occasional success stories, with Liu Cixin or Andrzej Sapkowski becoming well-known and popular with anglophone audiences; but imagine being able to partake of the brilliance of a dozen more such authors from across the globe! I’m certain the ability to have read more talented authors with different perspectives over the years has made me a better editor, and a better writer.\nHow did The Rosetta Archive come about, how did it develop, and what were the biggest challenges to making this anthology happen?\nAlex: It was the involvement and partnership of the Future Affairs Administration that allowed for this project to go forward. In addition to helping us fund the project—no small feat of its own, given the extra difficulty and expense of putting together such an international undertaking—the FAA is also working on the Chinese language version of the project, and they helped us find and select many of the stories from China and elsewhere in East Asia that have appeared in Future Science Fiction Digest and ultimately made their way into Rosetta.\nFAA had launched the Rosetta Awards (with the inaugural awards handed out last year), and we started out with the idea of collecting the nominated stories into an anthology. But that would have been a very thin book, and so the idea developed of expanding it to feature some more of the wonderful and original stories first published during 2020 in English. We had total creative freedom and worked hard to include a wide selection of stories and genres. Horror is not typically my wheelhouse, so it was especially interesting for me to select and onboard a couple of horror stories for the project.\nTarryn: I think my biggest challenge was the fact that I’ve never edited an anthology before. I’ve edited short stories, novellas, and novels, but there the author is the guiding hand, and one is only suggesting. Here I was helping to put together a whole greater than the sum of its parts, and in that I was fascinated, and I really felt enthralled to see the background workings.\nHow did collaboration work for you, both in terms of who did what, and in terms of whether or not it all went smoothly?\nAlex: This was a large undertaking on a relatively tight deadline, and it definitely benefited from two people working together, instead of having a single editor. Tarryn had started out as an associate editor at Future when it first launched and over time has taken on a more and more important role at the magazine and at UFO Publishing in general. She has become our primary copyeditor, has learned a lot more about story selection and developmental edits, and I definitely felt she was ready for a greater role. She was interested in taking on an anthology, so when an opportunity presented itself to collaborate on Rosetta, we both jumped at the chance to partner up on this.\nI handled the bulk of story selection, though still with input and advice from Tarryn. Mostly because I had already read much of the material for award consideration. We worked together on arranging the table of contents and the vision for the project; the sort of internal guidelines for what we’d like to see included.\nTarryn did the bulk of the edits—as a non-native speaker, I’m a poor choice as a copyeditor, and I rely on Tarryn and others to handle that part for all of my projects. She also took charge of reaching out to authors and translators in order to secure permissions and contracts, whereas I handled the payments and mailed out contributor copies. In the end, there was plenty of work to go around and I can’t think of any situations where there was any sort of tension. I think we were both just really enthusiastic about the project and it came through in our efforts.\nTarryn: Working with Alex is always extremely pleasant, even when I drop the ball, which is why I’m always motivated to give my best. This anthology was a steep learning curve for me, but I hope I held my own in terms of bringing my skills to the table. I largely focused on administration and copyediting, as well as the final proofread of the book before publication. Alex did most of the heavy lifting, as it were.\nAs individuals who work in publishing in various capacities, when it comes to reading and thinking about the merits of works in translation, does your approach differ in important ways versus reading and thinking about fiction written in English by native English speakers?\nAlex: I spend a fair amount of time thinking about this because I’ve had to make the ultimate call on selecting international stories for Future SF for years now, as well as selecting stories for Rosetta. First, it has to be an excellent story. I don’t care if the author’s English is imperfect; we can work through several rounds of edits and rewrites (frequently it takes that many) to fix those. However, the core of the story has to really shine; I don’t give those stories and authors that much of a break just because these are international works. I still want excellent stories!\nOnce the story makes it past that first and most difficult hurdle, the rest is down to the available space in the book/magazine and budget. Here, additional factors come into play. How different is the story from a tale by an American or a British author? Is there some unique quality in it that benefits from the author’s background, language, and culture? That’s a big plus. Finally, it’s crucial to remember that the translator involved is a cocreator for the English text and not just some technical person in the background. They make a huge impact on the quality, tone, and voice of the translation. As a translator myself, the level of difficulty involved in the translation is often apparent even if I don’t speak the source language, and I’m inclined to err on the side of the difficult-to-translate works where the translator’s exemplary work shines through.\nTarryn: I think my main focus is always first story and then style. You have to have a good story, and my job is to both add and take away from the story to its benefit. I take away the poor style choices and bad grammar and spelling, and I add to the flow and the consistency. So these things are important whether it was written by a first language or a fourth language speaker. And don’t be deceived: one of my absolute worst-written projects came from the US. So my approach is to look at each piece on its own merits.\nWere there pieces you had hoped to include but that just couldn’t be included for one reason or another?\nTarryn: There were a couple of cute stories that were just too long, so they unfortunately fell by the wayside. The one I really liked featured a minor guardian angel that was allergic to his own wing feathers and had to pluck out his downy fluff religiously.\nAlex: I believe the story Tarryn is referring to is “For Life” by Marta Kisiel, which originally appeared in The Big Book of Modern Fantasy edited by the VanderMeers. It was over fifteen thousand words long, which is why we never solicited it. There was only so much room and budget available in the book.\nGenerally, though, we had surprisingly little trouble gaining permissions to publish the stories we selected, even if the process involved dealing with authors, translators, and agents across the globe. Everyone was super helpful and the editors who originally published some of these stories really went out of their way to put us in touch with the authors and rights holders. Everyone wants the author/story they published to gain some extra attention, and I never get tired of the level of good will that’s present in our field!\nWhich, for you, are some of the most important pieces in this book, and why?\nTarryn: Of course, this was primarily a Rosetta Awards showcase, and in fact the first story in the anthology is the winner—“Rœsin.” I found the concept fascinating, and I’m really glad it won. It traces a fine line through ideas about prejudices and what ultimately makes us human.\nBut I feel to single out a piece as more important than the others is to miss the point here: we wanted to bring together an experience, like a blended whiskey if you will. If you want to focus on one story in particular at the expense of the others, it becomes too much like a single malt.\nAlex: Asking an editor to select their favorite story is a bit like asking a parent to select their favorite child. Like parents, some editors may actually have such thoughts, but we’ll never ever share them out loud, because we don’t want to make the other story-children feel bad.\nOften when readers in the US engage with translated works, they don’t necessarily know who the “big names” are, or who the exciting, groundbreaking authors are. Who are the authors in this book that are regarded as literary stars in the context of their cultures?\nAlex: A number of authors whose works were included in this book have already enjoyed a fair amount of domestic and international acclaim. Kim Bo-Young is well-known in Korea and a number of her works have been published in English. Japanese author Taiyo Fujii is well-recognized across East Asia. Sweden’s Marie Hermanson is an internationally bestselling novelist. Chen Qiufan has had a pair of novels published in English and is even better-known in China. Czech author Julie Nováková’s short fiction has been widely translated, including multiple pieces published here at Clarkesworld.\nTarryn: I would say Pilar Pedraza is huge in her language market. I am not a horror gourmand myself, but her story in this collection was nuanced and masterly.\nDo you feel like some of the stories gathered here may surprise readers?\nAlex: I think the readers will find the scope and imagination of the authors to meet and exceed their expectations. I really liked the kind and unsolicited feedback from Judith Huang, the inaugural winner of the Rosetta and translator of “Rœsin,” the story Tarryn mentioned earlier, who had this to say of another story in the book: “ . . . strange, moving, and Jungian somehow, like it tapped into something very deep and archetypal, especially at this moment.”\nThat is precisely the sort of reaction I love to see to these stories. More often, however, readers approach translated fiction with an expectation of their own preconceived notions of what the author’s language, culture, and country of origin are like and how that caricature of a real culture would influence the storytelling. The real international fiction, once they read it, is inevitably much more complex and interesting.\nTarryn: I think the finely drawn themes and concepts will really inspire readers. This anthology is all about writing as art, and the purity of the emotion and the depth of feeling really spoke to me.\nI don’t think we Westerners realize just how enormous the genre is in markets like China’s, and I want a sort of cross-pollination to occur, that might lead to a new Golden Age of genre fiction. I am rather tired of genre not being seen as artistic enough to merit the highest awards, and I feel it’s time speculative fiction came of age in that sense, that it becomes mainstream and its themes enter public discourse.\nWhen you’re putting together a book like this, which draws from Chinese, Russian, Swedish, Czech, and more, do you see specific things that connect the stories, regardless of their origins?\nTarryn: We drew from SF, horror, and fantasy for this collection. It is really very eclectic. What we did look for was a generally high standard of writing and of storytelling. I think the results speak for themselves. This is a toothsome morsel for any reader, and I hope it will be enjoyed as much as we delighted in putting it together.\nWhat, for you, are the “must-read” stories in this anthology? If a reader picked one or two pieces to look at, what would you want them to read, and why?\nTarryn: I would recommend “Just Like Migratory Birds” and “The Ancestral Temple in a Box,” although I’m rather fond of “Cousin Entropy” as well. They just spoke to me in terms of their vibrant imagery and outstanding story concepts.\nAlex: I will refer you to my previous answer about stories and children.\nDoes this book stand in conversation with other books featuring international fiction? Or is this project very much an independent, separate vision?\nAlex: I would say that we share the core idea of presenting excellent international stories to the anglophone readership. Having said that, so much of any given anthology is colored and influenced by the editors’ tastes. If Lavie or Christine were putting together an anthology having read the exact same material we had, their selections may have differed greatly. Picking up an anthology is always an exercise in trust on the part of the reader; they must trust the anthologist’s taste as much as they trust the author’s style when they pick up a single-author collection or a novel. Ultimately, I celebrate the release of any such anthology or special magazine issue, because an influx of international fiction consistently enriches the genre.\nTarryn: As Alex said, anthologies very much reflect the editor’s taste. I hope readers will find our choices interesting and will use this book as a springboard into the realm of translated fiction. It really is worth the look.\nAre there authors whose work you admire that haven’t yet been translated into English?\nAlex: If I may cheat slightly, I’d like to mention a few writers who had some but not nearly enough of their work translated into English.\nGrowing up, one of my favorite science fiction writers was a French author Francis Carsac. His Robinsons of the Cosmos and The Runaway Earth novels are international classics of the genre, as influential to readers as the works of Heinlein or Clarke. Criminally, they’ve never been translated into English. After many decades, British publisher Flame Tree Press recently released one of his books, The City Among the Stars, in English. Unfortunately, the book was not very well received, as it felt dated (as would most SF books published in the sixties and seventies), and I wonder how I’d feel rereading the books I so loved in the late 1980s, but I still wish they had been made available to anglophone readers.\nSimilarly, many authors writing in Russian have had limited exposure in English. Vladislav Krapivin, the Dyachenkos, H. L. Oldie—all deserve a larger audience. The list would have been much longer, except that many of the otherwise-talented contemporary authors have recently made their works far less palatable to me due to their not-so-silent approval of Russian aggression in Ukraine.\nTarryn: I helped edit one of Andrea Instone’s first mysteries to be translated from German (The Missing Professor). I am hoping to be involved in future ones. It all depends on translator availability. I wish I’d had the opportunity to learn German as a child.\nAre there specific challenges for English-speaking genre readers who read works in translation for the first time?\nAlex: I don’t see this as a significant problem. Speculative readers are uniquely experienced at navigating complex, unfamiliar cultures and worlds. Any reader willing and patient enough to suss out what’s going on in Neal Stephenson’s Anathem should be able to adjust to the minor differences inherent in a story from another real-world culture.\nTarryn: Speculative fiction is more than the old humanoid aliens with rubber foreheads set piece these days. Readers are placed in new and curious situations inside the author’s headspace, but the stories themselves are about hope for the future or love triumphant, and so we identify with them regardless of the number of moons in the sky. SFF brings us together in spite of worldbuilding and its complexities, so I don’t see the author’s cultural mores as being a problem.\nIn the Foreword, you share statistics on languages translated into English by genre periodicals in 2020. This year’s Rosetta Awards Eligibility List features thirty shorter stories translated from Chinese and ten from Spanish authors. At the same time, the list in the Foreword features one Arabic story, otherwise no work from Indian or African languages; likewise, the Rosetta Eligibility List features two shorter pieces from Arabic, one Persian, one Kurdish, but no other African or Indian language stories. How can we as a genre community get to a point where we are seeing much more work translated from these locations, communities, and languages? And what, for you, are some of the other locations around the globe with rich speculative traditions that you would like to see translated more?\nAlex: In the case of the Rosetta anthology, we were constrained by choosing from the works that were published in English that year; had some of these anthologies been published a year earlier, we would undoubtedly have included more stories from the languages and regions they represent.\nAt Future we never get enough quality submissions from Africa and Central Asia. And when we do, the story is often written in English, which works just fine for the magazine but wouldn’t make it into the anthology, which is explicitly focused on showcasing translations. It is also important not to focus solely on the language but also on the origin of the story. Rosetta features a story translated from French by an author from the Ivory Coast. Spanish language stories can come from Spain, South America, or North America. Another French translation we included in the anthology is by an author who resides in Quebec, Canada.\nI would love to see more fiction from the various republics that were once occupied by the Soviet Union. We’re working on an issue featuring multiple stories from Ukraine, but I’d love to see more voices from Kazakhstan, Georgia, Armenia, and the Baltic Republics. Some of those stories will have been written in Russian, but more and more of them are being written in Ukrainian and other native languages as these countries are reestablishing their own cultures and languages after having been long suppressed by imperialism.\nTarryn: Really, you have to follow the money. There are, as you’ve said, plenty of foreign works out there, it is the willingness to pay for translation and good editing that is needed. And the marketing as well.\nI think as SF has moved into the mainstream (think of the new Dune movie, the Foundation series, and although the Wheel of Time and of course GoT count as fantasy, they are evidence that there is money to be made from genre), we might see more and more demand. It’s time publishers went looking for new voices, and not just in some drafty Manhattan garret. And perhaps it won’t be just traditional publishers we have to look toward, either. With Amazon KDP and Draft2Digital and so on, indie authors are releasing their work in greater and greater numbers. I challenge people to look past the kaleidoscope of covers and see the interesting things that lie within. You may find dross, but there are bound to be pearls out there as well.\nAre there a few translated works that you felt deserved far more attention than they received? And if so, what do you appreciate most about them?\nAlex: I greatly enjoyed Qualityland, a novel by Marc Uwe-Kling translated from German and published in English in 2020. It made the Rosetta Award short list but ultimately lost to an equally amazing Daughter from the Dark by the Dyachenkos. Despite their performance on this award ballot, neither novel quite got the recognition they deserve with anglophone audiences, and I recommend that readers interested in international fiction check them out.\nTarryn: I have been working on editing translated traditional and cozy mysteries. I had no idea there was such a large market for them in Germany, and I’m hoping to help bring more into the anglosphere through a small imprint I’m working for, Nightshade and Moonlight. While speculative fiction remains my first love, I just can’t resist devouring works by the heirs of Arthur Conan Doyle and Agatha Christie.\nIs there anything else you’d like readers to know about The Rosetta Archive, about fiction in translation, or about your other projects?\nAlex: I’d be remiss not to mention that I have a novel coming out at the end of this month! The Middling Affliction is a humorous urban fantasy that’s prickly and snarky but has its heart in the right place, like a proper New Yorker. Check it out! Meantime, I’m working on various translation projects to help feature and promote Ukrainian authors. We’ll have a pair of stories in the May issue of Future, with other projects further down the line.\nTarryn: I beta and proofread The Middling Affliction, and I definitely recommend it. It’s lovely in a funny urban fantasy kitchen sink kind of way. It involves a certain amount of pizza snobbery, but I suppose we must forgive that.\nWhat are some of your most important goals, or hopes for the genre, in terms of works going into English or out to other languages/countries?\nTarryn: As I said above, I would love to see a cross-cultural trade wind between language markets, leading us to a sort of SFF Renaissance. I don’t believe that all the best SF died with Asimov and Heinlein. I want more international names on bestseller lists, and turnabout is also fair play. I can’t wait to see what the future has in store for us.\nAlex: In the long run, I’d love to see translated works become equally available and accepted by most readers, but also for the translators to be recognized and respected for the creatives they are, and not treated as mere technical support staff by the publishers and sometimes even by the writers. Translation should be recognized at the Hugos and the Nebulas, and not just by the Rosetta Awards, though it’s a step in the right direction.\nWhat is your advice for folks who would like to work in translations, and what is your advice for authors who would like to see their work translated into English?\nAlex: This is several questions wrapped into one, so I will try to address them in the least long-winded way possible. 🙂\nIf you’re a multilingual person interested in translation, start by reaching out to fellow translators working in your preferred language pairing. They will enthusiastically point you in the right direction, toward everything from professional organizations to social media groups populated by fellow translators.\nPersonally. I started out by translating a bunch of short stories. There’s very little money in it, which means no agents, publishers, or other third parties needed to be involved. I found stories I really liked in Russian, contacted the authors to obtain permission, and then shopped the translations to magazines the same way I would my own stories. I split any money earned from such publications fifty-fifty with the author. After a few successful publications, authors began to reach out to me directly, offering their stories for consideration. Once I built a sufficient portfolio, I started getting real, paid work from publishers, production companies, and other corporate clients who could afford to pay real money for my efforts. This is, of course, not the only strategy for breaking into literary translation, but it worked for me.\nIf you’re an author of short stories, see who is translating them from your language into English (or whatever target language you’re pursuing), and see if you can get them interested in your work. While some translators may be willing to undertake short story translations on spec, this will almost never work with novels, because of the tremendous amount of labor involved. For that, you can expect to pay around $0.10 to $0.15 per word if you want a competent translator to work on your book. Keep in mind that a translator is not an editor, so you will still need to budget for copyedits, et cetera to get published. Another strategy is to hire a translator to do a professional translation of your cover letter, synopsis, and an excerpt of up to ten thousand words into English. Your literary agency might cover the cost of doing this, and if you land an English publisher, they will hire the translator to subsequently translate the entire book. But these are considerable costs, even for the bigger publishers, which is a major hurdle in getting international works published in English.\nSome countries have funds that may help cover some or all translation costs into another language, so you may want to look into that as well. Once again, it’s a good idea to solicit advice from translators and authors whose work has already been translated, who might be able to point you in the right direction. Good luck!\nTarryn: I think there is definitely a market for it. For one thing you have whole countries full of new readers out there, waiting to be seized. That’s not to say it will be easy, but if a book has sold well in its original market, chances are it will find a following overseas as well.\nIt’s all about taking risks, ultimately. Having been involved in bringing translated fare to market (largely in terms of comma wrangling, mind), I would say do some research first, but be cautiously optimistic. And of course e-books and print on demand have been a game changer. Just make sure your cost-benefit analysis is realistic.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}