{"fingerprint": "sRGdPkPWpvs7a53/tyW+L6Qhbbc=", "sitename": "Clarkesworld Magazine", "title": "Messenger by Julia M Sidorova", "author": "Julia M Sidorova", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sidorova_08_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Messenger by Julia M Sidorova", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6870 words, short story\n Messenger\n Life is a stick with a death on each end, balanced on a finger of the Universe, I understand that much. My kind is born small and numerous, wet and weak. Most of us do not survive to the onset of maturation. Of those who do, yet fewer complete it. Sometimes a human will step on a whole brood of my kind and never notice, other times one of us, a mature one, will level a human home because it is in the way, and will not notice either. This is fairness, and it is made out of time.\n I am a mature and strong one, I’ve lived for a while. There were times I was big and wild, and sat in the high desert, watching water turn into salt, moon into sun; watching a root break a rock in its blindness, make a whole tree fall into abyss still clutching to the rock it had broken. Other times I wanted confinement, structure. I became a stone in a big road. The road conveyed armies back and forth. When armies no longer walked on me, they took me out of the road and fit me into a pillar to support a temple of peace. I listened to a lot of talking. I saw many humans, I learned how women were different from men. I smelled charred meat, I saw childbirth. When I left, the temple collapsed.\n Shortly after that, He took me in for the first time. I felt reduced to infinite smallness, then turned inside out, to expand on the Other Side of Things. It was not without pain. The Other Side was luminous and streaming fast in all directions at once. On the Other Side I did not move, I stretched; my tail end became an umbilicus attached to the point through which I entered. I knew that if this umbilicus broke I would not be able to reenter my world. I would contract until I was a dot, dense and blown by the luminous wind. I knew I would die once I was a dot.\n Yet I kept stretching, He forced me to, and that is how I knew He was mightier than me, than anyone of my kind. Once He had drawn me taut, He docked my head end into a place that was like a shining mouth of a jellyfish. Since I was inside out, all my thoughts and feelings, all my innermost corners and surfaces were exposed, raw and shriveling in the streaming wind, and the hand of His mind caressed and soothed, reading them. My shame and humiliation inverted inside out and became a surrender to infinite pleasure—the kind I had never experienced before.\n When I was exhausted and trembling with gratitude, he inoculated me with His purpose. His purpose stayed in my mind when He released me to my world.\n His purpose speaks in me. It says, find Me a vessel. I know the what but not the why—that is my role. He is my Master and I am His messenger, His Ag-ghel.\n I choose randomly. There is a little valley fed by a stream—a wet crease between two hills; tongues of greenery lick pale yellow slopes, getting drier, thornier as they extend. A grove, a field, a vineyard. A village. Huts, the color of earth and rocks, seem to sit atop each others’ shoulders, climbing uphill.\n I choose her because she is one of the two children who do not flee in fear when I show myself to them in my first ever human shape. The other child is a boy and smaller than she. He clutches her hand. I understand that my human shape is not reproduced very well. I wanted it to be a child, like them. It appears I got many things wrong. “Maria, is it the undead?” the boy mumbles. When I speak they do not understand me. Baffled, I shed the shape, become invisible. Still, Maria looks at me, and her eyes are blue-green.\n From this moment on I watch over her. I am a stone on the path she takes every day with her flock of sheep. I am a thornbush she crouches behind when she does not want her little brother to see what she is doing. At nights I lie on the roof of the hut she lives in with her family and listen to the twitter of their speech. This is when the memory of His stroking hand invades me again and again, and His purpose wisps in my head like handfuls of red feathers. I long for His touch and yet feel ashamed of it.\n One day Maria is up in the pasture and a streak of blood runs down to her knee. She sits down, pulls her knees up and folds back her skirt. She follows the trail of blood up her leg. When she finds the source, she squeezes her legs shut and pulls the skirt over. She sits for a while, her arms tight around her calves, then gets up and runs down to the village. She runs differently now than the way she used to, as if she holds a secret between her legs. A purpose. My time is drawing near.\n I need to take a better human form. I follow Maria’s family to the market to watch and learn. But the things that catch my attention are often superfluous: an imbalanced scale of a fig vendor absorbs me more than the vendor. I see the weights he uses, that they are good and stamped with the King’s seal, but I also see the wrongness of balance, and it draws me in. With an effort I pull away: I am here to learn to look like a vendor, not like his scale.\n A year and a half after Maria has ripened for womanhood, I follow her along the creek, the farthest from the village, where fields are no more and matted greens reach as high as her knees. She picks thistles and lilies; thistle leaves she gathers into her basket and lilies she weaves into a garland. Thistle milk and lily pollen cake her fingers. She mutters a song in a small, high-pitched voice, she meanders and pauses, and so does her song.\n “I am the rose of Sharon, and the lily of the valleys.\n “As the lily among thorns, so is my love among the daughters.\n “As the apple tree among the trees of the wood, so is my beloved among the sons . . .\n “I charge you, O daughters of Jerusalem, by the roes, and by the hinds of the field, that you stir not up, nor awake my love, till he pleases.”\n A man in the village has been looking at her, he is older, square-cut; he has curly black beard and anvil-shaped thumbs. The man has talked to her father. Soon she will be given to the anvil-thumbed man, even though he does not look like an apple tree among trees of the forest. I have to act. I become a thistle-plant in her path. My leaves are oozing with white milk.\n She reaches for me and I pierce her finger with a thorn of my stalk. She recoils with a gasp. She tries to pick the thorn out but it is burrowing yet deeper into her skin.\n In two days almost all of her hand is red and swollen and she complains of pain. But on a third day she gets better and I can leave. My job is done. That day, my Master draws me in and engulfs me in His caressing presence. I wish for nothing else than to dissolve in the honey of His grace, to be a string stretched between His universes, shimmering at His touch. I forget that I wanted to ask Him why He wants her with a child. I forget everything.\n He praises my service and calls me his best. His Ur-Ag-ghel. He gives me a name, Gabriel.\n When I return to my world, it has been four months, and things have taken a bad turn.\n She is with a child but everyone is angry at her. She says she has lain with no man or spirit, she weeps and stomps her foot when her father interrogates her. An old village woman has looked between her legs and pushed on her belly and still everyone is against her. The anvil-thumbed man no longer wants to take her into his house. Her family no longer sits her down with them to dinner. She eats her meals among cattle.\n One night when moon is in full bloom she slips out of the cattle shed and follows the creek side far away from the village. She picks a place, crouches right at the water’s edge. She rocks back and forth, mumbles her song, verse, pause, verse. She mumbles and rocks, and lets water run through her fingers.\n “The watchmen that went about the city found me, they smote me, they wounded me; the keepers of the walls took away my veil from me.\n “I charge you, O daughters of Jerusalem, if you find my beloved, that you tell him, that I am sick of love.”\n Her breathing is heavy, her voice is thin but still she hums her song. She waddles up to where the creek’s bank is steep and overhanging. She mounts it then jumps down into the shallows—the drop is higher than she is tall. A grunt is knocked out of her as she lands onto straight legs and folds up. She sits for a while, rocking, then climbs up the slope and jumps again. The third time, when she climbs up, she is limping.\n I fear for her. The third time she jumps I catch her in mid-air.\n She gasps, “Who is it? Let me go!”\n I lower into the water. My first words of human language squeeze out in a stutter.\n “I. Am. Gabriel messenger. What are you. Doing?”\n She probes with her fingers, far and wide around herself. Everywhere she probes, there is still me.\n “I hate the thistle-child,” she says.\n I understand something is going very wrong with His purpose, and it makes me terrified and lost, for He is great and so must be His plan. I, the messenger, must be at fault. “Is not thistle child,” I plead. “Is the child of one who is—” I am grasping for words,—“Who is—light? Who dwells on the Other Side of Things?” No, my words are hollow husks, no more. I recall the jellyfish-like crown into which He fitted my head, “Who presides on a shining—throne?” Then I find my footing, “Who is—God? You cannot hate it.”\n “Let me go!”\n “Please,” I say, “I am not good with words. I did not explain it well?”\n She cringes and tries to shift her body. “Let go, I’m sick!”\n She presses her hand to the bottom of her stomach and groans. With her other hand she reaches under her skirt and pulls a wad of herbs out of her female cavity. Crumpled leaves unfurl, pomegranate seeds fall out. It smells of parsley, rue. Of blood. She looks at it and begins to make noises like cackles and hiccups. Is this weeping or laughing?\n I have to save His plan. I wrap around her thighs and around her bleeding, I hold her inside and out in my cradle, and each time her toes curl and her fingers dig into me, I wrap her womb in words whose use I do not yet understand, random words out of her song, “My sister my love my undefiled your head is filled with dew and your locks with the drops of the night my rose my lily of the valley my wine my myrrh my mount Gilead my roe of the field my tower of vines my dove—”\n I carry her back to the shed of her family’s home and stay with her till she stops panting and curling her toes.\n “Does He love me?” she asks me. I think back to the unrelenting envelope of His caress spreading over my exposed inner side. What is love? He cannot touch her nor look her in the eye; He can only suck on my memories of her. If only I could show her, could do to her what He had done to me!\n “Yes, He does,” I say.\n “But you are not him?”\n “No. I am just a messenger.”\n “Why can’t I see you?”\n “Humans can only see my kind if we make an effort to be seen.”\n When she is asleep, I make a white lily and leave it on the ground next to her head. I leave in haste to set things right, to make balance the only way I can think of. I go to the anvil-thumbed man. He is asleep. I mount his chest and take shape of the fig vendor’s scale, only huge and fiery. “Thou shall take Maria as wife and take care of her every need,” I rumble, “She bears the child of God.” I sway my weighing bowls over his nose, I clang the chains, I spew noxious flames. Then I add, to my own surprise, “Thou shall not touch her as husband until her child is born.” Why did I say this?\n He is shaking and he swears to obey. Satisfied with my work, I leave.\n Over the next months I spend every night with Maria. She now has her own room in the anvil-thumbed man’s house. He treats Maria well and makes his mother serve her because her burden is heavy and she often feels ill. But at nights Maria refuses to have her mother-in-law in her room and prefers me. Without me she has night terrors, she tells me.\n She teaches me to speak more fluently. To read human faces. A broad smile. A narrow smile. A shadow of a smile coupled with a slight frown. These distinctions are important.\n I curl around her, I keep her cool, I prop her head. Her room smells of crushed rock and dew, and milk of her body. Cicadas’ tone hangs in the air, as if the indoors and outdoors are one. Sometimes she croons or moans when I rub against her skin. Sometimes she tells me to do it again.\n A white lily, found each morning at the head of her bed keeps the anvil-thumbed man and his mother in awe of the single-mindedness of the Divine purpose. How peculiar it is that He never pulls me in to Him during all this time, never inquires about the progress of His plan. How peculiar it is that I do not wish for it to happen.\n She keeps asking me to become visible to her and finally I acquiesce. I want to earn her praise and follow the description of a dream lover from that song she has been singing. I scrupulously reproduce the details such as “his cheeks as a bed of spices” and “his lips like lilies,” as well as “his belly is as bright ivory overlaid with sapphires” and in particular, “his legs are as pillars of marble.”\n Her recoil and disappointment are a surprise to me.\n The following nights she explains what the words of the song really mean. She guides me through my search of the acceptable human form. In the end I become what she wants me to be. I lie next to her and she asks me to kiss her lips. Then her neck. Then her breasts.\n The child that grows inside her is very fragile. Like me, it has to try and err at every step, groping blindly for a human form; like me, it is so eager to give up, for it is so lost in its ignorance of what it should become.\n By the time birthing comes, I have helped the child take the next step more than once. I have wrapped myself around it, teaching it to be human, passing the lessons Maria has been giving me. I have protected the mother from the child and the child from the mother; prevented the vinegar of divine essence from burning through a human body, prevented the human body, in the blindness of its wet ways, from attacking the divine.\n By the time birthing comes I am no longer certain I am just a messenger.\n A healthy boy is born. Maria recovers and all but forgets about me, tending the infant. I try to return to my old ways. I thunder through mountains, I bother oceans. I steal a red-hot rock from one of the Earth’s fire pits and keep it suspended in the skies until it burns out. It looks just like a star.\n But none of it feels the way it used to. The memory of His omnipresent love on my raw being, of the tug and tide of His universes makes me feel hollow. And the memory of the small gifts of trust and attachment Maria always had for me—her smile, her kiss, a stroke of her hand—while her whole body wailed and choked over its heavy burden, makes me feel hollower still. Her thinning voice, her sweat . . . I do not understand what the purpose of the Boy is, and it makes me restless.\n I return to where Maria lives—only to see more trouble. The King’s guard is going door to door, killing every male newborn. At least I travel faster than cavalrymen, faster than even the word of their doings. I manage to give Maria and her husband ample warning; they flee.\n Why did this happen? Eavesdropping in the King’s palace brings me the answer: the King has had a vision. Behold the Boy, it said, he will cause the royal death. Hence countrywide infanticides, they were but a royally sweeping response. A vision—is it not an act outside human powers? Does it not reveal a hand of a messenger? Has He appointed another messenger then, and if so, why is this messenger undoing His plan?\n What is His plan?\n The less I understand of my Master, the more I feel a slave.\n I burn with suspicion, insult. Jealousy. I rage high up in the sky, where air is so thin it no longer stains the void blue, to draw His attention to me. But The Other Side that He dwells in is not to be found even in the void.\n I visit upon my kind. The big and wild ones who roll upon deserts as sandstorms, and the old and sleepy ones who perch on mountaintops as helmets of ice. For all I know any one of them could have been taken in by Him and infested with His other purposes. I ask questions. For all I know, any one of them can have a reason not to answer. “Go to the Wise One,” they tell me.\n Before I do the pilgrimage, I call upon Maria and the Boy in their new home in Nazareth. She sees me walking up the road, cries, “Gabriel!” She hugs me. “Is everything all right? Last time you came it was with bad news.”\n “Yes, all right,” I say. I don’t know how to speak about my troubles. “You are pregnant, I see?” I thought it not possible.\n “What can I say? I’m a married woman . . . Joshua, greet Gabriel like I taught you.”\n The Boy hides his face in his Mother’s frock. Will he be turning into something inhuman as he grows up, I wonder. A fly buzzes by and I catch it. “Look what I got,” I say. I open my palm at his eye level and the creature tears out, its jet black hide flickers spectral colors. “A rainbow!”\n The Boy frowns.\n The Wise One lives at the bottom of the ocean in the deepest darkest gorge. As I fall through the chasm, I see gasses bubbling from the sheer walls that surround me, and heavy currents of dead, sulfur-saturated water buffet me from side to side. Animals I have never seen before crowd the rock mouths that spew sulfurous gas; they shine pale-green light on me and follow my descent with their bulging eyes. Mobs of pale, threadlike worms reach from the rock face, sway and coil around me. Strong as I am, I feel the enormous pressure with which water tries to force its way into me.\n At the bottom of the gorge there is a lake; its water is different from the rest of the ocean—colder? saltier?—and does not mix with it. I see the Wise One coiled up on the lake’s surface. He appears immature though he is older than me. Unlike the rest of my kind, he has refused to grow big and powerful. That is why he’s chosen to live under the crushing weight of the ocean. By now he probably could not survive on the surface. He looks much like the pale worms he lives amongst . . . Suddenly I realize the wisdom of his choice: He who dwells on The Other Side is unlikely to recruit him for His errands. The Wise One will never have a master because he wields no power. In being weak and small, and trapped underwater—he is free.\n I confess my story to the Wise One—everything but the part that I am as much a father to the Boy as my Master is. He ponders it, unhurriedly. The weight of water is wearing me out but I must wait.\n He says, “Why has He made you His messenger?”\n “I lived as a Temple stone for two hundred years. I assumed I knew humans. He believed me, I suppose. That’s why.” I add, “I did not know humans at all.”\n “Good,” he says. “Now tell me, wanderer, why have messengers?”\n The water pries, pushes, searches for openings. I’ve made myself impervious but it keeps trying. It cannot stop—thus is its nature. Suddenly I know the answer. “He cannot enter our world! Nor act upon it. Yet this world is to Him like a dry riverbed to the floodwater. It is only a balance that the flood desires, nothing more. He makes us serve Him because only through us can he change this world!”\n “And yet we are imperfect tools,” the Wise One says, “cumbersome, self-serving. Distractible. Swayed by passions. The Boy then, is—”\n “Is His plan to bypass our mediation! To enter this world through human agency. To talk to humans, to make them do His bidding without us as interpreters. But what is His message?”\n “You have said it yourself, seeker, there need not be any message, only—”\n “—only floodwater.”\n “—it being water . . . ” The Wise One undulates with satisfaction, and his coils bob up and down on his liquid bedstead.\n I am confused now—the water makes me so. New questions writhe in my mind like pale worms. “What is He? Why can He act upon us? What brought Him to this world? Or has He always existed next to it?”\n “Good, good,” the Wise One savors. “You have been to the boundary of the Earth, haven’t you? You have seen the dark void. I have not. But even water has holes in it. Empty space for thought. Imagine this: when a world is in its prime, like ours, ripe and overflowing with life, it attracts creatures like Him. Suppose life is a space for Him to pour in. He feels its presence from afar, like a ripple, a current through the Universes and He follows it. But there are obstacles. The pores in the sieve of this Universe are the wrong shape or too small for Him to enter. Peering through this sieve, He can latch onto our kind alone because our life force is the strongest of all—we are the only ones He can track. Or perhaps we are the only ones who can squeeze in and out through the sieve, alive.”\n Alive. I recall the shining wind, the pain of inversion. “If He . . . if the floodwaters were to pour into our world unhindered, would they drown it?”\n The Wise One loops onto himself, tightens the knot. “Drown it. Or leaven its life to a higher level. No one knows.”\n “If so, why had the Boy been put in danger?”\n “So many answers. Perhaps you only know but a small part of His plan. Perhaps His plan makes no sense. Perhaps He was testing you, not the Boy. Perhaps He was testing His other messenger. Perhaps—”\n How crushing, how unrelenting is the water!\n “You can see for yourself, discoverer. You can enter the Boy and find the answer.”\n Ripples in the lake, ripples in my vision. Spots of darkness, as if pores are widening in the sieve of the world.\n “Enter the Boy? Possess him? What if I hurt him?”\n “What does it matter if you do? Are you afraid of your Master’s wrath? Know yourself, messenger, then maybe you’ll know your Master—”\n I am already shooting up, shearing the walls of the gorge off, sending shreds of worm flesh tumbling into abyss. I flee, chased by the greatest fear I’ve ever felt—of waters rushing in.\n . . . An ocean, a sky. I float in between, a listless island. If His purpose was to tap into humanity in bypass of me and my kind, then I have made Him fail. His Son is not really His. He is mine, too. When will He learn it? How will He punish us?\n I spend most of the next sixteen years watching over the Boy, afraid to see signs of my Master’s plan, signs of the other messenger; afraid that my Master will pull me away from the Boy. Afraid to enter the Boy and see the answer.\n Every once in a while I visit his mother in what I now call my human-form-for-Maria. That’s the only human form I know. I reveal my presence with a white lily, and each time she blushes, finding it. She nuzzles the petals, her eyes searching for my shape. “Gabriel, you silly man,” she sometimes chastises me, “It’s winter!”\n I like it when she sits me to a bowl of pottage or tells me about her day. When I listen to her, the words of the Wise One become mute pebbles, a handful among many. I can throw them away. Sometimes she wonders what future holds for the Boy. I say I do not know.\n But without her, worry gnaws at me, and the Wise One’s words come alive. If only I could peek inside the Boy, just once, then I would know what he is capable of! I am tempted, oh so tempted! One day I find him at the sea shore, mending a boat. Alone. I succumb to temptation, I take possession of him.\n It feels almost familiar, as if he is still an unborn child. But there is something—something that grinds at me. A dry, rushed patter—his heart does not beat, it speaks in tongues. A tangle that draws ever tighter as if devouring itself from the inside out. Suddenly, the Boy’s body slams the sand. He twists and flips like the fish he catches; acid and bile surge the wrong way through his gut. Scared, I exit him.\n What have I done?!\n He lies flat, his eyes and mouth are frosted with sand, his stomach is deflated and droopy on the rack of his pelvis and ribs. But he comes to by the time I summon Maria to the scene. I have no courage to tell her I may have caused his seizure. I keep a tight watch, pondering the nature of the tangle inside him, but nothing else happens, and I am almost relieved.\n One day I visit again, and Maria and I are kneeling by her hearth, she is kindling a fire, I pass wood shavings and twigs to her so she could arrange them in the way she likes. Our heads almost touch. She tells me that she was such a confused and selfish little girl back in the day, that she did not think with her head, and that she cannot believe how bold—and casual—she was with me. But when she lifts her head to glance at me, her blue-green eyes are shining and I know she does not regret a single thing.\n The Boy picks up on her smile when he walks in on us. He must not have seen this kind of smile ever on her face. He looks stern. “Who is this, Mother?”\n “That’s Gabriel, remember? He’s known you since you were that small. He is watching over us. He’s a good friend.” She is blushing.\n When the Boy leaves, she measures me head to toe. “Perhaps you could age your appearance. You look much too young next to me. You’re still the young lover that you’ve . . . You look my son’s age! It’s just not—proper, and more so since I’m now a widow. It’s been years, Gabriel, don’t you realize?”\n “You don’t change,” I mutter.\n She shakes her head. “Oh but I do!” There is a shadow of a smile on her face, and a slight frown. I remember what this one means.\n A year after this, the Boy leaves home. He’s been moody and withdrawn ever since his seizure and he’s hardly spoken to anyone lately. That’s what Maria tells me when I come to see her. I say I don’t know what it means, if anything, and she becomes angry with me. “Only you can be so blind, Gabriel! I have to tell you this: I used to think sometimes—and this makes me wonder again—that you are, you know, simple. The way you don’t have an understanding of certain things . . . I just don’t know!” She wells up and walks away from me. She hasn’t even noticed my new, meticulously age-adjusted human-form-for-Maria.\n I am not a fool. I understand what it all means. Worse yet—I may have caused it by entering the Boy. I track him down in the high desert. At first I still hope that he will turn around, or pass through the dead lands and be on his way. Instead, he finds himself an overhang of a rock on a small plateau and settles in.\n The cavity he has chosen has a small hollow, so I make sure it is always filled with water. The day he finishes up his last ration, I leave a loaf of bread at the edge of his shelter.\n He does not touch it, he throws it off the cliff. And the new one the next day, and another one after that. On the fifth day he flings his fist into the air and cries out, “Stop tempting me!”\n Fear fills me up, fear like dead-water of the Wise One’s gorge. The self-devouring tangle, the dry patter instead of heartbeat. The purpose of my Master has woken up. My Boy is listening to the message.\n The next few days he still meanders around in search of food and I try to sneak it onto his path, but he rejects anything more than a dead copperhead as suspiciously convenient, thus a temptation. Then he just sits cross legged at the lip of his cave and stares into space. His head quivers from time to time, as if about to lose its balance on the weak stem of his neck.\n I must save him. I must get through to him.\n I take him by the shoulders and lift him into the air. “Please do not listen to Him who dwells on The Other Side of Things. He does not care about you. You are just a tool to Him, a vessel. He wants this world and He wants to enter it through you, just as He used to want to enter it through me!”\n The Boy’s eyes dart, hazy with delirium. I shake him by the shoulders. “Please, please hear me out!”\n “Be gone with you,” he pushes past his cracked lips.\n “I am your guardian, I’ve watched over you since before you were born. Ask your mother. Just let me take you to your mother and she will tell you! I am Gabriel!”\n “No! Don’t touch her! Stay away from us!” He fights me now, kicks, scratches at me.\n I lift him up and up into the sky. We fly. Higher, faster. Shreds of clouds tumbleweed past us. “Look around, am I not real? Am I not holding you? Look down. Will you not fall if not for me? I am here, while He is not. I am holding you, not Him. Do you want me to let you go to prove it? Do you think He’ll catch you? Because He won’t! He can’t! Say a word and fall, if you want, fall and break upon the ground because He won’t be there to support you!”\n Clawing, panting, the Boy chants, “Kill me if you must, but I shall not put the Lord my God to the test—”\n Higher and higher. “Open your eyes and see the world as I show it to you. Have courage!” Mountains are wrinkles, rivers are veins, forests are fur. Lost on the Boy, the glory of the world; his eyes are squeezed shut and wind sucks tears out of them. His pallid lips move, though no sound is coming out. I plummet to a snow-crowned peak, I crash him onto a glacier, slippery, steep, blinding to the eye, razor sharp; he retches bile, he curls up like a grub, he gulps for air. I am no longer invisible, I cannot . . . temple stones and pale worms, gutted bullocks and throbbing veins, thunderclouds and obelisks, a fiery scale, a burning bush, a human-form-for-Maria, a shining jellyfish, pieces, pieces—I swarm in front of the Boy, I swell, “I care for you—I want to protect you—please, look at me—see me for what I am—I am your father—”\n But he covers his eyes with his forearms, he crawls from me, away, away, he whimpers, choking on his puke, “Be gone, Satan, leave me alone!”\n When the Boy loses consciousness, I fly him back to his home. It is night there, and I knock on the door before I leave him on the doorstep. I watch his family flutter about him, drag him inside. I do not reveal myself.\n Almost immediately thereafter He who dwells on the Other Side draws me into His presence.\n Fight! Grab onto air, resist! A pain of inversion. Fight, fight! A shining jellyfish. Helplessness. Let me out becomes take me, I’m yours. Pleasureshame. Loathingbliss. Caressinterrogation. Now He knows everything I’ve done. He knows.\n And then—a thought slips through, a wrinkle in the shining wind. You keep hanging on—stretched as you are, you are afraid to give it up and die a dense dot—\n Yes, my insides moan.\n A comb of hatched lines—The Other Side frowns?—rakes me head to tail. He is releasing me and I am collapsing, about to burst through my own tail-end and into a pore of the world’s sieve; but even as I do it, I catch a glimpse of something I am not supposed to know about Him. A weakness.\n Growling, I fall flat onto the ground of my world.\n I learn that I have been kept away for ten years. The Boy has disciples now, followers. Crowds gather to hear him preach. He is rumored to make dead humans walk and turn things into other things. Is he capable of it now? Or has the other messenger been helping him? The Boy has come into Jerusalem and the capital is ready to boil over.\n The Boy is arrested.\n I know—He who dwells on The Other Side made sure I do—that He has devised to kill the Boy, discard him as faulty, because the Boy is not His son. Because, not being His son, the Boy has misread the message.\n Misunderstood it, garbled it up. No wonder—the Boy’s other father is a simple one.\n He who dwells wants me to know His plan and yet be unable to foil it. As I rush to the execution site to rescue my Boy, someone dark rises to stop me. One of my kind, but bigger than me. A wild one, crazy for his Master’s caress. More than an Ur-Ag-ghel, worse than an Ur-Ag-ghel. The shadow messenger, the snarling dog, the hurricane. Beelzebub.\n We clash.\n All I want is to claw my way to my Boy’s cross, all he wants is to keep me away. He drags me across half the world, slams me into mountaintops, tangles me in the roots of continents deep underwater. We tear pieces out of each other, we bleed memories and thoughts.\n It may have been days. We’ve worn each other out, we are both stuck inside Earth, stranded in its vein-work, mired in its black, tarry blood; he is locked in on me, leeching my life away, and I am gnawing at him, eviscerating his life. The degradation of our fight is almost complete, we are almost one, a killervictim, a hideous creature born of hatred; our joined flesh jerks and shudders.\n I win by a thread. That’s how little is enough to unbalance a scale on the finger of the Universe. It takes me another eternity to extricate myself from the ground, and from my victim’s flesh. When I drag myself to the cross, it’s over.\n I find my son a few days later—they sealed him in a crypt. I search for signs of life. Any life. My life-force. My Master’s purpose. Human warm-churning. There is none. I take his body to the mountain glacier we have been to. I make him a tomb of ice and granite.\n They say, while on the cross, he cried out, “Father, why have you forgotten me?” I will never know if it was me he called for. But I know that I have not come.\n What is love?\n Leaving white lilies in the places our son has spent his last days in, knowing that she will be there, she will come upon them. Leaving lilies even though I know they fit no longer, they are ridiculous, dated, outrageous—knowing all that and still not being able to stop, because this is the only language of speaking to her heart, that I know. My Master never loved you. I do.\n What is love?\n I stand in a grove. Lilies everywhere, their heavy fragrance mixes with twilight. “Joshua?” she calls in a breaking voice. “Son?” Too little light to see well, but I am just as culpable—she wants it so much that my body can’t help but assume the resemblance. She runs towards me but the closer she gets, the less believing she is. “Gabriel? . . . No. You don’t! Stop it, stop it now!” She groans and swings her fists, hits me in the chest, face.\n “I am so sorry,” I whisper, “So sorry.”\n Not for my failure to save him. For that—no word sorry is even allowed. I am sorry that my human-form-for-you is so easily mistaken for our son, I just wanted you to see what you yearned to see—just for one moment—I thought—yes, it is callow and cruel of me, you are right, I am simple, I am Gabriel-the-silly-man.\n “You left us,” she sobs, “you’ve abandoned us for ten years! How could you?”\n What is love?\n Our son is dead, we both know it. He has been killed because of something we did thirty three years ago. Our son’s followers keep seeing signs of his resurrection, they may have glimpsed my shape, wandered into my stubborn lilies. Soon neither she, nor I can stop the legend from forming. It will gain a meaning of its own, a message that neither she nor I will recognize though it will hardly matter; nothing we will or will not do will change its course.\n What is love?\n I will dote on her till the end of her days. There will be more tears and accusations. Guilt. Our life will be bitter, but not all the time. Sometimes there will be a shadow of a smile and only a slight frown to go along with it. “We’ve come a long way, you and I, haven’t we?” Yes, we have.\n Fairness is made out of time. When Maria passes away, I will be free to fight and die. I know this much: the One who kills His son because he has got His message wrong, knows no love.\n When You draw me in one more time—even if I have to kill every mature one of my kind to force You to turn to me as the only suitable messenger, because You will want one, You cannot help it—\n When You do it, when I am stretched on The Other Side—breaking off the attachment to my entry point will kill me but that’s not all. I know Your weakness, Master. The scar left of my ripped umbilicus will shut the pores of my world. You will never be able to reach into it again.\n All You will be left with, to contemplate till the end of eternity, will be a dense dot, blown about ceaselessly, aimlessly. A bitter little residue of me.\n Julia Sidorova is a Clarion West 2009 graduate. She has a Ph.D. in molecular genetics and she spends her days as a biomedical scientist at the University of Washington, Seattle, messing with cultured human cells, for the most part. The rest of the time she writes speculative fiction. She likes feeding hummingbirds, doing things the hard way, and making pronouncements on human nature, history, politics, finance, and other topics outside her area of expertise."}