{"fingerprint": "/DoS5Er2QJMZNNcgKCC+Tn7C/E8=", "sitename": "Clarkesworld Magazine", "title": "The True Vintage of Erzuine Thale by Robert Silverberg", "author": "Robert Silverberg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/silverberg_01_16_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The True Vintage of Erzuine Thale by Robert Silverberg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9240 words, novelette, REPRINT\nThe True Vintage of Erzuine Thale\nPuillayne of Ghiusz was a man born to every advantage life offers, for his father was the master of great estates along the favored southern shore of the Claritant Peninsula, his mother was descended from a long line of wizards who held hereditary possession of many great magics, and he himself had been granted a fine strong-thewed body, robust health, and great intellectual power.\nYet despite these gifts, Puillayne, unaccountably, was a man of deep and ineradicable melancholic bent. He lived alone in a splendid sprawling manse overlooking the Klorpentine Sea, a place of parapets and barbicans, loggias and pavilions, embrasures and turrets and sweeping pilasters, admitting only a few intimates to his solitary life. His soul was ever clouded over by a dark depressive miasma, which Puillayne was able to mitigate only through the steady intake of strong drink. For the world was old, nearing its end, its very rocks rounded and smoothed by time, every blade of grass invested with the essence of a long antiquity, and he knew from his earliest days that futurity was an empty vessel and only the long past supported the fragile present. This was a source of extreme infestivity to him. By assiduous use of drink, and only by such use of it, he could succeed from time to time in lifting his gloom, not through the drink itself but through the practice of his art, which was that of poetry: his wine was his gateway to his verse, and his verse, pouring from him in unstoppable superiloquent abundance, gave him transient release from despond. The verse forms of every era were at his fingertips, be they the sonnet or the sestina or the villanelle or the free chansonette so greatly beloved by the rhyme-loathing poets of Sheptun-Am, and in each of them he displayed ineffable mastery. It was typical of Puillayne, however, that the gayest of his lyrics was invariably tinged with ebon despair. Even in his cups, he could not escape the fundamental truth that the world’s day was done, that the sun was a heat-begrudging red cinder in the darkening sky, that all striving had been in vain for Earth and its denizens; and those ironies contaminated his every thought.\nAnd so, and so, cloistered in his rambling chambers on the heights above the metropole of Ghiusz, the capital city of the happy Claritant that jutted far out into the golden Klorpentine, sitting amidst his collection of rare wines, his treasures of exotic gems and unusual woods, his garden of extraordinary horticultural marvels, he would regale his little circle of friends with verses such as these:\nThe night is dark. The air is chill.\nSilver wine sparkles in my amber goblet.\nBut it is too soon to drink. First let me sing.\nJoy is done! The shadows gather!\nDarkness comes, and gladness ends!\nYet though the sun grows dim,\nMy soul takes flight in drink.\nWhat care I for the crumbling walls?\nWhat care I for the withering leaves?\nHere is wine!\nWho knows? This could be the world’s last night.\nMorning, perhaps, will bring a day without dawn.\nThe end is near. Therefore, friends, let us drink!\nDarkness . . . . darkness . . . .\nThe night is dark. The air is chill.\nTherefore, friends, let us drink!\nLet us drink!\n“How beautiful those verses are,” said Gimbiter Soleptan, a lithe, playful man given to the wearing of green damask pantaloons and scarlet sea-silk blouses. He was, perhaps, the closest of Puillayne’s little band of companions, antithetical though he was to him in the valence of his nature. “They make me wish to dance, to sing—and also . . . ” Gimbiter let the thought trail off, but glanced meaningfully to the sideboard at the farther end of the room.\n“Yes, I know. And to drink.”\nPuillayne rose and went to the great sideboard of black candana over-painted with jagged lines of orpiment and gamboge and flake blue in which he kept the wines he had chosen for the present week. For a moment, he hesitated among the tight-packed row of flasks. Then his hand closed on the neck of one fashioned from pale-violet crystal, through which a wine of radiant crimson glowed with cheery insistence.\n“One of my best,” he announced. “A claret, it is, of the Scaumside vineyard in Ascolais, waiting forty years for this night. But why let it wait longer? There may be no later chances.”\n“As you have said, Puillayne. ‘This could be the world’s last night.’ But why, then, do you still disdain to open Erzuine Thale’s True Vintage? By your own argument, you should seize upon it while opportunity yet remains. And yet you refuse.”\n“Because,” Puillayne said, smiling gravely, and glancing toward the cabinet of embossed doors where that greatest of all wines slept behind barriers of impenetrable spells, “This may, after all, not be the world’s last night, for none of the fatal signs have made themselves apparent yet. The True Vintage deserves only the grandest of occasions. I shall wait a while longer to broach it. But the wine I have here is itself no trifle. Observe me now.”\nHe set out a pair of steep transparent goblets rimmed with purple gold, murmured the word to the wine-flask that unsealed its stopper, and held it aloft to pour. As the wine descended into the goblet it passed through a glorious spectrum of transformation, now a wild scarlet, now deep crimson, now carmine, mauve, heliotrope shot through with lines of topaz, and, as it settled to its final hue, a magnificent coppery gold. “Come,” said Puillayne, and led his friend to the viewing-platform overlooking the bay, where they stood side by side, separated by the great vase of black porcelain that was one of Puillane’s most cherished treasures, in which a porcelain fish of the same glossy black swam insolently in the air.\nNight had just begun to fall. The feeble red sun hovered precariously over the western sea. Fierce eye-stabbing stars already blazed furiously out of the dusky sky to north and south of it, arranging themselves in the familiar constellations, the Hoary Nimbus, the Panoply of Swords, the Cloak of Cantenax, the Claw. The twilight air was cooling swiftly. Even here in this land of the far south, sheltered by the towering Kelpusar range from the harsh winds that raked Almery and the rest of Grand Motholam, there was no escape from the chill of the night. Everywhere, even here, such modest daily warmth as the sun afforded fled upward through the thinning air the moment that faint light was withdrawn.\nPuillayne and Gimbiter were silent a time, savoring the power of the wine, which penetrated subtly, reaching from one region of their souls to the next until it fastened on the heart. For Puillayne, it was the fifth wine of the day, and he was well along in the daily defeat of his innate somberness of spirit, having brought himself to the outer borderlands of the realm of sobriety. A delightful gyroscopic instability now befuddled his mind. He had begun with a silver wine of Kauchique flecked with molecules of gold, then had proceeded to a light ruby wine of the moorlands, a sprightly sprezzogranito from Cape Thaumissa, and, finally, a smooth but compelling dry Harpundium as a prelude to this venerable grandissimus that he currently was sharing with his friend. That progression was a typical one for him. Since early manhood he had rarely passed a waking hour without a goblet in his hand.\n“How beautiful this wine is,” said Gimbiter finally.\n“How dark the night,” said Puillayne. For even now he could not escape the essentially rueful cast of his thoughts.\n“Forget the darkness, dear friend, and enjoy the beauty of the wine. But no: they are forever mingled for you, are they not, the darkness and the wine. The one encircles the other in ceaseless chase.”\nThis far south, the sun plunged swiftly below the horizon. The ferocity of the starlight was remorseless now. The two men sipped thoughtfully.\nGimbiter said, after a further span of silence, “Do you know, Puillayne, that strangers are in town asking after you?”\n“Strangers, indeed? And asking for me?”\n“Three men from the north. Uncouth-looking ones. I have this from my gardener, who tells me that they have been making inquiries of your gardener.”\n“Indeed,” said Puillayne, with no great show of interest.\n“They are a nest of rogues, these gardeners. They all spy on us, and sell our secrets to any substantial bidder.”\n“You tell me no news here, Gimbiter.”\n“Does it not concern you that rough-hewn strangers are asking questions?”\nPuillayne shrugged. “Perhaps they are admirers of my verses, come to hear me recite.”\n“Perhaps they are thieves, come from afar to despoil you of some of your fabled treasures.”\n“Perhaps they are both. In that case, they must hear my verses before I permit any despoiling.”\n“You are very casual, Puillayne.”\n“Friend, the sun itself is dying as we stand here. Shall I lose sleep over the possibility that strangers may take some of my trinkets from me? With such talk you distract us from this unforgettable wine. I beg you, drink, Gimbiter, and put these strangers out of your mind.”\n“I can put them from mine,” said Gimbiter, “but I wish you would devote some part of yours to them.” And then he ceased to belabor the point, for he knew that Puillayne was a man utterly without fear. The profound bleakness that lay at the core of his spirit insulated him from ordinary cares. He lived without hope and therefore without uneasiness. And by this time of day, Gimbiter understood, Puillayne had further reinforced himself within an unbreachable palisade of wine.\nThe three strangers, though, were troublesome to Gimbiter. He had gone to the effort of inspecting them himself earlier that day. They had taken lodgings, said his head gardener, at the old hostelry called the Blue Wyvern, between the former ironmongers’ bazaar and the bazaar of silk and spices, and it was easy enough for Gimbiter to locate them as they moved along the boulevard that ran down the spine of the bazaar quarter. One was a squat, husky man garbed in heavy brown furs, with purple leather leggings and boots, and a cap of black bearskin trimmed with a fillet of gold. Another, tall and loose-limbed, sported a leopard-skin tarboosh, a robe of yellow muslin, and red boots ostentatiously spurred with the spines of the roseate urchin. The third, clad unpretentiously in a simple gray tunic and a quilted green mantle of some coarse heavy fabric, was of unremarkable stature and seemed all but invisible beside his two baroque confederates, until one noticed the look of smoldering menace in his deep-set, resolute, reptilian eyes, set like obsidian ellipsoids against his chalky-hued face.\nGimbiter made such inquiries about them at the hostelry as were feasible, but all he could learn was that they were mercantile travelers from Hither Almery or even farther north, come to the southlands on some enterprise of profit. But even the innkeeper knew that they were aware of the fame of the metropole’s great poet Puillayne, and were eager to achieve an audience with him. And therefore Gimbiter had duly provided his friend with a warning; but he was sadly aware that he could do no more than that.\nNor was Puillayne’s air of unconcern an affectation. One who has visited the mephitic shores of the Sea of Nothingness and returned is truly beyond all dismay. He knows that the world is an illusion built upon a foundation of mist and wind, and that it is great folly to attach oneself in any serious way to any contrary belief. During his more sober moments, of course, Puillayne of Ghiusz was as vulnerable to despair and anxiety as anyone else; but he took care to reach with great speed for his beloved antidote the instant that he felt tendrils of reality making poisonous incursions through his being. But for wine, he would have had no escape from his eternally sepulchral attitudinizing.\nSo the next day, and the next, days that were solitary by choice for him, Puillayne moved steadfastly through his palace of antiquarian treasures on his usual diurnal rounds, rising at day-break to bathe in the spring that ran through his gardens, then breakfasting on his customary sparse fare, then devoting an hour to the choice of the day’s wines and sampling the first of them.\nIn mid-morning, as the glow of the first flask of wine still lingered in him, he sat sipping the second of the day and reading awhile from some volume of his collected verse. There were fifty or sixty of them by now, bound identically in the black vellum made from the skin of fiendish Deodands that had been slaughtered for the bounty placed upon such fell creatures; and these were merely the poems that he had had sufficient sobriety to remember to indite and preserve, out of the scores that poured from him so freely. Puillayne constantly read and reread them with keen pleasure. Though he affected modesty with others, within the shelter of his own soul he had an unabashed admiration for his poems, which the second wine of the day invariably amplified.\nAfterward, before the second wine’s effect had completely faded, it was his daily practice to stroll through the rooms that held his cabinet of wonders, inspecting with ever-fresh delight the collection of artifacts and oddities that he had gathered during youthful travels that had taken him as far north as the grim wastes of Fer Aquila, as far to the east as the monster-infested deadlands beyond the Land of the Falling Wall. Where ghouls and deadly grues swarmed and thrived, as far west as ruined Ampridatvir and sullen Azederach on the sunset side of the black Supostimon Sea. In each of these places, the young Puillayne had acquired curios, not because the assembling of them had given him any particular pleasure in and of itself, but because the doing of it turned his attention for the moment, as did the drinking of wine, from the otherwise inescapable encroachment of gloom that from boyhood on had perpetually assailed his consciousness. He drew somber amusement now from fondling these things, which recalled to him some remote place he had visited, summoning up memories of great beauty and enchanting peace, or arduous struggle and biting discomfort, it being a matter of no importance to him which it might have been, so long as the act of remembering carried him away from the here and now.\nThen he would take his lunch, a repast scarcely less austere than his morning meal had been, always accompanying it by some third wine chosen for its soporific qualities. A period of dozing invariably followed, and then a second cooling plunge in the garden spring, and then—it was a highlight of the day—the ceremonial opening of the fourth flask of wine, the one that set free his spirit and allowed the composition of that day’s verses. He scribbled down his lines with haste, never pausing to revise, until the fervor of creation had left him. Once more, then, he read, or uttered the simple spell that filled his bayside audifactorium with music. Then came dinner, a more notable meal than the earlier two, one that would do justice to the fifth and grandest wine of the day, in the choosing of which he had devoted the greatest of care; and then, hoping as ever that the dying sun might perish in the night and release him at last from his funereal anticipations, he gave himself to forlorn dreamless sleep.\nSo it passed for the next day, and the next, and, on the third day after Gimbiter Soleptan’s visit, the three strangers of whom Gimbiter had warned him presented themselves at last at the gates of his manse.\nThey selected for their unsolicited intrusion the hour of the second wine, arriving just as he had taken one of the vellum-bound volumes of his verse from its shelf. Puillayne maintained a small staff of wraiths and revenants for his household needs, disliking as he did the use of living beings as domestic subordinates, and one of these pallid eidolons came to him with news of the visitors.\nPuillayne regarded the ghostly creature, which just then was hovering annoyingly at the borders of transparency as though attempting to communicate its own distress, with indifference. “Tell them they are welcome. Admit them upon the half hour.”\nIt was far from his usual custom to entertain visitors during the morning hours. The revenant was plainly discommoded by this surprising departure from habit. “Lordship, if one may venture to express an opinion—”\n“One may not. Admit them upon the half hour.”\nPuillayne used the interval until then to deck himself in formal morning garb: a thin tunic of light color, a violet mantle, laced trousers of the same color worn over underdrawers of deep red, and, above all the rest, a stiff unlined garment of a brilliant white. He had already selected a chilled wine from the Bay of Sanreale, a brisk vintage of a shimmering metallic-gray hue, for his second wine; now he drew forth a second flask of it and placed it beside the first. The house-wraith returned, precisely upon the half hour, with Puillayne’s mysterious guests.\nThey were, exactly as Gimbiter Soleptan had opined, a rough-hewn, uncouth lot. “I am Kesztrel Tsaye,” announced the shortest of the three, who seemed to be the dominant figure: a burly person wrapped in the thick shaggy fur of some wild beast, and topped with a gold-trimmed cap of a different, glossier fur. His dense black beard encroached almost completely on his blunt, unappealing features, like an additional shroud of fur. “This is Unthan Vyorn”—a nod toward a lanky, insolent-looking fellow in a yellow robe, flamboyantly baroque red boots, and an absurd betasseled bit of headgear that displayed a leopard’s spots—“and this,” he said, glancing toward a third man, pale and unremarkably garbed, notable mainly for an appearance of extreme inconsequence bordering on nonpresence, but for his eyes, which were cold and brooding, “is Malion Gainthrust. We three are profound admirers of your great art, and have come from our homes in the Maurenron foothills to express our homage.”\n“I can barely find words to convey the extreme delight I experience now, as I stand in the very presence of Puillayne of Ghiusz,” said lanky Unthan Vyorn in a disingenuously silken voice with just the merest hint of sibilance.\n“It seems to me that you are capable of finding words readily enough,” Puillayne observed. “But perhaps you mean only a conventional abnegation. Will you share my wine with me? At this hour of the morning, I customarily enjoy something simple, and I have selected this Sanreale.”\nHe indicated the pair of rounded gray flasks. But from the depths of his furs, Kesztrel Tsaye drew two globular green flasks of his own and set them on the nearby table. “No doubt your choice is superb, master. But we are well aware of your love of the grape, and among the gifts we bring to you are these carboys of our own finest vintage, the celebrated azure ambrosia of the Maurenrons, with which you are, perhaps, unfamiliar, and which will prove an interesting novelty to your palate.”\nPuillayne had not, in truth, ever tasted the so-called ambrosia of the Maurenrons, but he understood it to be an acrid and deplorable stuff, fit only for massaging cramped limbs. Yet he maintained an affable cordiality, studiously examining the nearer of the two carboys, holding it to the light, hefting it as though to determine the specific gravity of its contents. “The repute of your wines is not unknown to me,” he said diplomatically. “But I propose we set these aside for later in the day, since, as I have explained, I prefer only a light wine before my midday meal, and perhaps the same is true of you.” He gave them an inquisitive look. They made no objection; and so he murmured the spell of opening and poured out a ration of the Sanreale for each of them and himself.\nBy way of salute, Unthan Vyorn offered a quotation from one of Puillayne’s best-known little pieces:\nWhat is our world? It is but a boat\nThat breaks free at sunset, and drifts away\nWithout a trace.\nHis intonation was vile, his rhythm was uncertain, but at least he had managed the words accurately, and Puillayne supposed that his intentions were kindly. As he sipped his wine, he studied this odd trio with detached curiosity. They seemed like crude ruffians, but perhaps their unpolished manner was merely the typical style of the people of the Maurenrons, a locality to which his far-flung travels had never taken him. For all he knew, they were dukes or princes or high ministers of that northern place. He wondered in an almost incurious way what it was that they wanted with him. Merely to quote his own poetry to him was an insufficient motive for traveling such a distance. Gimbiter believed that they were malevolent; and it might well be that Gimbiter, a shrewd observer of mankind, was correct in that. For the nonce, however, his day’s intake of wine had fortified him against anxiety on that score. To Puillayne, they were at the moment merely a puzzling novelty. He would wait to see more.\n“Your journey,” he said politely, “was it a taxing one?”\n“We know some small magics, and we had a few useful spells to guide us. Going through the Kelpusars, there was only one truly difficult passage for us,” said Unthan Vyorn, “which was the crossing of the Mountain of the Eleven Uncertainties.”\n“Ah,” said Puillayne. “I know it well.” It was a place of bewildering confusion, where a swarm of identical peaks confronted the traveler and all roads seemed alike, though only one was correct and the others led into dire unpleasantness. “But you found your way through, evidently, and coped with equal deftness with the Gate of Ghosts just beyond, and the perilous Pillars of Yan Sfou.”\n“The hope of attaining the very place where now we find ourselves drew us onward through all obstacles,” Unthan Vyorn said, outdoing even himself in unctuosity of tone. And again he quoted Puillayne:\nThe mountain roads we traveled rose ten thousand cilavers high.\nThe rivers we crossed were more turbulent than a hundred demons.\nAnd our voices were lost in the thunder of the cataracts.\nWe cut through brambles that few swords could slash.\nAnd then beyond the mists we saw the golden Klorpentine\nAnd it was as if we had never known hardship at all.\nHow barbarously he attacked the delicate lines! How flat was his tone as he came to the ecstatic final couplet! But Puillayne masked his scorn. These were foreigners; they were his guests, however self-invited they might be; his responsibility was to maintain them at their ease. And he found them diverting, in their way. His life in these latter years had slipped into inflexible routine. The advent of poetry-quoting northern barbarians was an amusing interlude in his otherwise constricted days. He doubted more than ever, now, Gimbiter’s hypothesis that they meant him harm. There seemed nothing dangerous about these three except, perhaps, the chilly eyes of the one who did not seem to speak. His friend Gimbiter evidently had mistaken bumptiousness for malversation and malefic intent.\nFur-swathed Kesztrel Tsaye said, “We know, too, that you are a collector of exotica. Therefore we bring some humble gifts for your delight.” And he, too, offered a brief quotation:\nLet me have pleasures in this life\nFor the next is a dark abyss!\n“If you will, Malion Gainthrust—”\nKesztrel Tsaye nodded to the icy-eyed silent man, who produced from somewhere a sack that Puillayne had not previously noticed, and drew from it a drum of red candana covered with taut-stretched thaupin-hide, atop which nine red-eyed homunculi performed an obscene dance. This was followed by a little sphere of green chalcedony out of which a trapped and weeping demon peered, and that by a beaker which overflowed with a tempting aromatic yellow liquid that tumbled to the floor and rose again to return to the vessel from which it had come. Other small toys succeeded those, until gifts to the number of ten or twelve sat arrayed before Puillayne.\nDuring this time, Puillayne had consumed nearly all the wine from the flask he had reserved for himself, and he felt a cheering dizziness beginning to steal over him. The three visitors, though he had offered them only a third as much apiece, had barely taken any. Were they simply abstemious? Or was the shimmering wine of Sanreale too subtle for their jackanapes palates?\nHe said, when it appeared that they had exhausted their display of gewgaws for him, “If this wine gives you little gratification, I can select another and perhaps superior one for you, or we could open that which you have brought me.”\n“It is superb wine, master,” Unthan Vyorn said, “and we would expect no less from you. We know, after all, that your cellar is incomparable, that it is a storehouse of the most treasured wines of all the world, that in fact it contains even the unobtainable wine prized beyond all others, the True Vintage of Erzuine Thale. This Sanreale wine you have offered us is surely not in a class with that; but it has much merit in its own way and if we drink it slowly, it is because we cherish every swallow we take. Simply to be drinking the wine of Puillayne of Ghiusz in the veritable home of Puillayne of Ghiusz is an honor so extreme that it constringes our throats with joy, and compels us to drink more slowly than otherwise we might.”\n“You know of the True Vintage, do you?” Puillayne asked.\n“Is there anyone who does not? The legendary wine of the Nolwaynes who have reigned in Gammelcor since the days when the sun had the brightness of gold—the wine of miracles, the wine that offers the keenest of ecstasies that it is possible to experience—the wine that opens all doors to one with a single sip—” Unshielded covetousness now gleamed in the lanky man’s eyes. “If only we could enjoy that sip! Ah, if only we could merely have a glimpse of the container that holds that wondrous elixir!”\n“I rarely bring it forth, even to look at it,” said Puillayne. “I fear that if I were to take it from its place of safekeeping, I would be tempted to consume it prematurely, and that is not a temptation to which I am ready to yield.”\n“A man of iron!” marveled Kesztrel Tsaye. “To possess the True Vintage of Erzuine Thale, and to hold off from sampling it! And why, may I ask, do you scruple to deny yourself that joy of joys?”\nIt was a question Puillayne had heard many times before, for his ownership of the True Vintage was not something he had concealed from his friends. “I am, you know, a prodigious scribbler of minor verse. Yes,” he said, over their indignant protests, “minor verse, such a torrent of it that it would fill this manse a dozen times over if I preserved it all. I keep only a small part.” He gestured moodily at the fifty volumes bound in Deodand vellum. “But somewhere within me lurks the one great poem that will recapitulate all the striving of earthly history, the epic that will be the sum and testament of us who live as we do on the precipice at the edge of the end of days. Someday I will feel that poem brimming at the perimeters of my brain and demanding release. That feeling will come, I think, when our sun is in its ultimate extremity, and the encroaching darkness is about to arrive. And then, only then, will I broach the seal on the True Vintage, and quaff the legendary wine, which indeed opens all doors, including the door of creation, so that its essence will liberate the real poet within me, and in my final drunken joy I will be permitted to set down that one great poem that I yearn to write.”\n“You do us all an injustice, master, if you wait to write that epic until the very eve of our doom,” said Unthan Vyorn in a tone of what might almost have been sorrow sincerely framed. “For how will we be able to read it, when all has turned to ice and darkness? No poems will circulate among us as we lie there perishing in the final cold. You deny us your greatness! You withhold your gift!”\n“Be that as it may,” Puillayne said, “the time is not yet for opening that bottle. But I can offer you others.”\nFrom his cabinet, he selected a generous magnum of ancient Falernian, which bore a frayed label, yellowed and parched by time. The great rounded flask lacked its seal and it was obvious to all that the container was empty save for random crusts of desiccated dregs scattered about its interior. His visitors regarded it with puzzlement. “Fear not,” said Puillayne. “A mage of my acquaintance made certain of my bottles subject to the Spell of Recrudescent Fluescence, among them this one. It is inexhaustibly renewable.”\nHe turned his head aside and gave voice to the words, and, within moments, miraculous liquefaction commenced. While the magnum was filling, he summoned a new set of goblets, which he filled near to brimming for his guests and himself.\n“It is a wondrous wine,” said Kesztrel Tsaye after a sip or two. “Your hospitality knows no bounds, master.” Indeed, such parts of his heavily bearded face that were visible were beginning to show a ruddy radiance. Unthan Vyorn likewise displayed the effects of the potent stuff, and even the taciturn Malion Gainthrust, sitting somewhat apart as though he had no business in this room, seemed to evince some reduction of his habitual glower.\nPuillayne smiled benignly, sat back, let tranquility steal over him. He had not expected to be drinking the Falernian today, for it was a forceful wine, especially at this early hour. But he saw no harm in somewhat greater midday intoxication than he habitually practiced. Why, he might even find himself producing verse some hours earlier than usual. These uncouth disciples of his would probably derive some pleasure from witnessing the actual act of creation. Meanwhile, sipping steadily, he felt the walls around him beginning to sway and glide, and he ascended within himself in a gradual way until he felt himself to be floating slightly outside and above himself, a spectator of his own self, with something of a pleasant haze enveloping his mind.\nSomewhat surprisingly, his guests, gathered now in a circle about him, appeared to be indulging in a disquisition on the philosophy of criminality.\nKesztrel Tsaye offered the thought that the imminence of the world’s demise freed one from all the restraints of law, for it mattered very little how one behaved if shortly all accounts were to be settled with equal finality. “I disagree,” said Unthan Vyorn. “We remain responsible for our acts, since, if they transgress against statute and custom, they may in truth hasten the end that threatens us.”\nInterposing himself in their conversation, Puillayne said dreamily, “How so?”\n“The misdeeds of individuals,” Unthan Vyorn replied, “are not so much offenses against human law as they are ominous disturbances in a complex filament of cause and effect by which mankind is connected on all sides with surrounding nature. I believe that our cruelties, our sins, our violations, all drain vitality from our diminishing sun.”\nMalion Gainthrust stirred restlessly at that notion, as though he planned at last to speak, but he controlled himself with visible effort and subsided once more into remoteness.\nPuillayne said, “An interesting theory: the cumulative infamies and iniquities of our species, do you say, have taken a toll on the sun itself over the many millennia, and so we are the architects of our own extinction?”\n“It could be, yes.”\n“Then it is too late to embrace virtue, I suspect,” said Puillayne dolefully. “Through our incorrigible miscreancy we have undone ourselves beyond repair. The damage is surely irreversible in this late epoch of the world’s long existence.” And he sighed a great sigh of inconsolable grief. To his consternation, he found the effects of the long morning’s drinking abruptly weakening: the circular gyration of the walls had lessened and that agreeable haze had cleared, and he felt almost sober again, defenseless against the fundamental blackness of his intellective processes. It was a familiar event. No quantity of wine was sufficient to stave off the darkness indefinitely.\n“You look suddenly troubled, master,” Kesztrel Tsaye observed. “Despite the splendor of this wine, or perhaps even because of it, I see that some alteration of mood has overtaken you.”\n“I am reminded of my mortality. Our dim and shriveled sun—the certainty of imminent oblivion—”\n“Ah, master, consider that you should be cheered by contemplation of the catastrophe that is soon to overcome us, rather than being thrust, as you say, into despond.”\n“Cheered?”\n“Most truly. For we each must have death come unto us in our time—it is the law of the universe—and what pain it is as we lie dying to know that others will survive after we depart! But if all are to meet their end at once, then there is no reason to feel the bite of envy, and we can go easily as equals into our common destruction.”\nPuillayne shook his head obstinately. “I see merit in this argument, but little cheer. My death inexorably approaches, and that would be a cause of despair to me whether or not others might survive. Envy of those who survive is not a matter of any moment to me. For me, it will be as though all the cosmos dies when I do, and the dying of our sun adds only an additional layer of regret to what is already an infinitely regrettable outcome.”\n“You permit yourself to sink into needless brooding, master,” said Unthan Vyorn airily. “You should have another goblet of wine.”\n“Yes. These present thoughts of mine are pathetically insipid, and I shame myself by giving rein to them. Even in the heyday of the world, when the bright yellow sun blazed forth in full intensity, the concept of death was one that every mature person was compelled to face, and only cowards and fools looked toward it with terror or rage or anything else but acceptance and detachment. One must not lament the inevitable. But it is my flaw that I am unable to escape such feelings. Wine, I have found, is my sole anodyne against them. And even that is not fully satisfactory.”\nHe reached again for the Falernian. But Kesztrel Tsaye, interposing himself quickly, said, “That is the very wine that has brought this adverse effect upon you, master. Let us open, instead, the wine of our country that was our gift to you. You may not be aware that it is famed for its quality of soothing the troubled heart.” He signaled to Malion Gainthrust, who sprang to his feet, deftly unsealed the two green carboys of Maurenron ambrosia, and, taking fresh goblets from Puillayne’s cabinet, poured a tall serving of the pale bluish wine from one carboy for Puillayne and lesser quantities from the other for himself and his two companions.\n“To your health, master. Your renewed happiness. Your long life.”\nPuillayne found their wine unexpectedly fresh and vigorous, with none of the rough and sour flavor he had led himself to anticipate. He followed his first tentative sip with a deeper one, and then with a third. In very fact, it had a distinctly calmative effect, speedily lifting him out of the fresh slough of dejection into which he had let himself topple.\nBut another moment more and he detected a strange unwelcome furriness coating his tongue, and it began to seem to him that beneath the superficial exuberance and openheartedness of the wine lay some less appetizing tinge of flavor, something almost alkaline that crept upward on his palate and negated the immediately pleasing effect of the initial taste. Then he noticed a heaviness of the mind overtaking him, and a weakness of the limbs, and it occurred to him, first, that they had been serving themselves out of one carboy and him out of another, and then, that he was unable to move, so that it became clear to him that the wine had been drugged. Fierce-eyed Malion Gainthrust stood directly before him, and he was speaking at last, declaiming a rhythmic chant which even in his drugged state Puillayne recognized as a simple binding spell that left him trussed and helpless.\nLike any householder of some affluence, Puillayne had caused his manse to be protected by an assortment of defensive charms, which the magus of his family had assured him would defend him against many sorts of inimicable events. The most obvious was theft: there were treasures here that others might have reasons to crave. In addition, one must guard one’s house against fire, subterranean tremors, the fall of heavy stones from the sky, and other risks of the natural world. But, also, Puillayne was given to drunkenness, which could well lead to irresponsibility of behavior or mere clumsiness of movement, and he had bought himself a panoply of spells against the consequences of excessive intoxication.\nIn this moment of danger, it seemed to him that Citrathanda’s Punctilious Sentinel was the appropriate spirit to invoke, and in a dull thick-tongued way Puillayne began to recite the incantation. But over the years, his general indifference to jeopardy had led to incaution, and he had not taken the steps that were needful to maintain the potency of his guardian spirits, which had dimmed with time so that his spell had no effect. Nor would his household revenants be of the slightest use in this predicament. Their barely corporeal forms could exert no force against tangible life. Only his gardeners were incarnate beings, and they, even if they had been on the premises this late in the day, would have been unlikely to heed his call. Puillayne realized that he was altogether without protection now. Gently, his guests, who now were his captors, were prodding him upward out of his couch. Kesztrel Tsaye said, “You will kindly accompany us, please, as we make our tour of your widely reputed treasury of priceless prizes.”\nAll capacity for resistance was gone from him. Though they had left him with the power of locomotion, his arms were bound by invisible but unbreakable withes, and his spirit itself was captive to their wishes. He could do no other than let himself be led through one hall after another of his museum, staggering a little under the effect of their wine, and when they asked him of the nature of this artifact or that, he had no choice but to tell them. Whatever object caught their fancy, they removed from its case, with Malion Gainthrust serving as the means by which it was carried back to the great central room and added to a growing heap of plunder.\nThus they selected the Crystal Pillow of Carsephone Zorn, within which scenes from the daily life of any of seven subworlds could be viewed at ease, and the brocaded underrobe of some forgotten monarch of the Pharials, whose virility was enhanced twentyfold by an hour’s wearing of it, and the Key of Sarpanigondar, a surgical tool by which any diseased organ of the body could be reached and healed without a breaching of the skin. They took also the Infinitely Replenishable Casket of Jade, once the utmost glory of the turban-wearing marauders of the frigid valleys of the Lesser Ghalur, and Sangaal’s Remarkable Phoenix, from whose feathers fluttered a constant shower of gold dust, and the Heptachromatic Carpet of Kypard Segung, and the carbuncle-encrusted casket that contained the Incense of the Emerald Sky, and many another extraordinary object that had been part of Puillayne’s hoard of fabulosities for decade upon decade.\nHe watched in mounting chagrin. “So you have come all this way merely to rob me, then?”\n“It is not so simple,” said Kesztrel Tsaye. “You must believe us when we say that we revere your poetry, and were primarily motivated to endure the difficulties of the journey by the hope of attaining your actual presence.”\n“You choose an odd way to demonstrate your esteem for my art, then, for you would strip me of those things which I love even while claiming to express your regard for my work.”\n“Does it matter who owns these things for the upcoming interim?” the bearded man asked. “In a short while, the concept of ownership itself will be a moot one. You have stressed that point frequently in your verse.”\nThere was a certain logic to that, Puillayne admitted. As the mound of loot grew, he attempted to assuage himself by bringing himself to accept Kesztrel Tsaye’s argument that the sun would soon enough reach its last moment, smothering Earth in unending darkness and burying him and all his possessions under an obdurate coating of ice twenty marasangs thick, so what significance was there in the fact that these thieves were denuding him today of these trifles? All would be lost tomorrow or the day after, whether or not he had ever admitted the caitiff trio to his door.\nBut that species of sophistry brought him no surcease. Realistic appraisal of the probabilities told him that the dying of the sun might yet be a thousand years away, or even more, for although its inevitability was assured, its imminence was not so certain. Though ultimately he would be bereft of everything, as would everyone else, including these three villains, Puillayne came now to the realization that, all other things being equal, he preferred to await the end of all things amidst the presence of his collected keepsakes rather than without them. In that moment, he resolved to adopt a defensive posture.\nTherefore, he attempted once more to recite the Efficacious Sentinel of Citrathanda, emphasizing each syllable with a precision that he hoped might enhance the power of the spell. But his captors were so confident that there would be no result that they merely laughed as he spoke the verses, rather than making any effort to muffle his voice, and, in this, they were correct: as before, no guardian spirit came to his aid. Puillayne sensed that unless he found some more effective step to take, he was about to lose all that they had already selected, and, for all he knew, his life as well; and in that moment, facing the real possibility of personal extinction this very day, he understood quite clearly that his lifelong courtship of death had been merely a pose, that he was in no way actually prepared to take his leave of existence.\nOne possibility of saving himself remained.\n“If you will set me free,” Puillayne said, pausing an instant or two to focus their attention, “I will locate and share with you the True Vintage of Erzuine Thale.”\nThe impact of that statement upon them was immediate and unmistakable. Their eyes brightened; their faces grew flushed and glossy; they exchanged excited glances of frank concupiscence.\nPuillayne believed he understood this febrile response. They had been so overcome with an access of trivial greed, apparently, once they had had Puillayne in their power and knew themselves free to help themselves at will to the rich and varied contents of his halls, that they had forgotten for the moment that his manse contained not only such baubles as the Heptochromatic Carpet and the Infinitely Replenishable Casket, but also, hidden away somewhere in his enormous accumulation of rare wines, something vastly more desirable, the veritable wine of wines itself, the bringer of infinitely ecstatic fulfillment, the elixir of ineffable rapture, the True Vintage of Erzuine Thale. Now he had reminded them of it and all its delights; and now they craved it with an immediate and uncontrollable desire.\n“A splendid suggestion,” said Unthan Vyorn, betraying by his thickness of voice the intensity of his craving. “Summon the wine from its place of hiding, and we will partake.”\n“The bottle yields to no one’s beck,” Puillayne declared. “I must fetch it myself.”\n“Fetch it, then.”\n“You must first release me.”\n“You are capable of walking, are you not? Lead us to the wine, and we will do the rest.”\n“Impossible,” said Puillayne. “How do you think this famed wine has survived so long? It is protected by a network of highly serviceable spells, such as Thampyron’s Charm of Impartial Security, which insures that the flask will yield only to the volition of its inscribed owner, who at present is myself. If the flask senses that my volition is impaired, it will refuse to permit opening. Indeed, if it becomes aware that I am placed under extreme duress, the wine itself will be destroyed.”\n“What do you request of us, then?”\n“Free my arms. I will bring the bottle from its nest and open it for you, and you may partake of it, and I wish you much joy of it.”\n“And then?”\n“You will have had the rarest experience known to the soul of man, and I will have been cheated of the opportunity to give the world the epic poem that you claim so dearly to crave; and then, I hope, we will be quits, and you will leave me my little trinkets and take yourselves back to your dreary northern caves. Are we agreed?”\nThey looked at one another, coming quickly and wordlessly to an agreement, and Kesztrel Tsaye, with a grunt of assent, signaled to Malion Gainthrust to intone the counterspell. Puillayne felt the bonds that had embraced his arms melting away. He extended them in a lavish stretching gesture, flexed his fingers, looked expectantly at his captors.\n“Now fetch the celebrated wine,” said Kesztrel Tsaye.\nThey accompanied him back through chamber after chamber until they reached the hall where his finest wines were stored. Puillayne made a great show of searching through rack after rack, muttering to himself, shaking his head. “I have hidden it very securely,” he reported after a time. “Not so much as a precaution against theft, you realize, but as a way of making it more difficult for me to seize upon it myself in a moment of drunken impulsiveness.”\n“We understand,” Unthan Vyorn said. “But find it, if you please. We grow impatient.”\n“Let me think. If I were hiding such a miraculous wine from myself, where would I put it? The Cabinet of Meritorious Theriacs? Hardly. The Cinnabar Vestibule? The Chrysochlorous Benefice? The Tabulature? The Trogonic Chamber?”\nAs he pondered, he could see their restiveness mounting from one instant to the next. They tapped their fingers against their thighs, they moved their feet from side to side, they ran their hands inside their garments as though weapons were hidden there. Unheeding, Puillayne continued to frown and mutter. But then he brightened. “Ah, yes, yes, of course!” And he crossed the room, threw open a low door in the wall at its farther side, reached into the dusty interior of a service aperture.\n“Here,” he said jubilantly. “The True Vintage of Erzuine Thale!”\n“This?” said Kesztrel Tsaye, with some skepticism.\nThe bottle Puillayne held forth to them was a gray tapering one, dust-encrusted and unprepossessing, bearing only a single small label inscribed with barely legible runes in faint grayish ink. They crowded around like snorting basilisks inflamed with lust.\nEach in turn puzzled over the writing; but none could decipher it.\n“What language is that?” asked Unthan Vyorn.\n“These are Nolwaynish runes,” answered Puillayne. “See, see, here is the name of the maker, the famed vintner Erzuine Thale, and here is the date of the wine’s manufacture, in a chronology that I fear will mean nothing to you, and this emblem here is the seal of the king of Gammelcor who was reigning at the time of the bottling.”\n“You would not deceive us?” said Kesztrel Thale. “You would not fob some lesser wine off on us, taking advantage of our inability to read these scrawls?”\nPuillayne laughed jovially. “Put all your suspicions aside! I will not conceal the fact that I bitterly resent the imposition you are enforcing on me here, but that does not mean I can shunt aside thirty generations of family honor. Surely you must know that on my father’s side I am the Eighteenth Maghada of Nalanda, and there is a geas upon me as hereditary leader of that sacred order that bans me from all acts of deceit. This is, I assure you, the True Vintage of Erzuine Thale, and nothing else. Stand a bit aside, if you will, so that I can open the flask without activating Thampyron’s Charm, for, may I remind you, any hint that I act under duress will destroy its contents. It would be a pity to have preserved this wine for so long a time only to have it become worthless vinegar in the moment of unsealing.”\n“You act now of your own free will,” Unthan Vyorn said. “It was your choice to offer us this wine, nor was it done at our insistence.”\n“This is true,” Puillayne responded. He set out four goblets and, contemplating the flask thoughtfully, spoke the words that would breach its seal.\n“Three goblets will suffice,” said Kesztrel Tsaye.\n“I am not to partake?\n“If you do, it will leave that much less for us.”\n“You are cruel indeed, depriving me even of a fourth share of this wine, which I obtained at such expense and after negotiations so prolonged I can scarcely bear to think of them. But so be it. I will have none. As you pointed out, what does it matter, or anything else, when the hour of everlasting night grows ineluctably near?”\nHe put one goblet aside and filled the other three. Malion Gainthrust was the first to seize his, clutching it with berserk intensity and gulping it to its depths in a single crazed ingurgitation. Instantly, his strange chilly eyes grew bright as blazing coals. The other two men drank more judiciously, frowning a bit at the first sip as though they had expected some more immediate ebullition, sipping again, frowning again, now trembling. Puillayne refilled the goblets. “Drink deep,” he abjured them. “How I envy you this ecstasy of ecstasies!”\nMalion Gainthrust now fell to the floor, thrashing about oddly, and, a moment later, Kesztrel Tsaye did the same, toppling like a felled tree and slapping his hands against the tiles as though to indicate some extreme inward spasm. Long-legged Unthan Vyorn, suddenly looking deathly pale, swayed erratically, clutched at his throat, and gasped, “But this is some poison, is it not? By the Thodiarch, you have betrayed us!”\n“Indeed,” said Puillayne blandly, as Unthan Vyorn joined his writhing fellows on the floor. “I have given you not the True Vintage of Erzuine Thale, but the Efficacious Solvent of Gibrak Lahinne. The strictures of honor placed upon me in my capacity as Eighteenth Maghada of Nalanda do not extend to a requirement that I ignore the need for self-defense. Already, I believe, the bony frame of your bodies has begun to dissolve. Your internal organs must also be under attack. You will shortly lose consciousness, I suspect, which will spare you from whatever agonies you may at the moment be experiencing. But do you wonder that I took so harsh a step? You thought I was a helpless idle fool, and quite likely that scornful assessment was correct up until this hour, but by entering my sanctum and attempting to part me from the things I hold precious, you awakened me from my detachment and restored me to the love of life that had long ago fled from me. No longer did the impending doom of the world enfold me in paralysis. Indeed, I chose to take action against your depredations, and so—”\nBut he realized that there was no reason for further statements. His visitors had been reduced to puddles of yellow slime, leaving just their caps and boots and other garments, which he would add to his collection of memorabilia. The rest required only the services of his corps of revenants to remove, and then he was able to proceed with a clear mind to the remaining enterprises of a normal afternoon.\n“But will you not now at last permit yourself to enjoy the True Vintage?” Gimbiter Soleptan asked him two nights later, when he and several other of Puillayne’s closest friends had gathered in a tent of sky-blue silk in the garden poet’s manse for a celebratory dinner. The intoxicating scent of calavindra blossoms was in the air, and the pungent odor of sweet nargiise. “They might so easily have deprived you of it, and who knows but some subsequent miscreant might have more success? Best to drink it now, say I, and have the enjoyment of it before that is made impossible for you. Yes, drink it now!”\n“Not quite yet,” said Puillayne in a steadfast tone. “I understand the burden of your thought: seize the moment, guarantee the consumption while I can. By that reasoning, I should have guzzled it the instant those scoundrels had fallen. But you must remember that I have reserved a higher use for that wine. And the time for that use has not yet arrived.”\n“Yes,” said Immiter of Glosz, a white-haired sage who was of all the members of Puillayne’s circle the closest student of his work. “The great epic that you propose to indite in the hour of the sun’s end—”\n“Yes. And I must have the unbroached True Vintage to spur my hand, when that hour comes. Meanwhile, though, there are many wines here of not quite so notable a puissance that are worthy of our attention, and I propose that we ingest more than a few flasks this evening.” Puillayne gestured broadly at the array of wines he had previously set out, and beckoned to his friends to help themselves. “And as you drink,” he said, drawing from his brocaded sleeve a scrap of parchment, “I offer you the verses of this afternoon.”\nThe night is coming, but what of that?\nDo I not glow with pleasure still, and glow, and glow?\nThere is no darkness, there is no misery\nSo long as my flask is near!\nThe flower-picking maidens sing their lovely song by the jade pavilion.\nThe winged red khotemnas flutter brightly in the trees.\nI laugh and lift my glass and drain it to the dregs.\nO golden wine! O glorious day!\nSurely we are still only in the springtime of our winter\nAnd I know that death is merely a dream\nWhen I have my flask!\nOriginally published in Songs of the Dying Earth: Stories in Honor of Jack Vance, edited by George R. R. Martin and Gardner Dozois, 2009.\nRobert Silverberg is one of the most famous SF writers of modern times, with dozens of novels, anthologies, and collections to his credit. As both writer and editor (he was editor of the original anthology series New Dimensions, perhaps most acclaimed anthology series of its era), Silverberg was one of the most influential figures of the Post New Wave era of the '70s, and continues to be at the forefront of the field to this very day, having won a total of five Nebula Awards and four Hugo Awards, plus SFWA's prestigious Grandmaster Award.\nHis novels include the acclaimed Dying Inside, Lord Valentine's Castle, The Book of Skulls, Downward to the Earth, Tower of Glass, Son of Man, Nightwings, The World Inside, Born With The Dead, Shadrack In The Furnace, Thorns, Up the Line, The Man in the Maze, Tom O' Bedlam, Star of Gypsies, At Winter's End, The Face of the Waters, Kingdoms of the Wall, Hot Sky at Morning, The Alien Years, Lord Prestimion, Mountains of Majipoor, two novel-length expansions of famous Isaac Asimov stories, Nightfall and The Ugly Little Boy, The Long Way Home, and the mosaic novel Roma Eterna. His collections include Unfamiliar Territory, Capricorn Games, Majipoor Chronicles, The Best of Robert Silverberg, At The Conglomeroid Cocktail Party, Beyond the Safe Zone, and four massive retrospective collections, Secret Sharers: The Collected Stories of Robert Silverberg, Volume One: Secret Sharers, To the Dark Star: The Collected Stories of Robert Silverberg, Volume 2, Something Wild is Loose: The Collected Stories of Robert Silverberg, and Phases of the Moon: Stories from Six Decades, and a collection of early work, In the Beginning. His reprint anthologies are far too numerous to list here, but include The Science Fiction Hall of Fame, Volume One, The Science Fiction Hall of Fame, Volume Two B, and the distinguished Alpha series, among dozens of others. His most recent books are Musings and Meditations, a book of essays, and The Millennium Express, a collection. He lives with his wife, writer Karen Haber, in Oakland, California."}