{"fingerprint": "EXtA9zYhaxZgkjqsFT3FzMG9l98=", "sitename": "Clarkesworld Magazine", "title": "The Science Fiction Future of the Microbiome by Matthew Simmons", "author": "Matthew Simmons", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/simmons_06_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Science Fiction Future of the Microbiome by Matthew Simmons", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nThe Science Fiction Future of the Microbiome\nYou are wheeled into a hospital after a stroke. The doctors stabilize you and monitor you for a couple days. The latest treatments are at their disposal, so they use bacteria therapy to stimulate the growth of a diverse microbial ecosystem: feed you 3,3-dimethyl-1-butanol (DMB) to regulate trimethylamine N-oxide (TMAO) levels, nourish certain microbiota to reduce your body mass index, increase your salt processing bacteria to lower cholesterol, and alter your body’s cravings to desire foods beneficial to heart health. In a few days your tuned up body, now loaded with a bacterial population adept at combating heart disease, walks out of the hospital into a new life. Far-fetched? Not by much.\nThe human microbiome is the collective term for the flora inhabiting the human body. The Human Microbiome Project estimates there are as many as a hundred trillion cells in a human microbiome, weighing around three pounds in the average adult. These non-human cells, also called microbiota, outnumber the human cells in the body ten to one. Cell for cell we are more microbial than human. Gene for gene we have around nine million microbial genes to a mere 23,000 human genes.\nThe Human Microbiome has not been fully sequenced, but researchers estimate there are between 500-40,000 unique species of microbiota inhabiting the human body. Recent studies link these microbiota with heart disease, obesity, autoimmune disease, cancer, irritable bowel syndrome (IBS), depression, dementia, autism (ASD), and attention deficit hyperactivity disorder (ADHD) to name a few. If we alter these bacteria we can change our body and mood, treat diseases and conditions, change our scent and microbial print, and shift the way we view the world.\nThe majority of microbiota in the human body are bacteria in the gut—the thirty-foot long intestinal tract, starting at the stomach all the way to the anus. With its continuous stream of foreign matter—food, drinks, etc.—the gut provides bacteria with sustenance and an ideal hideout from the body’s immune system. The gut is like a trade path. The microbiota are the cities and towns that pop up along the route. They service the transient populations, the food we eat, and skim a little off the top. The relationship is mostly symbiotic. The transient populations need the boom-towns, the towns need the transients. The community, the body, needs both. However, highway robberies happen and occasionally a town is razed to the ground.\nWith the high concentration of bacteria in the gut, it’s no surprise that many of the emerging microbiome-based treatments are for gut illness. One of the more interesting and successful of these treatments is Fecal Microbial Transplants (FMTs). FMTs are the most effective treatment for C. Dificile, a common infection from hospitalization, and have been shown to help Crohn’s, ulcerative colitis, and IBS patients. To undergo an FMT, a patient swallows a healthy donor’s sterilized and encapsulated stool. Each gram of a donor’s stool contains around a hundred billion bacteria. It’s like a probiotics pill, but with a hundred times more live cultures. Unlike a normal probiotics pill, these bacteria naturally occur in the human body and help digest food, produce vitamins, and absorb nutrients.\nWhile medicinal poop has shock value, it’s just one way microbiome medicine could help with gut conditions. Recent studies link the microbiome to the boom of autoimmune diseases—conditions that cause the body to attack itself—such as celiac disease, rheumatoid arthritis, and diabetes. One study theorizes, an autoimmune disease’s genetic component lies in a microbial gene as opposed to a human gene. If genes that modulate autoimmune diseases are microbial, new treatments for these diseases could aim at the gut. These treatments could range from altering the gut’s bacterial makeup through FMTs and targeted antibiotics to microbiome diets. Microbiome diets—such as the paleo diet—already have many anecdotal proponents. They aim to reduce the inflammation caused by autoimmune diseases, allowing the gut to heal. Science on these diets is very thin, though the amount of people who report dietary relief from autoimmune symptoms are numerous.\nMicrobiome medicine could help with more than just gut conditions. In a recent study, researchers found a reduced risk of heart disease in mice whose microbiomes were drugged with DMB. DMB—a common substance found in olive oil, red wine, grapeseed oil, and balsamic vinegar—naturally prevents the microbiota from creating trimethylamine (TMA). Usually, when microbiota break down carnitine and lecithin—substances commonly found in red meat, fish, and other foods—they excrete TMA. Liver enzymes take the TMA and turn it into TMAO. TMAO then fuels atherosclerosis—a disease causing fat to build-up on arterial walls—which increases the risk of heart disease. With DMB this entire process can be prevented. More research is needed to determine the viability of DMB drugging as a treatment in humans, but the prospect of landing a blow against the world’s number one killer is always enticing.\nRecent research has explored microbiome treatments for the brain. In a series of studies, researchers alleviated symptoms of ASD in mice by treating gut permeability. Among ASD individuals, two-thirds have gut abnormalities, such as an increased permeability in the intestinal wall, also known as leaky gut. Researchers used Bacteroides fragilis to reduce inflammation and heal the leaky gut in mice bred to have ASD-like symptoms. After treatments, the mice showed improvement in communication, anxiety-like behavior, and sensorimotor functions—common symptoms of ASD. Conversely, when researchers injected healthy mice with chemicals to increase gut permeability, they began to develop ASD-like symptoms. While many researchers are quick to point out that more research is needed to understand the viability of these treatments in humans, this study, and others like it, have some researchers speculating that ASD may depend on gut bacteria.\nOther studies suggest the microbiome affects depression, ADHD, dementia, and food cravings. Using the vagus nerve, microbiota send neurotransmitters such as GABA, serotonin, or dopamine to create euphoria or sadness. This bidirectional connection is known as the gut-brain axis. Using the axis, microbiota influence cravings for certain foods that fuel their populations, with neurotransmitters as rewards. Though a great source of instant gratification, feeding these cravings doesn’t always keep us healthy. Our microbiota look out for their best interests. Researchers haven’t pinned down how all cravings work. If we knew, could we use microbiome medicine to alter them? Could we make kale give us the same rewards as candy? Could we all become healthy eaters without the desire for gluttonous foods? Or perhaps, we could drug the microbiota to release neurotransmitters for a natural high? We do not know the answer to these questions, but they represent some of the far-flung futures to which microbiome science could lead us.\nThe research of the Home Microbiome Study, and others like it, offers another hypothetical future. Through their studies we know every microbiome leaves a unique ‘print’ on a room, items, and people. These microbiome prints are distinct from person to person and are automatically implanted by the millions of particles we secrete every hour. Breathe out, and you are giving it off. Sit still, and it seeps out all the same. It’s in our dead skin that falls off each day, our hair, and sweat. At the moment, researchers can detect a change in the occupants of a room after a person has been there for as little as twenty minutes.\nWhile distinguishing one microbial cloud from another is not easy, what potential could this technology offer if perfected? Could forensic science tap into microbiome prints to solve crimes? Imagine you go away for a trip. You get back and your house is picked clean. Nothing is left. You aren’t concerned, you call the local precinct and they send over a scanning crew. They analyze the microbiome cloud left by the burglar. They discover it belongs to a moderately healthy individual in their thirties, who recently had surgery on their right leg. They run the fully sequenced print against collected microbiome data, find a match, and solve the case. Eerie and ethically problematic, but not impossible.\nThe ever-changing microbiome complicates the usefulness of these microbial prints. If they become standard operating procedure, would altering the microbiome become a necessary step for those with identities to protect—whistleblowers, people in the witness protection program, and criminals? We know antibiotics, a new environment, or a new diet can significantly alter a person’s intestinal flora. In the future, will someone burgle a house, then take antibiotics and change their diet to alter their microbiome print?\nWhat does altering the microbiome mean? Smell is determined by the microbiome, it also plays a role in human attraction. Appealing body odor in another person indicates compatible genes for breeding, but it could also indicate comparable political opinions. One recent study speculates we can smell key traits used to form political opinions. By changing a microbiome, a smell, a vast collection of genes, do we change the person and their opinions? Could it change who we are attracted to and who is attracted to us? Could a lover’s scent become intolerable after microbiome treatments? In the social realm, could politicians alter their microbiomes to appeal to voters? Or at least mask their scent with a leftist or conservative cologne?\nThese hypothetical futures are beyond where research has brought us, but as with cell phone surveillance, space exploration, and social media, continuous advances may turn them into reality. We could revolutionize medical treatments, surveillance, politics, and recreational drugs. We could cure diseases and live longer happier lives, or be tamed by forced bacteria injections or bacteria warfare. What would a society that puts the microbiome at the center of their understanding of the human look like?\nYou are wheeled into a hospital. You waited too long for your compulsory monthly injection, so your heart convulses like you’re having a stroke. The doctor’s give you the injection with smiles. Immediately it calms you, alters your microbiome to induce lethargy and apathy. They monitor you for a few days. Your numbed body walks out of the hospital ready to continue your life."}