{"fingerprint": "UpgJq5lEMHHOs7+yQSQcvqhoRSY=", "sitename": "Clarkesworld Magazine", "title": "The Thing With the Helmets by Emily C. Skaftun", "author": "Emily C Skaftun", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/skaftun_03_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Thing With the Helmets by Emily C. Skaftun", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5120 words, short story\nThe Thing With the Helmets\nYou couldn’t talk about the Helmets, which looked pretty ordinary displayed in a glass case in the lobby of the Smash Pad, the converted mattress warehouse where we practiced. They sparkled in all the colors of the rainbow, embossed with punny names and covered in glitter like any well-loved derby helmet, and the only hint of the eldritch Thing that happened (which no one would speak of) was a serious dent in the spider-web-patterned one on the bottom row. Well, that and the heavy-duty iron cage welded around the glass of the display case.\nWhen the Thing happened, I was already skating at the Smash Pad basically all the time on the juniors team, and even a self-obsessed high schooler is going to notice when fifteen members of the league all “move away” or get injured or quit derby in the same month (spoiler alert: they died). The Smash Brats lost a lot of good coaches to the Thing with the Helmets.\nStill, it was nothing like the rollerbugs.\nLet me back up:\nWhen I was eight years old my dad looked me up and down and declared that I was getting pudgy and needed a sport to keep me trim. Thanks, Dad, for the eating disorder.\nBut he’s dead now, so whatever. I guess I have the rollerbugs to thank for that.\nFirst we tried basketball, but I couldn’t catch a ball to save my pathetic life. The same was true for soccer—who’d-a thought catching a ball with your feet wouldn’t be easier than with your hands? I did like kicking the fuck out of the ball, but there was no place for such a one-hit wonder on a team.\nI always liked rollerskating, so Mom thought I’d make a great figure-skater. The failure of that one was entirely my own stubbornness—I hated the cold and threw epic tantrums to get out of those classes. As part of my bargain with her I agreed to try ballet. I sort of liked it, but Dad said ballet was for sissies, and as much as I hate to admit it now, at that point I still cared about his opinion. I did my very best impersonation of a bull in a china shop, tripping the other girls whenever I could, stepping on their toes, and even kicking them with my purposely out of control pirouettes. Besides, ballet class was doing nothing good for my budding body dysmorphia. You think nine years old is too young for bulimia? Then you’ve never been to a ballet class.\nThe ballet studio asked me to leave. Mom wasn’t mad. She was just disappointed. Although (sigh), she wasn’t really that surprised that I’d managed to screw up again.\nFinally, like a dream come true, came roller derby. Despite the tights, it was definitely not for sissies. And it was rollerskating, which I was pretty good at. And, though kicking and tripping were against the rules, sending another girl flying across the track with my “pudgy” hips was encouraged. I was in heaven.\nEleven years, two broken ankles, and about a million failed diets later, I was a proud blocker for the Smash Sisters. Mom no longer made comments about my weight because my blue hair, tattoo (happy 18th birthday to myself!), and facial piercings bothered her a lot more than the extra seventy pounds of fat and muscle I carried around under them. Dad concern-trolled me all the time, “warning” me about becoming diabetic like Aunt Peg and scowling when I ate cookies or ice cream. When he was home, that is. Which wasn’t much.\nIt’s funny how you can lose sight of the wider world sometimes. Inside Roll-a-Way rink we were in our own microcosm; music blaring and fans cheering and the yells of players and coaches echoing and whistles screeching and the bark and chatter of wheels on the wood floor were all deafening. A nuclear bomb could have gone off down in the city, and we would have missed it.\nAs it turns out that’s kind of what happened.\nThe rollerbugs didn’t set off a nuclear bomb. After all, they intended to live on this shiny blue planet they’d found. But they did not intend to share it with us.\nTheir ships tore into the sky, claws hanging from giant metal wings as they ripped their way through the city like a toddler on Christmas morning. They tore the tops off buildings and shook them until all the people toppled out. They rooted through neighborhoods like a bear tearing into a honeycomb, watching us scatter like totally pissed-off bees. Except that they were the ones flying. And stinging. They shot laser weapons that burned flesh instantly to dust.\nIn short, they were sci-fi fucking monsters. They had decidedly not come in peace.\nBetween the second half of the Beating Brontës v. Wicked Stepsisters bout and the first few jams of my team’s bout against the DashWheels, my hometown was more or less obliterated.\nOur first clue that something was wrong was when Roll-a-Way’s roof was ripped clean off. Sunlight spilled in along with great chunks of ceiling tile and lighting fixtures. I was in the sin bin when it happened, and a head-sized bomb of debris crashed right into the NSO timing my penalty, killing him. Missed me by two feet. Dust drifted down through the slanting sunlight like snow, and through it a rollerbug craft descended.\nPeople ran every which way, of course, like ants around a hill. Wails and cries could be heard over the music that now poured thinly out of only a few still-functioning speakers. The exits were jammed. On the track, enough debris had fallen to make skating impossible, and those skaters had all gone down.\nThey came up now, as I had from the box, as the women on the bench had, as the refs had, standing and staring at the new arrival with confusion and wonder.\nOther alien craft were busy blasting all the scrambling people with their death rays, colored beams visible in the air like effects at a rock concert. But the first ship just stared back. After a moment it wobbled to the rink floor like a falling leaf, a ramp dropped out of it like a tongue, and we got our first glimpse of the rollerbugs.\nThe more astute of you might already have guessed what the aliens looked like from the moniker we gave them. We thought they were in costumes at first, because they made no damn sense—wheels for feet, knobby joints, crazy pincher hands on their withery arms, big, bulbous heads and goggle eyes. There was something vaguely insectoid about them, but at the same time it was like looking in a mirror.\nThey rolled out of their ship onto the track, five of them. They were smaller than us, on average, but intimidating. We assumed the toy-looking weapons in their claws would atomize us.\nWe stood there, mesmerized. We’d clumped together, we humans, but our curiosity—and theirs—was a bit stronger than our fear. Our team captain, Scara Thrace, picked her way forward until she was mere feet from the nearest rollerbug, who was also sidling toward us. Was Scara about to become the first ambassador from Earth to another species?\nMaybe that was why she did it—maybe it was like taking your hat off for the National Anthem. Scara pulled out her mouthguard and stashed it under her left bra strap, then she unclasped her helmet and pulled it off.\nThe rollerbugs’ reaction was instant. They jumped back as though startled, started squawking to each other in a cacophony of sharp sounds, and the weapon in that forwardmost alien hand fired.\nScara rained down to the track with all the other particles of dust.\nWe ran for it like scaredy chickens. What else could we do? Skates made it harder to navigate the rubble and ruin of the city, but we didn’t dare stop to change as we scattered toward our various homes. My home was kind of still there, the basement part anyway, and I found Mom hiding in it with neighbor Bruce and his two little kids, watching the end of the world on their phones.\nThank all the Gods I don’t believe in that it was Mom’s day off. The hospital she worked at had been completely destroyed, and the only thing keeping her from running out to the nearest standing hospital to pitch in—and probably get her own self killed in the process—was keeping Bruce from going out after Kel and abandoning their kids. Thanks, Bruce, sincerely, for your lack of chill. Mom can get under my skin, but I’d go crazy if she got herself vaporized.\nWho knows where Dad had been when the attack started. He never came home and neither me nor Mom really minded.\nThings looked bad for humanity. We four spent the night down there in the basement, in a fort made of scavenged couch cushions and bedding, listening to water gushing from the house’s severed pipes and waiting for the rollerbugs to find us.\nThe next day some actual news started to come in through our remaining smartphones, and I’ll be damned if I wasn’t part of it. It seems someone had remained in the rink with us when we almost made first contact, someone with the presence of mind to record the proceedings. It had gone epically viral—like I bet every human being left on the planet with access to a still-working phone and some couple bars of signal had seen it. And it was pretty clear to them, as it had been to us, that the safest way to approach the rollerbugs was to do so wearing derby gear.\nSo we all watched, all of us humans, as an international diplomatic team skated hesitantly out onto the tarmac of some airport like a bunch of Bambis on ice, dressed in their brand-new knee and elbow pads, wristguards, and a rainbow of round helmets. Often, they’d fall. With rare exceptions they looked foolish. It was a sad day for human dignity.\nBut it worked, at least somewhat.\nA ship of rollerbugs spotted them and landed, and the aliens emerged like before, and this time no one took off their helmet and they hesitantly—oh so hesitantly—began the work of first contact.\nIt took months for the aliens and the humans to learn how to talk to each other. I can’t remotely understand how they figured it out, but humans have been learning unfamiliar languages from each other for millennia, so I guess it’s only a little more of a stretch to pick up a few phrases of rollerbug.\nThe upside was that in the meantime they stopped murderizing us. We understood that the peace might not last, but for the meantime we were free to attempt surviving in our demolished cities without getting disintegrated. Which was nice. They were hard months, but humans pulled together to restore things like supermarkets—which were more like farmers’ markets now—and we huddled together in whatever shelters still had a few sides left to keep the weather out. Folks rigged electricity and sewers as best they could.\nMom and I scavenged what we could from the house, which had been thrown into the backyard by one of those pterodactyl-clawed ships, and left the whole shebang alone. Mom wanted us to move into the shelter that had been set up at a local church, but I said Hell no. I pulled Mom along with me to the Smash Pad. It was entirely intact, one of the few buildings in town that was, and my teammates were already hard at work carrying sofas and mattresses and whatever else could be slept on over the torn-up streets to make a shelter of our track and lobby.\nMom’s face practically turned inside out when she saw the place, but I lied and said it had been cleaner before the attack.\nThe lobby is where I found Skaty McSkateface, one of the meanest girls in our league, just kind of . . . staring. It burned me up to see her standing there, not working, when she was always the one squawking loudly about other girls not “pulling their weight” while giving me side-eye, as if this fathlete wasn’t always the first blocker her skinny ass looked to for offense on the track.\n“Hey,” I said. “Barb needs help with the generator, and there’s two different scavenging crews headed out now.”\nHer body turned toward me, but not her eyes. Those were glued to the Helmet that had belonged to Stabrina the Teenage Bitch, the star jammer from the team that had succumbed to the Thing with the Helmets two years ago. “It was my fault,” Skaty said, a bare whisper.\nShe turned to me. “But I can fix it,” she whispered. Her eyes were like ice cubes, if ice cubes could stare right through you.\n“Cool,” I said, and went out to schlep mattresses.\nNone of us had been big news-watchers before the rollerbugs attacked, but once Science Barbie got the generator working reliably, we allocated one hour’s worth of power each night to projecting television news on the screen we used to use for a scoreboard. It used less power than trying to charge everyone’s cell phones, which most of the time had no bars anyway.\nAs the weeks passed, it seemed that our nation’s best minds were making progress on negotiating with the rollerbugs. Usually about half the hour’s news would be footage from the actual conversations, linguists in helmets trilling the phrases they’d learned with subtitles that only occasionally seemed likely to match. Things like: “potatoes are high in fiber and grow in poor soil,” and “humans cannot live without oxygen.” They never did seem to get around to “I’m going to remove this helmet; please do not vaporize me.”\nLife went on. Roller derby did not. We were still a family of sorts—more so even, since now we lived together—but now we were all committee work, no skating. How could we play, with cots on our practice track and Roll-a-Way flattened? Teamwork, drilled into us on the track, turned out to be less effective at solving problems like ants in the kitchen or taking turns at toilet maintenance.\nIt turns out that, like a family I guess, a lot of us didn’t really like each other, or have much in common once our sport was removed.\nOne night, the news didn’t come on.\nOn the scoreboard screen we saw a test pattern. No one even knew what it was except for Try Sarah Topps’s grandma, who immediately started singing that it was “Howdy Doody Time.” Whatever that is.\nWe semi-stampeded out the warehouse doors. We were a few miles from the city’s mostly already destroyed downtown, but we could see the rollerbugs’ ships out there again, tearing it up.\n“Fuck,” was all I could say. Mom was at the city’s nearest semi-functional hospital, so no one remarked on my language.\n“I don’t think it’s Howdy Doody Time,” Sarah said, while Keiko mused, “I guess negotiations hit a rough patch.”\nBut Skaty’s ice-cold voice cut through all the various ironic or panicky responses.\n“Get me the cutting torch,” she said.\nSkaty was the one who—two years ago now—pulled the spellbook out of a box destined for the Smash Sisters’ rummage sale. But it was Stabrina who understood what it was. The glittery spiral-bound notebook looked like something in which one of the Smash Sisters’ little sisters would have written bad poetry about boys or taken half-assed chemistry notes while doodling cartoon faces. But when Skaty started reading from it, sounding out what she thought were nonsense syllables, Stabrina actually covered her mouth. Like someone in a movie. Even for people who’d rubbed their sweaty skin on each other’s in practice, pushing and pulling each other and accidentally copping all kinds of feels, that felt like a violation to Skaty. She licked Stabrina’s palm.\nStabrina pulled her hand away, and the notebook too.\n“Next time use your words,” Skaty said.\n“Words, right,” Stabrina muttered, flipping through the sparkly notebook. “We’re not selling this.”\n“A used notebook? You’re right, we’re not.”\nThe rummage sale pulled in almost a grand for the league, but Skaty never knew where the money went. Maybe that’s where the travel team’s new helmets came from. None of the home teams had separate helmets just for bouting. And no one else had been invited to the decorating party in which they’d lovingly glittered up their new headgear. Skaty told herself they deserved it, pushing herself harder than ever in hopes of making the travel team.\nAt first, everything was great. The travel team could not lose. Their walls were unbreakable, their jammers unstoppable, and it was almost like they could read each other’s minds. They did it all without saying a word. And without laughing. Or smiling. Or sweating\nOr—maybe Stabrina was sweating a little. Anyway, her face looked odd . . .\nThe bout was over. The team pulled their Helmets off and, after a brief moment of blank confusion, finally shouted and hugged and laughed and cried out all the emotions they’d been holding in.\nThat was the first time.\nBy the penultimate game of the season, their faces started to look really weird. Had they painted them before the bout? Maybe their makeup was running, smearing, and that was why—\nThey had no faces. Photographs from the bout confirm it, showing nothing but uncanny holes in reality where their eyes and mouths should have been. The Smash Sisters’ photographer chose to believe it was a film error (despite shooting with digital).\nIt took a lot longer that time for them to remove their Helmets. Skaty went in to hug one of the blockers—she couldn’t remember who it had been, if she’d even known—but the blocker dug low and drove her shoulder right into Skaty’s sternum. Skaty tumbled onto her ass, breathless and gasping.\nWhen she managed to look up again, Carey Barely was offering her a hand, while other members of the travel team were chasing one of their jammers, Quick Asa Bunny. Asa was quivering, juking her teammates like a thing possessed. She seemed to have more than four limbs, they moved so fast.\nAnd then she was gone.\nOne last shout echoed through the Smash Pad, but the loudest sound in the world was Asa’a now-empty Helmet clattering to the concrete floor.\nAsa’s Helmet was the leftmost one on the top shelf of the steel-caged display cabinet that Skaty was now cutting into. Its glitter was two-toned pink, a suggestion of bunny ears on either side.\nWe remaining Smash Sisters gathered around Skaty, watching while not watching (hello, cutting torch) so we all looked either bored and restless with shifty gazes, or despondent, with hands covering our eyes, or reverent, eyes downcast.\nThe only one not covering her eyes was T. Ann Keiko Death, who stood behind Skaty facing the rest of us. “But they still had to make it through Champs,” she said. “Of course they all said they weren’t going to wear the Helmets, that the risk was too high . . . But during the first half of their wild card bout, against some team who shouldn’t have even been at Champs, Santa Fe or—”\n“Albuquerque,” someone interjected.\nThere was a loud clunk as part of the cage gave way. Skaty moved the torch to a different bar.\n“Whatever, anyway, they were getting creamed, so at halftime they put them on. And duh, they won.\n“Fast-forward to the final game of Champs, for the trophy. Those poor refs. There aren’t enough penalties in the rulebook for the shit they were doing. Forget WFTDA, they were in violation of physics. I remember Stabrina just sort of phased through the other team’s blockers and appeared on the other side. They called an Official Review and decided she must have cut the track. Fluke Cage touched the other team’s jammer—just touched her with one finger—and the jammer fell asleep right there on the track. They sent Fluke to the box for a forearm.”\nWith a huge clunk, the front of the cage slipped off the display case. Skaty choked the torch off and flipped her welding mask up, stepping back to let the metal grid fall forward dramatically into the lobby.\n“Your summary was too long, Keiko. Here are the bullet points: we have fifteen Helmets coated in evil magic glitter. Wearing them makes you strong, more or less invulnerable, and gives you superpowers. But only for a little while before it takes over and you die in spectacular and unexpected ways. Does that pretty much cover it?”\n“Ballistic Missy exploded,” Keiko added.\n“Right,” Skaty said. “So what are you waiting for? The first fifteen get to fight the rollerbugs.”\nIs it weird that my first thought was to be proud that I was in the top fifteen for once? I stepped right up, grabbing a green mottled helmet that had belonged to Liz Ard and absently trying it on for size.\nI vaguely noticed Skaty trying to stop me, but by then the Helmet’s power had kicked in and it was hard to focus on what Skaty was saying because she looked like a skeleton. I squinted at the bony arm with its five segmented digits held up in my face and the flesh of muscles and tendons and finally skin built themselves around her bones, and I heard her saying, “Wait. Not until—” but I also heard a mouse nosing along inside the wall of the lobby and wind in the trees outside and the emergency alert system bleating from a radio in a house two blocks away and, far above us, the click and trill of the rollerbugs talking in one of their ships.\nI had the urge to jump all the way up into the sky, right through the ceiling, and get fighting. I had the urge to grab Skaty’s barely protected bones and grind them to dust.\nWith great effort, I pulled off the Helmet.\nMy teammates were looking at me with fear and worry, and just a hint of the scorn/pity mix I got from the skinny bitches anytime I looked tired. So I steadied myself, hiding a headrush bordering on migraine territory, and just said, “Fits great. This one’s mine.”\nAnd then the lobby’s windows exploded and a pair of rollerbugs skittered into the Smash Pad.\nWe fought. I had my Helmet on in an instant and that creepy x-ray vision returned, but this time with, like, subtitles. It was like how I imagine being a killer robot would be. It was this infostream that told me the first rollerbug was about to fire her disintegration weapon at Skaty, but I guess she saw it too because she ducked her head like a charging bull and the beam glanced harmlessly off her Helmet. She tackled the first rollerbug so hard they both flew out through the shattered windows.\nOn the far side of her, Keiko phased out to avoid the second rollerbug’s disintegration blast, phasing back in to clobber it and take its weapon. It twitched on the floor, but I could see its internal injuries and a projection popped up that told me it would be terminated in 10, 9, 8 . . . Meanwhile, Keiko darted out the shattered window in a blur.\nI bounded out the gap after them, spinning in the air like a cartoon superhero, bouncing once before giving in to that urge I’d had earlier to fly. Okay, so it wasn’t really flying, but I did manage to jump all the way up to grab onto one of the rollerbug ship’s swinging claw thingies.\nOut of the corners of my eyes—and from some directions in which I don’t have eyes; thanks, magic evil Helmet!—I saw all the other Smash Sisters springing into action alongside me, flipping cars onto rollerbugs, ripping their heads off, taking their fancy atom guns and turning them back on the space invaders.\nI could practically hear what they were thinking.\nOr wait, I could hear what they were thinking.\nA second rollerbug ship swooped down alongside the one I was swinging from, and my datastream vision told me it was aiming its giant atomizer cannon at me. So I did the only thing you can do in a situation like that, and jumped up onto the main body of the rollerbug ship. The cannon followed me and fired, but I’d already launched myself onto that second ship by the time the first one started crackling out of existence like burning cotton candy.\nSarah was already there, gripping the ship and banging into its hull with her Helmet. One, two, three hits and she was in. I followed.\nIt went on like that, but not for long. With the astonishing power of helmet glitter on our side, the rollerbugs had no chance. We rid our city of them before the evening news.\nBut we didn’t make it back to the Smash Pad in time for the evening news.\nThe war may have been quick as interplanetary struggles for independence go, but it was still longer than your standard roller derby bout, and therefore longer than anyone had ever worn the possessed Helmets before. It’s a beautiful feeling, wearing the Helmet, one I cannot really explain. But I’ll try.\nHere’s the thing. When I put on the Helmet I was twenty years old. Fat. Weird looking. Rocking the community college approach to not knowing what I wanted to be when I grew up while still living at home with judgy parents who were unimpressed with my life choices. The only thing I’d ever been pretty good at was roller derby, and as you may have surmised, I wasn’t even that great at derby. I’d aged out of the Smash Brats two years ago and even with the fifteen best players in the league dead (as I now knew), it still took me over a year to get drafted to the travel team. I wasn’t convinced my teammates actually liked me.\nBut with the Helmets on, it was different. With the Helmet on, I felt like the best in the world, and furthermore, with all of us wearing them I felt I really, truly belonged. Sure, each of us went off on her own to take out rollerbugs in individual feats of glory, but even more often we worked together, coming at them from all angles with vicious, beautiful combo moves.\nWhen it was over, we landed in unison on a rooftop with only a few holes in it. We faced each other, and if there was a moment we could have taken off the Helmets it was right then, our mission complete, having won our bout.\nA piece of information pinged in my head, lighting it up like a flare in a cave: stragglers. Rollerbugs, a handful of them, alive in the city.\nWe didn’t even need to look at each other before off we went.\nOur Helmets told us where to go. They told us everything we needed to know: how many there were (five), where they were (outside Hillside Hospital), and whether they were armed (they weren’t). We swarmed that parking lot like hungry lions, cutting through a crowd of injured people to reach our prey.\nEverything else was muted. I could see everything, inside and out, in extreme close-up or backed out to an impossibly wide view. But none of it was important save the glowing bones of the rollerbugs. We would smash them into dust.\nBut other bones came into my x-ray view, human bones, suggestions of beings that were, inexplicably, protecting the rollerbugs. They said words to us in their human language, words like not a threat, injured, help, but we were so far beyond human that we could hardly understand them. We had squad goals. Destroy. Win.\nWe broke into an offensive formation, screening and hitting our way through the blockers between us and those alien jammers. Nothing could stop us. Except—\n“Helga Prudence Syvertson!”\nThe syllables were familiar. They got inside my head like an itch. I blinked, looking at the bipedal form whose mouth had shaped them. It too was familiar. I blinked again.\nBigger than the itch was the hum of my teammates, urging me on. We had each other, and needed nothing more. I kept going, through the squawking being. “What is wrong with you?” it said.\nAnd that, even more than the other syllables, was familiar. I recognized that as a question this being had asked me many times, over many years. A question I had asked myself. Those . . . words . . . brought a kind of . . . feelings-pain . . .\nNothing is wrong with you, my teammates seemed to say. The Helmet seemed to say.\nAnd oh, oh how I wanted to believe it. But as strong as the pull of camaraderie was on me was, what is wrong with me pulled harder. The datafeed slowed, my x-ray vision got blurry, flickered colors, the real-world vision flickered colors. I heard a wail of mourning coming out of a mouth that was in my face. I reached my hands up to blot out that sound and found the buckle of a chinstrap. Those hands—my hands—pressed into my face and up and up and the pain was so intense I thought my head—my head!—would explode. Ballistic Missy exploded, Keiko’s voice in my head helpfully told me, and then it was all their voices, the whole team, and oh, they were so disappointed in me, and the pain! My head was ripping in two!\nI blacked out. Luckily.\nBut I vaguely remember hearing one last voice as I did. “I’m proud of you,” it told me.\nShe told me. The nurse. Mom.\nI don’t actually know what happened to Skaty and Sarah and Keiko and Barbie and all the rest of them after I lost consciousness, because Mom won’t tell me. She says I don’t need to trouble myself with such ugliness, which of course just makes me want to know more. Did they kill those injured rollerbugs? Did they explode?\nI never saw them again.\nAll Mom will say, over and over again, is that she always knew those roller girls were a bad influence.\n“We did save the world, you know,” I tell her, and she just tsks. Honestly, I think to her the world-saving just barely makes up for our foul language. She hasn’t told me again that she’s proud. Just the opposite: she nags me about going back to school (it’s not even rebuilt yet) and taking up a new hobby to keep active. Something safe, wholesome.\nMaybe cheerleading, she says.\nEmily C. Skaftun is Editor in Chief of The Norwegian American, America's only Norwegian newspaper, and writes about love and monsters in her spare time. Emily is a graduate of the Clarion West Writers Workshop, and holds an MFA in Creative Writing. Her work has been published in Strange Horizons, Asimov's, Daily Science Fiction, and more. If Emily had a magic Helmet, she'd use it against traffic, chewing gum, and rain. Despite the inability (yet!) to vanquish rain, she lives just north of Seattle with her husband the mad scientist and two mini-tigers. She plays roller derby recreationally as V. Lucy Raptor."}