{"fingerprint": "he6xenoCgZ1oWVY2LoKricqYuO8=", "sitename": "Clarkesworld Magazine", "title": "Empress in Glass by Cory Skerry", "author": "Cory Skerry", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/skerry_05_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Empress in Glass by Cory Skerry", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2310 words, short story\nEmpress in Glass\nThe train tracks slashed across the wetlands like a stitched wound, and to Meneja, the sun’s red light pooling on the marsh looked like congealing blood.\n“We’ll be there soon,” said her attendant. Meneja couldn’t remember this one’s name—she thought of the woman as Hatchet, because of her sharp edges. Like one of the white herons that strode through the marsh, she had a sharp nose and a strangely curved neck. It looked as if it was meant to be strangled.\nMeneja didn’t reply. It would always be soon—her life was structured that way, because waiting encouraged doubts. As the progenitor of a new confluence between fashion, music, and art, she couldn’t afford to second-guess any of her metaphorical skydives.\nIf she closed her eyes, she could hear the same rhythm in her veins that would soon be broadcast on her website. It thrummed with the train, a secret song only she could hear, until they drifted into the Martinez Cemetery.\nThe steel contraption slowed so gently that Meneja didn’t realize they’d stopped until she glanced out the window again.\nHatchet helped Meneja into her jacket, which smelled of hotel detergent. She wondered what it would smell like if she had an apartment, if she settled down for even a week and had to choose her own soaps. Could she turn the washing machine dials with glass hands, or would she need to flex her missing joints, like with a zipper on a jacket?\n“This used to be a city, and the only graves were on the hill,” Hatchet said.\nMeneja gazed out at the marsh, studded with thousands of weathered stone monuments, which sunk at angles as the saturated ground merged with the bay; then up the hill, where pale mausoleums protruded from the grass like ticks on a stray.\nHer fingers clicked against the window as she compared the biggest mausoleum to the tip of her pinky. She had instructed them not to sculpt nails—the glass wasn’t meant to be a replacement for her skin, but instead, a window through which to look at the macabre miracle of how her body worked.\nHer blood filled her veins so tightly that she could see them flex with each heartbeat. This was the drumline for her every performance.\nA hand pinched her shoulder, too familiar, too imperative. She glanced over her shoulder to find Hatchet’s lip trembling. Meneja wondered what the tendons inside her face were doing to cause it, if they looked like a bow on a violin, if there was a sound to their fast-paced twitching.\n“Don’t do this,” Hatchet said. “It will be . . . obscene. If my daughter—”\n“If my aunt tried to give me orders, I’d give her personal information to my fans, so just imagine what I’ll do to an hourly if she ever speaks to me like that again.”\nHatchet was silent, her mouth shut like a garage door. Her eyes glimmered with tears. Meneja imagined the sound of the ducts amplified, a tide of salt sorrow washing through enormous speakers to the adulation of millions. She didn’t want equipment on her face, though. She liked her fans to see her while she sang for them, while she bled for them, while she slowly died at the same pace as they did. They looked inside themselves when they looked at her.\nMeneja stood up on her skinless legs. Months ago, just weeks after her hands, she’d paid a plastic surgeon to strip away her epidermis. Now the viscera and muscles of her legs pressed wetly against the glass boots, like raw meat roots growing in slim vases. She was a curved blossom growing up into opacity.\nEven with little rubber pads on the toes and steep heels, even strolling at a delicate pace, Meneja was always afraid she would step too hard and shatter them.\nShe had started with the glass, but now that she had the world’s attention, she yearned to do something with it. Fame was a rocket fuel, and Meneja was still driving a moped.\nNot after tonight.\nWhen Meneja was eight years old, the firemen brought her a stuffed animal. The blanket they’d wrapped her in felt like tape, holding her in place, and she accepted the big floppy rabbit because she felt like she couldn’t do anything else. The flames on the roof of her house reflected on its plastic eyes. When she looked up, there were flames on the eyes of the harried adults, too. Orange and yellow silk, flapping and twisting in a reptilian dance.\nThe orphan who left in the aid car that day was a lump of clay, waiting to become a sculpture. As they drove her away, she burned with guilt, because she was more sad about losing her pets than her parents: the little snake, Princess, recuperating in a terrarium from a run-in with Meneja’s cat, Pony.\nMeneja strode down the stairs and out onto the platform, where there may have been paparazzi a few minutes before the train’s arrival, but her security squad had probably taken care of that in a not-entirely-legal way.\nHer manager was chattering into a phone until he spotted her, and then he hung up without saying goodbye. Armand never used greetings or farewells.\n“We have a hearse so you can stretch out, without the flashbulb assholes figuring out which car you’re in,” Armand said. “It’s a good thing Jacob is with me—you look tired. You can’t be tired tonight.”\n“I don’t feel tired,” Meneja said, and in her mind, she said his next words before he spoke.\n“No one feels the way they look except beggars and dogs,” Armand said. He held out his arm and steadied her as she clicked her way to the hearse. There was a rubber mat draped over the bumper, so she wouldn’t crack her glass climbing in.\nShe lay propped on a pillow as Jacob knelt beside her, wiping and powdering, wiping and powdering. He smelled like mint juleps and stale sex, but she loved his fluttering hands and the way he called her “poppet,” so she forgave him the odor.\n“You’ll make history tonight. This is a show that will be watched long after we’re all dead,” he said.\nNo one spoke of the surgery this time—only of the fact she was allowing them to film it. She thought perhaps they didn’t want to bring it up because it meant they might have to discuss her motives, might have to verbally accept her insanity because she was the famous one, the one who could buy a laboratory and scientists and doctors. They had all learned not to challenge her.\nJust two weeks after her eighth birthday, Meneja was fostered and then adopted by a cousin she’d never before met.\nSusan, who wanted to be called “Aunt,” was a pudgy woman in her mid-thirties already overcome with ennui. Her husband Phil was interested in model airplanes and his job at Boeing and when they could be alone, Meneja.\nEven as a child Meneja recognized that the pills didn’t do any good—not the ones that Susan took religiously, and not the ones that Phil secretly put down the garbage disposal when he thought no one saw.\nOne day, when Phil saw her playing with her dolls, he shut the door to her room. Her Barbie was naked.\n“Do you know how babies are made?” Phil asked. The loose skin under his chin quivered, and he licked the edges of his mouth that barely qualified as lips over and over, like a lizard smelling the desert for danger.\n“A mommy and a daddy,” Meneja replied. She didn’t have a daddy Barbie, so she’d used a plastic tyrannosaurus rex. Her Barbie was lying on her belly, with the dinosaur mounting her from behind like she’d seen the neighbor’s cats do in the grass by the fence.\n“For humans, yes,” Phil said. “But you’re not a human, are you?”\nMeneja regarded him blankly while he asked her about the ships in the sky, about Alpha Centauri and cold-blooded vascular systems. His hoarse whispers rose with each unanswered question until Meneja began to cry.\nPhil’s pupils shrank down, and though he offered no apology or explanation, he left.\nMeneja had already signed all the waivers for the surgery, so they rolled her right in after scanning the ID chip in her wrist for verification purposes. It was a formality; no other woman on the planet had a delta of veins throbbing visibly inside her glass gloves and boots.\nTonight, she was not getting more of her skin peeled away.\nShe hazily said goodbye to her uterus before she slipped under. Later, she would watch the footage and recognize the thought as it passed through her eyes, as vivid and unmistakable as citrine silk billowing in her memories.\nThen her lashes swept down, and the camera moved to the doctors and the eighty-seven-million-dollar implant.\nIn high school, Meneja wrote a report on extinction-level events and the species that had survived or were likely to. Coelacanth, crocodile, tortoise, shark, and dragonfly. They were, in a way, her heroes, and in another way, her kin.\nShe left it on the table, where she knew Susan would see only homework and Phil would see that she’d been listening, that she understood.\nBut after dinner, when Susan went to watch some kind of Idol and Phil helped Meneja with the dishes, he only whispered, “This mammal suit will kill your children. It will cook them.”\nMeneja stared at the potatoes au gratin she’d spit back onto her plate going into the garbage disposal. The mechanical roar drowned out the other things he said, about cold-blooded creatures and life spans and ecosystem collapse.\nShe no longer let Phil see her cry. He would leave the house, and Susan would ask her what she’d done.\nIt took only six weeks for Meneja’s most important performance to heal. Even reputable newspapers who normally avoided celebrity gossip found ways to question the technology that Meneja had used to make herself ready for unorthodox motherhood.\nShe would not be the tiny plastic Barbie, but she had remembered the T. rex with an almost teratophilic intensity.\nHatchet visited near the end of her hospital stay, all the way in Phuket. She brought a bundle of homegrown flowers—carnations just like those that used to grow in Meneja’s childhood yard, before the house burned with her family inside. These were uneven and bedraggled, clearly from a roadside vendor rather than a florist.\n“This is my notice,” Hatchet said. She indicated the pink envelope tied to the bouquet.\nMeneja frowned. A plane ticket to Thailand, just to quit? “Is it because I was short with you?”\n“It’s because I know,” Hatchet said. “I couldn’t sleep, and . . . I spoke to your aunt. About—about her husband’s delusions.”\n“Get out.”\n“Miss, please. I—I care about you. Did he—did he do something to make you uncomfortable with your . . . womb?”\nIn that glistening moment, one that had never happened before and would never happen again, a storm of emotions spun through Meneja. The one that finally bubbled up and subsumed her was grief. “No,” she said, and her tears ran free, and deep inside her, dissipating stitches ached. “He just told me his truth.”\n“But he was ill,” Hatchet says. “He’s been locked up for ten years. You must know the things he said about you weren’t real. You’re not—not trapped in your body. You are your body.”\nMeneja wrestled with the heat in her eyes, the tightness in her throat. The same willpower that had subdued scientists and politicians was now the weapon she turned inward on herself. It was still long minutes before she could respond.\n“Something doesn’t have to be real to feel right,” she finally said. “We are all trapped in our bodies, Hatchet.” The woman opened her mouth, maybe to correct her name, but Meneja didn’t care about real names, and she talked over Hatchet. “Can you leave yours?”\n“No, but I don’t want to hatch amphibians out of it, either. You’re sick, too, only you’re too rich so no one will tell—”\n“People tell me so every day, in every news source, every blog, in thousands of tweets,” Meneja snapped. “Can you leave your body? Can you escape your sagging, shivering meat prison with its leaking holes? If you had the money, if you had the guts, would you at least renovate your cell?”\nHatchet was silent for long moments. “I’m sorry he did this to you.”\nMeneja pushed the call button, but Hatchet left before she could be thrown out.\nThe nurse brought three cold drinks to choose from, and Meneja sipped a fizzy citric concoction while she thought about Phil, and how he had been terrified of her from the first day she stepped into his carefully ordered life, but how he taught her to skate backward even though he refused to steady her with his hand, and how he read her bedtime stories, from a safe distance. About Susan, who finally called the police for a wellness check when she caught Phil putting table salt into the tampons under the bathroom sink to “neutralize the spawn so she doesn’t die before the winter.”\nAbout the state-of-the-art experimental womb she was bearing now, about the firestorm of international debate surrounding her body and what concepts and mores it might be violating.\nAbout sea turtles, nearly extinct in a plastic-soaked ocean, their eggs set upon by record levels of aerial scavengers encouraged by the tourist garbage prevalent along tropical coasts, and the rising number of male alligators hatching every year.\nAbout her white dress, the one Jacob had ordered for her from an up-and-coming designer in Bombay, that she would wear when she presented the first of her tiny mute children to the world.\nCory Skerry is an author, illustrator, and editor who lives in the Pacific Northwest with two rescued dogs and a judgmental bearded dragon. His greatest wish is that when his current meat shell falls apart, science will place his brain into the body of a giant killer octopus, with which he will be very responsible and not even slightly shipwrecky. He pinky swears."}