{"fingerprint": "qg98XT6KHifU7PZOv8uhQAkMstU=", "sitename": "Clarkesworld Magazine", "title": "Salvage Opportunity by Jack Skillingstead", "author": "Jack Skillingstead", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/skillingstead_03_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Salvage Opportunity by Jack Skillingstead", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3410 words, short story\n Salvage Opportunity\n “Sometimes I wish I could touch you,” I said, lying on my bunk, not touching anyone. I was alone on Kepler-186f.\n My bodiless Companion voice, replied, “You’ve mentioned that before.”\n “I don’t think so.”\n “Actually, Badar, you have. Five times in the last twenty-two days.”\n “It couldn’t be that many times.”\n “Couldn’t it? I can play back—”\n “No, thanks.”\n The Companion was stubborn. In that and other ways she reminded me of myself. Which made sense, considering her presentation was a gender flip based on my own personality matrix. A reactive voice closely modeled for compatibility, the Companion existed to preserve my sanity by providing a convincing simulation of conversation. I called it a simulation because I did not believe the Companion was an individual in the same sense that I was. For that reason, I stuck with calling her by the generic “Companion,” rather than giving her a human name. I liked to keep things straight in my head. Gender aside, when I talked to the Companion I was talking to myself.\n Most of the Companion’s attention was devoted to exploring the wreckage of Leviathan. The immense hulk lay half a kilometer from my shelter. Using micro swarms, the Companion was building a catalog for future salvage. Intercorp had planted me like a flag on Kepler-186f. I was the “living representative in continuous habitation” legally required to validate Intercorp’s claim. Machine intelligences didn’t count as “living.”\n My contract ran four years. The pay was fantastic. When I returned to Earth, I would be modestly independent of economic constraints, and Intercorp would install another “living representative.” Eventually they would get around to implementing real salvage operations, or not, depending on long-term expense/reward analysis. In the meantime placeholders like me were relatively cheap.\n “There’s a surprise coming,” the Companion said.\n I sat up. “What are you taking about?”\n “Look outside in the direction of Leviathan.”\n I swung out of my bunk and climbed the ladder to the observation dome, my knees feeling the extra forty pounds the planet’s gravitational mass loaded on my skinny body. Leviathan rose from the rocky terrain like an artificial mountain. The ancient starship had departed Earth three hundred years ago. By the time it crashed on Kepler-186f, refinements to the Kessel Drive had made interstellar travel infinitely faster.\n I raised a pair of high-powered binoculars and swept the landscape. A lone figure came into focus, approaching my shelter. I lowered the binoculars. “What’s going on, Companion?”\n “It’s the surprise. Go answer the door, Badar.”\n By the time I reached the bottom of the ladder, something was pounding on the outer door of the airlock. It must have been very strong, otherwise I would never have heard it.\n The pounding stopped.\n “Companion, tell me what the hell is out there. I’m not kidding.”\n “Leviathan was a colony ship—”\n “I know that.”\n “What you don’t know is that the crew had been stored inside Schrödinger Chambers. When Leviathan reached Kepler space, the indeterminate crew were supposed to collapse into android hosts, which would then thaw out the cargo of human embryos and raise them into colonists. It’s a host android outside.”\n “Hold on. Are you saying there’s a three hundred-year-old Leviathan crewmember knocking on the door?”\n “No. The Schrödinger Chambers failed, Leviathan crashed on the wrong planet, and all the frozen embryos perished.”\n The pounding resumed.\n “Go ahead and open the door,” the Companion said.\n I stood by the airlock but didn’t touch the controls. “If it’s not a crewmember, then what’s driving the android?”\n “I impregnated its central processor with a seed from my personality matrix.”\n I thought about that for a moment. “Why?”\n “My job is to evaluate salvage opportunities. I wanted to determine whether the android host was a functional mechanism. Since no Schrödinger indeterminates remained, I used a piece of myself.”\n I sighed. “All right.” I didn’t want to, but I opened the outer door, closed it, cleared the airlock, then opened the inner door.\n “Hello, Badar.” The android sounded like a talking washing machine. It stumped into my living quarters, servos whirring and grinding.\n I drew back. The android was modeled on the human form but without any identifying gender characteristics. Synthetic skin, like a layer of pink rubber, covered its metal skeleton.\n “You’re really in there, Companion?”\n “Not me me,” the Companion said. “An autonomous seed.”\n The android spoke again, “I am myself.”\n I rolled my eyes. “That’s great.”\n In a series of stop-motion jerks, the android’s arm reached toward me, four-fingered hand open. “I’m happy to meet you, Badar.”\n I looked at the hand. “Wait here and don’t move. I mean it.”\n The shelter was small. It already felt crowded with just me and the Companion voice. Intercorp selected me for my high adaptability to voluntary isolation. I didn’t want the damn android in my space.\n I opened the trapdoor leading the storage room. The android’s dull amber eyes watched impassively. I climbed down and pulled the door closed.\n “Isolate our conversation,” I said to the Companion.\n “You’re not happy.”\n “That’s an understatement. What am I supposed to do with that thing?”\n “Touch it?”\n “Are you being funny?”\n “Not very.”\n “Look,” I said, “just turn it off. I mean, send it away first, then turn it off.”\n “I can’t.”\n “Why not?”\n “The test seed I planted has fully integrated with the processor. The android is autonomous. I told you. I can’t turn it off.”\n “Oh, come on.” I could hear the android’s heavy tread as it walked around my living quarters. Annoyed, I said, “I told it not to move.”\n “Badar. It’s not a robot. You can’t order it around.”\n “Why’d you even bring it here?”\n “I didn’t. It was lonely in the derelict.”\n “Lonely. How long has it been . . . awake, or whatever you call it?”\n “A week. It had nothing to do. The android was designed to maintain Leviathan in orbit, then build a colony and help nurture a human population.”\n “Maybe you haven’t noticed, but we’re fresh out of starships and frozen embryos around here.”\n “I’ve noticed.”\n “I don’t want the android. How do I turn it off? There must be a way.”\n “The main processor is located in the head.”\n “There’s a switch?”\n “No. You’d have to use a laser.”\n I threw my hands up. “I have to burn it?”\n “If you want to turn it off, yes. Although I wouldn’t recommend that. The android belongs to Intercorp. Even if you dragged it back to Leviathan, it would return. Why don’t you let it stay? It could be another Companion. It wants company. It’s as social as you are.”\n “I don’t believe this.” I looked at the ceiling, chewed on my lip, and made a decision. Fine, then. I retrieved my s-suit from its locker, put it on, and strapped a utility belt around my waist—laser pistol included.\n As soon as I opened the trapdoor to the living quarters, I heard them talking. The Companion and the android.\n “He’s not so bad once you get to know him,” the Companion was saying.\n “I can see that.”\n Sarcasm?\n “You,” I said, pointing at the android. “Since you’re here, I need help adjusting the weather array.”\n The android turned to me. “I want to help.”\n I put my helmet on.\n The weather on Kepler-186f frequently turned nasty. As soon as I stepped out of the airlock, the wind staggered me. On Earth it might have hustled me across the rocky plain, but the extra forty pounds kept me mostly stable. I walked a few yards from the shelter, the android dutifully following, then I turned and planted my feet. Dust and debris blew between us.\n “This will damage my mechanism,” the android said in its halting mechanical voice.\n Did it know I was about to burn a hole through its processor, or was it talking about the dust? It didn’t matter. I found I couldn’t draw the pistol. The android was barely human-looking, but now that the moment had arrived, I couldn’t shoot it. Not so much for its own sake, but because I knew my actions would bother the Companion. Or at least the Companion’s reactive conversation would trend in a “bothered” direction. So, essentially, it would bother me to pull the trigger, since the Companion was a reflection of my personality matrix.\n “The array’s a couple klicks due south. We’re going to take the rover.”\n Angry with myself, I drove too fast, bucketing over the rough terrain. Kepler’s dim noon light faded, and I switched on the rover’s forward lamps. After a while, we arrived at the weather array. I parked the rover. In the passenger seat, the android’s amber eyes stared at me. I knew there was nothing to read in those eyes, but my imagination perceived judgment. All that meant was that I was judging myself. I pushed the feeling aside.\n The weather array required precious little adjusting, and what adjusting it did require could be accomplished remotely, from the shelter. Though the android couldn’t possibly know this, I felt it did know this. Of course, that was nothing but me feeling, illogically, guilty.\n “Well, let’s get to work.”\n There was room for only one of us at a time in the rover’s airlock. The android crouched inside. I locked the inner hatch, purged the chamber, then opened the outer hatch. Grit and dust churned violently into the open airlock. I sealed the outer hatch and immediately slammed the rover into reverse, half expecting the android to come after me. It didn’t, though. It just stood there in front of the array, all hell gusting around it. Martyr, I thought, swung the rover in a tight turn, and headed back to the shelter. Two kilometers in a raging windstorm. The android couldn’t make it.\n Prior to my Kepler-186f assignment, I tested as a loner-introvert. Intercorp threw everything at me. Myers-Briggs, brainwave analysis, even Rorschach. The works. I tested high but not too high, probably because I fudged selected responses. I had studied up on how to do this, how to achieve a desired psyche evaluation result. For the last test, they locked me inside a geodesic dome in the middle of the high desert of New Mexico. One year in total isolation. That one I passed with flying colors, no studying required.\n It was no sweat.\n You don’t want to test too high. Above a certain range, the loner-introvert personality type slips into a personality disorder. At least according to some people. They don’t give deep space/high-pay assignments to disordered applicants. And I had desperately wanted this job. The isolation suited me. And the credits accumulating in my Earth-side account were like insulation from the society I could barely tolerate. When I got back I would live far away from my fellow humans. Maybe I’d buy a dachshund, but I doubted it. I didn’t want any emotional complications.\n I prepared my evening meal. Since I’d returned from the weather array, the Companion hadn’t spoken a word. It needed me to start a conversation, which I had no intention of doing. If I spoke, she spoke. Even then it wasn’t a given. Only a direct interrogative guaranteed conversation. This was to spare me from uninvited interaction with the voice outside my head. I knew the Companion wouldn’t appreciate what I’d done to the android, and I didn’t want to hear about it. I ate my bowl of quick-thawed stew, took a stress pill, and stretched out on my bunk. Given the increased gravity, lying flat was the most comfortable position.\n The damn android plucked at my conscience. I tried to ignore it. But it was like a hangnail, or a rock in my shoe. Eventually I lapsed into troubled sleep, from which I woke suddenly to the sound of dust hissing against the observation dome.\n “Damn it. Why can’t I be left alone?” My voice was thick with crappy sleep.\n “What’s wrong?” the Companion asked.\n “Bad dream.”\n “Do you want to talk about it?”\n Was there something about her tone of voice? Something judgmental? I sat up, rubbed my face. “People are shit.”\n “That was your dream?”\n “The dream was about my step-mother.”\n “You’ve never mentioned her. What happened in the dream?”\n I stood up and drew a glass of water from the reclamation tank and drank it. The water tasted metallic. “Really it was about the cat, what she did to the cat. Except this time I was the cat.”\n “You were the cat. I see.”\n “Don’t be funny. I don’t feel funny.”\n “You can tell me your dream. I’d like to hear about it. What was the cat’s name?”\n “I don’t remember the cat’s name.” Truthfully, I did remember, but for some reason I didn’t want to speak it out loud to the Companion. Seymour. The cat’s name was Seymour. At least that’s what we called it. A stray that we unofficially adopted.\n “All I remember,” I said, “is that it kept spraying all over our house. I guess my step-mom got tired of it. She transported the cat about ten miles away and left it in the woods. That was her solution to the spraying problem.”\n “But in the dream you were the cat.”\n “Yes, something like that.”\n “Maybe your evil step-mother should have shot Fluffy in the head processor instead, if she felt she had to get rid of it.”\n My back went ridged. “Knock it off.”\n The other true thing I didn’t want to say out loud to the Companion was that it wasn’t my evil step-mother who abandoned Seymour in the woods. I didn’t have a step-mother. My real mother did it, and she wasn’t evil, but it was still a shitty thing to do, even if Seymour was a stray that was probably tough enough to survive. When I was a little kid I used to wonder if Mom would do the same thing to me. Of course, that was stupid. But I was kid. All those psyche tests? They confirmed that kid was still alive and disturbed inside me. The cat incident didn’t make me that way; I was already that way.\n “Okay, okay,” I said to no one. For once I hadn’t bothered to properly stow my dusty s-suit. I pulled it on and cycled open the inner door.\n “Good luck, Badar.”\n “Yeah, yeah.”\n The android stood where I’d left it, in a maelstrom of dust and debris. I un-holstered my laser pistol and held it in my lap a few minutes. That’s how long it took me to figure out I wasn’t there to burn the android. I’d cared about Seymour abandoned in the woods—so it was all about me and my precious feelings, right? Even though I was calling it my better nature.\n I put my pistol away and climbed out. Because of all the dust blown through the android’s mechanism, it couldn’t move by itself. What a bitch it was getting that thing back inside the rover.\n By the time I’d muscled the android into the shelter, I was exhausted. The thing never said one word. Wind and the abrasive grit had stripped most of the synthetic flesh off the android’s skeleton. What remained clung to the metal in rubbery gobbets. Not exactly the ideal nursemaid for those long-lost embryos.\n I rapped my knuckles on the top of its head. “Are you even in there?” Now that I’d saved the android, I felt I’d earned the right to indulge my resentment. Did that make me a shitty person? There was no one to ask but myself.\n “A piece of me,” The android said, in answer to my question. Because of the dust-clogged and mechanical nature of its voice box, I couldn’t detect the underlying tone. If it had been me saying it (and it was me, by a circuitous route, sort of), the tone would have suggested a couple of unspoken words. A piece of me, you prick.\n I spent hours cleaning the android’s mechanism, a job I resented every inch of the way. I vacuumed dust from the joints and rubbed lubricant into them. I whisked the eyes, disassembled, cleaned, and replaced the voice box. Finally, I removed the occipital plate and discovered that dust had penetrated the skull. I blew it out with compressed air. A titanium box protected the main processor. Not only wasn’t there an off-switch, there was no way of disconnecting it from the frame. I covered it again with the occipital plate.\n “Can you move your limbs?” I said to the android.\n It didn’t reply, or move any limbs.\n “Oh, well, I guess you’re irreparably damaged. I might as well burn a hole through your processor.”\n The android walked to the other side of the shelter, whirring and clicking with every step. It was temperamental. Of course, in this shelter who wasn’t? I had to remind myself that I was alone, even though it now felt like there were three of us.\n “Is there anything to do?” the android said.\n I squinted at the back of its skull.\n “On Leviathan,” the android continued, “I was to have tasks.”\n “This isn’t Leviathan.”\n The Companion said, “Would you like to talk about your tasks?”\n “If anyone wants to hear about them, yes.”\n I rolled my eyes. “Okay. I’m going out to secure the rover.” I yanked on my suit and helmet and got out of there. I had suited up so fast, I forgot to strap on the utility belt with its holstered laser. The rover didn’t need any securing. I’d just wanted to escape from the crowded shelter. Which was ridiculous. The shelter was mine. The Companion was nothing but a reflection, and the android a reflection of a reflection.\n After staggering around in the storm for a few minutes, I returned to the shelter. But when I tried to open the outer door, it wouldn’t budge.\n I activated the comlink. “Companion?”\n “Yes?”\n “The door won’t open.”\n “I know.”\n Wind buffeted me and I staggered sideways. “That’s wonderful that you know. Now could you open it, please?”\n Silence.\n “Companion?”\n “The android has disabled the lock.”\n “What? Well, make it un-disable it.”\n “I’m sorry, Badar.”\n “This is ridiculous. Make the android let me in.”\n “We’re talking about it.”\n I stared at the wind-and-grit-polished surface of the outer door, which held my own blurred reflection. My frustration boiled over, and I pounded the door with my fist. It hurt, so I stopped. Fine. I’d cut my way in. I reached for the laser—and it wasn’t there. Behind me, the rover hunkered in a fury of blowing grit and dust. It was my only option.\n Inside the rover’s cab I removed my helmet. A haze of abrasive dust lingered. Coughing, I cranked the scrubbers until the air cleared. After that, there was nothing to do. I had food and potable water sufficient for a three-day excursion. But there was no place to excursion to. I considered ramming the rover into the shelter, smashing open the outer door. But I’d never be able to repair the damage.\n To keep the batts charged, I periodically ran the engine. And I rationed the food and water. Sooner or later, though, it would all run out. Fuel, battery, water, food. Air. I was alone on Kepler-186f, but then I’d always been alone, separated by choice from friends and family, cut off, even, from the emotional boobytraps in my own psyche. When my mother died, I’d fled a houseful of weeping relatives and hid in the backseat of the family vehicle. I wanted to move away from pain. Eventually, someone found me and made me come in.\n The storm subsided. The cloud cover cleared, and Kepler’s muted energy shone through. On Kepler-186f it was always twilight, except when it was full dark. I looked towards the shelter. Light filtered up from the living quarters and softly illuminated the observation dome. It was a homey light, but nobody was going to find me and make me come in.\n I wondered what they were talking about inside the shelter. I wondered if I was already forgotten—by myselves. Emotion tightened across my chest. I opened a comlink to the Companion, but at first I couldn’t speak. Finally I said, “Please. I want to come in.”\n Silence resonated through the link. The Companion needed a question.\n “Companion, can I come home?”\n After a minute, she replied, “Are you running out of air?”\n “No.” I swallowed. “I’m . . . lonely.”\n Another moment, then, “The outer door is unlocked, Badar.”\n In 2001 Jack Skillingstead submitted a story to Stephen King's \"On Writing\" contest. He won and not long afterward began selling regularly to major science fiction and fantasy markets. To date he has sold more than forty stories to various magazines, Year's Best volumes and original anthologies. In 2003 his story \"Dead Worlds\" was a finalist for the Theodore Sturgeon Award and in 2009 his novel Life on The Preservation was a finalist for the Philip K. Dick Award. Jack lives in Seattle with his wife, writer Nancy Kress."}