{"fingerprint": "Ee/0MKl0MzIB9AkVrROj21WvLXo=", "sitename": "Clarkesworld Magazine", "title": "Syria, Time, and Typewriters: A Conversation with Jack Skillingstead by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/skillingstead_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Syria, Time, and Typewriters: A Conversation with Jack Skillingstead by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Syria, Time, and Typewriters: A Conversation with Jack Skillingstead\n Wishing to change the past is a common thought we all entertain. Whether it is to right a wrong, avoid regret, or to extend a kindness we didn’t have time for at the moment, hindsight provides a view of the good, the bad, and the murky. Messing with timelines has long been a popular topic for authors, but Jack Skillingstead’s latest book takes a whole new approach to crossing the streams.\n Olivia Nikitas is a hardened wartime journalist covering the waning moments of the war in Syria. While in Aleppo, she finds herself in dire circumstances with bullets flying and friends bleeding out on the floor. Something the size of a small bug slashes into the back of her neck and everything changes. The Chaos Function is an exciting genre-bending novel that explores the future and what it means to change the past.\n Jack Skillingstead is the author of a number of novels and over forty works of short fiction. His work has appeared in four Year’s Best Anthologies and has been translated into a variety of languages, including Russian, Polish, Czech, Spanish, French, and Chinese. He was one of the winners of Stephen King’s “On Writing” Contest and has been nominated for the Philip K. Dick Award and Theodore Sturgeon Memorial Award. His latest novel The Chaos Function was released by John Joseph Adams/HMH on March 19th.\n When and why did you get into writing?\n My earliest memory of wanting to be a writer goes back to when I was twelve years old. I remember reading Galactic Derelict, by Andre Norton. I’d never seen, or heard, the word “Derelict.” I looked it up in the dictionary. After that, I went around repeating the word. I still like to say it out loud. So, there was a sensitivity to words right from the start. I did that kind of stuff all the time. Words were always more to me than merely their dictionary definition. Also, around that time I was watching a lot of Star Trek, and I used to take note of who wrote the scripts.\n Even then, I knew the writing was the most important element. In junior high school, I worked on the school newspaper, but all I ever wrote were short fiction stories. I remember how clumsy my writing seemed in comparison to the work of real writers. I just ached to be able to do that. Once I even copied the first paragraph of a Howard Fast story (yes, Fast wrote some science fiction) and tacked it onto one of my feeble efforts. Or maybe it wasn’t as feeble as I thought, since the teacher didn’t seem to notice the difference. An attack of conscience later drove me to collect every copy of the issue in question and destroy them. So that’s sort of the “when” part of your question. As to the “why” part, I absolutely can’t tell you. The truth is, I can’t really remember a time when I didn’t want to tell stories.\n The Chaos Function is action packed. How do you approach writing an action scene?\n You approach an action scene the same way you approach any other scene. The same issues of narrative rhythm, character, and description are present. The pace within a scene may be different, but it varies. Action arises from a series of choices, the first being: what kind of book do I want this to be? In an action scene, or any scene, you look very closely at the details and then record them to the best of your ability. In a novel like The Chaos Function, where my intent was to keep the story rolling at freeway speed, I tried not to get sidetracked into meditations on character. It can be interesting, but it also tends to slow down the pace. I tried to always demonstrate character in action.\n Your most recent novel pulls from current events and extrapolates into the future. What was it about the current events that inspired you?\n Inspired is an interesting word in this context. You might instead ask what appalled me. Like everyone else these days, I find myself continually bathed in news, information, and conflict. Most of the news is bad. As a human being you want to do something about it. As a writer, you want to understand what I would call the patterns of disaster. My book is all about patterns of disaster.\n A major theme of your book is remaking the future by changing the past. Why do you think changing the past is such an enticing theme?\n Who doesn’t have regrets? Who hasn’t asked themselves: “If only . . . ”? Our lives are like a game show: Choices and Consequences! Most of us try to make the best choices we can based on available information. But we’re all human and sometimes we choose poorly even when we know we’re choosing poorly. Later, when the Consequences kick in, most of us, I think, would relish the opportunity to tweak the past in order to fix the present mess we find ourselves in. With The Chaos Function, my character Olivia actually finds herself in possession of such a power of retroactive choice modification. Things do go as she might of hoped they would.\n Olivia Nikitas is a tough journalist, but over the course of the story, we see her open up to the reader and other characters. Her knowledge and experience of war-torn areas are central to her worldview. She feels incredibly real. Did you research any real-life journalists who specialized in being embedded in war zones?\n I’d been reading about the civil war in Syria, trying to understand what was going on and why. I wanted to know more than what I was getting on various news feeds, and that meant doing some deep reading. At the same time, the book was simmering in the back of my mind. But I didn’t regard the two interests as being related—at least, not early on. That changed when I encountered Francesca Borri’s excellent Syrian Dust. Borri became a journalist specifically to cover the war in Syria. She also did books on Kosovo and the Israel/Palestine conflict. These books naturally led me to other modern-day war journalists, like Janine di Giovanni.\n In Ghosts by Daylight she writes movingly not only about her experiences in what I would call disaster zones, but of the effect her work has had on her personal relationships. Somewhere in all this reading light bulbs started coming on, illuminating the overlapping territory between my still-forming ideas for the book I was then calling, The Probability Machine, and the reporting of these journalists. Why would someone repeatedly put themselves in these dangerous situations? What did it do to one’s psyche? Could you enter these disaster zones with an open heart, or must you armor yourself against every horror the world has to offer? Olivia has already formed the habit of wearing emotional armor before she ever enters the disaster. What were the consequences of always wearing emotional armor? By now Olivia Nikitas had stepped onto the stage, a fully formed individual in her own right, and The Chaos Function built its narrative web around her.\n Being the near future, your novel features some advanced technology. What are some current technologies that inspired things like advanced screens and drone insects?\n While it may not be an absolute given that we will be walking around with smartphones ten years from now, it’s a pretty safe bet that we will be tethered to the Internet by some kind of personal technology. I thought about going the wearable route, and there’s a little of that in book, but mostly my characters interact with their smartphones in ways we are already familiar with. The phones are fancier but essentially the same. As for drone insects, they already exist and are in the hands of our spy agencies. It seemed reasonable to project forward a little and describe the “flies” that Olivia and other journalists deploy to obtain difficult footage.\n Your characters are well rounded with their own desires and motivations. Do you start with the characters’ personalities and see how they fit within your story or the other way around?\n It’s different every time. Olivia’s character in The Chaos Function is informed by the narrative engine, and vice versa. One would not exist without the other, or so I imagine.\n You’ve mentioned a number of times that writers often are looking to “scratch an itch” when writing a book. What was the itch that ended up as The Chaos Function?\n For a while now I’d wanted to write a book that slipped across genre boundaries, something that people who don’t normally read a lot of science fiction might find accessible and entertaining. And I wanted to see if I could do this using a solid science fictional premise that would also please my existing audience. Easier said than done, right? Anyway, that was the itch.\n How has Seattle influenced your work?\n I’ve lived here, except for a few wandering years, my whole life. Hence, I have been, at least in part, formed by this very distinct region of the country. At the same time, I don’t regard myself as a regional writer per se. The influence must exist, but I don’t think I can analyze it. Certainly, I’ve used a lot of local settings in my books and stories.\n You’ve said on occasion that some of your books were a bit of a struggle to produce. Was The Chaos Function a challenge or did all of the puzzle pieces fall together?\n The struggling part of Chaos occurred, for the most part, before I started writing. In this book I spent more time sorting out story elements ahead of time. Of course, I didn’t sort them all out. I’m just not that kind of writer. But going in I knew more than I generally do, and that helped. I did three drafts in almost exactly one year, which is fast for me. By the way, I’m not saying there were no surprises along the way. One exciting development didn’t fully emerge until I was well into the final edits. There is a serendipitous element to creative work that can’t, and shouldn’t, be planned for. Planning ahead of time helps with structure, but the really good stuff is what appears unexpectedly, and you can’t plan the unexpected.\n What projects are you working on next?\n I’m writing a follow-up to The Chaos Function. The working title is The Extinction Tactic. It’s got a dynamite core idea that I’m not going to tell you. I’ve been working on the book since last May.\n What does your writing process look like?\n Once I’m writing, whether it’s a short story or a novel, I show up every day. I used to set minimum page goals, a habit I formed when sheets of paper actually rolled out of various typewriters. Three pages a day, five pages a day. In recent years I go by time-at-the-desk, rather than absolute page or word counts. For me, the writing has to proceed at its own pace and not some arbitrary daily accumulation. There are times when you have to force it a little. But like physical exercise, if it hurts too much, you’re doing something wrong. What’s the point of writing fast, if when you’ve finished the first draft it’s a tangled mess beyond untangling? Also, I used to be more freewheeling about the process. You know, just sit down and write, without much forethought. Nowadays I recognize forethought as essential. The only danger—and it’s a real danger—is I might forethought my way right out of being interested in actually writing the story.\n Do you still use that Smith Corona Typewriter?\n Hell no! I’m nostalgic for typewriters sometimes, but I would not want to work on them again. However, they did serve a very useful function in my life as a writer. They taught me to pay attention, close attention, to every sentence. Especially when typing a clean copy for submission, the cost was heavy if you made more than a couple of mistakes on a given page. I had a rule of three. Three xxxed out or white-outs and I had to retype the whole page. It was painstaking and aggravating. But it taught me to be a better writer. It taught me to slow down. Which is what I say to young writers, if they happen to ask for my advice. What’s the hurry? I say. Take your time. Dwell on the details. That’s where you find your voice.\n You mention that part of your path to becoming a published writer meant you had to “get organized.” What did that entail? Spreadsheets?\n Ahead of my first pro sale I did make a kind of spreadsheet out of poster board. Excel existed but I wanted a big thing I could pin to the wall over my desk. Part of the difficulty of succeeding in this business is the quite natural reluctance on the part of writers to absorb the pain of rejection. And even though I believed then, as I do now, that rejection can make you a better writer by teaching you the value of rewriting and perseverance, I was, and am, no different than anyone else: I HATE GETTING REJECTED.\n The problem with that, is that you tend to give up on stories too soon, or, these days, you might opt to self-pub and call it a day. My poster-board spreadsheet featured a top horizontal row of ten short stories. Vertically on the left side of the board I listed ten fiction markets. I figured ten markets per story would be giving the work a fair chance, at least. I spent a nice weekend evening with my daughter making labels and addressing envelopes and printing copies of the ten stories (e-subs were not a thing back then). This was to head off my reluctance to submit a story that had already hurt my feelings by getting itself rejected a couple of times. I had ten copies of each story already sealed in 9 x 12 envelopes and ready to go, so there was no work and no time to second guess between submissions. I also bought one of those office spikes on which to impale all the rejections I just knew were coming my way. Anyhow, the preparation itself must have appeased the gods and demonstrated my intent to not go away, because almost immediately I started selling. First a couple of stories to a small press in the Midwest and then “Dead Worlds” went to Gardner Dozois at Asimov’s—and I was on my way at last.\n Where does Stephen King’s “Not bad” comment rank on your list of reviews you’ve received?\n At the time, it meant a lot to me. Winning that contest and seeing my little story posted on King’s website was a surreal experience. It was as if a door to the bigger world I longed to inhabit had finally and unexpectedly cracked open. The weirdness of Stephen King reading my story—right away I wished I had done a better job. Because, you know, I could have.\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}