{"fingerprint": "u88s2BEuHn4Wqc6GhL9Cj5Qgc/A=", "sitename": "Clarkesworld Magazine", "title": "The Latest Apocalypse: Popular Music and the End of the World by Brian Francis Slattery", "author": "Brian Francis Slattery", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/slattery_04_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Latest Apocalypse: Popular Music and the End of the World by Brian Francis Slattery", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nThe Latest Apocalypse: Popular Music and the End of the World\nAmerican popular culture—science fiction and otherwise—feasted on the Cold War’s stew of paranoia, incessant competition couched in terms of progress, and threat of mutually assured destruction right up until the tension could, without a doubt, be declared over with the breakup of the Soviet Union in 1991. In retrospect, it’s pretty amazing that Soviet-phobic films like The Day After (1983) and Red Dawn (1984) got made when they did. In the ’80s the Soviet Union wasn’t nearly the threat that it had once been. By the time the U.S.S.R. was in obvious decline, we’d been treated to four decades of apocalypse and post-apocalypse, in movies, television, books, and even music. Bill Haley and the Comets’ “Rock Around the Clock”—the 1954 song often credited with putting rock ’n’ roll on the map—was first issued as the B-side to “Thirteen Women (and Only One Man in Town),” which tells the story of a man who has a dream similar to what happens to Burgess Meredith’s bookworm bank-teller in the Twilight Zone episode “Time Enough at Last,” except that instead of books he’s left with after the bomb drops, it’s women. And his glasses don’t break.\nJust in case you’re the last person on earth who doesn’t know what a double entendre is, the music of “Thirteen Women” clues you in to what the lyrics are talking about: The saxes are swinging, the fingers are snapping, and the guitar makes catcalls. Not to be outdone, Dinah Shore re-recorded the song with a Cuban pulse as “Thirteen Men,” and Ann-Margaret recorded Dinah’s version as a cocktail number. Also equating the split atom with sex (and also from 1954) is Fay Simmons’s “You Hit Me Like an Atomic Bomb.” In addition to its flagrant metaphors, it has one of the most shameless—read: shamelessly terrific—organ parts ever heard. By 1957, the metaphor had been used often enough that it started to get kind of meaningless. The Five Stars’ “Atom Bomb Baby” of that year uses the couplet “Atom bomb baby, little atom bomb / I want her in my wigwam”—five times in the same song.\nIt’s easy to understand how the atom bomb got sexy. The musicians of the time were working in new, popular genres that were genetically engineered to party, and those artists were trying to make money. Sex sold then as well as it sells now, and people have never liked to pay for bad news. But it’s also confusing. If you’re trying not to upset people, why mention nuclear destruction at all? The reality of what nuclear war was—what it could be—was pretty fresh in 1954. Our atomic attacks on Japan were only nine years in the past. A year after that, John Hersey’s Hiroshima, an account of that city’s devastation, was a bestseller and was broadcast over the radio. Three years later the Soviet Union began testing its own nuclear weapons. People knew what was going on. So if the songs were jokes, they were dark ones, following a tradition that may have been started by Slim Galliard’s “Atomic Cocktail” in 1945.\n\"Atomic Cocktail\" is small-combo jazz with an easy swing, the sound of skilled players relaxing in the conventions of a genre over thirty years old. And where Bill Haley is all gee-whiz-can-you-believe-my-luck energy and enthusiasm—he and the Comets recorded \"Rock Around the Clock\" in the same studio session that produced \"Thirteen Women\"—underneath Galliard’s cool delivery lurk some pretty knowing, sinister lyrics: \"When you see it coming, grab your suitcase / It’ll send you through the sky like airmail—BOOM—atomic cocktail.\"\nIssued by the record company Atomic, Inc., the record’s blood-red label features what looks a lot like an explosion on the upper half, which then sends black lines sweeping along the inside curve toward a tiny human figure on the bottom. Arms outstretched, hands up, the figure might be partying; it might also be on fire and disintegrating. The same dichotomy is in the song: The music tells you to take it easy, but the lyrics tell you to run for it. You could say “Atomic Cocktail” charted the landscape for how popular music could deal with the atom, and if Bill Haley and Fay Simmons, representing rock ’n’ roll and lounge, went all in for the party, other artists—and other, older genres—took a look at what they thought the future might hold. And they weren’t so quick to laugh.\nThe fight about whether the ’50s-and-’60s folk revival was really folk—which is really a fight about what the word folk means—is never going to end. But the gist of that genre’s narrative is hard to argue with: Starting in the late ’40s, a bunch of people started to get interested in the music that poor Americans had played a generation before them. These revivalists both resuscitated that music and wrote their own songs harkening back to those styles as best they could. They shouldered for themselves the weight of history that came naturally to blues, jazz, country, and gospel, and under that heavy load, simple partying was impossible. Sarcasm wasn’t, though, as Bob Dylan’s 1963 “Talking World War III Blues” attests.\nIn the song, Dylan’s approach is less “Thirteen Women” and more “Atomic Cocktail”—or even The Crown City Four’s 1960 excoriating barbershop quartet-meets-marching-band cut “Watch World War Three (on Pay TV).” The conventions of an older musical genre gave Dylan the sarcastic tools he needed to approach his subject head on. But the young Dylan couldn’t escape the sheer anxiety, either. According to the liner notes for The Freewheelin’ Bob Dylan, “A Hard Rain’s A-Gonna Fall” was written in 1962 during the Cuban Missile Crisis, and Dylan is quoted as saying that “every line in it is actually the start of a whole song. But when I wrote it, I thought I wouldn’t have enough time alive to write all those songs so I put all I could into this one.” And Dylan, of course, was his generation’s genius—maybe the genius for multiple genres that came after him, despite his dire fortunetelling.\nFolksinger Bonnie Dobson was humbler than Dylan. Still, her “Morning Dew,” also from 1962, employed the same trick as “A Hard Rain’s Gonna Fall”: to make a serious treatment of annihilation listenable. “Morning Dew” turned out to have legs; it captured what so many people liked about the music of the folk revival and has since been recorded 32 times (and counting) by other artists, from hippies like the Grateful Dead to noiseniks like Einstürzende Neubauten. The lyrics are oblique enough that you could listen to the whole thing without knowing that it was heavily inspired by Nevil Shute’s 1957 post-apocalyptic novel, On the Beach—but Dobson is on record as saying that is indeed the case. If so, she made a smart aesthetic decision. The lyrics’ opacity is probably what saved the song. And made it a minor classic of nuclear-paranoia folk.\nFor a foil to “Morning Dew,” consider “Fallout Shelter,” yet again from 1962. The song is credited to Billy Chambers, who sang it. But it was written and produced by Bobby Braddock, who told Cold War-nostalgia website CONELRAD, “To be very candid, I was a musician going through serious psychological problems due to an overdose of speed at the time, and I was quite paranoid; I had tried to talk my parents into having a fallout shelter built.” He was also inspired by a Twilight Zone episode titled “The Shelter,” which is about a small town torn apart by a false alarm of an impending nuclear attack.\nBraddock, who went on to be an immensely successful Nashville songwriter and was recently inducted into the Country Music Hall of Fame, now humorously disowns his work on “Fallout Shelter.” Musically, he’s being a little hard on himself. The song’s Spanish-tinged rock is reminiscent of Roy Orbison, and the music’s quite pretty. It’s the lyrics that justify Braddock’s harsh judgment. The premise is as timeless: Two teenagers want to be together, but their parents won’t let them. Tragedy ensues. That story shows up everywhere from the traditional American song “Katy Dear” to Romeo and Juliet, but somehow exporting it to the context of nuclear annihilation fails. In the song, all the bombs fall, and the narrator, a young man, begs his parents to let him bring his girlfriend with her into their fallout shelter. The parents refuse, saying there isn’t enough room for her, and the boyfriend decides to stay outside with his true love so they can die together. By the time the narrator gets to the money line—“You hold my hand, I understand / The sickness has begun / And if we live or if we die / Our hearts will beat as one”—you’ve probably checked out. Braddock, working in what was then a new flavor of rock and country, couldn’t get at the terror of the subject without putting people off. It was more weight than the young musician—and a young music—could bear.\nThe straight-up country music of the Cold War era though, knew exactly what to do. It had deep roots in Appalachian ballads and hymns, and it had been viable commercial music since the ’20s. In 1927, The Carter Family sang that “God gave Noah the rainbow sign / No more water, but fire next time,” so for country musicians, writing about atomic power was easy. Next time meant now. Hawkshaw Hawkins’s 1947 song “When They Found the Atomic Power” understands the A-bomb as a divine sign that we’d better stop fighting. The Buchanan Brothers’ “Atomic Power” from 1946 considers Little Boy and Fat Man—the codenames of the bombs dropped on Japan in 1945—as “brimstone fire,” judging that “Hiroshima and Nagasaki paid a big price for their sins.” But lest we think the United States is off the hook for fiery repentance, there’s Fred Kirby’s \"When the Hell Bomb Falls.\" That song, like Hank Williams’s \"When the Fire Comes Down\" and Jim Anglin’s \"This World Can’t Stand Long,\" implicates all of us: \"He gave us all this blessed land, and this I cannot understand / A weapon of destruction to destroy us, everyone.\"\nAccording to country music’s diagnosis, we’re all in trouble. The Buchanans, however, make a pretty interesting last move in “Atomic Power” that starts to get past even the cohesive narrative of atomic power as God’s wrath: “But on that day of judgment when comes a greater power,” they sing, “we will not know the minute and we’ll not know the hour.” That’s where gospel picks up, and gospel has some even deeper sources to tap. By 1945, gospel as a marketed genre was over twenty years old. And like country music it had stayed relatively close to its roots in spirituals, which went back a few centuries. The tradition encompasses and draws strength from a history of unbelievable hardship, including the Middle Passage and the immense, horrific legacy of slavery.\nThat perspective makes “Jesus Hits Like an Atom Bomb” a pretty unique thing. It began life as a country song, written by Lee McCollum. As recorded by Lowell Blanchard and the Valley Trio in 1950, it’s a bit of a novelty number, easy to take none too seriously. But gospel groups latched onto it and made it theirs. The Soul Stirrers—which would include a pre-fame Sam Cooke over the years—recorded it the same year. Then the Pilgrim Travelers did it in 1951. Both of them changed the song’s tone, from jokey to celebratory, from declamatory to comforting. In doing so, they turned the country narrative about the atomic bomb inside out. For them, the threat of nuclear war isn’t a big deal; like the Buchanans suggest, it’s the Second Coming that we really need to watch out for. But where the Buchanans see menace, the gospel singers see hope. They’re looking forward to the day Jesus brings them home, and they accomplish in two lines what all the other above-mentioned songs never quite do: They defuse the bomb.\n“Jesus Hits,” in the hands of gospel musicians, transcends the bomb’s threat of complete annihilation. Yeah, it’s bad, gospel says. But gospel has seen bad. And its audience—which has been wronged, over and over, and carries the wisdom of that from generation to generation—has already seen a catastrophe or two. They’ve already witnessed the ruination of peoples, nations, and continents. Rock ’n’ roll tries to go crazy and party that away. Country tells us to be afraid for what we’ve done. Jazz tells us to take it easy; there’s nothing we can do about it anyway. But “Jesus Hits” goes further. It tells us that nuclear war is just the latest apocalypse; when the threat of it subsides, there will be another apocalypse waiting. And the biggest one is always coming, until the world really ends and begins again.\nThe gospel singers were right. For all the decades of obsession with nuclear annihilation—which shaped everything from politics to science fiction to music—after the bombings of Hiroshima and Nagasaki, the threat of death from atomic weapons turned out to have been a false alarm. But it’s too easy to make that point now, in hindsight. Maybe it’s possible to render the threat of global thermonuclear war quaint because it had a single cause—the U.S.S.R.—compared to our current era of multiple catastrophes: terrorism, economic hardship, political chaos, climate change.\nCulturally speaking, it’s hard now to point the finger, to color the map, to place what’s going on into a tidy context that makes it all easier to understand. But we can feel it. We see it in the news. We absorb it from books, the movies, TV, and, yes, music. And maybe all the worry is justified; on some level we comprehend what’s up, even if we can’t articulate it as a coherent concept or give it a name. But maybe we’re missing the signs of something bigger that pulls it all together—signs, perhaps delivered in song form, that will seem obvious generations from now. If that future comes, will we wonder why we worried so much about everything else? And what will we listen to then?"}