{"fingerprint": "T+nflv5xFts+MjFwL+zyNSuku8o=", "sitename": "Clarkesworld Magazine", "title": "Drawing Lines Between the Stars by Frank Smith", "author": "Frank Smith", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/smith_08_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Drawing Lines Between the Stars by Frank Smith", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6090 words, short story\nDrawing Lines Between the Stars\nAmbient lights dimmed throughout the starship. The arbitrary definition of nighttime on the Bakunawa. Buried within a confusion of workstation alerts was a flashing red distress beacon. Transitioning from mimetic, eye-sensor controls to standard, manual controls gave me a headache. I left the beacon for Captain Onome to find.\nWe were on our usual route home, coasting outside the belt, loaded up with a cargo of silicate rocks and water from Europa.\nCaptain Onome finally noticed the distress beacon and said, “Well, that’s odd.”\n“The worrying kind?” I said, enjoying the feel of my feet on the floorboards as I rolled out the kinks in my shoulders. After being pressed flat against my chair for a few hours, the Baku now ran at about 1-g but would continue to lose momentum until reaching a complete stop at our distribution hub on Luna.\nOur stations sat three across on the bridge. Including the captain and me, there was also Mike, with all the personality of a peeled prawn, off rotation in his cabin. The Baku’s AI bots managed our more tedious and time-consuming processes in the background.\n“Hard to say,” Onome said, moving like a mantis angling its way around a leaf as she opened the comms. “We’re being hailed by a solar sail—an astronomical solar glider.”\n“Ugh, I hate those,” I said. I shook up an aerosolized cocktail of tranquilizers and melatonin to come down from the last little boost of Alertec that had kept me going during the jump. During our last job, I headed down planetfall on Europa to manage a few software and hardware installations for a body hacker running on the moon’s eighty-five-hour day cycle. He wore me down to the bone. No matter where I am in ’verse, I need my eight hours, man.\n“Solar glider,” Onome said into the comms, “This is Captain Onome of the transport hauler the Bakunawa. Reading you loud and clear. Over.”\nWe weren’t in range for live communication, creating a short delay in response. I imagined the solar sail out there in the darkness, chasing cosmic winds, following astrological currents, waiting for a message in a bottle.\n“Ever been on one of those, Bex?” the cap said. My name is Bexar, pronounced “bear,” but the cap liked to call me “Bex,” which sounds like how it’s spelled. I don’t know. We have a lot of time to kill.\n“Not a fan,” I said. “The stories of astronomicals wandering into transit lanes are grisly. I’ve seen the vids of what happens when a hauler smashes into one at a full jump. The astronomicals follow the byways and frontage lanes these days—but I still don’t trust them.”\nAn audio-only message arrived. “Bakunawa, I am requesting assistance,” said a reedy feminine voice buried in static. “My ship the Aldebaran has sustained damage from a passing comet, and I am unable to make repairs. I am on my way to meet with the flotilla for the solar opposition. Can you assist? Over.”\n“Flotilla?” I said. “Solar opposition?”\n“The nomads meet every few years during specific astrological positions of the stars,” Onome said. “This ship must be on its way to one of their gatherings.”\nOnome expanded a holographic orrery of the solar system tracking the current position of the planets and the Baku. If Earth was a palm-sized rock, the solar sail was a grain of sand. Onome plucked the grain of sand away from the orrery, expanded it, and turned it over so we could get a look at its fat body and thin solar wings. Nothing had smashed into the thing, which was good.\nWe ran models of a rescue mission with the navigational AI.\n“At our current trajectory, we’ll pass each other in a few hours. What do you think, Bex?”\n“Rules of the road, right,” I said. “Pull the ship in before anyone gets hurt.”\nI shook off my desire for a nap with another Alertec, as well as a GABA supplement to keep my spirits up, chased with Echinacea.\nOnome responded to the astronomical: “Copy that, Aldebaran. I’m transmitting coordinates for pickup. Based on our current positions, we can pull you into orbit with the Bakunawa and bring you in. I’m starting a countdown and expect we’ll sync up just under 0300 hours from now. Over.”\n“Careful on those time commitments, Cap,” I said, strapping into my station.\nStarship time is weird. Somehow moving between our outer-Earth outpost and one of the space stations beyond the belt, days and weeks get lost. Everyone’s happy when we’re early and pissed when we’re late. On the Baku, we’re always rumbling along the same transit lanes between the same rocks—and, shit, I don’t know where the lost time goes. Maybe I’ll get it back in the end.\nAnd now we’d created a time commitment for ourselves. A job requiring a bit of precision.\nAll we could do was refine the rescue model and wait. The hard work would fall on the nomad. Hopefully time would be on all our sides. And like I said, starship time is weird.\nSpace is really just a bunch of stuff circling bigger stuff in 3-D. So that informed our idea with the astronomical. Our trajectory was fixed—a long orbit around Jupiter and Earth. The astronomical could move around a bit more, and if the pilot was halfway decent, drift right up to our ship and catch an orbit around us.\nThe right timing.\nA little luck.\nThat was the plan anyway.\nMike joined us on the bridge to help with the job, though it would have been better if he was out on the hull. “Man, I just don’t feel like dragging my ass into an EVA suit today,” he said, poking at the rescue mission model on my screen.\n“Your plan looks all right,” he added. “I’ll fix a few things.”\nI wiped the screen with my sleeve after he’d tucked himself into his station. The model was fine, and all Mike did was move a few things around and put them back where they were.\n“Whatever you two are going to do, do it fast,” Onome said.\n“Why are we doing this again, Cap?” Mike said.\n“The ship asked for help.”\n“Everybody needs something. What if it’s a scam?”\nWhile I thought Mike had a decent point, I didn’t think voicing my agreement was in the captain’s best interests.\n“I have faith in all of us to handle the unexpected,” Onome said.\nMike eyeballed me and shook his head. I gave him the finger.\nAs it came into view, the astronomical called to mind the boats our seafaring ancestors piloted across Earth oceans. With its patched-together hull, the ship was a mishmash of steel alloys and chrome, pitted by interstellar dust and cosmic radiation. Piloting that thing must have been lonely.\n“She’s gonna miss us,” Onome said.\nWe were in real-time, chitter-chatter range. The captain hailed the hitchhiker: “Fold your wings and slow your engines now, Aldebaran.”\nSilver sails folded and retracted against the small ship’s hull. As it came up on the low point of the Baku’s orbit, bursts of gas from its aerobrakes slowed the craft. Shaking like mad, the astronomical created enough drag to fall into an elongated orbit with us.\n“The ship’s too fragile to match our speed,” Onome said.\nMike grabbed at the solar sail with the robotic arms we use to load and unload cargo.\n“Missed, dammit,” he said.\n“We won’t get another chance,” Onome said.\nThe AI spat out a bunch of recommendations, but none made sense in the heat of the moment. Though I trust the bots to keep us from hitting any of the big rocks we’ve forgotten about because we’ve been popping Alertec for three or four days straight, there are still jobs only humans can do.\nI switched to the workstation’s manual controls. Working two joysticks, I maneuvered the arms wide and brought them in slow—the arms were on a track that could rotate around the hull of the bulbous and birdlike Baku—timing it so the astronomical would pass on its next rotation through the arms while they were wide open. I snagged the ship. Hooks at the ends of the arms created a magnetic seal against the astronomical’s fragile hull, tethering us together.\nHere was the Baku, the biggest rock around, and here was the astronomical, circling around us as we pulled the ship in closer.\n“Slow and steady,” Onome said.\nI dragged the astronomical up to the cargo hold and locked the ship in place with the Baku. We extended a docking module, creating an airlock between us.\n“Let’s meet our new passenger,” Onome said, her boots clunking across the floorboards.\nI took a beta-Sitosterol to come down from the stress, as well as my daily multivitamin. “Sure,” I said, transferring controls back to the AI.\nMike slumped in his chair. He was the last to leave.\nTraversing the Baku’s interior decks was like one of those children’s puzzles where you guide a metal ball through a maze. When you’re weightless, you coast seamlessly along a series of platforms set on top of each other connected by one continuous corridor. Under gravity, it’s a downhill trudge to the cargo hold and a trudge uphill to the bridge.\nOnome and I clomped down the corridor. I paused at the door to the cargo hold to straighten my jumpsuit. The captain insisted we maintain a daily exercise regimen to keep bone and muscle strength up, and while I did my best, the jumpsuit accentuated my gut.\n“Suck it in, Bex,” Onome said.\n“It’s not too late for me to hit up the gun safe,” Mike said.\nThe Baku is supplied with a small number of Gauss guns—service revolvers and a rifle. I guess in the event we’re attacked by a xenomorph we’ll be able to forestall the inevitable by three or four extra minutes. In his downtime, Mike likes to clean all the guns and dream about shooting a pirate. I’m afraid of pirates, too, but unlike Mike, I know that if the shit went down, I’d be the guy offering to make coffee while they pilfer our cargo hold. Or I’d be dead. First to die in a pirate invasion. First to be eaten during a zombie infestation. First to be impregnated by a xenomorph. This guy right here.\n“Save it,” Onome said. “Here she comes.”\nWe greeted our guest.\nThe hitchhiker was like an evolved idea of humanity. Her face and hair were streaked with a blue clay that smelled like earth and exotic oils. She wore a gray poncho that hung off her shoulders and a standard-issue flight jumpsuit, weathered by hard work.\nOnome shaped her hands into a triangle formed by her thumbs and forefingers. She pushed the triangle away from her heart toward our guest. Captains always seem to know this kinda junk. Unsure what it meant, I repeated the movement. The hitchhiker clenched her right hand into a fist with the tip of her thumb protruding out between her index and middle finger. Holding her fist against her heart chakra, she nodded, never letting her dark eyes off us.\n“Welcome to the Bakunawa,” Onome said, introducing us.\nOur hitchhiker said her name was Adena. “I was on my way to join my family for the opposition of Earth and Mars when I passed too close to a comet and one of my solar collectors started malfunctioning,” she said, breathing hard. Adena clutched the handrails to stay upright. Astronomical solar gliders are too small to grab significant Gs, so you’re just out there—slow and meandering, weightless inside a tin can. The Baku was early in its deceleration sequence. Being near Earth-standard gravity must have been beating the shit out of her. She didn’t complain.\n“We can assist with repairs,” Onome said.\n“I don’t want to be any trouble. I can manage on my own,” Adena said. “I just need a safe place to dock.”\n“It’s no trouble,” Onome said. “Bex is one of the best engineers in the system.”\n“If the problem is with one of your solar collectors,” I said, nudging around Mike, “chances are it’s the lines running from the sails to your batteries. I can take a look and print up replacement parts on my next shift. These are basic maintenance tasks you should really be on top of yourself, though.”\n“What about a full diagnostic there, Bex?” Mike said.\n“It’d take a few hours,” I said. “The astronomical is pretty beat up, so there’s probably a thousand different problems.”\n“Yeah, but a full diagnostic will tell you what to prioritize,” Mike said. “Problems tend to be holistic.”\n“I’d rather hit the obvious ones and get this thing space-worthy quick.”\n“A full diagnostic, chief,” Onome said. “If it takes a few hours, best to start on now.”\n“Right,” I said, retreating into the pointlessness of my rank. “I’ll have the Baku’s AI run a full diagnostic.”\nAdena pressed her fist against her heart chakra and nodded. “My ship is in your capable hands,” she said.\nOnome, desperate for a conversation with anyone other than me or Mike, clomped away, chatting with a blissed-out Adena, holding her arm for support. Personally, I don’t know if I’d be so trusting of a stranger fixing my ship. I’d also keep my rig in better repair.\nBefore I could enlist his help, Mike saluted me and took off for the bridge.\nMy eyes twitched. I wanted to crash out in my bunk.\nPatchouli scented the corridor. Adena had left a touchscreen control panel on the hatch of her astronomical unlocked. I used my reckoner, a handheld computer, to do a quick handshake and sync with the astronomical’s diagnostic tools. The astronomical ran ancient software with a UI I hadn’t seen since I was an apprentice. I asked the Baku’s AI to push out software updates.\nThere was a little strangeness in the oxygen recyclers, which I dismissed in the moment, focusing instead on the solar battery system. All things in time.\nI inhaled another dose of Alertec with a chaser of gentian root to calm my eye spasms, and I did my job because even if it’s a shit job that’s the job you do.\nAfter a long shift, gardening settles my mind. While the Baku’s AI automated the initial repair sequence I’d programmed, I hunkered down to pull some carrots in the biome where we grow produce in soil collected from Earth. Well, the whole ship is a biome, if you think about it. But the original starship engineers decided our gardens, arboretums, or green spaces were the ship’s “biomes” and the other areas on our ships were work or living spaces.\nEach carrot was a thumb-sized knob of expensive water, sugars, proteins, and fibers grown in soil collected from Earth. I chucked each nubbin into a bucket to be rinsed off, packed into a compostable container, and delivered to the galley. The captain lent a hand in our little garden biome when it occurred to her, and Mike, who only ate stuff formed out of plankton paste, never did.\nWe grow fruits and veggies, aloe vera, sansevierias and other oxygen-cleansing ferns, flowers, legumes and similar nitrogen-fixing plants. And we have a few live oak trees planted in a soil bed I designed that allows the tree’s root system to spread beneath the floorboards of the biome. On Earth, live oaks seem to defy gravity with their heavy, horizontal branches, and it was no different on our ship where tree branches embraced the room.\nI rustled around the base of the largest live oak like a sleepy elemental woodland spirit, ready to take a well-deserved nap, when I discovered the hitchhiker resting against a tree trunk, legs splayed out in front of her body. She’d been so quiet.\n“Am I in your spot?” Adena said. Removing her cap, silvery braids spilled around her face. “Onome said it was okay for me to be here.”\n“Yeah, it’s a good spot.”\n“I haven’t seen anything like this in years,” she said. “It’s very peaceful.”\nAdena had a pretty chill vibe. The blue clay had stained most of her skin turquoise, which complemented her dark purple eyes. You can get purple contacts, but these were real. Like, a genetic mod, for sure. Mellow aura. Visionary. Healing. Super mystical. If Adena ever left her zero gravity existence permanently, her body would crack like an egg.\n“Things with your ship are coming along,” I said. “My hunch about the lines running from your solar collectors was right. Not that I’m bragging. I’ve seen it all by now. You’ve probably experienced a lot of loss for a while. We’re printing replacement parts.”\n“It’s very kind of you to share your resources.”\n“We don’t have much,” I said. “But we share what we can. That’s the code of the road.”\n“If there’s anything I can do, please let me know.”\n“I am wondering about the gathering. The captain mentioned an opposition. I’m curious.”\n“An opposition between Earth, Mars, and the Sun occurs around about every two years. Due to all of their orbits, some oppositions bring them closer than others. The coming perihelic opposition is the closest the planets will have ever been in two hundred and eighty-four years—for the largest gathering of solar gliders ever. We’ll worship together at a point beyond Mars. The alignment of the planets with the Sun creates a cone of healing—we’re inside the cone now. Can you feel it?”\n“I want to, but I don’t think I know how,” I said. Heading into hour seventy-ninety-twelve of awaked-ness, I wasn’t experiencing anything healthy or conical. I’d been running the same route a long time, and I was sensitive enough in that moment, safe beneath the branches of the live oak, to recognize how physically and emotionally worn out I was, sure, but I was also tired all the time; tired of the life I’d been leading, and I wanted to change. I’d washed out years ago. Anyway. That’s some angst to drop on a friendly stranger.\n“Have you visited my ship?” Adena said, reading my aura.\n“Only as far as the airlock.”\n“I’ll give you the tour,” she said, hooking her arm through mine.\nRepair drones circled the exterior of Adena’s ship. Much of the golden-brown paint on the ship’s hull had been scraped away, revealing gray chrome panels, scuffs from docking clamps, and pounded-out dents.\nA whoosh of strange air hit me in the face as I opened the airlock—a familiar, chemical smell, soon consumed by the oils Adena favored. I let it go. By the end of a long haul, the Baku’s air can take on the tang of halitosis, too.\nAdena said she’d named her solar glider astronomical the Aldebaran, after the red dwarf star that followed after the Pleiades. “I follow where the stars lead,” she said.\nThat kinda talk usually turned me right off. Hanging out with this floating blue woman in her solar-powered starship that smelled of Nag Champa and sweat, my third eye was open.\nThe Aldebaran was cramped yet tidy. Beyond the airlock was a small utility room, odds and ends strapped to the walls. The watering system clucked on in a biome with shelves and glow lights, overflowing with whatnots. Beads of water glimmered weightless in the air.\nAdena’s cabin was across the hall. The top bunk was unmade with a heavy blanket strapped to a mattress. Out of respect, I only gave the room a glance.\nAt the end of the corridor was the cockpit, a narrow space with two jump chairs and an expansive view of the stars. The bridge of the Baku was fully enclosed with all of its navigational systems automated when not being operated by Mike, smearing his greasy fingerprints on the screens.\nThe cosmos through an opened shield viewer set off a dormant case of agoraphobia in me. I know that sounds strange. I’ve spent most of my life on a starship. Even on Earth, how often do you get an opportunity to look out on a view of nothing and everything at the same time?\n“Makes you feel small,” Adena said, between breaths. “During the opposition, we’ll gather our ships and commune with each other. We’ll be one large community. I miss that.”\nAdena settled into her chair.\nI moved a book from the seat to join her in the copilot’s station. “Is this a logbook?” I said.\n“Everything is in there.”\nMy eyes crossed as I thumbed through the pages.\nAir recyclers whooshed and clunked as repair drones clanked against the hull.\nA twinkling star.\nAdena said it was Aldebaran.\nThere and here.\nSure, any star can be anything you want.\nIf there are lifeforms living near it maybe they have their own name for their Sun.\nI closed my eyes and drifted asleep.\n“Bex.”\nAn oxygen mask hugged my mouth and chin. I was on the Baku, strapped into a medical station. My jumpsuit was unzipped to my waist, gizmos plugged against my chest. An IV in my right arm kept me from bending it at the elbow. The last thing I remembered was a sweet, narcoleptic sensation washing over me. I’d been inside the deep sleep, the stuff beyond REM and dreams where our minds do the heavy work of maintaining and negotiating our existence.\n“Where’s Adena?” I said, my tongue too stiff to form the words clearly. A great rumbling in my chest exploded, and I coughed hard exhalations of air.\nAdena’s body rested in the med station next to me. Straps held her body against the cushions. Adena’s purple eyes were fixed at a point beyond consciousness. The captain closed them. Flakes of blue clay danced around her face. Her bunched-up poncho floated in a corner of the room before crumbling against the floor. We were deep into the deceleration cycle now.\nI’d been dead for three minutes.\nThe captain explained what she knew. The diagnostic of the Aldebaran found that the ship’s atmosphere system was failing; that an excess of carbon monoxide, entering via a small series of leaks in different systems, had mixed with the oxygen.\n“You know how common CO is in space, Bex,” Mike said. His fat nose sucked in all of the blood in his body. A purple vein in his bald head pulsed. “Why didn’t you check the diagnostic before boarding the ship?”\n“How long was I asleep, Cap?” I didn’t answer to Mike.\n“I don’t know,” Onome said, her face a furrowed mess of lines. “It wasn’t until an alert went off on the Baku that there was a CO leak that we thought to look for you. We followed it to the airlock, which was open to the Aldebaran. That’s how we saved your life, Bex.”\nThe logbook from the Aldebaran was still in my hands. Tears danced in the air around my face, catching the light, sparkling with the bokeh of distant stars.\nIn the time that followed, I went over the Baku’s logs, trying to justify my mistake.\nI couldn’t.\nThe diagnostic turned up the interstellar CO during its initial scan, and I’d overridden the AI to put off cleaning the oxygen recyclers and atmosphere system until after the solar batteries were repaired. CO is very common in space; Mike was correct on that point. I must have taken it for granted because there was no reason why the repairs couldn’t have run in parallel. It was a dumb, random mistake. One I don’t think I would have allowed to happen if I’d been keeping my shit together.\nAdena had been breathing in small amounts of CO for days if not weeks. I could have fixed it without any effort or consequence. I failed her.\nNot wanting to prolong the investigation, I laid it all bare in the incident report, breaking everything down for thorough examination. I produced a strong, competent report and took ownership of my failures, which is what you do. But I still didn’t expect it to end my career.\nOnome waited to visit until after she’d heard back from corporate. Humiliated and depressed, I hadn’t left my cabin since Adena died. Mike left me alone, and I don’t think it was done out of empathy. Maybe it scared him. The fragility of starship life. I like to think that if the situation were reversed, I’d have reached out to him. I like to think that.\n“Bex, I have bad news,” Onome said.\n“I’m fired, aren’t I?”\nOnome tried to hold my hand. “We’re calling it an early retirement. But effective immediately, you are relieved of your duties.”\n“Is that it then for the investigation?”\n“We have to be self-sufficient out here, and the insurance adjusters use an algorithm in these cases to determine risk. Adena wasn’t a member of our crew, and to the best of anyone’s knowledge, she wasn’t registered to her ship or with the space agencies or guilds. Her ship was compromised already, and in trying to help her with repairs, you almost died with her. Not to sound cold—we work in a very high-risk environment. You produced a very thorough, very honest report. That went a long way in your favor.”\n“So you’re saying I should be grateful my career is over?”\n“You’re still alive. I’m sorry, Bex. I share a bit of the responsibility for what happened,” she said. “I should have forced you to go off duty. You were way overtime—that’s on me to monitor.”\n“What did they hit you with?”\n“Don’t worry about me,” Onome said.\n“If we share any of this responsibility, why am I the one out on his ass?”\n“Bex. I spoke up for you.”\n“I’m sure you did.”\n“I really tried to keep you with us. You have more years on this ship than anyone, but . . . ”\n“Do you still trust me?”\nOnome squeezed my shoulder. “We’ve got a few weeks before we get back to the station. I’ll set up counseling when you return to Earth. For now, the worst of it is over.”\n“Sure,” I said.\nI didn’t want to return to Earth, where I’d have to rehash why I’d been forced to retire for the rest of my life. Even with the pension, I’d need to make ends meet. What happens when no one trusts you to do the only job you know how to do? What happens when you don’t trust yourself?\nGoing home wasn’t an option.\nI took a quarter dose of Alertec with a new cocktail of supplements I’d started on during my recovery. Resveratrol for my immune system; phosphatidylcholine to help repair the cellular damage from, well, dying; ubiquinol to charge up my regenerating cells; GABA to avoid the brain farts; melatonin so I knew when to sleep; and a bunch of other stuff to detox from the CO poison and antibiotics, as well as my regular dosage of vitamins and nutraceuticals.\nAnd I read Adena’s logbook.\nThe book was an analog history of the Aldebaran, documenting the ship’s progress as it drifted through the cosmos: a physical, leather-bound book object, its pages filled with mileage and fuel ratios, supply inventories, and the ship’s daily position.\nAdena had drawn lines around the stars where she’d traveled, forming words that she shaped like how living without gravity had shaped her body. Each letter flowed and curled, looped and dashed. The straightforward journaling of facts and figures transcended the page, creating a shape of her life that made sense to me. The ship drifted under the power of solar radiation, yes, but it was never lost in space. Adena knew where she was going, even when she had no urgency to be anywhere. She had been on her way to the gathering for years, patiently channeling the orbit of the Aldebaran to go where it needed to be. She lived her life in the time between destinations.\nThe kind of time I misplaced.\nBurials in space are as dramatic as you want them to be. Either your last will requests your body be fired out to the depths or you’re fed to the ship’s recycler system to be broken down into raw elements, usable to the ship’s needs.\nWith the magnetic locks in her boots keeping our feet pressed against the floorboards, Onome met me under the flat, sterile lights of the medbay. We’d pass Mars soon. I hadn’t asked Onome to meet me so much as demanded. We needed to decide what to do with Adena’s body—we two who were responsible.\nAdena was stored in a sealed capsule, a coffin. I’d moved the capsule to the center of the medbay, near the station where I’d recovered.\n“What can I help you with, Bex?” Onome said.\n“Well,” I said, placing my hands on the cold metal container. “I’ve searched the Aldebaran’s logs for a will, and I’m almost certain Adena didn’t leave one. I can’t track down any relations back on Earth, either. I don’t know what she would have wanted done with her . . . her remains.”\n“I want to be respectful, of course,” Onome said. “What are your feelings?”\n“It’s not too late for her. We’re still on the right course. I’ve run the calculations.”\n“I’m not following you.”\n“The Aldebaran is clean. It’s good. Fully repaired. If I leave tomorrow, I can make it to the gathering. The solar sail nomads will know what Adena would have wanted—what’s respectful to her wishes.”\n“I don’t know that I can let you take the Aldebaran. Technically, it might be owned by the corporation now,” Onome said. “There’s also your pension to consider. It’s all yours to lose right now, chief.”\n“This is my responsibility.”\n“It doesn’t have to be. Stop right now and you can walk away with everything you’ve worked for all these years.”\n“Cap, if I go home, even with my pension, I’m going to be working on a loading dock until I drop dead. If I could afford to live on Earth, I never would have left. It’s why we’re up here instead of down there. I’m not asking for your help or your permission. All I need is for you to look away for a little bit.”\n“Bex, you’re making this so much more difficult.”\n“No, it’s so simple. We fix a lot of problems this way. If we were going to say some words over her, we would have done that by now. Instead, we’re treating Adena like cargo. You spoke to her, too, Cap. You knew her as well as I did, which is not at all, sure, but you were with her when she was still alive. What does that mean to you? Things happen for a reason. Adena understood that. When was the last time you actually looked at the stars outside this ship?”\n“We’re not having this conversation,” Onome said.\n“I think we are having this conversation.”\n“Bex, no, this conversation didn’t happen.”\nCaptain Onome created a triangle with her thumbs and forefinger. She pushed the triangle away from her chest, toward me. I remembered Adena and clenched my right hand into a fist with the tip of my thumb extending from between my index and middle fingers—catching the energy the captain sent me.\nAll eyes were elsewhere.\nIf you’ve done a good job, your garden will live on without you.\nAdena’s body rested in the now-empty biome of the Aldebaran, along with a collection of plants and seeds I’d harvested from the Baku, and a live oak cutting. I’d start a new garden. Until then, Adena could be amongst nature or something like it.\nDuring repairs, I’d flushed the solar glider’s entire atmosphere system. Upgraded all of the ship’s software, starting from its factory settings. I repaired the hull. Fixed the solar sails and batteries. I made the ship new. I made it mine. And now it was time to go.\nAfter its overhaul, the Aldebaran’s OS andUI were simplified versions of the Baku’s systems. As I settled into some familiar routines onboard my new home, I kept my eyes on the controls instead of the stars outside the cockpit.\nMy nerves getting the better of me, I turned the controls over to the ship for the launch. When the countdown clock hit zero, the astronomical solar glider—my solar sail—refused to detach from the Baku’s airlock.\nWe were stuck. The Baku refused to cut us loose.\nI unstrapped from my jump chair and pulled my weightless body through the small craft back to the Baku.\nGoddamn Mike was waiting for me. He’d engaged the manual override.\nMike’s smug, ruddy face filled the viewer between our airlocks. He was geared up for an armed insurrection, like a military cosplayer. I gave the glass between us a good pounding. Mike didn’t flinch.\nThe comm clicked on: “Can’t let you steal company property, chief,” Mike said.\n“What did I ever do you, Mike?” I said.\n“It’s what you could have done,” he said. “Come on out and we can talk about it.”\nI closed the viewer and killed the comms. Engaged the door seals on the Aldebaran. This was not good.\nTime was running out. For the Aldebaran to use the Baku’s orbital velocity and spin out toward the solar glider gathering, I needed to get a move on like now. Or that’s what I thought. Starship time, like I said, is weird.\nMy reckoner was still connected to both ships’ systems. Back in the cockpit of the Aldebaran, I set to work.Visualizations of the Baku’s systems blipped up from the face of my reckoner. As they did, I plucked the necessary system visualizations and tossed them at the Aldebaran’s control panel. When I had everything I needed, I hailed the Baku.\n“Bex, what’s going on?” Onome said, her voice shaky.\n“Ask Mike,” I said. “I thought we had a deal.”\n“I guess neither of us thought to loop Mike in. What are you doing, Bex? We have systems prepped for a space walk?”\n“Yeah, I’m going up top to unlock all the clamps and shit.”\nGotta love a good EVA suit, and the EVA suits on the Aldebaran were forgiving to my physique. The nylon and spandex material, reinforced with nickel-titanium shape alloys, hugged the bod, while providing protection from the cold, radioactive, vacuum of space.\n“Bex, you haven’t done a space walk in years.”\n“I used to do this kind of thing all the time, Cap. I’ve got my reckoner synced with the Baku and the Aldebaran. This’ll be a cinch.”\n“We’re still decelerating, Bex! You could be thrown from the hull before you can get back inside your ship. I’m ordering you back to the Baku. Mike can help you.”\n“No, I can’t go back. Not now,” I said. “Do you trust me?” I floated near a maintenance hatch, reckoner ready to pop the lid on this thing. I took an Alertec cut with B12 and creatine.\nStatic blasted through the comms for a precious stretch of time.\nClunks and clanks banged around the outside of the Aldebaran as the Baku released the solar glider astronomical from its grasp. My ship fell free, cast off from the Baku, tumbling away.\nThe captain said, “Bex, listen—”\nStrapping into my station, I killed the comms, as well as the connection between my reckoner and the Baku, giving up all of my control, and probably any chance of collecting on my pension, too.\nThe Baku turned its back to me, and I turned my back on it.\nTime to go. Time to transcend.\nBanking left, I folded forward in my jump chair to adjust the navigation controls. Silver Mylar solar-collecting sails extended from the glider. Solar photons goosed the ship’s sail, while the solar cells on the astronomical’s hull soaked up the necessary energy to keep the batteries full and the air recyclers running at one hundred percent purity. I adjusted the course while I could. Ultimately, the ship had to find its own way.\nI updated the logbook. The book was Adena’s will. She’d want to continue her journey to the end.\nSome of the time I’d lost came back. Weird how that works.\nBeyond the curvature of Mars, deep in the eclipsing shadow of the Sun, paper lanterns floated toward the heavens. The flotilla of solar sails twinkled, greeting me with quiet bursts of light. Beyond the rafts, Earth hid behind Mars’ eccentric orbit.\nWe moved into alignment, following the off-beaten paths, worshipping the planets.\nFrank Smith is a writer living in Austin, Texas where he maintains a love-hate relationship with agave plants. He has an MFA in creative writing from the New School and is a member of SFWA. His stories have appeared in Asimov's and Analog, as well as other fine publications. You can find him at frank-smith.com and follow his toy photography on Instagram at @frankphotowerks."}