{"fingerprint": "HeRUh8eCY3OdnqzV0j9+AKkDmWg=", "sitename": "Clarkesworld Magazine", "title": "The Loyalty of Birds by Rachel Sobel", "author": "Rachel Sobel", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sobel_03_09/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Loyalty of Birds by Rachel Sobel", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3820 words, short story\nThe Loyalty of Birds\nShe is so afraid that he will die that she cannot bear to watch his restless hands stilled upon the fine sheets; instead she sits at his bedside and watches the sunlight creep across the wall, abandoned tea cupped awkwardly between her palms. There are crickets singing in the garden, but beyond their mild whirring music, the world is still, as if it too is holding its breath.\nOr perhaps she has merely forgotten the quiet of this place. It has been so many years since she came here last, preferring the convenience and lively bustle of the city to her family’s isolated peace, and she finds it disconcerting to be surrounded by so much silence, though she rarely lets herself think why. She tries not to remember the city; it is too painful to think that everything she once loved has been destroyed by the Dauphim’s war.\nAs remedy to her smothered grief, she savors the smooth stones of the pale villa, walks the gardens of the inner courtyard and helps her attendants sort out the complicated trousseau of half a hundred generations that has come to rest in her attic. In the evenings she can sit in the fading light, keeping her hands busy with some necessary task or other, and watch the nest of fledgling starlings in the apple orchard scream at the farm cats with neighborly fury when the kittens draw too near them.\nIt is easier to be practical than to think much about anything else, because while there are irises beneath her bedroom window and lilies in the woods, there is still a civil war on her doorstep and a man who has destroyed himself lying in her second-best guest bedroom, his face drawn tight with his sleeping pain.\n“It will be worse before it gets better,” Gilos warns her, the truism as strange in his mouth as is the grimness in his light eyes. He is her physician, and like all of her people who have stayed, he is loyal more to her than to the honor of her name or any ideal of king or country. They were lovers once, long before he came to serve her, and the distance of that time makes her wonder if she has become old.\nShe looks at him now without expression, and he adds: “If it gets better.” His eyes are hard. She remembers belatedly that he too loved the man who lies in dreaming agony in the second-best guest bedroom, and she is sorry.\nBut she doesn’t believe him. She isn’t sure she can afford to believe him. They have lost so much already, and all that has been left to them are the ancient faded linens in the attic and the bright birds in the garden; if they cannot save him, she thinks, perhaps these things too shall be destroyed when the civil war comes to this place.\n“I don’t believe you,” she tells Gilos, and his smile is as hard as his eyes, bitter and self-mocking, but he spends none of his violence on her, and his voice is as mild as ever.\n“Then don’t, my lady,” he says simply, and his gaze does not stray to the doorway to the sickroom. He hesitates. “I will lessen the laudanum tonight,” he says at last. “It must be done, but—it will be worse.”\n“I’ll come,” she assures him, and goes to take refuge in her garden among the weeds she hasn’t had the time to pull.\nShe is not sure if his screams are worse than his stillness.\nThere is no way to know if the war will come here, but she knows it is her duty to make preparations as if it will; she helps her people to repair the walls until her hands are scraped raw with a new set of calluses. They are far from any significant territory, and for all the beauty of this place, it is still only a rambling mountain valley, hidden between the cliffs and fed by spring and rain, but there is always the chance someone will remember the name she used before they ever knew her.\nThey eat still-warm bread with goat cheese spread liberally across it, and choose to save the sausages for winter, which is only common sense. Instead they slice tomatoes and cucumbers while the solemn black-and-white kitten rubs against her ankles, his dignity apparently forgotten. Her eldest brother loved to steal garden vegetables when they were children, and she cannot eat here without thinking of him.\nIn the night, she sits beside the man she loves and watches him fight sleep with every lingering strength in his body; he barely speaks even to her, and then only when he wakes from his nightmares.\n“I dreamt that my hands were made of molten gold,” he murmurs once, his chest heaving with his gasping sobs; his face shines with tears in the light of her candle, and he flinches away from the touch of her hand on his face, looking sick. “I dreamt . . . ”\n“You’re safe now,” she whispers, stroking his dark hair back with a gentleness that surprises her. “There’s no one to hurt you here.”\nShe doesn’t look at his hands until he has fallen asleep again, his exhaustion too strong for him, and only then does she rest one hand lightly on his right wrist, well above the careful bandages.\nHis hands are ruined; the left is burnt beyond repair, and Gilos is still afraid he will have to cut it. She knows that he did it to himself in the fire that took his power from him, and it frightens her when he cries out in his sleep with such anguish that she cannot bear to touch him. Laudanum or no, there are no easy answers to his pain.\nShe finds in the attic a slender book bound in brown leather, and opens it to reveal pages covered with marvelous illustrations in colorful ink: dragons over warm seas, banquets and menageries, camels aboard flying ships and smiths shoeing horses; the paper is fine and dry beneath her fingers, and she brings it downstairs with her almost absently. On a whim, she takes it to show him, and sits beside him, tracing the shape of a sparrow’s wing with the tip of her little finger.\nShe stays for more than an hour, turning the pages for him when he tilts his chin at the book, and leaves only when duty forces her to. His eyes are overbright as he follows the trailing line of a willow, but he sits leaning against the pillows, shaking slightly. It is not until after she leaves that she remembers his fondness for books and paper, for drawings and paint as well as other stronger things. Perhaps she has only been cruel after all.\nBut that night he asks her to read to him; the request comes haltingly from his lips, strange in a mouth that has said so little voluntarily, and she brings an aging volume of peculiar foreign philosophy for his approval. Apparently it is good enough, because he settles back, his eyes closing so that the lashes lie along his cheeks. She reads aloud for hours, trying not to let him catch her watching the tension flow out of his body like very lethargic water, until at last she is sure he is asleep.\nIt takes a long time, even though once he would have teased her mercilessly for her horrible taste in literature; he has found philosophy boring for as long as she has known him, and that is half of why she chose it. She is afraid for him, and he sleeps so little and eats even less. She sits by his bedside long into the night, watching her candlelight flicker across the hollows of his gaunt face. If she is lucky, she falls asleep in the chair at his bedside, with only the crooked pains of age and grief to greet her in the morning, but as often as not, she awakens to midnight and the sound of his ragged breathing as he tries to keep from waking her.\nShe is so tired, so often, now; there are not enough of them to pull in the harvest, and likely not enough harvest either, and the summer is waning so fast that she is very hard-pressed to think how they will survive the winter. If the soldiers do not come, she thinks, then perhaps they will make it, and she goes over the records again with her steward, searching for some slight excess they can depend upon.\nIt is such hard going that every other task is easy by comparison, all the grueling physical work she lends a hand to when she has a spare moment made nothing in the face of this last, most brutal fact. She knows she cannot spare the time to go to him, but equally she cannot leave him alone with his nightmares, and so she goes, and is worn thin with exhaustion.\nAnd now he sleeps without dreams, and even knowing that she is likely being far too much the optimist, she comes back to him as soon as she can the next day with a small green silk case of books and an expression he would call determined. She needs him so badly, now, worse than she ever has; she needs his strength and his courage and his wit, and she cannot ask him to spare anything for her. He has so little for himself.\nTo her surprise, his mouth twitches upwards, almost a smile, and while he is still so thin that his bones show clear through the bandages at his wrists, she is strangely reassured, and cannot quite keep the answering smile from her face.\n“I will be damned before I spend the rest of my life reading horrible philosophy,” he whispers. “Poetry, madam, or at least a play, for the love of all things merry.”\nShe brandishes the green silk books at him with mock ferocity, displaying the gilt-lettered title. It is a set of mythological poetry, rife with firebirds and wishes, precisely the sort of foolishness that he once loved, and she is rewarded for the trouble it took to find it by the ghost of a smile on his face.\n“Heathen,” she says, as fondly as she dares, and he leans back into the pillows and closes his eyes as she pages delicately through the first of the thin volumes, her voice low and easy, soothing him into sleep.\nShe comes back the next day, as soon as she can be spared from directing the defenses, and after that again, and together they make their way through all the long slow poems of their history in the little time she cannot really justify setting aside for him, until at last they come to the tragic cycle of the sorcerer Theine. Once upon a time, it was his favorite, and even she, who has always hated poetry, could nearly tolerate it, but now she cannot help but find it cruel.\nBut as she starts to flip past, her fingers brushing lightly over the pages, he frowns, and shakes his head.\n“Please,” he says, his voice soft and harsh around the edges, and she knows that he is afraid.\nShe starts slowly, pausing more often than she needs to, to take a breath or sip of water from the blue clay cup beside his bed, and every time she looks in hope he has fallen asleep she finds him watching her, his gaze unnervingly still.\nAnd now she’s gone and laid him down,\nHis body limp upon the green.\nHis strength of limb has been and flown;\nThe stars are hid behind her screen.\nHe lies beneath a storm-torn beech\nHis mind grown dark with loathsome lies,\nAnd all his gift for song and speech\nHas died before her golden eyes.\nHis birds are slain, his master’s dead,\nThe school of wizards burnt and lost.\nHis brothers from the land have fled\nAnd left him here, to face the frost.\nShe binds him now with chains of light,\nWithin the shadowed sleepless hill,\nTo live so long as day flees night\nAnd listen to the dead winds’ will.\nShe pauses then, and turns to gaze,\nUpon this shattered sorcerer\nWhose mind was caught within her maze\nThough once he sought to conquer her.\n“My lord,” she whispers ’gainst his cheek,\n“In days when men may hear thy doom,\nDost think they shall my secrets seek?”\nHer eyes are bright within the gloom.\nShe does not wait on his reply,\nBut opens her bright-feathered wings\nAnd casts herself into the sky,\nAnd as she goes away she sings.\nThey let the words drift away into the silence, and after a long time he stirs in his bed, half-restless and half-thoughtful.\n“It isn’t like that at all, you know,” he murmurs, and for a moment there is a shadow of bitter mockery in his voice. He looks at her so steadily she is afraid. “I had thought that it would be like that, a queer dream of winds and stars, but poets,” he says, the bitterness stronger now, “are liars all.”\n“I’m sorry,” she says, and she does not think she has ever been so sorry in her life. “I left you to die,” she says, and cannot bring herself to go on.\nHis mouth quirks painfully, and he looks away.\n“My staff burnt to dust and ashes in my hands,” he says, at last, as if he is confessing to her, and his voice is colorless. “I felt myself break, and then there were shards of glass in my heart and nothing in my head but fire, and the world was gone.”\nShe touches the gilt lettering on the green silk lightly, with the tips of her fingers, and cannot think of anything to say.\n“Nothing mattered very much anymore,” he says, quietly, his face terrible to look at.\nThe next day she brings only lesser poetry.\nThe summer is fading, and soon it will be gone entirely and the harvest will have to be brought in. The apples on the trees are fat and tempting, smooth sides dappled pink and gold. The children collect them in baskets and eat themselves sick, and at night foxes chase each other drunkenly through the garden, made bold by fermenting berries. The breath of autumn touches everything with bronze.\nThe ploughman’s daughters, sturdy dark girls with solemn faces, have adopted him as their own, unafraid of his scars. They bring him half a hundred little presents clasped in their chubby hands, bright-colored leaves and scraps of golden silk and, once, the entire branch off an ash tree, sheared off in an early storm. It takes all three of them to carry it into his bedroom, and even so the wide branches near the top get stuck in the doorframe. Even Harra, her steward, has trouble maintaining her stern expression while she scolds them, as she has to do it from behind a screen of half-dead ash leaves.\nAnd even he smiles.\nBut he is quiet still, so reserved that it is sometimes hard to remember his presence at all, and much harder to remember the young man she first met, a wizard as strident as ever his crows were. Sometimes she thinks that it would be polite to ask the fate of his birds, but she is not sure even he knows. If they were not destroyed by the wizard he fought, they may have starved by now, or fled to some other wizard’s hand, perhaps even the one that ruined him. She has never been assured of the loyalty of birds.\nMost days, now, he drags himself from bed to sit in the chair beside his window; his broken strength is returning slowly, but as yet he can do little more than sit and sleep and watch her farmers struggling to get their wheat in. And he leaves bread crumbs on the sill every night, scattered as if it is accidental.\n“I’m sorry,” he whispers once, his eyes dark with exhaustion, and for a moment she cannot think what he means. “I’ve returned to you so useless,” he says, his mouth twisting a little with a merciless humor.\nShe bends to kiss his cheek, cupping her hand about the back of his neck, as reassuring as she can. “But you returned,” she says, and he is silent.\nSometimes she dreams that she went back for him herself. In the dreams, she steals a horse from her peasants and rides as fast as she can to find him. She swings down off her horse into an empty field of grass, golden stalks waving gently in the breeze as far as the eye can see, and walks for miles as the red sun sets behind her. There is never anyone there.\nIn the evening, she brings him honey and raspberries, and sits beside him to watch the sun set beyond his window. The light falls across the hills like spilt wine, wakening dim colors in the mountains, and she closes her eyes against its warmth.\n“I thought it would come back,” he says, after a long time, his voice gentle and almost idle. All but the last of the sun has disappeared behind the mountains, the land fading into the evening, and she turns to look at him and finds him hard to see. There are no candles in his room, but she thinks his eyes are closed.\n“It might,” she points out. Her hands clench tight around her wine-cup until she is afraid she will break it, and she very carefully does not think of all the history she knows which says that it will not. Broken wizards do not heal.\n“It won’t,” he says, quietly. Out the window, the moon is rising noiselessly behind the mountains, and it too is touched by the warmth of autumn, its luminous shine turned harvest orange. “I’ve known that for a long time now,” he admits, and she does not know what to say.\nHe hesitates in the face of her silence. “I wanted to die,” he says after a moment, so lightly that it is as if he is trying to diminish his honesty by flippancy. “I didn’t think that I was the sort to—” But he stops again, and does not go on.\n“Do you still?” she asks him, quiet and grave despite her fear, and his face is suddenly shy. He looks at his hands.\n“No,” he says, and nearly smiles.\nEarly one morning while she is making bread with Harra, he comes limping to the door of the kitchen and leans heavily against the wall, his good hand curled around a rough staff which Gilos got from the orchard for him. His face is pale and drawn with even this short walk, and she hurries to bring him a stool, her arms covered in flour to her elbows.\nShe watches him out of the corner of her eye as she works, and when it is time to take the bread out of the oven, she cuts off a thick slice—too early, of course, and it crumbles into the napkin, a mess of steaming bread bits against the blue of the linen.\nHe picks at it while she and Harra clean, the color returning slowly to his face, and when she brings him an apple and a slice of cheese, he eats these as well, not speaking. When he moves as if to rise, she is beside him at once, offering an arm and his staff. He makes a face, nose wrinkling in disgust at his own incapacitation.\n“Heroic of me,” he says, very dry, but takes her arm, and together they stumble back to his bedroom. She cannot stay; there are half a hundred absolutely vital things she must do today, and besides that she wants to check on the irrigation that leapt its ditch three days ago and was beaten back only with great effort, so she leaves him curled in the seat beside the window with most of the remainder of the loaf.\nShe returns much later to find the room chilly: the window open, bread eaten, crumbs scattered across the sill. He’ll be stiff later, she thinks; he has fallen asleep in his armchair, and she wakes him with a touch, keeping her hand on his shoulder. He is still prone to nightmares, and often wakes with the edge of terror sharp in his face, but today there is only a great weariness.\nFirst thing as he wakes, he glances to the window, his face still and nearly afraid, but there is nothing there. He runs his hand through his hair, staring out at the hills rolling up to the mountains beyond, and is silent for a long time.\n“I am a fool,” he says at last. “They will not come.” She cannot disagree. Not even the local sparrows will come to him, though they grow fat begging crumbs off the children, and so she looks at him and cannot find anything to say. She smoothes his hair back from his face, and kisses his cheek before she must leave him.\nOne night he joins her outside on the patio for dinner, a little dazed by the chatter of even half a dozen people but there nonetheless. It is nothing like their old life, but it is a life, she thinks, and curls her hand possessively around his elbow as she helps him back to his room. For a moment, she thinks she sees a fleeting shadow, sharp-edged and quick, but the light of her lamp shows nothing.\nIt’s grown chilly, these past few nights, and the room is tense with cold air from the open window. She leaves him sitting on the bed, hands useless in his lap, and crosses the room to close it.\n“Don’t,” he says, and she pauses. He looks up at her as she turns to him, and his eyes are clear and distant. “They came to their fate only for love of me,” he says, and hesitates, searching for words. “They may leave me for whatever reason they must,” he says at last, “but I will not lock them out, no matter how unlikely their return.”\nIt’s the longest speech she’s heard from him in a very long time, and she is taken aback; after a moment, she nods, and lets the window be, coming to sit beside him. She will have to bring him an extra blanket, she thinks, but that is scarcely a hardship.\n“Will you be all right?” she asks him, and he shrugs, rubs his face with his good hand and does not speak.\nThey sit together in silence and wait for the sound of wings.\nRachel Sobel is a biology student at the University of Washington in Seattle, and a recent graduate of the Alpha Writer's Workshop. She lives in a house full of people who consider her a dangerous lunatic, and generally manages to prove them right. Someday in the far future, she is going to be a scientist if she manages to survive her own education."}