{"fingerprint": "niNsiJESSrLqiLj1r2pBk24IhEQ=", "sitename": "Clarkesworld Magazine", "title": "Steel Is Not Enough: The Lives and Times of Magnus, Robot Fighter by Bill Spangler", "author": "Bill Spangler", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spangler_09_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Steel Is Not Enough: The Lives and Times of Magnus, Robot Fighter by Bill Spangler", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nSteel Is Not Enough: The Lives and Times of Magnus, Robot Fighter\nIt was a bright and boundless future, with flying cars dotting a perpetually blue sky. In the shadows of the mile-high spires, though, the poor and the outsiders struggled to survive. And everywhere you looked, thinking their steel thoughts, were robots.\nThis was the world of Magnus Robot Fighter, a comic book that premiered in 1963, from Gold Key comics. Although Magnus has never been as popular as Batman or Iron Man, he’s a character—and a concept—that keeps resurfacing. The newest version of the comic, a four-issue limited series from Dark Horse, started in August. Magnus’ longevity can be attributed to a lot of factors, but one of the major reasons is that it can be taken seriously as science fiction. While the chroniclers of Magnus’ adventures never skimped on the action, there was some real world-building and extrapolation in the series.\nMagnus Robot Fighter is set in the early 41st century, in the city of North Am. With a few exceptions (such as the Grand Canyon), North Am covers every available square foot of North America. Robots and artificial intelligences are an integral part of daily life, and few question the arrangement . . . but some do. One dissenter, oddly enough, is 1A, an ancient robot.\nIn order to protect mankind against renegade robots and to provide an example of a different way of life, 1A takes an orphan boy he calls Magnus and trains him in his secret Antarctic refuge. 1A teaches him how to destroy renegade robots and implants a device in his brain that allows him to eavesdrop on communications between robots. In issue four of the first run, a renegade robot tells him that “Your flesh and blood cannot stand against my steel!” The human replies, “Steel is not enough,” shortly before taking the robot permanently off-line.\nAs an adult, Magnus returns to North Am, where he becomes friends with Senator Zeremiah Clane and his beautiful daughter, Leeja.\nMagnus Robot Fighter was created by writer/ artist Russ Manning, with story assistance by Chase Craig. Basically, the 21 issues that Manning produced are what made the comic’s reputation. Manning’s vision of the 41st century was simple, but dynamic, and managed to suggest that the world continued beyond the borders of the panels. North Am follows in the tradition of Fritz Lang’s Metropolis, and Isaac Asimov’s Trantor, and it may have, in turn, influenced the mega-cities in Judge Dredd’s world, and Corcuscant, in the Star Wars prequels. (It’s worth noting that Manning was the first artist/writer to work on the Star Wars newspaper strip.) In addition, Manning produced a wide variety of robotic designs, both humanoid and non-human.\nThe very first words of Magnus Robot Fighter show how well Manning and Craig were grounded in prose science fiction. The first issue begins with, “No robot may harm a human, or allow a human to come to harm,” words that have a familiar ring to readers acquainted with Asimov’s robot stories. It’s quickly established that the definition of “harm” has changed since the 21st century. In that same issue, a robot takes a book away from a teenager because “humans might try such adventures again and come to harm.” It’s a moment reminiscent of Jack Williamson’s Humanoid stories.\nWhile robots who look like humans are relatively rare in the Magnus canon, they do exist, which may also make Magnus a spiritual ancestor to Rick Deckard and the replicant hunters of Do Androids Dream of Electric Sheep?\nIn Magnus Robot Fighter #15, “The Weird World of Mogul Badur,” there’s an explicit warning about humanity becoming too dependent on robots. Magnus and Leeja are taken to Sarkorum, a land isolated from the outside world for 800 years. The robots in Sarkorum, though, are still highly advanced and humans there have relinquished much of their independence to them. There’s a scene of robots feeding morbidly obese people, resting on floating couches. It bears a striking resemblance to the passengers on the Axion, in Wall-E. More importantly, this emphasis on social issues was very unusual for a comic of the time.\n(Another quality that Magnus Robot Fighter shares with prose sf is that it shows the limitations of science fiction as strictly an exercise in prediction. In issue three of the original run, robots are reading information from punched tapes.)\nAlong with the various robotic threats, Magnus and people of North Am are sometimes menaced by the Gophs, the residents of the lowest levels of the city. Leeja describes the Gophs as “criminals and anti-socials (who) resent all upper-level people.” Establishing that the paradise of North Am had a dark side was an unusual and memorable touch, and, again, it resonated with a classic: H.G.Wells’ The Time Machine.\nThe Gophs actually agreed with Magnus’ feelings about robots, but that wasn’t the only grievance they had with the upper-level “cloud-cloddies.” One of the major villains in Magnus’ first incarnation also felt that mankind had become too dependent on robots. The conflict arose in how he planned to solve this problem.\nIn his introduction in Magnus Robot Fighter #13, Dr. Laszlo Noel argued that all robots should be destroyed. That put Magnus in the interesting position of defending the status quo . . . at least in part. He replied, “All of the robots should not be destroyed. Robots are of use to mankind, but there should be fewer of them!” You didn’t see this sort of distinction when Superman battled Lex Luthor.\nAmong Magnus’ friends were Leeja Clane and the Outsiders, a group of teenagers who had embraced—or who were trying to embrace—Magnus’ philosophy. While she left most of the physical combat to Magnus, and occasionally needed rescuing, Leeja always came across as smart and strong-willed, unafraid to defy society’s expectations of her. She and Magnus meet when police robots try to arrest her. Shortly after their escape, she tells Magnus: “Fifteen minutes ago, I was only a daughter of Senator Clane. Now, I am a hunted robot resister . . . and I’m glad!” Later, she develops telepathic powers due to being the subject of experiments conducted by the renegade robot H8. These powers play a major role in the defeat of Malev-6, a planet-sized artificial intelligence.\nThe Outsiders started as a group of four boys, but, before long, they were joined by a girl. They liked Magnus and wanted to help him, but that didn’t mean that they didn’t make mistakes, like joining a paramilitary group controlled by Dr. Noel. For the time, the Outsiders were surprisingly multi-cultural: one boy was African-American; another had oriental ancestry and the girl was Native American. (Yes, those terms were undoubtedly different in their world, but that’s the clearest way to describe them in this one.)\nThese days this type of arrangement is considered a cliché in some quarters. However, when the Outsiders first appeared, the only analogous group was the bridge crew of the original starship Enterprise. The oriental member of the group was colored butter yellow,which seems like a less-than-enlightened approach now. Aside from that, though, none of the Outsiders could be called ethnic stereotypes; they were competent, admirable people. And introducing the Outsiders gave Magnus some teenaged sidekicks, without really giving him sidekicks.\nAfter Manning left the comic, Gold Key commissioned new stories from other creators. There was some real talent associated with these stories; Paul Norris drew the Brick Bradford newspaper strip and Dan Spiegle drew everything from Space Family Robinson to Blackhawk to Indiana Jones. Unfortunately, they were never able to maintain the level of quality that Manning and Craig established. The comic reverted to reprints, until it was cancelled in 1977.\nIn the early 1980s, Magnus resurfaced as a back-up strip in three issues of Doctor Solar, Man Of the Atom, another Gold Key comic. The first of these three stories—written by Roger McKenzie, with art by Frank Bolle—is particularly worth noting. This story is set in 1A’s underwater dome, shortly before Magnus returns to North Am. 1A tells him that the only way he’ll be leaving is if he destroys his robotic mentor. Magnus is supposed to be a robot fighter after all, and that includes fighting robots that he’s grown attached to. This disturbing idea proves to be a foreshadowing of the sort of questions that Magnus confronts in his next incarnation.\nIn 1991, Magnus Robot Fighter returned again, as part of the new Valiant comics line-up. Valiant featured both Gold Key characters, and original creations, such as the Harbingers (a team with some similarities to the X-Men) and Shadowman. The editor and head writer for the company was Jim Shooter, the former editor-in-chief at Marvel Comics. Shooter wrote—or co-wrote—the first 20 issues of the new Magnus. During that time, he both deepened the theme and came up with a clever twist to Magnus’ biography.\nThe thematic change was both simple and profound. The rogue robots of the 1960s were now freewill robots, and foremost among them was 1A. In the first issue of the new run, it’s established that there are approximately 10 million freewill robots in North Am . . . and they’re organizing.\nMagnus is reluctant to assume that all the freewill bots are killers; “Some may be well-balanced, but confused and afraid,” he says However, the panicky government wants a Final Solution to the problem of freewill robots. By issue two, Magnus is saying things like “I have killed rogues because it is my sworn duty to protect the lives of soft, arrogant human swine like you. I don’t like it and I don’t like you.” He destroys the leader of the freewill movement, but issue four ends with him extracting the robot communication monitor in his brain, and declaring himself a free man.\nYou probably won’t be surprised to hear that Magnus’ sense of duty eventually reasserts itself. However, he comes to think of himself as an outsider, not part of the power structure. In a later issue, he even identifies himself as a Goph.\nArt for these stories was provided by a variety of illustrators. The art was always slick and dynamic, but some artists came closer than others to matching Manning’s style.\nThe addition to the robot fighter’s back story was the revelation that he was the son of two members of the Harbingers. Another new character, the Geomancer, took baby Magnus into the future, to fulfill his destiny. In addition to tightening the continuity of the Valiant universe, the suggestion that Magnus was born with super powers provided a possible explanation of how he could “learn” to smash robots. (Steel is not enough, indeed.)\nTwo more Valiant comics—Rai and The Psi-Lords—were set in the 41st century. For a short time, Magnus appeared in two comics a month—his own book and the retooled Rai and the Future Force—as they fought an invasion from Malev-7, an upgraded version of the robot planet. This version of Magnus Robot Fighter ran for 64 issues. The next two revivals didn’t fare as well.\nWriter Tom Poyer turned Magnus into a fanatical technophobe who travelled back to the present in order to nip robot development in the bud. It was a plausible extrapolation of the character but if you were looking for a likeable protagonist, you weren’t going to find him here. In 2005, in another attempt to revive Magnus tried to put North Am’s robot problems in a larger context. It proposed that the conflict was caused by an alien race known as theTraffickers, as the prelude to an invasion. This approach, for better or for worse, lasted only one issue.\nShooter has returned to Magnus as the writer of the Dark Horse series, with Bill Reinhold providing the art. So far (after two appearances), Shooter seems to be focusing on humans using robots for criminal purposes, rather than artificial intelligences, and on character changes for Magnus and his cast. It looks like 1A is going to play a significant role in this story, and Magnus’ relationship with Leeja is nowhere near as simple as it used to be.\nIt’s too early to tell whether this new version of Magnus is likely to be nominated for the recently-established Hugo for graphic storytelling. The potential is definitely there, though.\nBill Spangler has been selling comic book scripts since the late 1980s, and has been writing about pop culture even longer. His most recent credits are a four-issue comic book revival of Tom Corbett, Space Cadet and a prose story starring the Green Hornet, scheduled to appear in the first volume of the The Green Hornet Chronicles. Bill's wife, Joyce, is a school psychologist and they live in Bucks County, Pennsylvania."}