{"fingerprint": "xzrpFC7J56HhckWK00W/3HxFgco=", "sitename": "Clarkesworld Magazine", "title": "The Halfway House at the Heart of Darkness by William Browning Spencer", "author": "William Browning Spencer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spencer_07_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Halfway House at the Heart of Darkness by William Browning Spencer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5710 words, short story, REPRINT\nThe Halfway House at the Heart of Darkness\nKeel wore a ragged shirt with the holo Veed There, Simmed That shimmering on it. She wore it in and out of the virtual. If she was in an interactive virtual, the other players sometimes complained. Amid the dragons and elves and swords of fire, a bramble-haired girl, obviously spiking her virtual with drugs and refusing to tune her shirt to something suitably medieval, could be distracting.\n“Fizz off,” Keel would say, in response to all complaints.\nKeel was difficult. Rich, self-destructive, beautiful, she was twenty years old and already a case study in virtual psychosis.\nShe had been rehabbed six times. She could have died that time on Makor when she went blank in the desert. She still bore the teeth marks of the land eels that were gnawing on her shoulder when they found her.\nA close one. You can’t revive the digested.\nNo one had to tell Keel that she was in rehab again. She was staring at a green ocean, huge white clouds overhead, white gulls filling the heated air with their cries.\nThey gave you these serenity mock-ups when they were bringing you around. They were fairly insipid and several shouts behind the technology. This particular V-run was embarrassing. The ocean wasn’t continuous, probably a seven-minute repeat, and the sun’s heat was patchy on her face.\nThe beach was empty. She was propped up in a lounge chair—no doubt her position back in the ward. With concentration, focusing on her spine, she could sense the actual contours of the bed, the satiny feel of the sensor pad.\nIt was work, this focusing, and she let it go. Always better to flow.\nFar to her right, she spied a solitary figure. The figure was moving toward her.\nIt was, she knew, a wilson. She was familiar with the drill. Don’t spook the patient. Approach her slowly after she is sedated and in a quiet setting.\nThe wilson was a fat man in a white suit (neo-Victorian, dead silly, Keel thought). He kept his panama hat from taking flight in the wind by clamping it onto his head with his right hand and leaning forward.\nKeel recognized him. She even remembered his name, but then It was the kind of name you’d remember: Dr. Max Marx.\nHe had been her counselor, her wilson, the last time she’d crashed. Which meant she was in Addiction Resources Limited, which was located just outside of New Vegas.\nDr. Marx looked up, waved, and came on again with new purpose.\nA pool of sadness welled in her throat. There was nothing like help, and its pale sister hope, to fill Keel’s soul with black water.\nFortunately, Dr. Max Marx wasn’t one of the hearty ones. The hearty ones were the worst. Marx was, in fact, refreshingly gloomy, his thick black beard and eyebrows creating a doomed stoic’s countenance.\n“Yes,” he said, in response to her criticism of the virtual, “this is a very miserable effect. You should see the sand crabs. They are laughable, like toys.” He eased himself down on the sand next to her and took his hat off and fanned it in front of his face. “I apologize. It must be very painful, a connoisseur of the vee like you, to endure this.”\nKeel remembered that Dr. Marx spoke in a manner subject to interpretation. His words always held a potential for sarcasm.\n“We are portable,” Dr. Marx said. “We are in a mobile unit, and so, alas, we don’t have the powerful stationary AdRes equipment at our command. Even so, we could do better, there are better mock-ups to be had, but we are not prospering these days. Financially, it has been a year of setbacks, and we have had to settle for some second-rate stuff.”\n“I’m not in a hospital?” Keel asked.\nMarx shook his head. “No. No hospital.”\nKeel frowned. Marx, sensing her confusion, put his hat back on his head and studied her through narrowed eyes. “We are on the run, Keel Benning. You have not been following the news, being otherwise occupied, but companies like your beloved Virtvana have won a major legislative battle. They are now empowered to maintain their customer base aggressively. I believe the wording is ‘protecting customer assets against invasive alienation by third-party services.’ Virtvana can come and get you.”\nKeel blinked at Dr. Marx’s dark countenance. “You can’t seriously think someone would . . . what? . . . kidnap me?”\nDr. Marx shrugged. “Virtvana might. For the precedent. You’re a good customer.”\n“Vee moguls are going to sweat the loss of one spike? That’s crazy.”\nDr. Marx sighed, stood up, whacked sand from his trousers with his hands. “You noticed then? That’s good. Being able to recognize crazy, that is a good sign. It means there is hope for your own sanity.”\nHer days were spent at the edge of the second-rate ocean. She longed for something that would silence the Need. She would have settled for a primitive bird-in-flight simulation. Anything. Some corny sex-with-dolphins loop—or something abstract, the color red leaking into blue, enhanced with aural-D.\nShe would have given ten years of her life for a game of Apes and Angels, Virtvana’s most popular package. Apes and Angels wasn’t just another smooth metaphysical mix—it was the true religion to its fans. A gamer started out down in the muck on Libido Island, where the senses were indulged with perfect, shimmerless sims. Not bad, Libido Island, and some gamers stayed there a long, long time. But what put Apes and Angels above the best pleasure pops was this: A player could evolve spiritually. If you followed the Path, if you were steadfast, you became more compassionate, more aware, at one with the universe . . . all of which was accompanied by feelings of euphoria.\nKeel would have settled for a legal rig. Apes and Angels was a chemically enhanced virtual, and the gear that true believers wore was stripped of most safeguards, tuned to a higher reality.\nIt was one of these hot pads that had landed Keel in Addiction Resources again.\n“It’s the street stuff that gets you in trouble,” Keel said. “I’ve just got to stay clear of that.”\n“You said that last time,” the wilson said. “You almost died, you know.”\nKeel felt suddenly hollowed, beaten. “Maybe I want to die,” she said.\nDr. Marx shrugged. Several translucent seagulls appeared, hovered over him, and then winked out. “Bah,” he muttered. “Bad therapy-V, bad, death-wishing clients, bad career choice. Who doesn’t want to die? And who doesn’t get that wish, sooner or later?”\nOne day, Dr. Marx said, “You are ready for swimming.”\nIt was morning, full of a phony, golden light. The nights were black and dreamless, nothing, and the days that grew out of them were pale and untaxing. It was an intentionally bland virtual, its sameness designed for healing.\nKeel was wearing a one-piece, white bathing suit. Her counselor wore bathing trunks, baggy with thick black vertical stripes; he looked particularly solemn, in an effort, no doubt, to counteract the farcical elements of rotund belly and sticklike legs.\nKeel sighed. She knew better than to protest. This was necessary. She took her wilson’s proffered hand, and they walked down to the water’s edge. The sand changed from white to gray where the water rolled over it, and they stepped forward into the salt-smelling foam.\nHer legs felt cold when the water enclosed them. The wetness was now more than virtual. As she leaned forward and kicked, her musc1es, taut and frayed, howled.\nShe knew the machines were exercising her now. Somewhere her real body, emaciated from long neglect, was swimming in a six-foot aquarium whose heavy seas circulated to create a kind of liquid treadmill. Her lungs ached; her shoulders twisted into monstrous knots of pain.\nIn the evening, they would talk, sitting in their chairs and watching the ocean swallow the sun, the clouds turning orange, the sky occasionally spotting badly, some sort of pixel fatigue.\n“If human beings are the universe’s way of looking at itself,” Dr. Marx said, “then virtual reality is the universe’s way of pretending to look at itself.”\n“You wilsons are all so down on virtual reality,” Keel said. “But maybe it is the natural evolution of perception. I mean, everything we see is a product of the equipment we see it with. Biological, mechanical, whatever.”\nDr. Marx snorted. “Bah. The old ‘everything-is-virtual’ argument. I am ashamed of you, Keel Benning. Something more original, please. We wilsons are down on virtual addiction because everywhere we look we see dead philosophers. We see them and they don’t look so good. We smell them, and they stink. That is our perception, our primitive reality.”\nThe healing was slow, and the sameness, the boredom, was a hole to be filled with words. Keel talked, again, about the death of her parents and her brother. They had been over this ground the last time she’d been in treatment, but she was here again, and so it was said again.\n“I’m rich because they are dead,” she said.\nIt was true, of course, and Dr. Marx merely nodded, staring in front of him. Her father had been a wealthy man, and he and his young wife and Keel’s brother, Calder, had died in a freak air-docking accident while vacationing at Keypond Terraforms. A “sole survivor” clause in her father’s life insurance policy had left Keel a vast sum.\nShe had been eleven at the time—and would have died with her family had she not been sulking that day, refusing to leave the hotel suite.\nShe knew she was not responsible, of course. But it was not an event you wished to dwell on. You looked, naturally, for powerful distractions.\n“It is a good excuse for your addiction,” Dr. Marx said. “If you die, maybe God will say, ‘I don’t blame you.’ Or maybe God will say, ‘Get real. Life’s hard.’ I don’t know. Addiction is in the present, not the past. It’s the addiction itself that leads to more addictive behavior.”\nKeel had heard all this before. She barely heard it this time. The weariness of the evening was real, brought on by the day’s physical exertions. She spoke in a kind of woozy, presleep fog, finding no power in her words, no emotional release.\nOf more interest were her counselor’s words. He spoke with rare candor, the result, perhaps, of their fugitive status, their isolation.\nIt was after a long silence that he said, “To tell you the truth, I’m thinking of getting out of the addiction treatment business. I’m sick of being on the losing side.”\nKeel felt a coldness in her then, which, later, she identified as fear.\nHe continued: “They are winning. Virtvana, MindSlide, Right to Flight. They’ve got the sex, the style, and the flash. All we wilsons have is a sense of mission, this knowledge that people are dying, and the ones that don’t die are being lost to lives of purpose.\n“Maybe we’re right—sure, we’re right—but we can’t sell it. In two, three days we’ll come to our destination and you’ll have to come into Big R and meet your fellow addicts. You won’t be impressed. It’s a henry-hovel in the Slash. It’s not a terrific advertisement for Big R.”\nKeel felt strange, comforting her wilson. Nonetheless, she reached forward and touched his bare shoulder. “You want to help people. That is a good and noble impulse.”\nHe looked up at her, a curious nakedness in his eyes. “Maybe that is hubris.\n“Hubris?”\n“Are you not familiar with the word? It means to try to steal the work of the gods.”\nKeel thought about that in the brief moment between the dimming of the seascape and the nothingness of night. She thought it would be a fine thing to do, to steal the work of the gods.\nDr. Marx checked the perimeter, the security net. All seemed to be in order. The air was heavy with moisture and the cloying odor of mint. This mint scent was the olfactory love song of an insect-like creature that flourished in the tropical belt. The creature looked like an unpleasant mix of spider and wasp. Knowing that the sweet scent came from it, Dr. Marx breathed shallowly and had to fight against an inclination to gag. Interesting, the way knowledge affected one. An odor, pleasant in itself, could induce nausea when its source was identified.\nHe was too weary to pursue the thought. He returned to the mobile unit, climbed in and locked the door behind him. He walked down the corridor, paused to peer into the room where Keel rested, sedated electrically.\nHe should not have spoken his doubts. He was weary, depressed, and it was true that he might very well abandon this crumbling profession. But he had no right to be so self-revealing to a client. As long as he was employed, it behooved him to conduct himself in a professional manner.\nKeel’s head rested quietly on the pillow. Behind her, on the green panels, her heart and lungs created cool, luminous graphics. Physically, she was restored. Emotionally, mentally, spiritually, she might be damaged beyond repair.\nHe turned away from the window and walked on down the corridor. He walked past his sleeping quarters to the control room. He undressed and lay down on the utilitarian flat and let the neuronet embrace him. He was aware, as always, of guilt and a hangdog sense of betrayal.\nThe virtual had come on the Highway two weeks ago. He’d already left Addiction Resources with Keel, traveling west into the wilderness of Pit Finitum, away from the treatment center and New Vegas.\nKnow the enemy. He’d sampled all the vees, played at lowest res with all the safeguards maxed, so that he could talk knowledgeably with his clients. But he’d never heard of this virtual—and it had a special fascination for him. It was called Halfway House.\nA training vee, not a recreational one, it consisted of a series of step-motivated, instructional virtuals designed to teach the apprentice addictions counselor his trade.\nSo why this guilt attached to methodically running the course?\nWhat guilt?\nThat guilt.\nOkay. Well . . .\nThe answer was simple enough: Here all interventions came to a good end, all problems were resolved, all clients were healed.\nSo far he had intervened on a fourteen-year-old boy addicted to Clawhammer Comix, masterfully diagnosed a woman suffering from Leary’s syndrome, and led an entire group of mix-feeders through a nasty withdrawal episode.\nHe could tell himself he was learning valuable healing techniques.\nOr he could tell himself that he was succumbing to the world that killed his clients, the hurt-free world where everything worked out for the best, good triumphed, bad withered and died, rewards came effortlessly—and if that was not enough, the volume could always be turned up.\nHe had reservations. Adjusting the neuronet, he thought, “I will be careful.” It was what his clients always said.\nKeel watched the insipid ocean, waited. Generally, Dr. Marx arrived soon after the darkness of sleep had fled. He did not come at all. When the sun was high in the sky, she began to shout for him. That was useless, of course.\nShe ran into the ocean, but it was a low res ghost and only filled her with vee-panic. She stumbled back to the beach chair, tried to calm herself with a rational voice: Someone will come.\nBut would they? She was, according to her wilson, in the wilds of Pit Finitum, hundreds of miles to the west of New Vegas, traveling toward a halfway house hidden in some dirty corner of the mining warren known as the Slash.\nDarkness came, and the programmed current took her into unconsciousness.\nThe second day was the same, although she sensed a physical weakness that emanated from Big R. Probably nutrients in one of the IV pockets had been depleted. I’ll die, she thought. Night snuffed the thought.\nA new dawn arrived without Dr. Marx. Was he dead? And if so, was he dead by accident or design? And if by design, whose? Perhaps he had killed himself; perhaps this whole business of Virtvana’s persecution was a delusion.\nKeel remembered the wilson’s despair, felt a sudden conviction that Dr. Marx had fled Addiction Resources without that center’s knowledge, a victim of the evangelism/paranoia psychosis that sometimes accompanied counselor burnout.\nKeel had survived much in her twenty years. She had donned some deadly v-gear and made it back to Big R intact. True, she had been saved a couple of times, and she probably wasn’t what anyone would call psychologically sound, but . . . it would be an ugly irony if it was an addictions rehab, an unhinged wilson, that finally killed her.\nKeel hated irony, and it was this disgust that pressed her into action.\nShe went looking for the plug. She began by focusing on her spine, the patches, the slightly off-body temp of the sensor pad. Had her v-universe been more engrossing, this would have been harder to do, but the ocean was deteriorating daily, the seagulls now no more than scissoring disruptions in the mottled sky.\nOn the third afternoon of her imposed solitude, she was able to sit upright in Big R. It required all her strength, the double-think of real Big-R motion while in the virtual. The affect in vee was to momentarily tilt the ocean and cause the sky to leak blue pixels into the sand.\nHad her arms been locked, had her body been glove-secured, it would have been wasted effort, of course, but Keel’s willing participation in her treatment, her daily exercise regimen, had allowed relaxed physical inhibitors. There had been no reason for Dr. Marx to anticipate Keel’s attempting a Big-R disruption.\nShe certainly didn’t want to.\nThe nausea and terror induced by contrary motion in Big R while simulating a virtual was considerable.\nKeel relied on gravity, shifting, leaning to the right. The bed shifted to regain balance.\nShe screamed, twisted, hurled herself sideways into Big R.\nAnd her world exploded. The ocean raced up the beach, a black tidal wave that screeched and rattled as though some monstrous mechanical beast were being demolished by giant pistons.\nBlack water engulfed her. She coughed and it filled her lungs. She flayed; her right fist slammed painfully against the side of the container, making it hum.\nShe clambered out of the exercise vat, placed conveniently next to the bed, stumbled, and sprawled on the floor in naked triumph.\n“Hello Big R,” she said, tasting blood on her lips.\nDr. Marx had let the system ease him back into Big R. The sessions room dimmed to glittering black, then the light returned. He was back in the bright control room. He removed the neuronet, swung his legs to the side of the flatbed, stretched. It had been a good session. He had learned something about distinguishing (behaviorally) the transitory feedback psychosis called frets from the organic v-disease, Viller’s Pathway.\nThis Halfway House was proving to be a remarkable instructional tool. In retrospect, his fear of its virtual form had been pure superstition. He smiled at his own irrationality.\nHe would have slept that night in ignorance, but he decided to give the perimeter of his makeshift compound a last security check before retiring.\nTo that effect, he dressed and went outside.\nIn the flare of the compound lights, the jungle’s purple vegetation looked particularly unpleasant, like the swollen limbs of long-drowned corpses. The usual skittering things made a racket. There was nothing in the area inclined to attack a man, but the planet’s evolution hadn’t stinted on biting and stinging vermin, and . . .\nAnd one of the vermin was missing.\nHe had, as always, been frugal in his breathing, gathering into his lungs as little of the noxious atmosphere as possible. The cloying mint scent never failed to sicken him.\nBut the odor was gone.\nIt had been there earlier in the evening, and now it was gone. He stood in jungle night, in the glare of the compound lights, waiting for his brain to process this piece of information, but his brain told him only that the odor had been there and now it was gone.\nStill, some knowledge of what this meant was leaking through, creating a roiling fear.\nIf you knew what to look for, you could find it. No vee was as detailed as nature.\nYou only had to find one seam, one faint oscillation in a rock, one incongruent shadow.\nIt was a first-rate sim, and it would have fooled him. But they had had to work fast, fabricating and downloading it, and no one had noted that a nasty alien bug filled the Big-R air with its mating fragrance.\nDr. Marx knew he was still in the vee. That meant, of course, that he had not walked outside at all. He was still lying on the flat. And, thanks to his blessed paranoia, there was a button at the base of the flat, two inches from where his left hand naturally lay. Pushing it would disrupt all current and activate a hypodermic containing twenty cc’s of hapotile-4. Hapotile-4 could get the attention of the deepest v-diver. The aftereffects were not pleasant, but, for many v-devotees, there wouldn’t have been an “after” without hapotile.\nDr. Marx didn’t hesitate. He strained for the Big R, traced the line of his arm, moved. It was there; he found it. Pressed.\nNothing.\nThen, out of the jungle, a figure came.\nEight feet tall, carved from black steel, the vee soldier bowed at the waist. Then, standing erect, it spoke: “We deactivated your failsafe before you embarked, Doctor.”\n“Who are you?” He was not intimidated by this military mockup, the boom of its metal voice, the faint whine of its servos. It was a virtual puppet, of course. Its masters were the thing to fear.\n“We are concerned citizens,” the soldier said. “We have reason to believe that you are preventing a client of ours, a client-in-good-credit, from satisfying her constitutionally sanctioned appetites.”\n“Keel Benning came to us of her own free will. Ask her and she will tell you as much.”\n“We will ask her. And that is not what she will say. She will say, for all the world to hear, that her freedom was compromised by so-called caregivers.”\n“Leave her a1one.”\nThe soldier came closer. It looked up at the dark blanket of the sky. “Too late to leave anyone alone, Doctor. Everyone is in the path of progress. One day we will all live in the vee. It is the natural home of gods.”\nThe sky began to glow as the black giant raised its gleaming arms.\n“You act largely out of ignorance,” the soldier said. “The godseekers come, and you treat them like aberrations, like madmen burning with sickness. This is because you do not know the virtual yourself. Fearing it, you have confined and studied it. You have refused to taste it, to savor it.”\nThe sky was glowing gold, and figures seemed to move in it, beautiful, winged humanforms.\nVirtvana, Marx thought. Apes and Angels.\nIt was his last coherent thought before enlightenment.\n“I give you a feast,” the soldier roared. And all the denizens of heaven swarmed down, surrounding Dr. Marx with love and compassion and that absolute, impossible distillation of a hundred thousand insights that formed a single, tear-shaped truth: Euphoria.\nKeel found she could stand. A couple of days of inaction hadn’t entirely destroyed the work of all that exercise. Shakily, she navigated the small room. The room had the sanitized, hospital look she’d grown to know and loathe. If this room followed the general scheme, the shelves over the bed should contain . . . They did, and Keel donned one of the gray, disposable client suits.\nShe found Dr. Marx by the noise he was making, a kind of huh, huh, huh delivered in a monotonous chant and punctuated by an occasional Ah! The sounds, and the writhing, near-naked body that lay on the table emitting these sounds, suggested to Keel that her doctor, naughty man, might be auditing something sexual on the virtual.\nBut a closer look showed signs of v-overload epilepsy. Keel had seen it before and knew that one’s first inclination, to shut down every incoming signal, was not the way to go. First you shut down any chemical enhancers—and, if you happened to have a hospital handy (as she did), you slowed the system more with something like clemadine or hetlin—then, if you were truly fortunate and your spike was epping in a high-tech detox (again, she was so fortunate), you plugged in a regulator, spliced it and started running the signals through that, toning them down.\nKeel got to it. As she moved, quickly, confidently, she had time to think that this was something she knew about (a consumer’s knowledge, not a tech’s, but still, her knowledge was extensive).\nDr. Marx had been freed from the virtual for approximately ten minutes (but was obviously not about to break the surface of Big R), when Keel heard the whine of the security alarm. The front door of the unit was being breached with an L-saw.\nKeel scrambled to the corridor where she’d seen the habitat sweep. She swung the ungainly tool around, falling to one knee as she struggled to unbolt the barrel lock. Fizzing pocky low-tech grubber.\nThe barrel-locking casing clattered to the floor just as the door collapsed.\nThe man in the doorway held a weapon, which, in retrospect, made Keel feel a little better. Had he been weaponless, she would still have done what she did.\nShe swept him out the door. The sonic blast scattered him across the cleared area, a tumbling, bloody mass of rags and unraveling flesh, a thigh bone tumbling into smaller bits as it rolled under frayed vegetation.\nShe was standing in the doorway when an explosion rocked the unit and sent her crashing backward. She crawled down the corridor, still lugging the habitat gun, and fell into the doorway of a cluttered storage room. An alarm continued to shriek somewhere.\nThe mobile now lay on its side. She fired in front of her. The roof rippled and roared, looked like it might hold, and then flapped away like an unholy, howling v-demon, a vast silver blade that smoothly severed the leafy tops of the jungle’s tallest sentinels. Keel plunged into the night, ran to the edge of the unit and peered out into the glare of the compound lights.\nThe man was crossing the clearing.\nShe crouched, and he turned, sensing motion. He was trained to fire reflexively but he was too late. The rolling sonic blast from Keel’s habitat gun swept man and weapon and weapon’s discharge into roiling motes that mixed with rock and sand and vegetation, a stew of organic and inorganic matter for the wind to stir.\nKeel waited for others to come but none did.\nFinally, she reentered the mobile to retrieve her wilson, dragging him (unconscious) into the scuffed arena of the compound.\nLater that night, exhausted, she discovered the aircraft that had brought the two men. She hesitated, then decided to destroy it. It would do her no good; it was not a vehicle she could operate, and its continued existence might bring others.\nThe next morning, Keel’s mood improved when she found a pair of boots that almost fit. They were a little tight but, she reasoned, that was probably better than a little loose. They had, according to Dr. Marx, a four-day trek ahead of them.\nDr. Marx was now conscious but fairly insufferable. He could talk about nothing but angels and the Light. A long, hard dose of Apes and Angels had filled him with fuzzy love and an uncomplicated metaphysics in which smiling angels fixed bad stuff and protected all good people (and, it went without saying, all people were good).\nKeel had managed to dress Dr. Marx in a suit again, and this restored a professional appearance to the wilson. But, to Keel’s dismay, Dr. Marx in virtual-withdrawal was a shameless whiner.\n“Please,” he would implore. “Please, I am in terrible terrible Neeeeeeed.”\nHe complained that the therapy-v was too weak, that he was sinking into a catatonic state. Later, he would stop entirely, of course, but now, please, something stronger . . . .\nNo.\nHe told her she was heartless, cruel, sadistic, vengeful. She was taking revenge for her own treatment program, although, if she would just recall, he had been the soul of gentleness and solicitude.\n“You can’t be in virtual and make the journey,” Keel said. “I need you to navigate. We will take breaks, but I’m afraid they will brief. Say goodbye to your mobile.”\nShe destroyed it with the habitat sweep, and they were on their way. It was a limping, difficult progress, for they took much with them: food, emergency camping and sleeping gear, a portable, two-feed v-rig, the virtual black box, and the security image grabs. And Dr. Marx was not a good traveler.\nIt took six days to get to the Slash, and then Dr. Marx said he wasn’t sure just where the halfway house was.\n“What?”\n“I don’t know. I’m disoriented.”\n“You’ll never be a good v-addict,” Keel said. “You can’t lie.”\n“I’m not lying!” Dr. Marx snapped, goggle-eyed with feigned innocence.\nKeel knew what was going on. He wanted to give her the slip and find a v-hovel where he could swap good feelings with his old angel buddies. Keel knew.\n“I’m not letting you out of my sight,” she said.\nThe Slash was a squalid mining town with every vice a disenfranchised population could buy. It had meaner toys than New Vegas, and no semblance of law.\nKeel couldn’t just ask around for a treatment house. You could get hurt that way.\nBut luck was with her. She spied the symbol of a triangle inside a circle on the side of what looked like an abandoned office. She watched a man descend a flight of stairs directly beneath the painted triangle. She followed him.\n“Where are we going?” Dr. Marx said. He was still a bundle of tics from angel-deprivation.\nKeel didn’t answer, just dragged him along. Inside, she saw the “Easy Does It” sign and knew everything was going to be okay.\nAn old man saw her and waved. Incredibly, he knew her, even knew her name. “Keel,” he shouted. “I’m delighted to see you.”\n,It’s a small world, Solly.”\n“It’s that. But you get around some too. You cover some ground, you know. I figured ground might be covering you by now.”\nKeel laughed. “Yeah.” She reached out and touched the old man’s arm. “I’m looking for a house,” she said.\nIn Group they couldn’t get over it. Dr. Max Marx was a fizzing client. This amazed everyone, but two identical twins, Sere and Shona, were so dazed by this event that they insisted on dogging the wilson’s every move. They’d flank him, peering into his eyes, trying to fathom this mystery by an act of unrelenting scrutiny.\nBrake Madders thought it was a narc thing and wanted to hurt Marx.\n“No, he’s one of us,” Keel said.\nAnd so, Keel thought, am I.\nWhen Dr. Max Marx was an old man, one of his favorite occupations was to reminisce. One of his favorite topics was Keel Benning. He gave her credit for saving his life, not only in the jungles of Pit Finitum but during the rocky days that followed when he wanted to flee the halfway house and find, again, virtual nirvana.\nShe had recognized every denial system and thwarted it with logic. When logic was not enough, she had simply shared his sadness and pain and doubt.\n“I’ve been there,” she had said.\nThe young wilsons and addiction activists knew Keel Benning only as the woman who had fought Virtvana and MindSlip and the vast lobby of Right to Flight, the woman who had secured a resounding victory for addicts’ rights and challenged the spurious thinking that suggested a drowning person was drowning by choice. She was a hero, but, like many heroes, she was not, to a newer generation, entirely real.\n“I was preoccupied at the time,” Dr. Marx would tell young listeners. “I kept making plans to slip out and find some Apes and Angels. You weren’t hard pressed then—and you aren’t now—to find some mind-flaming vee in the Slash. My thoughts would go that way a lot.\n“So I didn’t stop and think, ‘Here’s a woman who’s been rehabbed six times; it’s not likely she’ll stop on the seventh. She’s just endured some genuine nasty events, and she’s probably feeling the need for some quality downtime.’\n“What I saw was a woman who spent every waking moment working on her recovery. And when she wasn’t doing mental, spiritual, or physical push-ups she was helping those around her, all us shaking, vision-hungry, fizz-headed needers.\n“I didn’t think, ‘What the hell is this?’ back then. But I thought it later. I thought it when I saw her graduate from medical school.”\n“When she went back and got a law degree, so she could fight the bastards who wouldn’t let her practice addiction medicine properly, I thought it again. That time, I asked her. I asked her what had wrought the change.”\nDr. Marx would wait as long as it took for someone to ask, “What did she say?”\n“It unsettled me some,” he would say, then wait again to be prompted.\nThey’d prompt.\n“‘Helping people,’ she’d said. She’d found it was a thing she could do, she had a gift for it. All those no-counts and dead-enders in a halfway house in the Slack. She found she could help them all.”\nDr. Marx saw it then, and saw it every time after that, every time he’d seen her speaking on some monolith grid at some rally, some hearing, some whatever. Once he’d seen it, he saw it every time: that glint in her eye, the incorrigible, unsinkable addict.\n“People,” she had said. “What a rush.”\nOriginally published in Lord of the Fantastic: Stories in Honor of Roger Zelazny, edited by Martin H. Greenberg, 1998.\nWilliam Browning Spencer was born in Washington, D.C. and now lives in Austin, Texas. His first novel, Maybe I'll Call Anna, was published in 1990 and won a New American Writing Award, and he has subsequently made quite a reputation for himself with quirky, eccentric, eclectic novels that dance on the borderlines between horror, fantasy, and black comedy, novels such as Resume with Monsters, Zod Wallop, and Irrational Fears. His short work has been collected in The Return of Count Electric and Other Stories and The Ocean and All of Its Devices."}