{"fingerprint": "DiH4Nc8aDe/41NUduPQfz8BegSo=", "sitename": "Clarkesworld Magazine", "title": "Xiaolongbao: Soup Dumplings by D.A. Xiaolin Spires", "author": "D A Xiaolin Spires", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spires_09_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Xiaolongbao: Soup Dumplings by D.A. Xiaolin Spires", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5720 words, short story\nXiaolongbao: Soup Dumplings\nThe sky swelled with vermilion. Each step that I took toward the rosy jade grove, the redder and denser it got. It looked like the sky soaked itself into my mom’s old lipstick. I stood paralyzed for a moment by the thought of her lips, moving in her signature hushed way, reading to me, about math, about our family history, or at least what she remembered of it. The dire warmth in my hands woke me from my reverie. The steam from the xiaolongbao dumplings peeped through the basket resting on my palms and wafted upward, its faded gray mixing with the vermilion, as if feeding fuel into these flame-burned heavens.\nI shook my head and returned my focus straight ahead. My gaze pierced through the woods, and I picked up my pace, maneuvering through the rough stones. I rushed over to Lihui’s house. She had lost her mom, too—and today was the death anniversary. The illness that started from the journey here and ate away at my mom over the years also consumed her mom. A quantum bacteria, they called it. Not exactly organic, but a pestilence nonetheless, and one whose fatal bite may be worse than any cancer.\nWe bonded over our sadness, over our sudden unwanted independence, and after the funeral—over pork and bamboo covered in a thin sheet of chewy translucent wheat—transplanted wheat that my mom had brought with her and grew here. After we consoled ourselves with food, we whispered about all the things we could remember about the two. The steamed dumplings I prepared were an exact replica of how my mom used to make them . . . nineteen folds. A fold for each year of my life . . . with ten folds representing the decades my mom wasn’t there, as she and Lihui’s mom—Ayi—as I called her, passed when I was nine. Lihui was seven then.\nWhen I arrived at Lihui’s house, I removed my shoes, dusted the rosy jade leaf dust off my shoulders and from the basket. I pulled out a photo and laid it next to Ayi’s. We placed the basket in front of the altars as offerings, lit incense, and said our prayers to our respective moms. I burned some joss paper in the shape of their favorite dumplings as we consumed the fleshy version that I brought and offered. They were so juicy, and we ate them, turning away from the altar and instead watching the sky shift to even darker shades of crimson.\nIt was then that we noticed the first burst in the sky.\nThe rosy jade grove sat between our two biggest settlements. We got everything from its resources. Okay, that was a bit of an exaggeration, but we did dust for its powder, which we baked into foods, medicine, and used it as a spice-enhancement. It had great fertilizing properties, too.\nLihui shook one of the trees and the dust covered her hands. She began to lick it.\n“Lihui, you’re not supposed to . . . ”\n“Aw, come on Chiu. Lighten up a bit,” she said. “It’s not like anyone’s around. Besides, it’s good for the soil.”\n“Yeah?”\nShe sprinkled some on the ground. “Of course.”\nShe continued upward, licking her arms. I hesitated but did the same. It’s been years since I’ve been so rebellious—you’re supposed to wait until you’re out of the groves before tasting its parts. A superstition that the groves were watching, and you shouldn’t feed on it in its presence. But it’s been years since the grove has been this empty, and I wasn’t really one to think the groves could really see in that way anyway.\nI took another lick. I didn’t think the flavor ever tasted as good as it did now or maybe my memory deceived me. It had a nutty flavor now, but in another twenty minutes, I knew the flavor would change depending on the input from the skies, the wind, and the direction the pole-like trees were facing.\nI sat, grasping on to a tree, and started shimmying upward. Lihui was ahead of me, goading me on as she raced me, peppering her movements with cheerful insults, pumping her strong arms, and working her way up another trunk. “Come on, where’d all your muscles go? Burned away with the red sky?” She laughed.\nThe image of the first burst seared into my head. I shook it away, shimmying faster.\nShe smudged some of the dust off her face and pretended to throw it at me. I ducked.\nIt was a game we’d been playing since we were kids. Racing up toward the heavens. The jade trees (faux-bamboos, as some of us call them) bent from our weight as we neared their tops, but they still handled us pretty well. I used the empty basket from dumplings to fill with rosy jade leaves. I bent the leaves at different angles once I collected them—it created a sear in their fiber that released a relaxing chemical. It helped them start the fermentation process for longer keeping, with different angles producing different flavors.\nLihui picked up a jadeberry and chucked it at me. She laughed while I dodged the berry and ended up scattering a dozen folded leaves toward the ground below. There goes the tea for tonight, the powders for dumpling meat, and the fibers for the weave-threads, I thought, grimacing.\nI heard a jump and a swinging, and Lihui was off to another trunk below me. Of course, she was Lihui, so she was ready to salvage what she wasted. She held up her basket in mid-swing and caught a few of my scattered leaves and reached for others.\n“This isn’t New Year’s! No need to shed confetti,” she said.\n“You provoked it,” I said, nodding my chin at her.\n“You dropped them.” She grinned.\n“You’re in an awfully good mood for the death anniversary.” I plucked off another leaf, dusting it off.\nHer face fell.\nI looked at the sky for a moment and the angle of the faux-bamboo. They were beginning to tilt toward one direction. Usually, their canopies faced in all various ways, but sometimes when celestial occurrences were impending, they started to bend in a synchronized way.\nI didn’t dare talk about the burst. There was too much there, too much fear, too much of everything. I bent the leaf at the third mark and stuck it in my basket. “ . . . and wasting resources while at it.”\nAt that she sobered up a bit, turned to me with her clear, piercing eyes, and said, “It’s the day after death anniversary. I’m celebrating life.” I did hear a tinge of sadness in her voice. I wondered if she was thinking about her mother or the mark in the sky.\nThe way the faux-bamboo were tilting. The first signifying that the prophecy of impending doom might be right after all.\n“The jadeberries are getting redder,” I said.\nI didn’t want to think about it. Clinging to the pole-like trunk of the jade tree, I wiped one berry on my shorts and popped it in my mouth. Sweet, but tangy.\nI chucked one back at her. She was dexterous enough to catch it and slip it down her throat.\nWe chewed on another. Sweet. Again. This would be a good harvest.\nBut, underneath that, a trace of bitterness. I spat out the seed onto the ground of the grove below me. The seeds were edible but not exactly tasty. Besides, sometimes it was fun to watch the seed plop against the bottom trunks—which were turning from a healthy pink to a strange shade of violet. I wondered if we would all be around to see this seed grow into a tree. Or if there would be a grove left at all for it to grow in.\nI gave my legs some slack and plunged downward, while clinging lightly to the trees during the fall. My stomach flew into my throat, and I shivered, licking my lips. The bitter aftertaste of seeds in my mouth blossomed as I free fell toward the bottom.\nAbove me, I heard Lihui pull the same maneuver. She was shouting “whooopeee” as she fell.\nThe sound of another explosion rumbled in the sky. It left an audible wake of searing static as a new pattern that flickered between clouds.\nThe bowl in my hands shook. Ground jadeberry seeds spilled onto the table and floor, staining the surfaces red.\nLihui was handling the dough and a puff of rose jade leaf powder rose up from her bowl.\nI counted to three.\nThe pulsing steadied.\nA visible line appeared outside the window, like the silhouette of a faux-bamboo stem etched in the red sky.\nI traced it with my fingers, pretending to feel the line from the first burst. And now this one, pointing toward it like a V.\nLihui next to me drew two lines nearly touching into the spilled seeds with her index finger, mixing xiaolongbao dough with the ingredients for the filling. An aroma of raw meat and flour wafted into the air.\n“And then there were two,” she said, giving me a pointed look. I nodded.\nI knew what she was thinking. The prophecy.\nMy mom used to say: “Chiu, there is an art and serenity to crisp folds. A kind of magic.”\nThe steam of the iron would cloud over her expression and then it would clear, revealing her limpid brown eyes. She looked determined, like a dragon summoning rain. And then it would come again, another billow of steam. Her arm movements were swift, rolling over our tees and our qipaos of special occasions with the heat of the iron.\nIt was silly, I guess, just clothes, but she packaged them into neat bundles: flat, angled, firm.\nIt was just like how she made her xiaolongbao. A crown of nineteen perfect pleats met at the top in a cusp.\nCrisp folds.\nI popped a folded rose jade leaf in my mouth, tasting its spice.\nWhen the casket lid folded over my mom with an audible creak at the hinge, I remembered, “There is an art and serenity to crisp folds.”\nAnd with that creak, I felt my anchor to my last world disappear. I was like the laundry that tumbled around in the washer. Wrapped up, wrinkled, wrought up into knots.\nI ran after her as they pushed her body into the gaping maw of the restricted area. I struggled with the machine operators, trying to elbow my way in, but they held me back.\nIn my struggle, a ball of heat hit my face. The dry heat of the incinerator was so fiery—so different from the warm steam of the iron that reminded me of my mom. Similar steam rose up from the cooked dumplings that she would ladle into porcelain spoons for us.\nThe maw closed behind her, swallowing her up. After that, I just felt limp.\nThat was the last time I saw my mom, or what was left of her.\nThey dragged me out before I even knew to cry.\nAs I trudged back to my settlement, telling myself to put one foot in front of the next as I kicked up stones, I thought about her creations.\nI always liked how structured her creations looked. A tower of well-pressed garments. A faux-bamboo dish of methodically arranged dumplings, symmetrical and homologous in concentric circles. Their folded whorls of tops all pinched to perfection.\nEven the casket she designed months in advance was so beautifully and intricately carved—faux-bamboo curving toward each other in an unusual way. Dotting the angular design was the gentle curve of embossed jadeberry forms, delicate like sparkling constellations.\nAnd now it was dust.\nI couldn’t help but think of her when I needed something systematized to hold me together.\nThe lines in the sky unnerved me. I wish I could hold on to her hand, have her massage the creases in my palm with her rough, warm fingers.\nInstead, I clasped on to the sides of the T-shirt I was wearing, caking flour onto the fabric. I dragged my mind back to the present.\n“A couple more teaspoons of silken sauce,” I said. Lihui dropped them into the bowl of filling.\n“Would you like me to do the honors?” Lihui asked, making a mixing gesture with her arm. Maybe she noticed my hands were still shaking.\n“No. I got this.” I held the spatula firm as I stirred in circles, clockwise then counterclockwise. I was counting rotations to myself.\nI paused when the mixture was glossy and tinged ruddy brown with sauce. Lihui shook her head, and I agreed. There were still some chunks.\nI continued stirring, wanting the fillings to be even more smooth and incorporated.\nThat’s when the rumblings began to increase and I dropped the spatula, which got stuck in the bowl like a shoe caught on rocks.\nI lost count of the orbits the spatula in my hand made within the bowl. It must have been at thirty-something.\nNo matter. I waited for the rumblings to decrease and my hands to calm down. Admittedly, I was a bit unnerved.\nWhen the table was still, I spooned a lump of the mixture out, and the batter gleamed as bright as Lihui’s inquisitive eyes.\nMy mom would tuck me to bed with the same story.\nThe prophecy, as some people told it.\nLong ago, there were expert xiaolongbao makers that lived on top of a mountain.\nThey made divine dumplings that if eaten, would grant your most heartfelt wish.\nBut there was a rigorous process to become these xiaolongbao makers.\nFirst, you would have to climb the mountain. Then you’d have to scale across the tops of the faux-bamboo groves. They would all bend in a strange way, synchronized. There would also be puffs of clouds that pointed the right way as clear indicators if you were heading in the right direction.\nDon’t eat the jadeberries, my mom would say. They will get you drunk, and you will lose your holding. But keep latching on and scaling.\nThen as your hands roughened from all the activity, you would start gaining the calluses for the rigorous mixing and dough pounding.\nThen when you get to the famed kitchen, here comes the fun part—filling and folding.\nThe xiaolongbao makers—in my head they were always short and gregarious—would gather in a circle and ladle meats, fold, and pinch. Their hands were as quick as bird beaks, their twists as tight as qipao zippers.\n“Qipao zippers? That’s pretty tight,” I sometimes said, squirming in my pajamas. Then my mom would laugh.\nThe first batch would contain nineteen folds per dumpling, and they would send it to those on our planet.\nThe second batch would contain thirty-eight folds per dumpling, and they would send it to the nearest star.\nMy response was always the same and always incredulous.\n“Thirty-eight folds? But, mom, that’s impossible.”\n“Hush, Chiu, they don’t have typical hands. Remember? They carry the cherished callouses from traversing the divine mountains and passing across the tops of the sacred faux-bamboo.\n“Unlike typical callouses, they are still sensitive and dexterous, enough to manipulate the pliable skin without breaking it, yet they are blessed with incredible speed and skill. They are gift callouses on hard tough hands—hard tough hands fast and adroit enough to pick up a single eyelash in the air in a flash of a millisecond.”\nShe would bat her eyelashes, looking very serious.\nI would look at my hands, soft and pliable. My mom’s hands, on the other hand, were as rough as the rocks in front of our house.\n“Then they would fold seventy-six pleats, all pinched into a whorl up top. Their hands would move so fast at this point that they’re not even visible. You couldn’t even tell where they were—it was more probability than existence.”\nI laughed.\n“The quantum xiaolongbao makers,” my mom would say with a nod, finishing her story.\nThe joke was that if the seventy-six fold did happen, and it did appear before you on a tray, the universe would rip apart. Collapse and decoherence.\nI remember touching my mom’s calloused fingers before my eyelids would weigh me down, and I would fall into a deep sleep.\nThe roughness of her fingers and knuckles made me think of all the work she did for us. I would dream about her working and me asking her questions, playing around her general busyness, bugging her as she scampered about.\nAll that labor—that sometimes her movements were so methodical, you would forget that she was doing each one with will and it wasn’t just a continuous system, like she was breaking the law of thermodynamics in infinite sustained movements, that seemed to be moving on their own, coming from nowhere and everywhere at once.\nWhen they said she had a quantum bacteria eat away at her, I had no idea what they were talking about. Living on this planet was a new thing. We were refugees and settlers all at once. Deposited here without much memory of what had happened before. We didn’t know what we’d find here. The settlement grew over time as we grew accustomed to its settings.\nLore grew as fast as illnesses, grasping with rigor like weeds.\nUs kids did the best, adapted fastest, grew alongside the faux-bamboo, red-cheeked like their rosy glossy bark. We were as ruddy as the sky itself.\nWe experimented, played, and still adopted and adapted the customs of our people, the ones we could still access in our memory collective logs, retrofitted them to better serve this world.\nMeanwhile, as we thrived, our two moms eventually deteriorated. It wasn’t only them. More aunties and uncles were falling sick. And they weren’t sure how to contain the illness. The medicine was only effective at keeping the worst at bay.\nAs another sear ran through the sky, I started freaking out. There was something about that sound and the accompanying tear and the way I could see the faux-bamboo leaning in the distance. The color of the sky wasn’t so red anymore—more orange than anything else.\nI could smell an aroma wafting from the distance, from the faux-bamboo groves, coming in with the drafts in the cracks. It was an odor that was not within the trees’ typical range of shifting, grove-like smells. A damp dewiness but somewhat rank. Something wasn’t right.\nWe tried to focus on assembling our offerings—these xiaolongbao that have kept us fed and strong, that we planned to share with our dead moms.\nI was wrapping in a frenzy. Lihui could feel my anxiety, I could tell. She kept telling me to slow down. My hands were shaking, but it only made me wrap faster. My wraps were getting sloppier, seventeen folds instead of nineteen. Sometimes twenty or twenty-two. Lihui made it a point to count them aloud to get me to focus.\nHers were still a perfect nineteen. But my movements were more erratic. I could feel heat emanating from my fingers.\nAnd then more booms and sears startled us both from the heavens.\nWe should have stopped like the rest of the village. We should have stepped outside to check out what was going on. There was a murmuring crowd out there, and I could smell roasted faux-bamboo, somewhat sweet but with a burnt bitterness. I could hear the commotion and the gasps.\nLihui had her hands against the pane, getting them dirty with grease and flour. She gave up on the dumplings, instead focusing on the distraction.\nMaybe there was a fear in me that I didn’t want to face what was going on, like the way I didn’t want to face my mom’s death those many years ago. Maybe I just needed an activity to calm me down, even if I was wrapping in a fury that showed no hint of calming down.\nMy xiaolongbao were strange and nonconforming. This is not how my mom taught me to do things. They were, however, marked by crisp folds, but the folds were anything but systematic in number.\nI didn’t even bother counting the pleats or even really paying attention to the finished products. They still needed to be steamed, anyhow—passed through a form of fire as a ritualistic burning.\nI finished the last one, my teeth chattering, my heart in trepidation, my hands jittery, and I quickly plopped them onto the crisscross weave bottom of the faux-bamboo steamer.\nI stood next to Lihui, my dirty palms pressed up beside hers against the glass, watching the commotion in the skies and in the clearing below us, the voices of the village—shrieking and exclaiming.\nI heard a ding telling me the dumplings were done. Half-reluctant, half-relieved, I pulled myself away from the commotion outside the window. There were ten lines in the sky now. They were all pointing toward one another, like an asterisk, except without the intersection in the middle.\nI pulled the steamer to the table and called Lihui over. She was getting a bit ecstatic, whooping at every burst in the sky. She had half a mind to run out there, but I begged her to stay with me as we fulfilled our solemn duty, giving these offerings and eating with our dead moms in thought.\nBesides, even though more than half our village was down there, who knew if it was safe? Who knew if a tear in the sky wouldn’t rip out this land itself, along with the whole planet? We were too new here to know the kinds of cycles this world is used to.\nBut who was to say that being here in this house was any better?\nI pulled open the steamer lid and a cloud of fragrant warm heat rose up. We breathed it in and dug in with chopsticks and spoons. I ate without thinking, without counting, but did say a word or two to my mom.\nIt was juicy and filled with umami, I suppose, but I was too distracted to notice, my ears still attuned to the outside bustle.\nWhen we finished one batch, we opened the next, the layer underneath.\nOnce the steam cleared, I gasped.\nLihui leaned in and made a strange hiccupping sound.\nThere in the middle of the bunch of odd disjointed-numbered pleats was one that had pleats so countless it looked like a lotus flower.\n“Did I make that?” I gulped, standing up. I brought my chopstick close to the thing and pulled back, as if it would electrocute me.\nBut Lihui ignored me. She was already counting.\nHer eyes bulged as she kept talking, and she even ignored the big bolt of sound that rang through the skies and shook my home.\n“It’s impossible,” she whispered when she was done.\nI started counting, too, apprehensive. My hands were still shaking, causing an incessant clink clink clink from my chopsticks. I got to fifty and I had to sit down. My legs were quivering.\nSeventy-six. My non-calloused, non-divine-land-traversing hands had pulled together a whopping seventy-six folds.\nBefore I could stop her, Lihui grabbed the dumpling, ripped it in two with her teeth, letting the soup juice inside spray out. She chewed and swallowed and swept her palm at me, stuffing the other half in my mouth.\nIt was hot as hell, burning soup, and so deliciously thin and delicately crafted, that for a moment all that came to mind was really the feeling that my mom was here in all her structured, nurturing glory. It tasted like something she would make—something orderly, exacting, and perfect.\nI could even hear her voice, “my little quantum xiaolongbao maker,” whispering in my ear as I swallowed.\nThe boom that followed knocked us off our feet, shook our chairs until we fell onto the floor and hid under the table.\nI grasped onto Lihui’s hands, and they felt rough and textured like I never noticed before.\nAround us the dumplings fell, tumbling from the edge, on this side and that. The smell was incredible—steam and meat and the tinge of sweet jadeberry seeds.\nWhen it stopped shaking, we looked at each other and climbed out. It was a disaster. Pans, pots, broken cups—not to mention the splattering of sauces and a few dozen deformed dumplings all over the ground. I grabbed Lihui’s hand and nodded. We slipped past them on our greasy feet and tossed on slippers and ran outside.\nThe sky was quieter now. No land-rattling rumbles, but just a soft groan that seemed to be emanating everywhere all at once.\nEven the villagers were shushed. Or worse, dead. They looked petrified enough from where we were rushing.\nWe got to the clearing, and no, they weren’t dead, just a hush of a whisper as some pointed to the sky and as some tried to take photos.\nThe pattern in the sky was incredible, not just any asterisk, but one with so many dozens of lines, I could barely count it.\n“Count it by quadrants,” Lihui said. “It’s symmetrical, so one quadrant would do.”\nShe set about whispering to herself, increments going up and up.\nShe had this wild look to her like she was swinging on a faux-bamboo, like she was about to shove another divine xiaolongbao into my mouth.\n“Let me guess,” I said, while she said, “seventy-six” at the same time.\nI sucked in a breath of air.\nI could taste the savor of that dumpling, the one that conjured up the image of my mom. I don’t think I tasted it much then—it was too hot to really consider, but the sudden jolt of savory umami hit me like an aftershock.\nThrough the emptiness to which all the lines were pointing—that great maw of a hole in the center—came a dot. It became bigger and brighter.\n“Get cover,” someone more sensible than us yelled, and we ran to an underground bunker the settlement built when we first arrived, as part of the many disembarking safety precautions.\nEveryone gathered in. When the last villager dodged inside and shut the door, there was an explosion above land that rattled the jars on the shelves.\nWhen one of the aunties pulled open the bunker door minutes later, the heat was astounding, and the sound so deafening that she immediately closed it again.\nAbout half an hour later, we heard footsteps and tugs at the door.\nWe didn’t know what to expect.\nWe took a vote. With a show of hands, it was decided: unlock it and open it up.\nEach villager pressed a hand onto the multifaceted digital lock we had on board when we first arrived. It could read the DNA of those in the bunker and align it with its release protocol.\nIt tinkled a light melody, flashed bright green three times, and the door pulled open.\nTwo unfamiliar faces peered in, looking at us with curious eyes. “Mom?” called out a neighbor. “Aunty?” called out another.\nI didn’t recognize them at all. But more voices called out: “Aunty Zhen!” and “Aunty Li!”\nI squinted and it dawned on me. It was them after all, just that their features were smoothed over, as if a rolling pin had gone over their faces, removed their wrinkles, tightened up their smiles.\nThey lived across the bamboo grove but had died in graves and burned in the incinerator.\nA scream let up. Ghosts, some of the villagers yelled. Some demanded to shove them out and close the bunker door again.\nWe started whispering then. Around me fellow villagers discussed the best ways to throw herbs at their faces or to retrieve mirrors to scare them away.\nBut the two aunties were calm and shushed them all. A coolness passed through my spine, coming from what felt like a collective stirring in the air. Their voices were honeyed and soft, much like ghosts.\nBehind them, I saw two uncles. And behind them two more aunties. But they weren’t just any uncles and aunties. They were familiar and unfamiliar all at once. Uncle Ming, Uncle Zheng, Aunty Xi, Aunty Hua.\nBut all somewhat misconfigured, as if their features didn’t really reflect their inner selves or the selves they were before incinerating. I couldn’t pinpoint it, but something felt redone, as if they had gone through a machine that compressed their skin.\nI held my breath.\nI spotted someone who was peering about trying to look over the necks of those in front of them. It was more than familiarity—it was family. My closest aunty.\nAyi, Lihui’s mom.\nHer, I could recognize.\nAnd I couldn’t breathe. Behind her, someone was trying to wave to get my attention. That figure, that hair, that lipstick color.\nMom!\nIt didn’t even occur to me to ask how she managed to get that lipstick from the afterlife.\nI didn’t care about anything then.\nAll I cared about was that . . . this was my mom. Or at least some manifestation of her.\nUs abandoned kids . . . we cried and ran over to them, not caring if they were ghosts, the supernatural, or reincarnations of spirits themselves.\n“It’s safe now,” the collective parents said. “You can come out now.”\nOver dumplings, bamboo seeds, and other festive foods brought out by us all, we listened to their stories.\nI held my mom’s hand. It was strangely smooth, the callouses wiped away like our shared pain.\nHer voice was still honeyed, but her typical maternal, assertive tone was setting in. She and the others recounted the tale in rounds, as if they had it memorized.\nThe fiery maw of the incinerator wasn’t a funeral. It was sending them to another strand in time and space . . . but it was only open during particular days, and they had to hurry, as it only allowed a few people in at each open session. They really did pass through what might be considered some form of almost-but-not-quite-death, but it was a collapsible state, one that could be death and not all at once.\nWho did this? Who planned all this and executed the trip? We begged to know.\nThe ones who sent us here to begin with, my mom and the others responded. The ones who we never met—or if we had, we had systematically forgotten—but knew in our hearts had planned it all so that these ill settlers, our people, could get treatment.\nThey implanted in us the prophecy that they had calculated through intricate astronomic analysis.\nThere would be a great event, a great deformity, held open by many folds, and it was at this point they would return to us, our people saved.\nThe xiaolongbao I made just happened to be a coincidence. At least that was the conclusion that the aunties came up with.\nSecretly, that is not the conclusion Lihui and I came up with.\nAnd we had no evidence of it now, now that it was shoved down my digestive tract and passed days ago.\nNothing to peer at, poke at, and wonder if it did something. Certainly, the lore can’t be discounted.\nMaybe we were just too worked up and excited and mis-saw and miscounted, one aunty suggested. Maybe we were just seeing what we wanted to see.\nBut I remember that taste and that distinct feeling of my mom’s lips brushing up against my ear, whispering to me.\nNow, we cook together, Lihui and I and our moms—with their smooth, polished countenances that we were getting used to—folding xiaolongbao dumplings and chatting and laughing.\nThe sky returned to its typical crimson and lost its lines. The rosy jade groves were moving straight again. The people were going along in their ways, convening every so often and returning back to normal—or better than normal.\nBut there was an apprehension in the air—as if, well, we were not the sole holders of our will. That there were secrets that our once altered memories would never let us know.\nThe quantum bacteria had long been purged, destroyed by the quick pervasive heat in the wake of the ship’s arrival, and had dissipated when our once-thought-deceased villagers alighted.\nThe ship had been long gone, and no one remembers what it looked like or how they even got here. All the recovered passengers can’t remember if the seats were comfortable, if they had motion sickness, if they were fed well.\nBut they looked healed and healthy—and just a bit different from how the other villagers remembered them. Livelier, younger, more active. Somewhat flat and with a tinge of that nectar-sweet accent that they could never get rid of.\nTry and try as I might, I could not get my hands to work as fast as they did on that day the departed villagers returned. I tried to force myself to fold as many folds in a dumpling as I could, but it would always fall apart, the skin tearing by twenty-something folds.\n“Stop wasting the food,” my mom said.\nBut, even as she said that, she had a twinkle in her eye that I remembered from before she had left. Despite her renovated appearance, that twinkle would remain and reemerge from time to time. A hint of mischievousness to her ordered, structured life and creations.\nIn her hands, she had a dumpling that she covered with the other palm. I could see just the skin of it peeking out, with its myriad of folds. I could smell the aroma of folded rosy jade leaves and jadeberry seeds. When I tried to take a good look at it, she pulled it back, laughed, and dropped it in the steamer.\nWhen Lihui tried to reach for the steamer lid, Ayi swiped at her hands.\n“That one’s for me,” my mom said.\nMom winked at Ayi and laughed then, too, as if they shared a joke Lihui and I would never understand.\nD.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation."}