{"fingerprint": "yk9WRlJvSQxk+mP6NmbOEJ2lBSo=", "sitename": "Clarkesworld Magazine", "title": "Waves of Influence by D.A. Xiaolin Spires", "author": "D A Xiaolin Spires", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spires_09_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Waves of Influence by D.A. Xiaolin Spires", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5720 words, short story\nWaves of Influence\n“You sent this good for nothing wimp to me?” Her pointed finger inched upwards in the air until it settled on my face. Meixiu pulled back her finger and formed her other hand into a cup, tracing her right finger along the inside of the palm of her left hand. She lowered her voice, whispering to her bot, who stood by her side without moving, “This pimply faced early-twenty-something with small lackluster eyes emanates an aura of unfocused stupidity.”\nI checked my wrist. Everything she said appeared on her friendgram feed. Scrolling text littered with animated emojis. Then a holo of me formed beside my wrist.\nMy eyes burned. It was me all right, Chenghui, my likeness standing next to me, the photonic resonance only I could see. But my face was warped even more, the acne magnified, my ears big and droopy made to look like a forlorn dog.\nIt suddenly felt stuffy in this room, high above ground in one of the tallest skyscrapers in the city. I didn’t belong here. Street scum clinging to the whispers of fortune. This is where the rich stood, staring down at the plebes from this sky-high precipice.\n“I can hear you, y’know,” I said, my voice cool. “And I’m not too stupid to know how to download and read your feed.”\n“How?”\n“I, uh, hacked into your friendgram.” I cleared my throat. I hoped she wouldn’t expel me right there and then.\nMeixiu sighed, waving a hand in the air. “Delete it. The holo. Get rid of it.”\nThe bot dipped its neck, revealing its bald, shiny head.\nThe glowing message disappeared from my wrist. The holo faded away. I knew it winked away just as it reached the eyes of all in her inner circle.\n“Then you know lesson #1. Keep two dreamgrams. One, a truegram, for your following public and another, a friendgram for your close friends.”\nShe swiveled around so I couldn’t see her, letting the screen of the back of her leather chair face me. In the screen, she narrowed her eyes. “And pay for the security upgrade, so lurkers can’t enter.” I saw her arm, slender and practiced, reach out from behind the leather recliner and pull a cup towards her. The same arm put the cup out again, the lipstick on the cup shimmering.\nTiny ticking sounds filled the room, the collective exhale of her twenty-six analog clocks in the room. I had counted while she assessed me stupid.\nFrom behind the recliner, the screen read, “LEAVE.” The clocks continued to tick.\nTwenty-six stylized clocks told me the same thing. I was almost out of time. Any day now my sister’s heart might expire. The doctors said it could be a year, a month, or even a week. I sucked in a breath.\nI hoped Meixiu didn’t realize I was a fake.\nI had stolen a hoverbike, disabled the auto to drive thirty-two miles to get here. My butt was sore, my arms were tired. All for my sister, Yixuan.\nI held out the holoticket, projected from my wrist. It was an exact duplicate of the specs that Meixiu had programmed. My name was branded into its digital tapestry as clear as the illumiglass table in front of me. I belonged here, or at least the ticket claimed so.\nWith this ticket, I was the contest winner and there was no way I was going to let her kick me out. I pushed the glass of water that she had left out towards her, letting it screech along the table. Coasters were not needed with bots at your beck and call to clean and polish.\n“The contest rules said that you would teach me,” I said to the back of Meixiu’s chair, the message of LEAVE on the screen searing into my eyes. “You can’t just kick me out the moment I arrive.”\nFrom behind the chair I heard a tongue click. The mechanical whir filled the air as she swung back around. Her face was beautiful, near middle-aged with a few wrinkles around the eyes but with that soft touch only a social influencer could have. Her cheeks flawless and blushed. Her eyes sparkled brown and exuded passion. Meixiu enunciated every word with a practiced inflection, an accent that sounded intoxicating. She enchanted all her followers, including Yixuan. Including me. Even if I was only a follower for the last few weeks and not the years my account claimed. “I asked for only serious apprentices to enter the contest.”\n“But, I am a serious apprentice—”\nShe gave me an up and down, the quick jerk of her head for a second disturbed her makeup, the augmented tech hiccup before it settled back layered onto her face.\n“You come in here without any cosmetic enhancements and tell me you’re serious? You’re going to show that face to the public?” Her lips turned down.\nI threw my arms up. “But social influencers are supposed to be authentic!” I touched my cheeks, feeling the rough texture of craters. Yixuan and I both shared the fate of bad complexion.\n“Then, that’s lesson #2. You’re supposed to exude authenticity. Not wipe your programs of any blemish-removers. I’d be surprised if anyone wanted your holo floating around their rooms. If you can’t understand that basic point, then there’s no way to teach you.” She shut her eyes. The quick flutter caused the augmented eyeshadow to hover for a few zeptoseconds. It was barely visible, but my illegal perception enhancements made this moment of disjointed layering all too clear.\nThe clocks ticked. It was unnerving, all those analog needles making noises. These social influencers always lead the latest trends in purchases. I wonder how many women my age and younger were sporting analog clocks on their wrists because of her. I counted a few seconds and watched again, waiting for her to blink.\nThere, there it was. The layering dissonance.\n“You missed an upgrade,” I said.\n“What?” She rubbed her temples.\n“Your eyelids.”\n“Jacoby, mirror.”\nThe blank screen on the bot’s face turned reflective. Its head moved down its chest, guided along by the crane neck until it was at Meixiu’s eyes. Her pupils contracted as the light from the bot hit her face. She fluttered her eyelashes, a dainty movement of grace that made even my heart pound. The eyeshadow lapse didn’t really take away from her beauty.\n“You’re right. I’ll recalibrate. Good thing I didn’t send out any holoselfies in the last ten minutes.”\nShe gave me a look. “Come closer, you. Chengli or whatever.”\n“Name’s Chenghui.”\n“Alright, Chenghui.” She beckoned.\nI stepped up, head high, still waving, projecting my ticket. This projection was set to viewable to public, meaning it emitted photonic resonance that anyone in my physical vicinity could see.\n“Turn that off,” she said. “I already know you’ve won.”\nI heaved a sigh of relief. She didn’t notice my hack.\n“Jacoby, move the light to capture her profile.”\nShe picked up a brush from the holder on her table. The bristles were not as wispy as they looked and landed on my cheeks hard. I could almost feel the wisps of digital paint being applied on. I thought of Yixuan. What she would do to feel the touch of Meixiu’s artistry.\n“Ah, that’s better. This’ll work for now. Now, take this holoselfie and put it up. Call it the ‘before’ and tag it with #InfluencerApprenticeContest. You’re the winner and you better believe that I’ll make you one. All your followers will see my work.”\n“I only have ten.”\n“Ten? What have you been doing on there all this time? Well, that’ll have to change. Put this holo up and send me your profile.”\nI raised my wrist. A pane of light moved from the top of my head down to the bottom. I added Meixiu to my list of “bosombuddies.”\n“On second thought, add some of these wardrobe accessories before you post your holo.”\nA ping indicated I received a gift of two necklaces and a dress. Some facial adjustments also arrived my way.\n“That’s a Locklie Dree dress. And two Connie Wu Spring series from twenty years ago. We’re gonna bring it back.”\nA buzz indicated the holo was done rendering. I projected my holo out, with the setting so that it was viewable to anyone in the room.\nThe bottom lobes of my ears didn’t droop unevenly and my eyes looked alert and bright. The A-line dress flattered my hips, as the holo swayed, sashaying in place.\n“It’s . . . alright. Needs work, but this is the ‘before’ after all. The blue at least brings out some color in your otherwise lifeless eyes.”\n“Thanks,” I said. Inside I felt a giddiness rising up from my chest. Step one was complete. Meixiu had linked directly to my system.\n“Should I upload it now?”\n“Yes, post it.”\nI made a few swipes on my wrist. I blushed as this holoselfie would suddenly appear beside the ten girls, my followers across the globe. I could imagine this version of me appearing next to them in their rooms or alongside them as they went shopping at the fashion museums, as they marked items down behind glass for reproduction in their replibox. Right now, all these copies of me were popping up, virtual but admired. The contest winner. I’d probably only be there for the ten seconds before they scrolled to something else, but already I felt like I was moving in the right direction.\nI couldn’t help it. Excitement filled my chest. I was gloating.\n“On my way to influencing,” I said, smiling to myself. I looked at Meixiu, “Thanks to you, my social queen.” I was being facetious, but she didn’t notice.\n“Just call me, Meixiu.” She put her arms behind her head and leaned back. “The influencer who makes influencers,” she said. “Not bad huh? It was really Jacoby’s idea. Crunched all the numbers—a marketing move no one has tried before. It might just work.” She pulled up a mannequin wearing a silk vest.\n“Now, if you’ll excuse me. I have work to do. Negotiating my next contract with one of the ads.”\n“Anything I can do?” I wrapped my hands around each other in front of my body.\nShe shook her head.\n“I can’t help you with influencing any more today. It tires me. Besides I have this ad contract and other stuff to do. I have a pile of offerings to sort at the replibox. All these fans and companies sending me stuff. I have to see what I can sell and what I’ll need to repurpose.”\nI thought fast. I was losing her. I had to work my way in, get access quick. Yixuan was fading, her heart giving way. “I can do that. I’ll do the sorting. Inventory. I’m good at it.”\nMeixiu gave me a quizzical look. Her lips pursed together in a way I remembered from her holoselfie two days ago. She was wearing a mandarin collar dress then. Stately but elegant.\n“Fine. Jacoby will help you.”\nI heaved a sigh. I was in.\nI’m here, I thought. Not to emulate you, but to be you.\nThere were a million ways to make money and I could probably try my hand at hacking one of the cryptocurrencies, one of the smaller ones with less security. It would be more direct, faster, though probably subject to closer scrutiny. I could gain control of accounts and blackmail. I could try to steal proprietary information and sell it in an act of industrial espionage. I wouldn’t be the best, but I could train myself. I was sly and proficient.\nBut, it wasn’t about the money. I was content with being poor, for the most part. We’ve been poor all our lives.\nThis was for Yixuan. She wanted this. All those days she sat around, staring at Meixiu’s holo, mumbling, “Look at her. Her silken hair. Her cool, sexy style.” Showering her with praise. Even as Yixuan’s heart started to give way, her eyes lit up when a Meixiu truegram update came in. But, it wasn’t enough. There was a hunger in her eyes, a look of discontent. If I could just be Meixiu, then she’d hold on. She needed an influencer that could shower her with the attention she deserved. As Meixiu, I would constantly be sending her virtual messages, personally crafted, a holo just for her by her side. She’d look up to me, hang onto me as that thread of hope.\nI stared at a limb that I held in my hand. It looked real but felt light as a feather. The fingers were long, like a piano player’s, the nails were painted in metallic blue, the color of Meixiu’s eyes. Why would anyone recreate their arms and fingers and send it over to Meixiu? It was gross. Luckily, it was only a mylofoam reproduction. Organic reproduction was only allowed for certain specifications in the replibox. Only items in the preapproved list: food, medicine, clothing, and some others. And luckily Meixiu had the upgrades in, so no true-to-life reproductions of heads or organs could be sent her way.\nI shook my head and tossed the fake limb into the “reprocess” pile. It would cost Meixiu more creds to dissolve the item rather than just selling it off whole in the replibox. There was the reprocessing fee. But, I doubt anyone would want this thing. The “reprocess” pile was growing. Who would do this? Send this here?\nFans, I thought, reaching for a gold watch. Fans send a lot of junk. I scratched the surface with a fingernail. The gold flaked off.\nFans like my sister.\nI grabbed the pile for reprocessing, holding it in my arms, which Jacoby scanned to double check. He sent the details to Meixiu whose consent I received. Burn them.\nI put a few pieces—fake limbs, painted portraits, jars of unidentified fluids—into the replibox and set it for reprocessing. Dissolve. A flash of warmth filled the air as they were “burned” into potential particulates and drained cred from the owner’s account. These particulates siphoned into the chamber behind the box where they held in stasis until an order came in for production. Usually people sent items that already had fixed forms. It was way cheaper to pass on things as-is than to embed a reform command. I remember one of my mechoteachers said it was about the quantum costs of transformation, but reconstructional physics was never one of my best subjects.\nOnce the burn was through and the fan donations and promotional junk were nothing but digital debris, awaiting costly reformation, I went back to fetch more junk. Air-filled balloons (but not with highly coveted helium, but just regular mCO2), fake ivory chopsticks, faux jade canteens: Was anything real anymore? I stacked them again in the replibox, balancing them like a game.\nI remembered the game I used to play with Yixuan, stacking up the plastobins we used as kitchenware in our house. Here they use illumiglass, and plastobins never had the same shine. We would stack them into “buildings” after dinner, adding chopsticks as antennae. Then we’d smack them, watching them fall. Their translucent durable sides would collide and tumble onto the ground, the chopsticks clattering onto the mylopropylene tiles. Mom would then force us to wipe up the mess, saying that if we messed up those containers, we had no cred to reform more. She would look so serious before breaking into a smile. Mom whose smile I missed so much, before it faded away, like her physical strength in her last days.\nI thought about her frail arms, her weak legs. They said the sickness was genetic, but the gene bypassed me.\nI balanced the chopsticks in the faux jade canteens. The chopsticks shone with artificial gleam.\nI pressed the burn and felt a wave of heat as a zigzag pattern burned in my retinas for a moment before I blinked them away.\nThose were the days before Yixuan got sick, before she could hardly lift a chopstick, let alone jab a punch at plastobin towers. Since then, she’d been sitting in bed at the hospice, upsticking holoselfies of social celebs, talking in exaggerated form. Meixiu was her favorite, a shimmering figure of grace appearing at her bed at least three times a day. Yixuan kept refreshing Meixiu’s truegram feed. Her fingers twitched, always wanting more.\nI kicked the pile before me. A stitched towel and a rattling can flew up into the air and landed back down. The stitched towel covered up the face of a green-eyed polyporcelain doll. The can rolled away.\nJunk. All this junk. I bet some of these things might be ours. We had no cred to speak of to reform things, but Yixuan could have zapped something straight over to Meixiu without the transformation fee.\nI walked back to the pile, took a glance at the unsorted goods. Nothing that looked familiar. Good.\nJust piles of merch and junk. The fortunes amassed by highly-followed social influencers.\nTheir living, their earnings—refuse of the late twenty-first century.\nThe next day, Meixiu slinked in wearing a sequined Gustav Chen dress.\n“The fashion museums are awfully crowded. I couldn’t even lock onto the Ying Rodriguez scarf before it dissipated in favor of the next line.”\n“Sounds pretty awful,” I said. I looked at her mascaraed lashes. I wondered if that was the right response.\nMeixiu waved a hand. She made some motions with her wrist and her holoselfie from earlier today appeared, her red sequins glinting in the fashion museum lights, her slender form shifting into poses, foregrounding the illumiglass cases that held brand name purses and jewelry. Her holoselfie gave a flirtatious kiss.\nI pretended to catch the kiss. Meixiu approved, chuckling. I smiled.\n“I don’t understand why you even go there. Why don’t you just fabricate the background like most holo-posters?”\n“Then it wouldn’t be authentic,” she said. “Besides, I need to get out sometimes. It’s good for followers to spot me and take surreptitious holophotos of me and my merch. My sponsoring corporations love that.”\nShe studied her own holoform for a few more moments before swiping it away. Another celeb filled her view, blonde hair, hefty shoulders, and a robust chest, wearing a black leather suit.\n“Not bad. Take notes,” she said to Jacoby. His screen reflected the swagger of this Lisa W. Zhao and he tried copying the moves, making us both laugh.\nI had to admit it. Meixiu may be performed and artful, but she had the strange humor of a celeb who knew she was passing. Like a moth flying into the light, she continued to flaunt her feminine mystique even as she was becoming passé.\nIn the last few days, it was clear to me that her influence was dying. That was why she was trying harder to make appearances, to put herself on the scene. But it didn’t matter, she could be blowing up like the next Jachoo or becoming a social cadaver like Sayne Wang. All that mattered was Yixuan was into her. It was all for her. Yixuan was fiercely loyal and would stay following her, probably looking up to her like the way I hoped she looked up to me.\nMeixiu kept scrolling across her home feeds, keeping up with what the other influencers were posting. She had to strike a delicate balance, taking a stance of a particular lifestyle and brand, displaying a brazen uniqueness while not deviating too far from the norm. At least that’s what she admitted, as another one of her lessons.\nThrough my last few days of tinkering around in her tech, I found that she used the Mikst 24-K layering system. I read up on all the proprietary specs I could get my hands on. It meant all I needed was to steal the imprint of a particular memory to unlock her account.\nI would need that specific memory, along with her physical trace, a ghosting of her vitals, then I could take her identity and biosear it to my own. From there, I could gain access to her replibox and transfer it to our encrypted one—the one I shared with Yixuan, which would at least supply us with some merch to pay off the hospital debts. It was more so that Yixuan could get some of that scrap she coveted: bracelets and beaded broaches and whatever.\nI just wanted to see her face light up, happy. I wanted to be the hero in her heart, to wipe away the digital imprints of all those other fakes that took up her existence. If I could become Meixiu, even momentarily, then she would look up to me. And it wouldn’t work just to layer on a costume. As a huge social consumer, even savvier than me, Yixuan would sniff out the difference right away. I would have to graft Meixiu’s existence onto my own.\nAnd I needed to find that memory.\nOver the course of the week, Meixiu visited the museums, then spent time prancing around landmarks, trying to create a romantic concept for her brand. She told me all about it. As her apprentice, I followed her sometimes, taking my own holos against bridges over canals, grand pagodas, and marble plazas. I had my own following of about a few hundred now.\n“Not bad,” she said. “You have to work on your expressions. Even the maneuver layering won’t fix up your vacant eyes.”\nMeixiu had me sorting through her donations, even letting me take a few keepers of my own. Necklaces and belts, teeth cleaning powders and lip brighteners. I had to accept them to make myself seem like I was really interested.\nI experimented with all kinds of smiles and winks, practiced an exercise she called cheekbone lifts. She gave me a massager to level out what she called the uneven surfaces of my skin. She also gifted me an “Allure Cure” and we sat together, rolling these tiny balls over our pores, pulling at what she called the “magnetic presence of beauty,” letting this essence draw through our skin.\nEvery day we talked, but I could not get her to speak about her past. Not a peep about her life outside brands and glamorous concepts. She just spoke about her marketing philosophies and her approaches to stardom. Sometimes she joked around about Jacoby and other bots of the past, but nothing that triggered any memory curls in the security system.\nScrolling through her feeds offered no help. The few glimpses of life outside commercialism and grandeur—beach strolls, music concerts, feeding birds in parks—gave me little to work with. How could someone project such authenticity with such a shallow set of coordinates? The more I stayed with her, the more confounded I became. It seemed so obvious. There was no substance here, but people were drawn to her as real. As alive, charismatic, and full of verve and life.\nRituals became automatic to me. Daily habits: checking my reflection in Jacoby’s converted mirror, applying upscale digital foundations set at various levels of opacity and rubbing in the maquillage. The constant changes of outfits and the periodic body sweeps to realign wardrobe measurements. The pulling and pinching of skin that was supposed to brighten my chromatic schema for better layering. Strolling through set-like landscapes to make my intrigue more pronounced.\nIf Meixiu was stunning, graceful, and passionate, then I was made to be cool, dainty and carefree. She said my lifeless eyes were the biggest hurdle. She couldn’t make me alluring if I wasn’t expressive naturally. I told her I thought everything could be layered on, like glazing on pottery. But, she said I was as plain as an old-fashioned clay pot, and the layering could only disguise, not revolutionize.\nBut, I did feel a metamorphosis blooming within me—and I wasn’t sure if that was why I kept my holos on all the time, drawn to my own holoselfies like they were phantoms of my existence propping me up.\nIn those weeks, I visited Yixuan less and less, until one day an alert popped up. It was an alert I set up during the first few days of Meixiu’s tutelage.\nI tracked the many devious turns through the digital jungle that led me to the ID. The alert didn’t lie. It was Yixuan. She was my follower.\nI didn’t think she realized that it was me. I had since deleted my original “befores” that I posted months before, making sure to leave no trace of that unsightly past in my truefeed portfolio.\nI held my posture high, my chin up. My face was without blemishes and constantly covered with digital layering. We bought new layering tech so that we could enhance the grid, sharpen the twinkle of my perfectly aligned teeth and balance the smudge of the rouge so its evenness could ride over my cheekbones with the gliding smoothness of a crane in flight. The tailcoats of my signature asymmetric miniskirts fluttered behind me, shouting cute and delightful, as I trailed next to Meixiu. We often had posted holos together. Her hand clasped in mine, her smile as wide as my own. Her lips upturned in mystique, mine with a playful gap, exposing tongue and teeth, inviting fun and adventure.\nIt wasn’t that I forgot about Yixuan. It was all for her after all.\nIt was just that I got caught up on the brand metrics, the digital outfitting algorithms, the crunching of follower numbers. I got swept away in the brands that covered me, buffered me from the petty thing I was inside with layers and layers, building up a story that I couldn’t keep up with.\nAnd one day, in Meixiu’s replicator, I got an arm. An arm that looked just like Yixuan’s. Half-moon nails in glitter and glow, just like she liked it.\nIt was mylofoam, of course. Nothing else could get through. But something creeped me out about it. It was as fake as the glimmering lipstick that stuck to the fabric as I gave it a kiss.\nDidn’t know why I did it. Or maybe I did.\nIt reminded me of home, or some phantasmic rendering of it.\nIt must have been a year since I visited Yixuan.\nIt wasn’t that I didn’t want to go. It was just that I couldn’t be seen in the hospice. People would think I was dying. My ratings would fall, my followers would leave. Besides it’s not like she needed me, she just needed the ideal projection of grace—a holo to turn to.\nI had left Yixuan holomessages then, stripped of my layerings and often curt. This layerless being, it no longer felt like me. Conversely, they felt like some spectacle of me, a perversion, like I had removed my skin and my entrails were showing.\nHow much do we gain and shed until we are our real selves? What is the real underneath the real? Are they overlays or removals? I couldn’t tell but it didn’t really matter.\nI tried to convince Meixiu to come with me, but she wouldn’t go near that part of town. She didn’t understand my deviant fascination with the morbid.\n“Is this some new trend?” she asked. “I don’t think it’s going to work. The macabre went out decades ago and never came back. There are a few loners out there that go for it, but it’ll definitely kill your cute brand. And my mystique can’t handle a blow like that. You know I’m starting to show my age.”\n“Philanthropy,” I said. “Goodwill sells.” But, she knew as much as I did that it was a pathetic plea. She was right, of course. The stench of death was a brand-killer. Maybe it was better this way. I didn’t want her to suspect my past, even if I wanted some support to hang onto.\nNone of that conversation was caught in the digital entries of manicured holoselfies of our feeds. Those were the conversations uttered in lapses, swept under, not fit for viral consumption.\nI prepped for my trip. It felt like a journey to the land of unknown. Not sweeping landscapes and imposing statues polished to lustrous perfection, but a hospice. I tried on a new layering that fit my cute self, but also eclipsed some of my recognizable features. It dampened the effect of my bold, ruddy cheeks, dimmed the glitter of my teeth. Still, I stood out in the dreary town, in the waiting room, hanging around the morbid near-dead.\nLuckily the staff knew I could never stay in a room like that so long. They told me someone would be out soon to usher me into her room.\nI fretted. I knew she was comfortable. I made Jacoby make sure of that. Jacoby never knew where all the stuff was going. Meixiu didn’t have the hacking instinct in her bones to program him to follow, not even a bit. The directions were rerouted and re-encrypted in so many ways, an intricate labyrinth that misled at every turn.\nBut, I wrote the instructions carefully. Eventually these things would get to the hospice. Eventually, they would get to her. She would have some merch and clean sheets. Nurses hired to look after her.\nThey called me in. They walked in regulation sneakers, I sashayed in silver Viggo Lee’s. They left as soon as they showed me the room. There were many rooms, many patients. They were busy.\nI placed my hand on the door. It was faded, old. I pushed it open.\nWhen she saw me, it was like she saw a god.\nI walked in, stood by the seat that was planted next to her. By that point, I had surpassed Meixiu in follower numbers. Crowned “Influencer Maximus” in one of the major Social Influencer awards. We often worked together, so Meixiu didn’t mind my achievements, but I remembered the day it happened. The day I superseded her. Meixiu covered up bleary, swollen eyes with extra rendering around the upper half of her face. I could tell. My perceptions were always better than hers. We never talked about it.\nI saw the pile of merch at the foot of the hospital bed. The stuff I rerouted to her. I looked at the girl in the bed before me, almost a woman now. Her eyes wide, worshipping.\nYixuan.\nSomething in my heart jumped a little. But, not quite enough.\nAll I could see was something so plain and so small. Insignificant. A number on my extended followers’ list. Someone who loved me for who I truly was. Magnificent, stellar, cool, and sexy.\nI convinced myself I didn’t care. I stared at her dull lips and pallor, so obvious through her one digital layer of frecklesalve. Her nervous eyes flickered, full of enthusiasm and naïveté, even in her bedridden state. Her skin was pasty, a sallow yellow. I knew she was sick. There was a part of me that felt disgusted, a part sickened by her and myself. A part that knew I should care, felt that I did, but couldn’t be bothered to be informed to do anything otherwise. I just stood there.\nI smiled, dropping my lower lip to show off my splendid teeth and said one of my signature phrases.\n“Adventures come from within. Let’s share them together.”\nSomething weighty and loaded fell on me then. It felt like something broke through the sky and landed on my head. It wasn’t anything real. Maybe a digital hiccup, a layering issue that messed with my perceptions, besmirched my immaculate algorithm of cover-up.\nI felt exposed then, as something heavy plunged into my heart.\nI touched her hand, felt warmth. I hooked my fingers in hers and some pressure wiggled within. It seemed like an improbable feeling, a jolt that ran through my arms, a memory that surged from long ago.\nWhen I was little I carried you in my arms.\nWe went swimming, the ocean washing away all the sand from our skin, from playing sandcastles earlier, a game needing no materials but plastobins. Mom was chatting with a fellow beachgoer. You and I, we dove in. Icy cold, enlivening. It was clear water and we splashed, nonchalant, carefree. The waves lapped, gentle rises and falls on the surface. But, as you were yapping away, describing the sandcastle you planned to make upon our return to land, the waves rose suddenly and one tore through, knocking us out of our leisurely strokes. I desperately looked for you, saw an imprint from below the surface, warped and colorful, a billowing sheet of clothing and skin, and reached in.\nI pulled you up and brought you to shore, carried you in my arms, dripping, sopping, as Mom stood there agape and later crying. You were all right, and you went off to build your castle . . .\nBut the memory stuck with me.\nI let go of that hand, let it fall. I left all that merch and that sick figure on the bed.\nI rushed out of that hospice, my miniskirt coattails flying, feeling exposed, followed, a sticky cloying heaviness that gained on me, making my typically light footsteps of the Viggo Lee’s fall in a strangely heavy tread.\nThat memory came to me every so often. Water all around us, washing away sand, the dirt between our fingers. The fresh saltwater washing away everything, drawing me to you. Holding you safe.\nIt was the memory that someone used to hack my system, years later, when I no longer uploaded holos with Meixiu.\nI unleashed all my hacking prowess, had creepers that followed all the routes, all the entangled courses, but to no avail.\nI never knew who it was.\nAll I did was rock back and forth, sitting in my merch, wondering what I should burn and what to keep. I remembered holding a mylofoam limb, so ghastly and all kitsch, yearning for my royal social crown, the ticks and tocks of life I could never go back and retrieve.\nI gave the limb a kiss and watched my glimmering coral lipstick fade from its smooth, cold surface. The ticks and tocks remained the same, never fading, never faster, never slower, the same pitch, perfectly paced, persistent.\nD.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation."}