{"fingerprint": "eJOy51NjEUKd/hQyXc1fFD3c4RI=", "sitename": "Clarkesworld Magazine", "title": "The Iridescent Lake by D.A. Xiaolin Spires", "author": "D A Xiaolin Spires", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spires_06_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Iridescent Lake by D.A. Xiaolin Spires", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7810 words, novelette\nThe Iridescent Lake\nI skate around the iridescent lake, bobbing my head along to the eerie laser noises the ice makes, when it gives way to pressure. The colossal plasticine walls shoot up before me and I shield my eyes from the rays of sun poking through the microlattice ceiling net. I count ten visitors already today, and the natural rink has only been open an hour. A skater passes by me, his bioenhanced skates emitting “Pew! Pew!” and he pivots, grinding toward a stop as he bends to fix the tack compressions on his ankles, pressing them down to adhere better. Something flops out of his pocket as he races away into a flip.\nI glide across, kneeling to grab a foreign object on the ice. It’s a trapezoidal palm-sized card, glowing neon, with a series of swirls embedded. It’s one of those new-fangled key fobs, the glow indicating that the vehicle’s not too far away. I’m surprised to see one here; I keep hearing how the rocks don’t cooperate with the navigation and wheels. I turn to the skater, who’s now doing some stretches against the railing.\n“Hey, did you drop this?” My comm projects my voice into his receiver. He gives me a look of slight alarm, his pupils contracted, whites wide at the sight of my security badge, no doubt, and at the cascade of languages my holotranslator is projecting above my head—a look I catch through the slick designer glass on his helmet.\nHis eyes look almost like my lost son’s and they give me a start. I catch my breath and exhale. It’s been a while since I had that kind of reaction; I thought the wound was healing. The boy shakes his head, No, I didn’t drop it, but comes barreling at me with his brand name suit, an intent look, and furrowed brows.\nErratic behavior, I think, and my training kicks in before I can even register my movement. I shift aside, knees bent, waiting for that blow so I can launch him away. But last minute, like paper in a gust, he plucks the key from my hands and veers away, the “Pew! Pew!” whining of the ice tracking behind him in his wake. He glides away with his obnoxious mellx-leather gloves glued into a thumbs-up sign as his last bit of communication to me.\nStrange characters decide to live out in these lands, I tell myself for probably the tenth time since I moved here. It’s only been about a few months and already I’ve gotten shoved half a dozen different ways, leered at, poked, stepped on.\nIn turn, residents have gotten their fair share of retribution from me—jabs, elbows, “inadvertent” contact, and of course icy smiles. I’m told that’s how it is here on this auburn rock. People don’t get too chummy and I fell into place right along with them.\nIt’s just not typical that they have the same features and expression as Haolai’s.\nThe last time I got too chummy and complacent, Haolai disappeared. Right before my eyes. Masked men. That was on the solar outreaches, before I took the job here. I hunted for ages, gave up. They sent his body later. There are wounds that never scab over. This one grows a thin layer of platelets and fibrin before being yanked off by some resonant memory. The look in that boy’s eyes just now—that fear, that’s that scab being ripped off. That’s the hollow feeling in my stomach as I taste vomit and hide the ache pounding in my chest. I swallow up bitterness and pain in one black hole of gulp and continue scanning the ice as more visitors clamber onto the rink, holding hands, laughing through their helmets, and slipping about like holotoons.\nI’m on exit duty as session ends. Trumpets blare as if a cue for that awful music that the bazaar vendors play when they’re closing shop. Exhausted skaters, barely lifting puffy suit-encased arms, do their last lap. My partner-in-security Dran herds the stragglers to my vestibule—“Here, Yunhe, take care of ’em”—where they’ll get suctioned off of any remaining ice and water.\nI yank the lever at every entrance, letting the vestibule’s ceiling emit high-power vacs that suck up every bit of excess moisture on these visitors’ bods. Then I scan their passes, projected onto their shoulders, to verify that they’ve left. The scan inputs a ten percent discount into their systems for the next time they visit. It also implants an ad that they’ll pass on to any other resident with any contact. Even public parks need some viral advertising. One of the visitors gives me some trouble—a woman who insists she already went through the watertug and refuses to go through it again.\nI grab Dran and we check her, scanning her as she shakes red curls within her helmet and curses about civil liberties. The scan beeps as irregularities flow from this woman’s sides. “Honey, scanning is not a violation, not here at least,” Dran’s saying as she tries skating away. The words appear above Dran’s head, as they do with all security, and the word “Honey” written in gold script makes me smirk. They tried putting personalities to the words with fonts to convey emotions and it always comes off a bit awry. She pulls loose from Dran and in bullet speed veers left and away toward the other side of the rink. She’s almost across the ice when I race over and grab her again, dragging her back to the checkpoint—sure enough, another scan proves she’s got pocketfuls of ice kept in the tiny refrigeration chambers. She’s got at least a dozen of them.\n“No mood-ice rings for your customers.” My voice is gruff, unsympathetic.\nShe thrashes. Only then do I see the tiny pocketknife. I pull back as a flash of pain registers on my arm. There’s a cut in my suit, and I bark at Dran as I’m seeing the red ooze from my skin. Dran races over and holds her down as I spray the remi-glu over my skin and suit. Such a strong smell, with an effect just as potent. The redhead’s eyes are big and round and as bloodshot as her hair. She looks as frightened as newcomers when they land here.\n“Pretty lucky,” says Dran. He’s got her arms pinned down in his steel grip and I release the weapon and kick it away from her hand. She squeezes her fist and opens it, as if surprised she had used it at all. The knife goes flying across the ice, as innocuous as rock. I empty her stash out into the retrieval bin.\nShe grimaces, mumbles a sorry as Dran locks her arms behind her. “It’s a plant. Someone planted them on me. I’ve never seen those marble things before.” Her look of rabid regret gives her away. She’s desperate. I know how much they’d fetch on the market. Once the ice is carved into jewelry and set in climate-controlled shreela bezelcages, they’ll be more valuable than the purest diamond, even more coveted for courtship rituals, big events, playthings of magnates and celebs—put on a ship and transported away. Even the hardware for the fridge tech is a small fortune. I wonder how much trouble she’ll get in for losing those in addition to the ice. I try to feel sorry for her, but there’s nothing in me left. I’m wrung dry.\nShe assaulted me and my sympathy only goes so far.\nEven through the disturbance, my mind is still laser focused. I’ve been waiting for Haolai-look-alike to come around and make the exit, but I didn’t see him at all. He must have left at some point, hiding behind his darkened helmet. There’s an empty pit in my heart as I palm the suck for seized goods. The fridge tech marbleminis tumble about until they’re wrung dry and I palm a few of the dozen or so that have just been purified.\nThe cut is barely throbbing, healing proper thanks to the spray. I shake my arm. The cut’s pretty superficial but it could’ve been bad.\nShe gives me a look of distress and I kick myself for being so soft. She looks so slippin’ desperate. I can’t help her much at all, really, not without losing my own job.\n“Don’t do it again,” I say, shoving her as I slip a few empty marbleminis down her pocket. At least she could sell those and get something out of it. Maybe enough to buy herself out of the trouble she’s in with whoever hired her, at least enough to try to escape. Dran’s watching me, saying nothing. He’d keep his mouth shut.\n“I don’t know why you risk termination.” Dran passes through the vestibule, clean going in, clean going out, as he punches out with a beep.\nI shoot him a nonchalant look, like I don’t know what ya mean, with a shrug.\nIt’s clear he knows. He can count and he has fast eyes. He holds up his fingers. Four.\nThe number of fridge tech marbleminis I slipped down her pocket.\nWhat can I say? I know desperation. I smell it. It stinks like remi-glu. I pity her and am disgusted by her all at once. It’s a way to placate that smell. At least that’s what I tell myself.\nI walk through the vestibule. Even security’s got to run through the protocol. I don’t shiver, even though my neck is on the line. I’ve got a dozen new mocks of marbles, all filled with ice myself, and I’m hoping that the new contraband tech sticks. I’ve got about an hour before the upgraded patch goes through security, so if everything’s timed right . . .\nI hold my breath.\nGreen. I’m good. I pass right through, embezzling what I’m supposed to protect.\nThe ice here isn’t like ice anywhere else. It doesn’t simply cave and let you carve it up. It resists. It has its own weird autonomy. Sometimes it relaxes itself into a super slippery state with an iridescent tinge and you can’t help but slide backward into a slapstick butt plant. Sometimes it draws itself into tiny ridges, like an infinitesimal mountain range, which guides your skates into grooves and toward one direction or another. Scientists have come to this near-barren planet with kits and pop-up labs, coming up with hypotheses that ultimately get disproven. From the local lore, the ice is supposed to have both medicinal properties and be a source of bad luck—causing breakups, miscarriages, gambling downturns, and other misfortunes. That’s why they pay me top dollar to pose as a security guard here. Superstition has driven up my salary. Though, there’s something else going on and my other paycheck is the one that covers the objective of figuring out what it is.\nI steal back in on the day it’s closed. All my leads on the uniqueness of the ice have led me nowhere. I’ve only entrusted the ice to the underground scientists that swing by the bazaar who I have personally worked with and whose families I’ve met—with enough integrity to not double-cross me and with just enough unscrupulousness to wave away small infractions. I ferry the ice specimens back after they do the tests, purifying them again for reentry. I don’t know who the big boss is. All I know is that it’s for science. That’s enough for me.\nI see a streak on the ice and for a moment, I stay still. I realize it’s just a stray reflection of a faraway light, a trick of the eye. It reminds me of Haolai’s farewell holo—the one of his stillness being ejected into the distance. I need to earn to pay off my son’s funeral still. The costs are staggering. Shooting a kid into space as his final wish is more expensive than a colony wedding. I didn’t want his face haunting me, his eyes imploring, accusing, for not giving him his dying wish. So, there it is. His frozen body is out there somewhere—if the projections are right—orbiting around the sun near the Sunaba belt. I make it past the streak, no longer spooked by it.\nMy suit is armed with camouflaging and mule-ferrying tech more than ten times my own value. Usually only the most exquisite drugs line these pockets. Although in my case, it’s operatic ice encased in swank marbles. I’m banking on a big discovery, one that will get me paid so much cred it’ll be a joke.\nSteal only when everyone’s watching, but while no one’s actually looking. I’m breaking that word of advice now by coming here in the dark. This is when bot security is the highest—when the world is still and there is no distraction and no cover. Yet, I can’t help it. It was too hard to meet my quota during the day. I get low and creep around the periphery of the frozen crater lake, finding the spots least likely to sing. I turn off my mind from the job and let my body take over. It knows the spots of variation on the ice. I’ve passed by so many times in the last two weeks, taking intel, processing through my limbs and into the depths of my suit. I crawl along, finding a less traversed area of the amoebic borders of the lake rink, and careful as I can, crack the pricey minicoolers over and massage the ice back into place.\nI can feel the strange coolness even through my gloves. It reminds me of when I used to massage shampoo into Haolai’s hair, when he was a little boy. He’d smile at me an innocent smile—all baby teeth and pure enthusiasm as he popped suds. And now—that look of fear. Even more potent than the sorry-Mom-I’ve-done-something-wrong expression. Except, well, it’s not him. I’ve searched everywhere for the Haolai-look-alike and it has gotten me nowhere. Not at the bazaar. Not at the shanties. I can still see his expression of surprise then despair. I know it’s not Haolai, but still, I want to find the boy. This doppelgänger’s anomalous appearance and disappearance has gotten me agitated and the only way to clear my head is to put myself on a mission. Too bad it’s occupational suicide.\nI’m just taking a stroll, clearing my head, I tell myself, as I’m on all fours, trying to float across the ice, hoping my negation tech will hold up. They want samples from all areas of the ice—I’d have to traverse to the far edge. Luckily, the ice is cooperating; not melting at the surface, not forming ripples.\nA light approaches, flicks on in the distance, and I gasp lightly. It bobs along the strange changing color of the ice. It’s not the streak from before—this is a lot more—moving. More than what I’ve seen ice do. Sounds follow it. Some of the ethereal sounds when skates glide over it. And something else. Something more . . . human. Mumbling. My heart thumps as it approaches.\nBe as small as possible. They won’t see you.\n“Yunhe, is that you?” The familiar voice cuts into my harried breaths. It’s Dran.\nI start. Should I respond or try escaping? I consider how I wouldn’t hesitate to tackle a trespasser and I’m sure Dran wouldn’t either. He’s faster than I am. I look up at him through my helmet. “Yeah, hi,” I say, the holotranslator off.\n“Funny I’d find you here. I’m guessing you couldn’t sleep, too,” he said. “We shouldn’t be here, though. I put a temporary stop on the watchers when I saw it was you. Overrode it with my code.” He gives me a funny expression, a kind of half-squint, before reaching out to help me up.\nI shake off shreds of ice. “Yeah, well, couldn’t sleep and thought I’d do some reconnaissance.”\n“It is a nice quiet spot to do some thinking,” he says. Now I see him looking me up and down, standard procedure for checking pockets, visually locating any suspicious items. “You know, Yunhe, I don’t have you pegged as someone who would be involved in anything too . . . risky.” He waits for me to say something. I just look at him. He continues. “I was in fact hoping to meet you here. I found some strange materials I wanted you to review. About a corp—”\nHe gags then, and I hear a sudden burst almost a bit too late, as if my mind has suddenly realized it heard it. A chill travels up my spine as I see what has happened. An arrow has pierced his collarbone. I reach out for him as he falls, face forward, and I’m afraid he’ll crack his skull. He crumbles in the arms I hold out. It’s a harpoon. I follow the harpoon’s trajectory. It came from the west, where the sun had set hours ago, and the thing’s now pulling him, dragging him along a thin line, like a harpoon that had caught a whale. There’s a blood trail lining the ice and it’s darker than dark.\nThere’s no way this can happen. The grid keeps all the flying things out. How . . . ?\nI don’t try to tug too hard to keep him back. I don’t want him to split open after all. I frantically look for something that I can use to saw—I pop out the blade of one of my skates, and it flies up for a moment like an ejected meal bar from the grill-popper. I run after the rope and saw a few pulls, but the rope’s much too strong and goes taut just as I descend on it.\nA roaring comes from something unseen. I can’t cover my ears since I’m working on the rope.\nI tug on the rope, trying to hold back the pull. I grunt. It’s tough. It’s like fighting an extremely aggressive Lonsar bull or some other Center monster. Dran groans this insidious sound, something that’s both squeaky and deep at once, like a child stuck in a well, the voice reflecting off surrounding bricks. It reminds me of those old legends my mom used to tell me about the Center—wells, waterways, and dangers. I’m sawing and sawing and the rope won’t come off. Meanwhile, I’m being dragged alongside him with the harpoon still stuck at his collarbone, and there’s blood. I give up and run after him, spraying him with remi-glu. I tear off loose fabric using my skate and try to bandage him. Sweat trails down my back in my suit and I’m hyper-focused but also hyper-anxious, wondering who the hell was pulling my partner like he was a fine supper catch.\nI hear a whoosh in the air—above the constant roaring of what sounds like a shielded atmocopter—and for a moment I think I smell burning metal. Another harpoon comes and hits the ice, just grazing my suited arm. I curse, shout, and try pulling it off. I can feel the heat of it even through my thermagloves. I’m not sure what’s worse, the harpoon in Dran or the harpoon in the ice. What to tackle first? I’m starting to panic, overthink.\nMaybe Dran would be the easy choice, but now there’s going to be a huge crack in this lake that’ll be tough to fix. It’s not just a small sample. It’s a major rip. Besides, there’s a whole protocol for samples that even I follow in my covert jobs. You can’t just storm away with some of the specimens. Scientists even have to go through a rigorous check before harvesting any ice.\nI breathe deep. I decide on Dran.\nI remember that I had stashed away the redhead smuggler’s blade the other day and dig into my pocket. There it is. It’s small, but slickin’ sharp, and for a moment my arm aches in a phantom memory of the swift cut. It makes a grinding sound as I stick it through the unforgiving rope, and it cuts neat. Dran’s groaning, with the harpoon still lodged in him, and I spray half his body with remi-glu until he’s stuck onto the slick ice like prey for a giant Center spider. Smells as bad as one, too.\nI shake the can. Half empty. Getting the remi-glu to stick to the ice isn’t an easy task. This ice is as elusive texture-wise as it is color-wise in its iridescent gleam.\nThe other harpoon is now scraping the ice, trying to break off a large chunk of it. It really needs to do more damage than that. I wonder how many of these harpoons are out there as I reattach my ice skating blades and glide over. I use the knife to cut, but the harpoon releases before I can get a full cut. Good. At least it hasn’t taken a block of ice with it.\nIt’s coming back again in full velocity. Straight at me. Oh crap.\nI detach the removable ice skate blade, place the knife on it, quickly spray remi-glu, and chuck it toward the rope with a heft I learned from Center sports. The blade makes a grand curve like a boomerang and it slices through the rope. I duck as the loose harpoon flies past me and sticks in the ice. A bit of rope dangles from it, no longer tied to the ship. The makeshift boomerang strikes the ice with a soft pang near it.\nThere is a sound of fading, of that roaring moving away, and I see a streak in the distance that I assume is the camouflaged atmocopter ship zooming off. They usually don’t last long since they require so much power to operate.\nI grab the knife, covertly gather some ice crystals dislodged by the harpoon, and shovel them into my high-tech storage capsules away from Dran’s vantage point. Besides, he’s still groaning, lying still on the surface about ten meters away. The ice around the harpoon is acting strange, stranger than usual, not simply iridescent but undulating ever so slightly in a sapphire tinge.\nI try to remove the harpoon and I imagine it to be hefty—yet, in one swoop, it dislodges. It’s surprisingly light. I hear a loud moan from Dran again and I throw the harpoon over my shoulder, holding it by the hanging bit of rope, careful it doesn’t cut me. I go over to Dran and cut him off the ice, which is starting to shimmer under his weight. There’s something going on there, too. I spray him with more remi-glu for good measure, until he looks like he’s sporting a giant puffball at his shoulder, and drag both him and the harpoon. There’s a trembling in my feet as I skate with one foot, the other skate blade still pressed up against my waist in my utility belt. It’s like skateboarding, but it’s wobbly. The ice behind me is shimmering, almost shivering—there is something very fluid about the solid tonight.\nI pull him to the side and call over an off-network vehicle. I keep a lookout for any disturbances in the sky, any strange roaring sounds that might be a refueled atmocopter returning.\nNothing.\nDran sleeps like a log on my futon in main room. Coffee wafts in from the kitchen as I’m staring at the harpoon, parked against the table, its sharp tooth digging into my rug.\nI don’t disturb his wound—the remi-glu has taken care of the antiseptic and all. Dran still looks a little pale, his usually tough jaw looking gaunt, overshadowed, and ragged, and like he needs some food. I have a lot of questions for him and—\n“What—what—where am I?” He rolls off the futon and I kick the harpoon aside before he knocks it over and impales himself with it.\n“So, you let them in,” I say, holding up the harpoon. There’s an insignia of a phoenix with a spiral tail ending in a wispy flame.\n“I didn’t let them in,” he groans. His eyes flicker and he registers me and his surroundings. It’s pretty empty and run down—the last tenant tore up the floors and walls. “Nice apartment,” he says in a tease before lapsing into a hoarse cough. “Ah, my headache.”\nI don’t feel too good myself. My cut still throbs, and my mind had wandered, reeling, while watching over Dran. I suspect the point of that harpoon was dipped in something hallucinogenic.\nI push over a bowl of oatmeal and Dran sits up. He gives it a look, grimaces, says a thanks, and takes the longest time I’ve ever seen someone take to put a spoon into their mouth.\n“They blackmailed me,” he says, chewing. “Then tried to kill me when they realized I targeted the security systems for the energy drain. Probably would’ve killed me.”\n“Blackmailed?”\n“Said they had my daughter down in Center. It was a lie, but I didn’t know it at the time. They had pretty convincing voice clips. I couldn’t risk it.” He flips up his wrist-hatch, lips moving as he reads. “She’s alarmed, but fine.”\n“DNA-verified comms message?”\n“Yes, of course, verified as a communication from her.”\n“Which mob is this?” I ask, pointing at the phoenix. Its beak is razor sharp, much like the harpoon itself.\n“Burnaways. They just provided some private info on my daughter and told me to let them in if I wanted to see her safe. They weren’t supposed to notice the energy drain of their atmocopter at the lake until it was too late. Something must have tipped them off to do a check.”\nI scan the logo and run a classified search. It wouldn’t blip up on the system, but I’d get my results.\nI look up. Dran looks expectant, waiting for me to say something. I keep silent, letting the scan run. Lots of similar logos in the systems sphere.\n“You,” he says. “Your presence tipped them off that something wasn’t right. I certainly didn’t plan that. How did you know?”\n“I was looking for something. There was something about the smuggler that bothered me,” I say, my response prepared. “How did she get in there with that tech anyway?”\n“You know the scan in isn’t as robust as the scan out. It happens.”\n“Something just seems off.” Haolai. The redheaded smuggler. There’s something I’m missing.\nI look at Dran long and hard. The phoenix logo scan beeps with results. It shows some matching industries and faces, including one that looks uncannily like Dran’s.\nI pick up the harpoon and point it at him.\n“I knew there was something off. I didn’t see Haolai leave the rink the other day.”\n“Haolai?”\n“My son.”\n“Oh, right. The dead one. You’ve mentioned him. Why would he be on the rink?”\n“His face was. So, you know about my son. Then, you really are Dran.”\n“Of course I am. Stop being ridiculous.” He puts his hand on the table and tries pulling himself up, but releases with a thud, clutching his shoulder, his face scrunched in pain.\n“When you grimace, the paste lines are there.”\n“The what?”\n“The paste lines. The brand-new face ripping tech. I get it. I didn’t think it had already been perfected. I didn’t think we had the equipment. I can see it now. You’re not Dran. And that wasn’t Haolai.”\n“Look, Yunhe, I think you’ve had too long of a day.”\nI pick up the harpoon and put it right up to his face. He shirks back. Too late—for a moment, the skin lifts up.\n“Who are you under there?” I croak, still hardly believing it myself.\nThe skin billows about, revealing a chiseled chin and thin lips.\n“Look, I’ve been Dran for just about as long as you’ve known me.”\n“Which is only a few months.”\n“Yes, granted, but Dran was gone from day one. There never really was a Dran. Just an ID. Someone whose face was appropriated . . . ”\n“Harvested,” I whisper.\n“Yes, taken, and used. Bad luck he had compatible DNA with the tech. Now there are Drans all over the colonies. Not just here. So, I’ve been Dran, because it’s a safe, easy ID. I’m just trying to survive.”\n“By just trying to survive, you mean leading those guys in?”\n“I had no choice. They found out my real ID, threatened my kid. My daughter, for ice-sakes. Besides, I wouldn’t talk if I were you. Who are you working for?”\nIn this stark world, everyone owed everyone else something. We were always the dregs, the ones on the bottom, scrambling to persist. To exist. Everyone. Even the scientists who fare a little better are held accountable to a bigger fish.\nI shove my tip closer to his face, causing the skin to flare up even higher and uncover a piercing hazel eye. It shone almost as fiercely as the ice of iridescent lake.\n“Biotech. Interesting. It responds almost simultaneously. Must be paired.” I lay the tip of the harpoon there, waiting.\n“Dodging the question, I see,” he says. His skin continues to swell and flare up from the harpoon contact, and he’s giving me a righteous look.\nI jab him lightly on the shoulder with the sharp tip and he squeals an “ow.”\n“I’m not working for anyone. I’m, uh, what you call freelance.”\n“I’ve seen you scouring the ice. You’re looking for something. Probably have scraped stuff, just like everyone else tries to.” He grabs a book, an old relic and luxury from the Center about the ice mom and child myth, and throws it at my face. I parry it aside as he jumps back against the wall. I lodge the harpoon into the wall and pull it out, with pounded regolith dust billowing about. For a moment the dust disorients me, and he runs to another side of the room, picking up my old tethering suit, whipping its arm at me.\n“Not much of a weapon.”\n“It’s flappy and difficult to cut through. A perfect defensive tool.”\nI run the harpoon through it like a rag doll and throw it backward. Too bad. That was my favorite and only tethering suit. Some good memories.\nHe holds his hands up. “I don’t want to fight you. I just want to get out of here. Everyone’s trying to kill each other on this slippin’ piece of rock, and I just want to make it alive to see my family and meanwhile make enough dough to feed ’em. Look—I know what they’re all looking for. I know you’re working on getting the materials, too. If not for the Burnaways, then for someone else. I made a calculation and Central would eviscerate me faster than the Burnaways for giving away the codes for them to harvest ice.”\n“Yeah, they would,” I say, feeling a bit queasy about that. So many violations not yet to my name. Let’s keep it that way.\n“Well I needed the time to contact my daughter, make sure she was really okay. My faceplant wasn’t from them—it was a job done long ago so I could provide for my family. It’s on a loan, and I’m still paying that back. I need this job, if I still have it. I suspected, and still do, that you have someone that has you . . . ” He points at my eviscerated tethering suit in the corner. “ . . . tethered.”\n“So, that’s why you never harvested the ice yourself to sell to jewelers.”\nDran laughs. It’s an ugly sound, full of wheezing. He’s still hurting. “You don’t know. Isn’t that why they’re in your pocket? I thought you knew. It’s not really the jewelers. It’s cosmetics.”\nMy stomach does a flip. I suspected, but I never really knew.\nI’m not sure if I want to know who I’m helping. I always thought it was for gem lords or the drug industry, I mumble, mostly to myself. Dran responds.\n“Yes, it is the drug industry. The cosmetic industry. Face transplants. They’re trying to find biomatter in the ice.”\n“No, there isn’t any. We’ve done extensive testing . . . ” I trail off, realizing that I incriminated myself with we, grouping myself with the scientists.\n“It’s there. Preliminary scans show it. The ice is alive. It’s hiding its DNA patterns. But, it must be there. They’re using it to enhance the breadth of face transplant options. That’s what I’ve gathered from the little conversation I’ve had with the Burnaways.”\nThe Burnaways. I think about my son’s face. Haolai. Burned off when I got him back. I remember what the classified search of the logo scan revealed. Phoenixes—new life. Sure, they may have brought people new lives with new IDs, but only from burning the old. They’d harvested Haolai, left him dead. They needed not just a DNA sample. They needed an Extraction. A fatal facial and fluids Extraction. Typical procedure. He didn’t tell me that when he signed away his life. He didn’t tell me that when he was running, when they poached him. He probably didn’t know. Who in their right mind would sign away their life? It was a dirty lie by the Burnaways, an unconscionable trick. Filthy . . .\n“I think what they’re doing now is trying to find the magic solution that would bind with the tech to alter any type of DNA so it becomes a burnable face match. Not just from a particular type of DNA that sticks, but all kinds. This way, they can harvest all sorts of face types. They would have more to sell . . . ”\nHe says this almost in regret. “I’m sorry.”\n“Why would I let you go?” I ask. “Give me one reason not to turn you in.”\n“Because you’re involved. And you’re curious. We can keep our jobs if we can catch them in the act. If we stick it to them, we might just win. We have to bank that the Guard will prosecute, that the Burnaways’ reach isn’t too deep.”\n“And what if it is?”\n“My gut says it’s not. Yunhe, I know how to stop them. Don’t you want to try?”\nI don’t know why I trust him. Dran, this Dran, as it turns out, has always had my back for the three brutal months I’ve been on this planet. We’ve worked side by side day after day. It’s not long, but when all you got is a colleague, then well, I figure he’s the best ally I’ve got. Besides, the ice is ruined thus far and we could both be fired, but if we can frame this as the crime it was, and highlight our successful attempt to thwart it and contain the threat, then maybe we can escape penalization and keep our jobs. That’s all we want. To survive.\nIt occurs to me I’ll never get the monetary payoff I expected from my contraband ice. I only engaged in it blindly, never suspected that the science I was helping was the same science that facilitated the killing of my son. Face harvesting. No, I would not make it more widespread.\nI’m ambivalent about Dran and his fake face. Half of me wants to rip the thing off with the tuned harpoon. Reveal his secrets. The other half believes him—that he has a family, that what was done was done and it’s time to think of how to stop people from committing this heinous crime.\nA moral impasse. Who to believe?\nDran knows a lot more than he says. He’s good at that. I make him peel off his face for me—as a gesture of trust. I have the harpoon up against his forehead. His face responds in turn.\nHis eyes are asymmetrical, one’s wide-eyed and golden, the other shrunken. He’s also got a scar across his cheek. “Another reason for me to stay under wraps,” he says, grinning.\nI tell him to keep his wrapping face, his faceplant for now. At least then I won’t have to be constantly rattled by his unnerving look. Though, I admit, there is something vulnerable about it, something that asks to be accepted.\nDran replies that he has to keep his face anyway, for ID purposes. Right, there’s that.\n“Besides, I need it to take the Burnaways down.”\n“Take Burnaways down, huh? You have something in mind to make that happen?”\n“Are you in? Because, I’ll show you. We’ll need a plan though.”\nWe ride in the dark in one of the off-network clandestine jalopies. It’s cheap and uncomfortable, but best of all, it won’t leave a trace. No one can hack it and tell you where we’ve been. It’s great business here on this mostly barren land.\nWe approach the great expanse of the lake. It’s iridescent and shimmering as ever and the security has been upgraded—the algorithms must have picked up on the breach and updated it, washing away human foul as it always does: blood, vomit, pee. Lots of people get sick on the ice and release strange fluids from their suits. The AIs process this stuff. These things get done automatically, but soon the security uppers will learn about the atypical incident during the weekly briefing. We have a few days before it all gets unraveled.\nWe don’t target the iridescent lake exactly. No, we stop and drive west another hundred meters. I see nothing, just rocks and craters. Dran puts the car on hold and we jump off. I scan with my security-grade detector. Nothing. I’m carrying my newfound weapon of choice for good measure: the harpoon, wrapped up in a shiny plasticine cloth.\nDran’s on his hands and knees, hunting, sometimes looking up.\nHe points at the harpoon and I use it to dig. He does the same with a small shovel. The rock is hard, but Dran has brought chemical sprays to loosen the rock under the regolith. We dig and dig and there’s the smallest line. Just a tiny, flaccid pipe. It leads two ways.\nOne goes into a vestibule that we unearth. The other seems to go on forever, toward the lake.\nI realize that this is it—there’s been a constant microdrainage of the lake. The whole time I’ve been standing on the surface, guarding it, while also nipping away at its crust, there was a whole other dimension I wasn’t protecting (or nabbing from).\n“They melt the ice under the lake. They get these nanos to worm under and commence melting and it feeds into these pipes. Very, very expensive tech. They have to be really careful about it because a micro too much would trigger the security defenses. So, they just take the smallest bit at a time.”\nI can’t believe they went through so much trouble just to nab a little ice, not even a trickle, just this tiny bit. But it does go for quite a hefty price on the market.\nDran takes some evidence. He snaps holomedia with a small recording device.\n“The ice is agitated. It’s why it’s been acting erratically. There’s a balance to it all. The iridescence recently has been kind of changing color.”\nDran’s snapping a photo of the vestibule, a container even smaller than the harpoon, when I hear a loud whirring sound above. The atmocopter.\nI see the harpoon is glowing, sensing its presence. The phoenix logo fills in with fluorescence. I groan. Great, now we’re really visible.\nI hear two thumps on the ground and then I see them. The Haolai doppelganger and the female smuggler. The one who I slipped several minimarbles to. My heart sinks. I thought my goodwill would appease her, but—\nIt’s not her. Same eyes, same pursed lips. Her body’s different though. Bigger, chunkier. Face harvests, I remind myself. Her hair, still red, isn’t quite as bright as before.\nI find it incredibly tough to be combatting someone who looks like my dead son, but I pull out my makeshift skate-knife-boomerang and chuck it at them. My hit misses fake Haolai and grazes the female outlaw of the pair.\nShe surprises me with her athleticism. Her jumps are swift, which you wouldn’t be able to tell from her stocky body shape. She leaps to grab me, and I dodge. I run.\nMeanwhile, Dran’s on this version of Haolai—using a shovel as a weapon to swing at him.\nI hear a bam and whoosh and a beeping. As I interpret the series of beeps, I realize that they had tracked us through the harpoon. Why didn’t I think of that? Of course, a homing device.\nWell, too late. As I swing the harpoon the woman catches up to me. I see her fake eyes widen as I leap up—so used to my tricks on the ice—and come down at her with the full might of the harpoon right onto the weak point of her helmet.\nShe crumbles. The helmet visor goes completely clear. Her red hair’s splayed all over her face. She’s moaning and then silent. Knocked out. I check her vitals from her helmet, which still works despite the impact. She’s still breathing. Good. She’s probably street scum . . . like me. Wouldn’t want her dead.\nAll that’s left is Haolai. I can’t deal with him. I can’t confront him. For a second, I step back, thinking I’ll just run away while I can. Everything is wrong. He, the real he, should be alive, and instead there are so many phantoms of him running around.\nThen I see this fake Haolai knock Dran in the solar plexus. Dran is keeled over, adjusting his helmet, and the fake Haolai delivers a punt, sending Dran flying. He lands with a thud. I don’t want to know what he’s cracked in that body of his.\nI take the harpoon and grab the ice vestibule that we unearthed. That precious payload. The skin of the vestibule is firm, keeping the ice at a steady frozen state, though I do see the contents shifting slightly. The collected amount is the size of a head. I can’t believe, that through a series of tiny collections, they’re able to add up to that much. It must have been an ongoing project.\nFake Haolai sees me and he’s looking at Dran, then to me, making the calculation. I wave the vestibule to goad him. Yes, of course the vestibule is worth more than finishing off Dran—no matter how much he punched you. Come and get it.\nI’m about to head out on the ice and he’s following me. I cut through the checkpoint, bypassing the inspections with my in-knowledge and slip on two blades over my boots to form skates—thank the slickness for keeping spare blades on me at all times.\nI skate out to the middle of the lake and let the vestibule roll. It’s a risk, but I’m low on options. He chases it. It gives me enough time to grab incriminating media from Dran’s device and upload the media to the surveillance team—this time skipping the AI algorithms and going direct to Central.\nI throw my makeshift boomerang again and it misses fake Haolai, but it just taps the vestibule in the right way, nudging it toward me on the slick ice. Just as I intended. The ice seems to be rooting for me, pushing it my way in ripples.\nI’m faster than fake Haolai on ice. The ice is in tune with me, perhaps expecting a happy reunion with its brethren, its own missing part. I break the vestibule with the harpoon, and it spills out crystals, which melt and conform with the ice. I’ve never seen the lake do that—just kind of pull in more of itself like it just did.\nFake Haolai catches me unguarded and slams into me. The wind’s knocked out of me and I cough. I regain my senses, recover my footing, and send some blade-loaded kicks his way. He’s distracted and I knock him a good one on the arm.\nA net lands on top of him and he yelps. Behind me, I see a holotranslation floating in the air. “That’ll keep you from slipping away.”\nIt’s Dran, doubled over in pain, sprawled on the ice, still somehow waving at me. I spray fake Haolai down with the rest of the remi-glu until we can get the security here. I crinkle my nose as the pungent goop works its charm.\nI don’t feel bad about my small acts of ice smuggling because while a part of my covert operation was to ferry ice out, I was always careful to make it a point to ferry the samples back onto the lake. I never facilitated a net loss of ice, just let some out for research for a while. That was the deal, and maybe it’s unusual but the promises were always kept.\nNow that they’ve taken fake Haolai and the redhead into custody, and there’s a larger syndicate unraveling, I can say that I’m happy that they’re impeding the further advancement of these ID-slip masks. They never got the biomatter that they suspected would help bind more DNA to masks. The biomatter of the iridescent ice would continue to elude them.\nThe lake’s sneaky like that.\nDran has shed his own mask—he’s now back to his old face and allowed to keep it in public through some forgiveness program. All his petty crimes have been outed. I’ve been promoted and have access to the collection of small confiscated things—like gloves, ice skates, and key fobs. My past infringements never got aired out. My luck, I guess. The harpoon, I had to turn in to a higher security facility in the Center.\nAfter much hunting, I found the special hover vehicle that a certain key fob opens. The one that the first fake Haolai I met must have driven. It’s abandoned in the refuse zone, and no one’s bothered to check it out.\nInside, it’s dark and the lights don’t work. It smells dank and strangely musky. I shine a light in. I see Haolai’s face draped over one of the seats. It’s still fresh, not yet out so long that it’s decayed. It looks so uncanny, saggy, and lifeless, yet very much Haolai, with some translucent material at the eyes.\n“One day, maybe I’ll find your orbiting body,” I say, plying the face from the headrest, cradling it in my fist. “I’ll get enough money to lasso it and I can get you complete. Your face won’t be burned away after all. You won’t be a blank. You’ll have a face after all, an expression, with features. As meaningful and expressive as the ice of the iridescent lake.”\nI look into these translucent eyes, this phantom of his, pulling out star charts to calculate when it will be that I can complete him. I roll up and store his face in one of my extra contraband minimarbles, which glistens with this package, illuminating with a flare as bright as iridescent ice and fading to a glow in my pocket.\nD.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation."}