{"fingerprint": "gkcvERcTIOQsaVq8Oc84239Rca0=", "sitename": "Clarkesworld Magazine", "title": "Coffee Boom: Decoctions, Micronized by D.A. Xiaolin Spires", "author": "D A Xiaolin Spires", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spires_03_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Coffee Boom: Decoctions, Micronized by D.A. Xiaolin Spires", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7210 words, short story\nCoffee Boom: Decoctions, Micronized\nIt’s just a small bean, really. Just a tiny pinky nail-sized small bit of organic matter, roasted then crushed, soaked, and drained. Don’t throw away the baby with the bathwater, but in this case, really, do. Chuck it out, totally discard the baby, but keep the bathwater and drink it all up. Pour it into your mug, watch the steam rise up, and sip. It shouldn’t be a big deal.\nPeople like to think they’re in control of their lives, but deprive them of a bit of this bean soup and they’re useless. Millions of people, around the world, brain-dead without the dark juice.\nBrain-dead’s how Ava Chen feels as she throws her apron down. A few customers are asking for the check, but she sends one of the busboys. She’s had it, working at a diner’s worse than her past ten barista jobs, and she’s done with complaints of the fish (you don’t order seafood at a diner, hon), the seniors who tip pennies (she would feel sorry for their empty pension plans if it weren’t for her own vacant pockets), and babies and their spills (sure they’re cute, but they’re less so when sweeping up their dozens of Cheerios they’ve sent flying like the god of rain). The drizzle patters at the window for the fifth day in the row, always ready for her right when her shift ends. As she watches, the drizzle turns fierce and she shifts in her precision sneakers. Not walking, she decides. Can’t stand squishy socks. She calls up a self-cabbie with a flip gesture.\nHeading home in five, just after she counts her tips. Her headache pangs. She pours herself a mug of joe from the pot, takes a gulp, and spits it out. Burned, stale. Awful. She’d rather chew on the grinds.\nThey’ve got precision patty-flippers, everfrozen cubes for soda, and temperature rigor emulsifying creams for the sauces, but they can’t get even a damn cup of coffee right? Diners used to be about getting a nice warm mug, but now it’s more about getting gossip, being seen, making an appearance so people can tell you have a physical existence outside of the holowaves. For once, she’d like that perfect cup of joe, kind of like the one her fiancé used to make for her every morning before he decided to head out, coffee machine and all. Good riddance. It was a shame, but not entirely. The sex was mediocre and the coffee was good, close to awesome, but not divine.\nRight now, she wants divine. She wants that perfect buzz to settle on her, that pure mix of sweet and bitterness that passes through the lips, reaches the tongue, and slides down the gullet. Hot and aromatic.\nAs she counts the measly digits of digicash that her customers leave behind, she catches the sound of holowaves. Manager Martin’s watching his reality show again, Grub Howls, Food Champs on the Prowl. His eyes glued to the bubblescreen. He’s supposed to be scheduling or doing something, but she hears the waves with Chef Carl, the current gastrochamp railing at the employees, in his gruff accent. No, not like that—did you grow up on a pig farm? Used to splashing around liquids everywhere? Pea soup’s a delicate thing, not slop for the trough!\nMartin wishes he were like that, running the modern equivalent of a gulag, but he doesn’t have that tyrannical bent. He’s just a bit obnoxious. And lazy. And may as well throw in incompetent while she’s at it.\nChef Carl was lucky that the event he competed in was for Philadelphia pilaf and it was new enough to not have many competitors. Last season was all P’s: pizza, Peking duck, pecan pies, perogies, pig’s feet. This season was C’s: cottage cheese, coffee, carrot cake, chana masala, coconut water, chocolate—and Ava’s heart skips a beat when she considers the coffee competition approaching.\nNow, I, I could do it, thinks Ava. Be that tyrant. Get back at all those terrible bosses and persnickety coworkers at all those hoity toity cafés. She knows it’s not the first time she thinks that, nor will it be the last. All the cafés in the past six years of her life, moving and moving, where she quit before they could fire her. She’s not going to admit her coworkers are wrong, because they never are. She’s just more right. She’s got taste buds and the discerning tongue to back her up.\nShe hears the booming voice, You idiot, you don’t know how to use the sonar wash for the china? Celebrity Chef Carl and his barrage of vitriol. The screaming champ who tells the restaurants how to get better. It’s not just a pipe dream to become that guy. It’s her calling. Every time she tries to improve something in any establishment, they blackball her. How great it would be to get the title, march into all those flailing businesses she worked in, and give the management a bit of what they deserved. She smirks and her wrist blinks.\nTime for her home gastronomic trials.\nEvery so often Ava gets something in her head that fixates her. An image she’s crafted that’s more than just vision; something that makes her limbic system roar with its gut-hitting beauty. The perfect salted nut. How many granules? How dried? The ideal bowl of steamed rice. How chewy? Steaming for how long?\nFor six years, she’s been jumping ship, coffee shop to coffee shop, trying to figure out that perfect bit of that murky bathwater. She likes the pursuit. She likes the irony.\nOne of the mysteries of coffee. The grinds get tossed, the derivative salvaged.\nShe’s been hunting this best derivative, scouring all of the states. Her mind tells her she should stay in one place, rake up enough cash, but her quick mouth and exacting sense of taste are impatient, yearning to move on.\nWhen the car finally stops, she flips the tab to send the tip to the self-drive corporations (why she has to use her hard-earned tips to impart to faceless corps she doesn’t know, but this bot slid without bumps so who is she to complain). She lands on her sofa and doesn’t spend more than ten minutes there before a beep interrupts the quiet.\nShe groans, reaches for her arm in slow-mo, and pulls up the 3-D image of her sorority sis, in her bob and lab-friendly white blouse, smiling back at her. It remains frozen, her teeth shining, and Ava takes a moment to lower the lights, as to not blind Denise Kam with the glare through the projection.\nDenise used to be so young and naïve back in college, but now she’s matured into a physics lab assistant—way too smart for the job. Ava’s almost regretful that she coerced Denise to apply for the assistant position. Ava probably should have pressed her to apply for a better job, but well, at least this is better than nothing. Without Ava, Denise just sits around, figuring out stuff. She’s an excellent hacker, too, and if she had a more conniving bone in her body and stickier hands, could probably retrieve results from other labs. Not that Ava would promote that.\nIf Ava were still her acting big sis mentor, like back in the good ol’ days, she would push Denise’s too complacent self to apply for other positions and move upward, but she knows Denise would just say that she’s content with the way she is and she’s not like Ava, always moving on to the next thing. Ava can see in Denise’s eyes a kind of hunger. This look’s even present now through the holowave projection as Ava mouths an “accept.”\n“What’s that you got there?” Ava says, even before Denise gets to sneak in a hi. Greetings unneeded for her closest—who is she kidding?—only friend.\n“Oh, no, nothing,” Denise says, her arms still hidden, and rattles on about the physics conference right outside XCERN that she just came back from. About the experts in superconductivity of muons and charge transport she’s rubbed elbows with. When it comes to physics, she’s abound with energy and seems half Ava’s age rather than just a few years younger than her. Must be one of those scientific anomalies, Ava figures.\nAva scours her sofa, finds a half-eaten bag of chips tucked in the folds, and starts popping chip after chip in her mouth. Their sog-resistant savory coat lets out a satisfying crunch and Denise doesn’t seem to notice or care that her account of the weekend is punctuated by Ava’s symphony of salty attainment.\nOnce the bag’s done, Ava tosses the bag on the ground and the vac sweeps by, scans it, orders another, runs over it, backs up, does it again three more times and finally locates a pull point, plucks it up into its bod before it retreats. Ava’s been meaning to get that thing upgraded.\nDenise starts talking about swag, whisper ID lanyards, and choptalk ear clips when she pulls out the dish. It’s a small petri dish with some powder on it. “I was wondering if you could smell it.”\n“I knew something was up,” Ava says, sitting up. Something perks up in her olfactory receptors. Earthy, but bitter.\n“Is that . . . ?” Ava begins to say.\n“Let me bring the specimen closer,” says Denise, pulling a bendable polymer in the shape of a horn closer to the piece. Through the screen, Denise wafts with one hand. The aroma from the dark dust travels straight into Ava’s nostrils.\nInstinctively, Ava moves her nose closer to the emitters.\n“Ah, that is the best smelling coffee I’ve smelled in years!” she cries.\nCoffee. Real, non-stale, non-rip ’em out of the package coffee.\n“Isn’t it?” says Denise. She gives out one of her easy grins, before wafting some her own way, inhaling deep. “I thought you’d appreciate it more than me. But, if you think this smells good, you should try a cup.”\n“How? What? Why?”\n“Swag,” she says and Ava’s all ears.\nSome people like to build things. Others like to smash things. Victor Lang is the kind of guy that likes to build things to smash things. Watermelon catapults. Greenray disc pelting guns. Release hammers. Last time on his contemporary art show, “Smash ’em Squat,” he took five defunct self-drivers, stacked them high, and brought them into a gigantic trash crunch maw that took five weeks to build. In twenty minutes the cars were gobbled up. Two weeks ago, he flaunted demolishing skills by creating the world’s tiniest optic hammer and split open a dot-sized holowave battery. The whole thing was filmed using a magnilens. People like commissioning him for his flair and performative skills. Need a splash? Victor’s got an ostrich egg ready for your launch.\n“Satellite companies,” says Denise. “Ever since they got their sticky hands on the cesium standard, entangled photons, and hyperplexity, they’ve been itching to get their hands on more. ‘Embracement of the sciences,’ they call it. Always trying to see what breakthroughs they can implement.”\n“Curry favor with you basement tinkerers, huh?”\n“Yeah, get us physics lab hands and others on the bottom rungs to divulge our latest results before they’re published or something. Not sure that ever works.”\n“But, I’m sure they have enough money to try,” Ava says. “Not like my broke self.”\nDenise laughs. “They got tons of money.”\nAva’s not surprised about this. Denise has been talking about these companies calling up her lab, offering them discounts on communication packages, and passing out freebies at least a couple times a month.\nStill reeling from that powerful whiff of coffee, Ava opens up her collection of coffee beans she’s bought from auctions and collectors, safe in her climate-controlled pillbox. She picks one up and sniffs. Fruity smells linger in her nostrils. “So, what? They send in a miniature of one of his gadgets? Promotional junk? Swag to ingratiate you beggin’ lab assistants?”\n“Better, they sent him. The satellite companies gave him a gig. And you know what he made?”\n“A bunch of money?”\n“Yeah, for sure. Digidollars up the wazoo, well in stock money, which you know they won’t see for years. But, he made a mini-collider.”\n“Cute,” says Ava. She picks up another bean. This one has a darker roasty smell.\n“Cute and compact. Crushed a bunch of stuff for us. That thing was cataclysmic.”\n“Says the person who works with banging particles together.”\n“Yeah, so you know it must’ve been impressive if I’m telling you this.”\n“I’m listening.”\n“Better, I’ll show you.”\nDenise sends her a holoclip, which lights up in her apartment. It’s way too bright in the conference hall and all those white jackets, designed to be halfway between lab coat and suit, blind her. She’s about to complain when she sees a skinny dude, black hair slicked back, behind a table decked out in moving 3-D projections of his art, things going boom and smashing. In his hands is the collider. The collider’s just a small ring, maybe the size of a Cooktune pot lid. Ava leans in as the artist starts explaining. His voice is nasal, reedy.\n“A charge whips around and moves this plate, which gives whatever that’s in-between a crunch. It’s not any charge—we’ve got a specialized chip in here, with its network system transferred over from a genetically enhanced breed of eel.”\nDenise’s voice cuts through the holoclip: “A little collider, kitschy and adorable. But, it’s extremely powerful, more than he knows. He smashed up marshmallows, flat as discs—always nice to give out some sugar to these bleary-eyed academics. The best kind of swag. And then he adjusted the settings. Someone gave him the spare button from their shirt. Pulverized the thing. I don’t think anyone realizes how powerful that thing is. If you scale it up . . . ”\nIn that instance, the button smashes to bits.\nDenise continues, “Well, that’s another matter altogether. I’ve been working on the computation for that and it’ll be big. But, it got me thinking of you, of your—”\n“—hobby,” Ava says.\n“—obsession,” says Denise.\nAva sticks her tongue out at her, which Denise ignores or doesn’t see.\nThe holoclip fizzes away and shows Denise again at her office, flipping through some of the floating orbs that contain her files. With info too precious to upload onto the waves, which would be a lot less clutter.\nDenise, through the holowaves, rearranges the data orbs, stroking one of them. “I struck up a conversation with him.”\n“Bet the satellite reps were glad about that.”\n“Yeah, they didn’t get any info from me. But, I told him to wait and pulled out a few coffee beans from that stash you gave me. The ones you said I could crunch on during a down day. We tried smashing them. They pulverized okay. A little too charred. So I figure I’ll pull out one of those not-yet roasted specimens that’s just a keepsake.”\n“And . . . ?” Ava is nearly salivating.\n“You’re smelling it.”\nDenise puts the sniff horn back next to the ground coffee dust, blown to bits in a tiny collider. Ava takes in another inhale and it blooms all around her, the full notes, the fruity tang. “This has got to be Argentina,” says Ava.\n“That’s right,” Denise says.\n“Dark roast, bold bouquets.”\n“Yeah, the heat toasted it right up.”\nAva leans in, excited and knocks over a few beans, like the baby with the Cheerios. They scatter. “You know what this means, right?”\n“You’re coming over to get a brew?”\n“Not just coming over. I’m coming and scheming. I gotta get my hands on that collider.”\nThere are two echelons in the world. The ones where you can demand for things and feel like you got a high probability of getting them, and then there’s the ones where begging just makes you seem more pathetic. It’s not like Ava can just go marching up to a contemporary artist hired by one of the big corps and just demand they hand it over. It’s not even theirs at this point, the rights are bought by the corps.\nSlick, that’s what she needs to be. She’s gotta be subtle about it.\nThe mini-collider’s kept not in Victor’s workshop lab, but in an offshoot of the satellite corp. In their cultural outreach center. Sounds pretty tame, but it’s flanked by security. They have some pretty valuable pieces of art in there. Valuable as in hefty price tags. Satellite corps commission atmospheric-entry-proof decals that are worth tons of money to be slapped on their satellite bodies for commercial purposes. Some say they engage in a not-too-shabby trade of space travel antiques, alongside the snazzy pop art pieces, too. To be socially relevant and keep their brands in peoples’ minds, but it’s pretty lucrative.\nThey’ve got whole tons of stuff in storage, too, so talking heads say, but luckily Denise found out the mini-collider will be on display. It’ll be trapped behind glass, waiting for sticky fingers, one of the thirty pieces at their current on-site rotating exhibition.\nGood Denise. Smart enough to ask enough pointed questions about the art piece. Just enough to sound engaged and curious.\nDenise plucks a data orb from her desk and passes it into her computer’s frame. She must be doing work as she’s talking. “Is it really worth it?”\n“To make the best coffee ever alive? Is there anything more perfect?”\n“String theory and the vibration of threads in harmony?”\n“Fine, that and the coffee.”\n“Worth break-in and entry?”\n“It’s not really breaking in if you’re invited right? And besides, I’ll be the one doing the dirty work.”\n“Alright, well, I guess it’s better for me to be arrested as an apprentice than a perpetrator.”\n“Now, there’s the spirit! Glad you’ll be my backup.”\n“Anything for my sorority sis, right?”\nThey do a cheesy hand slap through the holowaves and laugh.\nAva doesn’t like to talk about her past bosses. The ones that verbally abused her, called her know-it-all punk, and used so many strings of curses, you’d think they run out of air. Tony at Everfresh, Jazz at Calmorn, the infamous Jenny at Pour-Me-One. And the rest of them. Sure, she provokes them, but can she really help herself? Some of those faux beans they pass off as real have no taste complexity at all. Just generated blandness with pumped in acidity. And don’t even talk about the rancid so-called fresh grounds. Those are just vile.\nBosses don’t like to hear that. They like to hear that you’ve earned more sales. They want to hear how many inches your smile increases when you approach the customer and that you’ve input the spelling of their name right on the engraving zap for their cup. They would get robots if they could, but to get the kind that perform like, well, actual service folk and not like dummy vac here, would be more than most of these wanna-be-bohemian-but-actually-franchise joints are interested in investing.\nWhen Ava takes out her store she’s been building up, the collection of singular coffee beans, flavor profiles of different years, she’ll win it big. Be the Prime Aggressor, the know-it-all expert that doles out the insults. Retribution, while knowing she’s got the upper hand. Her trophy would say so. Show them she was right all along.\nShe can’t wait.\nAva has on the brown vest and the green cap. She looks the part, the appraiser to assess the art’s value. With Ava’s goading, Denise pushed out a rumor not affiliated with her lab about an upcoming discovery. Now the physics-related artwork prices are in flux, climbing, and acquirers are lapping eagerly at these pieces.\nArt follows innovation and social trends. It wasn’t always like this—art used to be a place for a break and dissension. Now it’s all come together. The companies are always eager to enumerate their assets and to upgrade their financial standing as to win over investors into their savvy businesses. Corps thrive on money, power, and a sense of prestige, and they’re always trying innovative ways to marry art and business and capitalize off their cultural relevance to get more of those three things they’re always pining after. They commission and buy art, and artists seem all too happy to be their puppets. After all, some of this new tech art isn’t cheap, needs a wad of digidollars for production.\nThe satellite company, K-Squared, invited Ava in right away, as Denise helped her forge the ID of their typical appraisal company.\nAva’s hand is sweating over the orb and she wipes it in her pocket. The orb’s data file’s been purged. She gulps, envisions her goal—holding the food champ trophy—and walks over to the guard.\n“I’m here to see the management. I’m the appraiser you called in.”\nFor a moment, she hesitates, but collects herself as they do a skinscan. Ava had the skin files printed over her and she’s standing in it, in some made-up employee’s skin that Denise dumped into their system, fighting the urge to squirm, feeling out of sorts. The machine beeps a yes and she’s ushered into the exhibition.\nAva hasn’t been in an art exhibition for a while and is surprised to see that the same aesthetic is still in. For all the changes in tech art, you’d think there would be more drastic changes to display. But, nope, a quick assessment confirms. Museum-like exhibitions are still the same. White walls, glass. As if that was the only way to present things.\nIt turns out that the Munchkin Collider, as it’s called, isn’t the pièce de résistance. The real jewel of the exhibition is a reconstruction of a model of K-Squared’s main satellite, but cloned and spliced with bee genes, where tiny satellites buzz about in a multi-holed hive-planet model of a world. A friendly reminder of a future or alternate world where the satellites are all too relevant.\nAva works her way over to the corner, where she’s spotted the piece. Exactly as she saw it on Denise’s encrypted holowaves film. A loop, just a small cooking pan lid, but what it represents is much more remarkable. Even if she’s disappointed that the piece isn’t getting the limelight, she’s glad it’s not the main display. It’ll attract a lot less attention and the less fidgety the administrators, the better.\nShe’s got her flexisack open, full of scanners, surface assessors, and intel checks when she hears footsteps behind her.\n“Hi, I’m Yumei, the curator.” Ava curses under her breath. Wasn’t there a talk she was supposed to be giving today, like right now?\nMust’ve been cancelled.\nAva makes a few hand gestures (hidden away from the cameras that she’s spotted) to activate the alert to Denise. Denise must have stepped away from the control center of her apartment’s living room. Ava could’ve used a warning.\nAnd some alcohol to loosen her nerves.\nAva smiles the way she does when has to confront a customer. Reassuring. She hopes it’s convincing. Yumei is a tall figure with hunched shoulders as she peers down at people like she peers down at her art subjects. She has high arched brows that appear as if they’re constantly questioning. It’s hard to tell what she’s thinking.\n“I’m the appraiser, Song.” Ava flashes a security wave that brightens the room and then dims. With that, the voltonic light extinguishes, so Ava knows she can’t pull that stunt off again.\n“You’re here early.”\n“No, we had a change in the scheduling. My company sent the update a week ago.”\nYumei walks up to the glass stand and lifts the case. An alarm goes off and she says the safe string of numbers and letters along to tonal cues, which silences it.\nThere it is, the model particle collider that makes a perfect ground bean.\nAva feels goose bumps under her fake skin. She’s glad the appraiser outfit is equipped with long sleeves.\n“This is a beautiful piece we commissioned from Victor Lang. Titanium-lelum alloy, true-to-scale with some artistic reinterpretations. This year, so it probably hasn’t accrued worth from sitting around. But, well, we’ve heard the rumors . . . ”\nYumei pauses, her arched brows directed at Ava as if fishing for more.\n“Well, can’t comment on the rumors in the physics realm, but let’s just say that the particle collider types are doing quite well.”\nAva picks up the piece delicately, with the smart fabric lighting various colors as it takes in the weight and attributes.\n“Let’s hope so. We paid fifty-five mil for it.”\nFifty-five mil! Ava’s hand shakes and slips. And she catches the piece with deft diner-experienced precision before it falls further.\nYumei eyes her warily. “Are you really—”\n“Yes, Munchkin Collider passed the gravitational pull test,” Ava lies. Her hand is steady now, as she collects herself. “Now, to do a few more. If you don’t mind, I’d like to undergo some more innovative appraisal checks. Some of these are harmful to the eyes and I have my reflectocontacts in, but it looks like you don’t.\nAva turns her eyes blue with cerulean stripes. The world around her becomes monochrome.\nYumei says, without a hitch, “I would be happy to oblige. But, for precaution’s sake, I’d like another appraiser security wash just to be sure.”\nAva’s heart thumps in her body. She’s got no more juice left in the security wave that guaranteed her ID. It was exhausted in one go. She was lucky to even be able to procure that much of the industry-specific light.\n“Okay, I’ll emit that in a second, after I finish this test,” says Ava, her voice steady and calm, as she practiced. She pulls out a second layer scanner and runs it past the object. “Don’t want it to disrupt the results of this one. The surface looks freshly done, but there are a few nicks I see that might detract from the final value.”\n“Undoubtedly from the trial runs of smashing at the conference,” says Yumei. She looks deadpan, like the idea of hitting things together doesn’t bemuse her the least.\nAva breathes out. At least this scan bought her time. “Undoubtedly,” Ava repeats. “Comes with the territory, I suppose. All the collider models have to be constantly re-detailed.”\nShe’s sending out a sneak comm to Denise, now. Where is that girl? She can’t stall much longer, and the air is starting to get stuffy. She is getting hot under this second faux skin.\nA vibration goes up her hand. Denise reassuring her that she’s back. Ava says quickly, “I’m getting some interesting genetic signals. I’ll have to match that with my database. It will only take a minute or two.”\nYumei narrows her eyes at Ava. Something she said didn’t jibe. Ava can tell. In her head, she groans. She remembers the other holoclips that Denise sent. Ones where Victor Lang is winking, smug. Maybe the eels weren’t genetically enhanced after all. Maybe Victor Lang was just coming on to Denise, making up lies. Maybe . . .\n“I’m not sure if we ever checked your bag. Did we scan—?”\n“Yes,” says Ava, implying that she herself was scanned, and not her bag. That’s not a lie.\nIn her bag is a replica. They tried to get it as true to form as possible, hiring black market for imposter pieces that they put together themselves, so there will be no trace of the whole thing intact. Ava used the same payment methods for some of her more difficult to collect coffee beans that faced border restrictions.\nOutside there’s a commotion. They start and look out through the windows. One of the foam security hydrant’s gone off, sending foam everywhere. Sometimes the electric net frames that power the city get a glitch and require the foam to prevent the glitch from spreading, but it’s a rare sight. Passersby pull up their wrists to film it.\n“Continue your tests. I’ll be right back,” says Yumei. She heads out, probably checking to make sure the glitch hasn’t spread to the front of the K-Squared quarters.\nThank you, Denise, Ava whispers under her breath. Denise must have worked her charm with some other hacker to get that done, since Ava’s pretty sure the city grid is out of her league, but Denise has some discreet friends in high places. Ava slips out a small needle from under her faux skin. It releases a variation of the security light that short-circuits the cameras and feeds them false footage.\nShe executes the exchange—her fake for the real Victor Lang—and makes a quick calculation of value from an algorithm Denise threw together. Ava sends out a message to Yumei with the information. The good thing is, they’re probably right about the value. Ava just couldn’t get the numbers before the scans were complete and the estimate came in. The fifty-five mil took her by surprise—something that should not have happened. The figure highlighted on her wrist screen tells her it’s worth almost double now, with rumors spreading of the physics discovery abound. The physics and art worlds were abuzz with hearsay.\nWhile the repair drones fly in for the glitch, filling the air with their helicopter buzz, Ava takes her leave. The guard is only half paying attention, his head twisted at the scene outside, and he makes some comment about it. That works in her favor as the empty data orb is now filled with a physical object—the irreplaceable Victor Lang. They weren’t totally sure if this last part would work, but the scan pauses at Ava’s data orb. A red so quick and imperceptible flashes to green and the guard is still chatting away with Ava about his son’s allergies to the foam they use for purging the electric net, completely oblivious, and Ava nods, not daring to wipe away the cold sweat running down her real neck. The faux skin that’s over it is so hot she can’t wait to peel it off.\nThe last thing Ava sees is the security guard stepping outside, locking up the exhibition for the moment. He’s watching the foam spurt and spurt and Ava runs the opposite way, sweating in skin that’s not hers, away from the repair drones, away from the satellites that gather way too much data, and the sterilized world of art display, where all the backdrop are white and glass.\nAva and Denise celebrate with virtual cheers and hugs. Denise is still strapped with her lab so she can’t get away, so they settle with breaking champagne and experimentation. Ava plays around with it, exploding beans she’s been collecting for years, ones that she didn’t dare roast conventionally with the unevenness of the heat-infusion tech. She really does think there’s an electric eel splice in there somewhere, the seared pulverized result is perfectly roasted, and smooth to the smell, reminding her of the sleek agility and full body of an eel swimming around in a fish tank, a site she witnessed as a kid at an aquarium long ago.\nAva pulverizes enough beans for a cup and places them in a tiny data orb that she zaps clean. She takes it to a specialized centrifuge in the dead of the night, on a holiday so there is no peep of a researcher. It’s a food lab she has connections with through her multiple jobs, the ones she worked when she used to be a food taster for mechanical production and quit (so sick of tasting fake foods that she went in a blaze, telling her supervisor the foods were really all bland) and took on her many barista jobs in her pursuit for the best coffee. Ava incorrectly assumed that the real service world would provide real food that would animate her appetite-yearning soul. But, it was still chock-full of mediocre, and often worse. The lady who works the centrifuge facility owes her one, a colleague who does accounting. Ava had helped her son get into the right institution for specialized sensory assessors, giving him tips on how to really smell things and compose quantifiable data from the qualitative nose. Now all those experiences feel a lifetime away, as she trudges over, the only real delightful smell she’s smelled in what feels like decades safely tucked in her bag.\nAva disinfects and polishes the centrifuge herself. A sound stops her work. Again. There it is. She stops breathing.\nIn the hallway. The sinking shuffling of footsteps. They stop at the door. No one’s supposed to be here.\nShe waits for them to pass, but whoever it is doesn’t. She uses her smell vac and pulls in the particles of the coffee, praying for the machine to finish quickly. At least the smell vac is dead silent.\nThe footsteps move on. Ava drops her shoulders in relief, but she knows she’s not in the clear, not until she gets out of there.\nThe centrifuge’s no ordinary one. It’s got calibrators that focus on speed and pressure, while it maintains all the olfactory particles intact with a vacuum seal that’s near-impenetrable. All the research for her java creation pays off. As it finally finishes and the seal opens up, she can smell it—liquid, cascading like a trickle of a waterfall, that beautiful, dark cup of joe dripping into the container orb. She wafts the aromas away from the door.\nThe liquid swashes about in the orb in her bag as she tidies everything up and vacs the aromas so there’s not a trace. She leaves as silent as she came, deploying the noise cancellers that she installed on the surface of the container orb, so they move quietly along like criminals in the night. The noise cancellers should last until she gets out of the facility, or so she hopes.\n“That’s some damn good smelling coffee,” says Denise. She’s still fussing with data orbs. It turns out there really was a breakthrough at some other lab and she’s trying to keep up with the news.\n“I think the words you’re searching for are ‘divinely fragrant, with touches of cranberry and a hint of the acidity of lemon, though far from overbearing,’” says Ava.\n“Like I said, ‘damn good,’” says Denise.\n“Okay, good enough for me.”\n“How’s it taste?”\n“It’s so ridiculously marvelous, I can’t bear drinking more than a sip,” says Ava. “It’s silly, just a cup of joe, right? But, it’s the absolute best cup of joe there is. Half of me wants to just gulp it down in one go and laugh and cry from the buzz. But, another part of me knows that it’s staying in my keeppouch until the submissions open for Grub Howls.”\n“ . . . Food Champs on the Prowl!” says Denise. “You think the aromas will stick?”\n“In the keeppouch? Nothing degrades, not even the smell. You can trust me on that one.”\n“I trust your nose,” says Denise, laughing. “You know, Ava, sometimes I think you’re really twisted, but sometimes I think that twistedness comes from a one-track mind that just does what it wants.”\n“And sometimes I think that you deserve a lot more than you get—like your own principal investigator funds, some minions of your own. Maybe the incompetent ones that work with you . . . ” Ava trails off as Denise stops her.\n“Yeah, yeah, but then I’ll be too high-profile to go scraping around the muckier side of things for a celestial sip of coffee.”\n“Touché,” says Ava.\n“Oof,” says Denise as Ava watches an unmarked drone carrier that passed through Denise’s lab window drop a package in her lap.\n“Is this what I think—?” cries Denise, ripping it open. The drone flies away.\nInside is a marble, full of a deep brown liquid.\n“Your cut of the share. Not enough to sustain you day after day, but it’ll sustain your soul knowing that this exists. I’ll get you more when I can.”\n“Should I drink it?”\n“Hell, yeah? Get that down.”\nShe opens it, takes a whiff. Even without the enhancing functionality of the sniff horn in place, Ava can smell the waft of that powerful liquid coming through the holowaves.\nDenise calls out the password, which opens up a slit. She places her lips against the marble, tilts her head back, and she looks as if she’ll just melt into her chair.\nAva smiles. “Damn good?”\nFor a moment, Denise doesn’t respond. Her eyes flutter open as she shuts the lid of the marble. “I see it now. Why you go to great lengths just to get this. It’s transcendental.”\n“A quantum ecstatic state,” says Ava.\n“Sure, I think it just atom smashed my heart,” says Denise. And they both laugh.\nK-Squared exhibition doors still remain open. Ava manages to dig up information about the exhibition, especially on details like when they’re moving out the exhibition. She marks the date and when it comes, she strikes again, this time doing a switch-back. No one needs to know she took the machine, and besides, the newest version she crafted and tweaked from its specs works even better than the original. So back the original goes and she’s going to collect the dummy before any new scientific achievements crop up to pitch the artwork toward another appraisal.\nShe poses as one of the workers, slipping in and out, using deft hands and a number of blinders to scramble the signals as she works. The other workers are too busy handling the pièce de résistance satellite beehive and other notable works of art more high-profile than hers.\nNobody has figured out the switch.\nThere’s someone new in Denise’s office when she calls. A supervisor, who constantly provides encouragement for Denise’s work. Even now, Ava sees a holomessage highlighting Denise’s contribution to the team. Ava doesn’t know if this is the reason, but recently Denise has been talking about applying for some fellowships, voicing interest in testing out some experiments she’s kept on back-burners.\nAva chats with Denise as usual, but inside she’s mystified as to why all these years her nudging hasn’t worked, but now all of a sudden, Denise’s open to change. Maybe Ava spent too much time belittling her rivals. She always thought she pointed out Denise’s strong points, but perhaps it wasn’t obvious in her disparagement of her competition.\nBut, Denise looks happy.\nMaybe, just maybe, it’s the miracle of that sip of coffee.\nIt’s no surprise that Ava gets the coffee award. A giant holographic bean beaming out of a 4x6 crown-shaped trophy. The award is accompanied by contracts for her appearance on Grub Howls and tasting notes that beg her to make public her recipe, offering her grand payments for its divulgence.\nNot going to do it, Ava decides, but the grand prize isn’t too shabby. No more waiting on tables and being the on-the-fly pourer of terrible coffee for the customers.\nStarting next month, she will shine.\nAva scrawls out a few diagrams of how she’ll approach the show. She’s still trying to figure out how to rain terror on these baristas effectively so that they’ll change their recipe. At least try something that’ll come close to the actual aroma of coffee. A public persona of showering insults is how she’s always imagined it, but now her view’s starting to change.\nDenise’s blowing up. Getting big. It wasn’t her team that had the big breakthrough in physics during the whole appraisal fiasco, but Denise keeps hinting there’s good news coming her way.\nAnd one day she makes the announcement.\nShe got the fellowship and her review comments are all exceptional.\nAva takes a tiny sip of that original drink, making sure to siphon out the sip without exposing the rest to air. There’s still some of it left. The original “true coffee” coffee. She’ll make more, she knows. She’s improved on the design of bean collider. Tinkered around with the acceleration speeds and the materials. Also added a collection vac to it all, so all the aroma and ground debris can be retained for the final brew.\nAva smiles as she hears Victor Lang announcing on the holowaves a not-insignificant sum donated to his person. Coffee money, she thinks. He deserves it. Most of Victor’s money he gets from satellite art commissions gets locked up in stocks, and there are stipulations on how long he needs to hold them before sale. Even with the crazy high value of the artwork, very little actually shows up in Victor’s pockets. If commissioned artists pull out the money, they’re coerced into redirecting them into the foundations that K-Squared set up. All these exploitative practices that Ava looked up. She knows with a sense of satisfaction that Victor is probably pretty happy with this money not associated with the company that owns his life with all those signed contracts.\nAva stays awake late every night still collecting, tinkering. Making the centrifuge and collider better. Setting up contacts across oceans for better beans and stretches of land growth. She’s never revealed that the micronized coffee grinds are all done by collider, but she has mentioned that she explodes the bean into a powder with a secret technique.\nEven Food Blink holomag calls her “The First Great Female Molecular Gastronomic Celebrity Chef.” With a photo of her on the front cover, her hands covered in brown pulverized dust, her lips blowing it at the reader. They say she’s “the one” everyone’s been waiting for, the one who broke into the boys’ club of food, gadgets, and geekery. On the timeline scroll-through, they show the parade of male chefs throughout the contemporary culinary sphere: masters of sous vide, foams, dehydration techniques, flash-freezing, spherification—then her, breaking the tradition of males, with the caption of her method: maximum pulverized centrifugal drip (for brewed drinks and decoctions).\nAt her first shooting of Grub Howls, she shouts and screams at the personnel. But, behind the scenes, they laugh and drink coffee. Her resentment starts to dissipate; even old grudges slowly fade as they share sips of incredible coffee. The magazines must be on to her—café staff must be leaking that there’s an angelic side to this food snob demon with her hair-raising outrage, since they’re looking past her dark side and highlighting the bright. “The Golden Face to a Dark Brew.” “The Sparkly Java Guru.”\nAva puts her feet up in the back alley where they’ve stacked chairs. The video crew is taking a break, puffing out some e-smoke. She sits with some of her old coworkers, friends from years ago. (Were they friends? They sure seem like it, she thinks. Even good ol’ Manager Martin shows up to do a pretty spot-on imitation of her celebrity persona.) They sip and sip—the aroma of bittersweetness fills the air. And she’s reminded of the time they took her shift or went out to pick up more stirrers when she was running busy. It wasn’t all bad, she concedes, letting her mind drift as the steam hits her face.\nSomeone refills her mug with some of the crap from the kitchen. Bitter, burned, and bland, all at once. One day it’ll be great, she thinks.\nIt will totally be great. Already her coffee boom takes off—starting literally with that sweet redolent glorious boom of an aromatic collision.\nD.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation."}