{"fingerprint": "12zcr2vnAilel3xmnFdL6dWETfo=", "sitename": "Clarkesworld Magazine", "title": "Antarctica by D.A. Xiaolin Spires", "author": "D A Xiaolin Spires", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spires_11_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Antarctica by D.A. Xiaolin Spires", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5680 words, short story\n Antarctica\n I set my laser to a thinner edge as I cleared the excess around the general parallelogram shape of the form before me, a structure filled with tiny nodes. White shards flew around me, hitting my face and sticking to my skin, as my laser danced across the piece. I wiped the shards off with a towel before they could melt, already feeling the chill. I put the thermamask on over my head, cringing.\n The door opened up with a sucking “shwoop” before closing again, the room still in cold stasis.\n “Chenhua, you finally decided to throw that thing on, huh?” said Mac, pointing at my masked face. I turned around to look at him, pausing my laser for a moment. Even though I could only see his eyes, I could tell he was smiling. His sleeves were rolled up and I noticed goose bumps. He started rolling them down.\n “The mask obstructs my flow. But, so does having ice spit back into my face.”\n “Come out and have a beer with me.”\n I turned my laser back on and continued carving. “I can’t. You know that. And shouldn’t you be finishing up your ‘Ice Eight’ test?”\n His face fell. I could tell from the crinkles disappearing from the side of his eyes. “It failed. Nothing sticks. These damn microorganisms. At least your Eight seems to be coming along.”\n He reached behind me as I worked. “Careful, this is a live laser I have here,” I said, not bothering to turn it off this time.\n He released his hug. “We have a living center designed with Passivhaus principles, warm and toasty and here you are in the numbing cold, playing with ice. You might as well be out there in the blistering frost.”\n “Everyone else is in the cold, in their labs, testing their ice. Why should I be any different?”\n “Because you’re the artist,” he said. He snaked around to the front of my worktable and started admiring my other magnified replicas of unit cell phases of ice, encased in their own clear giant lockers against the wall. The laser emitted a tiny buzz as I continued to work, this time chiseling out finer detail on beam mode five. “Besides, you have a choice. You could make these models out of plastic, just print them out and be warm.”\n “And what’s the artistry in that?” I tried to get myself back into the flow. I turned off the laser. His presence interrupted my focus.\n “I don’t know, design? Durability?”\n “Mac, any schoolkid can print out one of my compositions online, but to render it in lab repro-ice is another thing altogether. You know that.” I put down the laser pen, intertwined my fingers and stretched, leaning forward. My fingers and lips were numb. I didn’t realize until I stopped working. I got up, deciding I could use a break after all.\n “Yes, yes, I know. They really are beautiful,” Mac said, with a whistle. He stroked the chin under his mask. “The crystalline structure, so intricate, rendered in so much detail.”\n I pulled out a large drawer, showing him my previous versions of Ice IV phases. Not quite perfect.\n “Beautiful,” he said. His eyes wide, his deep black pupils reflecting the complex network of connections and coordinates. “Almost as beautiful as you. I mean your, uh, neurons. Your smart ingenuity.”\n I laughed. “Alright. Since you’re trying so hard, I’ll get that beer with you.” He threw his arms around me.\n The alarm sounded and a groan that should never have been audible through the walls resounded in the room. We never got to getting that beer.\n “We lost McCurdo,” yelled Stone. He was the head of the team, the biologist Steven Stonewall, but everyone called him Stone since we never once saw him smile. We traipsed through the snow as fast as we could, but Antarctica was never kind to us two-legged squishy mammals. The vehicle was just fifteen feet away, but it felt like miles.\n “How can that even be possible?” I yelled through the howling storm. We shouldn’t be out here. We should be in there, in the warmth of the structure. The mechanical surveying team pulled up to check the house, which we all called Caterpillar for its long shape. They made sure there were no damages. Another team was checking the ice. My parka stretched across my underthermals, I trudged along, with something, some tag rubbing against my back. It shouldn’t have been my biggest concern then, but I couldn’t even think about anything else—certainly not the imminent frostbite, the unforgiving, unrelenting bite of this land. Just that rubbing against my back. Something I could pinpoint my focus on.\n Stone continued speaking, lost in thought. “McCurdo Station gone. The calving. It was quick. Too quick. Some of the buildings on landside survived, but the ones that are drifting or fell through, vanished.”\n Mac was racing ahead. He was always the fastest one, being lean and tall, with large strides.\n “The microorganisms,” I whispered. I don’t know how Stone heard, but I saw him nodding. I covered my face with my hand, blocking the cutting wind. The gales felt stronger than my laser, chiseling my face into its desired shape.\n “We don’t know if it’s magnetic or a pulse or what,” said Stone. “But, they’ve got something that is lacerating and propelling the ice.”\n Mac had reached the vehicle and was driving it back this way. It cleaved through the wind like nothing else. Germans and their incredible cars. This specially designed snowmobile looked angelic to me. I could almost imagine a halo as my legs started to give. Even under the smart underthermals I could feel the bite of the cold, as the wind continued to whip my face.\n We got on, just as my breathing was starting to escalate into cold-induced hyperventilation. We had been all too much in a rush to grab our climate-controlled portable breathing units. We were lucky our faces were still intact. I watched as the bots crawled across Caterpillar, checking for inconsistencies. Some of them pulled out arms to spray a sealant glue. Others shook the housing structure, checking the integrity of the ballasts.\n It was warm in the car. I took off my gloves, blew on my fingers, and set them against the warm vents.\n Mac listened in on the comms. “Looks okay. Not a collapser,” said Mac, passing his eyes back up at the Caterpillar. Not like all those McCurdo Station buildings, is what he didn’t say. We’ve witnessed a few collapses in our day. They were, as all of us could agree on, a few too many.\n I thought about my crystalline pieces, renderings of the different phases of ice. The hyperglass cases were sturdy and could hold up to a lot of pressure, but I wasn’t sure about a collapse. Funny how you think of your work before your own well-being. I should be worried about what we would do with ourselves if the Caterpillar really went kaput.\n Stone breathed a sigh of relief. The storms were evanescent things, suddenly furious, but dying with the same swiftness. They were getting worse though. More frequent, more powerful. What was happening to the poles?\n Mac drove us east towards Adelie Island. He didn’t want to go anywhere near McCurdo, knowing how precarious the situation was. We listened to the crackling radio in the car. The driving was so smooth, even in the midst of the storm. I vaguely wondered how much it would cost to buy myself one of these dream vehicles with their nearly-infallible sonic stability features—before snapping to the reality of the 150 mph wind smacking against our car, the violent starkness outside our isolated warmth. The communications department mentioned that rescue teams have been called in for McCurdo, ones trained for emergency care and assessment. Not wanting to get in the way of bots, Mac took us in the other direction, to survey the animals we were desperately trying to protect. There would be drone teams checking them out, but it seemed most of the damage was limited to the edge of the Ross Ice Shelf.\n A hush fell as we entered the ancestral breeding grounds of these majestic birds. The ones that acted like fish and conveyed tenderness like humans. We stopped about a hundred yards away, pulling out binoculars from their resting places in seat-back pockets. We witnessed the drones hovering above, adjusting to the gusts, grabbing footage. We saw the males huddling with the chicks and a few females returning from the arduous trip across the ice to get food. The females looked thinner than the last time I saw them, losing much of their body weight during their fast at the hatching site.\n Mac turned off the radio. The crackling stopped.\n “I’ll never get used to the ways these things just stand out there,” said Stone, adjusting the knobs on his binoculars.\n Mine auto-adjusted as I strapped them to my face. I must have picked up one of the new series. I could see the splash of oranges on their cheeks, magnified, next to their beaks. Behind and above their beaks, their eyes dotted like two punctuation marks, small harsh beads, pitch-black, as if the penguins were squinting from the cold.\n “You hear the news talk about them as the waddling tuxedos and their slow decline, but to me, they look more like dominoes. All lined up when they march, with their own order and configuration,” said Mac.\n “Yeah,” I said. “Though they look more like a massive jumbled-up crowd now. But you’re right. Tuxedos could never be so slick as they zoom past in their freewheeling slides.”\n One of the females was doing just that, sliding. She reached her young, opened her beak wide, like mistletoe hanging over an expectant couple. The little chick gobbled up whatever that beak held, in hasty, spastic gulps.\n “Slipping and sliding and slick hides. Of course, you’d think about the texture,” said Mac. I don’t know how many times I must have prattled on to him about structures and textures, tactile properties of ice and life.\n Now the dominoes were shivering out there, but otherwise straight as poles in the sea of ice. Occasional flits and movements here and there, but mostly still. A crowd of miniature Stonehenge.\n “And dominoes and penguins have another thing in common. Gambling,” said Stone.\n “Gambling,” said Mac, as if in agreeance. But, his expression said he didn’t understand.\n “They’re like me, they’re risk-takers,” said Stone. We nodded. Stoic Stone seemed as far off of a risk-taker than anyone I’ve met, with his redundant checking protocols, but then again, he was out here, on the brittle ice like us. “Every year it’s a gamble to see how many of these chicks survive.”\n Mac reached into the glove compartment and rummaged around. “How did that song go? ‘The ice recedes and recedes, the breeding ground ice softer and softer,’” he said, quoting lyrics from a hit meme song about climate change. He whistled. “I can’t seem to find the disc here.” I chuckled, thinking of those old disc relics. Mac smiled, pulling his hand out of the compartment, and instead started up the digital musical files in the car. The speakers blasted with that wretched, catchy tune. Stone’s lips remained a straight line.\n Two years ago, the ice collapsed, wiping out half the emperor penguin colony. By then it was mostly bots handling the research. But, once the bots discovered the bio-matter wedged in the ice, they sent us in.\n They thought it might have been bio-matter carried in by atmospheric nanos that drifted over the South Pole and settled onto the ice. Theories. No one really knew where they came from. I watched the male penguins incubate, from the warmth of my car. I felt like one of those chicks, jammed in the safety of their fur-like plumage while the outside cold wore on. In the -60 °C chill, one false move and their chick might be gone.\n As the climax of the song hit, “ . . . and the crack broke through the land,” I imagined the microorganisms falling from the sky, undetectable to our instruments while in the air, inflicting calamity as soon as they hit ice. It seemed improbable they could survive this cold, let alone swirl down from the heavens.\n Improbable, but yet they were here. Humans were always bad at probability.\n Mac punched a few keys at the screen, turning off the song system. The lyrics were getting grim.\n Stone flashed us a warning and opened the door to the dreadful cold. He leaped out.\n The cold flushed into the car, or technically, the heat seeped out in a wave, but it always seemed alive, this cold, like terrible tendrils out to obliterate organic life.\n Not the microorganisms though. Stuck in ice, they’re impervious to the cold.\n We followed suit, grabbing our gear. I pulled some spare breathing units from the back pockets of the seats and our faces stayed warm. My all-temp scrawl pad in hand, I made a few sketches of the landscape. It was what I was paid to do after all. The grants of the benefactors put to work. I traced my gloved finger over the screen, capturing the easy cures of the penguins’ backs, the white of the ice beyond. My hands were firm, not shaking even a bit. The storm wasn’t too bad here. It must have been segregated out west.\n I looked out to the horizon. It blended with the ice, a swath of murky whiteness that stretched all the way to the sky. The whiteness quivered in the slight atmospheric blasts. It was windy, but a breeze compared to the earlier rage. I brushed back a stray lock of hair, billowing in this relentless, raw ever-winter.\n Mac got on his knees, reached out to the ground, and chipped some ice. He dug around for a while, making a five-inch deep hole he would later plug with repro-ice. You needed to go deeper to find the microorganisms. That’s where they lived, and where they wreaked havoc.\n Structure-breakers. Ice clefters. Snapping the ties of the bonds.\n Shaking my pad to save my earlier sketches, I started a new one: hexagonal crystalline ice. Then I drew over some of the bonds. Ice Ih, the most abundant ice on Earth, almost all of it in this phase, now falling prey to these invisible parasites.\n We were heading back. Even our gear couldn’t take too much of the cold. Nor our bodies. I didn’t envy the penguins, though the adoration and care they devoted to their young was certainly admirable. I drew one last continuous-line drawing of the birds, lifting my fingers only to dot their eyes. I turned around. Mac was already striding ahead, as usual.\n I had half my leg in the car, when I heard a shout. I turned around. A nightmare filled my vision. A collapse. Isolated, at least it didn’t reach the penguins. It was Stone. He was behind me a minute ago, but now he was back twenty feet, his leg trapped in the ice.\n We drove the car over and, with a heave, pulled him up.\n “They don’t like us,” he said. He threw the specimen jars into the glove compartment. He tried to hide it, but his hands trembled, as he irradiated his leg with the handheld. His expression was as flat as ever, but you could see in his green eyes, the dilated pupils, that he was shaken. The microbes.\n Mac drove us back. The comms gave us a green light to head back to Caterpillar.\n There used to be more of us here. Besides Mac the biochemist and Stone the microbiologist. We had Rika in chemical engineering and Hiro, the textile material engineer. I liked Hiro a lot—we used to chat about materials, every morning as he sipped his coffee, I’d get his opinion on pieces for art projects I had in mind. Rika mostly kept to herself.\n I was the odd one out. The artist-in-residence. Stone never said so, but I always knew he thought it was stupid to have an artist. Superfluous. Better to bring another scientist, even if I had a master’s in environmental sciences—I was still there as the artist. The “bridge to the masses.”\n I uploaded another piece onto the MOMA website, an ongoing collection of my work on-site in the polar south. I had 135 pieces then and thousands of followers. I also put up my webcomic. Lowbrow stuff, even if it had more “hard scientific” merit than my “sophisticated” pieces. 200+ comics and a few million followers. Lowbrow gets retweeted and reposted, translated to hundreds of languages. Highbrow stays in its curated spaces, but gets the funding. Add the penguins into the mix and we had the WWF and foundations across the world throwing cash at our cause. I shut off my pad and went back to my sculptures. These were ones I hadn’t shown to the world. The glass-like delicacies, the pièce de résistance that I would bring back as a complete, groundbreaking series.\n I had been in this field long enough to know what would break ground. Before this stint, three months on a ship to scour the ocean floors and I designed real-to-life candied versions of the coral. These sweet replicas flew off the shelves in museum stores, movie theater concession stands, and supermarket register aisles. They were true-to-life reproductions of new species of animals and exotic corals no one has seen the likes of for ages. And alluring flavors to match. I worked with a food scientist then, and we made large and small pieces of these edible works: large for museum-goer consumption, so they could eat it with their eyes, supersized coral made of sugar hanging over them like trees. Then, small, portable ones for kids in strollers. They could suck on them like pacifiers. It was all the rage. Podcasts had me on. Their hosts called my work the best cocktail of art, both pop and polished.\n Now with the microorganisms, no one could keep their eyes off the polar ends of the world. The Arctic had their own team; here in the southern realms, we had us.\n Mac came by to let me know that I still owed him a beer.\n I dropped the laser, initiated a temporary climate securoshield over my work, and we headed to the lounge. I sat in what used to be Hiro’s favorite seat.\n We drank, not really talking. We looked out from the single hyperglass window into the white expanse. Obliterating. That’s how white it was. I thought about Stone’s leg. It was fine, but his skin needed some repairs. Superficial frostbite. The bots were working on it.\n “It could have been any one of us,” he said, as if reading my mind. Though, I didn’t know if he was talking about Stone or our other colleagues.\n “Not many beers left,” was my reply. I had taken a quick glance of the stock when I walked in. I took a swig, savoring the feel of the glass rim on my lips, thinking of my presence and that of his, our very aliveness. Mac put his hand over my own.\n The microbes took Hiro and Rika, softened the ice and broke it off. Hiro left behind a dog and an ailing mom. Rika, a wife and two kids. Their comms never even registered.\n I looked out beyond, trying to spot the ocean. I knew I wouldn’t. We were facing the wrong way—the ocean would be there of course, it surrounded in all directions, but not for thousands of miles away.\n “Their bodies are somewhere out there. In the sea.”\n “The team will find them,” he said. He sounded weary. “The bots are good bots.”\n He got up and returned, cracking open another beer. Fizz shot out and sizzled away. The skies were clear again.\n “The storm passed pretty quickly,” he said.\n “They’re getting worse,” I said. Mac looked away and pulled out my pad from the window ledge.\n “Let’s see what beauty you unveiled to the world this time.”\n He pulled up the webcomic. I had a few penguins with funny faces, talking philosophy. Amateur stuff, I knew, but the millennials loved them. Then a serious one explaining about ice structures, with only a hint of a punch line. Mac’s eyes passed down the screen. He put the pad back on the ledge.\n “Good work. Funny, but also crucial.”\n “It pleases the crowds,” I said. I finished the last drop of beer and nestled deeper into the chair. It wrapped around my hips like a glove. “So, what happened to Eight? Cubic phase eight, right? You said it failed?”\n “Yes, Ice Eight was a fail, a no-go. Not the right phase. But, I think, we’re onto something. A combination of phase 3 and phase 15 and maybe some others, though not sure which ones yet. The microbes seem to respond to the mix.”\n I got up and made myself a gin and tonic, sat down. No ice. Enough of that for now. Phase 3 and 15. I thought about their structures, their intersections spinning in my head. Nothing felt better than the semi-warm drink flowing down my throat, the bubbles tickling my tongue. The glass clinked as I set it down. No cold, no ring of condensation left on the windowsill.\n “Respond? In what way?” I asked.\n “I have a feeling Stone put some of the specimens on the surface. Out there earlier today. Uncharacteristic of him, I know, but I think he’s getting impatient. He’s testing some of the ice we’re working on. A small portion must have dusted onto his shoe.”\n “So, the microbes wanted it, pulling him in.”\n “That’s the theory.”\n I gulped down the rest of the warm beverage. It burned as it went down, warming my body. Mac came to my chair and caressed my neck and back. His hands felt warm, full of life-giving heat, toasty like the gin and tonic.\n The microbes stuck to Stone’s shoe. A dire attraction, I thought.\n Maybe we could figure it out after all.\n I decided in lieu of my typical droll comic, I would compose a treatise, an artist treatise. Some readers might think it a spoof. But, I thought it was about time.\n It caught like wildfire. It appeared in all the major outlets and was passed on across the world, translated into multiple languages.\n I scribbled a woman in a helmet, gripping a wooden rod, high-sticking as she glided across a clear, slick terrain. Fans in the bleachers cheered.\n Ice hockey rinks, vending machines, dropping hail—ice is ubiquitous but not everyone thinks about the diversity of ice. Like human moods congealing into expressions, when water becomes solid, it has a variety of masks to choose from. From phases I to XV, it has over a dozen of different crystalline solid configurations to take the form of, not to mention amorphous ice, with no crystalline structure to speak of.\n Like smiles, some crystalline structures require less muscle work, for example, phase Ice Ih is the most common one on Earth. Some require more labor to pull off. Like a frown, they require some muscling—Ice V, for example, is the most complex one of all. It requires cooling water to 253 K at 500 MPa to form.\n Here I inserted goofy harmless emoticons, personalities to these otherwise faceless beings.\n When the microbes came, they started breaking down Ice Ih. We tried patching it up. Formed ice in the lab to replace the thinner shelves. A kind of terraforming, but rather than transforming the land, simply reinforcing it with the same material. Like a flying buttress on a church.\n I doodled a grand gothic church, vaulted ceilings, sheer and crystal, with arrows pointing to the supporting structures.\n Hiro Suzuki and Rika Pranata were the most active, going out on long jaunts in the vehicles to pile the layers on. For weeks they spent hours laboring in the cold, spreading water, designed specifically to match the pH and chemical compounds of Antarctic ice and freezing it up.\n Caricatures of Rika and Hiro graced the page. They were waving, smiling from their all-weather vehicle.\n It didn’t work. The microbes didn’t take on. They broke those down more quickly. Some say they didn’t like the interlopers. That they can feel us trampling about and broke ice faster in those spots. Fracturing and calving away. Some say they took the scientists away for getting in their business. Those were the ones that said it was an act of Nature. Nature abhors a meddler.\n A larger-than-life figure, Nature, hovering over the Antarctic pole.\n But, in our grief, we disagreed. It wasn’t Nature—it was us humans who brought these microbes here. A product of human fallacy. It was the same story over and over. I knew it from my journey to the depths of the oceans, on the research ship for months. Our destruction of the ocean bottoms. The expanse of reefs, bleached white. The final dying exhale of an ecosystem.\n Here I filled in a panel with conspicuous displays of color and organic life, only to have it fade to white.\n Now, it was the polar edges of our worlds. Our shortsighted push to the brink of technology. Unchecked hubris. Nanocontamination in snow. The contamination is abundant, everywhere, but the research is in its infancy and unflappable proof of its cause is still at arm’s length.\n I drew in bits of snow, sinister and dark linings of a malevolent gray.\n It wasn’t just us, just the melting of the ice that would flood the oceans, thermally expand and bring water levels to greater depths—it was also the threat to all marine life. And the one that was most endangered now, the cute, bumbly penguins. Their black and white lives threatened to be obliterated, consumed by the gray oceans. Their ancestral breeding overtaken by the microbes.\n I illustrated fluffy, cute tuxedoes threatened by these floating emoticons.\n There are ones that believe in us. Those are the ones I speak to when I pen my comics, when I upload another one of my sumi scrolls or mixed media collages onto my collection. We can’t kill the microbes; that requires an amendment of UN dictations on destroying wilderness species, even if they did not spawn from the wild, as we suspect. But, they relaxed a provision to allow us to experiment to manufacture new ice to replace the old.\n A depiction of a group of protestors, a generation of believers graced the page.\n We looked at ourselves, at our multitudes of expressions. Regret, pity, determination. We looked at the ice, and its many phases of solid water. Expressions carved into intricate crystalline networks, as convoluted as rococo, but as ordered as an army.\n I sketched a band of tough, spirited crystalline configurations, altogether standing in their own battle configurations.\n This is the cavalry that will cease the calving. A formulation that the team of three of us here on New Amundsen-Scott pioneered. Trial testing showed it works. A mix of Phase III, elusive XV, XI, the ubiquitous Ih and a dash of what they call hyper-quenched glassy water.\n I scrawled in a rather detailed, escheresque maze of crystalline networks, wrapped in an ice cube. My stylus flowed with its own will. Tetragonal, proton ordered tetragonal, normal hexagonal, orthorhombic hexagonal ferroelectric crystalline structures, as well as high-density amorphous ice with its dangling bonds—all in concert, all intermingling—streamed from the tip of the instrument I wielded.\n The penguins will hatch on solid ground. It will take a year, but the penguins will rebound, much like us, much like the ice and hopefully, much like the Earth.\n And finally, the penguin, inked with bold lines, imbued with movement, smiled out from the page.\n I stacked the giant carved-ice crystalline sculptures, my models of all the phases, onto the vast ship. Another team is taking over; our tenure is over, though Stone has applied for an extension. I don’t know if he got it, but I think someone will have to literally extract him physically to get him to leave his lab.\n I marveled at my pieces. I knew it was no exaggeration to admit that no one has ever seen such fine sculptures before, both in material and in execution. They’re going to make their way across the world; in rotating galleries, and temporal stays at ice hotels and ice and snow festivals, starting in Krasnoyarsk, to Harbin, to Sapporo, and across the oceans to Alberta, Canada. No one has seen ice sculptures crafted in constructed polar repro-ice mixed with some pasteurized natural polar ice shreds, finely chiseled by surgical lasers. No one has seen the crystalline structures, so enormously rendered, the complex dimples and pores of each formation’s face, their idiosyncratic expressions, exposed for all to revere.\n The last week of our mission, about a week ago, Stone, Mac, and I, and a dozen bots layered shards of the new concoction, composed of several different ice phases, onto a restricted experimental stretch of Antarctic land—one of many where the microbes thrived with the most density. To be fair, mostly the bots layered. The bots sported a coating of repellants so the ice wouldn’t stick to their surfaces. All we did was help move the airtight enclosed cases over. That was about it. We stood back and watched, as the bots removed natural ice, scooped up shards of repro-ice, and planted them like a garden. Their appendages flew in mechanical swiftness, their bodies built for strength and endurance. Recently upgraded, they were at their prime in below-freezing degrees. Much more efficient than a bunch of humans and their doughy skins could ever be. I sketched.\n Unlike previous rejections, where the microbes refused to attach to the ice and, instead, fractured and melted the ice, this time, they adhered onto the old layer. What resulted looked like the wake of a resurfacer on an ice skating rink, the new ice looking clean and shiny, as if just squeegeed. Like a resurfacer, the bots shaved the top layers of the ice to get to the buried microbes. They added not water like a resurfacer, but, rather, these shards of ice we developed in the labs, a mutt of several phases melded together and carefully transported. Lab-perfected repro-ice. When they were finished, it was the satisfaction of glimpsing new infrastructure.\n I took off my mask for a moment, wanting no obstruction to this singular encounter. Mac and Stone did the same. The isolated land looked, even smelled, revived. There was a feeling in the air, buoyed by a crisp scent. The wind whipped my face, but I was so lost in the moment, it felt like nothing more than a gentle lap. I grabbed Mac’s gloved hand, intertwined his fingers into my own.\n I thought I saw a smile creep across Stone’s face, as he stepped forward in his thick boots to observe the scene better. But no, when he turned this way, his face was dead straight, his eyes steely, solid, so maybe it was simply a trick of the light and my own felicity projected onto others. We put our masks back on. The new ice plain of Antarctica glinted in the sun, as the robots wheeled back to the vehicle.\n Fresh groundwork. This was the paved road in which our humanity could survive and develop. And of course, not to mention, the penguins.\n Mac carried his lab packs into my storeroom on the research vessel, placing his expensive equipment and samples next to my insulated, climate-controlled own. His parka sang in the wind. We looked out at the open sea, an image we haven’t seen for months, since we mostly huddled in our labs and traveled only to research sites. Thrashing and shifting between icebergs, the sea looked fake, like a mirage.\n “You should probably move them into another compartment,” I yelled above the sound of waves crashing, pointing at his lab packs. “These are going direct to Russia via the Sea of Okhotsk.”\n The breeze quieted down for a moment. It smelled musty in this old ship, bringing in foreign aromas to this sterile land.\n He laughed. His voice fell what seemed like an octave, as if scraping against the ocean floor. “Lyubimaya, ne volnuysya. Moya lyubov’ ne znayet granits.”\n “Russian?”\n “Yes, Russian. I have been brushing up on my languages. I thought I could be your translator.” He picked up another set of crates, their orange stickers of “Fragile!” the brightest things around. It reminded me of the flash of flushed color on penguin cheeks.\n “I thought you were taking a year off to somewhere warm and tropical. Travel the Caribbean. Isn’t that what you said? ‘Before the islands get engulfed by the sea,’ I think were your words.”\n “Yeah, well, Russia is pretty much tropical compared to this.”\n I could see the crinkles at the edges of his eyes through his thermal mask.\n “Besides, you still owe me a few beers. How many times have you brushed aside our ‘spirit breaks’ for work?”\n I put down my pad and stopped counting inventory. He walked over and pulled me close. I could feel his warm breath fog our cheeks.\n “Vodka,” I said. “It won’t be beer, but vodka.”\n “Good enough for me,” he said, as he activated the ship compartment door. It squeaked to a shut, lending us some privacy.\n Outside, the waves roared, as far off, the bots worked. Fresh ice encroached over thin ground, adding new layers of cohesion and hope.\n Author’s Note:\n This story was informed by: Praveen, Thakur K and A Velumurgan. “Phase Properties and Type of Earth’s Water Ice and Space Ices.” Science of Solar System Ices. Lunar and Planetary Institute No. 146, 2008.\n Procedures such as mixing of ice phases, references to places such as Antarctica/research bases, any proposed solutions to ecological issues, as well as any and all other story elements, are used fictitiously.\n D.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation."}