{"fingerprint": "yzv7LmjmVYtpZFu1zXXB95NDsTA=", "sitename": "Clarkesworld Magazine", "title": "But, Still, I Smile by D.A. Xiaolin Spires", "author": "D A Xiaolin Spires", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spires_03_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: But, Still, I Smile by D.A. Xiaolin Spires", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8310 words, novelette\n But, Still, I Smile\n When my baby flowed away from me, I thought of it as coursing away through a river, far and far away, and perhaps journeying through the great Silver River (the Milky Way) and towards some other exoplanet unseen and unknown. I thought it might be carried away by that great band of light, so faint but populated by so many stars, all doing its part to lift her, tiny little fingers bringing her towards a future that still held bright.\n In reality, the system took the miscarriage remains and sucked it through tubes, yes, tubes unseen, but sterile tubes: no faint stars, no coursing through the galaxies, no distant land where she might be raised in the opposing angles of diffused rays of a dual star system. Despite the number of miscarriages, I was never sure where those tubes ended, maybe it went across the Earth, across the atmosphere. Maybe it jettisoned my baby into outer space itself, her body crystallized and preserved, in the half-born state it came into the world.\n I vowed never to have a kid again. Or at least I pretended to, in my infinite duress. What was the point? She was the closest to term, and yet, still failure.\n But, in my heart, I looked out into the vast unknown, thinking that somewhere my child was there, calling out for her mom.\n Mapping out for SETI was a natural course of an occupation for me. Maybe it was destined, as my name was Dengwen 登文, where deng means climb but also means record like in a registry. And wen meant literature but also could mean civilization. So, here I was, reinventing my name in my own way, recording the possibility of new civilizations in my mundane everyday work. I would spend days sifting through data. Finding extraterrestrial life was ambitious, grandiose, and romantic in theory, but rather tedious in practice. I didn’t mind. Tedium suited me. I could spend days numbly parsing through radio and light signals, any ripple of a signature that would suggest something other than the natural movement of cosmic gears turning came under my meticulous gaze.\n The Drake Equation always bothered me. Sure, it listed all the factors outright in diminishing fractions: birthrate of stars, stars with planets, life-sustaining planets, planets with life spawned, intelligence within those planets with life spawned, technological capability of the intelligence of the life spawned, and the span of years of a technological society. Sure, it made sense, ruling out candidates, like the piling discards dumped by sea trawlers of the past. But, when I stepped back and thought about it, the kernel that was left—it seemed improbable, almost impossible, despite my devotion to the project. Where were these places, these elusive hosts of life? It was like those old nursery rhymes where one thing compiled on the next compiled on the next and became a monstrous sentence with qualifiers abound. Given such a fraction of a fraction of a fraction, ad infinitum, the reduction of all the seemingly infinite stars out there, was there a space really for organic life to blossom and reach out to us and make contact?\n In my office, I rubbed my abdomen as the data flickered on charts before me. The data might be impassive, but my body wasn’t. It hurt. I was too embarrassed to get postnatal care, if it could be called postnatal. No, it wasn’t embarrassment. It was a blip of numbness, or of delusion, of not wanting to face the truth. I had bled out, that rare instance of life fostered inside of me that lasted to such an advanced stage, in the face of the countless attempts at conception, and obliterated by some tacit violence in the universe.\n Finding life out there seemed futile; the universe was as sterile as my womb. Cold, detached, anesthetized. It made one attempt at life and, well, we had royally messed it up. Destroyed ourselves and pretty much wrecked our home, Earth, along with it, thanks to petty disputes, constant competition over scarce resources getting scarcer. To think that another being might be out there and signal at us was like catching my fetus through the tubes and breathing life back into it. We were too far gone and we were hoping for a miracle.\n It was while thinking this—experiencing a flash of pain glide through my lower back and swallowing grief I might never dispel—that the strange anomaly caught my breath.\n An anomalous pattern of radio signals. It wasn’t like anything I’ve seen before.\n I pressed my face against the screen, feeling its cold glass. I looked closely, wondering if the pixels were shifting on me.\n They weren’t.\n I sat up, despite all the groans of my body.\n “Dengwen, you’re lucky you found the blip of possible life.” The nurse pressed the gauge against my cheek, taking my temperature and vitals. She didn’t seem too moved by the idea of imminent communication with extraterrestrials.\n “Yes, there’s hope for humanity yet,” I said.\n She dabbed a bit of anesthetic fumes behind my ear. My nose wrinkled at the smell, as I winced. I hated hospitals.\n “No, you’re lucky, for your own sake,” she said, wiping my arms down with the cleaning cloth. She gave me a stare I couldn’t decipher and shook her head at me, black hair whipping her chin. Then she tied the blue massage fabric to my arms and back. “Otherwise, you might not have ever come to me. How long has it been since the miscarriage?”\n “A week . . . ” My words tapered off as I tilted my head back so she checked my tonsils. I stared into the bright lights of the white ceiling. I still wasn’t sure exactly what she was looking for.\n “And you’re passing enough blood clots to make this an event worth flagging.” She tapped on my chart on the thin screen beside her. It didn’t say anything in that vein. I wondered how she knew.\n Blood clots.\n They freaked me out. I would flush them down the tubes, but they would return, day after day, ejected from my body, haunting me, detritus in lieu of life.\n Yet, they were comforting in their own way; evidence that she did exist, even if it was just a semblance of life, almost-life that short-circuited. Yearning for motherhood possessed me, no matter how much I tried to push it away. I closed my eyes, let my head swim as the massage fabric worked its way, stimulating my muscles, relieving my incessant pain. It couldn’t soothe the ache in my loins.\n Maybe they’ll deliver us some well-needed tech. Something to turn the tides, lower the CO2, bring down the rising sea levels. I wonder what they would look like, corporeal beings or evanescent bands of light? Would they speak with tongues and spit saliva? Or would they hover and float? There was so much we didn’t know. So much that couldn’t be inferred from the little data we had.\n The nurse must have turned the knob up higher, since I felt a pulse travel through my arms. The massage fabric sent me a buzz right under my chest. I put my hand there, thinking of how my breasts had gotten smaller, receded in the wake of the miscarriage, as if it, too, like all my nurturing prowess, decided to go into hibernation. Not yet, I had whispered. I had stopped cooking hearty broths for myself, stopped caring about my health, and instead zapped hydrobar dinners every day. I was numb, but deep within, I still hoped I could.\n I was woken up by the feeling of the nurse pressing a few thin pads to my hands. At first, I thought they were for the bleeding, but she said in a hushed voice, “Hemoglobin adhesives. It’ll pump some iron back into you. It’s cutting-edge tech that I swiped from the gift bag of a higher-up at a conference for military medical innovations.”\n It felt light in my hands, almost weightless.\n She pressed one against her skin, not opening it, but simply demonstrating. “Once you put it on, some of your blood will flow into its lattice fabric and align itself to avoid a hemolytic reaction. Then, once calibrated, the patch will shift iron out of its fabric, pitch the ferrous nutrients so it traverses air and skin and into your body.” She passed the one she was using as demonstration to me as well.\n “It’s not on the market yet and I don’t have many. I don’t give them out to my patients. But, you look like you could use some. Besides, it’s not every day I have a patient rocketing into space.”\n I thanked her, pocketed the stickers fast like they were contraband and we were about to be busted. The door opened just then and the nurse plastered a benign smile on her face as she finished up my checkup. She let the bots work around her, picking up extra supplies, checking the inventory, as she indicated to me with a finger that my time here was up. As we left, she handed me some more contraband: a whole box of hemoglobin adhesives and a dozen reviving sticks.\n “In case you run into the ETs,” she said in a whisper. “No one wants to say they might be violent. But, who knows. You might need them to save yourself.” She gestured slapping one on herself. She turned around, spinning on her heels, and left, curt with no goodbye, as if our appointment never happened.\n They wanted me out there with the scientists, exploring space. I mentioned I was only one of the data analysts. Why me? Shouldn’t they choose a xenoanthropologist, someone who had spent years dedicated to the role?\n “We’re not just sending you, Dengwen. Of course we’ll have a xenoanthropologist on board, plus a linguist, plus an army of data crunching AI. Botanists, geologists, everything we’ve got. But, who knows what kind of tech they might have? What if their connection fries our AIs? We can’t rely on AI to data analyze, we’ll need a human touch. Someone who might see a blip out of some inexplicable instinct where an AI might rationalize it away.”\n My supervisor sent me a pack of rations and told me to practice getting used to them. My stomach might first object, so better to deal with the ramifications while still on Earth. I tore off one of the packets and chewed. It tasted like dirt mixed with honey.\n The nurse must have watching over me, rooting for me. She didn’t mention to anyone else about the miscarriage, which might have disqualified me for the trip. She had simply logged in the necessary checkups, which flashed across my supervisor’s eyes during our meeting. I still had her medical supplies stashed away for the trip, pushing away the idea of violence that she had suggested, and instead banking on hope.\n I looked out of the giant window of my supervisor’s 22nd floor; she had the whole floor to herself and her data-crunching machines. For a moment, together we marveled at the skies that now held so much promise.\n “If only FTL drives were invented,” I said. “Then we course through to the outskirts of the universe and seek out more lives. If there is one, other than us that is, there must be more.”\n “Just be lucky we have even enough power to get to Proxima Centauri. So much of our energy put into keeping the seas at bay and the skies barely breathable enough to live. We’re really hanging on a thread. Your discovery came just in time.”\n I said what I thought she wanted to hear:\n “We need to unwind a new thread. A thread that’ll guide us to another species. Or guide them back to us. We’ll . . . ” My voice of optimism croaked to a halt as I shifted my feet. A cramp subsided. They should diminish and eventually go away, the nurse had said. It felt sad, being wistful for pain. It was the remnant of what was, life that hadn’t come to be. If only I could conceive . . .\n We never uttered those words that ran around in gossip circles and circulated the digital filigree. The ones that the nurse had whispered so directly into my ear. The possibility that “hope” was a trap. That they were malevolent. That there was no winning. That they would conquer us.\n It didn’t matter, for those of us who did the calculations. What if they were malevolent? Either way we die. The Earth was perishing before our eyes, given the rate of our global bickering. We didn’t have quite the mutual coordination to seed a big enough space station for a future generation. Mismanagement and bare sustenance were draining us of all our resources, leaving other recourses dead ends. Despite the hollers of the everyday citizens, deafening calls in our ears to stop and stay away from the aliens, in our raised towers high above their shouts, we knew that we only had one way: forward. And hope.\n We turned our faces against the protests.\n I spent a decade on board, waiting to get there. What if we got the calculations wrong? What if we missed our mark?\n This would be the ultimate mission, one of daring pleas and of desperation. We had torn apart our space programs, poured all our funding into saving the Earth, but our beloved planet had been careening into a vicious cycle, irregularities that became more magnified. We were lucky there was even enough push to get this spaceship out there, just enough of coming together and pinching and saving to bring us the fuel and resources needed, though mostly it was weighed down by constant fighting.\n Hope was the drug that temporarily anesthetized humanity from the stark matter of its imminent unfortunate end. Scientists put their all into it; the diminished SETI team overclocked their bodies, their machinery, put their lives on hold, to get us off the ground. People scrounged, collected, connected to get their hands on remote equipment.\n And then—the takeoff. The most beautiful sight on Earth and the Heavens so they called it. Our tiny ship. Millions of eyes following us, whispering, praying. The oceans receding, the blackness engulfing us, until we were one with the infinite stars.\n And then the wait.\n While I sat on board growing hair, growing wrinkles, my nails getting longer and clipped, longer and clipped, humanity struggled again, relentless quarreling as they faced the collapse of its own empire as the seas threatened to engulf residences and land and the skies loomed with noxious gas. We thought of the fragments of catastrophe while trying to pass time calmly—hurricanes, vacillating temperatures, underwater cities. We were restless. It wasn’t just me, but the whole of the crew. It was going to be a long marriage; a sense of domesticity in the midst of the ever-present faint hum of anticipation, as well as constraining doom, that made all of us a little stir crazy.\n My womb went from bleeding to productive again to obsolescence. While we flirted, made love, maintained our distances, fought, cohabited and uncohabited, interacted with one another in various ways in ten years, enough drama of seven people to last a lifetime, all the while I kept trying to conceive, my reproductive system made its way to its decline, until menopause took away its main utility. It was an empty cabin, probably the only empty cabin in the spaceship.\n This isn’t the way everyone looks at their bodies. It was how I looked at it. I had longed for a child, but I feared that it was all futile. Even implantations didn’t work. Ovulation wasn’t something that I could just trigger. It wasn’t a pistol that I could direct and point and shoot. Even having her take root and quicken was miracle enough. But, she was lost. So, with all my entanglements, I had hoped, but couldn’t count on, for more. A heartbeat. A sperm latching on to my egg. It wasn’t really like we were supposed to have children on board. But, could you blame me for being a little bit careless? For “forgetting” my birth control injections? I knew we had food and air enough, even if it was tight, should a little being make its way here.\n I didn’t want to think about what my future generation might face. That they might see the demise of Earth. But, there was hope, and with hope there was a chance that my hypothetical child could make it and live on.\n We were hopeful about the aliens, tracking them down, and so close to our solar system. Hints of a technology that could provide for our future, but it was a cautioned hope, one that had adjuncts and attributes enough to render the hope barely anything but human vanity. How were we any better than any of the other species that have collapsed? When it was our doing that had nearly undone the Earth? The question became moral. Why should we get to live, thrive, and beget?\n Would the aliens ask themselves the same things?\n These were the philosophical inquiries that harangued our crew for the ten years of trekking, as we made our way towards the red dwarf, the diminutive fifth wheel attached to the Centauri couple.\n Proxima b had been ruled out for life, despite the early possibility of water, but the new Proxima c glinted like a jewel. It was from there that the anomalous activity was detected—signals that could not be explained away with a whisk of the hand.\n The meteorite came from left field. If there was a left field in space—it certainly felt like there was. It struck through the cabin quarters of our Captain, through his uniformed chest, through his soft tissues and coming out the other side, dragging blood behind it.\n Years ago, lying naked in the Captain’s cabin, I had hoped he could father my child. I even shared with him my dirty secret of shirking birth control in an emotional flood of bonding. I thought he would eject me into outer space right there and then, punishment for my deception and transgression, but no, strangely, he smiled. He said yes, let’s do it. But nothing came of it.\n The possibility extinguished.\n We are nothing but bags of blood, I was reminded, and the leak was too potent.\n At the time of the meteorite, I was with the Captain, but not in a carnal way. Those days had been long gone, when after so many attempts, nothing came to fruit and the constant stress, mostly from my end, made us drift apart. It was utilitarian for me; his anatomy wasn’t living up to his end of the bargain, so we parted physically, but were still collegial.\n It was in this setting of collegiality that we were having a meeting, going over datasets. I saw the tiny bead of doom puncture through, in and out, as swift as a needle through fabric. His body torn up and a blood trail followed. It took me a fraction of a second to realize what was happening and another fraction for sheer horror to dawn upon me, but the moment felt stretched out like an eternity.\n I ran, then floated toward the hole of the ship as our gravitation system failed in the midst of the accident. I was being sucked in. My chest heaved, panic started to push to the brink of my systems. Okay, okay, I thought, grabbing anything around me. I felt something round and hard. It turned out to be a helmet. I pushed it towards the hole.\n With an audible whooshing noise, the helmet’s smooth surface made contact with the perforation and it got vacuumed up. Pressure adhered it there. Not the best fix but it was better than my own head.\n I swam-floated through blood droplets abound. Someone had sealed the exit hole of the meteorite with an ETA suit. A matching outfit—helmet and shoulders buffered by the whole of the cabin. There was overall confusion, as we tried to avoid the bobbing spheres of scarlet liquid mess. Lifeforce drained away.\n He was dead.\n When gravity came back, I smacked the ground with my hip and cursed for a good minute before getting up. I had heard the collective thumps of everything falling, but the pain made my senses register nothing but my own visceral agony.\n Once the feeling passed, I looked around. Some of us were pretty banged up. The captain’s body had fallen to the ground and bounced, with all his blood jostling and pooling. Blood was everywhere, staining us, staining the ship, staining the mission. It took us a week to get all the blood soaked up and discarded. We kept finding bits clinging to equipment, to clothes, to the walls.\n We gave him a proper funeral and ejected him into the coldness of space. The ritual of commemorating his death made us feel lost at sea. Our navigator cast off and I watched him crystallize and disappear, reminding me of thoughts long ago I wanted to excise.\n There were six of us now, distributing the roles of the Captain. Some we allocated to the AI systems and some we tried to keep for ourselves, if anything but to honor his service. Most of it went to the now-acting-Captain, and still geologist, Anjali, who had training in interstellar navigation alongside her geological interests. They gave me his objectives of reviewing safety measures.\n Every day, I would go to a different part of the ship with the sensor and test for structural integrity. It was redundancy; one of the AI systems had the same role. But, nobody felt safe anymore. Besides, there were some uncertainties given the effects of the meteorites. Sometimes, in the midst of a scan of a corner or door, I still would find blood and wonder how it got there.\n The twin lights of Alpha Centauri blinked at us like cat eyes while the diminutive third to which we were heading always seemed to be orbiting around the two, trying to fit in. It looked like Mars, always cast with a faint orange tint, or like it was always a sun constantly setting. If there was more of an apropos metaphor for human decline, this would be it. The image of a constantly setting star, but just there, hanging in the sky.\n But, no, this was hope. And when we found Proxima c, we found this hope to be dimmer and less filled with water than we had expected, at least that was what our scans said. We drew in closer, sent missives to Earth, now four-plus lightyears away. By the time it got to them, my hair would be streaked with silver, like the Milky Way.\n The ship crash-landed. We did a quick save, salvaging most of it, but lost a good deal of food and water in a contained fire put out by its safety systems. The ship also needed major repairs and we dispatched the drones to assess and reconstruct. We were already coming into our mission jaded and in despair.\n I stepped out onto the regolith, my five comrades, ex-lovers, confidants, quarrelers, sufferers, and risk-takers with me. The land felt strangely hard, dense and unbalanced. The gravity was two-thirds of Earth, so we bounded in our suits, our scanners propped onto thin fishing poles—loose tethers that would straighten and shoot forth at any sign of life.\n We kept tripping over what looked like unevenly accumulated slates, with ragged ends. We had to be careful not to rip a hole into our suits. We searched this land, but it seemed barren of life; there was no water, but maybe these alien creatures didn’t need water? They seemed so present, so real in our imaginations, that when no communication passed through, I felt a sense of defeat so acute it almost left me paralyzed. Only Gloria, who was the longest of my flames on board in the ten years, who consoled me when I had cried over my barren womb, kept me honest and helped me to my feet when abject bleakness took away all will that evening.\n The next day, when the light of Proxima Centauri cast its strange diffuse shadows, we got up and walked this land again. The one thing that we could agree on: there was a low-level sound, a kind of white noise that seemed to follow us. It wasn’t on any of the sensors, but there it was, as we peeked under yet another slate of the slate-strewn land—that we found was neither rock nor metal.\n The AIs could not tell us what the sound was, nor even locate the presence of a sound or a source. Nor could they say what material the planet was made of. The core was liquid, that we knew, but what about all these slabs we were constantly negotiating with in our boots?\n We split into teams. I packed my things, throwing in a few of the hemoglobin adhesives, a hydrobar, and a scanner into the compartments of my utility belt. Gloria came with me. It only made sense, since she was the most chipper and brazen, and I was likely the most morose. I didn’t care. I didn’t need a badge of merit as “best attitude for an explorer.” I just needed support. Her xenoanthropology background made her a prime candidate for finding the supposed aliens, who were looking to be more remote as the hours went by. Why go through the trouble of sending out signals, if you weren’t going to take calls? If you weren’t going to check in? But, it had been years since they sent them out and maybe now the calls were silent.\n She sent out various kinds of “messages”—audio, motion, smell, pheromonic, etc.—unleashed a concoction of labels that would say, “I’m here, please come out!” I helped her seal and stabilize these messages. She sent these out on drones, who would be able to cover more ground than our bounding steps alone.\n As we traversed, we came up to a mountain. It wasn’t made of slabs, unlike all the spaces that haphazardly made up this alien landscape. It was a veritable mountain of diverse objects of the same material of all different sizes. It loomed over us, breathtaking in its majesty, like approaching pyramids in the midst of desert sand. This definitely had to be the hand of intelligence right there.\n There was very little natural light in this area, almost none. We had to blast out our LEDs from our helmets so we could see, stark white light that made everything look eerie. The air felt strangely dense, though there were no readings in our scans that would suggest why. We wondered if it was this air, like an invisible cloud, that occluded Proxima Centauri’s rouge luminosity.\n With the projected light from our helmets, we took many scans, photos, and videos. We documented the different formations, discrete pieces that had flat planes and roundness to their attributes. There was a kind of Gaudí characteristic to the overall look of the mountain, not sharp, pointed and triangular like the Rockies, Everest, or any mountain on Earth, but a kind of rounded curvature to the overall heft of it. It was not a smooth landscape; it was an assemblage. I could tell that it was heaped on. That there must have been some machinery or guiding hand that had collected this and stacked it here. Was it a garbage dump? Ruins? A monument? Was it some kind of sign that we had to decipher?\n I was way over my head. I could not process this kind of data. It wasn’t radio waves or light. Whatever triggered that radio signal anomaly years ago must have scattered away, departed into the abyss somewhere out there, or have retreated somewhere undetected. What was left was material we could not determine, amassed in a means we could not understand the nature of. We could use an archeologist, xeno or not. We could probably use the consulting powers of all our Terran people. But, there was only the two of us, and our messages could not pass through the thick blockage of this atmosphere enough to get to the others before night.\n We poked around, trying to disturb as little as possible. I felt like a grave robber. Was I destroying the sanctity of this site by stepping in it? Luckily, given the gravity, our footsteps were relatively light and our boots left few tracks on this strange, shiny gray material.\n Two hours later and we had covered the whole of this mountain and documented almost all the parts. We couldn’t avoid disturbing some of the material, but agitated as little as we could. If anything, the air felt even thicker, it took some muscling to simply walk, even though the amount of gravity was on our side.\n I followed Gloria, who was giving out upbeat looks. Her buoyant stride and can-do attitude were starting to wear on me. After descending down the mountain, I got sick of stalking around in heaviness.\n I couldn’t take it anymore. A fit of total inanity and childishness overcame me. But, it was more than that. I thought I saw the tiniest hand, a little closed fist as an imprint on one of the rocks. Something I had seen in ultrasound photos.\n I knew I must have imagined it, because in a moment the image was gone. I stared at the rock, pushed my hand against it, despite our objective of not disturbing anything. But, nothing. It was like it was never there. Like my fetus never existed.\n I couldn’t bear it. My frustration skyrocketed. I kicked the slab hard where my phantom impression had projected. My leg got caught. A sharp edge hooked onto my suit and tore the fabric at my knee.\n I still don’t know why I did it. It’s not easy to explain. A presence bore down on me, teased me with an image, filled me with a wave of complete hopelessness, and I just needed to act out.\n Oxygen rushed out of my suit and I cursed loud. Gloria calmed me down through the comm from her end and hurried over. I was bleeding.\n I was such an idiot.\n I threw on two hemoglobin adhesives over the rip. They gave off a green light once activated, drinking a sample from my blood, drawing it through my vessels and skin, and calibrating. I calmed down, knowing it was feeding nutrients back into me. I stared at the green patch of light reflecting onto the strange material, a ray that bounced out onto the corner of an alien slab. Out of my peripheral vision, I saw Gloria follow my gaze. I held my stare; something was keeping me from moving my eyes.\n There. That was what it was. The green light, it was dissipating, stretching out, moving of its accord. For a moment, I thought it made the nebulous shape of that fetal fist again, but it soon shifted and perhaps it was only my imagination.\n Then everything started quaking.\n A gush rose from the mountain. I gasped.\n Oh no, this wasn’t a mountain. It was a volcano.\n We clambered far away. A pool of red, so crimson and bloodlike, spilled out of this landmass and chased after us. It wasn’t just after us, it was pooling in all directions, but it seemed like we were one of the targets of its lava tendrils.\n But, it wasn’t sizzling the land at all. It wasn’t destroying everything in its wake. The Gaudí pieces seemed to separate themselves, as if coming alive. They slip-slid against each other, coating in the liquid. They were being lubricated, oiled. They were moving.\n In my head, things were starting to piece together. Maybe it was from the frustration of the kick and the panic that overcame me. But, as we bounded away, Gloria and I, hoping that the oils wouldn’t reach our ship, I had a flash of insight.\n The rush of blood, the lifeforce oozing away, this was it: the blood, the lifeforce. The hand, my kin. The expulsion of the entity from my womb, half-grown not quite yet a baby. Blood clots, stuck, something that fastened and wouldn’t let go. Not yet.\n It was about reproduction, or about production, at least. I could tell. Call it a moment of eureka, a maternal instinct, a pulse of realization—though I was no mother, only yearning, desperate to be one.\n We hid out in our ship. All of us came back alive, except one. There were five of us gathered now. Kiki was out there, we hoped, and we sent probes and sent out two of our team, but even after exhaustive searches we could not find her. The red blood, the lubricant, continued to spill forth. It took some adjusting but the AI systems got the scanners to detect and monitor this planetary broth from afar. And we watched as it continued to paw through the land, with its liquid lick.\n I had dreams, of seeing blood, of tubes pulling out the body of my not-yet child. Of loss. I saw production, or the capacity for life. A tiny fist, strength in will.\n Then the volcano, and the spilling of red, all over. Red gush from the Captain. The rolling hill of his head to his chest to waist. Red gush from Gaudí assemblage. The rolling hill of its slapped together parts. My eyes burned in rouge. I was swimming past the scarlet globules, raging in front of the spill, hoping its crimson touch would not get me.\n And then I would awake, thinking of gears and machinery. Of waterways and circuitry. The machinery, it was coming alive, the light of our tech, activated by our blood—searing past the sealed-off density of the strange air and giving it propulsion.\n The sleeping giant awakes.\n Some of the red rivers, the gush of red current, had receded and we took the chance to step into those receded “banks” and push forth to see the Gaudí assemblage mountain again. Where did the red go to? We thought it was lubricating, absorbed into whatever this planet was made of. That was the most likely scenario crunched by the AIs.\n We still hadn’t found Kiki.\n The assemblage was double its size, the mountain not just looming, but threatening, like a god that had risen up from the land itself. How did it get to be this big?\n Was it like a plant that thirsted for water and once fed, burst to life, erect, upright, pulled back to life?\n There was nothing that indicated it was organic, but perhaps organic was always a Terran term that could not be transplanted here.\n When we looked closer, three of us this time, acting-Captain Anjali from the back, Gloria and I pressing forward, we could see that it was replicating. Layer by layer, as if being 3-D printed. We watched as the landforms pulled up from our feet, raising us, a centimeter at a time, jarring our balance.\n Caution prevailed over our curiosity and we returned back before we would be pushed so high we couldn’t climb back down. It didn’t seem probable, but we couldn’t yet calculate the rate of its growth. I avoided all the blood splatters, the oozing of the red, remembering the lubricant that had escaped my womb. The hand that never got to be.\n “It’s so high, it’s past sky-high. I don’t know what to call it. It must be rising up like a skyscraper,” I said. Back on our ship, we were a distance away, but I wouldn’t say safe. Not exactly.\n “It’s not just happening there, the land is being pushed up, new slabs are forming,” said Anjali, as she consulted her geological literature. “There’s nothing like this I’ve seen. It’s not exactly tectonic plates, it’s not just rock formation. This is too fast, too regulated, too . . . everything.”\n “Too freakin’ weird,” said Gloria.\n The rest of our team convened. Kiki had been found, wedged between two slabs, the material growing out of her knee. The biologist and medic, Ramon, tried treating her best he could, keeping her in an isolated space. But Kiki was light-headed and we didn’t know if she would live. She was oozing red, part blood, part the liquid of this land, and I couldn’t bear seeing more blood here. I took a look at her once from outside the chamber and vowed not to go in. Medic Ramon kept a drone ferrying this liquid out of our domain, in case it would gush forth and cause the material in her to multiply. We couldn’t contaminate our ship-turned-habitat. It was only our space of safety and our way out of here.\n I hated to admit it, but a dark part of me wished they hadn’t brought her back.\n They knew I had hemo stickies, and reluctantly, I gave some over for Kiki’s convalescence. I only divvied out two. I didn’t trust its interaction with anything with this land, but I knew there was also something else. Deep inside me I had an instinct.\n I also forked over two reviving sticks. I made a big show of having none left after that.\n I regretted kicking the slab, regretted getting cut, regretted slapping on the medical adhesive. It was that light that had been stretched out in strange ways. How could I have known?\n And yet, there was some growing comprehension in me. That I was supposed to kick it. That I was supposed to dream up that tiny fist. That it was supposed to bleed out. And as two more days passed, while the crew and I worked on repairs with the few replacements and makeshift resourceful cobbling together we exacted, the comprehension gnawed at me. It ballooned as I sealed the doors with repurposed silicone drinking packages and reinforced the walls with climate-conditioning spray. It stuck to my throat, like the lemony scent of the spritzer.\n It crept onto me, begging me, a pulsing sense of motherhood deep in my loins, until I went to see Kiki the day before we were set to leave. This was the reckoning, the final day I could do something about the compelling notion I felt so acutely from within.\n I was going to do something about it.\n Her body was still, obviously unconscious, the slab in her knee growing, even as Ramon continued to cut and discard the material to the outdoors via drone ferry. It was like keratin, like our fingernails and toes; she had the armor of this land coming out of her joint. She had it excised periodically, but it would come again.\n I brought to her the lighted stickies and removed the safety wrap. I was fully covered in a hazmat suit, no way I would be contaminated, but fear still pricked me. I knew something would happen, but I wasn’t sure what.\n Caution enveloped me, but a greater impulse brought my hand forth to cover her leg with the stickies. Five of them. One after another, with swift movements, before I could stop myself.\n The light bent around her knee in strange ways. It was irregular. Blood came pouring out—or was it the dark crimson of this land? I yelped, called for a drone, but there was so much of the liquid, coming out and cascading.\n The drone wasn’t big enough.\n I called out for another and tried to gather the blood. We couldn’t let it get everywhere. Who knew what it would it do to our beloved ship and shelter?\n I pulled Kiki into the drone, packing her limbs into the small vehicle as best I could, and then stuffed all the stained medical slurpcloths that had absorbed the blood into any available crevice in the mobile. I dumped a whole box of slurpcloths out and let it pull out the strange viscous fluid from her knee. I injected her with all my remaining reviving sticks that I had been saving for an emergency.\n They didn’t seem to do a thing. I improvised, going for the emerg pack. I set a small field around her—one we didn’t use often since it was such a power drain—so she would be protected from the land. There was just enough juice to last for a few hours.\n We rode while I directed the drones to the mountain. It took an hour on the highest speed, and I wondered what everyone else back at the spaceship was doing. Probably sleeping. Maybe Gloria was awake. She was always a night owl.\n It was dark, the rays from the helmet and the green eerie hue of the adhesives lighting the way. The adhesive light bent strangely when it interacted with the land, the green glimmer tossed around, zipping forth from slab to slab on the ground.\n Perhaps it was the interaction of organic and the growth of this land, whatever it was, one of the scanners started to pick up something, an anomaly, a kind of radio signal that I had remembered from so long ago. The blip that gave me reason to think there was life on this land. The signal that brought us here.\n When we came to the mountain, it reached so far out into the heavens, I could not see its apex. All the land had risen up. It was foolish of me to come here alone. I should’ve brought a team of drones, backup in case I slipped. I could feel the land still jittering under me, elevating on its own accord.\n The light of the hemoglobin adhesive danced about, stretched out like taffy then rebounded, jumping from discrete item to item in this alien assembly.\n Blood. I offer you blood, I thought. Blood and technology.\n The green light interacted with the mountain in an excited frenzy. It swung about, dancing on every piece of the assembly, in a synchronous intertwining waltz.\n I gaped, mouth hung open, breathing in the dry air of my suit.\n Kiki stirred. I reached my glove through the field, pulled off the drenched slurpcloths and then the pieces of the invading slab off her knee, which fell to brittle outside the field. The brittle recollected itself and a jet of the red ooze spurt forth and lubricated it before it was incorporated into the land.\n I pulled out a half dozen green stickies from my utility belt, peeled off the safety and activated them with Kiki’s used slurpcloths and threw them up in the air. They lifted up and were “grabbed” by the mountain detritus. I pulled out ones that I had used days ago from the rock tear still stuffed in another compartment in my belt, their tech infused with my blood, traces of the concoction of manufactured hemoglobin and my DNA left behind, and threw them over as well. I didn’t dare stay to see what happened.\n I commanded the drones to race away. We fled, moving swiftly over the strange terrain on our vehicles. A rumble shook the land and with a quivering voice, I commanded the drones to go faster.\n When I got back to the spaceship, Proxima Centauri was already peeking out its shy gaze. It was morning. The strange orange haze once again lit up the onyx surface of our ship. The rumbles had stopped.\n We were expected to leave today. We had received word that Earth might make it after all, that treaties were signed—must have been signed four plus years ago—that the worrywarts spreading hate of potential ET colonizers prevailed and part of the multilateral pact was for our crew to avoid alerting any aliens of our existence, a reversal of decisions past. It was just like politics, to swing one way and then back. We had the choice to stay here or go back if we wished, but if we stayed we were ordered to avoid foreign contact and would have to retreat to Proxima b, where there was no sign of life. In light of this, the crew had voted majority on leaving, to get off this eerie, unaccommodating, intelligent-less bust of a place and the dangers it spelled and make our return home. We didn’t have enough food or water to stay here much longer anyway. We left a few drones to keep watch.\n We took off with samples rendered inert by the moat of air that surrounded it, all contained in specimen vessels.\n From the spaceship window, I watched as we took off, all of us holding our breaths, hoping this spaceship would survive the launch. We were so much higher in elevation than we were weeks ago when we arrived. The planet becoming much bigger than it once was. It was still shifting. We could see it replicating, or doing whatever it was doing, layer by layer, adding onto itself.\n The spaceship shook as it blasted off, waking Kiki with its violent tremors.\n “It’s more than a geological anomaly,” she said, rubbing her knee. “It’s something far stranger.”\n It was only decades later, when we had returned to Earth—when the material sample had been probed, tested, placed into the highest levels of security on an orbiting space station—that we discovered what it was.\n I already knew long ago, but I kept it to myself.\n In our absence, humanity had realized that given an objective, it could collectivize and aim towards the goal. They had done it sending us into space. And they would do it again to at least try fixing our Earth and bringing a lab into orbit.\n They completed both those tasks, scrounging and cobbling best they could.\n We came back to a more hopeful Earth, even if the news we brought back was less than hopeful. No intelligent beings to bring us better tech. No trading for our salvation. But, at least our people had tried our best, we would hope to prevail, come what may.\n Only the strange material from Proxima c land and its fluids suggested otherwise.\n The tests concluded it was machinery left behind, oiled by the liquid of the land. It did implicate a higher intelligent being, but one that had fled long ago.\n Blood, I whispered to myself.\n The machinery that had covered Proxima c was rendered inert by the thickness of the atmosphere, a chemical stop button poured onto the massive engine. But, given blood, or rather, some tech version of it, hemoglobin infusion, activated through mingling with traces of human blood that calibrated the transfusion, it came on, powered up, and its interactions intensified and magnified, begetting and begetting.\n It was a self-replicating machine. Perhaps it had some purpose in the past, one that sent out those anomalous signals—to create some material resource that was useful. But, now, it seemed to run on its own accord.\n It stank of the fatalism of the paperclip maximizing AIs, of tech run amok, of instructions given and then abandoned—sealed off with the dense additives to the atmosphere as a stop-measure.\n I never really told anyone that it was my maternal impulse that turned it back on. That I had activated the hemoglobin stickies with blood from Kiki and I. Giving it lifeforce, or something to that end. All the scientific data converged, with experts agreeing it was the disturbance that had turned it back on. They surmised it was the pheromonic stink of our flesh and blood—and some thought it was simply a product of time. But, I knew and perhaps deep inside Gloria and Kiki knew, too.\n It was the hemoglobin tech, induced into activation by synchronization with our blood, the interaction I propelled that jarred the machinery awake.\n The machinery was an existential threat to our universe. One distant and not entirely pressing. But, once reactivated, the engine of production showed no signs of stopping. It was self-perpetuating, replicating, and would only get bigger and bigger. Its internal oils, that thick red, seemed also to reproduce itself. A command that had gone haywire, perhaps, with a quick-fix plug, a cursory halt, and an escape by the civilization that had left it behind.\n And I had pulled out that plug, let the spigot run.\n Blood, nourishing blood.\n It would take millions of years before the machinery-exoplanet grew big enough to do harm to us, but who knew what harm it would do to the fabric of space-time? Who knew the repercussions to the neighbors we had at Alpha Centauri? If it would wipe out those persistent cat eyes? If it would obliterate its associates? Perhaps it was the aberrant fifth wheel finally rampaging in its romantic neglect.\n Earth coalitions were already mobilizing a team to go stop it. To figure out a way to reproduce the atmospheric chemical that might shut it off and contain it.\n But, I? Well, I smile sometimes in my sleep.\n I know, it’s terrible, I unleashed a monster into this world. A mechanical monster, all tech and no reason. One that grows and grows and gobbles everything in its path. A sleeping giant awakened, and burgeoning, budding, layering up in its mass.\n But, still, I smile.\n In my womb, I feel the pulse of life. It resonates with the emptiness of space, the cavernous peal that beats in my flesh. It’s not one of my own DNA, but one that lives because of it. Mechanical, menacing, inorganic, and possibly a death sentence to us all.\n But, it was my hand that had brought it to life. It was the chemical reaction of my sanguine fluid, my hemoglobin stickies, my touch, and my action—my beautiful, horrendous, abominable baby.\n With a pounding fist of fury.\n Bound to me by blood and growing up so fast.\n D.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation."}