{"fingerprint": "/v49rVWsctEzAaIi0EdcIjQbfik=", "sitename": "Clarkesworld Magazine", "title": "Onyx Woods and the Grains of Deception by D.A. Xiaolin Spires", "author": "D A Xiaolin Spires", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/spires_08_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Onyx Woods and the Grains of Deception by D.A. Xiaolin Spires", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5450 words, short story\n Onyx Woods and the Grains of Deception\n “The king certainly likes fire,” said Cohl. We could see the smoke rise from beyond, from another forest. I pulled off my gloves and rubbed my back. Once we relaxed like this, I could feel all my muscles ache.\n Cohl took a bite of the lump in his hand and spit it out. “What is this anyway? Tastes like scalp.”\n I squeezed the brittle chunk in my hands. Crumbs scattered onto the ground. The inner pale core showed through the broken crust. I swiped at the dry specks. “Bread, they call it.”\n “Ugh, how is this edible?” He scratched his chin absently. “I remember grandma used to make gra soup. With yams and bacon. I’d give a whole month of these rations to have a bowl of that.”\n I pulled out my flask and poured tea all over the chunk of this substance, bread. It hardly felt like food. Hard like a board. Once the water seeped in, it transformed. The bread soaked up the brown liquid and became soft like a sponge.\n I took a bite and handed it over to Cohl. “It’s not so bad if you dunk it in some liquid. Tastes almost like pounded shelo.”\n He gave it a good pinching, squeezing out some drops that landed like stains on the dirt. He popped it in his mouth, shook his head and forced himself to swallow. “Now it tastes like wet scalp. Thanks, Staira.”\n “Wet scalp? Do you know what that’s even like?” I asked. “You haven’t had a decent shower in ages.”\n Cohl laughed, a large sound that echoed through the forest. “Sweat,” he said, patting down his hair. “I don’t need a shower. I have natural solvents.”\n I rolled my eyes but passed him the flask. He took a swig and wiped his mouth. Tea slid around the stubbles of his chin and neck, like an earthworm tunneling around roots. I smiled, despite myself. “Alright, let’s get going. The forests won’t clear themselves.”\n We picked up our sitting bladders, deflated them, and put them in our sacks. I pulled on my gloves.\n The king, under the advice of contempoists, converted forest into farmland. The contempoists, who showed him their silken parchments, strewn with graphs, proceeded on lengthy lexicon-riddled lectures about advancement. Told him that production was the way to do it. At least those were the rumors that flowed through in the informal transactions of the market. Whispers while wrapping fish, winks while bartering shoes. The sellers regaled in the many ways the contempoists stood, tall and proud in their black coats, as if they never had to do a day of labor in their lives. They would mimic their voices, soft and lush, never having to shout aloud, out and over, to the other side of the field or forest, like the others who labored in the sun. “The grains,” the contempoists insisted, parodied through the lips of various buyers and vendors. “The grains, they hold all the calories you need.” The bustle of the market, the swinging of sacks. The transactions would go on, but that bustle was the only place that the king couldn’t drag you away for infractions. The market was too unruly to lay a hand on, boisterous enough for intimate seditious conversations.\n Everyone also knew at this rate of conversion there would be no forest left. Already half the land was covered in waves of grain, rustling and glinting in sunlight. Grain as sandy-hued as the strange hair of the contempoists.\n The only reason I took this job was because I was sick of harvesting grain. At least that was what I told others. Day in and day out with the sickle, the lemf-woven bandana doing nothing to keep the sweat from rolling into my eyes. It would just get soaked, though an occasional breeze offered some reprieve, even as the sun beat down. When the opportunity came to switch to clearing the onyx forest I took it. Most people accepted that as explanation enough.\n Cohl and I took turns hacking at the trees. He heaved and stuck his axe into the trunk with the bark flying. I would come in from the other side doing the same. It was called congruent lumbering, and it was the most efficient way to fell the onyx trees, given all experimentation. We were careful not to swing too hard and take each other out right through the trunks. The trucks were tough things, flat, black, and lustrous. But, get past their runny sap and into their crystallized core and they would simply shatter.\n I’ve heard that there’s no other place quite like Phinelia. No place that has our various majestic forests, and this particular one, one of the few onyx woodlands, the upright walls of trees that shoot out into the distance. Like black parchment stretched out and pinned to the ground, one after another, stalwart facades. Look up and they appear as if they’re brushing up to the heavens themselves. It looked like they were placed there by a knowing hand, and some joked that’s why they’re also called the Magnificent Shelves, as if some curator were looking down on us, from above their massive heights. I would roam through the aisles of these wooden walls as a child, run through the nets of soft wispy tendrils of translucent green, the larklets that hugged the black smooth surface in a symbiotic embrace. The sinkwarbs, tweedoots, and other animals calling out in alarm, bounding and hiding in the folds of other wispy vines and shoots.\n But, now I heaved, grunted, and swung. Each foot of the wall required one hundred strikes of this specialized axe, no more and no less. At about seventy, beads of a scarlet ooze would appear, sap that collected on my blade. At seventy-five, the sap would start to flow out in droves and make its slow descent to the ground, running alongside the onyx-colored bark, creating a bath of crimson in the dirt in the aisles. At about eighty, we would reach the first hint of crystals. Flashes of a vivid blue. And at a hundred, the thing would snap. It would tear at the seam and the whole tree would begin to lean but would not really fall. Because the tree wall would go on into the distance, it was like taking a blade and slicing only a fraction of a parchment paper. It would not completely rip. So, this part of the forest tree wall that was cleaved would just lean up against the next tree wall over, and the semi-chopped tree wall would bend ever so slightly at the top, eclipsing the sun in the forest aisle. A giant curbed wooden tent.\n Cohl and I worked until sunset. Just as the shadows elongated and the sky’s pink darkened, we left. We didn’t get to the end of this tree today. We got about forty feet in, which means we each did two thousand strokes of the axeinto this tree wall. If we calculated right, at this rate, it would take a month to clear just this one tree. Then we would move to the next tree wall, hacking at it.\n The job before this, it was Lacy and I who teamed up. It was kind of nice working with another female lumberjack. We had a lot to commiserate with. But, for this job, they set me up with Cohl. Lacy was partnered with Chakla and set into the hill forests. Lacy was the lucky one. The hill forests have tenacious barks, but with the right curved blade, the wood tears quick. The insides are hollow. The creatures, the snailpops and cluechirps that lived in the forest, have been seen running off, escaping for their lives, ever since they started felling the trees.\n Here, among these onyx walls, except for the larklet webbing, there wasn’t much surrounding these black slabs. Not ever since the vast poaching.\n The next day we were breaking in the afternoon sun. We had both done fifteen hundred strokes and were at the tail end of our capacities. My arm throbbed like a swarm of cluechirps had pecked at it. I put down my axe and massaged my shoulders.\n “What do you suppose they do with all this lumber?” I said, gesturing at the semi-fallen slab above me.\n “I suppose they’ll be an army of men and transport it to the sea. There I imagine there’s some ship that takes it away.” Cohl took off his shoes and rubbed his feet. A stench wafted in the air and dissipated with a sudden breeze.\n “But, you’ve never seen it done,” I said, pulling off my own shoes.\n “No, I haven’t.” Cohl started to fan his feet with a folded parchment fan he kept in his back pocket. Then, he fanned his ruddy face.\n “Can you imagine? There’s a land out there that probably takes all of this wood and turns it into furniture. That’s what I’ve heard at the market. Living rooms full of Phinelian onyx wall wood couches. Dressers with this glow, the inside filled with woodcore crystals.”\n Cohl spat into the ground. “Excessive, wasteful,” he said. “Anyway, everyone knows that once the wood’s out of the ground, this stuff decays fast. Wouldn’t even make it through the journey across the seas. They’d bleed and bleed. It’d be nothing but bark rot.”\n “I’ve heard they use staying powders, fix the decay rate so it’s so minimal, so it’s almost nonexistent.” I looked up into the skies, thinking of my connection to these onyx woods. How small I was in the midst of their imposing barriers.\n “Fairy tales,” said Cohl. He waved a fan in my face and gave me a quizzical look. “I’ve been trying to figure out something about you.”\n “Oh yeah?” I looked down at the roots that lifted the tree out of the ground. They were gnarled, tangled, much like my thoughts.\n “They never assign women to the onyx forests. They say that the wood is too thick, the axe handle too rough. That around these parts and because of the way the black surface collects the sun, it’s too hot for a woman. So, how did you end up here?”\n “Too hot?” I laughed. I wiped sweat from my face.\n “Well, really, why did you insist on coming here? There hasn’t been an onyx female lumberjack ever as far as I know. So there must be a reason.”\n “Money,” I said, lying. “It’s for the money.”\n He nodded, as we both knew that this kind of labor meant an extra sackful of coins at the end of the job, but he gave me a good look in my eyes before he started lacing up his boots. Time for the next round of hacks.\n At one hundred, my axe should have eaten through all the wood, the sap, the crystals, and into the pocket of air that would confirm that the tear was complete. But, it didn’t. There was still a thin layer of woodcore crystal left.\n “That’s strange,” I thought. Cohl stopped working too, from the other side of the tree wall. He must have heard the difference in the vibration of the axe emanating from the tree.\n “I’m trying again,” I yelled. I heard his muted “sure” from across the wall of the tree.\n We swung in alternations and it finally fell at one-oh-six.\n “Six extra hacks,” I whispered. The crimson sap pooled onto the ground. Typically I would step over it and move on, but this time I drew closer, sunk my feet into the sap. It enveloped around my shoes, like blood flow.\n I could hear Cohl running around the fallen part of the tree wall, jogging from his adjacent forest aisle to my own.\n Of course, this discrepancy of six cleaves was something to note. And I knew I should’ve been conferring with Cohl before I did anything, but something instinctive took over me then. I peeled off my glove on my right hand, put my fingers into that sticky sap and felt into the jagged crystals of the tree, running my hands along their tapered tops. With the sap covering my fingers, the crystals felt cool to the touch, reminding me of ocean waves, but pointier. For a moment, I smelled something sickly sweet. It was the aroma of my mom’s snailpop-derived perfume.\n A memory flooded me then, as I wafted in that musty sweet aroma. I had left my parents and lived on the fringes of Phinelia. My parents wanted to do business with the contempoists and I wanted nothing to do with it. They approached them on the side of the road, dressed in their nicest clothes, so they told me. Their business venture was given proper consideration, Dad said.\n But, I heard the rumors. They were treated as nothing less than beggars. Laughed at in front of their eyes, the glowing white teeth of the contempoists gleamed in their faces. My parents’ idea of raising the giant forest fowl for eggs and for the eventual harvest of their bladders didn’t really jibe with the contempoists’ notion of high tastes in decoration and ornamental furniture. They rejected my parents, rejected their offer for the idea conception, with a hand wave. But, a few days later, the onyx woods were cleared of the great sapphire birds that used to perch sideways on its slick surface. The vast poaching, all taken up in a swift night. We still didn’t know how they did it. The woods became strangely quiet in one expedient night, so the rumors said.\n It was true, the woods really were strangely quiet. But, I had gotten used to that stillness.\n And it was when I was in Lakla, scavenging mushrooms from the spire forests there, when I heard about my parents’ deaths. A great tree had fallen on them. One of the onyx beauties. It must have been deliberate. The tree wall falls too slowly and usually rests on the adjacent tree, forming a tent. Even the most enfeebled Phinelians would be able to escape. They said this tree cracked at a strange angle and a part of it collapsed. Perhaps it was a way to bury my parents’ plan. Bury their idea so the contempoists wouldn’t have to pay the innovators’ cut. Even the king dared not repeal the laws of “idea conception,” a tenet of protecting intellectual creation held sacred to our people.\n My free hand, the left, reflexively went to my back pocket where the deflated bladder chair lay. It was one of the prototypes my dad had designed. I heard Cohl puffing as he approached. His own inflatable bladder chair was also bereft of air, flapping against his leg. It was one of the mass-produced ones from beyond the seas. I could tell from the sloppy stitching. My father got only a trifling of a cut for those, for using his designs, barely enough to even call payment. It was a nominal restitution, really, just so the contempoists could not be charged with violating the tenet of “idea conception.”\n I pulled out my customized bladder sack. The feeling of the crystal and its hard sharpness juxtaposed against the softness of the sack, as I continued running my right hand along the crystals.\n “What are you doing?” he gasped, seeing my hand, ungloved, thrust in the tree. “If the king catches all that sap material on you, you’ll be in trouble for contaminating the wood.”\n I shook my head, as my hand grasped one of the sharpest crystals. It seemed to warm up once I had my fingers around it. The sap dripped past my arm, to my elbow. I yanked it out.\n “No, Staira!”\n “Too late,” I said, holding out the crystal, its jagged cut proof of my desecration.\n My mom used to say there was something eerie about the forest. Something that just didn’t seem right. She would mention it to me when I came home from class, and back then we were still living in the sod houses. She said she heard whispers from the onyx forests that she’d never heard before from any of the other forests, not from the spire groves nor the stickwoods. And she said over and over that the onyx woods stood too still, even before the vast poaching. No rustling, no leaves, not like any of the other forests. Only animal calls that echoed along its walls.\n I always thought she spent too much time there. She and my dad liked to catalog the animals and vines and do some small-scale hunting. They would push aside the larklets and capture the wildlife. They’d experiment on the hides and fibers, selling knickknacks and scraping by. That was before the current king, who rubbed elbows with these outsider contempoists. Our village always had an unsaid rule: we could harvest from the forests, but never harvest the onyx trees themselves. They were too hallowed, too towering. Physically, they were impossible to cut. But, the king received these axes of a strange bronze for lumbering and sickles made of a white metal for grain-harvesting from the contempoists, in trade for the precious wood. He also got sackfuls of coarse nubby grain seeds. Now a small dedicated troop of us took to the lumbering and swiddening, with some of us transferring into the job, like me, while others labored in farming grains. It wasn’t only the onyx wood here in this forest that was being felled, but also in Clastaw, Walju, Pabley, and other onyx forests. They were all coming down, these great rows of monumental tree walls. And in their stead, rows of grains would emerge, a new food system materializing from the ashes of our burned woods.\n The king had explicit laws about making direct contact with any of the wooden stuff. With gloves on, we could brush up against anything, but we were told never to remove the gloves.\n Now in my naked but sappy fingers, the crystal pulsed and pulsed, a blue light projecting from its core. I threw it to the ground and the pulse diminished.\n I released a held breath.\n “One-oh-six,” I said. “A weak point. An anomaly.” I bent over and picked up the crystal again. It glowed brighter.\n “Ghosts,” whispered Cohl. He pointed at the aisle ahead of us.\n Blue wispy mist formed from thin air and coalesced, dancing between the tree walls. I heard whispers. I could understand words here and there. “The ancient forests.” A lot of mutterings. “Protection. Protect us.”\n The crystal pulsed as the ghosts fluttered around. My heart beat faster.\n There were stories that those who passed away in the forests would be absorbed by their hosts. The trees held the souls of the dead, as only the most superstitious would say. But, now, the superstition took hold in my chest as my heart thumped.\n From within the dynamic flows of the blue mist, from the nebulous figures and limbs that shaped in and out, I thought I saw my mother’s knowing glance and my dad’s esteemed chin. My mom’s beautiful hand and my dad’s slightly lame left leg. It was an impression of them, intertwined in the haze and I could not make it all out entirely. But, a pressing feeling came down on me.\n We would have to save the trees.\n I knew what I was doing when I took the job.\n I didn’t necessarily agree with the felling of the trees, but I was sick of life tending to grain and thought, well, if anyone was going to cut them down, might as well be me. Might as well revel in their proximity, even as the trees came drooping down as I worked. I chopped, regardless of my feelings about it. Rhythmic and willingly. Made timber, a dead thing, out of them. I knew I was complicit, complicit in tearing down something that bears our heritage, but even I thought it might be for the greater good. If it meant we would always be full, even if on scalp-flavored bread, then so be it.\n But, if the crystals held secrets of a past and identity we could not have imagined, wafted to us in blue mists, then this changed everything.\n I begged secrecy from Cohl and promised him a third of my pay. He refused my pay but swore he would keep his mouth shut for a few days, but would have to say something soon. All transgressions at worksites had to be reported, or families would be in jeopardy.\n I had no family to speak of, so there was nobody to threaten me with. But, Cohl had a husband and two kids. I think he was too dumbstruck to know what to say, or what to do. He saw the mists with his own eyes, just as I did—and he had that senseless look on his face as if the air itself had been sucked away. He looked at me, blinked, and nodded. Kept nodding, as if that was the only thing that made sense. Perhaps it was good to know that his head was still on his neck and he could bend it up and down.\n I dumped out the bread crumbs from the bladder sack that contained my store of food. As soon as I slipped the crystal in, the pulsing glow began to diminish. I could still see the glow through the fairly opaque skin of the bladder and watched it peter down to a dim stroke of light, before dying down altogether.\n I went back to the village and made my way through the now-quiet market. I knew if anyone would have any hint of what this was and what it meant, it would be the apothecary. They’d known me from since when I was a kid, when my mom would take me there to seek relief for colds and minor scrapes and wounds. I knew they harbored resentment towards the king but also provided his hand with various potions and powders. With their knowledge of substances and their association in the courts, they would be the only ones with the knowledge I needed.\n Polina gave me a good stare when I came in. She was wearing her apron, the same apron she must have had for a good twenty years now, with paisley designs stitched into the borders. The aroma of rara petals, so typical of this space, filled my nostrils. She greeted me with a provision of some herbal infusion and I goaded her gently into a conversation about the timber as I sipped, inhaling the floral steam. She charged on with the topic, obviously one of her liking, her cheeks alight with an animated glow. She yapped on about the rate of timber collection, experimentation with gossamer threads made of larklet fibers and the aphrodisiac effects of onyx wood sap, though its acquisition was illegal.\n “The black coats,” said Polina, hissing with the s in coats, referring to the contempoists, “They are distilling something from the wood, I’m sure. The wood is then turned to chips.” She urged me to put on my gloves. By then I had washed my hands by the well, with little trace of the trees left, at least not detectable without proper testing.\n She looked into her various jars and tapped on each, pulling one out of the shelves. She gave me a sprinkle of some dark powder. I held the powder in my own gloves. It was black as ash.\n “Sediment from the wood chips,” she said. She smiled, as if proud of her contraband.\n “Wood chips? I thought they were using the wood for furniture.”\n Polina laughed. “The wood is not really as precious as what it contains. But, no one talks about this in the market. You see, I sent my son to care for the king’s ailments. Ground springtops for his aches. I wouldn’t dare name all of them now. My son, why, he overhears it all. And he is too worried about our safety to leak it out to anyone but me. The dried wood is good for the shakes, but not much else. But, I see you’ve found out something of your own. You have something that might be useful. I would give you information, if you let me have some samples.”\n I pulled out the crystal with my gloved hand. She gasped. Even without the eerie glow, it was brilliant, refracting the little bit of streaming light from the closed curtains into soft blue hues.\n “From the heart of the onyx trees,” I said.\n She looked up at me in fear. “But, this . . . this is forbidden. It is one thing to pull off a few pieces of bark. But, this . . . this is the core. These are all the king’s designated lands.”\n “They used to be ours,” I said. I shrugged.\n She hesitated. I prodded her on with a nod. She looked up at me and something firm set in her eyes. Curiosity must have overtaken fear. She pulled out a knife, made of the same material as my axe, as I noted from the sheen, and took a few shavings off the crystal in her gloved hands. The crystal quivered as she skimmed its surface. A wisp of blue mist floated out like steam but did not congeal into anything menacing or remotely organic-seeming. She prepared the sample, suspending it in a liquid and covering it with glass. She put the small sample behind a contraption with multiple lenses and shone light through it.\n “Great energy, great potential,” she said. “I wonder what the contempoists would do with it. Could be for the mills. Or for bringing water up from the wells. But, there’s something else it could be for.” She raised her eyes at me, holding out the shavings as if it would be as clear to me as it was to her. She lowered her eyes. “Weapons.”\n “Weapons?” I asked, whispering.\n “The contempoists are not content to simply be. They must expand, and to do so requires power. At least that is what my son has told me. And their power is all derived from a certain exchange. They trade in weapons.”\n I have heard of such things. Firing explosives of distant lands that set off in systematic frenzy. I heard they require lots of energy to run, but had not seen one myself.\n Polina looked out towards the closed curtains and then turned to me, her eyes glowing. “You could make a great amount of coins smuggling those crystals,” she said. “Not to me. I’m not fancying a life venturing into the weapons business. Sure, a little aphrodisiac powder or some rare root, I can handle that. But, not weapons. Better keep my mouth shut and milk our position to the king.”\n She put a finger into the onyx powder and licked it. “But, there are those less scrupulous than me, who would be willing to pay. Weapons are lucrative after all.” Her eyes gleamed, and I wasn’t sure if it was the effect of the bark or something else that made it glow so.\n I simply laughed it off, said that maybe this sample is contaminated, that it was a fluke. The crystals probably didn’t contain that much energy after all and I would get her another sample later. She peered at me and simply gave me the crystal shavings sample. “Don’t bother,” she said. “I don’t really want a trace of this in my store. Too risky. Take it back with you. I’m content with my powders.”\n With the crystal in my bladder sack pressed against my pants, I dreamed that night that the roots of the onyx trees dug deep into our land, drawing from the soil where all our people had passed into. I dreamed the roots, those snarled messes, held all our villages’ souls, entangled in their coiled limbs. The instructions of my parents, of how to make the bladders, flashed in my mind. A reverie of how-to’s, a culmination of various whispers, in shifting misty forms, goading me to make this and make that. Ideas for innovation, specific processes for inventions. Even recipes, age-old instructions for gra soup and other village delights, some lost for generations. I tossed and turned, my blanket soaking in sweat, the crystal digging into my skin. My mind arranged what I could not while awake. They were impressions, profound and urgent.\n The trees were not sentient themselves, but they collected the intelligence, froze them into crystals. And I woke up realizing I had found the tree wall’s weak spot. One-oh-six. It must be something like a security breach of the trees, where the one hundred strokes always resulting in a clean break without accessing that knowledge, but the extra six hits indicating a spot of instability. The trees absorbed the village info, amassing these secrets, not letting them easily be freed. And I had been the lucky one that encountered their vulnerable point. Like tapping on a cocofruit at just the right angle for the liquid sweet flesh to coming spilling out.\n In the morning, during our day of rest, I choked down the strange bread made from outsider grains, soaking it in my tea, wishing it was pounded shelo instead. I watched the crumbs swirl and swirl, like the blue mist that emerged when I touched the crystal. My plan was to go back later that night and call out those forms, those mists that swirl and swirl. I would place my hand around the crystals, the whole mass of them and I would ask them for some guidance. Deep within the vault of their knowledge, drawing from the souls of our many villagers that have come and gone, there must be some way to beat the king, some way to fight off the contempoists, who were exploiting us and our resources of energy. False and easy promises of advancement from grains. The contempoists would have us indebted to them, exporting our greatest reserve, reap from our souls and ideas and have these dynamic elements rendered into something as consciously inert as energy to fuel their armaments of threat. They would then have us import a lifestyle of grains that required milling stones, brick ovens, and other foreign goods they planned to sell us, making us further in debt. I could see it clearly now. They intended to wring us dry, have us chop down all our trees and leave us wanting for more. It became clearer to me, as I held the crystal in my hand, assimilating the stray words, interpreting what the mists had to say. An ineffable feeling of wonder washed over me as I was starting to make more sense of the hazy jostling movements of these blue mists of knowledge.\n I spat out the last bits of bread and instead took out a store of dried mushrooms from a glass jar and chewed on their rubbery gills. I was complicit in this destruction of our trees, of our whole domain, of our beautiful Phinelia—and I would get it fixed. I had the whole village ancestry with me after all, backing me up, that I could tap into. Not just this one crystal, but with this security breach, a gateway to them all. And there must be something in there that could change the king’s mind, or even—get rid of him completely. I couldn’t believe my head was swarming with thoughts of persuasion, even a coup, but I could not bear to see my people shackled, their greatest asset shipped away to menacing groups of profiteering and power.\n Why didn’t it occur to me earlier? Maybe I was always suppressed by trauma, the image of the onyx tree falling ever so slowly, crushing my parents. There was always another hand, someone else, a sinister force that had set up the trap. I knew it but did nothing about it.\n I was a coward, I thought. But, I won’t let this continue on.\n I gulped down my tea, the swirling, floating crumbs dissolved to less than mush within the brown liquid. I put the crystal away, patting the sack my dad made. I grabbed the white sickle from the table and put on my coat. I tucked the sickle beneath the folds of my coat, hidden into its hardened protective sheath, and tied the sash at my waist. I heaved the axe, still caked with scarlet sap, wrapped the blade, and shoved it in a large sack. I had resources to gather, people to talk to, and a lot of convincing to do before nightfall.\n We would get our village back.\n D.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation."}