{"fingerprint": "i6x7C9Hez43z8YQKVwMiJYNVNB0=", "sitename": "Clarkesworld Magazine", "title": "Silent Bridge, Pale Cascade by Benjanun Sriduangkaew", "author": "Benjanun Sriduangkaew", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sriduangkaew_12_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Silent Bridge, Pale Cascade by Benjanun Sriduangkaew", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5180 words, short story\nSilent Bridge, Pale Cascade\nThe knife of her consciousness peeling off death in layers: this is how she wakes.\nShe is General Lunha of Silent Bridge, who fought one war to a draw as a man, and won five more a woman against adversaries who commanded miniature suns.\nThe knowledge reconstitutes piecemeal in the flexing muscles of her memory, in the gunfire-sear of her thoughts as she opens her eyes to a world of spider lilies skirmishing in flowerbeds, a sky of fractal glass. She is armed: an orchid-blade along one hip, a burst-pistol along the other. She is armored: a helm of black scarabs on her head, a sheath of amber chitin on her limbs and torso. There is no bed for her, no casket enclosing her. She comes to awareness on her feet, at ease but sharp. The way she has always been.\nGrass crackles and hisses. She draws the blade, its petals unfurling razor mouths, and recognizes that this weapon is personal to her. All generals have them: a bestiary of blades and a gathering of guns, used to an edge and oiled to a sheen. She maintained a smaller collection than most; this was one she always kept at her side.\nThe grass is stilled, coils of circuits and muscles and fangs, petroleum stains on Lunha's sword. She fires a shot into its vitals to be certain. A detonation of soundless light.\nHer datasphere snaps online. Augmens bring one of the walls into sharp focus, an output panel. At the moment, audio alone.\n“We had to make sure you were physically competent.” A voice keyed to a register of neutrality, inflection and otherwise; she cannot tell accent, preferred presentation, or much else. “It is our pleasure to welcome you back, General Lunha.”\n“My connection is restricted. Why is this?”\n“There have been some changes to data handling at your tier of command. We'll send you the new protocols shortly. It is routine. You'll want a briefing.”\n“Yes.” Lunha attempts to brute-force access, finds herself without grid privileges that ought to have been hers by right.\n“Your loyalty to the Hegemony has never been questioned.”\n“Thus I’ve proven,” said Lunha, who in life served it for sixty years from cadet to general.\n“We will not question it now.” The panel shimmers into a tactical map. “This world would offer its riches and might to our enemies. Neutralize it and the woman who lures it away from Hegemonic peace. Peruse her dossier at your leisure.”\nThe traitor planet is Tiansong, the Lake of Bridges, which in life was Lunha's homeworld.\nTheir leader is Xinjia of Pale Cascade, who in life was Lunha's bride.\nNaturally she questions whether she is Lunha, rebuilt from scraps of skin and smears, or a clone injected with Lunha’s data. The difference is theoretical beyond clan altars; in practice the two are much the same. There is a family-ghost copy of her floating about in Tiansong’s local grid, but that too is a reconstruction from secondary and tertiary sources, no more her soul or self than her career logs.\nThe grid enters her in a flood, though like all Hegemonic personnel above a certain rank Lunha is partitioned to retain autonomous consciousness. For good measure she runs self-diagnostics, which inform her that she is not embedded with regulators or remote surveillance. Perhaps it is a sign of trust; perhaps the reconstruction is experimental, and the biotechs did not want to risk interfering with her implants. She entertains the thought that she never died—severe injury, a long reconstruction, an edit of her memory to remove the event. The report is sealed, either way.\nThey’ve given her a tailored habitat: one section for rest, one for contemplation, one for physical practice. Being in this profession, she has few personal effects; most are accounted for. Not merely equipment but also the keepsakes of conquests. Here the gold-veined skeletons of Grenshal wolves, there the silver-blossom web of live Mahing spiders. A Silent Bridge shrine for the memories of elders, compressed snapshots of their accomplishments, proverbs and wisdom. Lunha did not consult them often, does not consult them now, and examines the altar only to ensure her family-ghost does not number among them.\nHer grid access continues to be tight. She may listen in on military broadcasts of all levels when she cares to, but she can't communicate. Public memory is a matter of course and she checks that for civilian perception of Tiansong. To the best of their knowledge Tiansong embroiled itself in civil war, during which a new religion emerged, spearheaded by Xinjia. A dispatch would be sent to return Tiansong to peace.\nReports on classified channels are somewhat different.\nOut of habit she evaluates troop strength, positions, resources: this is impersonal, simply the way her mind works. She estimates that with Tiansong's defenses it'd require less than a month to subdue her homeworld with minimal damage. In a situation where that isn’t a concern, it would be under a week. Quick strike rather than campaign, and entirely beneath her.\nFor three days she is left in isolation—no other being shares her space and she lacks social access. The void field around the compound forbids her to step far beyond the garden. On the fourth day, she stirs from meditation to the hum of moth engines, the music of shields flickering out to accommodate arrival. She does not go forth to greet nor move to arm herself; it seems beside the point.\nHer handler is purebred Costeya stock, a statuesque neutrois with eyes the color of lunar frost. They wear no uniform, introduce themselves simply as Operative Isren.\n“From which division?” Lunha tries to write to Isren, the right of any general to alter the thoughts and memory of lesser officers. She can’t.\n“Operative,” Isren says, and nothing else. They bow to her in the Tiansong manner, hand cupped over fist, before saluting her. “Your situation's unique.”\n“Why am I required? It is no trouble to flatten Tiansong.”\nIsren has knelt so they are level; they have a trick of arranging their bearing and their limbs so that the difference in height doesn't intimidate. “A bloodless solution is sought.”\n“There are other Tiansong personnel in active service.”\nWhen Isren smiles there's something of the flirt in the bend of their mouth. “None so brilliant as you. Xinjia of Pale Cascade is a labyrinthine opponent. She has brought awareness of the public sync to her world and had the opportunity to spread the idea before we imposed embargo. She boasts . . . disconnect. In essence she’s become an infection.”\n“Has she achieved it? Disconnect?”\nA shard of silence pinched between Isren’s professional circumspection and the situation’s need for candor. When they do speak it is delicately, around the edge of this balance. “Not through the conventional methods. Her way entails ripping out network nodes and reverse-engineering them. Fifty-fifty chance for cerebral damage. Five to eight thousand have been incapacitated, at last count.”\nLunha browses through available reports. Risk of brain death or not, Xinjia has gained traction, so much that she has been made First of Tiansong. It’s not unanimous; nearly half the clans posited against her. But nearly half was not half, and Silent Bridge tipped the scale. Her plans have been broadcast to twenty independent worlds. “Removing her won’t suffice.”\n“No. You are invested in keeping Tiansong well, Xinjia alive, and that’s why we brought you back.”\n“Let me travel there. I would assess the situation on the ground.”\n“That was anticipated,” Isren says. “We are on Tiansong.”\nWhen Lunha last visited her homeworld she was a man. Among family she’s celebrated only as daughter and niece, for all that she flows between the two as water over stone. Whatever her gender, General Lunha’s face—pride of several clans—is too well known, and so she puts on a mesh to hollow out her cheeks, broaden her nose, slope out her brow.\nShe travels light, almost ascetically. One firearm, one blade. Tiansong currency, but not too much. Her one concession to luxury is a disruptor array to guard against targeting and deep scans. Isren does not accompany her in person; on the pristine sea of Tiansong phenotypes, Isren’s Costeya face would be an oil slick. The operative has no objection to blending in, but on so short a notice, adjusting musculature, complexion and facial tells is beyond even Isren.\nLunha avoids air transports and their neural checks, keeping to the trains and their serpent-tracks. She takes her time. It is a leave of absence—the idea amuses and she catches herself smiling into the scaled window, her reflection momentarily interrupting art ads. One of them urges her to see a production of The Pearl Goddess and the Turtle, done by live actors and performed in a grid-dead auditorium. No recording, no interruptions.\nAt one clan-hold she says she is a daughter of Razor Garden; at another, in different clothes and with a voice deepened by mods, Lunha introduces himself as a groom newly marrying into Peony Aqueduct. At each Lunha is received with courtesy and invited to evening teas, wedding dinners, autumn feasts. Despite the tension of embargo they are hospitable, but none will so much as breathe Xinjia’s name.\nHer breakthrough comes while she sits in a kitchen sipping plum tea, legs stretched out and listening to an elderly cook who fancies she resembles his middle son, long lost to a gambling addiction. “You want to destroy a nemesis, you teach their child to gamble,” the cook is saying as he spoons chives and onions into dumpling skin.\n“So the ancestors say.” Lunha’s enemies tend toward a more direct approach. She takes pride in having survived some two hundred assassination attempts, though it doesn’t escape her that she might’ve failed to foil the final one. “These days there are quicker ways.”\nThe cook chuckles like dry clay cracking. “These days you point the young, impressionable son to Pale Cascade.”\n“Ah, it is but half a chance of ruin. I thought they hosted guests no more, having become grudging on hospitality of late? Since we can’t get off-world it was my hope to at least visit every hold before matrimony binds me . . . ”\nHe shrugs, pinches the last dumpling shut, and begins arranging them in the steamer. On Tiansong no one trusts replicants to get cuisine right. “If you know someone who knows someone in Silent Bridge.”\n“Is that so. Many thanks, uncle.”\nShe catches the next finned, plumaged train bound for her ancestral home.\nThe public sync, the great shared memory, is an instrument to maintain peace. Even after learning of it and what it does, Lunha continued to believe this, as she does now. It doesn’t do much for freedom of thought; it comes with all the downsides of information regulated under the state’s clenched fist and the grid usurps perception of the real. But it functions, stabilizes. The Costeya Hegemony has existed in equilibrium for centuries.\nIt is useful now as she edits herself into the distant branches of Silent Bridge rather than its primary boughs, as her true birth order dictates. The specifics make her hesitate. She settles on female, for convenience more than anything, and picks childless Ninth Aunt as her mother. No sibling, less dissonance to having a sudden sister where once there was none. Those reactions cannot be overridden. Emotions cannot be molded.\nWhen she arrives at the entrance bridge suspended between the maws of pearl-clasping dragons, Ninth Aunt comes to greet her. “My girl,” her aunt says uncertainly, “what kept you so long in Razor Garden?”\n“Grand nuptials, Mother, and I earned my board helping.” A bow, proper. An embrace, stiff. Having a daughter is merely a fact, the gestures Ninth Aunt makes merely obligation.\nHer edits have it that she’s been away three months; in truth she hasn’t been home for as long as—her mind stumbles over the rut of her death. But not counting that it’s been five years. Silent Bridge hasn’t changed. A central pagoda for common worship. Sapphire arches and garnet gates twining in conversation to mark the city’s boundaries. Tiansong cities have always been less crowded than most, and there’s never that density of lives in the habitat towers here as on Costeya birthworlds. A wealth of space, a freedom of aesthetics. Barely a whisper of the Hegemony.\nFar better off than many Costeya subjects, Lunha knows for a fact; there are border planets that remain in ruins even to this day after their annexation. She cannot understand Xinjia.\nWhen they first met Xinjia wore masks and prosthetic arms; she danced between folded shadows of dragons and herons, only parts of her visible in infrared. Like all thespians of her caliber, Xinjia never appeared in off-world broadcasts. Tiansong makes a fortune out of its insularity—foreigners wishing to enjoy its arts must come to the source and pay dearly, though there are always rogues and imitators.\nLunha in the audience, breathless from applause. A friend who knew a friend brokered her an introduction. Offstage, Xinjia shed the mask but kept the dress, paper breastplate and bladed belts. In the custom of shadow-thespians she wore her face plain, bare, without mods. It made Lunha touch her own, self-conscious of the optic overlays, the duochrome cast to her jawline, replicant-chic.\nThey talked quickly, amidst the noise of departing spectators; they talked again later, in the quiet of the staff's lounge where the furniture, retrogressive, did not contour to their bodies.\n“You talk drama like a layperson,” Xinjia remarked once, between sips of liquid gold and jellyfish garnished in diced ivory.\n“I don't have a background.”\n“Officer school doesn’t teach fine arts?” The actor drew a finger across Lunha's knuckles. “A soldier with a passion for theater.”\n“Not before tonight.” Lunha caught herself, succeeded in not blushing.\n“Soldiers fascinate me,” Xinjia said, absently. “The juxtaposition of discipline and danger. Violence and control.”\nTiansong marriage lasts five years, at the end of which spouses and family members evaluate one another: how well they fit, how well they belong. A collaborative project.\nThey wedded on a barge, surrounded by family, blessed by avatars of thundering war-gods with their quadruple arms and spears and battle-wheels. Given that Silent Bridge and Pale Cascade were old rivals, neither Xinjia nor Lunha expected it to last—and it came a surprise to all involved that the marriage was extended past the first five years into the second, then the third.\nDivorce came after Lunha made lieutenant-colonel. By then they’d been spouses for nineteen years.\nThe ivory tiles and the redwood walls of the great house hum with trackers. Lunha sets her array to nullify ones that would gene-match her.\nSilent Bridge has always been one of the more—paranoid, she supposes other clans would say—but it's never been like this. A city-wide security lockdown. Anyone not family has been ejected; off-worlders are long gone, scared away by a non-existent epidemic just before the embargo fell.\nXinjia anticipated that sanction. Lunha considers the possibility that she found a way to manipulate the sync. It unsettles.\nShe keeps up desultory small talk with Ninth Aunt, with cousins who tentatively say they have missed her. It is the thing to say to a relative months unseen. They do it carefully, unsure of the words, of regarding her as family.\nTo pretend to be a stranger pretending to be of Silent Bridge. Lunha buried away entirely, like the haunting she is, the ghost she should be.\n“Is that all you have?” Ninth Aunt says, trying to be a mother. “The clothes on your back and not much else?”\n“I've always traveled light.” Lunha nods. “You know that, Mother.”\n“You've never taken care of yourself, more like.”\nIt always surprises Lunha what people imagine to fill up the gaps, patch up the cracks of recall brought by the blunt impact of edit. A defense mechanism, army psychologists liked to tell her, to ward off mental dissolution. There are Hegemonic facilities devoted to research into that, the sync's effects. What it can do. What it can't.\nIsren has gifted her with a spy-host; Lunha activates it with a visualization of tadpoles bursting through deep water. She avoids contact. There are disconnected people in Silent Bridge. They would know Ninth Aunt has never had children.\nAfter days of self-imposed house arrest, she steals to the streets.\nIn the hours of thought and ancestors, the walkways are burnished gold. A low whisper of overhead vehicles like memory, a gleam of pearl from atmospheric stations like moons. Lunha inhales not air but the quiet.\nShe wanders first aimless, then with a direction as she cross-references the host's eavesdropped data. From the security measures she assumed it would be the great house, the halls in which Silent Bridge primaries make governance and cast laws. Two of them her mothers. They are proud of Lunha, but they always expected her rise through the ranks, her conquests of fifteen worlds in Costeya's name, and if she'd been or done any less it would have been a blot on a lineage of prodigies.\nAn old shrine, turtle tiles and turtle roof, stone monks enclosing a garden of fern and lavender. The scriptorium is guarded by wasp drones. She inputs a bypass code, stop-motion images of blue heron spearing silver fish. A murmur of acknowledgment and they give way; these are all Hegemonic make, and she has been reinstated as general. They've been reverse-engineered, but not deep enough to keep her out. She can’t quite fault the Tiansong techs; less than a thousand in the Hegemony command her level of access.\nBetween shelves showing paper books in augmens visuals, Lunha waits. She passes the time reading poetry, immersing herself in Huasing's interlocking seven-ten stanzas, Gweilin's interstitial prose-sculpture telling of the sun-archer and her moon-wife. They eel through her awareness, comforting, the balm of familiarity.\nXinjia arrives, eventually. It is where she comes to think when she needs solitude, and from what Lunha can tell solitude is precious to her these days, too rare.\nThe scriptorium is large, and Lunha did not go sixty years in the army without learning stealth. She finds a space to occupy, a blind spot where Xinjia will not look, and for a time simply observes.\nXinjia looks at peace, striding easily to the mat and the bar. She sheds her slippers, most of her clothes, until she is down to pastel secondskin, lavender shifting to gray as she moves. Hands on the bar she arches backward, stretching until her neck cords, the muscles in her torso pushing out in bas-relief.\nLunha turns off vocal mods and says, in her own voice, “Xinjia.”\nHer former wife straightens quickly, supple—sinuous. They had elaborate pet names for each other once. Bai Suzhen for Xinjia, after the white snake of legend.\nA precipice moment, but Xinjia does not fall. “General Lunha is dead. What are you?”\n“A ghost.” Lunha reaches into Tiansong's grid. Of course there's a copy of her in the archive of primaries, her knowledge and victories turned to clan wisdom. “But you would be familiar with that.”\n“Shall I offer you tea?”\n“No,” Lunha says, though she follows when Xinjia leads her to the low table, the cushions. “How have you been?”\n“You'd be familiar with updates on me.”\n“First of Tiansong.”\n“It was necessary to obtain that title to do what needs doing.” Xinjia calls up the ghost: Lunha’s face, serene. Feminine. Xinjia did not much like it when, on rare occasions, Lunha was a man. “This contains much of how you planned, how you dealt with your enemies.”\n“The data they sent home would be scoured of classified information.” A jar of ashes, after a fashion.\n“I was more interested in how you thought. Strange, but I don’t think I ever knew you so well as posthumously.” The secondskin has absorbed sweat, leaves only a trace of clean, saline scent. Xinjia has never worn perfume. Offstage she goes through the world strictly as herself. “There were votes to input your data to a replicant. I overrode it.”\n“We haven’t been spouses for a long time.”\n“I remarried,” Xinjia says, “into Silent Bridge. And so we are family, which gives me some rights over managing your image. Your mothers agreed with me the replicant idea was . . . abhorrent. May I touch you?”\nLunha nods and watches Xinjia’s thumb follow the line of her jaw, her nose, her mouth. There Xinjia stops, a weight of consideration, a pressure of shared recall.\n“Is it surgery or are you wearing something over your face?”\n“The latter,” she says against Xinjia’s finger and entertains the thought of their first time together, feeding each other slices of persimmon, licking the sweetness off each other’s hand. Slick fabrics that warmed to them, braids of sheet slithering against hips and thighs and ankles. For sex Xinjia never liked a still bed. “Why have you undertaken this?”\n“A glitch,” Xinjia says, in that detached way. Her hand has drifted away to rest—as though incidentally—on Lunha’s knee. “A glitch that left some out of sync, myself among them. What was it? Something happening on Yodsana, an explosion at a resort. Just a tidbit of news, insignificant, nothing to do with us. I think I was looking up Yodsana puppet theater, or else I’d never have noticed. To me the resort was operating as usual. To everyone else it’d gone up in flames, fifty tourists dead. I made a note to myself. Except a few days later I couldn’t remember why or what it was about. What did I care?”\n“That happens.” Rarely. Beyond rare.\nXinjia smiles, faint. “I followed some leads, made discoveries, gained contacts. It isn’t just me, Lunha. As we speak disconnect is happening on more worlds than you realize, one or two persons at a time. I’ve only taken it to a larger scale.”\n“You will take all of Tiansong with you.”\n“Enough of Tiansong wanted this that they elected me First. Can you imagine how I felt when—” Xinjia blinks, pulls away. A command brings up a floor compartment: a set of cups, a dispenser. “When did they let you . . . ?”\n“General. After three successful campaigns.” At this point it seems senseless to keep unsaid. “I underwent preparatory conditioning to minimize dissonance, though at the time I didn't realize what it was for.”\n“Hegemonic personnel must've let it slip. To friends, loved ones.”\n“Seldom. Easily overwritten.” Easily detected. The penalties exorbitant.\n“You are all right with this?” Xinjia pours. Chrysanthemum steam, the tea thick with tiny black pearls harvested from Razor Garden orchards. “Sixty years in service, an illustrious career. You can't understand at all why I'm doing this, why others want me to do this?”\n“In principle I can guess. In practice—this is not wise.”\nA cup is slid toward her. “They can take all we are from us. They can rob us of our languages, our cities, our names; they can make us strangers to ourselves and to our ghosts, until there's no one left to tend the altars or follow the hour of thought or sweep the graves.”\nLunha sips. She misses touch, not just any human contact but Xinjia's specifically. “The Hegemony has no cause to do that. The amount of rewriting it'd take would be colossal.”\n“It would cost them less to reduce Tiansong to scorch marks than to process that much. Yes. Should they find a reason though, my soldier, they will do it. Changing us a little at a time. Perhaps one day we'll stop lighting the incenses, the next we'll have Costeya replicants cooking for us. After a month, no one dances anymore the way I do. Instead: Costeya scripts, chrome stages and replicants performers, like on Imral and Salhune. They've this hold on our . . . everything. That I cannot abide.” Her former wife, someone else's now, looks up. “I believed that neither would you.”\n“Xinjia. Bai Suzhen.” Lunha does not reach out, still, will not be the one to yield tenderness. They haven't been spouses for so long. “Eighty years ago there was a conflict between Iron Gate and Crimson Falls. It was escalating. It’d have torn Tiansong apart, a field of ruins and carcasses, until the Hegemony intervened. A thorough edit. Now no one remembers that; now Iron Gate and Crimson Falls are at peace. You may not believe it, but that is what soldiers fight for—to preserve equilibrium, to bring stability.”\n“To enforce the Hegemonic definition of that.”\n“It’s one that works.”\n“And the massacres of Tiansong empresses when Costeya first took over, what about that? Is that stability; is that peace? Or is it bygones simply because it’s been all of three centuries? No. Don’t answer that.”\n“There are planets now which suffer much worse. I’ve been there; I’ve ordered their ruin and the execution of their citizens.” Lunha knows that she has failed, already. That there was never a way to win. Not here.\n“You are not yourself,” Xinjia says softly.\n“I am. I have always been myself.”\n“Then there is no ground on which we can meet. Perhaps there never has been.”\nLunha drinks until there’s no more in her cup, tea or pearl. “I will find a way to keep Tiansong safe.”\nIn the end neither of them surrenders. They do not touch; they do not kiss. A parting of strangers’ courtesy.\n“Isren.”\nIt takes no more than that, on their unique frequency, to summon the operative. A link, with visuals to let her know Isren remains in the habitat. “Yes, General?”\n“I could not dissuade First of Tiansong.”\n“In that case please head for Iron Gate. There’ll be a shuttle keyed to one of our ships in orbit.”\n“No.” Lunha gazes out through the round window, makes it widen to take up the whole wall. Silent Bridge at midday is platinum. “Bring me armor. I expect it within seventy-two hours. Are you authorized to officiate a duel?”\nHer handler’s expression does not change, save for a rapid blink. “That’s not what we had in mind, General.”\n“A duel minimizes collateral damage. Tiansong’s representative wins and we leave it under embargo, to limit the influence of disconnect. If Xinjia is assassinated, apprehended or otherwise forcibly stopped there will be others, and not on this world alone. It’ll be almost impossible to track the unsynchronized.” It is not a certainty, but it is how Xinjia would have learned to plot from Lunha’s image. “I win and Tiansong gives up its schemes, surrenders to reintegration. I don’t lose, Operative Isren.”\n“You invoke an archaic statute.”\n“I invoke it correctly, and this is not the first time I’ve pushed to resolve by single combat. This is a situation where military destruction is untenable, diplomatic solution impossible.”\n“If you lose, General, I’ll be overriding the result.” Isren is silent for a moment. “A duel to the death.”\n“So it goes.”\nShe sends word to Xinjia to choose a single-combat proxy, briskly outlining the terms. Xinjia accepts them immediately. They are the best that can be had, under the circumstances.\nLunha revokes the edits she made and takes off the facial mesh. She spends some time cleaning, hot water this side of scalding, balm and pigments to smooth away marks left by the mesh. Tiansong commanders of old did that, purify mind and body before going into battle, and Lunha has always followed suit. Not much time for the mind, but few engagements ever gave her the leisure.\nIsren’s arrival is not covert, and Silent Bridge is prepared. Lunha watches a feed from the operative’s eyes as the primaries greet the neutrois, coolly formal. Isren’s readouts telling who is disconnected: Lunha’s mothers, two other primaries, distant cousins Lunha doesn’t know—too young.\nThey escort Isren, courteous. Lunha does not admit them into her room. Her mothers catch a glimpse of her face—her own, the face she was born and grew up with—and Mother Yinliang’s eyes widen, stricken.\nIsren unpacks armor, dress uniform, more weapons. “I assumed you’d want this to be ceremonious. I’ve obtained authorization for your . . . tactical decision.”\nPerhaps she should’ve found time to speak to her mothers, Lunha thinks, but it is too late, she moved too fast. Odd, that. In battle there’s never been such a thing as too fast. “I appreciate it.”\n“Do you want to talk about it?” Isren tilts their head, just enough to emphasize a pale throat notched by a jeweled implant.\n“I don’t intend to become familiar with you, Operative.”\nThe neutrois’ laugh is ambiguous. “I’m married, quite happily. A career soldier like you, though she’s not half as feted. There’s an advantage to partnering within the ranks. Fewer secrets to keep. Speaking of that, has the First of Tiansong gone entirely offline, physically removed the neural implants? Can she still interface with the grid?”\n“She’s kept the implants.”\nIsren inclines their head. “I’ve sent you a program. Experimental. It’ll reintegrate her into sync. The infiltration method is the best of what we have; all you need is to establish a link with her and it’ll latch on.”\n“Side-effects?” Lunha grips the helm in her hands and decides against it. She’ll show her face.\n“So far as it’s been tested, none. The worst that could happen is that it won’t work.”\nNo side-effects. A program that forces neural interface back into the grid, and Isren would have her believe there are no side-effects. Isren wears no immediately visible protection, but they are not without. Lunha calculates her odds of avoiding the nerve toxins and disabling Isren before the operative’s nanos activate. Aloud she says only, “I’ll take that into account, Operative Isren. My thanks.”\nAt night, Silent Bridge is sapphires. All the colors that sapphires can be, the finest grade and luster.\nUnder her armor the dress uniform is snug; at her hip the orchid-blade rests with the ease of her own limbs. The winds cut harsh enough to sting and the summit of the great house is sheer, the tiles under them smooth.\nMother Yinliang has no expression anymore; Mother Fangxiu never did. Xinjia merely looks abstract, her gaze apathetic save when it rests on her proxy. A broad woman, sleek and muscled like a fox, veteran champion of Iron Gate pits. An insult, when it comes down to it, though Lunha does not underestimate.\nEach pair of eyes records and broadcasts. The uniform, the armor. She is a Hegemonic general. Except for her and Isren there is no hint of Costeya anywhere in Silent Bridge.\nStill time to execute that program, General. Isren’s voice through the private band.\nLunha strides forward to pay her mothers respect. Bending one knee, head bowed, the submission of a proper child. Neither answers her; neither touches her head. She accepts that and rises to face the pit fighter.\nThe first trickle of adrenaline. Her reflexes coil and her mind settles into that space of faceted clarity, the interior of her skull arctic and luminous.\nShe unsheathes her orchid-blade, its mouths baring teeth to the wind, its teeth clicking hunger to the cold.\nThey begin.\nBenjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award."}