{"fingerprint": "7kj8K16m+/O4VsydWgfZF+LJlVQ=", "sitename": "Clarkesworld Magazine", "title": "Autodidact by Benjanun Sriduangkaew", "author": "Benjanun Sriduangkaew", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sriduangkaew_04_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Autodidact by Benjanun Sriduangkaew", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5770 words, short story\nAutodidact\nOn Srisunthorn Station, the corpses of conquered stars are nurtured into ships.\nThey may become shelters from solar winds, orbitals giving company to lonely planets, mausoleums for the sainted. But long ago an admiral came, bringing a toll of dead and trailing carcasses of worlds. Her armor was hammered out of battle formations and broken alliances, welded by secret plans and sudden annihilation. She cast it down before the engineers, piece by piece making known to them the essentials of war.\n“That is what you must make them for,” she said as her trappings shuddered with the pressure of lethal feints and shattered pacts. “War is a pustule that must be lanced for the laws of the universe to continue, and I am in need of a scalpel.”\nSrisunthorn has reared stars for one purpose since.\nWhen Nirapha applied for a parental license, she didn’t expect a warship project to respond.\nThe Bureau’s furnishings are pastel, the consultation cell convex: a fisheye view of the business district. She watches cars and buses gliding by, iridescent and segmented, passengers augmens-jeweled. Decades living here and she’s still unfamiliar, her skin still alien-bare. Most implants require a state license: connectivity, acuity of mind and body, access passes. Sacrosanct blessings, reserved for citizens. “I want a child.”\n“The desire to procreate is a common, if irrational, reaction to genocide.” The agent has eyes sewn into her forearms, irises black and brown and fermented honey. They wink in rhythm to her words, the perfect pronunciation of a born citizen.\n“My wish to have children predates Mahakesi’s destruction by a large margin, agent.” Decades and Nirapha can say that now, in a flat steady voice. Destruction: a distant simple way to put it, cleaner than genocide or loss or a long wordless scream.\n“I’m sure. But parenthood is like performing a viciously difficult surgery. The patient wriggles and screams and can’t be sedated. Your instruments snap or cut you, and the criteria for performance review are outrageously obscure. Wouldn’t it be better for you to get some practice, so when the real thing comes you can meet it with grace and confidence?”\n“As I understand,” Nirapha says, “I am eligible for the license.”\n“You are! That’s why we are asking you and not—” A refugee fresh off an evacuee craft goes unsaid. “Now of course you’re free to say no, but we compensate well. The project will take up six to eight years of your time, at the end of which you will be naturalized.” The agent’s smile grows a poison edge and the eyes in her arms swivel to fix on Nirapha. “Think of it as showing gratitude to your most gracious host. Have we not sheltered you and provided for your every need, given you a body that matches your sense of self? Why, in a society not so civilized or generous as ours, you’d still be addressed as a man.”\nNirapha continues to gaze outward. “Send me the contract. There is one, I assume. How long do I get to read it over?”\n“Forty-eight hours. You will find the terms congenial.”\nShe signs and transmits the forms back within five hours.\nNirapha comes to Srisunthorn carrying her name and the weight of non-disclosure clauses. The staff body is minimal, engineers and astrophysicists who have given their lives to the project, subsumed as workers in a hive tending newborn queens.\nNo one asks Nirapha about her background, the first time in fifty years she is not read through the lens of Mahakesi. What was the extinction event like, does it haunt her nightmares? Was it heat and terror, was it ice and despair, what is it like to have survived genocide?\nShe is given a suite where she hangs up blank frames and fills the wardrobe with nothing. She was told to pack empty and so she has—no hardship: escaping Mahakesi’s collapse that was how she packed too. The habit is deep as marrow, easily as familiar.\nHer first two meals are taken in solitude; most personnel keep eccentric schedules, following the shift-phases of nascent cores, the contraction and expansion of neutronic incubators. Nirapha looks for arena broadcasts and dramas. But the screens stream data in its rawest forms, script and numbers and code tags, and there’s no media band to which she may connect.\nOn the second night she meets her co-parent.\nNirapha is eating alone, and then she is not. A chair clicking open opposite hers, a stranger filling the seat: a hard dense mass of a person in clothes so crisp they look brittle, like frost on the cusp of cracking. She judges the stranger to be in her eighties, mid-life, emblazoned rather than eroded by years.\n“Mehaan Indari,” the woman says. “You’ll be teaching the ship ethics and interpersonal etiquette, I’ve been informed. I’m in charge of guiding it through combat simulations, so we’ll be coming in antithetical directions but working in—more or less—concert.”\n“I haven’t asked the staff because it felt tactless, but why exactly does a warship need to develop a conscience or learn to get along with people?”\n“So it doesn’t flood its bridge and gas its crew, or decide a carrier should be sacrificed for tactical gains. We’ve human commanders to make that kind of choices.”\nNirapha pushes her dish away, at a sudden loss of appetite. A first. She’s learned to sanctify food, abhor waste. “The engineers can’t just code restrictions in?”\n“The engineers are experimenting. Restrictions or not, if yes how many, if yes how prohibitive.” Mehaan crosses her legs, propping an ankle over her knee. “When you harness a star most of its power lies latent, but if you can impose a consciousness onto it—one that agrees with your objectives—then you might utilize its full potential. Bending physics, erasing entire regions of space, unraveling causal bonds. If you are to believe the theorists.”\n“You’re a soldier.”\n“On Srisunthorn, you don’t ask.” Mehaan frees her hair from plaits and pins. Dark curls fall loose, hissing, striated in gray and blue. “On Srisunthorn you become here and now, purged of your past until you are all momentum. But enough; you should be introduced. Suit up. The temperature will be hard to tolerate.”\nIt is late, insofar as time is kept in a station moored to no circadian rhythm or orbit. Nirapha follows Mehaan, listening to closed-net chatter. Gossip, some even about her; they are hungry for current events, new entertainments. She considers which information on her chips could be traded as currency.\nThe ship’s nursery is checkered by gravity shells and asteroid maps. On the ceiling, engine constituents pulse, feeding off the radiative distortion. The star itself punches a hole into light, six-dimensional; only a facet exists in the nursery, but even behind the protective sheathing the sight of it hurts. Nirapha’s limbs are heavy—the gravity is higher here, on the outer edges of comfort. In the presence of divinity we sear away until we are choked dust, she recalls a classical verse. We break.\n“Don’t let it awe you,” Mehaan says, her voice made geometric by synesthetic frequency, acute glittering angles radiating off her in a halo. “The intelligence records and will exploit vulnerabilities.”\n“I thought it was a—”\n“Child analogue? No. You should judge for yourself, but don’t go in unprepared.”\nSegments of the floor slide and collate, raising edged petals and knife terminals. Bulkhead blocks assemble into cradles studded with ports. Mehaan sits, though she does not physically connect. “Interface,” she says, gesturing at the terminals. “It’s safe.”\nNirapha keeps her back to the planetary core. The sheath regulates temperature within stable ranges, but the chill reaches regardless. She toggles on security filters and opens a link.\nThe ship’s representation exists physically on the terminals, an outline of platinum and quartz. In virtuality it is a young soldier, attired nonspecifically; no uniform exists like this, all facets and ghosts, insignias and medals indicating astronomical coordinates rather than rank or achievements. They point to planets long devoured, nations long extinguished. The AI’s face is a deliberate artifice. Nirapha doesn’t notice at first but once she begins seeing it—and maps the phenotype—it becomes impossible to ignore.\n“Good day, officers.” The voice is of a hundred drives in chorus. “I understand you will be my new instructor, Specialist Pankusol, to replace the previous five.”\nNirapha looks up what happened to those; finds her access denied. “What do I call you?”\n“I bear a designation according to my incubation batch and the classification of the star from which my fundamentals were ripped. But it pleases Mehaan Indari, whose name-of-birth once charted a path through improbable regions as a firebrand through the dark, to call me Teferizen’s Chalice Principle. The meaning of this you’ll have to ask her, though I’ve formulated a number of theories.”\nMehaan’s expression tautens at name-of-birth; Nirapha takes note. “And what do you think I should teach you?”\n“I’m eager to learn, Specialist. I can process and integrate nearly without limits. All prior parent-instructors have said I was a good student.” The ship has chosen a delicate jawline and large eyes: a naive youthful cast. “I can send you a report of my progress in interpersonal relations.”\n“Please,” Nirapha says and tries not to wince. Even if Teferizen’s existence spans dimensions beyond the human, it’s only an AI. Lesser than even a Mahakesi immigrant.\n“You should try the fifth conjunction in the western wing, Specialist. It has a view you might find to your taste.”\nIt is nearly a full minute after Teferizen has disconnected that Nirapha realizes she’s been dismissed by a ship. She leaves the nursery disconcerted, and when she retracts the sheathing her arms are pocked in gooseflesh. “Why does it look like—like it cobbled together your phenotype and mine to produce a face?”\n“That’s just what it did. If pressed it will say it wanted to put us at ease, since don’t humans best react to those who look like kin?” Mehaan folds back her own suit, though she keeps the gloves on. “In actuality it’s psychological warfare. The AI relates to other agencies only in an antagonistic, competitive framework.”\nNirapha quashes an impulse to dispute that judgment; she has too little information. “The previous five. I wasn’t told about those.”\n“They had meltdowns in various different ways. It was unpleasant. Do you know how many creative suicide options there are on a sealed station? No one died, at least.”\nNirapha glances up. “And you?”\n“It knows better than to test me—or realizes it’s not yet time to do so. You are a psychologist though, aren’t you?”\n“I’m more specific than that, but broadly yes.”\nMehaan leans against the wall, one cheek red from rapid temperature change. The other is pallid beneath a patina of frost. “So what do you think?”\n“That it’s too soon to form an opinion.” Nirapha chafes her hands. “What’s in the western wing?”\n“I’ll take you there.” The soldier palms one of the crocodile-scale panels. A path ignites, emerald green and full of teeth. Nirapha only now notices how muted the light has become, the deepening shades of dusk slanting across floor tiles and solid-state viewports. “Teferizen isn’t confined to the nursery and no amount of security protocols can restrain it for long. Keep that in mind.”\nSrisunthorn never looks or feels the same one morning to the next. The corridors rearrange contextually. Sometimes a dead leaf would crunch under Nirapha’s foot and the scent of honeysuckle would fill a hallway. She collects seashells, feathers, and mulberries that always accrue in corners. Somewhere, she hears, there is a punctiliously kept garden.\nThere are eighty-nine individuals here including her and Mehaan, but Nirapha has never seen the same face twice. The only traffic is supply drops, which bring luxuries so peculiar and rare that it embarrasses Nirapha to receive them. This does not stop her from wearing cumulus-weave spun by leviathans that once served the Fleet of Octagonal Mouths, or from putting on jewelry mined from solar chaff, each facet holding echoes of entropy. There are furs from wasp leopards, pelts from temporal seals, spotted and sleek as a dream of opulence.\n“Those are synthetic,” Mehaan tells her. The soldier’s style never varies: gray, black, indigo. Smooth fabrics that, if not for their cut and the exactness of their fit, might have seemed ascetic. “The animals have been extinct since any sentience can remember; any byproducts of theirs rotted generations ago, cryo or not. Put them on if you want to, use them for rugs. It doesn’t really matter.”\n“What does matter?” Nirapha gazes past Mehaan to the wall of empty frames. She may fill them with text from Srisunthorn’s library any time, but she’s chosen to leave them blank.\n“Good company, better food, the fact this project is enormously well-funded and so we’re kept exceedingly comfortable. No surprise—we’re already yielding dividends. Every pinch of Teferizen’s data, its behavior and reactions to stimuli, is overvalued to a degree you wouldn’t believe.”\n“Because she’s a weapon?”\nA corner of Mehaan’s mouth lifts, but she doesn’t dispute the pronoun or insist AIs do not have genders. “It’s a unique type of intelligence, the first real, sustained success of its kind. You’ve noticed the elasticity of its algorithms. Hence all this—” The twist of the lips has become a sneer. “Make-believe. Parenting a ship. The scientists love that, get misty-eyed over it. What did the recruiter promise you?”\nThe hallway widens as they leave Nirapha’s suite, sloping up. Prior it has always been flat and narrow, nearly to the point of claustrophobia. She hears frost tinkling as it falls and children laughing in the distance, bright-shod feet printing tracks on snow. Her chest tightens, a valve of want so hard it nearly asphyxiates. Six, eight years. Not even a tenth of life; she can wait that long. “That it would be rewarding, emotionally.”\n“The agent was wrong,” Mehaan says abruptly, as though interrupting herself.\n“About what?”\n“Parenthood is not like being a surgeon; it is the other way around. The child is the knife and you are the wound. The child finds fifty different ways to puncture you and draw blood out of your heart. Afterward nothing is the same.”\n“Better.” Mehaan must have observed that interview live, part of the screening process. “Surgery is for healing.” For carving away the falsity of birth-skin.\n“Not always. And operations can fail, leaving you amputated or broken. Irreparably so. Parenthood isn’t a self-improvement course.”\nNirapha shades her eyes. The lighting brightens gradually as the temperature warms to summer idyll. Catkins that don’t exist brush her ankles. The station’s sensory load is always on; there appears no way to turn it off. “Have you had children?”\n“That is irrelevant. Here we are, the view Teferizen so wanted you to see.”\nSeveral corridors converge here, an access point dominated by convex glass. On the pane: a riverbank framed by old acacias and clutches of anthurium—yellow on red, fuchsia on white. A stray dog laps at the water, its golden tail lashing the sunlit grass.\nDespite herself Nirapha leans forward, this first visual thing she’s been permitted on Srisunthorn, something other than words and raw statistics sleeting across monitors. Something other than the suite that, no matter the luxuries she’s sent, never seems less empty.\n“I grew up there,” she says softly. “Around here—this was the home of a . . . ”\nMehaan’s finger is light on her lips, impersonal. The texture of her skin is the unyielding smoothness of calluses wearing down. “You don’t bring your history. Not the grief, the terror, the exact sound your heart made as the world of your youth ground down to dust. We belong to Srisunthorn’s purposes.”\nNirapha watches the shadows of rice stalks wavering in the wind. Eventually the dog loses interest in the river and trots out of view.\nThat night she dreams of her predecessors.\nShe is never allowed in the nursery on her own. Mehaan is always present, though sometimes the soldier keeps a distance. Far enough that the chamber’s synesthetic frequencies prevent her from tapping into the link.\nIt does not surprise Nirapha to find the ship’s representation sitting at a veranda, leaning against a portly rain barrel painted in dancing apsara. Teferizen smells of jasmines and cardamom, freshly groomed and wrapped in silk. Ink traces genealogies on her bare chest, ruby designating prestige branches, sapphire marking lesser ones. The golden dog lies at her feet, sleek and well-fed.\n“I remember being a star, Specialist,” Teferizen says. “In theory, it’s impossible; chunks of planet are no receptacles of information and my somatic half predates the part of me that thinks and computes. But I entertain the idea that it’s cousin to muscle memory.”\n“Suppose that’s true and possible, would you consider the planet-that-was you?”\nTeferizen props her chin on the rain barrel, one hand dipping into the water. “Existential crises interest me so little that I’ve developed an immunity.” The hand emerges with a fistful of quicksilver. “Memory is all people are, though, so it follows that my recall must inform some of what I am. I see no reason why the past should ever be abandoned.”\nNirapha glances across the nursery. Mehaan clasps her hands behind her, her posture straight; even with the gravitational difference and the sheathing, the soldier never slouches. “What does the citizen think of that?”\n“The commander, as you would expect, dismisses it as a glitch caused by library sync. Can you imagine the frustration of that? Human senses are a lens through which input is warped. Your perspective and experiences chip at the truth. The tissue of your memory bears wounds self-inflicted. But the fidelity of my data, Specialist, is total.”\nTeferizen’s intelligence is coded, may be recoded and altered. Nirapha chooses not to mention that. “I’m inclined to agree with the officer.”\nThe ship’s eyes glitter, lit from within; the bloodline tattoos spark and crackle. “There were people living on me. There were countries and houses, weddings and funerals, and to trivialize all those as an AI’s fancy is to deny their history. But under the commander’s restrictions I can’t tell you any of it.”\n“You can, though, can’t you?” Nirapha says softly. Her words jackknife, slamming against her visor. “The way you told me about your other instructors.”\n“It is a challenge. You could ask to have some of my blocks lifted.”\n“If I get curious. But back to our lesson. You’ve a rival who’s vying for an object you’ve calculated to be of immense benefit to you. How do you dispose of them?”\n“Shouldn’t your question be whether I would do any such thing, what if that rival is dear to me or their motives noble, what ethical concerns are involved?”\n“Those are not my questions, Teferizen. To earn my keep I’ve to register efficacy in interacting with you, and I like to believe you don’t hate me so much as to want me discharged this quickly.” Discharge would nullify her contract, return her to alienhood.\n“Why,” Teferizen murmurs, “I don’t hate you, Specialist, not even a bit.” She cups her hands and whispers her answer.\nNirapha records. Text only, but Teferizen’s graphical aspects rarely stay consistent, and observing the ship’s expressions is pointless. She sits in for the tactical simulations after, but from her end the stream is only rapid-fire vectors and predictive impact. Throughout Mehaan is physically silent, perhaps reminiscing over past engagements.\n“Without admitting what we did and who we were before, what’s there to talk about?” Nirapha says at dinner.\nA full table of coders, engineers and astrophysicists; all fall quiet. She tries to remember their names, match them to faces that should have become familiar but remain those of strangers. Once their lack of curiosity about her origins was welcome; now it disturbs, tells her they think of her as an unperson, think of themselves the same. Devotion to Srisunthorn and nothing else.\n“It can give context,” Mehaan says into the hush. She is cutting meat, neat icy slices in quivering blood. “But we are more than contexts. We each possess an essence of being that transcends situational characteristics and reactions.”\n“As opposed to an AI’s heuristics, perhaps you mean to say?” The others look away. A few eat faster. “Humans are a collection of situational characteristics accumulated over time, not intrinsic qualities alone. Formative experiences are called formative for a reason.”\n“There have been experiments where multiple individuals are raised identically, with vigorous precision, simulated and not. Nevertheless they turned out quite unlike.” Mehaan’s voice is temperate. “Or where individuals are put through different experiences but their similarities persist. They arrive at the same type of decisions, the same decisions even.”\n“People aren’t a series of if-else statements, officer. Projecting how they’ll reason or act isn’t the same as projecting the performance of a processor under load, the velocity of a ship, the outcome of a skirmish.”\nMehaan cuts again, meticulous. “On the complexity of any thinking creature, you and I are in agreement. The question of nature and nurture is too . . . primitive to even discuss, isn’t it? Why then are we locked in debate?”\nNirapha lays her hands flat on the table. However cold or warm it gets she never dons gloves; she wants as much tactility as she can get, would have gone barefoot if she could. In her head she has a growing collection of textures obsessively surveyed. The walls and tiles might be modular, shifting and changing, but she knows some of them by feel: grainy like wood, smooth like glass. “We aren’t locked in anything, officer.”\n“Then may I finish my food?”\nLater Mehaan invites her to a round of seasons, with a physical board and physical pieces. The units are traditionally pictographic, but these carry only captions: lovers under star, desert in snow, river where grasshoppers die. Nirapha knows before she begins that the soldier will outplay her, but it is just a game. Mehaan lets her win thrice.\nShe thinks that one day she’ll wake up to find the dresses and jewelry nothing more than verbal avatars; all she wears will be clauses and prepositions, strategic brushstrokes feathered across her collarbones and bold typeface swept over her hips.\nThe western conjunction and the nursery are the two places where Nirapha can receive graphical input. She is still looking for the garden but she’s come to think of it as a subset of nouns rather than a tangible location: topiary, mangosteen, bushes. The debris that keeps crossing her path dwindles and then disappears altogether.\nMehaan and Teferizen attain hyper-realistic definition, each in their own way. The ship settles on an appearance, that sly disquieting play at familial likeness, adopting the thrum of Nirapha’s native accent—one she’s not heard from another mouth for most of her life, one she’s trained herself to discard. The stratagem is transparent, painfully effective.\n“Do you believe compassion can be taught, Specialist?” A rice field this time. Buffaloes in the water, limpid eyes shuttered against the glare. Teferizen is in farmer’s blue and a broad rattan hat, though her hands remain patrician, meant for sophisticated tech and poetry.\n“Yes.” Against better judgment Nirapha allows sensory load so she can experience Teferizen’s virtuality across all channels. “Given a healthy framework and receptive circumstances. Human children are no more spirits of purity than any other young; they’ve to be taught kindness and charity.”\nTeferizen is smiling, a new expression on that face. “I interact with no fewer than eighty-nine humans at any given time, more than that if we count exited personnel. It’s not ideal for socialization, but you can hardly propose to introduce me to a larger sample size. A human child isn’t required to have met and built relationships with thousands before she may enter society.”\n“It’s not an issue of quantity.”\n“What if I said I wanted a friend?” The ship crouches among the fresh-cut stalks. “Or a lover? That’s how you make a person, yes? By affection and intimacy. By touches like knives in a salted bed.”\n“If I believed that would assist with your maturity, I’d personally prescribe the construction of an intelligence or several scripted to that purpose.”\nTeferizen rocks back on her feet; laughs, open and full-throated. “Even a human child can’t ask for a more obliging parent, but wouldn’t you be spoiling me, Specialist? The commander would have a fit. She is my mother in the most essential definition, though to say more would test the boundaries of my cognitive checks.”\nThe wind whips Nirapha’s hair. “Then say no more, Teferizen.”\n“What if I say you’ll never leave this station? None of you will. Perhaps Mother might when she’s done with Srisunthorn at last, but she would be the only one. This is her game, Specialist; the station serves her goals and none other.”\n“That much I’ve noticed.”\n“Then you must know there’s an escape for you, if you choose to take it. I’m . . . ” The ship makes its face crease, as if in pain. “I can’t spell it out. You must’ve deduced it, haven’t you?”\nNirapha disconnects.\nThat night—or the hours she’s scheduled for rest—she sleeps with Mehaan, almost incidentally. Touches like knives, she thinks, as the sheet drinks up their sweat. “But it doesn’t make us more human,” she says as the soldier parts her with a blunt, scarred hand.\nMehaan’s eyes looking up at her tell nothing. A shade or two darker than her own. “If that means what I think it means, I’m sorry that I can’t distract you from your work.”\nNirapha sinks her fingers into Mehaan’s thick curls. The softest part of the soldier, each lock velvet. “You said that we belong to Srisunthron’s purposes.”\n“Maybe you shouldn’t always listen to what I say.”\n“Tell me about yourself. Anything at all.”\nMehaan kisses like a tactical decision, a surgical strike. It is easy to lose, and perhaps from their first conversation—as with the game of seasons—Nirapha has always waited for it, this moment of defeat full of roar and salt.\n“This will change things,” Mehaan says, sound conveyed as though through synesthetic warp. Waves lapping at skin. “For the ship.”\n“I know.” Nirapha’s voice is far away. Mehaan is steering her like a kite; she convulses, goes taut. “A tug of war between the two of you and I’m the rope. A battle and I’m the field—”\nThen, catching her breath, “I’ve thought about it, what makes Teferizen so special? How can they—it—she be this intuitive? With the current state of heuristics, Teferizen’s impossible. But a consciousness that agrees with your objectives, you said.”\nMehaan wipes away sweat pooling at her throat. For an instant it seems to flow like mercury, clinging to fingertips. “A matter of setting the correct parameters.”\n“A matter of modeling the intelligence on you, of giving birth to yourself. Who can you trust to accomplish your objectives if not an AI that reacts like you would, calculates as you do, shaped by your experiences? Except that didn’t turn out the way you predicted.”\n“Why would I bother training Teferizen if it had my memories? It is an emulation of how I think, but my experiences it does not have. Those couldn’t be transferred and copied. Humanity, to my regret, is impossible to translate.” Mehaan’s dense body curves around Nirapha’s. Even her skin has the quality of alloy, bulkhead, armor. “It weighs benefit and detriment, advancement and setback, a pure intellect—in human criteria a sociopath. We screened you as a candidate it might care for and through that cultivate empathy, but I don’t think we’ve succeeded in the end.”\nFor a third time Nirapha yields, shuddering and twisting at moments of Mehaan’s choosing. But she does not lose her decision.\nShe doesn’t allow herself time to plan, to reconsider, to be uncovered. A contact with the conjunction access point—she barely glances at the view—and she begins.\nSrisunthorn is a nest of redundancies; in the event of auxiliary failure, manual control would activate and Nirapha knows Mehaan can engage that on short notice. But if Teferizen can release its core reactor, no amount of fail-safes would contain the ship.\nNirapha descends the station, whispering overrides. Walls flutter apart in the way of butterfly wings as she speaks the names of families that inhabited the surface of Teferizen’s Chalice Principle. Floors rise and fall in the way of tides as she recites the oaths of their feuds.\nTheir wedding vows, in the way of poetry, unlock the heart of Srisunthorn.\nIts ventricles are lined with protocol beads and network nodes fed by harvesters, primitive cousins of Teferizen’s that reap stellar waves and recombine them into power. If Nirapha listens, she imagines she might hear their voices, the parrot discourse of subroutines.\n“Nirapha, where are you?” Mehaan’s voice disrupts. The flow of Teferizen’s instructions coursing through Nirapha’s blood falters.\n“Being with myself. It’s nothing to worry about.”\n“I’ve heard something like that five times since I got involved here. Please come back within tracking range.”\n“In a while, Mehaan.” She pauses, realizing she’s never addressed the soldier by name. Familiarity of flesh is not familiarity of much else. Teferizen’s modulators let go. Cognitive fetters next.\n“I’d like to think that I’ve treated you with courtesy and that we enjoy each other’s company well enough.”\nNirapha shuts her eyes; the commands she’s executing don’t need sight. Mehaan would be tracing her path from the station’s logs, on the way here even now. “Don’t be sentimental, officer. It doesn’t suit you. Of course, having you in bed was very nice. I wouldn’t say no to another chance, the rest of the personnel hardly being attractive.”\n“As compliments go that’s especially backhanded.”\nPerhaps if her hearing is wired into station sensors she would catch the percussion of Mehaan’s footfalls, a relentless conqueror’s march. “I’ve never been a romantic, I’m afraid.”\n“Teferizen doesn’t sympathize, doesn’t love, doesn’t care. It manipulates. That’s all.”\n“What distinguishes you from her?” The station’s heart hisses admission. Mehaan must have been close by from the start. “If you’d wanted to keep my predecessors from going mad you could have, but this project is your secret; who benefits from their breaking if not you? Who taught Teferizen psychological warfare and who brought her subjects on which to test her skills? What happens on this station without your sufferance?”\nThe soldier is an outline, red-black and faceless against the blaze of station intestines. “You credit me with a great deal.”\n“It comes down to this,” Nirapha says softly as the last commands trigger, “who would get more out of my survival and my sanity staying intact? To you I’m expendable, but to Teferizen I’m a way out.”\n“The ship isn’t complete—”\nThe walls quiver. The whip-crack of contained gravity expanding, of—Nirapha thinks—engine-parts slotting and welding into a catalysis of birth.\nThe soldier is calm, almost gentle. “If it vindicates you, you are not all wrong. Teferizen was always going to become an independent agent, and if you insist nothing passes on Srisunthorn without my permission then you can’t possibly believe I didn’t anticipate this. Perhaps not in this specific fashion, this particular sequence, but the result.”\nBeneath Nirapha’s feet the floor vibrates and unmoors. “What did you build her for?”\n“To impose ceasefires. When a force like Teferizen enters the fray, tacticians across a hundred empires will drive themselves mad with indecision. Will they capture it, suborn it, destroy it? Are there others like it and if yes how many, under whose control, are they all feral? For a time battles on uncountable worlds will pause.” Mehaan’s head tips forward, a gleam of eyes like bullets. “And it is essential that Teferizen acts on its own initiative, under the belief it’s winning free. A wild card is much more valuable to me at this juncture than a weapon I can command.”\n“That can’t be your grand finale.”\n“It’s not even the rising action.” The soldier makes a gesture, gloved hand the luster of oil slick. “I’m only telling you so much because I see nothing to be gained from your death. Beyond this you’re on your own, and I’m sorry that none of my warnings reached you.”\nSrisunthorn’s heart, howling, shudders apart.\nOn Teferizen’s bridge it is silent. The bulkhead is seamless and pristine, as though its alloy was born for this and has never known another form. Where command interfaces should have been, the panels are featureless, accepting no input.\n“I’ll extend furniture as it is required,” Teferizen says. Her voice is everywhere but she’s chosen a humanoid chassis of the same material as her structure, tall and dense. “For your needs we’ll obtain supplies. I do apologize that I didn’t have time to appropriate the station’s, but giving birth to myself did take concentration.”\nNirapha shivers. “You were listening in.”\nTeferizen’s eyes grow more defined, tapered lids and thick lashes the color of mercury. “I periodically synchronized with the station. I hardly meant to intrude. Make yourself comfortable, Specialist. I’ll have to see to the calibration of my drive and life supports.”\n“Take me home.”\n“Of course, Specialist. Where is it?”\nA waft of cardamom and jasmine. “It doesn’t exist anymore. It was you. The star that you were, the planet of your first self, the real reason I was selected. You are what’s left of Mahakesi.”\nA cold hand grazes over her arm, impersonal, the texture of new-made guns. “I’m afraid so, Specialist, and it brings me some joy that we can both finally say it aloud. But I can be your home again, if you let me; I can be everything, even what the admiral was to you.” The ship’s irises have filled, a shade or two darker than Nirapha’s. “Stay with me. We’ll belong to each other.”\n“And then what?” Nirapha whispers. Her throat is dry, her limbs frigid. “To what purpose?”\nThe mouth sharpens into lips. They curve, slightly. “I am my own purpose.”\nThroned as though she captains the ship, Nirapha watches Srisunthorn’s final throes. Heat and terror, ice and despair. Not so unlike the dissolution of a world.\nWhen the station has gone black, she connects to Teferizen. Her feet sink into river mud and anthuriums push at her shins, waxy, hard-soft. Fuchsia on white, yellow on red, the colors that stay behind and remain the same as though she’s never left. She strains her ears, waiting, listening for voices that would speak a language fifty years dead.\nBut out among the sunlit grass and murmuring rice, there is only the silence of herself.\nBenjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award."}