{"fingerprint": "xrrjB/nRiN54WiHy5p4QHjBItEY=", "sitename": "Clarkesworld Magazine", "title": "The Occidental Bride by Benjanun Sriduangkaew", "author": "Benjanun Sriduangkaew", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/sriduangkaew_09_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Occidental Bride by Benjanun Sriduangkaew", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6640 words, short story\n The Occidental Bride\n New Year: the train eels along a landscape of red snow and shadow-dust, on carbonate tracks haloed in anemic light. Heilui keeps half the window opaque to block out the field of endless machine-dead, the sight of satellites pressed against the skyline like bruised mouths on a gash. The other half she fills with a news feed: disasters in montage, kaleidoscope of calamities—cities gone dark and still, streets turned to web-cracks and sidewalks impact-raised into briars, balconies smeared in blackened lymph and rust-red blots.\n She has watched it many times; has been made to, during the interrogation. The footage never fails to pull at her heart like the moon exerting its gravity on the acid tides. Pulling at her like the questions from back then, the faces and names lined up and Did you associate with this woman? This man? This woman? This man, this man, this man.\n Heilui’s hands are clammy with the sweat of remembered terror, the memory of teetering on the edge of freefall. She wipes them dry. Her lap is heavy with gifts prepared by relatives: engagement boxes of jade bangles and figurines, silk slippers threaded in gold, a bag of crystallized fruits. A kintsugi bowl: black pottery broken and mended in silver, the seams radiant with age. Foreign antique, contributed by a wealthy adventurer aunt.\n The train notifies her that another passenger will be joining her, transferred after one of the carriages have detached for another station. She sweeps up the gifts and blanks out the news feed.\n The compartment opens in a murmur of dry, rustling leaves. A young man takes the seat opposite, giving her a respectful distance. They exchange small talk: he is heading southwest for a research lab, armed with a postgraduate grant from the University of Rajamongkol.\n “And you, older sister?”\n She cups her palm over the antique bowl, fingering its chimera texture, rough earth striated with the velvet smoothness of precious metal. “I’m on my way,” Heilui whispers, “to meet my bride.”\n The Institute, the halfway house, sits ensconced in the hothouse hill: mantled in rough foliage, insulated from the machine ruins and their radiative hunger. This close, ignoring the wasteland of charred clay and half-alive intelligences is impossible, though Heilui tries to focus elsewhere, lash her attention to the interior of the car and the imminent appointment. Some of the interference nevertheless slips through, crooning ancient lullabies of wars eons gone, status dispatches from combat centuries ended. Some are foreign, some are in Putongwa and Fukginwa. Others are in Dakman with a smattering of Yingman recounting casualties. Strange-sounding names crowd in a white-noise fog, synthetic and toneless.\n Within the Institute’s walls the wasteland sky is blocked out by a seashell husk, bred into immensity to shield the entire compound. She is received at the gate by a guidance routine taking the form of a red-beaked crane. It gives her directions in a perky tourmaline voice and instructs her to avoid contact with candidates other than her own. Heilui is glad to comply, though she does steal glances at the manicured topiary and moss-ridden trellises, the small gazebos and polished benches. Young women and younger men, ghost-pale and exotic, in muted cosmetics and pastel dresses. They drift eyes downward or sit prim and quiet. She can’t spot any of them in conversation with one another; they arrange themselves as though hyper-conscious of an audience.\n The crane guides her to a private vestibule, where a low table waits with tea and covered wicker baskets. Heilui lifts the lids to find radish pastries and steamed red-pork buns. She doesn’t sample either; no point leaving crumbs all over herself and marring that first impression. Instead she stacks up the gifts. Briefly she wonders if she should have brought a bouquet—the culture of her bride’s birth values flowers as a courtship sign, though she imagines their bouquets must be as translucent as their people, frosted leaves and ivory petals, flora gone extinct when that continent heaved and broke.\n It is then that the crane starts speaking in her interrogator’s voice. Heilui nearly leaps out of her seat.\n “Relax, Doctor Lan,” says the interrogator, that same mild contralto she remembers. “We chose you for the case because we believe you better equipped than most to manage her. The subject has been neutralized entirely and you needn’t fear that she will be a danger.”\n “I’ll do my best.” Heilui licks parched lips.\n “This isn’t a test, though when the operation concludes successfully your profile will be cleaned up. No longer a person of interest, no more record of your unfortunate—but entirely innocuous of course, as you’ve proven—association with occidental terrorists. Good luck.”\n The line cuts. The vestibule’s partition folds aside and Heilui’s bride enters.\n Kerttu is tall and large-boned, as her people often are, bred in a land of giant-myths and arctic blaze. In echo of this image her hair is pale as snowdrift. Eyelashes mascara-gilded, eyelids faintly dusted copper, cheekbones accentuated to skeletal sharpness as though to compensate for the unreality of her pallor. The only spot of color above her neck is the fuchsia on her lips, applied to hone the corners of her mouth to crisp edges. Her bodice is closely fitted, the sleeves gradating from peach to oxblood cuffs, the skirt narrow and long: the colors are some of Heilui’s favorites, the style close to what she might herself wear. The Institute has been attentive.\n So ordinary, Heilui thinks, and tries to visualize Kerttu as she once was—in a lab coat, imperious over her empire of living matrices, her gleaming hives of bioweapons. But she can’t quite picture it, this woman as the engineer of genocides.\n Kerttu gives an antique bow, one fist cupped inside her palm. “Happy new year, Doctor Lan.”\n “Heilui will do, please. Sit. Have you eaten?” She nods at the dishes, wondering if Kerttu can use chopsticks. “Your Gwongdungwa is excellent.” An odd, piquant accent but she’s hardly going to criticize.\n “You honor me. I’ve had fine teachers.”\n A conversational dead-end. “Why don’t you tell me about yourself?”\n One long, slow blink. The occidental woman’s pupils are unnervingly black, emphasized as they are by irises the hue of jellyfishes. “Why did you pick me, Doctor?”\n Heilui turns the teacups upright. Pours. A distinct scent of plum rises. “Perhaps I spotted you in the Institute database and recognized destiny at first sight.” She pushes a cup over. “In Jatbun, they say that a red thread joins fated partners and you only need to pursue it to the other end. When you find yours, at once you will know it—the tug in your blood through your thumb as your fortune draws taut as pipa strings.”\n Kerttu curls her fingers around the teacup without flinching from the heat. “I don’t think it was my looks. There are others here younger than I am, more aesthetically pleasing. Is it the novelty of having a former mafia researcher and tamed war criminal for a wife?”\n “You are a person, not a novelty object,” she says. “The Institute recommended you, I thought it a fine suggestion, and I’m under some pressure to wed.”\n “Many factors affect the making of a purchase. Desirable attributes go on one side of the scale, the price tag on the other. This is perhaps the most honest form of marriage.” Kerttu sips gingerly, her expression pinching at the sourness, the unfamiliar. “Is that why you opted for the Institute instead of selecting from your peers? Though I think the latter might have been cheaper.”\n “I wanted my options from a different pool, and I chose you. Is that not enough? You can say no.”\n “I won’t.” This is said quickly, breathless like a gunshot.\n Heilui holds out her hand. “Shall we try to make this work?”\n Kerttu takes it, and with those painted lips kisses Heilui’s fingertips one by one.\n They marry on the train, the world’s ruin rushing past in silent witness. Kerttu hands over a fistful of gold earrings as though they burn her and, with detached grace, accepts the small mountain of dowry. She puts on the one bangle large enough for her wrist as the portable altar officiates: simulated incense and ancestors, two-dimensional gods rotating to give them blessings—mercy, prosperity, fertility. Kerttu’s identity rearranges itself to Lan Kerttu, alphabet to calligraphy.\n “There’s usually much more ceremony,” Heilui says, apologetic, “and nine courses of food. And your family would see you off . . . ”\n “This is fine.” Her wife cradles the kintsugi bowl, thumb running laps around its rim. “The last wedding I attended was a conflagration of opulence with a twenty-course banquet—one could die of abundance, asphyxiate on splendor. But it also involved people getting shot in the head and a couple of poisonings, though at least both grooms were unscathed. I also haven’t had a family since I was six.”\n That factoid Heilui knows, though she can’t conceive of being kinless. There should have been relatives to raise her, a small herd of uncles and aunts and in-laws. “How did you like the Institute?”\n “All of us hid our old lives; we never discussed our history and if we recognized each other from before, we pretended ignorance. Many of us wear scars.” Kerttu holds up her wrists, showing them unmarred and smooth, and points at her throat: just as clean, all the access points to arteries without scars. “Not me, though. I’ve never been able to stand the sight of my own blood, the weight of my own pain. What we discussed all the time, where the cameras didn’t reach, was our prospective clients. Who they might be, what sort of services we might be required to provide. Until a week ago, Doctor, I had no inkling of who you were.”\n “I’d have liked an introduction sooner, but their protocols are so strict. They did treat you well?” A needless question; the Institute keeps its charges in the greatest comfort.\n “I never wanted for anything.” Kerttu sets the bowl aside. “Aren’t you afraid of me?”\n The subject has been neutralized entirely. “Why would I need to be afraid of my bride?”\n In good time they arrive home, a complex of four tapered serpent-buildings wound loosely around a central hall. Redwood columns clad in bismuth crystal, flat roofs topped in gunmetal tiles, a modest lake: from what she knows Kerttu lived in more sumptuous arrangements, a spider citadel of phantasmagoria matrices and psychedelic weave, but her wife nevertheless widens her eyes as they disembark. “How many live here?” Kerttu asks softly. “I thought you only lived with your family.”\n “I do. Extended family. Isn’t that the way it’s supposed to be?” Heilui pulls up a layout of the estate, cupping the display in her palm like an egg of enameled rime. “The southwest hall belongs to my grandparents and some great-grandparents, the southeast one—oh, Aunt Daruwan lives there but she’s not in. Probably off unearthing crash sites or mapping crisis regions, you’d like her. Here, we’re in the northeastern one, the Tangerine.”\n By luck it is dinner hour, most of the family is assembled in the communal hall. No one is there to crowd in and overwhelm them when they enter the Tangerine’s sunset corridors. Kerttu’s luggage trails behind them, as silent as its owner. Even her suitcases are Institute-mandated for refinement, matte-black leather and copper filigree. Heilui suspects that when they unpack, Kerttu’s wardrobe will precisely match Heilui’s tastes. That is something she will need to remedy—a trip to the city, a stop at a tailor’s boutique. The Institute is exacting and thorough in how it molds its charges, but that level of micromanagement bothers her despite the brittleness of all this, the fraught weight of Kerttu’s presence.\n Heilui’s segment of the house spans three units, study, bedroom, and a simulator box where she does most of her work. “I’ll get you your own bed.” She gestures at a modular divan. “Until then, I hope you won’t mind that?”\n “You don’t wish me to share yours?” Kerttu absently pets her luggage, but her attention is on Heilui. A smile grows on her lips, like weeds, like thorns. “I would, sincerely, find it no chore.”\n Talons of heat sizzle on the back of Heilui’s ears. “Please make yourself comfortable. The bath is down the corridor.”\n “Thank you.” Kerttu twists apart the sleeves of her dress as though about to disrobe on the spot, casting off the fabric the way a snake molts. “May I ask a question?”\n “By all means.”\n “What did I cost you?” She is loosening the collars. A glimpse of clavicles, nearly paper-white, veins shining through. “I know that no money changed hands; the Institute takes currencies much more nebulous. But there is an essential truth that governs existence, greater and stronger than any force, and it is that on every object there is a price. What was mine?”\n Heilui laughs, faltering. The dress recedes and a shoulder comes bare, rounded and marked with a tattoo that declares Kerttu’s former allegiance. Butterflies congregating on a corpse, proboscises sipping sweat: the crest of a cartel, the symbol of ownership. “It’s more complicated than that. We could discuss it one day. Tomorrow I’ll introduce you to my family.”\n At breakfast, everyone convenes to see the foreign bride.\n She sits like a mannequin of frost and plaster, consuming porridge and condiments as solemnly as a funeral meal. The Lan children gawk at her openly; one of Heilui’s youngest nieces whispers—audibly—speculating whether Kerttu’s pallor might leave white smudges on the utensils and tea-bowls; whether it might rub off on the furniture like icing. Their parents shush them, but adult scrutiny is hardly more discreet. Heilui’s mothers regard Kerttu with pointed appraisal, no doubt already cataloguing many faults and improprieties.\n On her part Kerttu behaves as though she is by herself, facing an empty room, the round ivory-and-teak table all her own rather than occupied by fifteen. Occasionally, as though she is remembering from etiquette training, she puts food on Heilui’s plate—a knot of pork floss, a slice of yaujagwai. This is done stiffly and gingerly. Kerttu, Heilui recalls, wouldn’t be used to sharing food this way; where she came from each person keeps to their own dish, even among family and intimate friends.\n Heilui makes desultory conversation and asks after Aunt Daruwan. She knows that once her family can corner her alone she’ll be barraged with questions; she has told none of them of Kerttu’s background, allowing them to believe that her choice of spouse is conventional and untied to any state interest. Already an uncle and two cousins are bombarding her with messages. She mutes the notifications and, at the first polite opportunity, excuses herself. Kerttu makes her obeisance, courtly, to family elders and follows Heilui’s suit.\n They find a spot by one of the garden gates, behind an enclosure of hybrid bamboos and ceramic partitions. Kerttu arranges her skirts—fuller today, loosely made; another style Heilui herself likes—and folds herself like a paper puppet. “Am I making things difficult?”\n “They’ll come around, everyone just needs time to adjust.” Heilui silences another message, unread, and extends her palm. “Here’s a prototype I’ve been working on. Very unfinished, more a framework than anything.”\n “It appears to be an anthropological modeling program.” Kerttu tilts her head. “Not my field, Doctor. I was a biochemist.”\n “It’s a sim of the shattered continent. I’ve been ambitious with the scope and detail, so I would like—” She gives a laugh, makes a helpless gesture. “An authenticity check, maybe? I’ll get you your own shell, it’s last-generation and I haven’t upgraded it for a while, but . . . ”\n “It was a research subject that you required then, not a spouse.”\n “Not at all!” Heilui says quickly. “Why don’t we go into the city? You can pick out your own clothes.”\n “You’re treating me extravagantly for a person you purchased.” The biochemist turns the shell this way and that, her painted nails a shock of aqua against her phantom skin. “I’m not saying that to be judgmental or bitter—I’m neither; I’ve been owned since I was young, treated as investment, my intelligence bought and traded for. I understand my position perfectly. There’s no need to woo me. Ask and I will serve.”\n A frisson sings through Heilui, chased by a wash of nausea: for a moment she could understand the sick supremacy of commanding utter, total power over another human being. “Come on. Let’s get you to a tailor.”\n She loads her spare shell with the modeling client and turns that over to Kerttu, who engages the program with the rapt concentration of a sniper on her target. When they reach the commerce arcade, Kerttu looks up blinking as though jolted from a trance. She folds the shell away and surveys the velvet web of shops, the walkways weaving through them like ribbons. Tension pinches her expression as they join the crowd’s flow, families in New Year finery, children and young couples out to spend their red envelope money.\n Surreptitiously, Heilui searches the faces around them for a trace of the foreign, perhaps a declaration of suspicious intent etched into the downturn of a mouth, sewn into the hem of a skirt or sleeve, a glimpse of the butterflies emblem. But she finds nothing, sighting no set of features that is not everyday and ordinary to her, no complexion as startling as Kerttu’s or a nose so angular. She does not find the man who slaughtered countries, the man who once owned her wife.\n “Something’s making you uncomfortable.” Heilui loops her arm through Kerttu’s. “What is wrong?”\n “I’m the only foreigner here.” Kerttu has switched to Dakman, harsh and rolling.\n “Oh, you don’t need to worry—the staff here is perfectly used to foreigners. There are expatriates all over Kowloon, of every nationality you can imagine. I’ll put you in touch with them, if you like.”\n “By law I’m forbidden from making contact with those from the shattered continent, just as I’m forbidden from pursuing my previous specialty. I’m wearing certain implants to ensure my compliance. I appreciate your thought, Doctor.”\n At the tailor, Kerttu is imaged by a dozen mannequins that revolve slowly on their feet, laughing and animated as they flicker from style to style, season to season. In the end she chooses a postmodern keipou, unpatterned black sheathing her like carapace. Sleeveless, high crescent collars, unrelieved contrast between fabric and complexion making a monochrome print of Kerttu. “I lost much and there was never a funeral,” she explains the color. “I need to mourn. I expect I’ll always be mourning.”\n But this, like everything else, is said with distance as though discussing someone else’s grief.\n Their next stop is the Shau Kei Wan Temple, where Tinhau presides. Not the most traditional choice when it comes to matrimony, but Heilui has a special fondness for the sea goddess, and this temple is one of the few where Kwunyam is depicted in her male aspect while the war god Kwantai is presented as a woman: green-robed and armored, puissant with restrained fury. Heilui shows Kerttu the correct paper offerings to make, the right number of virtual incenses to ignite. They shake kaucim cups side by side, have the cast of their fortune read by streamed oracles.\n It belatedly occurs to Heilui, on their way back, to ask Kerttu if she is a monotheist. Her wife shrugs, a peculiarly foreign gesture. “My faith rests in the belief that the human capability for innovation and malice is infinite. I admit no other gods, pray to no other pantheon. I’ve never been disappointed.”\n Back at the Lan house they are ambushed at the gate, a gaggle of nieces and nephews swarming over Kerttu. Heilui presses a sheaf of red envelopes into her wife’s hand, each filled with account chips. “One per head,” she says, grinning. Under the shade of a butterfly tree, one of her mothers is waiting; she knows what that look means. “Don’t let them get greedy. Make them say the magic phrase first.”\n Kerttu holds the envelopes loosely and stares in bemusement, to a high-pitched chorus of gong hei fat choi. Heilui draws aside to join Mother Meitin under the fluttering, winged canopy. “We need to talk.” Meitin does not quite glance sidelong at Kerttu. “About . . . that.”\n “She’s not a that, Mother.”\n “Are you going to have children with her?” Meitin frowns. “They’d turn out looking rather dead. And her table manners! I thought the Institute had the foreign ones trained well?”\n “She will adapt.” Equivocating. “And she is unique. I don’t think I could have found anyone like her at the university or through any of your friends, or . . . ”\n Her mother sniffs. “An acquired taste, I’m sure. Well, your choices are your own and you’re a woman grown. At least she’s educated, I suppose.”\n Heilui refrains from pointing out that as a biochemist, Kerttu’s credentials are more impressive than most. Instead she watches her wife keep the envelopes out of the children’s reach in one hand, distributing them with the other to the niece or nephew who has approximated a correct pronunciation of Aunt Kerttu.\n Over the next weeks Kerttu drifts uneasily within the family home, colliding with or grazing past elders. She does not succeed in endearing herself to them, though Heilui notes with relief that the children have taken a liking to Kerttu, for her occidental novelty if nothing else. Any time she has a free moment, Kerttu would obsessively spend it on the simulation.\n Heilui monitors Kerttu’s progress, trying to use the map of her wife’s virtual wanderings to create an image that would pierce the inscrutable, remote shell. A crucial piece that would make the Kerttu she is seeing cohere with the Kerttu the mass murderer who created weapons that destroyed the shattered continent, the war criminal. Often she thinks of asking, Did you understand what you were doing? At the beginning, she mustn’t have, a prodigy whose supple intelligence was exploited, whose mind was slowly conditioned to regard her work as normal.\n Even then it is difficult to be afraid of Kerttu, who inhabits Heilui’s life with the soft focus of a ghost. Difficult to connect her with those atrocities, the solidity of statistics and the hard industrial edges of war. But then it is difficult to connect the shattered continent—smooth and pretty while it lived—with its history of dialects born and annexed, its first contacts negotiated through a language of exploitation and expansion.\n “You’ve been distant. Am I boring you?” Kerttu asks one evening as they share a dinner out in the city.\n “Certainly not,” Heilui says, laughing. “You have been nothing but delightful.”\n Kerttu cuts her pasta into fine, thin slices, scraping off the layer of plum sauce. The restaurant purports to serve the cuisines of the shattered continent, though perhaps less authentically than Kerttu is used to. “I don’t think your family would agree, though I’ve made efforts.”\n “My family is your family too.” Heilui rests her chin on her hand. “Some of them you’ll never win over, it’s just how they are. There have been feuds where siblings couldn’t forgive each other on their deathbeds. Lan elders are hard to please, no doubt about that.”\n “Except you are harder still. You haven’t . . . ” A frown. “You haven’t asked anything of me. Yet you must have bought me to fulfill a function, and I don’t think it’s to satisfy the fantasy of possessing a person whole and entire. You haven’t done anything to exert your ownership.”\n “I like you just the way you are. Is that so hard to believe?” She glances at her shell, taking a sip of honeyed lime. Expecting to hear her interrogator’s voice again. Even today she remains ignorant of the woman’s name or rank. Black ops. Counter-terrorism. “Would you like to try the simulation in immersive mode, Kerttu? You need a headset and will have to plug into the server I’ve got at home. Not perfect, but perhaps . . . ?”\n Kerttu’s breath hitches, audibly, as though that idea has shocked her pulse to a halt. “I would love nothing more. You do me too much kindness.”\n “Not at all—we’ll immerse together, yes? You can grade me on the simulation.”\n Several nights later, she starts awake to a hand over hers, long-fingered and tentative. Blearily she sits up to find Kerttu kneeling by her bed, a shadow dressed in gossamer lace. “Doctor.” Kerttu’s voice comes petal-soft. “Will you invite me in?”\n Wide awake now, Heilui rubs at her eyes and stares at her wife, then at the bed on the other end of their shared room. “I think you misunderstand. I’m not—what’s between us doesn’t have to be a transaction, not like that.”\n Kerttu’s hand withdraws. “I should earn my keep, my care. I have said before that it’s no ordeal—unless I hold so little appeal?”\n “It’s not that.” Heilui scoots inward, making room. “Come in. We can sleep together, in the most literal sense.”\n “Like sisters?” A trick of filtered moonlight makes it seem as though ice crystals have caught on Kerttu’s eyelashes. A snow-woman of Jatbun myth, visiting in the night to drink her lover’s spirit.\n “Like wife and wife. Not all marriages need to be heat and desire. Or at least that’s not what I want. If it’s what you . . . you can find others for that. I wouldn’t mind. But for me—”\n “Oh.” Exhaled surprise. “I see, I think.”\n Kerttu climbs in beside her, awkward, hesitating. A sigh loosens from her lips as she settles in against Heilui’s warmth and her arm snakes over, one hand splayed on Heilui’s stomach. “Is this all right, Doctor?” Asked as though she fears she might singe Heilui with that much contact, that much closeness.\n She laces her fingers through Kerttu’s. “It’s lovely.”\n They spend the night like that, entwined. They spend the next likewise, and the next after, learning the rhythm of each other’s breath, the curve of each other’s spine and the width of each other’s waist. A nascent dialect of touch, a first contact negotiated through comfort. A slow formation of matrimony like the founding of a country, while Heilui swallows back the secret code of guilt.\n The first time they stand in front of the server together is a clear morning where icicles crackle on the window like chimes. The simulator box is built of blueshift alloy, radiant with cold, an artifact of the world’s ruin and its eternal winter. With a command Heilui logs in and draws out two headsets. One she turns over to Kerttu, the other she slips around her own temple, a mesh with the texture of satin.\n “Anything particular you’d like to see?” she asks.\n “The city.” Kerttu touches the headset’s lattice. “The club.”\n Within the offspring of Heilui’s thought, cities throng the shattered continent like firmaments lit up in their thousands. But she knows from watching her wife which one Kerttu means—the city of her birth, the capital of her native land.\n The program pushes under their skin, flares across their senses, a susurration of colors and ice. Then they are side by side in the Tavastia, backstage. Darkened interior, hexagon walls dressed in facets and prism coins. Overhead, mannequins sway gently, many-jointed arachnid limbs painted in patterns of cracked granite.\n Kerttu pushes at the mannequins, making them clack. At her height they are in easy reach; she strokes their bald heads and thumbs their ovoid eye sockets. “My mother always longed to sing here. I don’t remember her face, her voice, even her name. At six she sold me to the syndicate. I fetched a good price—a mind such as I own doesn’t come by every day—and I wonder if she ever got her wish, to perform on a Tavastia stage. The first ten years I was kept entirely in the citadel to be imprinted for loyalty. By the time I was allowed to leave, she was gone. Or didn’t want to be found.”\n “I’m sorry,” Heilui says before she can stop herself.\n “No need, Doctor. My mother, she wasn’t an educated or well-off woman. The syndicate gave me a life of ease and refinement, my intelligence nurtured and honed to its utter best. Had my mother raised me according to her means, today I’d be just another refugee in the camps, if I even survived.” Kerttu clasps her hands behind her back—in the virtuality she wears not her grieving black but a peridot shirt and gray trousers, an overcoat in duochrome indigo. “There are no people here.”\n She follows her wife to the stage. It is full of unmanned instruments made from jagged blades and razorglass tendons. The floor is strobe-lit but empty of dancers; puppets sit by the side, prim and inanimate. “Anything I populate this world with would just be automatons—as complex a set of heuristics as I can buy, but they wouldn’t emulate human behavior with any degree of verisimilitude. I’ve thought of modeling you, actually.”\n “I hope you’ll agree that it is not hubris but fact that makes me point out I’m not exactly a population average. Not culturally, not in disposition, not in politics. Modeling those from the camps would likely yield better results.”\n “A population comprised entirely of averages would be terribly unrealistic, but I take your point.”\n Kerttu tugs at her sleeve as though to test whether the physics engine holds up to scrutiny. “I have a request to make of you, Doctor. You may believe me ungrateful—”\n “Please,” Heilui says. “I’ve no reason to think that.”\n “May I go into the city on my own? I wish to familiarize myself with its ligatures and arteries, to find my own path climbing its ribs and vertebrae all sharp with salt. I wish to know this island where I will spend the rest of my life as your wife.”\n Heilui’s pulse picks up. “You hardly need my permission. Your shell should be loaded with guidance routines, but if you run into any trouble you only need to call me.”\n “You are far more generous a client than I could ever dream of.” Kerttu makes again that ancient bow, as elegant as it is incongruous with her outfit. Heilui realizes with a start that no matter the correctness of her gesture, no matter her fluency in Gwongdungwa, Kerttu will never fit quite right.\n On Kerttu’s initial excursions, Heilui refrains from trailing her. Her wife comes home late each time; Heilui never asks questions and simply waits in bed, her arms bangled in moonlight. When Kerttu has bathed and changed she would come to card her fingers through Heilui’s hair, root to tip, until they fall asleep.\n It is on Kerttu’s fifth outing that Heilui tracks her—a bite of conscience, a twist of shame. She monitors her wife’s wanderings through markets that snake up pagodas, through secret streets behind amber pavilions, past the honeycombs of waterfront gardens where hybrid peacocks strut in sunset trails. Heilui tells herself Kerttu is monitored in any case, but she can’t get rid of the certainty that she’s committing a small betrayal.\n When Heilui at last follows her wife in person, it is down the harbor where beaked ferries knife the waters to white ribbons. She sits on the mezzanine of a floating restaurant, watching the world through sea spray. Watching as Kerttu enters the planetarium in her black keipou. Soon a man in the same shade follows her. Tall like Kerttu and just as colorless, a creature of her race and nation, raised on snow nova-bright. Heilui studies him: he is gaunt to the point of starvation but well-dressed, hair a few shades darker than Kerttu’s, a skull of cadaverous planes. In the Institute, no doubt his caretakers would have warmed his features with cosmetics to make him less startling to prospective clients.\n The two do not leave together; the man lingers behind, his gaze intent on Kerttu as she exits. From this far Heilui cannot appraise his expression—those harsh angles make him, like Kerttu, difficult to read—but she thinks he seems painfully lost. As much as a dangerous terrorist can seem lost. She tries to imagine him as the shadow behind assassinations of heads of state, the shadow behind the sales of private armies and weaponry and untold destruction. But as with Kerttu, she can only see an ordinary man. Foreign, but merely mortal. He doesn’t even sport the corpse-butterfly tattoo anywhere that she can glimpse.\n A wanted man who surfaces, exposing himself, just to retrieve Heilui’s wife.\n The second time he comes for Kerttu, it is on a rooftop maze.\n An art installment writ large, the maze is composed—syllabaric symphony—of elemental strands: wood and metal, fire and earth, and water to complete the quintet. Batik lions move against jade tortoises on a steam tapestry. Patchwork topiaries flourish on inked wires and luminous nesting dolls. Guidance materializes as a calligraphic girl, torso and limbs all made of brushstrokes, shedding proverbs and verses to give Heilui directions. She waits for the creature to begin whispering in a mild human contralto, but it remains only rote and routes. Overhead, starlings flit from candle-roof to platinum bough.\n By the time Heilui reaches Kerttu, the girl is down to quartered ink and halved characters.\n She takes cover behind a spread of bronze longma and marble rabbits. And there they are, a tableau like theater-dolls awaiting an audience: he a statue in black from neck to ankle, elongated limbs sheathed in crisp, expensive tailoring. Kerttu is seated on a bench of braided rime and gridded kites, her hair a pale corona. As if given life by Heilui’s spectating gaze, Kerttu stirs to motion and turns away from him. On her lap she holds the kintsugi bowl. “Yes,” she is saying, “I imagine the bowl holds enough genetic material with which to forge identity templates and authenticate my release from Institute trackers.”\n “Good.” His voice is a scratch of stone chipping at wood. He runs a knuckle down his lapel, smoothing the impeccable fabric, a nervous tic. “That should suffice. I’ll contact you again when I’ve made the necessary arrangements.”\n “No.”\n The man’s hand slows then goes still, as of an automaton winding down. “Are you afraid, Kerttu? I’ve never known you for a coward.”\n She looks up, her gaze ensnaring his, the gravity of a pyre drawing in moths. Heilui has learned her wife’s moods and in that moment she knows there’s no hesitation. Kerttu’s corneas seem like lamp-glass to a flame, small but absolute. “I’ve never been afraid. I’m just not leaving with you.”\n A gunshot like a soldier’s final breath. An eruption of starlings, crying out.\n The man falls, too fast for someone who should be bird-light, for a body that ought to float like gossamer or shredded ghosts. Where his blood touches Kerttu’s clothes it does not show; where it lands on Kerttu’s head it beads ruby-vivid against the snowdrift of her hair, the white slope of her brow.\n Bursts of communication, armored men and women spilling from between the maze’s strands: a rush of black, acid tides. They collect the man’s body, quick and efficient, folding him into a casket. A puppet returning to its box.\n Between all this, Kerttu’s expression never changes, as though his death belongs to someone else.\n A day later, Heilui receives a copy of her dossier. It has been wiped clean as if nothing has ever happened, as though she’s never been made to sit shivering in a metal chair, to answer question after question. To single out faces for betrayal. The copy deletes itself after one read. She doesn’t hear from her interrogator; she doesn’t expect she ever will. A vulgar touch—several sums transferred into her account, absurdly large, acrimoniously transactional. She doesn’t return them, knowing she can’t afford the luxury of pride.\n She finds her wife kneeling before the server, already plugged in. She follows.\n The church is carved from solid rock, a copper-roofed globe drenched in bronze evening. The floor murmurs quartz canticles underfoot. Kerttu is enclosed in a pebble-rounded pew, a carpet of white furs and ice crystals mounded at her bare feet. “I was never religious,” she says without turning, “but I liked Temppeliaukio. It is—was—a good hideout when I wanted to think. When I wanted peace, but usually it was too crowded. In a way, you’ve created the perfect version of my country for me.”\n “Kerttu—” Heilui draws a deep breath. “I’m sorry.”\n Her wife turns around. Rime cracks at her movement, sloughing off her shoulders in flecks and teardrops. “There’s no need, Doctor. I always knew I was released from the Institute for a purpose and he was a priority target. Of all his surviving associates, I made the best bait. I’m only curious why you did it. Is it simply patriotism? Frightening as his reputation was, I don’t think he would have resumed his work. He meant to lie low, disappear. Change his face again and become just an ordinary man.”\n “Five years ago occidental terrorists infiltrated my university and I got close to one of them, a woman I thought I could marry. She . . . made use of me to access our archives, I don’t remember anymore what data she got. I was arrested as a potential accessory and though found innocent, it scarred my records. This—I was offered amnesty. My name cleared.” Within the virtuality she is not subjected to involuntary reactions, the tyranny of cortisol and serotonin, but she’s accustomed to configuring her avatar to reflect her real body as much as possible. Her throat is sore and thick. “Why didn’t you? Go with him.”\n Kerttu folds her hands. Snow blooms, unmelting, on her knuckles like wedding rings. “Ultimately it is a question of whose property I am. What did he offer? A life on the run, dogged each step by terror. The past is past. There’s no use resurrecting a hill of ashes. The dead do not come back. The arrow of time doesn’t reverse.”\n Heilui purses her mouth, opens it. Exhales. “My contract with the Institute isn’t permanent. There’s been no further . . . instructions. After what’s happened, you should have this choice. You can go back to the Institute and they’ll find you another client.”\n “Is that what you want, Heilui?”\n A painful-sweet wrench in her chest: like love, like cardiac arrest. It is strategically placed and cannot be inadvertent, but even so. “You’ve never called me by name before, like that, ever.”\n “The Institute appears to be done with me. I’m of no further use to them and therefore I’m now granted freedom, after a fashion, as long as they can track me and I’m tethered to a client.” Kerttu looks, unblinking, at Heilui with her aquatic eyes. “A future can be had and a new life can be built. That is what you offer me and I’d like to take you up on it.”\n Logical. Transactional, as this has been from the beginning. And yet Heilui finds herself smiling. “No, you’re right. And if you were gone, I’d miss you. I’ll have to talk my family around, but my mothers at least I think I can convince.”\n “I will do my best to be the daughter-in-law they can tolerate. They will be my family, my mothers.”\n Heilui laughs, surprising herself, the sound of a scale tipping in her heart. “So they would. I never asked you properly before, did I, so—Kerttu, will you be my wife?”\n Kerttu gathers Heilui in her arms and kisses her brow, soft and warm. “Yes. Let’s try to make this work together.”\n At their feet, the frost of Kerttu’s country thaws: a pool clear as the first water of spring, blue-green and sharp with salt.\n Out in the world of mortal flesh and unbearable history, on the island surrounded by storm and sea, the occidental bride never dons black again.\n Benjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award."}