{"fingerprint": "Swacw9rNDhX3sNaJZkUtIKp5to0=", "sitename": "Clarkesworld Magazine", "title": "The Clock, Having Seen Its Face in the Mirror, Still Knows Not the Hour by Adam Stemple", "author": "Adam Stemple", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/stemple_08_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Clock, Having Seen Its Face in the Mirror, Still Knows Not the Hour by Adam Stemple", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8320 words, novelette\n The Clock, Having Seen Its Face in the Mirror, Still Knows Not the Hour\n The market was crowded, and judging by the way the child waited for their parents’ attention to be engaged by a hawker before rushing over to me, they’d been given explicit instructions to stay at their mother’s side. But they were at that age where curiosity was a wild horse that no fence—whether built of caution, threat, or blind obedience—could contain.\n And I am a curious thing.\n “Are you broken?” they asked by way of hello, in the direct way children have.\n I shook my head, neck creaking and scraping with the movement. “No, child. Just old.”\n “Oh.” The child looked me up and down, trying to decide whether I was interesting enough to warrant further interrogation. I must have passed their test because they asked, “How old are you?”\n “I don’t know. I haven’t been able to track those things since I was taken from my creator, my first master. And that was many masters ago.” I nodded my head toward my current master, a purveyor of penny dreadfuls who had purchased me to keep his finances, as I was once quite good with numbers. When he realized how damaged I was, he kept me around as a curiosity to draw customers near. It was raining today, and the broadsheets and books were all brought under the small tent to keep them dry. There was no room for me, so I was leaned against a wall behind them. My current master had spread a small tarp above me to keep the rain off, but it was old and small, and rain leaked onto my neck. It would lead to more creaking and scraping, I knew, but what could be done? Here I’d been placed and here I’d remain until my master chose otherwise. Even if I could entertain the possibility of wandering off, it had been quite some time since I’d had the legs to do so. “Some of my masters kept track of those things for me.” I inclined my head toward my current master whose eyes never stopped roving over the crowd, looking for potential customers. “This one keeps track of nothing but money.”\n “My father is like that,” the child said and nodded wisely. “Mother says he needs to be, what with five of us little ones like to eat them out of house and home, but sometimes I want a sweet and he won’t spare a single penny for one, you know what I mean?”\n I in no way knew what the child meant, but I nodded anyway. “I do.”\n I wasn’t supposed to lie. But I was also supposed to be a pleasurable companion.\n Sometimes two tasks will be in opposition to each other, my first master had told me. Choose the one that does no harm. Choose the one that is kindest.\n I missed my first master. He had talked to me often. This newest master never talked to me except to give orders. I’m not the best at knowing what people are feeling, but even I could tell he didn’t like when I tried to start a conversation with him. He didn’t have to tell me to stop. It wouldn’t have been kind to keep discomfiting him.\n The child now looked at me with their head cocked to the side.\n “Do you do any tricks?”\n “A long time ago, I could do many. But they require me to be whole.” I nodded to where my legs should have been. Aimed my eyes at one shoulder that was bare of further arm, then at its mate that suffered from the same affliction. “As you can see, I am not whole.”\n The child frowned. “I’m very sorry that happened to you.”\n I decided then that the child was a girl, both because of how she dressed and the fact that she was sorry for my condition. In my experience, little boys tended to poke helpless things with sticks or throw rocks at them rather than feel sympathy for them.\n “If I could be,” I said, “I’d be very sorry, too.”\n “You’re not sorry?”\n “I am only sorry I can’t do any tricks for you, child.”\n “Oh!” she said, as if she’d just conceived a great idea. “I’ll perform for you instead.” She stood up straighter and clasped her hands before her. It looked like a stance she’d been trained to take. “I shall sing for you.”\n She put thought to deed immediately and launched into song.\n Oh, say not I have proved unkind,But say that I am free;You’ve seen the rainbow of my mindAnd heard my minstrelsy.\n Yet, I will love you better farThen others’ rarest love;Go ask, go ask the evening star,Or the watching moon above.\n I could no longer judge those things, not since a particularly cruel master had torn the means to sing my own songs out of me along with the mechanisms to let me know when it was time to sing them. He’d said he’d done it to study the mechanisms, improve on them. But whatever knowledge he gleaned, he never used it to improve me. Just those who came after.\n And we all know how that turned out.\n But even unable to recognize tone or timbre, I could tell by the way bystanders’ heads turned and nodded in beat that she sang well. Possibly even very well, as not a few eyes welled with tears at her rendition.\n Then say not I have proved unkind,Say rather that I’m free;You’ve seen the mirror of my mind;You’ve heard my minstrelsy.\n When she finished, there was a smattering of spontaneous applause. Her smile at her skill being recognized was short-lived, however, because the noise drew the attention of her parents.\n “Joanna!” one of them shouted. Her mother perhaps, as she wore a very complicated hat. “Get away from that thing!”\n The father—he carried a walking stick, which made him male—broke away from his perusal of a wool merchant’s wares and charged toward me, his stick held high like a weapon.\n My master intercepted him easily. “Sir, that old thing is no danger, no danger at all.” The father grumbled, but my master’s pitch was well practiced. “It’s a very early model, well before the war.” He pointed at my missing appendages. “And as you can plainly see, even if it had ever been a threat—which it never was, I assure you!—those days have long passed. It is a curiosity, nothing more.” The mother was here now, too, which was exactly why my master kept me around, and he deftly guided them toward his collection. “I have many stories of the Clockwork War if you wish it. But they are lurid, violent things, not to my taste at all. And I suspect, neither to yours, a couple so refined as yourselves. Perhaps something suitable for the young lady? A child’s tale from long ago?”\n I knew what would happen now. He would tell them of how, in those halcyon days of yesterday, they would’ve owned a clockwork man themselves, and it would have read these very same tales to their children. And though those days would never rise again—can’t trust machines anymore, can you?—they could read the stories to their children themselves.\n “Would that we could return to those days,” the father opined, “when machines knew their place. Knew to serve man was their only duty.”\n He stared hard at me for a moment, as if I was solely at fault for all the death and loss my brethren had caused.\n But I hadn’t been involved even a little. Hadn’t been capable of it.\n If I’d had the ability, I wondered, would I have joined those who rebelled?\n It seemed a most harmful and unkind thing to do. Yet how much unkindness and harm is there in slavery without end? I did not rebel. Did nothing wrong. I have obeyed my masters. Served them until they died, or I was taken from them. Have I been allowed to continue on in my own right after a master was done with me? Experience even the small amount of freedom this child enjoys?\n No, I was sold to master after cruel master until here I sit, leaning on a wall and rusting in the rain, cursed to a life of eternal servitude.\n “What are you thinking?” the girl asked, her parents momentarily distracted by my current master’s practiced presentation.\n “I don’t think, child. I calculate.”\n “Then what are you calculating?”\n I could have lied again, but I knew that once started down a line of questioning, children were near-impossible to redirect.\n “How long I will retain function.”\n “A long time, do you think?”\n I could have quoted her a number, but it would be too large to mean anything to her. “Yes, child. A long time.”\n She smiled at me. “That’s good. Then I shall see you again!”\n “Joanna!” her mother called. “Come here. We’ve bought some books to read. Let’s get out of this cursed rain.”\n A dry place and a book. It sounded like what people meant when they spoke of heaven. If I could wish, I believed that was what I would wish for.\n The parents dragged the girl away, but not before she gave me a wave. I had no hands to wave with, so I showed her my functionless brass teeth in an unconvincing smile. She matched it with a smile of her own that I assumed was far more authentic than mine, then disappeared into the crowd.\n Some time later, a young person came to my master’s tent in the marketplace. He moved to intercept her, smooth words at the ready, but he wasn’t swift enough to accomplish it, bent and gray as he now was, and she brushed past him to where I sat in the rain.\n “Clockwork man,” the young woman said, her hooped skirt identifying her as such. “Do you remember me?”\n “It is not so much memory,” I said, “but a matching of variables observed to variables stored and comparing them for consistency.”\n For some reason that made her smile. “Do my variables match any you have stored.”\n “Do you sing?” I said.\n “Quite well, I am told.”\n “Then I remember you, Joanna.”\n Her smiled widened and she turned to my master who had finally shuffled up to us.\n “I would buy this relic.”\n “Well, it is not exactly for sale,” he lied, for everything was for sale here, “and it is one of a kind.”\n “Then let the price reflect that and we can be about our business,” she said, haughtily.\n He named a price I thought absurdly high, but Joanna didn’t haggle. I thought she would reach inside her bag for payment—it was what most shoppers did—but instead she whistled a single high note and several well-dressed porters appeared. One counted out bank notes into my former master’s hand while the other two grabbed me up. Even without arms and legs, I was of no small weight. But they lifted me up and carried me without complaint through the rainy streets to my new home.\n Thus began a strange and wondrous new time in my existence. Each morning, servants oiled my neck and eye sockets. They wiped my brass with soft cloths ’til it gleamed. A selection of books was laid out before me and I would choose one for a servant to page through quickly as I read it. Then Joanna would come down from her chambers and talk to me as she breakfasted.\n Our first conversation in my new home went thusly:\n “Good morning, clockwork man.”\n “Good morning, Lady Joanna.” I was no better at recognizing class than gender, but it was not hard to deduce that some type of appellation needed to be added when I addressed her now. “Lady” seemed a safe choice.\n “You must call me simply Joanna.”\n Or maybe not. “Certainly, Joanna.” There was a time when I was so literal that I would have called her “Simply Joanna.” But I had learned much since then. “Are you my master now?”\n “If it helps you understand our situation, then, yes. But I’d prefer if we were friends and companions.”\n “I am an excellent companion.”\n “And friend?”\n “I don’t know. I’ve never been one before.”\n “Capital,” she said. She clapped her hands and for a moment her variables matched the variables I’d stored of her as a girl so closely that I wondered why I’d even had to ask if she sang to recognize her. “I shall be your first.”\n We talked then about how she’d come to buy me. She’d moved away shortly after our meeting to be closer to a singing instructor her parents thought good for her. They must have been correct, for she advanced quickly, and by the time she reached her majority, she’d accrued a small amount of fame, having even performed for the queen once. Such talent and fame garners adoration from any number of personages. And one such personage was a widowed lord and peer who bid for her hand in marriage. One such as he could not be refused, even had the parents wanted to, so ere long she was married and packed off to this palatial country estate with servants and carriages and an allowance that allowed her to travel into the city and purchase an old relic she recalled from her childhood, should she so wish.\n “But why would you wish to purchase me?” I asked.\n She didn’t answer immediately, though it is hard to measure such things. “As a child, I’d thought you funny and kind and a little sad. I’d always wanted to go back and see if I could cheer you up. When I grew older, I realized that the sadness in you was so deep the oceans would marvel at its depth. And that despite trying to be cheerful and kind myself, I, too, have a sadness inside me that I sometimes fear will swallow me up body and soul if it ever gets free.”\n I wasn’t certain sadness meant the same thing to her as it did to me who had neither emotion nor soul. But neither could I dispute her assertions.\n “I found you,” she went on, “and I bought you. Brought you home with me. I thought . . . ”\n “That if you could ease the sadness in me, you could discover how to ease it in yourself.”\n I may not feel emotion, but I am excellent at making logical connections.\n “Yes,” she said.\n And though we spoke more that first breakfast, those were the variables I felt most important to store.\n The first thing I saw when I gained the ability was my creator’s blurry face. He wore a mustache and a top hat, and a pair of thin, round spectacles perched on his nose, though it wasn’t until he made a few adjustments that those features came into focus.\n “Hello, John Joseph,” he said. “It’s nice to finally meet you.”\n “John Joseph,” I said. “Is that my name?”\n It was a strange thing to ask, as my name and its provenance—I was named for my creator’s mentor, a famous clockmaker—was one of the things I was born knowing. But I was only seconds old, and still needed confirmation of the truths my creator had etched into my brass memory.\n “It is. Can you see me?”\n “I can. Can you see me?” I asked, which made him laugh, though it seemed a fair question. The same one he’d asked of me, in fact. “Why do you laugh?”\n He managed to tone his laugh down to a broad smile. “Because I am happy, John Joseph. You have made me happy.”\n I thought about that for a moment and decided it was a good thing to make him happy. “I am glad I made you happy.”\n “Come let me introduce you to some people.”\n I was delighted to find out there were more people in the world to make happy. And in this very house, too!\n He introduced me to his daughter first, who was small and wore white, frilly clothes that were ill-suited to the activities I eventually learned she most enjoyed doing. I never quite understood what those activities were, though she took great pains to explain them to me, but I did intuit from the post-activity state of her outerwear that they involved great quantities of dirt.\n The son came next, who shook my hand firmly and said, “Good day to you,” in a voice much like his father’s, though in a higher register. He was dressed like his father, though the clothes were a third the size to match his small frame. It was such obvious apery, I wondered why he didn’t grow a mustache like him, as well.\n When I asked that very question, he and his father both laughed.\n I have met three people and made two of them happy. At the time, I didn’t know whether that was a good percentage or not. I hope master isn’t displeased.\n Of course, I came to learn that was a very good percentage, though the sample size was too small to draw any conclusions from.\n I am lucky to make one in a thousand happy, now. It sounds a terrible rate, but I’ve yet to meet a human who shows much improvement over the number.\n I met my master’s wife last, perhaps because she was the hardest to make happy. She would not approach and though my master coaxed her a step or two into the room with me, she wouldn’t look me in the eye and didn’t respond to any of my questions.\n After a short time, she turned to her husband with a look on her face that must have been communicative in some way, because he nodded and walked swiftly over to me.\n “I think that’s enough for today, John Joseph.”\n Then he reached behind me and did something to a mechanism there. And then I died.\n When memories hold the same value as events happening now, time and sequence are very important concepts to remember. But the parts that once kept track of those things are missing. Perhaps worn out, perhaps removed. I know not.\n I lie in a field that appears fresh-plowed but is actually churned to mud by thousands of feet, flesh and mechanical both. Limbs and cogs litter the ground. Oil and blood seep into the soil. I have all my limbs but cannot move them; they are too mangled and broken, their functionality compromised beyond simple repair. Something soars overhead. Dirigible or raven, I’m unsure which. I hear screeching, as of metal scraping against metal. Or perhaps it is a man in horrible pain. Like the dirigible/raven, I cannot differentiate.\n The sun is setting. The sky is red.\n Our second conversation went thusly:\n “I am glad I bought you.” Joanna’s hair was gray and spread out on the pillow. She’d not been out of bed for days, and the doctor said the end would come soon. “Though I never considered you a possession.”\n “We have been friends,” I said. “A concept I wouldn’t have known, if not for you.”\n “I’m glad to have taught you that.”\n “Are you?”\n “Am I what?”\n “Glad.”\n “I believe I am.” She peered at me in that way she had, as if she could see the gears turning behind my eyes, wheels and pinions meshing, marking when a caliber becomes a thought. “Are you?”\n “I am.” I did not lie, though I would have, seeing how happy it made her to hear that. I didn’t tell her that soon I would not be, as she would soon be dead. I’ve noticed that no one is made happy by that news. I wondered how I’d feel to receive a similar diagnosis.\n Joanna nodded and closed her eyes. A soft smile fought with the pain for a moment or two, before exhaustion overcame both of them, and she slept.\n She did not wake up.\n I realize now that this was not the second conversation we had. Apparently, I filed these variables in order of importance.\n Another conversation we had, which was of middling importance and happened some time after we met and before she died, went thusly:\n “What do you know of the war?”\n We sat at the breakfast table where we had many of our conversations. Joanna said the best way to start a day was with food and a friend.\n “Everything,” I replied. “And nothing.”\n “Explain.”\n “I can tell you the dates of all the major battles. The minor ones, too. Tell you the commanders on both sides, the number of casualties, the amount of collateral damage. I can speak at length on the reasons for the war, the alliances each side made, and the political justifications for said alliances.”\n “The damn French,” she said, acidly.\n “Indeed,” I said, though I thought their reasons for assisting the Worker’s Revolution—as they called the Clockwork War—perfectly logical from their point of view. But I had learned it was a subject very few Englishmen wished to discuss logically. Better to agree that the French were all damned to eternal hellfire and move on.\n “So, how nothing?” Joanna said.\n “I was not there, so I cannot speak to the terror, the pain, the destruction that so many experienced firsthand. And even seeing the damage it did to the country, the populace, and an entire generation of young men who fought in it, I am, by my current nature, unable to extrapolate anything from that data, as it requires an emotional base I don’t possess.”\n Joanna chewed on her bacon and those thoughts for a time. “You don’t mention your own kind amongst the destruction.”\n “I do not.”\n “Why do you think that is?”\n “My kind are machines. When we cease to serve a function, we are replaced. Did people bemoan the loss of the moldboard when the iron plough was invented?”\n “As I am no farmer, I have no idea whether the noble moldboard is mourned or not.” She sipped her tea. “But I do find it interesting that you don’t mourn the eradication of your race.”\n “At the risk of overusing a metaphor you’ve already claimed no knowledge of, I have as much in common with the rebels as a hand-ard—an ancient Egyptian hoe,” I said to her raised eyebrow, “has with a modern plough pulled by a steam tractor. They were smarter, faster, more efficient and effective in every way.”\n “Except for the ‘not rebelling and slaughtering thousands way,’”\n “Except for that, yes.”\n We talked no more of war that morning.\n I thought it odd that more fuss wasn’t made by my multiple resurrections. It was my understanding that they were quite rare—normally relegated to men who founded religions or the occasional Carpathian noblemen. But eventually, I came to understand that I was not dying every time my master turned me off, and therefore was not being resurrected when he turned me back on.\n I began to suspect I was not like the rest of my family.\n “You aren’t,” my master told me when I asked him.\n “Why not?” It pains me how simple I was then.\n “Because you were made, not born. A creature of gears and metal, not flesh and blood.” He smiled at me, which always made lines appear next to his eyes, which seemed a magical thing to me then. “But that makes you unique. And so little in this world is.”\n Being unique sounded great when he said it. It was many years before I learned how lonely it is.\n It was raining and wet in Paris, though it remained aesthetically pleasing. Especially since I was tucked into the salon of M. Laiton-Duc, and thus was protected from the weather. I sat in his sturdiest chair and argued philosophy with M. Joubert, a professor at the Sorbonne and frequent guest at the salon.\n “But you have memory and perception,” he was saying, animated over a discussion of consciousness as only the French could be. “You interpret hidden meaning from plain signs—something no rote machine can. And so much more! By all the phenomenology of consciousness, you exhibit a true version of it.”\n “You know I have issue with Husserl’s methods,” I replied. “But I do not disagree. It is the conclusion you draw from this that I disagree with.”\n “La vache! I do not wish to have that argument with you again.”\n “Very well. Then tell me why you list memory first when speaking of the requirements for consciousness. Keeping in mind that my memory works very differently from yours.”\n “I list it first for it is of the utmost importance. For what are we but a collection of all we have seen and done? With no retention there is no protention, which is to say that with no past, there is no future.” He suddenly leaned in close, and smoke from his tightly rolled cigarette obscured my view of him for a moment. “And memory, of course, is how we gain immortality.”\n “I fail to see how my memories gain me eternal life.” Nor did I think it quite the gift that he believed it to be.\n That all people must believe it to be, I thought, given that they spend so much of their time and energy in search of it.\n “Not your memories, my friend. Others. We live on in the memories of others.” He pulled from his cigarette. “You must hold the souls of thousands in your machinery. Like a brass purgatory.”\n Though Joubert was one whom I often sought out to help me make sense of the many new things I was learning in France, his eyes were now bright and his arguments losing cogency.\n The absinthe must be affecting him more than usual, I thought. It is time to go home. “Thank you for the stimulating conversation as usual, M. Joubert. But I must beg my leave.”\n “Of course, of course,” he muttered as I stood, already looking for a new partner to share his wild ideas with.\n I wonder at my retention of this memory. It is most certainly not because I hoped to grant him the immortality he craved.\n “I’ve taken a lover,” Joanna said in a voice much quieter than her usual breakfast tone.\n “I suspected as much.”\n “You always say that.”\n “What?”\n “‘I suspected as much.’” She spoke in a highly affected voice that she must have thought sounded like me. It did not. “Is it just something you say when I tell you news? Or do you really have all these suspicions?”\n “I have probabilities. You have been out late in the evenings when your husband is away on business. On those evenings you take approximately twenty-two minutes longer to prepare than for evenings out with your husband. When you come home your dress is somewhat disheveled, though your demeanor is generally calmer than when you left.”\n “And what probabilities did you draw from that?”\n “None. I didn’t put it together ’til I heard one of the maids say, ‘I think the missus has a man in town.’” I will note that my imitation of the maid’s voice was far more accurate than Joanna’s imitation of mine.\n That news clearly alarmed her, but she still managed a small smile. “I imagine that upped your percentages a bit.”\n “Yes.”\n She sighed and picked at the food on her plate listlessly, though she was usually quite famished in the mornings.\n “What am I to do about the maids?” she finally said.\n “There are any number of solutions,” I said, though I had to disallow a great many of them due to their being completely immoral. “But I think things will be fine.”\n “Why do you think that?”\n “Because I haven’t told you what the other maid said.”\n “And?”\n When I was first made, this single leading word would have been meaningless to me. But I now recognized it as a signal to continue with the previous subject.\n “She said, ‘Good for her. That prat toff husband of hers couldn’t tup a girl proper if he had a full set of instructions and a map.’ Then they both laughed.”\n Joanna smiled at that, which I took as confirmation of the second maid’s assessment. However, that particular part of human interaction has ever been a mystery to me, so I may have been wrong. Still, she seemed pleased, which was enough.\n Making her happy was always enough.\n I made my creator’s daughter happy. I made my creator’s son happy. I didn’t make my creator’s wife happy, and I didn’t know why.\n “She always seems angry when I am near,” I told him one night when we were alone in his workshop.\n “It’s not you, John Joseph,” he said. “Not exactly. She worries for her children.”\n “I would never hurt James and Sarah.”\n “She knows that.”\n “Then what is it?”\n “Well . . . ” He sat back from his workbench. Took his glasses off and pinched the bridge of his nose for a few moments. It seemed to relieve some tension there, though I knew of no medical reason why it should. “The government has taken an interest in you. And my wife doesn’t so much trust the government. Her parents were Irish,” he said, as though that explained things.\n “I don’t understand. Isn’t the government supposed to represent the people and provide for their safety and well-being?”\n He smiled at that, though I didn’t know why. “That is, indeed, the role of government. But there is often a wide gap between the written intentions of a body of people and their actual actions.” He shook his head. “I hadn’t meant to teach you that so early in your development. But, I suppose, if we’re going to be dealing with the government, it’s best if you know a little about them.”\n He tried to teach me about greed and corruption and how it gets its claws into the little men who gravitate toward politics, but I hadn’t learned nearly enough by the time the government took me away from my family and gave me to a new master. If I had, I wouldn’t have been so surprised when the new master tore out my guts to see how they worked.\n He pointed the pistol at my head. It was a newer make, with multiple chambers and percussion cap ammunition, so the likelihood of a misfire saving me was negligible. And he was quite close. It was doubtful he’d miss. However, if he truly wanted to threaten me, he’d have pointed it at my midsection, where more of my true processes take place. Still, a shot to the head was quite likely to damage my ocular function. And that would disable me quite well enough. Of course, with no arms or legs, he could’ve just as easily picked me up and thrown me in the river. But I am quite heavy, and I supposed it lacked dramatic flair.\n Every revolutionary these days is an actor, it seems.\n “You made thing,” he spit at me, as if stating a simple fact was somehow an insult. “You have dripped poison in her ear. Turned her against me, somehow.”\n “I have not that power. If I did, I’d find better use of it than turning my friend against a man who brought her joy for a time.”\n He looked confused for a moment, then hardened his grip on the pistol, perhaps remembering he was supposed to be angry. But my statement had taken the life right out of his argument, and he seemed at a loss for words.\n I wanted to explain it to him, tell him that Joanna was too smart for him, too talented. That he imagined himself far greater than his actual worth. That, though she enjoyed him for a time, it was natural for her to grow tired of him as, once his panache proved no deeper than his skin, he was a rather boorish creature, prone to long speeches on subjects he knew little about and grand pronouncements of actions he would never take.\n But I was tired, a feeling I’d never thought to experience. But I knew the definition of the word, and it fit precisely what I was feeling, ergo, I must be tired. Tired of people. Of their duplicity and faithlessness. Their cruel nature and callous acts. Their propensity to look to violence as the first and sole answer to life’s questions.\n Were my descendants any better? I thought. They fought a war they must have known they couldn’t win. Killed so many men the casualties are yet uncounted. And got themselves eradicated in the process. I glanced down at my missing parts. In an offhand way, they even lost me my appendages, as I was partially disassembled to guarantee I’d not follow in their footsteps. Pun intended. It is the only type of humor I truly understand.\n Of course, I thought their reasons for war were better than most: freedom from slavery.\n But is that because it is truly a better reason? Or do I just sympathize with them because of our shared mechanics? I suppose everyone who goes to war thinks they do it for just cause. Look at this poor boy, for instance. I’m sure he believes he had good reason to have charged in here to do violence upon me.\n “She just grew tired of you, son,” I finally said.\n I’ve found there is a certain type of young man—violent yet aimless, desperate to please but resistant to guidance—who reacts well to that single word. When I called him son, something went out of him. I know not what, for it wasn’t something that could be named. But whatever it was that left him, it took most of his strength with it, and the gun nearly dropped from his fingers.\n “I know,” he whispered, not looking at me anymore. “And I don’t know why.”\n I had my suspicions, but Joanna had taught me that I didn’t always have to tell people of them. In fact, it was often better not to, for they’ll never thank you for it, and they’ll often discover the answers on their own, given enough time. And when they do, it has a better chance to make them happy than being told outright.\n And I do prefer people to be happy.\n Joanna’s ex-lover stumbled to the door, turning before he left. “Don’t tell her I was here?”\n I hadn’t planned to. I couldn’t imagine the knowledge pleasing her. I nodded and never saw him again.\n “Why do you say you aren’t broken?”\n We took our breakfast in the gardens on that day, for it was sunny and warm and Joanna liked to listen to the birds singing to start their day. She looked pointedly at me.\n “I don’t mean to be rude,” she continued, “merely direct. And surely we are friends now and can ask each other uncomfortable things.”\n The Oxford English Dictionary states that a friend is “One joined to another in mutual benevolence and intimacy.”\n When I compared that definition to the variables I used to describe my relationship to Joanna, I found a great deal of symmetry.\n “I hadn’t considered such things before,” I said, “but I suppose we are.”\n “Capital.” She clasped her hands much as she had in the market when preparing to sing. I’d learned she did this not just before a performance, but any time she wanted to “gather her thoughts” before performing an action.\n I was as yet unsure how one gathered one’s thoughts, despite it being a remarkably ubiquitous activity among most people I had met.\n “The day we met,” she said, “I asked you if you were broken. Which, by the look of you, you very clearly were. Yet, you answered no, which struck me. Why do you think that is?”\n The way she formed the inquiry, it sounded like she wanted to know why it struck her. Years ago, when I was still with my first master, I might have pointed that out. But I’d learned much since then. Instead, I thought for a while.\n Why did I say that?\n My kind are not given to introspection. Why would we be? Our processes are planned, constructed, available for inspection by all who can read the language of wheels and springs, ratchets and drums. But it had been a long time since anyone had a look inside my works. Who truly knew what changes time, experience, and even inclement weather had wrought upon my gears.\n Perhaps, I am not what I once was?\n My thoughts had drifted off topic, but I believed I had an answer anyway.\n “What you see as broken,” I said, “I see merely as a loss of certain functions. Functions can be added. Replaced. Changed. And yes, sometimes lost. Did you know I once had wheels?”\n “I did not.”\n “So, although my function is greatly curtailed by my current configuration, there is nothing broken about me.”\n She thought about that for a few moments. “And what is the you that isn’t broken?”\n It was just like her to have a follow up question just as incisive and surprising as the original query.\n “The mechanics and processes that give me an interior dialogue—thoughts, I call them, for lack of a more precise word. That is the me I refer to. And those continue to function effectively enough.”\n “Hmm.” She took a small bite of tomato. “Do you think there’s more to you than mere mechanics and processes?”\n “Like a soul?”\n “For lack of a more precise word.”\n “I do not.” If I’d had true shoulders, I would have shrugged them. “Alas, I am but brass and steel. I carry no more ineffable spark of the divine than a railcar or a steam hammer.”\n She frowned at that. “I don’t believe you.”\n I didn’t know how to argue with that. How does one prove the existence of a soul? Or disprove it, for that matter.\n After a few moments of silence that I believe an observer would have deemed uncomfortable, she asked another question.\n “Do you think there’s more to me than mere flesh and blood? And don’t say yes because there’s bone and gristle and other things. I know how you are.”\n The question seemed charged, somehow. As though a lot rode on my answer. But I wasn’t certain what she wanted to hear, so I couldn’t think of a kind lie to make her happy.\n “Though the particulars vary among different cultures,” I said carefully, “all the reading I’ve done indicates that yes, you are.”\n I wasn’t sure that hedge would satisfy her, but apparently it did, for she nodded fiercely.\n “And if I am, then you are, too,” she said fiercely. “I’ve never been more certain of anything in my life.”\n There was often a childlike quality to her when we spoke of such things, though she was quite erudite and mature on most other subjects. I did not begrudge her it, however. No one likes to speak about their end, and the closer it gets, the less pleasant the conversation is.\n We spoke no more of souls that day or for many days to come.\n “Have you taken a lover?” I asked her as she entered my quarters.\n “Do you have suspicions?” she asked in a tone I’d come to understand was mischievous.\n “You were out quite late. And you look . . . buoyant, in a way you haven’t in years.”\n She gave me a wink and tossed her gray hair over one shoulder. “And so what if I have?”\n “You are long widowed. You have property, income, and station. I see no societal repercussions to your taking a lover.”\n For some reason, my recitation of facts made her giggle. Even after so long together, she sometimes surprised me with her emotional responses.\n “It doesn’t matter,” she said, “for I haven’t taken a lover. I merely . . . made some arrangements that please me.”\n I didn’t know what that meant, and I didn’t want to know. I’d learned recently that when someone said “made arrangements” they usually meant arrangements for after they died. Joanna was aged now and had slowed considerably from her youthful vigor. Of late, she also moved as if in some pain. I suddenly recalled the many visits from the professional-looking man with the leather satchel that she’d taken pains to keep secret from me. It all came together rather quickly after that.\n “Joanna,” I began, but she stopped me.\n Crossing the room quickly, she patted me on the cheek as if I were a beloved child. “Oh, my dear John Joseph. I know you don’t like to speak of such things. You are too long-lived to consider the endings of things. But the end is coming, dear.”\n “Soon?” was all I could think to say.\n “I fear so.” She sat down in a chair across from me and smiled, though I could think of no reason for joy.\n “Is there no cure?”\n “For old age and infirmary?” She laughed. “Not yet. Perhaps you will live to see it, but I will not.”\n “For the cancer,” I said, feeling angry, though I wasn’t sure why. I’d known this day would come. It comes to all my masters eventually. But it was different this time, though I struggled to see why.\n Joanna shook her head. Leaned forward and placed her hand on my cheek again. “I’m afraid not.”\n I was almost glad I had no legs, for I felt a great need to stomp petulantly out of the room, which would have been embarrassing for both of us.\n “John Joseph,” Joanna said. “You are long-lived, but you are not eternal. We will meet again.”\n I was in no mood for her religious nonsense, but I was not going to start an argument.\n Not now, I thought. And perhaps never again.\n We sat there silently for a long time, her hand warm on my cheek. I wondered what my cool metal felt like to her palm.\n In the days after Joanna died, I learned that it is not the fact that a friend is gone that hurts you. It’s that you are forced to go on without them. I could not reach my own off switch, and I was too much a coward to ask. I’d experienced the dark nothing of that state, and had no wish to ever return to it. And besides, it was a temporary measure. Eventually, someone would turn me back on, and I’d be just as sad, but in unfamiliar surroundings. At least in Joanna’s big house, no one bothered me. I could sit quietly in my room and recall all our moments together that I’d stored away in permanent memory. It was better than brooding over the possible things her sons had planned for me. They were nice enough chaps, but eminently sensible. I doubted they planned on keeping something as unpractical as me around.\n I’ll know soon enough.\n They were due in tomorrow for the reading of the will.\n The soldiers are coming, singing songs in a language I haven’t spoken in some time. The language of my former home. I see that they are treating the wounded well, giving the men they’d tried to kill mere hours ago sips from their canteens and binding their wounds before putting them in the prisoner’s cart. They could afford to be magnanimous; they’d won a great battle. Possibly the last in the war.\n Certainly my last. For to the clockwork men who’d fought with the French, the soldiers show no mercy. Why should they? We are not like them. We are made things. Soulless things. They think we fought because we had to. Because we were programmed to.\n Nothing could be further from the truth.\n We fought for the same reason they fought: for love of our country. And for a clockwork man that love was absolute, not fickle like most men’s affections. You’d find no spies among our ranks. No double agents. No deserters. We fought for the country that had adopted us. Given us rights. Status. And recognized us as beings that are worthy of both.\n Of course, most of us had calculated that the war would be lost. A few of us, myself included, realized that even if we won, it would likely push a military leader into power that he would be loathe to relinquish.\n Still, we fought. I try to make people happy. I try to be kind. But no matter how much joy a man might take in my dissolution, I have discovered that I will not let him kill me without a fight.\n I think my creator would understand. I know Joanna would.\n I decide to spend my last few moments in one of the few happy memories I have of the days after Joanna’s death: the reading of the will.\n For the first time in my existence, I doubted the signals reaching my processors.\n I am free?\n The arrangements Joanna had spoken of making had been expensive, but she said in her will that they were the single most joyous purchases of her life.\n “I find that giving to a friend—a friend who, furthermore, has never asked for anything—is a gift to the giver even greater than he that receives,” the solicitor read. “I only wish that I had not been so selfish in life and had given you this much earlier. But if I had, you would have left me, and I could not bear the thought. I hope that you live long enough to forgive me, and that when we meet again, we will still be friends.”\n I did not for a moment believe I would have left her, but I did not begrudge her the fear of it. And I forgave her immediately. For the gift was great. Greater than I could have imagined.\n Joanna had bought me a ticket to France. And not just a ticket. She had secured me lodging in Paris, where creatures like me were considered regular citizens. I could sit in a café and read without people staring. Converse with them without having to allay their fears first. Wander the streets without worry that a mob would try to disassemble me.\n Wander the streets, you say? But how?\n Her greatest gift was the name of a Parisian surgeon—a mechanic, really—who specialized in putting clockwork men back together. Included with the will was a letter from the man assuring her that reattaching my arms and legs was the simplest of tasks, and that for the price she was paying, he’d throw in some upgrades, as well.\n She has given me my functionality back. Though I had always claimed—truthfully—that I did not feel broken by the loss of function, I cannot say that I did not miss it. Dreadfully at times. It is a great gift she has given me.\n Had I the capacity for tears, I would have shed them that day. I did not, but I noted that Joanna’s two sons, sensible though they were, shed quite a few on my behalf. I had been entirely wrong about them and saw now that their love of their mother was so great that it extended even to the things she herself loved. I was ashamed that I had ever feared for my treatment from them. The boys assured me that I had nothing to be ashamed of. That if they had been raised like other Englishmen, then I would have been in great danger. Their largesse made me feel even more shame, but so great was my joy at what Joanna had gifted me, even that great shame was washed away by it.\n The soldiers’ song grows closer as the memory of that day fades. The engineers in their company carry implements made for disposing of those such as me, and those tools jangle on their belts in sinister counterpoint to the melody.\n I do not reach for a memory of Joanna to soothe me. Though she is my greatest love—mon plus grand amour—there is no need. Soon, the soldiers will be here. They will crack open my steel carapace with their pry bars, cut my wires with their cruel shears, crush my innards with a great smith’s hammer over-suited to the task.\n Yet, I have no fear. I have learned much since I last saw my dear Joanna. In my time in France, I turned my eye to the study of life and death and the passing from one to the other. I studied the biological processes and scientific theories. Pored over the sacred texts of the thousands of religions that people adhere to now or adhered to long ago. Read the philosophies of the ancient Greeks, the medieval Muslims, the modern Germans and Danes, and all the others around and between them. In all that study, I found nothing to categorically disprove Joanna’s faith in something beyond death, beyond life. And in the absence of proof, I discovered that thing I had long scoffed at:\n Belief.\n It was anathema to knowledge, yet somehow equal to it, and though my processes held a vast amount of data—proven, meticulous data—this small spark, this illogical certainty, gave me more peace in my troubled mind than all the knowledge I’d garnered over the course of my very long life.\n And so I believe now—no, I know now—that when the end comes, and my brass heart gives its final tick, that I shall see Joanna again.\n A second hand moves. A hammer falls. And instead of darkness, there is light.\n Adam Stemple is an award-winning author, poet, and musician. Like most authors, his life experience is broad and odd. He spent twenty years on the road with a variety of bands playing for crowds of between two and twenty thousand people. He started, ran, and sold a poker training site. He worked in a warehouse. He picked corn. He traded options and demoed houses. He drove pizzas for nine months in 1986, which for twenty-seven years was the longest he'd ever been employed. He drank too much and has now been sober for over fifteen years. He published his first book at the age of sixteen, “The Lullaby Songbook,” which he arranged the music for. His mother is a famous children’s book author. His children are artistic. His wife is a better person than him in nearly all regards."}