{"fingerprint": "VLeFUneufb4z2R+W4jjGG5uvgpY=", "sitename": "Clarkesworld Magazine", "title": "The Wanderers by Bonnie Jo Stufflebeam", "author": "Bonnie Jo Stufflebeam", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/stufflebeam_02_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Wanderers by Bonnie Jo Stufflebeam", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2670 words, short story\nThe Wanderers\nWe came to your planet because we knew that you, the peoples of Kill Bill and Saw and Vietnam and Columbine Massacre would understand us. You could not call us monster, as our subjects had done, and you would not call us morally reprehensible, arising from actual or imputed bad character or conduct. We had watched your entertainments, our satellites catching your transmissions from so many fog years away, through so much space we marveled at the quality of transmission. The other planets never sent out such good entertainments. Yours we liked to watch most, the four of us, as our subjects screamed from the metal chambers which we had locked them in and which we never strayed from so we could hear them as they cried.\nNames of our own place would not fit in your world of dirt and blue sky, our names too convoluted, too garbled in the throat, so we gave ourselves your names. Joker and Samara and Alexander Great and Corleone. We matched them to personalities and memorized them and learned your language from the entertainments and from a red book Webster’s the weight of a rock that had made it through the satellites and into the entertainment machines. We used a laser to transfer it across our skin and we soaked the words in through our bodies which, we now know, would look to you like extended shadows in too little sun or ghosts, blank of mouths except when we need them and they open in our skins. Our stretched translucent bodies full of fog inside.\nOnce we had our names and were bored of our own subjects, who begged us not to go, not to go, because much like in your world, in ours we of violence are royalty. We launched ship despite their grabby hands and watched out the window as our subjects bowed low in our absence and wailed like the dying birds on your planet as our ship sunk down into your earth and broke the bird bones to pieces. Crows, our eye scans told us, for we had rigged them to match word to physical scan. It seemed when we landed that we had arrived in realm of crows, which was not what we had desired, and so we walked on from that place, black sand beneath and hot ball of roiling gas sun above so we would no longer hear the shriek song of crow throats.\nBefore you mention it, I will admit that yes, we had come to be your leaders. We had come to slay the ones you called leader before us and to take your whips and reins into our ephemeral hands. This is metaphor, we think. Your red book is unclear on metaphor. But we knew from your entertainments, which like all good entertainments must be based of truth, that you would not fault us this. That you would open your mouths in complaint and tell us you would destroy us but that it would delight you to be forced to try. Yes, we knew we had found people who would fight back, would claw their way past us to trade places, to be us, to be top. Our subjects let us lead too long. No resistance. They screamed but never tried to flee. Called us names and meant them because they did not have in them what we four have in us: need to dominate. Need to be on top. Need to press our metaphor feet into metaphor peoples and metaphor grind them into metaphor dirt.\nWe wandered until we came to dirt. It was same as black sand but made us sink less when walking. Around us the sky turned hazy orange and then cold. We had heard of cold. We loved it, loved how it rattled us inside, how we shook without meaning to.\nFinally in our shake we decided to speak, to try our hands at voice in the strange air we did not breathe for fear it might be poison to us. We used the breath we’d stored inside, enough for two fog years at least, more waiting in the ship for refuel.\n“That place was like Iraq War,” I said. The voice surprised me, shrill and unsure. I was of Corleone name. I was of that name because I stood tallest, reddest, not strongest of body but strongest of mind. It was me had absorbed most of red book, me who writes this now to you so you will know our reasons for coming.\n“Is like war,” Alexander Great said. “Cold is shaky like Cloverfield.”\nAlexander Great, she strongest of body, made comfort comment, as there in the cold we remembered the best part of you and your planet. You were expecting us, had been expecting us for years. We saw Alien and War of the Worlds and Roswell Area 51 Alien Autopsy Revealed. Maybe, we thought, you had met us before, those of other planets. We knew you did not have the ways to leave your planet and visit ours, your technology too primitive, too much of it spent on production of entertainments. We also saw your entertainments of Moon Landing and Mars Rover Mohawk Man and these were not as entertaining and we knew they must be true. You could not go as far as us. You would not be able to escape. And you would accept us more because of this.\nAs we walked over black dirt we heard humming. The fog in Joker’s body cavity swirled and bounced. He curved his mouth, twisted it. He mimicked the laugh of your entertainment royalty for who he had been named.\n“Hear them,” he said. “Hear them, hear them, hear them?” We did not know if words were question or answers, if they required response. We all looked to Samara, who had yet to let out her voice, always so quiet. We gave her chance. Nothing.\n“Yes,” Alexander Great said. “Yes,” I repeated. It was good exchange. Fair. Each of us had turn to speak and all but one took it. We would respect each other, for we were closest of kinfolk. We would not hurt our siblings.\nWe walked then until on horizon there were boxes taller than us, taller than what we had seen in entertainments. Boxes that reached up higher than sky. The humming increased as we came upon what we called city of boxes. Dirt hardened so much there was no sinking when walking, just perfect lighter black dotted with piles of chalky ash. Streets. Lighter black then faded to lighter lighter black in two thin lines to both sides, which in the entertainments we used to see your kind walk upon as the metal beast machines you call cars zipped down the hard dirt middles. Now there were none of you walking, and the metal beast machines slept still, some pulled to the side, some stopped right in middles, each one inches away from the other, nearly touching faces. We were wary of these beast machines, for had seen them in entertainments, fast running into one another, always chasing, explosions that made no sense to us as physics and so we concluded that beast machines must be weapons.\n“Stay back from beast machines,” I said. “This is weapon they can use against us when we declare us leaders. We must dismantle them.”\n“How?” Alexander Great asked. She is only one willing to show her brain weakness. Joker would never ask such question, and Samara, she is different in this landscape. At home she was quiet but aware. Here she looked unable to find the way, her face all bunched up like wrinkled water, digging through the ash piles as if she was looking for you in there.\nWe bent and searched beneath beast machine for clue as to dismantle device. I ran hands along backside and did not feel its breath, did not feel energy inside waiting to be released. I looked through window and saw ash inside too, one pile in each seat. I wondered if beast machine decomposing.\n“Dead already,” I said.\n“Already?” Joker wavered in a circle, turned around and around, and the air followed him, rippling as if mirage. “Already dead, already dead.”\nSamara looked down at surface below us. We waited, eyes on her. When nothing came, I tried next beast machine. It too no energy inside. No breath, no battery life, no fog to animate its metal casing. All down and down streets metal beast machines sleep like the fishes.\nSleeping beast machines were first thing. Second thing was sky, for as sun came up again sky was not blue of entertainments. It was same color as hardened dirt, lighter black, foggy like our insides. The sun burst through the fog but did not clear it. We should have felt kinship with fog, so similar in eye scan to our fog energy inside. But it was different sort of fog. Darker fog. Dirty. Too dirty to swallow.\nThird thing was you. There were none of you. We searched streets but nothing. We went inside buildings, pressing our hands to doors until we felt how they opened, but none of you there, either. No explosion marks like of Comet Extincts Dinosaurs or Deep Impact but more like The Road or I Am Legend, only not like those at all because there was not even one of you left and no monsters in the shadows. Your buildings full of empty chairs and desks and the reek of rotting sustenance.\nOutside again we found the humming come from moving picture screen suspended across building in middle of other picture screens that did not move but proclaimed in bold red letters, “Say No To Loneliness—Playmatez Are Here To Warm You In The Night.” Accompanying the words, a picture of two of your people twisted together in strange dance. The moving picture screen showed us image like entertainments but not as good; just one people fascinated with her own head fur, shaking it, running hands through it, closing one eye at the screen as if dirt in it. Words flashing at bottom which we translated with book skin: relating to one that possesses or exhibits a quality in abundance as if in concentrated form of a seed-producing annual, biennial or perennial that does not develop persistent woody tissue but dies down at the end of a growing season.\n“Must be religion,” Alexander Great said. “We pay tribute to you, goddess Herbal Essence,” he shouted at moving picture screen.\nI hoped that her loud words would call you out, but the picture people were all there was of you.\nWe have come to conclusion as to your whereabouts now, after searching city and suburb and finding it all empty, not even your bodies there to rot in sun. I wish you had not frightened so easily. I wish you had not hidden yourselves away. We would not have ruled you poorly. We would have given you the things you need: food, water, boxes, and screens to compose your entertainments. So we would have worked you until you bled. So we would have turned your undergrounds to torture chambers; we would have given everyone equal turn. Everyone not worry anymore about these money things and sickness. We have technology for this. No more like bad entertainments Patch Adams and It’s a Wonderful Life, which were not your best, I’m sure you know. No fun in these. No time for violence when worried with sick and money. We would make sure there was time.\nWhen we went to suburbs, we found smaller boxes all empty there too. Ash piles in driveways and ash piles in food rooms and ash piles in dead grass outside. We looked at each other out in hazy sun and I told them you had gone.\n“These people smarter than we thought,” I said. “They saw ship come down and they turned on invisibility devices. Their technology better than we imagined. Like Harry Potter. They used cloaks to hide from us.”\n“Why hide?” Alexander Great asked.\n“Hide,” Joker said. “Hide hide.”\n“They hide because stubborn. They do not like idea of being ruled. They want rule themselves. They do not understand that we rule them better. That bring peace by giving violence. That our own people loved us. That they would love us too.”\n“Come out,” Joker yelled.\n“That is not way,” Samara said. “They won’t come out. Can’t.” She bent and stuck her hand into pile of ash, let ash fall through fingers. When she held palm out for us to see, small chunks of white remained and flattened piece of metal with red gem attached. “Is bodies,” she said.\nWe said nothing, just stared, then burst laughs. “Perfect joke,” Alexander Great said. “Is good. Worthy of entertainments.”\nSamara let the pieces fall to ground. Nodded but did not laugh with us. “We are alone,” she said. We laughed again.\n“We will figure out invisibility,” I said, sensing Samara’s distress despite her attempt at brightening mood. “Do not worry, Samara, rest of kinfolk. Will all be as planned soon.”\nInside the box we found empty rooms with frames on wall showing people smiling too wide to be true, and your own entertainment box, and portable entertainments which we loaded in and let scan. There were few we had not seen. We explored rest of house and found entertainment boxes in two more rooms, portable entertainments of many shapes. Joker likes your Grand Theft Auto and your Silent Hill, thinks these are every bit as good as the entertainments we grew up with, maybe better because interactive. I did not watch him do these for long. I explored the rest of the box.\nThere were many items I could not find sense for. Little wooden blocks, couch covered in so many pillows you could not sit on, though this is what I understand couch is for. I poked at pillows in case they had special power, but they seemed just pillows. There was dead flower in glass vase and pictures on wall that did not move. These were things rarely noticed in your entertainments. I had not thought of them before, of their what and why. I touched unmoving picture and nothing happened. I touched frames where little kinfolk picture lived and nothing there too. I tried to match confusion to red book, whys to red book, but could not find reasons for objects’ existence. I sat on couch with too many pillows, on top of all pillows, and thought maybe we do not understand you as well as we thought.\nWe are willing to compromise. If you show yourselves, we will try our best to be gentle and make lonely disappear like unmoving picture in square that promised PlayMatez for lonely like us. Where are our PlayMatez? We see only empty city. Please come out. Come out, wherever you are.\nIn your room of bath I found Samara turning knobs for water. She looked up when I came in, left knob on. Water poured from faucet and disappeared down drain. I sat on edge of tub and watched as fog filled room. Looked like fog inside us. There was one window in room, and the fog went toward it, as if trying to run. It warmed our bodies and we watched as it swirled toward light. I thrust my hand into the air and touched it. Never had I touched the fog before. It made hands wetted and clammy and moved around me as I stood up into it. I wanted to open my mouth and breathe it in, but was not right kind of fog for breath. Wanted part of your world inside me for understand. Wanted to feel as if some part of you were still here to be consumed and ruled. But I let the fog drift toward window. And when it had collected and hung there, I opened window and let it out.\nBonnie Jo Stufflebeam lives in Denton, Texas, with her fiancé and two literarily-named cats—Gimli and Don Quixote. She has work forthcoming in Strange Horizons, Daily Science Fiction, and Goblin Fruit and has had fiction appear in Expanded Horizons. She's currently completing her MFA in Creative Writing at the University of Southern Maine's Stonecoast program. Follow her on Twitter @BonnieJoStuffle."}