{"fingerprint": "LwomVncE2CNTfukGbLE4iKpMxwk=", "sitename": "Clarkesworld Magazine", "title": "The Butcher of New Tasmania by Suo Hefu, translated by Andy Dudak", "author": "Suo Hefu; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/suo_02_19_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Butcher of New Tasmania by Suo Hefu, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2880 words, short story\n The Butcher of New Tasmania\n Mail type: L-1\\regular mail (audio file)Confidentiality ranking: 0Sender: Larry Wu, Ministry of Justice A-3190 Detainment CenterRecipient: Confederation Justice Emergency Relief and Special Pardon Committee\n Respected Committee Members:\n I trust that all of you, upon receiving this message, already have a suitable understanding of my case. I should note that the Confederation Broadcasting Network and other media platforms have taken it upon themselves to dub me “The Butcher of New Tasmania.” I would call this “Krikun” reporting, after a character in the 1942 Soviet drama Frontline. This Krikun is a special correspondent who is supposed to be covering the battlefront. The name means “one who likes to shout,” or “braggart,” or “bullshitter.” The satirical author portrays Krikun avoiding the front or any deep engagement with the armed forces, spending his days at the front’s general headquarters, speaking without thinking, committing fraud, and “creating” news. A first-rate style indeed.\n According to the wording of the indictment presented at court, I’m facing over half a century of prison time for “deliberate and violent genocidal activity” on the planet designated New Tasmania. As far as I can tell, the facts narrated in the indictment are true.\n But I don’t believe I’m guilty.\n Rest assured, I concede the following facts:\n I was the medical officer and biologist of the Vitus Bering’s exploration crew. Our licensed exploration team—what they nowadays call “bounty envoys”—departed for the frontier of the Old Confederation’s colonized zone. Our goal was Confederation award money. We arrived at the world that had been named New Tasmania during the Old Confederation Era, a terrestrial planet, and still inhabited. I descended to the surface with my colleagues—may their souls rest in peace—where we contacted the locals. I won’t deny that our exchange with these natives was far from pleasant. Finally, I admit that after leaving the surface of New Tasmania, I did something in the Vitus Bering’s automated biochemistry lab, and this led directly to . . . Well, after I woke from over a century of sleep, New Tasmania had lost a race of people.\n That’s right, I concede the veracity of the above-mentioned facts. At the beginning of every court session over the last three weeks, I had to admit these damn things, and it made me sick. But these facts in no way prove I am guilty of genocide, racism, or any sort of hate crime—unless, that is, you are willing to swear to whatever gods you believe in that hatred could somehow inspire a loathsome villain like me to save hundreds of thousands of lives.\n I saw New Tasmania for the first time on January 22, New Calendar Year 102—that is, 121 years, ten and a half months ago.\n As far as I know, less than half a million people had been born in our New Confederation before that day. We’d just broken away from the Old Confederation, from the shadow and turmoil of its long decline. The New Confed had begun extending feelers from the core worlds of Happy Valley, New Earth, Icaria, and New Atlantis, following footprints of former glory into the Milky Way.\n Two years, one month, and nineteen days before I set out, the Confed Parliament passed its “Licensed Exploration Bill.” This allowed qualified private organizations to secure Ministry of Foreign Affairs authorization and conduct autonomous exploration. The idea was to seek ancient colonies that had been isolated by the collapse and convince them to return to the fold. Captain Obolomov of the Vitus Bering was one of the first to apply for certification. If I remember right, we were the eighth or ninth crew to qualify. I was among its founders.\n Those first bounty envoys tended to focus on ancient colonies that were clearly indicated on Old Confederation navigational charts, or in the old literature—this was about reducing risk. But Obolomov wasn’t like other captains. From among countless Old Confederation colonies, he chose New Tasmania, a remote, little-known ocean world.\n “The first step is always the most difficult, comrades,” Obolomov said at the time of his decision. “We’re limited both in personnel and strength, so colonies that may still possess near-space defense fleets are probably not our best option. Not at this time.” Of course, he left something unsaid: according to the woefully inadequate Old Confederation data, New Tasmania, like hundreds of other single-product-economies, lacked the foundations of industry and agriculture, and had probably become depopulated. Our contract stipulated land-derived bonuses for explorers with priority discovery rights, in the event of an uninhabited colony world. Moreover . . .\n But I digress. Let’s return to the matter at hand.\n In brief, before we embarked, Obolomov made a . . . no, I should say two mistakes. First, New Tasmania turned out to be inhabited. Second, visiting worlds armed with rocks and sticks is no better than visiting a world defending itself with a near-space fleet. True, this wisdom has been envoy common sense for a long time, but back then, today’s common sense was still in the remote future . . . to say nothing of the fact that at the time, we were anticipating pristine, lucrative landscapes with not a soul in sight. There were no unpleasant possibilities on our list of considerations.\n Of course, we had our reasons for such thinking: from a certain point of view, New Tasmania was a nearly perfect copy of Old Earth—it had Earth-equivalent gravity, atmospheric pressure and composition, and an Earthlike biosphere. The diameter of its satellite was somewhere between Ceres and Luna. It revolved around a Sol-like yellow dwarf. The only difference was the planet’s interior: the radioactive heavy elements had decayed. The asthenosphere, its energy exhausted, had solidified. There was no plate drift, no orogenesis. Hundreds of millions of years of erosion had ground the surface down, and New Tasmania had become an ocean planet. Only islands remained, scattered over the surface like countless stars. Besides oil—long-ago exploited—this beautiful world had no mineral resources worth mentioning. There was also a dearth of arable soil. During the Old Confederation Era, the mainstay industry was tourism. And as everyone knows, after the collapse, residents of tourism worlds either fled to more self-sufficient planets, or they suffered in isolation, with no manufacturing ability, dwindling away toward extinction.\n But New Tasmania turned out to be an exception.\n As the goddamn media has emphasized countless times, we found New Tasmania populated. Over one-tenth of its islands were occupied by the descendants of ancient colonists. They were like the Polynesians of Old Earth. They piloted large catamarans and left the originally-settled big islands (including the one resembling Tasmania in size and shape for which the planet was named) and followed island chains, the remnant mountain ranges of this tectonically-dead world, ceaselessly expanding. They grew taro in the rarefied, wind-eroded soil. They used ground-up fish and plant starch from something like sago to raise pigs. They hewed down jungles with polished volcanic rock axes.\n “This should not be difficult work,” Obolomov said. Recon drones disguised as living things had sent images back to the Vitus Bering. The captain was vexed, like the rest of us, but he pounded his chest and bolstered his confidence. “These people are nothing but savages!” He performed an exaggerated Maori war dance as he spoke. “Nothing but a group of barbarians! Comrades, I daresay the moment we land in our shuttle, these simpletons will think us gods and prostrate themselves. By this time next month, our great Confed will have recovered a new member world, and we can start drawing our bonuses from the Ministry of Foreign Affairs. What do you say?”\n Unfortunately, this was the captain’s final mistake, which meant it was the whole crew’s final mistake.\n The next day, after entering New Tasmania orbit, the Vitus Bering’s crew—altogether a dozen souls, and besides Obolomov, all of us of Old Earth East Asian descent—rode the rickety, old-fashioned shuttle down to the surface. We landed on an island similar in size and shape to Old Earth’s Samoa. Yes, I know modern bounty envoys aren’t permitted to do so. Thousands of lessons have branded the word “prudence” onto their collective cerebral cortex. Before setting foot on a world, well-paid sociologists, biologists, and anthropologists spend hundreds of hours conducting holistic research and observation. Then comes specialized risk assessment. But at that time, we had none of this.\n Old Obolomov, though, this wasn’t his first foray. He had a small gun in his pocket, to guard against the unexpected, but when the local women surrounded the shuttle, ochre-painted and flower-decked and all smiles, the old boy forgot about his concealed weapon, like it had fallen through the event horizon of a black hole.\n At first, Obolomov’s assessment seemed to have been dead-on: the natives seemed no more than harmless savages. They lived in Viking-style longhouses made of the local giant pteridophyte stalks. They were painted head to toe in bizarre patterns of indigo blue. Their most advanced technology was a natural rubber they roasted and fashioned into balls, then hit back and forth to each other with large wooden bats, badminton-style. We used Old Confederation Era Common Tongue to ask about industry, star travel, computers, and so on, but all we got in return were head shakes and absurd stories—of course, the latter might be considered treasure by cultural scholars.\n Although their living conditions were not enviable, most of these people seemed healthy, strong and beautiful, with light brown curly hair. They seemed perfect examples of that formulation of 18th century Enlightenment philosophy: “the noble savage.” Their only imperfection was their bifurcated tongues, snakelike . . . but such small changes are quite common on secluded fringe worlds. We weren’t too surprised.\n I noticed that upon seeing our black hair, some of the natives betrayed fear and hostility. Unfortunately, we took this for first-contact jitters and paid it no mind. It didn’t help that the islanders’ chief declared a feast to welcome the “honored guests,” a feast, he said, that no one would ever forget.\n Each crew member was attended by at least half a dozen girls. Jugs of cassava beer were brought into the village’s public longhouse, to wash down the taro cakes. The higher-ups of the island took turns offering us a large goblet of snowstone to drink from, adding praise like delicacies to go with the alcohol.\n Quite soon, my companions got drunk and lost consciousness. They were like aphids glutted on sap, their little legs unmoving.\n Our hosts suddenly produced hatchets.\n The bloody, ruthless moments that followed are hard to relate. I suppose my delirious companions never knew what hit them. The sharp flint blades came down, severing windpipes and vertebrae . . .\n Because of the alcohol, I can’t clearly recall what I did, but I know I made it back to the shuttle—despite sustaining a wound.\n Luckily, I had once taken a shuttle pilot training course. I was able to return to the Vitus Bering and treat my wound in the infirmary. But I didn’t know how to pilot a starship, and I’d never taken courses on ansible communication. The ship’s high-powered radio was operational, but transmitting to the nearest colony at light speed would take a century. It was clear to me I had but one choice: send a distress signal, fire up a shipboard hibernation casket, then pray it could sustain me until the rescue team arrived.\n But I didn’t do that—at least, not immediately.\n A week later, I piloted that rickety old shuttle back down to the island of the slaughter, and hovered over it. This time, the high rez cameras showed me smoking ruins. Several sailing catamarans were berthed on the rocky, wave-battered shore. A large group of people armed with war clubs, hatchets, and flint-point spears were using the longhouse ruins as campfires. These people resembled the island’s residents, but they had straight black hair. The village’s women and children had been rounded up like livestock, while the men . . . I saw no adult men with curly brown hair, but chunks of meat were smoking over the fires. I felt sick to my stomach.\n Regrettably, I didn’t stick around to collect thorough video evidence. If I had, these screeching ethnic diversity activists who spend their days outside the detention center denouncing me as a “butcher,” might be educated.\n Over the next three months, I witnessed three more savage invasions. Adult men became smoked meat, women and children were carried off. The raiders all came from the big islands on New Tasmania’s equator.\n After a year had passed, I began to understand the motive behind this brutality.\n I believe you committee members already know, via the media, part of what I shall relate next. Unfortunately, the other side of the story has been treated negligently—even though I emphasized it in court many times.\n As we all know, New Tasmania’s settlers mostly came from Old Earth’s Southeast Asia. After the planet sank into isolation, the inhabitants branched into two races due to geographical conditions. These two races were nearly identical. There was a chance gene variation, and a small group of main island inhabitants with curly brown hair and bifurcated tongues had to flee in their catamarans. In the eyes of their “normal” relatives, they were spawned of witchcraft. They were evil. They had to be wiped out wherever they were found.\n To violate the prohibition against taking life, for such small, harmless physical differences . . . it seems absurd, right? But it’s not so surprising in the final analysis. When people realize how chaotic, dark, ridiculous, and hypocritical their society is, finding a scapegoat is clearly more alluring than introspection. Old Earthlings blamed heathens and witches for their misfortunes. Should it surprise us that a group of uncivilized New Tasmanians—their fishing boats wrecked by storms, their taro rotting, their bodies ravaged by pig nematodiasis—persecuted “wizards” with curly hair and forked tongues?\n I didn’t hate the murderers who landed me in this predicament. To them, black hair meant peril and death. They acted in self-defense. But I couldn’t just turn my back on what was happening, and lay down, and enter the dreamless Big Sleep. Granted, I had no responsibility toward the New Tasmanians, legally speaking. I expected no honor or reward for acting righteously.\n But I couldn’t turn my back on them. I had to do something.\n On November 2nd, New Calendar Year 113, I entered a hibernation casket. As I predicted, the senseless killing on New Tasmania ground to a halt within 40 years. Although the main island residents continued to expand and emigrate due to population pressure, and there were conflicts with local populations, the large-scale ethnic massacres were a thing of the past. These tragedies had become nothing more than sad old legends in local minds by the time a Confed rescue team found the Vitus Bering in synchronous orbit. They woke me and showed me the arrest warrant. The charge was “genocide.”\n Genocide . . . in a manner of speaking, this charge is accurate. In the three months before I entered hibernation, I used the Vitus Bering’s bio lab to tweak a local adenovirus. Then I used the shuttle to scatter my creation across the planet’s surface. This little pathogen infected native reproductive systems and zygotes, but in most cases had no effect. But variant zygotes—those that would have developed curly brown hair and forked tongues—were altered at the time of cell division. A few genes were prevented from replicating. That’s all. The fetuses developed normally otherwise.\n Simple and effective. Virtually no side effects. My preferred way of doing things.\n A few variant genes, a handful of negligible nucleic acids: it doesn’t take much to produce a race. Of course, this also means a tiny edit can annihilate a race. According to the “Confederation Anti-ethnic Cleansing and Genocide Act,” I did indeed wipe out a race. But each and every individual of that race lived on. I prevented hundreds or maybe thousands of massacres and wars. I enabled several hundred thousand people to die naturally of old age. Granted, my actions may have caused an irreversible loss to racial diversity . . . Fine. What choice did I have at the time?\n My lawyer says I could have ignored the events on New Tasmania, and just taken the Big Sleep. Hundreds of thousands of people would have lost their lives, but that wasn’t my legal responsibility. The rescue team could’ve found two races of New Tasmanians. The price? Hundreds of thousands meaninglessly dead. But I’m guessing the Confed Ministry of Justice won’t consider this. The notion of responsibility changes when you’re far from civilization. How can they truly understand my decision? Moreover, I can’t imagine them deliberately trashing the doctrine of racial diversity on my account. As for those martyrs willing to sacrifice themselves for their race, they’ll never see things my way. Never mind the hate-mailers, or the media parasites decorating front pages with “genocide” in bold font.\n Having said all this, I seek just one answer from the respected committee members:\n If you found yourself in my situation at that time, what would you have done? Hundreds of thousands of people versus a race: On which side of the scales would you have placed the decisive weight?\n Please tell me that . . .\n Originally published in Chinese in Science Fiction World, Seventh Issue of 2016.\n Translated and published in partnership with Storycom.\n Suo Hefu was born at a uranium research institute in Sichuan province, and currently lives in Nanjing. He studied for his master's in Central Asian history in Urumqi, Xinjiang province. In addition to writing, he enjoys historical research—particularly military history—and chess. He's had nearly thirty short stories and novellas published, including \"Return the Soul\" and \"The Cell\" in Science Fiction World, China's premier science fiction magazine. He also writes popular science articles and literary criticism.\n Andy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}