{"fingerprint": "2Wf4Yi1+byDUT2ggP1Lhc+W2EpA=", "sitename": "Clarkesworld Magazine", "title": "Interview with Steph Swainston by Jeff VanderMeer", "author": "Jeff VanderMeer", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/swainston_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Interview with Steph Swainston by Jeff VanderMeer", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Dangerous Offspring: An Interview with Steph Swainston\n Steph Swainston, from the publication of Year of Our War (Crawford Award winner), the first of her Fourlands novels, has been highly touted as a writer of unique and challenging fiction that just happens to be set in a secondary world—although Swainston, as is evident below, sees her creation more as a reflection of our world. The novels feature the ambivalent and fascinating Jant, who can fly, and a war against giant insects. The latest and third volume in the series, Dangerous Offspring, came out in the early summer from Eos.\n As a writer of unconventional fantasy myself, I thought it would be interesting to interview Swainston, and we conducted an email exchange during August and September that resulted in the interview below. I could easily have continued with a third or fourth round of questioning, but the fun had to come to an end at some point.\n What do you love most about fiction?—writing it, reading it, or however you want to interpret the question.\n I love quality the most; beautiful writing excites me more than anything else. Sometimes I am so thrilled it's like standing on top of a high cliff looking down an immense drop, or the sense of sick anticipation you get when riding a rollercoaster ratcheting up the incline to its fastest run. I love to read it and write it. To me, literature is the highest art form and I've been shocked to find how few genre writers agree.\n Fiction is a way of looking at the world, thinking about it, the better to understand it. Samuel Johnson said: 'The purpose of writing is to enable readers better to enjoy life or better to endure it.' That's rubbish. The purpose of writing is to enable the writers better to enjoy life or better to endure it. They have to write. If they didn't, they'd go crazy.\n That does bring up a question, though—don't you have to consider the reader to some extent, in terms of giving the reader enough space in the narrative to enter into a kind of dialogue with the writer and the writer's creation?\n Yes. It's a balance I'm always trying to improve. But I think some authors, especially in SF, agonise too much over who the reader is—which leads to all sorts of problems: uneven prose, dumbing down, or writers' block. I will never underestimate the reader's intelligence and will always allow them to make their own conclusions about characters and situations in the novels without telling them.\n It is impossible for an author to know who the reader is, or the reader's mind. All I can do is hope that my taste accords with that of readers—and that there are sufficient readers with discerning tastes to make my work commercially viable. If the writer goes against his own taste in an attempt to sell blockbuster numbers of books he may well be doomed to failure.\n There are a lot of readers, they all want something different, and to please them all you would be like the merchant in the Aesop's fable, who tries to please every bystander on the way to market and ends up carrying his own donkey. Or your book will be a donkey.\n Writers who are very commercially successful are usually not \"guessing\" the majority readership tastes correctly; rather, their own tastes coincide with the masses. So what I do is assume the reader is a reasonable person much like me. If I tried to make the Castle books conform to a more commercial fantasy taste I would be warping the Castle world from its original purpose.\n So, instead of worrying about the gap between author and reader, you can use it to your advantage. Give the reader a scene and let his imagination take it as far as he wants. Open metaphors are useful too: let the readers draw their own interpretations! I always thought the invisible characters in Christopher Priest's The Glamour were a metaphor for the fact that some individuals are more invisible than others—some people can never get served in a bar, while others have a formidable presence. I was rather put out when Priest told me he didn't intend such an allegorical interpretation.\n What draws you to fantasy fiction?\n Well, I don't really think of it as \"fantasy\" fiction. I prefer not to draw lines between good fantasy and good mainstream literature, but see the whole thing as a continuum. As an author I have to look at it that way so I don't constrain myself but can do anything. I didn't consciously set out to write fantasy; I'm writing the Castle mythos—something that interests me—and it's up to readers how they want to classify it.\n I share an interest with this kind of fiction because it's adept at using the deep structures of myths that will always be relevant and compelling, as long as we continue to be human. They are the precepts of storytelling—a clear roadmap the writer has to follow for the story to be great. Obviously you can twist them and play variations but, for example in Dangerous Offspring there can only be one outcome once Cyan had levelled her Challenge.\n Do you ever consciously try to subvert myth, though? To not give the reader the expected archetypal outcome?\n I'm not talking about \"archetypal outcomes.\" I'm talking about structures that are understandable owing to the way we are human: with normal patterns of human wants. The structures of male/female relationships, or relations of power and hierarchy which have recurred through the world ever since the Palaeolithic. Every human in the world has, encoded in his or her mind, the emotions and needs of the group animals we once were—and still are.\n That's why it is important not to be too weird in fiction. If you subvert archetypes too much, or give archetypes a cameo role rather than making them the root, the reader will feel disappointed even though he may not know why. Books such as Harrison's A Storm of Wings suffer from having nothing human nor relevant to people's lives to relate to. It's beautiful but unreadable. Even my Rhydanne or Vermiform characters have some human drives. Rhydanne miss some aspects of humanity but have an attractive predatory speed and grace.\n When a story deviates from the structure it will seem wrong. If the story demands an unpleasant end the writer must have the courage to conform. For example the Terry Gilliam film Brothers Grimm ended terribly because if you have two brothers competing for one woman then one brother must die, or lose badly, or be left behind. Two men competing for one woman, especially if the men are related, will NOT end with them still being friends! One of them must go, or, for the brothers to be reconciled, the woman must go.\n In Dangerous Offspring I show that the power of one generation must be handed over to the next - or the next generation will seize it. One generation always adapts the heroes of the previous one to its own means. Lightning knows when to stop, which is the highest attribute of power. He knows he must step back and allow himself to be superseded or the stagnation in his life and in the world will continue. Lightning's very presence is a sea-anchor slowing progress but keeping its course more certain.\n In this case Jant—in many ways Lightning's sidekick—is given the task of mentor to Cyan. So he can't sleep with Cyan and their relationship will be more pure. Jant is forced, by Lightning, to grow up; to become the leader. We shall see later whether he actually has it in him to become the mature Eszai.\n Have you always written work set in an imaginary place?\n I have always written Castle but I also write poetry—there's some on my website: www.stephswainston.co.uk. Yes, the Fourlands is an imaginary place but it's a mirror to hold up to the real world—it is my comment on, for example, class-A characters and our overly-competitive society in which meritocracy itself is often little more than a fantasy. In future, I plan to expand on this material by writing novels set in the real world, too. But first there will be some more Castle.\n The Fourlands may be an imaginary place but it is always based on real life. I describe real places and characters, and enlarge them out of proportion, zoom in on certain aspects, and that's how I make fantasy. I have done this since I was eight years old, but when I lived at home with my parents I had to keep it secret because they were very disparaging. I had to hide my notebooks—under the bed, that kind of thing—and once, in a plastic box in the woods behind the house. I kept going, regardless of derision, which incidentally is the advice I'd give to any aspiring author—never give up.\n What's your take on the idea of \"world-building\", then? M. John Harrison had some dismissive things to say about it on his blog recently. I agree to some extent, but don't there have to be some rules, some \"world-building,\" in order for a place to seem coherent enough for a reader to buy into it?\n There is a range of approaches. Most fantasy authors seem to want their world to stand alone, as if it really exists. But I am using the Fourlands to write about the real world—our world—and about the real people, problems and relationships I see around me. Terry Pratchett frequently used the Discworld this way.\n Some authors create secondary worlds just to set adventures in—a fact I find bizarre, because the most thrilling and arduous adventures happen in our world. But at the same time the Castle world has been worked out coherently to a great extent. So there is something for all readers' tastes. Of course the readers know that the world isn't real but they enjoy suspending disbelief. The consistency or 'realism' helps this, and that's part of the entertainment a book should offer. Dickens didn't feel the need to tell us, in every chapter of Great Expectations, that Pip isn't real or to flay the reader for daring to sympathise with a figment of their imagination. Why should fantasy be any different? I certainly enjoy suspending disbelief when I'm writing—that's part of the escapism that the Castle world has always offered me, and I'm glad to share it with readers.\n An author will stifle himself if he tries to tie himself to one definition of fantasy only. Rigidity in approach will only lead to rigidity in your creation. I think it is much healthier to allow yourself a range of approaches to your world. It will give your creation many more facets if you can see it as the obviously-constructed artefact it is, and a world into which life can be breathed, and a parable, and a place to put observations about our world, and an escape from our world, and somewhere to fantasise about sexy characters, and also put it to any other service you can think of!\n How has your science background influenced your writing?\n First, the Fourlands runs on scientific principles as much as I can make it and still include things I enjoy. The Shift is a break from such rigorous rules, but some of the Shift creatures and many details of the Insects come from observations of the natural world.\n Second, I include observations of people I've met in scientific jobs. Frost, the Circle's Architect in Dangerous Offspring, is a compilation of different engineers I've met, as well as myself. She builds a dam at the Insect front as part of her plan to push the Insects back, and she is rightly proud of her project—but unwittingly creates the worst disaster yet for the Fourlands. As ruthlessly ambitious as all immortals are, she responds with determination to overcome the disaster and continue with her plans. This inevitably takes a very great toll on her mental state. I witnessed a similar situation when I worked for a bio-tech start-up company: driven, scientific personalities responding as the company started to 'go under'.\n Having a scientist for a father, my feeling is that scientists are just as irrational and just as chaotic as people in any other profession. Would you agree?\n Yes and no. There's a discrepancy between their personal life and their published work. That comes across strongly with Frost in Dangerous Offspring. She's a genius architect and engineer, an Isambard Brunel or Christopher Wren. But she's also incredibly sentimental: immortality sits heavier on her than with most other Eszai because she misses her husband, who died during the Challenge when she was trying to gain immortality. She thinks she failed to save him and Eszai don't cope well with failure— Frost psychologically beats herself up with her loss and it's become a very long-term habit.\n Outside their specialist areas scientists rely on hearsay and prejudice just as much as everyone else. Also, peer-reviewed journals can be unreliable or corrupt, but hopefully not as much as open journals. There is a level of rigour and self-discipline and, as a result, pride, in science that I much admire.\n But remember: a little touch of chaos in an otherwise scientific mind is what leads to great discoveries. Some of the most important things I found while pursuing archaeology were on a whim and a hunch: bones from the Red Lady skeleton, a new type of stone tool from a cave in Wales, an Ice Age spear point in Ely museum, a blue glass bead in a Roman barracks. I found them because other people had overlooked them or thought that such things couldn't be possible. True scholars have open eyes and an approach capable of looking at a question from angles not previously considered—but also a scientific rigour to know how to use the discoveries.\n Incidentally, the geniuses that the Emperor saves from every age by giving them immortality and making them Eszai bicker amongst themselves something awful. Imagine the sparks that would fly if Miyamoto Musashi, Leonardo da Vinci, Vesalius and Louis Pasteur lived in one building!\n How do you approach starting a novel? When do you begin writing it?\n I begin straight away, but for the first couple of months I take time to do research, go through old notes and photographs. Then the relative amount of time spent on research declines and time spent doing writing increases until it's all writing. It's a natural process. I try to research for more than one book at a time—future novels will need less research as I already have a lot left over.\n What's the worst part of writing a novel, for you?\n I love most aspects of writing for publication but I dislike the Vanity Fair that surrounds it. I swear to you I have had more interesting discussions with my hairdresser about writing than with some of the people who preen themselves as literati.\n How much of a difference is between the novel you write and the novel readers read?\n Oh, there is a massive chasm—but that is inevitable, because readers can't fully know my mind and they read a story with their own experiences as raw material. My aim is to create images in the readers' minds, in the same way as certain pieces of music trigger your imagination, but they will build the pictures they 'see' from their own experiences. The places and people they've known are different from mine; that's something every author has to accept.\n The hallmark of great art is its capacity to generate diversity of opinion, since, as Oscar Wilde said: 'it shows that the work is new, complex and vital'. For a novel to have any value it must be able to provoke the reader into an intelligent response—to rouse controversy and discussion.\n You can read the Castle books as rollicking heroic adventures: \"kicking Insect butt,\" or you can look deeper—in Dangerous Offspring Lightning and Cyan show the difficulties of bringing up children, of the father-daughter relationship and of the communication between the generations.\n How do you \"manage\" that effect? In terms of providing surface entertainment and then also depth? Is it all about what you do during the revision process? I assume it can't be consciously in your mind at the rough draft stage.\n Yes, of course it is—in my mind long before the rough draft stage, because it is my natural taste to have both. We talked about how an author should be true to her taste in the first question.\n Some of Castle is autobiographical; I hope that makes the novels read more truly than most other fantasy. Sometimes the most seemingly unlikely details are based in fact—for example: In Dangerous Offspring, when Jant finds Cyan and gives her artificial respiration, it's based on my memory from when I had to do the same, at midnight, to a classmate who had collapsed from solvent abuse. And my sister once had to give artificial respiration—on her birthday, no less—to an old lady who died.\n When Frost builds a wall of books to mark out her office during the crisis of the Insect flight, well, I have seen someone do that. It was quite disturbing then, too.\n Do you believe in the existence of Evil?\n Certainly not. 'Evil' is just a strong word for something you don't like.\n So genocide perpetrated by a dictator, for example. That's not \"evil\", that's just something people don't like? I'm not trying to dissuade you from your definition, but it seems to me there's probably more you could say.\n You can't dissuade me from my definition. But there is a dangerous duality here. The 'evil' that is something people don't like accords with the deep structures in their minds I mentioned in the second question. Acts seem evil because they go against the instincts of the animals we once were—I think all hominids roughly followed such ideas of 'right' and 'wrong' for their own good. On top of that, cultural beliefs influence what people call evil. The fact that people from one culture unthinkingly call people from another culture 'evil' when they mean 'different' is a major source of strife in the world today.\n Does genocide become more 'evil' if it's perpetrated by a dictator? How about a democracy? The indigenous peoples of America suffered a genocide at the hands of European settlers and, later, the United States—yet so many of the leading actors in this genocide are revered as national heroes (for example Custer and Philip Sheridan). Were they evil? Unlikely: greedy and aggressive, certainly. Did they see themselves as evil? I doubt it. Calling things 'evil' obscures their causes and by so doing makes them more likely to happen again.\n Moreover, dictators don't carry out genocide by themselves. Should we punish everyone involved? Who would be left? Such a simplistic morality is what causes genocide—the victims killed are usually the 'evil' ones in the minds of the perpetrators.\n Most acts of intolerance are based on over-simplification and a refusal to understand others. To describe something as 'evil' is the greatest simplification you can have. You close down all further hope of understanding it and possibly of preventing it.\n Evil™, as an adversary in fantasy novels, should be avoided at all costs. I have written three novels without once using the word 'evil', because the people of the Fourlands don't have the religious concept. Ironically, as a result they don't have as much conflict between cultures as we do.\n What do you most fear?\n Selling myself short.\n More than anything else? You don't fear death? How about the death of loved ones?\n Ha ha ha ha ha ha. OK, you don't know me. You're forgiven. I am not in the slightest afraid of dying. Nobody who has been through what I have will be afraid of it. If you face death your senses are buzzing! You feel alive! I have thrown myself out of planes, swum underground, all without fear of death. Who the fuck cares? As long as it's fast and relatively painless, I don't give a crap if it happens next minute or in fifty years.\n How can something so universally commonplace as death be frightening? Death isn't frightening because when you are dead you don't exist, you know nothing. So when you are dead you can't possibly be in a state of fear or pain, and wish you were alive.\n I'd hate to die, though, knowing I've sold myself short—that I haven't achieved all I could, and done my best in this life. Rather than dwelling on the future or past you should be aware of yourself and your surroundings in the present. Think big! Plan for the future but don't miss half your life looking back or looking forwards!\n There is one person whom I'd be very upset if he died, but seeing as I can't do anything about it—other than keep the car brakes maintained and trust to chance—it would be neurotic to worry about it, yes?\n Do you have a favorite or least favorite word?\n They come and go. The worst words are definitely business jargon—the conversational equivalent of elevator muzak.\n Best words? Well, at the moment I'm tickled by the Bronte sisters' word for peeling potatoes: \"pillopotating\". \"In the kitchen, pillopotating\". Spoken aloud in a dreamy manner it is a very relaxing word. Also try: \"villeggiatura\" and \"papilionaceous\".\n The Brontes had a contribution to make to fantasy literature—their Great Glass Town. Sometimes I wish the fantasy genre had grown from Great Glass Town instead of Middle Earth. But they were ahead of their time, and Charlotte Bronte knew better than to go public with such a private world, even though her brother Branwell pushed her to do it and I suspect Thackeray would have loved it. I like to use variety—and as little repetition of words as possible. It amazes me that so much fantasy writing is leaden and conservative, still influenced by Tolkien's use of a solemn, \"epic\" style. Anything can happen in fantasy, so why use such stilted prose?\n Jeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.\n Jeff's novel Finch and writing book, Booklife, are forthcoming this fall."}