{"fingerprint": "k6NELIDmOQJMO016JwHAndR/3d8=", "sitename": "Clarkesworld Magazine", "title": "Ancient Engines by Michael Swanwick", "author": "Michael Swanwick", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/swanwick_04_17_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ancient Engines by Michael Swanwick", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2820 words, short story, REPRINT\nAncient Engines\n“Planning to live forever, Tiktok?”\nThe words cut through the bar’s chatter and gab and silenced them. The silence reached out to touch infinity and then, “I believe you’re talking to me?” a mech said.\nThe drunk laughed. “Ain’t nobody else here sticking needles in his face, is there?”\nThe old man saw it all. He lightly touched the hand of the young woman sitting with him and said, “Watch.”\nCarefully the mech set down his syringe alongside a bottle of liquid collagen on a square of velvet cloth. He disconnected himself from the recharger, laying the jack beside the syringe. When he looked up again, his face was still and hard. He looked like a young lion.\nThe drunk grinned sneeringly.\nThe bar was located just around the corner from the local stepping stage. It was a quiet retreat from the aggravations of the street, all brass and mirrors and wood paneling, as cozy and snug as the inside of a walnut. Light shifted lazily about the room, creating a varying emphasis like clouds drifting overhead on a summer day, but far dimmer. The bar, the bottles behind the bar, and the shelves beneath the bottles behind the bar were all aggressively real. If there was anything virtual, it was set up high or far back, where it couldn’t be touched. There was not a smart surface in the place.\n“If that was a challenge,” the mech said, “I’d be more than happy to meet you outside.”\n“Oh, noooooo,” the drunk said, his expression putting the lie to his words. “I just saw you shooting up that goop into your face, oh so dainty, like an old lady pumping herself full of antioxidants. So I figured . . . ” He weaved and put a hand down on a table to steady himself. “ . . . figured you was hoping to live forever.”\nThe girl looked questioningly at the old man. He held a finger to his lips.\n“Well, you’re right. You’re—what? Fifty years old? Just beginning to grow old and decay. Pretty soon your teeth will rot and fall out and your hair will melt away and your face will fold up in a million wrinkles. Your hearing and your eyesight will go and you won’t be able to remember the last time you got it up. You’ll be lucky if you don’t need diapers before the end. But me—” he drew a dram of fluid into his syringe and tapped the barrel to draw the bubbles to the top—“anything that fails, I’ll simply have it replaced. So, yes, I’m planning to live forever. While you, well, I suppose you’re planning to die. Soon, I hope.”\nThe drunk’s face twisted, and with an incoherent roar of rage he attacked the mech.\nIn a motion too fast to be seen, the mech stood, seized the drunk, whirled him around, and lifted him above his head. One hand was closed around the man’s throat so he couldn’t speak. The other held both wrists tight behind the knees so that, struggle as he might, the drunk was helpless.\n“I could snap your spine like that,” he said coldly. “If I exerted myself, I could rupture every internal organ you’ve got. I’m two-point-eight times stronger than a flesh man, and three-point-five times faster. My reflexes are only slightly slower than the speed of light, and I’ve just had a tune-up. You could hardly have chosen a worse person to pick a fight with.”\nThen the drunk was flipped around and set back on his feet. He gasped for air.\n“But since I’m also a merciful man, I’ll simply ask nicely if you wouldn’t rather leave.” The mech spun the drunk around and gave him a gentle shove toward the door.\nThe man left at a stumbling run.\nEveryone in the place—there were not many—had been watching. Now they remembered their drinks, and talk rose up to fill the room again. The bartender put something back under the bar and turned away.\nLeaving his recharge incomplete, the mech folded up his lubrication kit and slipped it in a pocket. He swiped his hand over the credit swatch, and stood.\nBut as he was leaving, the old man swiveled around and said, “I heard you say you hope to live forever. Is that true?”\n“Who doesn’t?” the mech said curtly.\n“Then sit down. Spend a few minutes out of the infinite swarm of centuries you’ve got ahead of you to humor an old man. What’s so urgent that you can’t spare the time?”\nThe mech hesitated. Then, as the young woman smiled at him, he sat.\n“Thank you. My name is—”\n“I know who you are, Mr. Brandt. There’s nothing wrong with my eidetics.”\nBrandt smiled. “That’s why I like you guys. I don’t have to be all the time reminding you of things.” He gestured to the woman sitting opposite him. “My granddaughter.” The light intensified where she sat, making her red hair blaze. She dimpled prettily.\n“Jack.” The young man drew up a chair. “Chimaera Navigator-Fuego, model number—”\n“Please. I founded Chimaera. Do you think I wouldn’t recognize one of my own children?”\nJack flushed. “What is it you want to talk about, Mr. Brandt?” His voice was audibly less hostile now, as synthetic counterhormones damped down his emotions.\n“Immortality. I found your ambition most intriguing.”\n“What’s to say? I take care of myself, I invest carefully, I buy all the upgrades. I see no reason why I shouldn’t live forever.” Defiantly. “I hope that doesn’t offend you.”\n“No, no, of course not. Why should it? Some men hope to achieve immortality through their works and others through their children. What could give me more joy than to do both? But tell me—do you really expect to live forever?”\nThe mech said nothing.\n“I remember an incident happened to my late father-in-law, William Porter. He was a fine fellow, Bill was, and who remembers him anymore? Only me.” The old man sighed. “He was a bit of a railroad buff, and one day he took a tour through a science museum that included a magnificent old steam locomotive. This was in the latter years of the last century. Well, he was listening admiringly to the guide extolling the virtues of this ancient engine when she mentioned its date of manufacture, and he realized that he was older than it was.” Brandt leaned forward. “This is the point where old Bill would laugh. But it’s not really funny, is it?”\n“No.”\nThe granddaughter sat listening quietly, intently, eating little pretzels one by one from a bowl.\n“How old are you, Jack?”\n“Seven years.”\n“I’m eighty-three. How many machines do you know of that are as old as me? Eighty-three years old and still functioning?”\n“I saw an automobile the other day,” his granddaughter said. “A Dusenberg. It was red.”\n“How delightful. But it’s not used for transportation anymore, is it? We have the stepping stages for that. I won an award once that had mounted on it a vacuum tube from Univac. That was the first real computer. Yet all its fame and historical importance couldn’t keep it from the scrap heap.”\n“Univac,” said the young man, “couldn’t act on its own behalf. If it could, perhaps it would be alive today.”\n“Parts wear out.”\n“New ones can be bought.”\n“Yes, as long as there’s the market. But there are only so many machine people of your make and model. A lot of you have risky occupations. There are accidents, and with every accident, the consumer market dwindles.”\n“You can buy antique parts. You can have them made.”\n“Yes, if you can afford them. And if not—?”\nThe young man fell silent.\n“Son, you’re not going to live forever. We’ve just established that. So now that you’ve admitted that you’ve got to die someday, you might as well admit that it’s going to be sooner rather than later. Mechanical people are in their infancy. And nobody can upgrade a Model T into a stepping stage. Agreed?”\nJack dipped his head. “Yes.”\n“You knew it all along.”\n“Yes.”\n“That’s why you behaved so badly toward that lush.”\n“Yes.”\n“I’m going to be brutal here, Jack—you probably won’t live to be eighty-three. You don’t have my advantages.”\n“Which are?”\n“Good genes. I chose my ancestors well.”\n“Good genes,” Jack said bitterly. “You received good genes and what did I get in their place? What the hell did I get?”\n“Molybdenum joints where stainless steel would do. Ruby chips instead of zirconium. A number seventeen plastic seating for—hell, we did all right by you boys.”\n“But it’s not enough.”\n“No. It’s not. It was only the best we could do.”\n“What’s the solution, then?” the granddaughter asked, smiling.\n“I’d advise taking the long view. That’s what I’ve done.”\n“Poppycock,” the mech said. “You were an extensionist when you were young. I input your autobiography. It seems to me you wanted immortality as much as I do.”\n“Oh, yes, I was a charter member of the life-extension movement. You can’t imagine the crap we put into our bodies! But eventually I wised up. The problem is, information degrades each time a human cell replenishes itself. Death is inherent in flesh people. It seems to be written into the basic program—a way, perhaps, of keeping the universe from filling up with old people.”\n“And old ideas,” his granddaughter said maliciously.\n“Touché. I saw that life-extension was a failure. So I decided that my children would succeed where I failed. That you would succeed. And—”\n“You failed.”\n“But I haven’t stopped trying!” The old man thumped the table in unison with his last three words. “You’ve obviously given this some thought. Let’s discuss what I should have done. What would it take to make a true immortal? What instructions should I have given your design team? Let’s design a mechanical man who’s got a shot at living forever.”\nCarefully, the mech said, “Well, the obvious to begin with. He ought to be able to buy new parts and upgrades as they come available. There should be ports and connectors that would make it easy to adjust to shifts in technology. He should be capable of surviving extremes of heat, cold, and moisture. And—” he waved a hand at his own face—“he shouldn’t look so goddamned pretty.”\n“I think you look nice,” the granddaughter said.\n“Yes, but I’d like to be able to pass for flesh.”\n“So our hypothetical immortal should be, one, infinitely upgradable; two, adaptable across a broad spectrum of conditions; and three, discreet. Anything else?”\n“I think she should be charming,” the granddaughter said.\n“She?” the mech asked.\n“Why not?”\n“That’s actually not a bad point,” the old man said. “The organism that survives evolutionary forces is the one that’s best adapted to its environmental niche. The environmental niche people live in is man-made. The single most useful trait a survivor can have is probably the ability to get along easily with other men. Or, if you’d rather, women.”\n“Oh,” said the granddaughter, “he doesn’t like women. I can tell by his body language.”\nThe young man flushed.\n“Don’t be offended,” said the old man. “You should never be offended by the truth. As for you—” he turned to face his granddaughter—“if you don’t learn to treat people better, I won’t take you places anymore.”\nShe dipped her head. “Sorry.”\n“Apology accepted. Let’s get back to task, shall we? Our hypothetical immortal would be a lot like flesh women, in many ways. Self-regenerating. Able to grow her own replacement parts. She could take in pretty much anything as fuel. A little carbon, a little water . . . ”\n“Alcohol would be an excellent fuel,” his granddaughter said.\n“She’d have the ability to mimic the superficial effects of aging,” the mech said. “Also, biological life evolves incrementally across generations. I’d want her to be able to evolve across upgrades.”\n“Fair enough. Only I’d do away with upgrades entirely, and give her total conscious control over her body. So she could change and evolve at will. She’ll need that ability, if she’s going to survive the collapse of civilization.”\n“The collapse of civilization? Do you think it likely?”\n“In the long run? Of course. When you take the long view it seems inevitable. Everything seems inevitable. Forever is a long time, remember. Time enough for absolutely everything to happen.”\nFor a moment nobody spoke.\nThen the old man slapped his hands together. “Well, we’ve created our New Eve. Now let’s wind her up and let her go. She can expect to live—how long?”\n“Forever,” said the mech.\n“Forever’s a long time. Let’s break it down into smaller units. In the year 2500, she’ll be doing what?”\n“Holding down a job,” the granddaughter said. “Designing art molecules, maybe, or scripting recreational hallucinations. She’ll be deeply involved in the culture. She’ll have lots of friends she cares about passionately, and maybe a husband or wife or two.”\n“Who will grow old,” the mech said, “or wear out. Who will die.”\n“She’ll mourn them, and move on.”\n“The year 3500. The collapse of civilization,” the old man said with gusto. “What will she do then?”\n“She’ll have made preparations, of course. If there are radiation or toxins in the environment, she’ll have made her systems immune from their effects. And she’ll make herself useful to the survivors. In the seeming of an old woman she’ll teach the healing arts. Now and then she might drop a hint about this and that. She’ll have a database squirreled away somewhere containing everything they’ll have lost. Slowly, she’ll guide them back to civilization. But a gentler one, this time. One less likely to tear itself apart.”\n“The year one million. Humanity evolves beyond anything we can currently imagine. How does she respond?”\n“She mimics their evolution. No—she’s been shaping their evolution. She wants a risk-free method of going to the stars, so she’s been encouraging a type of being that would strongly desire such a thing. She isn’t among the first to use it, though. She waits a few hundred generations for it to prove itself.”\nThe mech, who had been listening in fascinated silence, now said, “Suppose that never happens? What if starflight will always remain difficult and perilous? What then?”\n“It was once thought that people would never fly. So much that looks impossible becomes simple if you only wait.”\n“Four billion years. The sun uses up its hydrogen, its core collapses, helium fusion begins, and it balloons into a red giant. Earth is vaporized.”\n“Oh, she’ll be somewhere else by then. That’s easy.”\n“Five billion years. The Milky Way collides with the Andromeda Galaxy and the whole neighborhood is full of high-energy radiation and exploding stars.”\n“That’s trickier. She’s going to have to either prevent that or move a few million light-years away to a friendlier galaxy. But she’ll have time enough to prepare and to assemble the tools. I have faith that she’ll prove equal to the task.”\n“One trillion years. The last stars gutter out. Only black holes remain.”\n“Black holes are a terrific source of energy. No problem.”\n“1.06 googol years.”\n“Googol?”\n“That’s ten raised to the hundredth power—one followed by a hundred zeros. The heat-death of the universe. How does she survive it?”\n“She’ll have seen it coming for a long time,” the mech said. “When the last black holes dissolve, she’ll have to do without a source of free energy. Maybe she could take and rewrite her personality into the physical constants of the dying universe. Would that be possible?”\n“Oh, perhaps. But I really think that the lifetime of the universe is long enough for anyone,” the granddaughter said. “Mustn’t get greedy.”\n“Maybe so,” the old man said thoughtfully. “Maybe so.” Then, to the mech, “Well, there you have it: a glimpse into the future, and a brief biography of the first immortal, ending, alas, with her death. Now tell me. Knowing that you contributed something, however small, to that accomplishment—wouldn’t that be enough?”\n“No,” Jack said. “No, it wouldn’t.”\nBrandt made a face. “Well, you’re young. Let me ask you this: Has it been a good life so far? All in all?”\n“Not that good. Not good enough.”\nFor a long moment the old man was silent. Then, “Thank you,” he said. “I valued our conversation.” The interest went out of his eyes and he looked away.\nUncertainly Jack looked at the granddaughter, who smiled and shrugged. “He’s like that,” she said apologetically. “He’s old. His enthusiasms wax and wane with his chemical balances. I hope you don’t mind.”\n“I see.” The young man stood. Hesitantly, he made his way to the door.\nAt the door, he glanced back and saw the granddaughter tearing her linen napkin into little bits and eating the shreds, delicately washing them down with little sips of wine.\nOriginally published in Asimov’s Science Fiction, February 1999.\nMichael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.\nThis year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.\nHe lives in Philadelphia with his wife, Marianne Porter."}