{"fingerprint": "nfUxxHzKlVTIxl4M6GylBDEnUcE=", "sitename": "Clarkesworld Magazine", "title": "Passage of Earth by Michael Swanwick", "author": "Michael Swanwick", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/swanwick_04_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Passage of Earth by Michael Swanwick", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7400 words, short story\n Passage of Earth\n The ambulance arrived sometime between three and four in the morning. The morgue was quiet then, cool and faintly damp. Hank savored this time of night and the faint shadow of contentment it allowed him, like a cup of bitter coffee, long grown cold, waiting for his occasional sip. He liked being alone and not thinking. His rod and tackle box waited by the door, in case he felt like going fishing after his shift, though he rarely did. There was a copy of Here Be Dragons: Mapping the Human Genome in case he did not.\n He had opened up a drowning victim and was reeling out her intestines arm over arm, scanning them quickly and letting them down in loops into a galvanized bucket. It was unlikely he was going to find anything, but all deaths by violence got an autopsy. He whistled tunelessly as he worked.\n The bell from the loading dock rang.\n “Hell.” Hank put down his work, peeled off the latex gloves, and went to the intercom. “Sam? That you?” Then, on the sheriff’s familiar grunt, he buzzed the door open. “What have you got for me this time?”\n “Accident casualty.” Sam Aldridge didn’t meet his eye, and that was unusual. There was a gurney behind him, and on it something too large to be a human body, covered by canvas. The ambulance was already pulling away, which was so contrary to proper protocols as to be alarming.\n “That sure doesn’t look like—” Hank began.\n A woman stepped out of the darkness.\n It was Evelyn.\n “Boy, the old dump hasn’t changed one bit, has it? I’ll bet even the calendar on the wall’s the same. Did the county ever spring for a diener for the night shift?”\n “I . . . I’m still working alone.”\n “Wheel it in, Sam, and I’ll take over from here. Don’t worry about me, I know where everything goes.” Evelyn took a deep breath and shook her head in disgust. “Christ. It’s just like riding a bicycle. You never forget. Want to or not.”\n After the paperwork had been taken care of and Sheriff Sam was gone, Hank said, “Believe it or not, I had regained some semblance of inner peace, Evelyn. Just a little. It took me years. And now this. It’s like a kick in the stomach. I don’t see how you can justify doing this to me.”\n “Easiest thing in the world, sweetheart.” Evelyn suppressed a smirk that nobody but Hank could have even noticed, and flipped back the canvas. “Take a look.”\n It was a Worm.\n Hank found himself leaning low over the heavy, swollen body, breathing deep of its heady alien smell, suggestive of wet earth and truffles with sharp hints of ammonia. He thought of the ships in orbit, blind locomotives ten miles long. The photographs of these creatures didn’t do them justice. His hands itched to open this one up.\n “The Agency needs you to perform an autopsy.”\n Hank drew back. “Let me get this straight. You’ve got the corpse of an alien creature. A representative of the only other intelligent life form that the human race has ever encountered. Yet with all the forensic scientists you have on salary, you decide to hand it over to a lowly county coroner?”\n “We need your imagination, Hank. Anybody can tell how they’re put together. We want to know how they think.”\n “You told me I didn’t have an imagination. When you left me.” His words came out angrier than he’d intended, but he couldn’t find it in himself to apologize for their tone. “So, again—why me?”\n “What I said was, you couldn’t imagine bettering yourself. For anything impractical, you have imagination in spades. Now I’m asking you to cut open an alien corpse. What could be less practical?”\n “I’m not going to get a straight answer out of you, am I?”\n Evelyn’s mouth quirked up in a little smile so that for the briefest instant she was the woman he had fallen in love with, a million years ago. His heart ached to see it. “You never got one before,” she said. “Let’s not screw up a perfectly good divorce by starting now.”\n “Let me put a fresh chip in my dictation device,” Hank said. “Grab a smock and some latex gloves. You’re going to assist.”\n “Ready,” Evelyn said.\n Hank hit record, then stood over the Worm, head down, for a long moment. Getting in the zone. “Okay, let’s start with a gross physical examination. Um, what we have looks a lot like an annelid, rather blunter and fatter than the terrestrial equivalent and of course much larger. Just eyeballing it, I’d say this thing is about eight feet long, maybe two feet and a half in diameter. I could just about get my arms around it if I tried. There are three, five, seven, make that eleven somites, compared to say one or two hundred in an earthworm. No clitellum, so we’re warned not to take the annelid similarity too far.\n “The body is bluntly tapered at each end, and somewhat depressed posteriorly. The ventral side is flattened and paler than the dorsal surface. There’s a tripartite beak-like structure at one end, I’m guessing this is the mouth, and what must be an anus at the other. Near the beak are five swellings from which extend stiff, bone-like structures—mandibles, maybe? I’ll tell you, though, they look more like tools. This one might almost be a wrench, and over here a pair of grippers. They seem awfully specialized for an intelligent creature. Evelyn, you’ve dealt with these things, is there any variation within the species? I mean, do some have this arrangement of manipulators and others some other structure?”\n “We’ve never seen any two of the aliens with the same arrangement of manipulators.”\n “Really? That’s interesting. I wonder what it means. Okay, the obvious thing here is there are no apparent external sensory organs. No eyes, ears, nose. My guess is that whatever senses these things might have, they’re functionally blind.”\n “Intelligence is of that opinion too.”\n “Well, it must have shown in their behavior, right? So that’s an easy one. Here’s my first extrapolation: You’re going to have a bitch of a time understanding these things. Human beings rely on sight more than most animals, and if you trace back philosophy and science, they both have strong roots in optics. Something like this is simply going to think differently from us.\n “Now, looking between the somites—the rings—we find a number of tiny hairlike structures, and if we pull the rings apart, so much as we can, there’re all these small openings, almost like tiny anuses if there weren’t so many of them, closed with sphincter muscles, maybe a hundred of them, and it looks like they’re between each pair of somites. Oh, here’s something—the structures near the front, the swellings, are a more developed form of these little openings. Okay, now we turn the thing over. I’ll take this end you take the other. Right, now I want you to rock it by my count, and on the three we’ll flip it over. Ready? One, two, three!”\n The corpse slowly flipped over, almost overturning the gurney. The two of them barely managed to control it.\n “That was a close one,” Hank said cheerily. “Huh. What’s this?” He touched a line of painted numbers on the alien’s underbelly. Rt-Front/No. 43.\n “Never you mind what that is. Your job is to perform the autopsy.”\n “You’ve got more than one corpse.”\n Evelyn said nothing.\n “Now that I say it out loud, of course you do. You’ve got dozens. If you only had the one, I’d never have gotten to play with it. You have doctors of your own. Good researchers, some of them, who would cut open their grandmothers if they got the grant money. Hell, even forty-three would’ve been kept in-house. You must have hundreds, right?”\n For a fraction of a second, that exquisite face went motionless. Evelyn probably wasn’t even aware of doing it, but Hank knew from long experience that she’d just made a decision. “More like a thousand. There was a very big accident. It’s not on the news yet, but one of the Worms’ landers went down in the Pacific.”\n “Oh Jesus.” Hank pulled his gloves off, shoved up his glasses and ground his palms into his eyes. “You’ve got your war at last, haven’t you? You’ve picked a fight with creatures that have tremendous technological superiority over us, and they don’t even live here! All they have to do is drop a big enough rock into our atmosphere and there’ll be a mass extinction the likes of which hasn’t been seen since the dinosaurs died out. They won’t care. It’s not their planet!”\n Evelyn’s face twisted into an expression he hadn’t known it could form until just before the end of their marriage, when everything fell apart. “Stop being such an ass,” she said. Then, talking fast and earnestly, “We didn’t cause the accident. It was just dumb luck it happened, but once it did we had to take advantage of it. Yes, the Worms probably have the technology to wipe us out. So we have to deal with them. But to deal with them we have to understand them, and we do not. They’re a mystery to us. We don’t know what they want. We don’t know how they think. But after tonight we’ll have a little better idea. Provided only that you get back to work.”\n Hank went to the table and pulled a new pair of gloves off the roll. “Okay,” he said. “Okay.”\n “Just keep in mind that it’s not just my ass that’s riding on this,” Evelyn said. “It’s yours and everyone’s you know.”\n “I said okay!” Hank took a long breath, calming himself. “Next thing to do is cut this sucker open.” He picked up a bone saw. “This is bad technique, but we’re in a hurry.” The saw whined to life, and he cut through the leathery brown skin from beak to anus. “All right, now we peel the skin back. It’s wet-feeling and a little crunchy. The musculature looks much like that of a Terrestrial annelid. Structurally, that is. I’ve never seen anything quite that color black. Damn! The skin keeps curling back.”\n He went to his tackle box and removed a bottle of fishhooks. “Here. We’ll take a bit of nylon filament, tie two hooks together, like this, with about two inches of line between them. Then we hook the one through the skin, fold it down, and push the other through the cloth on the gurney. Repeat the process every six inches on both sides. That should hold it open.”\n “Got it.” Evelyn set to work.\n Some time later they were done, and Hank stared down into the opened Worm. “You want speculation? Here goes: This thing moves through the mud, or whatever the medium is there, face-first and blind. What does that suggest to you?”\n “I’d say that they’d be used to coming up against the unexpected.”\n “Very good. Haul back on this, I’m going to cut again. . . . Okay, now we’re past the musculature and there’s a fluffy mass of homogeneous stuff, we’ll come back to that in a minute. Cutting through the fluff . . . and into the body cavity and it’s absolutely chockablock with zillions of tiny little organs.”\n “Let’s keep our terminology at least vaguely scientific, shall we?” Evelyn said.\n “Well, there are more than I want to count. Literally hundreds of small organs under the musculature, I have no idea what they’re for but they’re all interconnected with vein-like tubing in various sizes. This is ferociously more complicated than human anatomy. It’s like a chemical plant in here. No two of the organs are the same so far as I can tell, although they all have a generic similarity. Let’s call them alembics, so we don’t confuse them with any other organs we may find. I see something that looks like a heart maybe, an isolated lump of muscle the size of my fist, there are three of them. Now I’m cutting deeper . . . Holy shit!”\n For a long minute, Hank stared into the opened alien corpse. Then he put the saw down on the gurney and, shaking his head, turned away. “Where’s that coffee?” he said.\n Without saying a word, Evelyn went to the coffee station and brought him his cold cup.\n Hank yanked his gloves, threw them in the trash, and drank.\n “All right,” Evelyn said, “so what was it?”\n “You mean you can’t see—no, of course you can’t. With you, it was human anatomy all the way.”\n “I took invertebrate biology in college.”\n “And forgot it just as fast as you could. Okay, look: Up here is the beak, semi-retractable. Down here is the anus. Food goes in one, waste comes out the other. What do you see between?”\n “There’s a kind of a tube. The gut?”\n “Yeah. It runs straight from the mouth to the anus, without interruption. Nothing in between. How does it eat without a stomach? How does it stay alive?” He saw from Evelyn’s expression that she was not impressed. “What we see before us is simply not possible.”\n “Yet here it is. So there’s an explanation. Find it.”\n “Yeah, yeah.” Glaring at the Worm’s innards, he drew on a new pair of gloves. “Let me take a look at that beak again. . . . Hah. See how the muscles are connected? The beak relaxes open, aaand—let’s take a look at the other end—so does the anus. So this beast crawls through the mud, mouth wide open, and the mud passes through it unhindered. That’s bound to have some effect on its psychological makeup.”\n “Like what?”\n “Damned if I know. Let’s take a closer look at the gut . . . There are rings of intrusive tissue near the beak one third of the way in, two thirds in, and just above the anus. We cut through and there is extremely fine structure, but nothing we’re going to figure out tonight. Oh, hey, I think I got it. Look at these three flaps just behind . . . ”\n He cut in silence for a while. “There. It has three stomachs. They’re located in the head, just behind the first ring of intrusive tissue. The mud or whatever is dumped into this kind of holding chamber, and then there’s this incredible complex of muscles, and—how many exit tubes?—this one has got, um, fourteen. I’ll trace one, and it goes right to this alembic. The next one goes to another alembic. I’ll trace this one and it goes to—yep, another alembic. There’s a pattern shaping up here.\n “Let’s put this aside for the moment, and go back to those masses of fluff. Jeeze, there’s a lot of this stuff. It must make up a good third of the body mass. Which has trilateral symmetry, by the way. Three masses of fluff proceed from head to tail, beneath the muscle sheath, all three connecting about eight inches below the mouth, into a ring around the straight gut. This is where the arms or manipulators or screwdrivers or whatever they are, grow. Now, at regular intervals the material puts out little arms, outgrowths that fine down to wire-like structures of the same material, almost like very thick nerves. Oh God. That’s what it is.” He drew back, and with a scalpel flensed the musculature away to reveal more of the mass. “It’s the central nervous system. This thing has a brain that weighs at least a hundred pounds. I don’t believe it. I don’t want to believe it.”\n “It’s true,” Evelyn said. “Our people in Bethesda have done slide studies. You’re looking at the thing’s brain.”\n “If you already knew the answer, then why the hell are you putting me through this?”\n “I’m not here to answer your questions. You’re here to answer mine.”\n Annoyed, Hank bent over the Worm again. There was rich stench of esters from the creature, pungent and penetrating, and the slightest whiff of what he guessed was putrefaction. “We start with the brain, and trace one of the subordinate ganglia inward. Tricky little thing, it goes all over the place, and ends up right here, at one of the alembics. We’ll try another one, and it . . . ends up at an alembic. There are a lot of these things, let’s see—hey—here’s one that goes to one of the structures in the straight gut. What could that be? A tongue! That’s it, there’s a row of tongues just within the gut, and more to taste the medium flowing through, yeah. And these little flapped openings just behind them open when the mud contains specific nutrients the worm desires. Okay, now we’re getting somewhere, how long have we been at this?”\n “About an hour and a half.”\n “It feels like longer.” He thought of getting some more coffee, decided against it. “So what have we got here? All that enormous brain mass—what’s it for?”\n “Maybe it’s all taken up by raw intelligence.”\n “Raw intelligence! No such thing. Nature doesn’t evolve intelligence without a purpose. It’s got to be used for something. Let’s see. A fair amount is taken up by taste, obviously. It has maybe sixty individual tongues, and I wouldn’t be surprised if its sense of taste were much more detailed than ours. Plus all those little alembics performing god-knows-what kind of chemical reactions.\n “Let’s suppose for a minute that it can consciously control those reactions, that would account for a lot of the brain mass. When the mud enters at the front, it’s tasted, maybe a little is siphoned off and sent through the alembics for transformation. Waste products are jetted into the straight gut, and pass through several more circles of tongues . . . Here’s another observation for you: These things would have an absolute sense of the state of their own health. They can probably create their own drugs, too. Come to think of it, I haven’t come across any evidence of disease here.” The Worm’s smell was heavy, penetratingly pervasive. He felt slightly dizzy, shook it off.\n “Okay, so we’ve got a creature that concentrates most of its energy and attention internally. It slides through an easy medium, and at the same time the mud slides through it. It tastes the mud as it passes, and we can guess that the mud will be in a constant state of transformation, so it experiences the universe more directly than do we.” He laughed. “It appears to be a verb.”\n “How’s that?”\n “One of Buckminster Fuller’s aphorisms. But it fits. The worm constantly transforms the universe. It takes in all it comes across, accepts it, changes it, and excretes it. It is an agent of change.”\n “That’s very clever. But it doesn’t help us deal with them.”\n “Well, of course not. They’re intelligent, and intelligence complicates everything. But if you wanted me to generalize, I’d say the Worms are straightforward and accepting—look at how they move blindly ahead—but that their means of changing things are devious, as witness the mass of alembics. That’s going to be their approach to us. Straightforward, yet devious in ways we just don’t get. Then, when they’re done with us, they’ll pass on without a backward glance.”\n “Terrific. Great stuff. Get back to work.”\n “Look, Evelyn. I’m tired and I’ve done all I can, and a pretty damned good job at that, I think. I could use a rest.”\n “You haven’t dealt with the stuff near the beak. The arms or whatever.”\n “Cripes.” Hank turned back to the corpse, cut open an edema, began talking. “The material of the arms is stiff and osseous, rather like teeth. This one has several moving parts, all controlled by muscles anchored alongside the edema. There’s a nest of ganglia here, connected by a very short route to the brain matter. Now I’m cutting into the brain matter, and there’s a small black gland, oops I’ve nicked it. Whew. What a smell. Now I’m cutting behind it.” Behind the gland was a small white structure, square and hard meshwork, looking like a cross between an instrument chip and a square of Chex cereal.\n Keeping his back to Evelyn, he picked it up.\n He put it in his mouth.\n He swallowed.\n What have I done? he thought. Aloud, he said, “As an operating hypothesis I’d say that the manipulative structures have been deliberately, make that consciously, grown. There, I’ve traced one of those veins back to the alembics. So that explains why there’s no uniformity, these things would grow exterior manipulators on need, and then discard them when they’re done. Yes, look, the muscles don’t actually connect to the manipulators, they wrap around them.”\n There was a sour taste on his tongue.\n I must be insane, he thought.\n “Did you just eat something?”\n Keeping his expression blank, Hank said, “Are you nuts? You mean did I put part of this . . . creature . . . in my mouth?” There was a burning within his brain, a buzzing like the sound of the rising sun picked up on a radio telescope. He wanted to scream, but his face simply smiled and said, “Do you—?” And then it was very hard to concentrate on what he was saying. He couldn’t quite focus on Evelyn, and there were white rays moving starburst across his vision and—\n When he came to, Hank was on the Interstate, doing ninety. His mouth was dry and his eyelids felt gritty. Bright yellow light was shining in his eyes from a sun that had barely lifted itself up above over the horizon. He must have been driving for hours. The steering wheel felt tacky and gummy. He looked down.\n There was blood on his hands. It went all the way up to his elbows.\n The traffic was light. Hank had no idea where he was heading, nor any desire whatsoever to stop.\n So he just kept driving.\n Whose blood was it on his hands? Logic said it was Evelyn’s. But that made no sense. Hate her though he did—and the sight of her had opened wounds and memories he’d thought cauterized shut long ago—he wouldn’t actually hurt her. Not physically. He wouldn’t actually kill her.\n Would he?\n It was impossible. But there was the blood on his hands. Whose else could it be? Some of it might be his own, admittedly. His hands ached horribly. They felt like he’d been pounding them into something hard, over and over again. But most of the blood was dried and itchy. Except for where his skin had split at the knuckles, he had no wounds of any kind. So the blood wasn’t his.\n “Of course you did,” Evelyn said. “You beat me to death and you enjoyed every minute of it.”\n Hank shrieked and almost ran off the road. He fought the car back and then turned and stared in disbelief. Evelyn sat in the passenger seat beside him.\n “You . . . how did . . . ?” Much as he had with the car, Hank seized control of himself. “You’re a hallucination,” he said.\n “Right in one!” Evelyn applauded lightly. “Or a memory, or the personification of your guilt, however you want to put it. You always were a bright man, Hank. Not so bright as to be able to keep your wife from walking out on you, but bright enough for government work.”\n “Your sleeping around was not my fault.”\n “Of course it was. You think you walked in on me and Jerome by accident? A woman doesn’t hate her husband enough to arrange something like that without good reason.”\n “Oh god, oh god, oh god.”\n “The fuel light is blinking. You’d better find a gas station and fill up.”\n A Lukoil station drifted into sight, so he pulled into it and stopped the car by a full service pump. When he got out, the service station attendant hurried toward him and then stopped, frozen.\n “Oh no,” the attendant said. He was a young man with sandy hair. “Not another one.”\n “Another one?” Hank slid his card through the reader. “What do you mean another one?” He chose high-test and began pumping, all the while staring hard at the attendant. All but daring him to try something. “Explain yourself.”\n “Another one like you.” The attendant couldn’t seem to look away from Hank’s hands. “The cops came right away and arrested the first one. It took five of them to get him into the car. Then another one came and when I called, they said to just take down his license number and let him go. They said there were people like you showing up all over.”\n Hank finished pumping and put the nozzle back on its hook. He did not push the button for a receipt. “Don’t try to stop me,” he said. The words just came and he said them. “I’d hurt you very badly if you did.”\n The young man’s eyes jerked upward. He looked spooked. “What are you people?”\n Hank paused, with his hand on the door. “I have no idea.”\n “You should have told him,” Evelyn said when he got back in the car. “Why didn’t you?”\n “Shut up.”\n “You ate something out of that Worm and it’s taken over part of your brain. You still feel like yourself, but you’re not in control. You’re sitting at the wheel but you have no say over where you’re going. Do you?”\n “No,” Hank admitted. “No, I don’t.”\n “What do you think it is—some kind of super-prion? Like mad cow disease, only faster than fast? A neuroprogrammer, maybe? An artificial overlay to your personality that feeds off of your brain and shunts your volition into a dead end?”\n “I don’t know.”\n “You’re the one with the imagination. This would seem to be your sort of thing. I’m surprised you’re not all over it.”\n “No,” Hank said. “No, you’re not at all surprised.”\n They drove on in silence for a time.\n “Do you remember when we first met? In med school? You were going to be a surgeon then.”\n “Please. Don’t.”\n “Rainy autumn afternoons in that ratty little third-floor walk-up of yours. With that great big aspen with the yellow leaves outside the window. It seemed like there was always at least one stuck to the glass. There were days when we never got dressed at all. We’d spend all day in and out of that enormous futon you’d bought instead of a bed, and it still wasn’t large enough. If we rolled off the edge, we’d go on making love on the floor. When it got dark, we’d send out for Chinese.”\n “We were happy then. Is that what you want me to say?”\n “It was your hands I liked best. Feeling them on me. You’d have one hand on my breast and the other between my legs and I’d imagine you cutting open a patient. Peeling back the flesh to reveal all those glistening organs inside.”\n “Okay, now that’s sick.”\n “You asked me what I was thinking once and I told you. I was watching your face closely, because I really wanted to know you back then. You loved it. So I know you’ve got demons inside you. Why not own up to them?”\n He squeezed his eyes shut, but something inside him opened them again, so he wouldn’t run the car off the road. A low moaning sound arose from somewhere deep in his throat. “I must be in Hell.”\n “C’mon. Be a sport. What could it hurt? I’m already dead.”\n “There are some things no man was meant to admit. Even to himself.”\n Evelyn snorted. “You always were the most astounding prig.”\n They drove on in silence for a while, deeper into the desert. At last, staring straight ahead of himself, Hank could not keep himself from saying, “There are worse revelations to come, aren’t there?”\n “Oh God, yes,” his mother said.\n “It was your father’s death.” His mother sucked wetly on a cigarette. “That’s what made you turn out the way you did. ”\n Hank could barely see the road for his tears. “I honestly don’t want to be having this conversation, Mom.”\n “No, of course you don’t. You never were big on self-awareness, were you? You preferred cutting open toads or hunching over that damned microscope.”\n “I’ve got plenty of self-awareness. I’ve got enough self-awareness to choke on. I can see where you’re going and I am not going to apologize for how I felt about Dad. He died of cancer when I was thirteen. What did I ever do to anyone that was half so bad as what he did to me? So I don’t want to hear any cheap Freudian bullshit about survivor guilt and failing to live up to his glorious example, okay?”\n “Nobody said it wasn’t hard on you. Particularly coming at the onset of puberty as it did.”\n “Mom!”\n “What. I wasn’t supposed to know? Who do you think did the laundry?” His mother lit a new cigarette from the old one, then crushed out the butt in an ashtray. “I knew a lot more of what was going on in those years than you thought I did, believe you me. All those hours you spent in the bathroom jerking off. The money you stole to buy dope with.”\n “I was in pain, Mom. And it’s not as if you were any help.”\n His mother looked at him with the same expression of weary annoyance he remembered so well. “You think there’s something special about your pain? I lost the only man I ever loved and I couldn’t move on because I had a kid to raise. Not a sweet little boy like I used to have either, but a sullen, self-pitying teenager. It took forever to get you shipped off to medical school.”\n “So then you moved on. Right off the roof of the county office building. Way to honor Dad’s memory, Mom. What do you think he would have said about that if he’d known?”\n Dryly, his mother said, “Ask him for yourself.”\n Hank closed his eyes.\n When he opened them, he was standing in the living room of his mother’s house. His father stood in the doorway, as he had so many times, smoking an unfiltered Camel and staring through the screen door at the street outside. “Well?” Hank said at last.\n With a sigh his father turned around. “I’m sorry,” he said. “I didn’t know what to do.” His lips moved up into what might have been a smile on another man. “Dying was new to me.”\n “Yeah, well you could have summoned the strength to tell me what was going on. But you couldn’t be bothered. The surgeon who operated on you? Doctor Tomasini. For years I thought of him as my real father. And you know why? Because he gave it to me straight. He told me exactly what was going to happen. He told me to brace myself for the worst. He said that it was going to be bad but that I would find the strength to get through it. Nobody’d ever talked to me like that before. Whenever I was in a rough spot, I’d fantasize going to him and asking for advice. Because there was no one else I could ask.”\n “I’m sorry you hate me,” his father said, not exactly looking at Hank. Then, almost mumbling, “Still, lots of men hate their fathers, and somehow manage to make decent lives for themselves.”\n “I didn’t hate you. You were just a guy who never got an education and never made anything of himself and knew it. You had a shitty job, a three-pack-a-day habit, and a wife who was a lush. And then you died.” All the anger went out of Hank in an instant, like air whooshing out of a punctured balloon, leaving nothing behind but an aching sense of loss. “There wasn’t really anything there to hate.”\n Abruptly, the car was filled with coil upon coil of glistening Worm. For an instant it looped outward, swallowing up car, Interstate, and all the world, and he was afloat in vacuum, either blind or somewhere perfectly lightless, and there was nothing but the Worm-smell, so strong he could taste it in his mouth.\n Then he was back on the road again, hands sticky on the wheel and sunlight in his eyes.\n “Boy, does that explain a lot!” Evelyn flashed her perfect teeth at him and beat on the top of the dashboard as if it were a drum. “How a guy as spectacularly unsuited for it as you are decided to become a surgeon. That perpetual cringe of failure you carry around on your shoulders. It even explains why, when push came to shove, you couldn’t bring yourself to cut open living people. Afraid of what you might find there?”\n “You don’t know what you’re talking about.”\n “I know that you froze up right in the middle of a perfectly routine appendectomy. What did you see in that body cavity?”\n “Shut up.”\n “Was it the appendix? I bet it was. What did it look like?”\n “Shut up.”\n “Did it look like a Worm?”\n He stared at her in amazement. “How did you know that?”\n “I’m just a hallucination, remember? An undigested bit of beef, a blot of mustard, a crumb of cheese, a fragment of underdone potato. So the question isn’t how did I know, but how did you know what a Worm was going to look like five years before their ships came into the Solar System?”\n “It’s a false memory, obviously.”\n “So where did it come from?” Evelyn lit up a cigarette. “We go off-road here.”\n He slowed down and started across the desert. The car bucked and bounced. Sagebrush scraped against the sides. Dust blossomed up into the air behind them.\n “Funny thing you calling your mother a lush,” Evelyn said. “Considering what happened after you bombed out of surgery.”\n “I’ve been clean for six years and four months. I still go to the meetings.”\n “Swell. The guy I married didn’t need to.”\n “Look, this is old territory, do we really need to revisit it? We went over it so many times during the divorce.”\n “And you’ve been going over it in your head ever since. Over and over and . . . ”\n “I want us to stop. That’s all. Just stop.”\n “It’s your call. I’m only a symptom, remember? If you want to stop thinking, then just stop thinking.”\n Unable to stop thinking, he continued eastward, ever eastward.\n For hours he drove, while they talked about every small and nasty thing he had done as a child, and then as an adolescent, and then as an alcoholic failure of a surgeon and a husband. Every time Hank managed to change the subject, Evelyn brought up something even more painful, until his face was wet with tears. He dug around in his pockets for a handkerchief. “You could show a little compassion, you know.”\n “Oh, the way you’ve shown me compassion? I offered to let you keep the car if you’d just give me back the photo albums. So you took the albums into the back yard and burned them all, including the only photos of my grandmother I had. Remember that? But of course I’m not real, am I? I’m just your image of Evelyn—and we both know you’re not willing to concede her the least spark of human decency. Watch out for that gully! You’d better keep your eyes straight ahead.”\n They were on a dirt road somewhere deep in the desert now. That was as much as he knew. The car bucked and scraped its underside against the sand, and he downshifted again. A rock rattled down the underside, probably tearing holes in vital places.\n Then Hank noticed plumes of dust in the distance, smaller versions of the one billowing up behind him. So there were other vehicles out there. Now that he knew to look for them, he saw more. There were long slanted pillars of dust rising up in the middle distance and tiny gray nubs down near the horizon. Dozens of them, scores, maybe hundreds.\n “What’s that noise?” he heard himself asking. “Helicopters?”\n “Such a clever little boy you are!”\n One by one flying machines lifted over the horizon. Some of them were news copters. The rest looked to be military. The little ones darted here and there, filming. The big ones circled slowly around a distant glint of metal in the desert. They looked a lot like grasshoppers. They seemed afraid to get too close.\n “See there?” Evelyn said. “That would be the lifter.”\n “Oh.” Hank said.\n Then, slowly, he ventured, “The lander going down wasn’t an accident, was it?”\n “No, of course not. The Worms crashed it in the Pacific on purpose. They killed hundreds of their own so the bodies would be distributed as widely as possible. They used themselves as bait. They wanted to collect a broad cross-section of humanity.\n “Which is ironic, really, because all they’re going to get is doctors, morticians, and academics. Some FBI agents, a few Homeland Security bureaucrats. No retirees, cafeteria ladies, jazz musicians, soccer coaches, or construction workers. Not one Guatemalan nun or Korean noodle chef. But how could they have known? They acted out of perfect ignorance of us and they got what they got.”\n “You sound just like me,” Hank said. Then, “So what now? Colored lights and anal probes?”\n Evelyn snorted again. “They’re a sort of hive culture. When one dies, it’s eaten by the others and its memories are assimilated. So a thousand deaths wouldn’t mean a lot to them. If individual memories were lost, the bulk of those individuals were already made up of the memories of previous generations. The better part of them would still be alive, back on the mother ship. Similarly, they wouldn’t have any ethical problems with harvesting a few hundred human beings. Eating us, I mean, and absorbing our memories into their collective identity. They probably don’t understand the concept of individual death. Even if they did, they’d think we should be grateful for being given a kind of immortality.”\n The car went over a boulder Hank hadn’t noticed in time, bouncing him so high that his head hit the roof. Still, he kept driving.\n “How do you know all that?”\n “How do you think I know?” Ahead, the alien ship was growing larger. At its base were Worm upon Worm upon Worm, all facing outward, skin brown and glistening. “Come on, Hank, do I have to spell it out for you?”\n “I have no idea what you’re talking about.”\n “Okay, Captain Courageous,” Evelyn said scornfully. “If this is what it takes.” She stuck both her hands into her mouth and pulled outward. The skin to either side of her mouth stretched like rubber, then tore. Her face ripped in half.\n Loop after loop of slick brown flesh flopped down to spill across Hank’s lap, slide over the back of the seat and fill up the rear of the car. The horridly familiar stench of Worm, part night soil and part chemical plant, took possession of him and would not let go. He found himself gagging, half from the smell and half from what it meant.\n A weary sense of futility grasped his shoulders and pushed down hard. “This is only a memory, isn’t it?”\n One end of the Worm rose up and turned toward him. Its beak split open in three parts and from the moist interior came Evelyn’s voice: “The answer to the question you haven’t got the balls to ask is: Yes, you’re dead. A Worm ate you and now you’re passing slowly through an alien gut, being tasted and experienced and understood. You’re nothing more than an emulation being run inside one of those hundred-pound brains.”\n Hank stopped the car and got out. There was an arroyo between him and the alien ship that the car would never be able to get across. So he started walking.\n “It all feels so real,” he said. The sun burned hot on his head, and the stones underfoot were hard. He could see other people walking determinedly through the shimmering heat. They were all converging on the ship.\n “Well, it would, wouldn’t it?” Evelyn walked beside him in human form again. But when he looked back the way they had come, there was only one set of footprints.\n Hank had been walking in a haze of horror and resignation. Now it was penetrated by a sudden stab of fear. “This will end, won’t it? Tell me it will. Tell me that you and I aren’t going to keep cycling through the same memories over and over, chewing on our regrets forever?”\n “You’re as sharp as ever, Hank,” Evelyn said. “That’s exactly what we’ve been doing. It passes the time between planets.”\n “For how long?”\n “For more years than you’d think possible. Space is awfully big, you know. It takes thousands and thousands of years to travel from one star to another.”\n “Then . . . this really is Hell, after all. I mean, I can’t imagine anything worse.”\n She said nothing.\n They topped a rise and looked down at the ship. It was a tapering cylinder, smooth and featureless save for a ring of openings at the bottom from which emerged the front ends of many Worms. Converging upon it were people who had started earlier or closer than Hank and thus gotten here before he did. They walked straight and unhesitatingly to the nearest Worm and were snatched up and gulped down by those sharp, tripartite beaks. Snap and then swallow. After which, the Worm slid back into the ship and was replaced by another. Not one of the victims showed the least emotion. It was all as dispassionate as an abattoir for robots.\n These creatures below were monstrously large, taller than Hank was. The one he had dissected must have been a hatchling. A grub. It made sense. You wouldn’t want to sacrifice any larger a percentage of your total memories than you had to.\n “Please.” He started down the slope, waving his arms to keep his balance when the sand slipped underfoot. He was crying again, apparently; he could feel the tears running down his cheeks. “Evelyn. Help me.”\n Scornful laughter. “Can you even imagine me helping you?”\n “No, of course—” Hank cut that thought short. Evelyn, the real Evelyn, would not have treated him like this. Yes, she had hurt him badly, and by that time she left, she had been glad to do so. But she wasn’t petty or cruel or vindictive before he made her that way.\n “Accepting responsibility for the mess you made of your life, Hank? You?”\n “Tell me what to do,” Hank said, pushing aside his anger and resentment, trying to remember Evelyn as she had once been. “Give me a hint.”\n For a maddeningly long moment Evelyn was silent. Then she said, “If the Worm that ate you so long ago could only communicate directly with you . . . what one question do you think it would ask?”\n “I don’t know.”\n “I think it would be, ‘Why are all your memories so ugly?’ ”\n Unexpectedly, she gave him a peck on the cheek.\n Hank had arrived. His Worm’s beak opened. Its breath smelled like Evelyn on a rainy Saturday afternoon. Hank stared at the glistening blackness within. So enticing. He wanted to fling himself down it.\n Once more into the gullet, he thought, and took a step closer to the Worm and the soothing darkness it encompassed.\n Its mouth gaped wide, waiting to ingest and transform him.\n Unbidden, then, a memory rose up within Hank of a night when their marriage was young and, traveling through Louisiana, he and Evelyn stopped on an impulse at a roadhouse where there was a zydeco band and beer in bottles and they were happy and in love and danced and danced and danced into an evening without end. It had seemed then that all good things would last forever.\n It was a fragile straw to cling to, but Hank clung to it with all his might.\n Worm and man together, they then thought: No one knows the size of the universe or what wonders and terrors it contains. Yet we drive on, blindly burrowing forward through the darkness, learning what we can and suffering what we must. Hoping for stars.\n Michael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.\n This year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.\n He lives in Philadelphia with his wife, Marianne Porter."}