{"fingerprint": "3k2VmzcEPO5ZvLVzw1WSfzzYIyM=", "sitename": "Clarkesworld Magazine", "title": "The Last Days of Old Night by Michael Swanwick", "author": "Michael Swanwick", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/swanwick_12_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Last Days of Old Night by Michael Swanwick", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7120 words, short story\nThe Last Days of Old Night\nThrough chaos and old night, the three brothers journeyed. Sometimes they rode and sometimes they strode. When they rode, their steeds snorted cold steam from their nostrils and obsidian hooves struck sparks from the rock. When they strode, their feet sank in the earth to their ankles. The sky was lit only by witch fires. Sometimes there were moons or flotillas of comets. Not tonight. Like all things, the sky and road changed at whim. In all the world, only the brothers could dictate what those changes would be.\nThat was simply how things were.\nGoat-Eater was a great-bellied giant of a man. “There is some new thing ahead,” he rumbled. Before them, the black mountains sank down to an ebony sea where blind waves crashed upon a beach as black as snow. It took a sharp eye to tell one from another, but he had that eye. Also, he could smell salt in the air. “It is made of water and it extends even farther than I can see.”\n“It is not what we fear, however,” said Bone-Grinder. “I would know.” He was smaller than the others, but more muscular and ungainly. One eye was missing and the other puckered; he had the mouth of a malcontent.\nThe third brother, who was nameless, did not speak and never had. Only he knew whether this was by necessity or choice. But he made a gesture indicating weariness. They had traveled far and hard and needed to rest.\nNo cities were near. Sometimes cities spontaneously sprang up, filled with music and motion and so ablaze with light that they could be seen half a continent away. Tonight the mountains were bleak and cheerless. So the nameless one pointed at a low knoll, turning it into a timbered drinking hall that soared halfway to their knees. Smoke lofted from its fire hole.\nDissolving their mounts to night mist, the brothers put off their size. They did not knock—their kind never did—but threw open the doors and stamped within. A fire roared like a dragon at the back of the hall. Faces pale, warriors leaped to their feet, sending benches clattering. Their thane, mighty in war and worthy in peace, drew his sword and, kneeling, placed it on the floor before the brothers.\n“Meat,” said Goat-Eater, and an aurochs carcass was roasting on a spit over the fire.\n“Drink,” said Bone-Grinder, and a page who an instant before had been a warrior hurried to proffer a two-handled silver drinking cup that had formerly been his helmet, foaming over with ale.\nThe nameless one spun the thane’s throne-chair about and sat before the fire, glowering and rubbing his hands together. His brothers squatted by his side, one crunching on a rack of beef ribs, the other swilling down beer.\n“This is noble meat,” Goat-Eater said. “Perhaps it was once a king.”\n“The drink is missing something, however,” said Bone-Grinder and at that instant a cat streaked by his foot in fierce pursuit of a mouse. With a sweep of his gnarled hand, Bone-Grinder caught the mouse and held it up by its tail to his squinting gaze. It had eyes like beads of jet and whiskers like white scratches in the air, and it struggled most prettily to escape. “Serving wench,” he said, and a young woman stood before him, clad in a simple brown dress, her eyes lowered. The giant examined her critically. “Fewer teats,” he said.\nThe maiden felt her body alter so that she had only two breasts.\n“You must have a name,” Bone-Grinder said. “I will invent a language for the occasion and choose a word from it for you.” For a long moment he was silent. Then: “Mischling,” he said, “bring me a barrel of wine and someone to drown in it.”\nMischling scuttled across the great hall to obey.\nWhich was how she came to be.\nFear was a mouse’s natural state. So Mischling did not feel she had lost much in her transformation: her tail, her whiskers, and her sleek pelt, yes, those she missed. But one who was in constant danger of cats and boots and casually flung eating knives could scarcely be more imperiled by being enlarged to human stature. Like all mice, she had been born blind; vision had come as a tremendous surprise to her. This transformation was but one more phase in her life.\nIn the kitchen, she overtoppled a cask as tall as she was onto its side. Like the popcorn machine and the microwave, it had come into existence in tandem with the knowledge in her head of its location. Appearing from nowhere, Pétur seized her from behind and kissed her neck. Minutes before, Pétur had been a mouse as well and possibly her mate. But shortly after her transformation, a corresponding change had come upon him and with it memories of a past that had never been. They two now shared a history and hopes that someday they would be wed. Together, Pétur and Mischling rolled the cask into the great hall and, with mallets, popped off the top.\nThen Pétur climbed in headfirst and drowned himself.\nBoth Mischling and Pétur naturally regretted the deed, but one did not go against the will of the brothers. It was simply what had to be.\nAfter Bone-Grinder had drunk down the quaff and chewed the boy’s corpse to nothing, he willed into being a throne-chair for himself and said to Mischling, “Stand before me.”\nShe obeyed. Mischling had been a woman for mere moments and had no idea what was expected of her. She trembled like a mouse.\n“Don’t be afraid of me—or I’ll crush you like a bug.”\n“No, sir.”\n“No monosyllabic answers either.”\n“Yes, sir.”\nBone-Grinder growled, “You don’t understand what I’m saying, do you?” Without waiting for a reply, he said, “From now on, understand everything you need to understand,” and enlightenment flowed into Mischling. With it came horror, for she now understood that he had the impulsiveness of an infant and the restraint of an avalanche. As did his brothers. There could be no predicting what they might do. “Now,” Bone-Grinder said, “Sing us a song.”\nThere was a stringed instrument in Mischling’s hands and she knew how to play it. Striking the appropriate stance she sang:\nIn the beginning was everything and nothing—\nA singularity called the monoblock.\nNo dimensions, no difference, no measurement,\nYet it contained the end of all things . . .\n“There is no amusement in this song,” Goat-Eater grumbled. He grabbed a back leg of Bone-Grinder’s chair and tumbled him into the fire.\nHowling with wrath, doubling in size, clothes smoldering, Bone-Grinder rose up and, seizing his brother, tried to wrestle him into the flames. In doing so, he knocked Mischling over. By the time she rose from the flagstones, both were giants again and entangled in combat, cursing and hitting each other with their fists. Their brother roared with silent laughter.\nAs the giants fought, the thane and his men fled, fearful of being crushed. Mischling took advantage of the confusion to escape unnoticed—save for the silent one, who missed nothing but did not try to stop her—into the darkness outside.\nHaving nowhere else to go, Mischling crept into the barn and burrowed into the straw for warmth. Then she cried herself to sleep, wishing that Pétur were there to comfort her and knowing that although the brothers had the power to bring him back, never in a thousand years would they do so.\nThe eternal, unending night closed over her, and she slept.\nMischling awoke to the brothers hooting and bellowing. At their command the walls and roof of the barn flew away and earth and straw flowed upward to become their mounts. This, in turn, revealed Mischling’s presence. Bone-Grinder seized her arm and yanked her upright. She grew almost as large as they. “We’ll take this one with us. She can clean our boots.”\nThe silent one nodded agreement. “She’ll need a mount too,” Goat-Eater said, and created a saddle beast, smaller in proportion to their mounts as she was to the brothers. With her new power of understanding, Mischling realized that this was done deliberately, so that she and her steed would have to struggle to keep up. For the brothers were, she now knew, as petty as they were powerful.\nThey rode away, leaving the drinking hall ablaze behind them.\nIt was a long trek to the sea. Mischling and her steed were both winded well before they reached it. All three brothers rode their mounts up to their necks in the surf. “Become solid,” one commanded, but the surf remained as it was. “Let there be a bridge crossing you,” said the second, but neither was that so. The silent one scooped up a handful of seawater to drink and then spat it out. They turned and rode back to the strand.\n“Here is a great mystery,” said Goat-Eater, “though not the one we seek. For this immense, roiling thing is continually changing yet refuses to obey us.”\n“There are no answers here,” said Bone-Grinder. “Therefore let us a create a city where answers may be found—and let that city be called Kiv.”\nThe silent one gestured and a city arose, filled with foundries and knackeries and boatyards. Light from its forges and torches created a semicircle along the seaside; myriad people and horses and wagons filled its streets, as industrious as bees in a hive. Seeing this, the brothers alit and put off their size. So too, perforce, did Mischling.\n“Swim out into the water,” said Bone-Grinder to the steeds, “until you drown.”\nWatching the beasts dwindle and disappear, Mischling felt a crushing sense of loss. Her steed was the only thing she had ever been responsible for, and she wished she could have somehow saved it, even as she understood why she could not.\nThe brothers disguised themselves as beggars in ragged clothes. “You will go before us,” said Goat-Eater, “and you will ask questions, for it is beneath our dignity to do so.”\n“What am I trying to learn?” Mischling asked.\n“Whatever you may,” said Bone-Grinder. Which Mischling understood meant that they had had premonitions of some essential change forthcoming in the nature of the world and feared it might diminish their power.\nWith that, the three sturdy beggars and one slight maid entered Kiv.\nFor a former mouse, Kiv was almost as terrifying as it was entrancing. Its twisty streets and sudden broad squares were hung over with paper lanterns and strings of electric lights so that every breeze made the shadows dance. The air was clangorous with machinery. Smoke pinched the nose. Purposeful men and women hurried in every direction. Wagons brought charcoal to the forges and foundries and vans carried crates of tools, spikes, and square head nails to the boatyards and sawpits. Torchlit docks and piers jutted into the sea all along the waterfront. Beyond them, in the yards, boats were being built, tarred, and fitted. Lean men sweated over woks in the cookhouses, child messengers darted through the crowds, and sturdy women poured copper into baked clay molds in the manufactories.\nA young man in a leather apron was taking a cigarette break outside a smithy. “Why is everyone building boats?” Mischling asked him.\n“We hope to be on the other side of the sea before the Sun comes up and changes everything,” he said.\n“Sun?”\n“The Sun is a thing not easy to explain. It is a great ball that rolls over the sky and then disappears in the west, only to be later reborn in the east. It is brighter than any lantern. Yet it is so far away that if you were to ride after it, however fleet your mount, you would never arrive on its shore. It casts a light over all the world. Yet when it goes down over the horizon, it takes that light with it and all is dark again. It has a surface temperature of roughly six thousand degrees Kelvin, yet its corona gets as hot as two million degrees. If you stand in its glare too long, your skin will turn red. Or so it will be, according to the Oracle, anyway, and she never lies.”\nMischling thanked the man and moved on.\n“When the Sun rises, everything on this side of the sea will turn to stone,” an ostler told her. “But those who reach the far side will not. This is why the Oracle has told us to make as many boats as can be built, that all might survive the change.”\n“How much time is there until the Sun appears?”\n“Not long,” the woman said. “The Oracle has told us to finish the boats we are working on but to begin no new ones, for there will be no time to complete them.”\nSo it went. When Mischling was done gathering information, she shared it with the brothers, concluding, “Night, they say, shall no longer be eternal, but punctuated by something called ‘day.’ But what that will be like, no one can say.”\n“What sort of thing is a boat?” Bone-Grinder asked.\n“It is like a pair of shoes that allow one to stand on water and it is like a steed which will carry one across that water. It has a large cloth called a sail which gathers the wind, a stick at the back which you point at whatever direction you wish not to go, and a wheel in between which turns the stick in the opposite direction it spins.”\n“We must journey to the far side of the water. The new world will need guidance,” said Goat-Eater.\n“Therefore we require a boat large enough to hold our true forms,” said Bone-Grinder, “and because this new thing, this ‘sea,’ will not obey our will, these people must build it for us.”\nThe silent one made a sharp gesture.\n“Or else,” Bone-Grinder translated.\n“But there is not enough time for them to build it,” Mischling objected.\n“Then we will give them time,” Goat-Eater said.\nThe brothers raised a steep hill on the landward side of Kiv. From its heights the city was a blaze of light against the ebony sea. A galaxy of lanterns bobbed in the harbor, where boats waited to depart with the tide.\nGray and grizzled, the silent one stretched out his arm over the city. His brothers did likewise. For a long time, they were motionless. Then a rumbling arose, as if of distant artillery. Louder it grew and more thunderous, until it filled the sky and shook the land underfoot. Veins stood out on their brows and sweat poured from their faces like rain. Lightning danced about their heads. Kiv and its surroundings shimmered and blurred.\nThen all was still.\nMischling, who had been holding her breath, gasped for air.\n“It is done,” Goat-Eater said. The brothers lowered their arms. “Kiv has been moved a decade into the past. In all that time, it will not suffer any sudden or arbitrary changes. This is a wonder such as the world has never seen.”\n“We still need a truth-teller,” Bone-Grinder said.\nThe silent one pointed at Mischling.\n“She will do,” agreed Bone-Grinder. Seizing Mischling by her shoulders, he transfixed her with his gaze. “Every word you say, from this instant onward will be true. All who hear you will know them to be so.” He released her. “Descend into the city. You will have ten years to do your work. We will return to Kiv for our boat just before its doom.”\n“But what do you expect me to do there?”\n“You will know what to do,” Goat-Eater said.\nThe silent one swatted her on her behind and she scampered downhill. When she looked back, the brothers were gone.\nThe city that Mischling entered was newer and quieter than before. Its people labored without any particular sense of urgency. Walking randomly and without purpose, she found herself in the Center Square, surrounded by guildhalls and government buildings. To one end was a platform upon which a man stood, addressing a small crowd. She climbed a set of steps on its side and shoved him out of her way. Looking down on the people, she cried, “Hwaet!”\nShe began speaking. Of the world as it was and of the world that was coming. Of the Sun and the destruction its light would bring upon them all. Of the need to build boats and to create a colony on the far side of the sea. The words came to her freely and out of nowhere. As she spoke, the crowd grew—slowly at first, and then rapidly, until the square was filled and all the streets leading into it as well. Thousands of silent faces turned up to Mischling in wonder.\nWhen she was done speaking, the jubilant crowd hoisted Mischling to their shoulders and, cheering, paraded her through the city as if she were an idol to be adored or an effigy on its way to a burning.\nFor ten years, Mischling reigned in Kiv. The art of governance was not difficult since she was invariably right and all knew it. Time passed, as if in a dream—a dream in which things changed only slowly and never abruptly or arbitrarily. Her people called her the Oracle and gave her their City Hall for a dwelling place. She, in turn, devoted all her energy to the boatbuilding enterprise, so as to save as many of them as possible.\nAlso, she set them to building a boat that would carry three giants.\nAlways, in the back of her mind, Mischling pondered the brothers. They had never, she realized, chosen to give themselves wisdom. Having power, they did not need it. She, however, commanded to understand whatever she needed to understand and needing to understand everything, was well on her way to being wise.\nWith wisdom came judgment—and in her judgment, the new world that was coming would be far better off if she could rid it of the brothers.\nBut how?\nOne night, the Oracle was wandering her city deep in thought when a notion popped into her head. The street ahead ended in a blank storehouse wall with an alley to either side. “When I turn the corner,” she said aloud, “there will be a little girl standing there, holding five kittens.” Then, so as to be sure, “Horned kittens.”\nShe turned the corner and saw a little girl struggling to control an armload of kittens. One wriggled free and the Oracle caught it as it fell. She scratched it between its nubby horns and returned it to the overburdened child. (“Thank you,” said the girl. “That one’s my favorite.”) Then, turning back, she chose a shop at random and said, “Someone who looks exactly like Pétur will come out of that chandlery now.”\nA slim young man hurried out of the chandlery and for an instant Mischling’s heart stopped. She had not counted on the likeness affecting her so.\n“Hai-hai, Oracle!” the man said cheerily, in a voice and manner not at all like Pétur’s. And was gone.\nWhen Mischling could think calmly again, she decided to give her newly discovered power another test. She attempted to say a deliberate lie: “I was never a mouse.” But she could not. No matter how she tried, the words would not form in her mouth.\nThis too was interesting.\nThe brothers had given her more power than they intended. Yet, even so, their power remained much greater than hers, and they had experience using it. Also, there were three of them and only one of her. “They will not return to Kiv,” she tried to say. “They have forgotten all about their boat.”\nThe words would not let themselves be said.\nThat night, lying sleepless in a bed far too large for one lone woman, Mischling found herself weeping. “I will never use this power I have selfishly,” she could not say. “I will not do the terrible thing that has entered my thoughts,” was also unutterable. Nor could she say, “I am strong enough to resist temptation.”\nIt was, however, the easiest thing in the world to say: “The next time I meet the young man who looks like Pétur, he will talk like Pétur and think like him as well.” Then, since she had already gone too far, she added, “He will love me just as I love him.”\nThat night, Mischling slept better than she had in years.\nIt was no coincidence that Mischling met New Pétur the next night, for immediately upon awakening, she had declared she would. But first she had to deal with a party from the Boatbuilders Guild who came to Oracle House to escort her to the yard where the Great Boat was nearing completion, so that she might inspect it.\nThe Great Boat was a simple klinker-built single-master, but huge beyond belief. The keel had been shaped from many large timbers doweled together, as had the strakes. The mast, similarly crafted, had to be hoisted by a crane special-built for that purpose. “It looks beautiful,” the Oracle said. “Is it seaworthy?”\n“I’d stake my life on it,” said Katrin, the mistress of the Boatbuilders’ Guild. “But . . . ”\n“But?”\n“But we can’t make a sail large enough for it.”\nPushing himself forward, Einar, who was the guild’s ranking mathematician, said, “Over such a large area, the first strong wind would shred it.” He presented the calculations and their meaning entered the Oracle’s head painlessly. “A thicker cloth might hold, but there is neither the time nor knowledge to make it.”\n“Have you tried sewing leather skins together?”\n“The seams would not hold.” Einar showed her further calculations.\n“In brief,” Katrin said, “all our work has been for nothing.”\n“A way will be found to make the sail,” the Oracle said. Upon which, the answer to the problem came to her. Briefly, she was stunned by the enormity of the solution. Then she smiled in a way she could see amazed the guild-folk, for never before had they seen malice on her face. “You will build a gibbet,” she said, “as tall as Oracle House and sturdy enough to hang a giant upon.”\n“But how will we capture this giant?” Katrin asked.\n“That will not be necessary. When the time comes, he will voluntarily sacrifice himself.”\nSo it was that, returning from the boatyard in a particularly good mood, Mischling took a sharp turn around a corner and slammed right into New Pétur. He apologized at length and, when he was done, Mischling stared silently up into his eyes. Then she took his hand and led him back to Oracle House.\nLater, lying naked in a bed that no longer seemed too large for her, Mischling said, “Tell me about yourself.”\n“Well . . . ” the so very familiar stranger said.\nPétur was a carpenter—of houses, not boats, though he could build boats as well, if called upon, and was sure he would be drafted into the boatbuilding enterprise as time ran short. He had a name, naturally, but Mischling forgot it in an instant. He also had a wife and children.\n“Do you love them?” Mischling asked, fearing the answer.\n“Very much,” Pétur replied. “But not as much as I do you.”\n“Tell me about your children.”\n“Magnus is very young—he has just discovered how to catch one of his feet with his hands. It takes him a while to do it, but when he succeeds he looks so very pleased with himself that my heart sings. Helga is about so high, and already she is a very prim and proper little lady. If I am careless with my eating manners, she scolds me, shaking her finger at me like this!” Pétur laughed. “Oh, such children I have! I am the most fortunate father in all Kiv.”\nEvery word made Mischling feel worse about herself. “Go back home to your children,” she wanted to say, “and forget this ever happened.” But what came out of her mouth was, “Tell me about your wife. But don’t tell me her name.”\nAll the light went out of Pétur. “She is a good woman, who deserves a better man than me. I thought when I married her that I would be able to keep my vows. But the heart scorns such promises. It knows only what it wants and will settle for nothing less.” He was silent for a breath. “Let us talk of more pleasant matters.”\nSo they did.\nEventually, Pétur drowsed off. Lying sleepless beside him, Mischling stared up at the ceiling. “I will send him home in the morning,” she couldn’t say. Nor, “A week will satisfy me.” Nor, “I will not ruin his life.”\nIn the end, the best she could manage was, “I will make up my mind when the brothers return to Kiv. If I let Pétur go, he and his family will reach the far side of the sea safely. In time, memory of me will fade. Whether his wife will ever forgive him and whether he will ever make peace with himself for the pain we are causing her, I do not know. Whether I love him enough to ever set him free, I do not know.\n“But for now, he is mine.”\nPétur moved into Oracle House, bringing with him a single satchel of clothes and his chest of tools. During work hours, he rehung doors, rebuilt balconies, and replaced rotting floors, for no one needed new houses.\nIt took no time at all for word that the Oracle had taken a married man for a lover to reach every ear in Kiv. To evil effect. Citizens—not all, but enough—concluded that there being deceit behind her actions, her words, believe them though they must, hid evil intent. Some shirked their labor; others pursued private matters at public expense, yet others refused to work at all. The boatbuilding, calculated to a nicety so there would be enough for everyone, fell behind schedule. Not all would be saved when the Sun finally rose. Worse, some of the obstructionists would be saved, while many who toiled hard and honorably wouldn’t.\nPétur, who was nobody’s fool, begged Mischling to send him away. “I am the cause of all this discord!”\n“I cannot,” she cried.\n“You must.”\n“So long as we both love each other, I refuse to let you go.”\n“I don’t love you.”\n“You lie!”\nAnd they both knew that to be true.\nPétur’s wife came to Oracle House to confront her husband’s new lover. She was tall and stern, with hair as black as the look in her eyes and the hard, rough hands of a woman who has worked all her life. Under other circumstances, Mischling could have liked her quite a lot.\n“I have come to take back my husband,” the woman said. “He is not the man I thought he was, but his children need him and he is still mine.”\nMischling put her little fists on her hips and, looking up at this big, brawny woman, said, “You have no power here and you know it.”\n“Do you want me to beg? Then I will beg.”\n“No, I want you to go. You will leave now.”\nThe woman turned away. She had no choice. Nevertheless, over her shoulder, she said, “I’ll be back.”\n“If you come back, your firstborn will die,” Mischling said. The woman was at the door. “Come back a second time and you’ll be childless.” She was shouting now and almost screaming, so as to be sure she was heard, “Come back a third time and Pétur will be a widower!”\nLater, with Pétur asleep beside her, Mischling stared out the window at a large red moon—there was only one moon tonight—and said aloud, “I’m as bad as the brothers. Worse, for they were never weak and don’t know how it feels. I should change my name to Man-Stealer, so all the city will know my shame.”\nBut of course they already did.\nAt last, the brothers returned.\nRather than put off their size, they willed the buildings to shrink away to make room for their passage. The citizens of Kiv watched in awe and fear as Mischling came out onto a balcony that Pétur had built onto Oracle House for this express purpose. Standing eye to eye with the giants, she told them what must be done if they were to have a sail for their boat. Her words did not please them. Two shouted angrily and shook their fists at her. But the third, grim and silent, turned away and plodded to the enormous gibbet at the far end of the square.\nA noose was produced, woven from many ropes of normal size, and the silent one placed it about his neck.\nAs a mark of honor, he was hung upside down.\nIt took him nine hours to die.\nWhen the deed was done, the silent one’s body was taken down and flayed. Then the skin, all in one piece, was brought to a tannery to be cured prior to being made into a sail. Goat-Eater and Bone-Grinder took their brother’s flayed body to the waterfront and placed it in the hold of the Great Boat, so that when they reached the far side of the sea, it might be wrapped in the sail and returned to life. For it was only on such conditions that the silent one had agreed to the sacrifice in the first place.\nWhile the tanning and sail-making were underway, Mischling stayed as far from the surviving brothers as she could. But when the sail had been fitted onto the Great Boat, Bone-Grinder and Goat-Eater returned to Oracle Square. Mischling went out onto the balcony again. She had a plan for eliminating each of them, and clever plans they were, too. But when she opened her mouth—\n“Silence, schemer!”\nBone-Grinder snatched up Mischling, the balcony disintegrating beneath her, and held her before his squinting eye. She could not speak. Her truth-telling had been muted. “You have worked a mighty mischief here,” he said, “against one who was greater than you can imagine. You forget who—and what!—you are. Therefore, your usefulness having come to an end, be again a mouse.”\nIn one bewildering instant, all the world loomed up around Mischling. She was all but lost in the vastness of Bone-Grinder’s hand. Delicately, he set her down on the square before him. Then he raised high a foot to stamp her flat.\nAs that foot came crashing down, Mischling panicked and ran for the building-side. She skittered along the plinth for its partial protection. Those who had been her subjects a minute before were now giants themselves and dangers to her. Worse, she had long ago forgotten all her mouse skills. But there was an iron grate in the pavement ahead and, more by luck than intent, she fell between its bars. With a splash, she landed in stagnant water and filth. In an instant, she was back on her four feet.\nShe fled down the storm sewer, panting in fear.\nAs she fled, Mischling said to herself, “I have killed one of them and, though I am small, I will find a way to destroy the other two.” She doubted the words, spoken only in her mind, had any power, particularly in her diminished form. But saying them made her feel braver. The world had no need of the brothers. Let them all die because of a mouse! Let Pétur be the cause of their downfall.\nShe began to make new plans.\nThe sewer led down to the sea. Emerging into open air onto a spill of rounded stones just above the high tide line, Mischling struggled at first to get her bearings. But the mast of the Great Boat loomed higher than anything else in the city and there was a lantern hung from its tip. She made that her lodestar.\nThe waterfront was all noise, lights, movement. Teamsters and stevedores were everywhere, emptying wagons and loading boats, while streams of refugees flowed about them, carrying what they could onto countless small craft. This made it difficult for Mischling to avoid being seen. But they were coming up on what the Oracle had declared would be the last outbound tide, so those who noticed Mischling had better things to do than harass a mouse. In relatively short order, she made her way to the grand pier, where an enormous hawser moored the Great Boat. It had metal baffles to keep off rodents like herself—but she had never planned to get aboard that way.\nInstead, Mischling searched among the boxes and barrels to be loaded onto the Great Boat and found a crate—to her, as large as a house—where one slat had buckled, leaking a trickle of grain. The grain had a heady aroma and, nibbling a little, she felt a fraction of the power she had lost—the merest smidgen—reenter her. She squeezed between the slats, burrowing into the grain. Snug within, she wriggled around so she could look out over the waterfront and all that was happening there.\nBoats were so thick on the harbor that an energetic man might cross from one side to the other by leaping from craft to craft. All who could were abandoning Kiv. Two piers over—lower and shorter and smaller piers, necessarily—Mischling saw three figures in silhouette. Two were female, tall and short, the larger one leading the smaller by her hand. The third was a man who clutched an infant to his breast. By the quickening of her heart, Mischling knew this to be New Pétur, with his family, hurrying to escape the doom about to fall on Kiv.\nMischling watched New Pétur, Magnus, Helga, and the woman whose name she had never known disappear over the edge of the pier onto a boat riding too low in the water to be seen. Hadn’t she once said, back when she was the Oracle, that they would all safely reach the far side of the sea? She couldn’t remember for sure. She hoped she had.\nIt hurt to lose her love a second time. But he was never the real Pétur anyway. Now that he was gone from her forever, she saw that she’d been a fool to behave as if he were.\nWithout warning, the crate Mischling was in was hurled into the sky and slammed down to the deck of the Great Boat. “That’s the last of them,” Bone-Grinder roared. “Let’s go.” He and Goat-Eater leaped onto the boat, one after the other, making it fling itself high and low, high and low.\nThere was a thumping of enormous boots as the boat was unmoored. “Let the sail be full of wind!” Goat-Eater commanded. “Brother, take the wheel and put Kiv to our backs. We must be on the far side of the sea before the rising of the Sun.”\nWater began to rush past the hull.\n“Let the city of Kiv burn behind us,” Bone-Grinder rumbled, “so that we always know which direction to steer away from.” In the wake of his words there came a roaring noise from landward, as of an all-consuming conflagration, and shortly thereafter the stench of burning buildings.\nTheir escape from oncoming doom had put the brothers in a good mood. “What should we do first when we reach the new land?” asked one. (Burrowing deeper into the grain, Mischling could not tell which muffled voice was which.) “Create bronze idols of ourselves to be worshipped? Change the mountains to rivers and the swamps to glaciers? Kill all the survivors of the old land and create new ones to replace them?”\n“All these things we shall do,” said the other, “just as soon as we have restored our brother to life. And much more as well.”\nThe words made Mischling’s blood run cold.\nNevertheless, she slipped out of her sanctuary crate. Mischling no longer had the Oracle’s power to reshape the world, nor a woman’s strength with which to sabotage the boat. But she had sharp little teeth.\nAlso, she knew the Great Boat’s construction, from top to bottom.\nThe boat’s wheel turned ropes that ran through pulleys below the deck to port and starboard, then back through a second set of pulleys to a spindle that made the rudder turn in the direction opposite the wheel’s rotation. In this counterintuitive manner, the boat could be turned in the same direction as the wheel.\nMischling crept below, undetected.\nOverhead, Goat-Eater and Bone-Grinder boasted, laughed, wrestled, and sang songs. They knew just enough to sail the boat. However, because they had never needed to understand how things work, they could never repair the tiller mechanism should it break. They would be left adrift at sea.\nAs would she. But that was a price Mischling was willing to pay for the sake of all who managed to escape the old country of perpetual night. Also, it might serve to atone, in part, for what she had done to New Pétur and his family.\nThe seas were calm and the course steady. Mischling climbed atop one of the ropes—it was many times thicker than she—that connected wheel and rudder. She anchored herself with all eighteen claws.\nShe began to gnaw.\nThe most heroic deeds are often drab and boring. Mischling attacked the rope with her teeth, to little effect. But she kept slashing, gnawing, and nibbling for hour after hour. Her jaws grew weary, then sore, and then numb. When she had made an inroad into the rope large enough for her to crawl into it, she stopped to examine her work. Whichever brother was at the wheel gave it a jerk and the rope leaped. Climbing back up, Mischling eyed the damaged rope carefully to see if it gave any sign of being ready to part.\nIt did not.\nWith an imagined sigh, she got back to work.\nUp top, the brothers took turns at the wheel, with occasional breaks to gamble at dice or argue or piss over the side, during which the Great Boat went wherever it listed.\nMeanwhile, Mischling kept gnawing away, like the Worm at the roots of the world tree said by some to exist at the northernmost pole of the world. Time and again, it came on her that the task was hopeless. Over and over, she thought of reasons to quit. Still, she persisted. This is my punishment, she thought, for acting like one of the mighty. But if punishment it was, it was one she accepted, for she did not stop gnawing.\nThen a single strand of rope fiber popped straight up from where she’d been chewing.\nMischling stopped, blinked. A second strand popped up.\nThe rope quivered like a violin string.\nThe brothers were banging about overhead, unaware of this new peril. Looking up through the hatchway for the first time since she had started severing the rope, Mischling saw that the sky was lighter than any she had ever known. The words false dawn popped into her head, and though she did not know their meaning, they gave her hope. She strained to make sense of the brothers’ voices.\n“It’s coming! We must make speed or . . . ”\n“We’re almost there. Look! There on the . . . it’s rising up!”\n“Not a . . . too soon. Our only chance . . . ”\nMischling scurried to find a place directly under the brothers, where she could hear them with greatest clarity. This was made more difficult by the way their voices rose and fell and overlapped. But she thought she had found it when—\nThe rope broke.\nIts two halves lashed back and forth like bullwhips, hissing in the air. Mischling cowered beneath them. She heard the brothers shout in anger and amazement. Goat-Eater tumbled down below like a rockslide and, seeing the flying ropes, seized first one and then the other. Cursing, he tied the two of them together. But in doing so, he yanked out the pulleys they rode in. So when he lumbered back up, he found the wheel still slack and the boat unwilling to obey it.\nMischling, meanwhile, followed in Goat-Eater’s shadow and found a hiding place within a stack of crates and sacks where, unobserved, she could watch her plan play out.\n“Look!” cried Bone-Grinder, pointing one long, misshapen arm to the east. “It comes!”\nA golden line of color touched the horizon, harbinger of the coming Sun. In that direction lay the mountains and forests and cities of the old country, doubtless already turned to stone. Before them, the dark cliffs of the new country loomed up. “We must reach land,” cried Goat-Eater. “But the boat refuses to obey me.”\n“We are almost there,” answered Bone-Grinder. “Grab the rope and leap overboard. We can pull the boat to shore.”\nThere was a splash and then another. Mischling emerged from the shadows and climbed up on the rail. The land was so very close, only minutes away. There was no doubt in her mind that the brothers would reach it.\nShe wanted to cry.\nBut then, with a radiance that was like the fanfare of a thousand trumpets, the Sun breasted the horizon. Its light stretched out across the sea to touch the Great Boat and the brothers pulling it. The boat and then the brothers slowed, stilled, turned to stone. The black stone rope connecting the three broke into a hundred fragments and fell into the sea, there to begin the ages-long process of turning into sand.\nTo her surprise, Mischling did not turn to stone. In all the Great Boat, she was the only thing that didn’t. Why this should be, she did not know, unless it was that she was too small and unimportant for such a grand transformation. She felt inside herself for her lost power and found that a small fragment of it lingered.\nSummoning that power, Mischling changed herself back to a woman. She stripped out of her clothes. Then she slipped over the boat’s stony side and swam toward shore. When she was on solid land, she would decide whether to be mouse or maid.\nAnd then she would give herself a new name.\nThree sea stacks stand just off the black sand beach Reynisfjara near the village of Vik on the southern coast of Iceland. Legend has it that they are two trolls and a boat they were hauling to shore, all turned to stone when they were caught by the rays of the rising sun. This is the first and only true account of what actually occurred. Let all who read these words be schooled thereby and live their lives accordingly.\nMichael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.\nThis year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.\nHe lives in Philadelphia with his wife, Marianne Porter."}