{"fingerprint": "o7jf+yHoLcHsn32J+oxzMAfI02Y=", "sitename": "Clarkesworld Magazine", "title": "Dinosaurs and Metaphors: A Conversation with Sheila Williams by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/swilliams_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dinosaurs and Metaphors: A Conversation with Sheila Williams by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Dinosaurs and Metaphors: A Conversation with Sheila Williams\n Born in Springfield, MA, Sheila Williams grew up in a family of five in western Massachusetts. Her mother had a master’s degree in microbiology; her father sparked her interest in genre fiction, reading Edgar Rice Burroughs to her. He had a membership to the Science Fiction Book Club, which delivered books every month. Once the spark caught, she read everything she could get her hands on. At the library she discovered a secret code: the books she loved had spaceships on the spines.\n Williams attended Elmira College in upstate New York. She spent a year abroad at the London School of Economics before graduating with a degree in philosophy. She earned her master’s in philosophy at Washington University in St. Louis, MO.\n In 1981, Williams joined the publishing industry, starting in a subsidiary rights department. In 1982, she became an assistant at Asimov’s Science Fiction Magazine, where she would work with the eponymous author and editor for ten years. Williams was given more responsibilities in weeks and the managing editor title in three years. In 1992, she cofounded the Dell Magazines Award for Undergraduate Excellence with Rick Wilber, a project that nurtures emerging authors beyond simply handing them a prize.\n She became editor of Asimov’s in 2004 when Gardner Dozois retired. Williams has been a Hugo Award finalist for editing almost every year since 2006 and won in 2011 and 2012. The magazine won Locus Awards in 2011, 2012, 2013, 2014, and 2016. In 2018, she was given SFWA’s Kate Wilhelm Solstice Award, with Gardner Dozois, “to honor their editing careers in support of science fiction and fantasy.”\n Williams has coedited many anthologies, the bulk of them collecting stories from Asimov’s, starting with Tales from Isaac Asimov’s Science Fiction Magazine in 1986 with Cynthia Manson, and including a long line of themed books with Gardner Dozois, such as 1999’s Isaac Asimov’s Werewolves. She edited Why I Left Harry’s All Night Hamburgers and Other Stories in 1990 with Charles Ardai and A Woman’s Liberation: A Choice of Futures By and About Women in 2001 with Connie Willis.\n Solo projects include Hugo and Nebula Award Winners from Asimov’s Science Fiction in 1995, Asimov’s Science Fiction: 30th Anniversary Anthology in 2007, and Enter a Future: Fantastic Tales from Asimov’s Science Fiction in 2010.\n Most recently, she’s spent time helping to arrange poetry readings for high school students at a local Barnes & Noble. “Some of the kids are nervous,” Williams says, “but I think they all benefit from having a real author’s reading experience. It’s wonderful to see how supportive they are of each other.”\n You once told me, “I love dinosaur stories!” Are there certain elements or aspects or things that the stories you love the most have in common? Or does it vary greatly depending on the story?\n I love many different kinds of stories. I do love dinosaur stories, but I also use the word as a metaphor. The “dinosaur” represents the fantastic element, be it scientific, surreal, or supernatural. I’ve read many New Yorker stories, but they don’t tend to be among my favorites. (There are exceptions, but these tend to be tales like George Saunders’ “Escape from Spiderhead.”) A story about a bad marriage, or a pedestrian neighborhood, or a claustrophobic social scene, usually needs an additional fantastic component to resonate with me. An example of this is Dale Bailey’s “Mating Habits of the Late Cretaceous.” This perfect story has everything—a disintegrating marriage and depression, but also time travel and dinosaurs! My favorite stories tend to be told on multiple levels, but they are all different.\n Since you took over Asimov’s in 2004, do you feel like there are specific things about your taste in stories that have changed?\n I’ve always been open to the next new idea, the next new type of story. It’s not so much that my tastes have changed as it is that authors and their fiction are influenced by their perspectives and by changing events. New authors bring new ideas. There’s a deeper appreciation of the diverse backgrounds today’s authors bring to the field. Authors are introducing a host of fresh ideas, new storytelling techniques, new characters, new worlds.\n I’m enjoying all of it. I loved what I was buying in 2004, but I wouldn’t want to be buying the exact same material sixteen years later. Even the authors who were being published in 2004 have grown and changed, and their fiction has evolved as well. My November/December holiday cover story by Sam Schreiber (“Christmas at the Hilbert Astoria”) is probably a bit zanier than something I might have published in 2005, but it contains a lot of complex math and physics and pairs well with my new Christmas story from Connie Willis (“Take a Look at the Five and Ten”). The issue also has stories by Alaya Dawn Johnson, Chen Qiufan, Julie Novakova, and lots of other recognizable names. No two are alike!\n Even before you took over Asimov’s you had been at Analog for a number of years, and you are part of a science fiction legacy. Do you feel like genre definitions are important, are they relevant? And how do you feel about horror or dark fantasy?\n I think it’s still important that there is a form of literature that explores the effects of science and technology on our culture and looks to their effects on the future. This is a rich vein that continually gives to authors as new advancements and discoveries occur in the STEM disciplines. It is the sort of fiction that I wanted for Entanglements. Entanglements may be the first book in the Twelve Tomorrows series to address a specific theme, but all the fiction in these books has been hard science fiction. I publish stories like this in Asimov’s, but I’m also delighted when the lines between science fiction and fantasy and horror blur. There is a lot of room for experimentation and the blending of ideas among these related fields.\n How did the Entanglements project come about; how did it develop, and why “Entanglements” as a specific theme?\n Susan Buckley, an acquisitions editor at MIT Press, contacted me late in November 2018 to inquire if I’d be interested in editing the 2020 edition of Twelve Tomorrows. This was to be the first edition with a specific theme. She and Gideon Lichfield of MIT Technology Review had already discussed some options for the theme, but they wanted to reach the final decision with me. I thought the effect of new technology on human relationships was both an intriguing theme and one that was broad enough that authors could approach it in myriad ways.\n Did the book turn out pretty much how you’d initially envisioned it? Or are there important differences between initial concept and final product?\n The final book is full of surprises, but in the quality of writing and diversity of ideas, it’s exactly what I was hoping for. There’s a range in story length and tone. This range happened organically, but it’s an essential element of an interesting collection of tales.\n What was the editorial process like in terms of story selection and/or ToC development?\n I submitted a list of twelve to fifteen authors who I knew were capable of tackling Entanglements’ themes in creative ways. A few authors fell off the list because my editors preferred not to have any overlap with authors who had appeared in the 2018 volume of Twelve Tomorrows. A few of the remaining authors were busy with other obligations. This left me with eight authors from the original list. I suggested a couple of new names and Gideon and Susan also made some recommendations. I was extremely happy with the final table of contents.\n There were other important aspects that went into the book’s development. I enjoyed working with Xia Jia on her thrilling tale, which was translated from Chinese by Ken Liu. Working closely with both authors gave me deeper insights into “The Monk of Lingyin Temple.”\n I had a lot of fun going through loads of art with Susan. Tatiana Plakhova’s work is stunning, thoughtful, and full of entangled connections. I was really pleased that she agreed to be a part of Entanglements.\n Personally, one very satisfying aspect of this book was having the opportunity to choose a distinguished science fiction author to profile or interview. Other volumes of TT have featured Neal Stephenson, Samuel R. Delany, and Gene Wolfe. I knew immediately that the author I wanted to fill this role was Nancy Kress. Lisa Yaszek, a professor of science fiction studies at Georgia Tech, whose work I’ve followed for some time, was an excellent interviewer. I felt very lucky that Nancy agreed to write “Invisible People” for the book as well.\n Were there stories you really liked that didn’t make it into final selection for one reason or another?\n No. This wasn’t an open call for submissions. One author sent two stories and I had a very strong preference for one over the other. Another author offered me a couple of different story scenarios. Both would have been fascinating, but sadly I could only choose one. I did ask for some rewrites and clarifications, but I was very happy with the quality of the material that I received.\n In the Introduction you wrote, “The book’s ten fiction authors were asked to write tales about the emotional bonds that hold us together. They had a broad canvas.” What are the advantages to giving authors a broad canvas to work with, and are there also potential disadvantages?\n I was afraid that a narrow theme would result in stories that were too similar to each other. A broad theme ensures that that there will be a variety of perspectives. Yet, there were some very interesting, and narrower, themes that I didn’t choose. I’d love to revisit some of these and figure out strategies for making them work.\n If someone will read only one story to see if the book is for them, which story would you tell them to read—and why?\n One strong feature of an anthology is the range of material. Some stories will appeal to you. Different stories may appeal to someone else. “Sparklybits,” Nick Wolven’s complicated tale about parenting dynamics, tools for virtual education, and concerns about screen time may be the best story for one reader. “Your Boyfriend Experience,” James Patrick Kelly’s story about a sexbot developer, his boyfriend, and the sexbot may be someone else’s favorite. “The Monogamy Hormone,” Annalee Newitz’s often very amusing story about a woman trying to choose between two lovers should charm almost everyone.\n Science fiction can challenge readers in different ways. Which story in the anthology challenges the reader the most?\n Sam J. Miller’s “The Nation of the Sick” may be the most challenging. There are a million ideas coming at the reader. As we are getting our mind around iterative modeling and floating fungitecture, our understanding of two brothers’ complex relationship also becomes clearer. The epistolary storytelling technique eventually yields the entire picture, but getting there is a great ride.\n Science fiction can also be about innovative ideas. When you think about the book from this angle, which stories come to mind?\n In addition to technology and ideas mentioned elsewhere here are a few: “Mediation,” Cadwell Turnbull’s deeply moving story about grief and an AI family therapist; “Don’t Mind Me,” Suzanne Palmer’s chilling look at a child-lock device that conveys ultimate parental control; “The Monogamy Hormone,” with Annalee Newitz’s walls painted with bacterial slime to help build the immune system of elementary students; and Mary Robinette Kowal’s robot service animals in “A Little Wisdom” are great examples of innovative ideas about technology’s future effects on all of us.\n If you weren’t collecting these pieces for Entanglements, would you have potentially published them in Asimov’s?\n Each of these stories could have been published in Asimov’s, although not in the same issue, as the issues aren’t thematic. There’s a brief graphic scene in Rich Larson’s story that might have caused me to waver about whether it was right for Asimov’s. Still, the characters are so humanely drawn and the mix of humor and pathos work so well that there’s a good chance I would have ultimately decided to take it for the magazine.\n You’ve edited a number of anthologies before, but the bulk of them are related to Asimov’s. Do you plan to do more anthologies completely separately from the magazine?\n Working on this original anthology was challenging and fun. I’d love to do more books like this if the opportunity comes along.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}