{"fingerprint": "+KvzytQfMLlgOrgDEN+o5SgpyI4=", "sitename": "Clarkesworld Magazine", "title": "Angel Pattern by Henry Szabranski", "author": "Henry Szabranski", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/szabranski_04_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Angel Pattern by Henry Szabranski", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8850 words, novelette\n Angel Pattern\n The city waited for our approach, crouched upon the valley floor like some vast, decaying predator.\n Skink, Creeper, and I paused at its edge to check for any signs of the patternmakers, but only whorls of ancient dust and crazed noon shadows greeted us. What seemed from a distance to be elegant domes and spires had turned out to be nothing of the sort. Huge outstretched arms, upright torsos, and out of scale heads thrust from the ground in a bizarre imitation of buildings. Even I, who had been brought up inside the giant body of the Motherman, was awed by the sheer size and intricacy of the grisly constructs.\n “Closer,” Skink urged.\n Creeper juddered into life beneath us. Over the course of our long journey the giant weaver’s once smooth walking action had been reduced to a bone-shaking stagger, but Skink had no choice other than to continue riding it. She could barely walk now, and no longer allowed me to carry her.\n “Look, Percher.” She pointed.\n I craned my neck, shielding my eyes from the glare of the sun. Cold sweat prickled and a familiar nausea stirred. Ever since we had left the shelter of the weave, the open sky terrified me. During the trip I had become well-practiced at distracting myself: by concentrating on the back of my hands, the increasingly sunburned nape of Skink’s neck, the intricacy of Creeper’s woven form—anything but acknowledge the yawning emptiness above. But now the lines of the city drew my gaze inexorably upward. Placed bright blue infinity squarely at the center of my attention. Framed by a perfectly circular ring of cloud high above the city.\n Dots circled within it. Bigger than birds or razorbugs could be, to appear as large as they did from the ground. Difficult to guess their true scale. Only that they were mostly wing, and high, high up.\n Overcome by dizziness, I steadied myself against one of Creeper’s many spiny protrusions.\n “Is that them?” I forced myself to keep looking up. “The patternmakers?”\n “Can’t be.” Skink gazed at the dots circling high above us, her expression unreadable. “Haven’t you heard the stories? They all gone, Percher. Long time ago.”\n During the journey, when reaching the city still seemed like a distant prospect, before Creeper had begun to noticeably deteriorate, before our supplies ran low, we had sampled the wine nestling at the bottom of the basket Skink had stolen from the witch, Meghra. That night the stars were pin-bright and a warm breeze countered the nighttime chill atop the giant weaver’s rocking chassis. Skink said her legs ached, and maybe the wine would help ease the pain.\n “You haven’t used them in days,” I pointed out. Though I had often seen her balancing on her hands, indeed walking on them more than a few steps, her body arched above her head in an increasingly familiar acrobatic performance.\n “Don’t need to use them, Percher.” Her voice rose in uncharacteristic emotion. “They always hurt. Always.”\n I noticed the glimmer in her eyes. “Sorry.” I was mortified. “Didn’t know.”\n “I don’t talk about it. Does no good.” Her anger was already cooling. “But they do hurt. All the time.”\n So many days we had been traveling together, and still she could surprise me.\n I rummaged behind me into the basket lodged in Creeper’s carapace until I found the unopened flagons of wine. Handed one to Skink and un-stoppered one for myself.\n The contents of Meghra’s basket had kept us alive during the long passage across the plain. “Found it in her cave,” Skink had explained, matter-of-factly, the day we set out. The day Skink had defeated her. “She doesn’t need it anymore.” The basket was full of neatly wrapped packages of spiced meat—which we avoided for as long as our hunger allowed, fearful of Meghra’s cannibalistic tastes—but also scrubbed root vegetables, dried fruits, nuts, flasks of spring water, and vinegary red wine. Supplies Meghra’s flesh body had still required or desired, even embedded in its fearsome suit of weave.\n I sampled the wine, curious and a little anxious. It tasted pungent, sour, and unfamiliar. In the Motherman, Da had occasionally fermented bone fruit, though such luxuries never reached young climblings like me or outcasts like Skink. I remembered the boorish misbehavior and next day illness its consumption seemed to cause, but only a gradual feeling of dizzy contentment stole over me as I drank more. I asked Skink, “Is it helping?”\n “Not making it worse.”\n The warmth in my belly spread, and the concern that perhaps Meghra had left us a poisoned gift receded. I stood and balanced on Creeper’s back, swaying beneath the open sky without fear for the first time since the Motherman’s fall.\n Skink laughed at my antics. “You dancing!” At her unspoken command, Creeper lurched so that I stumbled and fell back into my seat.\n “Ouch!” But I was laughing. “How you make it do that?”\n “Don’t know. Just can.”\n “I try!” I screwed up my face in semi-mock effort. “Creeper! Go in circle!”\n Of course the repurposed weaver took no notice of me. I had no link with it, no idea of what that would even feel like or how I could ever gain it.\n “Silly, Percher. No sense going in circles—journey will take longer.”\n “Circles!” I shouted. “Creeper, do as I say!”\n Creeper began to sway left and then right, but I knew it was only Skink indulging me. I staggered over to the nub above its head that served as her seat. “No good. Creeper has but one master.”\n “Don’t forget it.”\n “Maybe I’ll learn to how to control the weave. In the library, when we reach the city.”\n “Not a competition, Percher,” Skink said. She reached for the flagon gripped in my hand. “More wine.”\n “We’ve had enough,” I warned, half-seriously.\n “It’s medicine,” she said, and took another swig. “Need more.”\n I followed her example, and for a while we sat in companionable silence beneath the swaying stars.\n “Doesn’t it worry you?” Skink eventually said, her voice quiet and serious.\n “Hmmm?” I thought she was going to mention the city, or the prospect of meeting the patternmakers, or even just crossing the plain in the darkness. But I was wrong.\n “That I’m a killer.”\n I hesitated, struggling to emerge from my comfortable mood. This was the first time that she had mentioned such thoughts troubled her. “Meghra would have killed you. Or worse. You had no choice.”\n “Maybe.” She remained pensive. “Broc, too?”\n I rubbed my jaw. “Yes. Same.” Broc had been my older brother. Always little love lost between us, and by the time Skink had pushed him out of the Motherman’s skull into the mist far below he had been infected by the clevers’ murderous pattern. “Saved both our lives,” I said. “Twice.”\n Skink’s hand repeatedly rubbed her calf. A tracery of silvery white scars I hadn’t noticed before marked the skin. Eager to change the subject, I asked her what they were.\n “Mist caught me. When I was a baby.”\n I was surprised again. I had no idea. So much I still didn’t know about her. “Thought you were born . . . this way.”\n “My legs? I was. It’s why I couldn’t outrun the mist.” She gave me a withering look. Truth was I probably deserved it. When she was an outcast, before I properly knew her, before the fire and the razorbugs and the fall of the Motherman . . . I hadn’t been interested in her past. Only that she was a burden that Ma or Da made me carry when they needed to rest. My face radiated shame.\n “I was exploring,” she said. “Playing, climbing down. Got lost. The mist rose, and . . . ” She waved at her left foot, which in particular always pointed inward and was heavily veined with scar tissue. “Afterward, tribe tried to offer me back to the mist. Even my Ma and Da. Said I was chosen. Said I was cursed. So I ran. Best I could. Climbed and pulled myself up away from my family until I couldn’t climb anymore.”\n Without thinking I put my hand on her arm. “You must have felt so scared. So lonely.” She didn’t flinch away, as sometimes she did.\n “Was. Until your Ma and Da found me. Took me in. Began whole new life.”\n We grew silent. Remembering what we had left behind. Who and what we had lost, to the razorbugs and the rot and the fire and the mist.\n She reached for something beside her. “Here.” She held out a pendant of some sort, strung upon a single fine withy. Had she found it in Meghra’s basket? Shaped like a tiny weaver, it glistened darkly in her hand.\n “What’s this? My own little Creeper?”\n “Made it for you. A gift.” Her eyes looked directly into mine, sincere and fearful, so unlike her usual defiant expression. I was momentarily lost for words as I realized how much of a fool I had been for treating her offering lightly. It was obvious she had spent some time and effort making it.\n I carefully took the pendant, my fingers brushing hers very briefly, strangely sensitive and awkward at the same time, and pulled the ornament over my head. Tiny claws scritched the hairs on my chest. I said, “It’s beautiful.” And before I knew it, “You’re beautiful, too.”\n Her arms twined around my shoulders. Strong hands on the back of my neck. So many times I had held her, carried her, but never before like this; face-to-face. The taste of wine on her lips, on her breath warm.\n So many days together. And still she could surprise me.\n Creeper managed to clank and shudder down the final slope toward the city. If it had been uphill I doubt we would have made it. The weaver made a groaning noise and sank down beside the closest, half-collapsed tower. Before we had even dismounted, one of its many limbs had extended and began to pick apart the spilled mesh from a sloughed-off tongue of weave, eager to incorporate the spare withy strands into its own fraying pattern.\n Skink clambered down Creeper’s side. Fleet and skillful upon and within the weave, she slowed considerably when she reached the ground and took her first, hesitant step onto the debris-littered avenue. I watched her for a few moments before climbing down to offer my help. Things had been strangely awkward between us since that drunken night. Much remained unspoken. Was she regretful? Had I upset her? Did she just want things to go back to the way they had been before? Perhaps all these thoughts only troubled my mind and not hers.\n I steadied Skink as she leaned down and picked up a long, dark fragment of weave. “It’s dead.” She twisted it in her strong hands and it crackled apart. “Old and dead.” Disappointment, and perhaps a little worry, were evident in her voice. “Everything here . . . dead. Notice that, Percher? No trees or weeds or plants or grass or anything. Just dust and old weave.”\n She pushed away from my shoulder and limped toward the nearest building, a thick tentacle corkscrewing into the sky. She gripped its exterior and tried to climb. Withies snapped and crumbled beneath her fingers, but she managed to hold on. In moments she had pulled herself off the ground and slithered into a small opening above my head. There was little chance of me following her; I tried to grasp the weave in her trail but it crumbled to dust in my hand, too brittle to hold my clumsy weight.\n A gust of wind stirred the shards of weave around me. The tentacle building groaned and swayed. I wondered how deep its foundations lay. Just our luck that for countless centuries it had stood, but now upon our arrival it seemed it would collapse at any moment.\n I noticed a small, pale globe in the gray ash near my feet. I picked it up: a skull of some small animal; a mouse or rat or some other rodent. The bone was pitted and badly eroded, as if scoured by acid or millennia of dust-laden winds. I dropped it, shuddering, suddenly reminded of Da, of the way I had found him, that time back in the Motherman when the mist rose too high. Thank the gods we were finally safe from at least that curse, here in the heart of the plateau.\n Skink’s dark-smeared face reappeared at the hole she had crawled into. “No good. Need to go farther into the city.” I watched in relief as she scrambled back down to join me on the ground.\n “That’s where you think it is? The library?” I presumed this was where Skink still wanted us to go, the place where she said Meghra had discovered how to control the weave. Skink had seen some of Meghra’s mind during their terminal battle. Learned something of the witch’s memories, about the ruined city she had visited, the place where Meghra had gained the ancient knowledge of the patternmakers.\n “Farther in. And high. It’s up high.”\n I looked up at the dying towers around us, their tips swaying in the wind. The sick feeling in my stomach growing. The mysterious winged dots higher still within their halo of cloud, patient as vultures.\n “Oh good,” I said.\n In our absence, Creeper had given up trying to rebuild itself. It turned out the collapsed building’s withies were too desiccated to use as replacements for the weaver’s own worn and damaged parts. Instead, it had reconfigured itself. Shedding material, becoming thinner, taller. I watched in fascination as Creeper bent and twisted its structure, discarding or reforming its body and limbs until it finally resembled a hunched biped. A miniature Motherman.\n With a human-shaped cavity in its torso.\n I jumped at a touch on my shoulder, so intent on watching Creeper’s weirdly mobile innards reconfigure themselves that I had failed to notice Skink beside me.\n “Need to walk awhile,” she said. “You don’t mind?”\n “Mind?”\n She pointed at the opening in Creeper’s chest. “Only room for one this time.”\n “I . . . sure. Don’t mind.” Actually, now that she mentioned it, I did feel excluded, although I knew it wasn’t fair or rational. We had always ridden Creeper together until this point.\n “Thank you.” She smiled, and briefly my chest tightened with some strange, ache-some emotion. Creeper, I, even the fallen Motherman—we had all borne Skink at some point.\n She limped over to the newly humanoid weaver and climbed into its black heart. For a moment I was reminded of Meghra, of how she had similarly worn such a body. A different shape, much larger than this, but essentially the same idea. A dark carriage to help her weakened limbs move.\n Even after Skink had settled inside it, Creeper continued to change. Rebalancing itself, closing tighter around its mistress. In some parts it became difficult to see where Creeper ended and where Skink began. I remembered when Skink had first found the weaver, half-dead and small enough to fit into her palm. Could it always change its shape this way, I wondered, or was proximity to the city somehow enhancing its capabilities? Or was it Skink’s control that was improving?\n “Look at you,” I said quietly, a thought made vocal. “Look what you become.” Then, louder: “You’ve already mastered the weave, Skink. Is there really any more you can learn from this place?”\n Creeper/Skink swayed as it practiced balancing on two feet, limbering up, exploring the range of motion of its new configuration. “You don’t understand,” Skink said, her voice muffled. “The deeper I go, the more there is.”\n “Do you need to go deeper?” I remembered the dried-up carcass we had found rotting in the center of the Motherman’s brain. Skink had briefly taken its place, made the burning colossus that was our home walk so that we could reach the safety of the plateau before the Motherman collapsed into the deadly mist swirling at its feet. But at what cost? I remembered, too, the way Skink had destroyed Meghra, turned the witch’s own weave against her.\n During the battle, the old witch had almost sucked out Skink’s brain, absorbed its pattern into her own. But sometimes I wondered if it wasn’t Skink who had accidentally managed the reverse.\n Doesn’t it worry you? That I’m a killer?\n She was laughing now, still enjoying Creeper moving around her. “Why limit myself?”\n “Did Meghra limit herself? When she tried to read the pattern of your mind?”\n Skink’s dark eyes flashed with anger. “Different!”\n “Was it? Maybe that’s how she began. Came to this place and when she returned she tore away the brains of those she used to call family.”\n Creeper/Skink raised a long and powerful arm, curled weave fingers that could easily crush mine. “Not same at all, Percher. She damaged long before she came here. Never found more but the simplest mysteries.”\n “More than enough.”\n “Don’t be stupid, Percher. You know why we came here.” Weave hands rested on weave hips. “Expected better of you.”\n “Expected too much!”\n With an exasperated sigh Creeper/Skink turned toward the city.\n “Too much,” I whispered, to their retreating backs.\n No signs of life, farther in. No weeds or vines. No birds, no insects. Just dust and withies and half-buried, crumbling skeletons and the circling dots far above. Even so, I thought I heard skittering noises and rustlings deep in the weave. I picked up my pace, making sure I stayed in Creeper/Skink’s protective shadow; I knew from experience I should trust my instincts about being watched or followed.\n The anthropomorphic buildings pressing in around us became increasingly bizarre and disturbing; huge body organs or forms both too alike and unlike human. The deeper we ventured into the city the more they unsettled me; we walked amongst the feet of a grotesque and crowded stampede of titans in flight, or battle, or anguish. I had hoped to be reassured by the presence of the weave around me, thought it would help shield me from the tyranny of the sky, a familiar environment I could scurry back into, but it turned out to be no comfort at all. The patternmakers’ city was no cozy new home; instead it was a frozen moment of panic, of despair, of dissolution.\n Eventually the rustlings and movements around us grew too loud to ignore. Creeper/Skink and I halted as the denizens of the city began to reveal themselves at last.\n Weavers crawled out of the weave. From fist-sized beetles to tiny, barely visible mites that at first seemed like falls of dust, except that they quickly gathered into a marching army. Grasping hold of each other, forming chains, spheres, tubes, sheets of interlinked bodies and limbs, all merging into each other in a rippling, complexifying mass. Clumping together in mounds, clambering over each other like eager toads, forming tottering columns, extruding spindly arms and legs. Had the patternmakers of old encoded themselves into the weave itself? If so, their forms had devolved over time. Like the clevers in the Motherman’s head, barely capable of speech and even motion; groaning and honking and squealing, hopping and tumbling and slithering into the streets like a withy tide. Dozens of newborn mouths babbling, spewing at first nonsense, and then distinct words:\n “Well! Well!”\n “Well, well, well!”\n “Welcome!”\n I drew close to Creeper/Skink. The transforming weavers weren’t overtly threatening, but their sheer number and inconstancy intimidated me. The streets on all sides quivered with strange life. “What do you want?” I cried.\n Skink immediately made a shhh-ing noise. “Quiet, Percher!”\n We were surrounded. My disquiet rapidly grew into outright terror. What was there to stop all these creatures from simply burying us beneath their combined mass?\n From the streets on the right, a chorus: “Intruders!”\n From the left, a reply: “Seekers!”\n “Yes, seekers,” Skink said. “Seekers! That’s what we are.”\n A debate seemed to rage amongst the weavers. Hissing, clicking, popping, as if their constituent material were physically boiling. Then they appeared to settle, and a single voice from all ’round spoke: “To the mouth!” Stubby tentacles, elongated fingers, claws, and innumerable other types of limb and digit motioned in the same direction.\n Two of the largest and closest weaver colonies, a pair of shambling humanoid mounds only a few steps from us, pointed in the direction we were already heading. The center of the city. “Yes, the mouth, the mouth!” the first and largest one said, voice vaguely male. “Find yourselves there,” the smaller one said, voice vaguely female. Both of them, in their forms and in their mannerisms, uncannily familiar . . . but my mind shied away from making any definite identification.\n “We are going.” Skink’s voice was clear and calm. As if she were addressing a clutch of misbehaving young climblings. “Do not concern yourselves.”\n The weaver tide withdrew as quickly as it had appeared, slithering and clambering back into its countless nest holes in the buildings around us. Soon only the closest two forms remained, the humanoid pair staring at us with freshly grown eyes.\n “To understand and control the weave,” the smaller creature said, “you must become one with it.”\n “I know,” said Skink.\n I looked between her and the withy creatures, and at that moment I could not say which of the three of them terrified me more.\n The city’s hollow heart stretched as wide as the tallest building stood high: a huge circular pit in the compacted, layered weave. A ring of enormous faces surrounded the hole, a coven of titans overseeing the invisible brew within it. Heads larger even than the Motherman’s, peering into the opening, mouths and eyes open or grimacing as if in shock or surprise.\n Crystalline withies crackled beneath my feet as I stepped toward the pit’s edge. The lip around the perfectly circular hole was slightly raised, and the rim itself rounded. Water from the hills around the valley must have once pooled around the rim until it had eroded channels and narrow gullies through the weave. A series of waterfalls drizzled down the pit’s throat until they dissolved into a pale mist in the darkness far below. As far as I could tell it might as well have reached all the way to the center of the planet. I picked up a broken fragment of weave and tossed it in, watching it tumble and turn until I could see it no more.\n Beside me, Skink leaned forward out of Creeper’s chest. The weaver had reconfigured itself again, becoming even more compact and humanlike. Perhaps modeling itself after the weavers we had left behind in the city streets.\n I indicated the pit. “Was it made during the war?”\n “No. Look.” Skink waved at the huge faces surrounding us. “Point toward it, built ’round it. Hole must have been here first.”\n I scuffed the withies at my feet. How deep did they reach? I wondered if the whole plateau was made of them. The land upon which we stood only a thin skin of rock and soil layered over a giant plug of weave thrust up from the otherwise endless sea of mist. How many weavers must it have taken to create such a mass? How incredibly powerful the patternmakers must have been, to muster and master such resources.\n We circled the raised lip of the pit, slowly. The weave here was not the dry dead stuff we had encountered on the outskirts. Dark, lustrous, pliable. We must be close to some source of power or nutrition. Whatever that could even be.\n One building near the pit was different from the others. Like a thin-stalked toadstool leaning over the hole, it arced in a curve so that its disc-like crown seemed to hover directly above the pit. Its constituent withies so densely woven its outer skin appeared solid and without gap. Skink immediately pointed it out.\n “The library.”\n My heart leaped. At last, the prospect of some reward for our long journey. The possibility of answers. A whole treasure trove of them.\n We followed the raised, ragged edge of the pit toward it. But as we approached the entrance at the base of the stalk Skink hesitated.\n Between the library and us, a single thin tongue of weave reached out over the pit. I wondered at its purpose. Had the patternmakers used it to toss sacrifices into the heart of the underworld? Or simply basked there in the warmth of the air rising from the pit? Perhaps prayers or poems were recited for the delectation of the giant onlooking faces.\n “Don’t stop,” I urged Skink. We were almost at the entrance to the library building, and I was concerned that the crowd of weave creatures we had left behind would reemerge at any time, or that some gigantic creature would come slithering out of the rotten core of the world to pay us greetings.\n “The pit . . . ” she said, confirming my worst fears.\n “What about it? The library’s just there . . . ”\n But Skink was already limping across the narrow gantry out to where it ended above the center of the pit.\n Exasperated, I followed after her, terrified of missing a step and falling. I supposed that was one way of discovering what lay at the bottom. This close, the pit seemed like a giant maw with shards of weave like teeth pointing inward. I remembered the stories Da used to tell the tribe, of the great Dragon that had created the mist that swallowed the world. Such a tale seemed entirely more plausible, looking down into the endless pit from directly above it.\n “Why are we doing this?” I asked.\n “Just curious.”\n “About this hole? Biggest latrine in the world.”\n She didn’t even smile at my attempt at humor. “No. It’s important. The weavers told us. And I sense it.”\n I waved at the council of giant faces looming over the pit. “This all that’s left of the patternmakers? Restless ruins? Weavers spouting gibberish? There’s no special knowledge or wisdom here.”\n “You can’t see.” Skink spoke matter-of-factly. Not even thinking her words might hurt me. She leaned forward out of Creeper’s chest to get a better view of the pit. “Makers moved on. Became . . . more complicated. More interesting.” This last murmured almost to herself.\n “Can we go to the library now?” I was frustrated and a little saddened by the disparity between our views. “Find the answers we came for?”\n Skink didn’t move. Only her dark hair stirred, its long strands lifted by the warm breeze issuing from the pit’s unseen depths. What fascination did the abyss hold for her? Only confusion and anxiety gripped me. What could she sense with her strange talents that I could not?\n I swallowed hard, struck by a sudden wave of vertigo. The blue sky above combined with our exposed position upon that far too delicate arm. “Please. Let’s get away from here.”\n Reluctantly, Skink allowed herself to be drawn away from the pit. “There’s something down there,” she repeated, staring over her shoulder. “Something powerful.”\n “Please don’t wake it,” I said.\n Creeper was too large to fit into the opening at the bottom of the library tower.\n I watched, fascinated, as the weaver shed more and more of its body. Skink’s unification with Creeper was complete; the weaver no longer existed as a separate entity. Skink balanced upon stilt-like withy legs that to all intents and purposes had become extensions of her own, only straight and strong and unnaturally thin. Weave encased her entire lower body, threading over her arms and shoulders, even lacing through her hair. The great mass of the weaver, itself mostly scavenged from Meghra’s disintegrated body, had either been discarded or become so dense and compact it now fitted within the confines of Skink’s hybrid form.\n “What did you do to Creeper?” I asked, disturbed by her new tall shape, by her unfathomable and growing affinity with the weave. Was this how Meghra had started? Or the Motherman himself? I reminded myself it was not Skink’s form but her mind, her heart, that mattered. But the truth was, I was increasingly worried some profound change had overcome her. Something increasingly driving us apart. As if we had become members of different species. Grown distinct by time and circumstance.\n She gave me a questioning look. “Creeper was never a separate thing, Percher. It was always just a part of me.”\n Her revelation left me momentarily speechless. I remembered the little skittering weaver, hardly the size of Skink’s hand when she had first fished it out of the weave. It had taken me a while to grow comfortable with the creature, but I had begun to consider it a friend. And yet Skink was now telling me it had only ever existed as a puppet she had animated? The idea upset me in ways I couldn’t put into words.\n “You can . . . you can split yourself like that?”\n She shrugged. “It’s no big effort.” She bent over so that she could enter the library. I followed, the entrance ceiling unreachable, even if I stretched my arms above me and stood on tiptoes.\n As we spiraled higher and higher, narrow slit windows afforded us increasingly dramatic glimpses of the city below.\n “Sure this is the library?” I asked.\n “Yes. Saw it.” Skink stopped and half-twisted back to look at me. “You’ll help me, Percher? Read the books? Won’t be able to do it without you.”\n “Of course.” Had she been fretting all this time that I wouldn’t?\n We emerged out of the winding passageway into the center of the disc at the top of the building’s spindly supporting stalk. It was an environment utterly alien to me. A floor flat and solid, as if made from pounded earth. Faceted crystal glass windows set all around the outside of the circular room gave an astonishing view over the city’s dark artifacts; segmented, distorted, multicolored, magnified and bent, crazed and in some cases inverted. It reminded me of the view from the Motherman’s eyes, and at times I had to check that different panes looked out onto the same city and not some other place or time.\n And, of course, apart from the dazzling windows were the books. Thousands of books. Tens of thousands of books. Nestled in ordered rows upon freestanding shelves arrayed around the circular floor’s perimeter, the shelves aligned so that their lengths pointed toward the passageway emerging from the center. Holding huge tomes bound in hide and gold leaf piping. Tiny pamphlets that crumbled when glanced at. Thick volumes wider than they were tall. And everything in between. Some had been spilled upon the dusty floor, their yellowed pages fanned and their embossed spines broken, but the vast majority untouched in their dusty homes. So many books.\n “Remember when Da used to read to us?”\n I jumped at the sound of Skink’s voice, at the words that might have been plucked from my own mind. She stood beside one of the shelves, her fingers rested upon a random volume. “Yes, of course.”\n On most evenings, Da used to gather the tribe and read to us from the books in the library he (or more often I, toward the end) carried in a huge sack upon his back. Tales of the old world, of a time before the mist spilled out from the mouth of the Dragon and covered all the land.\n White whales. Goblins under mountains. Shadows chased across the thousand island sea. I smiled in fond remembrance. “Such stories.”\n The library had been my privilege and my burden to bear after Da died, but I had never tried to revive his habit of reading to the tribe. Fear of usurping his memory perhaps, or fear of my reading ability and the weakness of my own voice compared to his. Many of the words he used, and the settings and characters he read about, were baffling to us who had only ever known life in the weave. Even so, we had listened, captivated by his rolling tone, by the sounds of the unfamiliar words—like clock, and sword, and car, and gun—and tried to imagine a time when we had been more than scurrying vermin within a giant weave relic. Reminders of a world that once belonged to us and not to the lethal mist far below. That we had once been its masters.\n Such dreams.\n Da would close a book and there would always be a collective groan. “More!” we would complain. “Don’t stop there.” But he would promise more tomorrow, and we would settle down in our overnight nests and drift off to sleep, curled up high in the Motherman, way above the mist that seemed to twist and form shapes as if it dreamed dreams of its own.\n And now here we stood, as if we were characters in one of those stories ourselves, adventurers escaped from the burning husk of the Motherman, in this ancient city with its hidden mysteries and reanimated residents, in a real library the likes of which Da would have been ecstatic to explore.\n Desks, with maps spread across their length. Telescopes, globes, other intricate instruments of unknown origin and utility.\n With the sun lighting up the library’s windows like one vast multifaceted, multicolored lantern, I found the place utterly beautiful, utterly enchanting. If we found no other wonder in the city, this, for me, would be enough.\n I carefully picked up the nearest book. It was heavier than I expected. I blew dust off the tooled leather cover and opened it to a random page. Flicked it to another, then another. Picked a different book. Walked to another shelf, looked there. Then one farther away, my earlier joy reduced to a form of panic.\n Every page in every book I turned to. Full of unfamiliar characters and symbols, indecipherable words and alien lettering.\n All utterly unreadable.\n I closed the cover on yet another dusty tome and slid it back into place in its shelf. “I don’t understand it. How could Meghra have learned to control the weave here?”\n “Not in library, Percher. Not from books.” Skink was leafing through a large illustrated book on anatomy, her expression as pensive as one of the gargantuan faces gathered around the pit below. I glimpsed detailed diagrams of birds and feathers and autopsied wings.\n “You said you saw it. In Meghra’s mind. The city and the library. It’s why we came. It’s why I came.” I tried to keep the accusation from my voice, and failed utterly. Had she just mentioned the library so that I would come with her? Didn’t she know I would have followed her no matter what?\n She looked up from a full-page drawing of a bat and frowned at me. “Did see the city. Did see the library. But how can I be sure what she learned where?” She waved her weave-laced hand in frustration. “Perhaps she tricked me. Even at the end.”\n I shuddered at the memory of Meghra’s death. Crushed by her own weave. Crushed on Skink’s command. Doesn’t it worry you? That I’m a killer?\n Skink closed the bird book and straightened to her full new height. “Perhaps there’s somewhere else. Here in the city. Where she learned.”\n For a moment I struggled to think of any other place. Then I realized where Skink meant. “The pit.”\n “Yes.”\n I was dismissive. “How could she learn anything there?”\n “Don’t know. Want to take a closer look.”\n “It’s a hole . . . ” I sighed, seeing there was no point arguing. “Don’t trust this city, Skink. Not at all.”\n “There’s something waiting for me. It knows I’m here.”\n She walked on her weave-reinforced feet toward the exit. I hesitated. Like the pit to Skink, the books called to me. Surely there was something here we had missed, some readable section hidden in a dusty corner. We had only sampled a tiny fraction of the volumes in a tiny fraction of the shelves. But Skink was already away, her face set; she didn’t even glance back at me. It didn’t matter to her this time whether I followed or not.\n I had to jog down the passageway to catch and keep up with her.\n At the bottom of the library tower, by the gantry leading over the pit, they were already waiting for her. The weavers stacked together to form two composite but distinct entities. Only this time they were well defined. Dark replicas of people all too familiar to us.\n My sky-lost, pattern-rotted brother Broc, was one.\n Hunched over, half-dead, half-blind witch Meghra the other.\n “Stay away,” I warned.\n Skink laid a hand on my shoulder. “Percher.”\n “No!” I felt a fear unlike any since I first saw Meghra rising from her cave. Crawling over the ridge to peel our skulls off. Not fear for myself, you understand, but for Skink. I didn’t want to lose her. Not to the weave. Not to whatever lay in the pit. Not to those creepy, amalgam creatures.\n Not to anything.\n “Percher. I know what I’m doing.”\n “No you don’t. Not here.” The giant faces around the pit edge seemed to blur and twist through the hot air rising, become even more grotesque and menacing. The city was purely hostile, I was increasingly certain of it. “Look at them: brother and witch. Something here must know our minds and our memories.”\n “Percher, please. Can look after myself.”\n That had certainly been true so far. But something about the pit terrified me. Why was Skink so dismissive of the danger? Here was deliberate, sophisticated control of the weave like nothing we had encountered before.\n “Let me go,” Skink said. “You can stay here.”\n Slowly, against all my instincts, I stood back as Skink approached the Not-Broc and the Not-Meghra. The pair bowed to her, and indicated the gantry arching over the pit. They spoke in unison.\n “Find the answers you seek.”\n “You don’t know the questions.” Skink’s tone was a mixture of defiance and amusement.\n They bowed again, mockeries of the people they were meant to resemble. “Nevertheless.”\n The three of them walked out over the pit. I hesitated at the edge of the gantry, heart thumping in my throat, legs suddenly weak. Last time I had been beside Skink, but now she was already far out at the arm’s end. I would have to cross the thin bridge alone.\n My legs refused to budge.\n “If you truly want to understand and control the weave,” the Not-Meghra creature was saying, “you must first understand the mist.”\n “It kills everything it touches,” I shouted from the edge, still unable to step onto the gantry. Images of Da, half-dissolved, rose unbidden in my mind.\n “It’s far more complicated than that.” The Not-Meghra leaned over the pit. “More interesting.”\n “Each speck of mist is a tiny withy,” Not-Broc said, vastly more erudite in his new incarnation than he had ever been in life. “The makers’ ultimate building blocks.”\n The weaver creatures now stood on either side of Skink.\n “Listen to the Dragon,” they said. “Can’t you hear?”\n Skink closed her eyes.\n “Skink, no!”\n The withies beneath my feet seemed to tremble. The faces around us swayed. Warm air rose from deep within the pit, and something behind the weave lining of its throat seemed to glow, like the embers of a fire, only blue not red.\n That subterranean light, getting brighter. Pulsing around the insides of the pit, swirling ’round and ’round, faster. The warm, fetid breeze rising in a torrent now, so much it lifted Skink’s withy-tangled mop of hair in a single agitated mass. Just as when she had been in the witch Meghra’s grasp, her arms spread wide and her eyes rolled back into her head.\n The weave was trying to take her again.\n “Skink!”\n Eyes closed, face rapt, arms spread, the two weaver attendants crouched as if in fear beside her, I heard her quite clearly say:\n “Make the pain stop.”\n A wish, not a complaint.\n The breath caught in the back of my throat.\n Something rose from within the pit. A dancing, swaying, searching tentacle. A hazy, thin-tipped tongue. I realized then what must lie in the bottomless depths. The same thing that surrounded the plateau. That we had escaped falling into so many weeks ago.\n Da’s tales of the Dragon were true. Here we stood, atop its very throat. The whole woven plateau its vast body.\n And the mist was rising from deep within the pit. The flesh-eating mist that had destroyed the world.\n I rushed forward—but the withies peeled upward and formed an impassable barrier between myself and the gantry upon which Skink stood.\n Too late I realized just how much we had underestimated the danger.\n “Skink!”\n “Percher!”\n She could no longer be seen. Blue-pink tendrils of mist like tongues of flame had overrun the gantry. “Run!” she shouted. “Climb!”\n Mist boiled up out of the Dragon’s mouth, spilling over the edge and rolling out into the city.\n “Skink!”\n I waited as long as I could, dodging the individual, slow-moving patches, trying to see if Skink had escaped the gantry, but it was impossible. The mist’s acid touch destroyed every living thing in its path. The pit, the gantry, and everything above it was covered in mist, and the surrounding streets would soon be flooded too.\n She was gone.\n I ran, retreating back into the library. If there were doors I would have slammed them behind me. But there were none.\n Ma shouting: “Climb! Climb fast! Keep climbing!”\n That one time, that last time, I had seen the mist up close, when we had descended to try to forage in the lower reaches of the Motherman’s belly, to scrounge what we could, and to find shelter from the more chilly climes above. Some rare internal convulsion drove the mist high up the body of the Motherman that day. Ma and Da had grabbed everyone and everything and warned us all to climb immediately, to climb fast, to keep climbing. My brother Broc, as usual, scoffed and chided everyone else for cowardliness, but at the same time he climbed as fast as the rest of us, occasionally glancing down with a mixture of morbid curiosity and fear.\n Skink had clung to my back as I climbed with the others, that time before she had revealed her athletic abilities, and all was well, all was as expected, until I heard her say, “Where’s Da?” and I paused, because she was right. I had not seen him climbing with us.\n “The library,” Ma said, pausing beside us, barely hidden terror in her voice.\n The sack with the books was heavy—oh how I knew!—but that day Da insisted he would carry it, and instead Skink clung to my back in a rough harness.\n I didn’t wait to unburden myself, but descended with Skink still upon me, watching for signs of the mist rising through the Motherman’s porous weave, down to the huge curved plate of his pelvis, the lowest we had ever been. To my horror, there were obvious tendrils of mist probing through the Motherman’s organs, well-defined tubes of blue-pink smoke questing along the twisted withies.\n “Percher.” Skink, in my ear. “Mist rising. Mist hungry!”\n “I see it.”\n Every instinct screamed for me to retreat, to climb away, to reach safety.\n Instead, I went lower.\n Soon found Da.\n He had almost made it. Really, the mist had only just caught his legs. But it was enough. He must have slipped, injured, and then fallen back farther into its eroding grasp.\n Bones, like withies, seemed immune to the worst effects of the mist. Though even those were hollowed out and pitted, and when, later that night, we tearfully bundled them up and cast them down as a final offering to the cruel gods, there hardly seemed anything left of them at all.\n His last act had been to save the books. Those cursed, blessed books. Lifted them with his strong arms, lodged them in a tangle of withies to be found. His last gift to me. A gift I had lost. Save his books or save Skink, that had been the choice.\n Now here I was, slumped amongst the dust and the moldering, useless books of the patternmakers’ library, and it was Skink who was lost. I gazed out of the crystal windows, down into the throat of the pit. There was no sign of her. She had been right in the midst of the pit as the mist overwhelmed it and the streets of the city.\n The mist had claimed her, and probably soon it would claim me too.\n One of the library windows was shattered. The wind blew through it, turning the pages of books fallen nearby. I teetered upon the window’s ledge and gazed down on the mist, just as I had used to do in gaps in the Motherman’s chest so long ago, true to my name once more.\n The sun was dipping. Shadows of giants writhed across the carpet of mist where the pit once gaped. I watched it curling around buildings, changing texture from smooth to saw-toothed, to crystalline, to molten. Changing pattern all the time, pulsing, designs arising and fading, competing with and in conversation with each other.\n At least it was not rising.\n Safe for the moment, I drew back into the library.\n What had Skink thought she was doing? What had she unleashed? Why?\n And now she was gone.\n I raged at her. And I wept. I curled up in despair and tried to sleep. I would awake and it would all be a nightmare, fading away. But I could not sleep. Some sort of strange waking dream seized me.\n Surely it was not just Skink who had the power to control the weave? I had stood beside her in the Motherman’s brain when she had impelled him to move. Why couldn’t I do the same? With such power I would tear down the whole rotten city. Close the Dragon’s mouth forever.\n Skink had said she couldn’t learn how to control the weave from the books in the library, but maybe she was wrong. It wasn’t the way she or Meghra had learned—but maybe it was the way I could.\n There was power in the library. In its pages. Waiting to be found. Maybe she had been able to sense the weave, but I could sense the books, even the unreadable ones. The knowledge they contained was waiting to be freed; it just needed to be unlocked. Somehow.\n Da had told me once of someone who had learned to swim, having never been in water before, just by reading how to do it in a book. Poring over the instructions, the descriptions, the diagrams. How there had been special types of books—manuals, he had called them—that contained no stories, only instructions on how to achieve this, that, or the other. All I needed to do was find a manual on how to read the unfamiliar writing. To control the weave. To master the mist. Somewhere there had to be one. The answer could be on the next shelf, in the next tome, the next page.\n I stood alone in the library, laughing. For a moment, at least, I could imagine myself a maker; an architect of the world around me. Even that faint echo of glory, intoxicating. Is that what Skink had felt when she made the Motherman walk, when she defeated Meghra? That feeling of control?\n I would start small.\n Fishing out from under my shirt the pendant Skink had made, I dangled it before me, glittering like a dark jewel in the fading sunlight. I concentrated on it, through the tears its memory brought to my eyes. I commanded it to leap into life, to grow, to take on giant dimensions.\n But no matter how hard I tried, how much I raged at the desiccated little creature, I could not make it move. Not a quiver. Not even one insect-leg twitch.\n Whatever magic skill was required to interact with the weave, whatever inner flame burned within Skink . . . it appeared I lacked it utterly.\n Useless.\n I tore the pendant from my neck and faced the open window again.\n Books I had here, yes. Perhaps I could even learn to read their alien script. In time. But I had no time. No food here. No water. No Skink. No will.\n I climbed out the window, first my head, my arms, my shoulders. Balanced on its ledge. The red sun burning on the western horizon warming my face. I closed my eyes, wavered. Best not to look.\n How long would it take me to fall? Would I be dissolved, like Skink and Da and Ma and Broc, all taken, one way or another, by the mist?\n I could just stay there, right at the very edge, let gravity make its judgment. The decision would not even be mine, really.\n A strong downdraft buffeted me. Seized by a wave of vertigo and fear I tried to draw back.\n But it was too late. My feet lost traction, slipped. I wheeled my arms, tried to fall back into the library rather than forward into the mist-smothered pit, but even this movement unbalanced me.\n The ledge beneath my feet cracked and sagged.\n I began to slip.\n A beating of wings above.\n I looked up as I slid down.\n A huge shadow over me.\n A hand extended toward mine. Even as I teetered on the collapsing sill, my gaze followed the curve of the arm, the hugely muscled shoulders and chest, the long neck. To the face. Surrounded by its unruly fall of dark hair.\n “Grab hold,” Skink said. “I’ll pull you up.”\n She squeezed in through the broken window, careless of the remaining shards of glass. As she did so her vast wings folded and refolded in on themselves, continually halving in size, and at the same time becoming more diffuse. Soon they were gone entirely, drifted away like ash, like a dream.\n “You can fly.”\n “Can do many things now, Percher.”\n She squatted beside me on the library floor. She looked exhausted and pained, much more so than I had ever seen, not even after Meghra almost defeated her. Despite its intricate new casing of weave she still rubbed her twisted leg.\n “Thought I lost you. Thought . . . you chose the mist.”\n She gave a bitter laugh. “People tried to throw me into the mist before, Percher. I’m not going to do it to myself.”\n “I thought the pain . . . ” My voice caught. I couldn’t finish the sentence. I thought the pain—the promise of relief from it, that it would finally stop, made her decide to go. Become one with the mist, or with the Dragon, or whatever temptation had drawn her. And if it had stopped, how selfish of me to try and deny her that chance. Of begrudging her decision.\n Tears glistened in her eyes. “Hate the pain. On another day . . . choice could have been different. But not today. Not ready to give myself to the mist today.” She looked down. “Would drown.”\n I didn’t mention my relief, then. My own selfish joy. Probably it was all too obvious, anyway.\n “You saved me,” she said, surprising me again.\n “How?”\n She shrugged. I could see her eyes were brimming with tears. “Just being here. Your memory.”\n “No. It’s you who saved me. Just now.”\n She punched me on the shoulder. “Not a competition, Percher! It’s what we do. Save each other. We’re good at it.”\n A strange warm, tight feeling in my chest. Tears threatened my own eyes. “Yes. We are.”\n “Here. You lost something.” She held out the pendant I had torn from my neck and dropped on the floor. Its snapped withy miraculously whole again.\n I slipped the little scritcher back over my head. Felt its familiar claws gently tugging at my skin. “Thank you.”\n “Come. Watch this.” Skink stood and grabbed my hand, pulled me toward the window ledge again.\n I grasped her warm fingers as we stared out over the sea of mist lit blood red by the sunset.\n “The city is a memory,” she said. “A bad memory.” She held out her free hand, palm raised, fingers outstretched. “It needs to forget.”\n The ground beneath the library began to shake. The giant faces around the mist-filled hole trembled and cracked. The dust of centuries rose as they tilted toward the pit.\n “What are you doing?” I asked, alarmed.\n Skink squeezed my fingers, but her expression remained calm.\n Serene, even.\n Rank after rank of buildings rocked forward at her command. Leaning over, stretching out, seeming almost to liquefy as their constituent withies untangled from each other. Like saplings eager for sunlight, or roots hungry for water, the released withies reached out from every side of the pit, arching, questing; creating new bridges and connections. Forming a solid lid that covered the Dragon’s mouth and trapped the mist beneath.\n “Don’t you agree, Percher?” Skink’s voice was full of quiet determination as the city fell around us. “Time we made a pattern of our own.”\n Henry Szabranski was born in Birmingham, UK, and studied Astronomy & Astrophysics at Newcastle upon Tyne University, graduating with a degree in Theoretical Physics. His fiction has appeared in Clarkesworld, Beneath Ceaseless Skies, Diabolical Plots, Kaleidotrope, and Fantasy For Good: A Charitable Anthology, amongst other places. He lives in Buckinghamshire with his wife and two young sons."}