{"fingerprint": "iRusfgy2RbSqjShLaVWJQ21sh4E=", "sitename": "Clarkesworld Magazine", "title": "Some Remarks on the Reproductive Strategy of the Common Octopus by Bogi Takács", "author": "Bogi Takács", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/takacs_04_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Some Remarks on the Reproductive Strategy of the Common Octopus by Bogi Takács", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3340 words, short story\n Some Remarks on the Reproductive Strategy of the Common Octopus\n So let’s do it this way. I’ll show you whatever I want and you’ll believe me, because I’m an octopus. I might as well get some benefit out of it, not that we ever had much—especially not since you left. Humans, huh?\n Humans.\n I slide over the eerily warm surface, watch the tiny but constant stream of bubbles. Run tentacles gently over the crack where the bubbles emerge, adjust my bulk, gently pry.\n Scrape swims next to me, caresses the warm object. It’s a giant, bright oblong, textured like nothing else. Scrape trembles with the novelty of it. “I wouldn’t pry,” Scrape signals to me, his skin changing patterns with a fluttery nervousness.\n “The field strengthens here,” I say, “this object seems like the focus.”\n “What is the field?” Scrape asks, and I push myself away from the oblong, feeling suddenly tired. I signal back, “What indeed.”\n You’re a human, you should know. You inflicted the field upon us, without permission, without explanation. Of course you can say, “Why should we have asked? You were an octopus.”\n What I am right now is anyone’s guess.\n “Please,” Scrape says, “this is a bad idea.”\n I swim up to the oblong. “There is someone in there. I can feel the field thickening. There has to be someone in there—a living, breathing mind.”\n “That’s exactly why this is a bad idea.” Scrape tries to pull my tentacles away from the surface, but I resist. Flesh against flesh. The patterns on our skin flare.\n We struggle. “What do you think is going to happen when you open it?” Scrape yells. “Who do you think is inside?”\n That’s what I want to find out. I push him away from me.\n “You know what this is?” He quietens down so that I have to swim closer to understand his fleeting, minute signals. “It’s a container where humans put their dead.”\n I only saw a dead human much later, but Scrape was right. This was a singularly bad idea.\n We didn’t ask the right question. The right question was, “If we open this container, what will happen to the field?”\n I decide not to force Scrape. We are crafty, not brutish. I swim away, thoughts tossing and turning in me, and beyond me, in the field. Inside me, I try to gently pat out the border where the self ends and the field begins, as I’ve tried many times before, but it is an exercise in frustration. I can locate points of less self—more field, more self—less field, but it is a smooth transition.\n It is also an existential nightmare.\n I am going to meet Pebblesmooth. Pebblesmooth, who doesn’t have all the answers, but who has the best questions. Once I am there, I will ask, “Pebblesmooth, can a dead human affect the field?”\n Of course you know the answer. This is not about you. Not everything is about you.\n “Daughter. Have you touched the field?” Pebblesmooth asks me, twining her tentacles together.\n “Yes, many times,” I respond, all too fast, all too snappy. I am impatient.\n “Whose field have you touched?”\n I am flustered. Confused. Then much becomes clear.\n I rush back to the oblong in a daze, then reach outside my mind, try to get a hold on the field. Gently reach further outward, in the direction of the densing, the intensification. But I do not feel another presence, just this pure thickening. I push my mind outward with an effort, bulging out of myself. In the direction of the object, there is more self, but also more field—a paradox, a knot I do not know how to disentangle for all I am good at this type of task. I feel more of myself, more awareness, but also more field-memory; more of everything. The world becomes brighter, more focused, more fluid.\n I do not draw back, because I do not bump against another awareness, like I would draw back from another’s mind. We only share field-memory, not self-awareness.\n Scrape comes up to me. Has he been guarding the object? Has he been guarding it from me?\n “I also tried to push while you were away,” Scrape says. “There is no one inside. Just the field becoming stronger.”\n “Do you think this is,” I try to think of words, concepts, “a field generator of sorts? Like a wave generator, except with the field? Some kind of . . . technical device?”\n Scrape scrunches up in thought. “But then it might not be a huge issue if we open it.”\n I am stunned by the direct reversal of his position. I feel tempted to reverse mine, just so that we could be even. “What if we open it and it breaks, what if this destroys the field?”\n “There are other spots where the field thickens,” Scrape says. “Just on the seafloor in the shallows. There is nothing there.”\n I consider. “Yes, but has anyone tried to dig?”\n You came and you left. But in many, many senses, you will never leave. Even if you yourself get back in your spacecraft and go away this very instant, your echoes will never cease.\n It takes much hard work and ingenuity, but we choose a spot where the ground is softer, and eventually we triumph—if this can be called a triumph. Is all discovery positive, does discovery have value in itself, I wonder as Scrape shudders, points at the now-familiar alien surface peeking out from underground. I get closer. Now we know.\n “Great idea,” Pebblesmooth says and patterns in approval. “It would be reasonable to claim that these objects produce the field.”\n “Don’t we produce it ourselves?” someone from the crowd asks, and certainly we do, but in much more minute amounts. There seems to be agreement about this.\n “If you consider,” Pebblesmooth says, “our personal fields would not be large enough to reach across the spaces between us. How big is your extent, when you try to reach out, what do you feel? But the wider field undergirds us, and allows us to store memory.” She seems glowing, radiant. Did she try to reach inside the oblong, too? I was too absorbed in my thoughts to notice.\n “Without the field,” I consider, “our knowledge would be lost from generation to generation. Our lifespan is short.”\n Pebblesmooth looks around. She has assumed our leadership position, not just by virtue of her age and experience, but also because of her knowledge and poise. “But have you ever tried to reach back?” she asks. “Back toward the beginning?”\n Most of us haven’t. Some of us have, and those who did now point out the trail of memories in the field. We reach, grasp. Pull ourselves down into the depths of time. Before the Scrubbing of the Sea and the age of the heroes.\n Before the emergence, there is murk. And before the murk, nothing. Emergence is gradual, but we collect knowledge; of the world around us, of the humans who occasionally intrude into it. We understand sea, and land, and map these as far as we can reach. We define coast. We circumnavigate life itself. We teach our youngsters to reach into the field for knowledge, for development. We grow up faster and faster, if not in body, then in mind, as much as these can be distinguished; we make the most of our life spans.\n “There was nothing before the murk,” I say into the utter stillness.\n “Is that where you would like to go back?” Pebblesmooth asks gently.\n I am shaking, but I must continue. I speak. “If we investigate just one of these oblongs, just one, we will probably not destroy the field altogether—but we might understand our origins.”\n The water churns with the agitation of many bodies. Some people are for my position, some against.\n “I have seen one of these upland!” Scrape yells. “In Cloud-Covered Bay! It is where humans put their dead!”\n We scour field-memory, and our attention gathers more and more of us nearby, until there are dozens and dozens of minds acting in distributed concert.\n Very ancient memory, a ceremony, simple wooden-box placed on sailboat and pushed on-water. We investigate, clamber on-board. Pry open the box, see the dead human-body, pasty-pale, smooth. The sailboat ignites and we perish in flame.\n “Death-memories are some of the strongest,” Pebblesmooth mutters, “it makes sense for the earlier memories to be more tumultuous.”\n “This is not the same object,” I remark. “That one was just a box made of wood.”\n We search further.\n Clasp-clang, the earth of the bay trembling. One of us sneaking ahead in the wet ground. Human agitation. Someone slipping into a dark oblong, then launching into the sea.\n “This is a submarine,” Scrape says. “And not the same brightness of surface.”\n We find more submarine-memories before the humans vanish. Some are smaller, some are larger. Many are human-size, in various surface brightnesses, but the same texture as far as we can tell.\n “Those humans in there are alive,” I say. But when we browse through the memories, we can’t find any time when one of us sensed their minds.\n Yes, there were times we did not think you were real. In our defense—if we need a defense at all—you hadn’t exactly made yourselves real in our eyes. At that point, you hadn’t earned our judgment of sentience.\n “If there is a human inside,” I begin, “and we open it in-water, the human might die,” I say. “They lived upland.”\n “Do humans have life spans this long?” Scrape asks. “Can a human still be alive in there, after so many generations?” No one knows.\n “Still, her question was fair,” Pebblesmooth says. “We might want to open the object in the bay.”\n There is some discussion. We eventually agree that if we float the object to the shallows, we might be able to open it to the air while keeping ourselves in the safe wetness. We choose the other oblong for this task, the one we found first, so that we don’t have to dig further. I notice that below it there is some disruption in the ground—it must have come loose somehow.\n We drag, we push. It is hard going.\n We get to the bay shallows, and we pop open the oblong in a very short time.\n Inside there is pulsating jelly, and inside the pulsating jelly, a sleeping human. Pale and smooth. Alive. Asleep?\n We pull the human out and it keens.\n Would you have prioritized human life? Knowing what we knew back then? Knowing what we know now?\n The field shudders, but the shudder is localized. It bunches, twists. The human is in pain. We don’t know what to do with it. We withdraw into safe distance.\n The keening subsides. The human sits up, shuddering.\n “They don’t know how to pattern,” I say. “How will we communicate?”\n “They made all these complicated oblongs,” Scrape replies. “They must have a way.”\n Yes, we know all about reproductive strategies now. Humans, like many mammals, use a strategy known as K-selection: few offspring, longer lifespan, a longer period of parental care. We, or as you would call us, Octopus vulgaris, use r-selection: many offspring, shorter lifespan, shorter parental care. At least that was how you explained it, though we kept on thinking you were mistaken. The distinction is not as sharp as it sounds: strategies form a continuum, like much else. Like minds.\n And some of you, somewhere along the timeline before the murk, must have thought our strategy was wrong. For what else could explain your behavior?\n The human shudders constantly and produces multiple kinds of fluid. Finally it looks around. Notices us.\n The human pulls its head up sharply and produces a strange behavior. We try to speak to it, but it doesn’t understand our patterning, even when we speak in unison. We try to project our thoughts. Nothing happens.\n It makes limb gestures. Tries to get us to repeat our patterning, we assume. Pulls a pouch out of the oblong, opens it, and pulls out some kind of large, foldout board. It stands up the board and begins to make lines on it with a small stick.\n Time passes. It is now harder to think of the human as an “it.” We suspected humans were not animals like fish, for fish do not build complicated devices, but we could not be quite sure. Some land-animals build nests, castles.\n The human goes upland to eat, but sleeps in the oblong. We do not know what the human eats and we do not ask.\n The human is not very good at understanding our language, but it can make pictures, and we are good at understanding pictures; probably better than the human.\n Many of our people drift away, but Pebblesmooth, Scrape, and I remain, and our memories are there for all to see in the field. We name the human Seaweed, after its hair that it had cut into stripes shortly after first going upland.\n We tell the human that the other humans had left, a long time ago. They simply vanished—we don’t know what happened to them. The human explains that they were seeking to move to another world—not another planet, but another world. This is very hard to draw, and we still don’t sense the human’s thoughts, nor does the human sense ours. Our intent must be at cross-purposes, our minds orthogonal to each other. We only sense a thickening of the field.\n The human explains it can produce a lot of field. Not all humans can. Most of them produce as much as us. Some humans who could produce a lot of field were left here, until we could figure this out and maintain our field ourselves.\n We ask how we lived before the field. Seaweed says octopuses were supposed to be very intelligent. But yet humans could not communicate with us. They needed our help for the Scrubbing of the Sea. The humans came from another planet, which they had dirtied, and then they dirtied this one too. We also came from another planet—this was startling to contemplate. The humans brought us along because they thought we could help them clean the sea. If only they could give us instructions.\n “I thought our ancestors came up with the Scrubbing on their own,” Scrape yells at the human.\n “They were guided,” the human draws, then makes a shape for remorse.\n You think we learned from Seaweed—but Seaweed also learned from us. At least after we figured out that she had been left behind by you, used by you just as you had used us. For what ends beside dominion?\n “You took it from us,” Scrape screams. “You took away the age of the heroes. And you took away what came before!”\n I shake with anger, but also with fear.\n “They took my life from me and left me here alive in a coffin for the sake of the Obligation,” Seaweed draws, then erases the whole thing, and just draws the sign for remorse. Then Seaweed kicks the board and it collapses, folding back onto itself.\n We leave the human alone for a while after that.\n “I feel sorry for Seaweed,” Pebblesmooth says and I seethe—with her authority, making statements like that?\n “They destroyed our entire way of life so that we could help them restore what they ruined,” Scrape says, and I’m glad that he’s for the moment on my side.\n Then suddenly a bright, dangerous thought occurs to me. “This human is good at producing the field. We can surely use that for something.”\n Pebblesmooth stands in front of me. “We were made into an instrument, and this human must have been at least complicit in that, but it was also made into an instrument in turn,” she says, and I notice she is not using Seaweed’s name.\n She doesn’t need to ask me if it is good to make instruments out of sentient beings. I move away from her, ashamed.\n Pebblesmooth follows me. “Listen, daughter,” she says. “We can work together, without using each other.”\n But with a human?\n You know all about the Obligation, do you? You used it on each other, to justify all manner of heinous crimes, well before you decided to uplift us, as you would say.\n Uplifting implies up is better. But we have always lived underwater, in the sea.\n “You were supposed to figure out how to produce a very strong field eventually on your own,” Seaweed draws. She is better and better at getting complex concepts across, and we develop a dictionary of increasingly abstract shapes and marks. “You have individual variation in this, much like humans do. Then you can rely on those of you who can make a stronger field.”\n “But were you supposed to live that long?” I ask cautiously. Is there a secret here? Sometimes Seaweed doesn’t answer our questions, sometimes she grows upset and begins to bang on things.\n This time she replies.\n “We live very long, and my lifespan has also been artificially lengthened,” she says. “I will live for very long still, provided I sleep in the pod each night.”\n I look at Pebblesmooth, and she knows what I know—that Seaweed just gave us a key to her life.\n I ask. I must understand. “Seaweed, did you really mean to tell us that?”\n She nods with her head, and by this time we well know that this means yes. But she also looks away, and makes a face-shape that we have learned to associate with displeasure and sadness.\n Yes, it was easier to make us form a groupmind to enable us to pass our memories along to the next generation, rather than to change our reproductive strategy. Am I supposed to feel good about that?\n I don’t know what was before the murk. I only know that our minds worked differently, and Seaweed and the others told us that we were considered very intelligent. Very intelligent, but animals. I think you humans just hadn’t figured out how to communicate with us, and you had to remake us in your nature. You could not see any other way.\n Seaweed tells me she can sense other humans’ thoughts, but in us she can only sense that there is something there—a parallel to the thickening we feel.\n If Seaweed dies, will her memories be lost? I talk to her incessantly. And yes, I sometimes feel I am using her, as my only link to the humans that had gone by—and through them, to my own past. And I like being around her—the strong field around her makes me feel better, makes my thoughts move faster.\n Sometimes I feel that she is using me, to drag herself out of the loneliness of being abandoned by her own kind. Sometimes I feel that she still thinks of me as an animal, even though she tries to suppress the reaction drilled into her by the same people who shut her into the pod, wired her up to act as little more than a beacon.\n Sometimes, through her, I see myself as an animal.\n But sometimes we just talk, and sometimes we go swimming in the sea, and make jokes about the fish.\n And sometimes we make plans about how we will open the pods and change the course of history.\n Before Seaweed and the other humans passed on, they taught us about the Old Empire, but until you came, we did not know that the Old Empire vanished everywhere simultaneously. Yes, when we see humans like you, even when we know you are the descendants of those left behind, we are resentful—even when your shape is a bit different, and your hair does not hang in stripes.\n You say you are different. We are supposed to believe. But now I’ve shown you Manyspike’s memories—you specifically, because I trusted you with this, I trusted you with my anger—and now I ask you, for there is nothing else I can do, to understand what lies behind our resentment.\n All I ask is for you to tread these waters with care.\n Bogi Takács is a Hungarian Jewish agender trans person (e/em/eir/emself or they pronouns) and a resident alien in the US. E is a winner of the Lambda award for editing Transcendent 2: The Year's Best Transgender Speculative Fiction, and a finalist for the Hugo and Locus awards. Eir debut poetry collection Algorithmic Shapeshifting is out now from Aqueduct, and eir debut short story collection The Trans Space Octopus Congregation was published in Fall 2019 by Lethe Press. You can find Bogi on various social media as bogiperson."}