{"fingerprint": "wMaZbyNPPnMeemhLaD3oYVM0jMw=", "sitename": "Clarkesworld Magazine", "title": "A Universal Elegy by Tang Fei, translated by John Chu", "author": "Tang Fei; John Chu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tang_01_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Universal Elegy by Tang Fei, translated by John Chu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6890 words, short story\n A Universal Elegy\n I love you, stranger, but not because the world is hurting me.Before my love froze, it once flew.—The Elegy of Alia\n Alia Calendar 6th month, 87th year\n Brother, it’s not until my tongue stumbles over these two syllables that I realize how long it’s been since we last talked. Julian and I kept moving, kept living where even the heating system was a problem. A satellite communication system that could reach Mercury was beyond my wildest hopes. Sorry that I haven’t contacted you in so long.\n Actually, I could have run to a public communication kiosk. Sending you a written message would have cost only several sou, but Julian didn’t like it when I did that. He thought it was a waste of money. We both knew, though, that this was just one of the ways he punished me.\n Julian, my now former lover, had at some point suddenly become a nightmare. He tormented me, ridiculed me, in every way he could. He’s like all the others. His shifting gaze, the curl of his lips, the way his nose blushed, even the sound of his footsteps were filled with a meticulous indifference. He laughed at me, saying that I was mad. Gradually, I started to believe it. The world grew hazy. It lost its contours and weight. I sunk into thick, black, yet glistening agony. When I looked up at the stars, I saw a sky filled with flowing fire, dancing and spinning in a daze.\n I was always crying. Once, Julian said in front of me to his research institute colleagues that he wanted to conduct research in genetic ethology using me as a specimen. Of course, he was drunk when he said that. He was always drunk, just like I was always crying.\n I can say these things to you, not just because I’ve left the nightmare that was Julian—yes, we’ve broken up—but especially because you’re the only person in the universe who can understand me. We came from the same fertilized egg. We have the same DNA. Even though radiation from Cygnus A methylated some of your genes, you can still understand me, a sufferer of an inhibitory neuron blockage disorder.\n It’s done, brother. The all of the suffering is done. I’m fine now. I’ve never been finer. In six hours, I’m going to leave this planet together with Hull. He’s a good man. Although we’ve only known each other fifteen days, we already understand each other. How do I describe the merging of souls that happens between two strangers? Such a mysterious stirring of emotions. I can’t put it into words. It’s like how the sound waves from two different kinds of musical instruments resonate together harmoniously. Forgive me for such a clunky analogy, brother. All you need to know is that I’ve fallen in love with a stranger who happens to love me. More importantly, he completely understands me and accepts me.\n Six hours from now, fire will rush out of our rocket and we’ll travel to the other side of the universe, to Dieresis. That’s where he was born. Hull promised me that there I’ll get the respect that I deserved but never got on Earth. There, no one will think of me as being sick in the head. Like him, they’ll understand and respect me, even appreciate me.\n Brother, I love him. It’s absolutely not because the world keeps hurting me.\n Alia Calendar 6th month, 89th year\n Time flies by so fast. Sorry that I’ve gone so long without mailing you again. But, brother, in this vast universe, do people have to rely on such obsolete methods to reach out to each other? Hull told me that signals the brain sends travel farther than we think. During the countless years of a endless trek, a person’s train of thought will enter the mind of someone else on another planet. Isn’t that amazing?\n I want to tell you about Hull. Don’t worry, brother. I know my last letter made you think that I’ve committed yet another thoughtless mistake. Indeed, I have to admit that leaving Earth was definitely a somewhat hasty act. You know that’s why I sent you that last letter.\n Hull is a Dieresian. He’s 1.8 meters tall, 72 kilograms, black hair, brown eyes. He looks like a handsome Caucasian and speaks Earth languages really well. Our conversations are fluent and joyful. He’s more like my kind than any Earth person.\n His every subtle detail, no matter how difficult to check, is perfect. His pupils dilate at the just right times. His skin suffuses the air with a unique perfume. The rate his eyelashes quiver, the flaring of his nostrils, the unique path his fingertips glide over my skin steep me in the warm current of his love. I respond in the same detailed, satisfying way. We echo each other. The way we express our love is something that humans have never experienced and can never understand.\n Our love unfolded on an even more profound layer of spirituality. Cautious and reverent at first, it gradually transformed into something frenzied and wild until, finally, I realized that, all along, Hull had been guiding me, consciously training me. Through constant, ever deeper, ever more meticulous interactions, like how our ancestors sliced ever thinner slices of graphite until they finally sheared off a sheet of graphene, my already keen powers of perception and expression improved.\n Of course, coins aren’t just carried and spent. After all, Hull comes from outside the Milky Way. He has his quirks. For example, taking baths. For the first year of our flight, Hull never took a bath. One day, he suddenly announced he wanted to take one. By then, I was already used to his body odor and, moreover, I believed he had never taken a bath in his entire life. He locked himself in the bathroom for three days. To reassure me, he had meaningful conversations with me through the door that separated us. Even so, I was still distracted whenever I did anything else. Unbearable fantasies of what must have been happening behind the door ran wild through my mind.\n Afterwards, he told me that everyone on his planet takes this long to clean their body and waits this long in between. I asked him if I had to do the same. As he laughed, he comforted me, saying that they respected everyone’s habits and customs. I don’t know whether all Dieresians are like him. He obstinately refuses to cut his hair or nails. However, even if they are, I can accept that.\n Brother, your letter mentioned how worried you were. You said that you tried everything but couldn’t find anything about Dieresians. Everything about them seems to be a mystery. You were afraid that I’d fallen into another trap, just like before.\n You’ll know one way or the other soon enough. Our ship is about to reach Dieresis.\n No, it’ll be different this time. No matter whether that’s for better or worse.\n Alia Calendar 6th month, 89th year\n I’m sorry about the length of my letter. I hope your wife Jacqueline doesn’t glare at how much this space mail costs. But, brother, I can’t wait to tell you what happened after I reached Dieresis.\n After we disembarked, we immediately took the high-speed rail across the central axis of the city. This is Hull’s hometown. I’ve fantasized about this mystical place so many times. In reality, it’s more amazing than even my wildest fantasies. I’m sitting in an ancient form of transport that no longer exists on Earth. Streetscapes flash by on both sides. It’s as though I’ve sunk into a contemporary city of the 21st century. Simple geometric forms pile layer by layer one on top of another. Glass facades are flooded with a metallic radiance from their sun, a rust-red star, the only sign that I’ve gone to outer space.\n The train passes through the forest of tall buildings that is the business district then enter a residential district of gabled Baroque-style brick buildings. Green, clawed vines of wisteria, billowing in the occasional busts of wind, climb and fill every wall. Actually, they’re creatures that imitate wisteria. Sharp, slender claws stretch from their bodies. Suckers on their abdomens glue them to the walls. Hull told me this and when he saw my eyes, he added, smiling, that these not-wisteria vines were completely harmless.\n I could feel my pupils dilate. We looked at each other and laughed.\n Hull’s house is not more than a few steps from the train station. It’s decorated in the style of a 21st century Earth culture. Hull had obviously not put much thought into it. I didn’t understand how anyone so perceptive and intelligent could bear such out-dated decor.\n Hull shrugged. “My darling, it’s purely what you perceive through your senses, nothing to do with which era.”\n He pitied me, but tried his best to hide that. Brushing aside my bangs, he looked into my eyes. Silently, we held each other in our arms.\n Hull’s right. The longer I stay here, the more I can sense the current that runs under the ordinary things. Flowing in that current, they grow translucent, like jellyfish. Subtle aesthetic senses of all kinds follow the current-like tendrils, undulating slight in its gentle ripples.\n Living on Dieresis isn’t any different from living on the space ship. We spend most of the day either perceiving each other or loving each other. In other words, we train my powers of perception. Hull explained that once the sensory neurons all over my body are trained, they can be further developed to become even more powerful information processing units. My body isn’t sick like Earth doctors insist. Rather, it has stronger and denser sensory neurons than ordinary humans.\n “When you’re that perceptive, you’ll be even more like us.” He smiled at me.\n Immediately, I was steeped in our shared happiness. Already, I could practically feel the waves of joy, their amplitude growing from the constructive interference of our mutual, unspoken mental synchronicity.\n Brother, I can’t wait to become a Dieresian, can’t wait to get rid of my identity as a mentally ill human, can’t wait to love Hull. Here, everything fits. I’ve returned to my true home. I’ve roamed away for too long.\n You think we’re irresponsible, caring nothing about survival to wallowing in metaphysical questions, right? Don’t worry, brother. Although Dieresis looks like it hasn’t developed past our stone age, their technology has long developed to our standards. Tending our miniature farm for two hours a day supplies us enough food.\n I don’t know whether other Dieresians also live Hull’s sort of simple, frugal but fulfilling life. That said, it’s weird that I’ve been here so long now and Hull has never once taken me outside. He, himself, also rarely leaves this house. What is the outside world like? Is our mental synchronicity and happiness common on this planet?\n Alia Calendar 7th month, 89th year\n Who are we? From the beginning of time, no species has ever understood itself. Even while a species rushes to invade and exploit other worlds, it still doesn’t know what it is. Don’t worry, brother. If I told you that I sympathize deeply with those of my petty, greedy race, would you worry even more? Your sister, who has been arrogantly tormented by mental illness for years, hasn’t forgotten that she’s a part of the human race. That’s why I regret and limit our innate flaws.\n My body is changing. Brother, perhaps it has already changed.\n After I arrived, my appetite grew five-fold. I’ve fainted so many times because I always felt hungry. The weird thing was that I’d been losing weight. Hull urged me to eat more. I told him that my stomach can only hold so much.\n “You ought to consume nutrient materials with even more calories.” Hull handed me a bottle of dark red pills then told me to take a pill before every meal.\n The pill was really effective. Hunger no longer vexed me. My mind was always filled with every kind of food. I could train with Hull to develop my powers of perception again. The world was constantly multiplying by dividing. A vase was no longer a vase. A smile was no longer a smile. A shaft of light was a gathering of countless subtle gradations of color. Lightwaves rippled like water through the air. Every time you stared at it, you felt even more the dust flying around. They lightly touched your skin like snowflakes, making you shudder for an instant. We lingered over ever tinier things, as though we saw them through millions of microscopes. What our senses gathered was gradually amplified nearly to infinity. This was a vastness that humanity had never conceived of setting foot in. It was another way of interpreting the universe. Humanity has never imagined this kind of world. Humanity has never created any words to describe it.\n The initial enthusiasm has faded. I’m starting to feel tired. Because I’m following Hull so closely, I have no choice but to condense my soul, lose a little of my spirit. Some of the following will be wrong in the details.\n Even if I keep up with Hull in perceiving deep and subtle layers, the difference between how keen Hull’s powers of perception are and mine is huge. I’d never recognized this before, not because the difference didn’t exist but because I couldn’t be aware of it before. But now, I’m aware. So that I can keep up with him, more often than not, he reduces his own keenness. Brother, it’s only here that I’m deeply aware that I’m human.\n Sometimes, I even think Hull is in love with a monkey. And I am that monkey.\n As for those red pills, can they evolve me from a monkey to a person?\n I hate those pills, brother. Even on a purely physical level, they make me uncomfortable. As my perception grows keener, the discomfort becomes even more acute. For more than a few days, given half a chance, I flushed those pills down the toilet. Hull knows, I think. He just won’t say so.\n Tonight, the pill bottle was empty. Once again, Hull replaced it with a full bottle from his drawer. This was enough. He didn’t need to say anything. I swallowed today’s pills in front of him. We batted our eyelashes at each other. I told him that I wanted to go out for a stroll by myself. He didn’t stop me. This was the first time I’ve left the house.\n It didn’t look like there was anything to worry about. I was just going to wander around the garden.\n I followed the stairs down. It was black outside. At first, with the sound of rustling, the dampness, the thread of some flavor I can’t identify, I thought it was raining. I walked quietly. The only things left in the world were the rustling and strange, regular movement in the dark that matched it. That wasn’t rain. That was the swaying of vines on the wall. I imagined them as unbroken waves undulating in the dark, like a dangerous sea.\n The wind outside must have been fierce. What was odd, though, was I didn’t hear any wind.\n I pushed the door open. There was no wind, just the calm, peaceful night.\n The vines shone in the moonlight, deathly pale like scars. They stood out against the surrounding shadow. Even if the moonlight were blocked by clouds, they would still cling there.\n Five slender fingers stretched out, as though to beckon me.\n Finally, I understood what I saw. Shell-like fingernails that gave off a twinkling light. A palm that curled in a way that seemed deep with meaning. They formed a broken arm, a deathly pale severed arm. The continuously undulating vines stretched out, convulsing and twitching. A drop of a black, tepid liquid fell on my face. A little splashed into my mouth.\n How would someone on Earth describe the flavor? A fishy sweetness? That flavor slid like a snake down my throat and into my stomach, then became part of me.\n That was blood, brother. I grew terrified.\n I fainted.\n When I woke up, it was as if nothing had happened. Hull sat by the bed, his gaze soft. Even though I hadn’t opened my eyes, I could feel him there. Even if I hadn’t smelled his sweat or heard his breath, I would have known it was him. Only when he’s sitting next to me can I feel relaxed like the sand on a riverbank.\n “You fell,” Hull told me.\n I still hadn’t opened my eyes. I didn’t need to see my injuries. Not only could I clearly feel where he was, but also the scratches across my skin. Hull saw my fear. His fingers lightly stroked my eyelids. I opened my eyes, then gazed at him.\n He pressed up against me. Our breath grazed each other’s skin. He wanted me not to be afraid. He’d say—\n “That was a hallucination. You just fell, that’s all.”\n And then he said it. We spoke to each other not to say anything, but just to let the other hear. Sometimes, sounds comforted more than ideas.\n Brother, I love you.\n Hull said that after I recover, he’d take me on a stroll. Tomorrow, the day after, or maybe next week. I crashed my smile into him. Before, I would have been meek to him. Brother, there are lots of things that I don’t mind any more.\n Alia Calendar 11th month, 89th year\n I haven’t heard from you in a long time, brother. Have you discovered something? Hull says perhaps it’s a problem in the communication system. Don’t worry if you didn’t receive my previous letter. It’s just some nonsense I wrote under some exceptional circumstances.\n It’s winter here now. During the day, sunlight streams in through fogged windows. We’re silent, bathed in a golden cloud of light. At dusk, after a long session of meditation, we both open our eyes at the same time, give each other an understanding smile, then greet the approaching night. These are our tightly knit and joyous days. The cold air is full of the sluggish flavor peculiar to winter, a kind of sleepy contentment that gives people tranquility.\n For a few months now, my powers of perception have stagnated, but that’s ok. Steeped in the aura of quiet things, I don’t want even more. Hull ought to feel the same way perhaps. Once in a while, he worries, but about what? Like the scattered clouds that drift over farmland in the afternoon, that sort of anxiety is what, ultimately?\n I don’t intend to look for the answer. The answer will appear by itself. It always appears at the most unexpected moment, knocking fiercely at your front door until you open it.\n Last night, the night of what the Dieresians call Ramayana Day—\n Hull seemed out of character. After dinner, he just sat in his chair deep in thought.\n “Hull, you should sleep,” I said.\n Slowly, he raised his eyes. His gaze fell upon my body, then pierced through it. He still hadn’t seen me. I waited, waited as his gaze cut through the distant brambles then back to me again. Soon, his expression returned to normal and, cautiously, he held my hand.\n “Hi, Irina,” he called out, soft and hoarse.\n His voice both shook and was filled with wonder, as if this were the first time he’d ever said this name. I thought about our first meeting. I guess I must have smiled. His hand caressed my cheek. A bright, hot wind roared through my veins.\n At that moment, we thought the same things.\n But Hull didn’t get out of his chair. He sat motionless, as though he were nailed down.\n “Have you ever wondered how two species separated by many tens of thousands of lightyears can have practically the same physical appearance?” he asked.\n “But, actually?”\n “We merely look as though we’re the same. Unlike Earth people, in the Dieresian body, the cell is not the basic building block of life. Rather, every cell is a complete life unto itself. They all have independent circulatory and nervous systems. They are capable of being self-supporting and thinking for themselves. To integrate them requires a lot of calories. We have to consume a lot of calories.”\n I nodded my head. I finally understood why he took so long to bathe. He had to be especially careful in dealing with his hair and flakes of his skin. As far as he was concerned, every cell was priceless. How is he supposed to deal with naturally replaced cells?\n “Do you finally understand what I’m saying?” he asked.\n “Yes, you all have mental and sensory capabilities that I can’t even hope to reach,” I answered.\n He stared me for a long time without saying a word.\n Now, as I’m writing this letter, the memory of dim light is a reminder. I play back the scene, at long last understanding that expression that flashed across his face, the expression that burned in his eyes like flame. At first, it was despair.\n The clock tolled. Twelve o’clock. Midnight fell.\n “Come, let’s walk outside,” Hull said. Before I could react, he was already out the door.\n I called out his name as I chased him. He stood at the head of the stairs waiting for me.\n “Wear a coat. You’ll be cold,” he said.\n Eventually, we reached the street. The area was deserted, only us two pedestrians. Hull walked quickly, as though he were in a hurry to make an important appointment. I had to jog to keep up with him. If I weren’t careful, the swift figure in front of me would disappear in the dusky light. The street was so calm. All I heard was the echoing of our footsteps like beating of drums in the African jungle before hunters catch their prey. Except I didn’t know who was the prey.\n I could barely keep up because of how much Hull’s change had hurt me. Even if I exerted all my strength, the best I could do was catch a glimpse of him when he turned a corner then jog to catch up. The gap between us grew larger and larger. I almost lost him completely. In the central square, no matter what, I couldn’t even find his shadow. Fortunately, just then, I heard his footsteps.\n Not far away, Hull was climbing up a thousand-step flight of stairs to the central square’s high platform.\n A building squatted like giant creature from ancient times at the top of the stairs, waiting for us to arrive. This giant building had twelve, maybe more, archways leading inside. A roundel filled with radial tracery sat at the top of every archway. Pillars stood next to the archways and reliefs filled the arched doors. Towers with countless spires licked the black sky like flames.\n “Hull,” I shouted, but it came out soft and hoarse.\n Hull stopped, but only for a moment. He start climbing again, this time more quickly, towards the shadow the building cast. Soon, he disappeared into the middle archway.\n I had no other choice. I followed him in.\n My memories of that night seem to have been altered. Some parts have been deliberately stretched out, every detail clearly noted. Other parts leave only blurred contours.\n I guess I remember going through a winding corridor. That was difficult in this dark world. At its end, I pushed open a heavy gate. A surge of light hit my eyes. Crystal clear, sweet light. Light like spring water. I heard a beautiful chorus of men, women, children, old people singing softly in perfect homophony. Their harmony was like feathers drifting one after another to the ground. A soprano voice soared, piercing the buttresses and rib vaults. It reverberated in the lofty, open space.\n Overhead, the ribs intersected into a dome with an eight-pointed star. Large, resplendent gems were set in the smooth arch faces between the star’s ribs, forming an eight-petaled flower that burst forth into light. The pistil was a transparent net that shot out, flame-like, from the flower of light.\n “Welcome,” the light said to me.\n No, the light didn’t speak words, but I understood what it meant, like how Hull and I understood each other.\n I was here. Hull appeared by my side. Once again, he grabbed my hand.\n “Where is this?”\n “This is Eden. Mankind’s first home. We walked away from here then, finally, we returned again for the sake of the complete.”\n “I don’t understand.”\n “They are our inevitable final forms.”\n That last was Hull’s voice. He was behind me. When I turned to face him, the light receded like the tide. Close to a hundred elders wearing short-sleeved white robes belted at the waist stood in the space that the light had once filled.\n “You are not of our clan.” The most senior of the elders walked out of the crowd to greet us.\n His gaze flitted past the two of us and he immediately understood everything about us. That face of indeterminate age revealed a faint trace of—for now, let’s call it something like a smile. Brother, I don’t have the words to describe what was happening. Those mysterious, unspeakable consciousnesses melded into one. Within the flow of those merged consciousnesses, all individuality disappeared, replaced by boundless freedom and an incomparably keen sense of “I.”\n I am a life that has countless independent wills and thoughts—our cells have united.\n I am one among innumerable lives that form one huge body.\n I am one creation among everything created in the universe, one part of a successful world, a form that transitioned from tiny to huge, a connection in a mystical network to the outside.\n I, every I gathered here, after this realization, share their perception and cognition completely, the experience of life accumulated here without end, like crystals of wisdom.\n I am the most perfect form in the evolution of Dieresians, and also that of any high-order lifeform in this universe.\n At the time when I become “I,” I am outside of time, outside of cause and effect, coming infinitely closer on the infinitely long road, finally about to reach the core.\n Our world is one section of huge force without peer, without beginning, without end, galloping and howling seas, forever wandering smooth forms, forever returning, a returning that takes infinite years; all things are uniform, steadfast through the ages, forever observing carefully and tirelessly, steeped in and drunk on the wisdom and beauty of the universe.\n “This is the form that we eventually want to become.” I sighed as though I was talking in my sleep. “How do I become ‘I’?”\n Those who have become complete experience existence. The happiness they feel is boundless. The suffering they bear is critically grave. You will be weak, be seduced, be confronted with a choice. Don’t let the green flame consume you. Don’t become food for carnivores.\n I wanted to say that I didn’t understand, but the most senior of the elders had already returned to his companions. They started singing again. The elders and their profound gaze disappeared into the light that one again shrouded them. We quietly and respectfully backed our way out.\n As we climbed down the stairs, Hull explained wordlessly to me that he considered experience much more important than speech. That’s why he waited until the night of Ramayama Day, when the spirit collective can take physical form, before bringing me.\n “Also . . . ”\n “What?”\n We stopped walking and gazed at each other.\n “The drugs I gave you were indeed high-calorie nourishment pills. Ganglions need ample nourishment to grow and develop.”\n “You know, I’ve never doubted anything.”\n Holding each other’s hand, we continued towards the public square.\n “Is it that all Dieresians can ultimately become a spirit collective? What does it meant for a spirit collective to be complete?”\n “Some will abandon completeness.”\n “Why?”\n “Because that’s much easier. They keep only parts that are necessary. Being able to survive is enough.”\n “We won’t do that, right?”\n “Right.” He tightened his grip on my hand.\n “Hull, even if I loved you with all of my body and mind, I still wouldn’t think that was enough. I also want you to use all of your body and mind to answer me. All of everything.”\n As if I said some things I shouldn’t have said, Hull, somber and pale, didn’t say any more. Even though I didn’t use a deep layer of my powers of perception, I still knew he was struggling with pain. That was something I was utterly incapable of understanding at the time. I was afraid. Nameless, outmoded concerns once again floated to the top of my head.\n Just at that moment, a red bus slowly drove up from behind us.\n “Look, Hull, a bus. Can it take us home?”\n “Yes.”\n I wave down the bus then got in. He didn’t immediately follow me. He just stood by the bus, his face ashen. I suddenly realized something irreversible was about to happen. Just as I thought about getting off the bus, it started to move. Hull got on just before the bus doors closed.\n We were the only ones on the bus, no other passengers, no conductor, not even a driver. The empty seats and the handrails gleamed. Once the dim overhead light went out, the bus grew dark and nearly silent. All I could hear was the sound of the motor. We were like visitors who’d stumbled into the wrong cemetery. In the dark, countless invisible eyes glared at us coldly. The air grew thick with a faint sweet but nauseating flavor.\n I felt squished. The bus was jammed full of round shadows. I could feel the rise and fall of their breath on my skin.\n The bus turned suddenly. I nearly fell. Hull grabbed hold of me. Light from a streetlamp cut through the shadow of the driver’s seat. Like a bolt of lightning, it hit the two hands gripping the steering wheel so tight their knuckles had grown white. They steered the bus and controlled its speed with a practiced assurance, as though they were connected to arms and received instructions from a brain rather than being two isolated palms sliced off at the wrist. They were not bleeding. The cuts were extremely smooth and expertly done. They didn’t even leave scars. Although the hands were laborer’s hands, they were moist and shone white, like the hands of a pampered lady.\n This scene looked familiar, but I couldn’t remember where I’d seen it before. Where could I have seen it before?\n A leg lay flat just in front of my seat.\n A dignified face turned around on a mechanical stand to stare at me.\n A mouth connect to a tongue and windpipe glided by underfoot, weak and limp, in a miniature wheelchair. It stopped next to the driver’s seat and said something.\n The light turned red and the bus, brakes slammed, lurched to a stop. Two hands connected to robust arms rushed to grab the bus’s rings. A woman who only had an upper body held onto a man who only had a lower body. A headless body with its legs crossed sat perfectly still.\n The bus arrived at the station. Two slender, perfectly straight legs “pushed” me towards the bus’s rear door. A pair of massive breasts in a bra squeezed past me off the bus. A ass wearing rubber underpants with the help of mechanical legs followed me off the bus.\n I looked behind me. Hull. I shouted his name. It wasn’t until then, brother, that I discovered that I was laughing. Laughter shuddered through my body then splattered out. I was mad. You think so too, right? However, it would have been so much better if I’d actually gone mad.\n Hull didn’t say anything. He was still there in the form of a complete body. I couldn’t help thinking about what he’d look like after he’d been split into pieces. He—I should say “they,” what would they look like? Maybe the hands that once used to hold me in their grasp. Maybe his burning hot lips. Maybe his eyes.\n I looked at him in the distance, using my gaze to cut him and every other sort of compound form apart. Over and over, the real world fell apart in front of me. Because this was absurd, I didn’t feel any fear. I started to doubt my memories of these past few months. Perhaps I’d really gone mad. Everything involving Hull was the product of an unbridled imagination, my work of art created while I stayed at the madhouse.\n Even I as I write this letter, I’m still not completely sure. Does this world exist?\n No, brother, you’re wrong. I’m wrong too. Hull’s right. Just like when he grabbed me so tightly, he nearly broke my bones.\n He said, “Don’t make a sound. You exasperate them. They’re all perfectly normal Dieresians.”\n I remembered the words he said to me at home not too long ago. Now, I understood what he meant. Laughter gushed out in unending spurts. Involuntarily, I bent over in convulsion.\n Cold hatred gathered like nimbus clouds from every corner. From a mouth, a hand, an arm, or a waist, from any piece of the human body you can imagine dismembering. We stood in the midst of a violent storm. Hull was a terrifying sight to behold.\n “They will attack us if you don’t stop talking!”\n My eyes were startled open wide. He hated me. That’s for certain. Hidden behind the shadow of fear was him being fed up with and disappointed in me.\n And my disgust towards this horrible and ugly race along with the hate of Hull himself were written clearly on my face.\n We looked at each other in dismay, panting in coarse breaths. Because we’d just looked carelessly down at an abyss from on high and saw it for what it truly was, we felt dizzy.\n It passed in a moment no longer than a flash of lightning. For us, it was more than long enough.\n Why don’t I stop writing here. It seems like everything is over. I’m very tired.\n Alia Calendar 4th month, 90th year\n Brother, how are you doing? Did you get my letter? I think I’ve lost you again. I think I’ve lost a lot of things, irretrievably. I maintain an indifferent attitude as I watch the current of time sweep them away. After this year of struggle, Hull and I finally gave up on our marriage. It was like an abandoned spaceship. We each sat in our respective escape pods, separate windows gazing at the steel, island-like spaceship slowly drifting in the the vast, desolate universe.\n There was nothing we could do about it. We tried hard to forget what happened in the bus on Ramayana Day but we couldn’t. In the worst case, whenever we saw people being affectionate with each other, we couldn’t dismiss the hate deep in our hearts. All I had to do was look at his face and I’d think about it.\n We pretended to forget, only to bring it up deliberately, as a weapon, when we fought. We’d turn it into evidence for whatever we accused the other of. Then we’d pretend to forget again. Yes, we were still deeply in love. And it’s because of that the pain hurt even more.\n I envy those Dieresians who’d broken themselves into pieces. They look so calm and composed. They’re half-alive, but because of special technology, they’re able to work, eat, sleep, even have sex. They’re not too different from the humans I’ve met. Sometimes, I feel like I’m still on Earth. Everything that happened before is really just a fantasy in my mind.\n Just a bit of doubt and the crack you admit to will never fully heal. You’ll never have a way to acknowledge that he and this letter are real. What about you, brother? Hull, my Hull, and the infinitely vast and subtle sensory realm Hull and I experienced together?\n Just a bit of doubt and you lose a universe.\n I lost a universe, but this doesn’t at all make me feel any better. Even if I discover that it was all a fantasy, I’d still feel the stabs of pain. You are hated by a man you deeply love. You hate a man you deeply love. These two facts torment me to no end, drive me crazy. If it’s a fantasy, then why does it hurt so much. What’s the matter with me, brother? All of it was real, without a doubt.\n Finally, to restore our love, Hull suggested he cut his memory. He said Dieresians’ memories are stored in different places all over the body. Just excise that section and that memory completely goes away.\n “I looked further into this. They said all I have to do was cut off a pinky. If I do the surgery, at least one of us can start anew. I can go on to love without the blemish of our mutual hate.”\n Hull tried to convince me. I didn’t answer right away. There was something serious stopping me from agreeing with this intimate, seductive offer. I didn’t know what. Something deep in my heart resisted. I spent several days searching for what.\n One day, I sat by the window. The chilly and moist air of early spring seeped through my skin into the dark jungle of my heart. Suddenly, I understood what had stopped me. At the same time, I realized that Hull and I were over.\n “You shouldn’t have that surgery. At least not for my sake. Because I don’t want you to become like those people on the bus. Because I can’t bear to be with a man who is incomplete. Because what I want is all of you. All of you. Do you understand? Do you still remember our conversation outside the Lord’s palace? What I want is completeness. If you aren’t the complete you, then I won’t love you anymore.”\n Hull quickly grew paler and paler. The blood in his veins all rushed into his heart. He became so pale, he seemed transparent. Madly, I wanted to rush up to and hug this transparent man, but I didn’t.\n “You can’t bear an incomplete me. You also can’t face a complete but flawed me.” Hull said in a hoarse voice. He’d immediately understood what I’d meant.\n We stared at each other, merely stared at each other.\n The day that I left, Hull took me to the spaceport. When we reached its ground floor, he suddenly stopped. He looked at me with an odd expression.\n “You’re going to go. Don’t you want to see the green flame?”\n For a moment, I didn’t understand, but my body started trembling for no reason. A sharp chill climbed up my spine. I tried to ignore what he said, but my gaze involuntarily followed his and fell on the green, clawed vines on the wall.\n The spirit collective’s words emerged from the secluded valley of my memory.\n Don’t let the green flame swallow you. Don’t become food for carnivores.\n “It’s said that they are this world’s dominators. They’re a higher-order lifeform than even us. What’s even more bizarre, it’s claimed that we are their livestock, grazing on the pasture. They designed our bodies then waited. When we can’t bear life and choose to abandon completeness, the parts of our body we offer up they use as food.” Hull’s eyes were vacant. The corners of his mouth revealed a smile both tranquil and strange. I had the misimpression that he already had the surgery. “Our surgeries are actually really easy. All have to do is go to them naked. They know which part they ought to eat. They’re never wrong.”\n The shuddering started as a burst from below then diffused outward through the vines as a non-stop pulsing. They understood what Hull said. Like a starving, blood-thirsty beast that has sniffed out the scent of blood, they became wild beyond compare. Their leaves spun, their runners twisted, their tiny, thrashing claws scratched the walls.\n A seething ocean roiled before my eyes. It spit out an immense column of raging flames that couldn’t wait to swallow all life that was red, raw, and sweet.\n The vines rustled, a sound that was too familiar. I seemed to have heard it before. The sound resembled the violent scratching of sharp claws against my bones.\n “You don’t need to be afraid. They know what they need to do.” Hull sounded as though he were talking to himself in his sleep.\n I covered my face, then ran to the train station. Brother, the entire city was ablaze. That green flame hissed. It danced madly and seductively so that it could swallow this world.\n The train arrived. It took me away, from one high tower of green flame to another then beyond.\n Right now, I’m leaping through space on a spaceship. As for Hull, not long ago, I received his voicemail. He told me he’s already amputated both of his hands. Now, even though he remembers me, he’s no longer in pain. Brother, I’m on my way home, a complete person.\n Originally published in Chinese in New Science Fiction.\n Tang Fei is a member of Science Fiction and Fantasy Writers of America. Her works have appeared in Shanghai Literature, Flower City, and Fiction World. She has written fantasy, science fiction, fairy tales, and wuxia, but prefers to write in a way that straddles or stretches genre boundaries. Many of her stories have been published internationally and her work has been included in The Year’s Best Science Fiction in the United States. She has published a collection of stories, The Person Who Sees Cetus, and a novel, The Unknown Feast. Her story “Panda Breeder” was selected as Smokelong Quarterly’s Best Flash Fiction of 2019. The same year, “Wu Ding’s Journey to the West” won Speculative Fiction in Translation’s Most Popular Short Story silver medal. “Spore” was awarded the 2020 Chinese Readers’ Choice Awards (Gravity Awards) for best short story.\n She is also involved in different art forms such as literary criticism, poetry, installation, and photography.\n John Chu is a microprocessor architect by day, a writer, translator, and podcast narrator by night. His fiction has appeared or is forthcoming at Boston Review, Uncanny, Asimov's Science Fiction, and Tor.com among other venues. His translations have been published or is forthcoming at Clarkesworld, The Big Book of SF, and other venues. He has narrated for podcasts such as EscapePod, PodCastle, and Lightspeed. His story \"The Water That Falls on You from Nowhere\" won the 2014 Hugo Award for Best Short Story."}