{"fingerprint": "1JtEtOWYaUWPO2KmSRTn6Y/qw1c=", "sitename": "Clarkesworld Magazine", "title": "The Person Who Saw Cetus by Tang Fei, translated by S. Qiouyi Lu", "author": "Tang Fei; S Qiouyi Lu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tang_05_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Person Who Saw Cetus by Tang Fei, translated by S. Qiouyi Lu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5510 words, short story\n The Person Who Saw Cetus\n “What should I do? Turn gray with the pitch-black night?”\n She would always remember that summer day. Father’s enormous shadow settled upon her; she looked up from her workbook.\n “Lilian.” Father squatted before her desk, the crimson clouds outside draped across his shoulders. Father said her name again, then once more. Funny; never had there been a man like him who delighted so much in his daughter’s name.\n She laughed. “What?”\n “What are you doing?” He knew that she was doing her homework, of course, but he longed for a father-daughter conversation.\n Mother said that Father didn’t have a way with words, that he was quiet. She couldn’t imagine her father like that. But he definitely didn’t quite know how to communicate. He’d leave for work and half a month would fly by; when he returned, he’d only speak nonsense to his family.\n Father stood beside her, looking at her homework. The computer had already gone into screensaver mode; bright green, heart-shaped clouds darted across the black interface. Father swept his hand over the screen. A depth view of the interior of a railway car burst onto the gallium nitride screen. The scenery outside sped by the windows; inside, fourteen pink goldfish sat stiffly on the same bench, their bodies swaying with the forward motion of the train, their eyes spinning as they watched the clouds whirling throughout the cabin. This was the screensaver that Father had programmed just for her.\n The only one in the whole universe. He always took great pains to make strange and unique gifts for her.\n Father picked up the computer and tapped the goldfishes’ heads in a particular order, unlocking the computer.\n “Summer homework? Hasn’t school started already?” he asked.\n Of course he knew that this was summer homework. Mother had sent him to check up on her, after all.\n “It’s due tomorrow.”\n Father took a closer look. Although Lilian was only ten years old, she could still sense her father’s awkwardness. He really wasn’t good at this.\n “Why did you leave this question blank?” Father asked. And only he would ask such a question; the answer was obvious, embarrassing. Embarrassing to the point where Lilian couldn’t even respond.\n “Write about an unforgettable trip to outer space that you took this summer.” He read the question aloud, and then he understood.\n The sky had darkened. Cars whistled past on the nearby highway, the sound sharp and penetrating.\n It was as if they were sinking, sinking from the abundance of the Earth to this tiny apartment. Compared to the peeling outer walls, the dilapidated furniture inside wasn’t such an eyesore.\n Regardless of whether they’re rich or poor, people can always find a way to live with dignity, with beauty. Mother had said that. Lilian’s parents lived like that, too. They did their best to make their home comfortable and fitting; they tried their hardest to create the same learning environment for her as her classmates had. Even if they didn’t have the money for a microcomputer implant, Father still found a way to make her old graphene tablet retro and stylish, so that even her classmates were envious of her.\n She thought they’d always be able to deal with poverty.\n Until she saw that question.\n An unforgettable trip to outer space? Her family couldn’t afford such an expense, not even one trip to summer camp on the Moon. She’d never mentioned this to her parents; they couldn’t do anything about it. Her classmates flashed their photos in their group chats: tender moments from within flight cabins, the first footprint on the moon, things drifting in the currents of Europa’s surface oceans—and, of course, no end to the commemorative sites on the planets of the Phoenix Belt. And she, stuck at home, would keep refreshing her classmates’ feeds like an addict; she paid the most attention to these posts and photos, each the same as the last. On the first day of school, she skipped class.\n Her teacher had let Mother know that she’d skipped class; Mother had sent Father, who’d just returned home. Lilian would rather have been scolded by her teacher in front of her entire class than face her father like this.\n “I’ve already done the research; I can put something together in half an hour,” she said.\n “I think we can tweak that screensaver of yours.” Father’s eyes gleamed; as he spoke, his fingers flew over the keyboard.\n “How about when the clouds touch the goldfish, the goldfish spit out bubbles? What do you think—pretty cool, right?”\n Many years later, she’d remember his face, glowing with enthusiasm. Father was like those children in old movies setting off fireworks, all his attention on the strange new thing he was creating. He wasn’t avoiding embarrassment—he had already forgotten it.\n She kept her graphene tablet. She’d rolled it into a bundle, carrying it with countless other possessions in her suitcase as she went from place to place. Although the tablet was old, it functioned solidly and was still in good condition. Even after being flung out by a few angry landlords, it was still fine.\n When she was 22, she turned on the tablet before someone, showing him the screensaver that Father had made for her. He’d been astounded. He didn’t know that she hadn’t turned on the tablet in ten years, just as she didn’t know then that she’d fallen in love with him. They sat in a little nook in her dorm. It was raining outside, pitter-patter. He listened to her talk about her childhood, the silly things her father would do, that question on her summer homework. She actually remembered it.\n “I received full marks on that question. The first time.”\n “Awesome.”\n “How about you?”\n She stroked the screen. Those dead-serious goldfish. Delicate rainfall and no other sounds. The wind seeped into her skin; she curled up. “Father spent three days answering that question for me.” And it wasn’t exactly convincing. Her teacher thought the planet she described violated the laws of physics and couldn’t exist; Lilian had earned a zero on that assignment. Father was more furious than she was; he argued with her teacher, even succeeded in getting her teacher to change the grade to a passing one.\n “But actually, my teacher wasn’t wrong. There was never such a thing as ‘my visit to outer space.’ My father must’ve made the planet up. I don’t know why he was so angry; he argued with every teacher about this question, defending his invention 24/7. My teacher must’ve been scared of him in the end, thought he was too much of a hassle to deal with, and just changed the grade. Despite being terrible at conversation, he ended up winning the argument after all.”\n But everything has its price. Not long after that incident, Lilian was suspended.\n “Suspended? Why?”\n “No reason. One day, I received the notice, and that was that.”\n “What did your father say?”\n “He wasn’t there.” She laughed. Once he’d dealt with her summer homework, he’d gone to another city; his work required him to travel a lot. Besides, even if he were at home, there was still nothing he could have done. He must have known that she’d been suspended, but all he could do was call on the long-distance communiscope and mumble her name; he didn’t know how to express condolences or regret. Such an awkward person, arguing with people over what he deemed important and never giving an inch. Like insisting that the landscape in her homework really did come from an actual planet. No matter what, he had to convince her teacher that the planet was real, that the essay was real. Like all other things that he thought needed to be protected, it didn’t matter what price he had to pay; he’d defend them until death.\n So, that question—or, the fact that “such a planet does exist”—was actually far more important than she was: for the first time after so many years, this thought emerged clearly in Lilian’s mind.\n Before this, she’d never considered why she felt sad.\n Not a recollection, nor a thought.\n As long as she didn’t know the reason, she wouldn’t feel sadder.\n Lilian let out a long sigh, counted her heartbeats, and waited for her nose to clear. She felt as if a wave had passed over her, as if she were now floating up from the gloomy, icy depths to the surface of the ocean. His voice was like sunlight piercing down from above.\n He asked, “Your father often wasn’t home?”\n “Do you know about performance art? That’s what he did.”\n “Are those what they call body artists?”\n “I guess so. Through physical performance and installations combined with dramatic elements, these artists convey experiences and ideas. They’re not the same as actors either, oh no.”\n “So serious.” His eyes widened.\n “Nah.” She laughed and changed the topic. But he returned to the previous one.\n “I remember performance artists were really popular for a few years. If you had a party and didn’t invite a performance artist, it wasn’t a real party.”\n It wasn’t just a commercial pursuit—early performance artists were also employed to advocate and influence government policy. But she didn’t correct him.\n “Yeah. It’s too bad that my father was just an ordinary performance artist; he wasn’t particularly outstanding, and the money he made was barely enough to support our family. But he did genuinely enjoy his work.”\n “And then?”\n “Nothing. In the end he still wasn’t very successful.” She glanced at the small box on the table. The top danced with green light. “I downloaded some old movies. Let’s watch them.”\n They put on the VR headsets together. The induction cord connected to a designated spot on the cerebrum. As the movie played, microcurrents flowed through the probes on the induction cord, stimulating corresponding areas in the brain to create the illusion of being in the same time and place.\n Real illusions.\n People fell into it. Even if reason continuously asserted that this was fake, the body and all its senses had already been transported to virtual reality, experiencing uncanny adventure stories, secreting the pheromones of hate, terror, love, and joy. It might as well have been real.\n You could have it so long as you could pay the cash. No wonder people flocked to it. Who knew how many people the VR movie supply chain supported, including former performance artists.\n But Father surely wouldn’t have agreed with this thought.\n He also wouldn’t change professions.\n That is, if he were still alive.\n They watched Fellini’s La Dolce Vita. At the twenty-minute mark, he fell asleep. So she didn’t tell him that she’d seen this movie dozens of times, even once on film; so she didn’t tell him that she always thought Marcelli looked a little like her father; so she didn’t tell him that her Marcelli-resembling father had later gone insane and killed someone and had never been caught.\n The rain kept falling that night. He left after they finished watching the movie. The raincoat he borrowed never returned.\n Over the next ten years, one after another, her other possessions were borrowed away. She also accumulated a couple things that she’d borrowed and never returned. That became less frequent as the years passed. She was alone in the world; she threw herself into her work. She made only the barest of connections with people, carried no burdensome debts, and was never greeted by acquaintances on the street.\n So, at first, she didn’t process that the old man sitting on the sofa across from her was calling her name.\n “Lilian, long time no see.”\n She recognized that cheerful voice. “Hello.”\n Every performance artist needs an agent to manage their career. Father especially. The old man before her was perhaps the only person on Earth who could work with Father. After Father went missing, he continued to manage Father’s business, selling his installations, images, and souvenirs; every month, he’d send money to Lilian and her mother.\n “So chill. I read that news report about you. It’s next week, right? Humanity’s first voyage through a wormhole.”\n “I probably don’t really look like an astronaut.”\n “Not when you were little, at least. Amazing.”\n People always talked about her like this. Especially people who knew her when she was little. She’d grown up in poverty in a single-parent household; she was always climbing upward, finally becoming a top astronaut—she must’ve faced many hardships.\n They thought they knew. But they didn’t know.\n Suffering isn’t something you can understand simply by thinking about it.\n “Did something come up?”\n The old man glanced at the time, then stood. “You’re leaving next week, right? I want to give you something before you go. Are you free in a little bit? My office is just upstairs. I’m about to see a client; we should be done in about 40 minutes. Come see me then.”\n She was still trying to figure out how to decline the invitation, but the moment had already passed.\n The old man had already walked over to the door of the tea room. “Oh right, how’s your mother doing?”\n “She passed away seven years ago.”\n The old man looked back. “I’m so sorry.”\n She laughed. “No, you don’t care at all.”\n She was telling the truth. But putting it that way was probably unfair to the old man. He’d already done his duty as an agent. Father was the old man’s least profitable performance artist; on top of that, there was that notorious performance accident, after which he’d completely vanished. The old man absolutely had reason to dissolve the lifetime contract with Father, but he hadn’t. The good news was that, after the accident, Father’s work gained a novelty factor and was suddenly marketable again. Without much effort, the old man could send Lilian and her mother some money. They weathered many hardships that way.\n Mother was grateful for the old man. Even though, from a businessperson’s perspective, he was just fulfilling the terms of a contract. Lilian didn’t understand Mother, but she admired her; admired that, after experiencing so much, she still saw hope in the world; admired that she left this world with her heart full of warmth and thankfulness. She wanted to be like her mother, but she couldn’t.\n However, she could still sit in the tea room for a while before going upstairs to say hi, for old times’ sake.\n Lilian took a tiny sip of tea—there was no need to drink two cups at a place like this.\n “His understanding of this world was frank, fearless. You could see within brutal and bloody acts the possibility of love.” She didn’t know which patron had turned on the cable TV. The holographic image of a handsome man projected onto the empty floor in the middle of the tea room. His facial features, deportment, voice; there was nothing that couldn’t be called perfect. And that beautiful body beneath the close-fitting glass-fiber material could make anyone’s imagination roam. He was so confident; he knew that people would buy his act.\n Lilian knew that face: the most powerful art critic on Earth.\n Even if she weren’t watching the TV, there was no way she could miss that face. He was everywhere. Bored, Lilian started to estimate how much it would cost to insure that well-crafted body. It was a good way to pass the time; after completing the computation, it was about time for her to get up and see the old man. The critic had just mentioned Boyce; he talked on and on, his words an unceasing flow like gems splashing onto a jade plate.\n Before his words could get her feet wet, Lilian strode out of the tea room.\n The man’s office was as old-fashioned as he was: 20th century neoclassical style, with real leather sofas, abstract art, and, of course, a mahogany desk.\n “Well?” the old man asked, spreading both arms.\n She smiled and didn’t make a sound.\n “You know, you’re really quite like your father. Whenever I called to him on the street, I’d have to call until my throat was hoarse for him to hear.”\n Never really came across acquaintances on the street. She didn’t explain it as such. “Did you want to talk about something?”\n “You know, recently your father’s work has been doing well; collectors often pay high prices for his installations and performance images. The masses are jumping onto this bandwagon and buying anything that has to do with him; even a postcard with his portrait printed on it will sell several hundred thousand in a day.”\n “I don’t understand. Who would buy his things?” She was astounded. Father’s work was never particularly welcomed.\n “It’s true. That man always minded his own business as he did things, never understanding others’ feelings. So many employers only accepted his work reluctantly. He also always liked to ramble and say odd things.”\n “Using pure aesthetics as a cure to rescue this world of its hysteria.” She mimicked Father’s tone as she spoke.\n The old man fell back in his chair and guffawed.\n She didn’t laugh.\n In the end, the person who went insane was Father.\n The one who tried to rescue the world from hysteria ended up being hysteria’s ultimate outcome.\n Mother always forbade her from watching that particular performance, even exhorting her on her deathbed to vow that she’d never view it. But she’d still seen it, and not just once. In her darkest moments, she’d watched that recording on repeat with a morbid fascination. Although she wouldn’t admit it, it was as if she could feel the same hysteria, to the point where she was shivering—perhaps within that shivering she could get infinitely close to the answer to a question that she didn’t know.\n Father’s last performance. He’d enclosed himself with a young elephant in a glass room the size of a shipping container. Every wall flashed with simulated images of the universe’s birth and evolution: supernovae dilating; nebulae forming; unmeasurable amounts of interplanetary dust; the second generation of stars forming; gas giants coalescing; planets coming together to orbit binary stars; a dying star, its revolution stopped, half tundra, half inferno; all the lakes on a planet boiling under a thin atmosphere. Fast-forwarding, on endless loop. Time and space beyond human comprehension, all condensed in that moment into that shipping-container-sized glass room.\n One elephant and one human’s universe.\n The simulation played without intermission, accompanied by an indescribable, terrible roar.\n Seven hours later, the young elephant went mad in its own excrement and urine. It howled and ran into the wall, and then into Father, crushing with all its weight his already badly mangled body; then, it rolled about. Blood, organs, shards of broken bone, and eyeballs splattered everywhere, landing on distant stars.\n The performance was over.\n An unsalvageable corpse and an insane elephant were the coda.\n In the initial shock, people believed that the performance artist couldn’t have actually died. He’d used a brazen trick, replacing himself with a clone to complete this deathly performance. “This ruthless murder not only tramples on the law, but also defiles aesthetics and ethics; it has violated humanity’s basic decency.” The person who took the lead in pointing this out was that art critic, condemning as he spoke.\n The police immediately set out to arrest him; hackers searched for every bit of information about Father and doxed him; bounty hunters organized and moved to bring this murderer to justice—no cost was spared, but he escaped them all.\n With such an enormous net cast, he fled under cover of the hubbub that he himself had raised and was never seen again.\n Could the art collecting world suddenly admit such a notorious murderer ten years later?\n “They forgave him?” she asked the old man.\n The old man shrugged. No comment.\n It was about time to leave. She rose and prepared to say farewell. The old man stopped her and took a large box out of a drawer.\n She opened the lid and found herself stupefied.\n “I’m sure someone would pay a fortune for this, but I think you should have it,” the old man said.\n A stereoscope made of pearwood.\n The cover and separator on the photo viewing box were both lightproof, the lens was in good condition, the support slid on the track normally, and the copper knob shone like new. The stereoscopic mirror had been preserved well; it was as pristine as the day twenty years ago when Father had shown it to her.\n Of course, that photo was also in the box.\n She didn’t touch it.\n Twenty years had passed, and it was only faintly yellow.\n “My summer homework,” she murmured to herself.\n “So it’s true; I thought he was kidding. How reckless, using this as source material.” The old man stared at her, surprised. “Is this a real photo, or was it manipulated?”\n “He said it was real.” She didn’t make another sound and carefully put the lid back on the box.\n Another person’s voice filled the room; the TV had turned on at its programmed time. A familiar silhouette appeared before them.\n “Now, this person has high praise for your father. The world’s foremost art critic,” the old man said to her.\n This was the second time in an hour that Lilian had seen that face. She turned away.\n “Don’t be like that, Lily,” the old man said, looking into her eyes. “It’s already over.”\n “He looks younger, doesn’t he?”\n “You can’t blame him for what happened to your father. He’s an art critic; that’s his job. It’s all in the distant past now.”\n Twelve years ago wasn’t that far in the past.\n At that time, that great art critic was still just a second-tier critic, fifty years old and struggling to make a name for himself among his colleagues. Serendipitously, he met Father.\n The critic had been led to a pitch-black seat in the theater beside the municipal square; he held a telescope-like object that had been given to every spectator—the usher had told him that it was called a stereoscope. When a beam of blue light fell on a front-row seat, he raised the stereoscope according to the instructions. He saw a guy wearing a spacesuit leap onto the stage; the spotlight followed him as he made his way into the dark depths. The light went out; the astronaut had entered the darkness.\n Suddenly, a bright light came on. The entire theater was like a gleaming tin roof on a summer’s day. When he opened his eyes, he was in another world.\n Were those trees? Trees that looked like storm clouds.\n The tree trunks were made up of fine, golden piping. The piping followed a regular pattern, intertwining to form a complex, braided shape; hundreds of millions of strands pleated together to form an even more dazzling shape. Above, the trunks fanned out into countless delicate branches, and the branches fanned out into even finer divisions; the iterations continued to spread until they were all over the egg-white sky, until the naked eye could no longer see them. Below the tree trunks, like a mirror of the branches above, the trees’ enormous roots also grew in an awe-inspiring manner, spreading, expanding, and fanning out until roots as fine as a single strand of hair clung onto the surface of the silver rock below.\n At first glance, this unbelievable organism looked more like a tree trunk suspended in mid-air.\n Why would one think that this resembled a tree? Many parts were obviously wrong. He was, as far as the eye could see, in a completely uninhabited wilderness. Other than the white sky and the earth, it was just one giant-like tree after another.\n When the critic emerged from his initial shock, he found that he wasn’t the only one in the theater.\n He and the astronaut wearing a cumbersome spacesuit were both immobile before this colossus.\n The critic put down his stereoscope.\n Everything went black; he had returned to his seat. Two photos of the same size were on the stage. The image on both photos was almost the same—a tree suspended in a silver-white world.\n The astronaut was still there. He took off his helmet and turned toward the seats.\n “Dedicated to my daughter. This was her homework assignment.”\n Scattered applause sounded from the seats. The few people in the audience made their way to the exit.\n “What does this piece represent?” The critic had come to Father’s side.\n Performance artists never explain the meaning of their work. Father only smiled and said, “There’ll be another performance in half an hour. You can stay and watch again.”\n “This is called a stereoscope?” He changed the topic.\n “Yes, it’s made up of a set of optical reflectors. It can shift lines of sight. You probably know that the images seen by the left and right eye aren’t exactly the same; there’s parallax—it’s as if two camera lenses a set distance apart from each other are taking a photo of the same object at the same time. The stereoscope can shift lines of sight, combine the images seen by the left and right eye, and create a 3D effect.”\n “Photo?”\n “It’s a real photo. I used a 3D printer to make a space telescope, took the photo with a film camera, then enlarged the photo. Initially, it was for my daughter’s summer homework. I first made a small 3D stereoscope with those two photos. Then I enlarged the photos and used them here.”\n “This image was never manipulated—it’s a view from a real star? Which star?”\n “Cetus δ3.”\n The critic didn’t believe the performance artist. His research confirmed his hunch; with humanity’s current level of technology, it was impossible to observe Cetus δ3. Especially considering that the second star next to it was currently bursting into a planetary nebula. The dust and gases that it flung out would seriously impede any observation of Cetus δ3. It would be even more impossible to take such a clear picture.\n The photo that was so vivid he felt as if he were there turned out to be nothing more than a cheap manipulated image.\n In fact, the entire performance was just a cheap façade. The great critic thought it was funny; he noted his impression of the performance and wrote a half-ridiculing, half-joking review. “An Innocent Counterfeit”—the title the critic picked at the last minute before publication.\n The critic wasn’t aware that these nameless people were a gift that fate bestowed on him. The review that he’d written without much effort received unprecedented attention and recognition; his style of unrestrained mockery left a deep impression on people, and his complete rebuffing of the performance was seen as honest and courageous. Several people became performance art enthusiasts after reading his review.\n For a moment, he became the object of the masses’ attention, the darling of the art world; his likes and dislikes became everyone’s likes and dislikes, and his viewpoint became everyone’s viewpoint. The great art critic had finally become a real great art critic.\n At such a time, no one would be so foolish as to oppose him in public.\n Especially any affected parties.\n But Father did just that. He published a statement, doing the most to prove that the photo was real, upholding the value of his work. These were the two things he was least adept at—arguing and defending himself. The few times that he and the critic crossed swords, he’d been made a fool of relentlessly, falling countless times into presuppositional traps, many of which seemed to be of his own doing. Countless people joined this bout of grand mockery. His every word and every microexpression were captured and enlarged, becoming fodder for the art world, the entertainment world, comedians, and Internet commenters. People called him “The Person Who Saw Cetus.”\n So Father became everyone’s subconscious target. Back then, the more people loved the critic, the more they hated Father.\n From then on, he didn’t have a single client.\n Was it then that he started to go mad?\n Though he didn’t have clients, Father didn’t give up on performance art. Out of some sense of significance, he also didn’t give up arguing with the critic. Every new piece was a declaration of war against the great critic, a way for him to be good at something. The great critic would strike back with his most skilled hand. To outsiders, Father’s losses grew more and more miserable, and the great critic attracted more and more attention. Regardless of whether they meant to, regardless of whether they’d admit it, their meeting was an important point in each other’s destinies.\n The more the winner wins, the more the loser loses.\n The war between the two started with a fake photograph and ended with a fake suicide.\n Perhaps he hoped that he’d really died that way.\n That person, always unable to express anything clearly, always doing things that people didn’t understand; why did he think he could wish for the naïveté that others didn’t have?\n Even if there weren’t the great critic, there still wouldn’t have been any difference in the way his life dropped off into the abyss.\n That person who saw Cetus.\n The old man was right. This had nothing to do with the critic; plus, so many years had already passed.\n She just couldn’t understand why the critic had reversed his position on Father today, praising his work, even overturning his review from that time. Of course, the masses wouldn’t remember all that.\n But she remembered—she’d seen all of Father’s performance images and read all of the critic’s reviews.\n Hugging the box as she left the old man’s office, Lilian went straight home. Because the box was there, her normally comfortable home became a source of anxiety. In the end, she opened the box again. A lens, a photo, and also a slip of paper.\n This was absolutely the old man’s style. Before, if he had anything to say to Father that he found difficult to express, he’d leave a note like this.\n “Lilian, there’s something you must know. Actually, if you paid more attention to the outside world, you should already know—according to the latest DNA analyses, the blood left at the performance scene that year had fragments with variations; it couldn’t have been from a just-cloned person. So, that performance really was your father.”\n She stared at the slip of paper, chewing on the meaning of the two lines of text. Her eyes grew teeth; her heart grew teeth; the language center of her brain grew teeth. She chewed on these few lines of text that were harder even than pig iron. Teeth ground against pig iron; the sound was enough to make one itch.\n Her father was dead.\n The person her father killed twelve years ago in that performance had been himself.\n It was a real death performance.\n Once she understood this, she couldn’t hold it in any longer and laughed.\n “You seem well,” the astronaut beside her said.\n Just now, humanity had successfully crossed through a wormhole for the first time. Lilian didn’t say anything; she was still a bit dizzy, and her muscles felt tight. The reality of going through a wormhole was as enormous as the universe to her. With humanity’s current understanding of wormholes, it was still impossible to simulate a wormhole environment, impossible to do practice flights. Although they had theoretically mastered the crossing technology, there had been no way to experiment to confirm it. For the officials at the space agency, this flight was the verification. As long as it succeeded, they could use nuclear fusion spaceships to reach the before-unreachable stars that were a few hundred light-years away. Humanity couldn’t resist this kind of attraction.\n She didn’t mind being used as a test subject, even suggested that they had just her in control, with a GU-model AI replacing the other pilot. She thought they’d agree, but in the end they sent the person beside her.\n Just as the calculations predicted, when they crossed through the wormhole, Cetus δ was in a bright phase. Soon they’d discover the cool blue dot by the δ star. That was their destination—Cetus δ3. The spaceship started to slow down.\n Everything was going as planned.\n The moment her toes touched the frozen rock of the surface, it was as if an electric current had charged forth. She felt pain, pain to where her helmet’s visor fogged up, pain to where her tears turned conical—the gravity here was one-fourth that of Earth’s.\n She thought of that summer day, a silhouette crouching beside her. His shoulders cloaked with colorful clouds.\n “Are you all right?” her partner asked from the control room.\n “Do you see that forest up ahead, golden, made up of enormous trees?”\n “Are they trees? So big?”\n Lilian stooped, choked with sobs.\n “Are you all right?” her partner asked.\n “It’s nothing; I just remembered why I wanted to come here.”\n Originally published in Chinese in Cosmos Is Calling: Gogo, edited by Chen Kun, December 2015.\n Translated and published in partnership with Storycom.\n Tang Fei is a member of Science Fiction and Fantasy Writers of America. Her works have appeared in Shanghai Literature, Flower City, and Fiction World. She has written fantasy, science fiction, fairy tales, and wuxia, but prefers to write in a way that straddles or stretches genre boundaries. Many of her stories have been published internationally and her work has been included in The Year’s Best Science Fiction in the United States. She has published a collection of stories, The Person Who Sees Cetus, and a novel, The Unknown Feast. Her story “Panda Breeder” was selected as Smokelong Quarterly’s Best Flash Fiction of 2019. The same year, “Wu Ding’s Journey to the West” won Speculative Fiction in Translation’s Most Popular Short Story silver medal. “Spore” was awarded the 2020 Chinese Readers’ Choice Awards (Gravity Awards) for best short story.\n She is also involved in different art forms such as literary criticism, poetry, installation, and photography."}