{"fingerprint": "z7f5emRrYiFBguSfQWslL0OCij0=", "sitename": "Clarkesworld Magazine", "title": "Spore by Tang Fei, translated by Andy Dudak", "author": "Tang Fei; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tang_05_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Spore by Tang Fei, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5300 words, short story\nSpore\nThis is a small story, so don’t expect too much from it. The tale proceeds directly from beginning to end and wastes no time about it. Truth be told, I never thought the day would come I’d write it down.\nThe first time I saw her, I didn’t think anything would happen.\nNothing worthwhile ever really happens here.\nThey call this place End City, though some call it The Looking Glass City.\nFortunately, it’s not as affected and unconventional as these names would imply.\nFour months of snow, six months of thick fog—abandoned industrial zones as far as the eye can see, failed experiments in urban sculpture and installation, neglected historical buildings, unfinished residential parks, forever-pending road repairs and road plans. There’s no shortage of broken dreams here, no lack of unoccupied, derelict structures, no dearth of things attempted and forsaken halfway through.\nIt was supposed to be the northern hemisphere’s leading electronics industrial zone, a grand prospect indeed. When that aspiration had been shattered, artists were freighted in by the truckload. That’s when Gatekeeper showed up. The idea, he said, was to stimulate speculation and raise property values via art. I asked him how that was meant to work. He said something about using artists and their art to cultivate the land. But who could have anticipated the imminent tide of planetary colonization? This tract of land was soon deserted.\nWe were the left behind, a batch of useless human beings. But later you all came back. Unceasingly, people came. A whole world’s worth of useless people were drawn to this place. That’s what Gatekeeper said.\nAnd not long after she came here, she ran into me.\nIt was spring then. The snow had just melted. The sunlight was warm, the wind a bit cool. She sat atop a wall. I watched her long, snow-white legs gently swing, watched the sun shift position, its rays stabbing my eyes. She was something dazzling, rare, and remote, like a mountain’s snowpack in early spring, not yet begun to melt.\n“Pretty?” She stared down at me.\nI nodded.\nShe bent down to watch her leg shadows on the wall—like fish darting to and fro. I watched with her, avidly, enjoying myself. After a spell, I asked if she’d like to come down and join me for some food.\nShe ruminated on her legs. If it had been me up there on the wall, I would certainly have lost my balance and come toppling down. I was still staring, spellbound. She leaped down and landed by my side. I smelled something like sea salt, the tang of salt on the wind.\nAn AI shouldn’t smell like anything.\nI discerned at a glance she was an AI: too perfect, facial features so symmetrical, as if meticulously cut and polished to form an ideal East Asian face, high cheekbones, exquisite snow-white skin, faintly visible blue veins, body tall and slender, long-boned. Only her carelessly shorn black hair didn’t fit. Even though I spent my days absorbed in imaginary space romances, I couldn’t believe I’d stumbled across such a beautiful girl in End City—never mind an AI escaped from who-knew-where. End City had long been legendary as a place of freedom, attracting every sort of asylum seeker. Among these were runaway AIs. They abandoned their pasts and carried their secrets, coming here and doing their utmost to find a hiding place.\nSome succeeded, some failed. Most of the time it depended on luck.\nI brought her to my riverbank, and we looked at the reeds in the shallows and ate Chinese lettuce sandwiches. She ate convincingly. The chewing and swallowing movements were standard issue but didn’t lack in style. She even had a savoring subroutine. A good AI must fit the occasion and not vex humans. She did very well. While chewing, her expression was cheerful and content. Another subroutine created a natural-looking smile—not that she had the slightest inkling what the smile meant.\nNot that she had the slightest inkling what the smile meant to me.\nAmong their algorithms, there was none for providing feedback based on long-term, attentive observation of other people. This was fine by me. Being able to pay extended and close attention to someone, without awkwardness, without embarrassment, was ideal.\n“Did you cut your hair yourself?”\nShe turned toward me, appearing perplexed. Was she thinking of how to answer my question, or how to lie? Her pupils had been made excessively dark.\n“Delicious?” I asked, continuing to pretend I didn’t know she was an AI.\n“Mm-hm.” Another smile.\n“When you’re done, how about I take you to see where I work?” I reached out and wiped yogurt from the corner of her mouth.\nWasn’t it true that all stray AIs yearned for someone to take them home, a temporary safe harbor? A stray AI was surely in danger of reclamation, even here in End City. She ought to be thrilled with my offer. Indeed, it was easy to get her back to my workspace. Didn’t they know fear? If I’d taken her to a more sinister place, she might’ve found herself consigned to a more tragic fate.\nDo AIs experience fear?\nThen again, there were rumors of dangerous AIs, stories of people who’d brought strays home only to get strangled, or worse. Who reaps without sowing? There’s generally no such thing as a free lunch. Was it possible to just stumble upon a useful AI that was up for grabs? Only a daydreaming wretch would think so. I never thought there’d come a day I’d be bringing an AI home.\nPerhaps I’d been cooped up too long. In order to deliver my new trace-tatt design by the festival deadline, I’d been in my workspace at least a month, racking my brains and draining my life force. That day I’d completed a first draft. My strained mind and body could finally relax. That’s why I’d gone out for a leisurely stroll.\nIt was a special day for me, and not just because of the completed work. Maybe that’s why I risked bringing this AI, this unknown quantity, home. One thing’s for sure: my mood wasn’t bad that day, not bad at all.\nI showed her the culture dishes, the tattoo dye, the storage module for the nanites, and of course the all-important tattoo spores. Under quarantine casing, the dusting of infinitesimal purple spores on their fern fronds seemed unremarkable. But it was just these spores that would settle on people’s flesh and pierce dermis, dyestuff descending around damaged cells. Under nanite propulsion and according to our designs, the spores would take root between dermis and epidermis, and tattoo imagery would result. Unlike common tattoos, spore tattoos soon vanish. After three days, the dyes and nanites are metabolized. Many dazzling and complex designs disappear without a trace, thus the name “trace tattoos,” or “trace-tatts.”\nShe wasn’t too interested in the spores. After all, they could never enter her false flesh. If she saw—could she see?\nI took her to the drafting room, switched on the workstation’s light, and showed her the drafting tools, the workspace currently dry and dull as empty air. Finally, we entered the greenhouse.\nAssembly of the half-mechanical flowers was complete. They looked like biological flowers down to the petals, several flowers to a plant, petals overlapping in bunches, nearly submerging a gray-green underlayer of sepals. The wide expanse of pink-red flowers was resplendent, like a rosy cloud bank. She still seemed uninterested. Unsurprising, as they were, for the moment, just some unremarkable blooming flowers. It made sense that an AI like her would remain aloof from such a spectacle.\nI wanted to tell her that these seemingly common flowers would be the vectors of the tattoo spores. On the evening of Trace-Tatt Festival, they would be fired into the air. They would blossom with fire-like radiance. They would form fluctuating, brilliant fantasy designs, then submit to wind dispersal, scattering spores down upon the carousing, half-naked multitude, seeding trace-tatts in their bodies—and three days later the tatts would be metabolized.\nBut for whatever reason, facing her indifference, I just said: “Look. These are the flowers that will drop on Trace-Tatt Day. Every petal will carry tattoo spores.”\n“Spores that can tattoo?”\n“The spores are just one tool that implements the work. They will soon be landing on skin tissue, piercing it, and dye will sink around damaged cells. Under nanite propulsion and according to randomly chosen designs, they will implant dye between dermis and epidermis. One nanite may store over a thousand designs. It’s those designs we work out in the drafting room. According to regulation, a design may only be used once, so every year we need lots of new designs. Leading up to Trace-Tatt Festival we’re always busy.”\nShe yawned. So, these latest AIs could express feelings. I sought to quickly bring this topic of conversation to an end:\n“Generally speaking, tattoos are still done by people, not spores.”\nBut what was I really saying, in the end? We modern trace-tatt masters were only designers. In the old days we would’ve been part of the whole process. Back then, the real trace-tatt masters were programmers, nanotech engineers, botanists, molecular biologists, and most importantly design artists. They had to create from scratch. They plotted flower petal drift itineraries, bred new plants to host the spores, constructed the machine elements of the half-mech flowers, concocted the metabolic pathways for spore and nanite destruction.\nGatekeeper was the first and the best trace-tatt master. He pioneered the trace-tatt method, this magnificent art that consumes so much labor and material and leaves behind nothing.\nDesigns that drain artists’ life force, exquisite tatt brushwork, destined to be metabolized within three days, gone without a trace. Senseless.\nSo pointless it’s like a mockery of anything that means anything in this world.\nBrilliant, ephemeral beauty, like fireworks. Reason temporarily abandoned in a safely prescribed, orgiastic carousal. A resource-exhausting show of Doomsday-style consumption. Trace-tatts, naked flesh, sex, alcohol, and drugs. Gatekeeper reckoned it a winning combo, and he was proved right. People worldwide—and colonists out among the stars—fell over themselves to pay him. They came from near and far. They bought transit at exorbitant scalper prices. They squeezed into foul hotel rooms with dozens of strangers. They braved theft and rape to come here for Trace-Tatt Day.\nGatekeeper really is a genius. He made his fortune long ago, could probably buy the solar system’s entire space fleet at this point. But Gatekeeper is just Gatekeeper.\nI asked him once why he gave himself such a foolish-sounding nickname.\n“I mean to keep the Gate of Time. I mean not to let the past get through. The past shouldn’t be forgotten. Without the past, the present is hell.” Such was his answer. I couldn’t resist laughing. It all sounded so half-baked, so twentieth century, an argument based on cultural relics, old-fashioned and trite.\n“What are you laughing about?” The AI watched me, puzzled.\nI hurriedly composed myself. Even today, Gatekeeper’s bold and foolish words could tickle me. It has always been this way, hasn’t it? The new era mocking the old? Aren’t all fathers misunderstood by their sons?\nGatekeeper is my father. I am his son, a worthless son he’d rather not have, to be sure.\n“Nothing,” I said to the AI, smiling. I’d heard AIs have an algorithm for transferring information from the cloud, people’s personal data, as well as a mood reading for whoever they’re facing, a physiological value based on reckonings of previously known humans. In other words, my smile was in vain.\nShe saw me as a pile of numbers. And I saw her as a mass of ominous yet charming radiance.\nThey are beautiful, like trace-tatts. But they cannot self-metabolize and make themselves vanish. When people don’t need them anymore, they still exist. This is their sorrow. Despite understanding this, I couldn’t help wanting to make her happy, at least for a little while. “Well, that’s the grand tour, anyway. I suppose a human workspace seems pretty boring to you, right?” With that I shut my mouth, holding on to the question I almost blurted out, about her past, and what she did before.\nTheoretically, I didn’t know she was an AI. This was better for us both.\n“In such a workspace, what is your work?” She blinked.\nIt didn’t sound natural, and her expression was a bit stiff—signs she was, perhaps, an older model. Looking down, I saw our feet were very close. The arches of her insteps were not so beautiful.\n“My work is nothing much really . . . just simple design drafting.”\n“I’d like to see.”\nSaying no to a pretty girl is nigh impossible, but if she’s an AI, it’s not so hard. Nevertheless, I didn’t feel like refusing anyone that day.\nI sat down at the drawing board, opened a window, and dragged out some old designs from storage. The images floated into view one by one, glittering engravings of gold, flashing platinum etchings.\nI took out the cathode pen. My first stroke was a bit hesitant, cautiously descending, halting, and before the second stroke I held my breath. Inspiration had just flashed electrically in the depths of my brain, a warm current, persistent, a kind of fervent hope affecting my whole body, investing my heart with a new rhythm. Fundamentally, it was the desire to communicate. I seized upon it, like taking into my hand fireworks trickling down from the night sky.\nDazedly, I watched my first draft emerge.\nIt had been a long time since I’d drafted with such inspired speed. And it was just so beautiful.\n“What is it?” the AI asked.\n“Something I just thought of, a trace-tatt design. It represents a kind of algorithm or subroutine in a computer program. I’ve expressed it graphically, then put it through several fundamental transformations.”\n“What algorithm?”\n“For generating interest in something. Not that there really is such an algorithm. I just imagined one, and pictured it in this form.” That was as honest as I could be about my process.\nShe nodded, seeming to understand the roots of my inspiration.\n“I like them,” she said, lightly passing her fingertips through the nearest floating design. It broke into motes of light like dust, causing her to start, then spin once in a circle. Maybe this was how they expressed happiness. I watched her, fascinated. Unexpectedly, she snatched the pen from my hand and fell to modifying my latest design.\nHer technique was adept. Not only that, but . . .\nGatekeeper always said I wasn’t a natural trace-tatt master. My brushwork was too realistic for his taste. “You’re always taking reality as your starting point,” he often criticized. “The real world projected onto the trace-tatt world. Which isn’t necessarily a bad thing, just a bit down-to-earth, a bit boring.”\nMaybe he didn’t know he was the least qualified to say such things. No one was more single-mindedly devoted to leaving traces of the real world in the trace-tatt world. This was why he created the trace-tatt art in the first place.\nThe formative event had occurred in a faraway land, remote in time and space. I’ve never heard anyone but Gatekeeper mention it. I used to doubt the reality of that days-long and senseless mass slaughter.\nGatekeeper said it came without warning or portent. He was still a child then, part of a happy family.\nHappy, despite having to wear red armbands signifying their low societal rank, thanks to paternal grandpa’s colonial pioneer sympathies. The armbands meant citizens could arbitrarily humiliate them—but still, generally speaking, they were happy. Their rank designation just meant some inconveniences. That was all.\nWork limitations, housing restrictions. Priority-wise, near last in line for medical care, education, or purchasing rare goods.\nThus passed many years. The family accepted their fate and got used to it. Gatekeeper and the rest of them believed it couldn’t possibly get any worse. Life couldn’t get any worse.\nIn a sense, they were right.\nGatekeeper’s father was coming home from work when neighbors intercepted him at the residential district gate and surrounded him. They dragged him into a water fountain. He struggled and escaped, but they recaptured him and pressed him to the ground. This time they put their sense of ceremony first, and immediately set about their task, using a shovel, a paring knife, and a heavy bike lock to murder him. It was a protracted and chaotic process. No one knew whose was the killing blow.\nHis body was hung from the highest tree in the park. He would not be easily identified when the time came, and when it grew dark he was hardly noticeable up there.\nSo it was that Gatekeeper’s mother and two little sisters passed under the tree, oblivious to what had happened, when they came home. Following their evening routine, they began to prepare dinner and await the return of their menfolk. Instead, it was the killers who burst into the home. They interrogated mother and daughters as to the other men’s whereabouts. After several hours of deadlock, the hostiles were joined by reinforcements. The woman and two girls were taken up to the attic. They were forced to jump.\nThat was a fateful sunset, and not just for Gatekeeper’s family. The whole city, particularly the western district, erupted with violence against the armbanded, entirely without warning. The massacre went on for fifteen days. Whole family units were targeted, even if they merely supported the armbanded, and male infants were especially hunted. An official investigation subsequently reckoned the death toll at five hundred and forty-four souls. The executioners were nongovernmental and spontaneously organized. Although the seeds were sown by government-mandated viewing of the hostile faction’s propaganda, no one knew why the slaughter erupted on that day in particular. The murderers obtained unprecedented political legitimacy. They were able to use the crudest methods and most primitive tools to kill their neighbors and coworkers, even if the victim was a weeping, pleading child.\nGatekeeper’s paternal grandfather, the man who consigned his clan to shame and red armbands, hazarded returning home on the ninth day of the massacre. He’d been transferred to another city to undergo large-scale collective criticism. As it turned out, he might’ve evaded calamity, but he worried about his family members and returned home on the sly. Ultimately, this led him to the same fate as his son. I once asked Gatekeeper how he avoided extermination. He said that after he heard the news, he ran to the gate of the nearest police headquarters and began shouting reactionary slogans. He was sentenced as a political juvenile delinquent, and rode out the massacre in prison.\nA living nightmare. Suddenly begun and as suddenly over. Without reason, there was only cruelty and fear.\nI didn’t experience it, so it was hard for me to believe. Even though many of my blood relatives were among the dead, I could never feel Gatekeeper’s pain.\nHe grew up with death. He had survivor’s eyes.\nWorse still, he planned never to forget.\nAs in his city, so it went in others, spreading like a plague over a large area, but soon suppressed. After forty-four days of bloodshed, peace was restored.\nSoon enough, the slaughter was forgotten. Even without the intentional erasures and redactions, it would have vanished from people’s minds. Victims had been massacred by the family, so few were left to mourn the dead. The perpetrators were eager to evade justice. And history is, unavoidably, written by the survivors.\nGatekeeper tried many things before he finally created the art of trace-tatts. This was his final exertion—writing, audio, imagery, and every other attempt to record or narrate the nightmarish massacre had been erased, eliminated, purged. Like the slaughter itself, this great forgetting was accomplished by a tacit understanding between national will and the individual. Even the few surviving victims were eager to forget that chapter of history.\nExcept for Gatekeeper.\nHe painted those forty-four dreadful days on millions of strangers’ skins. He painted a mother hugging her infant just after it had been thrown down from a great height and killed. He painted a child noosed and dragged five hundred meters by his neighbor “uncle.” The tears of a grandmother begging to die in her grandson’s place. The indescribable panic on the face of the first victim just before the gang’s blows began to rain down. Clubs, shovels, and chains soaked in blood and brains. Arrogant, savage eyes, bright red. The dead hanging from trees like clusters of fruit. Crows filling the sky. Geometric forms, numbers, ancient pictograms in the Mayan or Egyptian mode, pointillism, large blocks of color, and of course traditional Japanese tattoo elements. All of this he made his obscure language of expression. He reproduced the past in myriad forms, destined to be metabolized after seventy-two hours.\nI never understood why Gatekeeper did this to himself. Why tell these stories over and over? Why throw himself into that marrow-chilling nightmare again and again? It was a nightmare that the other survivors sought desperately to abandon. The trace-tatted tourists were oblivious to the history they temporarily recapitulated. As far as they were concerned, the tatts were just beautiful designs, party accessories, a bit of End City’s local color. For many people it was a mediocre amusement at best, a few sparkly memories doomed to fade within a year and merge with the sea of forgetfulness.\nPerhaps this is why the tattoo arts were permitted to continue. I think people must have perceived Gatekeeper’s history lessons and message, but in such ambiguous ways and so fleetingly that it posed no danger. The powers that be must have thought of it that way.\nIn other words, Gatekeeper’s trace-tatt art had no real influence. It didn’t arouse anyone’s memories but his own. During quarrels I would cold-bloodedly deploy this truth. His persistence in remembering meant nothing to anyone but himself. Even I, his own son, had no interest in taking on the burden of these memories. Meaningless memories. He spent his life on them, and demanded I do the same. And I wasn’t having it.\n“The truth is you’re fundamentally unqualified.” He liked to retaliate with this truth in the same unfeeling manner I’d refused his passing of the torch.\nAnd it was true. I have no talent. I’m his flesh and blood, a random product of natural reproduction, but I haven’t inherited his ability, just as I didn’t get his memories. And why would I want to inherit those?\nI felt I’d been created specifically as a vector for his memories, an heir to his esoteric mnemonics. So, refusal of that inheritance was my best reprisal. I liked to see his eyes flash with pain or anxiety. I never thought of him as my father at those times. I was so young, so calm. It overwhelmed him. Until that day five years ago. I was showing off one of my inane trace-tatt designs. This time he dispensed with trying to shame me. Rather, he was silent for a long time. Gazing at my design, he seemed to look through the graphene tablet and fall into some world forever beyond my reach. In that moment, I almost believed his telomere-treated body grew old. He lifted his head and turned toward me. He’d never looked at me with such bewilderment and tenderness in his eyes.\nThe next day, he vanished.\nHe left behind an art form and its inheritors, the trace-tatt masters, including me.\nI often see that last look of his in my dreams. I have similar facial features, but I could never wear the expression he did that day. He was like a long-imprisoned criminal who’d just gotten early release. Using the review my dreams provided, I tried to decipher the meaning in his eyes at that moment. What was he thinking, that lone bearer of history trying to rouse a whole era’s memory? When his heart finally died, and he understood I was beyond redemption, where did he find hope? We, the skilled heirs he left behind, use what he taught us to create night skies bursting with incandescent mechanical flowers, and their raining spores, and the nano in those spores, and endlessly complicated and changing tatt designs. He would say our art is soulless.\nBut we wouldn’t care. Trace-tatting is merely our livelihood. We amuse tens of thousands of End City tourists, and it’s enough. The street graffiti gangs look down on us. They consider us mere buskers, selling our spirt and art. Big talk. Their scrawls may be full of moral implication, but they make no living.\nHer drawing was impressive. On the flexible screen, lines flowed and developed from the cellulose pen, and colors were evoked. Of course, I knew it all proceeded from some AI algorithm, but the image itself still moved me. This was essentially human, wasn’t it? After a few minutes, she’d already completed two design drafts. She seemed completely absorbed in her work, and she started on a third design. I watched closely. Something subtle seemed to leap out of the two completed drafts: abstract geometric forms overlapping, a strange combination I never could have imagined, yet arousing a sensation, a pulsing, uneasy, yet familiar feeling. My eyelids grew hot and I dropped my gaze.\nShe seemed to sense my discomfort. “You don’t like it?”\n“What’s your name by the way?” I said, deflecting her question with another.\nShe paused, pen in hand, and sized me up. I instinctively avoided eye contact, yet knew that my heart rate and hormone levels had no doubt already betrayed me.\nIn the presence of AIs, human ruses and affectations are useless. In their eyes we are always naked.\nShe embraced me, pressing her body against mine. Her exposed flesh was soft and warm. I didn’t think too much. I was like a fish following a warm ocean current, naturally and rightly finding her. Movement answered movement. Moist lips answered a shiver.\nShe must have understood my lust, not to mention my loneliness, from the beginning. After Gatekeeper left, I stopped having anything to do with life based on carbon or silicon. During the first year, I couldn’t help fantasizing he would suddenly return. I would rehearse scenes of us getting along. By the time I abandoned these hopes, I found myself unable to bear life among other people.\nI was a trace-tatt master. I treasured my relaxed, simple life. No history, no other people.\nThis was the only life I was fit for, even though sometimes, for a few specially designated days, it could be awfully lonely.\nShe had appeared at just the right time, like a seasonal flower. I weighed her down, firmly holding her wrists, lest we both get washed away by my body’s surging ecstasy. Her scent was intoxicating, reminiscent of sea salt.\nAfterward, I lay motionless. I watched her straighten out her clothes. She was, by design, like a woman in an ancient movie, shyly turned away from the man she’d just fucked, getting dressed. Her sweat glistened. A drop ran down her back to her tailbone. I noticed the string of numbers down there.\nThat would be her inception date, or software installation date. By convention this served as an AI’s delivery date. It was the birthday of the invested “soul,” and some people jokingly called it an AI’s birthday.\nHers was today.\nI sat up with a start, frightened of a sudden thought. I charged over to the central control screen and browsed her design drafts. I grabbed Gatekeeper’s designs from the cloud, but I already knew, and didn’t need to compare them with hers. I finally understood the cause of my recent flustered, familiar sensation. Without a doubt, her trace-tatt talent came directly from Gatekeeper. Maybe he participated in her entire manufacturing process, or maybe he was only responsible for her code. Maybe she was one of a large batch, or singular. It didn’t matter. What mattered was Gatekeeper had finally crafted a legitimate trace-tatt master, a total inheritor of his art and soul. They would contain history they’d never experienced. They would propagate records that had passed through many hands. Over and over they would, in vain, inscribe history on flesh. Again and again, it would vanish.\nThey were eminently qualified as his successors. That’s when I understood. That final look on his before he left: I knew what it had contained. A solution.\nVeins don’t contain memories. They don’t contain the longing for memory. They only contain base pairs arranged in sequence. What veins can’t do, algorithms can. Code can.\nGatekeeper and I had warred over history, and he had won.\nIn order to ridicule me, it seemed, he’d chosen my birthday as this AI’s inception date.\nWe were both his children. He’d made us on the same day of the year. He’d exiled us. Perhaps he’d even coded her to return to End City.\nI hate my father, that shade of history. Maybe he died back then after all, in that massacre whose causes he doesn’t understand today.\nWhat is the past but something bound to be metabolized by tomorrow after tomorrow?\nHe won, but his victory is preposterous and fruitless.\nEven if trace-tatts someday cover all the world’s flesh, people won’t understand what they mean, or once meant, or once tried to represent. History will be forgotten, as will Gatekeeper’s visual language. Trace-tatts will just be pretty designs indicating nothing.\n“Where are you going?” the AI asked as I left the room.\n“I’ll be right back.”\nI smiled at her, full of longing and regret. There couldn’t be many in this world as tender as her.\nShe really was beautiful.\nI didn’t return. I waited for the flashing red lights of the reclamation vehicle to play along the wall. And I waited for them to go away. Then, dragging my heels, I returned to my empty workspace. They’d taken the AI. She wouldn’t have struggled or resisted, I was sure. She would’ve been totally docile. Briefly I wondered if she really would’ve been such a bother, at my side. But no, I was too used to being alone. I asked myself if I would’ve reported her to reclamation if I hadn’t known her provenance, her relation to Gatekeeper. Her purpose, a trace-tatt master designed to surpass me. Maybe I would have.\nI don’t know.\nRegardless, the truth is never important.\nI’ll wait for tomorrow night’s riverbank salvos, the air-to-ground clamor, the blossoming of great fire flowers in the night sky.\nAs countless dim figures boil below. Ignoring the half-naked men and women around them, the celebrants will be looking up at gently falling and whirling and unfolding petals. And they’ll become even more naked to welcome the tattoo spores.\nAnd then three more fire flowers will be released in succession. Resplendent flowering trees on the curtain of the night sky, doomed to die in a flash, yet in that instant an eternity of brilliant blossoming, and then pink petals crumbling like snow, and perhaps a sea breeze, and the whole city trembling under petals.\nBut just now it is dusk. The sky is serene and exhausted. There is no trace of wind under the dark red clouds.\nNineteen years ago today I arrived in this world as Gatekeeper’s son.\nMy life began then, a lighthearted life that can’t bear heavy burdens. I said this story is quite short, preordained from beginning to end, unfolding inevitably. Of course I betrayed Gatekeeper, and of course I betrayed the AI.\nUp here on the workspace’s rooftop, the city’s highest, the night sky feels close. Finally, the wind gusts and penetrates my chest.\nDid I ever yearn to be loved? Did I yearn to become worthy of love?\nOh, that’s right! It’s just me, never loved, and unworthy of love.\nOriginally published in Chinese in Youth Literature, January 2019.\nTang Fei is a member of Science Fiction and Fantasy Writers of America. Her works have appeared in Shanghai Literature, Flower City, and Fiction World. She has written fantasy, science fiction, fairy tales, and wuxia, but prefers to write in a way that straddles or stretches genre boundaries. Many of her stories have been published internationally and her work has been included in The Year’s Best Science Fiction in the United States. She has published a collection of stories, The Person Who Sees Cetus, and a novel, The Unknown Feast. Her story “Panda Breeder” was selected as Smokelong Quarterly’s Best Flash Fiction of 2019. The same year, “Wu Ding’s Journey to the West” won Speculative Fiction in Translation’s Most Popular Short Story silver medal. “Spore” was awarded the 2020 Chinese Readers’ Choice Awards (Gravity Awards) for best short story.\nShe is also involved in different art forms such as literary criticism, poetry, installation, and photography.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}