{"fingerprint": "/MGEZZSICvNojC6NVl1mR+pRne8=", "sitename": "Clarkesworld Magazine", "title": "A Space of One's Own by Steve Rasnic Tem", "author": "Steve Rasnic Tem", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tem_06_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Space of One's Own by Steve Rasnic Tem", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4770 words, short story\n A Space of One's Own\n The skimmer is on the roof waiting for him, but he cannot help but pause to take a few deep breaths when he first enters all that open space. He walks to the edge and looks down through the mists of antiviral and -bacterial sprays: the streets empty of vehicles but full with the stream of humanity, their heads bobbing up and down seeking room to breathe, to see.\n The skimmer is waiting for him, the pilot beckoning to come aboard, and he can see an entire constellation of shimmering city lights beyond. Yet he still feels compelled to linger. This roof is so spacious, surely enough room for a dozen people to live and thrive. He cannot believe the powers that be have left so much space unutilized.\n The pilot continues to signal him, and he really must hurry. This opportunity may not come again. But he cannot shake off this feeling of pressing bodies, of hands grabbing onto his clothing, of hands slipping off as he starts to run away. He both fears the contact and regrets leaving it behind.\n A small animated blue bird with huge eyes appears at the corner of his vision. “Your stop is approaching,” it says in a high-pitched voice. He shakes it off and makes his way across the roof toward the skimmer. An animated bee flies in front of his face, blocking the way. Despite his resistance, he can feel its sting.\n Cedric opened his eyes. It had been a comfortable trip, but he was still relieved to be leaving such close quarters. Standing bodies were pressed shoulder to shoulder, groin to cheek throughout the car. The man next to him had some sort of strong, deliberate odor, apparently just under the threshold so he had still been permitted to ride. This version of the Rail was a relatively new system, only a year or so old and he didn’t understand much of anything about how it worked, but then he didn’t understand much about how anything worked these days. Life had become too complicated to do anything but live it. That was a good thing, according to the language scrolling on the walls of the car and on the sides of buildings on the way to and from his work. These were the only streams you didn’t have to pay for, but ran constantly in public spaces for free, every day.\n But the Rail was mostly satisfactory. He told it where he wanted to go and it dropped him on a platform a block away from home. The car wall in front of him turned a soft transparent green showing the fast-moving cityscape outside. The section of floor he was standing on suddenly passed through that less than solid wall and he found himself standing safely on the local platform, the train speeding past in a silvery blur without slowing down. Several hundred other people had been dropped here as well.\n You always stood on the Rail; the handicapped had their own system. They kept reconfiguring the cars so they could fit in even more riders. They’d done something to the floor of the cars—he actually enjoyed standing on those floors. You could feel them shifting, adapting where you stood. You just had to stand where the printed footprints were. He loved what they did. He thought he could stand there for an hour or more. Of course that was the purpose. And if you needed it this rod came down and did something to your lower back. For support, but it was more than that. It was heaven.\n Still, it was always a relief to get off, even onto a crowded platform. Hell was people, he’d heard. Certainly too many people were Hell.\n They encouraged you to wear a particular type of soft shoe on the Rail. It wasn’t required, but they sold them. He wore his pair everywhere for that rare feeling of comfort. He didn’t know if they were supposed to help off the Rail, but he certainly liked the way they made him feel. Someone at work said it was “just comfort by association.” He didn’t care.\n Cedric joined the stream of hundreds headed into his neighborhood. Each day there appeared to be fewer children in the crowd. Immediately he felt that urgency to fold in, pulling in his arms and tucking in his elbows, making himself smaller and more compact, generally limiting his movements. And yet it was important to move quickly—the next group would arrive at the platform in less than half an hour. Not surprisingly the neighborhood had changed extensively while he was at work. This happened every few weeks in order to improve efficiency. But this time the changes appeared to be more drastic than usual. He hardly recognized his block, or knew where his particular building happened to be. Colors, patterning, ornamentation had transformed, but that was typical—architectural surfaces were always fluid in a discount neighborhood. And there were always structural changes within the walls. You signed a contract that said room layouts and approximate sizes and even contents were alterable at management’s discretion. But he’d never heard of anyone returning to an apartment larger than the one they’d left. That was the price you paid in order to live here affordably. The options for constant spaces were rare and cost a fortune.\n But much more had happened during today’s absence from home. Exterior walls had changed position, basic architectural footprints had transmuted. Boundaries between properties had become fluid; he couldn’t imagine the number of negotiations required. Even the relationship between constructions had been restructured as one building became interwoven with another.\n Anyone who had spent the day in their apartment would have been asked to leave while all this took place. Thankfully he’d never had to experience that. There weren’t that many places one could go without a Rail trip requiring at least a day.\n A smiling, animated blue bird flew so close to his face he felt compelled to step back. “May I help you?” the bird asked.\n “I can’t find my building today.”\n The bird stared at him a few seconds before saying, “Cedric.”\n He didn’t like to commit himself to these things, in case there had been a hack and he was being lead into something he didn’t want. But he was tired. “Yes.”\n “Cedric, look at the buildings. Do you see the green one?”\n He gazed down the block. One of the buildings had turned a green glowing color. Blue birds flew in circles before the entrance so that there was no mistake.\n “Yes.”\n “Would you like me to accompany you?”\n “No, I’m fine.”\n “Have a nice day.”\n He started to say thank you but the bird was gone. He sighed and continued on to his building. The circling birds faded once he got there and the building returned to a coruscating blue that reminded him vaguely of the ocean. He liked it and immediately felt more relaxed.\n He gathered with a few hundred others before the multivator that would take him to his apartment’s new location. With a practiced distribution born of countless repetition they naturally fell into groups of twenty or so as they jammed themselves into each car. “4782,” the blue bird whispered into his ear. If he wasn’t mistaken, the car started moving down. If true, that could only mean he had lost his window again.\n The multivator traveled swiftly in a combination of horizontal, vertical, and diagonal moves, stopping and silently letting residents off seemingly at random on unmarked floors. There was an ancient expression even more relevant today: “a little bird told me.”\n Cedric envied the couples who got off together. Licensed couples were granted additional space. When Cedric had been married their quarters had still been small, but at least there had been a bigger bed, and room for a few additional pieces of furniture and more wall space for pictures, clothing, and decoration. And critical breathing space. He’d heard that housing management had been forced to increase square footages for couples after the rise in the domestic murder rate.\n “4782, this floor,” the smiling blue bird whispered and winked. The wall opened and Cedric stepped out into a narrow corridor. As he walked toward his apartment he could feel the walls closing together behind him to make a solid wall again. Although this movement was almost without sound, there was always some accompanying noise or sensation, if only the result of a modification in pressure as this expansion and contraction of living space happened all over the complex of buildings with every shift change. Cedric had come to think of this as the building’s breathing.\n The feeds promised that one day further developments in Rail technology would deliver you directly into your living space. He supposed that meant no walking to the building, no multivator, no corridors. Did that mean no doors? Doubtless. You could fit many more exit-less rooms into the same space.\n He passed an emergency ladder built into the wall. This safety feature always reminded him of the fragility of his residence here. In case of a fire or other disaster, which disabled the multivator passages above and below, the ladder would allow a manual exit in the indicated direction, but unless you lived relatively close to ground-level the distances involved made a safe exit problematic. This was generally accepted. Theirs had become a culture of fatalism.\n Once inside the apartment he did a quick survey to determine what had changed, what was missing. Most obviously the living space had been reduced by at least a third. The corner where his closet had been was subtracted. After a quick search he found his clothing stuffed under the much smaller bed. Selected images of his family, his wife, had been moved to the ceiling along with the free limited news, music, and entertainment feeds. One wall was equipped with a smaller version of his cooking, food storage, wash apparatus, and waste control. There was still that wide color band in the middle where you weren’t supposed to put anything, meant to allow for the temporary contractions that occurred throughout the day.\n Once Cedric forgot and placed a chair for reading and meditation in that region. Sometime during the night it had been caught between closet and bed during a contraction and snapped into pieces. You were never completely safe with anything beyond the built-in essentials.\n He was missing some of the mementoes from the shelf above his bed: his wife’s hairbrush, a toy his parents had given him when he was small. He would have to send a request for their return, assuming they could be located. So far nothing had ever been returned.\n A bit of bright red cloth lying on the floor caught his attention. He picked it up, recognized it, and brought it to his face, wondering if it still held any of Pauline’s scent.\n He’d come home from work one day and discovered that she was missing. There was no note, but all her things were gone. He knew she’d been unhappy since she’d lost her job, feeling unproductive and less functional. And they’d been denied a parenting license once again. But they’d been talking. She’d been better. It was hard to fathom she would just leave. Where could she even go?\n It had been nearly a year and now her scarf had suddenly been returned. Was there some mistake made that had resulted in them keeping some of his property and returning some of hers? Where did they store people’s personal items anyway? According to contract such things were to be expected during extensive remodels, but the management wasn’t responsible. He would file more inquiries; he didn’t know what else to do. There was no procedure he knew of where he might conduct a manual search.\n A small package slid out of the food dispenser and slid across the floor. He dutifully picked it up, unwrapped, and ate. He drank some water and used the bathroom. He balled up the wrapper and threw it in the corner. When he returned from work tomorrow it would be gone.\n The room illumination went into muted colors, then transitioned into an underwater scene on all six wall, ceiling, and floor surfaces. At least his preference had been maintained. He had the option, theoretically, of staying up all night if he wished, although he’d never tested it, or desired to. He was always too tired after work for news, entertainment, or anything else. Perhaps that was why she left him. He held her scarf in his hand and said “ready.”\n The happy bee came and stung him into sleep.\n When the skimmer finally takes off it flies just a few stories above the city streets, darting between buildings for a little bit of fun, sometimes dipping low enough beneath the preventative medical mists so that Cedric can see the mass of populace below. Several individuals look up. One or two actually wave. Most, however, remain focused on the back of the individual ahead of them, arms at their sides, proceeding forward at a more or less steady, but slow pace.\n Cedric enjoys this new freedom, but cannot help wondering if he is at all entitled. After all, many of the people he is passing over are just as deserving of this momentary escape, and many much more. He cannot see the faces of the ones who bother to look up, but he can well imagine their feelings.\n Unable to watch this painfully slow parade anymore, he signals for the pilot to take them up. They pass through the glittering clouds and into the vast constellation of city lights, and he asks the pilot if they might rise even more.\n When the Rail dropped Cedric off at the local platform he was amazed at how backed-up the lines were. Thousands of individuals filled every visible space in a slow creep toward their individual buildings. If it was like this all over the city . . . but that was a ridiculous thought. Things wouldn’t get that bad.\n “Some sort of bad Rail accident on the east side,” the man in front of him was saying. “Hundreds seriously injured. I don’t imagine they’ll do much to save those poor people.”\n “It could take us hours to get in,” a woman said. “Guess we’ll get to know our neighbors very well.” There were a few strained laughs in response.\n Her suggestion sounded reasonable, and yet Cedric saw very few attempt to converse with those around them. He knew very few of his neighbors even though he had seen some of them hundreds of times. There were still public gathering places, but closer to worksites than to housing locations. Land was precious. Chances were you knew your co-workers far better than the people in your own building.\n He saw a thousand of these faces every day—for him at least, such quantities made him want to turn away. He hadn’t visited the apartment of anyone else in all the years he’d lived in discount housing. Who had a place big enough for visitors?\n He found himself exchanging glances with a woman a few feet away. She looked increasingly familiar. And this wasn’t the vague familiarity he’d grown accustomed to, that after seeing thousands of faces every day you came to understand the types and subtypes and almost every one you’d ever known fit into one or the other and every day you saw at least twenty or thirty others who looked very much the same.\n He thought he must have seen her more than once before, and the way she kept glancing at him he thought she must have the same perception. Perhaps he had talked to her at some point.\n He looked away to check the progress of the crowd. He wondered where they were splitting into separate lines. They had to be splitting into individual lines at some point before any positive progress could be made.\n He turned back and for a moment he didn’t see her, and then suddenly she was there beside him, looking up at his face. She was short and very thin, very pale. She had the deeply set wrinkles above the nose which suggested someone who worried frequently.\n “Can you see anything? I hear they made our living quarters drastically smaller—did you hear that? Maybe that’s why there’s such a slowdown. I hear there’s been a huge influx of workers the past few days. Did you hear that? That would mean they would have to reduce the apartment size, wouldn’t they?”\n For some reason he seriously wanted to reassure her, but he knew very little. “I don’t see how they could be made much smaller,” he said. “I can barely turn around in my space as it is.”\n Cedric was hoping for a smile from her but he didn’t get one. “Sometimes I feel like I can’t breathe. The building gets to breathe, but I don’t.” The more she talked the closer she looked to breaking down.\n He took a chance and put a hand on her shoulder. She immediately stiffened, frowning, twisting her head to look at that shoulder. She forced a smile and he could see her beginning to relax. “Thank you. My name is Jules.”\n “I don’t see any major building changes, at least from the outside,” he replied. “They certainly don’t look any taller. All these extra people—well, the schedule is backed up. It makes sense.”\n She started to nod, but then the crowd surged forward, and she struggled to keep her balance. Before Cedric could try to help her she was moving away. “My name’s Cedric!” he cried as she was swept away on the thick tide of bodies.\n Back in his apartment he discovered that her anxiety had proved valid. He had half the space he had before, perhaps even less. His utilities were still smaller, still more compact. His bed had been reduced only slightly, but the only place to stand was either right inside the door or right in front of waste management. During contractions there would be no standing space at all. He would have to remember that if he didn’t want a broken leg.\n He supposed the intention was to encourage most people to spend all their time in bed. The smaller ceiling displayed a diminutive feed screen and a single photo of his missing wife. He leaned over the edge of the bed and pulled out the few items of clothing there: only a couple of his jumpsuits remained, but there beside them were two of Pauline’s favorite dresses, shoes, and underwear. He couldn’t remember the last time he had seen them.\n A happy blue bird fluttered down to the floor and perched on her clothing. “You are anxious. Your stress levels are rising,” it said with a smile.\n “What happened to my wife? Did she even leave on her own? I need to file a complaint.”\n “You need,” pause, “Cedric, to relax. You have a full work day ahead of you.”\n “Is there a human being I can talk to?”\n “I’m sorry,” pause, “Cedric. But there are so many of you now. That kind of individual attention is impossible.” The blue bird grinned and grinned and grinned. “But you can see Mister Bee if that would help.”\n Before Cedric could answer the happy bee came and stung him into sleep.\n Wait! Wait! I’ve forgotten something, Cedric shouts to the skimmer pilot. The pilot, a real rock star type, looks around and stares at him but says nothing.\n We have to go find Pauline! She would love this!\n The skimmer drops swiftly out of the sky, the rooftops looming larger, the vast network of city lights coming into sharper view, then through the mists and just above the hordes of slowly moving bodies, pushing against the walls of buildings, climbing up on top of each other, reaching for whatever they can get.\n The skimmer is dropping so fast he is afraid at first that it might actually crash into the crowd. But then it levels off and hovers just above their heads. Many of them look up this time, and Cedric leans over the side, desperately trying to find her. But it’s been over a year. Has he any chance at all?\n Cedric’s office was the busiest it had been since he started working there. Hundreds of projected displays with four employees at each display monitored information whose ultimate significance no single one of them was privy to. All gathered into one large room. But at least there was a high ceiling and air flow, and looking across the room through all these transparent displays of multicolored data made an aesthetically pleasing effect. It was the most pleasant place Cedric had ever worked. But although he knew only a small percentage of these people he did know some, and some of those familiar faces were missing.\n “Rotated out, I hear,” Bill said. Bill had been the one working next to Cedric when Cedric proposed to Pauline. “That actually means dis-employed, or terminated, although I hesitate to use that term. There are so many rumors, you know?”\n “But they were among our most highly skilled people. They’d been here so long.”\n “Well, there you go. Length of employment. There are so many of us now. Hallelujah for medical science!” Bill raised his arms in mock-ecstasy. “They just want to give more people a chance. There aren’t enough chances to go around.” He pointed at the display. “See that blue curved line? That means three million new people entered the city today. William told me before they showed him the door.”\n “Where will they put them all?” Cedric felt cold. He wished the air units would pause now and then.\n “Here, there, and everywhere. Did you know they were building a giant tower on the west end? It’s supposed to hold five million souls when it’s done, and it’ll be fully allocated before it’s even halfway constructed.”\n They both sat and stared at the display. Cedric wondered what other bad news was right in front of him if he only knew how to see it. But he was sitting here, and he had a home to go to for rest. He nudged Bill. “We should have gone to Mars earlier, I think.”\n Cedric dropped off the Rail and into a sea of heaving bodies. It was late in the day, but the sky was remarkably clear. So there was nothing to shade the crowd from the hot afternoon sun.\n The sea of humanity moved according to laws and forces which were not readily apparent. In one section of the crowd a large number of people appeared to be swaying, as if in keeping with some internal music. In another heads were bopping up and down at a frenetic pace. Were they dancing, or exercising? In either case probably just trying to keep the blood circulating. Many of them would likely be here for hours.\n That there had been significant changes to the residences was immediately obvious. Everything had been combined into one gigantic structure. Not as large as the one being built further west, at least according to Bill’s description, but still the largest building Cedric had ever seen. A rigid framework had been constructed on the outside to support something that gleamed brightly within. Cedric thought maybe glass or highly polished metal.\n There was a tug on his arm. He looked down to see Jules, looking exhausted and distraught, leaning all her weight against him.\n “I lost my job today. They sent me home. But they were building this, and I couldn’t get back in. I don’t even know if they’ll let me in, now that I don’t have a job. Or if they let me in, what might happen to me in there. I’ve been wandering around most of the day. Did you know there’s nowhere to go around here? Practically nothing but secure buildings and transport lanes. There’s hardly a place to even sit down.”\n “Oh, Jules. I’m so sorry.”\n “Can I come in with you? I won’t be any bother. Just anything, anything you could do.”\n “Of course. Of course. Come inside with me. I’ll manage. You can stay until we can get something figured out.”\n So they stood that way for hours, embracing, holding each other up. And during the long intervals when there appeared to be no forward movement at all they lay down together with the others, and eventually touched, and kissed, and promised more than they should have.\n But eventually they got to the front, the two of them, sometime after dark. There was no multivator here, just a series of single doors, and inside each door just a small dark room, hardly big enough for one person.\n At this point some people hesitated, and didn’t want to go inside. Eventually they would slump. Obviously they’d been stung. A smiling blue bird came to Cedric and told him to help carry the unconscious man in front of him, and with Jules’ help prop him up inside. The door closed. The man disappeared, and the door fell open again to reveal the small empty room.\n Cedric looked up. Windows were glowing in the structure inside that rigid framework, and in most of those windows there was a face looking out.\n When it came Cedric’s turn he held Jules tightly and tried to take her inside with him. But the blue birds appeared again, a swarm of them, and angrily blocked the way. “No! No!” shouted the bird in front. “For your own safety! One at a time!”\n “She’s coming with me, just for now,” Cedric insisted, but the birds wouldn’t allow them to pass. Eventually Jules fell to the ground and two of the residents left the crowd and carried her away. Cedric stood and watched all this but did nothing. What else could he do?\n Once inside the dark room, which was more of a booth, two halves of a capsule moved into place to enclose him. Then he was taken up, and up, and he could see through the exterior framework of the structure onto the world outside, that huge crowd, and the dark silhouettes of even more large buildings beyond. So at least he had a window again.\n If he turned around in the tight space there was his waste facility, and his food dispenser, and a small screen scrolling information promising wonders to come. At his right elbow was a sleeve containing a jumpsuit in his size and preferred color. Something clamped his legs, and he felt the pressure leaving his feet. He felt as if he was floating in midair.\n Near the ceiling of the capsule an image flickered into place. It was Pauline, but a picture he had never seen before. From the background it appeared to have been taken in their apartment. She looked alarmed. A vein stood out in her forehead, and a looming shadow had darkened half of her face.\n Cedric shouted for the bees to come, and when they did it seemed they stung him near unto death.\n Pauline snuggles against him and requests that the skimmer pilot take them higher. The pilot nods and the skimmer continues its upward trajectory. Cedric wonders what the limits might be. How far could they go and still remain safe? But perhaps that is an unnecessary question. When was the last time he had believed he could be safe in this world? He cannot remember.\n “Ask him if he can take us to Mars,” Pauline suggests. Cedric thinks to say that that would be impossible, of course. But he doesn’t say anything.\n Below them the city is still visible, and stretches to the horizon. The lights of it set fire to the night. He suspects they can be seen as far away, well, as far away as Mars.\n “We could stay up here forever,” she says, and kisses him, and it occurs to him he cannot remember the last time he was kissed.\n But no, he thinks, that simply isn’t true. Jules kissed him, and that had only been yesterday.\n “Ask him,” Pauline says. “Ask him if we can stay up here forever.”\n “But sweetheart,” he replies. “I think that’s actually what they want. We’re a lot less trouble for them if we never return.”\n “And does that even matter to you anymore?”\n He thinks about this and he thinks about this, and he can’t decide. Meanwhile the skimmer continues its upward path, to Mars or for wherever, or perhaps forever more.\n Steve Rasnic Tem is a past winner of the World Fantasy, Bram Stoker, and British Fantasy Awards. He has published over 430 short stories. Some of his best stories are collected in Figures Unseen: Selected Stories, published in April by Valancourt Books. The Mask Shop of Doctor Blaack, a middle-grade novel about Halloween, will appear this Fall from Hex Publishers. A handbook on writing, Yours To Tell: Dialogues on the Art & Practice of Writing, written with his late wife Melanie, appeared from Apex Books last year. Also appearing last year was his science fiction horror novel Ubo (Solaris Books), a finalist for the Bram Stoker Award."}