{"fingerprint": "eHCfNPYUJ5Vd/SldUn68V6jroEM=", "sitename": "Clarkesworld Magazine", "title": "The Rains on Mars by Natalia Theodoridou", "author": "Natalia Theodoridou", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/theodoridou_12_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Rains on Mars by Natalia Theodoridou", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4810 words, short story\nThe Rains on Mars\nMy shoulder hurts as if a handful of rusted nails have burrowed into my joint. Novak’s driving isn’t helping; the rover is jumping over the rough terrain, giving us all a good shake, especially the three of us sitting in the back. Ray and I are strapped in, but London is sprawled out, defying regulations, her helmet at her side, her breathing calm, as if she was born to live here, born to do this, never mind the terrain, the sky, the air.\nWe’re on our way out of the Valles Marineris main base, which means our own work stabilizing the central tubes will have to wait. But we go where we’re needed. It’s the base in Melas Chasma this time—the drilling team that works the Melas tunnel think there’s an ice plug in their way and they don’t have the expertise to drain it safely. If they’re not careful, the equipment might melt the ice and flood the tunnel or, worse, cause it to collapse, delaying the colony plans for months. That’s the kind of thing we’re for. Delicate work, the kind of work you need a good, level head on your shoulders to do well.\nAnother bump sends a jolt of pain down my arm, slicing me from shoulder to wrist. “Hey, Novak, take it easy!” I bark. London looks at me and laughs, her teeth the yellow of Martian sky. “What’s wrong, Mackintosh?” she asks. “Mars too much for ya? Need me to show you how to man up?”\nYulev reaches over from the co-driver’s seat and pokes Novak in the ribs. “He’s right, man,” he says, tender even in his reproach, his accent rolling over his consonants like a pebble drifting downstream. “The terrain is bumpy, but it’s not that bumpy.” None of that has any effect on Novak, who simply grunts and keeps steering the rover ahead like a pirate ship on rough seas.\nRay gives me one of their looks, the ones that make me think they’ve known me for years when I’ve only been here a few months. I can see their eyes behind the raised visor of their helmet, dark and full of concern. “Hang in there,” they say. “It’ll ease up as soon as we get to the forest.” They point out the window, and I can almost make out its wind turbines in the distance, silhouetted against the butterscotch sky, a white artificial forest, its trees fruiting with blades.\nI lean as close to the window as my helmet will allow. The sun is high, small, the land vast. I take it all in: the sinuous ridges, the ghosts of seas, the barren rock, the red, red dust. I let it steal my breath away for a moment. Is this what you wanted, brother? Would it have made you happy if you could see this?\nRay places their hand on my knee. The skintight suit numbs me to their touch, but I can still feel it somewhere far, far away. “What are you thinking of, Mac?” Ray asks.\nWhat am I thinking of?\nI’m thinking of the dry land that stretches out for miles and miles in front of me. I’m thinking of the rain, back home, ever falling, inescapable. I’m thinking of a body, left out on Mars’ surface, alone, taking forever to decompose.\nI say none of that.\n“Nothing,” I say instead. “Enjoying the view. That’s all.”\nOur team hasn’t been together that long, but we’ve already figured out our flow, a procedure that works for off-base call-outs, is efficient, and avoids any stepped-on toes. Ray, by far the most experienced one, an orphan raised by the State to lead teams just like this one, oversees the work and handles the extraction process from the surface. Novak helps them install the pipes, hauls around equipment, and drives the rover. London is in charge of the pump. Yulev and I work down in the tubes, manning the drill that will liquefy the ice, making and sealing the boreholes, installing the reservoir for the outflow to be collected. We’re a well-oiled machine.\nDown in the holes, Mars almost slips my mind. I imagine myself back on Earth in a hole much like this one, Robin working next to me, not talking, just being together, two brothers in the same underground womb, looking out for each other. The rock and the mud close in around me and I let go of everything, forget all about the surface. The hole is all there is. The Earth rumbles under my feet, saying, watch out all you want. You’re only guests here.\nYulev pulls my attention back to this hole, right now, his voice loud in my helmet comms. He’s talking about his kids again while sealing the hole for the outflow to be pumped through. He goes on and on about how he’s here just for a couple of years so he can make a good haul for his family back on Earth. I almost think he’s going to drop the sealant and whip out a couple of mugshots of his brats to show me.\n“Don’t you ever think about having kids, Mackintosh?” he asks.\n“Me? No,” I say. “I got myself snipped as soon as I could.”\n“What? No, man, why would you do that?” He gives me such a look of shock that now I’m really worried he’ll drop the equipment or do some sudden movement that will end with both of us engulfed in the icy embrace of a Martian flood.\nI shrug. My shoulder reminds me this was a foolish thing to do. “Every girlfriend I told seemed pretty happy about it, and the rest didn’t care either way.” I glance at him. “Besides, would you really want to see my ugly mug on a kid?”\n“No, you don’t know what you’re talking about, man, children are joy,” he says, his voice full of a dreamy ache that rubs on me like gravel. “No matter what shit’s going on over here, I know they’re out there, I know they’re safe, and my heart is full.”\nBack at Mariner base, we pass through the dust shower as quickly as we can, and then everyone rushes to their comms suites to check for messages from Earth. Yulev can barely hold it together every time his girls kiss the screen goodnight. We all love him for it—even as we pretend not to notice when he sobs into his pillow for a few minutes before going to sleep. London gets messages from her elderly mother once or twice a week. Even Novak the Brute has a family that cares enough to get in touch now and then.\nRay and I don’t bother checking. We go straight to our bunks in the dorm.\nI try to get out of my suit and wince as pain slices my shoulder joint like a red-hot knife going through butter. “God dammit. God bloody dammit.”\n“Here, let me help you with that,” Ray says. They come up to me and stand behind me. Their breath is hot on my neck as they gently peel the suit off me, its alloys maintaining the memory of my shape like a ghost, the afterthought of a body crumpling to the floor.\n“You need to get that shoulder of yours checked,” Ray says. “See about fixing it, or I’ll be in trouble.” They look me in the eyes. “How did you get that injury anyway? If it happened here, I need to know about it.” They try to sound professional, but something else, something caring seeps through. Perhaps that’s also part of their training. Be sensitive to discomfort, anticipate problems, save your team’s life. “You know, I’m responsible for stuff like that.”\nI point at the wall by their bed. “How come you don’t have any photos up there?” I ask. You’re such a poor conversationalist, brother, I almost hear Robin’s voice mock me. Can’t even get deflection right. “I mean, I know about your parents, but siblings? Friends? Someone special?”\n“You don’t either,” Ray says. I’m now entirely released from my suit, but Ray is still standing behind me close, too close, not close enough. I can feel the heat coming off their body, their face, their hands.\n“That’s not an answer,” I reply.\n“You didn’t answer me either,” they say. Their voice is soft and low, as if talking to a wounded animal. “About your shoulder.”\nI shake my head and say: “Nah, don’t worry about it, it’s an old injury. From a coal mine back home. Beam fell on it.” I rub the joint, laugh. “Must be the weather’s changing. Might rain.”\nThis is what I don’t say: Someone I owed a lot of money to twisted my arm behind my back and held it there while his buddies beat my brother to death in the middle of the street, right outside our house. It was raining that day, like every day. And my brother looked at me as they were killing him, not accusing, but as if to say It’s okay, brother. No sweat. I’m going willingly, brother, don’t cry.\nRay laughs, the sound edged with nerves. “Do you miss it, Earth? Do you ever think it was a mistake to come here?”\nI turn around to look at them, my bare torso almost touching theirs. “Is this genuine concern?” I snap. “Or are you running another one of those psych evaluations the bosses have you do?”\n“Mac . . . ” they start, but I cut them off.\nToo close.\n“What is it you want to know exactly? All these little questions all these months, all casual like, do you think I don’t notice? This is the story: I didn’t have much going for me on Earth, saw the posters one night, might have been wasted, I don’t recall, you know the ones, MARS NEEDS YOU, finger pointing right at your chest and so forth. Seemed like a good idea at the time. Spoke to the heart and the pocket. What more is there to ask for, right? Signed up.” Ran from the rain. Tried to live out Robin’s dream of Mars. “Here I am. That’s all there is to it. Nothing to go back to.”\n“Mac, I’m sorry, I didn’t mean . . . ” Ray starts again, but I raise my hand and back away from them, their skin, their concern.\nI’m not here for this. I don’t get to have this.\nI pull on a Tee and some shorts and run away, through the dorms, to the lounge, to the exit shaft, my skin crawling, my eyes stinging. I stand next to the surface monitor. The sun is coming down, has almost set, yellow on yellow, haloed with blue, not a cloud in sight. Is this what you dreamed of, brother? The only place it never rains.\nAnd yet. All I can see. All I can think.\nI try to apologize the next morning as we’re heading for the tunnels, but Ray smiles and tells me not to worry about it.\nWe’re working on the main base today, taking care of stretches with too many structural problems for the boring machines to deal with, so we head straight to our tubes. One day, all the tunnels, the Mariner base, the Melas, the Eos, will be connected, minimizing surface exposure for everyone in the colony. An underground city burrowed in Mars’ belly, or that’s what they tell us anyway. Some rich guy’s dream, sure, but something worth dreaming of ourselves, something worth working for, a change, a future.\nWe walk from our base to the intersection where we’ll split up, me, Yulev, and London to one tube, Novak and Ray to another. No need to climb to the surface today, maybe not even for a long time, unless they hit another iffy patch at one of the smaller bases. I surprise myself, catch me wishing for some incident that would force the regolith to spit me out, as if my body aches to ascend to the surface, my skin hungering for the rusty sky, the crushing void. That won’t do. Not today. Not ever. I shrug it off.\nRay is walking next to me, our shoulders almost touching, and I have this lump in my throat, a tangle of words hard enough to choke me. I cough. The lump won’t budge. But words come easy to Ray, and I always think I don’t know how they do it, even though every time it’s as simple as asking: “What are you thinking, Mac?”\nI flex my arms like an ape. “I’m itching to drill some good holes today,” I try to joke. I sound too much like Novak. More than I intended anyway.\nI don’t say: I think of the sounds of the tunnels back on Earth, the men covered in coal dust, my brother breathing with the voice of the mine. And for some reason that makes me think of the men in my old gym, all razor eyes and clad in steel, pumping hard, sweating toxic, then weeping in the bathrooms when the hot water ever so slightly softened their skin.\nRay shakes their head disapprovingly even as they chuckle at my sorry attempt at bravado. We’re almost at the intersection. They squeeze my shoulder, the one that doesn’t hurt. “Have fun down there today, yeah?” they say. They don’t say: Be careful.\nI nod. “Always.” We part ways.\nYulev walks ahead, mapping the area we need to secure. I follow with the drill perched on my shoulder and London brings up the rear lugging the support rods and stabilizing material.\nWe set up the rods and Yulev gives me the go-ahead. He flashes me the reading with the recommended drill depth and I start drilling carefully into the sidewalls, shallow borehole after shallow borehole, making a sieve for the stabilizing material to be injected into the arch of the tunnel. My shoulder stabs me with short, regular bursts of pain, but I don’t care. I let myself be lost in that rhythm, the ebb and flow of hurt. Savor it.\nThen I notice the liquid running down my visor, clear as raindrops. “What the hell?” I mutter.\n“What’s up?” Yulev asks, his voice far away.\nI disengage one hand from the drill to wipe the liquid away, and then I see that there is water coming down all over us, Yulev and London both drenched in rain, water pooling by our feet, dousing our machines, our suits. It’s raining in the tunnel. It’s fucking raining in the tunnel.\n“Are you seeing this?” I ask Yulev, my voice frantic and a little shrill, but he seems confused, like he doesn’t understand, like he can’t see or doesn’t care about this freaky, impossible rain.\n“What are you doing, man?” he asks back, suddenly alarmed. He flashes another reading at me, and I can’t even see it through my rain-streaked visor but I know I’ve drilled past the safety depth. “What are you doing?” Yulev asks again. His voice is tinted with panic.\n“For fuck’s sake, stop!” London shouts.\nCold sweat breaks all over my body as I look up to face the drill that’s still going. I feel the stone give, the crack expand.\nI step away. I should have stopped sooner. Should have felt the fault in the stone. Should have warned them. I yell at them to move, but it’s too late. The crack radiates all the way to the other side, blooming over Yulev’s head. The support rods are not enough to contain that kind of damage. The right side of the tunnel collapses. Yulev is there one moment and the next he’s gone, buried under a pile of rock.\nLondon grabs me from behind and pulls me back, clear of the rubble. “What the fuck did you do?” she screams at me. She drops me to the floor and starts pulling at the rubble, fighting to get to Yulev. We can hear him breathing through the comms.\nIt’s still raining when Ray’s voice spills over our comms channel, ordering us to evacuate the tunnel before it comes down on the rest of us. The crack I hit has reached all the way to the surface.\nI have to tear London from the rubble. We fall back. Leave Yulev behind, all alone, his comms silent now. Can’t even hear his breath.\nAs we make our way back, I think of the surface again. I’m standing on top of some peak, a volcano as old as the world, overlooking everything, and above it and above me a great, red, dusty rain that consumes us all.\nThe medics give us a quick but thorough check and discharge us in under thirty minutes. Both London and I are fine. Ray meets us in the lounge to tell us what we already know. Yulev’s gone. They’re sending an extraction team to retrieve his body as we speak.\nI look at my hands, wet with water. I look around me, at the pouring rain. The entire base is drenched. The tables, the chairs, the monitors, Ray. Their hair is wet, raindrops running down their face and they don’t even notice it.\n“Are you okay, Mac?” they ask.\nIt must be their tone that sets London off. “Are you serious, Ray?” she shouts. “This motherfucker was acting like an idiot and now Yulev is dead and you’re asking him if he’s okay? I sure hope he’s not!” She moves towards me and grabs me by the neckhole of my Tee. “I’ll fucking kill you for this, you incompetent piece of shit,” she breathes on my face.\nNovak takes a few steps forward but doesn’t try to stop her, like he hasn’t quite made up his mind about where he stands on all of this.\n“London,” Ray says, their voice calm but firm. They come between us, put a steady hand on London’s back until she releases me. “Leave us, please,” Ray says. “Let me do my job.”\nLondon turns to look at Ray in the eyes. “Will you, though?” She scoffs. “Soft spots notwithstanding?”\n“London, please,” is all Ray needs to say.\nAs soon as she and Novak are gone, Ray takes my hand and sits me on the lounger.\nI keep my eyes on the surface monitor, on the rain raging outside, soaking the land, a private thunderstorm just for me, flooding the world, flattening it and me and us and you, red mud indifferent to your hurt, your death, your mistakes.\n“What happened back there, Mac?” Ray asks. “Was there anything wrong with the equipment, or the readings? Did something distract you?”\nI shake my head, hide my face in my palms, the rain coming down, relentless, unstoppable, cold as ever.\n“I can’t help you if you don’t tell me what’s wrong, Mac.”\nDo I tell them? Do I tell them how their face looks streaked with the rains of Mars?\nI look at the monitor again, the indifferent land, the cold mud.\n“What’s going to happen to Yulev?” I ask.\nRay hesitates. “We’ll cremate his body,” they say after a few moments.\nWe should leave him out there, to this land that doesn’t care enough to break your body apart. We shouldn’t send ashes back to his children.\nRay looks at me sharply. “What did you say?” they ask.\nDid I say that out loud?\n“I’m sorry,” I say. I ran from the rain. Didn’t escape. Dead boys’ dreams don’t change a thing. “I’m so sorry.”\nLondon and Novak come for me the same night, after Yulev’s body is incinerated and packaged for transit on the next shuttle back to Earth. They don’t say a word. I am lying in my bunk, my mattress soaking wet, the rain falling on my closed eyes. No matter what I do, the rain will keep falling. I open my mouth and can feel the rainwater on my lips, my tongue, running down my throat, speaking the cold of Mars. Give up, it says. It’s all right. Nothing matters.\nI keep my eyes shut when Novak grabs me and drags me to the middle of the room. I do not resist. No struggle. Not anymore. Struggle is only for the ones who should go on. London holds me upright, twisting both my arms behind my back, as if she needs to, as if I’m going to put up a fight. I feel my shoulders pop in London’s steel grip as Novak punches me in the face, the chest, the stomach. I can’t help but try to double over, the taste of blood on my tongue, a little burned and a little metallic, like what that astronaut said space smells like once, back when guys like him were a rarity, back when nobody had died on Mars. I open my eyes. London unfolds me again and punches the small of my back, my legs, my ribs. My knees buckle. Novak’s skin glistens with rain. Is Ray here? I’m afraid to look. Are they watching this? Trying to decide whether they should stop it, or whether I deserve it?\nWhen Novak gets tired of beating me, he collapses on the floor, exhausted. London gives me one last kick and leans against the wall, spent, finally allowing me to fall. I find myself on top of Novak, in his arms, an almost-embrace. We are both panting, rainwater pooling around us. My shoulder hurts. Everything hurts. I feel Novak’s chest rising and falling. I think of the indifferent land. So much hurt and none of it matters. Rain is running down Novak’s cheeks. I reach up and touch his face and I want to tell him, don’t cry. Mars doesn’t care, brother, don’t cry.\nI never find out if there are consequences to what London and Novak did to me, but I hope there aren’t. They let me recover in the infirmary. I have my own room. Is that for my protection, I wonder? Did the other teams hear of what I did, what I caused, and are itching to get their hands on me too? Is Ray standing guard outside, trying to stop them from getting to me?\nThe rain here starts and stops, irregular like the beating of my heart, the antiseptic smell of the room overwhelmed by the scent of damp soil. I drift in and out of consciousness. I think of volcanoes, crevasses, seas past, resurrected, canals filled with rain.\nOne time, I see Ray standing over my bed. “What are you thinking of, Mac?” I think they say, but maybe they don’t say anything at all.\nI answer anyway.\nI’m thinking of my own father, who was the kind of person that could weep because of a verse he read and which made him feel like a child nobody loved, or like the world was too much, too violent, too loud, too joyous, just all too much.\nAnd I’m thinking of how many places in the universe there still are where nobody has ever died yet and of how fortunate this makes us, but only us, the childless ones holding the ghosts of our children by the hand, safely unborn, and of how unfortunate it makes everyone else, how much untapped opportunity for pain the universe still holds.\nAnd I’m not thinking of Yulev’s children, or of their father’s ashes in a box.\nWhen I open my eyes again, Ray’s gone.\nThe next time I see Ray, I’m discharged and back in my bunk. They knock on the door lightly before walking into the room, even though they don’t have to.\nThey come to tell me I’m off the team, off the mission. London blamed me and my incompetence in her statement and the company didn’t ask any more questions because that meant they’re not liable. And I am to blame, aren’t I?\nI’m to be sent back to Earth. On my own dime, too. Only fair. To do what? Ray can’t answer that, and neither can I, because who knows, and who cares.\nRay sits next to me on the bed and takes my hands in their own. Their skin is cold and wet.\n“I’m so sorry, Mac,” they say.\n“It’s okay,” I whisper.\nThey lean over and kiss my lips so lightly it really feels like goodbye.\nI cup their face. Rain sliding down their hair, their cheeks, over my fingers.\n“You’re crying,” they say.\nAm I?\nNo, it’s just the way the rain hits me, you see? Like this.\nThe rain stops falling as soon as the shuttle takes off, but I can still feel it on the inside of my skin, pooling, flooding the gaps within.\nNobody talks to me for the entire trip. Ten days, fifteen, twenty-five. Almost there now. I don’t think of Yulev’s ashes on the ship with me. I think of Robin when we were little and the Mars project was just starting. We sat on the roof on a clear night when it wasn’t raining and he looked up at the little red dot in the sky and said he would like to die there one day. I punched him because I thought he said he wanted to die. I was never one for nuance. I imagine Robin on the ship with me, looking back at Earth this time. Time to let go of the red now, brother, he says, get on board with the blue. Then I forget how to speak for a while.\nMy shoulder hurts. The rains don’t come back.\nOn Earth, I realize there’s no need for me to go back to where I came from, so I pick a mining town in the south, dry as a stone, no cloud in the sky, days blue as they come.\nI use what’s left of my small Martian salary to pay for a cheap motel and I make that my home, sparse and unremarkable in every way but its stubbornness to still feel not-lived-in, foreign, no matter how long I live in it. I even have a window I refuse to look out of.\nUsing my credit means the people I owe probably know I’m back. They might look for me, eventually, or they might not, might figure they’ve already taken away enough for me to turn on my heels and flee the planet. Don’t know, don’t really care. Let them come. There’s space for everyone over here on this side of the void.\nI meet my neighbors at the motel. They change every week or so. I remember how to speak again. I tell everyone I was a miner on Mars. That I got my brother killed, and then I got someone’s father killed because I thought I’d escaped even as I couldn’t let go. None of my neighbors are very impressed, but a few ask if I brought any red dust from Mars back with me. “Only the one in my lungs,” I say, and they laugh. I try to show them, bare my chest, claw at my skin. The company didn’t let me keep my suit, otherwise I’d show them that too. I finally don’t cry, brother, I don’t.\nSooner or later I’ll get a job in the mines here, but not yet. My face is healing nicely and my ribs hurt only when I breathe. The shoulder sometimes turns an angry red. It glows in the dark, like a planet.\nA month passes, two months, three. I buy a battered old laptop and set it up on the single table in the room.\nThere’s a message from Ray on my work account. It’s a minor miracle it hasn’t been deactivated yet.\nRay talks about the mission, about London and Novak, who are still raw from what happened but apparently found love when they joined fists over my bleeding jaw. There are two new members on the team, one lad, one girl, so far so good, but they can’t carry the drill like I did. Ray pauses at that, realizing what they said, no need to say more.\n“Are you doing okay?” they ask instead. “I’m thinking of you.” They pause, a finger tracing a ghost around their lips. There’s nothing else to say, so they close with: “What are you thinking of, Mac?”\nThe message ends.\nThe room is dark.\nWhat am I thinking of?\nI look into the camera and hit record.\nI used to have all these thoughts. I used to play the scene in my head, think of what I could have said to change things, what I could have done differently. Used to think of breaking things, fixing things. But all that’s over now. There are some planets you can never flee.\n“My heart is light, Ray,” I say into the microphone. So everything is simple now. “Be happy.”\nNow I think only of the rains on Mars.\nNatalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter."}