{"fingerprint": "6Y2xuvWd/iyHVtP2YYBnr/CIPYk=", "sitename": "Clarkesworld Magazine", "title": "To Set at Twilight In a Land of Reeds by Natalia Theodoridou", "author": "Natalia Theodoridou", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/theodoridou_10_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: To Set at Twilight In a Land of Reeds by Natalia Theodoridou", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3730 words, short story\n To Set at Twilight In a Land of Reeds\n The train ride takes long, longer than I’m used to traveling lately. The city has its own sense of distance, underground or glass-clad and stainless steeled. Entertainment drones at you from above, eating up idle time. No thought left unclaimed.\n Here, we zip through vast, open spaces. The landscape is a blur of burnt sienna and muted cypress green, nothing like the grays and neons of the city. But the biggest change is above. There’s no SkyVu here, so the firmament is just what it is, blank air, nothing. Thoughts galore. The sky is a made-up thing.\n No one else shares my carriage. Who even visits the countryside by train these days? Lena used to wonder at the fact that they still run a semi-regular service. Or maybe I just keep strange hours, strange habits. No matter; I savor the silence.\n Idly, my hand brushes my luggage. The old synthetic skin rests folded neatly inside. My own skin matches it: wrinkled, liver-spotted. I think of Margarita.\n I see the harvester robots first, far away, their long limbs swinging blades above the crops, their bulky cube-shaped bodies like something out of an anime from bygone eras. Margarita is with them, supervising or keeping them company, who can tell? From the distance, they look like toys.\n On foot now, my pace settles into something one might call leisurely. I haven’t felt myself move like that in a while. Since Lena, for sure. It’s the countryside’s doing. The wideness of it, the tall skies. It has a way of slowing you down, making a small thing of even a seven-foot robot with scythes for hands. Your meager meat-and-bone body doesn’t even compare.\n It’s not long before Margarita spots me: I can tell from the way her back straightens, her shoulders tense. She relaxes as soon as she recognizes my gait—though, if I could see myself from the outside now, with my long flowing skirt and my leisure and my country hat, would I have recognized me?\n She raises her arm and waves, starts walking with long strides to meet me on the road.\n “You came early,” she says instead of a greeting.\n It’s not an accusation, just an observation, but I feel the need to come up with an excuse anyway. For running away from that which cannot be escaped. I carry Lena, still. I can feel her weight on me, as real as the weight of the luggage in my hand. “I took some time off,” I say. “I thought why not spend it with my favorite—” person “—friend?”\n If she notices the hitch, she doesn’t comment.\n I have a better view of the harvesters now, with their big, staring eyes, their innocent eyebrow-shades, meant to pluck your heartstrings. To the right, a barrel-bodied robot with soft tubes for legs is ambling toward the stream in clumsy, gangling steps, carrying buckets. Margarita follows my gaze and we watch the robot for a while as it fills its buckets in silence. Her face lacks expression.\n “We had some ideas, didn’t we,” I say.\n “Yeah,” she says. “You sure did.”\n She presses a button on her wrist monitor and then puts two fingers into her mouth and whistles. The harvesters come to a stop immediately; turn their heads toward us in unison. If they weren’t so damn cute, they would be creepy as fuck.\n “Come on, boys!” she shouts. Then, to me: “Let’s put them to bed.”\n By the time the harvesters have made it to the barn, the sun has almost set. Up close, the robots are even more towering than I had remembered, but their slow bulk and tin heads make it easy to dismiss anything menacing, dangerous. Scythes and all.\n The robots arrange themselves in a circle on the dirt-covered floor, leaving space for Margarita, and, I realize, myself, without being instructed to do so. Margarita sits down cross-legged and pats the dirt next to her, so I follow her lead.\n The robots wait, imitating breathing, slow and creaking. They peer at her eagerly with their huge eyes, their mechanical jaws slack, mouth-slits half open.\n “There was a star, once upon a time,” Margarita begins the story, “that set at twilight on a land of reeds. It walked barefoot in the mud and wondered at every little thing: the chill on its face, the flow of the river, the song of the trees . . . It was lonely and it was sad, for there was no other in the world just like it, no one that knew the sky the same way it did.”\n Margarita pauses and wets her lips, even though she doesn’t need to.\n The robots purr and coo, pleased as cats, and continue listening to the story until their timers say they should feign falling asleep.\n “It walked and walked until it found a village, and in it, a villager. The villager saw the star walking naked among the trees and called out to it. He decided the star was a young woman. She needed to be clothed and fed and taught the ways of humans. He married the star, and the star, ignorant of its own heart, did not object. It bore the villager’s children—all boys with strong limbs and faces that shone in the dark. At night, it went out. It walked through the village until it reached the river. There, it sat in the mud and looked at the sky and all the stars. But never, not one did set again at twilight in this land of reeds.”\n The story done and the robots powered down safely in the barn, we sit at her kitchen table and Margarita puts the kettle on. She doesn’t drink, but she knows I like tea in the evening, strong and bitter. Lena liked hers sweet, so sweet it turned thick, like molasses. We used to drink our tea while staring out the window at the electric sky of the city, women smiling above us, white-teethed, fake skin pixel-perfect, untouchable.\n I can’t breathe.\n “Do you tell them stories every night?” I ask, if only to make sure I can still expel air from my mouth.\n “I’m running out of new ones.”\n “Why do you do it?”\n She shrugs, but the sideways glance she gives me does not escape me. “It makes them happy.”\n I let it go. “I got the parts you asked me for.”\n “The skin, too?”\n “Yes.” I look at her, now. A mind that’s a hundred years old, and skin still smooth as alabaster. I wonder what that must be like.\n We met at a rave, before the conservation act, before I was Margarita’s maintenance person, back when all our skin was young. Lena hooked up with Margarita and I watched. It was fun. They kept seeing each other without me for a few years after that. It eased off slowly as I volunteered to take over Margarita’s maintenance. We were all happy.\n I’m staring. Must stop. “Couldn’t find a replacement for your heat regulator, though. I’m sorry.”\n “Ah.” She sighs. “Well, what can you do.”\n She pours the hot water over a tea bag and I wrap my hands around the cup too quickly, burning my skin.\n “How long are you staying?” she asks.\n “Not long,” I reply. “Just a few days.” I pause, hesitate. “And, Margarita . . . ”\n She turns to look at me. “Yes?”\n “This is the last time I do your maintenance. Here.” I beam her the information of the new maintenance guy. “This is the contact info for the new contractor. He’s agreed to come out from the city every three months.” Her face remains painstakingly expressionless. “There’s an emergency number to call, if you need anything urgently.” If you break.\n “Is it because you’re sad?”\n I inhale sharply, then let the air out slowly. Lena, again and always. It’s like a stab wound, this pain. What I imagine a stab wound would feel like. “How did you know?”\n “Why are you sad, Dora?”\n My hands shake, so I wrap them more tightly around the cup. “Lena. She was . . . She passed.”\n Margarita does not respond for a few moments. I wonder what happens in her mind. Then she leans across the table and touches my hand lightly. Her skin is freezing. “I’m sorry,” she says. It sounds genuine.\n “We had a good life,” I say. I think of saying, she loved you. Loved us both, but I don’t. I’m not that bighearted.\n “Yes.”\n I finish my tea while it’s still scalding hot. It leaves a tingling in my throat.\n “Let’s get you fixed up,” I say, standing up.\n “Ah, yes,” she says, as if she’s forgotten. She hasn’t. “The conservationist has to be conserved.”\n We go into the lab at the back of the cabin.\n Margarita climbs onto the examination bed and opens up her chest compartment for me. I run the diagnostics and make small adjustments, then replace a few corroded nerve endings. So far so good. I can see the heat regulator—it’s fried through and through, but they don’t make her model anymore, and I couldn’t come up with a work-around. Maybe the new guy will have better luck.\n “Now for the fiddly part,” I say.\n Margarita observes me as I peel off her skin. Her eyes are completely still—perhaps the thing that will always give her away, that will always mark her as not-quite-human. Not the fact that she doesn’t need to breathe unless she chooses to, but this unflinching holding of your gaze.\n I fold up her used skin and put it away for storage, then dig out the aged skin from my bag. Margarita runs her metallic fingers over it, traces the wrinkles and moles.\n “How does it feel?” I ask.\n She takes some time to respond, but then she says: “Perfect.”\n I start from her head and move downward, wrapping her in her new skin as I go. Her body is giving off heat now, like a furnace. I wonder what Lena felt like when she ran her hands over Margarita’s skin.\n I wipe sweat from my forehead before it drips into my eyes and keep going.\n “Were you thinking of ending your life?” Margarita asks as I layer skin over her chest.\n For some reason, the question does not catch me by surprise, and so I don’t get the urge to lie. “Yes.”\n “But you won’t?”\n “No. I won’t.” I glance at her eyes, then back at my work. “Have you ever thought of doing that, Margarita?”\n “I have, yes.”\n “What kept you?”\n “Caring for another is reason enough to go on,” she says, and I’m sure the irony is not lost on her. She motions vaguely in the direction of the barn. “I had to stay here to care for them.”\n “But that doesn’t answer the big questions.” I pause. “Why do we keep going? Is life worth living? Et cetera. It just postpones them. Defers them to someone else.”\n “Perhaps,” Margarita says. “But life doesn’t care about your questions. It only cares about going on.”\n I wonder if the harvesters care about the big questions. We made them sentient because we thought it was cute, and we pretended it was because it would make them better at their job. Margarita, too, and others like her. For a while, it did. Not for long. Eventually, it made them miserable. We should have known that, should have seen it coming: making things smart enough to ask questions about life, but unable to find any answers. A perfect trap of existential agony. We’re not engineers. We’re tragedians.\n “I need a favor,” Margarita says as I’m applying skin around her calves.\n “Yes?”\n “There’s something that needs fixing in the woods. A wind turbine. It takes two and none of the robots have the required dexterity to help me.” She pauses, looking at me. “They understand what needs to be done, but they lack the skill to do it.”\n “Of course,” I say. “I’ll help.”\n I finish my work in silence.\n The robots find it hard to let go of Margarita the next morning, trapping her backpack between pincers and holding onto her hand with a gentleness that machines of this size and strength shouldn’t be capable of. Margarita reassures them with whispered words and soft but sure pats on their bulky metal bodies.\n We set off on foot into the dawn haze that still lingers over the plane, dew dampening the legs of our trousers. It’s an hour’s walk to the edge of the woods, then another hour or so before we start our climb in earnest. The wind turbine is at the top of the mountain—a rocky path lined with pine trees. We should be at the site by sunset, camp for the night, start the repair in the morning. Margarita has already moved the crane to the top—how she got it up there, I have no idea. On the third day, we’ll head back down.\n We walk in silence, Margarita in front, me in tow. Our skins are a match now, two women in their sixties, fit for their age. But her body is robust as no human woman’s, her gait too regular, her posture too sure. I can already feel the fatigue setting in mine, but she shows no sign of it. Does she ever get tired?\n What does it feel like, to be indestructible?\n She’s not, though. She wouldn’t need me, if she were.\n “Nobody from the village could help you with this?” I ask as we walk, if only to fill the silence.\n “They don’t come out here anymore. They don’t like them.” She pauses. “Us. Stealing their jobs. Being better at them than they are.”\n “Right. Of course.” Living in the city, sometimes I forget what things are like in the countryside. People see things differently here. Nature, humanity, the sky.\n The forest thickens around us. I stop walking for a moment, close my eyes, breathe in the resiny smell of the trees. Catch my breath. The air is cool on my eyelids. Could I live here, under this empty sky?\n I can hear water flowing nearby.\n Margarita stops walking, turns. “Are you all right?” she asks, her voice morphed around concern so genuine-sounding I can’t tell if it’s real or programmed. Then again, is there a difference?\n I start walking. “Fine.”\n We carry on.\n We reach the top at dusk. The wind turbine’s tower rises and rises, a colossus under the colossal sky. The rotor lies on the ground like a dismembered pinwheel. A giant’s toy.\n “Here we are,” Margarita says. She unlocks a container that’s placed next to the rotor and unpacks our tent. I’m thankful we didn’t need to carry any supplies with us—my knees are complaining loudly, and they didn’t need to haul anything but my body up the mountain. “Tomorrow, you’ll help me get the rotor up and set it on. I’ll be the eyes, you’ll be the fingers on the ground.”\n When I open my mouth to protest, she raises her hands. “Don’t worry. The crane’s controls are completely intuitive. It will be very easy for you.”\n She says it in an almost accusatory way that strips me clean of any will to protest. “OK,” I say.\n She points at the container. “There are energy bars in there. Help yourself.” Then, she starts setting up our tent. She doesn’t need it, because she needs no sleep. This is entirely for my benefit.\n When she’s done, we sit at the tent’s threshold together. She’s gazing up at the sky while I chew on my sustenance. It tastes artificially sweet and herby.\n “The robots are worried about you, you know,” Margarita says into the night. Her eyes are still fixed on the same spot in the sky, whatever it is she’s looking at. I look up instinctively, can see nothing. Only a dark expanse, shrouded with clouds.\n “Me? Why?” When did they tell you? I almost ask. Do they talk to you behind my back? It’s an irrational thought.\n “They believe your thought machine is broken.”\n My thought machine. “Do you think so?”\n Margarita lets a few moments pass before speaking. “No,” she says finally. “Not your thought machine.” Then she turns toward me and places her hand on my chest. “This machine, yes.” A silly, sentimental metaphor. We both know it.\n Lena.\n That night, I dream myself transparent. I stand on the top of a mountain and look down at my see-through chest. Inside, my heart is a train engine, huffing smoke and dripping oil all over my lungs.\n What a mess.\n Watching the giant pinwheel hover above me is an unnerving experience, but the job itself is as easy as Margarita promised. Margarita gives me instructions through the comms and I guide the crane through tiny maneuvers that translate into a delicate dance in the air. It’s glacial and beautiful.\n We’re in the middle of the job when I hear a beep and then Margarita says, “No. Oh no.”\n Panic sears through me. “What did I do?”\n A slight pause, then: “Nothing. Nothing. It’s not you, Dora.” Another pause. The sun is setting in the distance. “Let’s finish up here.”\n As soon as the attachment of the rotor is complete, Margarita makes her way back to the ground. It’s dark around us now, but her eyes are shiny.\n I reach out and touch her hand. Her skin is burning up. If she could sweat, she would be drenched. “What happened?” I ask.\n “An accident. One of the harvesters miscalculated, struck a tree. It collapsed on top of it.”\n “Is it going to be all right?” Then: “Can I fix it?”\n Margarita stares at me a moment too long, as if I just said something outlandish. As if I suggested raising the dead. “No,” she says. “It’s gone.”\n “I’m sorry,” I say. For your loss.\n She looks around, then at the sky.\n “Do you want to go back tonight?” I ask.\n “No. It’s too dangerous for you,” she says. My soft flesh, a hindrance. “We’ll go at first light.”\n The other robots are gathered in a circle around the harvester when we get there. They’re standing still, but something in their stance suggests living things in mourning. A vigil.\n Margarita approaches, stiff-backed. I linger a few paces away, like a distant relative who happened upon a family tragedy. The robots turn toward her then, all together. They reach for her hands, for her clothes, for her hair. She touches them back, head bowed.\n We hold a funeral, later. There’s no other way to call it, no other word for it. They carry their fallen friend to the barn, then stand around it in silence.\n Margarita’s skin is freezing next to mine. “It was the last of its model, you know,” she says.\n We watch the robots break down the harvester and each one takes a part—a pincer, a metal plate, a receptor—and solders it onto their body with a soldering iron that they pass around the circle. They’ve done this before, I realize. I see the odd bits and pieces that cover their bodies, now, remnants of worlds and lives gone for good.\n What have we done? I want to ask.\n I think of rhinos. I think of leopards and polar bears.\n Why do we lament the extinction of species? And does that extend to the ones we create?\n I stay silent.\n When almost nothing remains from the harvester, the robots disperse and we go back into the house. Margarita continues to freeze through the night, until finally I invite her to join me in my bed. I wrap her into a blanket burrito and cuddle her, pouring as much of my own body heat as I can into her. Slowly, slowly, she warms up.\n “Do you miss Lena?” she asks me, her eyes looking away from me in the dark.\n “Of course I do.”\n I can see Lena now, lying in bed facing me, sleeping. I can hear her voice, reading me something from her book. I see her back as she stands staring out our kitchen window, the tap running.\n I used to get angry about that. Lately, I’ve been doing it, too, my mind on what it was that got her so distracted. I asked her, once, and all she gave me in response was this wide motion toward the city, the sky, everything. Everything, all the time, at once.\n I study Margarita now, her eyes, her lips. Present. Grounding. Can I feel what they felt together?\n I lean close, lips parted, but Margarita stops me with a hand to the chest, freed from the blankets. “I can’t give you what you’re looking for,” she says.\n She’s right, of course. Maybe my thought machine is broken, after all.\n “Tell me a story,” I say. “Tell me the one about the star again.”\n Margarita nods. “There was a star, once upon a time,” she recites softly, “that set at twilight in a land of reeds.” She tells the story of its barefoot walking through the mud, the wondering at every little thing. Its loneliness and its sadness. The villager who tried to make of it something it wasn’t. The waiting.\n “It was one of a kind,” I say when Margarita finishes the story.\n “Yes,” she replies. She wraps her arms around herself under the blanket. “Aren’t we all?”\n As I drift off, I think: am I one of a kind?\n Were Lena and I a species? Are we going extinct?\n I sink into a cold, damp sleep, without dreams.\n The next day, I depart.\n I tell Margarita I’m heading back to the city. I doubt she’s fooled though—she can see so much farther and clearer than a human, after all. And yet, I leave them behind: Margarita, the harvesters, the questions they bear for us all.\n As soon as I reach the main road, I turn away from the city and toward the woods instead. I follow the direction we took when we made our way to the turbine, until I hear the running water again. Then, I follow the sound.\n It’s a river. Narrower than I imagined, but the water is crystal clear. It looks deep. Long stalks line the bank.\n I shed my shoes and let my toes sink into the cool mud.\n I raise my eyes to the sky and, in this land of reeds, I wait.\n Natalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter."}