{"fingerprint": "QxefFI4WWDVuXcNLixEsu7wL1kw=", "sitename": "Clarkesworld Magazine", "title": "The Last Eagle by Natalia Theodoridou", "author": "Natalia Theodoridou", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/theodoridou_04_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Last Eagle by Natalia Theodoridou", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6200 words, short story\n The Last Eagle\n “For a city boy, you are terrible in crowds,” Beatrice used to say, and she wasn’t wrong exactly, but it was never the crowds that were the problem. It was the open spaces. The too-muchness of air, of movement, of sound. Even here, I catch myself making my body small, as small as possible. The plaza is nearly empty—this is only a village, after all—and yet I feel exposed, worried about the boundlessness of sky, like something up above has been broken open. At least the day is overcast, the clouds low. I find that comforting, somehow. There is a chill in the air.\n I see someone walking fast towards me, their step sure, as if they’ve recognized me. A young-man-shaped person, lean and wiry. A full head taller than me, which is hardly a surprise. Sunburned skin and high cheekbones, dark hair down to their ears, arms chiseled and bare, despite the chill.\n They extend an arm to greet me. “You must be Lucia’s cousin!” they say. “My name is João. He/him. I’m your promised guide.”\n “Fabiano,” I say. It still feels good. “He/him.” I press my hand into his awkwardly, as if I’ve forgotten how to shake.\n “Your hands are cold, Fabiano,” he says and smiles with his eyes.\n He leads me to the village’s only guesthouse, where we’ll spend the night. There is nothing to do here—this village, like every other village in the region, was mostly abandoned sometime during the war, the majority of its inhabitants either dead or vanished—so we sit in our host’s kitchen, next to the stove. She places black coffee and flatbreads in front of us and retreats to a room in the back, separated from the kitchen with strings of beads hanging in a doorless frame.\n I am told that we need to start early the next morning, if we want to be at the next village before dark. “That’s where you say your friend was last seen, correct?” João asks me, his mouth half-full of bread.\n “Yes,” I say. I take a sip of coffee. Its bitterness bites my throat.\n “What was her name again?”\n “Beatrice.” We picked it together. It took us weeks. I kept coming up with lists upon lists, mostly baby name ideas I pulled off the Internet, but she didn’t like any of them. Said it felt weird to have a name; she’d never had one before. Then I showed her a painting by Dante Gabriel Rossetti and she asked me what that redheaded woman’s name was, and that was it. She never told me what it was about her that stuck, and I knew better than to ask.\n João nods. He eats and drinks quietly for a while. His face, illuminated only by the light of the stove, reminds me of that same painting. Golden and warm, like a proper pre-Raphaelite.\n “We should sleep,” he says then, and warns me again about our early start the next morning.\n My room is Spartan: a thin-mattressed bed, a stool with a shallow basin filled with water, a small mirror nailed to the limewashed wall. I avoid my reflection and turn off the lamp.\n I wrap the itchy blanket around myself and shiver in the dark. Sleep escapes me for hours. I think of Beatrice, of the hole in the side of her neck and the first time she showed it to me. I can still feel the weight of her key in my palm. She told me she was ashamed. And I got it, even as I wished I didn’t. I wished I could tell her there was nothing to be ashamed of, but I wasn’t quite there yet myself, back then.\n Am I now?\n I close my eyes to the darkness and think of open spaces, the dread of them putting the question to rest.\n I wake up frozen. The cold has seeped through the walls overnight and settled on me like a shroud. I shake my body awake enough to give myself my injection and then shave the peach fuzz on my face. I do it slowly, carefully, my little biweekly ritual. I cherish the feeling of the shaving foam on my jawline, my cheeks, my chin, then the pressure of the razor against my skin. I spare only the tiny black hairs on my upper lip. They make me look like a teenage boy, but I don’t care. I love them. I remember the shock that ran through me the first time I realized I loved something about my body. The radical newness of it enough to break the world apart, then put it back together again.\n João, full of warnings, has informed me that the hike to Castelalbano will be demanding and will take most of the day. I hesitate briefly before putting on my binder, but I can’t bring myself to go out without it. Much worse than walking out the door naked, it would be like going out without my skin. So that settles it, I guess.\n He greets me in the kitchen, his wide smile and his dark eyes bright and alert, as if he’s thrilled to be up at the crack of dawn and looking forward to a day of walking in the freezing cold. “Fabiano!” he exclaims and points at a small mound of freshly-baked flatbreads and another cup of that coffee, no doubt as bitter as last night’s. “Eat, drink,” he orders. “We have a difficult day ahead.” He beams at our host, who’s stuffing wood into the stove. “And we might not enjoy such hospitality again for some time.”\n “Really?” I ask, and it comes out more sarcastic than I intended. I would not be surprised if I found out later that our host had taken terrible offense. I’m not usually like this. I feel my cheeks burn.\n João laughs. “The people of Castelalbano are not known for their warmth,” he explains, without dropping that wide smile of his even for a moment. I catch myself staring at the shape of his lips, the way his moustache hugs the sides of his mouth, like a permanent frown painted onto his face, so much at odds with his disposition. It makes me want to touch his lips, see if I can wipe that frown away.\n When he’s satisfied that I’ve had enough to eat, he leads us out of the village and onto the path to Castelalbano.\n We walk without speaking for more than an hour before the sun peeks over the mountains that cradle us. My heart beats hard in my chest, my rib cage hurts, and João’s pace is too fast for me. I keep up for another hour before I have to admit defeat. “I’m not supposed to do strenuous exercise,” I say. Not in a binder is what I mean, and I almost say so, but then I don’t.\n He looks at me, confused. “This is not strenuous exercise,” he says. He flexes his well-formed glutes, as if to underline the point.\n “It is for me,” I reply, my tone as dry as December skin.\n His face drops, but only slightly. “I’m very sorry,” he says. “We’ll slow down.” He starts to walk again, then stops and turns around to face me once more. He puts a hand on my shoulder and squeezes. His eyes are warm and not pitying at all and I’m thankful for it. “Let me know if it is still too hard. I should not have assumed.” His face is flushed, and I know for sure it’s not from the trek.\n “It’s alright,” I say, and when he doesn’t let go of my shoulder I repeat: “It is. Really.” I try on a smile, and it must work because we’re on our way again the next moment.\n I focus on my shoes for most of the journey, even when João points out rare plants or supplies crucial bits of information on the region and vivid details about how the war played out in this ravine or that. I listen to his voice but not to what he’s saying, and all I can think of is the terrifying emptiness that stretches above us and what a miracle it is that we have our feet stuck to the ground, that we don’t all go falling into the sky.\n Castelalbano supposedly owes its name to a white castle which turns out to be little more than a limestone watchtower that stands, half-crumbled, at the village’s entrance. It is already dark when we see the top of the watchtower loom in the distance, its windows dark and empty.\n The power grid here was destroyed during the war and never repaired, so there are no lights in the streets, and the few inhabitants are probably already fast asleep in their beds. Our guest room for the night will be an abandoned barn.\n It is as cold inside the barn as it is outside, so we pick a corner as far from the entrance as possible and make ourselves a nest out of our sleeping bags and fleece blankets. We use a hurricane lamp for light. João opens his arms and invites me to make myself comfortable next to him. “For warmth,” he adds with a smile when he sees me hesitate. So we huddle together for a while. My chest is killing me, though, and I can’t stay like this forever, so I clench my teeth and ask him to turn around while I undress, slip out of my binder, and put my clothes back on as quickly as I can, my breath coming out in little puffs of steam.\n By the time I’m done, I’m shivering. “OK,” I say, “you can turn around again.”\n He only glances at the bulge of my chest for a second before opening his arms and inviting me into the warm blankets again. “Come on, boy,” he says. “You’ll freeze to death.”\n It takes me a few minutes to stop shaking, but eventually I do. He seems to interpret that as an invitation of some sort. “Tell me about Beatrice,” he says.\n What can I say of Beatrice? And how much can I tell him?\n “We met a couple of years ago, after the war had ended,” I say. “I found her wandering about in the city. She looked so lost. She had no one. Knew no one. So I took her in.” I was not Fabiano yet, then. Her name was not the only one we came up with together. “She disappeared three months ago. She was my only friend. Taught me . . . ” I stop myself.\n “Taught you what?”\n “Nothing. Never mind,” I say and he doesn’t press me further.\n “Do you have any idea why she left?” he asks. “Or what she was looking for?”\n “No. And no.”\n He nods, changes the subject. “Lucia said you were a student, before the war. What were you studying?”\n “Religion. Theater.”\n “Both?”\n I shrug. “They are not as far apart as you might think.”\n “I don’t think anything,” he says. “I have no religion. And I’ve never been to the theater.”\n “So what do you do when you’re not showing city boys around the mountains?”\n “I go where I’m needed.”\n “What does that even mean?”\n “Somebody has to rebuild this country,” he says. “This world.”\n His face grows serious for the first time since I met him. Sunny João. I thought his light never set, but here it is, the darkness that had to be there, somewhere. That is always there. How could it not, after everything?\n “Who did you lose?” I ask. “In the war.”\n “Does it matter?” he asks back—almost snaps, in fact, the way people do when they feel guilty about something. He looks away, and I can suddenly sense the openness again, the massive stretches of space above us, outside the barn, weighing down on us, threatening to crush us. “We’re all looking for someone.”\n It’s my turn to be silent. I always find myself floored when people open up like this, even a little. Even without talking. The slightest sign of vulnerability or kindness and I’m down on my knees, caught, surrendered.\n Beatrice used to say it’s my greatest flaw. I haven’t made up my mind yet about whether I agree or not.\n “Fabiano,” he says after a while. I like the way my name sounds on his lips. “Do people shorten your name a lot?”\n “Yes,” I say. “Fabio. Fab. All the time.”\n He raises his hand with the palm towards me, the fingers close together, as if he’s about to take an oath. “I will never shorten your name, Fabiano,” he says, so earnest, not a hint of irony in his voice, as if it’s the most important promise he’s made in his whole life.\n The people of Castelalbano live up to their reputation of guardedness, but João’s warmth could melt a glacier; these people never stood a chance. He manages to get us directions, a bathroom in which to wash ourselves, even a rudimentary breakfast. Finally, we walk into the village’s only coffee house, which transforms into a watering hole as the day progresses. Three people are seated at the plastic-covered tables, each one on their own. For the first time in a long time, I feel my body scrutinized, my visible queerness a weapon that can be used against me. I start thinking of these people as men, when I know I shouldn’t. I can’t help it. João remains relaxed, his arms at his sides, his face sure and open. It helps me relax a bit too, though I still keep two paces behind him as he approaches one of them. João gestures to the owner to brew fresh coffee for everyone and then motions towards the empty chairs at the man’s table. “May we join you?” he asks.\n The man grunts, and João takes a seat. He nods at me to join them, so I do. The man follows me with his eyes.\n The owner brings us the coffee, and we all drink before speaking, as is customary. “Good health,” João says. The black liquid is so hot it burns my tongue.\n “To you as well,” the man responds. I have a feeling he doesn’t mean both of us.\n João pulls out the photo of Beatrice I gave him. It’s the only photo of her I have; she didn’t like being photographed, except that one time, we went to the Luna Park. It had just reopened after the war. Beatrice didn’t really enjoy any of the rides, the machinery of it all disturbed her, reminded her too much of the factory. Until we got on the Ferris wheel. I was terrified, of course, but she got so excited, like a child. I couldn’t say no to her, so we went up. Her excitement made me forget I was afraid. She grounded me.\n Seeing the world from above shocked her and filled her with joy. She told me she’d never felt happy before. She asked me to take her picture so she would remember what she looked like when she was happy. Then her hands did their little dance. I took them into mine, steadied them. “How do you keep going?” I asked. She’d found who she was beyond that which she was made to be. Gave herself a name and a life. And yet, her hands remembered.\n She smiled and shrugged. “Factory settings are a starting point, Fabiano,” she said, “not a destiny.”\n “Even if you keep breaking?” I asked.\n “Even if you keep breaking,” she replied.\n I had the photo printed and framed, kept it on the mantelpiece above the fake fireplace in our living room.\n She didn’t take it with her when she left.\n “Have you seen this woman?” João asks the man.\n He only has to glance at the photo before answering. Castelalbano does not have many visitors and Beatrice would stand out anywhere. “Ah, yes,” he says. “One of those Artificials.”\n João gives me a look, but, if he’s surprised, or disapproving, he doesn’t let it show.\n “Do you know where she was going?” he asks.\n “She was looking for the Last Eagle, she said. Heard of sightings in the area, wanted to see for herself. So we sent her to Santa Antonia.” The man sips his coffee. “Bunch of Welder worshippers over there, the lot of them.”\n Something in my gut twists, sending a wave of pain through my middle. I stand up, steady myself on the back of the chair. I feel light-headed. “May I use your washroom?” I ask the owner.\n He almost laughs when he answers. “Crapper’s in the back,” he says, nodding towards a narrow corridor through the kitchen.\n I paw my way through the corridor, leaning on the wall every few steps. My stomach churns as I pass a row of cured meats hanging from the ceiling. I keep going until I find the small room in the back. There is only a tiny window for light, and I find myself thankful for the darkness.\n I wipe the toilet as best I can and drop myself on the seat, pins and needles in my cheeks and my vision dancing with dark spots. I breathe deep, trying to calm myself down. Stay grounded. I run my palms over the bare skin on my thighs. The cold feels good.\n I panic when I see the blood on my briefs.\n What is happening to me, why am I bleeding?\n Then I remember, and panic turns to a sinking feeling like a rock tumbling through me, from my head to my lungs to my stomach. Bleeding is a thing my body still does, on occasion, especially when under stress.\n Have you been under any stress lately, Fabiano?\n I pack my underwear with toilet paper and splash water on my face, then make my way back as fast as I can.\n João is standing by the door. The men ignore us. “All good?” he asks.\n “Yeah,” I say. “Fine.” Perhaps some pallor on my face betrays me, perhaps not.\n We walk out.\n “It’s a five-day walk to Santa Antonia,” he says. “Are you sure you are up for it? We can still turn back. You can change your mind.”\n “I am not changing my mind,” I say, as steady as I can manage.\n He stares at me with his dark eyes. “I don’t want you falling apart on me in the middle of nowhere,” he says, low and calm.\n “I’m not falling apart!” I protest—a bit too much. My voice breaks into a squeak.\n “Okay,” João says. “Okay. Let’s go.”\n We leave Castelalbano behind—its people peering at us behind drawn curtains, its streets deserted, its white castle watching us with its dark, empty windows.\n The next five days pass in a blur of exhaustion and low-volume agony. All I remember is thinking of Beatrice on these same steep paths, her legs straining, pausing now and then to wind herself up, or perhaps not. Perhaps she let her coil unwind all the way to the end. Perhaps she let her body tumble down some historic ravine. Perhaps she’s still down there, all limbs and angles, like a broken doll. I did look down, I think I did. All I could see was sky.\n Or maybe that was the fever João says I ran the entire way to Santa Antonia. He claims I rambled, but, when I ask about what, he says it doesn’t matter.\n When I’m finally well again, we are settled in a warm room with rugs not only on the floors but draped all over the stone walls. It feels like a cocoon. The bed—just one bed for the both of us—is piled high with blankets. I catch myself thinking I could stay here forever, in this warmth, with João sleeping next to me. A snowstorm is raging outside, and our search is suspended until the weather clears.\n I can’t stand to think what a snowstorm might mean for Beatrice, if she’s still out there, somewhere.\n João brings me soup. I enjoy the bowl’s warmth much more than the taste of the soup, but he’s watching me, so I force myself to take a spoonful.\n “Why didn’t you tell me about Beatrice?” he asks.\n “Tell you what?”\n “That she’s one of Welder’s creatures. A Worker, I assume?”\n I poke at a piece of gray meat that’s floating in my bowl. Goat, I think. “I didn’t know how you’d take it,” I say after a while, ashamed of how little credit I gave him. He’s Lucia’s friend, after all. She would never be friends with someone who could find Beatrice’s existence offensive or unacceptable. “Not everyone would be happy roaming the mountains in winter for a Worker. Some people still hold grudges, from the war.” I pause. “Some people wouldn’t even consider Beatrice alive.”\n “I’m not some people,” he says.\n “I know,” I reply. “I know that now.”\n “Did she speak to you of the factory? What they did there, whether she knew what it was they were making, the ammunition?”\n I remember those moments when she would get that absent look on her face and her hands would do their little dance in the air, like she was still screwing screws at the factory.\n I take another spoonful of soup. “She didn’t like to talk about it,” I say.\n “And the Last Eagle?”\n “I was the one who first heard about it. A friend of a friend joined a Welder cult and was raving about animals still roaming the mountains. I told Beatrice. She thought if she found one of the animals, she might be able to find the Welder himself. I had no idea she was going to try. Not alone. I shouldn’t have said anything.” I hand João the bowl of soup. It’s still almost full, but I can’t eat anymore. “This is all my fault.”\n João leaves the bowl on the floor and pushes himself closer—me under the blankets, he on top. “It’s not. Fabiano. If you truly think of Beatrice as a person, then you’ll allow her the freedom to choose for herself.”\n That shuts me up good. Why didn’t I ever think of it that way? I’ve been so wrapped up in finding my friend and feeling sorry for myself, that I never stopped to consider what this might mean for Beatrice.\n Well done, Fabiano.\n João leans his back against the wall and stares at the window. I do the same. There’s a thin film of snow caked on the glass. We’re shut in here, the outside world obscured. I think after a while of this I could even forget it exists.\n “Have you ever seen an animal?” João asks. “One of Welder’s?”\n I shake my head. “People say the city crawled with them before the war, but I’ve never seen one, neither before nor after. And now they’ve taken them all apart, anyway, used them for scraps,” I say. “Have you?”\n “Yes,” he says. His voice sounds strange, distorted. “An antelope.” He pauses for so long I think he won’t speak again, but then he does. “It was during the war. I was hiding a group of fighters in a ravine not far from here. We were supposed to cross enemy lines, pass one of the villages on the way, and join a larger group on the other side. But there was a storm, and I got us lost. We crossed paths with another group. We didn’t have any insignia on, and neither did they, so we didn’t know if they were friends or enemies. We might have even been on the same side, tree-hugging anarchists and bleeding-heart posthumanists, all of us. It didn’t matter. I don’t know who opened fire first, but we all ended up shooting at one another like idiots. Then the storm suddenly stopped, and there was this antelope. It came out of the bushes. Its joints made this awful creaking sound, like rusted metal scraping on metal. It was the most beautiful thing around, for miles. Broken and beautiful.\n “It paused and just stared at us. We stopped shooting, stared back. Then it turned around and disappeared into the bushes again.”\n He closes his eyes and stays silent for a while, breathing deeply, as if to steady himself.\n “Then what happened?” I prompt him.\n “None of us said a word. Didn’t look at each other. We hid our weapons and went our separate ways.” He turns to look at me. “I hope your Beatrice found what she was looking for,” he says. Then he bends over and kisses me on the forehead, like we’re friends, or more, like we’ve known each other for years. “Sleep. I’ll go talk to the people here, see if I can find out anything else.”\n I wake up more rested than I’ve been in months. There is a strange light coming into the room from the sheet of snow on the window. I can’t tell what time it is. João is not next to me, and for a moment I panic, I think he left, too. But the clothes he wore in bed last night are folded neatly and draped over the back of the single chair in the room. I breathe. I get up and wash my face, then put on as many layers of clothes as I can and walk out. I hear voices from downstairs, and João’s laughter, high and gurgling like a mountain stream. I follow the sounds.\n It’s a celebration. There are young people juggling empty glass bottles and trousered aunties smoking pipes and singing polyphonic songs in a language I’ve never heard before, their voices like flutes. João joins them. I’m surprised he knows all the words. His singing voice is high, higher than I would have ever expected, and singing makes his cheeks stick out round and perfect, like small apples. Makes the skin on my face flush. I’m almost envious of him, of the confidence with which he uses his voice; something I’ve never been able to do, even after my voice dropped. He nods at me and I join the crowd, take a seat on a rush chair in the corner. The song fills me and I start tapping the rhythm on the table next to me.\n A small child approaches me. They have long braids that end in tassels made from colorful wool, a round face, and legs like twigs, bare despite the cold. The child climbs on my lap and wraps their arms around my neck. I stop tapping and wrap a protective arm around the child, keeping the rhythm with my leg instead. When the song ends, the crowd cheers and claps, everyone patting João on the shoulder or ruffling his hair in approval, like he’s one of them. He’s beaming at me and there is a bursting feeling in my chest, like I’m proud of him, as if I can claim any stake to him.\n The child gives me a kiss on the cheek and then takes my hand. They open my palm and deposit a small metal object in it, then close my fingers around it, before climbing down and disappearing behind the gathered adults.\n João comes to sit next to me, his turn to wrap an arm around my shoulders. “I’m glad you’re feeling better,” he shouts in my ear to be heard over the crowd’s clamor, even though I haven’t said a thing about how I feel.\n “What do the songs say?” I ask.\n “They praise the Great Welder in the sky,” he replies, as if that answers anything.\n “For what?” I ask, and he laughs. “For what?” I repeat, elbowing him in the ribs.\n He doesn’t reply. He simply opens his arms, as if to mean, everything. Everything around us that exists or is yet to exist. Then he gestures with his head to my hand. “What have you got there?” he asks.\n I had almost forgotten about the child’s little gift, drunk by the weight of João’s arm on me. I unfurl my fingers. A bullet is resting on my palm, tiny and perfect, like a flower.\n I never find out what it was we were celebrating. When the fun dies down and the crowd disperses, João takes me by the hand and leads me back to our room with soft, light steps. We crawl under the blankets on the bed and then take off all of our clothes while trying to keep our skins touching in as many places as possible and so it becomes like a dance, like one of those contact improv pieces I used to go to all the time when I was a student. I keep my binder on. I remember the dance Beatrice and I used to do sometimes in front of a mirror, twisting our bodies so that it looked like her head was mine, my keyhole-less neck hers.\n I trace the frown on João’s face with my fingers and then his smile. His mouth is like a furnace, and for a moment I wish I could burn in there. I wish I were metal, melted down and transformed into something new, harder and unbreakable.\n The snowstorm takes ten days to clear, and we spend most of that time in our room, having awful goat soup, discovering each other’s bodies, talking about things we remember from our very different childhoods—like building your own kite to fly on Clean Monday (him), and buying sheets of sweet and sour candy called skins for pennies from the shop on the corner (me), or learning the name of every extinct species of animal, which was an impossible task (me), or being made to sit on a bucket warmed with coals when your tummy hurt (him).\n Then the time comes for us to move on, and I don’t want to go. I wish we could stay here forever. I would learn how to speak Santa Antonia’s language, I would praise the Great Welder in the sky for every little thing that exists in the world, and I would learn the lyrics to all their songs, even if I could never bring myself to sing them. I might even learn how to love things that are damaged and imperfect, like he does.\n I say so. Not everything. Just enough.\n He doesn’t say anything in response. When he’s done stuffing his backpack he glances around the room to make sure every trace of our stay here has been either packed or discarded, he touches me lightly on the shoulder and kisses my eyes.\n We move out.\n It will be another week before we reach the next shelter, and then another couple of days or so to reach the peak where the Last Eagle has been seen. We don’t talk much on the way. João becomes more and more distant, or maybe I do. When we made love in Santa Antonia, for a moment I thought his dick was mine. I carry that euphoria with me for days. And the pain of it, of course. I avoid the sky as much as I can, but the crevasses that yawn on either side of our path do me no favors. I start thinking of depth as inverted height and my head spins.\n João retreats somewhere inside himself and grows agitated the higher we go. He scans the surroundings—quick, furtive glances, as if he’s scared of things that may be lurking in the bald mountains and empty cliff tops around us.\n There’s no sign of Beatrice, the Last Eagle, or any other animal, but we do come across something the night before we reach the final shelter before the peak. From afar, it looks like a dark mass tucked in the curve between two giant rocks. João reaches it first and he just stands there, contemplating it.\n I come up behind him as fast as I can, panting. It’s a nest made of razor wire. For what creature? I want to ask. For what offspring? I open my mouth to speak the words, but the sound of sobbing stops me. João is kneeling by the nest now, weeping. For what, for whom, I do not know. I put a hand on his back and he shakes it off. I wait patiently, let him be for as long as he needs, allow him the time and space to get it all out.\n When he stops crying, I give him my hand and this time he takes it. He’s back on his feet, drying his eyes on the rough wool of his sleeve.\n “Maybe you’re not supposed to find her, you know,” is all he says. “Maybe you’re supposed to let her go.”\n I don’t know what this means—supposed by whom? Who decides?—and I don’t ask.\n The final shelter is little more than a wooden cabin large enough to house two, maybe three people, but no more. It’s been almost a month since Castelalbano and I monitor my body, scrutinize the tiniest feeling in my guts, scared out of my mind that I’ll bleed again.\n We make the little cabin as warm as we can by feeding logs to the woodburner. They are frozen solid, hiss angrily every time we add a new one to the fire.\n I don’t bleed.\n The distance between João and myself closes slowly and we find each other’s bodies again, little by little.\n The second night, when we’re lying in bed together, he tells me I remind him of a boy he loved and lost in the war.\n “Was he also such a mess?” I ask.\n “No,” he says. He gives me a look that makes me think he’ll explain how me and that boy are different, but he doesn’t. Instead, he adds: “Besides, it’s not you. It’s the world that’s a mess.”\n Then he sings another of Santa Antonia’s songs.\n I ask what the words mean, but he simply smiles and does not say.\n On the third morning, I tell him it’s time.\n We climb for two days straight. It’s hard, makes my bones feel like they’re breaking, and I want to quit, but I keep going. We sleep only for the darkest hours of the night, pressed into tiny enclosures on the cliff face. I dream, though, for the first time since Beatrice left.\n In my dream, I find her in a church. It’s not one I’ve been to before, but it’s high, so high I cannot see the ceiling—it disappears far above us, into the clouds. Beatrice is sitting next to me in the pews. Someone is singing in a language I don’t recognize. “What does it say?” I ask her, but she just hands me a bullet and smiles. Then she stands up, and I notice the keyhole in her neck is gone.\n She turns around and points with her finger at the far end of the church. “Look!” she says. “Look!”\n I wake up before I can see what she was showing me. I say nothing of my dream to João.\n We go on climbing.\n And then, finally, we are at the peak. It’s a barren spot, the ground underneath our feet hard, frozen solid. I take a deep breath and look around, at the space too vast to contemplate. There are clouds below us, and clouds above, and I don’t know who I am anymore. My fingers reach for my neck, searching for a hole. Perhaps Beatrice did find what she was looking for. Perhaps it’s true that we’re not broken, that it’s the world that breaks us. If I believe it, will I let her go? My heart beats fast. My mouth falls open and I don’t even know whether I’m trying to speak or sing or cry. A sound comes out like the sigh of a wind instrument—something foreign and alarming and unrecognizable.\n João hugs me from behind, steadies me. And I come back to myself. I come back. I come back.\n We hear the music first. Old music-box melody, slightly broken, out of tune.\n João points at the sky. “There,” he says. “There.”\n There, the Last Eagle is soaring above us, its tarpaulin wings creaking in their pulley joints, its two wooden heads facing in opposite directions, as if saying what difference could coming or going possibly make? It used to be painted yellow, but now the color is chipped and falling away. It circles the peak once, twice, looking at us with one head and ignoring us with the other.\n Then, much too soon, it swerves left and flies away.\n João doesn’t loosen his grip on me until he’s sure there is no shaking left in my limbs, until my heart has slowed to a pace close to normal. The vast open space above no longer feels like it’s going to swallow us whole. Or maybe it does, and I no longer care.\n I turn my head to look at him. His eyes are wet and shiny, looking in the direction of the Last Eagle now gone. He’s still holding me, he doesn’t let go. “So beautiful,” he says of the crumbling thing, the broken thing, and I love him for it. “So beautiful.”\n Natalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter."}