{"fingerprint": "YECaxfPvKJKWTZtvHZDzXNsMYIg=", "sitename": "Clarkesworld Magazine", "title": "Blue And Blue And Blue And Pink by Lavie Tidhar", "author": "Lavie Tidhar", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tidhar_09_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Blue And Blue And Blue And Pink by Lavie Tidhar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3350 words, short story\nBlue And Blue And Blue And Pink\nPurple clouds roiled on the horizon and the old Cessna Centurion came in low and fast, riding the tailwind. Giorgio, on the ground and looking up, took shelter behind a crude half-shed of corrugated iron and lit a cigarette with a Zippo he’d once bought in the Talat Sao back in Vientiane. It was supposedly owned by a downed Air America pilot during the Secret War.\nHe stared at the plane coming in from the border. Smoke was coming out of the engine and half a wing looked like it’d been strafed, and Giorgio wondered who it was flying it. One of the Israelis, maybe.\nThe plane, trailing smoke, dove down low as it lined up to the landing strip. All the pilots came out to watch. The Cessna struggled in the air, then righted, the engine whine louder now. The Cessna hit the strip with a bump and Giorgio coughed smoke, but then it came down safely and coasted the rest of the way and came to a halt.\nEveryone cheered.\nThe pilot—Avi, or Eli, or one of those—took off his belt and fell out of the open door. He looked dazed.\n“Pink!” he said. “Blue and blue and blue and pink!”\nThe ground crew opened the hoses then. Avi—that was his name, Giorgio was almost sure it was that—rolled on the ground as the laced water hit him. Giorgio took a drag on his cigarette. Avi screamed. The other pilots, having been through this exact routine too many times before, lost interest and drifted off. Avi’s two buddies waited anxiously until the jets of water stopped and the pilot stopped screaming. They ran over to him and helped him up.\n“Decontaminated,” the guy who passed for ground crew foreman said. He stowed away the hose and he and his team went to the cargo hold and began off-loading the contraband. Giorgio put out his cigarette and went to join the other pilots in the sole shack that served as bar and tuck shop.\n“Did you hear about Johnny Luck?” Sam Cheng said, passing him a bottle. Giorgio twisted off the cap and took a swig. The beer was cold, at least.\n“No,” he said. “What about him?”\n“Came in three, four days ago from a run, got deloused and everything, but he must have been careless on the other side. Started showing yesterday morning. He’s in the isolation tent.”\n“Shit,” Giorgio said.\n“Yeah. Me and some of the boys are going over there later, sing him out. You should come.”\n“I . . . alright.”\nGiorgio downed the rest of his beer and tossed the bottle onto the heap with the others. He didn’t want to go see Johnny Luck.\n“How many does that make now?” he said.\nSam Cheng shrugged. “Five the past month.”\n“Shit.”\n“It’s the job. It’s why we get the danger pay. And who else is going to hire us? American Airlines? This is the only job that’s going. You know this, Giorgio.”\n“It’s a shit job.”\n“But it’s flying.”\nHe handed him another beer. Giorgio nodded.\n“It’s still flying,” he said.\nThere were twelve of them outside the isolation tent that evening.\n“Enough for a minyan,” one of the Israelis said. Giorgio looked at him blankly.\nJohnny Luck was inside the tent. Giorgio tried to remember what he knew about him. Not much. Recent arrival, one of the oldest at twenty-seven. No one on the squad expected to make it to thirty. Not if they stayed. He thought Johnny was South African. There were a lot of South Africans running missions over the line.\n“Ready, boys?” Chaplain Buzz said. He wasn’t really a chaplain, but before he became a pilot, he went to seminary school.\nThey started singing “Danny Boy.” The pipes were calling across the night and inside the isolation tent Johnny Luck was slowly, well—whatever it was that happened after you were exposed, it was happening to Johnny Luck.\nAfter the song they all raised a drink for Johnny, and then they poured some on the ground outside the tent. Then they drifted off. Someone started a campfire and someone else strummed a guitar. Giorgio lay under the mosquito net in his tent and tried to sleep. He’d run, what, nineteen, twenty missions over the line, easy? Never had a problem. Always observed the protocols. Never been exposed.\nBut everyone’s luck runs out sooner or later.\nGiorgio fell asleep. In his dream he was back home in his parents’ farmhouse. Vines grew over the pergola columns and roof and bunches of grapes hung down, purple and green. He reached up and plucked a grape and put it in his mouth and it tasted blue and blue and blue and pink. His mother came out of the kitchen where she had been cooking and saw him.\n“Giorgio!” she said. She wiped her hands on her apron. This was very strange to Giorgio, since he grew up in a small flat, not on a farm, and his mother never cooked.\nHis mother looked at him curiously.\n“How much you’ve grown!” she said.\n“Mama,” he said. He went to her. She looked good. But hadn’t she died in the last major outbreak, five years ago? And she was never this large or this homey. His mother was thin as a rake and smoked long menthol cigarettes and worked in accounts. “You look good,” he said.\n“Come give Mama a hug,” she said. She put her arms around him. It felt good to be held by his mother.\n“Snuggly-wuggly,” she said, nuzzling him close. “Snuggly-wuggly-woozy-woo.”\n“No, no,” Giorgio said. “No, mother.”\nMother was turning blue.\n“Snuggle!” she cried. Her arms lengthened, wrapped around him. Blue and blue and blue and pink.\nGiorgio woke into early dawn. He was drenched in sweat and his teeth were clenched tight, and there was a bad taste in his mouth. Mosquitoes buzzed outside the net, and in the distance someone was still playing the damn guitar.\nGiorgio took a sip of warm water and gurgled and spat it out on the ground. He stole out of the tent into the rising sun. The sun rose over the line, on the other side. Some of the other pilots were already awake and about. Nothing came from the isolation tent. Over at the tuck shop, Sam Cheng was frying eggs.\nGiorgio ambled over and got a burrito. Sam poured him a coffee, which he brewed in a giant can that once housed pickles. He said it gave the coffee a kick. The coffee was vile, but it was the only coffee around, so Giorgio drank it.\nHe grimaced.\n“Bad dream?” Sam said sympathetically.\n“Bad coffee,” Giorgio said.\n“Sure, boss. Whatever you say.”\nA plume of dust rose in the distance. Giorgio watched it come closer and soon heard the sound of the engine. The jeep came into the pilots’ encampment and stopped, and the woman from the company stepped out. She wore field boots that were more expensive than Giorgio’s plane. She had goggles on and a face and nose mask, and she wore gloves. The ground crew foreman came over and they spoke briefly, then the foreman nodded. Another plume of dust came across the horizon and soon one of the company’s big unmarked trucks arrived and the ground crew started off-loading contraband and loading the stuff the pilots brought back on their runs in its place.\nThe woman walked over to the tuck shop. She looked at the hand-chalked menu, at Sam Cheng, and at the coffee. If she made a face it was behind her mask. She nodded to Giorgio.\n“Pilot?”\n“Aha.”\n“Got a job for you.”\n“Why me?”\n“You’re present.”\nGiorgio nodded. “What’s the run,” he said.\nShe motioned for him to come. The ground crew had unloaded all the contraband off the big truck. Giorgio saw that the isolation tent was down. A sealed plastic box the size and length of a coffin sat by the waiting truck. He felt a little queasy at the sight.\n“Knew him?” the woman from the company said.\n“A little.”\n“Alright.” She handed him a chart in her gloved hand. Giorgio took it. He frowned. The flight path was longer than he’d expected.\n“A deep dive?” he said.\nThe woman from the company shrugged.\n“I’ll have to take on extra fuel,” Giorgio said.\nThe woman from the company shrugged.\n“What am I taking?” he asked her.\n“The usual.”\n“Alright.”\n“It’s a bonus flight,” she said, apparently taking pity on him. “Double the usual pay. When you get back.”\nImplied in her tone was that failure to return would just save the company costs.\n“Alright.”\nShe nodded. “Get to it, then,” she said.\nThe ground crew loaded Johnny Luck’s coffin onto the truck with the rest of the contraband the pilots brought in from beyond the line. Giorgio didn’t know who the company really was, or why it was still trading over the line, when no one should have been crossing the line for any reason. The whole place was under quarantine.\nGiorgio went to his plane. The ground crew had already loaded the cargo. Giorgio said, “I need extra fuel.”\nThe foreman said, “Already done.”\nThe foreman never said very much. He was a company man. Like the woman from the company he wore goggles and a face mask, though unlike hers, his boots weren’t worth shit.\n“Alright.”\n“See you, Giorgio.”\nDid he know the foreman’s name?\n“Yeah, see you,” he said. He climbed into the cockpit. Did the check. Started the engine. Taxied to the runway. Saw that one plane had already taken off, ahead of him. Starting early that morning.\nHe took to the air. This was the best part. The moment the wheels left the ground and the whole improbable thing happened, of leaving the earth and rising into the skies. The airfield grew small below, tents and parked airplanes and the company truck. Bad coffee and bad dreams.\nHe climbed and then eased the stick until he was flying at a fixed altitude. He looked down. Fields and small rivers and clumps of houses here and there. Roads. He checked the compass and the map, but he didn’t really need to.\nAs he approached the line, he dropped down low. He flew over grassy hills and old abandoned roads. Once he thought he saw a patrol convoy and skirted ’round them. Then he was over the line, with no discernible change on the ground below.\nHe followed a river for a little while until it reached a fording and a small abandoned mill, and then he flew northeasterly for a while. He rose high again. From the skies the world over the line looked the same as on the other side. He saw roads and he saw houses and once he passed a small town, though no one walked in the streets and the playgrounds were abandoned. But he could sense eyes in the windows, and he knew people still lived there.\nCarl, he thought. That was the foreman’s name.\nThe sky was very blue and blue and blue, with only a blush of pink on the horizon. Giorgio passed over a small village and turned northeasterly again. He didn’t recognize the land below anymore; this was outside of the regular route the smugglers took. A crackling of static came on his headphones.\n“ . . . Everywhere . . . ” a male voice said in panic.\nGiorgio turned the dial, trying to dislodge the moronic voices that kept coming up on the old VHF.\n“ . . . Overwhelmed . . . ” A woman’s voice this time. Giorgio turned the dial.\n“Mama loves you, Giorgio,” a woman’s voice said very clearly in his ear. He gritted his teeth. In life his mother barely showed her emotions, mostly she was disappointed in him, his hair that had been too long, his choice of girlfriends, his choice of career. “Giorgio, it’s me, love, can you hear me, over?”\n“Over and out,” Giorgio muttered. There was no point trying to turn off the radio. The voices came on regardless, this side of the line.\nHe dove low, spotting the target in the distance. A white farmhouse just like the one in his dream, and a dirt track running parallel to it, which he’d have to use for landing.\nThe attack came fast and sudden on his right. He felt the thud of multiple impacts against the belly of the plane. He banked sharply left and then right, trying to dodge them. He looked down, saw muted shadows in the vegetation and arrows flying into the sky. He rose and the arrows reached the upmost point of their trajectory and fell back down to the ground with a strange, forlorn grace.\nThe farmhouse grew close. Giorgio glided, looking it over, but he could see no movement. An old truck stood next to the farmhouse and crates had been left haphazardly on the ground.\nGiorgio wondered if he should just go back. But then he wouldn’t be paid, and would have to take on the cost of the extra fuel besides. So, he went down for a landing.\nThe dirt strip was straight and flat, surprisingly so, and the plane landed smoothly. Giorgio turned the plane around for takeoff and taxied near the drop point, then stilled the engine. He sat in the cockpit for a moment, looking, but nothing moved, and everything seemed peaceful. He put on his standard-issue surgical mask and gloves and climbed down from the cockpit.\nThe sky was very clear, and the sun was warm. Empty snail shells lay on the ground under a clump of gerberas. Giorgio walked slowly to the farmhouse.\nThe cargo was waiting for him on the tarmac. He noticed some of the lids on the boxes were ajar and the contents caught the sun. They glinted like gold.\n“Hello?” Giorgio called. “Hello?”\nNobody answered. Giorgio shrugged.\n“Alright,” he said.\nHe went back to the plane and began off-loading the shipment of contraband by himself. It wasn’t unusual to never see anyone. It was better this way. It was hot, though.\nHe took down boxes of useless stuff—toilet paper, soap, board games, toys, stuff the company picked up in bulk for pennies on the other side. He stacked the boxes against the white stone of the farmhouse. The walls were crawling with ivy.\nGiorgio went back to the cockpit. He picked up his bottle of water and took a long swig. Then he went back to work.\nThe return contraband was heavy. He figured it was old gold coins, pieces of jewelry, stuff like that, which was of no further use on this side of the line. It didn’t matter to Giorgio. It was only when he was lifting the final crate, straining against the weight of it, that he heard the fuzzy.\n“Hug?” the fuzzy said hopefully.\nGiorgio put down the crate. The fuzzy was blue and blue and blue and pink, with large curious eyes and a round, cuddly shape. It stood in the sunlight less than two meters away, blinking.\n“Hug!” the fuzzy said.\nGiorgio took a careful step back, and then another. The fuzzy didn’t move any closer, but it looked hurt at Giorgio’s retreat.\n“Snuggle-wuggle?” the fuzzy said. It blinked again.\nGiorgio knew he should get away from the fuzzy, but somehow he didn’t take another step back. He stared at it. Back when he was four or so his mother bought him one just like this one. He loved it and fell asleep with it every night and took it with him everywhere he went.\n“Huggy-bugs,” the fuzzy said pleadingly.\n“No, no,” Giorgio said.\nThe fuzzy hopped in place. Then, somehow, it was too close to Giorgio, even though Giorgio didn’t see it make the leap across the distance. Now it was too close. Giorgio felt warm foolish love suffuse him.\n“Huggy-wugs,” he said.\nThe fuzzy felt warm and natural in his arms. He held him close, remembering that odd sensation when you loved something so much you wanted to just squeeze it and squeeze it harder. But the fuzzy didn’t mind. The fuzzy was soft and pliable and endlessly huggable. Its huge eyes stared lovingly into Giorgio’s.\n“Snuggle-wuggle,” it said. It nuzzled Giorgio’s neck and buried its face in the crook of his shoulder.\nGiorgio got back into the cockpit, the fuzzy in his arms. It was too late to turn back now. He stared at the fuzzy.\n“Take . . . with?” the fuzzy said. “Help . . . Fuzzy-wuzz!”\nHow long did he have? He thought about Johnny Luck in his box. He wasn’t going to go that way. He could stay behind the line. Some pilots never came back, and their missions were written off. The company didn’t care as long as the deliveries kept running. And there were always new pilots to carry them through.\nHe put the fuzzy in the jump seat and strapped them both in. The engines came alive, and the propeller spun, and the fuzzy and Giorgio accelerated across the dirt track. The plane jumped into the air, and the fuzzy warbled something Giorgio didn’t catch.\nThe steady drone of the engines was calming on his nerves. He flew back the way he’d come, over a small village with blue and blue and blue and pink flowers growing in a profusion over the roads and in the gardens and in pots on the windowsills. Giorgio smelled menthol cigarette smoke from the back seat of the plane.\n“Watch where you’re going, Giorgio!” his mother snapped. He turned his head and saw her sitting there, puffing on the long thin cigarette with quick jerks of her hand, the way she had ever since he could remember.\n“Mama,” he said.\n“Watch the road!”\n“This isn’t a car, Mama,” he said. She only ever came flying with him once, reluctantly. He had been so proud, having just got his wings. She had complained the whole way to the airfield and then sat mute in the small plane the whole half hour they were airborne. Giorgio had felt a vague sense of disappointment then that he never quite managed to put into words.\nHe flew over the small town again and then, just like that, he went over the line. He looked behind, but of course there was nothing there, and the jump seat was empty.\nHe felt fine. The sky was blue and blue and blue and pink. Soon the airfield came into view, and the tents, and the parked airplanes. The jeep of the woman from the company was still there. Giorgio eased the stick, aligned with the landing strip. The landing was smooth. The ground crew sprayed him with delousing water, but he didn’t feel a thing. They off-loaded the cargo and Giorgio went off to change his wet clothes. The fuzzy was in the corner of his tent as Giorgio put on a fresh shirt and trousers.\n“Huggy?” it said hopefully.\nGiorgio looked into the crooked mirror over his washbasin. There was nothing there, just the back of the tent, and the dim light, and a mosquito. He finished buttoning his shirt and stepped out of the tent. He went over to the tuck shop.\n“Could I get a beer?” he said.\nThe fuzzy pushed the bottle inexpertly across the wooden counter.\nGiorgio took a sip, but the beer tasted like bubble gum, and he put it down. A shadow fell on him then, and he looked up and saw the woman from the company.\n“Did you get the cargo?” she said.\nGiorgio shrugged.\n“Sure,” he said.\n“Sit up straight when I’m talking to you,” the woman from the company said. She smelled of menthol cigarettes.\n“Yes, Mama,” Giorgio said. The fuzzy jumped into his lap. It looked up at Giorgio with big bright eyes.\n“Huggy-wuggy,” it said.\n“Yes,” the woman from the company said, quite seriously. She knelt down and put her arms around Giorgio. He felt like he was four years old again, and everything was better.\n“Snuggle-wuggle,” the woman said.\nAnd everything was blue and blue and blue and pink, forever.\nLavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize."}