{"fingerprint": "uSTQoat05ImLLvZ+O23O0rpwRfg=", "sitename": "Clarkesworld Magazine", "title": "The Smell of Orange Groves by Lavie Tidhar", "author": "Lavie Tidhar", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tidhar_11_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Smell of Orange Groves by Lavie Tidhar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5300 words, short story\n The Smell of Orange Groves\n On the roof the solar panels were folded in on themselves, still asleep, yet uneasily stirring, as though they could sense the imminent coming of the sun. Boris stood on the edge of the roof. The roof was flat and the building’s residents, his father’s neighbors, had, over the years, planted and expanded an assortment of plants, in pots of clay and aluminum and wood, across the roof, turning it into a high-rise tropical garden.\n It was quiet up there and, for the moment, still cool. He loved the smell of late-blooming jasmine, it crept along the walls of the building, climbing tenaciously high, spreading out all over the old neighborhood that surrounded Central Station. He took a deep breath of night air and released it slowly, haltingly, watching the lights of the space port: it rose out of the sandy ground of Tel Aviv, the shape of an hourglass, and the slow moving sub-orbital flights took off and landed, like moving stars, tracing jeweled flight paths in the skies.\n He loved the smell of this place, this city. The smell of the sea to the west, that wild scent of salt and open water, seaweed and tar, of suntan lotion and people. He loved to watch the solar surfers in the early morning, with spread transparent wings gliding on the winds above the Mediterranean. Loved the smell of cold conditioned air leaking out of windows, of basil when you rubbed it between your fingers, loved the smell of shawarma rising from street level with its heady mix of spices, turmeric and cumin dominating, loved the smell of vanished orange groves from far beyond the urban blocks of Tel Aviv or Jaffa.\n Once it had all been orange groves. He stared out at the old neighborhood, the peeling paint, box-like apartment blocks in old-style Soviet architecture crowded in with magnificent early twentieth-century Bauhaus constructions, buildings made to look like ships, with long curving graceful balconies, small round windows, flat roofs like decks, like the one he stood on—\n Mixed amongst the old buildings were newer constructions, Martian-style co-op buildings with drop-chutes for lifts, and small rooms divided and sub-divided inside, many without any windows—\n Laundry hanging as it had for hundreds of years, off wash lines and windows, faded blouses and shorts blowing in the wind, gently. Balls of lights floated in the streets down below, dimming now, and Boris realised the night was receding, saw a blush of pink and red on the edge of the horizon and knew the sun was coming.\n He had spent the night keeping vigil with his father. Vlad Chong, son of Weiwei Zhong (Zhong Weiwei in the Chinese manner of putting the family name first) and of Yulia Chong, née Rabinovich. In the tradition of the family, Boris, too, was given a Russian name. In another of the family’s traditions, he was also given a second, Jewish name. He smiled wryly, thinking about it. Boris Aaron Chong, the heritage and weight of three shared and ancient histories pressing down heavily on his slim, no longer young shoulders.\n It had not been an easy night.\n Once it had all been orange groves . . . he took a deep breath, that smell of old asphalt and lingering combustion-engine exhaust fumes, gone now like the oranges yet still, somehow, lingering, a memory-scent.\n He’d tried to leave it behind. The family’s memory, what he sometimes, privately, called the Curse of the Family Chong, or Weiwei’s Folly.\n He could still remember it. Of course he could. A day so long ago, that Boris Aaron Chong himself was not yet an idea, an I-loop that hadn’t yet been formed . . .\n It was in Jaffa, in the Old City on top of the hill, above the harbor. The home of the Others.\n Zhong Weiwei cycled up the hill, sweating in the heat. He mistrusted these narrow winding streets, both of the Old City itself and of Ajami, the neighborhood that had at last reclaimed its heritage. Weiwei understood this place’s conflicts very well. There were Arabs and Jews and they wanted the same land and so they fought. Weiwei understood land, and how you were willing to die for it.\n But he also knew the concept of land had changed. That land was a concept less of a physicality now, and more of the mind. Recently, he had invested some of his money in an entire planetary system in the Guilds of Ashkelon games-universe. Soon he would have children—Yulia was in her third trimester already—and then grandchildren, and great-grandchildren, and so on down the generations, and they would remember Weiwei, their progenitor. They would thank him for what he’d done, for the real estate both real and virtual, and for what he was hoping to achieve today.\n He, Zhong Weiwei, would begin a dynasty, here in this divided land. For he had understood the most basic of aspects, he alone saw the relevance of that foreign enclave that was Central Station. Jews to the north (and his children, too, would be Jewish, which was a strange and unsettling thought), Arabs to the south, now they have returned, reclaimed Ajami and Menashiya, and were building New Jaffa, a city towering into the sky in steel and stone and glass. Divided cities, like Akko, and Haifa, in the north, and the new cities sprouting in the desert, in the Negev and the Arava.\n Arab or Jew, they needed their immigrants, their foreign workers, their Thai and Filipino and Chinese, Somali and Nigerian. And they needed their buffer, that in-between zone that was Central Station, old South Tel Aviv, a poor place, a vibrant place—most of all, a liminal place.\n And he would make it his home. His, and his children’s, and his children’s children. The Jews and the Arabs understood family, at least. In that they were like the Chinese—so different to the Anglos, with their nuclear families, strained relations, all living separately, alone . . . This, Weiwei swore, would not happen to his children.\n At the top of the hill he stopped, and wiped his brow from the sweat with the cloth handkerchief he kept for that purpose. Cars went past him, and the sound of construction was everywhere. He himself worked on one of the buildings they were erecting here, a diasporic construction crew, small Vietnamese and tall Nigerians and pale solid Transylvanians, communicating by hand signals and Asteroid pidgin (though that had not yet been in widespread use at that time) and automatic translators through their nodes. Weiwei himself worked the exoskeleton suits, climbing up the tower blocks with spider-like grips, watching the city far down below and looking out to sea, and distant ships . . .\n But today was his day off. He had saved money—some to send, every month, to his family back in Chengdu, some for his soon to be growing family here. And the rest for this, for the favor to be asked of the Others.\n Folding the handkerchief neatly away, he pushed the bike along the road and into the maze of alleyways that was the Old City of Jaffa. The remains of an ancient Egyptian fort could still be seen there, the gate had been re-fashioned a century before, and the hanging orange tree still hung by chains, planted within a heavy, egg-shaped stone basket, in the shade of the walls. Weiwei didn’t stop, but kept going until he reached, at last, the place of the Oracle.\n Boris looked at the rising sun. He felt tired, drained. He kept his father company throughout the night. His father, Vlad, hardly slept any more. He sat for hours in his armchair, a thing worn and full of holes, dragged one day, years ago (the memory crystal-clear in Boris’ mind), with great effort and pride from Jaffa’s flea market. Vlad’s hands moved through the air, moving and rearranging invisible objects. He would not give Boris access into his visual feed. He barely communicated, any more. Boris suspected the objects were memories, that Vlad was trying to somehow fit them back together again. But he couldn’t tell for sure.\n Like Weiwei, Vlad had been a construction worker. He had been one of the people who had built Central Station, climbing up the unfinished gigantic structure, this space port that was now an entity unto itself, a miniature mall-nation to which neither Tel Aviv nor Jaffa could lay complete claim.\n But that had been long ago. Humans lived longer now, but the mind grew old just the same, and Vlad’s mind was older than his body. Boris, on the roof, went to the corner by the door. It was shaded by a miniature palm tree, and now the solar panels, too, were opening out, extending delicate wings, the better to catch the rising sun and provide shade and shelter to the plants.\n Long ago, the resident association had installed a communal table and a samovar there, and each week a different flat took turns to supply the tea and the coffee and the sugar. Boris gently plucked leaves off the potted mint plant nearby, and made himself a cup of tea. The sound of boiling water pouring into the mug was soothing, and the smell of the mint spread in the air, fresh and clean, waking him up. He waited as the mint brewed; took the mug with him back to the edge of the roof. Looking down, Central Station—never truly asleep—was noisily waking up.\n He sipped his tea, and thought of the Oracle.\n The Oracle’s name had once been Cohen, and rumor had it that she was a relation of St. Cohen of the Others, though no one could tell for certain. Few people today knew this. For three generations she had resided in the Old City, in that dark and quiet stone house, her and her Other alone.\n The Other’s name, or ident tag, was not known, which was not unusual, with Others.\n Regardless of possible familial links, outside the stone house there stood a small shrine to St. Cohen. It was a modest thing, with random items of golden color placed on it, and old, broken circuits and the like, and candles burning at all hours. Weiwei, when he came to the door, paused for a moment before the shrine, and lit a candle, and placed an offering—a defunct computer chip from the old days, purchased at great expense in the flea market down the hill.\n Help me achieve my goal today, he thought, help me unify my family and let them share my mind when I am gone.\n There was no wind in the Old City, but the old stone walls radiated a comforting coolness. Weiwei, who had only recently had a node installed, pinged the door and, a moment later, it opened. He went inside.\n Boris remembered that moment as a stillness and at the same time, paradoxically, as a shifting, a sudden inexplicable change of perspective. His grandfather’s memory glinted in the mind. For all his posturing, Weiwei was like an explorer in an unknown land, feeling his way by touch and instinct. He had not grown up with a node; he found it difficult to follow the Conversation, that endless chatter of human and machine feeds a modern human would feel deaf and blind without; yet he was a man who could sense the future as instinctively as a chrysalis can sense adulthood. He knew his children would be different, and their children different in their turn, but he equally knew there can be no future without a past—\n “Zhong Weiwei,” the Oracle said. Weiwei bowed. The Oracle was surprisingly young, or young-looking at any rate. She had short black hair and unremarkable features and pale skin and a golden prosthetic for a thumb, which made Weiwei shiver without warning: it was her Other.\n “I seek a boon,” Weiwei said. He hesitated, then extended forwards the small box. “Chocolates,” he said, and—or was it just his imagination?—the Oracle smiled.\n It was quiet in the room. It took him a moment to realize it was the Conversation, ceasing. The room was blocked to mundane network traffic. It was a safe-haven, and he knew it was protected by the high-level encryption engines of the Others. The Oracle took the box from him and opened it, selecting one particular piece with care and putting it in her mouth. She chewed thoughtfully for a moment and indicated approval by inching her head. Weiwei bowed again.\n “Please,” the Oracle said. “Sit down.”\n Weiwei sat down. The chair was high-backed and old and worn—from the flea market, he thought, and the thought made him feel strange, the idea of the Oracle shopping in the stalls, almost as though she were human. But of course, she was human. It should have made him feel more at ease, but somehow it didn’t.\n Then the Oracle’s eyes subtly changed color, and her voice, when it came, was different, rougher, a little lower than it had been, and Weiwei swallowed again. “What is it you wish to ask of us, Zhong Weiwei?”\n It was her Other, speaking now. The Other, shotgun-riding on the human body, Joined with the Oracle, quantum processors running within that golden thumb . . . Weiwei, gathering his courage, said, “I seek a bridge.”\n The Other nodded, indicating for him to proceed.\n “A bridge between past and future,” Weiwei said. “A . . . continuity.”\n “Immortality,” the Other said. It sighed. Its hand rose and scratched its chin, the golden thumb digging into the woman’s pale flesh. “All humans want is immortality.”\n Weiwei shook his head, though he could not deny it. The idea of death, of dying, terrified him. He lacked faith, he knew. Many believed, belief was what kept humanity going. Reincarnation or the afterlife, or the mythical Upload, what they called being Translated—they were the same, they required a belief he did not possess, much as he may long for it. He knew that when he died, that would be it. The I-loop with the ident tag of Zhong Weiwei would cease to exist, simply and without fuss, and the universe would continue just as it always had. It was a terrible thing to contemplate, one’s insignificance. For human I-loops, they were the universe’s focal point, the object around which everything revolved. Reality was subjective. And yet that was an illusion, just as an I was, the human personality a composite machine compiled out of billions of neurons, delicate networks operating semi-independently in the grey matter of a human brain. Machines augmented it, but they could not preserve it, not forever. So yes, Weiwei thought. The thing that he was seeking was a vain thing, but it was also a practical thing. He took a deep breath and said, “I want my children to remember me.”\n Boris watched Central Station. The sun was rising now, behind the space port, and down below robotniks moved into position, spreading out blankets and crude, hand-written signs asking for donations, of spare parts or gasoline or vodka, poor creatures, the remnants of forgotten wars, humans cyborged and then discarded when they were no longer needed.\n He saw Brother R. Patch-It, of the Church of Robot, doing his rounds—the Church tried to look after the robotniks, as it did after its small flock of humans. Robots were a strange missing link between human and Other, not fitting in either world—digital beings shaped by physicality, by bodies, many refusing the Upload in favor of their own, strange faith . . . Boris remembered Brother Patch-It, from childhood—the robot doubled up as a moyel, circumcising the Jewish boys of the neighborhood on the eighth day of their birth. The question of Who is a Jew had been asked not just about the Chong family, but of the robots too, and was settled long ago. Boris had fragmented memories, from the matrilineal side, predating Weiwei—the protests in Jerusalem, Matt Cohen’s labs and the first, primitive Breeding Grounds, where digital entities evolved in ruthless evolutionary cycles:\n Plaques waving on King George Street, a mass demonstration: No to Slavery! and Destroy the Concentration Camp! and so on, an angry mass of humanity coming together to protest the perceived enslavement of those first, fragile Others in their locked-down networks, Matt Cohen’s laboratories under siege, his rag-tag team of scientists, kicked out from one country after another before settling, at long last, in Jerusalem—\n St. Cohen of the Others, they called him now. Boris lifted the mug to his lips and discovered it was empty. He put it down, rubbed his eyes. He should have slept. He was no longer young, could not go days without sleep, powered by stimulants and restless, youthful energy. The days when he and Miriam hid on this very same roof, holding each other, making promises they knew, even then, they couldn’t keep . . .\n He thought of her now, trying to catch a glimpse of her walking down Neve Sha’anan, the ancient paved pavilion of Central Station where she had her shebeen. It was hard to think of her, to ache like this, like a, like a boy. He had not come back because of her but, somewhere in the back of his mind, it must have been, the thought . . .\n On his neck the aug breathed softly. He had picked it up in Tong Yun City, on Mars, in a back-street off Arafat Avenue, in a no-name clinic run by a third-generation Martian Chinese, a Mr. Wong, who installed it for him.\n It was supposed to have been bred out of the fossilized remains of microbacterial Martian life forms, but whether that was true no one knew for sure. It was strange having the aug. It was a parasite, it fed off of Boris, it pulsated gently against his neck, a part of him now, another appendage, feeding him alien thoughts, alien feelings, taking in turn Boris’ human perspective and subtly shifting it; it was like watching your ideas filtered through a kaleidoscope.\n He put his hand against the aug and felt its warm, surprisingly rough surface. It moved under his fingers, breathing gently. Sometimes the aug synthesized strange substances; they acted like drugs on Boris’ system, catching him by surprise. At other times it shifted visual perspective, or even interfaced with Boris’ node, the digital networking component of his brain, installed shortly after birth, without which one was worse than blind, worse than deaf, one was disconnected from the Conversation.\n He had tried to run away, he knew. He had left home, had left Weiwei’s memory, or tried to, for a while. He went into Central Station, and he rode the elevators to the very top, and beyond. He had left the Earth, beyond orbit, gone to the Belt, and to Mars, but the memories followed him, Weiwei’s bridge, linking forever future and past . . .\n “I wish my memory to live on, when I am gone.”\n “So do all humans,” the Other said.\n “I wish . . . ” gathering courage, he continued. “I wish for my family to remember,” he said. “To learn from the past, to plan for the future. I wish my children to have my memories, and for their memories, in turn, to be passed on. I want my grandchildren and their grandchildren and onwards, down the ages, into the future, to remember this moment.”\n “And so it shall be,” the Other said.\n And so it was, Boris thought. The memory was clear in his mind, suspended like a dewdrop, perfect and unchanged. Weiwei had gotten what he asked for, and his memories were Boris’ now, as were Vlad’s, as were his grandmother Yulia’s and his mother’s, and all the rest of them—cousins and nieces and uncles, nephews and aunts, all sharing the Chong family’s central reservoir of memory, each able to dip, instantaneously, into that deep pool of memories, into the ocean of the past.\n Weiwei’s Bridge, as they still called it, in the family. It worked in strange ways, sometimes, even far away, when he was working in the birthing clinics on Ceres, or walking down an avenue in Tong Yun City, on Mars, a sudden memory would form in his head, a new memory—Cousin Oksana’s memories of giving birth for the first time, to little Yan—pain and joy mixing in with random thoughts, wondering if anyone had fed the dog, the doctor’s voice saying, “Push! Push!”, the smell of sweat, the beeping of monitors, the low chatter of people outside the door, and that indescribable feeling as the baby slowly emerged out of her . . .\n He put down the mug. Down below Central Station was awake now, the neighborhood stalls set with fresh produce, the market alive with sounds, the smell of smoke and chickens roasting slowly on a grill, the shouts of children as they went to school—\n He thought of Miriam. Mama Jones, they called her now. Her father was Nigerian, her mother from the Philippines, and they had loved each other, when the world was young, loved in the Hebrew that was their childhood tongue, but were separated, not by flood or war but simply life, and the things it did to people. Boris worked the birthing clinics of Central Station, but there were too many memories here, memories like ghosts, and at last he rebelled, and gone into Central Station and up, and onto an RLV that took him to orbit, to the place they called Gateway, and from there, first, to Lunar Port.\n He was young, he had wanted adventure. He had tried to get away. Lunar Port, Ceres, Tong Yun . . . but the memories pursued him, and worst amongst them were his father’s. They followed him through the chatter of the Conversation, compressed memories bouncing from one Mirror to the other, across space, at the speed of light, and so they remembered him here on Earth just as he remembered them there, and at last the weight of it became such that he returned.\n He had been back in Lunar Port when it happened. He had been brushing his teeth, watching his face—not young, not old, a common enough face, the eyes Chinese, the facial features Slavic, his hair thinning a little—when the memory attacked him, suffused him—he dropped the toothbrush.\n Not his father’s memory, his nephew’s, Yan: Vlad sitting in the chair, in his apartment, his father older than Boris remembered, thinner, and something that hurt him obscurely, that reached across space and made his chest tighten with pain—that clouded look in his father’s eyes. Vlad sat without speaking, without acknowledging his nephew or the rest of them, who had come to visit him.\n He sat there and his hands moved through the air, arranging and rearranging objects none could see.\n “Boris!”\n “Yan.”\n His nephew’s shy smile. “I didn’t think you were real.”\n Time-delay, moon-to-Earth round-trip, node-to-node. “You’ve grown.”\n “Yes, well . . . ”\n Yan worked inside Central Station. A lab on Level Five where they manufactured viral ads, airborne microscopic agents that transferred themselves from person to person, thriving in a closed-environment, air-conditioned system like Central Station, coded to deliver person-specific offers, organics interfacing with nodal equipment, all to shout Buy. Buy. Buy.\n “It’s your father.”\n “What happened?”\n “We don’t know.”\n That admission must have hurt Yan. Boris waited, silence eating bandwidth, silence on an Earth-moon return trip.\n “Did you take him to the doctors?”\n “You know we did.”\n “And?”\n “They don’t know.”\n Silence between them, silence at the speed of light, traveling through space.\n “Come home, Boris,” Yan said, and Boris marveled at how the boy had grown, the man coming out, this stranger he did not know and yet whose life he could so clearly remember.\n Come home.\n That same day he packed his meager belongings, checked out of the Libra and had taken the shuttle to lunar orbit, and from there a ship to Gateaway, and down, at last, to Central Station.\n Memory like a cancer growing. Boris was a doctor, he had seen Weiwei Bridge for himself—that strange semi-organic growth that wove itself into the Chongs’ cerebral cortex and into the grey matter of their brains, interfacing with their nodes, growing, strange delicate spirals of alien matter, an evolved technology, forbidden, Other. It was overgrowing his father’s mind, somehow it had gotten out of control, it was growing like a cancer, and Vlad could not move for the memories.\n Boris suspected but he couldn’t know, just as he did not know what Weiwei had paid for this boon, what terrible fee had been extracted from him—that memory, and that alone, had been wiped clean—only the Other, saying, And so it shall be, and then, the next moment, Weiwei was standing outside and the door was closed and he blinked, there amidst the old stone walls, wondering if it had worked.\n Once it had all been orange groves . . . he remembered thinking that, as he went out of the doors of Central Station, on his arrival, back on Earth, the gravity confusing and uncomfortable, into the hot and humid air outside. Standing under the eaves, he breathed in deeply, gravity pulled him down but he didn’t care. It smelled just like he remembered, and the oranges, vanished or not, were still there, the famed Jaffa oranges that grew here when all this, not Tel Aviv, not Central Station, existed, when it was orange groves, and sand, and sea . . .\n He crossed the road, his feet leading him; they had their own memory, crossing the road from the grand doors of Central Station to the Neve Sha’anan pedestrian street, the heart of the old neighborhood, and it was so much smaller than he remembered; as a child it was a world and now it had shrunk—\n Crowds of people, solar tuk-tuks buzzing along the road, tourists gawking, a memcordist checking her feed stats as everything she saw and felt and smelled was broadcast live across the networks, capturing Boris in a glance that went out to millions of indifferent viewers across the solar system—\n Pickpockets, bored CS Security keeping an eye out, a begging robotnik with a missing eye and bad patches of rust on his chest, dark-suited Mormons sweating in the heat, handing out leaflets while on the other side of the road Elronites did the same—\n Light rain, falling.\n From the nearby market the shouts of sellers promising the freshest pomegranates, melons, grapes, bananas, in a café ahead old men playing backgammon, drinking small china cups of bitter black coffee, smoking nargilas—sheesha pipes—R. Patch-It walking slowly amidst the chaos, the robot an oasis of calm in the mass of noisy, sweaty humanity—\n Looking, smelling, listening, remembering, so intensely he didn’t at first see them, the woman and the child, on the other side of the road, until he almost ran into them—\n Or they into him. The boy, dark skinned, with extraordinary blue eyes—the woman familiar, somehow, it made him instantly uneasy, and the boy said, with hope in his voice, “Are you my daddy?”\n Boris Chong breathed deeply. The woman said, “Kranki!” in an angry, worried tone. Boris took it for the boy’s name, or nickname—Kranki in Asteroid Pidgin meaning grumpy, or crazy, or strange . . .\n Boris knelt beside the boy, the ceaseless movement of people around them forgotten. He looked into those eyes. “It’s possible,” he said. “I know that blue. It was popular three decades ago. We hacked an open source version out of the trademarked Armani code . . . ”\n He was waffling, he thought. Why was he doing that? The woman, her familiarity disturbed him. A buzzing as of invisible mosquitoes, in his mind, a reshaping of his vision come flooding him, out of his aug, the boy frozen beside him, smiling now, a large and bewildering and knowing smile—\n The woman was shouting, he could hear it distantly, “Stop it! What are you doing to him?”\n The boy was interfacing with his aug, he realized. The words came in a rush, he said, “You had no parents,” to the boy. Recollection and shame mingling together. “You were labbed, right here, hacked together out of public-property genomes and bits of black market nodes.” The boy’s hold on his mind slackened. Boris breathed, straightened up. “Nakaimas,” he said, and took a step back, suddenly frightened.\n The woman looked terrified, and angry. “Stop it,” she said. “He’s not—”\n Boris was suddenly ashamed. “I know,” he said. He felt confused, embarrassed. “I’m sorry.” This mix of emotions, coming so rapidly they blended into each other, wasn’t natural. Somehow the boy had interfaced with the aug and the aug, in turn, was feeding into Boris’ mind. He tried to focus. He looked at the woman. Somehow it was important to him that she would understand. He said, “He can speak to my aug. Without an interface.” Then, remembering the clinics, remembering his own work, before he left to go to space, he said, quietly, “I must have done a better job than I thought, back then.”\n The boy looked up at him with guileless, deep blue eyes. Boris remembered children like him, he had birthed many, so many . . . the clinics of Central Station were said to be on par with those of Yunan, even. But he had not expected this, this interference, though he had heard stories, on the asteroids, and in Tong Yun, the whispered word that used to mean black magic: nakaimas.\n The woman was looking at him, and her eyes, he knew her eyes—\n Something passed between them, something that needed no node, no digital encoding, something earlier, more human and more primitive, like a shock, and she said, “Boris? Boris Chong?”\n He recognized her at the same time she did him, wonder replacing worry, wonder, too, at how he failed to recognize her, this woman of indeterminate years suddenly resolving, like two bodies occupying the same space, into the young woman he had loved, when the world was young.\n “Miriam?” he said.\n “It’s me,” she said.\n “But you—”\n “I never left,” she said. “You did.”\n He wanted to go to her now. The world was awake, and Boris was alone on the roof of the old apartment building, alone and free, but for the memories. He didn’t know what he would do about his father. He remembered holding his hand, once, when he was small, and Vlad had seemed so big, so confident and sure, and full of life. They had gone to the beach that day, it was a summer’s day and in Menashiya Jews and Arabs and Filipinos all mingled together, the Muslim women in their long dark clothes and the children running shrieking in their underwear; Tel Aviv girls in tiny bikinis, sunbathing placidly; someone smoking a joint, and the strong smell of it wafting in the sea air; the life guard in his tower calling out trilingual instructions—“Keep to the marked area! Did anyone lose a child? Please come to the lifeguards now! You with the boat, head towards the Tel Aviv harbor and away from the swimming area!”—the words getting lost in the chatter, someone had parked their car and was blaring out beats from the stereo, Somali refugees were cooking a barbeque on the promenade’s grassy area, a dreadlocked white guy was playing a guitar, and Vlad held Boris’ hand as they went into the water, strong and safe, and Boris knew nothing would ever happen to him; that his father would always be there to protect him, no matter what happened.\n Lavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize."}