{"fingerprint": "y1t0z8nZX32gBUHhOR00c4KNQYA=", "sitename": "Clarkesworld Magazine", "title": "Deep into the Dark: A Conversation with Lavie Tidhar by Jeremy L. C. Jones", "author": "Jeremy L C Jones", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tidhar_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Deep into the Dark: A Conversation with Lavie Tidhar by Jeremy L. C. Jones", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Deep into the Dark: A Conversation with Lavie Tidhar\n It was easy to write.\n “I honestly wish I knew why,” said Lavie Tidhar. “Some books are like that. Most aren’t! It just felt right but, you know, I wish that could happen with every book, but the truth is it’s so rare, you just have to be thankful when it happens.”\n He’s talking about Osama, the winner of the 2012 World Fantasy Award for Best Novel—a novel featuring a pulp writer, a detective, a vigilante named Osama Bin Laden, and a view of the world that seems at once brilliant and dark, dulled by a wise man’s weariness and sharpened by a young man’s exposure to a very real, very immediate truth.\n Tidhar, who was born in Israel, has spent most of his adult life travelling, each trip seeming to add a layering to his writing, while deepening his sense of rootedness in the past. Story after story and novel after novel—from The Bookman Histories to Martian Sands to The Violent Century (due out this month) there is always that forward thrust, that delving deeper into a darker space that is also, somehow, more revealing, more full of light.\n I went into our interview expecting the globe-trotting man of letters to be simply bubbling with enthusiasm for his craft. He is not, mind you, a grump or premature curmudgeon, but his relationship sitting at the keyboard is a bit more conflicted than I expected.\n “I don’t know if enjoy is the right word,” said Tidhar. “But if I don’t do it for a length of time I know get very irritable, restless, physically itching to write. So perhaps ‘obsession’ would be a better description.”\n Fortunately for the world, Tidhar’s obsessions—whether writing, collecting Hebrew pulp fiction, writing screenplays, or what have you—tend to be entertaining, evocative, and enlightening.\n How about James Ellroy’s blurb for The Violent Century: “A brilliantly etched phantasmagoric reconfiguring of that most sizzling of eras—the twilight 20th.” What do you think of it? Is he spot on? Off?\n To be honest, I’m just so chuffed to have a James Ellroy blurb! I finally got to read his books when I was living in Laos, in 2008—a short time after writing Osama, I think—and I admire more than anything just how deep he is willing to go inside, the courage of putting everything on the page, no matter how sordid or terrible it is.\n It’s a courage I don’t quite have yet, though I hope I am getting closer—the novel I’ve been working on the past year is the one where I’ve really tried to go deep into the dark, if that makes sense (and it was a strange and uncomfortable experience! It can really mess you up, that sort of thing).\n Can you expand on “deep into the dark” and how it relates to the novel you're currently working on?\n I think in a way it’s my most personal novel, in that it goes deepest into my obsessions, particularly with the Holocaust, but with pulp fiction, with pornographic fiction (which I’ve been fascinated by as a mode of storytelling). I wrote it very quickly, mostly at night, because it was such an unpleasant space to inhabit, but at the same time, like with Osama, it felt very true to be doing it. I think it’s very dark, but also very funny, if that makes sense. We’ll see what happens!\n Can you talk a little bit where you started with The Violent Century? How you developed it? What some of the surprises were along the way?\n I keep referring to The Violent Century as my “accidental book”. I never meant to write it!\n It started with an e-mail exchange with a friend of mine who’s a film producer in the UK. She mentioned in passing they had been looking to make a British superhero film, but never found the right script. So I fired off an e-mail banging on about how well of course you can’t do that because you have to understand superheroes in terms of the Jewish experience during the lead up to World War 2 (virtually all the creators of superheroes were first generation Jews born in the United States to immigrant parents). And once I wrote that, I kind of thought, well, actually, that’s not such a bad idea! So I sat down that same day and wrote, I think, five or eight pages of script, and then forgot about it.\n At the time I was moving back to the UK, and I got stuck for a couple of months visiting my parents, sorting out paperwork, so to keep myself occupied I worked on the screenplay of what was going to become The Violent Century. And I was quite happy with it! It was fun (I write screenplays occasionally for fun, as weird as that sounds!)\n I showed it to my friend, and she liked it—but she also pointed out that, as a movie, we were looking at something that could only really be done by a big Hollywood studio. “Why don’t you turn it into a novel?” she said. And again, this little light bulb went off in my head and I thought, well, why not turn it into a novel!\n So it was all very accidental—and also a very different experience, an experience in adaptation, really, which is something I am fascinated with. It was hard work . . . It went through an enormous amount of drafts and, of course, the book is a very different creature to the screenplay. I was also working on a comics adaptation of it, to the extent that we had the first issue written, and a few pages of art—I hoped we could sell the comics first and then the novel but, as it turned out, the book sold very, very quickly after submission, and my artist (Paul McCaffrey) and I went on to do a comic called Adler instead (Titan Comics is releasing it next year).\n What’s “fun” about working on a screenplay. Or, put differently, how is it different for you to create stories in that form as opposed to narrative prose?\n Maybe it’s stripping the story down so much. I’m quite minimalist, which is good. I don’t need to provide elaborate descriptions or instructions, I can just go straight in with character and dialogue and a maybe little bit of stage-setting. It’s different! And a ninety page screenplay is much quicker to write than a novel, it’s like taking a break. And of course writing screenplays has worked out quite well for me—one eventually became The Violent Century, one became Adler (my forthcoming comics mini-series) and I’m actually writing one now for some producers, so I have a genuine writing “gig”. We’ll see what happens with it!\n What’s at the heart of the book for you?\n To me, and I think like Osama, The Violent Century is a love story. That’s the core of it.\n There’s a murder mystery of sort in there, and the big historical stuff I love to do, and it does I hope say something about our conception of heroism, and it’s about World War 2, and to a much smaller extent the Holocaust (which, again, I think you can only understand superheroes if you understand the world that created them). But at the heart of it, it’s a love story. What else is there to write about, if not love?\n Ironically, some early reviews seem to suggest I was “obviously” inspired by all different kinds of comic books. The truth is I never read much comics—it wasn’t something we really had when I was growing up. I have been trying to educate myself more in reading them, and I love hanging out with comics creators, who are some of the nicest people you’d ever meet—but I was trying to come at the theme as if it were being created from scratch, in the 1930s, by these geeky Jewish kids (which I suppose is what I am!)\n You know, they all had to change their names—Stanley Lieber became Stan Lee, Jacob Kurzberg became Jack Kirby, Robert Kahn became Bob Kane. I was fascinated by that erasure. And Lee and Jerry Siegel both appear as minor characters in The Violent Century!\n I wonder what your geeky Jewish kid turned early 20th Century American comic book writer would’ve been. And how would changing your name to fit a market effect your writing? Would it be freeing? Limiting? Like wearing a mask? Like being forced to hide?\n I was thinking about this recently, actually—I’d have gone for an Anglophone sounding equivalent—Larry Tiddler or something equally ridiculous, which sort of sounds the way English people usually tend to pronounce my name anyway!\n My writerly alter-ego, who sometimes appears in the fiction, is Lior Tirosh. I also quite like the pen name “Sebastian Bruce” (who is briefly mentioned in Osama, and who I have written a short biography of—where he said “never trust a man with two first names.”).\n The habit of using Anglophone names was quite common in Hebrew pulp fiction, where it was by “Mike Longshott” or “Kim Rockman”—great names! And then the actual writer’s name was usually given as “Translated by”. So I love the idea of alter egos and fictitious identities, but I think I’m far enough in to just stick with ‘Lavie Tidhar’ and hope for the best.\n Hebrew pulp fiction! Can you talk a little more about Hebrew pulp novels influenced your writing?\n They’re wonderful—wonderfully bad, and with the most amazingly lurid covers imaginable. They were pocket books, cheap paperbacks from the 1950s and 1960s—so many of them essentially produced by this one publisher, under different names. It’s said some of the best Israeli writers got their breaks writing pulps to begin with (under a host of pseudonyms).\n I’ve been fascinated with them for a long time, especially the infamous Stalag novels, or Nazisploitation material that was incredibly popular (in an under the counter sort of way) in the 1960s, and which is incredibly rare (and collectible) now. They’re violent, pornographic (though very tame by today’s standard) and I think were able to say something, in pulp, that mainstream fiction wasn’t able to deal with.\n I collect Hebrew pulp, to an extent—I was lucky recently that I lived in Jaffa right next door to its grand flea market, and I was able to walk through the market and pick up these incredibly rare books for next to nothing—romance chapbooks from the 1940s, early pornography, spy series (the improbable Patrick Kim: Karate Man, about a two meter tall Korean secret agent, which ran for years and an enormous amount of titles)—the marginal literature that people read but that is seldom recorded, seldom acknowledged.\n The one I’m particularly obsessed with is the (real life) figure of David Tidhar, known as “the first Hebrew Detective”. He was a larger-than-life character who became the hero of a series of chapbooks written about him. I have two of them—they date back to the 1930s. I also have a signed copy of his autobiography, which is utterly bizarre—in four pages early on he seems to single-handedly—and in cold blood!—kill about forty people! He’s appeared in a couple of my works—particularly “The Projected Girl”, a novelette Ellen Datlow published a couple of years back in an anthology called Naked City. And he’s forthcoming again in a story I did for an anthology called Tel Aviv Noir. But I’m not done with him yet . . .\n Back to The Violent Century: how did that novel challenge you in ways that your other books haven’t?\n It was a nightmare to write! You know, Osama was probably the easiest thing I ever wrote, strangely enough. And the book I’ve been working on this year, I wrote it incredibly quickly (mostly because it was so dark—I couldn’t bear the thought of spending too long in that mental space).\n The Violent Century was the opposite. It was hard, it was slow, it went through rewrite after rewrite—but each time it was getting closer to what it should have been. I made a stylistic choice early on in the way it is told, and the response to that wasn’t good, and I stopped working for three months because I didn’t know what to do—and then I decided I knew best after all, and kept going. You have to trust your instincts (though it can be scary!).\n And it was written very much in the middle of a lot of transition, both in my circumstances and in my career—I started work on it when I thought my career was essentially over before it’s began, and finished it literally a week before winning the World Fantasy Award for Osama. So it’s been a real rollercoaster in many ways!\n You’ve lived and traveled all around the world. How do you suppose that has affected your writing and sense of place?\n I’ve said it before, that sense of place is incredibly important to me—not necessarily in overblown descriptions of places but for my own feel for a place in order for me to write about it. But at the same time, though I have set stories widely across the world, and I’ve lived in many of those places, I am increasingly uncomfortable with doing that—I am feeling more and more that I need to concentrate on my personal background, heritage, geography. I’m conflicted, in a way.\n Vanuatu was a big influence on my science fiction short stories, for instance in the use of Bislama (the pidgin/creole English used in Vanuatu) which has fed into my fiction a lot. Laos strongly influenced Gorel & The Pot-Bellied God (and Osama starts and ends there). I’ve been lucky—I’ve climbed volcanoes and sailed canoes and I’ve lived in some of the most remote and beautiful places on Earth. I’ve hitchhiked across Eastern Europe and Southeast Africa. I travelled on the trans-Siberian railway and stood on a frozen river of ice in the Gobi desert. But so what? That doesn’t make you a good writer, necessarily (though it can make you a boring dinner companion!).\n So I’m trying to go deeper inside myself, instead. And to write honestly and authentically from my own identity.\n Which is not to say I’m at all averse to writing the occasional very silly mash-up!\n You started off as a poet, with a Hebrew collection, and poetry continues to appear in your work—both English poetry and I think also Bislama poetry? What is the importance of poetry to you?\n I’ve said this before, that I wish I was a great poet, but I’m not—I’m decent, maybe even good, but I won’t be great, the way Larkin or Plath were, say. Or Amichai or Celan—take your pick. I did publish, a little, here and there, but if I do write (which is very infrequently, sadly—and I think you never know if you’ll ever write another poem, which is what happened to Larkin, he knew it was over, and that was three years I think before he died—it was all gone), well, these days I just work them into the novels or a story, so at least they’re there, if only for myself!\n Back when we started, you mentioned the novel you’re working on now. Can you talk a little bit about it?\n I don’t want to say much at this stage, obviously—it’s on the face of it a Hardboiled detective novel, which is actually quite hard to do, a proper Hardboiled (Osama is noir, but it’s very far from Hardboiled!)—but of course it’s not really a detective novel at all. It’s sort of alternate history, but again, like Osama, it’s not really an alternate history either. It’s . . . going to be interesting to see what happens with it. I’m just going over it now before sending it to my editor. And it’s about the Holocaust again—I think this will have to be my last work set in, or about, World War 2 for a while (after Martian Sands and The Violent Century). I just can’t sustain it any more. It’s draining, but something I also can’t escape. My mother was born in a refugee camp in Germany, her parents survived Auschwitz. Most of my family died there. A handful lived through the camp. It’s something that I need to talk about almost obsessively, but finding the right way, the right form of art in which to do it, that’s difficult, and I think I come at it from a weird angle.\n But this will be my final statement on a lot of that stuff—Nazism and sexuality and pulp fiction and Hitler and Zionism and and metafictional worlds and what have you! And there are a couple of novellas still that I’m toying with about all that. But I’d like to write something very different after that. And a part of me just wants to do an honest-to-God big old science fiction novel. And a part of me—in all seriousness—wants to do a Star Wars novel. Just because I’d be fascinated to take that big property and try and treat it really seriously—do a literary novel set in that world!\n Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle."}