{"fingerprint": "O1M6rIqP0sEUoPOJ9ZmcBArOiKU=", "sitename": "Clarkesworld Magazine", "title": "Rain Falling in the Pines by Lavie Tidhar", "author": "Lavie Tidhar", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tidhar_10_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Rain Falling in the Pines by Lavie Tidhar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7490 words, short story\nRain Falling in the Pines\n1.\nTwo men in dark sunglasses stepped through the doors of the Monte Carmelo. They stopped and scanned the gloomy inside. Geshem-Nofel-Ba’oranim clocked them and kept to his booth. He knew trouble when it walked through the door looking for him.\nThe two men were armed. Security, probably federal. That’s if Geshem was lucky, if it wasn’t someone he owed money to.\nThe two men stepped up to the bar.\n“Looking for a Neand,” one said.\nThere was a sudden silence around them at the slur.\n“Don’t know any First Humans,” the bartender said. She polished a glass. Kept her face carefully blank. Kept one hand on the EMP device under the counter.\n“Goes by the name of Geshem.”\nThe Monte Carmelo sat on the edge of the First Human Sanctuary and the Federated Lands of Judea Palestina. The border wasn’t neat. The Sanctuary encompassed most of Mount Carmel, which had been home to the original First Humans a long time in the past, and it extended down to the Hills of Menashe and past Armageddon to the Jezreel Valley and into the Galilee. The Monte Carmelo sat somewhere on the border, between Druze villages and the monastery of the Carmelites, each of which had their own dispensation, so questions of authority were the sort of questions it was best not to ask. Which was what drew the sort of people who drank there to the Monte Carmelo.\n“Shin Bet or Shurta?” the bartender said. Her name was Mili, and she was wired with the sort of old-school upgrades backstreet surgeons still performed over the border in Sidon or Beirut, the sort of stuff that made you a little faster and a little tougher, just like First Humans were. Geshem thought he could trust her. But he couldn’t be sure.\n“I’m Cohen, this is Haddad,” the man on the left said. His hair was thinning on top. “We’re with Antiquities.”\n“No antiquities here,” Mili said.\n“It’s all antiquities here,” Haddad said. He had a pencil moustache. “Where’s the Neand?”\nGeshem sank low in the booth. He could make a run for it, but he didn’t know into what. So he stayed put for the moment. He squished a green ball in his hand.\nMili shrugged. “You’re in the wrong place, friend,” she said.\n“Not your friend,” Haddad said. His partner smirked.\n“We can shut you down,” Cohen said.\n“On what grounds?”\n“Smuggling.”\n“We’re under Carmelite protection,” Mili said. “Besides, I’m just the bartender. You want, I can sell you a beer. What did he do, anyway? This Geshem?”\nCohen shrugged. Haddad said, “Took something he shouldn’t have, didn’t he.”\n“You want a beer?” Mili said.\n“I don’t want a beer,” Cohen said. He and Haddad pulled out weapons. They were short snub-nosed pistols, ugly. They weren’t quite pointing them. But they weren’t being subtle about it either.\nThe rest of the clientele didn’t like it, Geshem knew. The Monte Carmelo catered to people who didn’t have much to do with the law. But they wouldn’t look too kindly on Geshem either, for bringing the law to this place. So Geshem slid out of the booth and came out slowly, arms raised.\n“I didn’t do nothing,” he said.\nCohen and Haddad turned. Cohen smiled an ugly smile. Haddad just looked confused. Geshem smiled back at Cohen. Then he let go of the ball he was holding.\nIt rolled across the floor of the bar and stopped at the feet of the two Antiquities men. It was green and squishy. Geshem had bought it off of a Tiberian gene-shaman, and to be honest he didn’t know quite what to expect.\nWhen the ball exploded it made a sort of wet whoomph sound. It splattered the two men with goo.\n“Get it off me, get it off!”\nHaddad squeezed off a shot. It went wide, hit the ceiling. Patrons glowered into their beers. The green stuff crawled over the two men from Antiquities, growing furry and glowing like cave moss.\nMili shouted, “No guns in the bar!” She hopped over the counter and took their weapons. Geshem ran for the door.\n“Keep my tab open!” he shouted behind him.\n“You’re barred!” Mili shouted. But by then Geshem was outside.\nThe Carmel Mountain, ancient, sacred, strewn with bones and fought over ever since Homo Sapiens first set foot in First Humans land, sloped down to the valley below. Somewhere beyond the trees was the road, a digitally federated thruway linking Gaza City and Tel Aviv to Haifa and Lebanon, cutting like a knife through the Sanctuary. But Geshem figured as long as he avoided the road, and as long as he could shake off the two Antiquities agents and get back into his peoples’ enclave, he should be fine. He laughed and ran into the trees, taking with him the backpack with the roc’s egg he really wasn’t supposed to be carrying.\n2.\nGeshem-Nofel-Ba’oranim didn’t even want the roc’s egg. He’d been hoping for something a little less bothersome when he made the trek to the Sea of Galilee to see the gene-shaman.\nThe gene-shaman was a Sapi, some old Jewish dude who was wanted across the intertwined strips of both Judean and Palestinian authorities and in a few other places besides. So like other Sapis who needed a place to lie low, he crossed into First Human territory, since Geshem’s people only got the land in the first place because it was jungly, swampy, and filled with, not to point too fine a point on it, monsters.\nRelics of the old wars, specifically, from behemoths and great taninim to derelict manshonyaggers, roc nests, djinns, UXOs, mutated ants, and nanogoo swamps. Not to mention the cave bears and the killer robots.\nRobots. Now there was a thing Geshem didn’t like. Call him bigoted, but he just didn’t trust them. Some even came down from Central Station into First Human land to preach the Way of Robot, and they were all about doing no harm to people even though, he thought darkly, even though what did people make robots for in the first place if not to kill people? And the other thing, whenever he met one of the old humanoid robots was, he was never sure they thought First Humans were, well, people. Even though they were always very polite and all. The problem was, they were modeled on Sapis, not Neands—pardon the slur. It was galling to be named after some German pastor.\nThe point being, if you were running from something or hiding from something you came to the First Humans, and for the most part, as long as you were cool you got to stay, and the gene-shaman was cool insofar as he kept himself to himself, and he knew better than to screw you on a deal—or so Geshem thought then, at least. Now he wasn’t so sure.\nThere were no roads and no cars going through the Sanctuary. There were no drones other than the old feral war drones that still lived there, and even the Conversation was muted across the Sanctuary, though echoes of it still fed through. Most First Humans weren’t noded, and if they had to access the virtuality they did it the old-fashioned way, with a screen or a rig or an immersion pod. So Geshem made the trek, past Armageddon, all along the Jezreel and through the mountains to Tiberias and the lake. It really was beautiful country. The heat didn’t bother him, and his genetic signature confused most of the old predators, since they were coded for Sapis, back in the days when First Humans were still extinct.\nIt was a long trek, though. This wasn’t Central Station with the ships coming down from orbit, though you could see them darting like fireflies in the night above the Sanctuary. This wasn’t Gaza City either, with the gleaming port and floating islands and the glass and chrome pipes that ran down to the underwater cities of the Drift. This was bad old detritus and debris land, where the bones of Geshem’s ancestors still lay deep down in the mud.\nHe reached Tiberias, and he saw the lake, and the monsters in the water. He sat with the gene-shaman ’round the fire and swapped stories and then they talked shop.\n“You got that thing I asked for?” the gene-shaman said. His name was Lotem.\nGeshem brought out the package, wrapped in waterproofed mammoth hide. Back in the Great Rebirthing, the Denisovans got much of Siberia, and this was Siberian mammoth leather, the real deal. Inside it was the stuff Lotem had asked for.\n“What is it, anyway?” Geshem said.\n“Latest drop from the Kunming labs,” Lotem said. “It’s just code. Genome sequencing and stuff. You know.”\n“To make monsters, sure,” Geshem said.\n“It’s not just monsters,” Lotem said, looking genuinely agitated. “It’s good stuff, too. Like those nano-mites that got released into the oceans to eat the Pacific Trash Vortex and the North Atlantic Garbage Patch and stuff.”\n“Didn’t they go rogue and start eating all kinds of other things, like ships and subs?” Geshem said. “And then there was a story about whole islands vanishing.”\nLotem rubbed his hands together. “Alright,” he said, “so that was a bad example. I’m just saying.”\n“Look, man,” Geshem said. “I don’t care what you need it for. What have you got for me, is what I want to know.”\n“I got this,” Lotem said. He rummaged around in a pile by the fire and came back with the egg. The egg was about the size of a human head, and heavy. The shell was a smooth warm metal, and it glowed faintly from inside.\n“What do I need with a roc egg?” Geshem said.\n“It’s not your regular roc egg,” Lotem said.\n“Where did you get it?”\n“The Golan. Don’t ask.”\n“You went over?” Geshem said, wondering if the gene-shaman was stupid or mad or both.\n“It’s where all the primo stuff is, my man. Old old war stuff. But this isn’t old. It’s new.”\n“It’s a roc egg,” Geshem said. He felt almost insulted. It was a long trek to the lake, and it would be a long trek back. “What do you want me to do with it, make a roc omelet?”\nLotem smiled politely at the old joke.\n“It’s fertilized,” he said. “See here?” He pointed to a spot on the egg. Geshem squinted but it looked solid to him.\n“Someone inseminated it with off-world wildtech,” Lotem said. “I think.”\n“You think?”\nLotem shrugged. “Nakaimas from Jettisoned.”\nTranslation: bad magic from the last outpost on Charon. Geshem had never been off-world, though there were some First Humans on Mars. People only lived on Jettisoned because that’s what happened to them, they were jettisoned off the Exodus ships as they departed the solar system. All the wildtech in the solar system came from that lawless hell on Charon. But how some of it ended up in the Golan and inside a roc’s egg, he had no idea. The Golan has been an involuntary park for centuries, ever since a terror-artist dada bomb went off there. Not even a First Human tracker would go into the Golan.\n“What’s it like there?” he said, fascinated.\n“Pretty,” Lotem said. “Weird. It looks really peaceful, until something awful crawls out of the ground or swoops down on you. The shadows all fall wrong. Some of the rocks talk and some of the animals aren’t really animals, but you can’t . . . ” He fell quiet. “You can’t tell what they are,” he said.\n“How did you go there and still get out alive?”\n“Protection,” Lotem said. He showed Geshem the disc hanging ’round his neck, looped through with string.\n“It’s a terror-artist artifact?” Geshem said, impressed. Those things were so rare as to be nonexistent. And the real stuff was more likely to kill you than protect you.\n“Made by Nasu, supposedly. Someone sold it to me in the flea market in Jaffa. Didn’t know if it was genuine but . . . ” Lotem shrugged. “I got in and I got out again, so it has to be. It must null some of the worst effects of the dada bomb.”\nAs fascinating as all this no doubt was, Geshem realized none of this really answered his questions, which were one, what exactly the egg was, two, how Jettisoned wildtech even ended up in the Golan, and more importantly, three, what, if anything, it was worth.\nStill. A trade was a trade. He took the egg, and some green goo grenades, and a handful of Sidorov embryo-mech maker beans that he was going to either sow or sell. So all in all it wasn’t a bad deal.\nAt least that was what he figured until the first attack came.\n3.\nHe was deep into Sanctuary land by then and no one should have messed with him there, only there they suddenly were, four white ghosts dropping out of the trees soundlessly. Sapis with Uzis, because old guns were still the best guns.\nThey fired. He ducked and rolled. Humans hunting his kind—again. He felt his hatred of them rise like bile. He vanished into the trees. He put on goggles and watched ghosts with digital imprints track him. He could smell them without looking. He could smell swamp water. He ran and they followed, but the water was near. Geshem slipped into the mud. He crouched low. He whispered invocations.\nThe four assassins materialized soundlessly. They moved without hurrying. They had to be good to have made it this far into the Sanctuary. Combat rewired bodies, the works. But this was Geshem’s land.\nWhen the Tanin burst out of the swamp its tail swatted trees like matchsticks. A huge mouth opened, teeth like giant blades. The assassins ran, or tried to. The Tanin’s neck whipped this way and that, the head on it like a pea at the end of a stalk. Two huge eyes burned yellow and green. They looked at the intruders dispassionately. Geshem didn’t know what ancient lab created the Taninim. This one was only a minor Tanin. The Great Taninim of old still lived, but only deep in the secret heart of the Sanctuary.\nThe white ghosts fled.\nThe Tanin fed.\nAfter a while the Tanin slunk back into the swamp and Geshem climbed out. He found a foot and, a little later, an intact hand. He took the hand.\nFilaments still twitched inside the flesh and blood. Augmented, but he knew that already. Geshem wondered who would send mercenaries after him. The fingerprints had been burned clean off. He tossed the hand into the swamp, a respectful offering to the Tanin.\nHe spent the night in the ruins of Afula, a Sapi town overgrown with jungle now. This was ancient First Human land. When the Sapis first came over from Africa, Geshem’s people had already been living in this place. Their stone tools still littered the ground. Whenever he found one of the worked flint knives, he held it in his hand and marveled at how well it fit, and at that continuity with his own ancient past. But Sapis bred quickly, and First Humans didn’t, and eventually only the Sapis were left of all the human races of the Earth.\nHe made a fire and sat all alone amidst the rotten fallen-down buildings of the Sapis. The stars shone bright overhead. He stared fascinated at the moving dots of light that were the shimmering orbitals rings and transport ships. Sapis always had to spread and conquer. They did it to the other human races and if they ever met aliens out there, they would do it to them too. You couldn’t blame them for it—it was just their nature.\nA beating of wings as large as sails bellowed in the night. Geshem saw a dark shape as large as an airplane hovering against the field of stars. The creature swooped low and came to stand beyond the light of Geshem’s fire.\nHuge eyes regarded him quizzically. A monstrous beak opened and closed without sound.\nLike the Taninim, the rocs were really just tweaked bioweapons. They were imprinted for Sapis, not First Humans. But Geshem had never seen one of the creatures this close before.\nHe stared at the roc.\nThe roc stared at Geshem.\nGeshem took out the egg.\n“Is this what you’re after?” he murmured. The roc inched its head. You could get lost in its eyes, Geshem thought. The egg felt warm in his hands, alive somehow.\n“You can take it,” Geshem said. He carried the egg beyond the fire and placed it on the ground. The roc towered over him. Geshem backed away, slowly.\nThe roc lowered its head. It examined the egg.\nIt cooed.\n“Good roc,” Geshem said. “Good roc.”\nThe roc touched the front of its beak to the egg. Then it pulled back and opened two huge wings and cawed softly.\n“Good roc!” Geshem said desperately.\nThe wings thrashed. The creature rose into the air. It circled overhead and sped east.\nGeshem sat on his haunches and stared at the egg.\n“What are you?” he said softly. But there was no answer.\n4.\nCampfire smoke rose into the setting sun as Geshem approached the settlement the next day. Armageddon rose overhead. A brook bubbled gently, and Geshem inhaled the smell of fresh pines.\n“Geshem!” he heard the children crying. “Geshem’s coming!”\nHe grinned and opened his long arms wide as his niece, Alei-Shalechet-Noflim-Ba’stav, jumped on him.\n“Uncle Geshem!”\n“Shalechet,” he said, hugging her.\n“Did you bring me anything?”\n“Black gold to anoint your brow,” Geshem said. He had an unfortunate love for old Sapi songs. “Your forehead rhymes with eyes and with light.”\n“Uncle Geshem! Come on!”\n“I brought you a roc’s egg,” Geshem said. “Would you like to see it?”\nHer eyes grew wide.\n“Here,” he said carelessly. He opened the bag. Shalechet took the egg. An aura of visible spectrum light surrounded her head. The currents swirled and traveled down her arms to the egg. The egg shuddered.\n“It’s alive,” Shalechet said. “It’s saying . . . ” Her eyes grew wider. She was noded from birth, but not with a Sapi node. Some tinkered-with bespoke thing: it was unpredictable.\n“It’s cold,” she said. “It’s dark . . . It’s come from a great distance, from a place where the sun is small and cold in the sky . . . It wants to talk but can’t. It speaks in different protocols. It doesn’t understand what I am. It’s only seen Sapis before.”\n“You can understand all that? How?”\n“I don’t know . . . ”\nShe put the egg down on the ground and stared at it. “It was not meant to be here, Uncle Geshem. It was not sent to Earth for us.”\n“Then who?”\nShe shuddered. “I don’t know,” she said. “But they will come for it.”\nGeshem thought of the white ghosts in the forest.\n“I think they already have,” he said.\nHe spent the night by the fire, under the stars. The brook bubbled. His grandfather came and sat with him then. Ruach-Noshevet-Ba’gfanim. The old man had been to Mars, had worked the Lunar-Martian trade route in his youth. A First Human on Old Mars. He never tired of telling the tales. But he came back and made a family. He wasn’t noded, but he carried a communication disc around his neck, had a full-immersion pod buried out the back way and hooked up to solar. Geshem never went into the virtuality himself. He felt better in the physicality, where the digital ghosts of the Others seldom incurred.\n“This thing you brought,” Ruach said, “it has off-world code?”\n“Seems so, Grandfather.”\n“I heard stories, in the Up and Out,” Ruach said. “Strange rumors, even stranger code coming in from beyond the Oort. Dark entities as large as worlds, they say, amorphous filaments moving like tendrils. Or like sea anemones.”\n“Sea anemones?” Geshem said.\nHis grandfather nodded. “Out in there in Oort.”\n“Well, what are they?” Geshem said.\n“Some say they were made there long ago by the Spiders who seeded the solar system with the Conversation, but they mutated into a new network, new Others with different protocols. Some say it was ‘Mad’ Rucker, the Terror-artist, who also made the boppers on Titan. Some just say they’re aliens.”\n“Are they real?” Geshem said. “Or is it just a story?”\nRuach shrugged, a Sapi habit he’d picked up in the Up and Out.\n“Who knows,” he said. “But there are people who believe in them. You want to watch out, Geshem-Nofel-Ba’oranim. And you want to get rid of that thing you brought back with you.”\n“Soon as I sell it,” Geshem said. “I owe to those Toads from Kunming.”\nRuach nodded, another Sapi habit.\n“This was not wise,” he said. “Getting involved with the Toads.”\n“I am not as wise as you, Grandfather,” Geshem said, and Ruach grinned and slapped him on the shoulder, and Geshem laughed.\n“No,” his grandfather said. “You are not.”\n5.\nThe Kunming Toads started out as just another small-time outfit on the Golden Triangle Special Economic Zone between Luang Namtha, Chiang Rai, Tachileik, and Yunnan. They’d since upgraded meth to Plateau and Crucifixation, turned from people-smuggling to organ-legging, and finally veered into the lucrative market of extreme gene modification. Now they were a semirespectable guild with offices in nearly every Autonomous Zone, crypto anarchy, pirate utopia, and cyberstate across Earth and the Inner System—in other words, everywhere.\nThe problem was, Geshem didn’t so much get the data-drop that Lotem, the old gene-shaman, had asked for. It was more that he’d stolen it.\nOr, more to the point, he’d paid an uplifted octopus to do it for him.\nOctopi being a highly intelligent and generally morally compromised aquatic species who lived in the Drift and were more trustworthy on the whole than dolphins, who Geshem thought of, rather uncharitably, as the vermin of the sea.\nThis particular octopus went by the name Shraga. He lived in the Down Below past Gaza Port. Geshem managed to get him on the third attempt, using the encryption disc Shraga gave him and hooking up to a public node. He hated using the Conversation.\nMurky water, things moving in the dark.\nShraga said, “What do you want, Neand? I’m hunting snails.”\n“I had some ghost-types come after me recently,” Geshem said. “You wouldn’t happen to know anything about that, would you, Shraga?”\nThe octopus made a rude sound.\n“You have land-person problems,” Shraga said. “These are not my problems.”\n“I just wondered how careful you were when you stole that drop from the Toads.”\n“Shraga is always careful,” Shraga said. “That’s why Shraga is still alive, Neand. Why are you still alive? Your species already died out once.”\n“Listen, you eight-armed freak,” Geshem said, and Shraga laughed an octopus laugh and said, “No, you listen, Geshem. Don’t come pooping in my habitat when it’s your own that’s covered in crap. You know?”\nAnd he cut the connection.\nWhich meant the Toads probably weren’t after him, so he may as well reach out to them. He made a call. A fat green-skinned man answered on the screen. Folds of fat rolled down from his face. The fat inflated. A Kunming Toad. They got the name for a reason.\n“What do you want, Neand?” he said.\n“Baigujing,” Shemesh said, and the Toad inflated some more.\n“It’s Boss Baigujing to you,” he said.\nGeshem and the Toads went back: a short, sad history he didn’t like to dwell on.\n“Don’t call Sapis boss,” Geshem said.\n“Hardly a . . . Sapi,” Boss Baigujing said.\n“Tweaked genes, still Sapi genes,” Geshem said.\n“Hey, I have like three to five percent Neanderthal,” Boss Baigujing said, sounding hurt.\nGeshem wasn’t going to shrug, but he made a face.\n“I got something to sell,” he said.\n“Yeah? What’s that? Mammoth bones?”\nBaigujing laughed at his own joke.\n“This,” Geshem said. He held up the egg.\n“Roc’s egg? So what?”\n“Scan it.”\nThe Toad must have run a scan. He deflated. Cold eyes stared at Geshem through the old screen.\n“How much do you want for it?” Baigujing said.\n“What you offering?”\nThe Toad inflated. He laughed, but without much humor.\n“You don’t even know what it is, do you?” he said.\n“I know it’s valuable,” Geshem said. “And I have it.”\n“Bad magic,” Baigujing said. He inflated again, loomed huge and green-skinned in the viewport. “Bad magic.”\n“Tomorrow,” Geshem said. “Usual place. No tricks.”\n“We’re respectable businesspeople,” Baigujing said.\n“Business I like,” Geshem said. “It’s people I don’t trust.”\nBaigujing laughed as he cut the connection.\n6.\nSo now Geshem was running out of the Monte Carmelo with two guys supposedly from Antiquities after him and a no-show from the Toads. He never saw the two guys before.\nCohen and Haddad. They sounded like Tel Aviv lawyers.\nHow did they know where to find him?\nStupid question. Where else would he go to make a deal?\nHe hid in the pines. He pinged Shraga from a portable node—he came wired, this time.\nThe sound of bubbles, engine hum in the background. Shraga getting high on thermal vents from Gaza-Under-Sea.\n“What do you want, Geshem? I’m busy.”\n“Busy doing what?”\n“I’m . . . ” Grunt. “Breaking into a . . . ” Grunt. “Sky vault.”\n“What’s a sky vault, Shraga?”\n“It’s a vault in the . . . ” Grunt. “Sky.”\n“Like in orbit?”\n“Right.”\n“You ever been, Shraga?”\n“There’s the Down Below and there’s the . . . ” Grunt. “Up and Out. I’ll stick to the sea, thank you. Especially since the Sapis stopped dumping quite so much crap into it.”\n“Other than themselves,” Geshem said.\nThe octopus laughed. “I like the . . . ” Grunt. “Cities. They sparkle, Geshem. What do you want?”\n“I’m being chased by Antiquities.”\n“Again?”\nGeshem shook his head. Was someone moving in the trees? Could they track him? They had infrared vision and gene-sniffers tuned to First Humans, all kinds of nasty things.\n“It’s different,” he said.\n“Different how?”\n“Dunno. Can you find them for me? Cohen and Haddad.”\n“Do you know how many Cohen and Haddad there are? Hold on. I’ll pull the data from the Monte Carmelo . . . Got it. Huh.”\n“What?” Geshem said. The bad feeling he had just got worse.\n“They are Antiquities but they’re off-world Antiquities. What did you get yourself involved in, Geshem?”\n“I don’t know!”\n“Where would you get off-world artifacts? You live in the . . . ” A grunt again. “Sanctuary.”\n“I guess from . . . ” Geshem grunted. Maybe it was infectious. “Off-world,” he said.\n“Funny!” the octopus said. “Can I see it?”\n“It’s in my bag.”\n“Hold on . . . Ohhh . . . ”\n“Can you tell what it is?” Geshem said.\n“It’s old,” Shraga said. “It’s Oort code. That stuff’s not supposed to exist.”\n“Dark entities as large as planets?” Geshem said. “Tendrils and so on?”\n“That’s the story.”\n“You believe it?”\n“All I know is it’s weird code from space,” Shraga said. “Whatever you do don’t bring it into the Drift. Alright?”\n“I wasn’t planning to . . . ”\n“You have two lots of people coming for you, Geshem,” Shraga said. “Did you mention ghosts? Because you have ghosts coming at you from the slopes, and you have Toads coming at you from the—oh, hey, Mili.”\nThe bartender from the Monte Carmelo crashed into Geshem and pushed him against a pine.\n“Get lost, Shraga,” she said. “You’re about as useful as an octopus in a fight.”\n“Octopi are very good fighters,” Shraga said. He sounded hurt.\n“This way,” Mili said. She grabbed Geshem. He ran after her, lumbering through the trees. Mili was too tall, too graceful—too Sapi. Geshem was short and squat. They made it to the end of a clearing. An old wooden hut sat in the clearing, the house of some long-vanished caretaker.\n“It should be safe inside,” Mili said.\nGeshem let her lead him. Shraga had gone silent. Geshem-Nofel-Ba’oranim was keenly aware of the smell of the soil, the blueness of the skies, how quiet it was then, how quiet. He smelled it too late.\nThe door opened.\nHe turned to run.\nMili said, “Don’t.”\nShe had a gun pointed at him.\nShe pushed him into the dark inside of the hut.\n7.\nThree people stood within and watched him. Two were white ghosts, like the Sapis who had tried to hunt him in the Sanctuary before. The third one was different. She was barely human in form. Some extreme modification, off-world probably. He didn’t know. But still a Sapi under it all. A cocktail of bird genes: a hawk, a raven. When she spread her arms open, she had black-feather wings. A human mouth was melded with a beak.\n“Geshem-Nofel-Ba’oranim,” she said. “I am Ziz.”\n“What’s it to me?” Geshem said.\nHe looked accusingly at Mili. She shrugged, looking embarrassed.\n“You didn’t know you had a bounty on you?” she said.\n“We mean you no harm,” Ziz said.\n“Whatever it is,” Geshem said in a low voice, “I can double it.”\nMili smiled.\n“No, you can’t,” she said.\n“Will you please pay attention?” Ziz said. The bird-woman sounded annoyed, which pleased Geshem.\nHe said, “I am a First Human, and you have no claim here.”\n“I serve those who live beyond the sun and have no Earthly names,” Ziz said.\nSo she was one of those.\n“The Masters of the Nine Billion Hells!” Ziz said.\n“I’m sure,” Geshem said.\n“Just give me the egg,” Ziz said.\n“What egg?” Geshem said.\n“Search him,” Ziz ordered. Her ghosts moved on Geshem.\nHe said, “Don’t.”\n“Or what?” Ziz said. Her beak opened and closed hungrily.\nGeshem shrugged.\n“Or else it will blow up,” he said. “And us with it.”\nThe ghosts froze. Ziz closed her beak with a click. She stared at Geshem.\n“You’re bluffing,” she said.\n“I am not afraid to die,” Geshem said. “My people died out because of your people once before. None of us fear death. Or whatever those Nine Billion Hells are. So stand back, and we can talk.”\n“I can do that,” Ziz said.\n“I thought so,” Geshem said.\nWhy did Sapis always think First Humans were stupid?\nThe ghosts moved back and stared at Geshem without expression. Ziz shuddered and when she did her feathers changed color and became a deep golden-green.\n“You’re not from around here, are you?” Geshem said.\nZiz laughed.\n“Callisto,” she said.\n“Outer System? Figures.”\n“The voices of the entities in the dark are whispered more audibly there,” Ziz said.\n“I’m sure. Why do you want the egg?”\n“It belongs to us.”\n“How so?”\n“It has Oort code. It was not meant to . . . ” She hesitated. “It fell into the wrong hands.”\n“What is it, anyway?” Geshem said. “Oort code.”\n“There’s the Conversation,” Ziz said. “And then there’s that which isn’t.”\n“The Quietude,” Mili said. Ziz turned sharply, her beak clicking.\n“Yes,” she said.\n“A shadow network?” Geshem said.\n“Yes.”\n“Is it true?”\nHe knew the Conversation was seeded throughout the solar system. It had begun on Earth and spread through near-space and across the Great Crossing to the Outer System, self-replicating Spiders clinging to rocks, converting them into further Spiders, routers and hubs, broadcasting stations, mirrors and servers . . .\nHow could another network exist, undetected, unknown, amidst all the teeming worlds of humanity?\n“Yes,” Ziz said, just as Mili said, “No.”\n“What?”\n“No,” Mili said, and she moved her gun, and this time she pointed it at the bird-woman.\n“You will forfeit your fee?” Ziz said.\n“If this is what I think it is, then yes, gladly,” Mili said.\n“What do you think it is?” Ziz said.\n“A Quietude node,” Mili said. “And it’s ready to hatch.”\nZiz inched her head. The ghosts moved fast. Geshem was too slow to make it out clearly. They moved like, well, ghosts. But so did Mili.\nWhatever backstreet hardwire job she’d had done was worth the money. Old military tech kicked in. The ghosts and Mili danced as their movements blurred. Then it was over, too quickly, and the ghosts lay on the ground. Mili’s leg was broken. She pointed the gun at the bird-woman.\n“I’m taking him,” she said.\n“I’m just here to sell it,” Geshem said. He ignored Mili. “If you have an offer to make . . . ” he said to Ziz.\n“I will find you,” Ziz said. “We will always find . . . it. We just listen to the quiet.”\n“Move it, Geshem,” Mili said. She pushed him out and hobbled after him. She shut the door on the bird-woman and the ghosts.\n“I could cut you in,” Geshem said.\n“Shut up.”\nShe pushed him along. He went deeper into the trees. He could feel the egg in the backpack. It was moving.\n8.\nHe tried to make a run for it nearer the ravine. Mili blurred and then she was in front of him. Even with her leg broken she was too fast. Geshem saw it cost her, though. She burned energy bad, speeding up like this. And she was wounded. He figured he could wait.\n“I won’t,” she said. “If that’s what you’re thinking.”\n“I wasn’t thinking anything.”\n“I can see that.”\nThey were deep in digitally federated quilt by then. They passed from Druze to Jew to First Human to Arab to Carmelite authority and all over again. To Geshem, this didn’t mean anything. To him, the Carmel was all his. First Humans have lived here long before the first Sapis ever came.\nEvergreen. The mountain that is green all year round, as the old song went. Geshem knew where he was, where they were heading. He watched Mili, but she moved along faster now, and her leg looked better. Built-in medical nanobots repairing the damage. He was mildly impressed. Paying for this kind of wetware took some doing.\nA small black thing flew overhead and spoke to them.\n“Geshem-Nofel-Ba’oranim! This is Antiquities! Surrender yourself and your cargo!”\n“Can’t you see she’s kidnapping me!” Geshem shouted at the drone.\n“ . . . Ah,” the drone said.\n“So do something,” Geshem said.\nThe drone extended two tiny rods and aimed it at them.\n“Miss, drop down your weap—”\nThe drone exploded.\nGeshem ducked from the rain of hot plastic.\n“How did you do that?” he said.\n“I didn’t,” Mili said. Something large and green and mean-looking hopped in front of them then. A Toad grinned. A tongue like a rope lashed out and snatched Mili’s gun from her hand.\nMili said, “Run!”\nThat lash of a tongue whipped again, caught Geshem’s arm, and pulled. Geshem pulled back and the Toad hopped over him and vanished in the pines, the tongue unspooling.\n“Hey!” Geshem shouted. “I’m on your side! We had a deal!”\nHe heard the Toads croak laughter all around them. Geshem ran helplessly after Mili. Her leg seemed fine now, and she was even faster now than before. How did she do it?\n“You stole from us, Neand!” a voice boomed.\nBaigujing.\nSo the boss came in person.\n“How did you find out?” Geshem shouted. His wrist hurt where the Toad’s tongue had touched it. Poison Toads. But their poisons were designed for Sapis, not his kind.\nHe hoped.\n“We always find out, Geshem.”\nA Toad hopped in their path and Mili blasted it with a hand cannon Geshem couldn’t recall seeing before. The Toad exploded in a wet green cloud. Poisoned bits of Toad flesh landed. Geshem shielded his face.\n“I’ll sell it to you!” he screamed. “I don’t even want it!”\n“We’ll take it, and kill you,” Baigujing said. Geshem saw him for just a moment. The boss Toad was huge, the size of two men, and hopped impossibly high, that grotesque body augmented with titanium muscles.\nThe forest was all around them then. Geshem heard something whisper through the air. Saw a ghost materialize and take out a Toad like it was nothing, a hand reaching inside the green flesh and squeezing its heart out. The ghost looked his way. Their eyes connected.\nHe saw dark shapes move behind the ghost’s eyes. Dark entities, as large as planets . . .\n“Come on, Geshem!”\nMili pulled him on. She picked him up. She ran, leaped high, over ambushing Toads now fighting the cultists. Geshem knew what was up ahead.\nFirst Home.\n9.\n“Are you kidnapping me or protecting me?” Geshem said.\n“Maybe I’m doing both.”\nThey were holed up in the cave. Mili checked her weapons. Geshem brooded. He was tired of being mixed up in Sapi affairs.\nHe took out the egg and placed it on a bedding of pine needles. He didn’t know what it was. He wasn’t sure he cared. Some sort of new digital life from the cold reaches of the solar system, in the dark places where the sun was a myth. The solar system was big, and it hosted a variety of life. Base Humans and First Humans and Martian Re-Borns, uplifted octopi, and sentient robots, who was to say what was born in the Oort? All life deserved a chance. Sometimes it even deserved a second. He placed his hand on the egg and felt its warmth. There was a life there.\n“What do they want with you?” he murmured. “What will they do if they take you?”\n“I used to work for the Kunming Toads,” Mili said.\n“Yeah? How did that work out for you?” Geshem said.\n“Badly.”\nHe looked at her closely then. Saw the tiredness in her eyes, the taut muscles flexing, the way her fingers gripped the gun.\n“Why were you bartending?” he said. “Keeping an eye out for jobs?”\n“You wouldn’t believe me,” she said.\n“Try me.”\n“I was trying to go straight.”\nShe smiled. Geshem smiled back.\n“I can cut you in for a half of whatever this thing’s worth,” he said.\nShe shook her head. “It isn’t worth anything,” she said. “Anything but trouble.”\n“True.” He felt the egg again. It shuddered—and was that a tiny crack?\n“So what do you want to do?” Geshem said.\n“I want to see what it is,” Mili said. “When it hatches.”\n“Me too.”\nThe sounds of battle outside. Toads versus ghosts. He wondered who’d win.\nFirst Home. He didn’t need to look around him. It was just a cave. But more than a hundred thousand years ago, First Humans had shared this space with the new humans who came out of Africa.\nThey’d lived together, hunted together, cooked the meat together. Their babies were born here, and some of the babies were mixed, old human and new.\nThere had been love, here.\nGeshem thought of that cave more often than he should. He resented the Sapis. But he couldn’t let go of the fact that it hadn’t always been war. The genes of his people lived on in Homo Sapiens, evidence of that long-ago melding.\nWhat right did he have to decide for whatever this was, yet-to-be-born inside the egg?\n“I’ll make a fire,” he said.\nHe set about collecting wood.\nNight fell outside, slowly.\n10.\nWhen at last they came it was neither Toads nor ghosts.\nTwo men in cheap suits walked in and stood and watched Geshem and Mili and the egg and the fire.\n“Cohen and Haddad,” Geshem said.\n“Antiquities,” Mili said. She smiled. Geshem found that he liked her smile.\n“Surrender the egg,” Haddad said.\n“Or what?” Geshem said.\nTwo small, silver guns materialized in the men’s hands. Off-world weapons, made for lighter gravity. He didn’t know why those. Then he figured it out.\nHe looked at them with new eyes then.\n“Who are you?” he said.\nMili looked at him in confusion.\n“But they’re legit,” she said, “I checked them u—”\nThe two men smiled in unison. And Geshem knew whoever Cohen and Haddad once were, the things that were flesh-surfing them were very different.\n“Now,” Geshem said.\nThe two men raised their guns to fire.\nWhich was when Ruach-Noshevet-Ba’gfanim and the rest of Geshem’s people fell on them.\nThe digitals riding the two Antiquities men struggled, but here in the Sanctuary there were very few resources connected to the Conversation, and even the old war drones and UXOs and robots were useless to them, being of obsolete makes and using outdated protocols: and so they had to fight with flesh alone, with fists and feet, and eventually they were subdued.\nThey looked up at him from the dirt. And the creature that was Cohen said, “We’ll be back for you,” and the one that was Haddad said, “We’ll be back, Geshem-Nofel-Ba’oranim.”\nThen their bodies went slack, and their eyes went dull, and there was nothing there but two humans napping in the dirt.\nThe egg cracked then. Geshem heard it. He turned to look. Mili crouched by the egg, watching, and Geshem said, “Maybe you should take a step back—”\nWhen the egg split right down the middle. Terrible heat escaped from within, bathing the cave in the light of a sun. Mili turned away then. She ran to Geshem. He held her hand, and they watched as something emerged from the hatching egg.\nIt was a wisp of darkness. A shadow that followed that blast of fire, because while true darkness exists alone, shadows are light’s children. It was small at first, but it fed. It drew from the ancient stones and the dirt and the pines and pulled matter onto itself, and it fashioned itself a body. It gave itself wings and a tail. It raised a head, long and beautiful, and two eyes as dark as space looked into Geshem’s own.\n“Shalom . . . ” Geshem said.\nThe creature opened a beak and cried. It lunged at Geshem. Geshem fell back, alarmed.\nBut the creature didn’t harm him. Geshem looked up from his place in the dirt. He saw the priestess, Ziz, with an ugly curved knife in her hand. She had snuck up on Geshem while the bird was hatching. Now Ziz raised ugly talons and opened shimmering wings. She stared at the baby creature with eyes full of fear and love and avarice, and the knife dropped uselessly from her taloned hands.\n“It’s . . . ” she started to say.\nThe creature tore out her throat. It sank its beak into her soft belly and slurped, and as Ziz collapsed the creature grew again. It beat dark wings against the entrance of that ancient cave. It turned its head, just once, and looked at Geshem. Those dark eyes, and within them he saw the coldness of the Oort, and thought he knew something of the Nine Billion Hells . . .\nThen the creature cawed softly. It beat its wings and rose into the sky. For a moment it hovered against the moon. Then Geshem saw a second shape rise and join it.\n“Roc . . . ” he said.\n“I guess it missed its mother,” Mili said. She reached down and helped Geshem up. They stood shoulder to shoulder and watched the creature fly away, until it became just another part of the night and was gone.\n11.\nThe stars burned on a low flame, as one of the old songs said. But Geshem sometimes longed for ancient music, the ones his progenitors must have made. They must have sung to the moon, they must have danced under the stars, right here on this land, before they went extinct. Archaeological finds could show you the bones of the animals they hunted and the tools that they made, the remnants of their homes and fires. But they could not teach you their tongue, their songs, what they believed in, how they prayed. He felt that loss acutely in himself.\n“The Toads will come after you, you know,” Mili said. She was back behind bar. Geshem sat on a stool and played with an empty shot glass. He just liked the feel of it in his hands.\n“I know,” he said. “But they won’t go into Sanctuary land again.”\nMili laughed. “Not if they know better,” she said. “But you can’t stay here forever.”\n“I’ll work it out with them,” Geshem said. “I’ll work something out. What about you?”\nMili shrugged. “Maybe I’ll hire out again,” she said. “I was going to quit but . . . This whole thing reminded me.”\n“What you’re missing?”\n“Why I quit.”\nShe touched his hand gently. Then someone called her on the other side of the bar, and she left, and Geshem sat alone.\nLavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize."}