{"fingerprint": "XIdcLXu1kVLmZtHP9sQOpO2Ru5g=", "sitename": "Clarkesworld Magazine", "title": "The Language of the Whirlwind by Lavie Tidhar", "author": "Lavie Tidhar", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tidhar_02_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Language of the Whirlwind by Lavie Tidhar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4010 words, short story\nThe Language of the Whirlwind\nThe sky was the color of ash and the Whistler has been at it again: the shrill sound of his whistle rang like a curse down the abandoned street. Damn kid, the priest thought. Damn stupid kid. It was a miracle he was still alive.\nIt was a miracle. The boy was cursed, or blessed, or both. Perhaps he had been a normal child, once. But the year before he had lost his speech, and now nothing remained of it but the whistling.\nThe priest himself had been cursed, or blessed, or both. It was hard to tell, anymore. One year ago, he thought. How can everything change in one year?\nHe ran a hand through damp, thinning hair and looked warily up and down the street. All quiet—apart from the ceaseless whistling. But empty streets meant nothing any more, in this empty, ruined city. You never knew who or what may be hiding behind a fallen wall, or in the shadows of an abandoned shop . . . looters and slavers and hunters and snatchers—or the guards of a half-hundred banded-together groups, from the roof-dwellers to the children of the ruins to . . .\nThe boy kept whistling. Touched by God, the boy was. No one knew who his parents had been—or who had given him the whistle. The first the priest knew of him was when he saw him, in that first week after the Event—the catastrophe, the apocalypse, that thing that had happened, suddenly and inexplicably, to the city of Tel Aviv. He was not yet a priest, then. He had been a . . . well, did it matter? He had had a wife, and two children, still very small—some friends—a job—a television licence.\nGone. All gone, and in their stead he stood, a priest praying for salvation.\nPraying to the Fireman.\nHe walked passed ruined shop fronts, around a Merkava tank half-buried in the broken asphalt of the road, watching the mountain, listening to the whistle of the boy.\nThe boy. He had first seen him, walking down this same street, two weeks after he had lost everything he had. The whirlwinds had come from the sea, tearing through Tel Aviv like biblical avengers, throwing up cars, tearing down houses and power-lines, making rag dolls of men, women, children . . . cats and dogs. There were so few left. Only cockroaches and rats there were in plenty, still. There was good eating on a rat. The priest had a friend who kept a farm in an abandoned pharmacy, hundreds and hundreds of pink, fat, juicy rats . . . people, survivors, came from all over the city to buy the meat. A whole industry had sprung around it, street stalls offering the visitors sheesh-kebabs of skewered rat in cumin and salt, rat stews with barley, and boneless meat in thin, flat pita bread made with year-old flour . . . and besides the food stalls a small market emerged, the alte-zachen souk, where scavengers came to sell and trade the refuse of a city that had once held two million people. It was said less than ten thousand now remained.\nHe was going there now, to the rat market and the rat men, to search amidst the stalls of the alte-zachen souk, for there were relics to be found, hints and secrets only he could decipher, and the might lead him to the Fireman. He watched the mountain rise in the distance as he had every day since the whirlwinds had come from the sea, and slaughtered the people of Tel Aviv, and took away his life . . . the day the mountain had risen, impossibly-high, emerging in the heart of Tel Aviv and rising, rising, felling houses and shopping malls and office towers as it rose. The heart of the city was a mystery. It was not possible to climb the mountain, no more than it was possible to leave the city. Only one had gone before, and would one day return . . . or so the priest believed. So his new religion affirmed. The Fireman had risen into the sky and up the mountain, where the great, cold beings lived. There were intelligences there, a whole other world, it was whispered: great beings as large as worlds, with cold clear eyes, who watched the city from their heights, and though slow, cold thoughts . . . Why had they come? Their mountain rose above the city and beyond the mountain there were other mountains, other skies . . . but outside of Tel Aviv there was nothing, a ring of darkness surrounding the city. None could climb, could ascend the mountain—and none could leave the city. We are prisoners here, he thought, for the untold time. I was born here and I will die here, as my sons have. The city is my tomb.\nA whistle—he jumped, then realised it was the Whistler, who was following him. The boy, the cursed boy . . . he had seen him that first time, two weeks after the storm had lashed the city into bloodied submission and turned its few survivors into rats. The boy had been walking down the street, the whistle blowing—a small, brown-haired boy with large, serious eyes, in shorts and sandals and a once-white shirt splattered with old, dried blood. And as the priest (who was not then yet a priest) watched, a whirlwind had come, and then another, and another . . .\nHow to describe them? He was currently engaged in writing the Holy Book of Fire, the story of the city and the Fireman and of the Prophecy that he had seen, that he had known so fervently to be true. In the Holy Book he had attempted to describe the whirlwinds:\nThey came from the sea. Storms, sentient tornadoes. Invisible, aware, and hungry, they came from the sea. The whirlwinds. How many we could not tell. They threw cars into the air and brought them down like bombs, and when the army rose against them they broke our tanks and plucked the men from inside them, or roasted them in the metal, like crabs in their shells . . . they painted the city with our blood and re-drew it, filled with broken-down houses and streets that were no longer there, and graves, so many graves . . . they came from the sea but they are the children of the mountain, and they were sent from high above, to remind us we are mortals.\nTo remind us how easy it is for us to die.\nThe Holy Book currently filled half an A4 notepad that he had originally found in an abandoned stationary shop. His disciples were not many, but when they gathered, in the place that had once been a pharmacy and was now a slaughterhouse and a church, he read to them passages from the book, and they repeated the words, so they could spread them.\nHe alone had seen the Fireman, had seen him rise to heaven in a chariot of flame. He alone knew the tru—\nThe whistling returned, louder than before, and he saw the Whistler was gaining on him. The boy no longer wore his sandals, and the soles of his feet were black and hard, but he wore the same bloodied shirt, the same faded shorts as when he had first seen him. It was his eyes that the priest found most disturbing though . . . they were the grey and brown of the sea before a storm, the color of the sky the day the whirlwinds came . . . when he had first seen the boy he had seen the whirlwinds come to him, one and two at first and then three, four, ten, until their silent howling filled the world and ripped apart buildings still standing, tossed cars like game balls—but the boy himself was unharmed, and he stood there, surrounded by the storm, and whistled.\nThe boy was cursed, or blessed, or both. If he had any parents, brothers, sisters, he had none, now. Alone, he still stood. Like the priest.\nHe tried to ignore the boy. He was afraid of the whirlwinds, afraid of being taken, too soon. After they came he had prayed to die, prayed in the old religion, prayed to God and His angels, but no angels came, and there was no God. He had been there that day when the mountain rose and he saw the Fireman, driving his fire truck along the road, driving over everything in his path, driving like fire, like wind, charging at the mountain as those who dwell above reached down and took him, and the great municipal fire truck rose up in the air, higher and higher, until at last it disappeared beyond . . .\nHe knew then. Knew the Fireman had been chosen. A holy messiah, as it had been of old, in the old bible, chosen to lead his people out of darkness and into the light. Knew that he would return. That day he had shelled his old, dead identity and became the priest.\nHe walked through the silent city, and the Whistler followed him.\nFrom above, the city:\nThe carcasses of cars and tanks lie rotting in the sun on Ibn Gvirol and Herzl streets, and along the Yarkon river human skeletons lie bleaching in the sand. Fires burn, here and there, and on the rooftops of the city one can see newly-formed habitats, green gardens and colonies of migrating humans whose children may never see the streets below. All along the shoreline small fires burn, where refugees gather to watch the wall of darkness on the horizon: you may go this far, but no farther. Along the Ayalon Highway the rider clans race and war. Above all towers the mountain, its peak rising beyond the cloud, and beyond it can just be seen the outlines of other mountains, other lands . . .\nThe rat market was near the old bus station. Here, amidst ruined shawarma stalls and the remains of massage parlours, the Rat Lord made his home, and with him his band of hangers-on, the traders in white meat, the male and female prostitutes, the singers, the dancers, the mad and the lost.\nThe cries came from everywhere, and with them the mouth-watering scent of char-grilled flesh. “White meat!” they said. “White meat on a stick!”\n“Coins! Stamps! Tennis rackets! Footballs! Pens!—” and all the other useless things the scavengers found amidst the abandoned shops.\n“Onions! Fresh onions!”\n“Oranges! Juicy oranges!”\n“Lettuce! Tomatoes! Cucumbers! Garlic!”—from the roof dwellers and the small kibbutzim, those communal societies that had formed in the ruined city, and grew produce on the ground that peeked from underneath the broken-down concrete.\n“Tinned pears! Tinned fish! Tinned peas! Tinned corn!”—In this the scavengers always did good trade, though prices were rising as stock had become increasingly harder to come by.\n“Baby clothes . . . family photographs . . . ID books . . . ” from a wizened old woman whose teeth were a bygone dream.\nA wide board set up to one side. Photos pinned on to it, hand-written notices. Have you seen this child? Have you seen my wife? Have you seen my husband, have you seen my son, have you seen, have you seen, have you—\nBut no one has, and they are gone, gone, all gone into the clouds—\n“White meat! Tender and sweet! Tasting like honey, the bestest white meat!”\nThe priest paid for a skewer (a pair of earrings, a handful of gold teeth), and on a whim he couldn’t quite explain paid for another, and gave it to the boy. To shut his whistling, he thought. The boy let the whistle drop onto his chest, where it hung by a string. He bit into the meat. There were three little rodents per skewer.\n“Books! Get your books here! Good books, thick books, plenty of paper!”\nThe bookseller smiled up at him as he approached. The boy trailed behind. “Good paper, priest. Soft and strong, good for starting a fire and good for the bum—”\n“I have the only book I need,” the priest said, patting the place where his notebook was, and the bookseller nodded. “Are there news?”\n“He has not yet descended to be amongst us,” the priest said. “But the time is approaching.”\n“The Fireman . . . ” the bookseller said. “I’ve heard the stories. A biker clan tried to challenge the mountain last week, did you know?”\nThe priest shook his head. The bookseller said, “Raced up old Dizengoff Street—what’s left of it—straight up the side of the mountain. Ahead they went, five of them, then four, then three. One made it almost to the place where Dizengoff Centre used to stand, before—”\nThe priest nodded again. “It is folly to try,” he said. “What happened?”\n“Combustions,” the bookseller said. “spontaneous combustions, as spectacular as—”\n“It is His mark,” the priest said, feeling excitement slide down his throat like a reviving medicine. “The time is nigh, I have told you.”\nThe bookseller only shrugged. “Perhaps,” he said. “Now, do you need a book?”\nHis stall was covered in paperbacks. Most were best-sellers, since those were the ones they printed most of. Now the survivors of Tel Aviv lit fires with them and always kept a book close by—you never knew when you might need to go, and a single book could last a long time . . .\n“I have little enough to trade,” the priest said—looking longingly at a particularly thick thriller. He searched in his pocket. “I found these,” he said. Rings, of yellow gold and sapphires, a ruby chain of white gold, a diamond bracelet—there was still a market for jewellery in the city, with clan leaders cladding themselves in looted gold. The bookseller took the objects, examined them, made a motion with his head. The priest nodded thanks, and helped himself to the book.\nBehind him the whistling continued. People stared, but did not move towards the child. Holy child, the priest thought. They can recognise that in him. Sometimes he thought the boy’s whistles were the language of the whirlwind.\nHe walked away, towards the Rat House.\n“Priest!’\nThe Rat Lord was an old friend—and a believer. A large man, with hairy arms and thinner hair sprouting out of his ears, and reading glasses too small for his face. he had once been a general, and an aspiring politician, before the event put an end to both careers before the one had ended and the second began. Now he bred and butchered rats, and his fingers were covered in diamonds and topaz. “Lord of Rats,” the priest said, nodding.\n“Have one,” the Rat Lord said generously, waving his hand, “on the house.”\n“Thank you,” the priest said. “Is the gathering ready?”\n“Ready and waiting,” the Rat Lord said.\n“Then let us pray,” the priest said—and he followed the Rat Lord into the building, where the screams of rats could be heard, and their scrabbling feet, and into a back room of the old pharmacy, where a dozen people had gathered, waiting.\nMy flock, he thought. My lost little rats, anxiously awaiting the fire.\n“Friends,” he said, looking at their faces. From all over the city they came, young and old, women and men, the lost, the mad—those touched by fire. Those who believed. “The hour draws near, and on top of the mountain the fire beckons. He is coming. Soon we shall be delivered.”\n“Soon we shall be delivered,” they echoed him. The shrill sound of a whistle sounded outside. The priest knelt down on the hard floor and joined his hands before him. “Let us pray,” he said; and so they did.\nHe used to like Louis Armstrong music, pizza with olives, fresh cold water from the fridge, cartoons on Saturday morning TV. Now his thoughts were fire and his nights were waiting, always waiting for a sign from above, a sign that never seemed to come. Why has it happened? he thought. The storm had come and lashed the city of Tel Aviv into oblivion, but why? It occurred to him frequently that he might as well be asking—Why life? Why Death? The universe held no answers, and humanity went through cycles of life and death, birth and life and death, endlessly, no more comprehending than ants or dogs or rats. Did rats have a religion? Did rats pray to a rat-god? If so, what did they pray for?\nSalvation, he thought. I pray for salvation.\nYet what sort of salvation could a Fireman bring?\nThe streets back were dark and cold and quiet. Too quiet. The silence was pierced only by the boy’s incessant whistling—and suddenly the priest was very afraid.\nShadows moved ahead . . . they skulked in the darkness of ruined hallways. He turned, began to walk back. Don’t run, he thought. When he came to the boy he said, “Come with me—” wondering if the boy understood.\n“Come with me—” but even as he spoke he saw the shadows congeal ahead, and knew they were coming.\nStupid, stupid. He had not been paying attention. “There is nothing to take from me,” he said loudly, speaking to the approaching shadows. “Nothing that hasn’t already been taken.”\nHe did not even have the jewellery any more. All he carried was the book, and a wrapped package of three plump, salted skinned rats. And the Book, too, of course. The Holy Book of Fire. But they would not want that.\n“I have nothing,” he said again, feeling the weight of the words tightening around his neck, pulling him down. “Nothing . . . ”\n“You have your life,” the shadows said. They came closer and closer, and one of them held a torch now, and in its light he could see them, young faces, hungry, without mercy—faces from which laughter and light had been bleached clean. “We shall take that, and the child.”\n“Pretty boy!’ crowed another of the shadows. “We’ll put you to work in the mines, old man. There is much to be mined for, in this God-forsaken city.”\nHe knew about the mines. Deep they dug, into the cellars and the hidden warehouses, and as they dug they built, caves for the cave-dwellers, a hidden dark city under the city . . . some said the miners, too, had their own religion, and were seeking escape down there, in the darkness below the sands—seeking a way out of the city, tunnelling their way towards—\nBut there was nothing. He knew that. They all knew that. The city was no longer a part of the world, the other world. It had been annexed, and now belonged only to the mountain, and to what lay beyond.\n“Take me,” he said. “But leave the boy.”\n“The boy too can work,” the same voice said. They all looked the same to him, these boys who had once been soldiers or construction workers or delivery boys or telemarketers. They had been scourged by wind, he thought, scourged clean as bones. The dead had no mercy. “We have work for the boy.”\nUgly laughter. The priest, with shaking hands, brought out the holy book. “The Fireman comes,” he said, his voice weak in the cold night. “And the city shall be delivered at His approach. He has seen much that has been hidden, the bringer of fire, the bringer of ligh—”\nA back-handed slap felled him, the pain burning, burning, and he welcomed it. “Take him,” another voice said. All the while the boy was whistling, whistling, a forlorn cry in the night, the call of an extinct animal sensing its fate. Hands grabbed the priest, pulled him up. He saw knives, a rope. Their leader—if that’s what he was—approached the boy. “Shut up,” he said. But the boy’s only answer was his whistle.\nThe leader slapped him, casually, and the boy fell back a step, the whistle falling from his bloodied lips.\n“There’s men would pay good food for a boy like this,” he said, “and wouldn’t mind a bit of blood on him, either.”\n“He is innocent!’ the priest cried, and the leader turned to him, a snarl on his boyish face, and said, “No one is innocent.”\nIt was true, though the priest hated to think it. None of them were innocent, none of them who survived. And yet the boy, at least . . . surely the boy was innocent, if anyone was?\nFire and air, and high above the shadowy presence of cold, enormous beings in the mountain, and he thought, Let him call, let him—\nAnd as he rose, as he charged at these shades, these cold men of the ruined city, he thought not of fire or prophets, messiahs or signs, but only of the boy—Let them come, he thought. He ran at the leader, bringing him down, and the others turned away from the boy and came for him, knives glinting in the light of the torch—and the darkness was pierced with the sound of a lone whistle, a whistle in the night, and they came—he felt them come even as the knife slashed down on his arm and the pain rose in him, and brought his old name with it.\nThey converged on the street from all corners, it seemed. Hovering in the air, these cold, unknowable whirlwinds, and starlight was bent and transformed as it passed through them. Silent, they came closer, and the men left him, and tried to run, and someone cursed, and the priest lay on the ground, waiting for his death still, hoping for it, and all the while the boy’s whistle cut through the air like a surgical blade—\nHolding his arm, blood trickling through his fingers, he watched the whirlwinds come. Where they passed the ground was torn up, buildings collapsed, their sound drowning the boy’s whistle. When the men tried to flee some were snatched up by the wind, rising up in the air slowly before exploding, their blood raining down like fallen poppies. But some escaped, moving between the columns of air, vanishing in the distance, to live another day in the city, to die another night.\n“They came,” he said, speaking to the boy—but the boy was no longer there.\nWhen he raised his eyes he saw the boy hovering in the air above him, caught inside a whirlwind. Round and round and round he went, his face placid, his eyes the color of a grey storm, his shirt a mix of blood old and new. The whistle sounded, shriller than ever, communicating in a language the priest could not, would not understand.\nHigher and higher the boy went, and the priest began to shout, screaming at the storm, but it was no good—the boy rose and then the whistling stopped, and a faint “pop’ sounded, like a bottle being uncorked—\nRed rain fell down on the priest, softly, like a whisper in the night, like a mother’s goodnight kiss. Red rain fell and the whirlwinds turned away, and from the sky an object fell down to the ground, and the priest grasped for it with bloodied fingers, barely seeing:\nIt was a cheap, plastic whistle, the mouthpiece still moist where it had been blown, and teeth marks that were the only thing to remain of the boy.\nHe stared at the object in his hand, and raised his head, and watched the mountain rise, mute and inexplicable as life, as death, impossibly-high in the distance.\nWhy? he said, or thought he had, though no sound came. When he cried it was without sound and the tears mingled with the blood of the boy. Why? he said, or tried to, but the whirlwinds were gone and the street was deserted again, and very quiet, and very dark, and after a while he put the whistle in his pocket and resumed the long walk home, alone.\nLavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize."}