{"fingerprint": "1EmquHbHaABnKGI0wKWZw2iUqy8=", "sitename": "Clarkesworld Magazine", "title": "The Book Seller by Lavie Tidhar", "author": "Lavie Tidhar", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tidhar_03_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Book Seller by Lavie Tidhar", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9480 words, novelette, REPRINT\nThe Book Seller\nAchimwene loved Central Station. He loved the adaptoplant neighborhoods sprouting over the old stone and concrete buildings, the budding of new apartments and the gradual fading and shearing of old ones, dried windows and walls flaking and falling down in the wind.\nAchimwene loved the calls of the alte-zachen, the rag-and-bone men, in their traditional passage across the narrow streets, collecting junk to carry to their immense junkyard-cum-temple on the hill in Jaffa to the south. He loved the smell of sheesha-pipes on the morning wind, and the smell of bitter coffee, loved the smell of fresh horse manure left behind by the alte-zachen’s patient, plodding horses.\nNothing pleased Achimwene Haile Selassi Jones as much as the sight of the sun rising behind Central Station, the light slowly diffusing beyond and over the immense, hour-glass shape of the space port. Or almost nothing. For he had one overriding passion, at the time that we pick this thread, a passion which to him was both a job and a mission.\nEarly morning light suffused Central Station and the old cobbled streets. It highlighted exhausted prostitutes and street-sweeping machines, the bobbing floating lanterns that, with dawn coming, were slowly drifting away, to be stored until nightfall. On the rooftops solar panels unfurled themselves, welcoming the sun. The air was still cool at this time. Soon it will be hot, the sun beating down, the aircon units turning on with a roar of cold air in shops and restaurants and crowded apartments all over the old neighborhood.\n“Ibrahim,” Achimwene said, acknowledging the alte-zachen man as he approached. Ibrahim was perched on top of his cart, the boy Ismail by his side. The cart was pushed by a solitary horse, an old gray being who blinked at Achimwene patiently. The cart was already filled, with adaptoplant furniture, scrap plastic and metal, boxes of discarded house wares and, lying carelessly on its side, a discarded stone bust of Albert Einstein.\n“Achimwene,” Ibrahim said, smiling. “How is the weather?”\n“Fair to middling,” Achimwene said, and they both laughed, comfortable in the near-daily ritual.\nThis is Achimwene: he was not the most imposing of people, did not draw the eye in a crowd. He was slight of frame, and somewhat stooped, and wore old-fashioned glasses to correct a minor fault of vision. His hair was once thickly curled but not much of it was left now, and he was mostly, sad to say, bald. He had a soft mouth and patient, trusting eyes, with fine lines of disappointment at their corners. His name meant “brother” in Chichewa, a language dominant in Malawi, though he was of the Joneses of Central Station, and the brother of Miriam Jones, of Mama Jones’ Shebeen on Neve Sha’anan Street. Every morning he rose early, bathed hurriedly, and went out into the streets in time to catch the rising sun and the alte-zachen man. Now he rubbed his hands together, as if cold, and said, in his soft, quiet voice, “Do you have anything for me today, Ibrahim?”\nIbrahim ran his hand over his own bald pate and smiled. Sometimes the answer was a simple, “No.” Sometimes it came with a hesitant, “Perhaps . . . ”\nToday it was a “Yes,” Ibrahim said, and Achimwene raised his eyes, to him or to the heavens, and said, “Show me?”\n“Ismail,” Ibrahim said, and the boy, who sat beside him wordless until then, climbed down from the cart with a quick, confident grin and went to the back of the cart. “It’s heavy!” he complained. Achimwene hurried to his side and helped him bring down a heavy box.\nHe looked at it.\n“Open it,” Ibrahim said. “Are these any good to you?”\nAchimwene knelt by the side of the box. His fingers reached for it, traced an opening. Slowly, he pulled the flaps of the box apart. Savoring the moment that light would fall down on the box’s contents, and the smell of those precious, fragile things inside would rise, released, into the air, and tickle his nose. There was no other smell like it in the world, the smell of old and weathered paper.\nThe box opened. He looked inside.\nBooks. Not the endless scrolls of text and images, moving and static, nor full-immersion narratives he understood other people to experience, in what he called, in his obsolete tongue, the networks, and others called, simply, the Conversation. Not those, to which he, anyway, had no access. Nor were they books as decorations, physical objects hand-crafted by artisans, vellum-bound, gold-tooled, typeset by hand and sold at a premium.\nNo.\nHe looked at the things in the box, these fragile, worn, faded, thin, cheap paper-bound books. They smelled of dust, and mould, and age. They smelled, faintly, of pee, and tobacco, and spilled coffee. They smelled like things which had lived.\nThey smelled like history.\nWith careful fingers he took a book out and held it, gently turning the pages. It was all but priceless. His breath, as they often said in those very same books, caught in his throat.\nIt was a Ringo.\nA genuine Ringo.\nThe cover of this fragile paperback showed a leather-faced gunman against a desert-red background. RINGO, it said, in giant letters, and below, the fictitious author’s name, Jeff McNamara. Finally, the individual title of the book, one of many in that long running Western series. This one was On The Road To Kansas City.\nWere they all like this?\nOf course, there had never been a “Jeff McNamara.” Ringo was a series of Hebrew-language Westerns, all written pseudonymously by starving young writers in a bygone Tel Aviv, who contributed besides it similar tales of space adventures, sexual titillation or soppy romance, as the occasion (and the publisher’s check book) had called for. Achimwene rifled carefully through the rest of the books. All paperbacks, printed on cheap, thin pulp paper centuries before. How had they been preserved? Some of these he had only ever seen mentioned in auction catalogues, their existence, here, now, was nothing short of a miracle. There was a nurse romance; a murder mystery; a World War Two adventure; an erotic tale whose lurid cover made Achimwene blush. They were impossible, they could not possibly exist. “Where did you find them?” he said.\nIbrahim shrugged. “An opened Century Vault,” he said.\nAchimwene exhaled a sigh. He had heard of such things—subterranean safe-rooms, built in some long-ago war of the Jews, pockets of reinforced concrete shelters caught like bubbles all under the city surface. But he had never expected . . .\n“Are there . . . many of them?” he said.\nIbrahim smiled. “Many,” he said. Then, taking pity on Achimwene, said, “Many vaults, but most are inaccessible. Every now and then, construction work uncovers one . . . the owners called me, for they viewed much of it as rubbish. What, after all, would a modern person want with one of these?” and he gestured at the box, saying, “I saved them for you. The rest of the stuff is back in the Junkyard, but this was the only box of books.”\n“I can pay,” Achimwene said. “I mean, I will work something out, I will borrow—” the thought stuck like a bone in his throat (as they said in those books)—“I will borrow from my sister.”\nBut Ibrahim, to Achimwene’s delight and incomprehension, waved him aside with a laugh. “Pay me the usual,” he said. “After all, it is only a box, and this is mere paper. It cost me nothing, and I have made my profit already. What extra value you place on it surely is a value of your own.”\n“But they are precious!” Achimwene said, shocked. “Collectors would pay—” imagination failed him. Ibrahim smiled, and his smile was gentle. “You are the only collector I know,” he said. “Can you afford what you think they’re worth?”\n“No,” Achimwene said—whispered.\n“Then pay only what I ask,” Ibrahim said and, with a shake of his head, as at the folly of his fellow man, steered the horse into action. The patient beast beat its flank with its tail, shoeing away flies, and ambled onwards. The boy, Ismail, remained there a moment longer, staring at the books. “Lots of old junk in the Vaults!” he said. He spread his arms wide to describe them. “I was there, I saw it! These . . . books?” he shot an uncertain look at Achimwene, then ploughed on—“and big flat square things called televisions, that we took for plastic scrap, and old guns, lots of old guns! But the Jews took those—why do you think they buried those things?” the boy said. His eyes, vat-grown haunting greens, stared at Achimwene. “So much junk,” the boy said, at last, with a note of finality, and then, laughing, ran after the cart, jumping up on it with youthful ease.\nAchimwene stared at the cart until it disappeared around the bend. Then, with the tenderness of a father picking up a new-born infant, he picked up the box of books and carried them the short way to his alcove.\nAchimwene’s life was about to change, but he did not yet know it. He spent the rest of the morning happily cataloguing, preserving and shelving the ancient books. Each lurid cover delighted him. He handled the books with only the tips of his fingers, turning the pages carefully, reverently. There were many faiths in Central Station, from Elronism to St. Cohen to followers of Ogko, mixed amidst the larger populations—Jews to the north, Muslims to the south, a hundred offshoots of Christianity dotted all about like potted plants—but only Achimwene’s faith called for this. The worship of old, obsolete books. The worship, he liked to think, of history itself.\nHe spent the morning quite happily, therefore, with only one customer. For Achimwene was not alone in his—obsession? Fervor?\nOthers were like him. Mostly men, and mostly, like himself, broken in some fundamental fashion. They came from all over, pilgrims taking hesitant steps through the unfamiliar streets of the old neighborhood, reaching at last Achimwene’s alcove, a shop which had no name. They needed no sign. They simply knew.\nThere was an Armenian priest from Jerusalem who came once a month, a devotee of Hebrew pulps so obscure even Achimwene struggled with the conversation—romance chapbooks printed in twenty or thirty stapled pages at a time, filled with Zionist fervor and lovers’ longings, so rare and fragile few remained in the world. There was a rare woman, whose name was Nur, who came from Damascus once a year, and whose specialty was the works of obscure poet and science fiction writer Lior Tirosh. There was a man from Haifa who collected erotica, and a man from the Galilee collecting mysteries.\n“Achimwene? Shalom!”\nAchimwene straightened in his chair. He had sat at his desk for some half an hour, typing, on what was his pride and joy, a rare collectors’ item: a genuine, Hebrew typewriter. It was his peace and his escape, in the quiet times, to sit at his desk and pen, in the words of those old, vanished pulp writers, similarly exciting narratives of daring-do, rescues, and escapes.\n“Shalom, Gideon,” he said, sighing a little. The man, who hovered at the door, now came fully inside. He was a stooped figure, with long white hair, twinkling eyes, and a bottle of cheap arak held, like an offering, in one hand.\n“Got glasses?”\n“Sure . . . ”\nAchimwene brought out two glasses, neither too clean, and put them on the desk. The man, Gideon, motioned with his head at the typewriter. “Writing again?” he said.\n“You know,” Achimwene said.\nHebrew was the language of his birth. The Joneses were once Nigerian immigrants. Some said they had come over on work visas, and stayed. Others that they had escaped some long-forgotten civil war, had crossed the border illegally from Egypt, and stayed. One way or the other, the Joneses, like the Chongs, had lived in Central Station for generations.\nGideon opened the bottle, poured them both a drink. “Water?” Achimwene said.\nGideon shook his head. Achimwene sighed again and Gideon raised the glass, the liquid clear. “L’chaim,” he said.\nThey clinked glasses. Achimwene drank, the arak burning his throat, the anis flavor tickling his nose. Made him think of his sister’s shebeen. Said, “So, nu? What’s new with you, Gideon?”\nHe’d decided, suddenly and with aching clarity, that he won’t share the new haul with Gideon. Will keep them to himself, a private secret, for just a little while longer. Later, perhaps, he’d sell one or two. But not yet. For the moment, they were his, and his alone.\nThey chatted, whiling away an hour or two. Two men old before their time, in a dark alcove, sipping arak, reminiscing of books found and lost, of bargains struck and the ones that got away. At last Gideon left, having purchased a minor Western, in what is termed, in those circles, Good condition—that is, it was falling apart. Achimwene breathed out a sigh of relief, his head swimming from the arak, and returned to his typewriter. He punched an experimental heh, then a nun. He began to type.\nThe g.\nThe girl.\nThe girl was in trouble.\nA crowd surrounded her. Excitable, their faces twisted in the light of their torches. They held stones, blades. They shouted a word, a name, like a curse. The girl looked at them, her delicate face frightened.\n“Won’t someone save me?” she cried. “A hero, a—”\nAchimwene frowned in irritation for, from the outside, a commotion was rising, the noise disturbing his concentration. He listened, but the noise only grew louder and, with a sigh of irritation, he pulled himself upwards and went to the door.\nPerhaps this is how lives change. A momentary decision, the toss of a coin. He could have returned to his desk, completed his sentence, or chosen to tidy up the shelves, or make a cup of coffee. He chose to open the door instead.\nThey are dangerous things, doors, Ogko had once said. You never knew what you’d find on the other side of one.\nAchimwene opened the door and stepped outside.\nThe g.\nThe girl.\nThe girl was in trouble.\nThis much Achimwene saw, though for the moment, the why of it escaped him.\nThis is what he saw:\nThe crowd was composed of people Achimwene knew. Neighbors, cousins, acquaintances. He thought he saw young Yan there, and his fiancé, Youssou (who was Achimwene’s second cousin); the greengrocer from around the corner; some adaptoplant dwellers he knew by sight if not name; and others. They were just people. They were of Central Station.\nThe girl wasn’t.\nAchimwene had never seen her before. She was slight of frame. She walked with a strange gait, as though unaccustomed to the gravity. Her face was narrow, indeed delicate. Her head had been done in some other-worldly fashion, it was woven into dreadlocks that moved slowly, even sluggishly, above her head, and an ancient name rose in Achimwene’s mind.\nMedusa.\nThe girl’s panicked eyes turned, looking. For just a moment, they found his. But her look did not (as Medusa’s was said to) turn him to stone.\nShe turned away.\nThe crowd surrounded her in a semi-circle. Her back was to Achimwene. The crowd—the word mob flashed through Achimwene’s mind uneasily—was excited, restless. Some held stones in their hands, but uncertainly, as though they were not sure why, or what they were meant to do with them. A mood of ugly energy animated them. And now Achimwene could hear a shouted word, a name, rising and falling in different intonations as the girl turned, and turned, helplessly seeking escape.\n“Shambleau!”\nThe word sent a shiver down Achimwene’s back (a sensation he had often read about in the pulps, yet seldom if ever experienced in real life). It arose in him vague, menacing images, desolate Martian landscapes, isolated kibbutzim on the Martian tundra, red sunsets, the color of blood.\n“Strigoi!”\nAnd there it was, that other word, a word conjuring, as though from thin air, images of brooding mountains, dark castles, bat-shaped shadows fleeting on the winds against a blood-red, setting sun . . . images of an ageless Count, of teeth elongating in a hungry skull, sinking to touch skin, to drain blood . . .\n“Shambleau!”\n“Get back! Get back to where you came from!”\n“Leave her alone!”\nThe cry pierced the night. The mob milled, confused. The voice like a blade had cut through the day and the girl, startled and surprised, turned this way and that, searching for the source of that voice.\nWho said it?\nWho dared the wrath of the mob?\nWith a sense of reality cleaving in half, Achimwene, almost with a slight frisson, a delicious shiver of recognition, realized that it was he, himself, who had spoken.\nHad, indeed, stepped forward from his door, a little hunched figure facing this mob of relatives and acquaintances and, even, perhaps, a few friends. “Leave her alone,” he said again, savoring the words, and for once, perhaps for the first time in his life, people listened to him. A silence had descended. The girl, caught between her tormentors and this mysterious new figure, seemed uncertain.\n“Oh, it’s Achimwene,” someone said, and somebody else suddenly, crudely laughed, breaking the silence.\n“She’s Shambleau,” someone else said, and the first speaker (he couldn’t quite see who it was) said, “Well, she’d be no harm to him.”\nThat crude laughter again and then, as if by some unspoken agreement, or command, the crowd began, slowly, to disperse.\nAchimwene found that his heart was beating fast; that his palms sweated; that his eyes developed a sudden itch. He felt like sneezing. The girl, slowly, floated over to him. They were of the same height. She looked into his eyes. Her eyes were a deep clear blue, vat-grown. They regarded each other as the rest of the mob dispersed. Soon they were left alone, in that quiet street, with Achimwene’s back to the door of his shop.\nShe regarded him quizzically; her lips moved without sound, her eyes flicked up and down, scanning him. She looked confused, then shocked. She took a step back.\n“No, wait!” he said.\n“You are . . . you are not . . . ”\nHe realized she had been trying to communicate with him. His silence had baffled her. Repelled her, most likely. He was a cripple. He said, “I have no node.”\n“How is that . . . possible?”\nHe laughed, though there was no humor in it. “It is not that unusual, here, on Earth,” he said.\n“You know I am not—” she said, and hesitated, and he said, “From here? I guessed. You are from Mars?”\nA smile twisted her lips, for just a moment. “The asteroids,” she admitted.\n“What is it like, in space?” Excitement animated him. She shrugged. “Olsem difren,” she said, in the pidgin of the asteroids.\nThe same, but different.\nThey stared at each other, two strangers, her vat-grown eyes against his natural-birth ones. “My name is Achimwene,” he said.\n“Oh.”\n“And you are?”\nThat same half-smile twisting her lips. He could tell she was bewildered by him. Repelled. Something inside him fluttered, like a caged bird dying of lack of oxygen.\n“Carmel,” she said, softly. “My name is Carmel.”\nHe nodded. The bird was free, it was beating its wings inside him. “Would you like to come in?” he said. He gestured at his shop. The door, still standing half open.\nDecisions splitting quantum universes . . . she bit her lip. There was no blood. He noticed her canines, then. Long and sharp. Unease took him again. Truth in the old stories? A Shambleau? Here?\n“A cup of tea?” he said, desperately.\nShe nodded, distractedly. She was still trying to speak to him, he realized She could not understand why he wasn’t replying.\n“I am un-noded,” he said again. Shrugged. “It is—”\n“Yes,” she said.\n“Yes?”\n“Yes, I would like to come in. For . . . tea.” She stepped closer to him. He could not read the look in her eyes. “Thank you,” she said, in her soft voice, that strange accent. “For . . . you know.”\n“Yes.” He grinned, suddenly, feeling bold, almost invincible. “It’s nothing.”\n“Not . . . nothing.” Her hand touched his shoulder, briefly, a light touch. Then she had gone past him and disappeared through the half-open door.\nThe shelves inside were arranged by genre.\nRomance.\nMystery.\nDetection.\nAdventure.\nAnd so on.\nLife wasn’t like that neat classification system, Achimwene had come to realize. Life was half-completed plots abandoned, heroes dying half-way along their quests, loves requited and un-, some fading inexplicably, some burning short and bright. There was a story of a man who fell in love with a vampire . . .\nCarmel was fascinated by him, but increasingly distant. She did not understand him. He had no taste to him, nothing she could sink her teeth into. Her fangs. She was a predator, she needed feed, and Achimwene could not provide it to her.\nThat first time, when she had come into his shop, had run her fingers along the spines of ancient books, fascinated, shy: “We had books, on the asteroid,” she admitted, embarrassed, it seemed, by the confession of a shared history. “On Nungai Merurun, we had a library of physical books, they had come in one of the ships, once, a great-uncle traded something for them—” leaving Achimwene with dreams of going into space, of visiting this Ng. Merurun, discovering a priceless treasure hidden away.\nLamely, he had offered her tea. He brewed it on the small primus stove, in a dented saucepan, with fresh mint leaves in the water. Stirred sugar into the glasses. She had looked at the tea in incomprehension, concentrating. It was only later he realized she was trying to communicate with him again.\nShe frowned, shook her head. She was shaking a little, he realized. “Please,” he said. “Drink.”\n“I don’t,” she said. “You’re not.” She gave up.\nAchimwene often wondered what the Conversation was like. He knew that, wherever he passed, nearly anything he saw or touched was noded. Humans, yes, but also plants, robots, appliances, walls, solar panels—nearly everything was connected, in an ever-expanding, organically growing Aristocratic Small World network, that spread out, across Central Station, across Tel Aviv and Jaffa, across the interwoven entity that was Palestine/Israel, across that region called the Middle East, across Earth, across trans-solar space and beyond, where the lone Spiders sang to each other as they built more nodes and hubs, expanded farther and farther their intricate web. He knew a human was surrounded, every living moment, by the constant hum of other humans, other minds, an endless conversation going on in ways Achimwene could not conceive of. His own life was silent. He was a node of one. He moved his lips. Voice came. That was all. He said, “You are strigoi.”\n“Yes.” Her lips twisted in that half-smile. “I am a monster.”\n“Don’t say that.” His heart beat fast. He said, “You’re beautiful.”\nHer smile disappeared. She came closer to him, the tea forgotten. She leaned into him. Put her lips against his skin, against his neck, he felt her breath, the lightness of her lips on his hot skin. Sudden pain bit into him. She had fastened her lips over the wound, her teeth piercing his skin. He sighed. “Nothing!” she said. She pulled away from him abruptly. “It is like . . . I don’t know!” She shook. He realized she was frightened. He touched the wound on his neck. He had felt nothing. “Always, to buy love, to buy obedience, to buy worship, I must feed,” she said, matter-of-factly. “I drain them of their precious data, bleed them for it, and pay them in dopamine, in ecstasy. But you have no storage, no broadcast, no firewall . . . there is nothing there. You are like a simulacra,” she said. The word pleased her. “A simulacra,” she repeated, softly. “You have the appearance of a man but there is nothing behind your eyes. You do not broadcast.”\n“That’s ridiculous,” Achimwene said, anger flaring, suddenly. “I speak. You can hear me. I have a mind. I can express my—”\nBut she was only shaking her head, and shivering. “I’m hungry,” she said. “I need to feed.”\nThere were willing victims in Central Station. The bite of a strigoi gave pleasure. More—it conferred status on the victim, bragging rights. There had never been strigoi on Earth. It made Achimwene nervous.\nHe found himself living in one of his old books. He was the one to arrange Carmel’s feeding, select her victims, who paid for the privilege. Achimwene, to his horror, discovered he had become a middleman. The bag man.\nThere was something repulsive about it all, as well as a strange, shameful excitement. There was no sex: sex was not a part of it, although it could be. Carmel leeched knowledge—memories—stored sensations—anything—pure uncut data from her victims, her fangs fastening on their neck, injecting dopamine into their blood as her node broke their inadequate protections, smashed their firewalls and their security, and bled them dry.\n“Where do you come from?” he once asked her, as they lay on his narrow bed, the window open and the heat making them sweat, and she told him of Ng. Merurun, the tiny asteroid where she grew up, and how she ran away, on board the Emaciated Messiah, where a Shambleau attacked her, and passed on the virus, or the sickness, whatever it was.\n“And how did you come to be here?” he said, and sensed, almost before he spoke, her unease, her reluctance to answer. Jealousy flared in him then, and he could not say why.\nHis sister came to visit him. She walked into the bookshop as he sat behind the desk, typing. He was writing less and less, now; his new life seemed to him a kind of novel.\n“Achimwene,” she said.\nHe raised his head. “Miriam,” he said, heavily.\nThey did not get along.\n“The girl, Carmel. She is with you?”\n“I let her stay,” he said, carefully.\n“Oh, Achimwene, you are a fool!” she said.\nHer boy—their sister’s boy—Kranki—was with her. Achimwene regarded him uneasily. The boy was vat-grown—had come from the birthing clinics—his eyes were Armani-trademark blue. “Hey, Kranki,” Achimwene said.\n“Anggkel,” the boy said—uncle, in the pidgin of the asteroids. “Yu olsem wanem?”\n“I gud,” Achimwene said.\nHow are you? I am well.\n“Fren blong mi Ismail I stap aotside,” Kranki said. “I stret hemi kam insaed?”\nMy friend Ismail is outside. Is it ok if he comes in?\n“I stret,” Achimwene said.\nMiriam blinked. “Ismail,” she said. “Where did you come from?”\nKranki had turned, appeared, to all intents and purposes, to play with an invisible playmate. Achimwene said, carefully, “There is no one there.”\n“Of course there is,” his sister snapped. “It’s Ismail, the Jaffa boy.”\nAchimwene shook his head.\n“Listen, Achimwene. The girl. Do you know why she came here?”\n“No.”\n“She followed Boris.”\n“Boris,” Achimwene said. “Your Boris?”\n“My Boris,” she said.\n“She knew him before?”\n“She knew him on Mars. In Tong Yun City.”\n“I . . . see.”\n“You see nothing, Achi. You are blind like a worm.” Old words, still with the power to hurt him. They had never been close, somehow. He said, “What do you want, Miriam?”\nHer face softened. “I do not want . . . I do not want her to hurt you.”\n“I am a grown-up,” he said. “I can take care of myself.”\n“Achi, like you ever could!”\nCould that be affection, in her voice? It sounded like frustration. Miriam said, “Is she here?”\n“Kranki,” Achimwene said, “who are you playing with?”\n“Ismail,” Kranki said, pausing in the middle of telling a story to someone only he could see.\n“He’s not here,” Achimwene said.\n“Sure he is. He’s right here.”\nAchimwene formed his lips into an O of understanding. “Is he virtual?” he said.\nKranki shrugged. “I guess,” he said. He clearly felt uncomfortable with—or didn’tunderstand—the question. Achimwene let it go.\nHis sister said, “I like the girl, Achi.”\nIt took him by surprise. “You’ve met her?”\n“She has a sickness. She needs help.”\n“I am helping her!”\nBut his sister only shook her head.\n“Go away, Miriam,” he said, feeling suddenly tired, depressed. His sister said, “Is she here?”\n“She is resting.”\nAbove his shop there was a tiny flat, accessible by narrow, twisting stairs. It wasn’t much but it was home. “Carmel?” his sister called. “Carmel!”\nThere was a sound above, as of someone moving. Then a lack of sound. Achimwene watched his sister standing impassively. Realized she was talking, in the way of other people, with Carmel. Communicating in a way that was barred to him. Then normal sound again, feet on the stairs, and Carmel came into the room.\n“Hi,” she said, awkwardly. She came and stood closer to Achimwene, then took his hand in hers. The feel of her small, cold fingers in between his hands startled him and made a feeling of pleasure spread throughout his body, like warmth in the blood. Nothing more was said. The physical action itself was an act of speaking.\nMiriam nodded.\nThen Kranki startled them all.\nCarmel had spent the previous night in the company of a woman. Achimwene had known there was sex involved, not just feeding. He had told himself he didn’t mind. When Carmel came back she had smelled of sweat and sex and blood. She moved lethargically, and he knew she was drunk on data. She had tried to describe it to him once, but he didn’t really understand it, what it was like.\nHe had lain there on the narrow bed with her and watched the moon outside, and the floating lanterns with their rudimentary intelligence. He had his arm around the sleeping Carmel, and he had never felt happier.\nKranki turned and regarded Carmel. He whispered something to the air—to the place Ismail was standing, Achimwene guessed. He giggled at the reply and turned to Carmel.\n“Are you a vampire?” he said.\n“Kranki!”\nAt the horrified look on Miriam’s face, Achimwene wanted to laugh. Carmel said, “No, it’s all right—” in asteroid pidgin. I stret nomo.\nBut she was watching the boy intently. “Who is your friend?” she said, softly.\n“It’s Ismail. He lives in Jaffa on the hill.”\n“And what is he?” Carmel said. “What are you?”\nThe boy didn’t seem to understand the question. “He is him. I am me. We are . . . ” he hesitated.\n“Nakaimas . . . ” Carmel whispered. The sound of her voice made Achimwene shiver. That same cold run of ice down his spine, like in the old books, like when Ringo the Gunslinger met a horror from beyond the grave on the lonesome prairies.\nHe knew the word, though never understood the way people used it. It meant black magic, but also, he knew, it meant to somehow, impossibly, transcend the networks, that thing they called the Conversation.\n“Kranki . . .” the warning tone in Miriam’s voice was unmistakable. But neither Kranki nor Carmel paid her any heed. “I could show you,” the boy said. His clear, blue eyes seemed curious, guileless. He stepped forward and stood directly in front of Carmel and reached out his hand, pointing finger extended. Carmel, momentarily, hesitated. Then she, too, reached forward and, finger extended, touched its tip to the boy’s own.\nIt is, perhaps, the prerogative of every man or woman to imagine, and thus force a shape, a meaning, onto that wild and meandering narrative of their lives, by choosing genre. A princess is rescued by a prince; a vampire stalks a victim in the dark; a student becomes the master. A circle is completed. And so on.\nIt was the next morning that Achimwene’s story changed, for him. It had been a Romance, perhaps, of sorts. But now it became a Mystery.\nPerhaps they chose it, by tacit agreement, as a way to bind them, to make this curious relationship, this joining of two ill-fitted individuals somehow work. Or perhaps it was curiosity that motivated them after all, that earliest of motives, the most human and the most suspect, the one that had led Adam to the Tree, in the dawn of story.\nThe next morning Carmel came down the stairs. Achimwene had slept in the bookshop that night, curled up in a thin blanket on top of a mattress he had kept by the wall and which was normally laden with books. The books, pushed aside, formed an untidy wall around him as he slept, an alcove within an alcove.\nCarmel came down. Her hair moved sluggishly around her skull. She wore a thin cotton shift; he could see how thin she was.\nAchimwene said, “Tell me what happened yesterday.”\nCarmel shrugged. “Is there any coffee?”\n“You know where it is.”\nHe sat up, feeling self-conscious and angry. Pulling the blanket over his legs. Carmel went to the primus stove, filled the pot with water from the tap, added spoons of black coffee carelessly. Set it to cook.\n“The boy is . . . a sort of strigoi,” she said. “Maybe. Yes. No. I don’t know.”\n“What did he do?”\n“He gave me something. He took something away. A memory. Mine or someone else’s. It’s no longer there.”\n“What did he give you?”\n“Knowledge. That he exists.”\n“Nakaimas.”\n“Yes.” She laughed, a sound as bitter as the coffee. “Black magic. Like me. Not like me.”\n“You were a weapon,” he said. She turned, sharply. There were two coffee cups on the table. Glass on varnished wood. “What?”\n“I read about it.”\n“Always your books.”\nHe couldn’t tell by her tone how she meant it. He said, “There are silences in your Conversation. Holes.” Could not quite picture it, to him there was only a silence. Said, “The books have answers.”\nShe poured coffee, stirred sugar into the glasses. Came over and sat beside him, her side pressing into his. Passed him a cup. “Tell me,” she said.\nHe took a sip. The coffee burned his tongue. Sweet. He began to talk quickly. “I read up on the condition. Strigoi. Shambleau. There are references from the era of the Shangri-La Virus, contemporary accounts. The Kunming Labs were working on genetic weapons, but the war ended before the strain could be deployed—they sold it off-world, it went loose, it spread. It never worked right. there are hints—I need access to a bigger library. Rumors. Cryptic footnotes.”\n“Saying what?”\n“Suggesting a deeper purpose. Or that Strigoi was but a side-effect of something else. A secret purpose . . . ”\nPerhaps they wanted to believe. Everyone needs a mystery.\nShe stirred beside him. Turned to face him. Smiled. It was perhaps the first time she ever truly smiled at him. Her teeth were long, and sharp.\n“We could find out,” she said.\n“Together,” he said. He drank his coffee, to hide his excitement. But he knew she could tell.\n“We could be detectives.”\n“Like Judge Dee,” he said.\n“Who?”\n“Some detective.”\n“Book detective,” she said, dismissively.\n“Like Bill Glimmung, then,” he said. Her face lit up. For a moment she looked very young. “I love those stories,” she said.\nEven Achimwene had seen Glimmung features. They had been made in 2D, 3D, full-immersion, as scent narratives, as touch-tapestry—Martian Hardboiled, they called the genre, the Phobos Studios cranked out hundreds of them over decades if not centuries, Elvis Mandela had made the character his own.\n“Like Bill Glimmung, then,” she said solemnly, and he laughed.\n“Like Glimmung,” he said.\nAnd so the lovers, by complicit agreement, became detectives.\nMARTIAN HARDBOILED, genre of. Flourished in the CENTURY OF DRAGON. Most prominent character: Bill GLIMMUNG, played most memorably by Elvis MANDELA (for which see separate entry). The genre is well-known, indeed notorious, for the liberal use of sex and violence, transplanted from old EARTH (also see MANHOME; HUMANITY PRIME) hardboiled into a Martian setting, sometimes realistically-portrayed, often with implicit or explicit elements of FANTASY.\nWhile early stories stuck faithfully to the mean streets of TONG YUN CITY, with its triads, hafmek pushers and Israeli, Red Chinese and Red Soviet agents, later narratives took in off-world adventures, including in the BELT, the VENUSIAN NO-GO ZONE and the OUTER PLANETS. Elements of SOAP OPERA intruded as the narratives became ever more complex and on-going (see entry for long-running Martian soap CHAINS OF ASSEMBLY for separate discussion).\n“There was something else,” Carmel said.\nAchimwene said, “What?”\nThey were walking the streets of old Central Station. The space port rose above them, immense and inscrutable. Carmel said, “When I came in. Came down.” She shook her head in frustration and a solitary dreadlock snaked around her mouth, making her blow on it to move it away. “When I came to Earth.”\nThose few words evoked in Achimwene a nameless longing. So much to infer, so much suggested, to a man who had never left his home town. Carmel said, “I bought a new identity in Tong Yun, before I came. The best you could. From a Conch—”\nLooking at him to see if he understood. Achimwene did. A Conch was a human who had been ensconced, welded into a permanent pod-cum-exoskeleton. He was only part human, had become part digital by extension. It was not unsimilar, in some ways, to the eunuchs of old Earth. Achimwene said, “I see?” Carmel said, “It worked. When I passed through Central Station security I was allowed through, with no problems. The . . . the digitals did not pick up on my . . . nature. The fake ident was accepted.”\n“So?”\nCarmel sighed, and a loose dreadlock tickled Achimwene’s neck, sending a warmth rushing through him. “So is that likely?” she said. She stopped walking, then, when Achimwene stopped also, she started pacing. A floating lantern bobbed beside them for a few moments then, as though sensing their intensity, drifted away, leaving them in shadow. “There are no strigoi on Earth,” Carmel said.\n“How do we know for sure?” Achimwene said.\n“It’s one of those things. Everyone knows it.”\nAchimwene shrugged. “But you’re here,” he pointed out.\nCarmel waved her finger; stuck it in his face. “And how likely is that?” she yelled, startling him. “I believed it worked, because I wanted to believe it. But surely they know! I am not human, Achi! My body is riddled with nodal filaments, exabytes of data, hostile protocols! You want to tell me they didn’t know?”\nAchimwene shook his head. Reached for her, but she pulled away from him. “What are you saying?” he said.\n“They let me through.” Her voice was matter of fact.\n“Why?” Achimwene said. “Why would they do that?”\n“I don’t know.”\nAchimwene chewed his lip. Intuition made a leap in his mind, neurons singing to neurons. “You think it is because of those children,” he said.\nCarmel stopped pacing. He saw how pale her face was, how delicate. “Yes,” she said.\n“Why?”\n“I don’t know.”\n“Then you must ask a digital,” he said. “You must ask an Other.”\nShe glared at him. “Why would they talk to me?” she said.\nAchimwene didn’t have an answer. “We can proceed the way we agreed,” he said, a little lamely. “We’ll get the answers. Sooner or later, we’ll figure it out, Carmel.”\n“How?” she said.\nHe pulled her to him. She did not resist. The words from an old book rose into Achimwene’s mind, and with them the entire scene. “We’ll get to the bottom of this,” he said.\nAnd so on a sweltering hot day Achimwene and the strigoi left Central Station, on foot, and shortly thereafter crossed the invisible barrier that separated the old neighborhood. from the city of Tel Aviv proper. Achimwene walked slowly; an electronic cigarette dangled from his lips, another vintage affectation, and the fedora hat he wore shaded him from the sun even as his sweat drenched into the brim of the hat. Beside him Carmel was cool in a light blue dress. They came to Allenby Street and followed it towards the Carmel Market—“It’s like my name,” Carmel said, wonderingly.\n“It is an old name,” Achimwene said. But his attention was elsewhere.\n“Where are we going?” Carmel said. Achimwene smiled, white teeth around the metal cigarette. “Every detective,” he said, “needs an informant.”\nPicture, then, Allenby. Not the way it was, but the way it is. Surprisingly little has changed. It was a long, dirty street, with dark shops selling knock-off products with the air of disuse upon them. Carmel dawdled outside a magic shop. Achimwene bargained with a fruit juice seller and returned with two cups of fresh orange juice, handing one to Carmel. They passed a bakery where cream-filled pastries vied for their attention. They passed a Church of Robot node where a rusting preacher tried to get their attention with a sad distracted air. They passed shawarma stalls thick with the smell of cumin and lamb fat. They passed a road-sweeping machine that warbled at them pleasantly, and a recruitment center for the Martian Kibbutz Movement. They passed a gaggle of black-clad Orthodox Jews; like Achimwene, they were unnoded.\nCarmel looked this way and that, smelling, looking, feeding, Achimwene knew, on pure unadulterated feed. Something he could not experience, could not know, but knew, nevertheless, that it was there, invisible yet ever present. Like God. The lines from a poem by Mahmoud Darwish floated in his head. Something about the invisibles. “Look,” Carmel said, smiling. “A bookshop.”\nIndeed it was. They were coming closer to the market now and the throng of people intensified, and solar buses crawled like insects, with their wings spread high, along the Allenby road, carrying passengers, and the smell of fresh vegetables, of peppers and tomatoes, and the sweet strong smell of oranges, too, filled the air. The bookshop was, in fact, a yard, open to the skies, the books under awnings, and piled up, here and there, in untidy mountains—it was the sort of shop that would have no prices, and where you’d always have to ask for the price, which depended on the owner, and his mood, and on the weather and the alignment of the stars.\nThe owner in question was indeed standing in the shade of the long, metal bookcases lining up one wall. He was smoking a cigar and its overpowering aroma filled the air and made Carmel sneeze. The man looked up and saw them. “Achimwene,” he said, without surprise. Then he squinted and said, in a lower voice, “I heard you got a nice batch recently.”\n“Word travels,” Achimwene said, complacently. Carmel, meanwhile, was browsing aimlessly, picking up fragile-looking paper books and magazines, replacing them, picking up others. Achimwene saw, at a glance, early editions of Yehuda Amichai, a first edition Yoav Avni, several worn Ringo paperbacks he already had, and a Lior Tirosh semizdat collection. He said, “Shimshon, what do you know about vampires?”\n“Vampires?” Shimshon said. He took a thoughtful pull on his cigar. “In the literary tradition? There is Neshikat Ha’mavet Shel Dracula, by Dan Shocker, in the Horror series from nineteen seventy-two—” Dracula’s Death Kiss—“or Gal Amir’s Laila Adom—” Red Night—“possibly the first Hebrew vampire novel, or Vered Tochterman’s Dam Kachol—” Blue Blood—“from around the same period. Didn’t think it was particularly your area, Achimwene.” Shimshon grinned. “But I’d be happy to sell you a copy. I think I have a signed Tochterman somewhere. Expensive, though. Unless you want to trade . . . ”\n“No,” Achimwene said, although regretfully. “I’m not looking for a pulp, right now. I’m looking for non-fiction.”\nShimshon’s eyebrows rose and he regarded Achimwene without the grin. “Mil. Hist?” he said, uneasily. “Robotniks? The Nosferatu Code?”\nAchimwene regarded him, uncertain. “The what?” he said.\nBut Shimshon was shaking his head. “I don’t deal in that sort of thing,” he said. “Verboten. Hagiratech. Go away, Achimwene. Go back to Central Station. Shop’s closed.” He turned and dropped the cigar and stepped on it with his foot. “You, love!” he said. “Shop’s closing. Are you going to buy that book? No? Then put it down.”\nCarmel turned, wounded dignity flashing in her green eyes. “Then take it!” she said, shoving a (priceless, Achimwene thought) copy of Lior Tirosh’s first—and only—poetry collection, Remnants of God, into Shimshon’s hands. She hissed, a sound Achimwene suspected was not only in the audible range but went deeper, in the non-sound of digital communication, for Shimshon’s face went pale and he said, “Get . . . out!” in a strangled whisper as Carmel smiled at him, flashing her small, sharp teeth.\nThey left. They crossed the street and stood outside a cheap cosmetics surgery booth, offering wrinkles erased or tentacles grafted, next to a handwritten sign that said, Gone for Lunch. “Verboten?” Achimwene said. “Hagiratech?”\n“Forbidden,” Carmel said. “the sort of wildtech that ends up on Jettisoned, from the exodus ships.”\n“What you are,” he said.\n“Yes. I looked, myself, you know. But it is like you said. Holes in the Conversation. Did we learn nothing useful?”\n“No,” he said. Then, “Yes.”\nShe smiled. “Which is it?”\nMilitary history, Shimshon had said. And no one knew better than him how to classify a thing into its genre. And—robotniks.\n“We need to find us,” Achimwene said, “an ex-soldier.” He smiled without humor “Better brush up on your Battle Yiddish,” he said.\n“Ezekiel.”\n“Achimwene.”\n“I brought . . . vodka. And spare parts.” He had bought them in Tel Aviv, on Allenby, at great expense. Robotnik parts were not easy to come by.\nEzekiel looked at him without expression. His face was metal smooth. It never smiled. His body was mostly metal. It was rusted. It creaked when he walked. He ignored the proffered offerings. Turned his head. “You brought her?” he said. “Here?”\nCarmel stared at the robotnik in curiosity. They were at the heart of the old station, a burned down ancient bus platform open to the sky. Achimwene knew platforms continued down below, that the robotniks—ex-soldiers, cyborged humans, preset day beggars and dealers in Crucifixation and stolen goods—made their base down there. But there he could not go. Ezekiel met him above-ground. A drum with fire burning, the flames reflected in the dull metal of the robotnik’s face. “I saw your kind,” Carmel said. “On Mars. In Tong Yun City. Begging.”\n“And I saw your kind,” the robotnik said. “In the sands of the Sinai, in the war. Begging. Begging for their lives, as we decapitated them and stuck a stake through their hearts and watched them die.”\n“Jesus Elron, Ezekiel!”\nThe robotnik ignored his exclamation. “I had heard,” he said. “That one came. Here. Strigoi. But I did not believe! The defense systems would have picked her up. Should have eliminated her.”\n“They didn’t,” Achimwene said.\n“Yes . . . ”\n“Do you know why?”\nThe robotnik stared at him. Then he gave a short laugh and accepted the bottle of vodka. “You guess they let her through? The Others?”\nAchimwene shrugged. “It’s the only answer that makes sense.”\n“And you want to know why.”\n“Call me curious.”\n“I call you a fool,” the robotnik said, without malice. “And you not even noded. She still has an effect on you?”\n“She has a name,” Carmel said, acidly. Ezekiel ignored her. “You’re a collector of old stories, aren’t you, Achimwene,” he said. “Now you came to collect mine?”\nAchimwene just shrugged. The robotnik took a deep slug of vodka and said, “So, nu? What do you want to know?”\n“Tell me about Nosferatu,” Achimwene said.\nSHANGRI-LA VIRUS, the. Bio-weapon developed in the GOLDEN TRIANGLE and used during the UNOFFICIAL WAR. Transmission mechanisms included sexual intercourse (99%-100%), by air (50%-60%), by water (30%-35%), through saliva (15%-20%) and by touch (5%-6%). Used most memorably during the LONG CHENG ATTACK (for which also see LAOS; RAVENZ; THE KLAN KLANDESTINE). The weapon curtailed aggression in humans, making them peaceable and docile. All known samples destroyed in the Unofficial War, along with the city of Long Cheng.\n“We never found out for sure where Nosferatu came from,” Ezekiel said. It was quiet in the abandoned shell of the old station. Overhead a sub-orbital came in to land, and from the adaptoplant neighborhoods ringing the old stone buildings the sound of laughter could be heard, and someone playing the guitar. “It had been introduced into the battlefield during the Third Sinai Campaign, by one side, or the other, or both.” He fell quiet. “I am not even sure who we were fighting for,” he said. He took another drink of vodka. The almost pure alcohol served as fuel for the robotniks. Ezekiel said, “At first we paid it little enough attention. We’d find victims on dawn patrols. Men, women, robotniks. Wandering the dunes or the Red Sea shore, dazed, their minds leeched clean. The small wounds on their necks. Still. They were alive. Not ripped to shreds by Jub Jubs. But the data. We began to notice the enemy knew where to find us. Knew where we went. We began to be afraid of the dark. To never go out alone. Patrol in teams. But worse. For the ones who were bitten, and carried back by us, had turned, became the enemy’s own weapon. Nosferatu.”\nAchimwene felt sweat on his forehead, took a step away from the fire. Away from them, the floating lanterns bobbed in the air. Someone cried in the distance and the cry was suddenly and inexplicably cut off, and Achimwene wondered if the street sweeping machines would find another corpse the next morning, lying in the gutter outside a shebeen or No. 1 Pin Street, the most notorious of the drug dens-cum-brothels of Central Station.\n“They rose within our ranks. They fed in secret. Robotniks don’t sleep, Achimwene. Not the way the humans we used to be did. But we do turn off. Shut-eye. And they preyed on us, bleeding out minds, feeding on our feed. Do you know what it is like?” The robotnik’s voice didn’tgrow louder, but it carried. “We were human, once. The army took us off the battlefield, broken, dying. It grafted us into new bodies, made us into shiny, near-invulnerable killing machines. We had no legal rights, not any more. We were technically, and clinically, dead. We had few memories, if any, of what we once were. But those we had, we kept hold of, jealously. Hints to our old identity. The memory of feet in the rain. The smell of pine resin. A hug from a newborn baby whose name we no longer knew.\n“And the strigoi were taking even those away from us.”\nAchimwene looked at Carmel, but she was looking nowhere, her eyes were closed, her lips pressed together. “We finally grew wise to it,” Ezekiel said. “We began to hunt them down. If we found a victim we did not take them back. Not alive. We staked them, we cut off their heads, we burned the bodies. Have you ever opened a strigoi’s belly, Achimwene?” he motioned at Carmel. “Want to know what her insides look like?”\n“No,” Achimwene said, but Ezekiel the robotnik ignored him. “Like cancer,” he said. “Strigoi is like robotnik, it is a human body subverted, cyborged. She isn’t human, Achimwene, however much you’d like to believe it. I remember the first one we cut open. The filaments inside. Moving. Still trying to spread. Nosferatu Protocol, we called it. What we had to do. Following the Nosferatu Protocol. Who created the virus? I don’t know. Us. Them. The Kunming Labs. Someone. St. Cohen only knows. All I know is how to kill them.”\nAchimwene looked at Carmel. Her eyes were open now. She was staring at the robotnik. “I didn’t ask for this,” she said. “I am not a weapon. There is no fucking war!”\n“There was—”\n“There were a lot of things!”\nA silence. At last, Ezekiel stirred. “So what do you want?” he said. He sounded tired. The bottle of vodka was nearly finished. Achimwene said, “What more can you tell us?”\n“Nothing, Achi. I can tell you nothing. Only to be careful.” The robotnik laughed. “But it’s too late for that, isn’t it,” he said.\nAchimwene was arranging his books when Boris came to see him. He heard the soft footsteps and the hesitant cough and straightened up, dusting his hands from the fragile books and looked at the man Carmel had come to Earth for.\n“Achi.”\n“Boris.”\nHe remembered him as a loose-limbed, gangly teenager. Seeing him like this was a shock. There was a thing growing on Boris’ neck. It was flesh-colored, but the color was slightly off to the rest of Boris’s skin. It seemed to breathe gently. Boris’s face was lined, he was still thin but there was an unhealthy nature to his thinness. “I heard you were back,” Achimwene said.\n“My father,” Boris said, as though that explained everything.\n“And we always thought you were the one who got away,” Achimwene said. Genuine curiosity made him add, “What was it like? In the Up and Out?”\n“Strange,” Boris said. “The same.” He shrugged. “I don’t know.”\n“So you are seeing my sister again.”\n“Yes.”\n“You’ve hurt her once before, Boris. Are you going to do it again?”\nBoris opened his mouth, closed it again. He stood there, taking Achimwene back years. “I heard Carmel is staying with you,” Boris said at last.\n“Yes.”\nAgain, an uncomfortable silence. Boris scanned the bookshelves, picked a book at random. “What’s this?” he said.\n“Be careful with that!”\nBoris looked startled. He stared at the small hardcover in his hands. “That’s a Captain Yuno,” Achimwene said, proudly. “Captain Yuno on a Dangerous Mission, the second of the three Sagi novels. The least rare of the three, admittedly, but still . . . priceless.”\nBoris looked momentarily amused. “He was a kid taikonaut?” he said.\n“Sagi envisioned a solar system teeming with intelligent alien life,” Achimwene said, primly. “He imagined a world government, and the people of Earth working together in peace.”\n“No kidding. He must have been disappointed when—”\n“This book is pre-spaceflight,” Achimwene said. Boris whistled. “So it’s old?”\n“Yes.”\n“And valuable?”\n“Very.”\n“How do you know all this stuff?”\n“I read.”\nBoris put the book back on the shelf, carefully. “Listen, Achi—” he said.\n“No,” Achimwene said. “You listen. Whatever happened between you and Carmel is between you two. I won’t say I don’t care, because I’d be lying, but it is not my business. Do you have a claim on her?”\n“What?” Boris said. “No. Achi, I’m just trying to—”\n“To what?”\n“To warn you. I know you’re not used to—” again he hesitated. Achimwene remembered Boris as someone of few words, even as a boy. Words did not come easy to him. “Not used to women?” Achimwene said, his anger tightly coiled.\nBoris had to smile. “You have to admit—”\n“I am not some, some—”\n“She is not a woman, Achi. She’s a strigoi.”\nAchimwene closed his eyes. Expelled breath. Opened his eyes again and regarded Boris levelly. “Is that all?” he said.\nBoris held his eyes. After a moment, he seemed to deflate. “Very well,” he said.\n“Yes.”\n“I guess I’ll see you.”\n“I guess.”\n“Please pass my regards to Carmel.”\nAchimwene nodded. Boris, at last, shrugged. Then he turned and left the store.\nThere comes a time in a man’s life when he realizes stories are lies. Things do not end neatly. The enforced narratives a human impinges on the chaotic mess that is life become empty labels, like the dried husks of corn such as are thrown down, in the summer months, from the adaptoplant neighborhoods high above Central Station, to litter the streets below.\nHe woke up in the night and the air was humid, and there was no wind. The window was open. Carmel was lying on her side, asleep, her small, naked body tangled up in the sheets. He watched her chest rise and fall, her breath even. A smear of what might have been blood on her lips. “Carmel?” he said, but quietly, and she didn’t hear. He rubbed her back. Her skin was smooth and warm. She moved sleepily under his hand, murmured something he didn’t catch, and settled down again.\nAchimwene stared out of the window, at the moon rising high above Central Station. A mystery was no longer a mystery once it was solved. What difference did it make how Carmel had come to be there, with him, at that moment? It was not facts that mattered, but feelings. He stared at the moon, thinking of that first human to land there, all those years before, that first human footprint in that alien dust.\nInside Carmel was asleep and he was awake, outside dogs howled up at the moon and, from somewhere, the image came to Achimwene of a man in a spacesuit turning at the sound, a man who does a little tap dance on the moon, on the dusty moon.\nHe lay back down and held on to Carmel and she turned, trustingly, and settled into his arms.\nOriginally published in Interzone,#244 January-February 2013.\nLavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize."}