{"fingerprint": "JtcoEQS+VNZCr4lLlCxfufjqRUA=", "sitename": "Clarkesworld Magazine", "title": "(To See the Other) Whole Against the Sky by E. Catherine Tobler", "author": "E Catherine Tobler", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tobler_11_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: (To See the Other) Whole Against the Sky by E. Catherine Tobler", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4010 words, short story\n(To See the Other) Whole Against the Sky\n2013 Finalist: Theodore Sturgeon Award\nClose your eyes. As you travel farther away from me, your ship becoming little more than a pinprick of light amid infinite pinpricks of light, I want you to remember me as I was the first time you saw me, in the field. The day I glowed.\nAll right, it was an interface malfunction, but I still glowed. You told me I had been set on fire, that I was all colors and so seemed white, holy, pure.\nHow we laughed.\nQuery: If two interstellar ships leave Point A in the same instant, traveling at identical velocities in opposite directions, at what distance does communication between Ship A and Ship B break down?\nAs first meetings go, it wasn’t terrible.\nWhen you’re assigned a new partner, you never know how you’ll mesh. In this business, it usually doesn’t matter. We are expendable and know that from the outset. What matters are the multitrillion dollar cargoes of compressed titanium, the ships, the Manifest Destiny. The fallibility of machines in the vastness of deep space means bringing a human to tend them, to coddle when needed. Assigning one crewmember per ship keeps costs down. Keeps the murders down, too. The company took its time in understanding this. They tried multiple configurations: complete crews with chains of command; pairs; loners.\nThe traditional chains of command became problematic almost from the outset, crews slaughtering each other over money and station when they realized both were all they would have in the deep black. Sometimes it went quickly: the men killed each other over the women, the women killed each other over the men. When the wreckage of the Prospero was finally recovered, the company required only two more similar incidents to convince themselves.\nLaunched-as-pairs had more success in the early years, but the fucking ruined everything. Regardless of sexual orientations, interests, configurations, it always came to fucking. Two humans, confined in an enclosed space for more years than one can rightly imagine when the contracts are signed, create an immense amount of havoc, destruction, ejaculate, and blood.\nProviding crewmembers with other means of relief for such long voyages was deemed outside the company’s scope, if lacing MREs with birth control and controlling one’s carry-on luggage was not. Even employing homophobes in an effort to avoid such base desires did not have the desired outcome. They fucked, killed their partner, and then went insane as the ship drifted untended. One can presume with half a dozen such reported incidents, there were three to five times more that number.\nThe proper custodians were deemed to be loners, us. Those content to exist with a minimum of contact. While suicide remains a concern in certain circles—circles that will never reach the uppermost levels—we are used to anhedonic wonderlands, to agoraphobic serenity. With a communications unit for holographic interaction, we do what we do best: talk behind our aliases as we ensure the natural hum and shiver of the machines around us. For a loner, this is the precisely perfect occupation, a diet of minimally-invasive companionship that can be closed at a moment’s notice.\nResponse: “If” is a terrible word. When two interstellar ships leave Point A. There is no if involved, for the ships do leave, in the same instant, travelling at identical velocities. Ship A heads toward illusory west. Ship B heads into illusory east. Point A becomes the anchor around which all other stars move, a point where you can calculate all those distances you love so well.\nAt what distance does communication between the ships break down? Never. This is the awful truth. The ships will continue to communicate, via radio frequency waves and pings. It is the people on board the ships who lose the ability to communicate. The VR interface no longer interfaces. One can send time delayed holograms via the interface, but even this data becomes obese. It is stripped, to voice alone, which travels faster than you might imagine—what is the speed of a whisper in the dead of night? It is like a well-barbed arrow, sharp and fierce. But even voice becomes too heavy in the deep black, so thought and emotion are condensed into communiques, nearly old fashioned letters which speak perhaps twice as well as any VR interface might. They are slow, but allow for harder truths. In the end, there will be only silence, even as the ships whisper via radio, via small Bracewell probes launched into the black in an attempt to extend communication range. Ships don’t care how long a thing takes. Neither do loners. Usually.\n“Are you awake? I hope you’re awake.”\nThey were the first words I spoke to you as I waited for your avatar to log in to the virtual environment. The first place I conjured for you was that field, empty but for the grass and the sky. Earth blues and greens, mid-summer, northern hemisphere. It could have been anywhere of course. I chose these intentionally. Not to ground you in something familiar, but to show you something familiar to me.\n“Sometimes the avatar takes a while to come online.”\nI could see your name on my console, small and green and hovering in the lower left. You weren’t a known entity to me then, but Company-approved nonetheless and green-lighted. I walked a slow circle as I waited, hands outstretched to brush the scentless white blooms that reached up through the grass. I couldn’t feel the grass either, of course, but memory filled those blanks easily enough. Drought grass stubble, my palms would itch. The grass moved in a slow wave even though there was no wind. If I concentrated elsewhere, the scent of coffee intruded, so I didn’t.\nYou coalesced from copper clouds. Tall, though not as tall as you would become. Pale, but not so pale yet, either. I stopped pacing and curled toes into grass that did not exist. “I don’t mean to get you out of bed.” Of course, I did; the Company required such things. “Can you confirm the distance?”\nYour voice cracked as it came online—I blamed the interface even then, because your voice was only ever even from this moment on. “Eleven,” you said, and it seemed as though you had not spoken for a very long time. “Eleven point two AU.”\n“And the other?” My hands paused in the grass even as yours reached for it. “Earth?” How far were we at this point? Was your ship processing data as it should? Our numbers should match, they should always match.\nIt happened then, that burst in the interface and your eyes went wide. I thought I could see my reflection in your eyes (you chose blue, so did I)—the way I seemed to glow as if lit from within, but nothing inside me would ever burn so bright.\nYou told me I had been set on fire, and your hands reached from the grass, toward me. I did not move, knowing there might be a touch, avatar against avatar, but I would not feel it. All colors you said and looked as though you were warming your hands against a campfire. “Holy, pure.”\nWe laughed, maybe the first thing we did in unison. We both knew it for a lie, considering where we were and who we must be. Loners.\n“Can you confirm the distance?”\nYour head came up, eyes taking in the landscape beyond me. Your hands slid into your pockets that formed at the mere idea of pockets crossing your mind, a place to put your hands so they would not enfold me. Your avatar flared with light then, a pulse of blue as the interface crackled.\n“Two hundred seventy-seven thousand—”\nOur minds have trouble comprehending such distances. The system compensates, makes it momentarily bearable. I drew up a chart between us, a familiar thing to anyone schooled in astronavigation (we both were). My fingers pulled gleaming lines like neon spaghetti from apparent nothingness, to illuminate the distance from here to there, but not back again.\n“ . . . six hundred AU,” you finished. How could we be so far away from Earth?\n“Sleep now,” I said, and erased the hovering lines with a sweep of my hand. You would be tired. It was hard coming out of hypersleep—in the latter days and when ships flew with full crews, it was the point when a good percentage of shipboard deaths occurred, crew disoriented and wary of everything. A body needed time. A body needed distance.\n“Online in another two hours for recalibration.”\nQuery: Do east and west exist in space? North and south?\nYou will think your ship is haunted; the Company tells us it is a commonplace belief, so includes this amusing anecdote in all briefings. You always laugh, until you sign the contract, find yourself on board and in the depth of space, and start to hear things. Most cities are haunted and as your ship is a city for one, so too does it hold its ghosts. You bring them on board with you—eidolons, fears, illusory things that should be beyond people of our training and education. Still, Einar murmurs.\nEinar is more like a city than not, despite its population concerns. A vast array of universe-traversing equipment rises around your room as it does mine, a one-room studio which looks much like the spaces we occupied before the Company offered its contract. Beyond the borders of tidy, automated kitchens and icon-laden desks, is a window that surveys the labyrinthine network of power conduits and production stations. Stations only you will use, but not today. In the distance, a vacuum door lit overhead with a perfectly white LED sign which reads “Cargo Observation.”\nYou won’t like this door, no one does. It will come to be your least favorite part of the ship. You can cross the pleasantly padded deckplate as you want, jog through the maintenance corridors to clear your mind, but the door you will avoid. It is the starkest reminder that you are somewhere else, somewhere far from home. Such reminders are reason enough to keep the window’s opacity set to maximum, preserving the room’s Terran simplicity. Your desk is orderly, fingerprints erased almost as they are left. Beyond this space, the conduits and especially the door, will fade.\nNot that you see them often. Any corridor can be transformed with the brush of a hand, any thought overlaying the great gerbil maze with varying degrees of falsehood. Atmosphere condensers become the trees of Central Park in early fall, with customizable time-of-day and alterable crowd density controls. Neat stacks of cargo crates make for lovely park benches and with one simple command, squirrels will always come for the acorns you never hold.\nThe surreality of the corridors have hidden the haunting for some time, daunted your belief. The Company told you, after all, that you would hear things on occasion. The Company was diligent enough to train you on the sadly predictable failures of the human mind during long periods of isolation. Is it worse or better then, time spent together? It’s hard to say, because while it eases one ache, it intensifies others. We may come to think the sounds are us, moving ever closer to each other, stumbling in dark corridors as we reach for each other’s light, even though we know this is improbable. We occupy identical ships, with identical cargoes, heading in opposite directions.\nIt was certainly one of the squirrels. You think you hear a metallic bang, like a foot stubbed somewhere deep in the corridors. The squirrel that was not there never turned, merrily eating the acorn that was not there, that had never been in your hand, and surely didn’t respond when you asked, “Did you hear that?”\nA proper New York squirrel always turns at the first shock of sound, gone to the treetops after a noise like that. Street animals know best that cruelties always awaited the careless in a city. Even Einar. Perhaps especially so.\nResponse: You will come to understand that north, south, east, or west do not exist within in the limitless black of space. Compass points lose merit where there is no center from which to reach. There is no pole, no equator. Compass points can be manufactured as one manufactures anything. From the requirements of one’s mind, anything might spring.\nBegin at any stable point—a galaxy, a planet—understanding that stability is also a myth, for everything is in constant motion (see: Newton, 1687; Kepler, 1609). Visible objects are useful, but understand that visibility is likewise a myth. Light requires time to travel its distances, so what you see is no longer what exists. Galactic equator, grids infinitesimally divisible, you limit yourself with four directions.\nMy field, your field. They come to be one and the same, though more often than not we choose my field with its long grasses and blue sky. You say you feel like an intruder here. You like that feeling and I come to like having you here. I know I can always turn the interface off if I need to be alone, but less and less do I find myself needing that. We stay longer every time. If the connection drops, we come back a moment later, right where we were before as if never gone. Even after breaking for sleep, we come back like that. Picking up a never-ending conversation.\nThere is a couch in the field today, red and velvet and if we close our eyes—our real eyes and not our virtual eyes—we can almost feel it. I like it best when it’s brushed backwards. When I look at your hands splayed across the fabric, I watch how you stroke it backwards, too. Against the soft grain, so the light sheen turns to dark matte. My cheek rests against your cheek and if I close my eyes I can feel that connection, too.\nI can’t remember how it happened—it’s too far gone now and I could calculate the AU, but I don’t. I can’t remember how talk of charts and distances and shipwide pressures turned into talk of family, of things we had and would never have. We were loners—we had forgone marriage and children, we had never formed the bonds so many others do. I always wondered what that would be like, to find someone you could tolerate for such a long journey. There were near misses for you and me both, the glance of an asteroid off the port side, but no impact, no hard strike.\nThere was an asteroid, you say. Or rather, a meteor. All right, a micrometeor shower. Like rain on the hull. Did the ship incur damage? No, nothing like that. No shield fluctuation, no hull breach. It’s an explanation of a sound you can’t otherwise explain: the squirrel hadn’t been there, after all, and part of your rational mind knows this. It’s an explanation of a thing you can’t otherwise understand: one body moving through another, each with a different destination. I picture our ships, moving ever farther apart as they close in on their destinations.\nJust interplanetary dust, you say. If you could wipe the ship’s windows clean, you would.\nQuery: What about the aliens?\nI become well-schooled in conversations, hearing you even when you aren’t there to reply. Is it that I know you so well by this point, or is it that you remain elusive and blank-slate, so any reply from my own mind will slot where your own would go? Is it that I am a similar slate, empty until you arrive with your words? You’re more distant now and I shouldn’t feel it, but I do. I mark the distance in logs, charts, tables. Soon, we will pass beyond all communication.\nI wake in the night feeling hands on me. Insistent. These hands prove that the shortest distance between two points may be a straight line, but that’s never the best route to take. Thumbs knead into flesh, pull open, feast. Canvas beneath fingers, painted in firm strokes. I wake, heavy with blood, startled it hasn’t boiled through my skin, left me in a puddle. I am alone, I should be beyond this point. Should never have come to this point.\nThe deck is solid beneath my feet when I run. Running gives me a focus, sets those concocted hands at a firm distance if only for a while. What I can reach of the corridors in four looping circuits amounts to ten kilometers. Just over six miles of corridors that can look like anything I want them to. I could run mountain trails, trees bleeding from gold to orange and back again. There could be birdsong, a breeze to cool the sweat on my skin, but there is only the black anthracite luster of the corridors I have come to prefer. I don’t look at the door with its LED lights.\nI’m moving farther away from you when I climb the corridors, coming closer to you when following the arc back to the command module. Machinery breathes around me, a thundering exhale that will see me to my destination. The cargo is quiet; compressed titanium never fusses, only rests in its countless cases (one million, four hundred thirty thousand—it’s my job to count the countless and that number is almost the distance from Saturn to Sol, almost).\nDid you hear that?\nI ask you, even though you are not there. But there is a thump before the machine whir swallows any other sound.\nAn emphatic no.\nResponse: Everyone asks about aliens. There is a clause in the Company contract about that too, about the distances involved—distances which you are about to experience should you agree to Company terms and sign your life away. Yes, alien life probably exists in the deep black, but these distances, the Company says, make any extraterrestrial contact unlikely.\nGiven the number of galaxies, the number of stars within those galaxies, the number of stars which support planetary systems, to presume life doesn’t exist somewhere is foolish, but you will likely not encounter it. Consider how difficult it is to haul the cargo you’re about to haul. Consider the distance involved, the communication depravation you are about to endure.\nOf course, there are protocols one should follow, if the unlikely proves likely and one is not immediately killed or fucked or fucked to death. These are detailed in contract subsections which no one reads.\n(A foolish presumption perhaps, but what if true? What if there’s a reason for all the silence? What if there is simply no one else? No one wants to dwell on that. Not even loners.)\n“Are you awake? I hope you’re awake. Don’t get out of bed.”\nIf you are like me, and surely over these past months we have established that you are and I am, and we are—then you are awake most hours, even if in bed. Time ceases to matter really. The ship keeps time, but we don’t always follow along. In space, it’s always night beyond the windows, no matter the glow that fills the corridors.\nMy voice probably crackles and spits, fat dripping into a fire, echoing in reverse at times the way yours does now. I’m getting farther away. This message will be delayed—is it three months now? I could calculate it, but I don’t.\nI can hear you say it’s fine and I picture you sitting bolt upright in bed, because it’s the way I came to your last message. It didn’t matter—it was fine—whenever the words came, whenever you came. It was the turning of one body into another in the tangle of the bed sheets, across countless (no) astronomical miles. It was that voice, welcome at any hour, because it managed to be a bridge in the distance we believed we needed. Distance from everything else, so we could find each other here. Deep impact.\nYour room is wholly dark but for the hologram of me—the windows don’t let the white LEDs bleed through, there is no door, only this warm darkness that crackles with me. It won’t be bright, this hologram; distance precludes that now. Space tears at the message in transit. You quickly learn to gauge how close someone is to you by how much of them has been ravaged away. Next time, it will be only voice, and after that— I imagine the way you study me, hands reaching for sheets the way they once reached for field grass, the way they once reached for me and maybe still do. If you are anything like me.\nMuch like the last message you sent me, it doesn’t matter what I say. I tell you about the ship, I tell you about my days, which are quiet and filled with running. There are books to read, of course; so many books, carried as far as they’ve ever been carried. There is the occasional squirrel—you taught me how foolish they are and they aren’t there at all, but I’ve named them all, even though they are all the same, the same as every leaf that falls loose from Central Park’s autumn canvas. I erase every soul in the park with the slide of one finger, but for one figure I keep distant and shadowed with your name. The ship is good, the cargo is complacent, and I’ve not been killed, fucked, or fucked to death by aliens.\nStatus quo. Query: How are you?\nYou don’t dream, so I tell you all of mine, as if you will somehow understand and acquire the ability through me. Improbable, I think, if I cannot even press my hand to your hand, but I keep telling you what happens when I appear to be asleep. I dream about that door.\nCargo Observation. Why do crates (one million, four hundred thirty thousand) of compressed titanium require observation? Were these ships used for something else before we hauled such trouble-free cargo? I don’t know, but in the dream I go to that door and press my hand against its flat surface. It’s as cold as anything you can imagine—we are in the depths of space, we know cold and can imagine plenty. The door doesn’t so much open as it disappears and I’m not sure what I expect to find on the other side, but it isn’t the familiar anthracite corridors I encounter.\nI am running then, moving farther away from you when I climb the corridors, coming closer to you when following the arc back to the command module. Machinery breathes around me, a thundering exhale that will see me to my destination, but my destination is not the command module—not mine, because this one is just that much different. It’s cleaner, colder, and it has a scent of salt. Of another body. Aliens, I think, and for a moment panic wells up, but then— Then.\nYou stride through the access hatch and your rough palm notches against mine and if I could teach you how to dream it would be in this moment, when we know the warmth of each other’s fingers in the dead cold of space. It would be when we realize that we are not alone, that we have never been alone, that we have been travelling on this vessel together all the while. You were only ever through a doorway and I was only ever through a doorway, and perhaps this is noted in the Company contract—perhaps we agreed to it, felt a wariness for the door because of strings attached, because if we knew we were not alone—\nNot loners at all. And we know what happens to not-loners, so my hand slides from yours and we step back, as if performing a dance, and there is a hard flicker—a burst of energy through the interface, and your pale face illuminates, as bright as the sun we have not seen in years, and you tell me I’m glowing, I’m glowing.\nClose your eyes. I want you to remember me this way."}