{"fingerprint": "vwA1NVdUtFuv0gd16UpMEjoHYlw=", "sitename": "Clarkesworld Magazine", "title": "Migratory Patterns of Underground Birds by E. Catherine Tobler", "author": "E Catherine Tobler", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tobler_05_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Migratory Patterns of Underground Birds by E. Catherine Tobler", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4340 words, short story\n Migratory Patterns of Underground Birds\n They say everything in the world has been discovered. They are wrong.\n Finding the bodies used to be troubling; it’s worse when the bunkers turn empty, the bodies taken.\n The land is filled with bunkers, dark wombs carved into the earth, reinforced with stone, brick, bars. They kept us in small spaces, but we expanded even so, and when they left—they? I still don’t know—we began to die, and so I left too, before I could become a body for someone to discover.\n Everywhere I go, the world is living and its people are dead. Lights in the sky every third night as I travel, some times near and most times distant, and then not again. The sky grows as quiet as the land, maybe more so because the land holds the whisper of wind through tall grasses and sometimes the trickle of fresh water, but there is never enough water. It was this way in the bunker, so many bodies, so much thirst.\n Here, the land spreads quiet, low and still. I hunch against the short spiked grass and do not feel the seep of water through my pants; everything is frozen, a season unturned. Cipta told me the ways the ground would thaw, how water would pool when the season warmed, but everything remains cold, hard, and Cipta is gone with all the others.\n The sky darkens with the coming of night and ahead, a bunker plummets into the cold ground, metal doors spread open against the sedge. It has been twelve sunrises since I found the last bunker and with the frozen ground, I did not expect another so soon. I will not sleep here, but build a fire in a ring of rocks. It has become rote, the metal and the flint and the way they can be made to spark. The flat land supports no trees and an almost-constant wind whips the sparks into flames.\n Every bunker opens the same: metal stairs tonguing into the black ground. There will be sixty-four steps before I reach solid floor. I light my reed torch in the fire and it sputters in the cold dark, throwing shadows against the stairs. I do not touch the handrail, I do not touch the central support; dried blood splatters both like rust.\n There should be bodies, but there is only the memory of such within these stone halls. The underground space spreads empty and black, torchlight moving over walls and metal cages. The sound of my feet echoes, floors slick with dust. Cots, blankets, the scent of a thing that was once wet and now rots. A coat hangs empty against a wall, then loose over my shoulders.\n The earliest bunkers I found contained bodies, some lain out as if sleeping, others appearing felled in mid-step. The sixty-four steps of the earliest bunkers were piled with bodies, hands straining toward sky that would remain forever out of reach. The earliest bunkers contained pantries of food and provisions, but this bunker’s pantry is empty, every shelf draped in dust.\n Halfway into my climb back into the wind-whipped world, cold, clear light punches down the staircase. The wind rushes down and the sharpness of the light makes my eyes water. I cannot see anything in the flood of light and tears, even looking through the bars of my fingers raised against the brilliance. The light pours through the opening like a vast and searching eye.\n Have they come for me at last? I still don’t know who I mean; there were guards in the bunkers, administering meals and schedules, but they like every person held in the cages is dead or gone. Have they come for me at last? Do they control the lights?\n Who? I hear the question in Cipta’s rough voice and I still don’t know who I mean.\n The lights move off, the sky revealed as if the brightness was never there. The worn toes of my boots catch the lip of almost every step as I force myself up the remaining stairs, legs burning when I emerge into the evening wind, heart like a fist in my throat. Stars prick through the vault of sky—a brightening chain of them spread like string toward the far horizon—but it is not yet dark enough to hide anything that might otherwise be up there. There are no lights. There is no ship, no drone. Cipta said when there was, we were to run away, not toward, but the sky is empty of all but stars and night-flying birds and the wind extinguishes the flames from my reed torch.\n I sink to the ground and smother the fire with the meager soil I am able to rake free with my fingers. Was it the fire that brought the lights in the sky? It was not the fire before, the lights always and ever at a distance. A glance at the empty and yawning mouth of the bunker reveals no answers so I take my meager pack and do what I have done since I left the confines of the bunker: I walk.\n Every time I bleed, I make a mark in a book of paper with the end of a stick blackened in fire. Cipta kept this book before me, produced it with her own hands using threads pulled from her clothing and hair pulled from her scalp to bind the pages. Cipta wrote down days, and blood, and showed me how words are made. Cipta remembered a life lived beyond bunkers, a life with family and responsibilities, a life at the edge of a great sea that caught the colors of day and night alike, but of that life I see no sign no matter how far I walk. I have left the frozen waste behind and jagged mountains rise into the clouded sky.\n The blood is not an injury, only a recurring means through which we might track the days, the months, the years. She told me that once this blood and body would nourish a child, but I have never seen a child in this world. Every time I bleed, I think of Cipta, because she was here in the beginning and no longer is.\n Cold wind curls the edge of the page up against the stick, leaving the mark ragged. I slide the stick back into the book’s spine, and slide the book back into my pack, and keep moving. I will not want to travel tomorrow when the blood is more and the pain sharper, so must cover as much ground as I might today.\n And where am I going? Away.\n And why am I going? Because to stay was a kind of death all its own, though I knew the limits of that underground bunker better than I knew anything else. This world is, on the whole, unknown to me, the sky grotesque and endless, and yet to deny myself its terrifying grandeur once I had seen its colors and storms was in some way unthinkable.\n The mountains, seen days ago as a ridge that grew less vague the more I walked, are dry and rocky. The vegetation is sparse and I find myself missing the frozen tundra; there was plenty to burn there. I have found no river, but even the smallest of plants draws water from somewhere. Even the smallest rodents.\n A small furred body darts up the ridge ahead and I follow. It has been ten days since I’ve caught anything for the scarcity of things living on the ground. Birds traverse the sky in long unreachable lines and I lost two spears before I stopped trying for them. It’s a spear I throw now, skewering the rodent before it can escape. The motion of the spear hauls the rodent backward, into a slide of ruddy rock.\n Once skinned, the small body crisps up in the scant fire. I am tearing a long strip of meat free from its spine when I see more movement on a distant ridge. If it is another animal, I will have food for tomorrow, tomorrow when I cannot travel as easi—\n It is a person, a person moving up the next ridge I am to face. The person climbs with long-legged determinedness, body thrown into shadow by the angle of the sun. I stop breathing and stare, my meal growing cold between my teeth. I stagger to my feet and take a lurching step forward, kicking broken rock over my fire. Wait, I want to say, but the word sticks in my throat; it has been so long since I have spoken, have I forgotten how? Wait, I want to say, but my voice goes unheard.\n Time fragments: I do not remember shoving my meal into my pack, do not remember abandoning the fire to the stones. I do not remember breaking my spear in two when I jolt at the sight of this person—wood of any decent length is so hard to come by and later there will be anger over this senseless destruction. The mountains themselves seem to fall away even as they impede my every step. Loose rock slides under my boots and when I reach the ridge, the mountains are already falling into the shadow of coming night. Breathless, I make my way up the ridge the person climbed, but a footprint makes me fall to my knees.\n In the soft dry ground, the footprint is foreign. I reach for it, as if I can add it to my pack as something found on my journey, something to share with others in a distant future. Before I can ruin the outline of shoe in dirt, I stop myself. The footprint doesn’t matter; the foot that left the print does.\n The ridge is hard under foot, hands bloodied and spear further broken by the time I reach the top. I expect to see land spreading far and away from these dry hills, but more mountain spreads beyond. Amid the rocky landscape, there is no figure, no one to call to, and I wonder if after all this time I have begun to crave companionship and conjured a shadow to pursue.\n I cannot look down the ridge at the footprint or its sudden absence.\n The rock mountains give eventual way to sprawling plains, the wash of rock consumed by the rise of tender grass and harder sedge. Here, the air is soft with white tufts expelled from seed, as if the ground has never known ice and rivers run abundant if yet unseen. The green plain undulates in a gradual wave the way the mountains never did, every surface covered with long, thick grasses that conceal abundant life. Rodents and larger animals bound from the verdant growth and I think that if only they stayed still, I would never see them, they would pass unknown. But they spring from their hiding places, disrupting the clean, straight lines of the grass to burst brief into the air, before they are once again swallowed by the fertile deep. The beasts tunnel in frantic lines from the invasion of my boots, chittering to each other and going still when I do. If another person passed through this grass, the wind has long since erased their passage.\n I stand and close my eyes and listen to the world around me, different from the mountains that rise far to my back. The wind makes a low breath through the grass and it is seed that lifts into the air instead of dry dust. Bent to my knees, damp ground soaks my clothes and gives way under my weight, as if it means to welcome me for a long stay, but I will not stay, no matter how cool and pleasant the blades are beneath my callused hands.\n Against the far horizon the land moves upward again and if they are mountains I do not care. For now, there is only the plain and I clear a circle of grass down to the dirt, thinking to build a fire. But the ground is too wet and my laughter startles animals within the grass as it pours from me.\n I burrow into the grass, until I can cover myself and watch the sky pass above through a thin lattice of green. I was kept below ground for so long, it is a comfort to be sheltered from the limitless sky. Clouds thicken across the ivory vault and the smell of rain saturates the cooling air, but the clouds do not spill their water. The sky bruises the way I do when I fall, until the sun is dragged beneath the horizon by scrabbling, dark-clouded hands.\n Night comes and sleep, too, and when I wake there is a brown rabbit curled near my damp cheek. It watches me with wide black eyes, but does not flee, its side rising with unpanicked breaths. I am only a creature in the grass much as it is; its nose moves and it breathes me in, the smells of sweat and wet and half-warm sleep. Its ears are wet with dew and above the green canopy that covers us, morning stretches its bright fingers. I do not move until the rabbit goes, tunneling without hurry into the grass as if it knows where it is headed, without fearing me as a threat.\n I bundle grass into my pack, exchanging it for a meal of dried meat and berries as I set off across the plain. Wet ground means no fire, which means no fresh meat, but there were times before I had no food at all, and the berries are sweet. The bunkers meant reliable food, a place to sleep already shaped by your body from countless nights before, a path known to all because it was all that existed. And when all has gone?\n I walk on.\n The green plain is not eternal, not like the sky above, for in the near distance there rises something I have not seen in eighty-four days: a shed. This shed is a division, a sharp point between the plain and all that sprawls beyond—and here, beyond, I can see it is not hills or mountains, but ragged trees at long last, clawing at the boundless and darkening sky.\n The shed is so worn that its shadowed silhouette slants toward the setting sun. The prior shed led to a bunker and I have no cause to expect this space will be any different. Will this bunker hold bodies? Will this bunker hold food?\n When the figure emerges from the shadows, I stare in fear that I have conjured this person yet again. A man, not tall but looking accustomed to work, to walking. Strong, solid.\n Cipta told me: the stupid ones will try to take you by force because they know of no other way to hurt you. They believe your cunt is the center of your world, because their cock is the center of theirs. The smart ones are the ones you have to watch, because they know the myriad ways you can be hurt, the ways that extend from your center, the way pieces of your mind can be taken, abused, erased. These are the ones you have to watch for, Cipta said.\n Is he stupid or is he smart? His hands are laden with wet clothing and he wrings water from each piece before draping them over the shed doors. He has a stranglehold on a shirt when he looks up, when he sees me. His chin comes up, shirt forgotten in his hands, as I stare in return. His eyes narrow and his lips part and his face brightens from the flood of lights in the sky.\n Lights in the sky.\n There is a startling uprush of air and birds scatter upward from the grasses, shrieking as the lights descend upon the shed. Toward the man. I lurch into motion, desperate to reach him, but my boots slip against the damp grass, and I cannot run fast enough. The lights are the way I imagine sunlight on wide seas: bright and clear and flooding the plain. When I break through their boundary, I expect to be burned, to dissolve, to fly into the air in a thousand pieces and forget everything I have known, but I am only blinded by the brilliance. I push toward the shed even as I cannot see it, and when I can see it, the lights have gone, the man has gone, and I am once again alone.\n My throat is raw as if screamed that way and his laundry hangs cold in the rising dark.\n Why was he taken?\n Why not me?\n Will they bring him back?\n Will they come for me?\n Who? I still don’t know who I mean.\n Of all the questions that consume me, none is so painful or insistent as the desperate longing that rises beneath the surface of my skin; the longing to go and no longer wander these plains, these mountains, this looming swamp. If the lights would dissolve me, if they would take me apart and erase me as they have every other person here, I would have done.\n I linger at the shed: ten days, fifteen, twenty-eight. I bleed, I sleep, I do not touch his clothing. It dries and stiffens where he left it after countless rains that keep me inside the bunker’s shelter. And this bunker beneath the shed is like any other; lines of beds that hold the impression of bodies long gone; dusty, empty cells, and rooms that once held food. He had begun a smaller pantry: nuts, water, dried meat, and labeled packets of seeds. And now he is gone.\n I wait for the lights to return and they do not. I walk out in dusk and back in dusk, approaching the shed as I did that day and they still do not return. I think to make a life here, to settle and stay, but the sky beckons the way the land does. I cannot stay, because when people stay, they are killed. They evaporate in light and wind.\n The lights do not return and when the weather clears, the ground at last dry from a lack of rain, I leave the bunker behind, because I cannot stay even if I cannot be taken by the lights. I walk to the towering trees that line the horizon as far as I can see and my yearning to go—into the sky, into the lights—stretches taut inside me.\n Even beneath the frame of trees there is no escaping the sky. It observes me through every gap of bare branches, pressing me toward ground still wet with rain. The ground runs with small rivers that collide and form pools, pools to reflect the sky and brighten the gloom of the world under the canopy. I break the pools with my boots, shattering sky so it cannot see me, running through slick mud heedless of destination. I am only going because I cannot be taken.\n Why have they not taken me?\n Why was I ever brought?\n Was I brought?\n I can remember no place beyond this one. Cipta spoke of other lives, of men and women she loved, of paved streets and vehicles that moved through the world on metal tracks, but I have seen no such thing here. The ground is spoiled only by root and rain, and the only thing built are bunkers, bunkers to hold bodies that have all vanished. All but for me.\n I run until the ground refuses me. The ground becomes a swamp that pulls me in to my knees, and it’s mud that latches onto me, tries to hold me where I am. I walk on, through the black mud that undulates like the green plain, sucking my knees, my thighs, my hips. It insists I stay; I insist I go. I claw myself out, nails bending in the sodden earth.\n Was I made for only this journey?\n This endless goddamn journey with an endless goddamn sky covering me.\n There is little warning before the creature rears out of the mud. It is scaled and fanged, and it’s hard to tell hunger from outrage when it bellows. Its mud-splattered face surely reflects my own and I think if there are such creatures in this world, why are they not gone? Why have they not been taken as every person was taken?\n It is this anger and the broken end of my spear that kill the beast, and as with the beast, my own hunger and outrage are impossible to separate. My spear drips with blood and gore when I lift it from the muddy, broken wreck of the beast’s head. With a wrenched sob, I push myself from the dead, losing a boot to the suck of the mud as I find a solid bank to pull myself onto.\n The rain is colder through the branches, spitting bits of bark into my hair, onto my cheeks. My hands are turning blue with cold and there will be no fire. There will only ever be the rain, I think, and then I sleep, having crawled to a tree and wedged myself into a wet and broken length of wood that should seemingly topple over in the night. It does not and I dream Cipta’s hands warm and rough on my cheeks, though when I wake, I am alone and the rain still falls.\n At the edge of the swamp and in the cold twilight rain, I wash the mud from my body. I strip off my clothes and wring the mud out, draping each piece on branches to allow the hard rain to beat them clean. They will never be clean, but I close my eyes and spread my hands and stand beneath the wild skies so that I might be.\n The lights do not come, but the rain does in pounding sheets that never warm. Maybe it will always be this, rain drumming on skin until it has silenced the longing inside me to go wherever those lights go. But then the rain also goes, the clouds drifting apart in clumps of gray and white as if they never gathered to rain on anyone at all.\n The world is silent in the aftermath. I make slow circles in the mossy ground, my toes clean for the first time in days. The swamp lingers at my back, watching me, but I do not mind it so much as I mind the sky. The clouds part to expose the lazy stare of the night sky. Stars prick through the gloaming, faint but growing stronger as the sun gives up its hold. And there, still above me, is the string of stars reaching toward the distant horizon.\n Where am I going? Away.\n Why am I going? Because to stay in any one place, where the ground might hold the impression of my body, is a kind of death all its own.\n I walk naked through the growing night, until I can not see the world before me, until I roll a stone over to take advantage of its dry ground and build a meager fire. Metal and flint and for once there is no wind to tempt my sparks away. The grass of the plains burns fragrant in the night, feeding the flames that stroke the swamp’s wood. I spread my clothes close to the fire so that they may finish drying, and stretch myself flat too, watching the sky as it watches me. My skin pricks under its unblinking scrutiny. I do not blink, I do not blink, and then I sleep.\n I dream of the lights, spreading far across water, bursting wide open to obliterate the stars.\n I mark each day in the book with a stick burned in the fire. It has been sixty-two days since they took the man at the shed; it has been seven times that since I last saw Cipta. I write her name on the page so I will not forget, so she will not be carried from my memory.\n The longing to go does not ease.\n And so I go.\n Wherever my feet can take me: across ground that grows more rocky and calls to mind the mountains—the mountains where I first saw him—but the land does not rise, it rushes outward, ever flat toward that distant horizon. I think I can see the world complete, but then the land dips and days are spent crossing a crevasse that must then be ascended, and more world stretches beyond that. And beyond that.\n In the end, it is the air that betrays the coming sea; it presses damp against my cheeks and tastes like salt, and the ground beneath my feet becomes slippery with moss, with small grasses that spread into tide pools cupped by larger spoons of rock. This water holds salt the way the air does, and I have never seen so much of it, running from tide pools, narrowing into rivers, swelling into ponds, to flow against a shoreline where it breaks into a wide-reaching sea. Is this Cipta’s sea? Could there be another? I can see across its entire width, evening waters reflecting the sky above. The string of stars dangles above this sunless sea, as if the string has reached its own end, and for the first time, I am not compelled to break the reflection of sky or its regard of me.\n Spreading around the sea, other figures stand in shadowy relief upon wet and mossy stones as I do; they are women and they are men and they, like me, gaze in wonder at the water that spreads with such abundance between us. My legs buckle and my knees crack against the stones and I cannot breathe.\n They, as I used to, lift their eyes to the sky, as if searching for the lights, for the way out, for the answers why.\n And these people—\n They do not disappear.\n They do not disappear."}