{"fingerprint": "xeU1AlubWpWdambTYzkYpiq0YKs=", "sitename": "Clarkesworld Magazine", "title": "Pithing Needle by E. Catherine Tobler", "author": "E Catherine Tobler", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tobler_10_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pithing Needle by E. Catherine Tobler", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3810 words, short story\nPithing Needle\nWe have run toward enough danger to understand this is unique, this conflict will change everything we know. It will change the Nessik, too, but we don’t care about them in this moment, because hundreds of thousands of their young are—\nAre eating our—\nBlackout.\nWe came together, armed, prepared, and yet not. They sent an entire division, but it will never be enough. We can see that the moment our cargo ship touches down; everything stands in ruin: charred and smoking trees, satellites drawn down from orbit, the alien ship itself, a crumpled tin-can spire rising six fucking miles into the clouded sky. The rain is ash and not water, not washing clean, but sticking, to our armor, our weapons, to the coiled Nessik bodies that lash out of absolutely nowhere to engulf us.\nSwallowed by a thousand tongues, yanked into a quivering mouth with a sharp beak that bites and bites, digested even before the creature even swallows. A hard boot against a soft throat, those thousand tongues pull back, but only for a breath, and then they’re back, hauling me deeper until I pull the slick trigger, turn the tongues into mash that streams violet across my goggles, mash that doesn’t move until I scrape my fingers through it. The alien (later, the word Nessik comes later) erupts dead at my feet, looking like a vicious neon orange hermit crab turned inside out over its shell.\nThere’s no time to admire—there’s another one, tentacles and arms coiling around my boots. This one is hot, nearly steaming in the jungle humidity. The heat bleeds straight through armor, causing me to think my boots are melting. I look and it’s time enough for the Nessik to yank me off my feet entirely and haul me in. Back into a mouth that looks like the first mouth that looks like a yawning cavern of death. But I’m not going down that way. I could pull this trigger all day.\nSo I do.\nThey never stop. I can’t count how many there are; the crashed ship, rising six miles into the clouded sky, seems as though it will never empty. I can’t count the numbers, but I do notice the differences among them. There are larger aliens and smaller aliens—it’s the smaller ones that give me pause—not because they’re potentially juveniles (children have ceased to matter in this world—who would bring a child into this ruined world? Who?), but because they outnumber the larger aliens. I see how some of the smaller aliens are marked; deep grooves raked into their shells, like someone cut them with a blade; sooty streaks where they were scorched with fire.\nThis thing that rises in me might have a name; someone might call it sympathy. I call it bullshit. Curiosity if anything else, because when a thing falls from the stars—they called it the Arecibo Event, having no idea what the ship held, what it was doing as it plummeted from the sky and into the ground at Arecibo—I wonder what the fuck it is, what the fuck it contains. I wonder because I know I’m about to be in the middle of it.\nThey never stop, these monsters. The ground is alive with them; incessant, a kind of black-oil ocean dredged from deepest space to swallow the land as we once knew it. They are like nothing I have seen—maybe in childhood, for I remember hermit crabs, legs protruding from a stolen shell, but these aliens are more perfect than that; their shells are not stolen, they are absolutely part of their shells, flesh and shell as one thing. Writhing arms and tentacles emerge from these shells—there is the impression of a face, but there are no eyes and I wonder how they see, how they find me every single time I escape. I climb a tree—it’s on me. I round a boulder, there’s another. I crouch under a busted arc of the old Arecibo dish, there’s half a dozen of them on me inside thirty seconds. They are relentless, merciless, alien.\nI don’t try to talk to them—they have mouths but use them only to eat. I will not be eaten—slick trigger in slick glove, I fire the way they eat: constant. Sometimes I get there before they do; sometimes I’m firing and a soldier is already inside that shell, digesting. A thousand tongues inside one hungry, angry mouth.\nI never wonder what this is; I know all too well. This is what I signed up for, because there was nothing else. The world changed long before I was born, swallowed by water and scorched by sun—and this will only change it more. This is all there is now. Writhing ground, falling sky, and I love it.\nI’m also good at it. I’ve been spliced twice at this point—twice or more, everything fades under continued augmentation (but for you, you never fade). I suppose I am not entirely human anymore. I can see better, move better, but no one down here cares (until they discover it, until they do). The tentacles that wrap me up and haul me into a mouth don’t care (until they do).\nWe reach the ship days later. The sky tells us it has been only hours, but surely it’s days we’ve been hacking and shooting and sliding through the muck of exploded alien bodies. They litter the landscape; the dead outnumber the living here, the living aliens moving on, spreading through the jungle as they devour. More divisions arrive to greet them, while we lumber toward the ship.\nIt’s the strangest thing we’ve never seen; it looks like a hive, which is what we come to call it. You never kick a hive because of what may come boiling out, but when the troops place the explosives in an effort to bring the upper levels of the thing down, they only succeed in busting open all the levels that weren’t broken open upon landing. This ship explodes with life; aliens everywhere.\nSlick and click, I could do this all day, until one of the smaller aliens gets the jump on me. I see it in your face a second before it happens; the widening of your eyes before the alien snatches me. It hauls me backward hard, so hard I’m wedged inside its mouth with my rifle parallel to its beak. I can’t reach the trigger, so spin the rifle like I’m performing a drill, in a perfect line before a review committee. The rifle doesn’t spin, is clocked by a thick tentacle that wraps it, flings it. You catch my spit-slick rifle and then I’m gone—swallowed by a black mouth.\nThere is no direction here; I can say down is down because I’ve been swallowed, but there’s absolutely no light, no sense of motion outside the muscle that contracts around me as it swallows, draws me in. Warm, slick muscle ripples around me with such strength I can’t move against it. I try, but I can’t turn. I can’t wriggle my way up or down. The scream that rips out of me is silenced by the slither of wet muscle across my neck, my mouth. This alien tastes like salt.\nAnd then—\nViolent light as I am spat from the maw, into a room that has no corners, no edges. I slide across what feels like half-warm wax, unable to gain any purchase. The room terminates in a soft cup; this cradles me and is strangely comforting after the black suck of muscle. The alien that swallowed me perches on the rim of this room, screaming. Eventually, this alien begins to calm and the scream turns into a chitter turns into a pattern, a pattern that my brain begins to dissect.\nLanguage is patterns, repetitions; pauses and stops and resumptions, and this, this is what the alien is doing. It’s talking to me. Trying to tell me something. I understand none of the words, but the structure becomes familiar. The alien repeats itself, clicking, and then there are two aliens, and three, and more. They have no eyes, but they absolutely watch me as I drip saliva and mud into the cup of this room.\nThere are no edges in the room and I cannot stand up on the flexible, waxy floor; I can only sprawl, watching them as they watch me. The alien who swallowed me becomes indistinct from the others on the lip of the room; they all swallowed me, they all scream at me, over and over, fucking—\nOne slides into the room with me, all mouth and fury, still screaming. The fury is familiar if not the words, and I scream back, refusing to draw myself into a ball as the alien nears me; I should, should make myself as small as possible. But I lash out.\nThe strange thing is—the strangest amid a tableau of strange—is that the alien allows it. It takes my punch as my fist strikes its leading tentacle. Endures the way I kick its shell as it slides toward me. The alien spins under the impact, also unable to hold onto anything in this room. This cell.\nIt’s a cell—me a prisoner, but if the alien can’t move here, was the alien also held here? Its shell is marked, five long scratches near what I take for its mouth. But as it spins, I see more. Five becomes fifteen becomes twenty and more. Were it human, I would take the marks for years, but it’s not and I don’t.\nIt lets me beat on it, until I realize I’m not getting anywhere; the weight of the alien pulls the flexible cup on which we fight down and down. It provides no support, no surface from which to attack, so at long last we can only both sprawl there, heaving with exhausted breath. I stare at the thing: black-oil ocean waiting to flood over me. It is never still, tentacles and arms rippling even as it does not reach for me. The weight of its shell presses the waxy cell flatter than my body did on its own; I stretch, meaning to find a way up and out, but the cell gives every time I move, and there won’t be any walking up these walls.\nBees could live here, I think, but even bees have straight-edged walls.\nI do not sleep and if the alien does, I am unaware of it. It never stops moving.\nAt some point, it begins chirping at me again. Slow, precise. It chirps a sequence of four sounds. And again. When it comes again, I think I might go mad from it, but I’ve been spliced, am part machine.\nI open my mouth and repeat the sequence as given; it is only mimicry. The alien flinches, scrambles and tries to get away, but there is nowhere to go. The panicked action leaves us rolling together, the flexible wax cell moving with us. It is like being trapped on a boat with a very large animal, only unable to jump overboard into cleansing waters. I dig my hands into the floor-wall, but cannot break through the material. It is impossibly strong.\nThe aliens on the lip of the room screech at the alien nearer to me. The alien calms and chitters at me again. I don’t know the words, but my augmented throat appears able to make these sounds, so I repeat them again. Again, the alien seems to panic—screaming like comets across the black sky—and this time, the lashing is so forceful, I am swept back into tentacles, pulled into its dripping mouth.\nBeyond.\nThe pithing needle, born deep inside the alien, pierces the base of my brain, splicing through bone and tissue. There should be only black—only death—but it’s a riot of colors and scents that I have never seen or smelled before. It’s not green and it’s not grass, but it’s alive and writhing and under my feet, sliding up my calves with a texture like knives, coiling around me like it knows me. It’s not blue or orange; it’s not lemon or onyx; it’s deeper than any of these things as humans know them. It’s a flexible floor, never moving because in space there is no up or down. It’s bodies forced into breeding cells until none can move without stirring the entire cell to chaos. It is eating one’s way to the bottom until one is at the bottom and is slowly eaten in turn. Endless mouths, teeth all the way down, needle rattled in skull.\nConfinement. A hundred thousand bodies pressed together; I understand this in a way that comes without words. The sensation of being there floods through me; no longer remotely human, me, but alien. Coiled into shell, tentacles whipping to gain space, but there is never space, not even when another cell manages to burst loose, eating their own kind, stacking shells mortared with the dead so they may slither out, to spark an engine overload, to toss this prison ship from the stars. No words; I smell every second of confinement, taste it in the back of my throat, until it gags me, until—\nThe solid crunch of the alien’s shell as it shatters. Gray slop, and razor-sharp jackknife shell pieces carving into my armor. We are hauled from the cell by the other aliens with impossibly long tentacles that have broken through the juvenile’s shell, have shattered it to retrieve me, wet and dripping as a newborn. New eyes, new fingers, new everything.\nThey fling me from the ship, into the chaos beyond. I land gracelessly in the mud—full on rain now, always rain, pulling ash from the sky above the burning city. The landscape moves; it isn’t the storm, but the aliens as they move ever away from the crash site, as they explore Earth as invader, colonist, glutton. They do not slow, even as military divisions drop from the sky, even as drones circle from above. The coastal water writhes with their black-oil bodies, but light fractures my view; human soldiers drop around me. Some stay to haul me to what they perceive as safety.\nThe rain feels like blood running out of me. I lift a hand to the back of my neck—there should be a hole, evidence of the violation, but there is nothing. Nothing. They cradle me (flexible wax, cannot gain purchase), fingers probing, seeking. What was done, can I see them, am I here? So many questions, but every answer comes out in the alien’s own tongue. I chitter, I warble, I send streams of echolocation up and into the storm.\nThis is alien sight—I am looking at my commander’s face, framed by the burning tree above us, but I see the far distant aliens. They move like a tsunami of black water; they do not pause, they overrun every city they encounter. The sky is full of military—I ping these sounds so that I might see off the helicopters, off the rappel lines, off every rifle and every weapon I know will not matter. Small stands will be made, but these aliens are hungry—they have been held (sagging cell, flexible, too much weight and too many mouths and oh eat me so this will cease) and will be held no more. They revel under these rainy skies; every droplet of rain echoes back to me, flooding like the aliens—the Nessik! A name, a people, a place they have come from. I reach into the collective—so many, I still cannot count them—and I see a black world, a world that never stops moving, because they are the ground, are the water, are the sky.\nWhat did they do to me?\nUnknown?\nToo many—factors.\nToo many Nessik.\nI chitter. They stare. I cannot form the proper words to tell them, about the ship and the cells, and then you are there, cradling my head, asking if I can see you.\nI see you, in more colors than ever before. The color that glosses your rain-wet face has no word; the taste of the rain that slides from your nose and into my chittering mouth has no name on this world. What world—this world, but I cannot say where I am. I could reach into the drone that passes over us, could crack open the housing and show you the spill of wires, connective pathways; I could turn these colors and tastepaths into a map, could pull you inside this space and show you, but you would only ever know a fraction—a fragment, a—\nThe drone slows above us; its red-slit eye oscillates over me, Cyclops pondering. My breath stutters in my throat—rain still feels like blood and you ask if I can see you, if I can feel you, and your fingers are like burning brands against my neck. There should be a print, a mark to make your passage evident, but these marks are better buried. Your goggles light up in drone-red, in Cyclops-fury, and then fades into rain as the drone moves on.\nWhat did they do, you want to know and I cannot say. Cannot form the words; there is rain, and there is the color of your face and the taste of the rain, sliding off of you and into me.\nBlackout tastes like sunlight.\nLater, in the tent, the rain furious on the meager roof. It will punch through, and this reminds me of something, but I do not know what. Your fingers comb through my wet hair, my eyes slit shut, and you still want to know—you don’t even have to ask, because I can hear the unspoken thought—what they did, what did they do, did they—\nNo. It wasn’t—\nBut I suppose in a way it was. Pithing.\nYou are more than a needle inside of me. As quick as they were—nothing and then there, there where I need you to be. The rain on the tent roof, your fingers on my hips—flexible, pressing, but you can’t tear through. My fingers sliding up your neck, into your hair. Pithing. Let me tell you. Jack in. Deeper.\nThey took me, spliced me so I could understand—but it’s not just that because as the echolocation pours out of me even as we two are joined, you can see what I see. I can show you, take you down these pathways as if they are my veins. Information rolls beneath our closed eyes. Sightless, but not; we can see the ruined land beyond the tent, the bodies, the fighting that continues just beyond the debris field of the crashed ship. We can watch as alien body pierces human; you thrust into me hard, roll me over on the cot, and everything vanishes in a dark-water flood. You scream into my mouth and there is no word for the taste of you when you realize what they made of me. They took this not-human body and made it something more not-human. But ever yours as you fingerprint me, deeper, pithing.\nThey determine the ship is empty, but send me to its crater-lip to confirm. I scan the way the Nessik have taught me to scan. There are only dead here, on the plain and within the depth of the ship. Dead and more dead. Dead and almost dead. Nothing here is alive, save for us, you and me, and I could tell them this, but they would never believe they are already dead. They on their mountain cannot see that they are in the valley, that they will be consumed.\nThe division plans to move out. We pack our gear, because we go where they tell us to go; it doesn’t matter what happened in the depth of that ship. It matters that we came out. We, I, me, whatever. I cannot speak the words—that I do not wish to go—but you know this as though it is your own thought as the ships lift us into the sky. We run north through the low clouds, tracing the line of destruction the aliens have left. There is one break in their path, the swath of ocean that stretches between Puerto Rico and the Dominican Republic. When the land resumes, so does their path of gluttony; we can see troops engaging them on the ground. I can feel the troops being eaten, can feel the way those muscles work to envelope, swallow, devour.\nThere is no accord. The press is, however, awash in such opinions—the Earth embarks upon a brand new day! Fortune favors both races! Hope was born from destruction and war!\nIn the trenches, we know the truth. There is no hope and no one is favored. I can speak to the Nessik and sometimes the Nessik reply, but mostly they are as angry as we are, and common ground does nothing to remedy the war. Has it ever? They hate this, we hate this, and yet, they will eat us if given the opportunity because for so long they were starving and this is all they know—swallowing a thing before they are swallowed. We do not wish to be eaten because for so long life is all we have known, and so.\nImpasse.\nSurely there is something, my commanders press me. I tell them of the alien war, the shipboard captivity, the eating, every mouth so impossibly hungry. But this changes nothing. Aliens, they say to explain it away; we cannot understand them, and though I can, I tell my commanders there is nothing. Nothing they will hear.\nWhen I am deemed uncooperative, they try to make more of me, try to splice this ability into other soldiers, and under your hands, they do so. You spread this ability into other chimera like me in an effort for soldiers to understand the alien. Does anyone? Ever?\nWith a hundred thousand soldiers modified, surely there will come an answer. A pleasing answer. There does not. No matter where we travel, there is no answer that pleases. No matter the connection between you and me and the Nessik, they remain slippery, elusive—alien.\nThe Nessik will not conform, will not be remade to fit this world they crashed upon, and in the dark, when we two move as one, this delights us as it should not. Our own kind will not listen—they deserve the flood if they would not heed the warning. I reach ever out, streaming echolocation into the black where only drone eyes can see. In the dark, the Nessik endure. Thrive. They will not be eaten as they eat.\nSurely there is something, officials press me. I was the first, surely there was a reason. A thread of logic they can follow to get out of this nightmare labyrinth.\nAnd you press me, deeper, deeper, pithing into me.\nWe can feel the hive move.\nSlippery, elusive, alien."}