{"fingerprint": "7AXbqhPELI7gUObY5GMYDmcXBs8=", "sitename": "Clarkesworld Magazine", "title": "(R + D) /I = M by E. Catherine Tobler", "author": "E Catherine Tobler", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/tobler_05_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: (R + D) /I = M by E. Catherine Tobler", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3360 words, short story\n (R + D) /I = M\n Grapes grew differently on Mars and no one minded. This trespass was for science, ask anyone.\n Perhaps they shouldn’t have grown at all, but they did, into oblong coils that turned the color of copper under the days of long, if distant, sunshine. We found they were best at night, when they froze into slush.\n We would sneak into the vineyard, just the two of us, silent as we always had been. We had heard the humans wish for this ability, to be naked under the Martian sky, stretching in our low gravity, bodies coiling however they might. They pictured Martians like grapes, though never noticed any of us in those early days. They didn’t then know how close they were to the truth. Our bodies grew as slender as the grapes did, tethered to the ground by delicate webbed feet the way the grapes held to their vines, spout-like heads spread open to collect whatever moisture the air produced. The leaves and coiled vines hovered in the air, held back by only the weight of the fruit upon them. Once plucked, the vine sprang back, looking much like we did when we jumped.\n It didn’t take us long to perfect our system of thievery, though we would both argue we weren’t stealing anything. A certain percentage of the crop would be lost; we reasoned we were taking grapes before they could be lost to conditions not even they could bear. The planet’s orbit would carry it farther and farther away from the sun, and the humans had not yet perfected their methods of harvest. They were still monitoring, calculating, devising. They wanted a year-round harvest; they were to be sorely disappointed.\n We gorged ourselves amid the vines, unable to wait for the first taste of sweet grapey slush that befell our stigma when we crushed the grapes in our hurried hands. We ate until our bodies ached from the cold, then ate some more because we could. We sprawled on the ground, not drunk, but still intoxicated by the fruit, by the very idea that humans had come here and planted such wonders. We had never known such things. The humans found them commonplace, only an experiment.\n Eventually, the outpost believed it had ghosts. One night, we overstayed our welcome and found ourselves lingering amid the vines as the humans patrolled. You—it was always you and never me—had chewed a vine and it stood out starkly against the sepia sky of mid-morning.\n “Ghosts don’t chew grapevines.”\n “Mars has no indigenous life—what else might have done that?”\n The idea was absurd, but we learned early on that absurdity never kept humans from trying or thinking a thing. They moved past us and never noticed us amid the tangle of fruit and vines. Also absurd, considering how tall you stand and how your stomach growled (it was well past midday and stolen grapes eaten in the middle of the night cannot wholly sustain a body or the child within).\n After that, we left them more clues. It was too fun not to. We also ached for contact, though our elders had forbidden us. Leave them be, we had been told. We wondered about the humans every day, because if they had something as wonderful as grapes, what else might they have? Clearly they were absurd—ghosts on Mars! they cried—but we didn’t care. One night, we left them grapes on their doorstep, spelling out a greeting in our language. They stared at the mess, unable to make anything of it. Knowing their language might help, you suggested with the curl of a lip. I scoffed.\n We watched as the woman cleaned up the grapes, carefully placing them in a bin so that she might take them inside for salvage, study. But before she carted them away, she paused and looked at the vines where we hid. We held our breath, clutched our hands. I think you were holding me back rather than holding on. We did not move.\n The woman smoothed the ground flat before her. She made a shape, grape by grape, then went inside. Was it a word? We watched until it froze with nightfall, then ate it piece, by piece, by piece. In our bellies, it sounded like a welcome.\n They have the most amazing things, humans.\n We watch from a distance, but get closer all the time, and when we find a way in, we don’t immediately leave. It’s not their walls we sink through—those are as solid as anything, and we are only flesh and sometimes bone. It’s the minds we find a way into, because humans think so loudly.\n They have come a long way—from the bluish planet in the sky, or so they believe. We remain doubtful, though we have not traveled beyond our own skies, so who is to say? They have brought with them wonderful things, things we cannot explain. Perhaps the blue world is filled with such things—the better we get to know their thoughts, we realize it is so.\n Within their habitat, they have rooms where they appear able to return to their home world if only for a time. These rooms mimic landscapes they know, but also those they have never visited. Virtually, they can go anywhere. The woman loves these landscapes, the man is at first hesitant. Didn’t they come to Mars to see Mars? he asks.\n He holds to her hand—and as we step into their thoughts (their skins), I feel your hand in mine, an echo of theirs. They walk across a watery landscape that has both breadth and width and a strange depth that glimmers with colors we have no name for. Their bare feet press against wet lily pads which they think look painted and we watch the water ripple outward, ever expanding rings that deepen the sense of unease we feel as we go.\n We don’t understand water, not this way. In our world, water is brief, transitory, often frozen. Our water does not unspool through the world the way this water does. Our water does not hold things—these lilies and fibrous green pads unfurl in the liquid, flowers spreading up and roots sprawling down. Each is reflected up and down until there is no up and down and I feel lost, lost though I know exactly where I am. I’m not in this room at all, but my mind says otherwise, hooked into the woman’s mind as I am. She takes a deep breath and leaps—\n Her toes spring from one lily pad, to the next, and it’s slick, and she slides—the thrill down her-my spine is like nothing I’ve known—then she’s righted herself. They only delight in this—they cannot do this in the real world, only in this illusory place. They leap from pad to pad, hand in hand, and it’s too much for me, me who wanted to go. I pull myself out and you follow, so there we are, where we have always been, crouched outside their habitat again, familiar sepia wind washing over us. Our feet dry. Our hands unclasped, because that is also a human thing—\n Until you take my hand in yours.\n They keep us in a room that we can cross in three strides. The gravity within this holding space is heavier than our own, so we don’t stride. We haven’t moved at all, wrapped around each other. When I slide inside your mind, I can see the blackness, your eyes closed as you murr like a low ground tremor, the slope of your head matching the concave curve of my neck. We notch together as we ever have. I know you miss the sky.\n Our long legs fold together, mine around you and yours around me, your softly swelling body fitting within the hollowed well of my own. My arms enfold you as if they could keep you from all harm, though in this false gravity I am not sure how well they would move. Were that true at all, we would not be in this room, would we? We should have run—we tell each other this over and over, but it’s no use. We were too curious. You liked those grapes too well and I cannot blame you. I liked their taste on your skin.\n The humans watch us from a window that seems little more than a slit; her eyes are blue and his are hazel. They want to know what we are—not who we are. “Martians” is the word he uses over and over, muttering it as he paces in disbelief. Others are coming to see for themselves, just to be sure. As if we might be a hallucination.\n “Martians!”\n We suppose that’s accurate, as they call this world Mars.\n Later, they slide a tray into the room and hastily close the slot. The tray is filled with their food, but no grapes. We cannot tell them that we don’t consume these things. We eat differently than they do, drinking sunlight and not water. The grapes were the first food we dared. Eventually, we will wither without the sunlight; maybe then they will understand.\n I feel you slip into sleep, your round body a little more lax against my own. I bid my warmth into you, as if we can make sunlight here between us as we did the bud of a child, but keep my attention on those eyes beyond the window. Are they angry? Upset we took their grapes? They douse the lights soon after the thought—I still don’t know if they’re telepathic; it’s too easy to presume they’ve taken the light away because we took the grapes, so I won’t. It can’t be that easy. My skin puckers in the darkness, I curl around you, because I think it’s night, time to rest, even though it’s not.\n When I wake my arms are empty. You are gone. The elders spoke of this before—loss, how we would come to know it if we aged. We are not aged, it’s too soon.\n The humans— There is one pair of eyes at the window. Hazel. Despite the gravity in this place, despite the weakness in my sun-deprived limbs, I push myself to standing. I rush the wall, slam a shoulder into it, make that window vibrate. The hazel eyes go wide, and then I’m screaming. Words he won’t understand, about you and sunlight and how we cannot live confined. My throat strains—we are only this vocal when mating. When I quiet, the male human turns away.\n We learn the room we have occupied vents to the outside; they bring you back, small and gray and how like a husk even though rounded with child. You are cold when I draw you against me. The humans seal the room and then one wall parts; I can feel their gravity flood out while the scent and heat of our own world rushes in—here come the winds, tonguing sand into every corner, over the food we have not touched.\n The humans watch, study—I don’t care. I carry you out of their habitat and toward their strange vineyard. I lay you down amid the sun-drenched rows and press grapes into your skin, crushing juice over your stigma. You bloom, warmth and color starting at your edges, bleeding inward. The humans are still staring when I look up at them. The male presses his hand against the flat of their habitat window.\n You are light as air in my arms as we notch into each other. The days are growing shorter, the sunlight fleeting, and soon we will be three. Carrying you both, we go. I know you miss the sky.\n We trespass.\n If anyone asks (and the judges will), they will say we invented it, that these landscapes do not exist for they are so completely different than the spaces within our own forms. The human body is tightly contained, and yet—\n I sink into her consciousness as easily as she breathes, and she is all dark warmth. This deep, light does not pierce skin or muscle. I stretch along her bones, so unlike my bones—hard but not dense, solid and yet hollow. The marrow inside her is hot slush, suffocating, intoxicating. I move down through her arm, where it narrows at wrist and then bursts into palm, into fingers. Here, she is like the valley which nearly splits our world in two—broad and deep and fanning ever outward. Countless turns and twists, channels and ridges, rises and falls.\n Her fingers are like nothing I have known, they seem clumsy when compared to my own, yet I am strangely fascinated by every tiny bone, the way the muscles move taut and then slack, the whorl of the prints which sink even to the underside of her skin. Here, there is almost-light, but it’s the dark sweet core of her I move toward.\n Back up that arm, pausing in the joint that marks upper from lower. Flinging myself up and up to the shoulder, to the curl of bone which leads inward toward her heart. We have nothing so complicated as hearts, nor ribs which I step down and down. When she inhales, I cling, not yet ready to fall.\n Her heart is like a sandfall—blood cascading like sand down miles of canyon, spilling careless at the bottom. I picture the forms it might take were there wind, but inside this body there is only confinement. Blood moves, a hurried river through coils of vein; the only wind is drawn down from high above, into tissue that expands, contracts, tissue that is the color of your throat. I go still at that notion, because if they share this color, what else might we have in common?\n I let go and fall.\n Free falling—we did this off the canyon rim yesterday and last cycle and five cycles from now. She stretches and I expand to fill all these spaces, budding nubs of flesh, gleaming edge of a rib, and I should pull back, before I lose myself entirely, but I cannot. They will say we invented it, so where’s the harm in dreaming a little longer?\n Her belly is full of more coils and I am reminded of what must lurk beneath winter’s ice sheet, of what longs to explode outward as the air warms. She seems near to bursting now—out, out, we want to writhe free, but no—these bodies are contained.\n Still, deeper down, deeper inside, there seems no containment—in the heart of her belly, she is as pink as sunrise, warm and wet, and she looks like us, concave from one angle and convex from another. She swells, she is hollow, she waits to be inundated even as this body can inundate itself. Small branching arms, hungry ovoid mouths. If she contains a river, she also contains the immeasurable forms which thrive in river’s flood. One body floods hers and she, she pulls that flood into herself, as if this part of her can drink the way her mouth drinks— That tongue and the curl of lips, a fathomless well I long to fall through.\n I lie; this is what they tell me after they have asked (they always ask). I have created a story, so that we might spare the humans. If they are like us deep down, surely they are worth sparing.\n The judges look to you for confirmation of the lie, of the story. You don’t care for fictions, knowing only facts: none will be spared, these humans threatened your child, your world, your mate. You stretch your consciousness out and pull the judges inside to do the work that must be done. No sparing, no reprieve. This body will no longer be contained; this marrow will cool.\n The outpost goes silent, but the relays still run with incoming messages. Lighted panels still phosphoresce in the night, turning black to gold and blue. We listen to the voices, make shadows in the light. We play a game in the quiet corridors: how will those voices determine every human here is dead?\n They will say it was a risk. Traveling to a distant world they had only dusty images and scarce data on. Traveling to a place they didn’t fully believe in. They presumed there would be no indigenous life because their data showed them none. Yes, fossils in the rock record, but that’s all they were, fossils. Evidence of past life, not present. Nothing sentient grew there. They could not believe in creatures like us no matter that their literature told them we existed. Risk is intrinsic in such endeavors. Nothing lost, nothing gained! Humans invented such phrases for these situations.\n Risk plus distance divided by isolation equates madness. It crawls into one’s bones nearly the way we’re capable of. One’s brain. (Sweet, soft—don’t distract me from this game.) How much can a human stand, even if they have carted entertainment programs, books, music, and science labs across forty-eight million miles? They have come two by two, male and female, but precisely how much sex will distract one from the utter undeniable truth that they are alone in the black? Saturated walls of silk enveloping an erection is a fleeting, temporary distraction from the indisputable fact that this place is empty, that one is alone, that one will never get back home. One can pummel their blood-hard flesh into anything they like—mouth, hand, skull—try to make a home, but it will never be. Madness.\n Perhaps an equipment failure, a burned relay. They can see their own messages are received, but nothing comes back. (You study those panels, noting which light brighten and which go dark as the messages come.) Concern is met with silence. Fear is met with silence. Remote sensors will tell them the outpost is intact—there was no crippling windstorm, no devastating earthquake. Ironic, that name—the scientists here were no longer on earth, remember—this world was never theirs, do not presume to name it—\n Yes, names. They will come back to those, too. Mars, the god of war, red and fierce, filled with iron and anger in equal measure. Mars doesn’t give, it only consumes in its rage. They send what they like—landing rovers with optimistic names to trundle through sand, rovers to break apart our rocks and study our past. But what of our present? They never looked for that. Never named that.\n What if there were sentient— That voice would be quickly silenced because the thought is irrational. There was no sentient life, they would repeat. It isn’t a possibility given the current planetary conditions. There is no liquid water, it’s not possible. But we were more than possible—they just couldn’t believe it.\n They will never contemplate the truth of what took this outpost. In time, they will launch another mission with a hopeful name (Opportunity! Curiosity! Excelsior!), they will land more living beings on our world. We do not want them here. This will never be a possibility that crosses a human mind. Surely if there were sentient life, it would welcome humanity.\n They trespassed, onto a world already claimed, and set their roots into dusty, cracked soil. They coaxed life from the waste—these oblong grapes we feed to each other in the quiet of the outpost amid our game. Their sweetness makes you bloom with color yet.\n We mean to leave this place to the wind and the sand, but before we go, you can’t help yourself: your grape-sticky fingers slide over the communications panel. You open that channel and I imagine human faces brightening with relief, delight, when they realize there is a message after all. They were mistaken! Share the news! But the words you speak into the relay are laden with warning, with threat, with pain. No other should come here, you say. No other should dare. Do not let this be your destination.\n But years later iridescent lights descend from the sky at their return. We creep to the sand-consumed outpost, you and me and our child, and watch as the humans emerge from their ships. Our child finds a grapevine amid the sand, rips it free.\n They trespass.\n We trespass."}