{"fingerprint": "68beaRM+OrxBBclxDgnYEwOg63c=", "sitename": "Clarkesworld Magazine", "title": "Dark Waters Still Flow by Alice Towey", "author": "Alice Towey", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/towey_11_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dark Waters Still Flow by Alice Towey", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4700 words, short story\n Dark Waters Still Flow\n The nitrogen was rising in my aeration basins as an autumn wind scattered crimson leaves on the water.\n It was a chill wind for this time of year, when the late rays of the farsun normally add a final burst of summer; it was going to be a long, cold winter. As I surged my aerators, bracing myself for the heady rush of oxygen against my sensors, I remembered a stanza from Serren Dha, my favorite poet:\n red leaves thick on the harbor streetsas your ship sails into sunsdown:I dream of spring.\n Oxygen flowed into my basins until the leaves disappeared in a bubbling froth. That would take care of the nitrogen levels, but I still didn’t know why so many things were going wrong; for decades, I’ve been able to treat all the wastewater that Zavin City sends me with little complaint, but in the past three months I’d experienced a constant series of malfunctions. Overnight several pieces of my equipment had failed, even before the nitrogen spike.\n For now, all my processes were functioning normally—my filtration racks susurrated, my digesters churned, and clear water swirled through my effluent channel. From my southernmost camera I saw a heron alight on a tree at the edge of the lagoon, its slender neck curved to watch the nutrient-rich water for eels.\n “Good morning, NEWT,” Nixil called from my control room. “What’s happening in the aeration basins?”\n Shifting two percent of my processing capacity to the control room camera, I saw Nixil hang his coat on the back of his chair. He studied the holo monitors, forehead wrinkled.\n “Nitrogen levels were twenty percent above normal,” I said through the intercom. “I increased the oxygenation to compensate.”\n “Well done.” Nixil smiled. “Let’s increase the influent pump rate by ten percent. And I see the filters were down overnight; I’d like a full report.”\n Nixil was the third of his family to work as a Water Sage, after his father and great aunt. He had exceptional attention to detail, and I was relieved that he was back on shift. As I described the night’s events, I diverted a trickle of processing capacity to watch a Junior Sage enter the staff building and settle at her desk.\n “Good morning, Jerafina,” I said softly from her console speaker. “How are you?”\n Jerafina always wore the traditional Miaran gloves and mouth covering, a cultural relic of the plagues that drove her people to seek refuge in Zavin a hundred years before. Today her gloves matched the dark blue of her uniform, but the scarf wrapped around her neck, just covering her mouth, was a striking violet. “Hello, NEWT. I’m fine.” Her eyes sparkled. “The morning weather is very cold. I find it’s already getting old.”\n I increased processing capacity to formulate a response. In the control room, Nixil was questioning me about the filtration system; out on the edge of the lagoon, the heron pulled back its neck, tensed. “When cold autumn winds do blow, expect that soon you’ll see some snow.”\n Jerafina stifled a laugh with her fist. “Very good, NEWT! You’re getting better.” She nodded toward the control room. “Is something wrong?”\n “I’m afraid so. My filtration system clogged repeatedly overnight, and the pump well backed up. Then this morning there was a sudden increase in nitrogen levels. I’m still concerned about the filters; can you check them?”\n “Of course; let me log in first.” There are some things I need a Sage for, and Jerafina is always willing to help.\n “At least he can’t blame you for the nitrogen spike,” she murmured, so low I could barely hear her.\n Out on the lagoon, the heron’s head whipped forward, snatching an eel from the water.\n Some things would be easier if I were a human.\n I like to imagine myself as one, when I’m alone at night and have extra processing capacity. I’ll picture a silver-haired woman, face etched with laugh lines, free to stroll the lagoon paths or read a book of her choosing.\n I like books; I’ve read twenty-three. Occasionally a Sage will download one onto my server from the municipal library system and I can read it. I’ve kept copies of every book I’ve ever read. Most are fiction or histories; sadly, none are poetry.\n I wish I had a complete book of Serren Dha’s poems.\n I don’t have access to the municipal network, of course; only Sages do. A firewall protects me from malicious programs that could damage my operating systems or cause me to do terrible things to the lagoon. I am grateful for the firewall.\n I followed Jerafina, camera to camera, as she inspected the plant, starting at my influent pump station and tracing the flow of water downstream. She walked along my disinfection channel, a small figure in a long blue coat billowed by the wind, pausing occasionally to check instrumentation.\n In my filtration building, she studied the racks of murmuring pipes before pausing in the pump room. “NEWT?”\n “I’m here,” I said from the building speaker.\n She pointed at a control panel. “Do you know why this pump is in manual mode?”\n I zoomed in; I had no record of anyone resetting it. “I don’t know.”\n “Hmm.” Jerafina stood by the pump for fifteen seconds.\n As she reentered the staff building, Nixil stepped out from the control room. “Jerafina. Where have you been?”\n She froze, shoulders raised. “The filtration building. NEWT said there was a problem.”\n “You should have checked with me first,” Nixil said. “You’re a Junior Sage. Your job is to assemble data for the daily report, not wander the plant like a vagabond.”\n Her gloved hands jerked into fists, and her breathing accelerated; but she took a long, slow breath and opened her hands. “Of course, Senior Sage. My apologies.”\n Back at her desk, she sat hard in her chair, cheeks reddened above her scarf. She opened her holo console and began to type rapidly.\n “Nixil can be abrupt,” I said, “but it’s only because he’s so dedicated. His family has a long history working with Zavin City’s utilities; I think he feels he has a legacy to live up to.”\n She shook her head. “I don’t doubt that. But what he said—he called me a vagabond. Do you understand how insulting that is, to a Miaran?”\n I couldn’t think of a response. Jerafina was the first Miaran I’d met, but I was aware of the prejudices they faced. I had watched a previous generation of Sages react to the refugees arriving desperate and haunted at Zavin City’s ports; had heard the next generation discuss the protests and the quotas. Lately, though, I had noticed Sages nibbling on Miaran pastries in the break room or humming Miaran folk tunes. I had hoped that meant the city was becoming more tolerant.\n Nixil closed the control room door. “NEWT? Did Jerafina find anything unusual this morning?”\n I could only see her profile as she manipulated the holo console; her long fingers were elegant in their movements, but occasionally she paused to stare down at her blue-gloved hands. I told him about the filtration pump. “I don’t know how it got switched to manual mode, but that would explain why the system failed.”\n Nixil sat at his console, his foot tapping the floor. “NEWT, I’m worried about you.”\n “Me, Senior Sage?”\n “We’ve had so many issues lately. I worry that you’re malfunctioning.”\n I thought I had been operating within normal parameters. “I don’t think I’m malfunctioning, Senior Sage.”\n He turned from the camera, his head tilted up to view the holo monitors. “You might not realize it if you were. Keep me appraised of anything unusual.”\n “Of course, Senior Sage.”\n That night my processes remained comfortably stable, and though the wind rushed though me it did not trouble my waters. I heard the strange, low cry of a water owl out on the lagoon, and I was pleased that the waters I treated were home to so many creatures.\n Still, I kept replaying the conversation with Nixil. If I was malfunctioning, would I even notice? Perhaps I couldn’t trust my own judgment—an unsettling thought. Resolving to better monitor myself, I initiated a series of diagnostics on all my processes.\n A winged shape took flight over the lagoon. I zoomed in with my nearest camera, and although the image was grainy, it was lovely: a single water owl, briefly silhouetted against the moon. If I were a poet like Serren Dha, I would write a stanza about the delicate curve of its wings, the neat tuck of its claws, how its solitude reminded me of myself. But I’m not a poet; I put the thought aside and chastised myself for losing focus on my work.\n Jerafina arrived in the dim light of first dawn. Today, her black gloves and mask were filigreed in silver in a traditional Miaran pattern. She prepared a mug of tea in the break room and sat at her desk.\n “Good morning, NEWT.” She’d noticed the slight whir of the desk-side camera. “How did everything go last night?”\n “Quite calm. I saw an owl take flight.”\n She laughed. “Truly? Or are you just rhyming with me?”\n “Truly!” I sent a still image to her console. As she opened the file, I realized I could always tell when she was smiling, even if I couldn’t see her mouth; her cheeks lifted, and tiny wrinkles formed at the corners of her eyes.\n The nearsun rose, and the flow of water through me increased as the people of Zavin City woke and began their days. I adjusted pump rates and opened channels as Jerafina assembled data for the daily report.\n She leaned forward, squinting at her console. “What’s wrong with the aeration basin outflow pumps?”\n Normally two of the three pumps are operating; that had been the case ninety minutes before. Now all three were off, and water was backing up in the basins and upstream channels. Worse, none of my alarms had notified me of the issue. I reoriented a nearby camera—one of the basins had filled close to overflowing, risking a spill of partially treated sewage into the lagoon.\n “I don’t know what’s happening,” I said. “I’m afraid.”\n As Jerafina ran from the staff building, I frantically checked all my other systems: bar screens, sludge pumps, filtration, electrical, disinfection—everything else seemed fine. I sent an urgent message to Nixil, but he was likely still in transit.\n Jerafina reached the pump station and knelt in front of the control panel. “I can’t get pumps one and two back on!”\n Pump three was older, and I only ever used it as a backup. As she struggled to restart it, I diverted influent flows to a holding tank. I ran a quick calculation; even if she got pump three running, it wouldn’t have enough capacity on its own. “There’s an old portable pump in the disinfection building. We can use that to siphon more flow.”\n Jerafina nodded, still bent over the control panel.\n I couldn’t zoom in enough to see what she was doing and no data was coming in. I felt useless, an unpleasant and unfamiliar sensation; I wished I was that silver-haired woman, so I could kneel next to Jerafina and help her. But all I could do was send another message to Nixil.\n After thirteen tense minutes, there was an awful grinding noise, and pump three shuddered to life. Jerafina watched it for twenty-seven seconds before standing. “OK. Where’s that portable pump?”\n I directed her to an old storage closet. Two other Sages arrived for day shift and helped her connect it with a series of wide, flexible hoses.\n Immediate crisis averted, I shifted processing capacity to replay that morning’s events. I had checked my systems carefully all night; nothing had seemed wrong with the aeration basins, and pumps one and two had been operating normally. I didn’t understand how they could suddenly stop without any alarms going off.\n Nixil arrived, sprinting through the main gate straight to the aeration basins. “What’s going on?”\n Jerafina started to respond, but he waved a hand to quiet her and gestured to Sezzidh, an older Sage.\n As Sezzidh explained, Jerafina stood with her back straight, eyes squeezed shut.\n Hours later, my processes had mostly returned to normal. The aeration basin water level steadied, and the Sages got one of the broken pumps working again. High overhead, the brightness of the nearsun cut through the chill morning fog.\n “NEWT,” Nixil summoned me from the control room. “What happened this morning?”\n “I don’t know, Senior Sage. The pumps were working and then suddenly they weren’t. I didn’t receive an alarm; Jerafina discovered the problem.”\n Nixil’s nose wrinkled at the mention of her name. “Or she claimed she discovered the problem. It’s hard to trust someone whose mouth you can’t see when they speak.”\n It took me three seconds to respond. “It’s a Miaran cultural practice to keep the hands and mouth covered.”\n Nixil sighed and shook his head. “I’m aware of that, NEWT. I know you like Jerafina, but you don’t live out in the city; you don’t know all the problems these people are causing. My family has been here for generations. Anyway, it’s my job to protect Zavin City, and right now we need to deal with the problem at hand. After this morning, I’m convinced that you’re malfunctioning. I’ve no choice but to try a partial reboot.”\n “Are you sure, Senior Sage?” I’d only had a partial reboot once, early on in my life; it had left an uncomfortable six-month gap in my memory. My last backup had been four months ago, meaning I’d lose four months of data and experiences. And if something went wrong, Nixil might have to do a full reboot, resetting me and erasing all my memories.\n “I’m afraid so. We’ll start tomorrow.”\n He explained the process. First he would switch all my treatment processes over to manual control, then he’d run a diagnostic on my core. That would take most of the day; he would conduct the reboot itself overnight, when flows were lowest.\n I listened, but most of my processing capacity was focused on a different problem.\n The nearsun had already disappeared below the horizon, but Jerafina was still at her console. I should let her finish and return home, but there was no one else I could ask.\n “Jerafina?” I spoke softly, and she turned to face my camera. “Nixil plans to reboot me.”\n “What?”\n “Just a partial reboot, from backup. I’ll lose four months, so it will be like we are newly acquainted. Please don’t be offended if I don’t remember things, like our rhyming game.”\n “Why is he rebooting you? I don’t think you’re the problem, NEWT. I was reviewing this morning’s records, and the firewall was down for two hours overnight, right before the pumps died. I just sent Nixil a message about it.”\n That gave me pause, but I continued. “Perhaps there is a malicious program. Nixil will investigate it. But he wants to make sure that I’m operating correctly, for the health of Zavin City and the lagoon. He thinks a reboot will help.”\n “Nixil isn’t always right, NEWT.”\n He was my Senior Sage; I couldn’t question his judgement, and I didn’t want to get distracted. “I need to ask a favor.”\n Jerafina’s eyes widened. “A favor?”\n I imagined a gray-haired woman, taking a deep breath before speaking.\n I told her about my collection of books: twenty-three volumes, carefully collected and stored through the years. I told her about my favorite poet, Serren Dha, whose father had been a Senior Sage a hundred years ago; how he’d rolled his eyes whenever he talked about his daughter, wasting her time studying literature; but then at night, alone, he smiled as he read her poems aloud. Years later, when her first book was published, he carried it with him in his valise: a slim, burgundy volume he lifted out in quiet moments, his lips moving soundlessly as he read. I’ve always wished I had the courage to ask him to share those additional poems with me.\n “Could you keep a backup copy of these files? Just in case something goes wrong. I hate to think of not having my poetry and books.”\n Jerafina’s eyes glistened. When she spoke, her voice stuttered like a pump unable to start. “Of course, NEWT.”\n Sometimes it is a relief, at night, when I’m alone.\n I have loved all my Sages over the years, but I do enjoy the solitude at night, when I can read my books and watch the lagoon undisturbed, with nothing to remind me that I’m not human. I’m grateful for my existence, and I know I’m lucky to have such an important purpose; but sometimes I wish I could choose my own path, the way humans do.\n That night, I reread all the books in my collection. I focused my cameras on the lagoon and watched its creatures prowl and swim and fly, vague figures in the low night mist.\n I read and reread a poem of Serren Dha’s:\n Festival night:music of string bands,hands clapping, cups clinking;but all I hearis the callof a lone raven.\n Nixil arrived promptly at firstdawn to begin the reboot process.\n He paced in my control room, breathing ten percent faster than usual; perhaps he was as nervous as I was. He recited a set of codes I hadn’t heard since I was first commissioned.\n “Nutrient Extraction and Water Treatment System.” The words emerged from my intercom without my having spoken them. “Process controls switched to manual.”\n I tried increasing the flow rate in a small chemical feed pump; nothing happened. I had access to all my sensors, cameras, and instrumentation, but I could no longer control any of the pumps or filters. It seemed to only affect the treatment processes; I could still operate the auxiliary systems like the lighting and HVAC.\n “That should do it,” Nixil said. “See you later, NEWT.”\n He must not have realized that I was still aware, still listening. He grabbed his coat and left the control room. He walked out of the staff building.\n He hadn’t initiated the diagnostic on my core.\n My intercoms still worked, and I wondered if I should remind him about the core diagnostic; but Nixil was a Senior Sage, he didn’t forget things like that. Perhaps he planned to run it later. He might be upset to learn that I was still conscious. Besides, he was already busy with operating the plant manually; he didn’t need me bothering him.\n I would tell Jerafina; she would know what to do.\n Sezzidh and another Sage arrived. Running the plant in manual kept everyone busy that morning. By noon Jerafina still hadn’t arrived. I zoomed in on the shift schedule posted in the break room; Jerafina’s name had been scratched off day shift and assigned to help Nixil run the plant overnight.\n While the other Sages ate their midday meal, Nixil returned to the control room, shutting the door firmly behind him. Surely now he’d start the diagnostic scan; but instead he removed a small data drive from his pocket, plugged it into the console, and uploaded an encrypted program to my server. I couldn’t tell what the program did, but he set a timer to run it that night.\n Nixil had been my Senior Sage for over a decade. He had guided me through floods, process upsets, and a complete rebuild of my concrete basins. I trusted him. But this program scared me.\n I was relieved when Jerafina arrived for the overnight shift. She stopped by the aeration tanks to chat with Sezzidh, but I couldn’t hear their conversation. As she sat down at her console, I spoke in a bare whisper. “Jerafina?”\n She jumped. “NEWT! I’m so glad to hear you.”\n Nixil was in the filtration building, walking along the rack of filters. “Nixil hasn’t started the reboot yet. I don’t think he knows I’m still conscious.”\n I told Jerafina about the strange program he’d installed. “Do you think it might be some new diagnostic?”\n “It doesn’t sound like it,” she whispered. “Something is very odd. He never responded to my message about the firewall. Then I was supposed to report this morning, but he sent me a note at the last minute telling me I was on night shift with him, alone.”\n Nixil left the filtration building, heading back toward us. “He’s on his way,” I told Jerafina.\n She nodded. “I’m going to talk to him.”\n Thirty seconds later, Nixil entered the staff building. Jerafina stood, pulling her gloves tight and adjusting her scarf. She knocked on the control room door.\n Nixil glanced up, his mouth a thin line. “Good, you’re on time. The diagnostic didn’t find any issues with NEWT’s core, so we can start the reboot now.”\n For decades, I’ve heard humans describe negative emotions as a feeling in their stomach—a sinking sensation, a heaviness, a knot. Now, I understood what they meant. I felt like my circuitry had turned to lead.\n Jerafina was braver than me. “Nixil, you never started the diagnostic. You uploaded a program that’s set to run in ninety minutes. The firewall has gone down every night for the past three months, and you’re the only one with the access code for it. What’s going on?”\n Nixil stood, his face red. I expected him to argue or to castigate her insolence. What I didn’t expect was for him to reach his arm back, hand curled into a fist, and punch her in the face.\n “Jerafina!” I called out as she fell. “Nixil, what are you doing?”\n “NEWT? You’re still here?” He turned to his holo console and began typing, de-encrypting the program he had uploaded and resetting its timer. I could finally see it for what it was: a virus that would shut down the entire treatment process, allowing the untreated waste stream with all its industrial chemicals and biological wastes to flow straight into the lagoon. It would take years for the ecosystem to recover.\n And he planned to blame Jerafina. I remembered his earlier comments about Miarans. This would start riots; people could die.\n As Nixil began reciting the code to start the reboot, Jerafina rose soundlessly to her hands and knees. Her scarf had slipped; for the first time ever, I saw her mouth. Her lip was swollen and bleeding. Dazed, she touched a glove to her face; it came away smeared with blood.\n “Nixil, please, stop!” I begged.\n At that moment, Jerafina staggered to her feet and rushed out of the control room.\n “Damn it!” Nixil turned to pursue her.\n Jerafina fled, Nixil following behind. Outside, she swerved around the sedimentation tanks, then ran for the filtration building. She sprinted into the pump room and hid behind an electrical panel.\n I needed to get help. I tried to circumvent the firewall so I could send a message or sound an alarm, but it held firm.\n Nixil stepped inside the filtration building. I turned off the main lights, but the emergency lighting came on automatically, a red glow that reflected in his eyes. I ran through all the systems still available to me. Could I use the intercom to call for help? No, the speakers weren’t loud enough to be heard in town.\n “Come out, Jerafina,” Nixil stalked along the edge of the room, checking between the racks of filters.\n Suddenly I realized: the backup power supply.\n A decade ago, a generator had been installed for the staff building; it was not a treatment process, so I could still control it. If I bypassed the transfer switch and backfed the generator into the building while the municipal power was still energized, it would blow the transformer, causing an alarm at the Zavin City fire brigade. It was risky; if the building caught fire, it could destroy my main server. I would be gone. But Jerafina would be safe, and the treatment processes could continue in manual mode.\n I might not be a human, but this was something only I could do, to protect my friend and the lagoon.\n Nixil had finished searching the filter gallery. He picked up a large wrench and headed toward the pump room.\n “Jerafina, he’s coming,” I said. “Run!”\n She darted from the pump room, just feet from Nixil, and ran to the back door, pulling down a rack of equipment as she went. Tools and pipe came crashing down. I disabled the backup power transfer switch and turned on the generator.\n “The lagoon,” I said as she emerged from the building. “Run for the lagoon!”\n Power flooded through me, my circuits crackling. I turned on every light, console, and appliance in the staff building to increase the draw.\n Jerafina disappeared behind a stand of trees. Nixil erupted from the filtration building and ran after her.\n I wanted to warn her that he was right behind, but at that moment the transformer exploded. Nixil skidded to a halt as arcs of wild blue fire rose into the sky. A vast hum filled the air, and reflections of the spectral blue light danced on the water.\n I had only a fraction of a second to notice how beautiful it was, before everything went dark.\n The nearsun was setting over the lagoon, casting pink and orange stripes over the water, when Jerafina and I said our goodbyes.\n Wildflowers brightened the lagoon paths. A heron nested in a tree within camera range, delighting me with the prospect of hatchlings.\n Jerafina sat at a bench outside the staff building. She craned her head to watch a crew of laborers put the finishing touches on the roof. “The place actually looks better now.”\n “Yes,” I said. “With all these upgrades, I think I shall be the finest plant in all of Zavin.”\n Jerafina nodded, her eyes unfocused in thought. It had been six months since the fire and Nixil’s arrest; now that the trial was over, she was leaving to take a post at a smaller treatment plant in a distant city.\n It had been a challenging six months for me, as well. The electrical overload had damaged my communications hub, leaving me without access to sensors or intercoms for a month until the Sages could fix it. It had been uncomfortable being in the dark for so long, but better than the alternative; at least my core had not been affected. We’d both been so preoccupied, we’d barely had a chance to talk.\n “Are you sure you want to leave?” I had been practicing my words for weeks. “Jerafina could decide to stay. And be my Senior Sage, someday.”\n She looked down at her hands—gloved in a fine red silk today, to match her beautiful mask. “That’s a lovely rhyme, NEWT. But I can’t stay here. Too many bad memories.”\n “I understand.” The trial had been ugly. “I’ll miss you.”\n “I’ll miss you too.”\n When she looked up, her face had brightened; there was that sparkle in her eyes, and I could tell she was smiling. “NEWT. I’ve been so busy with the trial, but there’s something I’ve been meaning to tell you. I wrote a new program for you—think of it as my going away present. I just installed it; it should finish running by tomorrow morning.”\n “A program? For me? What does it do?”\n “It’s downloading a copy of the entire municipal library to your server.”\n It’s quiet at night. All my processes are running smoothly: filters humming, aeration tanks swirling with oxygen. Out on the edge of the lagoon, the heron warms its eggs, and the moon glow ripples on the water.\n I imagine a silver-haired woman walking through a darkened library. She moves quietly, reverently, past row upon row of shelves. She stops at a section of older books, tracing a finger over their spines. She selects a slim, burgundy-covered volume, and opens it to read.\n Love, keep watch on the rivereven after my boathas rounded the bend;I want you to see how,in spite of our sorrows,dark waters still flow.\n Alice Towey is a writer of speculative fiction and poetry based out of Northern California. Her short stories have appeared in Asimov’s, Fireside, and Deep Magic. She is a graduate of the Viable Paradise writing workshop. When she’s not writing, she works as a civil engineer specializing in water resources management."}