{"fingerprint": "johyxY2jLQ82jhm6cKYJvt3jbco=", "sitename": "Clarkesworld Magazine", "title": "Video Game Sci-Fi Comes of Age by Brian Trent", "author": "Brian Trent", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/trent_01_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Video Game Sci-Fi Comes of Age by Brian Trent", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Non-Fiction\nVideo Game Sci-Fi Comes of Age\nEver since 1978’s Space Invaders, science-fiction has been a mainstay of the video game revolution. The genre itself had already been in films for fifty years—dating back to Fritz Lang’s 1927 classic Metropolis—and debuted in books somewhere between Lucian’s True History and Voltaire penning the alien visitation story “Micromegas.” Video games were a sparkling new form of entertainment, and science-fiction itself was perched on the cusp of being revitalized thanks to Star Wars. William Gibson’s cyberpunk masterpiece Neuromancer was just a few short years away.\nToday of course, science-fiction is grafted onto the very bones of our culture. Quality films like Minority Report, Gattaca, or Moon explore its sociological aspects, TV features the acclaimed reboot of Battlestar Galactica, and new scientific sensibilities have permitted today’s literary practitioners to push the realm into new frontiers.\nAnd what of video games? For many years they remained frozen in a shallow, space-opera adolescence. The bread-and-butter of science-fiction—speculating on themes of society, technology, and discovery within a rational framework—was brazenly traded up for the glitz and instant-gratification of blowing things to pieces. Even when Space Invaders fell aside in favor of more graphically-enhanced games, the storyline remained as undercooked as ever. Whether it was 1987’s Contra (belligerent aliens in the South American jungle,) Mega Man (belligerent robots in the urban jungle) or Blaster Master (belligerent mutants in the subterranean jungle) the overriding lesson was as deep as a Flash Gordon serial: Thrillingly kill the bad guys and you win!\nTimes are steadily changing.\nTechnological upgrades and new demands from the game-buying public have matured the game industry in startling ways. Today’s games routinely feature cinematic cut-scenes, professional voice-over work from Hollywood talent, full orchestral scores, and an art direction rivaling big budget films. The stories have grown to match. The best of today’s science-fiction video games dare to tread philosophical, ethical, and sociological territory usually reserved for literature. Evocative settings, layered characters, and imaginative plots are finally lifting games into the spotlight of serious consideration.\nThe claim can be submitted that games are making legitimate contributions to the genre.\nTangible Futures\nSci-fi is speculative fiction rooted in science. It puts society and the human condition through an imaginative filter. It builds structured worlds and histories. We can loosely group its contributions into the Verne and Wells camps; the former wrote optimistic odysseys of techno-exploration, while the latter probed a grimmer (and often dystopian) depth.\nInterestingly, one of the most notable features of the gaming industry’s growth is the overwhelming adoption of the Wellsian perspective. Societal collapse, war, and the negative consequences of technology feature prominently in today’s story-based sci-fi games.\nConsider the Fallout series. Fallout was the spiritual successor to 1988’s Wasteland; both boasted a setting derivative of Mad Max, yet both outstripped their inspiration. A consistent, multilayered post-nuclear culture emerges across the series’ mythos: Nuclear survivors build barter-based societies (the only hard currency is bottle-caps), and malls, aircraft carriers, museums and subway tunnels are used for desperate shelters. Apocalyptic lit tends to divide everything into good-versus-evil; Fallout achieves something more complex as myriad factions try carving niches on a radioactive planet. Added to this toxic stew is a host of mutated competitors; humanity is no longer top predator. Fallout manages to be uniquely stylish about its proceedings, too: a retro-future 1950s look permeates the ruins, and this decaying shell of a jingoistic “Red Scare” culture forms a chilling contrast to the steaming biohazard of your surroundings.\nThe Deus Ex series is not so apocalyptic, though it is more realistic. Deus Ex is arguably the masterpiece of gamedom, serving up an intricately-crafted near-future marked by disease, terrorism, and economic collapse (Deus Ex came out in 2000.) The theme here is fear, control, power and transformation, and it comes off as powerful as anything handed down to us from Orwell. A dark, gritty, cyberpunk noir about a frighteningly credible plot to take control of world governments under the guise of “protection,” the story weaves techno-speculation with historical conspiracy theories. It’s also enhanced by stunning political acumen: fictional newspapers read like press releases from post-9-11 America. With a vast open world and riveting script, Deus Ex single-handedly poses the argument for games as art.\nThe Legacy of Kain series is chiefly dark fantasy, not science-fiction, but it bears mention for its astonishing inventiveness, time-travel, interdimensional concepts and steampunk milieu. Technically a vampire story, the games’ antiheroes Kain and Raziel are defiant cosmic forces who would be at home in William Blake’s convoluted mythos. In the series’ strongest entry, Soul Reaver, the story begins on the world of Nosgoth where a decadent vampire civilization has crushed the human race. Raziel, once a prince of Kain’s empire, is executed for betrayal. His soul is saved from oblivion by a Cthulhu-esque abomination calling itself the Elder God which feeds on the “life-force” of the planet; but since vampires have established an immortal dynasty, there isn’t so much “life-force” floating around any more. The Elder God (masterfully voiced by the late Tony Jay) returns Raziel to life, letting him get revenge against his brethren while simultaneously using him to overthrow the vampiric blight.\nRaziel reanimates to discover that centuries have passed. Worse, his bloodthirsty enemies have devolved into monstrous things (vampires of Nosgoth undergo a kind of self-Lamarckian metamorphosis.) The planet is appropriately gloomy with smokestacks blotting out the sun, but the real dazzle comes when Raziel shifts to the spirit realm . . . a warped version of the normal world inhabited by its own creatures.\nThe Legacy of Kain series is the video game industry’s answer to Olaf Stapledon; just when you think you have a handle on the world, the story pulls back to reveal that all your actions were the merest wink in an unthinkably large canvas. Other installations in the series have Raziel shuttling to different eras on the timeline, trying to make and unmake a grandiose history. The quality of writing and voice-acting is perhaps the best in gamedom.\nAlso worth mentioning is the game BioShock, another moody contribution to the dystopian field. Set in 1960 in the undersea city of Rapture, it introduces us to eccentric industrialist Andrew Ryan. Rapture is a city where, he tells us, “the artist would not fear the censor, the scientist would not be bound by petty morality . . . the great would not be constrained by the small.” It’s objectivism on steroids, and ultimately casts judgment on laissez-faire capitalism. Rapture quickly becomes a degenerate nightmare.\nLike Fallout, BioShock utilizes the retro-future look for its underwater Xanadu. Striking colors blossom upon Rapture’s malls, hospitals and haunted corridors, while deranged citizens prowl the gloom. Like most modern games, player choice results in one of several different endings.\nThe upcoming game Brink promises to form a contrast with BioShock: instead of occurring beneath the waves, Brink will be set on a floating city called The Ark. Inside, the last batch of humans cling to life after an environmental catastrophe.\nWar Among the Stars\nVoltaire and H.G. Wells let aliens out of the bottle, but today’s games like Gears of War, Halo, and the spectacular Mass Effect move well beyond the Space Invaders mentality.\nThe popular Gears of War (2006) provides a lightning-fast combat experience, although it’s the most derivative of the bunch. Coming across as a hybrid of John Steakley’s novel Armor (the main character Fenix hearkens back to the novel’s Felix) and Heinlein’s Starship Troopers, it nonetheless portrays a complex tale of survival against overwhelming odds. The planet Sera has been colonized by humans. All seems well until “Emergence Day,” when the hapless colonists learn an indigenous species—nicknamed The Locust—has awakened from hibernation and is none too pleased at finding its world invaded. Gears of War is gamedom’s exploration of futuristic war, and it does so with a visceral, energetic crackle. The conflict is a grudge match between two species hell-bent on genocidal victory.\nIn Halo, the alien threat is not a creature defending its homeworld, but a theocratic confederation known as the Covenant. It’s one of the less desirable First Contact situations: Upon encountering human beings, the Covenant High Priests decide we’re the devil and must be purged from the galaxy. The subsequent war is just the starting point for an intriguing take on the Pandora’s Box legend, with galaxy-wide implications.\nOne of the most well-crafted stories in this subset is to be found in Mass Effect. Here’s a galactic epic that makes an entirely credible effort at justifying its fiction in scientific terms. Humanity has begun to spread into the galaxy and finds a millennia-old political structure called The Council already in place. Cordial but not especially fond of us, The Council is privately alarmed by the human race’s ceaseless adaptability and ambition—a probably unintentional nod to Arthur C. Clarke’s “Rescue Party.”\nThe game provides less warfare than political maneuver and investigation, with plenty of pragmatic side-quests such as surveying worlds for mineral, gas, and metal deposits on behalf of Earth Alliance. Of course, the main story is a “save the universe” theme, but it’s done in a surprisingly well-conceived implementation that is more original than the bulk of films and books put together.\nTampering with Nature\nMan’s tampering with nature, one of the earliest sci-fi conventions dating back to Mary Shelley’s seminal work, is popular in modern games. Usually it has to do with bioweapons research; a tangible enough worry in our age of genetic engineering and terrorism.\nMegacorporations are the cold-hearted villains in this subset of games: In the Resident Evil series, Umbrella Corporation is experimenting with the mutagenic T and G viruses. In the Red Faction series, Ultor Corporation is performing gruesome experiments on Martian miners. The game System Shock offers a double-whammy of man’s inventiveness gone bad: a malevolent artificial intelligence named SHODAN (itself the product of the unethical TriOptimum Corporation) decides to set itself up as god and then unleash mutagenic compounds against the Earth.\nIn these and other examples, the specters of disease and deformity are prevalent; we are reminded of James Woods’ mantra in the David Cronenberg film Videodrome: “All hail the new flesh!” Cronenberg himself was a popularizer of this concept in Hollywood, gleefully blurring the line between the human body and mutation in films like The Fly and Existenz.\nIn late 2008, the new Large Hadron Collider in Switzerland inspired a thrill of paranoia around the world. Here was something beyond cloning or genetic engineering, people said. The collider supposedly threatened the very fabric of the universe. Ten years earlier, the game Half-Life anticipated this with its fictional “Black Mesa Incident” in which high-energy physics experimentation punches a hole into a nearby dimension. No harm done, right?\nThe main character is a theoretical physicist named Gordon Freeman. He sports black-rimmed glasses and a goatee, is employed at a secret Nevada testing facility known as Black Mesa, and happens to be working when this incident occurs. The first game in the series is simply his attempt to escape the facility alive . . . even when the “hole” is repaired, our otherworldly competitors are aware of us now and they’re coming through on their own.\nHalf-Life is a terrifying and claustrophobic epic. Freeman encounters some of the most imaginative aliens in sci-fi’s visual media. Even when he escapes the facility, it becomes apparent that the “Black Mesa Incident” is no longer confined to the labs. It’s the proverbial “gray goo” scenario on a planetary scale; exotic flora and fauna are literally transforming the ecology of Earth.\nHalf-Life 2 plunges the tale into the grimmest levels yet. While the alien antagonist from the original, a freakish being named Nihilanth, has been defeated, it turns out to be a case of winning the battle but losing the war. An entirely new force called the Combine has moved into the vacuum created by Nihilanth’s defeat, and then kept moving right into Earth. When Half-Life 2 opens, the entire human race has been decimated, with survivors forced into ghettos (there are even some defeated aliens from the first game to be seen, forced into manual labor by the Combine’s shock troops.) Human reproduction is outlawed by a “suppression field” that makes procreation impossible, and there are disturbing hints that the world’s children have been eradicated.\nFreeman’s romp takes him through the shattered ruins of Earthly civilization, eventually bringing the fight to his oppressors and rallying the people to rise up . . . for whatever good it will do.\nIn the Thief series, we meet Garrett, a purse-snatching rogue who lives like the Artful Dodger in a city rife with political intrigue. It seems that his society is gripped by an invisible war between at least two ideological factions: the Hammerites, who advocate an industrial revolution replete with steam-driven machines and mechanized factories, and the Woodsies, a sect of fanatical pagan nature-worshipers who see machinery as an affront to the natural order. When Garrett gets himself in a spot of trouble—strung up by vines and having his eye plucked out by Woodsies—he decides to work with the Hammerites to exterminate these troublesome fanatics.\nThis is the storyline behind Thief: The Dark Project, a high-class steampunk adventure released in 1998 by Eidos Interactive. Garrett is a crafty enough antihero to lend considerable strength to the Hammerite cause. In time, the Woodsies are defeated. All is well . . . or is it? The game ends with Garret receiving a dire warning about the dawning of the “Metal Age.”\nThief II: The Metal Age delivers on this foreshadowing. The world Garrett has created through his defeat of the pagans is now overrun by monstrous automatons who, true to the Woodsies’ prophecy, are choking off the world. The Hammerites soon prove to be as fanatical as their bygone enemies, and Garrett must soon contend with them.\nBy virtue of its financial success alone (even in times of economic downturns) the video game industry is a juggernaut, handily defeating Hollywood box office sales. In fact, the line between the two has been blurring for a while. Actors like Keith David, James Woods, Ron Perlman, Seth Green, Michelle Rodriguez, and Ray Liotta have all lent their vocal talents to games, and each major release sees a growing stable of talent defecting to the digital domain. The storylines behind today’s best games are no longer cursory fluff, but rather are the main motivation to keep playing. And gaming continues to provide an unequalled facet to the science-fiction genre: the player can actively shape the experience based on his or her actions and decisions. Possibility—that central component of all science-fiction—is especially organic in a medium empowering player choice and ethical considerations.\nThe landscape of science-fiction can now welcome video games into the big tent. If current trends in gaming and multimedia persist, that tent is about to get a whole lot bigger.\nBrian Trent is a genre-spanning writer of both fiction and nonfiction. His work has appeared multiple times in Clarkesworld, Electric Velocipede, Strange Horizons, Atomjack, The Humanist (including a cover piece on human longevity research,) Boston Literary Magazine, The Copperfield Review, The Eclectic Muse, Bewildering Stories, Writer's Digest, and many others. He twice won Honorable Mention in the L. Ron Hubbard's Writers of the Future contest last year, and was a panelist at Yale's science-fiction symposium \"Literary Visions.\""}