{"fingerprint": "8k2Z3ysQxrpEA1g4nYmhYF0XDjw=", "sitename": "Clarkesworld Magazine", "title": "Breaking Out of the Box: A Conversation with Cadwell Turnbull by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/turnbull_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Breaking Out of the Box: A Conversation with Cadwell Turnbull by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nBreaking Out of the Box: A Conversation with Cadwell Turnbull\nCadwell Turnbull was born in Chevy Chase, MD and moved to his parents’ home island of St. Thomas when he was still an infant. He moved to Pittsburgh to attend La Roche University and earned a degree in professional writing. He returned to St. Thomas for a year and worked as a substitute teacher, and then taught in South Korea for a year. Afterward, he worked as a media coordinator for AmeriCorps and as a journalist on St. Thomas while attending NC State University.\nTurnbull earned a creative writing MFA in fiction and an English MA in linguistics. One of his teachers was author John Kessel, who introduced Turnbull to Octavia E. Butler’s Xenogenesis trilogy, books that became important to Turnbull’s debut novel, The Lesson. Turnbull attended Clarion West in 2016.\nCadwell Turnbull’s work is complex: sophisticated speculative fiction with a literary flair and a deep interest in things that matter. His work usually tackles socially charged issues, and often draws on the experience of moving from place to place, and of a layered sense of otherness. NPR’s review of No Gods, No Monsters says, “There’s race and sexuality and class and collectivism . . . There’s the overarching idea of othering those who do not look like us or live like us or love like us . . . ” and Tor.com says, “Turnbull refuses to smooth over or shove aside the complexity of the everyday world we live [in] . . . Turnbull doesn’t let the reader forgot how diverse and beautiful the world was, nor how complicated and thorny . . . No Gods, No Monsters is a staggering achievement of literary craftsmanship . . . ”\nTurnbull’s first published story was in Nightmare Magazine in 2017: “Loneliness Is in Your Blood” (reprinted in The Best American Science Fiction and Fantasy 2018 edited by N. K. Jemisin and John Joseph Adams), followed by “Other Worlds and This One” in Asimov’s and “A Third of the Stars of Heaven” in Lightspeed, also in 2017. Blackstone published Turnbull’s debut novel The Lesson in 2019, which received glowing reviews from nearly every respected industry outlet you could think of. The Lesson was included in “Best of 2019” lists for Library Journal, Kirkus, and Publishers Weekly. The novel also landed on the Locus Recommended Reading list, was long listed for the Massachusetts Book Award, short listed for the VCU Cabell Award, and won the 2020 Neukom Institute Literary Arts Award for Speculative Fiction in the Debut category.\nTurnbull lives in Raleigh and teaches creative writing at NC State University. No Gods, No Monsters is his second novel, and has received starred reviews from Publishers Weekly, Kirkus, Library Journal, and Booklist.\nYou are relatively new to the scene, but your fiction has landed well with discerning readers, and you’ve garnered really lovely reviews. When you start working on a piece of shorter fiction, what is important to you; what is the initial focus?\nI’d say that my stories start two major ways. I either have an idea first, and then I find the characters and the setting that will help me flesh that idea out (and also conceal the idea). Or I get interested in a particular kind of person. Usually this is still tied to some idea but through theme. I am asking: how would this particular kind of person respond to this particular sort of event?\nEither approach always ends in some sort of character study, and the structure of the story hinges around a moment of revelation or confrontation, for the character or the perceived reader. For me, plot is the little steps toward revelation or reckoning. Often those steps are quiet because I think the world reveals itself most in quiet moments. If I’m lucky I’ll stumble across something loud enough to feel like a proper climax, where the big action in the moment also offers revelation.\nThere’s a third approach. I am always finding thematic connections between stories, and sometimes I lean into those, play them up. Or I create a character I like, but they’re a side character, and then I can’t help but write about them. Lots of my stories end up being triptychs or having sequels or exist in the same universe as other stories.\nWith a dozen short stories published and very likely more on the way, do you feel like there are themes you tend to write, do you see any consistent elements?\nI think I jumped the gun here a little. I am a conspiracy theorist at heart. Everything is connected. And I most definitely return to themes again and again until I feel like I am asking the right questions.\nA big one is sibling relations with some knot of tension or conflict at the center. Familial relationships fascinate me because no one in the world understands you more and less than a close family member—a paradox I can’t help but explore over and over.\nOther stories focus on people hitting up against a certain aspect of society, some disparity or pocket of alienation that causes them to act against that system. Usually, the action is relatively small but meaningful to that individual.\nExistential dread shows up a lot. Something shifts in a person’s life that causes them to question reality itself. In one of my more recent stories, it is a body-swap. In another one it is a spontaneous act of teleportation that doesn’t happen again.\nAlso, moments of social change. That tends to be the subject of my novels, but my short stories hit up on this almost as often.\nAre there elements of writing that are harder for you—and how do you deal with those elements? Or are you fairly well-rounded in your work?\nI am certainly not well-rounded, though I try to lean on the study of craft to help me with my deficits. I love structure, but I’m not always great at plot momentum. I go where I go, linger in places I maybe shouldn’t. I am also not great at description. Some of this is stubbornly deliberate, but sometimes I don’t describe things that might help a reader. I seldom describe what people look like, and what I reach for I don’t like, so it often goes away in revision.\nYou have this new project called Many Worlds, a “collaborative shared multiverse project,” which just launched. How did it come about, and what is the central concept?\nWell, it came about because I felt like there needed to be an answer to intertextual narrative that wasn’t large, heavily funded franchises. I’ve always been interested in multiverses as a speculative concept. I wanted to create something that focused on the worlds and not just iterations of people (though there’s tons of fun to be had there, too).\nI also wanted to incorporate some of the things I love about cooperativism and apply it to what is often a solitary art form. Short fiction writers spend a lot of time creating these big worlds, only to spend just several thousand words in them. I thought: wouldn’t it be great if a writer could offer up their worlds as a sandbox for other writers inclined to write within it? And then: what if it wasn’t just one world, but many? And then: what if there were many other authors doing the exact same thing? A big interdimensional sandbox for writers to play in together.\nA cosmic entity called the Simulacrum ties Many Worlds together. And of course, there are travelers that move between worlds. The mechanism for travel is a bit strange, and because there’s a bunch of us, there’s a bunch of directions we’ve been taking this aspect of the narrative in.\nOn the Many Worlds site there’s a list of “Previously Published Many Worlds Stories,” which came out at a variety of places, such as Asimov’s, Lightspeed, and James Gunn’s Ad Astra. What is the relationship between those stories and the Season One content?\nSome of them aren’t related at all. The project is designed to produce stand-alone stories and tie-in stories. Occasionally we may use a world of a stand-alone story as a short-term destination in a tie-in story, but how that works isn’t always central to the tie-in story’s plot.\nWhat previously published stories do is establish some prestige for the whole project. Authors bring work in that they’re proud of and this makes the whole project better.\nI will say that one of my previously published stories is important to Many Worlds on a meta-narrative level. I finished “Shock of Birth” while I was still setting up the project. It was a bit of luck that the story got picked up by Asimov’s.\nAre there connections between Many Worlds and your latest novel, No Gods, No Monsters?\nNo, they aren’t connected. No Gods, No Monsters does feature its own multiverse, but with different mechanics. Fortunately, there’s all sorts of ways to design multiverses. I am pretty sure I am going to design more.\nWhat are the things you learned in writing debut novel The Lesson that you brought to No Gods, No Monsters?\nMostly structure. They’re very similar structurally. The Lesson follows several points of view during a moment of change. That structure was a discovery. I didn’t really know what I was doing.\nNo Gods, No Monsters was an earnest attempt to try to both push and improve on the approach. I wanted a narrative that valued each character, gave weight to each of their concerns, in relation to but also independent of what someone from the outside might view as important. I wanted to center the people. I also wanted to somehow move the plot better while doing that. I wasn’t completely satisfied the first time, so I tried it again.\nHow did No Gods start—what was the inspiration, how did the project develop, and did the final book end up being different in significant ways from the initial idea(s)?\nThe inspiration was part, “Hey, I want to write an urban fantasy, what would that look like?” And part, “Hey, this urban fantasy is a good setting for a lot of other stuff I’ve been thinking about for the last decade or so.” It was a natural progression of weaving old ideas with new ones. It really felt like the story just rose from my subconscious, bit by bit, with all these great connections. Not a dream like The Lesson, but dreamlike.\nEarly on, I knew I wanted the book to be told by a narrator I’d been coming back to for years. I only had one story published about the narrator, but I’d written others. Like The Lesson, that published story eventually made its way into the book because I realized that it was essential as an origin story. That changed the voice of the book somewhat, but it also made me think a lot about how a voice, even a narrator’s voice, might change over years. I was always interested in a personified, third-person narrator, but I became interested in what might happen if characters in a story knew more than that narrator. That also changed the book.\nThe Lesson was set in the US Virgin Islands, deliberately centered in and tapping into the culture you grew up with. No Gods keeps some connection to the Islands but also reaches into other locales. Is that connection, and cultural visibility, just as important with No Gods as it was with The Lesson?\nWhen I was in graduate school, I kept trying to write stories that used my own linguistic context as the authoritative voice of the story, even when the story was outside of the Virgin Islands. We get dominant culture narratives all the time that use the dominant lens to tell stories about “exotic” places. I wanted to do the inverse of that, tell a story set within another context, through a nondominant lens. I struggled with it a lot. I still don’t think I got it exactly right.\nI realize this sounds theoretical. Really, it was more of an emotional/experiential thing. No matter where I go, I bring myself. It felt important to me to do this in my writing. I’ve always felt like the choice being posed to me was to either write about home or write about elsewhere. Either choice felt like a box to break out of. My real-life experience is liminal, so No Gods became liminal, too.\nOne of many things No Gods does is interrogate the idea of the monster. Why is this important?\nI love horror movies, but I’m also a scaredy cat. The way I’ve been able to keep watching horror is to associate with the monsters. If I can find something to empathize with, I empathize. If I can’t empathize, I try to understand their guiding principles. Often enough, a monster is something that has become twisted due to some trauma or tragedy. That’s something I can always connect with. I think a lot of marginalized people can connect with that.\nOne of the subtler layers at play, for me, is the idea of power. The narrative explores the ways that power manifests, is used, is exploited, and so on. Power is rarely a simplistic concept. Is this accurate—is it deliberate or important?\nThere’s a moment in the novel where a young child hears someone discussing “malevolent” and “benevolent” powers and the child thinks the two words sound the same, “like sisters.” The child doesn’t completely know how profound an observation this is, but it is my hope that the reader does. Wielding power is dangerous no matter how it is used, for good or ill. There are unintended consequences. Sacrifices are required.\nIn our world, power is unevenly distributed. Is that inherent? Can one assert oneself without affecting the assertions of others? Even if there was a clean equivalent exchange, I don’t think we’d know it. And it would be atypical.\nIn the novel there are two organizations on opposing sides of a power struggle. One, in my mind, is concerned with a greater good. What that is and who must be sacrificed in the name of it is a major concern of the series.\nWhat is your favorite thing about this book and its characters?\nThe thing I love, that I got excited about while writing, is also the thing that may be immensely frustrating to readers. I find the older I get, the murkier human interactions are. I think it goes back to the question of power. I love that everybody in the story is controlling information, that it is being weaponized for both noble and not-so-noble gains. I don’t always like it in real life, but I wanted the story to match the world I experience. Personal motives are just as murky, and I love that all the characters are struggling with what they should be saying and why. Every character is navigating the messy area between selective truth and selective silence. It isn’t painted as evil because sometimes it is protective. Sometimes it is even loving. One of my characters makes this decision with his parents. He decides that protecting them from difficult realities is more important than deeper intimacy with them. It might be misguided, but that’s not the point. We all do this. All the time.\nNo Gods is book one of the Convergence Saga. Can you tell us anything about the next book?\nEach book is several years apart and is focused on a particular moment in the monster emergence. No Gods is the reckoning. We Are the Crisis is the backlash once the world generally makes up their mind about what is happening. The focus is the social change, told through the characters. But many of the characters will also be invested in finding answers to better-understand the monster world. They’ll find some of what they’re looking for, and some of what they’re not.\nWhat else are you working on, what do you have coming up for new readers and fans?\nRight now, it is mostly just the book. Many Worlds will be an ongoing thing, and hopefully we’ll have a running list of newsy things to share. I also have been working on a project with Realm Media. That should be announcing soonish. Until then, I’ve been keeping a lid on things.\nAt least one story in an anthology. Maybe a couple more if I can get my act together. A novella I worked on with my students that I’m hoping to find a good home for. That’s it, I think.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}