{"fingerprint": "DFGFNOlGYNj953JnIblVMNgIgOI=", "sitename": "Clarkesworld Magazine", "title": "The Yorkshire Mammoth by Harry Turtledove", "author": "Harry Turtledove", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/turtledove_08_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Yorkshire Mammoth by Harry Turtledove", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7370 words, short story\n The Yorkshire Mammoth\n Thrsk is, or claims to be, the only town in England without a vowel to, or in, its name. People who live there say the Vikings carried it off a thousand years ago. Looking at them and listening to the Scandinavian words in their Yorkshire dialect, you may easily believe the Vikings left a lot more recently than that, if they ever left at all.\n Beautiful country, northern Yorkshire. The dales and the fells and the tall barrens with glaciers snaking down from them . . . Not the kind of landscape I’d been used to in Glasgow, but it grew on me the longer I stayed in Thrsk.\n Wotan and Donner Rengaw, of whose veterinary practice I formed a small but growing part, loved Thrsk, too, though they were no more Yorkshiremen than I. They also loved the people whose stock they helped—except when those people didn’t pay their bills, which happened all too often. Anybody who doubts Yorkshire country farmers are slow with their silver has yet to meet one.\n Oh. Wotan and Donner? When I first went to Thrsk in those prewar days, I wondered if I’d find a pair of fierce Teutons with swastika buttons in their lapels. But no. They were quite comfortably Anglo-Saxon. Wotan made light of it, saying their mother had been frightened by an opera. Donner grew tight-lipped whenever the subject was raised, so I soon stopped raising it.\n Down in the dales, the farmers were much like farmers anywhere else, even if they did expect a good deal in the way of value for their money. In the higher country, though, I wondered not only whether the Vikings had ever left but whether the Ice Age had ever abated. The cold winds blowing off the glaciers made me want to keep one eye peeled for cave bears, dire wolves, saber-toothed tigers, or other relics of bygone days.\n Such monsters, of course, had vanished from England and Wales and Scotland in Roman times, though they lingered in Ireland with the Irish elk and the aurochs until after the Norman conquest. Nor had anyone in Yorkshire set eyes on a woolly rhinoceros since the days of Queen Elizabeth, or those of James I at the very latest.\n Mammoths, though, mammoths were a different story. Like mahouts in far-off India, the canny Yorkshiremen worked out that getting work from their enormous neighbors was more profitable than slaughtering them wholesale. And that long tradition lingered still in those days when I was new in Thrsk, especially on the highlands too rugged or rocky for tractors. Mammoths gave the veterinary trade around there a fillip it got in few other places outside the Far East.\n I was in the surgery doing our small-animal business one bright but chilly spring morning. (Bright, warm spring mornings come seldom to Thrsk.) I’d just taken ten stitches from the side of a cat that had quarreled with a dog when the phone rang. The cat, a tough old tom named Toby, was mild as milk as long as he sat on his mistress’ lap. Mrs. Aldiss said he’d actually won the fight, but he hadn’t come off unscathed.\n She was fumbling in her coin purse to pay me when the housekeeper stuck her head into the antiseptic-smelling room and said, “Sorry to bother you, Mister Holley, but it’s Wilf Latchett from up on Longyoke Fells. He sounds a bit upset.”\n “I’m coming, Missus Kitchen,” I said at once. You had to be tough to live on Longyoke Fells; if you weren’t, you’d freeze or starve or both together. The ice lay very near there. Wilf Latchett and his family were suited to their rugged home. He took everything as it came. I found it hard to imagine him upset. Yet I couldn’t doubt Mrs. Kitchen. As I hurried towards the phone, I did add, “Missus Aldiss was about to give me the last two and six of the bill for Toby.”\n “I’ll get it,” the housekeeper assured me. She knew as well as I, we’d never see it if she didn’t.\n “Thanks,” I said, and then, a moment later as I picked up the telephone, “George Holley here, Mister Latchett. How can I help you?”\n “Is Mister Wotan there? Or even Mister Donner?”\n I heard such things a good deal when I was new to those parts. The crofters were used to the Rengaw brothers, where I was just a stranger they’d hired. But the Yorkshiremen did warm to me once they saw I could do the job all right. “I’m sorry, but they’re on call,” I said to Wilf Latchett. “Tell me what wants doing. I’ll handle it as best I can.”\n The telephone wires carried his sigh to me. “Well, it’s Awd Bill,” he said. Before I could enquire as to what manner of beast Old Bill might me, he went on, “’E’s gone an’ broke a toosk off short, ’e ’as.”\n “A . . . tusk?” I echoed faintly. Mammoth work was a treat I hadn’t yet enjoyed. Well, it seemed I was about to.\n “Aye, a toosk. D’ye think I’m jestin’ with ye, young man?” Mr. Latchett said. “Broke it on a stone in t’dirt, ’e did.” Up on Longyoke Fells, the dirt was more stones than anything else.\n I’d studied animal dentistry at veterinary school in Glasgow, but dentistry on mammoths is not your ordinary animal dentistry. Thinking how unhappy such a large patient might be also made me think of something else. “Ah, Mister Latchett,” I said, “Old Bill . . . He’s been fixed, hasn’t he?” If I sounded hopeful and anxious, well, I was.\n But Mr. Latchett said, “Oh, aye. T’awd vet, ’e took care of it years gone by. ’E said a mammoth wi’ ’is stones was plumb dangerous, an’ Ah reckon ’e knew what ’e was talkin’ aboot.”\n I reckoned the same, and blessed the old vet—the man from whom Wotan had purchased the practice a few years earlier. “Very good, Mister Latchett,” I said, hoping it was. “I’ll be up as soon as I can.”\n “Ah hope ye can do summat, young man,” the farmer said. “Awd Bill, ’e’s none too pleased wi’ having but the one diggin’ shovel.”\n “Er—yes,” I said. Mammoths used their tusks to grub some of their food out of the ground. How well would Old Bill get along without a matched set, even if I could properly repair the remaining stump or stub or whatever the proper word was?\n One thing at a time, though. Making that repair—if I could do it—had to come first. I said my goodbyes to Wilf Latchett, made sure the surgery held no one in urgent need of help, and then threw into my traveling satchel whatever I thought might be useful in this unusual case. That dealt with, I went out to the shed and tossed the satchel into the elderly, spavined Morris Minor Wotan let me use.\n The Minor had a self-starter, but that was long deceased. Its designers having perhaps anticipated such flaws, it also had a crank. That didn’t always make the engine turn over, either, but it did then. The shed housing the Minor forthwith commenced to fill with noxious fumes. I quickly backed the car out into the open air to give myself a chance to breathe.\n Away I went, trailing more smoke behind me. People in the street waved as I clattered past. No one seemed upset at the Minor’s stream of exhaust; every third car in those days smoked the same way. Fine-tuning motors was an idea whose time had not yet come.\n Thrsk is not a village, but it is no great city, either. I soon found myself in the countryside, climbing up past the dales to the fells. Before very long at all, I was glad for my tweed jacket. Snow lingered on north-facing slopes. The wind off the glaciers reminded me of the days when all Britain lay beneath them. By the way that wind felt, those days had ceased only a fortnight before at the earliest.\n The road grew steeper. No crew had come up these slopes with fresh macadam for many a long year. To negotiate the bumps and the grade, I had to drive the Minor in first gear. That dropped my speed not quite to zero, but as near as made no difference. It hardly mattered. I wasn’t holding up traffic; mine was the only car on a very long, very lonely stretch of road.\n Just before I rounded the last bend and reached Wilf Latchett’s farm, three or four musk oxen bounded away in alarm. They run wild up near the ice and are most shy of men, having been hunted so much for so long.\n I started standing on the brake pedal well before I reached the gate. The lining was but a memory—the metal shoe squealed against the metal drum. For all my efforts, the Minor glided thirty yards past before the auto in motion became an auto at rest.\n Wilf Latchett stood at the gate watching me walk back to him, veterinary satchel in hand. No tweed jacket or sheepskin coat for him. He wore only a collarless shirt. His one concession to the climate was that it had long sleeves. “Now then, Mister ’Olley, I’m right glad to see ye,” he said, and opened the gate so I could come through.\n “You didn’t need to wait out here, Wilf,” I said. How long had he been standing out in the cold? From the moment he set down the phone? It wouldn’t have surprised me a bit. Yorkshiremen drank in such courtesy with their mothers’ milk. They would sooner have seen their holdings sacked than make an expected guest open a gate for himself.\n “’Tweren’t nothin’,” Wilf said now with a shrug. He was a fair, ruddy man in his fifties, the straw-colored hair under his cloth cap just beginning to go gray. His face looked younger than his years, his battered, knobby-knuckled hands much older. The big veins just under his skin stood out like tree roots in eroded soil.\n “Take me to Old Bill,” I said as he closed up behind me.\n “Aye,” he said, and he was off. His Wellingtons clumped on the dirt and the new grass, still sparse and pale green up here where spring remained barely more than a rumor.\n Most of the soil atop that cold, windswept hill was thin and poor, judging by the paltry growth it raised. Yet the garden behind the stone farmhouse and the fields on the far slope seemed far more prosperous than they had any business being. The aroma rising from the garden gave me a clue I did not need to be Hercule Poirot to unravel. “Do you use mammoth dung for fertilizer, Wilf?” I asked.\n He nodded. “Aye, that we do. Nowt like it for makin’ plants grow tall.” He pointed towards the barn, which was—and needed to be—much larger than his home. “Awd Bill, ’e’s in there.”\n Again, I needed to be no great fictional detective to deduce this. My own little gray cells, poor as they were, sufficed nicely. “Will you come in with me, Wilf?” I said. “He knows you better and likes you better than he does me.” Even a dog you can carry in a handbag is liable to nip a stranger. Attention from a out-of-temper woolly mammoth might prove a bit more serious.\n Wilf Latchett nodded again. “Right glad to do it, Mister Holley.” In he went. I followed.\n It was warmer within than without, though nearly night-dark. The walls shielded us from the merciless wind outside, and Old Bill was big enough to be his own heater. The same odor I had smelled by the garden was thicker and fresher here.\n Wilf smelled it, too. With a chuckle, he said, “My lads, they’ll ha’ themsels a bit o’ muckin’ out to do.” He pointed towards a thin white object leaning against the wall. “Ah brought in the boosted toosk, in case ye needed it.”\n Wanting to give Old Bill a moment to get used to my presence, I went over and hefted the broken tusk. Four or five feet of ivory, it had to weigh a good fifty pounds: heavier than I expected. “It will be worth a fair bit to you,” I said. “Ivory—heh, heh—doesn’t grow on trees.”\n “Ah thought o’ that, Ah did,” Wilf said. “Ah’d liefer ha’ Awd Bill whole, though.”\n “I understand,” I said, and then, because I couldn’t put it off any longer, “Let’s have a look at him, shall we?” If I sounded more cheerful and less nervous than I was, people often do.\n “Come on with me, then,” Wilf said matter-of-factly, and went over to the great gray-brown beast stuffing hay into its mouth with its trunk. Instead of running the other way, I followed.\n Old Bill didn’t turn to look at us, but his ears twitched in our direction as we drew near. They were smaller than those of an Indian elephant, much less those of an African. The tropical varieties use their ears to radiate away excess heat, a worry seldom found in subglacial Yorkshire.\n Wilf set a fond hand on the side of the mammoth’s face, not far from where the broken tusk erupted. “Stay steady, awd boy,” he said. “T’ vet, ’e’s ’ere to help you. ’E’ll not ’urt you any more’n he must.”\n I hoped the beast was listening. Stepping up beside Wilf Latchett, I got my first look at what remained of the tusk. Sure enough, there was the pulp cavity, exposed to air and dirt and germs. As I examined it, Old Bill examined me. For all the mammoth’s bulk, its eye wasn’t a great deal larger than my own. It relied more on hearing and sense of smell—and on touch, as the end of its trunk explored me. It was like being felt by an enormously strong, two-fingered hand.\n “Let’s numb things up a bit, shall we?” I said, and used a large-bore needle to give the mammoth an injection of novocaine near the base of that tooth. I wanted the nerve as much out of action as I could make it before I went to work on the damaged part of the tusk. I also squirted novocaine on the nerve ending exposed by the break. From the snuffling sound Old Bill made, he wasn’t sure he cared for that, but he tolerated it. Had he taken any serious offense, I should not be setting down this tale now.\n Wilf and I stepped outside for a cigarette while the anesthetic took effect. Then, hoping I’d not just smoked my last one like a man before a firing squad, I walked back into the barn.\n Horses’ teeth and those of cattle are large and long-rooted, so I had some tolerably formidable dentistry tools. But those teeth do not compare to a tusk. As far as I know, elephant dentists have to improvise. Demand is not sufficient to encourage the manufacture of instruments on such a mammoth scale.\n Forgive me.\n I cleaned out the pulp cavity as far as I could reach with my misnamed “large animal” tools. Old Bill did not care for that, even anesthetized, but put up with it as if he knew I did not mean to hurt him. I have seen the same from many other beasts as well.\n Having excised the nerve as far as I could reach, I cleaned the cavity with antiseptic solution. Then I inserted pointed strips of gutta-percha and used a match to seal the rubbery stuff to the tusk. “There!” I said, pleased with my handiwork.\n Wilf seemed less delighted. “Well, you’ve done summat, any road,” he allowed. “But will yon blowout patch stand up to it when Awd Bill gets to diggin’ again?”\n I ran into that like a mammoth tusk slamming into a buried stone. After a bit of thought, I had to admit, “I don’t know.”\n “Is there aught more ye can do?” he asked.\n “I don’t know,” I repeated, and stood there in the great mammoth-smelling barn whilst I thought some more. After a couple of minutes, I said, “This will do for the time being, I think. But if you’ll let me take the broken tusk along with me, I may be able to come up with something better, something that will last quite a while. You’ll get the tusk back, I promise.” Having reminded him it was valuable, I wanted to leave no doubts on that score.\n He scratched the side of his jaw. “Ah’ll ha’ to shell out more brass’n just for a simple visit, won’t I?”\n “I’m afraid so. I don’t know how much yet—I have to speak with someone down in Ripon,” I said. “I’ll need a bit of help for what I have in mind. Do you want me to go ahead or not?”\n “Aye, do it,” Wilf said. “Ah’d like Awd Bill as near whole and ’ale again as ’e can get. ’E’s not just a beast o’ burden. ’E’s part o’ the family, like.”\n They say Yorkshire farmers are stingy, hard-bitten men. And some are, true enough. But many others see things like Wilf Latchett, and care for their stock as they would for their children. Oh, I’m not saying Wilf turned up his nose at cock-a-leekie, but a mammoth has more character than a mammoth’s weight of chickens.\n City bred as I am, I always enjoyed going into Ripon. Ripon may be no great city, but a city it is. However charming Thrsk is, it is no more than a town. The difference between the one and the other is not so easily defined, but is readily seen. Just for instance, Ripon had traffic lights, an amenity Thrsk was innocent of in those days.\n And Ripon had Dr. Aryeh Teitelbaum. That distinguished Jewish gentleman was Wotan and Donner’s dentist, and lately mine as well. He’d also given the practice much valuable advice about caring for, maintaining, and repairing teeth. Being an expert on that score gave him an advantage even if the teeth in question weren’t human.\n “Hullo, old man!” he said when I walked into his office. He had the plummiest BBC accent I’d ever heard. His father, I happened to know, dealt in secondhand clothes in Birmingham. To hear him talk, though, you’d guess he was to the manor born. His diction didn’t falter even when he saw the broken tusk in my arms. “Where on earth did you come by that?” he enquired.\n “Hilltop farmer up on the fells, as near the glaciers as you can get without being buried in ice,” I replied.\n “You do know we don’t make false teeth from ivory anymore?” he said.\n “I had heard that, yes.” I did my best to match Aryeh dry for dry. It was the best way I knew to make him get down to business.\n He plucked at his beard. Yes, he wore one even then, when they were as few and far between as could be. His was closely trimmed, with some gray starting to show in patches on his chin. Reasonably enough, he asked, “Why did you bring it to me, then?”\n “I hoped you might rig some sort of replacement, prosthesis, false tusk—call it what you will. Something Old Bill can use instead of what he’s lost here.”\n “Isn’t that interesting?” Aryeh murmured. “A farmer up near the ice . . . He’ll not have a pair of threepenny bits to jingle in his pocket, will he?”\n “He isn’t rich,” I agreed.\n I might as well not have spoken. “It’s all right. The challenge of it alone is worth the candle,” he said, more to himself than to me. He might have forgotten I was there. Then he remembered me again. Most of the time, the expression on his roundish face was mild, even amused. Now his gaze sharpened. “You won’t have taken an impression of the remaining end of the tusk, will you?”\n “I’m afraid not.”\n Aryeh sighed at my many failings. Wotan often did the same, but on a different note. The dentist said, “Can you go back up there and get the contours of the last foot or so? I’ll want to shape a socket for the false tooth, you understand.” By the way he said it, he assumed I understood nothing. When it came to dentistry, that was a fair assumption.\n “I can, certainly,” I said, hoping the Morris Minor would agree with me; it was a savage climb. “But what shall I use to make the impression? Modeling clay? I can pick some up, I suppose.”\n “Wait here. Don’t move even a muscle. Not a muscle, do you hear? I’ll be back directly.” Aryeh disappeared into the bowels of his office. He emerged in due course with a carton he carried in both hands. “Here you go, old man. This is the compound I use to take impressions for crowns and false teeth. You’ll need more than I’m in the habit of using, I fear.”\n “Thanks ever so much! Will it come off the tusk once it dries, or will I need to cut it in half?” I asked.\n “It should come off. If not, you’ll do whatever you have to do, and I’ll adjust accordingly,” Aryeh said.\n After thanking him again, I drove back up to the Latchett farm without phoning ahead. The Minor just about made it up the last steep bit. This time, remembering where the gate was, I trod on the brake well in advance, and slowed to a halt only a little bit beyond the hinged opening.\n As I’d hoped, one of Wilf’s boys was out in the rocky fields. Ralph Latchett, a taller, ruddier version of his father, opened the gate for me. “Why art tha back so soon, Doc?” he asked. A doctor for humans or a dentist is invariably called Doctor, a veterinarian is inevitably tagged Doc.\n “I’ve been down to see Doctor Teitelbaum about Old Bill’s tusk,” I said. “He wants me to make an impression of the stump.”\n “He’ll be able to do summat for the mammut’?” Like his father, Ralph sounded anxious.\n “He thinks he will.”\n “Huh. ’E allus reckons ’e can do aught, that ’un,” Ralph said, an opinion little different from my own. He went on, “Let’s ’ope ’e ’as the right of it this time.”\n “Let’s,” I agreed. “Will you take me to Old Bill?” I didn’t much care to be alone with the mammoth in that great drafty barn.\n “I will, sir, and right gladly, too.” He set a pace that I, with my arms full of PATENT IMPRESSIONIZING COMPOUND (it said on the carton), was hard-pressed to match. Recalling the things people said about elephants’ memories, I hoped the beast was in a forgiving mood.\n As he had been the last time I came in, Old Bill was eating. Since he couldn’t forage for himself so well, the Latchetts were keeping him in hay. He snuffled in my direction. His tail and ears twitched a bit as I came up to him, but only a bit. He seemed willing to tolerate me, if not to welcome me as a bosom friend.\n I molded the compound around the tusk’s stump. It was, one of the boxes inside the carton informed me, made up largely of alginate, whatever alginate was. The box also said it had a setting time of about four minutes. The way I was using it, I gave it twice as long.\n Old Bill, I should add, accepted my attentions as calmly as if I were a Latchett and he’d known me for years. When I said as much, Ralph nodded. “’E’s a good ’un, our Bill is,” he said. I could only nod back; any mammoth not a “good ’un” would be far too dangerous to keep near people.\n As I worked the impressionizing compound off his tusk, Old Bill did not flinch or show any other sign or pain or distress. That told me the procedure I’d done a few days before had probably rooted out, you might say, any incipient infection in the tusk’s stub. I also checked the gutta-percha seal at the end of the stub. Even under a magnifying glass, it seemed intact.\n “All as’t should be, Mister Holley?” Ralph asked.\n “I think so. I hope so,” I answered. Though new to the practice, I had already learned not to promise success I couldn’t be sure of delivering.\n “Even so much is good t’hear, any road.” Ralph might have grown up far from city sophistication, but he understood I wasn’t promising. I always appreciated things being clear between veterinarian and client. Then he asked, “What’s the scot this new bit o’ business?”\n “Not a farthing,” I told him, pleased that I could. “Doctor Teitelbaum doesn’t want payment. He said he’s never had the chance to work on a mammoth before.”\n “Huh!” Ralph said. “’E took our brass fine last year, when ’e yanked my bottom wisdom teeth.” He paused, visibly running his tongue around the inside of his mouth. “They don’t ’urt no more—I will say that.”\n I took the mold back to the car and drove to Ripon once more. Going downhill in the Minor could be even more exciting than going up. Climbing a hill, you wondered if you’d make it to the top. Descending, you wondered fearfully how fast you’d be going when you got to the bottom and whether you could stop if you had to. Any slope at all gave the brakes a challenge they really weren’t up to meeting.\n Thanks to the dearth of traffic in the high fells, I got down on to flat ground with no more than the usual pounding heart and cold perspiration. Nor did I have any mishaps parking the car down the street from Aryeh Teitelbaum’s office. The mold survived the drive unscathed, too. I took it inside.\n This time, I had to sit half an hour in the waiting room, as he was busy with a patient. When the man came out, he nodded to me. He was feeling of his jaw, as if amazed he didn’t hurt more. Sure enough, he said, “Reminds me o’ the trenches in the war. The Huns finish shelling, and you go, ‘Well, I didn’t catch a packet this time.’” Another nod and he went on his way.\n A moment later, Aryeh stepped into the waiting room. I gave him the mold I’d made. He looked at it from the side, then peered into it to see what the end looked like. “Nicely done, George. Very nicely done indeed,” he said. “It’s just what I need. I don’t believe I could have done better myself, even if the thought of getting near the brute didn’t scare me spitless.”\n I happened to know he’d won a Military Medal in Belgium in ’18, when things looked black indeed. Not that he’d told me himself, you understand; he would have gone on the rack before bragging like that. But I’d heard it from more than one man who’d served with him. And, things being as they are, Jews have to show twice the bravery to win half the credit.\n So all I said was, “Will it do what wants doing?”\n “I think it should,” he said. “You must give me a week or ten days now. I shan’t be doing this alone. But at the end of that time I may have something to make your mammoth a bit less lopsided.”\n “I’ll come back in ten days’ time, then,” I said.\n “Ring before you do,” he warned. “I shouldn’t want you to make the trip for nothing if it isn’t ready.” And so it was agreed.\n A good thing he had me telephone before going back to Ripon. When I did, Aryeh told me he needed two days more. He was all apologies, which I ignored. The man was doing me and the Latchetts and Old Bill a considerable favor. If he and whatever confederates he’d enlisted needed a bit more time, then they did, that was all.\n I checked again before driving down. On getting the green light, I chugged to Ripon in the old Minor. I had no idea what I’d see. “Good morning, George,” Aryeh said when I walked into his office. After we shook hands he brought me the broken tusk. “Here you are. Your Mister Latchett will make the best of this. Not long on cash, you said?”\n “Not a bit of it,” I agreed. “But he worries more about Old Bill than any of that.”\n “He knows what matters to him. Pity more men don’t,” the dentist said. “Now if you’ll excuse me for a moment—” Aryeh ducked into his inner office. He always had a flair for the dramatic.\n No more than two minutes later, out he came again, carrying another tusk, or rather a denture, I supposed you’d say, doing duty for the genuine article. It was almost as creamy-white as the true mammoth tooth. Only the socket at the end Aryeh held uppermost really gave away its being man-made.\n “Gosh, that’s wonderful!” I exclaimed. “What’s it made of?”\n “Concrete,” Aryeh answered. “Josh Doggett, who’s in the building trades here, lent a hand with it after I finished the mold. It’s painted now, to look more like ivory. That will wear off with use and time. Unless Will Latchett touches it up now and again, he’ll have a mammoth with a two-toned tusk.”\n “It’s made of concrete?” I said doubtfully. “Isn’t it all too likely to break again?”\n “I dare hope not, anyhow,” he answered. “A couple of steel reinforcing rods run the length of it. Getting them bent to the proper curvature was what held me up. Now that they are, though, Josh is confident it will last about as long as the unbroken tusk. If reinforced concrete is good enough for skyscrapers, he says, it’s likely good enough for mammoths, too.”\n “I hope so,” I said, laughing. “Will the socket fit smoothly over the broken end of the tusk? Should I cement it into place?”\n “I’d cement it. I’ll let you have some dental cement, the kind I use to hold crowns on tooth stumps in people’s mouths.” Aryeh laughed, too. “I never have to apply it with a paintbrush, though. It dries fairly fast, so you’d do well not to waste time between putting it on and placing the tusk.”\n I nodded. “I understand. You’ve put an awful lot of time and work and supplies into this, Aryeh. Are you sure there isn’t some way I can square it with you?”\n He shook his head. “It’s my pleasure. I’ve never had the chance to work on this scale before. It’s taught me a few things, though heaven only knows if I’ll ever get the chance to use them again.”\n “You’re aces in my book,” I said. He waved that aside. Like a lot of generous men, he was embarrassed by his own generosity.\n I took the denture out to the auto, and then the veritable mammoth tusk. People on the sidewalk gave me curious looks, but Ripon is not such a big city that anyone had the crust to ask me straight out what the devil I was doing. Aryeh, meanwhile, loaded me down with enough dental cement for a regiment’s worth of human sufferers.\n Then it was up to the edge of the glacier once more. My poor elderly Minor did not approve. The motor growled and whined like an unhappy dog as the car climbed and climbed. The jaunt never failed to fascinate me, though. Not so long ago, as the geologists measure such things, all Britain lay beneath a mile of ice. Even after it began to retreat, after the Channel cut our island kingdom off from the Continent, for long centuries places like Dover and Portsmouth were as subarctic as the Yorkshire fells are today.\n The air had that icy chill, but also that icy purity. If you could make a living here, you could make a living anywhere. I would have taken my hat off to Wilf Latchett and his hearty brood, but the chilly wind might have snatched it from my hand and blown it downhill towards warmer climes.\n Wilf was out in the fields not far from the gate when I drove up. He raised rye and oats, which had a chance to ripen even in the short upland growing season. Sometimes, if the year looked like being warmish, he would risk a bit of barley, but never wheat. Wheat was for farmers down in the dales, who could count on frost-free days into October.\n Wilf came to the gate, blowing smoke from a Woodbine. “What ’ave you got for me today, Doc?” he asked, setting a work-ravaged hand on the latch.\n “With luck, something that will set Old Bill to rights.” I left the car and drew the replacement semi-tusk out through the open rear window.\n “There’s summat out of the ordinary,” Wilf said, taking it from me and turning it this way and that to examine all of Aryeh Teitelbaum’s handiwork. He smiled as he reached into the socket at the end; he saw at once how it would connect the new part to the whole of the mammoth. “’E’s a right clever feller, Doctor Teitelbaum is.”\n “I think so, too,” I said.\n He hefted the prosthetic. “Not much heavier than the real ivory,” he remarked. “Shouldn’t trouble Awd Bill a bit to bear it. An’ ’e even slapped paint on it t’make it look more like t’other ’un.”\n “He said you’d have to touch that up if you don’t want it looking like, well, concrete after a while,” I said.\n “Mebbe Ah will, mebbe Ah won’t,” Wilf said. “But concrete? Will Ah have to worry it’ll break off short again?”\n “I hope not.” I explained how Aryeh and his friend had reinforced the tusk with steel.\n “By gaw! What’ll they think of next?” Wilf said.\n Remembering, I also took out the broken length of ivory. “And here’s this,” I said. “As I told you, it’ll bring you back something for all the trouble you and Old Bill have gone through, anyhow.”\n “Obliged, sir. Much obliged indeed. For now, ye can lay it on t’grass there. I’ll tend to it in good time,” Wilf said. I must have given him a look, because he chuckled. “’Oo’s going to come by and nick it, Mister ’Olley? Answer me that, eh?”\n I set down the tusk and spread my hands. “You’ve got me there.”\n We walked together to the great mammoth barn. I tried to get Wilf to let me carry the replacement tusk while taking the much lighter cement himself, but he wouldn’t hear of it. I had to argue him out of lugging the cement, too. He was my host, or felt he was, and didn’t want a guest doing anything for himself.\n When we went inside, Old Bill gave a questioning snort. That was all—by then, I’d been there often enough to have reached the rank of accepted person. He may even have understood that I’d come to do him good. Some animals seem to, and mammoths are uncommonly clever beasts.\n I painted the inside of the socket with cement, and the last foot or so of the tusk stump as well. When the concrete creation was in place, I made sure I had cement all around the butt end of the socket, doing my best to seal it away from the outside air.\n “’Ow long’s it need to dry?” Wilf asked.\n “Not long, Aryeh said. I’ll give it about ten minutes, because I’m using so much more cement than he does with his patients.”\n He laughed again. “Aye, reckon y’are.” He laid a hand on the side of Old Bill’s great, shaggy head. “’Ang on, awd lad. ’Twon’t be long.” The mammoth snorted once more. Did it understand what he told it? I would say no, if you mean understand as you or I might. But it understood that a human it trusted was telling it something in reassuring tones. The mammoth stood quietly while I held the false tusk in place, waiting for the cement to set.\n Old Bill stayed so calm, I gave it an extra couple of minutes. Then I stepped away. The concrete simulacrum was a bit heavier than the ivory it replaced, thanks to the steel reinforcing rods and the socket extending its length. I wondered if that would disturb or discomfit the mammoth. It didn’t seem to. And, after all, he was closer to being in balance now than he had been with his broken tusk.\n As I’ve noted, mammoths and elephants do not see well, depending more on smell and hearing than on sight. There in the mammoth barn, though, I would have sworn Old Bill was trying to look down the new tusk to discover what I’d done to him. He cocked his head now this way, now that. Had he been a human being, I should have said he was puzzled.\n Try as he would, he didn’t get the answer he was looking for from his eyes. Then he felt the replacement tusk with his trunk. He used that for so much: to smell with, to siphon up water and squirt it into his mouth, and to pick up food and likewise convey it to his tongue and the teeth that were not tusks.\n He reminded me it could also serve as a hand. The two fingerlike projections stroked the painted concrete. Old Bill seemed particularly intrigued by the way the socket fit onto the lost tusk’s stump. He explored the joining again and again. I wish I could have deciphered his grunt. Claiming an animal acts like a man is a mug’s game, of course, but if I’d had to put the noise into English it would have been something like How did he do that?\n Wilf Latchett thought the same. “Wonderin’ ’ow it got there,” he said.\n Then Old Bill walked to the closed door of the barn and turned his great head back towards Wilf, as far as it would go. I’ve been cooped up in here long enough, that look said. Now that I’m whole again, let me go out and be a proper mammoth again.\n Wilf hurried to open the door. No doubt Old Bill could have broken it open himself, but he seemed to appreciate the courtesy. As soon as the space would accommodate his bulk, he hurried out onto the grass.\n Up went his trunk in what looked like joy. Yes, I know I warned against anthropomorphizing, but here once more it was hard to avoid. Then he trumpeted out a blast that sounded like a dozen horn players blowing on bugles full of spit.\n A moment later, another mammoth answered, far off in the distance. “Ah, that’ll be Dusty Rhodes’ Chuzzlewit,” Wilf said.\n “Chuzzlewit?” It was hardly a name I’d have expected a Yorkshire mammoth to bear.\n “Likes Dickens, Dusty does. ’E’s a good bloke any road, though,” Wilf said, leaving me to make what I would of that.\n Leaving it alone seemed the better part of valor. I just said, “Call me in a week to let me know how he’s doing. Call me right away if he has trouble of any kind, or if he seems to be in pain. I’ve never done a root canal on a mammoth before. I hope everything’s all right, but I don’t know that it is. And of course call me if he breaks the tusk again. Heaven forbid, I know, but it can happen.”\n Wilf sketched a salute, as if I were a young, mustache-wearing first lieutenant from his Great War days. “Ah’ll do just as ye say, Mister ’Olley. An’ me an’ Awd Bill, we’re much obliged to ye, and to the dentist, and to his friend down in Ripon.”\n I thanked him and headed back to the Morris Minor. Wilf came along to open the gate for me, the kind of kindness men in the high country took for granted in those days. We’d almost reached the edge of the road when Old Bill trumpeted again. He sounded delighted. I hoped he was. I hoped he’d stay that way.\n For the next week, I tightened up every time the telephone in the surgery rang. I knew, I knew, it would be Wilf Latchett, ringing me to report some disaster: Old Bill in distress from pain in the now nearly unreachable pulp cavity, or else the replacement tusk and some of the stump snapping off.\n Every time, it was someone else calling about something else. Every time, I took a deep breath and relaxed . . . till the telephone clamored again. On the appointed day, Wilf did telephone—late in the afternoon. Mrs. Kitchen took the call. I was sewing up the hind leg of a dog who’d come off second best in a scrape with some barbed wire.\n “It’s Wilf Latchett, Doctor Holley!” she called down the hallway.\n “Talk to him for a couple of minutes, please. I’m almost finished here.” I made sure I did what needed doing properly, accepted the farmer’s thanks and half a crown, and hurried to the telephone. As soon as Mrs. Kitchen handed me the receiver, I blurted out, “How’s he doing, Wilf?”\n “’E’s capital, Mister ’Olley. First rate,” Wilf answered. “Couldn’t be better. Fine fettle Awd Bill’s in, yes indeed.”\n Relief washed over me like the gentle rain so rare in rugged Yorkshire. Flood, yes. Drought, yes. Blizzard, often. But gentle rain, here, is more spoken of than seen. “I’m so glad to hear it!” I said.\n “Well, now, sir, I’m right glad you took such good care of ’im,” Wilf said.\n “Call again if there’s the least trouble,” I told him, and he rang off.\n There wasn’t, not that had anything to do with the replacement tusk. Old Bill lived quite happily with it for more than twenty years. Wotan put him down in the early 1960s, when a malignant mass in his bowel left him but a sad shadow of his old self. By that time, Wilf’s sons were running the farm together.\n But I did have one more reminder of the story. A year or so after I put on the replacement tusk, Aryeh Teitelbaum was drilling out and filling a cavity I’d got. After he’d finished, he said, “Your Wilf Latchett came by not so long ago.”\n “Did he?” I said blurrily—the novocaine left half my tongue numb.\n “He did.” Aryeh nodded. “He gave me a fiver—said he’d got it from what he made off Old Bill’s broken tusk. I tried to turn him down, but he wouldn’t hear of it.”\n “They’re proud men, Yorkshire farmers,” I said.\n He nodded once more. “That they are. So I passed two pounds ten to Josh Doggett and kept the other half myself. Oh, and Wilf gave me—this.” He reached behind him and took something off a shelf. It was a carved ivory mammoth, no bigger than the last joint of my thumb. “His wife made it, he told me, from a bit he didn’t sell. Some women still weave, some knit. Kitty Latchett makes these little carvings—mostly from stone, but not this one.”\n “No, not this one,” I agreed, and held it close to my face to get a good look. “If you hadn’t told me, I might have believed it went all the way back to the Ice Age. Of course, this far north that never really quite ended.”\n “I doubt we’ve got better since, either,” Aryeh said. Since the second war had started only a week or two earlier, I couldn’t very well quarrel with him.\n You don’t see mammoths on farms any more, though a few wild ones still wander near the edges of the glaciers. The ice is drawing back more these days. People say the world is warming up. I’m glad I’ve lived when I have, and that I’ve been able to smooth things along a bit for beasts and men.\n Harry Turtledove is an escaped Byzantine historian. He writes alternate history, other science fiction, fantasy (often historically based), and. when people let him get away with it, historical fiction. He is perhaps best known for The Guns of the South; more recent books include Joe Steele, The House of Daniel, Through Darkes Europe, and a contemporary supernatural thriller, Alpha and Omega.\n He lives in Los Angeles with his wife, Broadway maven and fellow writer Laura Frankos. They have three daughters, two granddaughters, and three over-privileged cats. Anyone looking for his annoying opinions about writing and a great many other things can find him on Twitter @HNTurtledove."}