{"fingerprint": "+bm54BI1RoSlXJwXS8i/v9vS9KA=", "sitename": "Clarkesworld Magazine", "title": "Birdwatcher by Garth Upshaw", "author": "Garth Upshaw", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/upshaw_05_08/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Birdwatcher by Garth Upshaw", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "1560 words, short story\nBirdwatcher\nI was poisoning crows the day the aliens arrived. They’re smarter than you might think—crows, not aliens—and they don’t go for any of the easy stuff anymore. I had some good roadkill, two squirrels and a raccoon, but I couldn’t work up any enthusiasm for using it. The crows would caw and peck at the corpses as carefully as a dowager entering her bath. Nowadays, I had to mash D-Con into a virulent green powder, mix it with honey or peanut butter, and spread it on the underside of a flashy piece of metal. Crows love the sparkle and glitter, and they must know it’s bad, but they pick it up anyway.\nMy mom’s backyard stretches towards a narrow gully choked with blackberry and old-man’s beard. Right before the ground drops out from underneath you, a gnarled old walnut tree stands guard. The trunk’s as solid as a cement pillar, but covered with head-sized lumps that weep a yellow sap, trapping twigs, dead leaves, and insects in a sticky gruel. The branches are treacherous, thick as regular trees, and jut out at all angles like arthritic fingers. They break off with no warning, crushing the ferns and hosta underneath. The crows love the walnut tree, gathering like impudent black leaves, squawking and shouting in a raucous tumult.\nThat day, I watched from mid-yard, hidden behind a sheet of gray weathered plywood I’d cut a viewing slit in. A faded pink-and-green lawn umbrella cast an oval of welcome shade, but kept the air close and hot. Binoculars pressed against my sweaty face. I shifted in the folding chair, thighs constrained by the unyielding metal arm supports, and took a long swallow of tepid cherry Slurpee. The sun burned a hole in the sky like the business end of a welding torch, flashing off the pieces of Mom’s hand mirror I’d shattered and arranged on a low, wide stump.\nIt’s not worth doing a project unless you do it right, and I’d placed each piece with an aesthetic eye towards the whole effect. A landing area free of glass on the side of the stump away from me. Shards tilted different directions to send reflected sunlight 360 degrees. A central triangular piece propped so as to give a curious crow a chance for self-examination. The back of each deadly shard was slathered with my peanut butter concoction.\nA dozen big crows descended from the tree, cawing and gabbling. They pranced around the stump, hopping with wings half spread, cocking their heads at the bits of mirror. Their eyes drank in the light, black and shiny as a new coat of paint. An ant crawled up my right calf, and I reached down, slowly, slowly, and ground it against my leg.\nThe sky flashed orange and purple, like a years’ worth of sunsets had been dumped catywampus and stirred with a big stick. I looked up, surprised and mystified. Purple and orange. My high school colors. It was afternoon, four o’clock at the absolute latest.\n“Doyle? Doyle, are you outside?” Mom’s high voice cut through the backyard like a mosquito’s whine. “What was that flash of light? I know you’re there.” Crows flew back to the tree, their flapping wings sounding like half-hearted applause.\nI waited to answer, irritated that she’d violated my space. “I’m bird watching,” I finally yelled, twisting in my chair so I could see her. She stood at the sliding glass doors, bleached blond hair cut in an expensively retro style.\n“Doyle, could you come here?” Her fingers tugged at her bathrobe, pulling it tighter around her surgically enhanced figure. “Something’s gone terribly wrong with the power.” She cocked her head at the swirling colors still leaking from the sky. “What’s all that? Northern lights?”\nI sighed, levering myself out of my chair, and letting the binoculars swing free from around my neck. “Don’t be stupid. We’re too far south.” A wave of petulance swept over me. I trudged towards the stump. The afternoon was ruined.\nI drew a tarp over my project, knocking a shard out of alignment in spite of my care. I tucked the corners down, and made my way up the lawn to the house, feeling like I was wading through hot syrup. I stopped at the back patio, peeling my T-shirt away from my belly and flapping the cloth to get a slight cooling effect.\nA frown wrinkled the perfect skin of Mom’s forehead. “If you’d go on a diet, get some exercise, or maybe go out with a nice girl . . . ”\n“You said the power was down?”\n“How’d your interview go?” She flashed her white teeth at me. “For Mr. Perfect SAT scores, the job should be a breeze.”\nI turned, and pressing a finger to close one nostril, blew a viscous stream of yellow snot out my nose. Most of it landed on the wilted geraniums that fringed the patio, and I used my T-shirt to wipe the rest off the side of my face. “What do I need money for?”\nMom flinched and retreated inside. “Dad will be home soon, and I’ve been planning a pork roast.” Cool air poured from the house.\n“Roger loves his dead pig.”\n“He wants to be your friend.” Mom backed into the kitchen and took an invigorating swig from a tall glass. Ice rattled.\n“Who needs friends?” I followed her inside, leaving the door open behind me.\nMom pushed several buttons on the stove. “See? Nothing.”\nDétente, then. I flicked a light switch to no effect. “I’ll check the breakers.”\n“Thanks, dear. I knew I could count on you.” Mom kissed the air near my head.\nI rummaged through the utility drawer, found a flashlight, and checked the batteries. The breaker box was on the far side of the garage wall, an obstacle course I was loath to traverse in the dark. “Wait here.”\nThe hot, stale air of the garage sucked my remaining energy away. I played the yellow flashlight beam over the cobwebs on a jetski that blocked the breaker box, analyzing my path through the detritus of aborted recreational attempts to “bring our family together.”\nI’d just flipped the metal latch when a voice whispered in my ear. “Hello, Doyle.”\nI jumped, knocking a box of deck screws clattering across the cement floor. A clean-cut man of about forty, dressed in brown slacks and a purple and orange button-down shirt, stood beside me. I spluttered in surprise. “Who the fuck are you?”\n“We arrive today.” He nodded his head. Every hair stayed in place. “All at once. From far away. For everybody.” He smiled, teeth shining in the gloom like a row of mirrors.\n“How’d you get in?” I inched my hand closer to a plumber’s wrench.\n“We bring greetings, gifts for you.” He held out a glowing white egg, folding my hand around its warmth, and pressed the top with his thumb.\nI sucked in my breath. The garage had vanished. I stood on a beach, waves swishing in and swirling around my ankles. The cool water splashed to my knees. My arms felt firm and strong. A bright orange Frisbee sailed over my head and I jumped, catching it one-handed and flicking it back before I landed. My real father laughed and ran into the surf, diving into an oncoming wave after the flying disk.\n“See?” The man’s smile gleamed in the darkness. “You can choose anytime.” He let go of the egg, pressing its smooth heaviness into my hand, before stepping aside and walking away, growing smaller and smaller without ever leaving the garage until he winked out and was finally gone.\nI stumbled backwards, abandoning the breaker box. My heart beat so hard I thought my chest would burst. I pushed the door to the house open, brushing spider webs from my face with the hand that still held the egg.\nMy mother stood in the hallway, hair pressed flat on one side of her head. I looked away from her open bathrobe, not wanting to see more. She raised her arm. An egg, twin to mine, glowed at me from her hand. Tears leaked from her eyes. “Sorry, Doyle. I haven’t been the greatest mom.” She pressed the top of her egg and vanished.\nI sit in the lawn chair, hot air leaden and heavy on me. I try to suck more Slurpee through my straw, but I’ve reached bottom, and the rattling sound echoes in my ears. I can’t hear any cars, and the burnt blue sky is empty of con trails. I stroke the smooth outside of the egg in my lap, and then slip it into a pocket. A crow lands on the stump, cocking its black head sideways. Its feathers are mottled, mangy. I press the binoculars hard into my cheekbones, trying to recover the sense of excitement I used to feel watching the birds take my bait.\nI leap up, flailing my arms and knocking the plywood blind over. Crows scatter in a flapping black cloud, cawing their disapproval at me. I lurch to the stump and sweep the shards of glass onto the ground. The tip of one piece cuts my palm, and I bring my hand to my mouth. My blood tastes hot and salty. I hitch my shorts up and turn towards the gully, wondering if any blackberries are ripe.\nGarth lives in Portland, Oregon with his brilliant, gorgeous wife, Katrina, and his three super-genius children: Chris, Kami, and Luken. He's had jobs ranging from foundry drudge, bell packer, and tarantula minder to .com CEO, and has recently embarked on a guinea pig breeding project. Garth is an avid biker, refusing to remove his feet from the pedals even in the icy rain that mars the Mediterranean climate of the Pacific Northwest only six to nine months a year. This is his first sale to Clarkesworld Magazine."}