{"fingerprint": "EVlZPwxpf28xe/JJiULjYrqGjYE=", "sitename": "Clarkesworld Magazine", "title": "Radiant Metafiction: A Conversation with Catherynne M. Valente by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/valente_interview_2015/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Radiant Metafiction: A Conversation with Catherynne M. Valente by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Radiant Metafiction: A Conversation with Catherynne M. Valente\n Sometimes a short story can contain an entire solar system. Catherine M. Valente’s “The Radiant Car Thy Sparrows Drew” is one such story. Published in the August 2009 issue of Clarkesworld, it served as the spark for her latest novel.\n Radiance, out from Tor Books on October 20th, is a wildly ambitious novel that not only encompasses an inhabited alternate history solar system, but the relationship between a daughter and father. Told through bookending bits of metafiction, the story of Severin Unck, a documentarian and the daughter of the famed filmmaker Percival Unck, sets readers orbiting around the complexities of this unique solar system and family. There are callowhales swimming the seas of Venus, a Pluto with nutritious night-blooming lilies, a moon where silent silver screen dreams are created, and a mysterious disappearance.\n Catherynne M. Valente is the New York Times bestselling author of over a dozen works of fiction and poetry. She is the winner of the Andre Norton, Tiptree, Mythopoeic, Rhysling, Lamda, Locus, and Hugo awards in addition to being a finalist for the Nebula and World Fantasy Awards.\n Radiance is constructed of layers and layers of gossip column press snippets, audio transcripts, interviews, and more. What made you switch up styles on a chapter-by-chapter basis?\n Radiance is such a big story. I knew it from the moment I put the period on the first paragraph of the original short story, “The Radiant Car Thy Sparrows Drew.” It’s massive in terms of worldbuilding, scope, the cast of characters, the stakes. It’s probably the most ambitious thing I’ve ever written.\n And it took me years to figure out how to tell that story. In many ways, I had to become a better writer in order to take it from a piece of short fiction to a novel. I had to give myself permission to do certain things, use certain tricks—like including scripts, audio, shifting POV, and the other ephemera and metafictional elements you mention. It’s pretty much a postmodern free-for-all. At first I kept thinking: I can’t just describe what’s onscreen in a movie inside the book. That just makes it look like I’d rather be making a movie. I had to get to a point where I could say: I actually can do that because it’s my book and that’s the right way to do it.\n Though I will say, I didn’t really switch up every chapter. Each part of the book is strongly structured, alternating the four main narrative throughlines—Severin Unck, the disappeared filmmaker, Anchises St. John, the boy she rescued grown to a bitter man, Mary Pellam, the young ingenue, and Erasmo St. John, Unck’s lover and director of photography—with sections of ephemera, one for one. There is a pattern, I swear! The parts of the book are all symmetrically structured.\n Radiance is a novel in large part about the magical act of seeing and hearing. About who gets to see and hear and speak. About the stories we tell ourselves about ourselves in order to become who we want to be, in order to heal grief, in order to connect with others. There was no way it could ever have just one protagonist’s voice. And given that the world is an alternate history—but not just an alternate history, a decopunk alternate history—but not just a decopunk alternate history, a decopunk alternate history involving a pulp SF style inhabitable solar system, I had a lot of information to convey just to establish the status quo. In the real world, we know a culture by its output; by its theater and its gossip, what its young people long for, what its aristocracy defends. What better way to communicate all that than by simply listening in?\n So we get the most popular radio drama broadcast through the Solar System, we get the gossip hounds (it’s hard to express the power they had in old Hollywood when most now treat them as a joke) hunting down rumors of murder and secret homosexuality and studio malfeasance, the diary of an actress coming to the Moon for the first time, the advertisements made to encourage Americans to settle Pluto. And throughout, the shifting, changing film Percival Unck keeps trying to make about his daughter’s disappearance, flitting through genres and styles, desperate for one that will make the story make sense. And all these together create the voice of a culture on the brink of change, many perspectives, many voices, as though we’re listening to everything come through the transom on some Neptunian outpost.\n What films inspired or influenced Radiance\n Oh, goodness. A Trip to the Moon and Metropolis, obviously, influenced the aesthetic enormously. Un Chien Andalou, the 1925 Phantom of the Opera, The Cabinet of Dr. Caligari, The Lodger, the Fairbanks Robin Hood, early animation like Snow White . . . and then as the novel moves through other genres, noir, gothic, children’s fantasy, detective films, movies like The Maltese Falcon, Touch of Evil, Murder on the Orient Express, Rebecca, The House of Usher, Fantasia. Tristram Shandy: A Cock and Bull Story. Several of the found footage horror films of recent years like The Blair Witch Project, Paranormal Activity, and Cloverfield. There’s even a bit of Who Framed Roger Rabbit? hiding in there.\n I suppose the shorter answer would be: all of them?\n What drew you to black and white era of filmmaking?\n There is something uniquely beautiful about black and white film. It glows away imperfections, its light is otherworldly and strange, and it still communicates a kind of cultural authority to us. Black and white is serious art. Black and white means business. And yet it took such a wild circus of techniques to pull off—the bit about Virago Studios painting everyone black and white is drawn from real life. Color shows strangely on black and white film sometimes, and George Méliès, ever the perfectionist, had everyone on his lot painted so what he saw would be what the finished film would show. Shooting in black and white was very difficult and still is if you’re not just using an Instagram filter. But it looks instantly like Art to us.\n Plus, I was really angry at Thomas Edison.\n At this point, I think most people are well aware that Edison was a terrible human being. Though we tend to focus on Tesla and electricity, his underhandedness stretched far further. He really was a proper supervillain, in a way. I was reading a book about old Hollywood, and the men who founded the first four major studios, and became interested in why Hollywood itself had become the center of filmmaking, when it was so far from New York, the cultural and financial center of America.\n It turns out, the answer is: California was just far away enough that Edison couldn’t do whatever he wanted. He really did own all the patents on color film and sound and video recording, and really did pursue them viciously. Ultimately, filmmakers had to run away to even make and show a film without paying Edison enormous sums of money. I found the idea of what might have happened had that situation persisted, despite such runnings away, fascinating. After all, patents today are used to crush new companies and industries. It’s not much of a stretch at all. Of course, corporate studios could always pay the price, but that would mean only schlocky blockbusters would have sound. “Real art” would slowly become silent, and then the studios might chase that authenticity, and give up sound to get the shine of the artiste.\n Combine all this with an issue I’ve always been interested in: the idea of what a science fictional or fantasy world produces as art. What is speculative fiction to that world? What is realism? And you have Radiance. Silent films and wild planets.\n What was it like growing up as the daughter of a filmmaker? How did it influence the story?\n The very first seed of the story was an interview with Mark Z. Danielewski in which he talked about what a profound influence his father, a cinematographer, had been on him as a writer. And I thought: Huh. My father was a director and I’ve never written about that at all.\n My mother was, too, actually. They met at UCLA and at one point my father was pursuing film directing while my mother directed theater. Some of my earliest memories are of my mother wearing black all the time and going to something called “rehearsal,” which just sounded like another planet to me.\n Ultimately, my dad went into advertising and my mom became a political science professor, but my father absolutely gave my siblings and I childhoods steeped in movies like developing chemicals. Our home movies were all beautifully shot and directed. We all know how to find the camera. In the 80s, life wasn’t as constantly recorded as it is now. But we have all been filmed since birth, more or less. We speak to each other in movie quotes—common now, but not so much when we were kids. Movies are the lifeblood of my family.\n Radiance is a story about a father and a daughter and the cameras between them. It’s not the story of my father and I, but it draws much from the experience of being raised by someone who could look at life as a scene, reshoot the occasional heartwarming moment, and talk to his kid about structure while she ate Frosted Flakes.\n What were some of the challenges of expanding the original Clarkesworld story into a full novel?\n One of the biggest was the ending. You can be coy about an ending in short fiction. You can be coy in a novel, but it tends to piss people off a little. Hell, it pisses me off unless it’s done absolutely perfectly. I didn’t want to pull a LOST and not provide answers. So I had to decide what happened to Severin. But the ambiguity of her was part of what I loved about the story, so it was very hard for me to come down firmly, in a solid science fictional not hand-wavy way, on the central question of the book.\n This was also the first time I ever pulled out the old trick of getting down the structure on index cards and putting them up on my wall to keep it all straight. Radiance seems complex on the surface, but it’s really a fancied-up thriller, and getting myself in that mindset, rather than in the long, elegant strokes of a short story, was quite tough.\n But it was never hard to fill the space. Radiance was always squeezed into that short story. Making it into a 450-page novel was mostly a matter of giving everything room to breathe.\n Why did you change the name of Bysshe in the short story to Severin in the novel?\n *laughs* Well, I suppose this is a little embarrassing. Initially, my idea for the aesthetic of the short story was more “romantic poet” than art-deco. So Percival’s daughter was Bysshe, after Percy Bysshe Shelley.\n But I did a couple of readings of the story, and once I started writing the novel and reading bits aloud (something I think all writers should do), I noticed I was wincing when I said her name. Because it doesn’t sound as nice as it looks on paper? It sounds soft and flaccid and like it’s sort of apologizing for being said. That’s not Severin at all. And also sounds a little like you’re saying “bitch” with a lisp?\n So I figured, if you wince saying the protagonist’s name, that can’t be good, because girl, you are gonna have to say that name a lot. So I chose Severin because it, too, is a traditionally masculine name, and it shares a root with severe. Plus, I can say it without wincing.\n With its complex narrative style, do you think Radiance could become a film? If so, who would you like to play Severin?\n I do! I think an enterprising screenwriter would have to pare it down to a more core concept (or else make it a television series) but I think the story of a filmmaker disappearing on a Venus infested with giant whale-aliens would make a lovely movie, with the silent film aesthetic but without the silence. It’s a book about movies, after all. Half the novel is scripts!\n I think Jessica Brown Findlay or Tuppence Middleton would make a fantastic Severin. If they’re busy, there’s an Australian actress named Becky Lou Church who would be utterly perfect. Maybe Chiwetel Ejiofor or Adewale Akinnuoye-Agbaje for Erasmo, Carey Mulligan for young Mary Pellam, Emma Thompson for older Mary, Colin Firth or Bill Nighy for Percival? I think Iwan Rheon would be a great Anchises. I CAN DO THIS ALL DAY.\n Is an author a director, an actor, a screenwriter, or a bit of all three?\n All of the above! Plus lighting designer, special effects supervisor, set builder, cinematographer, all the actors, film editor, craft services, stuntman, and probably best boy since hardly anyone knows what that is. (It’s like a manager for the lighting or grip department.)\n All of the planets in the solar system you’ve created are utterly unique and beautiful. What inspired them?\n Well, the watery Venus came straight from Zelazny, most directly The Doors of His Face, the Lamps of His Mouth. But a lot of authors in the pulp era fancied Venus a waterworld, and it was wanting to recreate that pulp idea with a 2015 literary sensibility that fueled Venus.\n The others, in a strange way, came from genre. I thought about what genres the different planets made me think of: Mars, obviously a Western. With all that dust, it would be a perfect place for ranches and cowboys and boom-bust towns. Pluto is clearly a hothouse gothic world. Uranus felt so noir in my head—the cold, the distance, the dark, neon lights reflecting in the ice. Neptune is associated with water, of course, but I loved the idea of massive cities moving like ships over the oceans. Jupiter’s gravity seemed a perfect match for a kind of Grand Central Station, so I left it a gas giant, unlike the others, where I wanted people to be able to plant their feet. (For all the fantastic unreal elements, there is actually quite a bit of carefully thought-through science in Radiance, I promise!)\n And the Moon has been the great spotlight in the sky for millions of years. Where else would you put the movies?\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}