{"fingerprint": "S5o7E0U97anmTY/+VHEnnI5o2W4=", "sitename": "Clarkesworld Magazine", "title": "Intro to Prom by Genevieve Valentine", "author": "Genevieve Valentine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/valentine_10_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Intro to Prom by Genevieve Valentine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10780 words, novelette\n Intro to Prom\n 1. Marine Biology\n Jack had promised to pick her up for fishgazing, but he’s late, and by the time he comes out of his house she’s forgotten her promise and started counting the windows.\n “Celandine,” he says, quietly. Disappointed. He can always tell when she’s been counting; they’ve had time to get used to each other.\n She makes herself look at him. She smiles, smooths her hands down her skirt, swings a leg over her bike. (One hundred seventy-two dark windows—she hadn’t gotten to the end of the last row, and it feels like leaving something undone, like a door’s still open or water’s boiling.) She pedals until her legs are shaking. Behind them, dark windows. Ahead of them, the sky.\n They make good time even with the detour around Willow Square, and the fish are still feeding when they get to the hill. They leave their bikes on low ground—Mara and Robbie never come this close, it’s fine—and walk on foot up the path they’ve worn into the grass.\n Dead birds are everywhere underfoot (they kept trying to escape), and it takes a while to reach the top of the hill without stepping on the bones. Back in town, the strings of streetlights are glowing yellow; she can see her bedroom, if she turns around.\n “Don’t look back,” Jack says. The hill’s steep, and he’s out of breath, and he sounds more frightened than he is.\n “Coward,” she says anyway, just so he’ll frown at her. She likes when he’s angry. Makes her feel better.\n At the top of the hill they lie back in the grass. It’s brittle after so long without water—even the insects won’t live in it now—and it scrapes her calves, the backs of her arms, the palms of her hands when she sinks her fingers into the dirt and grips as hard as she can.\n Above them, the fish swarm in darts of blue and gold and black. It’s day; they glint, sometimes. Sometimes, the long thin shadow of an eel slides across the sky.\n She’d thought the crack in the sky was an eel, the first time she saw it.\n “Just pretend it is,” Jack had told her. “Close your eyes and count to ten and try.”\n He’d been looking at her like he wanted to kiss her. “It helps,” he’d said. Jack’s a fucking idiot.\n The fish move above them, never touching.\n “It’s bigger,” she says after a while.\n After a while he says, “Yeah.”\n It’s a lie, but she keeps looking up, hoping.\n When it’s too dark to see anything, they go back down the hill toward the grid of lamps in Venture, through the wide dark avenue that splits the West Side from the East; their bikes are the only noise, all the way home.\n For prom, Jack used the car. It was only for special occasions (gas was tough to come by), but prom counted.\n Celandine had found a skirt that swished at her calves. Her hair was pinned up on one side; she’d put on lip gloss. Her shoes slid off her feet if she wasn’t careful, but they were in Venture. Where was there to run?\n Jack wore what he always wore, but when he smiled and opened the car door for her it made him seem more polished, somehow. Special.\n The gym was strung with lights, and music trembled under their feet as they got closer. (Loud music scared the insects.) Jack reached for her, pulled back at the last second.\n Mara and Robbie had already arrived, and were dancing so hard the floor was creaking. Mara, who never bothered to dress up, had a necklace made of safety pins and didn’t even seem to notice they’d gotten tangled in her hair. Robbie’s white button-down was soaked through. How early had they come? How long had there been music playing that Celandine hadn’t heard?\n Didn’t matter now. She and Jack took up a position not too far away—you had to leave a little space at the beginning of the night, or it looked like you were trying too hard—and joined in.\n And it was so good, in the gym with the dim strings of lights and the bass vibrating in her eardrums; the heavy swing of her body and the impact of her heels on the ground and the thin cold relief of air with every breath. She pretended there were other people. She pretended she’d never heard this music before. She danced until her shoulders ached.\n Once or twice at the beginning they’d tried something else—Robbie stole Jack’s bike and everyone took sides and schemed, all four of them met at the diner and tried to have a meal—but it was too much, on top of everything. Only prom worked.\n Eventually, inevitably, there was a slow dance. Robbie looked at her so long it became obvious; then he came over and held out his hand.\n Jack stepped back (you never fought the prom selection, that was against the rules). Celandine put her arms around Robbie’s shoulders, and Robbie put his hands on her waist, and the song floated around the gym as they swayed back and forth. Behind them Jack and Mara conferred in low voices.\n “How could you,” Mara snapped during the next song, storming up to them, and Celandine perked up. She liked the dramatic ones, and only Mara really knew how to do them.\n This felt like the end of the second season of MEMORIAL, KANSAS—the way Mara was standing, the mood of the song—but it was hard to tell from just the opening. Celandine tried to remember if Mara and Robbie could have seen it.\n “Mara, come on, don’t make a scene,” Robbie said like he was reading off a card. His hands were tight on her hips; he was looking at Mara.\n “Well, you could avoid a scene if you could keep your hands to yourself instead of ditching me on prom night. Has this been going on all year?”\n “Of course not!” Celandine said. This wasn’t MEMORIAL, KANSAS after all, and the surprise made her sound patently false, which was too bad. The dramatic ones were important to get right.\n Robbie gasped, even more unconvincing. “Mara, please—”\n “Did you know she was coming tonight? Were you planning all along to leave me for some bitch from the East Side?”\n Celandine bit back a grin. She had no idea where this was going.\n Behind them, Jack said, “Hey, that’s my friend you’re talking about.”\n “And you’re a coward too,” Mara said, too sharp suddenly, spinning to face him with an accusing finger already pointed. “This is what happens when you lie about your feelings and hide behind bullshit for years.”\n Jack looked like he was searching for an answer, and Celandine rolled her eyes. Mara was good at being angry, but she always lost the thread halfway through and it stopped being fun.\n “Mara, please don’t say such things,” she said, solemn. Someone was going to save this prom. “We didn’t mean for this to happen. The heart wants what the heart wants.”\n Mara’s eyes glinted. “My heart wants you dead in a ditch. Should I do something about that?”\n It felt like a punch.\n “Yes,” Celandine breathed.\n But no one was ever serious when she wanted them to be. Mara was shaking her head; Robbie’s hands were too tight; she couldn’t see Jack, but she knew how he looked whenever she brought it up. She didn’t know what to do now. The song was ending.\n “Let’s get out of here,” Robbie said finally. “It’s a beautiful night.”\n Another slow song was playing—it was only slow songs, by this hour—and Robbie slid an arm around her waist as they walked out into the cool darkness.\n Jack and Mara watched them go. Usually there was some idea of how things were going to go after prom, some arc everyone had agreed on, and Celandine wondered what they’d end up doing, suddenly left to themselves. Arguing, or raiding stores, or having sex in the car, or being gloomy. They both liked all those things.\n She didn’t really like anything anymore. Arguing, sometimes, but Jack didn’t like fighting with her and Mara was too good at it.\n “You’re a fool to ever leave her,” she said.\n Things like that sounded better on prom night. Other nights talking felt like dumping salt in her mouth, but prom night was always important, and everything she said pinned her to the moment, to the sound of beetles crunching under her shoes.\n “I’m a fool to believe she’d have me,” Robbie said.\n “So I’m just a sub for the woman you really love?”\n “No,” he said. He was terrible at this. “How could anyone not want you, on a night like this?”\n All the romantic shit he ever said was conditional, like he was afraid she’d catch feelings otherwise. She tried not to be offended, but they’d had enough proms by now. She’d never had a feeling yet. Honestly, he should know better.\n She smiled, felt the slime of her gloss as her mouth slid away from her teeth. “Want to go look at the fish?”\n He looked away. “You’re an asshole,” he said. He didn’t let go of her waist.\n They walked the long way around Willow Square and split freeze-dried ice cream, the MADE-FINE FUN TIME DINER neon sign reflecting in the package. Then they made out next to the old research complex, because the birds were still afraid of the noise it used to make when it was running, so there were no bones.\n “We could go somewhere if you wanted to have sex,” Robbie’d offered once, and she’d considered it—he was handsome and she was going to die, she might as well—but she preferred them here, in the dark and a little afraid.\n Usually Jack picked her up in the car after, but Mara must have really stung him, because long after she was tired of making out with Robbie nobody had shown.\n Finally they gave up. Robbie stepped away—“You’ll be all right?” and she nodded, because what else was she going to do—and turned back to the West Side, head down. He’d never looked at the crack in the sky, after that first time. She wished she didn’t want so badly to make him look.\n Celandine stayed there a while, listening to the hum of the generator that was still on in the research complex, wondering what it was powering. It must be important; they’d kept it on when they left.\n She walked home the long way, slowly, mindful of her shoes.\n None of them crossed Willow Square. That’s where the body was.\n 2. Civics\n A few days before prom, Jack and Celandine meet Mara and Robbie outside the Made-Fine General Store, all the bird skeletons swept into a single pile out of the way, and draw lots. It’s Robbie’s turn.\n “Okay, so I’m taking . . . ” he pulls slips of paper out of the shoebox, “Celandine over, and I’ll leave with . . . Jack.”\n Everyone nods, to seal the deal, and steps over the broken glass to shop.\n (There are no limits to prom. You can shop in the General Store. You can break into empty houses. You can go to the fancy boutique in Willow Square, though none of them ever have. It’s prom; prom is for the living.)\n On prom night, he waits by the neutral strip in the middle of town, on the hood of his car so the bugs don’t run over his boots, and looks at the ice cream shop just to have something to long for.\n He grins as she rounds the corner. He likes Mara a lot, when he likes Mara.\n Mara doesn’t put much effort into prom, but her jacket suits her. Celandine had dressed her, once—a filmy dress someone inexplicably brought to Venture, and it had looked like Mara was emerging from the wreckage of a ship.\n He’d fingered her after, because she asked and he had no reason not to get to second base with somebody, and he’d appreciated the way the fabric slipped away under his hand, but it wasn’t like Mara had enjoyed it more than usual because she was in a dress. She gave it back to Celandine. He’s afraid of the day Celandine will wear it, because he’ll probably feel very different. He feels different about anything, when it’s Celandine.\n Mara’s jacket is military gray, with MADE-FINE SECURITY FORCES patches. She shoves up the sleeves, always, until the music’s really going and they’re flapping over the tops of her fingers like puppets she’s shaking to death.\n She frowns. “What are you going to do when that shirt falls apart?”\n “The guy had two more, I should be fine.”\n Then he braces. She never believes him when he says he didn’t know someone, when she asks about a storefront or a suit jacket and he shrugs. She thinks everyone else in Venture got together all the time for picnics, and the things he and Celandine use must have special significance because of who they came from.\n But she’s quiet now; maybe she wants an easy night.\n (And he didn’t know everyone in Venture. He didn’t even know everyone at the high school. If he had, he’d have noticed Mara and Robbie were missing.)\n Mara doesn’t like being inside the restaurants, so they sit on the hood of the car and eat frozen berries from a bag before they head to the gym.\n They’re the first ones; the lights are on and the music’s going, and they take up their stations and dance.\n Jack doesn’t feel like he inhabits his body much anymore. Sex did that at first, but the novelty’s gone. Drugs did, for a while—he went through whatever the clinic left behind, and there are a few months he doesn’t remember. Detoxing had definitely made him feel like he inhabited his body, but in a way he never wants to think about again.\n Dancing works, sometimes, if it’s the right song and all four of them land a beat at the same time so that the floor of the gym shakes. Dancing is supposed to be what works. He tries.\n Tonight he and Mara are in love; Celandine and Robbie are the friends who’ve been dying for this to happen, who get to hoot and make gagging noises as he and Mara slow dance. (“Like the Hollywood Hills party in TEEN SENSATION CLARA CLARK,” Celandine explained. Jack had nodded. Robbie and Mara had exchanged a blank look, but the library had both seasons in hard copy, so it was fine.)\n It’s good to change the story sometimes. They’ll all go home friends, happy and young. He’s looking forward to it.\n Robbie rushes them when he and Celandine get there, hugs them so close it hurts. “You fucking did it,” he crows over the bass line, “you did it, I’m so proud of you, man!”\n “Hey, I asked him, you be proud of ME,” shouts Mara, and Jack and Robbie both laugh. A little apart, Celandine’s slipping off her shoes. Her dark hair’s braided back; he can see the line of her jaw.\n “You kids be good,” Robbie calls as he heads back to Celandine, “we have a bet going about how soon you’ll get engaged, don’t mess this up.”\n “You know I’ll win,” Celandine smiles, a click more subdued than she should be. She’s looking right at him.\n Celandine always looks at him, on prom night; it pins him into his body, just for a second, every time.\n (“You’re fucked, then,” Mara said when he told her, and he’d shrugged and looked up at the crack in the sky.)\n Jack had never said a word to Celandine before the company showed up to take her out of class.\n Celandine had never put a toe out of line, either. (Jack was already drinking by the time his mom brought them to Venture to give him stability.) When the Made-Fine Security Corps came for her, she marked her place in her textbook and drew a line under her notes before she stood up and went with them.\n Mr. Smith hadn’t said anything to stop them; he never even asked what she’d done. He’d turned to the projector and pointed at stages in the life cycle of coral. And Jack had sat through it.\n Later it seemed like a nightmare that he couldn’t think what to do except return to a sentence half-written, the diagram with blank ID labels that had to be filled so he could study. But he wasn’t in a position to do anything, and it was easy not to ask; it was easy to be hopeless and to label fish with their names.\n (Later, after it was too late, he assembled the news: Made-Fine was on trial for illegal waste dumping, had poisoned the ocean. And Venture—their bubble-city PR move, on an island, out from under American interference—wasn’t a “prototype sustainable township” for marine research. This wasn’t a test of the Made-Fine Transparadome protecting cities from rising water, or experiments restoring marine life. They were growing algae mats, to cast doubts on why the fish had really died. Algae is an act of God; God’s allowed to kill anything.\n Celandine’s father and his mother and every adult in this bubble town had agreed to be here because a company asked, so they could make algae and cast doubt. And Celandine found out, and she had told everyone.)\n At some point, his mother came home. He couldn’t bring himself to ask any questions. It felt like giving dignity to it, to ask why, like it was a thing that could have a reason. He locked himself in his room.\n A few years before Venture, his mom had taken him to an old-fashioned amusement park, and he’d ridden one of the roller-coasters (had lied about his height to get on). The opening gate they chugged through was shaped like the head of a wolf, because of some backstory he’d been too scared to listen to. He only remembered sitting at the top of the first drop, the sudden horrible understanding of how helpless he was against a machine with a will.\n He waited for everyone to get penned in and shot. Surely there was an uproar on the mainland. Surely there was so much anger at the company—so much trouble coming for the guilty—that they’d have to kill everyone in Venture to keep the secret.\n But the Made-Fine Security Forces never came. The government never came. No one even punished Celandine’s dad for bringing classified documents home. When reporters called in for comment, Made-Fine Security took Celandine out of house arrest to the video feed in City Hall; during school, so no one would see. (He didn’t know until later.)\n He kept taking notes about fish names. Everyone’s parents kept making algae mats. Week by week, the tide came in and never went out.\n Finally, when the water was waist-high outside the dome and Made-Fine realized there was no point in a drowned city, they sent duck trucks and a company boat to evacuate them. Made-Fine employees scrambled onto the passenger loaders with half-packed suitcases, rushing to get aboard before Made-Fine sealed Venture shut and let the ocean take it back. You got a seat if you signed an NDA.\n Almost everyone went. His mother went, packing up with her team into a truck with classified research in it; she looked over the crowd to make sure he was near a truck and holding a suitcase, and waved before she ducked inside.\n He signed the NDA. He told the other kids in the truck they were fucking losers and he was going to ride with his mom. He told the soldier standing guard that Mr. Smith had asked him to help burn some things and he’d be going with the teachers later. Nobody stopped him as he moved past the clusters of trucks in the airlock queue.\n It was chaos, but it didn’t feel like it should have. It should have felt like a fight. They were being taken somewhere at the mercy of Made-Fine, and everyone was signing an agreement and getting in, because it was that or drown. A few people were screaming, horribly. They got sedated by medics and put into a separate truck. At the time he hadn’t understood it.\n You could hear the airlock from almost anywhere in Venture; it shook the sky as it sealed and unsealed. He locked the door to his room and turned up music as loud as he could. His courage would fail him if he heard them sealing him in. He needed to wait until there was nothing to be done.\n (They never even powered down the grid. Things are starting to fail, and eventually it will just be the dark, but the company didn’t even care enough to turn off the lights. Whatever Venture cost them, the company could afford.)\n He thought he’d stayed behind alone—brave, somehow—until he saw Celandine under the trees near the Square.\n She’d cut her hair. Her eyes were rimmed red, and her hands were shaking; she was spoiling for a fight.\n “Are you fucking serious,” she’d said when she saw him, like he’d masterminded the whole thing, like Made-Fine had been sending him credits on the sly for all the good work he’d been doing covering their tracks.\n But it was only anger with nowhere to go. He understood. She’d wanted to die alone; now it would be harder. He thought he’d wanted that, too.\n “I didn’t know,” he’d said, and she hit him.\n He’d cataloged the bruises, after, as he was measuring out the first few rows of painkillers. A ladder along his ribs, deeper where he’d tried to twist away from her wide swings and she’d switched to uppercuts instead. One of them had just missed his kidneys, the bruise a strange green spiral across his stomach that lingered longer than any of the others. (That’s the one where she broke two fingers.) One to his right eye that swelled it shut for a week. One open-handed crack right across the jaw.\n That was when she screamed; the broken fingers.\n The day after the fight, he’d come to her house and helped her patch them up. Too late to pretend they weren’t in it together.\n Nothing’s felt like that since. Not good—it was the most pain he’d ever been in—but still it hadn’t felt like an attack. It felt more real than any promise an adult had ever given him. It felt like something they were agreeing on. Everything was broken, and now so were they.\n His mother had said the algae was going to be important for nutrition. The fish that were gone were gone; it could do them no harm now. She hollowed as she spoke, empty and fragile and wrong. The lie inhabited so much of her that once it was out, nothing was left.\n Not Celandine. She looked like she’d eaten the sun. He’s never believed anything so much in his life as he believed Celandine when she was hitting him.\n As he bandaged her fingers that second day, she’d asked him, “Would you have stayed if you knew I was here?”\n “I hope this heals right,” he’d said.\n He’s thought about it since. He’s had plenty of time. But there’s no urgency to answer; it’s too late, and she’s a machine with a will.\n 3. Sports Medicine\n Robbie sleeps in the pressure suit.\n At first it was just practical—by the time he and Mara were free, there was the crack in the dome, and they all assumed it would all be over any day. The pressure suits were from Celandine and Jack, from emergency kits in City Hall, and every night he slid it on and slept half-sitting on the couch in his old apartment, listening for the sound of running water.\n Now it seems stupid. The suit’s clammy, and every morning he wakes up right where he is, exactly the same. That hasn’t stopped him doing it—it’s a habit that makes too much sense to break. But he knows not to tell Mara. She’d even gotten itchy about him praying, because if you got to rely on something then Birch had something to take away. Outdoor time. Your parents. Your holy book.\n (She keeps her suit wadded up in her bedroom closet, the helmet on the bathroom counter, like it will prove how little she cares.)\n In the morning after he’s taken a shower with water that smells like algae, he checks the calendar—it’s nearly prom—and looks outside.\n “Something’s moving in Willow Square.”\n “Fuck you,” says Mara, around a mouthful of peanut butter.\n “I’m serious,” he says, watching a shadow a long way away. It could be anything.\n “Well, it’s not him. Celandine probably caved and went shopping.”\n He knows it’s a lie; he knows she knows. He makes a cup of instant coffee (it also tastes like algae) and forces himself to drink the whole thing slowly before he checks outside again. Nothing’s moving, now. Maybe he imagined it.\n “Snap out of it before we meet them,” Mara says as she gets up, but it’s not unkind. She even rests a hand on the back of his head a second, fingertips pressing a little against his skull like she can hold his fears in.\n She’s right. There’s nothing left in Willow Square to cast a shadow. Still, he looks out the window until they leave for neutral ground.\n Officer Birch jumped from the clock tower of City Hall when he realized Made-Fine was never coming back for him like they promised, and he’d been keeping Mara and Robbie locked up for nothing.\n (Loitering, technically, and then vandalism when Birch yanked Mara’s arm and she banged into the railing. They were the only people ever put in Made-Fine’s Rehabilitation Center. Turned out the operations team had threatened to go public with poor work conditions in the dome. Only four people on the team had kids. Things got quiet after they were in company custody.)\n Birch never mentioned the evacuation. He said their visitation rights had been curtailed for mouthing off. When they didn’t see any other staff, he said there were layoffs. Robbie still doesn’t know what actually happened, that Birch cracked and told them and opened the door.\n (For a while he thought the company must have had something on Birch until his mom died or something, and then he caved. But that would mean Made-Fine was still telling him anything, and Robbie doesn’t think so. That day was just Birch’s limit. He hasn’t decided what of.)\n The thing Robbie hates most about it is that after all that shit, he and Mara still had to walk outside with Birch like they’d been through something together instead of Birch happening to them every day for years.\n And then outside, they actually had. They’d all stared together at the empty windows and the dead squirrels and the thousand roaches and the birds flying desperate circles, like they were a unit and not a man who had condemned two kids to die. When Celandine and Jack first saw them, they’d seen them all together. Robbie will never get that back. He’ll never be totally free, so long as either of them remembers Birch.\n (He used to think things like that sounded dramatic. Now he kind of needs them, just to keep track of time.)\n Mara must have been thinking the same thing—she and Robbie bolted over just to get the fuck away from Officer Birch. And Celandine and Jack had looked like monsters, like people cut into the wrong film footage; he can’t imagine now how scared he must have been, to run toward two strangers who were so obviously not right.\n “The comms,” Celandine said. Jack was already pedaling toward City Hall.\n Jack’s the first person Robbie ever fell in love with, because of the way he raced up the stairs of City Hall trying to save them.\n Birch was looking at Celandine like she must have murdered everyone in town herself.\n “I’m a Registered Corrections Officer of Made-Fine Security Services,” he said, chest straightening like the company name made him bulletproof. “What’s going on here?”\n “The company left you to die,” Celandine said.\n (Mara has never forgiven Celandine. Robbie doesn’t actually trust Celandine much—they make out and whatever, but he’s also been to the compost pit to see if there were bodies. That silence between Birch’s question and her answer was the most he’s ever liked her, because at least she could tell when someone was a piece of shit.)\n Birch lost it—he screamed at her to do something, and when she didn’t answer right away he drew his stun gun like he could electrocute her into making the company come back.\n “Look at the sky,” Celandine said. Not like a dare; like she was compelling him to do it. Like she was a ghost who’d been waiting for him.\n Birch must have been thinking the same thing. Still, he looked. He made a weird gurgling noise.\n Robbie didn’t move. Whatever it was, Birch didn’t deserve to have Robbie experience it with him.\n (He and Mara looked later, when they were alone. Mara cried so hard she choked and then made him promise not to tell anyone. “I won’t,” he said, like there was an Anyone.)\n When Birch ran toward City Hall they all followed him, to see what the comms had brought up and to keep him from stun-gunning Jack.\n Jack was cycling through channels, alerting for survivors in need of pickup. (“Not previously known survivors,” he kept saying, and Robbie’s stomach sank.) It was static on the other end of the comms the first time he cycled through. The second time it was silence.\n After a few hours, Celandine said, “Do you think the water’s too deep, now, anyway?”\n Robbie felt the blood draining out of his fingertips.\n “We don’t know if there’s anyone left,” Jack said later, outside. They were eating. Birch had staggered off somewhere; no one had gone looking for him.\n “Like, they’re all dead?” Mara asked, between bites of candy bar. (They ate candy the first few days; rations but also a party.) She sounded angry they might have died, but Robbie suspected she was just angry that she’d missed it.\n “The flood never stopped. They kept saying the water table would drop, but.” Jack gestured at the dome over their heads; in what was apparently the midday sun, the light around them was a murky blue.\n “It’s too late now,” Celandine said.\n Robbie didn’t look up.\n He still hadn’t looked up, the day Birch jumped from the clock tower in City Hall. The whole town was so quiet Robbie could hear two hundred bones breaking at once from where he was sitting in the kitchen eating canned peas.\n Robbie and Mara had already claimed the West Side in a way that feels, now, like Mara and Celandine had decided it was something they’d need. After the noise they converged on Willow Square.\n It looked like someone had made a doll of Officer Birch and stuffed it with pudding, and there was no blood, which made it worse, somehow. If there was blood everywhere then he would definitely be dead and there would be nothing anyone could do about it, but having him still whole suggested he might still be alive, and someone had to go check on him—maybe even help him.\n Celandine and Jack looked at each other. Celandine called out, without really looking over, “You guys stay where you are.”\n Robbie, who would not have checked on Officer Birch if they’d found him on fire, stayed the fuck where he was.\n Jack stepped forward. Carefully, like noise would split the body open. “Are we going to . . . bury him? A funeral?”\n “No,” Mara said.\n Jack looked at her. “So where would he go?”\n “Compost heap.” She licked her teeth like she was getting rid of something. Then she left.\n Robbie wanted to go with her, desperately, but he couldn’t move. He was still trying to piece together the sound he’d heard with the body in front of him. One of the legs (shorter now, too short) was starting to deflate.\n After a while he said, “I hope he felt it.”\n Celandine looked at him. Then she seemed to accept something—he didn’t think she really understood anything, just accepted things—and went home.\n Jack looked uncomfortably between the body and Celandine, the body and Robbie, like he genuinely wanted to make sure honors were done to the dead.\n He cared so much about things, for such a long time; it’s why Robbie loved him as long as he did. What else was there to do, when you were waiting to die, but love something and try to hold on?\n They never went back to City Hall. The candy wrappers are still sitting there, as far as he knows.\n Celandine draws for prom. She’ll show up with Jack, leave with Mara.\n It will be an early night—Celandine and Mara never last long—but otherwise it’s a good lineup. He’d just as soon avoid Celandine. (She always wants to look at the crack in the dome. He doesn’t mind kissing her, but if he thinks about it too long it’s like kissing someone who’s already dead.)\n He looks at Mara. “You gonna shop?”\n “I want the shirt you wore a few times back,” she says, and he’s surprised to feel the sting of not getting to go shopping with her. Then he says, “Oh cool, okay, sure,” and they head back home.\n He and Mara live in one house. They didn’t talk about it; they just walked into a house and set up. (That was the second or third night. The first night they’d slept outside City Hall, keeping watch by turns, in air that had seemed fresh, by comparison, back then.)\n At first it had seemed weird to not be closer to Celandine and Jack, but it’s for the best. He and Mara have the suits. He and Mara would be leaving, when the time came. Better not to be next door when it happened.\n Sometimes at the beginning, when they went shopping, Mara would put on the ugliest things she could find and strike poses like the movies that played in the jail on Saturdays. He always laughed, not even because it was funny but because he was so fucking happy not to be in there anymore that even a reminder of it was actually a reminder they were out.\n Not free, though. Not until the sky falls in.\n “We haven’t watched a movie in a while,” he says, over the crunch of beetles.\n She frowns. “What’s left?”\n None. The only physical movies had been in the library; anything on the network is gone. They looked for things on people’s computers—they’d seen the first season of THE COVE AT SUNSET, and a lot of porn that was hilarious at first and then felt like you were haunting people. By now it was a competition between things you could watch again and things that made you worry too much about time: the fish, and the slimy bloom on the south edge of the dome, and how long it’s been since you thought about anyone up there as anything but dead.\n After a second he says, “Let’s play STREET RACE 6 with the audio from THE SISTERS OF IVORY HALL.”\n Mara thinks it over. “So . . . Evangeline Camden is the biker?”\n “And Mr. Percy is the cop.”\n Mara half-smiles. “That sounds like a good movie.”\n It’s a terrible movie. But they portion out the whiskey from somebody’s apartment, and they laugh a lot, and it’s something they’re choosing to do because they can, and it’s fine, so long as you don’t look outside.\n Jack’s wearing the same thing he always wears, and it’s a comfort. A different outfit every time makes you think about how many people left things behind; about how many proms there have been.\n (Too many. They all still look the same. Somebody needs to get older.)\n Showing up with Mara is just normal, so he doesn’t think much about the story. He’s bad at it—he tries to follow along, but it always happens too fast. If there were anyone else around to do this, no one would pick him.\n Prom stuff is always best with Mara. Mara prepares with him beforehand, so he feels like he knows what he’s doing. Celandine always manages to come up with something that sounds almost right but just different enough to lose him, and it moves too quickly and he ends up lost and just coasting until they can shut up and make out.\n When it’s his and Jack’s turn to leave together, Jack likes to start the story early, leaning forward between songs to see if Robbie has ideas, his forehead shiny from sweat and his teeth white when he smiles. It’s always easier, looking at Jack, to feel like he’d do whatever.\n This time, “whatever” is that Jack moved away and has come back, and he’s had a crush on Robbie all this time. It goes pretty well; he asks Celandine for a dance, and Jack cuts in awkwardly and Robbie pretends to be surprised Jack wants to dance with him and not Celandine, and he doesn’t have to pretend he’s blushing when Jack winks at him.\n (He checks for Celandine once or twice later, because sometimes she gets upset if people aren’t doing prom right, but she’s off dancing alone, sort of empty in a way Robbie ignores. He’s dancing with Jack. It’s a good prom.)\n They leave before Celandine and Mara can start to get weird, and Jack drives him to the park that has a few trees that died from thirst and a fountain right in the center. It went stagnant and they never fixed it. (They’re all afraid to fuck with the water filtration system.) Now it’s a bunch of weeds and, if you go closer, hedgehogs and birds that got desperate for water and drowned.\n They stay in the car.\n They make out for a while, until the crickets get going and it’s impossible to think about anything. There have been proms where Robbie and Jack had sex in the back seat; Robbie kind of likes it. Sex is what you do to celebrate the bugs dying off in the winter, or to feel like someone’s really listening to you.\n But what Robbie aches for is his parents. Sometimes he feels he has to say something or he’s going to forget them. Jack had told him about the people sedated and dragged out—those must be his parents, his parents and Mara’s parents, and he wants so much to know what they looked like, just to be sure, just to know his parents didn’t want to leave him. But—better not to ask.\n “Last night we watched STREET RACE 6 with the audio from THE SISTERS OF IVORY HALL,” he says instead, just to stop himself from saying his parents’ names.\n Jack grins like that’s the best thing he’s ever heard, says, “Show me,” starts the car.\n Robbie wasn’t expecting that—he feels traitorous, like he always does when he mentions Mara, and then he feels stupid for saying something he knew was going to make him feel bad—but Jack’s humming as he backs out.\n As they’re pulling away, one of the tree branches tears off the trunk and crashes onto the sidewalk.\n Robbie slams his hands on the dashboard, like it’s the car that’s crashing. Jack lets the truck roll to a stop, so nothing jars, and Robbie eventually forces his shoulders to loosen his arms, makes his lungs push in and out.\n “Maybe I just want to go home,” he says, after too long.\n Jack drops Robbie at the border to the West Side; he curls his hand around Robbie’s knee but doesn’t say anything. Venture is big enough that Robbie can watch the truck for nearly a minute before it’s out of sight.\n In his room, he pins the curtains closed and turns on THE SISTERS OF IVORY HALL as loud as he can, so there’s no room left for the sound of a heavy branch falling.\n It’s the sound of the morning Birch jumped. It’s the sound he hears every time Celandine mentions the crack in the dome. The sound his body will make when the water rushes in.\n He sleeps in the suit.\n 4. Physics\n Mara goes to the comm center to call all the people she’ll never forgive.\n Her parents, for agreeing to work here; the medical loans that had them so desperate to start with; Made-Fine. Officer Birch, whose death didn’t nearly make up for what he did; Celandine, for everything, all the time.\n There’s no sound on the other end. At this point, the entire system groans as she starts it up, and every third or fourth time she’ll get an alarm that the system doesn’t have any receptors in range. Sometimes it goes dark halfway through her SOS. None of them will even know what to do when it goes; you didn’t learn how to fix things until you were older, and the company was sure you could be trusted.\n She respects that it even turns on. It’s gonna die any day, but it’s going with dignity, giving up in stages.\n Mara likes machines. She wanted to join the mechanical engineering program at the high school, before she got locked up. Her parents talked about it when they visited like it was something she’d be allowed to do when she got out, which was her first clue she was never getting out.\n Outside, she looks at Birch’s bones.\n There was a while when the whole thing was disgusting. Once she had to turn back because of the smell, and there’s still a stain on the sidewalk. But the nice thing about having too many insects is that they’re more than happy to take care of a corpse. Now it’s just some bones inside a Made-Fine jacket. (She cannot believe this asshole was still wearing his company jacket when he jumped. Some things are fucking sad.)\n For how much they all avoid it, Mara’s seen each of them in Willow Square. Jack first, gripping his handlebars with white knuckles; when he saw Mara he actually started to bike over like he was going to protect her before he realized he’d have to go past the body and stopped.\n Robbie came a few weeks after, at the farthest possible edge where you could still see it; she’d caught his eye, and he’d nodded. She’s never mentioned it. He’d come to make sure Birch was really dead, and she doesn’t think that’s strange. It’s important to know some people are nothing but bones.\n Celandine came when the body was almost gone—the gases dispersed, the liquids dried up, the fat under the split-open skin carried off by ten thousand dutiful bugs. The streetlights were on, a waste of energy that no one did anything about because it was easier to leave this grid on than admit to being afraid of the dark. Celandine stood in the middle of the town square and looked at the body for close to an hour, never moving, even when the ants started walking across her boots.\n Mara doesn’t know what she was thinking. (Mara has never once known what Celandine was thinking.) Celandine never even saw her. She just stood there for an hour, and then walked home, carefully out of the puddles of light.\n None of them know about the others. Mara likes that she knows more about something than everyone else, even about stupid shit that doesn’t matter. Nothing matters anymore. Might as well know what’s going on.\n The bones are scattered now. It would look like the wind caught them, if there was any wind, but the industrial fans died early, and the air is stale and still. Mara kicked them. She’d gotten a burst of static over the comms that turned out to be another relay dying, and since it was too late to beat him to death, she settled for the bones.\n Some days the only thing that gets her out of bed is knowing that whenever the sky falls in, the sea worms will suck the marrow right out of Birch’s remains, and she’d hate to miss that.\n Once she went all the way to the edge where the dome met the ground. The nano-sealant was creeping up—waist-high already—and had its thousands of soft gray fingers disappearing into the rocks. It had crushed some of them, pushing out the space between atoms, and she’d imagined everybody above ground slowly consumed by the gentle cloud of something that you created and couldn’t stop.\n She pressed her face to the glass. Outside, the worms were alive in the sand.\n Robbie told her that her parents had to be drugged and dragged out, that they hadn’t left her. They were probably trying to reach her on the comms—they were trying to reach her. (Or Made-Fine had killed them; just as good. If they were dead, it would explain why they hadn’t come.)\n It was like looking across the fields back home, if every strand of grass was waiting for a meal.\n She’d never gone back. Some things felt like punishment even when no one could see.\n The dome groans as she heads down the stairs—the tide must be coming in—and she makes herself look up. She’s not Robbie. She has some courage.\n It’s day; there’s a little shine to the sludge. Shadows make long slow shapes with a tail right at the end.\n She can see the crack. It’s bigger.\n “Oh sure, fuck it,” Mara says, because why not have whales, too. She hasn’t seen a fucking whale in her entire life, and now there’s one above the reef in whatever new ocean this is. That whole reef is going to collapse into the dome—it’s going to kill hundreds of fish and all the coral that’s managed to grow here and now it will probably sink a whale.\n It’s prom night. She’s going with Jack, and honestly she’s forgotten who she’s leaving with.\n She wishes you could show up and leave with the same person sometimes. It’s prom rules that no name goes back in the box once you draw it, but eventually they’ll run out of other stories. Eventually someone will have to admit they want to be with the same person all night.\n (There have been so many proms. Too many. They’ve been here so long; they never get older.)\n She’s supposed to meet Jack outside the ice cream parlor. She goes to the diner instead, eats some mossy-tasting salami that looks better if you hold it up to the neon sign and two handfuls of frozen fries heated in the microwave just long enough that the edges are hot and the inside’s still icy.\n She wants a tomato. She’d dig someone’s eye out for a tomato.\n She’s two servings into the freeze-dried ice cream when the rest of them find her.\n “Oh thank God,” Robbie says, and Celandine lets out a heavy breath, like this is one of her movie things and they were on the verge of something terrible if they didn’t find her in time.\n Jack just says “Mara” quietly, like he’s happy to see her or like he understands, and that’s what makes her stand up, that fucking tone in his voice like all of this is something she did for prom’s sake—and maybe it was, she can eat frozen fries any time, maybe it was for prom’s sake that she did something no one’s ever done—and fuck, is that worse? Is it worse to give in without knowing it? Does it even matter if you know anything when the crack in the sky is waiting to drown you and you’ll never eat a tomato again in your whole life, which feels like a fucking long time suddenly? She can’t breathe.\n “Why didn’t you show up?” Robbie asks—stupid, stupid Robbie, who sounds like maybe she just forgot.\n “Because I didn’t feel like dancing when I’m going to fucking die in here,” Mara snaps, her voice way too high in her own ears. She can’t see anymore, her eyes are standing water and she hates all of them. Jack makes a soft noise; there’s the sound of someone moving, stopping suddenly.\n A beetle lands on her cheek—desperate for water—and Mara has to scrape it off and crush it.\n When she blinks her eyes open again, she sees it was Robbie who stepped closer. He looks like shit. He’s never going to forgive himself for that day behind the high school, the cigarette that was just illegal enough that Made-Fine had an excuse. She doesn’t want him to ever forgive himself.\n It’s Celandine who says, “Yes, you will.”\n For a second, nothing else makes a sound.\n Mara tries to laugh, but it doesn’t take. “Soon?” she manages, trying to get acid into it and failing. Robbie makes a noise.\n Celandine says, “Very soon. It will be over, I promise.”\n If she’d sounded earnest Mara would have punched her, but she sounds like always, like a movie you don’t care about that somehow knows you don’t care. The same lines play over and over until you forget what you were supposed to feel the first time. You start to laugh when the woman screams, when the monster lumbers across the stage they’ve set up to look like a swamp except for the one plant, forgotten, still in the pot. You owe it nothing. It’s haunted by what other people love and think. You don’t have to think anything. You don’t have to love anything. Nothing’s going to happen to you.\n Celandine says, “How about next time I arrive with Mara, leave with Jack,” even though she doesn’t have the shoebox. No one argues. Partly, Mara’s relieved to feel invisible. Partly she hates Celandine, because that’s how any of this happened: someone did something, and no one argued.\n After that the night’s kind of over. Robbie walks next to her until Jack and Celandine are well out of sight. Then he says, “Can I?”\n She nods. Not in front of the others—Robbie knows better—but she gets so hollow after she cries, and even after everything it’s nice to have Robbie.\n When he scoops her up, he barely misses a step, and she can drop her head to his shoulder without opening her eyes. She knows what his whole body feels like, even when they’re separated. When they die she’s going to miss him.\n “We’re not going to die,” he says—she didn’t realize she’d spoken. She doesn’t answer. He’s not a fool; he knows their chances.\n She has nightmares where they make it—the pressure suits, the burst of impossible energy, the surface—and there’s nothing left but the sun and the water, and they don’t even know where to set out.\n She says, “They left without us. We’ll never get that back. Doesn’t matter how far we swim.”\n His hands tighten around her shoulder, under her knees.\n At home he helps her get into the shower. He makes instant coffee from the hoard of packets, and when she shakes her head, he drinks it himself.\n He helps her into the suit, before he goes into his room. The helmet fogs up as she breathes. When he’s gone, she takes it off.\n 5. Statistics\n Before the dance, Celandine rings the bell on the West Side border next to the ice cream store. When Mara shows up, Celandine says, “Come get ready at my house.”\n She knows Mara will agree. Her house is nice. All the rooms in her place feel haunted—nothing you can do about that—but she keeps them pristine, because who wants to die in a gross house?\n (Jack had spent the first year in different apartments, moving when he got sick of the view or the pipes stopped working. Eventually she’d admitted that seeing the light go out in his window frightened her. He’d moved in next door. There’s always a lamp on.)\n Mara sits at Celandine’s kitchen table, frowning, and lets Celandine do her hair. It’s curly, and Celandine twists loose handfuls, pinning them together into a bun at the back.\n “It’s just going to fall apart when I dance.”\n “You haven’t even seen it.”\n “Nothing you’ve tried ever sticks.”\n Celandine sets down the copper wire she’d braided into a headband the night before. “Use paper clips, then,” she says, goes into her bedroom to change.\n Celandine’s prom dress is a yellow coat. She took off the SPF collar—seems cruel, somehow, to keep it on.\n Mara’s gone outside to wait. She’s wearing a flannel shirt cinched with a utility belt from the sports section, and she’s stuck the headband through the off-center knot of Celandine’s work. She’s probably trying to apologize.\n The music’s booming when they got there; Celandine can hear it three blocks away. The boys are dancing, frantic. Robbie has on an oiled-canvas jacket that makes him look like a fisherman, with the sleeves shoved up to his elbows and fastened somehow, so only the body of it swings as he moves. Jack’s worn what he always wears.\n (“I’m not going to let anything about this change me,” he’d said early on, crying into his sleeves, heaving angry breaths that arched his back until it almost touched her hand.\n Of course it will, she almost said, don’t be stupid, but she didn’t. This was back when she still worried a little for his feelings.)\n She and Mara practically pogo into the gym. Celandine forgets to even think of a story; she has her eyes squeezed shut, plants her feet and swings her whole body in time with the music. When the slow dances start she staggers outside without quite opening her eyes, shoves her hands in the pockets of her dress, and sways back and forth in the air that always feels too cold and too damp after prom.\n There’s a soft groaning sound from far away.\n “Jack,” she says, too loud.\n She keeps her eyes shut, but she feels how warm he is when he comes closer and listens.\n “It’s not the dome,” he says. “Just the generator.”\n “Are you sure? Can you see it from here?”\n “I’m sure.”\n She’s trembling now. It really does get cold at night. She’s relieved Jack doesn’t touch her. She wants him to stand here forever, close but not touching, and lie to her about the sounds in the dark.\n “Mara and Robbie left,” he says after a little while. “Back when the slow dances started. You want to go home?”\n “No.”\n “You want to dance?”\n They never slow dance, but she really is cold. It’s very dark tonight. “If you want.”\n He shrugs. “We could just go to the diner if you want somewhere else to be.”\n “Let’s go to Willow Square.”\n “What?” He pulls back. “Celandine, come on. No.”\n “You chicken?”\n “About what? Not like he’s running the police station down there.”\n There’s no reason to ever go back there. It’s only that Celandine wants so badly for something to be final. She wants to look at a thing with a witness and be certain; she wants something to be over with. Anything. She wonders if Jack drove Robbie over tonight. Maybe she can lie down under the wheels.\n She squeezes her eyes shut tighter, until she doesn’t want that anymore.\n “Let’s just go,” she says. “Prom’s over.”\n He drives her home. Then he brings out a can of spray cheese and some crackers still cold from the freezer and a whole chocolate bar and some orange juice he made from concentrate. They sweep the bugs off his porch and eat, and he runs through the last season of THE COVE AT SUNSET. It was his favorite show; she likes to watch him talk about it, until he reaches the last few he ever saw. Then it’s sad. No matter what had happened above ground, there were at least a few more he’d never seen.\n (They’re definitely not making THE COVE AT SUNSET anymore. That town is ocean now.)\n After a little pause he says, “Do you want to be quiet? If not, I’ll make something up.”\n She’s wanted it to be quiet while he was talking, but now she misses it, and if she looks toward the center of town, she can see something moving.\n “Let’s keep going.”\n He coughs around his chocolate bar. Then he pulls it together.\n “Okay, so, we know Susie lost the campaign for student council at the city college. We can assume this was when she decided to . . . become the Cove’s first serial killer.”\n She keeps her eyes on his face, ignores the shadows. “No way she’s the first. That Cove has been fucked up a long time. Second, minimum.”\n He smiles. This is his favorite game.\n “Right, of course. The town’s still shaken by the long-ago crime spree of the infamous . . . ” he raises his eyebrows, waits.\n “Seacove Slasher.”\n “I mean, that’s fine, but it’s not really descriptive. The Cove wouldn’t settle for something that vague. We need more M.O.”\n “I don’t want—“ she stops. He’ll know why she doesn’t want any gore with her murder mysteries. “The Cabinet Killer?”\n He frowns, thoughtful. “Yeah, okay—the Cabinet Killer, who killed victims in an extremely quick and painless way,” he glances over for her nod, “and stuffed their bodies in pantries for the authorities to find.”\n “How many people did he kill?”\n “Seven. Teen,” he adds, when she makes an unimpressed face.\n “Mm. How did they catch him?”\n Jack stretches his legs down the stairs, slumps back against his propped-up arms. “Not Sheriff Daniels, obviously.”\n No crime in Sunset Cove had ever been solved by Sheriff Daniels, who spent most of his time talking in circles with his ex-wife, until she died; just before Venture got cut off, the show introduced his secret daughter, which didn’t bode well for him solving any crimes in the future.\n “Lisa Avalon,” he says. Lisa had the leftover subplots—entrepreneurial housewife, amateur detective, bookstore employee pining over guest stars. She’d be available for this. “And after the Cabinet Killer nearly got her, Derek Howard joined.”\n “No way. That guy doesn’t have the stomach for it.”\n He’s quiet, and she thinks maybe he’s angry (her stomach turns over), but when she looks he’s just smiling in the way that always makes her want to throw rocks at the dome until it caves in.\n He opens his mouth to say something, then stops and looks toward the town. She freezes, just in case. There are never noises there—not like there’s a breeze, and the birds are dead—but sometimes you hear phantom sounds. Can’t help it. Your mind misses things even if you don’t.\n “So,” he says. “Lisa Avalon, trying to solve the Case of the Cabinet Killer, teams up with . . . ”\n “Susie’s dad. It’s where Susie got the idea, obviously—listening to her father talk about it. She learned too much about it. Killing just made sense after that.”\n Jack stands up and goes inside, as fast and quiet as a dream. He’ll never be angry enough to say something about what she did. He’ll never blame her. He’ll never give her an excuse to hate herself like she wants to.\n She sits on the porch until the dark grows into the murk of morning. At some point, she falls asleep.\n When she wakes up, a bird’s died; near the bend in the road, well past the streetlights. That’s what had made the shadows. She didn’t know there still were any birds.\n She screams for a little while, brushes the beetles off her coat, goes inside to shower.\n The problem, she’d discovered as her father confided in her because he couldn’t bear it anymore and thought she would keep the secret, was that when you felt something so much that it made your hands shake, felt it so much you did something that should have killed you, you disappeared into that feeling. Some horrible endless well of that feeling would always be waiting, heavier than you and inexhaustible.\n The only way to keep going was to not care, as hard as you could, so the feeling forgot you were there. For the length of a prom you walked where you wanted without going under. All of them are dying, and there’s nothing to stop it; what else was there to do but be young?\n Every time she sees Jack, she’s standing over the well: horrified to be caught, relieved to be back where she deserves.\n Once, early on—before Robbie and Mara, just after she stopped worrying about Jack’s feelings—she said, “I should kill myself.” She’d stayed alive to show the company she wasn’t afraid, and to make her father suffer when he made the choice they both knew he’d make. By then, some of propelling anger had burned out, and she didn’t mind getting it over with. The cat that someone left behind was doing well enough with the rats (it would last another six months), but birds were starting to die, and there were more insects every month. She was a blip in an ecosystem. She might as well.\n Jack had reached out like he was going to touch her. He cleared his throat a few times. Finally, when he could sound like he was playing it cool, he’d said, “And what would I do all by myself for the next fifty years?” with a queasy smile at the end like he was going to charm her into staying alive.\n The crack had appeared not long after, so that was one worry out of the way.\n She takes the bike path alone and lies on the brittle grass to look at the sky. The crack is bigger, but it’s taking so terribly long. The land is dead under them. They’re dead inside this. It feels like a hundred years; she doesn’t know what’s keeping it.\n They have the lights on all the time. It attracts the fish. The weight of the coral reef should be speeding things up. They’re a lamp on the bottom of the goddamn sea, she doesn’t know what else she has to do. She needs something to be over with.\n When the moment comes, she’s going to fight the water. It’s so embarrassing she’s never said it out loud, not even to Jack. It’s important not to let people attach themselves to you, if you’re planning not to be around for long.\n When the dome cracks and the water crashes in all at once, and Robbie and Mara are scrambling for the pressure suits that will save them from the ocean long enough to die in the sunlight, and Jack’s doing whatever heroic thing he can with his last minutes, Celandine’s going to be gasping for air forgetting to close her eyes and gulping salt water from screaming like a fool. Seawater’s so thick, and it burns so badly if you keep your eyes open.\n The clock tower at City Hall, the one Birch jumped from, strikes seven. She brushes dead grass off her prom skirt and straightens the knot of necklaces she’s worn because the weight keeps reminding her to breathe.\n She walks past six thousand seventy-two windows that will never light up again. She goes around Willow Square.\n Robbie meets her at the diner. Prom’s lifted from THE COVE AT SUNSET; Jack’s been in love with Celandine a long time and has just been too afraid to say so until tonight. Mara’s going to admit a crush on Robbie, and they’re going to come back here, after, for ice cream.\n (“She likes me anyway, but the ice cream can’t hurt,” Robbie said when they were planning, and Celandine nodded once she realized he was serious.)\n The gym’s lit up—it always is—and the music is playing—it always is. Robbie rushes ahead to catch the end of a song he likes. They’ll never have new music; you get attached to what’s still there.\n Inside, Jack and Mara call to him, and he whoops and joins in. Their thumping steps echo out into the street.\n The dome is dark when she looks up; shadows on shadows, the end of everything.\n She waits for a new song, because it makes a better entrance, and then she squares her shoulders and heads inside. The dome makes a soft horrible sound that doesn’t matter; at prom she won’t be able to hear.\n Genevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times."}