{"fingerprint": "xJ8K77vNgm51Nzt3h8OfSOZQwaQ=", "sitename": "Clarkesworld Magazine", "title": "The Long Goodnight of Violet Wild (Part 2) by Catherynne M. Valente", "author": "Catherynne M Valente", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/valente_03_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Long Goodnight of Violet Wild (Part 2) by Catherynne M. Valente", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9520 words, novelette\nThe Long Goodnight of Violet Wild (Part 2 of 2)\nWinner: 2016 Eugie Foster Memorial Award for Short Fiction\n3. Green\nThe place between the Blue Country and the Green Country is full of dinosaurs called stories, bubble-storms that make you think you’re somebody else, and a sky and a ground that look almost exactly the same. And, for a little while, it was full of me. My sorrow and me and the Sparrowbone Mask of the Incarnadine Fisherwomen crossed the Blue Country where it gets all narrow and thirsty. I was also all narrow and thirsty, but between the two of us, I complained less than the Blue Country. I shut my eyes when we stepped over the border. I shut my eyes and tried to remember kissing Orchid Harm and knowing that we were both thinking about ice cream.\nWhen I was little and my hair hadn’t grown out yet but my piss-and-vinegar had, I asked my Papo:\n“Papo, will I ever meet a story?”\nMy Papo took a long tug on his squirrel-bone pipe and blew smoky lilac rings onto my fingers.\n“Maybe-so, funny bunny, maybe-not-so. But don’t be sad if you don’t. Stories are pretty dumb animals. And so aggressive!”\nI clapped my hands. “Say three ways they’re dumb!”\n“Let’s see.” Papo counted them off on his fingers. “They’re cold-blooded, they use big words when they ought to use small ones, and they have no natural defense against comets.”\nSo that’s what I was thinking about while my sorrow and me hammered a few tent stakes into the huge blue night. We made camp at the edge of a sparkling oasis where the water looked like liquid labradorite. The reason I thought about my Papo was because the oasis was already occupado. A herd of stories slurped up the water and munched up the blueberry brambles and cobalt cattails growing up all over the place out of the aquamarine desert. The other thing that slurped and munched and stomped about the oasis was the great electro-city of Lizard Tongue. The city limits stood a ways off, but clearly Lizard Tongue crept closer all the time. Little houses shaped like sailboats and parrot eggs spilled out of the metropolis, inching toward the water, inching, inching—nobody look at them or they’ll stampede! I could hear the laughing and dancing of the city and I didn’t want to laugh and I didn’t want to dance and sleeping on the earth never troubled me so I stuck to my sorrow and the water like a flat blue stone.\nIt’s pretty easy to make a camp with a sorrow as tall as a streetlamp, especially when you didn’t pack anything from home. I did that on purpose. I hadn’t decided yet if it was clever or stupid as sin. I didn’t have matches or food or a toothbrush or a pocketknife. But the Ordinary Emperor couldn’t come sneaking around impersonating my matches or my beef jerky or my toothbrush or my pocketknife, either. I was safe. I was Emperor-proof. I was not squirrel-proof. The mauve squirrels of time and/or space milled and tumbled behind us like a stupid furry wave of yesterpuke and all any of us could do was ignore them while they did weird rat-cartwheels and chittered at each other, which sounds like the ticks of an obnoxiously loud clock, and fucked with their tails held over their eyes like blindfolds in the blue-silver sunset.\nMy sorrow picked turquoise coconuts from the paisley palm trees with her furry lavender trunk and lined up the nuts neatly all in a row. Sorrows are very fastidious, as it turns out.\n“A storm is coming at seven minutes past seven,” the Sparrowbone Mask of the Incarnadine Fisherwomen said. “I do not like to get wet.”\nI collected brambles and crunched them up for kindling. In order to crunch up brambles, I had to creep and sneak among the stories, and that made me nervous, because of what Papo said when my hair was short.\nA story’s scales are every which shade of blue you can think of and four new ones, too. I tiptoed between them, which was like tiptoeing between trolley-cars. I tried to avoid the poison spikes on their periwinkle tails and the furious horns on their navy blue heads and the crystal sapphire plates on their backs. The setting sun shone through their sapphire plates and burned up my eyeballs with blue.\n“Heyo, guignol-girl!” One story swung round his dinosaur-head at me and smacked his chompers. “Why so skulk and slither? Have you scrofulous aims on our supper?”\n“Nope, I only want to make a fire,” I said. “We’ll be gone in the morning.”\n“Ah, conflagration,” the herd nodded sagely all together. “The best of all the -ations.”\n“And whither do you peregrinate, young sapiens sapiens?” said one of the girl-dinosaurs. You can tell girl-stories apart from boy-stories because girl-stories have webbed feet and two tongues.\nI was so excited I could have chewed rocks for bubblegum. Me, Violet Wild, talking to several real live stories all at once. “I’m going to the Red Country,” I said. “I’m going to the place where death is a red dress and love is a kind of longing and maybe a boy named Orchid didn’t get his throat ripped out by squirrels.”\n“We never voyage to the Red Country. We find no affinity there. We are allowed no autarchy of spirit.”\n“We cannot live freely,” explained the webfooted girl-story, even though I knew what autarchy meant. What was I, a baby eating paint? “They pen us up in scarlet corrals and force us to say exactly what we mean. It’s deplorable.”\n“Abhorrent.”\n“Iniquitous!”\nThe stories were working themselves up into a big blue fury. I took a chance. I grew up a Nowgirl on the purple pampas, I’m careful as a crook on a balcony when it comes to animals. I wouldn’t like to spook a story. When your business is wildness and the creatures who own it, you gotta be cool, you gotta be able to act like a creature, talk like a creature, make a creature feel like you’re their home and the door’s wide open.\n“Heyo, Brobdingnagian bunnies,” I said with all the sweetness I knew how to make with my mouth. “No quisquoses or querulous tristiloquies.” I started to sweat and the stars started to come out. I was already almost out of good words. “Nobody’s going to . . . uh . . . ravish you off to Red and rapine. Pull on your tranquilities one leg at a time. Listen to the . . . um . . . psithurisma? The psithurisma of the . . . vespertine . . . trees rustling, eat your comestibles, get down with dormition.”\nThe stories milled around me, purring, rubbing their flanks on me, getting their musk all over my clothes. And then I had to go lie down because those words tired me right out. I don’t even know if all of them were really words but I remembered Mummery saying all of them at one point or another to this and that pretty person with a pretty name.\nMy sorrow lay down in the moonlight. I leaned against her furry indigo chest. She spat on the brambles and cattails I crunched up and they blazed up purple and white. I didn’t know a sorrow could set things on fire.\n“I love you,” my sorrow said.\nIn the Blue Country, when you say you love someone it means you want to eat them. I knew that because when I thought about Orchid Harm on the edge of the oasis with water like labradorite all I could think of was how good his skin tasted when I kissed it; how sweet and savory his mouth had always been, how even his bones would probably taste like sugar, how even his blood would taste like hot cocoa. I didn’t like those thoughts but they were in my head and I couldn’t not have them. That was what happened to my desire in the Blue Country. The blue leaked out all over it and I wanted to swallow Orchid. He would be okay inside me. He could live in my liver. I would take care of him. I would always be full.\nBut Orchid wasn’t with me which is probably good for him as I have never been good at controlling myself when I have an ardor. My belly growled but I didn’t bring anything to eat on account of not wanting an Emperor-steak, medium-rare, so it was coconut delight on a starlit night with the bubbles coming in. In the Blue Country, the bubbles gleam almost black. They roll in like dark dust, an iridescent wall of go-fuck-yourself, a soft, ticklish tsunami of heart-killing gases. I didn’t know that then but I know it now. The bubble-storm covered the blue plains and wherever a bubble popped something invisible leaked out, something to do with memory and the organs that make you feel things even when you would rather play croquet with a plutonium mallet than feel one more drop of anything at all. The blue-bruise-black-bloody bubbles tumbled and popped and burst and glittered under the ultramarine stars and I felt my sorrow’s trunk around my ankle which was good because otherwise I think I would probably have floated off or disappeared.\nPeople came out of the houses shaped like sailboats and the houses shaped like parrot eggs. They held up their hands like little kids in the bubble-monsoon. Bubbles got stuck in their hair like flowers, on their fingers like rings. I’d never seen a person who looked like those people. They had hair the color of tropical fish and skin the color of a spring sky and the ladies wore cerulean dresses with blue butterflies all over them and the boys wore midnight waistcoats and my heart turned blue just looking at them.\n“Heyo, girlie!” The blue people called, waggling their blue fingers in the bubbly night. “Heyo, elephant and mask! Come dance with us! Cornflower Leap and Pavonine Up are getting married! You don’t even have any blueberry schnapps!”\nBecause of the bubbles popping all over me I stopped being sure who I was. The bubbles smelled like a skull covered in moss and tourmalines. Their gasses tasted like coffee with too much milk and sugar left by an Emperor on a kitchen counter inside a wine bottle.\n“Cornflower Leap and Pavonine Up are dead, dummies,” I said, but I said it wrong somehow because I wasn’t Violet Wild anymore but rather a bubble and inside the bubble of me I was turning into a box of matchsticks. Or Orchid Harm. Or Mummery. I heard clarinets playing the blues. I heard my bones getting older. “They got dead two hundred years ago, you’re just too drunk to remember when their wedding grew traffic laws and sporting teams and turned into a city.”\nOne of the blue ladies opened her mouth right up and ate a bubble out of the air on purpose and I decided she was the worst because who would do that? “So what?” she giggled. “They’re still getting married! Don’t be such a drip. How did a girlie as young as you get to be a drip as droopy as you?”\nPeople who are not purple are baffling.\nYou better not laugh but I danced with the blue people. Their butterflies landed on me. When they landed on me they turned violet like my body and my name but they didn’t seem upset about it. The whole world looked like a black rainbow bubble. It was the opposite of drinking the sun that Orchid’s family brewed down in their slipstills. When I drink the sun, I feel soft and edgeless. When the bubbles rained down on me I felt like I was made of edges all slicing themselves up and the lights of Lizard Tongue burned up my whole brain and while I was burning I was dancing and while I was dancing I was the Queen of the Six-Legged squirrels. They climbed up over me in between the black bubbles. Some of them touched the turquoise butterflies and when they did that they turned blue and after I could always tell which of the squirrels had been with me that night because their fur never got purple again, not even a little.\nI fell down dancing and burning. I fell down on the cracked cobalt desert. A blue lady in a periwinkle flapper dress whose hair was the color of the whole damn ocean tried to get me to sit up like I was some sad sack of nothing at Mummery’s parties who couldn’t hold her schnapps.\n“Have you ever met anyone who stopped being dead?” I asked her.\n“Nobody blue,” she said.\nI felt something underneath me. A mushy, creamy, silky something. A something like custard with a crystal heart. I rolled over and my face made a purple print in the blue earth and when I rolled over I saw Jellyfish looking shamefaced, which she should have done because stowaways should not look proudfaced, ever.\n“I ate a bunch of bleu cheese at the wedding buffet in the town square and now my tummy hates me,” the watercolor unicorn mourned.\nOne time Orchid Harm told me a story about getting married and having kids and getting a job somewhere with no squirrels or prohibited substances. It seemed pretty unrealistic to me. Jellyfish and I breathed in so much blackish-brackish bubble-smoke that we threw up together, behind a little royal blue dune full of night-blooming lobelia flowers. When we threw up, that story came out and soaked into the ground. My sorrow picked us both up in her trunk and carried us back to the fire.\nThe last thing I said before I fell asleep was: “What’s inside your cabinet?”\nThe only answer I got was the sound of a lock latching itself and a squirrel screeching because sorrow stepped on it.\nWhen I woke up the Blue Country had run off. The beautiful baffling blue buffoons and the black bubbles and the pompous stories had legged it, too.\nGreen snow fell on my hair. It sparkled in my lap and there was a poisonous barb from the tail of a story stuck to the bottom of my shoe. I pulled it off very carefully and hung it from my belt. My hand turned blue where I’d held it and it was always blue forever and so I never again really thought of it as my hand.\n4. Yellow\nSometimes I get so mad at Mummery. She never told me anything important. Oh, sure, she taught me how to fly a clarinet and how much a lie weighs and how to shoot her stained-glass Nonegun like a champ. Of course, you can plot any course you like on a clarinet, darlingest, but the swiftest and most fuel efficient is Premiére Rhapsodie by Debussy in A Major. Ugh! Who needs to know the fuel efficiency of Debussy? Mummery toot-tooted her long glass horn all over the world and she never fed me one little spoonful of it when I was starving to death for anything other than our old awful wine bottle in Plum Pudding. What did Mummery have to share about the Green Country? I enjoyed the saunas in Verdigris, but Absinthe is simply lousy with loyalty. It’s a serious problem. That’s nothing! That’s rubbish, is what. Especially if you know that in the Green Country, loyalty is a type of street mime.\nThe Green Country is frozen solid. Mummery, if only you’d said one useful thing, I’d have brought a thicker coat. Hill after hill of green snow under a chartreuse sky. But trees still grew and they still gave fruit—apples and almonds and mangoes and limes and avocados shut up in crystal ice pods, hanging from branches like party lanterns. People with eyes the color of mint jelly and hair the color of unripe bananas, wearing knit olive caps with sage poms on the ends zoomed on jade toboggans, up and down and everywhere, or else they skate on green glass rivers, ever so many more than in the Blue Country. Green people never stop moving or shivering. My sorrow slipped and slid and stumbled on the lime-green ice. Jellyfish and I held on for dear life. The Sparrowbone Mask of the Incarnadine Fisherwomen clung to my face, which I was happy about because otherwise I’d have had green frost growing on my teeth.\nOne time Orchid Harm and I went up to the skull socket of the opera house and read out loud to each other from a book about how to play the guitar. It never mattered what we read about really, when we read out loud to each other. We just liked to hear our voices go back and forth like a seesaw. Most popular songs are made up of three or four or even two simple chords, whispered Orchid seductively. Let us begin with the D chord, which is produced by holding the fingers thusly. And he put his fingers on my throat like mine was the neck of a guitar. And suddenly a terror happened inside me, a terror that Orchid must be so cold, so cold in my memory of the skull socket and the D chord and cold wherever he might be and nothing mattered at all but that I had to warm him up, wrap him in fur or wool or lay next to him skin to skin, build a fire, the biggest fire that ever wrecked a hearth, anything if it would get him warm again. Hot. Panic went zigzagging through all my veins. We had to go faster.\n“We’ll go to Absinthe,” I said shakily, even though I didn’t know where Absinthe was because I had a useless Mummery. I told the panic to sit down and shut up. “We need food and camping will be a stupid experience here.”\n“I love you,” said my sorrow, and her legs grew like the legs of a telescope, longer even than they had already. The bottoms of her fuzzy hippo-feet flattened out like pancakes frying in butter until they got as wide as snowshoes. A sorrow is a resourceful beast. Nothing stops sorrow, not really. She took the snowy glittering emerald hills two at a stride. Behind us the army of squirrels flowed like the train of a long violet gown. Before us, toboggan-commuters ran and hid.\n“In the Green Country, when you say you love somebody, it means you will keep them warm even if you have to bathe them in your own blood,” Jellyfish purred. Watercolor unicorns can purr, even though real unicorns can’t. Jellyfish rubbed her velvety peach and puce horn against my sorrow’s spine.\n“How do you know that?”\n“Ocherous Wince, the drunken dog-lover who painted me, also painted a picture more famous than me. Even your Mummery couldn’t afford it. It’s called When I Am In Love My Heart Turns Green. A watercolor lady with watercolor wings washes a watercolor salamander with the blood pouring out of her wrists and her elbows. The salamander lies in a bathtub that is a sawn-open lightbulb with icicles instead of clawfeet. It’s the most romantic thing I ever saw. I know a lot of things because of Ocherous Wince, but I never like to say because I don’t want you to think I’m a know-it-all even though I really want to say because knowing things is nicer when somebody else knows you know them.”\nAbsinthe sits so close to the border of the Yellow Country that half the day is gold and half the day is green. Three brothers sculpted the whole city—houses, pubs, war monuments—out of jellybean-colored ice with only a little bit of wormwood for stability and character. I didn’t learn that from Jellyfish or Mummery, but from a malachite sign on the highway leading into the city. The brothers were named Peapod. They were each missing their pinky fingers but not for the same reason.\nIt turns out everybody notices you when you ride into town on a purple woolly mammoth with snowshoes for feet with a unicorn in your lap and a bone mask on your face. I couldn’t decide if I liked being invisible better or being watched by everybody all at once. They both hurt. Loyalties scattered before us like pigeons, their pale green greasepainted faces miming despair or delight or umbrage, depending on their schtick. They mimed tripping over each other, and then some actually did trip, and soon we’d cause a mime-jam and I had to leave my sorrow parked in the street. I was so hungry I could barely shiver in the cold. Jellyfish knew a cafe called O Tannenbaum but I didn’t have any money.\n“That’s all right,” said the watercolor unicorn. “In the Green Country, money means grief.”\nSo I paid for a pine-green leather booth at O Tannenbaum, a stein of creme de menthe, a mugwort cake and parakeet pie with tears. The waiter wore a waistcoat of clover with moldavite buttons. He held out his hands politely. I didn’t think I could do it. You can’t just grieve because the bill wants 15% agony on top of the prix fixe. But my grief happened to me like a back alley mugging and I put my face into his hands so no one would see my sobbing; I put my face into his hands like a bone mask so no one could see what I looked like on the inside.\n“I’m so lonely,” I wept. “I’m nobody but a wound walking around.” I lifted my head—my head felt heavier than a planet. “Did you ever meet anyone who fucked up and put it all right again, put it all back the way it was?”\n“Nobody green,” said the waiter, but he walked away looking very pleased with his tip.\nIt’s a hard damn thing when you’re feeling lowly to sit in a leather booth with nobody but a unicorn across from you. Lucky for me, a squirrel hopped up on the bamboo table. She sat back on her hind two legs and rubbed her humongous paradox-pregnant belly with the other four paws. Her bushy mauve tail stood at attention behind her, bristling so hard you could hear it crackling.\n“Pink and green feel good on my eyes,” the time-squirrel said in Orchid Harm’s voice.\n“Oh, go drown yourself in a hole,” I spat at it, and drank my creme de menthe, which gave me a creme de menthe mustache that completely undermined much of what I said later.\nThe squirrel tried again. She opened her mouth and my voice came out.\n“No quisquoses or querulous tristiloquies,” she said soothingly. But I had no use for a squirrel’s soothe.\n“Eat shit,” I hissed.\nBut that little squirrel was the squirrel who would not quit. She rubbed her cheeks and stretched her jaw and out came a voice I did not know, a man’s voice, with a very expensive accent.\n“The Red Country is the only country with walls. It stands to reason something precious lives there. But short of all-out war, which I think we can all agree is at least inconvenient, if not irresponsible, we cannot know what those walls conceal. I would suggest espionage, if we can find a suitable candidate.”\nNow, I don’t listen to chronosquirrels. They’re worse than toddlers. They babble out things that got themselves said a thousand months ago or will be said seventy years from now or were only said by a preying mantis wearing suspenders in a universe that’s already burned itself out. When I was little I used to listen, but my Papo spanked me and told me the worst thing in the world was for a Nowboy to listen to his herd. It’ll drive you madder than a plate of snakes, he said. He never spanked me for anything else and that’s how I know he meant serious business. But this dopey doe also meant serious business. I could tell by her tail. And I probably would have gotten into it with her, which may or may not have done me a lick of good, except that I’d made a mistake without even thinking about it, without even brushing off a worry or a grain of dread, and just at that moment when I was about to tilt face first into Papo’s plate of snakes, the jade pepper grinder turned into a jade Emperor with black peppercorn lips and a squat silver crown.\n“Salutations, young Violet,” said the Ordinary Emperor in a voice like a hot cocktail. “What’s a nice purple girl like you doing in a bad old green place like this?”\nJellyfish shrieked. When a unicorn shrieks, it sounds like sighing. I just stared. I’d been so careful. The Emperor of Peppercorns hopped across the table on his grinder. The mauve squirrel patted his crown with one of her hands. They were about the same height. I shook my head and declined to say several swear words.\n“Don’t feel bad, Miss V,” he said. “It’s not possible to live without objects. Why do you think I do things this way? Because I enjoy being hand brooms and cheese-knives?”\n“Leave me alone,” I moaned.\n“Now, I just heard you say you were lonely! You don’t have to be lonely. None of my subjects have to be lonely! It was one of my campaign promises, you know.”\n“Go back to Mummery. Mind your own business.”\nThe Ordinary Emperor stroked his jade beard. “I think you liked me better when I was naked in your kitchen. I can do it again, if you like. I want you to like me. That is the cornerstone of my administration.”\n“No. Be a pepper grinder. Be a broom.”\n“Your Papo cannot handle the herd by himself, señorita,” clucked the Ordinary Emperor. “You’ve abandoned him. Midnight comes at 3 p.m. in Plum Pudding. Every day is Thursday. Your Mummery has had her clarinet out day and night looking for you.”\n“Papo managed before I was born, he can manage now. And you could have told Mums I was fine.”\n“I could have. I know what you’re doing. It’s a silly, old-fashioned thing, but it’s just so you. I’ve written a song about it, you know. I called it My Baby Done Gone to Red. It’s proved very popular on the radio, but then, most of my songs do.”\n“I’ve been gone for three days!”\n“Culture moves very quickly when it needs to, funny bunny. Don’t you like having a song with you in it?”\nI thought about Mummery and all the people who thought she was fine as a sack of bees and drank her up like champagne. She lived for that drinking-up kind of love. Maybe I would, too, if I ever got it. The yellow half of Absinthe’s day came barreling through the cafe window like a bandit in a barfight. Gold, gorgeous, impossible gold, on my hands and my shoulders and my unicorn and my mouth, the color of the slat under my bed, the color of the secret I showed Orchid before I loved him. Sitting in that puddle of suddenly gold light felt like wearing a tiger’s fur.\n“Well, I haven’t heard the song,” I allowed. Maybe I wanted a little of that champagne-love, too.\nThen the Ordinary Emperor wasn’t a pepper grinder anymore because he was that beautiful man in doublet and hose and a thousand hundred colors who stood in my kitchen smelling like sex and power and eleven kinds of orange and white. He put his hands over mine.\n“Didn’t you ever wonder why the clarinauts are the only ones who travel between countries? Why they’re so famous and why everyone wants to hear what they say?”\n“I never thought about it even one time.” That was a lie; I thought about it all the time the whole year I was eleven but that was long enough ago that it didn’t feel like much of a lie.\nHe wiped away my creme de menthe mustache. I didn’t know it yet, but my lips stayed green and they always would. “A clarinaut is born with a reed in her heart through which the world can pass and make a song. For everyone else, leaving home is poison. They just get so lost. Sometimes they spiral down the drain and end up Red. Most of the time they just wash away. It’s because of the war. Bombs are so unpredictable. I’m sure everyone feels very embarrassed now.”\nI didn’t want to talk about the specialness of Mummery. I didn’t want to cry, either, but I was, and my tears splashed down onto the table in big, showy drops of gold. The Ordinary Emperor knuckled under my chin.\n“Mon petite biche, it is natural to want to kill yourself when you have bitten off a hurt so big you can’t swallow it. I once threw myself off Split Salmon Bridge in the Orange Country. But the Marmalade Sea spit me back. The Marmalade Sea thinks suicide is for cowards and she won’t be a part of it. But you and I know better.”\n“I don’t want to kill myself!”\n“It doesn’t matter what death means in the Red Country, Violet. Orchid didn’t die in the Red Country. And you won’t make it halfway across the Tangerine Tundra. You’re already bleeding.” He turned over my blue palm, tracing tracks in my golden tears. “You’ll ride your sorrow into a red brick wall.”\n“It does matter. It does. You don’t matter. My sorrow loves me.”\n“And what kind of love would that be? The love that means killing? Or eating? Or keeping warm? Do you know what ‘I love you’ means in the Yellow Country?”\n“It means ‘I cannot stand the sight of you,’” whinnied Jellyfish, flicking her apricot and daffodil tail. “Ocherous Wince said it to all her paintings every day.”\nThe waiter appeared to take the Ordinary Emperor’s order. He trembled slightly, his clovers quivering. “The pea soup and a glass of green apple gin with a dash of melon syrup, my good man,” his Majesty said without glancing at the help. “I shall tell you a secret if you like, Violet. It’s better than a swipe of gold paint, I promise.”\n“I don’t care.” My face got all hot and plum-dark even through the freezing lemony air. I didn’t want him to talk about my slat. “Why do you bother with me? Go be a government by yourself.”\n“I like you. Isn’t that enough? I like how much you look like your Mummery. I like how hard you rode Stopwatch across the Past Perfect Plains. I like how you looked at me when you caught me making coffee. I like that you painted the underside of your bed and I especially like how you showed it to Orchid. I’m going to tell you anyway. Before I came to the throne, during the reign of the Extraordinary Emperor, I hunted sorrows. Professionally. In fact, it was I who hunted them to extinction.”\n“What the hell did you do that for?” The waiter set down his royal meal and fled which I would also have liked to do but could not because I did not work in food service.\n“Because I am from the Orange Country, and in the Orange Country, a sorrow is not a mammoth with a cabinet in its stomach, it is a kind of melancholic dread, a bitter, heartsick gloom. It feels as though you can never get free of a sorrow once you have one, as though you become allergic to happiness. It was because of a certain sorrow that I leapt from the Split Salmon Bridge. My parents died of a housefire and then my wife died of being my wife.” The Ordinary Emperor’s voice stopped working quite right and he sipped his gin. “All this having happened before the war, we could all hop freely from Orange to Yellow to Purple to Blue to Green—through Red was always a suspicious nation, their immigration policies never sensible, even then, even then when no one else knew what a lock was or a key. When I was a young man I did as young men do—I traveled, I tried to find women to travel with me, I ate foreign food and pretended to like it. And I saw that everywhere else, sorrows roamed like buffalo, and they were not distresses nor dolors nor disconsolations, but animals who could bleed. Parasites drinking from us like fountains. I did not set out for politics, but to rid the world of sorrows. I thought if I could kill them in the other countries, the Orange Country sort of sorrow would perish, too. I rode the ranges on a quagga with indigestion. I invented the Nonegun myself—I’ll tell you that secret, too, if you like, and then you will know something your Mums doesn’t, which I think is just about the best gift I could give you. To make the little engine inside a Nonegun you have to feel nothing for anyone. Your heart has to look like the vacuum of space. Not coincidentally, that is also how you make the engine inside an Emperor. I shot all the sorrows between the eyes. I murdered them. I rode them down. I was merciless.”\n“Did it work?” I asked softly.\n“No. When I go home I still want to die. But it made a good campaign slogan. I have told you this for two reasons. The first is that when you pass into the Orange Country you will want to cut yourself open from throat to navel. Your sorrow has gotten big and fat. It will sit on you and you will not get up again. Believe me, I know. When I saw you come home with a sorrow following you like a homeless kitten I almost shot it right there and I should have. They have no good parts. Perhaps that is why I like you, really. Because I bleached sorrow from the universe and you found one anyway.”\nThe Ordinary Emperor took my face in his hands. He kissed me. I started to not like it but it turned into a different kind of kiss, not like the kisses I made with Orchid, but a kiss that made me wonder what it meant to kiss someone in the Orange Country, a kiss half full of apology and half full of nostalgia and a third half full of do what I say or else. So in the end I came round again to not liking it. I didn’t know what he was thinking when he kissed me. I guess that’s not a thing that always happens.\n“The second reason I told you about the sorrows, Violet Wild, is so that you will know that I can do anything. I am the man who murdered sorrow. It said that on my election posters. You were too young to vote, but your Mummery wasn’t, and you won’t be too young when I come up for re-election.”\n“So?”\n“So if you run as my Vice-Emperor, which is another way of saying Empress, which is another way of saying wife, I will kill time for you, just like I killed sorrow. Squirrels will be no trouble after all those woolly monsters. Then everything can happen at once and you will both have Orchid and not have him at the same time because the part where you showed him the slat under your bed and the part where his body disappeared on the edge of the Blue Country will not have to happen in that order, or any order. It will be the same for my wife and my parents and only in the Red Country will time still mean passing.”\nThe squirrel still squatted on the table with her belly full of baby futures in her greedy hands. She glared at the Ordinary Emperor with unpasteurized hate in her milky eyes. I looked out the great ice picture window of the restaurant that wasn’t called O Tannenbaum anymore, but The Jonquil Julep, the hoppingest nightspot in the Yellow Country. Only the farthest fuzz on the horizon still looked green. Chic blonde howdy-dos started to crowd in wearing daffodil dresses and butterscotch tuxedos. Some of them looked sallow and waxy; some of them coughed.\n“There is always a spot of cholera in the Yellow Country,” admitted the Ordinary Emperor with some chagrin. Through the glass I saw my sorrow hunched over, peering in at the Emperor, weeping soundlessly, wiping her eyes with her trunk. “But the light here is so good for painting.”\nEverything looked like the underside of my bed. The six-legged squirrel said:\n“Show me something your parents don’t know about.”\nAnd love went pinballing through me but it was a Yellow kind of love and suddenly my creme de menthe was banana schnapps and suddenly my mugwort cake was lemon meringue and suddenly I hated Orchid Harm. I hated him for making me have an ardor for something that wasn’t a pony or a Papo or a color of paint, I hated him for being a Sunslinger all over town even though everybody knew that shit would hollow you out and fill you back up with nothing if you stuck with it. I hated him for making friends with my unicorn and I hated him for hanging around Papo and me till he got dead from it and I hated him for bleeding out under me and making everything that happened happen. I didn’t want to see his horrible handsome face ever again. I didn’t want alive-Orchid and dead-Orchid at the same time, which is a pretty colossally unpleasant idea when you think about it. My love was the sourest thing I’d ever had. If Orchid had sidled up and ordered a cantaloupe whiskey, I would have turned my face away. I had to swallow all that back to talk again.\n“But killing sorrow didn’t work,” I said, but I kept looking at my sorrow on the other side of the window.\n“I obviously missed one,” he said grimly. “I will be more thorough.”\nAnd the Ordinary Emperor, quick as a rainbow coming on, snatched up the squirrel of time and whipped her little body against the lemonwood table so that it broke her neck right in half. She didn’t even get a chance to squeak.\nSometimes it takes me a long time to think through things, to set them up just right in my head so I can see how they’d break if I had a hammer. But sometimes I have a hammer. So I said:\n“No, that sounds terrible. You are terrible. I am a Nowgirl and a Nowgirl doesn’t lead her herd to slaughter. Bring them home, bring them in, my Papo always said that and that’s what I will always say, too. Go away. Go be dried pasta. Go be sad and orange. Go jump off your bridge again. I’m going to the Red Country on my sorrow’s back.”\nThe Ordinary Emperor held up his hand. He stood to leave as though he were a regular person who was going to walk out the door and not just turn into a bar of Blue Country soap. He looked almost completely white in the loud yellow sunshine. The light burned my eyes.\n“It’s dangerous in the Red Country, Violet. You’ll have to say what you mean. Even your Mummery never flew so far. ”\nHe dropped the corpse of the mauve space-time squirrel next to his butter knife by way of paying his tab because in the Yellow Country, money means time.\n“You are not a romantic man,” said Jellyfish through clenched pistachio-colored teeth. That’s the worst insult a watercolor unicorn knows.\n“There’s a shortcut to the Orange Country in the ladies’ room. Turn the right tap three times, the left tap once, and pull the stopper out of the basin.” That was how the Ordinary Emperor said goodbye. I’m pretty sure he told Mummery I was a no-good whore who would never make good even if I lived to a hundred. That’s probably even true. But that wasn’t why I ran after him and stabbed him in the neck with the poisonous prong of the story hanging from my belt. I did that because, no matter what, a Nowgirl looks after her herd.\n5. Orange\nThis is what happened to me in the Orange Country: I didn’t see any cities even though there are really nice cities there, or drink any alcohol even though I’ve always heard clementine schnapps is really great, or talk to any animals even though in the Orange Country a poem means a kind of tiger that can’t talk but can sing, or people, even though there were probably some decent ones making a big bright orange life somewhere.\nI came out of the door in the basin of The Jonquil Julep and I lay down on floor of a carrot-colored autumn jungle and cried until I didn’t have anything wet left to lose. Then I crawled under a papaya tree and clawed the orange clay until I made a hole big enough to climb inside if I curled up my whole body like a circle you draw with one smooth motion. The clay smelled like fire.\n“I love you,” said my sorrow. She didn’t look well. Her fur was threadbare, translucent, her trunk dried out.\n“I don’t know what ‘I love you’ means in the Orange Country,” sighed Jellyfish.\n“I do,” said the Sparrowbone Mask of the Incarnadine Fisherwomen, who hadn’t had a damn thing to say in ages. “Here, if you love someone, you mean to keep them prisoner and never let them see the sun.”\n“But then they’d be safe,” I whispered.\n“I love you,” said my sorrow. She got down on her giant woolly knees beside my hole. “I love you. Your eyes are yellow.”\nI began to claw into the orange clay my hole. I peeled it away and crammed it into my mouth. My teeth went through it easy as anything. It didn’t taste like dirt. It tasted like a lot of words, one after the other, with conflict and resolution and a beginning, middle, but no end. It tasted like Mummery showing me how to play the clarinet. It tasted like an Emperor who wasn’t an Emperor anymore. The earth stained my tongue orange forever.\n“I love you,” said my sorrow.\n“I heard you, dammit,” I said between bright mouthfuls.\nLike she was putting an exclamation point on her favorite phrase, my sorrow opened up her cabinet doors in the sienna shadows of the orange jungle. Toucans and orioles and birds of paradise crowed and called and their crowing and calling caromed off the titian trunks until my ears hated birdsong more than any other thing. My sorrow opened up her cabinet doors and the wind whistled through the space inside her and it sounded like Premiére Rhapsodie in A Major through the holes of a fuel-efficient crystal clarinet.\nInside my sorrow hung a dress the color of garnets, with a long train trailing behind it and a neckline that plunged to the navel. It looked like it would be very hard to dance in.\n6. Red\nIn the Red Country, love is love, loyalty is loyalty, a story is a story, and death is a long red dress. The Red Country is the only country with walls.\nI slept my way into the Red Country.\nI lay down inside the red dress called death; I lay down inside my sorrow and a bone mask crawled onto my face; I lay down and didn’t dream and my sorrow smuggled me out of the orange jungles where sorrow is sadness. I don’t remember that part so I can’t say anything about it. The inside of my sorrow was cool and dim; there wasn’t any furniture in there, or any candles. She seemed all right again, once we’d lumbered on out of the jungle. Strong and solid like she’d been in the beginning. I didn’t throw up even though I ate all that dirt. Jellyfish told me later that the place where the Orange Country turns into the Red Country is a marshland full of flamingos and ruby otters fighting for supremacy. I would have liked to have seen that.\nI pulled it together by the time we reached the riverbanks. The Incarnadine River flows like blood out of the marshes, through six locks and four sluice gates in the body of a red brick wall as tall as clouds. Then it joins the greater rushing rapids and pools of the Claret, the only river in seven kingdoms with dolphins living in it, and all together, the rivers and the magenta dolphins, roar and tumble down the valleys and into the heart of the city of Cranberry-on-Claret.\nCrimson boats choked up the Incarnadine. A thousand fishing lines stuck up into the pink dawn like pony-poles on the pampas. The fisherwomen all wore masks like mine, masks like mine and burgundy swimming costumes that covered them from neck to toe and all I could think was how I’d hate to swim in one of those things, but they probably never had to because if you fell out of your boat you’d just land in another boat. The fisherwomen cried out when they saw me. I suppose I looked frightening, wearing that revealing, low-cut death and the bone mask and riding a mammoth with a unicorn in my arms. They called me some name that wasn’t Violet Wild and the ones nearest to shore climbed out of their boats, shaking and laughing and holding out their arms. I don’t think anyone should get stuck holding their arms out to nothing and no one, so I shimmied down my sorrow’s fur and they clung on for dear live, touching the Sparrowbone Mask of the Incarnadine Fisherwomen, stroking its cheeks, its red spiral mouth, telling it how it had scared them, vanishing like that.\n“I love you,” the Sparrowbone Mask of the Incarnadine Fisherwomen kept saying over and over. It felt strange when the mask on my face spoke but I didn’t speak. “I love you. Sometimes you can’t help vanishing. I love you. I can’t stay.”\nMy mask and I said both together: “We are afraid of the wall.”\n“Don’t be doltish,” an Incarnadine Fisherwoman said. She must have been a good fisherwoman as she had eight vermillion catfish hanging off her belt and some of them were still opening and closing their mouths, trying to breathe water that had vanished like a mask. “You’re one of us.”\nSo my sorrow swam through the wall. She got into the scarlet water which rose all the way up to her eyeballs but she didn’t mind. I rode her like sailing a boat and the red water soaked the train of my red death dress and magenta dolphins followed along with us, jumping out of the water and echolocating like a bunch of maniacs and the Sparrowbone Mask of the Incarnadine Fisherwomen said:\n“I am beginning to remember who I am now that everything is red again. Why is anything unred in the world? It’s madness.”\nJellyfish hid her lavender face in her watermelon-colored hooves and whispered:\n“Please don’t forget about me, I am water soluble!”\nI wondered, when the river crashed into the longest wall in the world, a red brick wall that went on forever side to side and also up and down, if the wall had a name. Everything has a name, even if that name is in Latin and nobody knows it but one person who doesn’t live nearby. Somebody had tried to blow up the wall several times. Jagged chunks were missing; bullets had gouged out rock and mortar long ago, but no one had ever made a hole. The Incarnadine River slushed in through a cherry-colored sluice gate. Rosy sunlight lit up its prongs. I glided on in with all the other fisherwomen like there never was a wall in the first place. I looked behind us—the river swarmed with squirrels, gasping, half drowning, paddling their little feet for dear life. They squirmed through the sluice gate like plague rats.\n“If you didn’t have that mask on, you would have had to pay the toll,” whispered Jellyfish.\n“What’s the toll?”\n“A hundred years as a fisherwoman.”\nCranberry-on-Claret is a city of carnelian and lacquerwork and carbuncle streetlamps glowing with red gas flames because the cities of the Red Country are not electrified like Plum Pudding and Lizard Tongue and Absinthe. People with hair the color of raspberries and eyes the color of wood embers play ruby bassoons and chalcedony hurdy-gurdies and cinnamon-stick violins on the long, wide streets and they never stop even when they sleep; they just switch to nocturnes and keep playing through their dreaming. When they saw me coming, they started up My Baby Done Gone to Red, which, it turns out, is only middling as far as radio hits go.\nSome folks wore deaths like mine. Some didn’t. The Ordinary Emperor said that sometimes the dead go to the Red Country but nobody looked dead. They looked busy like city people always look. It was warm in Cranberry-on-Claret, an autumnal kind of warm, the kind that’s having a serious think about turning to cold. The clouds glowed primrose and carmine.\n“Where are we going?” asked my watercolor unicorn.\n“The opera house,” I answered.\nI guess maybe all opera houses are skulls because the one in the Red Country looked just like the one back home except, of course, as scarlet as the spiral mouth of a mask. It just wasn’t a human skull. Out of a cinnabar piazza hunched up a squirrel skull bigger than a cathedral and twice as fancy. Its great long teeth opened and closed like proper doors and prickled with scrimshaw carving like my Papo used to do on pony-bones. All over the wine-colored skull grew bright hibiscus flowers and devil’s hat mushrooms and red velvet lichen and fire opals.\nBelow the opera house and behind they kept the corrals. Blue stories milled miserably in pens, their sapphire plates drooping, their eyes all gooey with cataracts. I took off the Sparrowbone Mask of the Incarnadine Fisherwomen and climbed down my sorrow.\n“Heyo, beastie-blues,” I said, holding my hands out for them to sniff through the copper wire and redwood of their paddock. “No lachrymose quadrupeds on my watch. Be not down in the mouth. Woe-be-gone, not woe-be-come.”\n“That’s blue talk,” a boy-story whispered. “You gotta talk red or you get no cud.”\n“Say what you mean,” grumbled a girl-story with three missing scales over her left eye. “It’s the law.”\n“I always said what I meant. I just meant something very fancy,” sniffed a grandfather-story lying in the mud to stay cool.\n“Okay. I came from the Purple Country to find a boy named Orchid Harm.”\n“Nope, that’s not what you mean,” the blue grandpa dinosaur growled, but he didn’t seem upset about it. Stories mostly growl unless they’re sick.\n“Sure it is!”\n“I’m just a simple story, what do I know?” He turned his cerulean rump to me.\n“You’re just old and rude. I’m pretty sure Orchid is up there in the eye of that skull, it’s only that I was going to let you out of your pen before I went climbing but maybe I won’t now.”\n“How’s about we tell you what you mean and then you let us out and nobody owes nobody nothing?” said the girl-story with the missing scales. It made me sad to hear a story talking like that, with no grammar at all.\n“I came from the Purple Country to find Orchid,” I repeated because I was afraid.\n“Are you sure you’re not an allegory for depression or the agrarian revolution or the afterlife?”\n“I’m not an allegory for anything! You’re an allegory! And you stink!”\n“If you say so.”\n“What do you mean then?”\n“I mean a blue dinosaur. I mean a story about a girl who lost somebody and couldn’t get over it. I can mean both at the same time. That’s allowed.”\n“This isn’t any better than when you were saying autarchy and peregrinate.”\n“So peregrinate with autarchy, girlie. That’s how you’re supposed to act around stories, anyway. Who raised you?”\nI kicked out the lock on their paddock and let the reptilian stories loose. They bolted like blue lightning into the cinnabar piazza. Jellyfish ran joyfully among them, jumping and wriggling and whinnying, giddy to be in a herd again, making a mess of a color scheme.\n“I love you,” said my sorrow. She had shrunk up small again, no taller than a good dog, and she was wearing the Sparrowbone Mask of the Incarnadine Fisherwomen. By the time I’d gotten half way up the opera-skull, she was gone.\n“Let us begin by practicing the chromatic scale, beginning with E major.”\nThat is what the voice coming out of the eye socket of a giant operatic squirrel said and it was Orchid’s voice and it had a laugh hidden inside it like it always did. I pulled myself up and over the lip of the socket and curled up next to Orchid Harm and his seven books, of which he’d already read four. I curled up next to him like nothing bad had ever happened. I fit into the line of his body and he fit into mine. I didn’t say anything for a long, long time. He stroked my hair and read to me about basic strumming technique but after awhile he stopped talking, too and we just sat there quietly and he smelled like sunlight and booze and everything purple in the world.\n“I killed the Ordinary Emperor with a story’s tail,” I confessed at last.\n“I missed you, too.”\n“Are you dead?”\n“The squirrels won’t tell me. Something about collapsing a waveform. But I’m not the one wearing a red dress.”\nI looked down. Deep red silky satin death flowed out over the bone floor. A lot of my skin showed in the slits of that dress. It felt nice.\n“The squirrels ate you, though.”\n“You never know with squirrels. I think I ate some of them, too. It’s kind of the same thing, with time travel, whether you eat the squirrel or the squirrel eats you. I remember it hurt. I remember you kissed me till it was over. I remember Early-to-Tea and Stopwatch screaming. Sometimes you can’t help vanishing. Anyway, the squirrels felt bad about it. Because we’d taken care of them so well and they had to do it anyway. They apologized for ages. I fell asleep once in the middle of them going on and on about how timelines taste.”\n“Am I dead?”\n“I don’t know, did you die?”\n“Maybe the bubbles got me. The Emperor said I’d get sick if I traveled without a clarinet. And parts of me aren’t my own parts anymore.” I stretched out my legs. They were the color of rooster feathers. “But I don’t think so. What do you mean the squirrels had to do it?”\n“Self-defense, is what they said about a million times.”\n“What? We never so much as kicked one!”\n“You have to think like a six-legged mauve squirrel of infinite time. The Ordinary Emperor was going to hunt them all down one by one and set the chronology of everything possible and impossible on fire. They set a contraption in motion so that he couldn’t touch them, a contraption involving you and me and a blue story and a Red Country where nobody dies, they just change clothes. They’re very tidy creatures. Don’t worry, we’re safe in the Red Country. There’ll probably be another war. The squirrels can’t fix that. They’re only little. But everyone always wants to conquer the Red Country and nobody ever has. We have a wall and it’s a really good one.”\nI twisted my head up to look at him, his plum-colored hair, his amethyst eyes, his stubborn chin. “You have to say what you mean here.”\n“I mean I love you. And I mean the infinite squirrels of space and time devoured me to save themselves from annihilation at the hands of a pepper grinder. I can mean both. It’s allowed.”\nI kissed Orchid Harm inside the skull of a giant rodent and we knew that we were both thinking about ice cream. The ruby bassoons hooted up from the piazza and scarlet tanagers scattered from the rooftops and a watercolor unicorn told a joke about the way tubas are way down the road but the echoes carried her voice up and up and everywhere. Orchid stopped the kiss first. He pointed to the smooth crimson roof of the eye socket.\nA long stripe of gold paint gleamed there.\nTHE END\nCatherynne M. Valente is the New York Times bestselling author of over two dozen works of fiction and poetry, including Palimpsest, the Orphan's Tales series, Deathless, Radiance, and the crowdfunded phenomenon The Girl Who Circumnavigated Fairyland in a Ship of Own Making (and the four books that followed it). She is the winner of the Andre Norton, Tiptree, Sturgeon, Prix Imaginales, Eugie Foster Memorial, Mythopoeic, Rhysling, Lambda, Locus, Romantic Times' Critics Choice and Hugo awards. She has been a finalist for the Nebula and World Fantasy Awards. She lives on an island off the coast of Maine with a small but growing menagerie of beasts, some of which are human."}