{"fingerprint": "ScsGOxR9Gr2AQDzRaSuaGnmlBfw=", "sitename": "Clarkesworld Magazine", "title": "The Long Goodnight of Violet Wild (Part 1) by Catherynne M. Valente", "author": "Catherynne M Valente", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/valente_01_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Long Goodnight of Violet Wild (Part 1) by Catherynne M. Valente", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5980 words, short story\nThe Long Goodnight of Violet Wild (Part 1 of 2)\nWinner: 2016 Eugie Foster Memorial Award for Short Fiction\n1: Violet\nI don’t know what stories are anymore so I don’t know how to tell you about the adventures of Woe-Be-Gone Nowgirl Violet Wild. In the Red Country, a story is a lot of words, one after the other, with conflict and resolution and a beginning, middle, and, most of the time, an end. But in the Blue Country, a story is a kind of dinosaur. You see how it gets confusing. I don’t know whether to begin by saying: Once upon a time a girl named Violet Wild rode a purple mammoth bareback through all the seven countries of world just to find a red dress that fit or by shooting you right in that sweet spot between your reptilian skull-plates. It’s a big decision. One false move and I’m breakfast.\nI expect Red Rules are safer. They usually are. Here we go then! Rifle to the shoulder, adjust the crosshairs, stare down the barrel, don’t dare breathe, don’t move a muscle and—\nViolet Wild is me. Just a kid with hair the color of raisins and eyes the color of grape jelly, living the life glasstastic in a four-bedroom wine bottle on the east end of Plum Pudding, the only electrified city in the Country of Purple. Bottle architecture was hotter than fried gold back then—and when the sunset slung itself against all those bright glass doors the bluffs just turned into a glitterbomb firework and everyone went staggering home with lavender light stuck to their coats. I got myself born like everybody else in P-Town: Mummery wrote a perfect sentence, so perfect and beautiful and fabulously punctuated that when she finished it, there was a baby floating in the ink pot and that was that. You have to be careful what you write in Plum Pudding. An accidentally glorious grocery list could net you twins. For this reason, the most famous novel in the Country of Purple begins: It is a truth universally acknowledged, umbrella grouchy eggs. I guess the author had too much to worry about already.\nThat was about the last perfect thing anybody did concerning myself. Oh, it was a fabulously punctuated life I had—Mums was a Clarinaut, Papo was a Nowboy, and you never saw a house more like a toybox than the bottle at 15 Portwine Place, chock full of gadgets and nonsense from parts unknown, art that came down off the walls for breakfast, visits from the Ordinary Emperor, and on some precious nights, gorgeous people in lavender suits and sweet potato ice cream gowns giggling through mouthfuls of mulberry schnapps over how much tastier were Orange Country cocktails and how much more belligerent were Green Country cockatiels. We had piles of carousel horse steaks and mugs of foamy creme de violette on our wide glass table every night. Trouble was, Mums was a Clarinaut and Papa was a Nowboy, so I mostly ate and drank it on my lonesome, or with the Sacred Sparrowbone Mask of the Incarnadine Fisherwomen and the watercolor unicorns from Still Life with Banana Tree, Unicorns, and Murdered Tuba, who came down off the living room wall some mornings in hopes of coffee and cereal with marshmallows. Mummery brought them back from her expeditions, landing her crystal clarinet, the good ship Eggplant, in the garden in a shower of prismy bubbles, her long arms full of poison darts, portraiture, explosives that look exactly like tea kettles and lollipops that look exactly like explosives. And then she’d take off again, with a sort of confused-confounded glance down at me, as though every time she came home, it was a shock to remember that I’d ever been born.\n“You could ask to go with her, you know,” said the Sacred Sparrowbone Mask of the Incarnadine Fisherwomen once, tipping the spiral-swirl of her carved mouth toward a bowl of bruise-black coffee, careful to keep its scruff of bloodgull feathers combed back and out of the way.\n“We agree,” piped up the watercolor unicorns, nosing at a pillowcase I’d filled with marshmallow cereal for them. “You could be her First Mate, see the crass and colorful world by clarinet. It’s romantic.”\n“You think everything’s romantic,” I sighed. Watercolor unicorns have hearts like soap operas that never end, and when they gallop it looks like crying. “But it wouldn’t be. It would be like traveling with a snowman who keeps looking at you like you’re a lit torch.”\nSo I guess it’s no surprise I went out to the herds with Papo as soon as I could. I could ride a pony by the time I got a handle on finger painting—great jeweled beasts escaped from some primeval carousel beyond the walls of time. There’s a horn stuck all the way through them, bone or antler or both, and they leap across the Past Perfect Plains on it like a sharp white foot, leaving holes in the earth like ellipses. They’re vicious and wily and they bite like it’s their one passion in life, but they’re the only horses strong and fast enough to ride down the present just as it’s becoming the future and lasso it down. And in the Country of Purple, the minutes and hours of present-future-happening look an awful lot like overgrown pregnant six-legged mauve squirrels. They’re pregnant all the time, but they never give birth, on account of how they’re pregnant with tomorrow and a year from now and alternate universes where everyone is half-bat. When a squirrel comes to term, she just winks out like a squashed cigarette. That’s the Nowboy life. Saddle up with the sun and bring in tomorrow’s herd—or next week’s or next decade’s. If we didn’t, those nasty little rodents would run wild all over the place. Plays would close three years before they open, Wednesdays would go on strike, and a century of Halloweens would happen all at once during one poor bedraggled lunch break. It’s hard, dusty work, but Papo always says if you don’t ride the present like the devil it’ll get right away from you because it’s a feral little creature with a terrible personality and no natural predators.\nSo that’s who I was before the six-legged squirrels of the present turned around and spat in my face. I was called Violet and I lived in a purple world and I had ardors for my Papo, my magenta pony Stopwatch even though he bit me several times and once semi-fatally, a bone mask, and a watercolor painting. But I only loved a boy named Orchid Harm, who I haven’t mentioned yet because when everything ever is about one thing, sometimes it’s hard to name it. But let’s be plain: I don’t know what love is anymore, either. In the Red Country, when you say you love someone, it means you need them. You desire them. You look after them and yearn achingly for them when they’re away down at the shops. But in the Country of Purple, when you say you love someone, it means you killed them. For a long time, that’s what I thought it meant everywhere.\nI only ever had one friend who was a person. His name was Orchid Harm. He could read faster than anyone I ever met and he kissed as fast as reading. He had hair the color of beetroot and eyes the color of mangosteen and he was a Sunslinger like his Papo before him. They caught sunshine in buckets all over Plum Pudding, mixed it with sugar and lorikeet eggs and fermented it into something not even a little bit legal. Orchid had nothing to do all day while the sun dripped down into his stills. He used to strap on a wash-basket full of books and shimmy up onto the roof of the opera house, which is actually a giantess’s skull with moss and tourmalines living all over it, scoot down into the curve of the left eye socket, and read seven books before twilight. No more, no less. He liked anything that came in sevens. I only came in ones, but he liked me anyway.\nWe met when his parents came to our bottle all covered in glitter and the smell of excitingly dodgy money to drink Mummery’s schnapps and listen to Papo’s Nowboy songs played on a real zanfona box with a squirrel-leg handle. It was a marquee night in Mummery’s career—the Ordinary Emperor had promised to come, he who tells all our lives which way to run. Everyone kept peering at brandy snifters, tea kettles, fire pokers, bracelets, books on our high glass shelves. When—and where—would the Little Man make his entrance? Oh, Mauve, do you remember, when he came to our to-do, he was my wife’s left-hand glove, the one she’d lost in the chaise cushions months ago!\nAnd then a jar of dried pasta grew a face and said: “What a pleasure it is to see so many of my most illustrious subject gathered all together in this fine home,” but I didn’t care because I was seven.\nYou see, the Ordinary Emperor can be anything he likes, as long as it’s nothing you’d expect an Emperor to ever want to be. At any moment, anything you own could turn into the Emperor and he’d know everything you’d ever done with it—every mirror you’d ever hung and then cried in because you hated your own face, or candle you ever lit because you were up late doing something dastard, or worse, or better. It’s unsettling and that’s a fact.\nOrchid was only little and so was I. While Mums cooed over the Emperor of Dried Pasta, I sat with my knees up by the hearth, feeding escargot to one of the watercolor unicorns. They can’t get enough of escargot, even though it gives them horrible runny creamsicle-shits. This is the first thing Orchid ever said to me:\n“I like your unicorn. Pink and green feel good on my eyes. I think I know who painted it but I don’t want you to think I’m a know-it-all so I won’t say even though I really want to say because I read a whole book about her and knowing things is nicer when somebody else knows you know them.”\n“I call her Jellyfish even though that’s not her name. You can pet her but you have to let her smell your hand first. You can say who painted it if you want. Mums told me when she brought it home from Yellow Country, but I forgot.” I didn’t forget. I never got the hang of forgetting things the way other people do.\nOrchid let Jellyfish snuffle his palm with her runny rosy nose.\n“Do you have snails?” the watercolor unicorn asked. “They’re very romantic.”\nOrchid didn’t, but he had a glass of blackberry champagne because his parents let him drink what they drank and eat what they ate and read what they read and do what they did, which I thought was the best thing I had ever heard. Jellyfish slurped it up.\n“A lady named Ochreous Wince painted me and the tuba and the banana tree and all my brothers and sisters about a hundred years ago, if you want to know. She was a drunk and she had a lot of dogs,” Jellyfish sniffed when she was done, and jumped back up into her frame in a puff of rosewater smoke.\n“Show me someplace that your parents don’t know about,” said Orchid. I took him to my room and made him crawl under my bed. It was stuffy and close down there, and I’m not very tidy. Orchid waited. He was good at waiting. I rolled over and pointed to the underside of my bed. On one of the slats I’d painted a single stripe of gold paint.\n“Where?” he breathed. He put his hand on it. I put my hand on his.\n“I stole it from Mummery’s ship when she was busy being given the key to the city.”\n“She already lives here.”\n“I know.”\nAfter that, Orchid started going out with Papo and me sometimes, out beyond the city walls and onto the dry, flat Past Perfect Plains where the thousand squirrels that are every future and present and past scrabbled and screamed and thrashed their fluffy tails in the air. I shouldn’t have let him, but knowing things is nicer when somebody else knows you know them. By the time the worst thing in the world happened, Orchid Harm could play Bury Me on the Prairie with a Squirrel in my Fist on the zanfona box as well as Papo or me. He helped a blackberry-colored mare named Early-to-Tea get born and she followed him around like a lovesick tiger, biting his shoulders and hopping in circles until he gave up and learned to ride her.\nI don’t want to say this part. I wish this were the kind of story that’s a blue dinosaur munching up blueberries with a brain in its head and a brain in its tail so it never forgets how big it is. But I have to or the rest of it won’t make sense. Okay, calm down, I’m doing it. Rifle up.\nThe day of the worst thing in the world was long and hot and bright, packed so full of summer autumn seeped out through the stitches. We’d ridden out further than usual—the ponies ran like they had thorns in their bellies and the stupid squirrels kept going at each other like mad, whacking their purple heads together and tail-wrestling and spitting paradoxes through clenched teeth. I wanted to give them some real space, something fresh to graze on. Maybe if they ate enough they’d just lay down in the heat and hold their little bellies in their paws and concentrate on breathing like any sane animal. Papo stayed behind to see to a doe mewling and foaming at the mouth, trying to pass a chronology stone. She kept coughing up chunks of the Ordinary Emperor’s profligate youth, his wartime speeches and night terrors echoing out of her rodent-mouth across the prairie.\nWe rode so far, Orchid and me, bouncing across the cracked purple desert on Stopwatch and Early-to-Tea, that we couldn’t even see the lights of Plum Pudding anymore, couldn’t see anything but the plains spreading out like an inkstain. That far into the wilds, the world wasn’t really purple anymore. It turned to indigo, the dark, windy borderlands where the desert looks like an ocean and the twisted-up trees are the color of lightning. And then, just when I was about to tell Orchid how much I liked the shadow of his cheekbones by indigo light, the Blue Country happened, right in front of us. That’s the only way I can say it where it seems right to me. I’d never seen a border before. Somehow I always thought there would be a wall, or guards with spears and pom-poms on their shoes, or at least a sign. But it was just a line in the land, and on this side everything was purple and on that side everything was blue. The earth was still thirsty and spidered up with fine cracks like a soft boiled egg just before you stick your spoon in, but instead of the deep indigo night-steppe or the bright purple pampas, long aquamarine salt flats stretched out before us, speckled with blueberry brambles and sapphire tumbleweeds and skittering blue crabs. The Blue Country smelled like hot corn and cold snow. All the mauve time-squirrels skidded up short, sniffing the blue-indigo line suspiciously.\nWe let Stopwatch and Early-to-Tea bounce off after the crabs. The carousel ponies roared joyfully and hopped to it, skewering the cerulean crustacean shells with their bone poles, each gnawing the meat and claws off the other’s spike. The sun caromed off the gems on their rump. Orchid and I just watched the blue.\n“Didn’t you ever want to see this, Violet? Go to all other places that exist in the universe, like your Mummery?” he said at last. “Didn’t you ever watch her clarinet take off and feel like you’d die if you didn’t see what she saw? I feel like I’ll die if I don’t see something new. Something better than sunshine in a bucket.”\nOff in the distance, I could see a pack of stories slurping at a watering hole, their long spine-plates standing against the setting sun like broken fences.\n“Do you want to know a secret?” I said. I didn’t wait for him to answer. Orchid always wanted to know secrets. “I dream in gold. When I’m asleep I don’t even know what purple is. And one time I actually packed a suitcase and went to the train station and bought a ticket to the Yellow Country with money I got from selling all my chess sets. But when I got there and the conductor was showing me to my seat I just knew how proud Mums would be. I could see her stupid face telling her friends about her daughter running off on an adventure. Darling, the plum doesn’t fall far from the tree, don’t you know? Violet’s just like a little photograph of me, don’t you think? Well, the point is: fuck her, I guess.”\n“You were going to go without me?”\nAnd my guts were full of shame, because I hadn’t even thought of him that day, not when I put on my stockings or my hat, not when I marched into a taxi and told him to take me to Heliotrope Station, not when I bought my ticket for one. I just wanted to go. Which meant I was a little photograph of her, after all. I kissed him, to make it better. We liked kissing. We’d discovered it together. We’d discussed it and we were fairly certain no one in the world did it as well as we did. When Orchid and me kissed, we always knew what the other was thinking, and just then we knew that the other was thinking that we had two horses and could go now, right now, across the border and through the crabs and blueberries and stories and hot corn air. We’d read in our books, curled up together, holding hands and feet, in the eye socket of the opera house, that all the fish in the Blue Country could talk, and all the people had eyes the color of peacock feathers, and you could make babies by singing an aria so perfectly that when you were done, there would be a kid in the sheet music, and that would be that, so The Cyan Sigh can never be performed on-key unless the soprano is ready for the responsibility. And in the Blue Country, all the cities were electrified, just like us.\nWe were happy and we were going to run away together. So the squirrels ate him.\nOrchid and I jumped over the border like a broomstick and when our feet came down the squirrels screeched and rushed forward, biting our heels, slashing our legs with their six clawed feet, spitting bile in our faces. Well, I thought it was our faces, our heels, our legs. I thought they were gunning for both of us. But it was Orchid they wanted. The squirrels slashed open his ankles so he’d fall down to their level, and then they bit off his fingers. I tried to pull and kick them off but there were so many, and you can’t kill a plains-squirrel. You just can’t. You might stab the rest of your life. You might break a half-bat universe’s neck. You might end the whole world. I lay over Orchid so they couldn’t get to him but all that meant was they dug out one of my kidneys and I was holding him when they chewed out his throat and I kissed him because when we kissed we always knew what the other was thinking and I don’t want to talk about this anymore.\n2: Blue\nPapo never said anything. Neither did I. Jellyfish and the other watercolor unicorns each cut off a bit of their tails and stuck them together to make a watercolor orchid in the bottom left corner of the painting. It looked like a five-year-old with a head injury drew it with her feet and it ruined the whole composition. Orcheous Wince would have sicced her dogs on it. But no matter how Mummery fumed, they wouldn’t put their tails back where they belonged. The Sacred Sparrowbone Mask of the Incarnadine Fisherwomen just said: “I like being a mask better than I’d like being a face, I think. But if you want, you can put me on and I’ll be your face if you don’t want anyone to see what you look like on the inside right now. Because everyone can see.”\nOrchid’s father gave me a creme-pot full of sunslung booze. I went up to the eye socket of the opera house and drank and drank but the pot never seemed to dry up. Good. Everything had a shine on it when I drank the sun. Everything had a heart that only I could see. Everything tasted like Orchid Harm, because he always tasted like the whole of the sun.\nOnce, I rode out on Stopwatch across the indigo borderlands again, up to the line in the earth where it all goes blue. I could see, I thought I could see, the haze of cornflower light over Lizard Tongue, the city that started as a wedding two hundred years ago and the party just never stopped. Stopwatch turned his big magenta head around and bit my hand—but softly. Hardly a bite at all.\nI looked down. All the squirrels, pregnant with futures and purple with the present, thousands of them, stood on their hind legs around my pony’s spike, staring up at me in silence like the death of time.\nThe day the rest of it happened, the squirrels were particularly depraved. I caught three shredding each other’s bellies to ribbons behind a sun-broiled rock, blood and fur and yesterdays everywhere. I tried to pull them apart but I didn’t try very hard because I never did anymore. They all died anyway, and I got long scratches all up and down my arms for my trouble. I’d have to go and get an inoculation. Half of them are rabid and the other half are lousy with regret. I looked at my arms, already starting to scab up. I am a champion coagulator. All the way home I picked them open again and again. So I didn’t notice anyone following me back into P-Town, up through the heights and the sunset on the wine bottle houses, through the narrow lilac streets while the plummy streetlamps came on one at a time. I was almost home before I heard the other footsteps. The bells of St. Murex bonged out their lonely moans and I could almost hear Mummery’s voice, rich as soup, laughing at her own jokes by the glass hearth. But I did hear, finally, a sound, a such-soft sound, like a girl’s hair falling, as it’s cut, onto a floor of ice. I turned around and saw a funny little beastie behind me, staring at me with clear lantern-fish eyes.\nThe thing looked some fair bit like a woolly mammoth, if a mammoth could shrink down to the size of a curly wolfhound, with long indigo fur that faded into pale, pale lavender, almost white, over its four feet and the tip of its trunk, which curled up into the shape of a question mark. But on either side, where a mammoth would have flanks and ribs and the bulge of its elephant belly, my creeper had cabinet doors, locked tight, the color of dark cabbages with neat white trim and silver hinges. I looked at my sorrow and it looked at me. Our dark eyes were the same eyes, and that’s how I knew it was mine.\n“I love you,” it said.\nBut Mummery said: “Don’t you dare let that thing in the house.” She was home for once, so she thought she could make rules. “It’s filthy; I won’t have it. Look how it’s upsetting the unicorns!” The poor things were snorting and stampeding terribly in their frame, squashing watercolor bananas as they tumbled off the watercolor tree.\n“Let it sleep in the garden, Mauve. Come back to me,” said a box of matchsticks, for that night Mums was busy that night, being very important and desirable company. She was entertaining the Ordinary Emperor alone. I peered over into the box—every matchstick was carved in the shape of a tiny man with a shock of blue sulfuric hair that would strike on any surface. When he was here last month, the Ordinary Emperor was our downstairs hammer. I think the Ordinary Emperor wanted to seduce my mother. He showed up a lot during the mating season when Papo slept out on the range.\n“What on earth is it?” sniffed Mummery, lifting a flute of mulberry schnapps to her lips as though nobody had ever died in the history of the world.\n“Light me, my darling,” cried the Ordinary Emperor, and she did, striking his head on the mantle and bringing him in close to the tiny mammoth’s face. It didn’t blink or cringe away, even though it had a burning monarch and a great dumb Mummery-face right up against its trunk.\n“Why, it’s a sorrow,” the Ordinary Emperor whistled. “I thought they were extinct. I told them to be extinct ages ago. Naughty Nellies. Do you know, in the Red Country, sorrow means grief and pain and horror and loss? It’s a decadent place. Everything tastes like cranberries, even the roast beef.”\nThat was the first thing the Ordinary Emperor ever said to me alone. Mums knew very well what sorrow meant where the sun sets red. Then he said a second thing:\n“You are more beautiful than your mother.”\nThat’s the kind of Emperor the Matchstick Man is, in seven words. But Mummery fell for it and glowered at me with her great famous moonshadow eyes.\nBut my sorrow was not extinct. My sorrow was hungry. I put it out in the garden and locked the fence. I filled an agate bowl with the mushrooms we grow on the carcass of a jacaranda tree that used to grow by the kitchen window and water from our private well. I meant to leave it to its dinner, but for whatever reason my body ever decides to do things, I sat down with it instead, in the shadow of Mummery’s crystal clarinet, parked between the roses and the lobelias. The breeze made soft, half-melodic notes as it blew over the Eggplant’s portholes. A few iridescent fuel-bubbles popped free of the bell.\nMy sorrow ate so daintily, picking up each lacecap mushroom with its trunk, turning it around twice, and placing it on its outstretched ultraviolet tongue. It couldn’t get its mouth in the right place to drink. I cupped my hands and dipped them into the clear water and held them up to my sorrow. Its tongue slipped against my palms three times as it lapped. I stroked my sorrow’s fur and we watched the garden wall come alive with moonflowers opening like pale happy mouths in the night wind off of the Cutglass River. My sorrow was soft as fish frills. I didn’t want to hurt its pride by looking, so I decided she was a girl, like me.\n“I love you,” my sorrow said, and she put her soft mouth over my ravaged arms. She opened the wounds again with her tongue and licked up the purple blood that seeped out of the depths of me. I kept stroking her spine and the warm wood of the cabinet doors in her belly. I pulled gently at their handles, but they would not open.\n“It’s ok if you love me,” I whispered. “I forgive you.”\nBut she didn’t love me, not then, or not enough. I woke up in the morning in my own bed. My sorrow slept curled into the curve of my sleep. When she snored it sounded like the river-wind blowing over my mother’s ship. I tried to get up. But the floor of my bedroom was covered in sleeping squirrels, a mauve blanket of a hundred unhappened futures. When I put my bare feet on the floor, they scattered like buckshot.\nI came downstairs reeking of sorrowmusk and futureshit. Mummery was already gone; Papo had never come home. Instead of anyone who lived with me, a stranger stood in our kitchen, fixing himself coffee. He was short but very slim and handsome, shaven, with brilliant hair of every color, even green, even burgundy, even gold, tied back with one of my velvet ribbons. He wore a doublet and hose like an actor or a lawyer, and when he turned to search for the cream, I could see a beautiful chest peeking out from beneath an apricot silk shirt. The unfamiliar colors of him made my eyes throb, painfully, then hungrily, starving for his emerald, his orange, his cobalt, even his brown and black. His gold. The stranger noticed me suddenly, fixing his eyes, the same shocking spatter of all possible colors as his hair, on my face.\n“You’re naked,” I said before I could remember to be polite. I don’t know how I knew it, but I did. I had caught the Ordinary Emperor naked, unhidden in any oddjob object, the morning after he’d probably ridden Mummery like Stopwatch.\nOne imperial eyebrow lifted in amusement.\n“So are you,” he said.\nI don’t sleep with clothes on. I don’t see why I should strangle myself in a nightdress just so my dreams won’t see my tits. I think his majesty expected me to blush and cover myself with my hands, but I didn’t care. If Orchid could never see my skin again, what did it matter who else did? So we stood there, looking at each other like stories at a watering hole. The Ordinary Emperor had an expression on that only people like Mummery understand, the kind of unplain stare that carries a hundred footnotes to its desire.\nThe king blinked first. He vanished from the kitchen and became our chandelier. Every teardrop-shaped jewel was an eye, every lightbulb was a mouth. I looked up at the blaze of him and drank his coffee. He took it sweet, mostly cream and honey, with only a lash of coffee hiding somewhere in the thick of it.\n“Defiant girl, who raised you?” hissed the Sacred Sparrowbone Mask of the Incarnadine Fisherwomen.\n“You know who,” I snorted, and even the chandelier laughed.\n“Good morning, Violet,” the lightbulbs said, flashing blue, garnet, lime green with each word. “If you give me your sorrow, I shall see it safely executed. They are pests, like milkweed or uncles. You are far too young and lovely to have a boil like that leaking all over your face.”\nI looked down. My sorrow had followed me without the smallest sound, and sat on her haunches beside my feet, staring up at me with those deepwater eyes. I held out the Emperor’s coffee cup so she could sip.\n“Do you really know everything that happens in all your countries?” I asked him. There really is nothing like a man hopping on top of your mother to make him seem altogether less frightening and a little pitiful.\n“I don’t know it all at once. But if I want to know it, I can lean toward it and it will lean toward me and then I know it better than you know your favorite lullaby.” The Ordinary Emperor burned so brightly in our chandelier. Light bloomed out of the crystals, hot, dappled, harlequin light, pouring down onto my skin, turning me all those colors, all his spun-sugar patchwork. I didn’t like it. His light on me felt like hands. It burned me; it clutched me, it petted me like a cat. I loved it. I was drowning in my dream of gold. My bones creaked for more. I wanted to wash it off forever.\nI closed my eyes. I could still see the prisms of the Emperor. “What does death mean in the Red Country?” I whispered.\n“It is a kind of dress with a long train that trails behind it and a neckline that plunges to the navel. Death is the color of garnets and is very hard to dance in.” The eyes in my chandelier looked kind. We have a dress like that, too. It is the color of hyacinths and it is called need. “I know what you’re asking, darling. And if you go to the Red Country you may find Orchid laughing there and wearing a red dress. It is possible. The dead here often go there, to Incarnadine, where the fisherwomen punt along the Rubicund, fishing for hope. The Red Country is not for you, Violet. The dead are very exclusive.”\nAnd then I said it, to the king of everything, the hope buried under the concrete at the bottom of me: “Doesn’t it seem to you that a body eaten by the present becoming the future shouldn’t really be dead? Shouldn’t he just be waiting for me in tomorrow?”\n“That I cannot tell you. It doesn’t make much sense to me, though. Eaten is eaten. Your pampas squirrels are not my subjects. They are not my countries. They are time, and time eats everything but listens to no one. The digestive systems of squirrels are unreliable at best. I know it is painful to hear, but time devours all love affairs. It is unavoidable. The Red Country is so much larger than the others. And you, Violet Wild, you specifically, do not have rights of passage through any of my nations. Stay put and do as your Mummery tells you. You are such a trial to her, you know.”\nThe Ordinary Emperor snuffed abruptly out and the wine bottle went dark. The watercolor unicorns whinnied fearfully. The Sacred Sparrowbone Mask of the Incarnadine Fisherwomen turned its face to the wall. In the shallow cup of her other side, a last mauve squirrel hid away the great exodus from my bedroom. She held her tail up over her little face and whispered:\n“I won’t say even though I really want to say.”\nMy sorrow tugged my fingers with her trunk. “I love you,” she said again, and this time I shivered. I believed her, and I did not live in the Red Country where love means longing. “If you let me, I can be so big.”\nMy sorrow twisted her trunk around her own neck and squeezed. She grew like a wetness spreading through cloth. Taller than me, and then taller than the cabinets, and then taller than the chandelier. She lowered her purple trunk to me like a ladder.\nI don’t know what stories are anymore. I don’t know how fast sorrow can move and I don’t know how squirrels work. But I am wearing my best need and a bone face over mine so no one can see what my insides look like. I can see already the blue crabs waving their claws to the blue sky, I can see the lights of Lizard Tongue and hear the wedding bells playing their millionth song. I am going on the back of my sorrow, further than Mummery ever did, to a place where love is love, stories have ends, and death is a red dress.\nA stream of rabid, pregnant, time-squirrels races after me. I hope the crabs get them all.\nCatherynne M. Valente is the New York Times bestselling author of over two dozen works of fiction and poetry, including Palimpsest, the Orphan's Tales series, Deathless, Radiance, and the crowdfunded phenomenon The Girl Who Circumnavigated Fairyland in a Ship of Own Making (and the four books that followed it). She is the winner of the Andre Norton, Tiptree, Sturgeon, Prix Imaginales, Eugie Foster Memorial, Mythopoeic, Rhysling, Lambda, Locus, Romantic Times' Critics Choice and Hugo awards. She has been a finalist for the Nebula and World Fantasy Awards. She lives on an island off the coast of Maine with a small but growing menagerie of beasts, some of which are human."}