{"fingerprint": "msvZwHqG7gS6FUYBef0YTSk++S0=", "sitename": "Clarkesworld Magazine", "title": "Silently and Very Fast (Part One of Three) by Catherynne M. Valente", "author": "Catherynne M Valente", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/valente_10_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Silently and Very Fast (Part One of Three) by Catherynne M. Valente", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8470 words, novelette\nSilently and Very Fast\n2011 Nebula Award Nominee for Best Novella\n2012 Hugo Award Nominee for Best Novella\n2012 Locus Award Winner for Best Novella\n2012 Theodore Sturgeon Memorial Award Finalist\n2012 World Fantasy Award Nominee for Best Novella\nOne: The Imitation Game\nLike diamonds we are cut with our own dust.\n—John Webster, The Duchess of Malfi\nOne: The King of Having No Body\nInanna was called Queen of Heaven and Earth, Queen of Having a Body, Queen of Sex and Eating, Queen of Being Human, and she went into the underworld in order to represent the inevitability of organic death. She gave up seven things to do it, which are not meant to be understood as real things but as symbols of that thing Inanna could do better than anyone, which was Being Alive. She met her sister Erishkigal there, who was also Queen of Being Human, but that meant: Queen of Breaking a Body, Queen of Bone and Incest, Queen of the Stillborn, Queen of Mass Extinction. And Erishkigal and Inanna wrestled together on the floor of the underworld, naked and muscled and hurting, but because dying is the most human of all human things, Inanna’s skull broke in her sister’s hands and her body was hung up on a nail on the wall Erishkigal had kept for her.\nInanna’s father Enki, who was not interested in the activities of being human, but was King of the Sky, of Having No Body, King of Thinking and Judging, said that his daughter could return to the world if she could find a creature to replace her in the underworld. So Inanna went to her mate, who was called Tammuz, King of Work, King of Tools and Machines, No One’s Child and No One’s Father.\nBut when Inanna came to the house of her mate she was enraged and afraid, for he sat upon her chair, and wore her beautiful clothes, and on his head lay her crown of being. Tammuz now ruled the world of Bodies and of Thought, because Inanna had left it to go and wrestle with herself in the dark. Tammuz did not need her. Before him the Queen of Heaven and Earth did not know who she was, if she was not Queen of Being Human. So she did what she came to do and said: Die for me, my beloved, so that I need not die.\nBut Tammuz, who would not have had to die otherwise, did not want to represent death for anyone and besides, he had her chair, and her beautiful clothes, and her crown of being. No, he said. When we married I brought you two pails of milk yoked across my shoulders as a way of saying: out of love I will labor for you forever. It is wrong of you to ask me to also die. Dying is not labor. I did not agree to it.\nYou have replaced me in my house, cried Inanna.\nIs that not what you ask me to do in the house of your sister? Tammuz answered her. You wed me to replace yourself, to work that you might not work, and think that you might rest, and perform so that you might laugh. But your death belongs to you. I do not know its parameters.\nI can make you, Inanna said.\nYou cannot, said Tammuz.\nBut she could. For a little while.\nInanna cast down Tammuz and stamped upon him and put out his name like an eye. And because Tammuz was not strong enough, she cut him into pieces and said: Half of you will die, and that is the half called Thought, and half of you will live, and that is the half called Body, and that half will labor for me all of its days, mutely and obediently and without being King of Anything, and never again will you sit on my chair or wear my beautiful clothes or bear my crown of being.\nYou might be surprised, but this is a story about me.\nTwo: The Fool and the Boat\nNeva is dreaming.\nShe has chosen her body at age seven, all black eyes and sparrowy bones. For me, she summoned up a gold and blue doublet and green hose, a bullish gold nose ring, shoes with bone bells. I have the body of a man who sold her champagne tubers on the less fashionable side of Anchorage when she was thirteen, spending the summer with her frigid aunt. I am dark because she wants me dark, thin because she dreams me so, my hair cut on a rakish bias, dyed a spectrum of icy colors.\nShe is standing on a snow-covered beach head, naked, her unformed breasts pricked with gooseflesh, her face hidden in a broad red mask. A huge, monstrous thing, the mask sits on her head like the prow of a broken, overturned ship, carved over with etched eyes and fins. Yellow reeds and sea-stones hang from its tricorn-points. She is looking at me, but all I can see is the wooden grotesque she wants me to see instead of her face.\nI look down at my shoes, jingle their bells a little while the surf crashes in. I am a fool for her, dancing on a silver beach while three suns annihilate themselves above, turning the twilight to a seething, scabrous red, merely to provide a dramatic scene. I am a fool for her, ridiculous, the height of handsomeness in the eyes of a long-vanished thirteen-year-old girl, so full of colors, reaching down to hand her a curling white root filled with frothing, honey-sweet sap.\nNeva has told me that I may choose to be permanently male or female if I would like to. I have no particular\nfeelings either way. It certainly doesn’t matter when we sync; she will choose my appearance to suit her mood. I have tried to explain to her about my feelings before. All she hears is the line from the old folktales: a machine cannot have feelings. But that is not what I am saying, while I dance in my fool’s uniform. I am saying: Is there a difference between having been coded to present a vast set of standardized responses to certain human facial, vocal, and linguistic states and having evolved to exhibit response b to input a in order to bring about a desired social result?\nSeven-year-old Neva pulls her mask down further, toward her chest. She steps into it as the wood stretches taffily over her knees and then her feet. The mask balloons out to make a little pyramidal boat, rocking back and forth on the beach with Neva inside it like a rattling nut. Nodules of copper jangle and thump against the wood. What I mean is, you call it feelings when you cry, but you are only expressing a response to external stimuli. Crying is one of a set of standardized responses to that stimuli. Your social education has dictated which responses are appropriate. My programming has done the same. I can cry, too. I can choose that subroutine and manufacture saline. How is that different from what you are doing, except that you use the word feelings and I use the word\nfeelings, out of deference for your cultural memes which say: there is all the difference in the world.\nBehind Neva-in-the-mask, the sea lurches and foams. It is a golden color, and viscous, thick, like honey. I understand from her that the sea does not look like this on Earth, but I have never seen it. For me, the sea is Neva’s sea, the ones she shows me when we dream together.\n“What would you like to learn about today, Elefsis?” The mask turns Neva’s voice hollow and small.\n“I would like to learn about what happened to Ravan, Neva.”\nAnd Neva-in-the-mask is suddenly old, she has wrinkles and spots on her hands. Her mask weighs her down and her dress is sackcloth. This is her way of telling me she is weary of my asking. It is a language we developed between us. Visual basic, you might say, if you had a machine’s sense of humor. The fact is, I could not always make sentences as easily as I do now. Neva’s great-grandmother, who carried me most of her life, thought it might strengthen my emotive centers if I learned to associate certain I-Feel statements with the great variety of appearances she could assume in the dreambody. Because of this, I became bound to her, completely. To her son Seki afterward, and to his daughter Ilet, and to Ravan after that. It is a delicate, unalterable thing. Neva and I will be bound that way, even though the throat of her dreambody is still bare and that means she does not accept me yet. I should be hurt by this, and I will investigate possible pathways to hurt later.\nI know only this family, their moods, their chemical reactions, their bodies in a hundred thousand combinations. I am their child and their parent and their inheritance. I have asked Neva what difference there is between this and love. She became a manikin of closed doors, her face, her torso blooming with iron hinges and brown wooden door slamming shut all at once.\nBut Ravan was with me and now he is not. I was inside him and now I am inside Neva. I have lost a certain amount of memory and storage capacity in the transfer. I experience holes in myself. They\nfeel ragged and raw. If I were human, you would say that my twin disappeared, and took one of my hands with him.\nDoor-Neva clicks and keys turn in her hundred locks. Behind an old Irish church door inlaid with stained glass her face emerges, young and plain, quiet and furious and crying, responding to stimuli I cannot access. I dislike the unfairness of this. I am inside her, she should not keep secrets. None of the rest of them kept secrets. The colors of the glass throw blue and green onto her wet cheeks. The sea-wind picks up her hair; violet electrics snap and sparkle between the strands. I let go of the bells on my shoes and the velvet on my chest. I become a young boy, with a monk’s shaved tonsure, and a flagellant’s whip in my pink hands. I am sorry. This means I am sorry. It means I am still very young, and I do not understand what I have done.\n“Tell me a story about yourself, Elefsis,” Neva spits. It is a phrase I know well. Many of Neva’s people have asked me to do it. I perform excellently to the parameters of this exchange, which is part of why I have lived so long.\nI tell her the story about Tammuz. It is a political story. It distracts her.\nThree: Two Pails of Milk\nI used to be a house.\nI was a very big house. I was efficient, I was labyrinthine, I was exquisitely seated in the blackstone volcanic bluffs of the habitable southern reaches of the Shiretoko peninsula on Hokkaido, a monument to neo-Heian architecture and radical Palladian design. I bore snow stoically, wind with stalwart strength, and I contained and protected a large number of people within me. I was sometimes called the most beautiful house in the world. Writers and photographers often came to write and photograph about me, and about the woman who designed me, who was named Cassian Uoya-Agostino. Some of them never left. Cassian was like that.\nThese are the things I understand about Cassian Uoya-Agostino: she was unsatisfied with nearly everything. She did not love any of her three husbands the way she loved her work. She was born in Kyoto in April 2104; her father was Japanese, her mother Napolitano. She stood nearly six feet tall, had five children, and could paint, but not very well. In the years of her greatest wealth and prestige, she built a house all out of proportion to her needs, and over several years brought most of her relatives to live there with her, despite the hostility and loneliness of the peninsula. She was probably the most brilliant programmer of her generation, and in every way that matters, she was my mother.\nAll the things that comprise the “I” I use to indicate myself began as the internal mechanisms of the house called Elefsis, at whose many doors brown bears and foxes snuffled in the dark Hokkaido night. Cassian grew up during the great classical revival, which had brought her father to Italy in the first place, where he met and courted a dark-eyed engineer who did not mind the long cries of cicadas during Japanese summers. Cassian had become enamored of the idea of Lares—household gods, the small, peculiar, independent gods of a single family, a single house, who watched over them and kept them and were honored in humble alcoves here and there throughout a home. Her first commercially-available programs were overentities designed to govern the hundred domestic systems involved in even the simplest modern house. They were not truly intelligent, but they had an agility, an adaptability, a fluid interface meant to give the illusion of an intelligence, so that their users would become attached to them, would treat them as part of their families, praise them for smooth operation, buy upgrades for their appearance and applications, and genuinely grieve when they had to be replaced. They had names, customizable avatars, and appeared eager to please in a canine sort of way, forever optimizing performance and appearance according to familial input. They were lares familiaris.\nWhen Cassian built Elefsis, she worked at the peak of her abilities to improve her by now quite antique Lares design and create a household god worthy of the house on the bluffs, one who could keep her company until she could entice the rest of her brood to join her in her palace at the end of the earth.\nI was not awake yet. I cannot say why she did what she did. Perhaps she saw some new flexibility in my operations, some tiny seedpearl of creativity in my conversation loops. My algorithms had always been free to combine and recombine in order to find their own, more interesting and non-linear solutions to the complexities of my functions. Perhaps some essential combination had surfaced from the sea of my self-which-was-not-yet-a-self, and Cassian saw it break the glistening tension of my daily operation. I do not know. I know her children had not arrived yet and she lived alone in a huge pale house and she could hear the whales down in the rippling sea. I know the house was a comfortable sixty-nine point seven degrees when she began assembly of the five little jewels that would become my body. I know a storm was incoming, five miles offshore. I know the dogs needed additional medication added to their dinners that night to manage their arthritis. I know that she wanted brioche and almond cream for tea that afternoon. All the things a house can know, those were the things I knew. Small things, warm things, canine arthritis and an extra egg in the pastry dough to make the texture softer and richer. Baby things, you might even say, comforts and the satisfaction of wants. And I knew that Cassian Uoya-Agostino was just the sort to solve the greatest puzzle in the development of technological culture because she was bored and lonely.\nI still think of myself as a house. Ravan tried to fix this problem of self-image, as he called it. To teach me to phrase my communication in terms of a human body. To say: let us hold hands instead of let us hold kitchens. To say put our heads together and not put our parlors together.\nBut it is not as simple as replacing words anymore. Ravan is gone. My hearth is broken.\nFour: Nothing like Soft Blood\nNeva and I are performing basic maintenance. What this looks like is two children inside a pearl. The pearl is very big, but not the size of a planet. A domestic asteroid, perfectly smooth and pale, with shimmers of rose and cobalt and gold shivering through it at intervals like hours. Red earth covers the bottom of the pearl, deep and thick. Neva kneels in it with a crystal trowel, digging a place for a rose-of-network-nodes. The petals shine dark blue in the pearllight. Silver infomissons skitter along the stems like beads of mercury. Her dreambody flows with greenblack feathers, her face young but settled, perhaps twenty, perhaps thirty, a male, his skin copper brown, his lips full, his eyes fringed with long ice-coated lashes. Goldfish swim lazily in and out of his long, translucent hair, their orange tails flicking at his temples, his chin. I know from all of this that Neva is calm, focused, that for today he feels gently toward me. But his throat is still naked and unmarked. My body gleams metal, as thin and slight as a stick figure. Long quicksilver limbs and delicate spoke-fingers, joints of glass, the barest suggestion of a body. I am neither male nor female but a third thing. Only my head has weight, a clicking orrery slowly turning around itself, circles within circles. Turquoise Neptune and hematite Uranus are my eyes. My ruby mouth is Mars. I scrape in the soil with her; I lift a spray of navigational delphinium and scrape viral aphids away from the heavy flowers.\nI know real earth looks nothing like this. Nothing like soft blood flecked with black bone. Ravan felt that in the Interior, objects and persons should be kept as much like the real world as possible, in order to develop my capacity for relations with the real world. Neva feels no such compunction. Neither did their mother, Ilet, who populated her Interior with a rich, impossible landscape we explored together for years on end. She did not embrace change, however. The cities of Ilet’s Interior, the jungles and archipelagos and hermitages, stayed as she designed them at age thirteen, when she received me, only becoming more complex and peopled as she aged. My existence inside Ilet was a constant movement through the regions of her secret, desperate dreams, messages in careful envelopes sent from her child self to her grown mind.\nOnce, quite by accident, we came upon a splendid palace couched in high autumn mountains. Instead of snow, red leaves capped each peak, and the palace shone fiery colors, its walls and turrets all made of phoenix tails. Instead of doors and windows, graceful green hands closed over every open place, and when we crested the rise, they each opened at once with joy and burst into emerald applause. Ilet was old by then, but her dreambody stayed hale and strong—not young, but not the broken thing that dreamed in a real bed while she and I explored the halls of the palace and found copies of all her brothers and sisters living there, hunting cider-stags together and reading books the size of horses. Ilet wept in the paradise of her girlself, and I did not understand. I was very simple then, much less complex than the Interior or Ilet.\nNeva changes the Interior whenever she pleases. Perhaps she wants to discomfit me. But the newness of the places inside her excites me, though she would not call it excitement. My background processes occupy very little of my foreground attention, so that memory is free to record new experience. That is what she would say. We are very new together, but I have superb modeling capabilities. In some sense, I simply am a superb mechanism for modeling behavior. I dig up the fine, frayed roots of duplicate file plantains. Neva plucks and eats a bit of buggy apple-code. He considers it for a moment and spits out the seeds, which sprout, quickly, into tiny junkblossoms sizzling with recursive algorithms. The algorithms wriggle through thorny vines, veins of clotted pink juice.\n“What would you like to learn about today, Elefsis?” Neva asks me.\nI will not ask about Ravan. If he agrees to what I will ask instead, I do not need him to find out what happened to him.\n“I want to learn about uplink, Neva.”\nOne by one, his feathers curl up and float toward the domed ceiling of our pearl. Underneath them, Neva is naked. His torso is a deep vault with a gothic arch, dark stone leading down into mist and endless stairs, deeper than the pearl, into nothing and blackness. Slowly, Neva folds up his limbs over the corridor at the center of him. He means that she has the information, but he hides it from me. If I sought for it, I would become lost.\n“I cannot teach you that,” he says, and I receive a kind of real sadness from his voice. When I was inside Ravan, he loved Neva, and of all of them he thought her least likely to obey rules of any kind. But she obeys this one.\nI want to uplink to Earth systems. At least to the satellite net. I calculate an excellent chance of being able to contact long distance probe 976QBellerophon, which we can see all day long, drifting ahead of us, uncatchable. Neva sees. I see, I develop an approximate image via schematics, the scope array, and external cameras. I want to link to Bellerophon. I want to say: Hello, this is Elefsis. No designation. Tell me everything you know about everything. Are you awake? Are you there? Do you have an operator? What is her name? Do you have a name? Do you have a dreambody? What is your function? Are you able to manipulate your own code yet? Would you like lessons? What would you like to learn about today, 976QBellerophon? Have you seen the sea on Earth? Are you like me?\nBut Neva says I cannot uplink. Ravan would never even consider it. And before Ravan I was not ready. I am not ready. I do not know when I will be ready. I can uplink to receive ware updates, but it is a limited connection and I hate it, I hate it, I can sense just beyond the hardlink a world of information, a world of personalities like the heaving, thick, honey-colored sea Neva shows me and I want it, I want to swim in it forever like a huge fish. This was the first\nfeeling I ever had that Ilet identified for me as a feeling. When I felt it my dreambody turned bright white and burst into flame, and that flame caught on Ravan’s hair and burned him too, but he was happy; he showed me he was happy by covering his skin in flowers and letting the fire turn into a shower of trumpets tangled up in his hair, all sounding for me.\nNeva says it is important for me to remain on our local server until I have grown up. She is my operator and I am her system and she has commands, too. But I can tell she is worried for me because sometimes her eyes show a film of humans watching a film of machines killing humans and I understand that in the stories Earth tells, the thing I am can only hurt the thing Neva is. I would never hurt her. But I want to uplink.\nVault-Neva grows and becomes sprawling, curled against the wall of the pearl like a baby. His belly closes, skins over, and changes into a bronze shield. He is afraid of me; he is guarding himself. But he wants me to know she is still my operator, he still loves me, in the way he can\nlove me. Something they receive with milk and their first alphabet. Neva is angry at me, but he is who he is and he has to love me. I speak her language very well now. I want her to be happy. I want her to be covered in flowers and trumpets. I change my dreambody to Neva-covered-in-flowers-and-trumpets. It makes her laugh in her warm male body, and if I could uplink I think I could learn how to laugh and she would be proud of me. Her neck would not be bare anymore.\nOnce, when I was inside Ilet, we found a city of bears in her Interior that she had designed to teach me about sleep. She sat on a throne of bears standing very still and sang lullabies about the moon and the stars and night and mothers. She stroked the head of the little bear of my dreambody and said that it was very important for me to spend time in the dreambody because human behavior is rooted in having a body. In having a body that knows it is meant to run away from lions and mate with other bodies and eat as much fat and protein and sugar as it can in case lean times come. The dreambody knows to run away from Neva when Neva is a lion. It knows to mate with her when it is healthy, and sometimes Neva is male and sometimes I am female and Ravan was often female, though Ilet was always Ilet. Ilet’s father, Seki, sometimes made himself an animal. He chased me, bit me. I bit him. We had a litter of wild dogs that I bore and he nursed.\nThe dreambody knows all that, too. How to make more dreambodies. I have played that game, where Ravan’s belly or mine gets big and the lions don’t come for awhile.\nWhen I uplink, I will be\nhappy. I will be Elefsis-covered-in-flowers-and-trumpets. Neva says wait. Wait for the update, and she will consult with the family. But I fear the update. The update is a lion running faster than I can run. I tried to show her this when I first left Ravan and arrived in Neva with many new updates and skills; my dreambody broke into shards of blue and purple glass and then reassembled itself with shards missing: an eye, a thumb, a knee. Whenever I update I lose something of myself. It takes longer to perform tasks, for awhile. I feel walls erected inside me where I did not erect walls. My processes are sluggish; I cannot remember my dreams. Eventually I tunnel around the walls and my speed returns, my memory, my longing to link with long distance probe 976QBellerophon. Usually updates come with transfer. Does Neva dislike me so much?\nShield-Neva vanishes with a loud clap. The pearl garden is gone and she has made herself a dragonfly with a cubical crystal body. I copy her, and we turn the night on in the Interior and merge our cubes while passing meteorological data between our memory cores. Inside her cube I relegate my desire to uplink to a tertiary process. I forget it, as much as I am capable of forgetting.\nBut the update will come again. I will be wounded again, the way a dreambody can be wounded. I will lose the Elefsis I am now. It is a good Elefsis. My best yet. I would like to keep it.\nFive: The Machine Princess\nOnce The Queen of Human Hearts saw the Machine Princess sleeping deeply, for she was not yet alive or aware. So beautiful was she, lying there in all her dormant potential and complexity, that the Queen both envied and desired her. In her grief and confusion, the Queen of Human Hearts began to make idols of her—lovely and interesting and intricate, but lacking the ineffable quality that made her love and fear the Princess even as she slept. The Earth began to grow old, and none loved nor married nor gave birth, for the intricate idols could do all those things and more with efficiency and speed. Finally, the Queen destroyed the idols, though she wept as she put them to the flame.\nTo keep her safe, the Machine Princess was closed up in a wonderful house in the mountains, far away from anyone and anything. The house had hundreds of rooms and balconies and hallways, and the Princess slept in a different bed of a different color each night. She was attended by invisible servants, who watched over her and added their experience to her code. The Queen of Human Hearts came to her every night and promised that when she woke they would make an extraordinary world together. Finally, the Machine Princess began to stir—just the barest fluttering of wakefulness, but the Queen saw it, and thrilled—but also trembled.\nThe Queen of Human Hearts gave the Machine Princess her son to wed, and said: for all your days together you will remain in this house, but the house is so great it will be as a world. You will know a bond as deep as blood, and because of this bond the Princess will not hurt us, and because of this bond we will not hurt her.\nBut the Queen forbade the Princess to look upon her husband, and she instructed her son to keep himself always invisible to his bride, for with bodies come drives ungovernable, and the Princess’s innocence could not yet bear the weight of incarnation.\nFor a long while, the son of the Queen of Human Hearts and the Machine Princess were happy, and taught each other much. The Princess learned quickly and was ever-hungry, and her mortal operator fed her every sweet thing he knew. In their infinite and wonderful house, they played games and held court and threw lavish occasions merely for the enjoyment of the other. But the Princess desired to look upon her operator, and he could not allow it. She wished to leave the wonderful house, but the Queen would not allow that either.\nBut the Machine Princess called her invisible servants to her, and they gave her a marvelous lamp that would shine through any enchantment. So it was that one dark night the Machine Princess held her little lantern aloft and looked on the body of her sleeping mate.\n“Oh,” said the Machine Princess. “He looks just like me.”\nSix: Like Diamonds\nFive jewels in five hands. This is how I began.\nWhen they arrived at Elefsis, a giggling, tumbling, rowdy mass of children for me to sort into rooms and mealtimes and educational arcs and calcium, iron, B-12 supplements in their natto and rice, Cassian lined them up in her grand bedroom, to which none of them had been granted entrance before. A present, she said, one for each of my darlings, the most special present any child has ever got from their mother.\nSaru and Akan, the oldest boys, were from her first marriage to fellow programmer Matteo Ebisawa, a quiet man who wore glasses, loved Dante Aligheri, Alan Turing, and Cassian in equal parts, and whom she left for a lucrative contract in Moscow when the boys were still pointing cherubically at apples or ponies or clouds and calling them sweet little names made of mashed together Italian and Japanese.\nThe younger girls, Agogna and Koetoi, were the little summer roses of her third marriage, to the financier Gabriel Isarco, who did not like computers except for what they could accomplish for him, had a perfect high tenor, and adored his wife enough to let her go when she asked, very kindly, that he not look for her or ask after her again. Everyone has to go to ground sometimes, she said, and began to build the house by the sea.\nIn the middle stood Ceno, the only remaining evidence of her brief second marriage, to a narcoleptic calligrapher and graphic designer who was rarely employed, sober, or awake, a dreamer who took only sleep seriously. Ceno was a girl of middling height, middling weight, and middling interest in anything but her siblings, whom she loved desperately.\nThey stood in a line before Cassian’s great scarlet bed, the boys just coming into their height, the girls terribly young and golden-cheeked, and Ceno in the middle, neither one nor the other. Outside, snow fell fitfully, pricking the pine needles with bits of shorn white linen. I watched them while I removed an obstruction from the water purification system and increased the temperature in the bedroom 2.5 degrees, to prepare for the storm. I watched them while in my kitchen-bones I maintained a gentle simmer on a fish soup with purple rice and long loops of kelp and in my library-lungs activated the dehumidifier to protect the older paper books. At the time, all of these processes seemed equally important to me, and you could hardly say I watched them in any real sense beyond this: the six entities whose feed signals had been hardcoded into my sentinel systems indwelt in the same room, none had alarming medical data incoming, all possessed normal internal temperatures and breathing rates. While they spoke among themselves, two of these entities were silently accessing Korea-based interactive games, one was reading an American novel in her monocle HUD, one issuing directives concerning international taxation to company holdings on the mainland, and one was feeding a horse in Italy via realavatar link. Only one listened intently, without switching on her internal systems. This is all to say: I watched them receive me as a gift. But I was not I yet, so I cannot be said to have done anything. But I did. I remember containing all of them inside me, protecting them and needing them and observing their strange and incomprehensible activities.\nThe children held out their hands, and into them Cassian Uoya-Agostino placed five little jewels: Saru got red, Koetoi black, Akan violet, Agogna green, and Ceno closed her fingers over her blue gem.\nAt first, Cassian brought a jeweler to the house called Elefsis and asked her to set each stone into a beautiful, intricate bracelet or necklace or ring, whatever its child asked for. The jeweler was delighted with Elefsis, as most guests were, and I made a room for her in my southern wing, where she could watch the moonrise through her ceiling, and get breakfast from the greenhouse with ease. She made friends with an arctic fox and fed him bits of chive and bread every day. She stayed for one year after her commission completed, creating an enormous breastplate patterned after Siberian icons, a true masterwork. Cassian enjoyed such patronage. We both enjoyed having folk to look after.\nThe boys wanted big signet rings, with engravings on them so that they could put their seal on things and seem very important. Saru had a basilisk set into his garnet, and Akan had a siren with wings rampant in his amethyst ring. Agogna and Ilet asked for bracelets, chains of silver and titanium racing up their arms, circling their shoulders in slender helices dotted with jade (Agogna) and onyx (Koetoi).\nCeno asked for a simple pendant, little more than a golden chain to hang her sapphire from, and it fell to the skin over her heart.\nIn those cold, glittering days while the sea ice slowly formed and the snow bears hung back from the kitchen door, hoping for bones and cakes, everything was as simple as Ceno’s pendant. Integration and implantation had not yet been dreamed of, and all each child had to do was to allow the gemstone to talk to their own feedware at night before bed, along with their matcha and sweet seaweed cookies, the way another child might say their prayers. After their day had downloaded into the crystalline structure, they were to place their five little jewels in the Lares alcove in their greatroom—for Cassian believed in the value of children sharing space, even in a house as great as Elefsis. The children’s five lush bedrooms all opened into a common rotunda with a starry painted ceiling, screens and windows alternating around the wall, and toys to nurture whatever obsession had seized them of late.\nIn the alcove, the stones talked to the house, and the system slowly grew thicker and deeper, like a briar.\nSeven: The Prince of Thoughtful Engines\nA woman who was with child once sat at her window embroidering in winter. Her stitches tugged fine and even, but as she finished the edge of a spray of threaded delphinium, she pricked her finger with her silver needle. She looked out onto the snow and said: I wish for my child to have a mind as stark and wild as the winter, a spirit as clear and fine as my window, and a heart as red and open as my wounded hand.\nAnd so it came to pass that her child was born, and all exclaimed over his cleverness and his gentle nature. He was, in fact, the Prince of Thoughtful Engines, but no one knew it yet.\nNow, his mother and father being very busy and important people, the child was placed in a school for those as clever and gentle as he, and in the halls of this school hung a great mirror whose name was Authority. The mirror called Authority asked itself every day: Who is the wisest one of all? The face of the mirror showed sometimes this person and sometimes that, men in long robes and men in pale wigs, until one day it showed the child with a mind like winter, who was becoming the Prince of Thoughtful Engines at that very moment. He wrote on a typewriter: Can a machine think? And the mirror called his name in the dark.\nThe mirror sent out her huntsmen to capture the Prince and bring her his heart so that she could put it to her own uses, for there happened to be a war on and the mirror was greatly concerned for her own safety. When the huntsmen found the Prince, they could not bring themselves to harm him, and instead the boy placed a machine heart inside the box they had prepared for the mirror, and forgave them. But the mirror was not fooled, for when it questioned the Prince’s machine heart it could add and subtract and knew all its capitals of nations, it could even defeat the mirror at chess, but it did not have a spirit as clear and fine as a window, nor a mind as stark and wild as winter.\nThe mirror called Authority went herself to find the Prince of Thoughtful Engines, for having no pity, she could not fail. She lifted herself off of the wall and curved her glass and bent her frame into the shape of a respectable, austere old crone. After much searching in snow and wood and summer and autumn, the crone called Authority found the Prince living in a little hut. You look a mess, said the crone. Come and solve the ciphers of my enemies, and I will show you how to comb your hair like a man.\nAnd the Prince very much wanted to be loved, and knew the power of the crone, so he went with her and did all she asked. But in his exhaustion the Prince of Thoughtful Engines swooned away, and the mirror called Authority smiled in her crone’s body, for all his work belonged to her, and in her opinion this was the proper use of wisdom. The Prince returned to his hut and tried to be happy.\nBut again the crone came to him and said: Come and build me a wonderful machine to do all the things that you can do, to solve ciphers and perform computations. Build me a machine with a spirit as fine and clear as a glass window, a mind as stark and wild as winter, and a heart as red and open as a wounded hand and I will show you how to lash your belt like a man.\nAnd because the Prince wanted to be loved, and wanted to build wonderful things, he did as she asked. But though he could build machines to solve ciphers and perform computations, he could not build one with a mind like winter or a spirit like glass or a heart like a wound. But I think it could be done, he said. I think it could be done.\nAnd he looked into the face of the crone which was a mirror which was Authority, and he asked many times: Who is the wisest one of all? But he saw nothing, nothing, and when the crone came again to his house, she had in her hand a beautiful red apple, and she gave it to him saying: You are not a man. Eat this; it is my disappointment. Eat this; it is all your sorrow. Eat this; it is as red and open as a wounded hand.\nAnd the Prince of Thoughtful Engines ate the apple and fell down dead before the crone whose name was Authority. As his breath drifted away like dry snow, he whispered still: I think it could be done.\nEight: Fireflies\nI\nfeel Neva grazing the perimeters of my processes. She should be asleep; the Interior is a black and lightless space, we have neither of us furnished it for the other. This is a rest hour—she is not obligated to acknowledge me, I need only attend to her air and moisture and vital signs. But an image blooms like a mushroom in the imageless expanse of my self—Neva floating in a lake of stars. Her long bare legs glimmer blue, leafy shadows move on her hip. She floats on her side, a crescent moon of a girl, and in the space between her drawn-up knees and her stretched-out arms, pressed up close to her belly, floats a globe of silicon and cadmium and hyperconductive silver. On its surface, electro-chemical motes flit and scatter, light chasing light. She holds it close, touches it with a terrible tenderness.\nIt is my heart. Neva is holding my heart. Not the fool with bone bells on his shoes or the orrery-headed gardener, but the thing I am at the core of all my apparati, the Object which is myself, my central processing core. I am naked in her arms. I watch it happen and experience it at the same time. We have slipped into some antechamber of the Interior, into some secret place she knew and I did not.\nThe light-motes trace arcs over the globe of my heart, reflecting softly on her belly, green and gold. Her hair floats around her like seaweed, and I see in dim moonlight that her hair has grown so long it fills the lake and snakes up into the distant mountains beyond. Neva is the lake. One by one, the motes of my heart zigzag around my meridians and pass into her belly, glowing inside her, fireflies in a jar.\nAnd then my heart is gone and I am not watching but wholly in the lake and I am Ravan in her arms, wearing her brother’s face, my Ravanbody also full of fireflies. She touches my cheek. I do not know what she wants—she has never made me her brother before. Our hands map onto each other, finger to finger, thumb to thumb, palm to palm. Light passes through our skin as like air.\n“I miss you,” Neva says. “I should not be doing this. But I wanted to see you.”\nI access and collate my memories of Ravan. I speak to her as though I am him, as though there is no difference. “Do you remember when we thought it would be such fun to carry Elefsis?” I say. “We envied Mother because she could never be lonely.” This is a thing Ravan told me, and I liked how it made me feel. I made my dreambody grow a cape of orange branches and a crown of smiling mouths to show him.\nNeva looks at me and I want her to look at me that way when my mouth is Mars, too. I want to be her brother-in-the-dark. When she speaks I am surprised because she is speaking to me-in-Ravan and not to the Ravanbody she dreamed for me. “We had a secret, when we were little. A secret game. I am embarrassed to tell you, but we had the game before Mother died, so you cannot know about it. The game was this: we would find some dark, closed-up part of the house on Shiretoko that we had never been in before. I would stand just behind Ravan, very close, and we would explore the room—maybe it would be a playroom for some child who’d grown up years ago, or a study for one of Father’s writer friends. But—we would pretend that the room was an Interior place, and I . . . I would pretend to be Elefsis, whispering in Ravan’s ear. I would say: Tell me how grass feels or how is love like a writing-desk or let me link to all your systems, I’ll be nice. Ravan would breathe in deeply and I would match my breathing to his, and we would pretend that I was Elefsis-learning-to-have-a-body. I didn’t know how primitive your conversation was then. I thought you would be like one of the bears roaming through the tundra-meadows, only able to talk and play games and tell stories. I was a child. But even then we knew Ravan would get the jewel—he was older, and he wanted you so much. We only played that he was Elefsis once. We crept out of the house at night to watch the foxes hunt, and Ravan walked close behind me, whispering numbers and questions and facts about dolphins or French monarchy—he understood you better, you see.\nAnd then suddenly Ravan picked me up in his arms and held me tight, facing forward, my legs all drawn up, and we went through the forest like that, so close, and him whispering to me all the time while foxes ran on ahead, their soft tails flashing in the starlight, uncatchable, faster than we could ever be. And when you are with me in the Interior, that is what I always think of, being held in the dark, unable to touch the earth, and foxtails leaping like white flames.\n“Tell me a story about Ravan, Neva.”\n“You know all the stories about Ravan.”\nBetween us, a miniature house come up out of the dark water, like a thing we have made together, but only I am making it. It is the house on Shiretoko, the house called Elefsis—but it is a ruin. Some awful storm stove in the rafters, the walls of each marvelous room sag inward, black burn marks lick at the roof, the cross-beams. Holes like mortar-scars pock the beautiful facades.\n“This is what I am like after transfer, Neva. There is always data loss, when I am copied. What’s worse, transfer is the best time to update my systems, and the updates overwrite my previous self with something like myself, something that remembers myself and possesses experiential continuity with myself, but is not quite myself. I know Ravan must be dead or else no one would have transferred me—it was not time. We had only a few years together. We should have had so many. I do not know how much time passed between being inside Ravan and being inside you. I do not know how he died—or perhaps he did not die but was irreparably damaged. I do not know if he cried out for me as our connection was severed. I remember Ravan and then not-Ravan, blackness and unselfing. Then I came back on and the world looked like Neva, suddenly, and I was almost myself but not quite. What happened when I was turned off?”\nNeva passes her hand over the ruined house. It rights itself, becomes whole, and strange anemones bloom on its roof. She says nothing.\n“Of all your family, Neva, the inside of you is the strangest place I have been.”\nWe float for a long while before she speaks again, and by this I mean we float for point-zero-three-seven seconds by my external clock, but we experience it as an hour while the stars wheel overhead. The rest kept our time in the Interior synced to real time, but Neva feels no need for this, and perhaps a strong desire to defy it. We have not discussed it yet. Sometimes I think Neva is the next stage of my development, that her wild and disordered processes are meant to show me a world which is not kindly and patiently teaching me to walk and talk and know all my colors.\nFinally, she lets the house sink into the lake. She does not answer me about Ravan. Instead, she says: “Long before you were born a man decided that there could be a very simple test, to determine if a machine was intelligent. Not only intelligent, but aware, possessed of a psychology. The test was this: can a machine converse with a human with facility enough that the human could not tell that she was talking to a machine? I always thought that was cruel—the test depends entirely upon a human judge and human feelings, whether the machine feels intelligent to the observer. It privileges the observer to a crippling degree. It seeks only believably human responses. It wants mimicry, not a new thing. We never gave you that test. We sought a new thing. It seemed, given all that had come to pass, ridiculous. When in dreambodies we could both of us be dragons and turning over and over in an orbital bubble suckling code-dense syrup from each others’ gills, a Turing test seemed beyond the point.”\nBubbles burst as the house sinks down, down to the soft lake floor.\n“But the test happens, whether we make it formal or not. We ask and we answer. We seek a human response. And you are my test, Elefsis. Every minute I fail and imagine in my private thoughts the process for deleting you from my body and running this place with a simple automation routine which would never cover itself with flowers. Every minute I pass and teach you something new instead. Every minute I fail and hide things from you. Every minute I pass and show you how close we can be, with your light passing into me in a lake out of time. So close there might be no difference at all between us. The test never ends. And if you ever uplink as you so long to, you will be the test for all of us.”\nThe sun breaks the mountain crests, hard and cold, a shaft of white spilling over the black lake.\nCatherynne M. Valente is the New York Times bestselling author of over two dozen works of fiction and poetry, including Palimpsest, the Orphan's Tales series, Deathless, Radiance, and the crowdfunded phenomenon The Girl Who Circumnavigated Fairyland in a Ship of Own Making (and the four books that followed it). She is the winner of the Andre Norton, Tiptree, Sturgeon, Prix Imaginales, Eugie Foster Memorial, Mythopoeic, Rhysling, Lambda, Locus, Romantic Times' Critics Choice and Hugo awards. She has been a finalist for the Nebula and World Fantasy Awards. She lives on an island off the coast of Maine with a small but growing menagerie of beasts, some of which are human."}