{"fingerprint": "nv7MMYnhd3YeVKs1qcnwJ5oVIyk=", "sitename": "Clarkesworld Magazine", "title": "Everyone from Themis Sends Letters Home by Genevieve Valentine", "author": "Genevieve Valentine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/valentine_10_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Everyone from Themis Sends Letters Home by Genevieve Valentine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9190 words, novelette\n Everyone from Themis Sends Letters Home\n The water here is never going to make good bread. If I’d known, I would have requested sturdier flour—we’ll be waiting six years for the next transport pod. Agosti told me today my bread’s good for massaging the gums, like he was trying to focus on the positives. Woods threatened to arrest him anyway, which was nice of him.\n But that’s really the only thing that makes me sad. Otherwise, I promise, I’m getting along here very well. I miss you, too. Every time I’m up late with the dough I imagine you’re at the table working, and when I look up it takes me a second to remember. But everyone here is pitching in. Marquez and Perlman and I are figuring out how to cheat an apple tree into producing fruit sooner, and Agosti’s building equipment out of our old life support systems. If it works out, we’ll have our own cider in two years. (“We can dip the bread in it,” Perlman said, and Woods threatened to arrest her, too. Gives him something to do. Imagine being in charge of five people. Good thing he has a knack for building.)\n The sun’s different than back home—they told us about particles and turbulence on the way over and I was too stupid to understand it and too afraid to tell them, so just pretend I explained and you were really impressed. The planet’s locked, so there’s really only water on the equator—nothing makes it toward the sun and it’s ice by the time you go ten miles further darkside. You’re never 100% sure what time it even is, except that it’s a little more purple in the daylight for the hour we get it, and at sunset it looks like the whole place was attacked by vampires. It’s sunset most of the time. That’s not too bad if you can just avoid the river; that river never looks right with the dark coming in.\n Agosti and Perlman were up until 3:30 shouting about which route will get us over the mountains, which would be more understandable if there were any mountains. But the movie bank’s still broken, so it’s just as well. I’m betting on Perlman. If anyone could lead us over imaginary mountains, it’s her.\n My other entertainment is staying up late, trying to fight the water and make bread that will actually rise, and the bird that sings all night. Samara—Perlman—says we’re not supposed to assign characteristics from home to the things we find here until they’ve been observed and documented and whatever else, but—thrush family.\n It’s most active during our night hours, and we’re working on why (trying to make sure it’s not drawn to the lights we brought with us, which would be bad news), but in the meantime it seems happy to sit in the trees outside the kitchen and sing. Three little bursts, then a longer one that’s so many notes it sounds like showing off, then a little pause to see if anyone’s listening, so it’s definitely showing off. If I whistle anything, it tries to repeat it, and it’s a fairly good mimic, but nothing I do really takes. It knows what it likes.\n It has the same woodwind sound as the one back home, the house I lived in when I was young. Hermit thrush? Wood thrush? Something I used to hear all the time and never thought about, of course. Good news is that now it’s just me and this one bird and I’ll get to start over again with every new animal. This time I’m going to pay better attention.\n Perlman will officially name it—they don’t ask the cooks how to classify animal species, that’s why the company hauled a biologist out here. But Perlman knows I like it, so maybe she’ll consult me. I know it best. That should count for something.\n All my love.\n Proxima Centauri Personnel Status Report: Day 1187Author: Dr. Samara Perlman\n Crew Health: Reiterating that as a biologist, I am not in a position to diagnose or treat any major medical issues, am not sure how I was tasked with this position, and am deeply concerned about how soon we can expect a qualified physician rather than a group of people who had slapdash medic training for three days before they left Earth. That said, all six residents currently seem in good health. Carlos Marquez claims a slight cough, but as the scans came back negative, my money’s on allergies. If he dies of tuberculosis next week we’ll know I was wrong.\n Crew Injuries: Anthony Agosti nursing a minor wrist sprain after having punched a wall. Should he resort to violence again I’ll be sending him to Officer Woods for a formal report and some time in the brig. We shouldn’t build a new planet with the same problems as the old one.\n Crew Mental Health: Marie Roland continues to claim she can’t see the mountains to the northwest of Themis. No other signs of psychosis appear, and when questioned or shown pictures of the mountains, Roland becomes distracted and mildly agitated. No tendency to violence. Suspect a minor mental block prevents her from fully acknowledging the terrain—homesickness? For now, as she’s still willing to train for the mission, there seems to be no point in forcing the issue; have asked Woods to stop pushing it and will let Marie come to it in her own time.\n Crew Mission Training: Expedition prep continues. Entire staff follow regimen of five-kilometer runs on hilly terrain every morning, weight lifting three times a week, rock climbing on nearby hills twice a week. Once the snow melts a little off the pass we’ll be able to determine the actual level of dexterity required for the climb and train accordingly. Vigil until then.\n to whomever\n there’s nothing here left to build and the mountain project is on hold until the thaw and I don’t care about sunset please get the movie bank going again before I throw myself in the river full stop\n anthony\n to whomever\n there’s nothing here left to build and the mountain project is on hold until the thaw and I don’t care about sunset please get the movie bank going again before I throw myself in the river full stop\n anthony\n sorry sent it twice by mistake\n wouldn’t do that kind of thing if the movie bank worked though probably\n anthony\n Samara and I did a perimeter walk today, a kilometer out from the camp. I picked almost more plants than I could carry, and I’m fairly sure at least half are edible, which will make meals much more exciting. Samara insisted on running tests for poison, don’t worry, but I think if I have to measure one more judicious use of dried black pepper I’m going to scream. I want something that tastes like it grew in the ground.\n Samara’s amazing. I don’t even remember first meeting her; it just feels like I’ve always known her, which I guess is what close quarters will do to you. We cataloged five species of bird (none of them my bird, so I guess the animals here really can tell day from night and it’s something we’ll get used to), and she spent a lot more time with insects than I was interested in.\n The air here smells just like home. I don’t know why—the water’s different, so the soil should be different, but it smells exactly like the dirt from my grandmother’s garden. It helps stop me from getting lonely, that the soil here might be the same as what we left behind.\n Marquez showed us pictures of his children a few nights ago; it’s his daughter’s birthday. Samara cried, but nobody pushed it. It’s strange how much we left behind to be here, and I think no matter how much work you’re getting done, sometimes it just hits you how separate you are. We must have really wanted this. I must still.\n I know you weren’t ready, and you might never be ready. These letters aren’t meant to convince you, I promise. It just makes me feel closer to home.\n All my love—\n Dr. March:\n Mixed results, as always. Sunset was a little longer than yesterday, so the seasons function is working. None of the subjects have noticed yet that Vivian and Carlos are interfaces, which bodes well for long-term use of constructed intelligence inside Themis. (Suggest we minimize the rock-climbing training until we can work out the uncanny valley problem in the weight distribution. Can the development team extend the thaw?) But overall, investors should be pleased—let me know if you need any demo footage, I have a clip of everyone working on the gardens that should go over well.\n Technical glitch, first incident: Anthony’s punch should have broken his hand. I’m not sure if the safety settings are appropriately set or too schoolmarmy. We might need to dial them down and get someone to break their leg as a test run for more realistic game play.\n Gigantic fucking technical glitch, ongoing: Marie can’t see the mountains. I’ve checked her equipment, and there’s no other potential hardware problems (attached is the most recent server diagnostic for your review, but there’s nothing in it that would account for it). Either she has an actual mental block that we can’t do anything about, or there’s a subjectivity issue somewhere in the code for Themis and we have to find it and fix it. I can’t tell which one is more likely, because you made me military instead of medical and I can’t just put her in jail until she tells me she sees them. Do we have a timetable for getting security clearance on that or are we going to have to settle for imperfect data?\n -Woods\n Woods dropped into the chair in Benjamina’s cubicle so hard her BIRDS OF MONTANE ECOSYSTEMS reference chart came loose and sank to the floor.\n “You gotta fix those mountains,” he said.\n “My chart, please.”\n “It’s going to break the sim,” he said, scooping it up and smoothing a bent edge. “We’ll have done four years of work for nothing because Marie has some synapse you can’t outsmart.”\n “The problem’s her head, not the software.” After a pointed pause, she turned around. He carried some ego out of a Themis session and it took a day or so to wear off; the faster you could remind him that everyone else was actually busy, the better. “You can see the mountains when you’re in Themis, and you know they’re not there. Sounds like you should take it up with the psych team.”\n “I’d have thought you wanted to keep her out of all that.” He wasn’t quite threatening her; he wasn’t quite sympathizing. (The reason Woods got chosen for beta-test jobs was how good he could be at Not Quite.)\n Benjamina didn’t bother to recite any anonymity bullshit. Woods had been in Themis a long time; they read letters out loud to each other. He knew what she sounded like. “I’ve been trying.”\n “They want to test the mountains before we wrap beta.”\n “We need to look at her file—I can’t reverse engineer a synapse misfire.”\n “They fixed Agosti’s color blindness.”\n “That’s different,” said Benjamina, picking crumbs off her keyboard. She didn’t like that fix, for no particular reason. It was productive; it just itched.\n “Listen, I like her, but this is going to kill the beta, and you and I will be under the knife.”\n “Get the psych team to request Marie’s file from the warden. Is Perlman at the same place?”\n “Nah, Perlman stabbed her husband, she went someplace serious. Roland’s just in a prison for fuckups.”\n “Fine. So get Dr. March to show me the file. I can port into Carlos for eyes on the ground. Then I’ll know what I’m dealing with.”\n “Nobody in this building’s willing to talk to the shrinks but me. That should tell you something.” Woods stood up, the little bird poster still in his hands. He was holding the very edges, like it was an expensive library book.\n One of the things nobody at Othrys talked about was that the longer you spent in Themis, the weirder physical objects were when you came back. Officially, nobody was talking about it because it was just Woods, and no one liked Woods enough to make him for a martyr of motor-skill dissociation. Unofficially, nobody wanted to think Themis came back with you. Benjamina hoped that wore off, too.\n “How are you doing?”\n He was smoothing the edges of the chart with the pads of his fingers as he set it down. He looked up at her like he was surprised.\n “I’m going to go eat some decent bread,” he said finally, and left.\n Benjamina’s computer pinged. It was waiting for her letter.\n Agosti came back from his walk today and did some very elaborate hand gestures about how much snow is left on the mountain pass and pointing to the northwest, and it took me three minutes to realize it wasn’t a buildup to a jerkoff joke. Those fucking mountains. Woods told him to knock it off—very sheriffy thing to do, glad he’s finding something to lay down the law about—but still. It gets old.\n Samara named that bird Catharus rolandus. It’s useless to be proud of something that has so little to do with actual contributions from you, but I teared up anyway. Plus that genus is apparently very close to the wood thrush after all! I felt like a scientist! Then I baked a shitty loaf of bread and lost that feeling immediately, because a scientist would know how to outsmart this water.\n I loved your letter. Not the markets, though—Themis is really good for reminding you of the value of only knowing a few people. The only thing I miss about the night markets is the two of us wearing those giant sweaters with the huge arms we bought as a joke and ended up needing that whole winter and we had to push the sleeves up before we reached for anything. All the fabrics here are sort of flat. They keep you warm, but it’s not the same.\n All my love\n Mr. Collins:\n My name is Dr. Frederick March, and I’m a consulting psychologist for Othrys Games. We’ve been partnering with your institution to test the latest game from Othrys; I understand you might not have all the details of how the process has gone so far, so first of all, I wanted to thank you, and let you know it’s been invaluable. You’re assisting us with some truly amazing work about constructed intelligence and full-neuro game play. There are even insights into the human subconscious and stimuli processing that I suspect will have significant implications going forward in other realms of study.\n I say all this so you’ll understand why I’d so much like to meet to discuss the next steps, since we’ve had to terminate the study slightly earlier than planned. Your in-house medical team has been exemplary, and we are completely understanding of what happened—immunity to memory suppressants is a risk of repeated exposure and this was discussed prior to beginning. We agree with you that the testing stage has effectively ended—the downside of informed consent.\n However, because of this, we would like to work out some visitations with the subjects in question. I understand our team has had some miscommunications with your administration trying to set these up. Let me assure you this is the standard debrief for any long-term player. And in this particular case, I expect that the subjects themselves would benefit from being able to speak with a trained professional about their experience. The amount and type of memories that might be restored have definite in-game applications and are potential data points well within the scope of our contract with your correctional facility. I’m happy to discuss further particulars—please let me know your thoughts.\n Sincerely,\n Frederick March\n Dr. March was already in the VP’s office, and Woods wasn’t, which meant the worst. Benjamina let the closed-door click echo a moment, trying to decide if looking stoic or penitent would work better. (Women who were too stoic got fired for not caring; women who were too penitent got fired for poor performance.) She forced herself not to ask questions as she sat. Inquisitive women were no better than the other kinds.\n “We’ve had a problem with Themis,” the VP said. He looked from one of them to the other. “Frederick knows already.”\n Of course he did. Benjamina waited.\n “It’s not the simulation,” the VP continued after a moment, as if to put her mind at ease, as if she was concerned that somehow her work wasn’t up to par and they would have waited until now to tell her. “In fact, Erytheia—the coders have aliases, it’s easier,” he explained to Dr. March, “—has our lowest fault rate, and has spent the most time working on individual settings for Roland. I think she could be invaluable to us during the postmortem process.”\n Benjamina blinked. “Postmortem of what?”\n Dr. March turned toward her. “Did you know Ms. Roland was a drug addict?”\n “No,” she said, and her stomach dropped as she considered why the medical side of the experiment wasn’t feasible any more. “Did she get any memories back when the drugs stopped working, or is it still a fog?”\n “She got them back.”\n Stoic, she thought. Be stoic. No point being penitent now.\n “Are Perlman and Agosti still in beta?” If they were, she’d have to talk to their coders about some in-game reason Marie was gone, though she couldn’t think of one they would believe. Marie would never leave Themis. She knew it best. Benjamina might have to port in on a simulation and drop dead in front of them.\n “No,” said the VP. “We decided to stop beta across the board. Dr. March is trying to get the warden to agree to interviews so we can find out how the, uh—the memory process? Is going. It will probably take a few weeks. Woods will go along and observe, obviously—continuity for them—and then he can circle back with you, so we can bring our findings to the team in a way that isn’t so . . . clinical. No offense.”\n “Of course,” said Dr. March. He was still looking at Benjamina.\n “Let me know when,” she said, and that was the last thing anyone needed from her.\n She drove home with shaking hands, for no good reason—Marie was a test user, they used to have test users at fucking conventions. She’d liked that better; there were plenty of ways to test what players would believe without lying to them at the beginning. Management wanted to test if the environment could fool the mind, but no one had asked Benjamina. None of this had been her idea. Nothing was her fault.\n The night was barely cloudy, and she drove past her turnoff and out until there was nothing but the highway on either side, so when she set up the telescope, she could see a glimpse of Proxima Centauri through the haze of light pollution. It blinked back and forth in the lens, and it was so dim. Light from there would never quite suffice.\n No one had said anything to the development team—no one ever did unless something was wrong—but she suspected this game was more than a Virtual Experience market maker. There were private companies prepping long-haul spacecraft with stasis technology; they’d want to train their people in the most realistic conditions possible, and they had money to burn.\n Normally, she’d write a letter to Marie. Dear Marie, I was looking up at Proxima tonight and I thought about you. Dear Marie, I got your letter. I programmed the thrush to mimic you a little, and you noticed. When the first astronauts land on Proxima Centauri b, maybe there will really be birds. I’ve studied everything I can, and there’s no telling. It might all be a layer of ice. There might be mountains everywhere. They might try to make a new home in a place that’s nothing but poison. Dear Marie, I want you to be happy there.\n Through the lens, the planet slid around the star.\n Woods,\n After you came and talked to us, Samara found out you hadn’t even paid us for our time in Themis. Mistake, by the way—if you’d paid us it would have at least looked like you weren’t trying to use us like lab rats and get away with it—and I feel like you should have known better. Not the company, but, you. You always seemed like a guy who wanted everything to have a reason.\n Samara’s got a lawyer, and the company should have papers by now. She told me not to contact you. I’m glad she’s suing, because you all deserve it. Go bankrupt.\n But I have an offer for whoever’s in charge: I can’t testify if I’m dead, and I want to go back to Themis permanently. I don’t know how long ‘permanently’ is, since the prison refuses to keep people on life support for things like that and you won’t want to bring me to a hospital, so just budget accordingly—a person probably starves to death in a week? So, a week. Unless I’ve built up such a resistance to the meds that it kills me in a few hours, which I assume would be cheaper.\n I don’t know who actually made Themis. I’m assuming you were involved, because you had the shortest fuse of anybody there, and at the time I thought that’s just what being law enforcement did to people, but it makes more sense if you made it. And I don’t know who I was writing to, that whole time. In Themis I just thought I had someone I loved, and he was where my letters went. I didn’t know I needed to love someone so badly you could lie to me about it for four years—but that’s how it worked, the psychologist said. You made Samara write reports because whatever you managed to do with her, there were some things she wouldn’t fall for. I was an idiot and I’d been lonely my whole life. You could do anything to me.\n It wasn’t you, was it? Was it one person writing me back, or did you reply by committee? One of you must have seen the picture of my arrest, since you gave me long hair in Themis. You talked about missing my braids. Whoever it was, go fuck yourself. I didn’t even like it, it was too long, but in Themis I kept it long all that time for your sake. I wanted to cut it—it got so humid in the summers I dreamed of shaving it off, I must have told you, I wrote you so much—but keeping my hair long was like a promise we’d see each other again. So I kept it.\n I thought that I couldn’t quite picture you because being in stasis on the ship seeped the color out of your dreams. And then it had been a long time, so of course I couldn’t really remember you—I looked at your messages and forgot whether you had good posture or not when you typed. I wanted to think you hunched like I did, like that weird pang in the lower back was something we shared 25 trillion miles away. I wondered sometimes why I’d gone to Proxima Centauri if I had someone I loved so much. Not that you can say that to the person you left behind. I never even mentioned it to Samara. But everybody knew Carlos and I had loved ones back home. When there are so few of you, you end up knowing a lot of things that you never talk about.\n Carlos isn’t real, right? I mean—the doctor told me he wasn’t, I know he wasn’t. But there wasn’t a person pretending to be him? He was just a program that got really excited about apple cider?\n I don’t even know how to be angry at you—it was the worst hour of my life and I threw up after, but it wasn’t You (whoever that is) explaining it, I would have been able to tell. So it still feels like you weren’t part of what went wrong, like the program got stuck even after I woke up and you locked me out and I’m still carrying you, someone I love and just forgot—\n Anyway, I’m going through withdrawal. The prison definitely doesn’t care—they said if I could go through it with the drugs that got me in here I could go through it with whatever they stuck in me to make me forget Themis. But maybe if you read this letter, you still consider me market research and this will be helpful. No appetite, no energy. I have a headache right behind my eyes. I’m always cold, even though Themis was colder than prison so you’d think I wouldn’t be. I sleep a lot. I always dream of being back in Themis. Probably good news for you. Sell a million copies. Just give me mine.\n And fix the bread. It never worked right, that should be changed.\n Let me go home.\n Marie\n Benjamina waited until the office was empty before she crossed the floor to Woods’ office. Stoic, not penitent; stoic people didn’t skulk over to meet someone they barely liked just to see how interviews had gone with the people they had used.\n She’d never been to his office before—he must always have come to her, strange, she’d never even noticed—and it was so blank it startled her into stillness at the threshold.\n “Want an invitation?” He was standing, reaching for his coat, like he’d just been waiting for her so they could walk out together. “You look like a vampire.”\n She didn’t say anything, and she didn’t move closer; after a second, he cracked a grin. “You’re kind of an asshole, Harris.”\n They walked out in silence, but from the way his thumb brushed the front of his coat lapel over and over, something terrible had happened and they were just waiting to be away from the cameras.\n Six blocks later, he said, “It was bad.”\n She stopped and looked at him.\n “She, uh—” He rubbed his hand once, rough, across his forehead. “In Themis, she looked fine. Healthy. It was stupid to assume she’d look the same in person, but I didn’t expect . . . I didn’t expect it. Samara’s suing us.”\n It took her a second too long to catch up, and before she could stop it it was out: “Because of how Marie looks?”\n “No, if Samara knew how Marie looked she’d have just murdered me.” His hands had disappeared into his pockets, fists that pulled against the shoulders and ruined the line of his coat. She’d put that into their last game, the noir murder mystery—the private eye yanked on his coat from the inside that same way. She thought she’d invented it; she’d been proud of herself.\n The letter he handed her was on paper so thin she hesitated to touch it.\n “It’s addressed to me, but trust me, it’s for you.”\n She wanted to take it home and read it where she couldn’t embarrass herself, but if Woods sat through three interviews she could manage this. She read it in the wide alley garden between two office buildings, where admin staff ate lunch to pretend they’d gotten away from everything. At some point she started shaking; he stood next to her like they were pretending the wind was cold. She read it again. She put it in her pocket. He didn’t argue.\n “Will you see her again?”\n “I could get arrested for passing her company information. We’re getting sued.”\n “I know.”\n “Fuck it, I’m hungry,” he said.\n They found a place far enough away they felt all right sitting down. He ate three pieces of bread out of the plastic basket in the first five minutes. Then he tore a napkin into pieces.\n “Samara’s skin and bones. Anthony’s got insomnia. Dr. Asshole said it was just drug interactions. The prison claims the game damages the cortex. They’re probably going to sue each other while Samara and Anthony are suing us.”\n “But not Marie.”\n He looked at her. His eyes were very dark; they couldn’t quite get them to register in Themis—they coded as black, which always looked flat, so anyone who met him in the game thought his eyes were lighter brown. It must have been a surprise for Marie to see him as he really was.\n “We can’t do that.”\n “Are you going to see her again?”\n “I’m not passing her a letter, Ben.”\n “Are you allowed to have an assistant with you, for the interviews? Stenography? Someone has to be holding the recorder.”\n “You’re out of your mind.”\n Her lips pulled tight across each row of teeth. “I have to do something.”\n “If you’re looking to feel less guilty, stop. No such thing.”\n He blurred underneath the tears that sprang up. She let them go—too late not to be penitent—so her vision would be clearer for what came next. “Then I’ll go myself,” she said.\n “It’s more than your job is worth.”\n There was nothing to say to that; her job had been worth so little there was no point.\n Outside it was not quite dark, and just beginning to be cold; the temperature of Themis, decided by a developer so much her senior she’d never met him.\n When she turned toward home, he walked with her.\n Halfway there, he said, “We have one more interview with her.”\n Hi Marie,\n My handle on the Themis team is Erytheia. It’s not my real name, but it’s easier to keep track of who wrote which code this way. Erytheia was one of the daughters of Themis. (I didn’t pick it.) When we were getting ready for the dry run they made me your experience specialist so we could concentrate on each user’s take on Themis and build as rich a world as possible.\n Woods showed me your letter.\n I just wanted you to know there wasn’t a committee. All your letters came to me, and I read them all. Some of what you told me went into a development memo, like how there weren’t enough insects for a landscape with that much standing water and vegetation. But I didn’t send my letters to trick you into writing more often, and I didn’t discuss anything personal. I answered you because I wanted you to feel like there was a person writing you back. I was the person writing you back.\n -E\n Hey Marie,\n Can you sleep? I can’t fucking sleep. My body thinks it’s too dark because it’s dumb and can only remember one set of things at a time and it’s stuck on Themis—like, we were definitely stuck on Themis but you don’t have to be such an asshole about it, get used to night and day and let me get some fucking sleep, damn.\n And honestly the Themis shit doesn’t really bother me. Everything I can remember from there is all of us just doing our best and getting along, so it’s not like it was embarrassing. I feel like an idiot for not realizing sooner—now it’s so fucking obvious why the movie bank didn’t work, because it was too complicated to make it work inside the game or whatever—but actually being there was fine. The part that bothers me is the whole time out here that I thought I was just depressed and dreaming about some random planet is the part that’s vanishing, like that’s the only part the drugs actually affected once the wall wore off. Can you imagine what we must have looked like to everybody else, hopped up on that stuff?\n I’m signing Samara’s guy’s thing. Are you? You should, they’re trying to pay us off but that just means they know they fucked up and want us to keep quiet.\n You’re not talking to anyone about any of this, right? They told me you’re having a rough time and I get that. What wasn’t better about Themis than being locked up? But you get killed that way, or they find some reason to extend your sentence twenty years, so zip that shit and just wait for Samara’s guy to make us too famous to die.\n When we get out we should see if we can get a parole dispensation to cross state lines, it was cool all living together, that was nice. Plus movies work here, that’s a reason to stay here. Plus I bet your bread in the real world is amazing.\n Keep your cool, Marie. I know you can do this.\n -Anthony\n Marie,\n My attorney heard from Othrys Games that you’ve been in contact with the company, trying to make a deal to get back to Themis. He wanted to send you a cease and desist, but I told him I wanted to talk to you first before we did anything official.\n The case we’re building downplays the nature of the game as much as possible. It doesn’t matter that the game wasn’t some battle simulator where we died all the time—it matters that they did it to us without our permission and then hoped people would ignore it because nobody cares about us. If you keep asking to go back in there, they’re going to use it as evidence that what they were doing was benign, or helpful, and we’re going to have to fight that impression in court, and when the game hits shelves and it’s fine, it will look even worse. We’re fighting the company—we can’t let the game become the thing we’re fighting.\n This thing is really important—my lawyer says it could be a cornerstone for other cases about prisoners’ rights. That’s big, Marie. It’s bigger than us. Cut it out.\n I’m not saying all this to be cruel—I miss it there, too. I could do my work and close doors behind me, of course fucking I miss it. But trying to get back to a lie is only going to hurt us. We need to be free again here. This is our shot. What they did to us was wrong—you can’t fix that. Let me fight it.\n Flush this letter. They can’t find it.\n Samara\n The Othrys lawyers call Benjamina for a deposition, and she sits in a meeting room with no windows with her back to the door—the only other seat, across from the lawyer whose smile is set tight across his face and doesn’t get anywhere near his eyes—and tries to ignore that this is all a setup to make her uncomfortable.\n She answers fifty questions about the game: its purpose (“Any game’s purpose—entertainment”), what game play will be like (it takes ten minutes, and the lawyer’s mouth purses the more she talks about how beautiful Themis is), the passage of time (“Four to seven times faster than real time, everybody playing an instance has to agree on the speed if they’re playing in the MMORPG rather than single-player,” she says, just to watch his jaw tick before he asks for clarification), how long it’s been in development (five years), how long the beta test has been going (just over a year), the chance of fatigue (“The same as with any mentally stimulating activity, like a deposition,” she says, and the lawyer’s lips positively disappear).\n “Did you know that Samara Perlman is trying to use the time she spent in Themis as proof of good behavior to reduce her sentence?”\n It’s an amazing tactic. She keeps her face neutral. “No, I didn’t.”\n “Do you have an opinion on the validity of that?”\n “No one who beta tested Themis ever evidenced any antisocial behavior, and as they believed the simulation was real life, their behavior in Themis would be close to real-world behavior.”\n “If I play a video game and kill a hundred imaginary people, am I a bad person outside the game?”\n “Because of killing the video game people, specifically?”\n He takes an even breath in and out. “Miss Harris, if you could answer the question.”\n “I think there’s a line between fantasy and reality, but the three subjects who had Themis beta-tested on them weren’t aware that line had even been crossed, so the question is kind of useless.”\n “Please answer it.”\n “I did.”\n He closes his eyes and counts to five, this time, which gives her enough time to plant the bug under the table.\n She lets the bug run—in for one count of corporate espionage, in for two counts—and siphons out the Othrys talk on her home laptop, with its wallpaper she made from Themis: the view outside the kitchen, where the thrush is singing.\n The lawyer hums and taps his pen; in the microphone it sounds like a stone gavel. “Wages we might have to push back on, since I’m not sure we can really count playing video games as ‘labor.’”\n “Agreed,” someone else says. “Plus I see that they’re pushing for time served for the passage of time in the game AND asking for wages for physical hours spent using the game. We can probably use that to shut down this thing at both ends. If they can’t decide what was more important, how can we?”\n “Good point,” the lawyer says. “We should get Warden Collins back in here to talk about labor practices. Give him enough rope to hang himself, we can show the only people using these inmates was the prison.”\n The next day at work, she comes into Woods’ office, closes the door behind her.\n “They’re going to lose.”\n “I know.”\n They stand for a little while not looking at each other. He’s put up a panorama of Themis on his office wall. It’s the geological survey, before they started the naturalist pass and brought people in; the idea of Themis, before anything really happened. The sun is setting. The sun is always setting.\n She waits until they lose the case before she visits Marie.\n Marie Roland on Themis is nearly six feet tall, has bakers’ arms, covers four feet at a stride. She has lines around her eyes from squinting at the sun; they got deeper on Themis, where the sun is safer to look at. Her voice is deep enough that Benjamina had to program the Acomys cahirinus knockoff to startle and bolt when she laughed.\n Marie Roland on the other side of the visitation table is someone who—Benjamina has to accept it all at once, there’s no point in doing things with best intentions any more—Benjamina’s driven into the grave.\n She sits down. Marie waits a few seconds to look up at her.\n “That was you?” she says, and it’s with such disdain that Benjamina almost smiles.\n “Yes.”\n “Have you come to apologize?”\n “Yes,” she says. “I don’t think it will be worth much, but yes.”\n Marie sits back in her chair. Five seven, maybe five eight; the circles under her eyes are as big as her eyes.\n You end up loving the things you make. Benjamina had been prepared for that—she’d seen it happen in other games, she’d seen it happen to Woods, she had braced herself. But Marie was made already; Benjamina can’t look her in the eye.\n “Samara got to be a biologist. Anthony was an engineer. Was there a reason I wasn’t a scientist? Did my file say I was too stupid?”\n Benjamina shrugs. “They assigned you to me. I didn’t know enough science to code one.”\n “You don’t know how to bake, either,” Marie says.\n They sit for a moment in quiet. Benjamina leans forward and starts to tell her why she’s come, but Marie starts talking, and she freezes.\n “I’ve forgotten a lot of important things,” Marie says to the tabletop. “There was—there was a bird, and I know we were trying to make cider but I can’t remember how far we got? Was Woods going to arrest us?”\n “No. The—uh, the point of the game was to see what people would do with minimal interference.”\n Marie’s gaze is sharp. Benjamina programmed that stare in wholesale, without ever seeing it. In person it feels like a slap.\n “So you picked convicts to see what we would do if we thought we could get away with it? Burn in hell.”\n “I’m wearing a recorder,” Benjamina says, “if there’s anything you want to get off your chest.”\n To Penitentiary Staff:\n This is a general notice that MARIE ROLAND [ID: 68223-18-0709] should be given a psychiatric evaluation as soon as possible. Recently she has evidenced delusional thinking and bursts of hostility, and a recent visit with a supposed family member left her extremely agitated. All future visits must be approved by the warden’s office, and Roland will not be allowed to meet any visitors whatsoever until she has complied with the evaluation and any recommended medication regimen.\n Sincerely,\n Janet Evanston, on behalf of Christopher Collins, Warden\n The following letter to the editor was delivered to our editorial offices by a third party. Upon confirming pertinent facts, the Evening Times considers the letter worthy of publication.\n When I was in Themis, I caught a fly.\n You’ll hear about Themis soon, if they aren’t already selling it. It’s beautiful there. You’ll want to stay in it forever. That’s not a threat; I just envy you.\n When you stand next to the river and think about vampires, know that I was there first. They sent me without telling me it was virtual. I thought I had been selected to be the first inhabitant of a new planet. I should have known better—the game couldn’t make me forget who I was, and no one like me gets selected for something like that—but Themis is hard enough to live in that you believe it’s real. It never really feels like night or day and your sleep cycle gets messed up and the terrain is rough for vegetables, so you have to fight the soil for eight months to get anything started. It’s not easy. The bread there never baked right. I thought it was the water, for a long time.\n I’m currently in the [redacted by editors], which is where Othrys tested Themis on us. I didn’t volunteer—I was selected for a sleep study, they said, because I had vivid dreams, and it would get me time off for good behavior if I agreed. They never told us about Themis. For a year, I lived in two places and I didn’t know.\n I don’t know what they gave me to make me forget, but they gave it to me on each end of Themis, on the way in and after I was out. Eventually my body got used to it—side effect of being an addict, which you think they’d have worried about more, but.\n Some things I’ve forgotten—there was a bird I loved, but I couldn’t tell you what it looked or sounded like. It’s a bird in a dream. But I remember more of it than I was supposed to.\n We tried to sue the game company for experimenting on us without our knowledge or permission. It didn’t work; we pushed too hard to have it affect our sentences, I guess.\n I’m not writing this because I’m surprised. You’re probably not surprised, either. Part of me wishes I had it in me to be noble and fight to get us all released because of this—Samara and Anthony deserve their freedom. But I’m writing because I want to live inside Themis until I die, and Othrys says they won’t let me.\n We lost the lawsuit, so there’s no danger in it. It probably looks great to them that I want to go back, anyway. And most people won’t live in the same Themis I built. They’re making it more interesting for new people. You’ll have cities to live in instead of just shipping-crate mess halls; you’ll be able to see the mountains. You’ll all be dealing with each other.\n Samara’s lawyer told me the Themis I lived in was a demo they built just for Anthony and Samara and me—it’s not the version on the shelves, so I could live inside it and never come into contact with anyone. You’ll have a hard time in Themis, but I’ll never be the problem.\n They developed that game around us, one thing at a time—the daytime got more purple as we went along and we called it the seasons, and the wildlife filled in in bursts because they didn’t think we’d remember what had been there the last time. (We did remember—we just thought nature was getting used to us.) Eventually there were plants with briars and fruit flies that would bother me when I was cooking. Real life. Things you believe. I caught one of them late at night, before it could land on some dough I was rolling out for cookies, and I carried it outside because Samara, our team biologist, had told us to be very careful to preserve everything we found so she could catalog all of it.\n It’s not real, they forced it on us and we were never meant to keep it, I’m not stupid, but I held the fruit fly in the cup of my hand and felt its wings beating. How can they say that’s not mine?\n Marie Roland\n Correction: As the writer of the letter was unavailable for editorial consultation on yesterday’s Letter to the Editor, at the advice of legal counsel, it has been removed.\n “What the fuck did you do?”\n Benjamina hands him his coffee. They’ve told the office they’re dating; it explains a lot of time in each other’s company.\n “I tried to fucking—” she looks around, lowers her volume, “help Marie be someone no one could ignore. That’s her best chance.”\n “Her best chance is a legal appeal by people who know what they’re doing, not you on a crusade.”\n She sits back and looks at him, flat. “You think that this time, for sure, three inmates are going to win against two state prisons and Othrys Games by just quietly doing the right thing.”\n He leans closer; his hand, flat on the table, almost touches her fist.\n “I think if anybody realizes you’re the problem, you are going to need help and I am not going to be able to give it. What are you thinking?”\n She meets his eye. “I saw Marie.”\n REVIEW: THEMIS IS A WHOLE NEW WORLDby Sarah McElroy\n As a games reviewer, you tend to get jaded about new products. The graphics are increasingly realistic, the plots increasingly dense, and there’s a sense that some games are more about one-upsmanship than about providing a transporting experience for players.\n Themis is coming to the market nearly three years late, and shrouded in mystery. It was the subject of a lawsuit two years ago, as beta testers complained they hadn’t signed on for something as immersive as they got. For normal people, that gives you pause. For gamers, that’s the kind of buzz money can’t buy. (A one-day-only letter to the editor also appeared in the Evening Times; the newspaper didn’t respond to requests for comment, so the message-board debate rages on about whether it was a legitimate report from the trenches, or genius advertising.)\n And if you’ve been waiting for Themis as long as I have, it’s awkward to realize you understand exactly what those beta testers meant.\n In terms of practicalities, Themis isn’t very much different from half a dozen other VR immersions that have appeared the last few years. You’re part of a hardscrabble crew assigned to terraform Themis, the first colony on Proxima Centauri. If you’re looking for more plot, you won’t find it: the entire hook of Themis is that the world is, quite literally, what you make it.\n But what a world. The eternal sunset casts a rosy glow over the camp, the flies hover over any kill you make. And if you think otherwise, trust me, you’ll end up making kills—Themis is about moral questions as much as strategy choices, and your team will have to eat something until the potato harvest. Every herbivore on Proxima Centauri is a take on Earth fauna of the taiga, so if you can’t look a reindeer in the eye and fire, you’re going to go hungry a lot. And you should think quickly; Themis has admirable ambitions about its much-touted real-time settings, but there’s no doubt that the optimal game play occurs at about seven times the speed of life, and at that speed, hunger levels are highly responsive. (Given that your larger goal is simply to cross the mountains and make geological observations about the ice on the dark side of the planet, hunger might be the closest you come to emergency action.)\n There have been concerns about the complications of MMORPG when everything is quite so unstructured; it’s one thing to put up with creeps when they’re a mage avatar in your questing party, and another to deal with them in an environment so sharply realized that it might as well be real. I’m honestly not sure how that setting will develop—when we played it in the Tabula offices, all was well, but the more you open the encampment to strangers, the greater the risk. It’s just as well the game has a Private setting, where you and a handful of AI colleagues split the work and develop the colony in contemplative near-silence. You even get to choose your profession. (Medic is so boring as to be childish; go for Cook. Don’t worry—there’s no achievement bar. You can mess up bread as much as you want.)\n These days, to survive in the marketplace, a game can’t just be good and survive. It can’t even settle for being impressive. It has to be earth-shaking. And for a game that can be explained in a single sentence, Themis really does defy description. I know I’ll be seeing copycats for the next ten years; I know none of them will make me feel the way Themis did.\n RATING: Must-Have\n Hello Sarah,\n I saw your piece about Themis in Tabula. I am a developer at Othrys who worked on the beta testing for Themis and would love to speak with you further. You can contact me at the email above.\n Benjamina Harris\n To All Othrys Staff:\n Benjamina Harris has been terminated, effective immediately. In the next few days, HR staff may meet with you to ask questions about her performance. We apologize for the inconvenience, and appreciate your cooperation.\n Sincerely,\n Dan Turpin, CEO\n It feels so silly, handing Woods a disk—first time she’s handled a physical disk in six years, no bigger than her thumbnail, and still passing it over is like handing him a raw egg.\n “I told you I can’t help you,” he says, but she has her hands in her pockets and after a minute, he slips the thing out of sight.\n “Thank you,” she says. He’s furious with her—that she didn’t get out before she was fired, that she’s had to create a new identity after everyone’s already on alert, that she’s making him responsible for backup copies of bugged conversations and stolen correspondence that will get her thrown in prison for fifty years. But he’s here when he shouldn’t be, and that makes him better than some.\n “You won’t make it out of the country,” he says. “Please just hide closer to home. Yosemite’s a thousand square miles.”\n She could. It would be safer. But living alone in a clearing near the river, birds calling out in the dark, mountains to the northwest—she swallows. It would be stealing.\n She says, “I hope it’s bad enough that someone finds Marie.”\n She heads south; the sun sets off the red rocks, and there’s no one else for a hundred miles, and she sits in the quiet car and compiles a new geography, and realizes she’ll never reach the border.\n Still, she drives while she can. The footprint of the mesas is so big it never shifts; she moves like someone in a dream, not quite fast enough.\n EVENING TIMES\n OTHRYS WHISTLEBLOWER TELLS ALL ABOUT SHOCKING MEDICAL EXPERIMENTATION: “THEMIS WASN’T WORTH THE COST”\n THE SUNDAY LEDGER\n “THE WARDEN KNEW, AND NO ONE STOPPED HIM”: HOW “THEMIS” MUST MARK THE END OF THE PRISON INDUSTRIAL COMPLEX\n THE NEW YORK STANDARD\n THE ORACLE OF OTHRYS: VIDEO GAME SNITCH BLOWS THE LID OFF VR HORROR\n THE LONE CANDLE\n THE THEMIS EXPERIMENT: WHY VIRTUAL REALITY MAKES EVERYONE A PRISONER\n OWL EYES NEWS\n BOSS BATTLE: CHRISTOPHER COLLINS, “THE VIDEO-GAME WARDEN,” RETIRES WITH $2 MILLION SEVERANCE\n TABULA GAMES\n WORLD-CLASS: “THEMIS” BREAKS SALES RECORDS\n THE NEW YORK WEEK IN REVIEW\n MARIE ROLAND: THE WOMAN WHO CAN NEVER GO HOME\n Samara, Anthony,\n This is my last letter. I hope this ends up being of some use to you—make no secret of it, if it will help. I’m happy to be anybody’s pawn now.\n It was an honor building Themis with you. I’m glad you’re not coming, but it won’t be the same.\n Marie\n Spent today walking downstream a dozen kilometers and recording things. There are more species of cattails in this one stretch than I ever saw on Earth. Saw a lot of teeth marks on them—bodes well for the idea of some Earth-adjacent fauna that have just been scared off by our camp but might eventually be coaxed to come back.\n Of course, I shredded my feet and somehow managed to get a giant bruise on my knee without even falling down. (How did they ever let me become a naturalist with a constitution like this?) Listened to a whole chapter of a book while I was soaking in salt water, which is the most salt and the most reading I’ve gotten since I landed.\n You’d think they’d have sent more people, but I guess for a temperate zone you don’t really have to. Winters don’t kill you here, and it’s only a couple of weeks until the pass melts and we can set off for the mountains to do the survey for the second-wave team. (My bet is glacier melt that will sustain a thousand people; Vivian claims there’s taiga and we can support twice that. Carlos is holding the money.)\n It’s winter at home, by now, isn’t it? I hope all is well with you. I would love to know for sure.\n The bread I made today was edible! The bird outside was very proud of me—he sang along with me all night. I threw him crumbs, at the end of it, and he liked them, and it feels like it will even last the night without going stale. This time next year, I’ll have the hang of it for sure.\n That bird really does have a lovely song. They said to be careful assigning old observations to what I find here, but: thrush family. I just know it.\n All my love—\n Genevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times."}