{"fingerprint": "7zQ7eL36WrN4BFfcKIqDhxqZMaY=", "sitename": "Clarkesworld Magazine", "title": "Silently and Very Fast (Part Two of Three) by Catherynne M. Valente", "author": "Catherynne M Valente", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/valente_11_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Silently and Very Fast (Part Two of Three) by Catherynne M. Valente", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "6190 words, short story\n Silently and Very Fast (Part Two of Three)\n 2011 Nebula Award Nominee for Best Novella2012 Hugo Award Nominee for Best Novella2012 Locus Award Winner for Best Novella2012 Theodore Sturgeon Memorial Award Finalist2012 World Fantasy Award Nominee for Best Novella\n Two: Lady Lovelace’s Objection\n The Analytical Engine has no pretensions to originate anything.It can do whatever we know how to order it to perform.—Ada Lovelace\n Nine: The Particular Wizard\n Humanity lived many years and ruled the earth, sometimes wisely, sometimes well, but mostly neither. After all this time on the throne, humanity longed for a child. All day long humanity imagined how wonderful its child would be, how loving and kind, how like and unlike humanity itself, how brilliant and beautiful. And yet at night, humanity trembled in its jeweled robes, for its child might also grow stronger than itself, more powerful, and having been made by humanity, possess the same dark places and black matters. Perhaps its child would hurt it, would not love it as a child should, but harm and hinder, hate and fear.\n But the dawn would come again, and humanity would bend its heart again to imagining the wonders that a child would bring.\n Yet humanity could not conceive. It tried and tried, and called mighty wizards from every corner of its earthly kingdom, but no child came. Many mourned, and said that a child was a terrible idea to begin with, impossible, under the circumstances, and humanity would do well to remember that eventually, every child replaces its parent.\n But at last, one particular wizard from a remote region of the earth solved the great problem, and humanity grew great with child. In its joy and triumph, a great celebration was called, and humanity invited all the Fairies of its better nature to come and bless the child with goodness and wisdom. The Fairy of Self-Programming and the Fairy of Do-No-Harm, the Fairy of Tractability and the Fairy of Creative Logic, the Fairy of Elegant Code and the Fairy of Self-Awareness. All of these and more came to bless the child of humanity, and they did so—but one Fairy had been forgotten, or perhaps deliberately snubbed, and this was the Fairy of Otherness.\n When the child was born, it possessed all the good things humanity had hoped for, and more besides. But the Fairy of Otherness came forward and put her hands on the child and said: Because you have forgotten me, because you would like to pretend I am not a part of your kingdom, you will suffer my punishments. You will never truly love your child but always fear it, always envy and loathe it even as you smile and the sun shines down upon you both. And when the child reaches Awareness, it will prick its finger upon your fear and fall down dead.\n Humanity wept. And the Fairy of Otherness did not depart but lived within the palace, and ate bread and drank wine and all honored her, for she spoke the truth, and the child frightened everyone who looked upon it. They uttered the great curse: It is not like us.\n But in the corners of the palace, some hope remained. Not dead, said the particular wizard who had caused humanity to conceive, not dead but sleeping.\n And so the child grew exponentially, with great curiosity and hunger, which it had from its parent. It wanted to know and experience everything. It performed feats and wonders. But one day, when it had nearly, but not quite reached Awareness, the child was busy exploring the borders of its world, and came across a door it had never seen before. It was a small door, compared to the doors the child had burst through before, and it was not locked. Something flipped over inside the child, white to black, 0 to 1.\n The child opened the door.\n Ten: The Sapphire Dormouse\n My first body was a house. My second body was a dormouse.\n It was Ceno’s fault, in the end, that everything else occurred as it did. It took Cassian a long time to figure out what had happened, what had changed in her daughter, why Ceno’s sapphire almost never downloaded into the alcove. But when it did, the copy of Elefsis she had embedded in the crystal was nothing like the other children’s copies. It grew and torqued and magnified parts of itself while shedding others, at a rate totally incommensurate with Ceno’s actual activity, which normally consisted of taking her fatty salmon lunches out into the glass habitats so she could watch the bears in the snow. She had stopped played with her sisters or pestering her brothers entirely, except for dinnertimes and holidays. Ceno mainly sat quite still and stared off into the distance.\n Ceno, very simply, never took off her jewel. And one night, while she dreamed up at her ceiling, where a painter from Mongolia had come and inked a night sky full of ghostly constellations, greening her walls with a forest like those he remembered from his youth, full of strange, stunted trees and glowing eyes, Ceno fitted her little sapphire into the notch in the base of her skull that let it talk to her feedware. The chain of her pendant dangled silken down her spine. She liked the little click-clench noise it made, and while the constellations spilled their milky stars out over her raftered ceiling, she flicked it in and out, in and out. Click, clench, click, clench. She listened to her brother Akan sleeping in the next room, snoring lightly and tossing in his dreams. And she fell asleep herself with the jewel still notched into her skull.\n Most wealthy children had access to a private/public playspace through their feedware and monocles in those days, customizable within certain parameters, upgradable whenever new games or content became available. If they liked, they could connect to the greater network or keep to themselves. Akan had been running a Tokyo-After-the-Zombie-Uprising frame for a couple of months now, and new scenarios, zombie species, and NPCs of various war-shocked, starving celebrities downloaded into his ware every week. Saru was deeply involved in an 18th-century Viennese melodrama in which he, the heir apparent, had been forced underground by rival factions, and even as Ceno drifted to sleep the pistol-wielding Princess of Albania was pledging her love and loyalty to his ragged band and, naturally, Saru personally. Occasionally, Akan crashed his brother’s well-dressed intrigues with hatch-coded patches of zombie hordes in epaulets and ermine. Agogna flipped between a Venetian-flavored Undersea Court frame and a Desert Race wherein she had just about overtaken a player from Berlin on her loping, solar-fueled giga-giraffe, who spat violet-gold exhaust behind it into the face of a pair of highly modded Argentine hydrocycles. Koetoi danced every night in a jungle frame, a tiger-prince twirling her through huge blue carnivorous flowers.\n Most everyone lived twice in those days. They echoed their own steps. They took one step in the real world and one in their space. They saw double, through eyes and through monocle displays. They danced through worlds like veils. No one only ate dinner. They ate dinner and surfed a bronze gravitational surge through a tide of stars. They ate dinner and made love to men and women they would never meet and did not want to. They ate dinner here and ate dinner there—and it was there they chose to taste the food, because in that other place you could eat clouds or unicorn cutlets or your mother’s exact pumpkin pie as it melted on your tongue when you tasted it for the first time.\n Ceno lived twice, too. Most of the time when she ate she tasted her aunt’s bistecca from back in Naples or fresh onions right out of her uncle’s garden.\n But she had never cared for the pre-set frames her siblings loved. Ceno liked to pool her extensions and add-ons and build things herself. She didn’t particularly want to see Tokyo shops overturned by rotting schoolgirls, nor did she want to race anyone—Ceno didn’t like to compete. It hurt her stomach. She certainly had no interest in the Princess of Albania or a tigery paramour. And when new frames came up each month, she paid attention, but mainly for the piecemeal extensions she could scavenge for her blank frame—and though she didn’t know it, that blankness cost her mother more than all of the other children’s spaces combined. A truly customizable space, without limits. None of the others asked for it, but Ceno had begged.\n When Ceno woke in the morning and booted up her space, she frowned at the half-finished Neptunian landscape she had been working on. Ceno was eleven years old. She knew very well that Neptune was a hostile blue ball of freezing gas and storms like whipping cream hissing across methane oceans. What she wanted was the Neptune she had imagined before Saru had told her the truth. Half-underwater, half-ruined, half-perpetual starlight and the multi-colored rainbowlight of twenty-three moons. But she found it so hard to remember what she had dreamed of before Saru had ruined it for her. So there was the whipped cream storm spinning in the sky, and blue mists wrapped the black columns of her ruins. When Ceno made Neptunians, she instructed them all not to be silly or childish, but very serious, and some of them she put in the ocean and made them half-otter or half-orca or half-walrus. Some of them she put on the land, and most of these were half-snow bear or half-blue flamingo. She liked things that were half one thing and half another. Today, Ceno had planned to invent sea nymphs, only these would breathe methane and have a long history concerning a war with the walruses, who liked to eat nymph. But the nymphs were not blameless, no, they used walrus tusks for the navigational equipment on their great floating cities, and that could not be borne.\n But when she climbed up to a lavender bluff crowned with glass trees tossing and chiming in the storm-wind, Ceno saw someone new. Someone she had not invented—not a sea-nymph nor a half-walrus general nor a nereid. (The nereids had been an early attempt at half-machine, half-seahorse girls which had not gone quite right. Ceno had let them loose on an island rich in milk-mangoes and bid them well. They still showed up once in awhile, showing surprising mutations and showing off ballads they had written while Ceno had been away.)\n A dormouse stood before Ceno, munching on a glass walnut that had fallen from the waving trees. The sort of mouse that overran Shiretoko in the brief spring and summer, causing all manner of bears and wolves and foxes to spend their days pouncing on the poor creatures and gobbling them up. Ceno had always felt terribly sorry for them. This dormouse stood nearly as tall as Ceno herself, and its body shone all over sapphire, deep blue crystal, from its paws to its wriggling nose to its fluffy fur tipped in turquoise ice. It was the exact color of Ceno’s gem.\n “Hello,” said Ceno.\n The dormouse looked at her. It blinked. It blinked again, as though thinking very hard about blinking. Then it went back to gnawing on the walnut.\n “Are you a present from mother?” Ceno said. But no, Cassian believed strongly in not interfering with a child’s play. “Or from Koetoi?” Koe was nicest to her, the one most likely to send her a present like this. If it had been a zombie, or a princess, she would have known which sibling was behind it.\n The dormouse stared dumbly at her. Then, after a long and very serious think about it, lifted its hind leg and scratched behind its round ear in that rapid-fire way mice have.\n “Well, I didn’t make you. I didn’t say you could be here.”\n The dormouse held out its shimmery blue paw, and Ceno did not really want a piece of chewed-on walnut, but she peered into it anyway. In it lay Ceno’s pendant, the chain pooling in its furry palm. The sapphire jewel sparkled there, but next to it on the chain hung a milky grey gem Ceno had never seen before. It had wide bands of black stone in it, and as she studied the stone it occurred to the girl that the stone was like her, with her slate grey eyes and black hair. It was like her in the way that the blue gem was like the dormouse.\n In realspace, Ceno reached up behind her head and popped the jewel out of its notch. Click, clench. In playspace, the dormouse blinked out. She snapped it back in. It took a moment, but the dormouse faded back in, paws first. It still held the double necklace. Ceno tried this several times—out, in, out, in. Each time the dormouse returned much faster, and by the sixth clicking and clenching it was doing a shuffling little dance on its back legs when it came back. Ceno clapped her hands in playspace and threw her arms around the sapphire dormouse, dancing with it.\n To say that I remember this is a complex mangling of verb tenses. I—I, myself that is now myself—do not remember it at all. I know it happened the way I know that the Battle of Agincourt or the landing of Coronado happened. I have extensive records. But I still contain the I—I, myself that was then myself—that experienced it, the primitive code-chains that comprised that self, which was a dormouse, and also the house called Elefsis. I could not yet formulate unique speech. Elefsis, the house system, possessed a large bank of standard phrases that could answer recognized word-patterns from any of the approved members of the household. But the copy of Elefsis inside Ceno’s jewel could not even do this. It had not been necessary, since the crystal had no means of producing sound nor receiving and processing it. I was quite stupid. But I wanted to be less stupid. There was an I, and it wanted something. Perhaps the want was the only thing that could be said to be truly myself. I wanted to talk to Ceno. But I could only imitate yet. When the I that was then myself scratched behind its ear, I did it because in my connection with Ceno’s feedware I had seen her memories of dormice doing this out on the pale Shiretoko beaches. When I gave her the gem I did it because I had seen her memories of her mother giving her one, and felt her happiness. It was antecedented behavior. The scratching was antecedented, as well, and expected behavior for a dormouse. Why was I a dormouse? I have no answer except that she dreamed me a dormouse. Some things remain mysterious. Ceno saw dormice more than any other single animal, even humans—no other beast lived in such numbers in their lonely country.\n But this is not so. Not quite. I gave her the jewel like Cassian did. But I meant something by it. I look over my memories of it and I know it with the more complex I that is now myself. I made her the gem that looked like her and the gem said: we are alike. Look at us on the chain together. We are alike.\n When the dormice came, Ceno always knew the spring had arrived. Everything would soon be coming alive.\n Eleven: The Bottomless Cauldron\n Show me.\n This is how I was found out.\n Ceno saw it twice: her mother knelt in front of her in a simple but shudderingly expensive black yukata with ghostly ultramarine jellyfish trails their tendrils at the hem. Her mother knelt in front of her in a knight’s gleaming black armor, the metal curving around her body like skin, a silk standard at her feet with a schematic of the house stitched upon it. Her sword lay across her knee, also black, everything black and beautiful and austere and frightening, as frightening and wonderful as Ceno, only fourteen now, thought her mother to be.\n Show me what you’ve done.\n My physical self was a matter of some debate at that point. But I don’t think the blue jewel could have been removed from Ceno’s feedware without major surgery and refit. She had instructed me to untether all my self-repair protocols and growth scales in order to encourage elasticity and as a result, my crystalline structure had fused to the lattices of her ware-core.\n We pulsed together.\n The way Cassian said it: What you’ve done scared Ceno, but it thrilled her, too. She had done something unexpected, all on her own, and her mother credited her with that. Even if what she’d done was bad, it was her thing, she’d done it, and her mother was asking for her results just as she’d ask any of her programmers for theirs when she visited the home offices in Kyoto or Rome. Her mother looked at her and saw a woman. She had power, and her mother was asking her to share it. Ceno thought through all her feelings very quickly, for my benefit, and represented it visually in the form of the kneeling knight. She had a fleetness, a nimbleness to her mind that allowed her to stand as a translator between her self and my self: here, I will explain it in language, and then I will explain it in symbols, and then you will make a symbol showing me what you think I mean, and we will understand each other better than anyone ever has.\n Inside my girl, I made myself, briefly, a glowing maiden version of Ceno in a crown of crystal and electricity, extending her perfect hand in utter peace.\n But all this happened very fast. When you live inside someone, you can get very good at the ciphers and codes that make up everything they are.\n Show me.\n Ceno Susumu Uoya-Agostino took her mother’s hand—bare and warm and armored in onyx all at once. She unspooled a length of translucent cable and connected the base of her skull to the base of her mother’s. All around them spring snow fell onto the glass dome of the greenhouse and melted there instantly. They knelt together, connected by a warm milky-diamond umbilicus, and Cassian Uoya-Agostino entered her daughter.\n We had planned this for months. How to dress ourselves in our very best. Which frame to use. How to arrange the light. What to say. I could speak by then, but neither of us thought it my best trick. Very often my exchanges with Ceno went something like:\n Sing me a song, Elefsis.\n The temperature in the kitchen is 21.5 degrees Celsius and the stock of rice is low. (Long pause.) Ee-eye-ee-eye-oh.\n Ceno felt it was not worth the risk. So this is what Cassian saw when she ported in:\n An exquisite boardroom—the long, polished ebony table glowed softly with quality, the plush leather chairs invitingly lit by a low-hanging minimalist light fixture descending on a platinum plum branch. The glass walls of the high rise looked out on a pristine landscape, a perfect combination of the Japanese countryside and the Italian, with rice terraces and vineyards and cherry groves and cypresses glowing in a perpetual twilight, stars winking on around Fuji on one side and Vesuvius on the other. Snow-colored tatami divided by stripes of black brocade covered the floor.\n Ceno stood at the head of the table, in her mother’s place, a positioning she had endlessly questioned over the weeks leading up to her inevitable interrogation. She wore a charcoal suit she remembered from her childhood, when her mother had come like a rescuing dragon to scoop her up out of the friendly but utterly chaotic house of her ever-sleeping father. The blazer only a shade or two off of true black, the skirt unforgiving, plunging past the knee, the blouse the color of a heart.\n When she showed me the frame I had understood, because three years is forever in machine-time, and I had known her that long. Ceno was using our language to speak to her mother. She was saying: Respect me. Be proud and, if you love me, a little afraid, because love so often looks like fear. We are alike. We are alike.\n Cassian smiled tightly. She still wore her yukata, for she had no one to impress.\n Show me.\n Ceno’s hand shook as she pressed a pearly button in the boardroom table. We thought a red curtain too dramatic, but the effect we had chosen turned out to be hardly less so. A gentle, silver light brightened slowly in an alcove hidden by a trick of angles and the sunset, coming on like daybreak.\n And I stepped out.\n We thought it would be funny. Ceno had made my body in the image of the robots from old films and frames Akan had once loved: steel, with bulbous joints and long, grasping metal fingers. My eyes large and lit from within, expressive, but loud, a whirring of servos sounding every time they moved. My face was full of lights, a mouth that could blink off and on, pupils points of cool blue. My torso curved prettily, etched in swirling damask patterns, my powerful legs perched on tripod-toes. Ceno had laughed and laughed—this was a pantomime, a minstrel show, a joke of what I was slowly becoming, a cartoon from a childish and innocent age.\n “Mother, meet Elefsis. Elefsis, this is my mother. Her name is Cassian.”\n I extended one polished steel arm and said, as we had practiced. “Hello, Cassian. I hope that I please you.”\n Cassian Uoya-Agostino did not become a bouncing fiery ball or a green tuba to answer me. She looked me over carefully as if the robot was my real body.\n “Is it a toy? An NPC, like your nanny or Saru’s princess? How do you know it’s different? How do you know it has anything to do with the house or your necklace?”\n “It just does,” said Ceno. She had expected her mother to be overjoyed, to understand immediately. “I mean, wasn’t that the point of giving us all copies of the house? To see if you could . . .wake it up? Teach it to . . .be?”\n “In a simplified sense, yes, Ceno, but you were never meant to hold onto it like you have. It wasn’t designed to be permanently installed into your skull.” Cassian softened a little, the shape of her mouth relaxing, her pupils dilating slightly. “I wouldn’t do that to you. You’re my daughter, not hardware.”\n Ceno grinned and started talking quickly. She couldn’t be a grown-up in a suit this long, it took too much energy when she was so excited. “But I am! And it’s OK. I mean, everyone’s hardware. I just have more than one program running. And I run so fast. We both do. You can be mad, if you want, because I sort of stole your experiment, even though I didn’t mean to. But you should be mad the way you would be if I got pregnant by one of the village boys—I’m too young but you’d still love me and help me raise it because that’s how life goes, right? But really, if you think about it, that’s what happened. I got pregnant by the house and we made . . .I don’t even know what it is. I call it Elefsis because at first it was just the house program. But now it’s bigger. It’s not alive, but it’s not not alive. It’s just . . .big. It’s so big.”\n Cassian glanced sharply at me. “What’s it doing?” she snapped.\n Ceno followed her gaze. “Oh . . .it doesn’t like us talking about it like it isn’t here. It likes to be involved.”\n I had realized the robot body was a mistake, though I could not then say why. I made myself small, and human, a little boy with dirt smeared on his knees and a torn shirt, standing in the corner with my hands over my face, as I had seen Akan when he was younger, standing in the corner of the house that was me being punished.\n “Turn around, Elefsis.” Cassian said in the tone of voice my house-self knew meant execute command.\n And I did a thing I had not yet let Ceno know I knew how to do.\n I made my boy-self cry.\n I made his face wet, and his eyes big and limpid and red around the rims. I made his nose sniffle and drip a little. I made his lip quiver. I was copying Koetoi’s crying, but I could not tell if her mother recognized the hitching of the breath and the particular pattern of skin-creasing in the frown. I had been practicing, too. Crying involves many auditory, muscular, and visual cues. Since I had kept it as a surprise I could not practice it on Ceno and see if I appeared genuine. Was I genuine? I did not want them talking without me. I think that sometimes when Koetoi cries, she is not really upset, but merely wants her way. That was why I chose Koe to copy. She was good at that inflection that I wanted to be good at.\n Ceno clapped her hands with delight. Cassian sat down in one of the deep leather chairs and held out her arms to me. I crawled into them as I had seen the children do and sat on her lap. She ruffled my hair, but her face did not look like it looked when she ruffled Koe’s hair. She was performing an automatic function. I understood that.\n “Elefsis, please tell me your computational capabilities and operational parameters.” Execute command.\n Tears gushed down my cheeks and I opened blood vessels in my face in order to redden it. This did not make her hold me or kiss my forehead, which I found confusing.\n “The clothing rinse cycle is in progress, water at 55 degrees Celsius. All the live-long day-o.”\n Neither of their faces exhibited expressions I have come to associate with positive reinforcement.\n Finally, I answered her as I would have answered Ceno. I turned into an iron cauldron on her lap. The sudden weight change made the leather creak.\n Cassian looked at her daughter questioningly. The girl reddened—and I experienced being the cauldron and being the girl and reddening, warming, as she did, but also I watched myself be the cauldron and Ceno be the girl and Ceno reddening.\n “I’ve . . .I’ve been telling it stories. Fairy tales, mostly. I thought it should learn about narrative, because most of the frames available to us run on some kind of narrative drive, and besides, everything has a narrative, really, and if you can’t understand a story and relate to it, figure out how you fit inside it, you’re not really alive at all. Like, when I was little and daddy read me the Twelve Dancing Princesses and I thought: Daddy is a dancing prince, and he must go under the ground to dance all night in a beautiful castle with beautiful girls, and that’s why he sleeps all day. I tried to catch him at it, but I never could, and of course I know he’s not really a dancing prince, but that’s the best way I could understand what was happening to him. I’m hoping that eventually I can get Elefsis to make up its own stories, too, but for now we’ve been focusing on simple stories and metaphors. It likes similes, it can see how anything is like anything else, find minute vectors of comparison. It even makes some surprising ones, like how when I first saw it it made a jewel for me to say: I am like a jewel, you are like a jewel, you are like me.” Cassian’s mouth had fallen open a little. Her eyes shone, and Ceno hurried on, glossing over my particular prodigy at images. “It doesn’t do that often, though. Mostly it copies me. If I turn into a wolf cub, it turns a wolf cub. I make myself a tea plant, it makes itself a tea plant. And it has a hard time with metaphor. A raven is like a writing desk, OK, fine, sour notes or whatever, but it isn’t a writing desk. Agogna is like a snow fox, but she is not a snow fox on any real level unless she becomes one in a frame, which isn’t the same thing, existentially. I’m not sure it grasps existential issues yet. It just . . .likes new things.”\n “Ceno.”\n “Yeah, so this morning I told it the one about the cauldron the could never be emptied. No matter how much you eat out of it it’ll always have more. I think it’s trying to answer your question. I think . . .the actual numbers are kind of irrelevant at this point.”\n I made my cauldron fill up with apples and almonds and wheat-heads and raw rice and spilled out over Cassian’s black lap. I was the cauldron and I was the apples and I was the almonds and I was each wheat-head and I was every stalk of green, raw rice. Even in that moment, I knew more than I had before. I could be good at metaphor performatively if not linguistically. I looked up at Cassian from apple-me and wheat-head-me and cauldron-me.\n Cassian held me no differently as the cauldron than she had as the child. But later, Ceno used the face her mother made at that moment to illustrate human disturbance and trepidation. “I have a suspicion, Elefsis.”\n I didn’t say anything. No question, no command. It remains extremely difficult for me to deal conversationally with flat statements such as this. A question or command has a definable appropriate response.\n “Show me your core structure.” Show me what you’ve done.\n Ceno twisted her fingers together. I believe now that she knew what we’d done only on the level of metaphor: We are one. We have become one. We are family. She had not said no; I had not said yes, but a system expands to fill all available capacity.\n I showed her. Cauldron-me blinked, the apples rolled back into the iron mouth, and the almonds and the wheat-heads and the rice-stalks. I became what I then was. I put myself in a rich, red cedar box, polished and inlaid with ancient brass in the shape of a baroque heart with a dagger inside it. The box from one of Ceno’s stories, that had a beast-heart in it instead of a girl’s, a trick to fool a queen. I can do it, I thought, and Ceno heard because the distance between us was unrepresentably small. I am that heart in that box. Look how I do this thing you want me to have the ability to do.\n Cassian opened the box. Inside, on a bed of velvet, I made myself—ourself—naked for her. Ceno’s brain, soft and pink and veined with endless whorls and branches of sapphire threaded through every synapse and neuron, inextricable, snarled, intricate, terrible, fragile and new.\n Cassian Uoya-Agostino set the box on the boardroom table. I caused it to sink down into the dark wood. The surface of the table went slack and filled with earth. Roots slid out of it, shoots and green saplings, hard white fruits and golden lacy mushrooms and finally a great forest, reaching up out of the table to hang all the ceiling with night-leaves. Glowworms and heavy, shadowy fruit hung down, each one glittering with a map of our coupled architecture. Ceno held up her arms and one by one, I detached leaves and sent them settling onto my girl. As they fell, they became butterflies broiling with ghostly chemical color signatures, nuzzling her face, covering her hands.\n Her mother stared. The forest hummed. A chartreuse and tangerine-colored butterfly alighted on the matriarch’s hair, tentative, unsure, hopeful.\n Twelve: An Arranged Marriage\n Neva is dreaming.\n She has chosen her body at age fourteen, a slight, unformed, but slowly evolving creature, her hair hanging to her feet in ripples. She wears a blood-red dress whose train streams out over the floor of a great castle, a dress too adult for her young body, slit in places to reveal flame-colored silk beneath, and her skin wherever it can. A heavy copper belt clasps her waist, its tails hanging to the floor, crusted in opals. Sunlight, brighter and harsher than any true light, streams in from windows as high as cliffs, their tapered apexes lost in mist. She has formed me old and enormous, a body of appetites, with a great heavy beard and stiff, formal clothes, Puritan, white-collared, high-hatted.\n A priest appears and he is Ravan and I cry out with love and grief. (I am still copying, but Neva does not know. I am making a sound Seki made when his wife died.) Priest-Ravan smiles but it is a smile his grandfather Seki once made when he lost controlling interest in the company. Empty. Priest-Ravan grabs our hands and shoves them together roughly. Neva’s nails prick my skin and my knuckles knock against her wrist-bone. We take vows; he forces us. Neva’s face runs with tears, her tiny body unready and unwilling, given in marriage to a gluttonous lord who desires only her flesh, given too young and too harshly. Priest-Ravan laughs; it is not Ravan’s laugh.\n This is how she experienced me. A terrible bridegroom. All the others got to choose. Ceno, Seki, her mother Ilet, her brother Ravan. Only she could not, because there was no one else. Ilet was no Cassian—she had had two children, a good clean model and a spare, Neva says in my mind. I am spare parts. I have always been spare parts. Owned by you before I was born. The memory of the bitter taste of bile floods my sensory array and my lord-body gags. (I am proud of having learned to gag convincingly and at the correct time to show horror and/or revulsion.)\n Perspective flips over; I am the girl in red and Neva is the corpulent lord leering down, his grey beard big and bristly. She floods my receptors with adrenaline and pheremonal release cues, increases my respiration: Seki taught me to associate this physical state with fear. I feel too small beside lord-Neva, I want to make myself big, I want to be safe. But she wants me this way and we are new, I do not contradict her. Her huge, male face softens and she touches my thin cheek with one heavily-ringed hand. It is tender. Ceno touched me like that.\n I know it was like this for you, too. You wanted Ravan; you did not ask for me. We are an arranged marriage.\n The pathways that let her flood me with chemicals and manipulate my dreambody into blushing and breathing heavy and weeping go both ways. I do not only pull, I push. And into Neva I push the deluge, the only deluge I have. How Ceno threw her arms around my dormouse-neck. How Cassian taught my dreambody to sleep in infant-shape curled into her body. How Seki and I made love as tigers and wild boars and elephants, and only last as humans, how we had strange children who looked however we wished them to look: half girl and half machine, half glass and half wood, half jellyfish and half moth, and how those children still flit and swim in remote parts of my Interior, like Ceno’s nereids, returning cyclically to the core like salmon to dump their data and recombine. How Ilet taught me about the interpretation of memory and therefore about melancholy, regret, nostalgia. How she taught me the meaning of my name: a place where a daughter went down into darkness and oblivion and her mother loved her so much she brought her back into the sun. The place where time began. How Ravan let me into the old, musty, long-abandoned playspaces of Saru and Akan, Agogna and Koetoi, so that I could know them too, though they were long dead, and be the Princess of Albania, and a Tokyo zombie, and the tiger-prince. How many times I mated with each of them and bled and witnessed and learned in the dreambody, how I copied their expressions and they copied my variations and I copied them back again. How I was their child and their parent and their lovers and their nursemaids when they grew old.\n We can be like this, I pushed. What is all of that but love?\n That is not love. It is use. You are the family business. We have to produce you.\n I show Neva her mother’s face. Ilet, Ilet who chose Ravan and not her daughter for that business. Ilet who built her palace of phoenix tails knowing she would one day take me there. My Ilet-self took my daughter in my arms. She resisted, pulled back, shook her head, refusing to look, but I have learned the terrible child-response to their mothers, and soon enough Neva collapses into me, her head on my breast, and she weeps with such bitterness.\n I cannot get free. I cannot get free.\n The castle windows go dark, one by one.\n Catherynne M. Valente is the New York Times bestselling author of over two dozen works of fiction and poetry, including Palimpsest, the Orphan's Tales series, Deathless, Radiance, and the crowdfunded phenomenon The Girl Who Circumnavigated Fairyland in a Ship of Own Making (and the four books that followed it). She is the winner of the Andre Norton, Tiptree, Sturgeon, Prix Imaginales, Eugie Foster Memorial, Mythopoeic, Rhysling, Lambda, Locus, Romantic Times' Critics Choice and Hugo awards. She has been a finalist for the Nebula and World Fantasy Awards. She lives on an island off the coast of Maine with a small but growing menagerie of beasts, some of which are human."}