{"fingerprint": "TKeezbG/fapNbWo8u9Hl/YQzGkU=", "sitename": "Clarkesworld Magazine", "title": "Seeing by Genevieve Valentine", "author": "Genevieve Valentine", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/valentine_11_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Seeing by Genevieve Valentine", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4380 words, short story\nSeeing\nAfter it was over, they pulled her from the sea.\nEven as they lifted her into the rescue boat she was saying, “No, no; we could have made it.”\nShe was cradling the hand the Captain broke.\nThe first time Marika saw the night sky, she was terrified.\n(Strange she wasn’t terrified sooner. They’d escaped the city because of the water riots. The city wouldn’t last long; the night swallowed it up one time too many, and then day just never came.\nMaybe that’s what happened to her — one terror swallowing another.)\nThe night sky was a battle of stars, a violent seam tearing through the center like a wound badly sewn up. The points of light marshaled in ways she didn’t understand; the constellations she remembered were devoured by the hordes. Everything bled.\n(This prepares her, a little, for what comes later.)\n(What comes later:\nA star dropping out of sight, a ship that holds three, a scattering of gold.)\nIt is impossible, from the ground, to look at a star.\nThe atmospheric interference muddies the light, drags it through the sky faster than your eyes can follow. If you’re lucky—if you’re at a high altitude, on a clear night, in a lonely place—this interference is perhaps a few dozen arcseconds out of alignment with reality. If it’s windy, or you can’t escape the summer, or you are trapped by people and lights, your problems multiply. You fall away from the truth by full seconds; you are hopelessly lost the moment you turn your face to the sky.\nBy the time you look up, nothing is true anymore; the ghosts of the stars only flicker and shine.\nAstronomers call this measurement Seeing. (Science has run out of more complicated words to explain the ways the universe has outwitted us.)\nWhat it means: you can’t trust your eyes. You can’t trust your instruments. You can’t trust a thing, from the ground.\nThey made it to a boat. At night, Marika slipped from her mother’s arms and climbed to the deck to watch the sky.\nOnce, an old man was sitting on the railing. He was staring at something—a steady, bright star that was already setting.\nThe water that night was calm, past the ship’s wake; the edges of the sky were mirrored clean. The star, reflected in the water’s edge, looked like twins moving to greet one another.\nThe old man didn’t turn to look at her. He didn’t move at all. He watched the star setting for a long time.\nWhen it slipped into the water, so did he.\nIt seemed rude that some places survived when others didn’t, but Marika and her mother found a city where lights still came on. (Her mother didn’t last six months there; too used to running.)\nThe city drafted for sciences; better than a war that only drafted cannon fodder. When the city came for Marika, she didn’t argue.\n(They had privatized water. Mission Control got it below market price. Marika even had enough to bathe in. She still hoarded, took furtive gulps like she didn’t know when the next one was coming. It gave her away as a refugee, but she couldn’t stop. Some thirsts you never get over.)\nThey teach Marika how to measure light.\nIn some ways it’s interesting to discover that light has measures other than Safe and Not Safe, that there’s still a world in which mathematics are of any use at all. But the more she learns about candelas and albedo and gravitational lensing and seeing and the impossibility of ever knowing anything for sure, the more thinks that every light should just be classified Not Safe.\n(You know as little about light as you know about why a man would slip away into the water when the shore was in sight by morning.)\nBut still she negotiates the unlikelihood of Gaussian distribution in phase fluctuations, and calculates probable intermittency to gauge turbulence strength, all so that someone standing at the telescope can point the lens at the sky and know where it’s really looking.\nKonstantinova heads up the observation banks, and Marika tries not to look over her shoulder at the star map there. (It doesn’t matter. Not her business. Not Safe.)\nWhen Gliese 581-d transits its star, Marika is the only one still awake working, and Konstantinova says, “Well, it might as well be you—come look at this.”\nMarika leans in and watches the screen; it’s a grainy, stuttering image replaying in a slow-motion loop, tucked into a corner and drowned out by a crawl of numbers underneath. She recognizes the numbers at the very bottom edge; the initial readings are run through her model to peel away the seeing and get as close to exact locations as their numbers allow.\n“It’s beautiful,” Konstantinova says.\nMarika knows she’s only looking at the numbers.\nNumbers are universal, Marika gets it. You have to rely on mathematics if you’re going to get anywhere, because the universe conspires against you the moment you lift your face to the sky in some warm place on a windy plain, the atmosphere sluicing across the nightscape, your meager vision blurred by tears. Marika understands.\n(But she knows, she knows, you can’t tell a thing from the ground.)\nThis moment is their first point of contact.\n(Only Konstantinova would know what that means, what will happen now; but it’s a measurement she never takes.)\nKonstantinova has a knack for transit.\nShe watches the map they’ve made, piled with F-through-M stars (warm enough to heat a planet, cool enough to last). They’re tagged; the closest ones have telescopes dogging them, just in case.\n(They won’t be able to stay here very long. They have to pick somewhere to go where they stand a chance.)\nSometimes one of the stars has a drop in luminosity, the intensity of their light suddenly dimming. This happens sometimes when one is dying, or a flare ends, or when debris comes between the telescope and the far-off star.\nBut Konstantinova has a knack, and she can watch the numbers sinking and know she has a transit even before the alarm sounds.\nEvery time it comes she flips the switch to record, replays it in slow motion, marks the points of contact: click, click, click, click.\nEvery time, she thinks, Let this be home.\n(By now the numbers are practically shapes; she can look at a column of numerals and see the corona of a star.)\nDuring a planetary transit, there are four points of contact, moments where the circumference of the planet touches the edge of the star in only one place.\n1. Just before the transit begins, when the outermost edges meet for the first time.\n2. As the planet moves closer to the center, when the trailing edge of the planet has just come within the circle of the star.\n3. As the planet passes the center of the transit, its leading curve touches the far edge of the star.\n4. At the end of transit, the trailing curve of the planet moves closer and closer to freedom; then there is a single point of contact with the edge of the star; then the transit is over and they are parting.\n(This has no real scope if you are close to the event; schoolchildren gather with shoeboxes to peer into the eclipse, that’s all.\nThis has no meaning until you are watching your new home become a black pearl against a far-off disc of light.)\nGliese 581 is a red dwarf star, warm and small, twenty light years from the Earth. It hangs in Libra, if you’re watching from the ground. It has four planets ringing it. One of them transits at the right speed; it’s close enough to Gliese for light, far enough for water.\n(The classification is Gliese 581-d; when people begin to pin hopes on it, it shrinks to “Gliese Dee”; to “Dee.” Marika calls it Gliese 581, never mentions Dee at all.)\nThere is a chance Dee is an ocean planet.\nIn the ops bay, there is construction on a small-scale human transport. There are calculations being made.\nIt is a very slight chance, but these are desperate days, and people must put a lot of faith, sometimes, in very slight chances.\nSometimes when they were still running from place to place, it was a comfort for Marika to watch the sky and see there was no balance there, either. The stars you knew would roll beyond your sight and be replaced by strangers, and there was nothing you could do.\nAfter a while she couldn’t breathe in cities, wanted only to be in the wild, watching a war she couldn’t win.\n(The sky is a battle; stars are always falling.)\nSeeing can be mitigated on cold, clear nights. From a refuge on top of a mountain, the seeing is so clear that, if you didn’t know better, it might not occur to you that the star is even moving.\n(You know better now; you can’t trust your eyes.)\nSometimes there’s no such luck, and even the Moon wavers like a coin submerged in shallow water. When seeing is at its worst, the Aristarchus crater on the Oceanus Procellarum can suffer so much distortion that it’s only intermittently visible. If you know what you’re looking for, and you know your numbers, you can calculate the seeing from that.\nMarika doesn’t learn this until it’s too late. For her, Aristarchus is always just a pale dot in a black sea, washing in and out of sight; a star on dark water, or a drowning man.\nMaybe the old man held out a hand as he toppled—a reflex, second thoughts—but Marika never remembers. Maybe he called for help, or tried to pull himself up before the water took him, but it might be a lie.\nThis moment always blurs when she tries to recall it; it wavers like the Moon, sneaks sidelong into her imagination when she’s running checklists on the three-seat ship that will carry them to Gliese 581.\n(She doesn’t think she was terrified watching the old man drop into the water, but she must have been; whenever he appears in her thoughts she freezes, fumbles for something to hold on to.)\nWhen she’s drunk enough and dreaming, sometimes he holds out his arm and the star-wake catches him, pulls him smoothly across the water until he disappears into the sky.\nBut it was only Jupiter, she thinks, not a star; you know that now.\nShe wakes up grieving, doesn’t know why.\nMarika calls it Gliese 581 because she doesn’t ever want to pin her hopes on a planet by mistake.\nTheir spacesuits are molded in the Orlan model—a thick skin they can pull on and clamp shut—and Konstantinova thinks it’s remarkably like wearing an elephant.\nApparently it’s not as bad as it used to be. The gloves are more articulated, the legs less bulky. There’s still no joint at the neck; the chest is stiff to support the oxygen and coolant strapped to the back.\nBefore Alkonost I, she and Zeke and Marika run drills until they can all get in, attach the water-coolant hoses, and seal up in five minutes; in four; in three.\nKonstantinova always hears an exhale over the mike when Marika’s fastened in. For a long time she thinks it’s relief. Exertion, maybe. Panic, maybe. (Marika is a liability; why they’re sending her up is anyone’s guess.)\nBut once, Konstantinova sees Marika’s face as Zeke seals her in: Marika frowns, brushes at the helmet’s gold-coated visor like she’s cleaning a dirty glass.\n(The sound is a sigh. It hurts.)\nKonstantinova’s life support system whirrs awake.\n“Clear,” she says, turns her mind to important things.\n“The life support system isn’t active in the pods,” says Zeke. “Shit. Mission Control, are you reading me?”\nAn acknowledgement comes back over the static; then a plan. Marika and Zeke fish around in the toolbox and do as they’re told. Konstantinova takes comm, passing along a series of orders that become wild guesses.\nNo one panics until they realize the ambient heat from the launch melted a circuit in the outer hull that can’t be set right again.\nMission Control goes quiet for a long time.\nMarika and Zeke wait, holding the handrails to keep from floating away; at the comm, Konstantinova is bent over like someone punched her in the stomach.\nThen the Director says, “At full speed, it’s forty years to Dee. Operations calculates that it’s possible to make it, without suspension, on the existing lift-support.” A pause. “There’s not enough for a return.”\nHe doesn’t say, We might not have this chance again, if this ship comes down in pieces. He doesn’t say, You might as well take your chances, things aren’t any better on the ground.\nKonstantinova’s visor trembles against the net of stars.\n“You’ll have some life support after landing,” comes over the line. “A day, maybe, maybe a week. Depends how much oxygen you use on the trip. But even a day is long enough to find out if Dee is really habitable.”\nThe Director clears his throat. “This isn’t a call we’re going to make, Alkonost. It’s up to you.”\nAfter a long time, Konstantinova says, “No.”\nZeke says, “And I’m a No. That’s majority—we’re no-go, Control. We’re inputting a new trajectory. Confirm.”\nKonstatinova curses under her breath, until the roar of the atmosphere swallows the words.\nAfter it’s over, Konstantinova pulls Marika out of the hatch.\n“My hand hurts,” Marika says, absently.\nKonstantinova says, “We broke your fingers.”\n(This is the second; it is nearly the eclipse.)\nMarika doesn’t remember anything until they play the recording.\nThen she listens as Zeke orders her more and more sharply to let go of the handhold and strap in for re-entry, where are you going, the decision’s been made, this is an order, don’t touch the hatch, have you lost your mind, that’s an order, answer me goddammit, move back now or I’ll make you move.\n“Why didn’t you answer?” they ask her.\nShe says, “I did.”\n(Not then—when Zeke blocked the hatch and broke her fingers, it was Konstantinova who yelped.\nBut on the recorder, as soon as the Director said “It’s possible to make it,” she said “Go.”)\nThey put Marika back at the computer bank, and she gauges wind resistance and plots angles and tells the telescope where it should be pointing.\n(She’s still good at it; she just doesn’t look behind her anymore where the map is, where the ghosts of the stars flicker and shine.)\nIt’s a week before anyone talks to her.\nThe first person who does is Konstantinova.\n“Can you move your fingers?”\nMarika says, “Yes.”\nA week later, Konstantinova hands her a screwdriver, says, “Prove it.”\nKonstantinova makes her do mechanic drills at night, after the others are asleep.\nSo Marika drills: into her suit in two minutes, alone; flicking switches to a full-speed metronome; screwing and unscrewing panels until the pads of her fingers have no skin left.\nShe doesn’t understand why, until she hears rumors that the techs are making modifications and repairs; that it will be going back up as Alkonost II, with three chairs up for grabs.\n“They’ll never crew me again,” she says.\nKonstantinova says, “You have fifteen seconds. Go.”\nIt takes a year for Alkonost II to take off.\nZeke gets water-fever and dies. No one offers to replace him.\nWalters gets drafted out of the pilot pool. He’s surly to the techs; he can suit up in two minutes; he cries in his bunk.\nKonstantinova wishes for one, just one, to be the sort of person you want beside you when you stand on a new planet.\nBut no one else comes, and that morning on the launch pad, it’s Marika standing on her other side.\n(This is the third; it’s almost over.)\nThe launch succeeds. The pods register nominal. The life support system holds.\nThey make it through the asteroid belt with only one bump (a fragment of meteorite, so small that when it strikes the hull it makes a soprano ping they can hear inside).\nDecision point comes after that, with the inner planets behind them and Jupiter filling the viewscreen. Along the top edge, a shadow is passing; a moon in transit.\n“We are go,” says Konstantinova; her feet go numb just saying it.\n“Godspeed,” says Mission Control.\nOn the ground, they’ve already started to leave notes, to write things down and lock them up safely in case the war gets worse while they’re gone. They’re making a covenant of things for their children to do when they’re grown and staring at the dusty computer banks, greeting three far-away strangers.\n“When we wake up,” says Konsantinova, “we won’t know a soul. Imagine that.”\nShe glances behind her, but Marika’s looking out at Jupiter with a crestfallen face; a moment later, Marika closes her pod like she’s glad to go.\n(Walters went into his right after launch, even before the asteroid field. He’d better be as good at landings as they swear he is. She doesn’t put much faith in people who are surly to techs.)\nKonstantinova stays up long enough to watch the ship accelerate to full speed, just in case.\nJupiter drops away, and Uranus and Neptune roll past in the distance like blue marbles, and there’s a brief bright string of stones along the Kuiper belt (Haumea whirling by), and then they’re in deep space and it’s nothing but her star map, as far as she can see.\nIt’s so familiar, suddenly, that she has to calculate the luminosity of Vega from memory before she can breathe again.\n(Some thirsts you never get over.)\nThey wake up three days shy of Gliese 581.\nKonstantinova wakes a day before the others to check out the comm. The Captain should be first, she feels. Zeke would have agreed.\nWhen Dee comes into sight, cloudy and blue and welcome, Konstantinova holds her breath, runs some numbers.\n(It’s an afterthought. By now the numbers are practically shapes, and she knows what home looks like.)\nWalters wakes next. He looks out at the planet, sighs, and starts to dress.\nMarika wakes last. As her pod cracks open she knocks it away with outstretched arms, leans out the edge and takes a few gasping breaths.\n“I dreamed we hit the water,” she says.\nKonstantinova doesn’t answer. People’s dreams are their own business.\nThe navigation system is working and the life support is as expected (enough air to get home, and Konstantinova tries not to shout with relief).\nThere’s a message from Mission Control, only twenty years old, which catches up to them on the second day. A few of the old voices from Mission Control send good wishes, and introduce some new voices.\n“We’ve been monitoring your trip, Alkonost,” says one of the strangers. “Everything looks good; watch fuel usage on your way in, so you can make it back up all right if the gravity’s stronger than estimated. Let us know when you wake up. Good morning, and Godspeed.”\nKonstantinova sends a message back. Beside her, Marika looks grimly through the viewscreen, where Gliese 581-d is spinning in the glow of their new home star.\nThey suit up and take positions for landing; it’s so instinctive now that Konstantinova smiles.\n(She spent forty years dreaming of setting down on Dee, and after all that practice the comm switches feel like her own fingertips.\nShe never got to the part where they step out on a new world; not enough imagination left over.)\nThe checklist goes well until the very last moment, until Dee’s gravity has already caught them and they’ve begun the slow, inevitable fall.\n“The third shock absorber isn’t running,” says Konstaninova. The words sound distant; disbelieving.\n“We can land with two,” Marika says.\nWalters says, “Not on water; if we’re off by more than a few degrees the surface tension will knock us over before we even touch down. We’ll slam into the water and be pulverized by impact.” He’s not disbelieving; he sounds like that’s just what he’s expected all along.\n“Then you’d better do your job, I guess,” Konstantinova snaps.\n“What’s wrong with it?” asks Marika. “It froze?”\nKonstaninova frowns at the diagnostic. “Doesn’t look like it. The mechanism still registers. Something must have broken loose while we were sleeping. Maybe we can open the nav panel in the back and—”\n“In the asteroid belt,” says Marika. “Something hit the hull.”\n“After last time, there better not be a fucking thing wrong with that hull,” says Konstantinova.\n“But it sang,” Marika says quietly.\nAll at once Konstantinova has a vision like a reel of film, as a sliver of rock careens into the hull, as a few grains slice through the hull and nick the fuel line, as forty years of a microscopic accident converge on them at once when there’s not enough pressure in a valve.\nShe tries for words, and for a moment fails.\n“We can’t access that now,” Walters says. “We’re heading into the atmosphere, we’ll burn up if we go out there. Let’s pull out, we’ll look at it from a steady orbit.”\n“If we pull out now,” says Konstanitnova, “we’ll burn the fuel we need to launch from the surface of Dee and go home. So we take our chances in the water, or we take our chances on the ground.”\nThis shouldn’t be such an agony; this isn’t the first time she’s been here. It should get easier. This should have an answer, by now.\n“All right,” she manages, “pull out and circle back on a one-way trip. This is the go/no go. Vote.”\nShe waits without turning for them to weigh in. She has a new respect for Mission Control, forty-one years ago; this is a silence that’s hard to allow.\nAt last, Walters says, “No go. We’ll take our chances in the water.”\nMarika doesn’t say anything. Konstantinova frowns at the comm, wonders if she missed it; if Marika answered while Konstaninova was still talking.\n(Marika has that habit, and her answer is always Go.)\nBut she waits for an answer a long time, until there is the sound of something sealing; Konstantinova sees the warning light go red under her fingers before she registers that Marika is opening the outer hatch.\nClick.\n(The transit is over; they are parting.)\nThe hairline crack is in the hydraulics panel. As Marika approaches it, moving hand over hand along the side rails, one bead of gasoline pushes through it and away.\n“You won’t get home,” she says into her mic. “You’ve lost too much already.”\nShe doesn’t know if the connection is still live; she forgets if she turned it on or not, and her heart is pounding too loudly for her to hear a thing.\nShe grips the screwdriver in her free hand and gets to work. It’s familiar by now, and the screws come apart one by one, cling gently to the magnets in the fingertips of her glove.\nThe suit warms up with her work; her visor fogs. She tries not to panic. There’s not enough air to panic. (She disconnected—there wasn’t time for anything else.)\nIf she lets go of the handrail, she’ll vanish.\nShe imagines a darkness like the darkness of the boat on calm water, imagines stretching out a hand as she falls.\nThe screwdriver shakes; she clamps down with numb fingers to keep it from escaping, drags off another screw.\nBut it’s useless. Her helmet is fogging up from the inside now—she can’t see, she can’t see, and there’s not enough time left to hold her breath and wait for equalization, not enough oxygen left to hyperventilate and turn it into droplets big enough to see around.\nShe shoves the pick in at an angle, to avoid her eyes.\nThree stabs before the visor cracks; another three before she can wedge the pick inside and wrench it out.\nThe shield winks once and spins gently out of sight, knocks away a scattering of gold where the coating has flaked off under the chisel.\nShe exhales, so her lungs don’t explode from the decompression, and turns to the bulkhead with shaking hands. She has to work fast—she forgets how long you can last before the darkness swallows you.\n(You have fifteen seconds. Go.)\nThe last screw opens; the panel opens.\nShe slices the fuel line where it’s torn, shoves the healthy end of the hose back into the joint, throws the clamp shut. Stray gasoline floats past her in black pearls.\n(She’s freezing; her lips are numb; when she blinks her eyelids crack, snap off, go flying.)\nThe panel begins to vibrate as the system kicks in.\n(Seven seconds.)\nShe slams the bulkhead shut, fumbles three of the screws back into place. It’s all she manages before her fingers freeze.\nFar away, Konstantinova is saying something about re-entry, about being out of time, she’s panicked, she’s screaming—but the last of the air escapes the suit, and then there’s silence.\n(Marika breathes in; her lungs collapse.)\nThe ship is accelerating now, dragging her.\nShe pulls free.\nThe motion spins her slightly, away from the planet towards the sky. For a moment, the full view stuns her.\nShe thinks, It’s beautiful.\nIt’s the first time in her life she’s ever thought it.\n(This is why: there is no seeing.\nNow there is only the sky; she’s looking, for an instant, straight to the stars. This is the true geography.)\nThe Milky Way rips through the black at a different angle; this sky is a stranger, a ceaseless riot, sharp and steady-bright.\nIt’s a lovely war.\n(Two seconds.\nOne second.)\nAfter it’s over, Konstantinova will emerge from the sea.\nShe will stand on the deck of the Alkonost; pull off her helmet; breathe.\nThe night will be deep. When she turns her face to the sky, to search for a place to begin with her numbers, the ghosts of the stars will flicker and shine.\nGenevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times."}