{"fingerprint": "3AKOieA2m8XXdlfO0xYDNT53IBA=", "sitename": "Clarkesworld Magazine", "title": "Working Towards Legacy: A Conversation with Ann & Jeff VanderMeer by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/vandermeers_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Working Towards Legacy: A Conversation with Ann & Jeff VanderMeer by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Working Towards Legacy: A Conversation with Ann & Jeff VanderMeer\n Ann & Jeff VanderMeer’s The Big Book of Modern Fantasy, published in 2020 by Penguin Random House imprint Vintage, came out to a host of stellar reviews, was a finalist for a Locus Award, and won a World Fantasy Award. The Big Book of Classic Fantasy (2009, Vintage) received similar praise, including landing as a finalist for REH Foundation, Locus, British Fantasy, and World Fantasy awards. The Big Book of Science Fiction (2016, Vintage) began the series, garnering praise from The New York Times’ “Book Review,” The Washington Post, Wired, and many others, and ultimately won them a Locus Award for Best Anthology. (Interestingly, their introduction to The Big Book of Science Fiction earned them a BSFA nomination for nonfiction.) But these are just some of the recent accomplishments in two long, often intertwined careers of individuals who have had a huge impact on genre.\n Ann & Jeff VanderMeer’s first collaborative anthology project was Best American Fantasy in 2007, published by Prime Books. Before this, Ann had spent years editing The Silver Web magazine (originally called The Sterling Web, which she cofounded in 1989); and her company, Buzzcity Press, published Jeff’s novel Dradin, in Love in 1996. Ann became fiction editor at Weird Tales in 2007 and later took over as editor-in-chief, picking up two Hugo Award nominations and a Hugo win during her tenure. She has well over a dozen anthologies to her name, some of them coedited with Jeff. Solo projects include the well-received XPRIZE anthologies Current Futures: A Sci-Fi Ocean Anthology (2019) and Avatars Inc. (2020). Her name has frequently appeared on awards lists for best editor since 2010.\n Combining their powers, anthology The Weird: A Compendium of Strange and Dark Stories (2011 with Corvus, 2012 with Tor) won British Fantasy and World Fantasy awards. Their 2008 titles put them on several awards lists: Fast Ships, Black Sails (Night Shade) earned them a Shirley Jackson nomination, and Steampunk (Tachyon) earned them a World Fantasy nomination. Collectively or separately, since those first appearances, they are consistently up for major awards.\n In high school, Jeff founded The Ministry of Whimsy Press (a press for which he would, years later, receive a Special Award, Non-Professional World Fantasy nomination) and in 1989, started Jabberwocky Magazine, which went for two issues. He self-published his first book collection The Book of Frog. He started his awards streak with a 1994 Rhysling win for poem “Flight Is for Those Who Have Not Yet Crossed Over,” which appeared in Ann’s The Silver Web. Dradin, in Love was a Sturgeon Award finalist, and novella “The Transformation of Martin Lake” in 1999 anthology Palace Corbie Eight won a World Fantasy Award, both of which began the Ambergris series.\n At this point, he has more awards nominations than can reasonably be listed here. Notable books include the Southern Reach trilogy: Shirley Jackson and Nebula Award winner Annihilation, Authority, and Acceptance, all published in 2014 by FSG Originals; and recent titles A Peculiar Peril (2020 with FSG Books for Young Readers) and Hummingbird Salamander (2021 MCD), both of which were critically acclaimed and well-received.\n You’ve worked on a number of anthologies together, beginning with Best American Fantasy in 2007. Collaboration can happen in any number of ways. In some situations, one person handles one type of thing, and the other handles a separate set of things. In other situations, there has to be consensus on every part of a project. How does collaboration work for you two, and has it changed since 2007?\n Ann VanderMeer: When we first started collaborating, we didn’t have any set rules. We were still finding out how to work together. We both jumped in and tackled whatever was in front of us. Jeff had more editorial and publishing experience than I did at that time, so his suggestions and insights were very instructive for me. Best American Fantasy was my first anthology credit, and I am very proud of it. I remember the first time I saw the book in a bookstore—what a kick that was!\n Jeff and I have different skills and talents so that helps make these collaborations work well. He is so good with the bigger picture and the overall concepts; and his instincts are spot-on most of the time. I am a detail-oriented person, so I deal with a lot of the nitty gritty, such as the permissions process (not the most fun, but necessary).\n We also made a determination early on that each of us gets one veto (to drop a story) and one selection that cannot be vetoed. Luckily, we hardly ever have to use the veto in either scenario, as we generally agree on all selections before finalizing the table of contents. The bottom line is we have a great deal of respect for one another. This is a key component to our work together.\n One of the things you talked about wanting to do with Best American Fantasy was reaching beyond the borders of what people consider to be genre. You also enjoyed bringing different kinds of writers together. Are these still things you work toward with your editorial projects?\n AV: I have done this in every project since I started publishing back in the eighties. At the time I didn’t realize this was revolutionary, it was just the way I thought it should be done. Keep in mind I had no formal publishing training, so I didn’t know what was and wasn’t acceptable. I didn’t know a lot about labeling fiction and writers. I just did what made sense to me. I wanted to bring my favorite stories to the largest audience I could reach. Now I see so many editors and publishers doing this, blurring the lines, and it makes me very happy.\n In addition to bringing works together from various genres I also prefer to pair well-known writers with the up-and-coming ones. It has often created beautiful friendships, but as well, the reader benefits from seeing these stories in conversation with each other.\n What, for you, is important about fantasy or science fiction, what does genre fiction do that is different from other types of literature?\n AV: Explorations beyond our current reality, SFF stretches the imagination beyond what realistic fiction can do. It allows the writer and the reader to encounter a sense of wonder and something far outside what we know. And in this way, it is able to deal with important issues without the reader feeling as if they are being lectured. The best fiction will move the reader, will help them explore things they never thought possible, or just never even considered. And this fiction will stay with the reader long after the book is closed.\n One of the things you do in your Big Book anthologies is include fiction originally written in other languages. What are some of the challenges of selecting stories from different cultures, especially non-anglophone cultures, and how do you deal with those challenges?\n AV: We have been fortunate to know many writers, translators, and editors from around the world. They offer suggestions and help us in our research. We couldn’t do this work without them. Typically, we will request a list of stories along a certain aesthetic with a short synopsis for each one. Those we find intriguing that match our project, we ask for a few translated pages. This gives us a sense of the writing style. If that works well, then we contract for a full translation.\n It’s a risk, for sure, but worth it. There have only been two instances when a translated story didn’t end up in our anthologies. But we always pay for the work, and we do try to help the translator find an appropriate place for publication, if we can’t use it.\n Ann, who were the people that inspired you early in your career, or the people who were important to becoming the editor you are today?\n AV: My father was the first influence. He had always wanted to be a writer and loved science fiction. My parents went through a contentious divorce when I was only five years old and there was a lot of heartache for me and my younger sister. This was a way for me to reconnect with my dad, a way for me to be seen by him. Indeed, he was the first person I called when I won the Hugo Award in 2009. I think he was crying on the phone with me.\n And my grandmother was a huge reader and storyteller. She supported me in this venture early on even though she admitted she didn’t understand anything I was publishing, ha! I have to give credit to many of the other editors and publishers who I reached out to when I first got started. Long before we had Internet and email. All done via letters! This was how Jeff and I first became acquainted. And he’s been a source of guidance and inspiration ever since.\n You are a fiction editor at Tor.com. What is an “Ann VanderMeer Tor.com” story, how would you characterize the works you’ve selected for that venue?\n AV: I would hope readers say that an “Ann VanderMeer” story is like nothing they’ve ever read before. My goal is to give the audience what they didn’t even know they wanted. I strive for that deeper emotional connection with unforgettable characters in unusual situations.\n As someone who has been editing short fiction for a while, not just in anthologies but also in magazines, what do you see as some of the most important transitions or changes in the publishing industry; and what makes them important?\n AV: I am seeing a much wider reach; publishers, editors seeking the best from all over the world. This can only lead to better books and stories overall. I am also seeing more diversity not just in the writers being published, but also in the people who become gatekeepers as well. This is so very important. When I first started out in the late eighties, there were only a few gatekeepers (publishers, magazines, and editors, etc.), and if a writer didn’t connect with them, they were out of luck. Now there are many other venues, so if a writer doesn’t get selected for this particular Year’s Best or that particular Award, all is not lost because there are now other Year’s Best anthologies with different editors and other Awards allowing the reading audience to have a much wider selection of excellent fiction to read. There are also a lot of terrific publishers doing innovative things. (This was one of the main reasons we wanted Best American Fantasy to have a different editor each year.)\n What are a few of the stories you’ve selected that stand out most for you, or were especially important to you, and why?\n AV: This is like asking me who my favorite child is! I love ALL the stories I have published. How am I supposed to single some of them out when there are so many? I will say that one of the most important stories I’ve ever published is “The Devil in America” by Kai Ashante Wilson. This story should be required reading in each and every high school in this country. Especially now.\n What is your advice for people who’d like to become magazine editors, or for people who are just stepping into the role?\n AV: First I would recommend reading everything you can, and not just in the genre you want to work in. Expand your sensibilities by reading nonfiction, poetry, et cetera. Get a taste of it all. Next, I would say trust your instincts. If it feels right move forward. If it doesn’t, step back and reassess. Don’t be afraid to ask for help or admit when you don’t know something. And when you do get advice, take it all with a grain of salt. Again, trust your instincts.\n Back in 2015, you both put together an anthology for PM Press called Sisters of the Revolution: A Feminist Speculative Fiction Anthology. In conversations about fiction, we sometimes talk about the role of fiction as being “political.” Are anthologies inevitably political? Does gathering stories under a broad theme, such as the Big Books, mean that the focus is on storytelling, or ideas, and politics or statements and the like?\n AV: All fiction is political, whether you can see it starkly on the page or not. We’re all political creatures, after all. Each editor will be bringing their own biases and preferences to their projects, so even if the anthology isn’t overtly political, it still makes a statement in the story selections and even in the TOC order and organization of the book.\n When I approach the selection process for each project, I want the story to be relevant to today’s reader. And I have been pleasantly surprised by how often that has happened with work published decades ago. It must a be a good, solid, entertaining, engaging story, regardless of the historical significance. The work also has to “play well” with other stories in the anthology. By this I mean each one is different, perhaps approaching similar ideas in uncommon ways. Beyond this, I wanted to ensure that we were able to provide as wide a look at storytelling as possible, stretching the boundaries of each genre and theme as far as we could go.\n Jeff, Picador is reissuing your Ambergris trilogy. You’ve put down a lot of words since writing those books, many of them quite well received. What are some of the most important ways you’ve changed as a writer since then, and what are the major reasons for those changes?\n Jeff VanderMeer: Although I’m known for weird fiction, the way that manifests is varied, so one answer is that every time I start to write a novel, I’m letting the work show me how to write it; the structure, and all the rest, usually coming out of the uniqueness of the character and situation. I often feel, when I start a novel, like it’s the first time I’ve written a novel, which gives me the frisson of excitement and discovery I need. So, what changes is simply that over time you acquire the ability to write stories many, many different ways, and you have the muscle memory of finishing many novels, so you are not particularly worried if things start slowly or if it seems like you’ll never be done with something.\n The Ambergris books were in large part about how history shapes us and our cultures and societies and thus required a different, more wide-angle approach than some of the later work. In a sense, you learn whole skill sets as a writer for a project like Ambergris that you may not use again for quite some time, or only use part of. At the same time, I exhausted a lot of what I wanted to experiment with in terms of metafiction, so a book like Annihilation has vestiges of Ambergris influence—competing accounts of the same events, weird ephemera like fragments of maps, et cetera, to prove the reality of an unreal thing—but are more earnest and more interested in experiments being invisible, acting upon the reader without their conscious knowledge.\n What are the things that you are excited for new readers to find in these books, the things that are still as relevant and essential as they were when the books first came out?\n JV: The central question running through the Ambergris books is whether the city can have a viable future without dealing with the colonial aspects of its founding, and whether it can survive a mass disappearance that most want to ignore and never think about again. This is very relevant to the history of colonialism on this planet, which is still playing out, and we’re still dealing with denial and not facing it. I’d say the historical sweep and incorporating a lot of ideas from different approaches to historical theory keep it fresh—and then, of course, hopefully unique characters and a certain timeless quality to the more fantastical elements of Ambergris.\n What is the heart of the series for you? What is important or special about these books for you?\n JV: Well, the other story of these books is how hard it was to find a publisher for City of Saints and Madmen, the first one, and how that was a great education about the publishing world. I think without that hard slog, during which I almost gave up, I wouldn’t have been toughened up enough. After that experience, which included one publisher stealing book order money and telling me he was spending it on his honeymoon but actually using it to pay for a stay in a sanatorium due to a nervous breakdown from bilking so many authors, while also threatening me from a Hotmail account supposedly from his lawyer . . . well, after that, nothing really surprises you. I did write about these experiences at one point: http://trashotron.com/agony/columns/2004/04-06-04-1.htm\n You mentioned in your interview with Carmen Maria Machado (at Interview Magazine) that you were working on “an ancillary tech build-out” from elements of Hummingbird Salamander. What does that mean, how does it work, what do you get out of it—and have you done similar things in relation to other projects?\n JV: I guess this is definitely one influence of the Ambergris books on later work. I created so many “found objects”—magazine layouts from Ambergris, booklets from Ambergris, images of objects supposedly created in Ambergris. And this really helped shore up the reality of an imaginary place.\n For Hummingbird Salamander, since there’s a cult around a dead ecoterrorist, I thought it would be good to have a meta site that is supposedly including messages from that cult, and thus friendsofsilvina.com was born. It’s a build out of a fictional milieu into the real world that doesn’t reveal its hand. It’s not really helping sales of the book, but it was an interesting creative project and hopefully a little extra delight for readers.\n Authors often write fiction in deliberate conversation with other works or authors. With Hummingbird Salamander, is there a similar conversation at play?\n JV: I think I’ll actually push back against the premise of this question, in that while the Ambergris books are definitely in part also in conversation with or alluding to other authors, most of my fiction in an ecological space is engaging with the real world and influenced by the world, not by other fiction. Sometimes I think folks get overinvested in trying to establish a lineage of influence and this can get kind of inbred and not very useful. Hummingbird Salamander is influenced by our current moment, like the pandemic, like climate crisis, and is not interested in engaging with other fictions in a similar space. It’s prickly that way.\n You both have pretty amazing careers. Are there projects that you just couldn’t make work, that you felt passionate about but just didn’t go anywhere for one reason or another? Are there projects that are on your minds that you haven’t been able to do yet?\n AV: We still have a few ideas kicking about. Never say never, because you never know what the future might bring.\n JV: I think Ann would agree that if we ever edited an anthology again it would be a huge million-word anthology of fiction by Latin American women, both realism and fantastical short stories. To both showcase so many amazing authors not really translated much yet and to repatriate a lineage of un/real that’s often severed in the way genre versus non-genre is published in some of those markets. Probably covering the twentieth century.\n Both of you have also been involved in various communities and non-publishing efforts in different ways, such as funding the Octavia Project and working with Shared Worlds. What have been the things that were especially important to you (and why)?\n AV: I’ve been thinking about this a lot lately, as I have stepped back from editing these massive Big Books. What will be my legacy? I want to spend more time mentoring and assisting the next generation of editors coming up. If I can help in that area, it will mean more to me than a dozen awards or shelves filled with books with my name on them.\n I’ve always had a soft spot in my heart for teenagers, as I know how difficult that time can be. I know my teen years were rough! I want to do more in our local community helping young people. We have some amazing nonprofit organizations in this town that work with teens in trouble, homeless youth, et cetera. I admire them greatly and do what I can to help those projects.\n JV: Michael Moorcock was very kind early in my career—getting me an agent, writing an introduction to City of Saints and Madmen. All he ever said about leverage was, if you ever have any sway in publishing, pay it forward. The best thing you can do for your own career is to help other writers, in my opinion. Never have liked writers who treat it like a competition.\n In terms of publishing, writing, and editing, what are you working on now, what do you have coming up that people should know about?\n AV: I am still acquiring fiction for Tor.com and have some fabulous stories coming up next year (2022). I am also working on a few other projects that I can’t really talk about yet. One of them is taking me out of my comfort zone. I am both terrified and excited at the same time. It’s good for me!\n JV: I’m close to finishing The Stone Shed, a new novel set in a ravine suspiciously like the one running through our backyard, plus soon to finish the sequel to A Peculiar Peril. I’m also working on a rewilding nonfiction book and two more novels: Drone Love, a stand-alone, and Absolution, the fourth Southern Reach novel.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}