{"fingerprint": "lW8V/+/F5O74tNHR3vP2vaRyqSU=", "sitename": "Clarkesworld Magazine", "title": "Annihilation, Authority, and Acceptance: An Interview with Jeff VanderMeer by Ben Fry", "author": "Ben Fry", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/vandermeer_interview_2014/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Annihilation, Authority, and Acceptance: An Interview with Jeff VanderMeer by Ben Fry", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nAnnihilation, Authority, and Acceptance: An Interview with Jeff VanderMeer\nJeff VanderMeer’s Southern Reach trilogy, comprised of Annihilation, Authority, and Acceptance was optioned by Paramount Pictures and foreign language rights have sold in sixteen countries. The series has been featured on the front page of the New York Times as an example of an accelerated publishing schedule, also known as “binge reading” and spotlighted by Entertainment Weekly, among many many others.\nThe trilogy chronicles the attempts of the secret government agency known as the Southern Reach to uncover the mystery behind Area X, a pristine wilderness existing behind an invisible border, cut off from the rest of the world for over thirty years. The first two books are already out and Acceptance will be published on September 2nd.\nIn April, VanderMeer attended the Arkansas Book Festival and participated in a Q&A with Ben Fry at the Witt Stephens Jr. Central Arkansas Nature Center. Fry has served as General Manager of KLRE & KUAR Public Radio in Little Rock, Arkansas, since 1995. He also serves as an adjunct professor in the School of Mass Communication at the University of Arkansas at Little Rock, teaching film classes. This transcript of their conversation has been slightly abridged.\nJeff, can you talk a little bit about the beginnings of this book, how the idea came to you, and whether you were thinking of a trilogy when it first came about?\nThe very basic idea came to me actually in a nightmare. I was very sick with bronchitis, and one night I had this nightmare where I was walking down into a tunnel, and as I walked into the tunnel, I saw these living words written in some living material on the walls, and they were getting fresher as I went farther and farther down, which meant whatever was writing them was actually down there as well. At a certain point, I saw kind of a weird light, and I knew if I turned the corner, I would actually see whatever was down there. At that point, I think it was that my writer brain decided to airlift me out, because if I’d seen whatever was there, I wouldn’t have written the story.\nThere were some precursors to this. I had wanted to write about the Florida Wilderness in some form for a long time, and so I had that in the back of my head. There had also been the Gulf oil spill, which at the time had been this horrible unending experience where hiking in that coastal wilderness, knowing the threat to it, and having to sit there every day not being able to do anything about it, the oil was just, and all of our heads in that area was just basically continually spilling and spilling and spilling. On some level, I think that also affected my subconscious just coming up with something like Area X to some degree, a total transformation, obviously, of the situation, but I still think that was a bit of a catalyst.\nHave you always been inspired by dreams? My experience with that is I have this fantastic dream. I go, “This is a great story.” I wake up, and it’s absolutely ridiculous.\nYes, I have tons of dreams. I had a dream about a giant armadillo that was terrorizing Tallahassee where I live. That did not become anything, not even a story. Usually, when I have a dream, it doesn’t become a story, but when characters and situations and a plot begin accrete around it, then it works. I do have a strong belief in the subconscious. There’re many times working on a book where when I go to bed, I say, “Okay, subconscious, this is the problem I’m working on. I want a solution in the morning.” That actually works.\nCould you talk a little bit more about St. Marks, the wildlife refuge and your hikes there.\nI hike out to St. Marks, which is in the [Florida] Panhandle, and there’s a trail out there that’s about fourteen miles, and it’s a great trail to do because it goes from your standard pine forest to cypress swamp, and it goes from that to salt marsh and then from there out to the sea, and so you have all of these different environments back-to-back. It’s fairly unique. You can’t find a whole lot of places like that in the United States with that particular type of environment.\nYou see all kinds of things out there. The dolphins will come into the freshwater canals at high tide chasing fish, and they’ve adapted to the brackish water there, so you’ll be out there hiking, and the first time I saw this, it just kind of blew my mind, because you’re not expecting a dolphin. You kind of think you’re in a dolphin-free zone, and suddenly you’re not.\nIt’s like the first time I was in Australia and I saw a kangaroo, a flash of brown come out of the underbrush, it’s the same thing because I was used to flashes of brown meaning a deer. You see things like that that are natural to the area, but they seem really strange if you don’t live there and experience them a few times.\nSo sometimes I get reactions to the books where people are reacting to things that actually happened in the wilderness, but they’re not accustomed to that area of the wilderness, or they don’t go hiking a lot, and so the books are even stranger for them than they are for other people.\nI did actually once thought I saw a kangaroo out [at St. Marks, too] which I know couldn’t have been a kangaroo, but I was with someone who was saying, “Look, there’s an alligator over there,” and so I saw this “kangaroo” out of the corner of my eye, turned to look at the alligator, and [when I tried to find the kangaroo again], it wasn’t there anymore. I’ll never know what it was.\nI did encounter a Florida panther out there. It’s an unconfirmed sighting because I was there by myself, and I didn’t take a picture, but there are no other cats that large with tails in Florida. That was something.\nIs that an important part of writing these novels, the environment? Is that important to you, natural settings?\nYeah, it really is. This is just the first time I’ve really had an opportunity to engage at length with it to some degree. Before, most of my novels have been set in cities, so it’s been obviously a more urban environment. It’s been really kind of satisfying to really write about the place that’s closest to my heart, that I really feel is home.\nWhen I was a child, we traveled around so much I didn’t really have a place that I could write about, like Stephen King writes about Maine. After close to twenty years hiking at St. Marks, I really feel close to it, and I feel comfortable with it. That’s one reason why I could write the novel so quickly: the whole landscape is basically the fourteen-mile hike, including the lighthouse.\nIn fact, when I finished it, I handed it to my wife, and I said, “I think I just wrote something incomprehensible about four women wandering aimlessly on a hiking trail in North Florida. Could you please check for me?” She read it and thankfully gave it the stamp of approval and said it was actually a novel and actually made sense.\nThen in Authority, which is set in kind of like small towns in part and the secret agency, it gave me an opportunity to show wildlife kind of interacting in that context and the way that we, even in small towns and whatnot, we encounter animals. A slightly more urban setting. We still are interacting with our environment in an interesting way.\nWhen I was reading Annihilation, there was this point where I really felt like I couldn’t trust anything that anybody said, including the narrator . . . I even started to wonder whether what she was telling me was happening was authentic or not. Is that intentional?\nYeah, it is intentional that this novel destabilizes you section by section. You think you’re reading one kind of novel. Then you think you’re reading another kind of novel. Then you just slowly kind of descend into this world where you’re having to yourself analyze what’s going on and say, “Is this accurate? Is this not accurate?” You kind of descend into the paranoia because you get a sense, I think, pretty early on, so it’s not a spoiler, that the agency that’s sending them in is pretty paranoid itself and hasn’t told them everything like the excerpt that I read.\nYou have that. Then you have whatever is in Area X being a really good mimic and at times throwing back things at you that it thinks you want to see. If the biologist is inaccurate, it’s because she’s being misled. I think she’s not so much an unreliable narrator as somebody who doesn’t want to tell you everything at the time you want to hear it. Everything she says is accurate up to a point. It’s just that she’s not telling everything.\nEspecially in the third book, you learn a lot more about her too and get a better sense of maybe peculiarities of her character you don’t know about in book one, and also by book three, a lot of the conversations that occur in Annihilation take on a different light because you know a lot more about those other characters on the expedition with her, because some of the other two books go back into the past a little bit.\nThere’s a style in it too that I think you do which is the characters hold back information. In Authority, I noticed that sometimes I would think that there would be an incident that will happen, and I will think it’s all over with, and then a few pages later, you come back, and you hear there was something really important that happened in that incident that wasn’t explained at that time. What’s your intention with that?[In part because the main character is trying to analyze everything and put it into a context first, and also because the point at which some things happen to the main character isn’t the point of maximum tension—it’s when he has to report back to his superiors. But] there’s also a real practical reason why [for some of] those gaps, so I can’t really address that. With the biologist, she’s very concerned about being seen as objective and not being judged by certain things, so her agenda when she sets out this journal account, which is written . . . it’s not really in the moment of what’s happening but a little bit afterwards . . . she’s very concerned about that, and so there’s certain things she doesn’t want to let you know, because she wants you to have other information first. I also think she’s kind of a reticent person anyway, somebody who kind of interacts with the wilderness a lot more than she does with other people or has more of an affinity for so . . .\nThe first novel’s first person, the second novel is third person. Did you think at some point about writing the second novel in first person?\nNo, I pretty much always knew the second novel was going to be third person. It was from the point of view of a new director taking over the Southern Reach, the secret agency, and I always knew that it was better for me to do that in third person.\nSomehow, my way into his character was third person, not first person, maybe because I think that if you’re new coming into the situation, you can already feel a little overwhelmed, and being so close as first person to that character probably would’ve meant it would be very difficult to get a sense of what’s going on around him, and so I wanted a little bit of separation from him, even though I’m very interior on his thoughts, to be able to kind of show the wider view of things.\nIn the third book, I use first, second, and third for different character points of view. Something that really annoys me with multiple character novels is when they use all first person. It’s really hard to make those differentiated, and if you use too many third person points of view, then the same problem can occur, just not as giant. Using the mix of the three makes them really stand out from one another, because the second person one is set in the past.\nDid they get progressively longer. Is Acceptance a lot longer than Authority?\nThe second one is ninety-three thousand words, and the third one is about ninety-one thousand. Almost twice [the length of Annihilation], and they’re all very complete, separate novels. There’s parts of the third one you probably can’t read without reading the first two, but the first two you can read independent of one another. You could conceivable read Authority first and then read Annihilation. It would be a different reading experience, but the reveals and the mysteries are so different in what’s happening that you wouldn’t have any spoilers, one from the other really.\nI think Annihilation works all alone too. You don’t necessary have to know all the things that you’re going to find out in the next novels.\nThat’s correct, and that’s why they’re not this A to B to C bunch of reveals because it’s actually been really rewarding to me, because I like ambiguity quite a bit, to have a certain number of readers saying, “I don’t even want to know what happens next. There’s enough in this for me.” Then, of course, there’re readers who say, “I need to know what these mysteries.” I think I struck a balance between those two groups. It’ll be probably enough for them to both hate me by the end of the series. [Laughing]\nSeriously, Authority is an exploration of authority as well as a continuation of the story. It is its own separate character arc. It is about this secret agency. It’s an expedition into it the same way that Annihilation’s an expedition into Area X, and then the third book has its own set of themes and concerns.\nReveals are like ten to twenty sentences a book, and then there’s all the rest of it [remaining to write]. Conceivably, I could’ve written book one and done a couple Twitter messages and been done, I suppose, but there were some other things I wanted to explore, and I really wanted to explore these characters from different points of view. Even by the end of the second book, you have a different view of the psychologist, who’s on the expedition in the first book, for example.\nThe publishing experience was different for you from what you have been used to. Would you talk a little bit about that?\nYeah, it was quite interesting. Up until this point, I’d been writing books that were set in imaginary worlds. They were published by science fiction fantasy publishers here in the US. Sometimes they were published by mainstream publishers overseas. On this one, it was the exact reverse. We had several offers from literary mainstream imprints and very little interest from genre imprints, and I still don’t know why that was. I was kind of concerned until the books came out, and does this mean it’s not going to connect with a certain segment of readers?\nBut so far, these are probably my best-selling books ever. I think the schedule that they’re on of releasing all three in the same year has been really helpful too in terms of sometimes you’ll have the second book come out a year later, and even if people really loved the first book, there’s this resistance to it, or they have forgotten certain parts, and so there was also less need for me to kind of recap things at the beginning of the second book that there would’ve been otherwise.\nThe only thing about the fact that they’re putting them out back to back is I think I’m probably going to be dead by the end because I’ve been on the road more or less continuously except for some breaks from February 4th through now, and then I get two months off, and then I go back on the road from the end of June to the end of the year.\nI get a year off after this, and after living like a hermit for two years, I get to be on the road and learn how to talk to people again, which has been fascinating as well.\nWhich one do you like better, the hermit or road warrior.\nThe hermit because I love to write, but I do love being out on the road. Now, I schedule some extra time to go walking around the wilderness. I enjoy meeting people, but every once in a while, at a certain point I have to kind of retreat and get some writing time in. There’s kind of an itch there where if I don’t write for a very long time, I get kind of twitchy. Luckily you’re not encountering me when I’m twitchy.\nAudience: What about you doing the screenplay for the movie?\nThat’s a very good question. Because it’s a first person narrative and film is third person, they’re going to have to make radical changes anyway to make the first movie, so I don’t really have a problem with someone else doing the screenplay. If it was somebody other than Scott Rudin Productions, maybe I would have a problem.\nWell, thinking about the film, are there things that you are concerned about?\nI’m concerned about a few things. These are not four white women running round in Annihilation, as you learn in the second book. They’re also not a bunch of men, and my concern would be that they would change the gender of the characters or something like that. I’m less concerned on the diversity issue because it’s more about getting the right actor. [Regina King] who was on Southland who I think would be perfect to play the biologist, even though you learn the biologist is not African-American in the second book. It’s more getting the mix right, getting the right actresses, sticking with women for that expedition. Those would be my main concerns would be casting concerns.\nIn fact, that’s what I was thinking about. I would hate to see them change the female expedition because we’ve got to have a guy in there. There’s a tendency to do that with a science fiction thriller, to not have it all be led by women. That concerned me too.\nI read somewhere recently that a lot of the top blockbusters have had female leads, so maybe that’s changing.\nYour parents, growing up in Fiji, what kind of influences has that had on your writing over the years?\nThere’s a scene in Annihilation where she goes out at night, and she finds this glowing starfish. This is actually something that happened to me when I was in Fiji at like the age of six or seven. We were out on the reef at night, and . . . at a certain point I had no idea where the heck I was and which way land was or anything else. I could kind of see flashlights in the distance, and I came across this Crown-of-Thorns starfish, which does kind of have a phosphorescence at night. It kind of acclimated me to exactly where I was.\nOther than that, I haven’t been able to write about Fiji, and I don’t know if it’s because I was so young when I was there or because being embedded in another culture doesn’t really mean you become an expert on where you are. Definitely, it was an influence because instead of taking raises or sometimes pay, what they did is they took travel vouchers and at the age of, I think, I was eight or nine when we came back from the Peace Corps from Fiji, we spent nine months traveling around the world, mostly Southeast Asia and Africa and places like that, and it was the perfect age for me to soak up a lot of it and, of course, have an influence on my fiction and how I think about fiction in general.\nYour parents, I think, somewhat show up in the books.\nThey do a little bit. They’re kind of transformed. They appeared a little bit more in my prior novels. My dad’s an ant scientist. He’s a research chemist with the USDA working on fire ants. My mom’s a biological illustrator and currently studying French graveyard art for another Ph.D. over in France. In fact, she once got caught in a graveyard after hours and was detained by the police and then emailed me and said, “You wouldn’t believe how many weird people there are in this graveyard after midnight.” I was like, “Yes, mom, you were there.”\nHow important is research in your writing? In this particular, in the first book, Annihilation, you’ve got a biologist and a psychiatrist. You’ve got all these scientists. How important is it for you to kind of know where they’re coming from?\nEven though my dad’s an “ant scientist,” he has interaction with other kinds of scientists, and there are certain things that are common across in terms of scientific theory and pursuit. That I already kind of had down, and then I did do some research. I always wanted to be a marine biologist until I discovered I didn’t really want to study biology—I just wanted to look in tidal pools—and so I had some background there.\nI also had the idea that the biologist is not the world’s best biologist. I mean, you notice in the book that she gets fired from an awful lot of jobs. I used that in part because I didn’t want to over-research it and then kill the spontaneity of the book with too much of that. There’re actions that she takes that are not really by the book that wind up being important to the plot in the second and the third book.\nYou know, you also write things that kind of take place in imaginary cities and involve history. Do you spend a lot of time researching that sort of thing?\nFor the prior books, I studied pretty much all of Byzantine history. I must have read twenty to thirty books on Byzantine history and Venetian history. There’re some really weird things in there—like you find out that the Visigoths made cloaks from the pelts of field mice and that the leaders who had the most power had the most field mouse pelts in their cloaks. That sounds very powerful. [Laughter]\nFor the Southern Reach novels, it was more the sense of place that was really important, and so I reached this point in writing where I knew I needed to have a different environment because at some point one of the characters leaves the South basically, and I was a little bit frantic about that because everything in the books that’s about the South is something that I’ve seen, observed, know the texture of, and I didn’t want a single received research detail in there.\nSo my wife and I actually took two weeks off to just go up the coast of California as basically a research trip, and what I was doing was collecting textures and smells and scents and talking to people. You can’t feel like you live there obviously if you’ve only been there for that amount of time, but in terms of the actual landscape, you can pick up enough detail, enough sense of it, that you’re not giving reader received secondhand information.\nAudience: What did you study in college?\nWell, I went to the University of Florida, and I took some creative writing classes. I started out as a journalism major and then went to English with a Latin American History minor, and then by the second year I pretty much I knew I didn’t really feel like graduating. I know that sounds weird, so I just took every class I wanted to take that I hadn’t taken because the poet Richard Wilbur had come through a couple of years before, and he basically said don’t get a creative writing degree—just take as many different courses as possible. Learn as much as possible, soak everything in.\nAt that point, I just had lost focus because I didn’t want to become a teacher or journalist. I just wanted to write fiction. I dropped out halfway through my senior year, and I got a tech writing job, and then I just wrote on the side until I could become a full-time writer. I wouldn’t necessarily advise that as a path. It’s just what happened to me. It’s very difficult when you go in thinking you want to do one thing and then you realize it doesn’t really matter what you do because all you want to do is write fiction. That’s very destabilizing when you’re in a situation where you need to have discipline.\nAudience: Do you have a good idea about the characters’ names and who they are and where they are? Since there are no names in Annihilation and you don’t know exactly where in the world it’s set.\nIn Authority, you get a better idea of most of them. You get some names. You may never get a name for the biologist; I’m not telling. And you get more of a sense of place, very specific. Like, the Southern Reach building in Authority is based on a combination of really crappy 1970s concrete government buildings in the United States and like the worst possible Soviet architectural disasters, so it’s this kind of U that has all these weird baffle issues and all these gutter issues. I had a lot of fun with that where actually, for the second novel, I have a diagram of the building and how everything matches up.\nWe mentioned that the story has a kind of espionage thing going on. What was your inspiration for that?\nI’m a huge John Le Carre fan. I think he is a brilliant writer, and for some reason—and this doesn’t lessen the accomplishment—in his best novels, I think he’s just an absolutely master of the art and craft of writing, but because they’re espionage novels and therefore they have this particular focus, it’s easier to see how he uses craft than in some mainstream literary novels that are not in a particular genre. Even though, like I said, I think he’s absolutely a master of that.\nI love the interiority of some of his characters, the way that he makes all his characters incredible lived-in, and you just see everything from their perspective in such an interesting way and how they get involved in these very intricate puzzles. I’ve taken a lot of craft lessons from reading Le Carre’s books, and I wanted to do kind of a deconstructed spy story mixed with kind of a horror story.\nYou’ve mentioned your wife a couple of times. I know you edit anthologies together. What’s the working relationship like.\nIt didn’t start out very well. We met because she came down to Gainesville where I was organizing some literary events, and she was asking for advice about her magazine, which she just started. I promptly then sent her a story. This was very early in my career. It was a terrible story about a talking magic frog going to the prom, and I don’t even . . . I mean, it was really, really early in my career.\nShe rejected it, and then I sent her a letter back saying that I was glad she rejected it. It had been a test to see if she was a good editor. [Laughter] Which it had not been. It was just a crappy story that I had not recognized was a crappy story. Our relationship built on that. As most relationships do.\nFor a long time, we kept our editing separate because we wanted to have separate identities, and we were both afraid, just because of sexism in the field, that if we combined forces everything would be about me. Then eventually, it made no sense because she was helping on all the projects I was doing, and I was helping on all the projects she was doing, so we combined forces, and now we’ve edited all these anthologies together, and it’s proven very good.\nI’m a good skimmer if that makes any sense, on these anthologies. I will go on ahead like a golden retriever bringing back interesting stuff, and she will tell me, “That wasn’t actually very interesting at all,” or “This was.” She’s the more in-depth reader for the anthology. She’s also a very good general editor, and I’m more about the line edits and getting into the manuscript, and so we work very well in that regard.\nAfter the third novel comes out and you’ve finished your travels where do you go from there? I know you’re not going to think about writing fiction for a year, right?\nRight. Well, I’m working on editing for our own press an omnibus of a really interesting Finnish writer, Leena Krohn, a nine hundred-page volume of her work. I think she’s an amazing fantasy writer who’s very underappreciated, and my hope is that when all of these reviewers get this doorstop of a book, there’s absolutely no way that they can ignore her work.\nI’m also working on something called The Book Murderer, which I meant to be the last novel I ever wrote but probably will be the next one, which is a sendup of all aspects of book culture. From publishing to reviewers to everything, every aspect of it, literary festivals. This festival nothing weird has happened, so I have no material.\nWell, yeah, it’s not over yet.\nHa! Yes, and, you know, the book addresses issues like blurbing. Blurbing can be a very kind of incestuous thing where you blurb somebody, and then they ask you for a blurb, and so there’s a section in The Book Murderer where he does a rant on his blog about blurbers, and the whole incestuous nature is completely over the top. The reason I know this might get me in trouble is I posted on my blog just as an experiment to see how people would react, and I got so much hate mail from this thing that was meant to be a parody or a satire.\nThank you very much.\nThank you. Thank you for some great questions."}