{"fingerprint": "/Q9PpyHZ8dBrM0EXIzxYj3QYLZw=", "sitename": "Clarkesworld Magazine", "title": "An Interview with Jeff VanderMeer by Neddal Ayad", "author": "Neddal Ayad", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/vandermeer_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Interview with Jeff VanderMeer by Neddal Ayad", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nAn Interview with Jeff VanderMeer\nJeff VanderMeer is all over the place. In the best possible way. When he’s not kicking people in the head with the novels in his Ambergris Cycle; City of Saints and Madmen, Shriek: An Afterword, and Finch, he’s editing anthologies; The Leviathan series (w/various co-editors), The Thackery T. Lambshead Pocket Guide to Eccentric & Discredited Diseases, Steampunk (w/Ann VanderMeer), The New Weird (w/Ann VanderMeer). Forthcoming books include Booklife: Strategies and Survival Tips for 21st Century Writers and (w/Ann VanderMeer) TheKosher Guide to Imaginary Animals. When he’s not writing or editing fiction he’s laying down science on various aspects of writing on his blog, Ecstatic Days, interviewing people for this fine publication, amongst others, and writing reviews for The Washing Post Book World. When he’s not doing that he’s teaching workshops. When he’s not doing that he’s traveling. When he’s not traveling . . . you get the idea. I caught up with Jeff via email and pinned him down long enough to talk about the genesis of Shriek: An Afterword, the PR grind, and plushies.\nWhat compels you to write?\nI write for a number of reasons. The primary one is, naturally enough, to tell stories—one of the first I ever did was a blatant retelling of an Aesop’s fable, and I still remember that because of the pleasure I felt in spinning a yarn, no matter how derivative. But I also wrote poetry as a child, and kept a diary. When I started to write a lot of fiction and poetry, I stopped keeping the diary, so at the time I assumed the fiction and poetry had taken the place of the confessional nature of the diary. That I had, in sense, revealed my personal life, in deeply disguised form, in those works.\nI wrote first to amuse myself, to satisfy the rich inner world I created while growing up. My parents were involved in a messy, argumentative ten-year divorce and although I didn’t think of it in this way at the time, the fiction and poetry helped me to find a constructive outlet for feelings of sadness and anger, as well as an escape. This is common for many children who become writers.\nThe nonfiction is usually a more outward expression of my own fiction, in that I believe every writer should define not only what they like but what they don’t like (and why), and in this defining learn something about their own fiction. I consider my reviews, for example, to be very much from a writer’s perspective rather than a critic’s perspective. In fact, I’m very wary of critics, having seen them get so many things wrong so much of the time—and also very aware of the problems that occur when you let others define what you do and how you do it.\nMy interviews are usually an expression of admiration for other writers, and a genuine desire to better understand their work and their lives. The blog, meanwhile, began as a kind of public diary about the writing life. For a long time, I found it a very unself-conscious means of expression, and I enjoyed it for that reason. I felt like I was creating something for myself, like my fiction, that other people just happened to read. When I found out that a lot of people were reading it, my attitude changed, and I now think of it as more of an online magazine. I’m hopeful that I can redirect it in future and make it more personal again, but I’m not sure. I do enjoy writing blog entries, in that it’s more formal than a message board post, but there’s still a kind of looseness I don’t get from more formal nonfiction, in magazines and web magazines. What the blog does for me now is allow me to promote work I really enjoy but to not be tied to the idea of a full review, or of a complete review. I’ve had fun reviewing parts of books as I read them, which may sound odd, but can yield rewards unlike a complete review written after having absorbed an entire novel, for example.\nIn general, though, I’ve been writing for so long, though, that I just do it, I don’t really think about why I am doing it.\nYou once said that Thomas Ligotti was involved in the genesis of Shriek? How so?\nA while back, Ligotti and I had an email correspondence about the Ambergris work. I got the feeling it wasn’t all to his taste, but one thing he said to me about “Early History . . . ” stuck with me. He said that the narrator of the story (which takes the form of a fake history essay), historian Duncan Shriek, had no stake in the story, unlike in Nabokov’s “Pale Fire”, where the narrator definitely has a stake. In narrow terms of influence and meta intent, I’d meant “Early History” more as a correction of Pavic’s flaccid “Dictionary Of The Khazars” than a gloss on “Pale Fire”, so I didn’t find the comment useful in the context of what I’d written. But I thought it would be interesting to develop a context in which Shriek would have a stake. At first, it was just an exercise of background writing for the character, but suddenly Duncan’s sister, Janice, came alive in my imagination. The first draft of the novel was, I kid you not, twelve single-spaced pages in the form of a Hoegbotton pamphlet written by Janice. As soon as I had written it, I realized that what I really had was a rough summary of a novel. I would not have come up with the idea without Ligotti’s comment to me.\nNow that Shriek has been on the shelves for a while and you’ve had time to absorb and process, how do you feel about the reaction to the novel?\nOverall, I’m quite happy with the reaction, although had hoped it would be up for some awards. I feel it’s actually a stronger book. I do think some readers had trouble realizing that it wasn’t going to be City of Saints 2. With City, Shriek, and Finch, it’s the same city as the setting, but radically different approaches. This can cause some sense of the bends in unprepared readers. Still, it has continued to sell steadily in trade paperback, and I continue to get comments from readers via email—someone even used a passage from it at their wedding. It also made several year’s best lists, including Amazon, SF Site, Austin Chronicle, and the San Francisco Chronicle. In the UK, similarly it sold well past its sales cycle and is almost sold out. It’s been translated into German and soon into Russian, among others. I think of it in terms of reader reaction as a kind of cult sleeper that will eventually catch up to City. In terms of how it works as a novel, it does everything I meant it to do and more. My sole real disappointment is that hardly any reviewers engaged the novel fully, even though it got lots of great reviews. By which I mean they disregarded the discussion and application of history in the novel. They ignored the environmental subtext. They wanted, presumably, to read it the same way they read any other fantasy novel. But it was quite specifically not any other fantasy novel.\nThe environmental and historical subtexts are fairly obvious, do you think they were missed or ignored?\nFor one thing, most reviewers are working under a time crunch, and they have an obligation to summarize the basic storyline, and they have very little space to work with sometimes. So it might be unrealistic of me to expect more than what I got.\nFor that matter, Ambergris during the civil war bares more than a passing resemblance to any number of “real” cities in the midst of an urban conflict – Hanoi, Belfast, Beirut, Sarajevo, Baghdad, Gaza . . . even places like Detroit and New Orleans. Again, do you think that the reviewers ignored this or just dismissed this element of the work?\nI’m not sure. It’s possible it’s one of those things where you pick up on a lot of it on a second read—a luxury a lot of reviewers don’t get. I also meant this novel to be about the whole world, in a sense, and there’s a lot going on.\nDid you have a hard time pitching Shriek?\nI didn’t really have to pitch Shriek. My agent didn’t want to run it by editors until I’d finished it. So it wasn’t pitching it so much as getting them to be receptive to reading it when I’d finished. It tended to split editors down the middle, but this is also true of Veniss and City. The difference this time is my success with Veniss and City made Shriek viable from a large publisher—i.e., some of the editors didn’t have to think about the bottom line quite so much, despite Shriek being a somewhat odd book.\nHow much did Shriek change as it made its way from submitted manuscript to bookstore?\nIn working with my editor at Tor, Liz Gorinsky, it changed by about 30,000 words. About 20,000 revised substantially and about 10,000 added. She did a great job with structural and line edits. I knew it was the kind of novel that would need that kind of an edit because it wasn’t structured in a conventional way. As a kind of demented family chronicle, it had to seem both plotted and not plotted, for example.\nIs it better to be a consummate stylist or to have good ideas?\nI prefer to read writers who have good ideas and are consummate stylists. The problem is that a consummate stylist like Nabokov can be accused of not having good ideas because he is a consummate stylist, which is a little unfair. I think it’s better to be a decent stylist with good ideas than a great stylist with mediocre ideas, though.\nThis idea of style is an interesting one, though. I tend to change my style to fit the story. I may still operate within certain basic parameters, but it’s not always possible to tell I wrote a story because I like to change things up. Jeff Ford, after reading three recent stories of mine told me he wouldn’t have had a clue the same guy wrote all three if he hadn’t already known. That’s a good thing as far as I’m concerned.\nHow do you balance your vision vs. market demand?\nI don’t listen to the marketplace. I write what I want to write. Once it’s finished, then I switch to PR/spin mode and I think about how to position the material, or contextualize it, in such a way that it will be most appealing to editors and readers. I’m very lucky in that unlike a Ligotti, for example, I write weird stuff but I also don’t mind doing the PR work, and I’m actually good at it. In fact, Ligotti has been an anti-example for me, as have a few other eccentric writers. I never want it said that I failed because I didn’t put myself out there and give it my best shot in terms of doing readings, schmoozing, etc. This creates an unreal image of me in some people’s minds, however, because the public side of me is mostly related to doing things to help the books get attention and sales. The private, creative side is not as often seen. So, ironically enough, given the experimental nature of, say, City of Saints, I have had people make comments indicating they think I’m too commercial! Far from it.\nYou’ve mentioned that Shriek is a deeply personal novel and that like City . . . it draws on aspects of your family history. Does your family read your work? What do they think?\nThey do read my work. My mother was horrified that I referred to her research on French graveyard art in “Strange Case Of X’, but only because she thought it might somehow compromise the book she is writing on it. I wrote a story collected in The Day Dali Died called “At the Crossroads, Burying the Dog,” about the night my sister and I buried the family dog, Sita, a Samoyed long since abandoned by both my father and my mother into our care. I think my dad didn’t care for the story that much. And sometimes my sister will say, “it didn’t happen that way.” But you do what you have to do to re-imagine real life events so that they become universal and alive outside of your personal life.\nI find it quite peculiar that most reviewers seem to think there is no autobiographical element to my work. Between the world travel yielding up exotic settings for it, the experiences in those stories often having some basis in my own experiences in those countries, and then the personal references to family members, you’d think they’d comment on it more.\nBut just including information about your family members doesn’t make something personal in a visceral sense. The information about “X” in “Strange Case of X” is very accurate, precise information about me. But the simple recitation of biographical facts did not make the story personal to me. What made it personal was what it said about creativity, and the writer’s relationship to his or her work. The obsessive quality.\nMy family has read Shriek, and has been very good about it, considering that I plundered incidents from their life for it. For example, a family member of mine twice attempted suicide—something that, for me, was not just traumatic because I was close, but because it was almost as if an alternate me had tried to kill itself. When they read the suicide scene in Shriek, they said only that I was wrong—it didn’t make you numb or cleaned out. It made you angry. I said, that might be true of them, but it wasn’t true of me. So what I wrote in Shriek about suicide is about this person, but using my own reaction to their attempts. If anyone was ever going to be mad about me using real events in my fiction, that would have been it. But they weren’t and I love them for that.\nI’m going to list some recurring themes and motifs in your work and you’re going to tell me why they are recurring themes and motifs in your work.\nThe brother-sister-lover triad (Duncan and Janice Shriek and Mary Sabon in Shriek, Nicola, Nicholas, and Shadrach in Veniss . . . )\nGrowing up, because of their ten-year conflict before finally divorcing, my parents were somewhat distant from us. Their attention was diverted toward seeing the worst of each other, a situation that became more frenzied as time progressed. Thus, my sister and I were what remained of the family in an emotional sense. I was closer to her than to my parents. I think it comes out of that—that, to me, the family unit was basically me and my sister. So when I write of “family,” that’s who it is, with the parents distant, removed, or dead in some sense.\nOf course, there is another dynamic at work now, which is that I have inherited the extended family of my wonderful wife, and now my idea of family is much wider and deeper than before. So I think it’s safe to say that Shriek is the last appearance of that particular dynamic in my work. Zamilon File is, at one level, about a husband’s love for his wife, and devotion to her, for example. The fact is, right now, it is very hard for me to be cynical about love, knowing exactly what I would do for Ann, and how far I would go.\nEyes, lack thereof, and their removal.\nThis must be something subconscious. There are several elements in my fiction that are intuitive and that I don’t fully understand.\nThe Underground—As sanctuary and as death-trap.\nI’m sick of hearing about Jung, but it may be that this is a Jungian thing. I’m trying to think back to my childhood, and whether there might be something there that figures into this, but I’m drawing a blank. I’m sorry I can’t give a more satisfying answer.\nLittle people.\nThe mushroom dwellers aren’t hobbits. They are a colonized people who are barely understandable to their colonizers. To my mind, they are exemplary of an advanced civilization so advanced that they seem incomprehensible and primitive to species not quite so advanced. As for the appearance of dwarfs, midgets, etc., in my fiction, I don’t know. I like the lack of perfection that is a kind of perfection itself. I like the way in which this affects how people view such individuals.\nInfection\nInfection is part of our world. There are hundreds and thousands in bacterial and cellular migrations and interactions occurring around and in us all the time, and infection is one of them. Infection is also a physical symptom of the absorption of knowledge in Duncan’s case: the price to be paid for acquiring knowledge is to be literally transformed. And infection is the price to be paid for being human.\nCodes and ciphers\nWe all speak in codes and ciphers and shorthand. Our mannerisms, the things we mean that are at odds with the things we say, the way we say things that sound like they mean one thing but mean another. Codes and ciphers are at the heart of human communication. To explore “formal” codes and ciphers is to explore the history of human communication, too, in a way. And human language. And the way in which we allow language and writing to enslave us or make us free.\nIs it difficult to write about the Mushroom Dwellers, to give the sense of something whose motivations and motives are beyond human experience?\nI struggled with this throughout writing Shriek. I even toyed with naming and describing a new sense over and beyond the human five senses. I filled a few pages with what this new sense might be like, studied various animals and insects that possess senses we don’t, and in the end, the best I could do is encapsulate in that penultimate section in which Janice puts on the glasses and follows a trail of fungi to Duncan’s hidey-hole. At the same time, I’m not sure Duncan isn’t right about their motivations when he talks, early in the book, about the Silence. The simplest of motivations can seem oblique when masked by actions that cannot be interpreted because of lack of information.\nThere’s an eschatological bent to much of your work - the post-human world that’s beginning to form in Veniss, the post-human Ambergris of “Corpse Mouth, Spore Nose” and Finch- would you care to speculate where this comes from?\nWell, for one thing I think the “end times” of our planet will feature strangeness we can’t even begin to fathom—and that appeals to me. I will never forget in The Time Machine when Our Hero goes forward and forward and forward in time and things get odder and odder, and trying to somehow describe and catalog that oddness is appealing to me, since it seems to promise new ways of looking at the world. I don’t believe in the supremacy of human beings, and anyone who looks at the historical record of the world would be a fool to believe that we’re anything other than a blip on a remote planet. So, in terms of suiting my sense of the long view of history, the recent eschatological bent as you put it is perfectly appropriate. I do think you can examine the alien within a non-SF or non-outer-space context, too. Think of David Bunch’s fiction, which often seems as if it were completely not of this world. Or even some of Cordwainer Smith’s work.\nCould you tell me how the limited edition of Shriek came about?\nWyrm Publishing was interested in doing one, as part of a new line of books. I knew the Church had more music for Shriek than just the music used for the Shriek movie, and when they expressed interest in fleshing it out into something more like a soundtrack for the novel, with lyrics taken from the book, I thought it would be a great idea. Then you throw in getting a cover by Ben Templesmith and layout by John Coulthart . . . it’s the “dream team” edition from my point of view.\nHow did the Church get involved?\nRobert Devereux, a Pittsburgh musician, had contacted me about doing a soundtrack for City Of Saints. When that came out—it was called “Fungicide”—I then thought, while working on Shriek, why not have music for it, too? I contacted The Church because I’d listened to so much of their music while writing the book. At that point, I was set on doing a short movie using still photography, public domain images, and some live action. I thought investing in a strong soundtrack would be a good thing to do, given we had no live-action actors to invest in.\nAfter The Church got involved—in fact, they actually came to one of the Shriek release parties, in San Francisco—then I thought, what if they actually developed the film music into a soundtrack for the novel. Steve Kilbey seemed attracted to the idea, and they went back into the studio, with Tim and the whole gang, and did an actual soundtrack. Since Kilbey’s a bit of a hero of mine, I was thrilled, especially because they extracted such meaningful parts of the book for the lyrics. The actual CD is so much more complex and song-cycle-ish than the original movie music. They did an amazing job.\nWhat can you tell me about Finch?\nIt very much borrows from two impulses: hardboiled noir, with that kind of stripped down prose, and visionary, mind-blowing dark fantasy. Those two impulses are wedded in Finch. I see this as a progression: the arch metafictional experiments in City Of Saints, somewhat stylized, which give way to the personal unreliable narration of the Shriek siblings in Shriek: An Afterword, and now a gritty, from-ground-level view of Ambergris in Finch. Throughout the experience, you are kind of progressing from the city as idea to the city as real. In Finch, you are more or less looking out from behind the eyes of the title character. Almost as if he were wearing a tiny camera on his left ear. While also getting his thoughts. Even as the events are more conventionally thriller-oriented, the orientation itself is intensely personal. It’s the last novel of the Ambergris Cycle, which is not to say I’ll never write about Ambergris again, but this solves the mysteries set up by the first two books, while opening up others. It’s also set 100 years after Shriek during a time in which the gray caps have risen, flooded the city, and taken control. The human resistance has been broken. Against this backdrop, John Finch has to solve a strange double murder. Solving it might just change the city forever.\nHow does it feel to be one of the handful of contemporary writers who’ve picked up the gauntlet that Moorcock and Ellison threw down back in the late 60’s/early 70’s?\nThat’s kind of you to say, although the tradition I feel part of is that which mixes mainstream and genre influences. As for how I feel about where I am, some days I feel privileged, other days not so much. I am now two years into not having a day job and making my living entirely from my writing and editing. How can you beat that? And I continue to get a lot of critical praise and pick up new readers. Other days, I feel that it is always going to be an uphill fight. When I was younger, I thought I’d get to a point where I wouldn’t have to keep fighting and working so hard (even though I get pleasure from working hard). I now recognize that even contracts from big publishers will not, in my particular case, solidify my position. I have to go out and prove myself all over again every day.\nLargely, though, I embrace this situation. I am at peace with it. I am strongest when I feel like an outsider, and the longer I feel that way, the longer I will continue to produce strong work. There is little danger of becoming complacent in my world. That said, I find the strength to keep going forward, to keep storming the keep, trying to take that hill, because of the strength of the response from my readers. From those critics who get what I’m doing. And, most importantly, from my wife Ann, who is the toughest human being I’ve ever met and whose example and guidance keep me sane.\nIn any event, I will always be an advocate of adult writing, of adult literature. Of trying new and different things. I feel that long-term this is the only strategy worth pursuing for me. I don’t believe in God. I don’t believe in an afterlife. This is our only life, and thus taking chances doesn’t scare me.\nWhere are the Gray Cap plushies?\nThey’re coming, I suppose. Along with the Gray Cap Underroos."}