{"fingerprint": "IYSc55wC0K7Bnfc2j6ipBC0erMk=", "sitename": "Clarkesworld Magazine", "title": "Solace by James Van Pelt", "author": "James Van Pelt", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/vanpelt_05_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Solace by James Van Pelt", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7120 words, short story, REPRINT\n Solace\n The wall display didn’t last two sleep cycles. When Meghan woke the first time, one hundred years into the four thousand years long journey to Zeta Reticula, she waved her hand at the sensor, and the steel wall morphed into a long view of the Crystal River. On the left side, aspen leaves trembled in a breeze she couldn’t feel. The river itself cut across the image, appearing between trees, tumbling over rocks, chuckling and hissing through the speakers before draining onto the floor at the bottom of the image. On the river’s right bank, the generator house, a remnant of 19th Century mining, clung to a gray granite outcrop. A tall water chute dropped from the building’s bottom, down the short cliff to a pool below. She’d taken the picture on her last hike before reporting for flight training. Every crew member’s room had a display. Only hers showed the same scene continuously. She joined the crew for their fourteen-day work period, and then returned to the long-sleep bed.\n But when she awoke the second time, two hundred years after they left Earth orbit, the metal wall remained grimly blank. She sat on her bunk’s edge, empty, knowing the lead in her limbs was the result of a hundred years of sleep but believing that sadness caused it. No mountain. No river. No rustic generator house standing against the aspen. She called for Crew Chief Teague.\n While she waited, she opened the box under her bed where she kept a souvenir from Earth, a miner’s iron candlestick holder, a long spike at one end, a brass handle on the other, and a metal loop in the middle to hold the candle. She’d found it in a pit beside the generator house after she’d taken the picture. It had a nice heft to it, balanced in her hand. She had cleaned the rust off so the metal shined, but pits marred what must have at one time been a smooth surface. She liked the roughness under her fingers.\n After checking the circuits, crew chief Teague said, “Everything about this expedition is an experiment.” He punched at the manual overrides for the display behind a cover plate in Meghan’s room. “There’s no way to test the effects of time on technology except to watch it over time, and that’s what we’re doing.” He clicked the plate shut. “All that matters is keeping life support, guidance, and propulsion running for the whole trip. You make sure hydroponics continue to function. I work in mechanical repair. Teams service the power plant. One of the four crews is awake every twenty-five years, but we don’t have time to repair a luxury like your display wall. We’re janitors.” He ran his hand down the blank surface. “It’s already an old ship, and we have a long, long way to go.”\n “We have to keep running too. The people.”\n “Yes, there is that.” He rubbed his chin while looking at the candlestick holder in her lap. “Interesting piece. Does the handle unscrew?”\n She twisted it. “Seems stuck.”\n “We could open in the machine shop.”\n She shook her head.\n After Teague left, Meghan tried to remember how the river looked and sounded. With the wall display working, she could imagine an aspen breeze on her face, the rushing water’s pebbly smell. She could remember uneven ground, slickness of spray-splashed rocks, stirred leaves’ sweetness. With eyes closed, she tried to evoke the memory. Hadn’t the ground been a little slippery with gravel? Hadn’t there been a crow circling overhead? When she was a little girl, her mother died. A month later Meghan could not remember her Mom’s face. Only after digging into a scrapbook did the sense of her mother come back to her. Now, it was just as bad, but what she couldn’t remember was Earth. The metal walls, the synthetic cushioning on the floor, the ventilation’s constant hiss seemed like they had been a part of her forever, and the Earth slipped away, piece by piece.\n She placed the flat of her hand on the blank wall. It’s only two years, she thought. In two years I’ll be out of the ship, if the planet around Zeta Reticula is habitable. But she shivered. Only two subjective years. She’d spend most of the trip in the long-sleep cocoon. If the technology worked, she would leave the ship in four thousand real years.\n Teague was right, though, about untested technology. Nearly every element of the expedition was a prototype. Could a human-manufactured device continue to function after four thousand years, even with constant maintenance? The Egyptian pyramids were forty-five hundred years old, and they still stood, but they were merely rocks in a pile, not a sophisticated space vehicle. After four thousand years, the pyramids weren’t expected to enter an orbit around a distant planet while maintaining a sustainable environment against the deadliness of space.\n And what of the people on board? The only test of the technology that kept a person alive for four thousand years and preserved the seeds and fertilized ova would take four thousand years. Dr. Arnold, who knew all their medical charts by heart, told her that what she felt was homesickness. Like Meghan and the rest of the crew, he was in his twenties, but he spoke with maturity. Meghan trusted him. “Look for these symptoms,” he said, “episodic or constant crying, nausea, difficulty sleeping, disrupted menstrual cycle.” He consulted his notes. “Of course, those symptoms may also be induced by long sleep.” His assistant, Dr. Singh, nodded in agreement.\n “Dr. Arnold, I’m two hundred years late on my last period.”\n Already she felt old. Already, with the sun no more than a bright star in their wake, she felt creaky and removed, a part of the dead. I shouldn’t be able to sense Earth’s pull from here, she thought. I shouldn’t have come. They should have known that a hydroponics officer wouldn’t do well away from Earth, away from forests and long stretches of mountain grass. Even when we arrive, if everything works, if the planet is hospitable, it will take years and years to grow Earth trees to sit beneath. I’ll never see an aspen again.\n I won’t make it.\n Isaac scooted his stool closer to the tiny woodstove. If he sat close enough, long enough, the warmth crept through his mittens and the arms of his coat. His knees, only a few inches from the stove, nearly blistered, but the cold pressed against his back. It slipped around the sides of his hood. He eyed the tiny pile of wood by the stove, the remains of the table he’d broken into pieces the day before. All the cabin’s goods sat on the floor since he’d burned the shelves earlier. Beside the remains of the table, the only other wood was a small box of kindling in case the fire went out, and the chair he sat on. Outside, snow covered the ground so deeply that there was no hope of finding deadfall. Besides, every tree within a mile had either been cut down for mine timbers or had its low branches cut off for firewood. He’d hauled the wood he’d been burning for the last ten days from a site four miles upstream, but that was long before the storm moved in, cutting visibility to a few feet.\n In the room below, machinery thumped steadily. Water poured through a sluice to turn a wheel connected to a squat generator. Cables ran up the mountain to the mines’ compressors, clearing dead air from the tunnels and powering the drills, but Isaac couldn’t tell if the miners were still working. They probably were hunkered down like he was, in their bunk houses near the digging, or they were stuck in the town of Crystal. If they were working, the compressors needed to run.\n He looked out the window. Thick frost coated the inside of the glass and snow piled half way up outside dimmed what light the dark afternoon offered. The window in his tiny, second story maintenance room was at least fifteen feet above the ground. Two weeks of non-stop snow had nearly buried the building. Ten days ago, when the supplies clerk dropped off a bag full of dried meat and two loaves of bread, he’d said, “First winter in the mountains, boy? It’ll get so cold your piss will freeze before it splashes your boots.”\n Isaac hadn’t been able to open the outside door for the last three days. Heavy snow blocked it. He rubbed his mittens together, trying to distribute the heat. A steady wind moaned outside. Trees creaked. Something snapped sharply overhead. He glanced at the thick timbers supporting the roof. How much weight could they hold? How much crushing snow lay above him?\n He sighed, unwilling to leave the stove’s meager heat, but he had a job to do. Checking for candles in his coat pocket, he walked down to the darkness of the generator room, a “Tommie Sticker” in hand to hold the light. It was a fancy one, with a brass match holder and a screw-on cap to keep the matches dry serving as the handle. Ice covered the stairs, and the air smelled wet and cold. He jammed the spike end of the Tommie Sticker into the plank wall, then carefully lit the candle, using both hands to hold the match steady against his shivering. Oil for the lamp had run out two days ago. The wavering candle revealed water pounding through the sluice against the horizontal wheel, turning it ponderously counter-clockwise.\n Isaac used a two-pond hammer and chisel to clear ice from the water’s entrance and exit points. If the machinery stopped, miners would be without ventilation or power. Ice blocks as big as his head broke free from the structure and clattered to the unlevel floor, where they slid to the far wall. Despite the cold, he soon built up a sweat. He pulled his hood back and unfastened the coat’s top. When he finished, he would strip his coat and layers of shirts, replacing the damp undershirt with a dry one. If he didn’t, he’d be too cold to sleep later.\n The work wasn’t unlike living in the monastery, he thought, complete with a vow of silence and constant labor to keep his hands busy. He thought about God and God’s plan. He never felt as close to heaven as he did when he worked alone, cut off from human conversation and the daily distractions. In a way, he hoped the storm would hold. As long as the weather cut him off, he could replicate life in the monastery. He had loved his room there. The rough-hewn bed and the blanket thrown over a thin mattress. He’d read by candlelight there, too. Yes, the generator house reminded him of the monastery. The wooden building felt like a cradle of the miraculous, a miracle that never occurred when he had been an initiate.\n It hadn’t been this cold, though. No, not nearly so cold at all.\n Meghan came awake slowly and in pain. Dr. Arnold had decided four cycles ago that the powerful painkillers they used to soften the shift from the long sleep’s near death to full wakefulness were damaging, so they didn’t flood her system with them before they woke her. Lying as still as she could in the cocoon, her elbows and knees ached, as did her ankles and wrists. Even her knuckles hurt. A tear squeezed out of each eye and raced into her ears as she thought about clenching her fists for the first time on her own in a hundred years. Every move would hurt, at first, even though the mechanical manipulators flexed her joints daily.\n When she’d gone to sleep last, Crew Chief Teague had refused. She’d shaken his hand before heading to her cocoon. “I’ll be okay,” he said. “I’ll have a rich and long life, working in the ship. In twenty-five years I’ll greet the next work crew.”\n “I’ll never see you again,” said Meghan.\n “Maybe you will. I’ll be old though.” He didn’t meet her eyes. “I can’t face the dark.”\n Meghan could say nothing to that because she understood. Each time, climbing into the cocoon seemed like entering death. A one hundred year long instant later she woke to pain. Even her skin hurt, the now active cells firing neurons back and forth, renewing contacts that had laid moribund for so long, but as she lay in the cocoon this time, she thought about Teague wandering through the ship, all the crews sleeping, and he would wander for years and years and years, twenty-five of them completely alone until the next crew woke, and what could he say to them? He’d have a quarter of a century of experience that none of them could share. For them, Earth was only a couple months in their wake. They were still young in all ways except years. Teague would greet them. “Hi,” he might say. “I’m what you will be someday.” In him, they’d watch their mortality.\n Then, he’d wait twenty-five more years, alone, if he lived, and as an elderly man, he would welcome the next crew to their two weeks of busy wakefulness.\n It was unlikely he would meet a third crew. He would be ninety-seven years old, and despite what he said, he certainly would not be alive when she awoke.\n She had closed her eyes as the cocoon’s lid came down. Her muscles tightened. In a blink, the pain would come, the one hundred year blink.\n And it did.\n It took several hours before she could shuffle to the infirmary. Waking was worse this time. Dr. Arnold said, “We haven’t gone a fifth of the way, yet.” He massaged her hands, lighting them with a million wincing tingles. “Some of the medical staff may stay awake longer than the two weeks for research.” Even though he was young, like her, tiny creases that would become worry lines were evident on his forehead.\n She thought his eyes were kind, though. He flinched when she flinched. “Sorry,” he said. “I’m trying to be gentle.”\n When Meghan reached her room, she pulled the protective plastic off her bed and found a fragile note folded on her pillow from Crew Chief Teague, who wrote, “Try the wall now.” He had signed and dated it twenty years earlier. An old man wrote this, she thought.\n She waved her hand at the sensor, provoking a cascade of pain down her side. The wall flickered. The speakers whispered. Then the Crystal River winked into existence. Water burbled over rocks. Leaves rasped against each other. A long cloud in the distance slid slowly across a mountaintop.\n How long had Teague worked on the wall? A present for a young girl he would never see again.\n The speakers popped twice, like a computer chip crunching somewhere and the sound turned off, then the image brightened and washed into a pure white. Meghan shaded her eyes before it too vanished. His repair lasted for ten seconds. How long had he worked on it? She tried to open the service panel, but it remained stubbornly closed. Frustrated, she slapped her hand against it, then grabbed the iron candlestick holder from under the bed. Its sharp end pried the small hatch open. Looking at the circuit board underneath revealed nothing, though. Circuit boards were not her area of expertise. The hatch wouldn’t reclose.\n Meghan stared at the blank wall for a long time before seeking out Dr. Arnold and his soft, kind hands.\n “What is that?” he asked, pointing to the candleholder.\n Meghan turned the artifact over in her fingers. She hadn’t realized that she still carried it. “It’s all I have from Earth. It’s a miner’s light.”\n She slept with him for the rest of the two weeks until they returned to the cocoons again. The first time, as she pulled his shirt over his head, he said, “You’re going to have to quit calling me Dr. Arnold. My name’s Sean.”\n Once, she woke up, still unfamiliar with Sean’s shape, and listened to his breathing in the dark room. If she tried hard, it reminded her of wind through the leaves.\n Isaac considered the various forms of meditation. He’d learned to plant a question in his mind, then to spend the day or days or weeks contemplating its implications and meaning. While pondering the question, he would read from the Bible or the many studies in the monastery’s library. Meditation was best during his vows of silence. At length, the question would glow in his head, like campfire coals. Now, lying on his bed, squeezing his arms close to his body, trying not to shiver, he considered why God allowed cold. Genesis told him that cold was one of the ways God showed man that the Earth would continue. It said, “While the earth remaineth, seedtime and harvest, and cold and heat, and summer and winter, and day and night shall not cease.”\n Twice in the night, the roof creaked loudly, the second time dumping a pile of snow onto the floor. Holding the Tommy Sticker high, he could see where a board had broken. He wondered how he could get outside of the generator house to knock snow off the roof, but the wind roared and the window showed no outside light at all now. He wasn’t sure if it was day or night. Was such a storm normal? He had no mountain experience. The monastery had been challenging, but it didn’t teach him how to survive here. If it had snowed for forty days and forty nights for Noah, instead of raining, it could hardly be worse than this.\n The Bible wasn’t clear on snow. Mostly it appeared in the comparison “white as snow” in a dozen passages. He remembered somewhere the prophets linked it to leprosy. By candle he found the verse in Numbers. Turning the pages with his mittens was impossible, so he shucked them off and put them between his legs to keep them warm. The passage said, “And the cloud departed from off the tabernacle; and, behold, Miriam became leprous, white as snow: and Aaron looked upon Miriam, and, behold, she was leprous.” In Exodus he came across Moses turning a rod into a snake and back into a rod again. Then God said to Moses, “Put now thine hand into thy bosom. And he put his hand into his bosom: and when he took it out, behold, his hand was leprous as snow.”\n Even God didn’t like snow.\n The roof creaked again, sending another icy spill to the growing pile.\n The door wouldn’t move. Forcing the weight that rested against it was impossible, so he tried the window and pushed it up. A solid white wall stood revealed. He jabbed a shovel into it, dumped snow on the floor, dug in again. A half hour later, he’d cleared a tunnel to the surface, about a foot above the window. He pushed the snowshoes out the hole and, then climbed after them. The wind slammed into his face when he rolled to the surface, and his arm sank to his armpit when he tried to right himself. Strapping on the broad snowshoes took longer than he wished. Snow worked its way into the top of his shoes, froze into little balls on his gloves and fell down his collar. He couldn’t see even to the trees that stood twenty yards away from the generator house. His eyes watered, and his cheeks stung. The air’s gray luminosity revealed that it was day, but he could barely tell, nor did it matter.\n He had imagined by the height of the snow on the generator house that the river valley would be twenty feet under, but he could see now that a huge drift covered the house. Standing on the show shoes, his chest was as high as the roof’s eave, but the snow on the roof was piled higher than his head. Isaac realized that knocking the weight off could be dangerous. If it all came off the steep roof at the same time, it could easily bury him, so he tentatively dug into the overhang, stretching as far as he could with the shovel. A slab dropped off, revealing the wood shingles beneath. Another jab broke free a coffin-sized slab that made a thud he felt through his feet. A crack opened up in the bank of snow that remained on the roof. Isaac backed away as fast as he could as the gap widened, and two thirds of the mass slid ponderously off, leaving only a thin sliver at the ridge.\n Snow covered the hole he’d just climbed from, blocking his way back.\n “Crackers,” he said, the strongest explicative he used. Breath froze on his chin. Before he could get back into the house, though, he needed to sweep the other side. Lifting knees high to clear the snowshoes, he moved around the building.\n As he waded through the drift, he thought about the book of Amos, which said, “And I will smite the winter house with the summer house; and the houses of ivory shall perish, and the great houses shall have an end, saith the Lord.”\n What Isaac needed here was a little smiting.\n By the time he’d finished, dug his way back into the generator house and closed the window, he was exhausted, but, more dangerously, he was freezing. The fire in the stove had gone out, and without a buffering layer of snow on the roof, a draft blew through the room. The water wheel had picked up an ominous screech, so instead of trying to light the fire, he put a candle into the Tommie Sticker and walked down the stairs. Ice had formed in the trough where the stream entered the generator wheel, and now water poured onto the floor, deflected by the blockage. The wheel turned half as slow as it should. Water poured onto the floor, some of it freezing against the wood, but most flowing down the slant to the far wall.\n Too tired even for a well earned, “Crackers!” he swung the two-pound hammer against the blockage. It barely chipped, and he lost his footing, sprawling beneath the water wheel. Icy water drenched him. Isaac scrambled away, slipping on the slick floor. If he didn’t clear the trough soon, the wheel would freeze solid. It could become unusable until spring, and only then after extensive repair.\n Carefully, this time, keeping his weight distributed on both feet, he sidled toward the trough, hammer in hand. He thought of Lamech, Noah’s father, who the Bible said of, “And he called his name Noah, saying, This same shall comfort us concerning our work and toil of our hands, because of the ground which the LORD hath cursed.”\n The ice was the curse, the hammer the work. So cold he could hardly hold the heavy tool, Isaac swung it against the obstruction.\n When she woke again, an elderly man leaned over the cocoon. “Don’t move, Meghan. You shouldn’t feel pain, but you’re likely to be nauseous for a few minutes.”\n She closed her eyes. I’m five hundred and twenty years old now, she thought. Over thirty-five hundred years to go.\n When she opened her eyes, the old man still leaned in, looking concerned. His hand reached over the edge to cup her upper arm. “Are you okay?”\n Tentatively, she nodded, then waited to see if the movement would bother her. Her stomach twisted, but the discomfort passed. “I think so.” Her joints didn’t ache, but her thinking felt fuzzy. She looked at him closely. “Crew Chief Teague?” He shook his head. “No, he’s dead.” She squinted. “Dr. Arnold?”\n He nodded. “I’m still Sean. It took years to figure out what was wrong with the long sleep.”\n “How many?”\n “Almost forty.”\n She remembered Sean’s smooth skin. How he felt when she woke but he still slept. How he’d held her when she talked about Earth and her fears.\n “I’m dying,” she had said, their last night together. “We will never get to where we are going, and we will never go back.”\n The night before, a hundred years earlier, Sean had rocked her gently, holding her head to his chest. “We’re not dead yet.”\n Now, Meghan didn’t recognize his eyes. He held out a hand to help her from the cocoon, but she didn’t take it. He was a stranger. She sat up on her own, felt sick again. When it passed, and she climbed out, Sean stood back, looking at her sadly. “I missed you,” he said.\n “It’s only been a few minutes for me.”\n “That’s true.”\n She stood awkwardly for a minute, unsure of what to say.\n Finally, she offered, “I have work to do.”\n “Of course. Me too.” Lights flickered on the other cocoons, and she realized he’d woken her first.\n For the first week, she only saw him at meals, but she sat on the other side of the cafeteria. She tried not to think about the blank wall and her candle holder keepsake. With effort, she avoided pulling the box from under the bed. She thought, maybe if I don’t look at it, I won’t long for it. I won’t miss it. Meghan concentrated on the hydroponic tanks. Every connection needed to be refitted. She retooled valves, serviced pumps, recalibrated the chemical testing equipment, and met with the horticulturists who talked about genetic drift, mutations and evolution. Over the course of five hundred years, the plants adapted to the artificial environment. The most efficient at extracting nutrients from the fluids flourished. The more aggressive that grew faster or taller crowded out their weaker cousins.\n She couldn’t sleep during her rest hours, so she wandered back to the hydroponics rooms. All the plants were low growers, flourishing under lights hanging from the ceiling. Tomatoes, strawberries, cucumbers, ferns of various sorts, beets, peppers and numerous others. Nothing that grew tall. Tree seeds were held in storage for planet fall when they reached Zeta Reticula, although there was a question if they would germinate. No one had ever planted a four thousand year-old seed before. She walked down the long row, letting the palm of her hand brush the plant tops while imagining the aspen the ship carried. Would there be an aspen grove one day on the planet orbiting Zeta Reticula? Aspen preferred to spread from their roots. If just one seed germinated, she could grow a forest. Would Earth trees flourish so far from their native sun?\n The fear gathered in her chest like a tightness, so she rubbed her fist between her breasts as she walked, trying to work through the tension. At the end of the row of vegetation, she looked up one of the ship’s long spokes, a huge hollow chamber that reached the ship’s core, the center they revolved around to produce the illusion of gravity. She’d grown used to the effect that had disoriented her at first, moving from the claustrophobic pressure of the growing room to the shocking reach of empty space. She crossed the fifty-foot diameter of the spoke to get to the next row of plants.\n At the end of the final work day before entering the cocoon again, she walked through the plants one last time. They smelled wet and vaguely chemical, but not green, not natural at all, so she kept going until she reached Sean’s room and raised her hand to knock. She paused. It seemed that only two weeks ago she had kissed a young man goodbye. She couldn’t picture the ship without him. Every day she expected to see him turn a corner, to join her in the hydroponic labs. He never did. Instead, an old man looked at her mournfully when she passed by. He sacrificed forty years to save her and the rest. She almost left.\n When he opened the door, Meghan said, “I missed you too.”\n Sean let her in, the age spots on his hand were prominent in the harsh, hallway light. “I have something for you.” He opened a drawer and removed the metal candle holder. “I know how much it meant. I thought about having them open it for you. We could find out if there’s anything inside.”\n She traced her finger along the loop where the candle would have been placed. Rubbed the rough brass cap at one end. If held the wrong way, it looked like a weapon, the five-inch long, narrow spike that would hold the antique in a mine wall or stuck into wood could also hurt someone. “I’d forgotten about it,” she lied.\n As they talked quietly in his room, she started to see the man she used to know. Beneath the thinning hair, behind the wrinkles and tiredness, she recognized him.\n When they slipped under the sheets later, Sean said, “I don’t have as much to offer as I did before. I’m not . . . young.”\n “Just hold me, then, and let’s sleep.”\n But after hours of listening to his soft breathing and thinking that he still sounded a little like wind through aspens, he woke up, and Meghan found he had more life in him than he thought.\n Isaac stood next to the cold stove. His clothes no longer dripped. They crackled when he moved. Next to his skin, though, they were soaked, and he could feel them sucking away the little heat that remained. One ceiling board had broken completely while he’d knocked the snow off the roof, and the supplies directly underneath were covered, including the boxes of matches. He scooped snow off the floor in double handfuls until he found them, but the boxes were squashed and the matches ruined. The match heads smeared against the striker when he tried to light them.\n Dully, his head feeling sluggish and slow, he knelt on the pile of snow for a minute. Flakes came down through the hole in the room, swirling in a breeze that hadn’t been there before. Without matches, he’d never light the fire. Maybe he could get the snowshoes back on and make his way to the miners’ cabins, but he knew the steep trail, completely hidden in the storm, would be almost impossible to hike, even if his clothes weren’t already wet and he wasn’t exhausted. He couldn’t feel his knees against the snow, and the cold crept up his legs. He thought about just staying still. His chin drifted to his chest. Resting sounded good. In a few minutes, he would get up, but for now, a little sleep was all he needed. The vibration and steady thumping of the generator below annoyed him though, then, frightened, he stood. If he slept, the generator would surely freeze, and so would he. If he didn’t have duties, he could rest, but the others depended on him.\n Isaac waved his arms to restore circulation, slapping his hands against his arms, then staggered toward the stairs. With renewed vigor, the wind shook the house. No light came from the depths. His candle had gone out, so he swept his hand against the wood, careful to not fall again on the slick floor, until he hit the Tommie Sticker. Water gurgled against the power wheel behind him. With a yank, he pulled the candle holder from the wood, forced himself to climb the stairs, before sitting by the stove. It took a dozen tries to unscrew the brass cap holding the matches. There were only three. Carefully, he lit one, but before he touched the candle, the breeze blew it out. He nearly wept. With the new hole in the roof, there was no place he could guarantee the next match would stay lit long enough to start the fire.\n He opened the stove door, pushed his hands inside, out of the wind, to light the second match. It flicked to life, but the draw up the chimney immediately snuffed it out.\n Isaac took a deep breath, closed the stove flue to stop the wind, and mumbled a prayer before lighting the last match. The water in his shoes felt like it was freezing. He couldn’t feel his feet at all. The match caught, held steady. Carefully, he pushed the candle wick into the flame. It flared into life. He jammed the candle between two charcoaled logs in the stove before feeding kindling to the flame. Soon, smoke flowed from the open stove. Isaac coughed, and his eyes teared, as he kicked the stool apart for bigger pieces of wood, the last fuel in the house, but he didn’t open the flue until a healthy flame filled the iron stove. Heat baked off the sides. His gloves steamed on top of the stove as he warmed his hands. Piece by piece, he removed his clothes to hang around the stove before wrapping his blanket around his shivering shoulders. Water dripped from his coat and pants. Heat rolled off the stove, tingling his cheeks, sending stabbing sparks through his toes and feet. He grimaced and moved closer.\n The wood walls of the house rattled in a torrent of wind, whipping the fire in the little stove into a tiny inferno. At its peak, when surely the house would have to shatter, the wind stopped, and for the first time in a ten days, the house fell silent except for the river’s heart beating through the generator below.\n The storm had broken.\n In the cabin’s sudden quiet, Isaac reached for his bible, opened it randomly to read the first verse his eye fell upon. Surely the storm’s cessation was a miracle. Surely a message would be at hand. He wrote the verse on a slip of paper, rolled it into a tube, then sealed it inside the Tommy Sticker. By the time he finished, his face felt warm and his toes stopped aching.\n Sean didn’t wake up after the seventh long sleep.\n Dr. Singh said, “He knew the dangers when he let himself age. The sleep process is hard. I’m sorry.” She consulted her notes. “Dr. Arnold was a great man. His work on long sleep cellular degradation and preservation was groundbreaking. If we were still on Earth, he surely would receive a Nobel Prize. We should all make it to Zeta Reticula because of him.” Singh shook her head sympathetically. “I understand you were close.”\n Meghan gripped the edge of the examination table. “I saw him yesterday . . . before the last sleep I mean. I just saw him.” She felt every minute of her seven hundred and twenty-two years.\n “Me too,” said Singh. “If you need them, I can prescribe anti-depressants, but I’d rather not. Drug interaction is difficult to predict.”\n Meghan walked the long hall from the infirmary to Sean’s apartment. The plastic sheets covered his bed and the desk, coated by a thin layer of dust. Despite automated cleaning mechanisms, dust still fell on surfaces they couldn’t reach. She pulled the plastic off his desk and let it fall to the floor. He’d left a notebook and her candle holder in the middle. She turned the cover back carefully. The paper that started the trip seven hundred years ago, even though it was acid free and specially milled to last, had become brittle. Any hand-written notes that were expected to be permanent were written on plastic paper, but Sean had enjoyed the feel of real pages better.\n He had written “To Meghan” inside the cover; the rest of the pages were blank.\n When she sat on the edge of the bed, the plastic crackled. The candle holder rested on her lap. She wondered, did everyone feel so empty, and what could she do about it? Her fingers pressed against the cool metal. Although remembering the aspen shaking in the valley of her wall display escaped her, she felt connected through the hard shape. How often had this candle holder stuck in a mine wall to light a few feet of rock? Who else had held it? Had it ever been more than just a tool to them? Her fingers traveled from the pointed end, past the coil that held the candle, to the burnished brass tube. For the first time, Meghan really examined the antique as a practical object instead of art. Was that a cap on the end of what she had thought was the handle? She twisted it hard. Nothing. Maybe the antique did have something in it, another connection to Earth. Both Teague and Sean had wondered, now she wanted to know.\n A few minutes later she asked the machine shop chief, a stout woman whose name Meghan had never known, “Do you have a way to open it?”\n The chief turned it over. She said, “It’s brass, I think. From the 19th Century, you say? I can cut it apart, but it will cause damage.”\n “Go ahead.”\n The chief handled the cutting tool delicately, sending tiny sparks flurrying as she sliced through the candle holder’s end. A coin-sized piece of metal dropped to the floor. Meghan leaned over her shoulder as the chief used a pair of tweezers to pull the rolled up slip of paper from the cavity.\n Meghan shivered. “It’s almost a thousand years old!”\n “There’s writing.”\n “A message.” Meghan feared the paper would crumble before she could discover what it said.\n “What does it mean?” asked the shop chief after they’d carefully unrolled it.\n “It’s a bible verse, I think. I think I know.”\n Meghan left the puzzled shop chief behind and headed toward hydroponics, already planning new pipes and grow lights. She would have to leave explanations and instructions for the next shift’s hydroponic officers.\n Isaac climbed through the window and up to the surface again, the last of the chair burning in the stove behind him. The air bit just as cruelly, but without the wind behind it, and the clouds clearing, he didn’t feel as cold, although dampness squished in his temporarily warm clothes. If he couldn’t find more wood soon, though, the fire would wink out again, and storm or no storm, he would freeze. Holding a short-handled axe, he girded himself for the long hike up the canyon where he might be able to find firewood.\n For a moment, he tried to orient himself. Snow transformed the valley, hiding all that had been familiar. The hundreds of tree trunks that marked the land before were deeply covered so the vista before him was smooth, clean, and hypnotic. The Crystal River had almost entirely vanished, revealed only by a narrow crack in the snow from where the water’s glassy voice arose.\n What surprised him most, though, were the trees that remained. Two weeks earlier, their lowest branches were twenty feet above the ground, the easy to reach ones having been chopped off for wood. Now, though, where the snow drifted, their needles brushed the crystalline surface. He would have no trouble finding fuel. He thought, why that tree there carries enough dead limbs to keep me warm for a month. It felt like a miracle.\n He thought about the Bible verse he’d written on the slip of paper. He wasn’t sure what it meant, but it had filled him with hope: “Come, let us take our fill of love until the morning: let us solace ourselves with loves. For the goodman is not at home, he is gone a long journey.” A bit from Proverbs.\n When spring came, he would take the Tommie Sticker with its message and bury it by the pump house. Somewhere, someone might read it, and it would help. He was sure of it.\n Meghan kept her eyes closed for a long time after she awoke until, finally, Dr. Singh’s familiar voice said, “I know you can hear me. Your vitals don’t lie.”\n “I’m eight hundred and twenty-two years old today.” She hadn’t moved even a finger yet, but she didn’t feel tired like she had the last time. She only felt hopeful.\n She waited through Dr. Singh’s tests impatiently. “I have to get to work,” Meghan said.\n Rushing through the hallways, she barely acknowledged other crew members’ greetings. They, too, had work to do. So much of the trip waited before them. So much more space had to be traversed before they could come to a rest.\n The first hydroponics lab looked much like she had left it, although she noted the tanks that held the plants steady would need rebuilding on her shift. She passed under one of the spokes, the cathedral-like height earning not a glance. Did her experiment work, she thought. Did the other hydroponics officers follow her direction? She couldn’t see far in front of her. The ceiling’s downward bulge cut off her view until she was almost there, and then, she saw.\n At the end of the row, where normally the plants stopped, her jury-rigged piping led to the new plant tanks. A thick trunk rose from the tank, and as she entered the space below the next spoke, her gaze traveled up the tree’s long stretch. Guy wires attached to the vertical space’s sides held the tree steady. At the top, new grow fixtures hung suspended from other wires, bathing the aspen in light.\n Meghan held her breath. An aspen, under the right conditions, can grow to eighty feet. This one was easily that tall. She walked around the tree. New piping and tanks connected to her original work. Three other trees grew from them. The closest tank came from her co-worker twenty-five years down the line, and the tree from that tank nearly matched her own. A smaller tree, only fifty years old, grew from the next tank, and the last tank held the smallest tree, still over thirty feet to its top. The history attached to it showed it had been built twenty-five years ago. Each officer had added a tree to the grove.\n Meghan sat on the floor so she could look up with less strain. Each tree’s branches touched the next. The room smelled of aspen, a light leafy odor that reminded her of mountains and streams, and an old generator house perched on the edge of a short cliff.\n After she’d sat for a while, she realized that air currents in the ship flowed up the spoke. What she heard, finally, was not the ubiquitous mechanical hiss from the ventilation vents. What she heard was the gentle rustle of leaves touching leaves, a sound that she thought she’d long left behind and would never hear again.\n Originally published in Analog Science Fiction and Fact, June 2009.\n James Van Pelt is a writer who also serves as an English teacher in the language arts department at the Fruita Monument High School in Fruita, Colorado. A prolific short-story writer, his stories have been finalists for the Nebula Award and the Theodore Sturgeon Award, and he himself has been a finalist for the John W. Campbell Award for Best New Writer. His stories have been gathered in four collections, Strangers and Beggars, The Last of the O-Forms and Other Stories, The Radio Magician and Other Stories, and Flying in the Heart of the Lafayette Escadrille, and he has also published a novel, Summer of the Apocalypse. Coming up is a new novel, Pandora's Gun. Van Pelt lives in Grand Junction, Colorado."}