{"fingerprint": "XLprWUkRRk2hE96Zt3Vy+9UiGNU=", "sitename": "Clarkesworld Magazine", "title": "Astrophilia by Carrie Vaughn", "author": "Carrie Vaughn", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/vaughn_07_12/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Astrophilia by Carrie Vaughn", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7880 words, novelette\n Astrophilia\n Finalist: 2013 WSFA Small Press Award for Short Fiction\n After five years of drought, the tiny, wool-producing household of Greentree was finished. First the pastures died off, then the sheep, and Stella and the others didn’t have any wool to process and couldn’t meet the household’s quota, small though it was with only five of them working at the end. The holding just couldn’t support a household and the regional committee couldn’t keep putting credits into it, hoping that rains would come. They might never come, or the next year might be a flood. No one could tell, and that was the problem, wasn’t it?\n None of them argued when Az and Jude put in to dissolve Greentree. They could starve themselves to death with pride, but that would be a waste of resources. Stella was a good weaver, and ought to have a chance somewhere else. That was the first reason they gave for the decision.\n Because they dissolved voluntarily, the committee found places for them in other households, ones not on the verge of collapse. However, Az put in a special request and found Stella’s new home herself. “I know the head of the place, Toma. He’ll take good care of you, but more than that his place is prosperous. Rich enough for children, even. You could earn a baby there, Stella.” Az’s wrinkled hands gripped Stella’s young ones in her own, and her eyes shone. Twenty-three years ago, Greentree had been prosperous enough to earn a baby: Stella. But those days were gone.\n Stella began to have doubts. “Mama, I don’t want to leave you and everyone—”\n “We’ll be fine. We’d have had to leave sooner or later, and this way we’ve got credits to take with us. Start new on a good footing, yes?”\n “Yes, but—” She hesitated, because her fears were childish. “What if they don’t like me?”\n Az shook her head. “Winter market I gave Toma the shawl you made. You should have seen him, Stella, his mouth dropped. He said Barnard Croft would take you on the spot, credits or no.”\n But what if they don’t like me, Stella wanted to whine. She wasn’t worried about her weaving.\n Az must have seen that she was about to cry. “Oh, dear, it’ll be all right. We’ll see each other at the markets, maybe more if there’s trading to be done. You’ll be happy, I know you will. Better things will come.”\n Because Az seemed so pleased for her, Stella stayed quiet, and hoped.\n In the spring, Stella traveled to Barnard Croft, three hundred miles on the Long Road from Greentree, in the hills near the coast.\n Rain poured on the last day of the journey, so the waystation driver used a pair of horses to draw the wagon, instead of the truck. Stella offered to wait until the storm passed and the solar batteries charged up, but he had a schedule to keep, and insisted that the horses needed the exercise.\n Stella sat under the awning on the front seat of the wagon, wrapped in a blanket against the chill, feeling sorry for the hulking draft animals in front of her. They were soaked, brown coats dripping as they clomped step by step on the muddy road. It might have been faster, waiting for the clouds to break, for the sun to emerge and let them use the truck. But the driver said they’d be waiting for days in these spring rains.\n She traveled through an alien world, wet and green. Stella had never seen so much water in her whole life, all of it pouring from the sky. A quarter of this amount of rain a couple of hundred miles east would have saved Greentree.\n The road curved into the next green valley, to Barnard Croft. The wide meadow and its surrounding, rolling hills were green, lush with grass. A handful of alpaca grazed along a stream that ran frothing from the hills opposite. The animals didn’t seem to mind the water, however matted and heavy their coats looked. There’d be some work, cleaning that mess for spinning. Actually, she looked forward to it. She wanted to make herself useful as soon as she could. To prove herself. If this didn’t work, if she didn’t fit in here and had to throw herself on the mercy of the regional committee to find some place prosperous enough to take her, that could use a decent weaver . . . no, this would work.\n A half-a-dozen whitewashed cottages clustered together, along with sheds and shelters for animals, a couple of rabbit hutches, and squares of turned black soil with a barest sheen of green—garden plots and new growth. The largest cottage stood apart from the others. It had wide doors and many windows, shuttered now against the rain—the work house, she guessed. Under the shelter of the wide eaves sat wooden barrels for washing wool, and a pair of precious copper pots for dyeing. All comfortable, familiar sights.\n The next largest cottage, near the garden plots, had a smoking chimney. Kitchen and common room, most likely. Which meant the others were sleeping quarters. She wondered which was hers, and who’d she’d be sharing with. A pair of windmills stood on the side of one hill; their trefoil blades were still.\n At the top of the highest hill, across the meadow, was a small, unpainted shack. It couldn’t have held more than a person or two standing upright. This, she did not recognize. Maybe it was a curing shed, though it seemed an unlikely spot, exposed as it was to every passing storm.\n A turn-off took them from the road to the cottages, and by the time the driver pulled up the horses, eased the wagon to a stop, and set the brakes, a pair of men wrapped in cloaks emerged from the work house to greet them. Stella thanked the driver and jumped to the ground. Her boots splashed, her long woolen skirt tangled around her legs, and the rain pressed the blanket close around her. She felt sodden and bedraggled, but she wouldn’t complain.\n The elder of those who came to greet her was middle aged and worn, but he moved briskly and spread his arms wide. “Here she is! Didn’t know if you would make it in this weather.” This was Toma. Az’s friend, Stella reminded herself. Nothing to worry about.\n “Horses’ll get through anything,” the driver said, moving to the back of the wagon to unload her luggage.\n “Well then,” Toma said. “Let’s get you inside and dried off.”\n “Thank you,” Stella managed. “I just have a couple of bags. And a loom. Az let me take Greentree’s loom.”\n “Well then, that is a treasure. Good.”\n The men clustered around the back of the wagon to help. The bags held her clothes, a few books and letters and trinkets. Her equipment: spindles and needles, carders, skeins of yarn, coils of roving. The loom took up most of the space—dismantled, legs and frames strapped together, mechanisms folded away in protective oilskin. It would take her most of a day to set up. She’d feel better when it was.\n A third figure came running from the work house, shrouded by her wrap and hood like the others. The shape of her was female, young—maybe even Stella’s age. She wore dark trousers and a pale tunic, like the others.\n She came straight to the driver. “Anything for me?”\n “Package from Griffith?” the driver answered.\n “Oh, yes!”\n The driver dug under an oil cloth and brought out a leather document case, stuffed full. The woman came forward to take it, revealing her face, sandstone-burnished skin and bright brown eyes.\n Toma scowled at her, but the woman didn’t seem to notice. She tucked the package under her arm and beamed like sunshine.\n “At least be useful and take a bag,” Toma said to her.\n Taking up a bag with a free hand, the woman flashed a smile at Stella, and turned to carry her load to the cottage.\n Toma and other other man, Jorge, carried the loom to the work house. Hefting the rest of her luggage, Stella went to the main cottage, following the young woman at a distance. Behind her, the driver returned to his seat and got the horses moving again; their hooves splashed on the road.\n Around dinner time, the clouds broke, belying the driver’s prediction. Some sky and a last bit of sunlight peeked through.\n They ate what seemed to her eyes a magnificent feast—meat, eggs, preserved fruits and vegetables, fresh bread. At Greentree, they’d barely got through the winter on stores, and until this meal Stella hadn’t realized she’d been dimly hungry all the time, for weeks. Months. Greentree really had been dying.\n The folk of the croft gathered around the hearth at night, just as they did back home at Greentree, just as folk did at dozens of households up and down the Long Road. She met everyone: Toma and Jorge, who’d helped with the loom. Elsta, Toma’s partner, who ran the kitchen and garden. Nik and Wendy, Jon and Faren. Peri had a baby, which showed just how well off Barnard was, to be able to support a baby as well as a refugee like Stella. The first thing Peri did was put the baby—Bette—in Stella’s arms, and Stella was stricken because she’d never held a wriggly baby before and was afraid of dropping her. But Peri arranged her arms just so and took the baby back after a few moments of cooing over them both. Stella had never thought of earning the right to have her implant removed, to have a baby—another mouth to feed at Greentree would have been a disaster.\n Elsta was wearing the shawl Stella had made, the one Az had given Toma—her audition, really, to prove her worth. The shawl was an intricate weave made of finely spun merino. Stella had done everything—carded and spun the wool, dyed it the difficult smoky blue, and designed the pattern herself. Elsta didn’t have to wear it; the croft could have traded it for credits. Stella felt a small spark of pride. Wasn’t just charity that brought her here.\n Stella had brought her work basket, but Elsta tsked at her. “You’ve had a long trip, so rest now. Plenty of time to work later.” So she sat on a blanket spread out on the floor and played with Bette.\n Elsta picked apart a tangle of roving, preparing to draft into the spindle of her spinning wheel. Toma and Jorge had a folding table in front of them, and the tools to repair a set of hand carders. The others knit, crocheted, or mended. They no doubt made all their own clothing, from weaving the fabric to sewing, dark trousers, bright skirts, aprons, and tunics. Stella’s hands itched to work—she was in the middle of knitting a pair of very bright yellow socks from the remnants of yarn from a weaving. They’d be ugly but warm—and the right kind of ugly had a charm of its own. But Elsta was probably right, and the baby was fascinating. Bette had a set of wooden blocks that she banged into each other; occasionally, very seriously, she handed them to Stella. Then demanded them back. The process must have had a logic to it.\n The young woman wasn’t with them. She’d skipped dinner as well. Stella was thinking of how to ask about her, when Elsta did it for her.\n “Is Andi gone out to her study, then?”\n Toma grumbled, “Of course she is.” The words bit.\n Her study—the shack on the hill? Stella listened close, wishing the baby would stop banging her blocks so loudly.\n “Toma—”\n “She should be here.”\n “She’s done her work, let her be. The night’s turned clear, you know how she gets.”\n “She should listen to me.”\n “The more you push, the angrier she’ll get. Leave her be, dearest.”\n Elsta’s wheel turned and purred, Peri hummed as she knit, and Bette’s toys clacked. Toma frowned, never looking up from his work.\n Her bags sat by one of the two beds in the smallest cottage, only half unpacked. The other bed, Andi’s, remained empty. Stella washed, brushed out her short blond hair, changed into her nightdress, and curled up under the covers. Andi still hadn’t returned.\n The air smelled wrong, here. Wet, earthy, as if she could smell the grass growing outside the window. The shutters cracked open to let in a breeze. Stella was chilled; her nose wouldn’t stop running. The desert always smelled dusty, dry—even at night, the heat of the sun rose up from the ground. There, her nose itched with dust.\n She couldn’t sleep. She kept waiting for Andi to come back.\n Finally, she did. Stella started awake when the door opened with the smallest squeak—so she must have slept, at least a little. Cocooned under the covers, she clutched her pillow, blinking, uncertain for a moment where she was and what was happening. Everything felt wrong, but that was to be expected, so she lay still.\n Andi didn’t seem to notice that she was awake. She hung up her cloak on a peg by the door, sat on her bed while she peeled off shoes and clothes, which she left lying on the chest at the foot of her bed, and crawled under the covers without seeming to notice—or care—that Stella was there. The woman moved quickly—nervously, even? But when she pulled the covers over her, she lay still, asleep in moments. Stella had a suspicion that she’d had practice, falling asleep quickly in the last hours before dawn, before she’d be expected to rise and work.\n Stella supposed she would get a chance to finally talk to her new roommate soon enough, but she had no idea what she was going to say to her.\n The next day, the clouds had more than broken. No sign of them remained, and the sun blazed clear as it ever had in the desert, but on a world that was wet, green, and growing. The faint sprouts in the garden plots seem to have exploded into full growth, leaves uncurling. The angora in the hutches pressed twitching noses to the wire mesh of their cages, as if they could squeeze out to play in the meadow. Every shutter and window in the croft was opened to let in the sun.\n The work house was wide, clean, whitewashed inside and out. It smelled of lanolin, fiber and work. Lint floated in beams of sunlight. Two—now three—looms and a pair of spinning wheels sat facing each other, so the weavers and spinners could talk. Days would pass quickly here. The first passed quickly enough, and Stella finished it feeling tired and satisfied.\n Andi had spent the day at the wash tubs outside, cleaning a batch of wool, preparing it to card and spin in the next week or so. She’d still been asleep when Stella got up that morning, but must have woken up soon after. They still hadn’t talked. Not even hello. They kept missing each other, being in different places. Continually out of rhythm, like a pattern that wove crooked because you hadn’t counted the threads right. The more time passed without them speaking, the harder Stella found it to think of anything to say. She wanted to ask, Are you avoiding me?\n Stella had finished putting away her work and was headed for the common room, when she noticed Andi following the footpath away from the cottages, around the meadow and up the hill to the lonely shack. Her study, Elsta had called it. She walked at a steady pace, not quite running, but not lingering.\n After waiting until she was far enough ahead that she was not likely to look over her shoulder, Stella followed.\n The trail up the hill was a hike, and even walking slowly Stella was soon gasping for breath. But slowly and steadily she made progress. The path made a couple of switchbacks, and finally reached the crest of the hill and the tiny weathered shack planted there.\n As she suspected, the view was worth the climb. The whole of Barnard Croft’s valley was visible, as well as the next one over. The neighboring croft’s cottages were pale specks, and a thread of smoke climbed from one. The hills were soft, rounded, cut through with clefts like the folds in a length of fabric. Trees along the creek gave texture to the picture. The Long Road was a gray track painted around the green rise. The sky above stretched on, and on, blue touched by a faint haze. If she squinted, she thought she could see a line of gray on the far western horizon—the ocean, and the breeze in that direction had a touch of salt and wild. From this perspective, the croft rested in a shallow bowl that sat on the top of the world. She wondered how long it would take to walk around the entire valley, and decided she would like to try some sunny day.\n The shed seemed even smaller when she was standing next to it. Strangely, part of the roof was missing, folded back on hinges, letting in light. The walls were too high to see over, and the door was closed. Stella hesitated; she shouldn’t be here, she was invading. She had to share a room with this woman, she shouldn’t intrude. Then again—she had to share a room with this woman. She only wanted to talk. And if Andi didn’t like it, well . . .\n Stella knocked on the door before she could change her mind. Three quick, woodpecker-like raps.\n When the door swung out, she hopped back, managed not to fall over, and looked wide eyed to see Andi glaring at her.\n Then the expression softened, falling away to blank confusion. “Oh. Hi.”\n They stared at each other for a long moment. Andi leaned on the door, blocking the way; Stella still couldn’t see what was inside.\n “May I come in?” she finally asked, because Andi hadn’t closed the door on her.\n “Oh—sure.” The woman seemed to shake herself out of a daydream, and stepped back to open the door wide.\n The bulk of the tiny room was taken up by a device mounted on a tripod as tall as she was. A metallic cylinder, wide as a bucket, pointed to the ceiling. A giant tin can almost, except the outer case was painted gray, and it had latches, dials, levers, all manner of protrusions connected to it. Stella moved around it, studying it, reminding herself not to touch, however much the object beckoned.\n “It’s a telescope, isn’t it?” she asked, looking over to Andi. “An old one.”\n A smile dawned on Andi’s face, lighting her mahogany eyes. “It is—twelve-inch reflector. Century or so old, probably. Pride and joy.” Her finger traced up the tripod, stroking it like it was a favorite pet.\n Stella’s chest clenched at that smile, and she was glad now that she’d followed Andi here. She kept her voice calm. “Where’d you get it? You couldn’t have traded for it—”\n “Oh no, you can’t trade for something like this. What would you trade for it?” Meaning how many bales of wool, or bolts of cloth, or live alpacas, or cans full of fish from the coast was something like this worth? You couldn’t put a price on it. Some people would just give it away, because it had no real use, no matter how rare it was. Andi continued, “It was Pan’s, who ran the household before Toma. He was one of the ones who helped build up the network with the observatories, after the big fall. Then he left it all to me. He’d have left it to Toma, but he wasn’t interested.” She shrugged, as if unable to explain.\n “Then it actually works?”\n “Oh yes.” That smile shone again, and Stella would stay and talk all night, to keep that smile lit up. “I mean, not now, we’ll have to wait until dark, assuming the weather stays clear. With the roof open it’s almost a real observatory. See how we’ve fixed the seams?” She pointed to the edges, where the roof met the walls. Besides the hinges and latches that closed the roof in place, the seams had oilskin weatherproofing, to keep rain from seeping through the cracks. The design was clever. The building, then, was shelter for the equipment. The telescope never moved—the bottom points of the tripod were anchored with bricks.\n Beside the telescope there wasn’t much here: a tiny desk, a shelf filled with books, a bin holding a stack of papers, and a wooden box holding pencils. The leather pouch Andi had received yesterday was open, and packets of paper spread over the desk.\n “Is that what you got in the mail?”\n She bustled to the desk and shuffled through the pages. “Assignment from Griffith. It’s a whole new list of coordinates, now that summer’s almost here. The whole sky changes—what we see changes, at least—so I make observations and send the whole thing back.” The flush in her brown face deepened as she ducked away. “I know it doesn’t sound very interesting, we mostly just write down numbers and trade them back and forth—”\n “Oh no,” Stella said, shaking her head to emphasize. “It’s interesting. Unusual—”\n “And useless, Toma says.” The smile turned sad, and last night’s discussion became clear to Stella.\n “Nothing’s useless,” Stella said. “It’s like you said—you can’t just throw something like this away.” This wasn’t like a household that couldn’t feed itself and had no choice but to break up.\n Three sharp rings of a distant brass bell sounded across the valley. Stella looked out the door, confused.\n “Elsta’s supper bell,” Andi explained. “She only uses it when we’ve all scattered.” She quickly straightened her papers, returned them to their pouch, and latched the roof back in place. Too late, Stella thought to help, reaching up to hold the panel of wood after Andi had already secured the last latch. Oh well. Maybe next time.\n Stella got a better look at Andi as they walked back to the croft. She was rough in the way of wind and rain, her dark hair curly, pulled back by a scrap of gray yarn that was unraveling. The collar of her shirt was untied, and her woven jacket had slipped off a shoulder. Stella resisted an urge to pull it back up, and to brush the lock of hair that had fallen out of the tie behind her ear.\n “So you’re really more of an astronomer than a weaver,” Stella said. She’d tried to sound encouraging, but Andi frowned.\n “Drives Toma crazy,” Andi said. “If there was a household of astronomers, I’d join. But astronomy doesn’t feed anyone, does it? Well, some of it does—meteorology, climatology, solar astronomy, maybe. But not what we’re doing. We don’t earn anyone a baby.”\n “What are you doing?”\n “Astronomical observation. As much as we can, though it feels like reinventing the wheel sometimes. We’re not learning anything that people didn’t already know back in the day. We’re just—well, it feels like filling in the gaps until we get back to where we were. Tracking asteroids, marking supernovae, that sort of thing. Maybe we can’t do much with the data. But it might be useful someday.”\n “There, you see—it’s planning ahead. There’s use in that.”\n She sighed. “The committees mostly think it’s a waste of time. They can’t really complain, though, because we—those of us in the network—do our share and work extra to support the observatories. A bunch of us designate ration credits toward Griffith and Kitt Peak and Wilson—they’ve got the region’s big scopes—to keep staff there maintaining the equipment, to keep the solar power and windmills running. Toma always complains, says if I put my extra credits toward the household we could have a second baby. He says it could even be mine. But they’re my credits, and this is important. I earn the time I spend with the scope, and he can’t argue.” She said that as a declaration, then looked straight at Stella, who blushed. “They may have brought you here to make up for me.”\n Stella didn’t know what to say to that. She was too grateful to have a place at all, to consider that she may have been wanted.\n Awkwardly, Andi covered up the silence. “Well. I hope you like it here. That you don’t get too homesick, I mean.”\n The words felt like a warm blanket, soft and wooly. “Thanks.”\n “We can be kind of rowdy sometimes. Bette gets colicky, and you haven’t heard Wendy sing yet. Then there’s Jorge and Jon—they share a bed as well as a cottage, see, and can get pretty loud, though if you tease them about it they’ll deny it.”\n “I don’t mind rowdy. But I did almost expect to find a clandestine still in that shed.”\n Andi laughed. “I think Toma’d like a still better, because at least you can drink from it. Elsta does make a really good cider, though. If she ever put enough together to trade, it would make up for all the credits I waste on the observatories.”\n As they came off the hill and approached the cluster of cottages, Andi asked, “Did you know that Stella means star in Latin?”\n “Yes, I did,” she answered.\n Work was work no matter where you were, and Stella settled into her work quickly. The folk of Barnard were nice, and Andi was easy to talk to. And cute. Stella found excuses to be in the same room with her, just to see that smile. She hadn’t expected this, coming to a new household. But she didn’t mind, not at all.\n Many households along the Long Road kept sheep, but the folk at Barnard did most of the spinning and weaving for trade. All the wool came to them. Barnard also produced a small quantity of specialty fibers from the alpaca and angora rabbits they kept. They were known for the quality of all their work, the smoothness of their yarns, the evenness of their weaving. Their work was sought after not just along the Long Road, but up and down the coast.\n Everyone spun, wove, and dyed. Everyone knew every step of working with wool. They either came here because they knew, or because they’d grown up here learning the trade, like Toma and Nik, like Bette would in her turn. As Andi had, as Stella found out. Andi was the baby that Toma and Elsta had earned together.\n Stella and Andi were at the looms, talking as they worked. The spring rains seem to have broken for good, and everyone else had taken their work outside. Wendy sat in the fresh air with her spinning wheel. A new batch of wool had arrived, and Toma and Jorge worked cleaning it. So Stella had a chance to ask questions in private.\n “Could you get a place at one of the observatories? How does that work?”\n Andi shook her head. “It wouldn’t work out. There’s three people at Kitt and two each at Griffith and Wilson, and they pick their successors. I’m better use to them here, working to send them credits.”\n “And you have your telescope, I suppose.”\n “The astronomers love my telescope,” she said. “They call my setup Barnard Observatory, as if it’s actually important. Isn’t it silly?”\n “Of course it isn’t.”\n Andi’s hands flashed, passing the shuttle across. She glanced up every now and then. Stella, for her part, let her hands move by habit, and watched Andi more than her own work. Outside, Wendy sang as she spun, in rhythm with the clipping hum of her wheel. Her voice was light, dream-like.\n The next time Andi glanced up, she exclaimed, “How do you do that? You’re not even watching and it’s coming out beautiful.”\n Stella blinked at her work—not much to judge by, she thought. A foot or two of fabric curling over the breast beam, only just starting to wind onto the cloth beam. “I don’t know. It’s what I’m good at. Like you and the telescope.”\n “Nice of you to say so. But here, look at this—I’ve missed a row.” She sat back and started unpicking the last five minutes of her work. “I go too fast. My mind wanders.”\n “It happens to everyone,” Stella said.\n “Not you. I saw that shawl you did for Elsta.”\n “I’ve just gotten good at covering up the mistakes,” Stella said, winking.\n A week after her arrival, an agent from the regional committee came to visit. A stout, gray-haired, cheerful woman, she was the doctor who made regular rounds up and down the Long Road. She was scheduled to give Bette a round of vaccinations, but Stella suspected the woman was going to be checking on her as well, to make sure she was settling in and hadn’t disrupted the household too much.\n The doctor, Nance, sat with Bette on the floor, and the baby immediately started crying. Peri hovered, but Nance just smiled and cooed while lifting the baby’s arms and checking her ears, not seeming at all bothered.\n “How is the world treating you then, Toma?” Nance turned to Toma, who was sitting in his usual chair by the fire.\n His brow was creased with worry, though there didn’t seem to be anything wrong. “Fine, fine,” he said brusquely.\n Nance turned. “And Stella, are you doing well?”\n “Yes, thank you,” Stella said. She was winding yarn around Andi’s outstretched hands, to make a skein. This didn’t feel much like an inspection, but that only made her more nervous.\n “Very good. My, you’re a wiggler, aren’t you?” Bette’s crying had finally subsided to red-faced sniffling, but she continued to fling herself from Nance’s arms in an attempt to escape. After a round with a stethoscope, Nance let her go, and the baby crawled away, back to Peri.\n The doctor turned her full attention to Toma. “The committee wants to order more banners, they expect to award quite a few this summer. Will you have some ready?”\n Toma seemed startled. “Really? Are they sure?”\n Barnard supplied the red-and-green patterned cloth used to make the banners awarded to households who’d been approved to have a baby. One of the things Nance had asked about when she first arrived was if anyone had tried bribing him for a length of the cloth over the last year. One of the reasons Barnard had the task of producing the banners—they were prosperous enough not to be vulnerable to bribes. Such attempts happened rarely, but did happen. Households had been broken up over such crimes.\n The banner the household had earned for Bette was pinned proudly to the wall above the mantel.\n Nance shrugged. “The region’s been stable for a couple of years. No quota arguments, most households supporting themselves, just enough surplus to get by without draining resources. We’re a healthy region, Toma. If we can support more children, we ought to. And you—with all these healthy young women you have, you might think of putting in for another baby.” The doctor beamed.\n Stella and Andi looked at each other and blushed. Another baby so soon after the first? Scandalous.\n Nance gathered up her kit. “Before I go, let me check all your birth control implants so we don’t have any mishaps, eh?”\n She started with Elsta and Toma and worked her way around the room.\n “Not that I could have a mishap,” Andi muttered to Stella. “They ought to make exceptions for someone like me who isn’t likely to get in that kind of trouble. Because of her preferences, you know?”\n “I know,” Stella said, blushing very hard now. “I’ve had that thought myself.”\n They stared at each other for a very long moment. Stella’s mouth had suddenly gone dry. She wanted to flee the room and stick her head in a bucket of cool water. Then again, she didn’t.\n When Nance came to her side to prod her arm, checking that the implant was in place, Stella hardly felt it.\n “Looks like you’re good and covered,” Nance said. “For now, eh? Until you get that extra banner.” She winked.\n The doctor stayed for supper and still had enough daylight left to walk to the next waystation along the road. Elsta wrapped up a snack of fruit and cheese for her to take with her, and Nance thanked her very much. As soon as she was gone, Toma muttered.\n “Too many mouths to feed—and what happens when the next flood hits? The next typhoon? We lose everything and then there isn’t enough? We have enough as it is, more than enough. Wanting more, it’s asking for trouble. Getting greedy is what brought the disasters in the first place. It’s too much.”\n Everyone stayed quiet, letting him rant. This felt to Stella like an old argument, words repeated like the chorus of a song. Toma’s philosophy, expounded by habit. He didn’t need a response.\n Stella finished winding the skein of yarn and quietly excused herself, putting her things away and saying goodnight to everyone.\n Andi followed her out of the cottage soon after, and they walked together to their room.\n “So, do you want one?” Stella asked her.\n “A baby? I suppose I do. Someday. I mean, I assumed as well off as Barnard is I could have one if I wanted one. It’s a little odd, thinking about who I’d pick for the father. That’s the part I’m not sure about. What about you?”\n Besides being secretly, massively pleased that Andi hadn’t thought much about fathers . . . “I assumed I’d never get the chance. I don’t think I’d miss it if I didn’t.”\n “Enough other people who want ’em, right?”\n “Something like that.”\n They reached their room, changed into their nightclothes, washed up for bed. Ended up sitting on their beds, facing each other and talking. That first uncomfortable night seemed far away now.\n “Toma doesn’t seem to like the idea of another baby,” Stella prompted.\n “Terrified, I think,” she said. “Wanting too much gets people in trouble.”\n “But it only seems natural, to want as much as you can have.”\n Andi shook her head. “His grandparents remembered the old days. He heard stories from them about the disasters. All the people who died in the floods and plagues. He’s that close to it—might as well have lived through it himself. He thinks we’ll lose it all, that another great disaster will fall on us and destroy everything. It’s part of why he hates my telescope so much. It’s a sign of the old days when everything went rotten. But it won’t happen, doesn’t he see that?”\n Stella shrugged. “Those days aren’t so far gone, really. Look at what happened to Greentree.”\n “Oh—Stella, I’m sorry. I didn’t mean that there’s not anything to it, just that . . . ” She shrugged, unable to finish the thought.\n “It can’t happen here. I know.”\n Andi’s black hair fell around her face, framing her pensive expression. She stared into space. “I just wish he could see how good things are. We’ve earned a little extra, haven’t we?”\n Unexpected even to herself, Stella burst, “Can I kiss you?”\n In half a heartbeat Andi fell at her, holding Stella’s arms, and Stella clung back, and either her arms were hot or Andi’s hands were, and they met, lips to lips.\n One evening, Andi escaped the gathering in the common room, and brought Stella with her. They left as the sun had almost set, leaving just enough light to follow the path to the observatory. They took candles inside shaded lanterns for the trip back to their cottage. At dusk, the windmills were ghostly skeletons lurking on the hillside.\n They waited for full dark, talking while Andi looked over her paperwork and prepared her notes. Andi asked about Greentree, and Stella explained that the aquifers had dried up in the drought. Households remained in the region because they’d always been there. Some survived, but they weren’t particularly successful. She told Andi how the green of the valleys near the coast had almost blinded her when she first arrived, and how all the rain had seemed like a miracle.\n Then it was time to unlatch the roof panels and look at the sky.\n “Don’t squint, just relax. Let the image come into focus,” Andi said, bending close to give directions to Stella, who was peering through the scope’s eyepiece. Truth be told, Stella was more aware of Andi’s hand resting lightly on her shoulder. She shifted closer.\n “You should be able to see it,” Andi said, straightening to look at the sky.\n “Okay . . . I think . . . oh! Is that it?” A disk had come into view, a pale, glowing light striped with orange, yellow, cream. Like someone had covered a very distant moon with melted butter.\n “Jupiter,” Andi said proudly.\n “But it’s just a star.”\n “Not up close it isn’t.”\n Not a disk, then, but a sphere. Another planet. “Amazing.”\n “Isn’t it? You ought to be able to see some of the moons as well—a couple of bright stars on either side?”\n “I think . . . yes, there they are.”\n After an hour, Stella began shivering in the nighttime cold, and Andi put her arms around her, rubbing warmth into her back. In moments, they were kissing, and stumbled together to the desk by the shack’s wall, where Andi pushed her back across the surface and made love to her. Jupiter had swung out of view by the time they closed up the roof and stumbled off the hill.\n Another round of storms came, shrouding the nighttime sky, and they spent the evenings around the hearth with the others. Some of the light went out of Andi on those nights. She sat on a chair with a basket of mending at her feet, darning socks and shirts, head bent over her work. Lamplight turned her skin amber and made her hair shine like obsidian. But she didn’t talk. That may have been because Elsta and Toma talked over everyone, or Peri exclaimed over something the baby did, then everyone had to admire Bette.\n The day the latest round of rain broke and the heat of summer finally settled over the valley, Andi got another package from Griffith, and that light of discovery came back to her. Tonight, they’d rush off to the observatory after supper.\n Stella almost missed the cue to escape, helping Elsta with the dishes. When she was finished and drying her hands, Andi was at the door. Stella rushed in behind her. Then Toma brought out a basket, one of the ones as big as an embrace that they used to store just-washed wool in, and set it by Andi’s chair before the hearth. “Andi, get back here.”\n Her hand was on the door, one foot over the threshold, and Stella thought she might keep going, pretending that she hadn’t heard. But her hand clenched on the door frame, and she turned around.\n “We’ve got to get all this new wool processed, so you’ll stay in tonight to help.”\n “I can do that tomorrow. I’ll work double tomorrow—”\n “Now, Andi.”\n Stella stepped forward, hands reaching for the basket. “Toma, I can do that.”\n “No, you’re doing plenty already. Andi needs to do it.”\n “I’ll be done with the mending in a minute and can finish that in no time at all. Really, it’s all right.”\n He looked past her, to Andi. “You know the rules—household business first.”\n “The household business is done. This is makework!” she said. Toma held the basket out in reproof.\n Stella tried again. “But I like carding.” It sounded lame—no one liked carding.\n But Andi had surrendered, coming away from the door, shuffling toward her chair. “Stella, it’s all right. Not your argument.”\n “But—” The pleading in her gaze felt naked. She wanted to help, how could she help?\n Andi slumped in the chair without looking up. All Stella could do was sit in her own chair, with her knitting. She jabbed herself with the needle three times, from glancing up at Andi every other stitch.\n Toma sat before his workbench, looking pleased for nearly the first time since Stella had met him.\n Well after dark, Stella lay in her bed, stomach in knots. Andi was in the other bed and hadn’t said a word all evening.\n “Andi? Are you all right?” she whispered. She stared across the room, to the slope of the other woman, mounded her under blanket. The lump didn’t move, but didn’t look relaxed in sleep. But if she didn’t want to talk, Stella wouldn’t force her.\n “I’m okay,” Andi sighed, finally.\n “Anything I can do?”\n Another long pause, and Stella was sure she’d said too much. Then, “You’re a good person, Stella. Anyone ever told you that?”\n Stella crawled out from under her covers, crossed to Andi’s bed, climbed in with her. Andi pulled the covers up over them both, and the women held each other.\n Toma sent Andi on an errand, delivering a set of blankets to the next waystation and picking up messages to bring back. More makework. The task could just have as easily been done by the next wagon messenger to pass by. Andi told him as much, standing outside the work house the next morning.\n “Why wait when we can get the job done now?” Toma answered, hefting the backpack, stuffed to bursting with newly woven woolens, toward her.\n Stella was at her loom, and her hand on the shuttle paused as she listened. But Andi didn’t say anything else. Only glared at Toma a good long minute before taking up the pack. She’d be gone most of the day, hiking there and back.\n Which was the point, wasn’t it?\n Stella contrived to find jobs that kept Toma in sight, sorting and carding wool outside where he was working repairing a fence, when she should have been weaving. So she saw when Toma studied the hammer in his hand, looked up the hill, and started walking the path to Andi’s observatory.\n Stella dropped the basket of wool she was holding and ran.\n He was merely walking. Stella overtook him easily, at first. But after fifty yards of running, she slowed, clutching at a stitch in her side. Gasping for breath with burning lungs, she kept on, step after step, hauling herself up the hill, desperate to get there first.\n “Stella, go back, don’t get in the middle of this.”\n Even if she could catch enough of her breath to speak, she didn’t know what she would say. He lengthened his stride, gaining on her. She got to the shed a bare few steps before him.\n The door didn’t have a lock; it had never needed one. Stella pressed herself across it and faced out, to Toma, marching closer. At least she had something to lean on for the moment.\n “Move aside, Stella. She’s got to grow up and get on with what’s important,” Toma said.\n “This is important.”\n He stopped, studied her. He gripped the handle of the hammer like it was a weapon. Her heart thudded. How angry was he?\n Toma considered, then said, “Stella. You’re here because I wanted to do Az a favor. I can change my mind. I can send a message to Nance and the committee that it just isn’t working out. I can do that.”\n Panic brought sudden tears to her eyes. He wouldn’t dare, he couldn’t, she’d proven herself already in just a few weeks, hadn’t she? The committee wouldn’t believe him, couldn’t listen to him. But she couldn’t be sure of that, could she?\n Best thing to do would be to step aside. He was head of the household, it was his call. She ought to do as he said, because her place here wasn’t secure. A month ago that might not have mattered, but now—she wanted to stay, she had to stay.\n And if she stepped aside, leaving Toma free to enter the shed, what would she tell Andi afterward?\n She swallowed the lump in her throat and found words. “I know disaster can still happen. I know the droughts and storms and plagues do still come and can take away everything. Better than anyone, I know. But we have to start building again sometime, yes? People like Andi have to start building, and we have to let them, even if it seems useless to the rest of us. Because it isn’t useless, it—it’s beautiful.”\n He stared at her for a long time. She thought maybe he was considering how to wrestle her away from the door. He was bigger than she was, and she wasn’t strong. It wouldn’t take much. But she’d fight.\n “You’re infatuated, that’s all,” he said.\n Maybe, not that it mattered.\n Then he said, “You’re not going to move away, are you?”\n Shaking her head, Stella flattened herself more firmly against the door.\n Toma’s grip on the hammer loosened, just a bit. “My grandparents—has Andi told you about my grandparents? They were children when the big fall came. They remembered what it was like. Mostly they talked about what they’d lost, all the things they had and didn’t now. And I thought, all those things they missed, that they wanted back—that was what caused the fall in the first place, wasn’t it? We don’t need it, any of it.”\n “Andi needs it. And it’s not hurting anything.” What else could she say, she had to say something that would make it all right. “Better things will come, or what’s the point?”\n A weird crooked smile turned Toma’s lips, and he shifted his grip on the hammer. Holding it by the head now, he let it dangle by his leg. “God, what a world,” he muttered. Stella still couldn’t tell if he was going to force her away from the door. She held her breath.\n Toma said, “Don’t tell Andi about this. All right?”\n She nodded. “All right.”\n Toma turned and started down the trail, a calm and steady pace. Like a man who’d just gone out for a walk.\n Stella slid to the ground and sat on the grass by the wall until the old man was out of sight. Finally, after scrubbing the tears from her face, she followed him down, returning to the cottages and her work.\n Andi was home in time for supper, and the household ate together as usual. The woman was quiet and kept making quick glances at Toma, who avoided looking back at all. It was like she knew Toma had had a plan. Stella couldn’t say anything until they were alone.\n The night was clear, the moon was dark. Stella’d learned enough from Andi to know it was a good night for stargazing. As they were cleaning up after the meal, she touched Andi’s hand. “Let’s go to the observatory.”\n Andi glanced at Toma, and her lips pressed together, grim. “I don’t think that’s a good idea.”\n “I think it’ll be okay.”\n Andi clearly didn’t believe her, so Stella took her hand, and together they walked out of the cottage, then across the yard, past the work house, and to the trail that led up the hill to the observatory.\n And it was all right.\n Carrie Vaughn’s work includes the Philip K. Dick Award winning novel Bannerless, the New York Times Bestselling Kitty Norville urban fantasy series, over twenty novels and upwards of one hundred short stories, two of which have been finalists for the Hugo Award. Her most recent novel, Questland, is about a high-tech LARP that goes horribly wrong and the literature professor who has to save the day. She’s a contributor to the Wild Cards series of shared world superhero books edited by George R. R. Martin and a graduate of the Odyssey Fantasy Writing Workshop. An Air Force brat, she survived her nomadic childhood and managed to put down roots in Boulder, Colorado."}