{"fingerprint": "Yxa0Mo7F5CCEhrhNdGDZN2/q2zY=", "sitename": "Clarkesworld Magazine", "title": "Suteta Mono de wa Nai (Not Easily Thrown Away) by Juliette Wade", "author": "Juliette Wade", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wade_03_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Suteta Mono de wa Nai (Not Easily Thrown Away) by Juliette Wade", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5320 words, short story\n Suteta Mono de wa Nai捨てたものではない(Not Easily Thrown Away)\n ‘Cram-school psycho’ was just a bully’s insult until I started hearing the voices.\n One of them sounds like a whistle, and the other like a rusty trumpet, and when I sit at my desk at midnight, slowly hitting my head against my schoolbooks, they discuss my future.\n “She’ll probably pass the exams on her own.”\n “No, she won’t.”\n “She might. She studies hard.”\n “But she doesn’t sleep enough. Look how she’s fallen apart since her father’s work reassignment.”\n “Her grandmother isn’t taking good care of her. She needs someone to take care of her.”\n “No, she doesn’t. She’d lose her spirit.”\n “She would not.”\n I’d scream at them to shut up, but I wouldn’t want to wake Obaa-chan. Instead, when the pressure in my head wants to break me, and I hear the metallic ticking and the rustling get closer, I slip my feet into my zori sandals on the back step and hop out into the narrow space behind our apartment. Beyond the wall with its leafless ivy, the late train rushes by with a shudder and a shriek and I can scream as loud as I like and nobody will hear.\n I won’t pass the exams.\n I have to pass the exams.\n “She’s mine,” says rusty trumpet. And whistle argues, “No, she’s mine.”\n Sometimes I just want to leave the world.\n Obaa-chan made me name tags so I could sew them into my high school uniform: Kitano Naoko. I didn’t want to throw away the extras, so I stitched them into my Gothic-girl cosplay. One in the spiderweb stockings, another in the white crinoline, another for the black minidress with the lace-up bodice. Small links back to the ordinary me.\n My costume’s still missing something.\n In the bathroom of Harajuku station, I stand at the mirror beside a college girl in platform shoes. Her hair is dyed cherry-red, and she paints her lips into a big pink kiss. I can’t afford platform shoes, and if I dyed my hair they wouldn’t let me back in school. I draw black tears down my cheeks, and walk out into the icy January rain.\n I’m the only one standing on the bridge. My other world is empty: no crowd of cosplayers to talk to, no music to lose myself in. Even Cherry Girl crosses and heads down Takeshita street, probably to meet friends.\n I shiver under my tiny plastic umbrella, pacing back and forth through the puddles. I’d forgotten it’s Adult’s Day, the celebration for twenty-year-olds—I can’t avoid seeing the shining stars of the holiday. Young women walk choko-choko in fancy geta onto the gravel path toward Meiji Shrine. Twenty-year-old perfection cocooned in layers of bright kimono and white fur shoulder-wraps. They glimmer against the dark gray street and the green trees. Admiring family members hover around them, carrying umbrellas to protect them from the rain.\n They can scarcely walk in those heavy kimonos. They’re not shivering, though. They’ve made it through. They’ll walk beneath the torii gate into the shrine, make their offerings, and be blessed. Everything falls toward them—young men, good fortune, even gravity. They’re so bright I can hardly bear to look, and light-years away.\n I don’t know why I came out here.\n I walk fast back to the station. Change clothes in the bathroom, wipe my face clean for appearances. At a vending machine, I buy a can of hot milk-tea to warm my hands, and get back on the train.\n At least I chased away the voices for a little while. But when the train pulls into my station, the pressure comes back ten times worse.\n I have to be careful now, because of Obaa-chan. My bag has to be zipped, not the least shred of crinoline showing. The better way would be not to bring it around the front at all. I walk down the station steps, duck around the raised guard rail and across the tracks, then sidestep between the ivied wall and the back of our apartment building. An ice-cold drip from the eaves strikes me right at the crest of my head.\n The voices are back.\n “She’s mine.”\n “No, she’s mine!”\n “Naoko-san, hey!”\n My fingers clench. As I sidestep past our neighbors’ back porch, the metallic ticking starts. There’s the rustling, too, frantic this time. It sounds so real. Too real. Maybe there’s a cat fight? But feral cats don’t whistle my name . . .\n I peek past the piece of wall that divides their porch from ours. Things are fighting, outside our back step. A skeleton, and a bat? No, skeletons don’t have lights . . .\n Crack.\n The whistle rises in pitch like a scream, and the bat-thing falls down with the skeleton-thing standing over it.\n I jump in and kick the skeleton-thing. It breaks apart, all its pieces scattering across the ground with a sound like a bike crash. A metal bar—the brake of a train? A bike pedal. A chain. A couple of disconnected gears. When I look for the bat thing, all I see is Obaa-chan’s old paper umbrella from her tour of the Nakasendo Highway years ago, and a cracked teapot with a broken lid.\n “Iya da . . . I’m fighting garbage?”\n That’s it—I’ve really lost it. I drop my bag, squat down and hide my face in my hands.\n “We’re not garbage,” says the whistling voice, beside my feet. “I might be dusty, but I haven’t been thrown away. I still matter.”\n I look down. The sumi-e painting on the side of the old teapot isn’t plum blossoms any more. It’s a face, and the crack looks like a sly grin.\n I mutter aloud, “I need to see a psychiatrist, for sure.”\n “No,” whistles the voice slyly through the crack. “Everything will be all right so long as you pass your college entrance exams.”\n I don’t scream.\n I do stand up with both hands over my mouth.\n The metal parts are pulling back together as if by magnets, and the little lights go on, blue and yellow.\n “Ow,” says rusty trumpet. “Kyusu, no fair. You called her.”\n “You broke me!” the teapot retorts. It settles itself atop the umbrella, which tips itself up and gives a ruffle. “Den is nothing but a ruffian. I’m a good boy.”\n “Traditional,” says Den, scornfully.\n “Glue,” I mumble. “Inside, we have some. Wait a minute . . . ”\n I slip off my shoes and step in the back door. The kitchen light is on, and Obaa-chan is cooking. I keep my mouth shut, tiptoeing past the door and into the front entry hall. Oto-san always kept glue in the slipper cabinet; it wouldn’t have gotten moved when his company moved him.\n Back out to the cold. I sit on the back step beside my zori and glue the two pieces of the teapot lid back together, casting glances at Kyusu, who has developed small brown bamboo hands and is covering his head as if his life force resided there, like a kappa’s.\n “Do you have tea in there?” I ask.\n “Of course,” he says, importantly. “Very old tea.”\n “He doesn’t,” says Den, who stands by the wall with lights winking. “It’s all dried out long since.”\n Kyusu looks offended.\n I hand Kyusu his lid, and glance down politely at the tube of glue while he puts it on. His teapot’s still full of cracks, of course—but if I had to glue anyone’s mouth shut, I’d rather it be Den’s.\n I ask, “Kyusu, do you need anything else? I have a rag, I could tidy you up—”\n “Iya!” he cries. Then he ruffles a bit, and apologizes: “Shitsurei shimashita. You’ve taken good care of me.”\n “Yet you’re still alive,” says Den. He sounds surprised. Kyusu gives an indignant ruffle, and Den lifts his bike pedal like a threatening fist.\n I stand up. “Den, leave him alone. Shall I kick you again?”\n Den’s lights wink out. Suddenly a light flicks on in the window above my head, and both Den and Kyusu flop down, old pieces of junk forgotten in the dirt.\n Behind me, Obaa-chan opens the door. “Nao-chan, what in the world are you doing out here?”\n “Tadaima.” I duck my head. “I’m home.”\n “Okaeri-nasai.” The way Obaa-chan says it, it’s more a command than a greeting. She leaves it there in my ears and shuffles back into the house. Face burning, I carry my shoes back to their spot in the entry hall, and sneak my bag into the closet behind my folded futon. I wish I could have left it outside, but I don’t trust Den.\n If he and Kyusu are there at all. But I saw them; I glued Kyusu’s lid for him. And Obaa-chan’s stories always made the yokai spirits seem so real . . .\n Maybe it’s myself I don’t trust.\n Obaa-chan is sitting in her chair at the kitchen table when I walk in, but the moment I sit down she stands up again, pouring me tea the way she used to for Oto-san, with precision and ceremony. Taking a small bowl to the rice cooker and filling it. Filling another bowl with miso soup. Bringing them to my place. Reminding me of the trouble I am to her.\n I clap my hands together. “Itadakimasu. Obaa-chan, I’ll do the dishes.”\n “Of course you won’t,” she replies. “You’ll be studying.”\n Ashamed, I hide in my miso soup. It’s delicious, with bits of fried tofu. Just what my frozen body needed, which only makes me feel worse.\n “You haven’t been taking proper care of yourself, Naoko-san,” Obaa-chan says. “Your face is all dirty.”\n She knows. She must; she didn’t ask a single question about my bag. I pull my bangs down over my eyes. “I’m sorry.”\n “I spoke with your father.”\n I put my chopsticks down, carefully. Pinch the edge of the table until my fingertips turn white.\n “I’ll be driving you to cram school, and picking you up, this week. That should help.”\n It feels like a door shut in my face. I should be grateful. She’s always tried to help. But I hardly feel I know her any more.\n I manage to say something. “You’re taking good care of me, Grandmother.”\n I pick up my chopsticks again and start eating, like a puppet.\n There’s no escape.\n Day after day, kanji characters march through my head. Mathematics, English, social studies, science, Japanese language—they’re skeletons made of broken chopsticks and bent umbrellas, rusty scissors, a hundred kinds of junk. Their footsteps hurt, and when I try to catch them they twist and fall apart.\n Obaa-chan invited me into the formal tatami-mat room with the kotatsu, so I could tuck into the quilt under the heated table and keep warm while I worked. I declined, because I don’t need Grandfather and Mother’s ancestor portraits watching me on top of everyone else. Since then, the weather has dropped below freezing. Obaa-chan peeks into my room occasionally, her mending in hand, but she never asks me to change my mind.\n “You can still pass.” Kyusu is peeking through my window, seemingly unaffected by the cold. “It’s not much longer.”\n “Kyusu, I’m trying to study.”\n I have no idea why he even cares. It was just a little glue.\n “You’d rather go out. I can see why,” says Den, beside him. “We know you try on the costume when no one is in the house. You’ve got a new spirit, and now it’s being squashed.”\n “Both of you shut up, okay?”\n A sad little whistle comes in reply. “All right, I understand.”\n Now I feel sorry. For a teapot on an umbrella. This does not help my concentration.\n “You don’t have to do this,” says Den.\n “Yes, I do.”\n Oto-san went to Tokyo University. I dream about getting into Kyoto, if I only could score high enough, but I’ll never get there—probably easier to fly to the moon.\n “You don’t.” His electric-panel face taps against my window, lights blinking. “It’s your life. Your grandmother shouldn’t be watching everything you do.”\n “Den—”\n “I’m serious. You could tell her so.”\n I dig my left hand deep into my hair, and force my cramped fingers to keep writing, nicely formed characters, one in each box. Twelve hundred character essay, due tomorrow morning. And tomorrow night I’m sure there will be another just like it.\n “Nao-chan, dinner!” Obaa-chan calls.\n I can hardly set down the pencil. I shake my hand out, and blow on it, walking to the kitchen. Here, the space heater is on, but the friction in my head is so bad I’d almost prefer the cold.\n I imagine myself standing on the sub-zero Jingumae bridge in my spiderweb stockings. I sit down, Obaa-chan gets up.\n “I spoke to your father last night,” she says, serving rice. “The weather is warmer in Nagasaki.”\n “Is that so.” I imagine myself standing on the moon.\n “He would like to talk to you sometime.”\n I have nothing to say. She never calls me to the phone. I used to talk to Oto-san, when he sat here on my right. I never minded eating late so I could talk to him. Obaa-chan talked to him, too. Now his empty chair is a crater, and she and I stand on opposite sides.\n Obaa-chan sighs. “If you told me more about your studies, I could tell him how you’re doing.” She sets down the rice bowl; the tiny sound of it hitting the table echoes like an asteroid impact. I answer like an alien.\n “You already know how I’m doing. Don’t you? You’re always watching me. You don’t even let me breathe.”\n Obaa-chan frowns. “Nao-chan, these exams will decide the rest of your life. You’ll just have to endure.”\n “I can’t stand it!” I push back from the table. “What if I don’t want to take the exams? What if I don’t care?”\n Her fingers clench around the rice paddle, still in her hand. “You!” she snaps. “You only think about yourself—you treat your father’s sacrifices as if they mean nothing.”\n “That’s right, he’s perfect, and I’m nothing but a nuisance who will never be good for anything!”\n “Naoko-san, sit down and eat your dinner.”\n “I’m not hungry.”\n I run away down the hall, all the way out the back door. I curl up on the step with my knees pressed into my eyes.\n “Naoko-san?” whistles Kyusu’s voice. “Are you all right?”\n Den whispers, “Look how powerful you are now.”\n “Leave me alone!”\n I want to say that it was Den’s fault, but I was the one who did it. I chose to speak.\n I’m too tired to study and too angry to sleep.\n Again.\n Obaa-chan and I aren’t speaking. I haven’t eaten breakfast or dinner for two days because that would mean going into the kitchen. It would mean her serving me, reminding me as always of the filial debt that I can never repay.\n “You should say sorry,” Kyusu whistles, by the window. “She still cares for you. Just say sorry.”\n “No way,” says Den. “You should stay strong. She should apologize to you.”\n Kyusu gives a ruffle. “Naoko-san, your grandmother would be glad to see you eat. So would I.”\n He’s stopped telling me I can pass the exams.\n I still have to pass the exams.\n I feel sick, but my stomach is empty. Probably, Obaa-chan thinks I’ve been eating at school, but I’ve only had a little water. I’m just not hungry; my stomach feels flattened like an origami box. I tiptoe out to the back door and slip into my zori on the step. I take deep breaths, as if the icy air might fill me out to my proper shape again.\n “Naoko-san?” Kyusu hops over from the window, his bamboo umbrella-handle stamping small circles in the frozen dirt. “I’m worried about you. Please eat.”\n “She’s glimpsed the possible ends,” says Den, leaning against the frozen twists of ivy. His yellow light blinks once. “Failure.”\n “Den, stop.”\n His blue light blinks once. “Death.”\n A shiver rises up from my feet, all the way to my head. Is that where this darkness leads? Suicide? “I don’t want to throw my life away,” I say. “I just want—I don’t know, a way out of this.”\n “Time?” Kyusu suggests meekly.\n “A different spirit,” Den trumpets. “Like wearing your costume.”\n I can only sigh. “I still have to pass the exams.”\n “No, you don’t,” says Den.\n “She does, though,” says Kyusu.\n Den laughs like the clatter of a chain against metal. “Not if she leaves the human world, and joins us. That would be a significant change.”\n For an instant I forget the cold. Leave the world? Is that possible?\n Kyusu hops backward with a ruffle. “Iya . . . ”\n His mournful whistle disturbs me. “Kyusu, is your life so terrible? Would you rather be in someone’s kitchen serving tea, or keeping off the rain?”\n “It’s not that. Den is . . . ” He waves away his own thought with one bamboo hand. “I had to be forgotten before I could have my own memories, but I mustn’t be undervalued. You should know that neglect does . . . unexpected things.”\n “It gives you life!” Den cries.\n I hug myself. “I am alive.”\n Den scoffs with a grating noise. “Are you more alive now, or when you wear the costume?”\n I look down, worrying the ties of the house-coat Obaa-chan made for me. He knows my answer, or he wouldn’t have asked.\n “Your father left for Nagasaki. That’s what did it.” Den waves his bicycle pedal in a grand circle. “Now you’re realizing you have the power to do as you like with your own life. You could turn yokai, and leave behind your problems for good. Exams mean nothing to us.”\n Just throw the exams away? I can hardly imagine it. I pull my house-coat tighter. “What do I have to do?”\n A deep shudder comes from the rails behind the wall. The flash of a headlight breaks the darkness, and the first train of the morning shrieks by.\n Den says, “Come to Harajuku.”\n No matter how many times I’ve come out to the Jingumae bridge, I never expected to follow the Adult’s Day girls so soon—and not like this. Above my head, the giant torii gate of Meiji Shrine looks almost painted, heavy ink-black lines against the dawning sky. It stands like a dark border between my past and future.\n Den and Kyusu step beneath it first. Following them into the space between the trees, I shiver even in my winter coat. I try to imagine the yokai version of myself, but I see only Kitano Naoko, desperate high-schooler and cosplayer in withdrawal.\n What kind of yokai could I be? I wouldn’t do well as a neck-stretching rokurokubi, or a faceless noppera-bo. All I really know how to do is Gothic-girl.\n What would a Gothic-girl yokai look like? Longer hair? Paler face? Would I feel cold? Hunger? Would I have silent footsteps?\n Den and Kyusu don’t. Den’s gears rattle and scuff through the gravel; Kyusu hops with little crunching sounds, rather like the lamp in the Miyazaki movie. I’m still surprised they made it here so easily; early commuters on the Yamanote line seemed too rushed to do more than raise an eyebrow at a pile of abandoned objects in the corner by my seat. We’ve left commuters behind, though; here on the path between the trees, there is no one.\n Soon the inner torii gate comes into view. Beyond it, the heavy wooden doors to the courtyard stand open. Kyusu stops abruptly before the high gate-sill, spreading his bamboo-and-paper skirts.\n “Naoko-san, don’t do this,” he whistles. “Your grandmother will have found you gone by now. She’ll be frantic, asking the neighborhood police if they’ve seen you.”\n Obaa-chan frantic . . . I hug myself, and shiver deeper into my coat. “What other choice do I have?”\n Den straightens himself up, walking forward. “You can’t stop her, Kyusu.”\n “And you can’t make her. She doesn’t even like you.”\n “That doesn’t matter. She’s mine anyway.”\n “No, she’s not.”\n “Well, she’s certainly not yours.”\n “Quiet down, both of you,” I say. “I belong to myself. Den, you said yourself, it’s my life.”\n Den’s electric-panel face swivels around to me. “Truly? Then why are you here?”\n I bite my lips shut.\n “Naoko-san,” says Kyusu, “we can still go home . . . ”\n “That’s enough!” Den raises his bike pedal threateningly. “Teapot-boy, give her to me or this time I’ll break your face.”\n I cry out, “Den, don’t!”\n But Kyusu drops his skirts with a whistling sigh. “It’s all right. I’ll stay behind.”\n Den hops and rattles over the wooden sill into the main shrine courtyard. I step over too, but with Kyusu gone it feels different. I don’t like Den talking like he owns me. My stomach starts to cramp. I wish I could see the priests, but no one is in sight. Even the fortune-telling windows are still closed. At the stone steps I approach the offering bin and clap my hands to invoke the attention of the kami.\n “Stop that,” says Den.\n “Don’t you appreciate it?”\n “It’s not for me. And with what you’re doing, we want as little attention as possible.”\n That sounds bad. “Den, what am I doing?”\n Den’s yellow light winks at me. “If you want to cross over to our world, you’ll need to eat the offerings.”\n My stomach squirms. The New Year’s offerings of mochi and oranges will still be arrayed before the altars. To eat them—the awful thought makes my hair stand on end. A sudden pain bites the back of my head, so sharp I clasp my hands over it.\n “I can’t. Den, I can’t do this.”\n “Don’t be an idiot. Of course you can. You’re just hungry enough, and soon your new spirit will do it for you.” Both his lights are glowing now, as if in satisfaction. “I told that teapot you were mine. Now he’s just garbage. I matter.”\n “What are you saying? Kyusu matters.” The back of my head hurts so much it feels like it’s going to split open. I should never have come here. I should have realized, when Kyusu tried to stop us. I should never have let him stay behind . . .\n I turn away and run back across the broad courtyard. At the gate, I call out.\n “Kyusu? Are you still here?”\n The dawn stillness is broken only by the trickle of water in the purifying basin.\n Then comes a soft whistle. “Naoko-san?”\n Yokatta! Relieved, I follow his voice to a spot behind the basin. He cringes when he sees me.\n “Naoko-san, are you all right?”\n “My head is hurting. I’m so sorry. I should have listened to you. Den talks like he never cared about me at all, only about himself.”\n “I know,” Kyusu sighs. He bows his teapot head so deeply he has to hold his lid on with both hands. “Neither of us did, at first. We only wanted to change you, to prove we still mattered, that we couldn’t just be thrown away. I’m afraid I have no excuse.”\n My stomach cramps again. “That was what you both wanted, from the very beginning? To turn me yokai?”\n He shakes one small hand before his face. “No, no, that was never my thought. Den had that plan, I suppose, but I only learned it today. Since you hadn’t been eating, there was only one obvious possibility.”\n “What?”\n “This.” He reaches up for a dipper of water from the purifying basin and pours it into his spout. Then, bowing his head toward me, he removes his lid.\n The tea gives off a musty scent, like rain on old leaves. I’m embarrassed to look at something so private, but once I do I can’t stop staring. The purifying water glows with its own light, and the floating leaves flicker and change into the vision of a woman. She is deathly thin, with a starved expression, and two tentacular braids that undulate all on their own, revealing a gaping horror at the back of her head: a mouth full of sharp teeth.\n Futakuchi onna.\n “No. No. That’s not me!” But there’s still the pain at the back of my head—and I had that feeling that my hair was standing up . . . Iya! I hold my head tightly with both hands.\n Kyusu claps his lid back on. “You’re still in danger. You have to eat something normal, quickly.”\n I search my pockets. Nothing. “I could buy something at the station—”\n Then I hear Den’s voice calling. If he’s come looking for me, that can’t be good.\n “Naoko-san, are you hungry? I’ve brought you an orange . . . ”\n Agony bites my head again. I scoop up Kyusu, and run. Den isn’t a fast mover, but it’s a long way back along the pathway through the trees, and I’m dizzy with pain and hunger.\n “Just don’t stop,” whistles Kyusu.\n At last we pass under the great torii gate and cross the street onto the bridge. There are people here, real people. I stumble through them to the station, and buy myself a train ticket. Once inside, I hurry to the vending machine and buy myself a hot milk-tea.\n I have never tasted anything so delicious. As I cradle its warmth in my free hand against my face, the pain in my head slowly subsides. Kyusu stays tucked tightly under my arm, making no complaint as we board the train.\n We reach our station with no sign of Den. It seems almost normal to walk down the station steps, around the guard rail and across the tracks. I duck in behind the ivied wall and sidestep to my back porch. Once there, I set Kyusu down.\n “Kyusu, are you all right?”\n He’s silent for a long moment. At last, he ruffles hesitantly. “Yes?”\n “You don’t sound sure.”\n Kyusu pats his porcelain face with his bamboo hands, sumi-e eyes blinking. “Just—I’m surprised. You carried me, and I’m still alive.”\n “By good fortune, we both are. It’s rude, but may I go inside and get something to eat?”\n “Please do, before Den finds you.”\n I brace for Obaa-chan, and dare a quiet, “Tadaima . . . ”\n The apartment is silent. Even the kitchen is empty. Where could she be? The rice cooker light is on, so I wash my hands and open it. The rush of delicious steam makes me want to swoon. I take up a ball of rice with the paddle and shape it into a triangle between my hands; it’s scalding hot, but I don’t care. My head is finally my own again.\n My mouth is full of hot rice when I hear Kyusu scream.\n I gulp down the mouthful and run for the back door, nearly falling when I try to get into my zori. Den stands over Kyusu, raining blows with the bike pedal that could easily shatter his head—if they haven’t already.\n I kick Den to pieces against the ivied wall, but all too soon, he pulls himself back together.\n I step between him and Kyusu. “Leave him alone.”\n Den’s trumpeting voice is wild and furious. “Go ahead, kick me. Kick me all you like, but you’ll never get rid of me. I’m not so easily thrown away.”\n Behind him, Kyusu gets up slowly. His head seems whole; he pats himself carefully with his small brown hands. I’ve seen him in pain, seen him broken, but he’s never seemed afraid of death—except when I’ve cared for him.\n I know what I have to do.\n I crack open the apartment door and grab a clean rag from the laundry basket. Then I go for Den. He’s expecting a kick, but I catch him by a loop of his chain and start rubbing.\n Now he’s the one who squirms and screams. Hits, too, but I won’t let go. Whoever abandoned him left him covered with old oil and dirt that stains the rag. His brake handle is far easier, just a thin film of dust, and easy to wipe away. When I reach his electric panel his screams turn to whimpers, and finally fade away. I give each of his gears a good scrubbing, just to be sure.\n Kyusu is watching me with both hands held over his mouth.\n I drop the rag in the dirt, and extend a hand toward him. “Kyusu. I’d never do such a thing to you, I promise. You matter to me.”\n He twists his umbrella-foot in the dirt almost shyly. “Perhaps, if we are careful, we could care for each other without crushing each other’s spirits?” Then he grimaces. “I’m still sorry I couldn’t help you pass your entrance exams.”\n The exams. For the first time, the thought fails to bring its usual panic.\n “Kyusu, excuse me a moment,” I say. “I need to find my grandmother.”\n I carry my shoes, thinking to go straight out through the front entryway and ask after her with the neighborhood police, but passing the kitchen door, I glimpse her in the corner of my eye.\n Obaa-chan, alone at the kitchen table. Not cooking. Not mending. Silent, lonely, her eyes downcast.\n I don’t know how to go in there. I leave my shoes and coat in the entryway and smooth my hair, so she won’t scold me for little nothings when I’ve barely escaped throwing away my human self. If I sit down, she’ll get up, and it will be too late. This time has to be different.\n I walk in, straight to the electric kettle.\n “Obaa-chan, can I get you some tea?”\n I hear her shaking gasp, but focus on taking down a pair of cups and the small iron teapot—the replacement for our hand-painted porcelain one that cracked. The careful routine: shaking in tea, pouring in hot water, placing the cups and teapot on a laquered tray. At last she answers.\n “Nao-chan—yes, please.”\n My hands shake, setting the tray down in front of Oto-san’s place. I place one cup for her, one for me, and sit down.\n Obaa-chan doesn’t get up. The clock ticks on the wall, beside our kitchen shrine.\n I reach for my cup, trying to find something to say.\n “Obaa-chan, I’m sorry. I know I’m late for school.”\n After several silent seconds, she murmurs, “You’re safe . . . ”\n Did she know the danger I was in? How could she know? But somehow it makes words easier.\n “Obaa-chan, I’m sorry. I’m trying to study hard, but I’m not Oto-san. I think I’m going to fail, and the harder I try, the harder . . . it’s terrible, inside my head. I don’t know what to do.”\n She nods. Picks up her teacup in both hands, and sips. “You’re just like me.”\n Like her? I blink at my tea, and take a sip to cover my confusion.\n “Life is long,” she says. “Even if you fail, even if you become ronin, you can try again.”\n “Oto-san—”\n “He will return one day. He will want you to be here.”\n I sneak a glance at her face. Deep behind her sad eyes, I can hear words she doesn’t say. Life is long, if you don’t throw it away. What happened to her? Maybe one day she will trust me enough to tell me.\n “I understand.” I take a sip of tea, and swallow. “I should probably get ready for school.”\n She nods. “I’ll drive you today.”\n “Yes, please.”\n “I’m here waiting whenever you are ready.”\n “Hai.”\n I run back to my room, but before I pick up my backpack, I open the sliding door of the futon closet. I open my bag and spread my costume out on the floor, feeling the tickle of crinoline on my palms.\n I’m not going to throw it away—and now I know what it’s missing.\n I can wrap the bicycle chain around the waistline, and sew the gears into the skirt. The electric panel lights would look good if I stitched them to one shoulder. And the exams will end before winter does, so I’ll need a better umbrella.\n I’ll ask Kyusu if he’d like to come with me.\n Juliette Wade combined a trip to the Gouffre de Padirac with her academic background in linguistics and anthropology to create the world of Varin, a grand experiment in speculative ethnography. She lives the Bay Area of California with her husband and two children, who support and inspire her. Her fiction has appeared in Clarkesworld, Analog, and Fantasy & Science Fiction. She runs the Dive into Worldbuilding video series and workshop at www.patreon.com/JulietteWade."}