{"fingerprint": "Lv/TRD+O+njzfJpiOqpqmsTt5+o=", "sitename": "Clarkesworld Magazine", "title": "The Persistence of Blood by Juliette Wade", "author": "Juliette Wade", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wade_03_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Persistence of Blood by Juliette Wade", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "26340 words, novella\n The Persistence of Blood\n Beneath her squirming two year old, beneath her rustling gown, Selemei could feel herself bleeding. It had started an hour ago. A subtle trickle of guilt—and, like a trickle of falling dust at the border of the city-caverns, it warned that the way forward was dangerous. Selemei squeezed Pelli tighter. Her daughter squeaked protest, so she released a little, nuzzled down between Pelli’s puffed curls, and inhaled the sweet scent of kalla oil where her hair parted. She risked a glance down the brass dinner table at her partner, Xeref.\n Xeref sat deep in conversation with their elder son, the fingers of one pale hand buried in his silver hair, while their younger son listened raptly. Seeming to sense her glance, Xeref looked up, and his lips curved into a smile.\n She knew those fingers, those lips. A lick of heat; the memory of pleasure—and then the fear struck her in the stomach, as unspeakable as the blood.\n Oh, holy Heile in your mercy, preserve my health, keep my senses intact . . .\n Selemei hid the tremors of her hands by rubbing them into Pelli’s back. With a giggle, Pelli started kissing her cheeks. Selemei managed to return a few kisses, then tried to pull away by looking up at the electric chandelier that hung from the vaulted ceiling.\n Eight-year-old Aven tugged at her left hand, playing with the ruby drops dangling from her bracelet. “Can I wear your bracelet, Mother?”\n Caught in the breath of doom, she couldn’t bear to make Aven frown. “Not now, but someday, all right?”\n Aven circled her wrist with her thin fingers, golden like Selemei’s own, and sighed. “It’s so pretty.”\n Not the word she would have used. The rubies looked like drops of blood. She had no doubt what Xeref had meant by them: blood is precious. When she’d first begun her bleeding, Mother had taught her the same. In this age of decline, the noble blood of the Grobal Race was not to be wasted.\n Well, she hadn’t wasted it! Seven pregnancies in twenty years of partnership with Xeref. Five live births, four of the children perfectly normal. And while Pelli’s albinism might be recessive, it could do little harm here in the city-caverns. Their beautiful, brave Enzyel had just partnered into the Eighth Family to great acclaim. Meanwhile, however, the decline continued, and no success was ever enough—even success paid for in blood.\n Another trickle made her want to scream.\n “Off you go, now,” she said instead, lowering Pelli’s feet to the floor. The girl ran to her nurse-escort and patted the leg of his black silk suit. The escort frowned—his Imbati castemark tattoo furrowed between his brows.\n “Pelli,” Selemei scolded. “We don’t touch the Imbati. Are you a big girl?”\n “Big girl.” Pelli lifted her white hands away and wrung them over her head contritely. “Big girl.”\n “And who are a big girl’s hands for?”\n “Pelli.”\n “Ask if you want your Verrid to hold you.”\n Pelli’s lip trembled, but she managed, “My please?”\n “Of course, young Mistress,” the escort replied. He swooped her up in a twirl that turned the threatening tears into a cry of joy, and carried her from the dining room.\n Selemei sighed. Pelli was so big now. Perhaps if she’d been smaller, more dependent on the breast, this doom could have been postponed. To Aven she said, “Time to get ready for bed, darling.” Aven’s escort caught her glance and passed it to other Imbati of the Household, who quickly withdrew. At last even her sons Brinx and Corrim came to kiss her and excused themselves to their shared rooms.\n She had to speak now, while the blood could still protect her. She turned toward Xeref at the head of the table, but fear twined up into her throat.\n Xeref gave her an uncertain smile.\n Xeref’s Imbati woman moved, noticeable now as she left her station behind his shoulder. Imbati Ustin—tall, broad-shouldered, and muscular with her hair in several long braids that looked almost white against her tailored blacks—easily pulled out one of the brass chairs that stood empty between them. Xeref stood up, still smiling, and moved to the new seat. Then Selemei’s own manservant, Grivi, pulled out the chair beside his.\n Oh, to be close to him again!\n She couldn’t move.\n If she got close, they would kiss—if they kissed, they would make love—if they made love, she would get pregnant again—and even if she managed not to lose the pregnancy, there would be labor, and pain—not just pain, but pain like with Pelli. The screaming. The blank darkness. She’d wake up feeling like someone had dismembered her, her left leg dead to the hip, and this time, maybe her right, too. Maybe this time she wouldn’t regain her ability to walk. Or maybe this time she wouldn’t wake up at all.\n “Xeref, I can’t,” she blurted.\n “Selemei?”\n She stared down at her hands clutched in her lap, at the beautiful bracelet. The ruby drops looked dark in the shadow of the silk tablecloth. “I know blood is precious. I know my duty to the Race. But I just can’t anymore.”\n The guilt sharpened when spoken aloud. She tried not to imagine what words might come from his mouth in reply. Perverse—selfish—unworthy—\n Xeref cleared his throat. “Selemei?”\n Something touched her shoulder—oh, mercy, that was his hand! Her whole body clenched in on itself, hardened. Her chest felt like a geode, unable to admit breath, crusted inside with fear.\n Xeref pulled his hand away. “Oh, Selemei, my jewel, my life’s partner, my blessed Maiden Eyn—I’m sorry.”\n She shook her head. Tried to breathe.\n “Grivi,” said Xeref, “is she all right?”\n The Imbati made no answer.\n She could hear Xeref stand, pace the length of the table, but if she tried to respond, she’d only moan, or scream. Abruptly, he left through the bronze door to the sitting room; she could hear him out there, murmuring to his Ustin.\n “Mistress,” Grivi said in his deep soft voice, “I have vowed to protect you.”\n Her Grivi had helped her more in her recoveries than anyone, but could she really ask him to protect her from Xeref? Was that even possible? Would it mean she could never kiss Xeref again, never feel his arms around her? Did she really want such protection?\n She sipped a small breath. “I understand, Grivi, thank you.”\n Then Xeref came in. Selemei snapped her jaw shut.\n “My Selemei.” Xeref’s voice was husky, vibrating at the edge of control. He knelt beside her feet on the silk carpet.\n Elinda help me. Surely he wouldn’t demand to have her while she still bled.\n His breath grated. “I—Ustin said—you’ve—gnash it, Selemei, this is my fault!”\n What? She frowned.\n “It’s my fault. When Pelli was being born, I should have—I don’t know what I should have done. How could I listen to you scream and do nothing? I asked the doctors, but I only thought they would take away your pain, not that they’d—” He dragged a breath. “You went quiet so suddenly. I thought Mother Elinda had plucked your soul away, and my own heart too. And then when you woke damaged! And it was my fault!”\n She whispered, “But you didn’t do anything . . . ”\n Xeref shook his head. He grasped her hand, his fingers pale against her golden skin, and lifted it until her bracelet sparkled in the light. “I didn’t give this to you because blood is precious, Selemei. I gave it to you because your blood is precious. You are precious. I don’t care what the Family Council says, the Race doesn’t deserve your life!”\n She managed to look at him. His gray eyes, shining with emotion—his silver hair, falling to his shoulders. Age had given him creases around his eyes; as it had given him more substance, it had also granted him more dignity and determination. And more influence—he often reminded their boys that as the First Family’s representative on the cabinet, he had the Eminence’s ear.\n Yet he would put her first.\n “Xeref,” she whispered. “Thank you.” Her chest opened slowly. What would happen now? Was there a way forward over cracked uncertain stone?\n Xeref leaned close to her cheek for a kiss that barely touched her—the same kind of careful innocence he’d used when they’d first become partners, to soften the age difference between them. He cleared his throat. “My Ustin tells me that in the last couple of months you’ve been missing your friend, Tamelera,” he said. When she frowned in bafflement at the change of subject, he added, “Garr’s partner, who moved away with him to Selimna?”\n She couldn’t stop a smile at that. “Dear, I know who Tamelera is; I sent her a radiogram last week.”\n Xeref chuckled nervously. “Of course you do.”\n Selemei humored him. “Your Ustin deserves credit for turning her powers of observation to Ladies’ concerns. I do miss Tamelera. I could talk to her. We would play kuarjos together, and dareli, and we’d talk.”\n Xeref laid a hand against his chest. “I could—would you like me, to talk to you?”\n “Don’t we talk?”\n A blush turned his pale cheeks pink. “Well, we do.”\n Though never before about the terrible things—the real things. “Maybe you could tell me what you and Brinx were talking about?”\n Xeref smiled. “You can be proud of him. He’s really getting to know the workings of the cabinet. Cousin Fedron likes working with him.”\n “I saw how Corrim listens,” she said. “I’d say he already knows more than you expect him to.”\n Xeref nodded. “I can’t believe he’s almost twelve.”\n Selemei gulped. Corrim’s twelfth birthday would make him eligible for Heir Selection if the worst occurred. “Mercy of Heile,” she said, “is the Eminence Indal unwell?”\n “Oh, no!” Xeref waved his hands. “I mean, he’s well, of course he is. I’m sorry. I scared you, and I didn’t mean to.” He sighed. “This wasn’t how I thought this should work.”\n Selemei sighed, too. She and Tamelera had talked of anything, everything, deliberately avoiding any discussion of their duties to the Race. But when had she and Xeref last spoken of anything but family? She tried to think of something else; anything else. Her mind was as empty as an abandoned cave pocket. “I love you?”\n “I love you, too. My Selemei.” He sounded awfully disappointed.\n “Sir,” said Imbati Ustin, quietly behind his left shoulder. “I believe you enjoy a game of kuarjos?”\n Now hope lit his eyes. “Selemei—shall we play?” He offered his arm.\n She had been walking with more courage, recently, with less worry that her left hip might fail unexpectedly. She still stood slowly, and walked slowly, but it felt good not to have to grasp Xeref’s arm too hard. In the sitting room, someone—Ustin, most likely—had already moved the kuarjos set from its pedestal in the corner onto the slate-topped table between the couches. Selemei sat, arranged her silk skirts, and fell into anticipating potential moves for the long-haired warriors wrought in gold, who brandished antique weapons upon their posts at the grid intersections.\n Xeref turned the marble board so she had the emerald-helmed warriors, and he the sapphire. He opened his hands to her. “You go first.”\n She nodded. They played in silence, but when she executed her first entrapment, he glanced up at her.\n “Have you always been this good at kuarjos? How is it we’ve never played before?”\n She shrugged. “I played with Tamelera.” She took a deep breath. “Xeref, about—what we talked about—are you sure you won’t, or we won’t . . . ?”\n “We won’t. I promise.”\n “But what should I tell people, when they ask?”\n “They’ll ask?” He sighed. “Of course they’ll ask. Say we’ve decided not to.”\n She raised eyebrows at him. “They’ll blame me. And think I’ve insulted you. And that I’ve lost my mind.”\n “Then say it’s just not working.”\n “They’ll think I’m sick. The Family Council would investigate.”\n “Then say it’s my fault.” He frowned, shaking his head. “Not that I’ve rejected you, but that my health is to blame.”\n “Your health . . . you mean put your cabinet position at risk?”\n At that moment, a wysp entered through the stone arches of the ceiling: a tiny golden spark of light that spiraled down between them, casting a burst of warrior-shadows, then disappearing through the marble game board and table and into the floor.\n “Wysps are good luck,” Xeref said. “Maybe no one will ask you.”\n Selemei sighed. “Let’s play.”\n Nobody could be that lucky.\n Selemei put her hands on her hips, feeling uncomfortably like her own mother. Before her on the bed, Pelli frowned stubbornly down at her own small, nightgown-clad body—a too-familiar defiance.\n “Nap first, big girl,” Selemei said. “Your cousin’s party doesn’t even start for hours.”\n “Mama party.”\n “I’m not going. Your father will take you, with Corrim and Aven.” Staying home was the only way to be safe from questions, though writing letters while her entire family helped celebrate a cousin’s confirmation seemed—gnash it!—well, unfair. She blew out a breath.\n Pelli scowled.\n Selemei sat beside her. “I love you, Pelli. I promise you can go out, just lie down a bit first.”\n “Excuse me, Mistress?” Pelli’s Verrid said softly.\n She waved him off. “I’ll take care of it. Please, take a break, Verrid.” The Imbati bowed stiffly and withdrew through a door hidden behind a curtain. Her Grivi remained. When Selemei turned back to Pelli, her daughter’s lip was trembling dangerously. “Pelli, it’s all right, come here, I love you.” She held the girl’s head against her shoulder and rocked her. “Time for sleeping, just a bit of sleeping, nothing to do now, nothing, nothing, Mama’s doing nothing, not going anywhere, nap time for Pelli, Mama loves her Pelli.” She leaned over to deposit Pelli into bed, but Pelli clung, and Selemei had to catch herself with her elbow before she squished her accidentally. “Let go, big girl.”\n Pelli squirmed and whined.\n “Here, I’ll lie down with you.” It was difficult, because Pelli still wouldn’t let go, and her left hip twinged as she shifted to straighten it, and her gown hitched up above her knees. She grunted, but she’d often told Grivi she’d rather manage such awkwardness without his help, at least when she was alone. “There.” She kissed Pelli’s warm cheek. “Sleepy Mama, sleepy Pelli.”\n Pelli sat up.\n Selemei tightened her arm across her daughter’s lap. “Lie down, Pelli.”\n “Pelli party!”\n Gnash it! “You won’t go to the party at all, if you don’t sleep.” Looking up at her from an awkward position on the bed did not convey authority, and her leg was aching, and she didn’t want help. “Pelli, you will lie down right now because I told you so.”\n “No!”\n “You are a little girl, and little girls do as they’re told.”\n “Nooo!”\n “Gnash it, I’m your mother and I know what’s best for you. If you don’t think of your health, you’ll ruin your value to the Race!”\n Pelli started bawling.\n “Lie down!” Selemei heaved up on one elbow and pulled her down. Pelli thrashed. Her head hit Selemei in the cheekbone; her knee jabbed her in the stomach. Gnash it, gnash it . . . Grunting, Selemei struggled to grab the flailing limbs. Finally she managed to pin part of the bedsheet under her own body and wrap the rest of it over Pelli, to catch the hand that was hitting her in the head and tuck it under, to pin the sheet down with one hand on Pelli’s other side. Pelli roared with rage. Panting, Selemei held her there until fatigue drained the note of anger from Pelli’s cries, and she hiccupped to a stop.\n Hitching breaths. But, finally, sleeping breaths.\n Selemei carefully let go, even more carefully pulled her arm back.\n Oww . . .\n She collapsed facedown on the bed. Breathed, hard, aching everywhere. Her left leg twitched and twinged.\n Why did I do that? I wasn’t going to do that again. Not to Pelli. I should have let Verrid handle this, even if it was Imbati coddling.\n She turned her head and touched her lips to Pelli’s wet cheek; a hint of salt crept between them.\n She’s too much like me.\n Selemei sighed her head back down on the bed, and closed her eyes. It was easier just to lie here, not to try to move, just to imagine herself sinking through the mattress toward the stone floor.\n Curtains rustled, and a quiet change came to the air of the bedroom. A servant coming in, maybe Pelli’s Verrid. A long silence pulled Selemei toward sleep.\n Grivi whispered tensely, “We don’t need your interference.”\n Another long silence followed, but Selemei was fully awake now.\n Grivi whispered again. “Gentlemen’s servants should stick to politics. They always think everything is their business. I’m charged to safeguard her health.”\n And a higher voice answered. “But her health is politics. You know that.”\n Ustin’s voice? What was Ustin doing here without Xeref? She shouldn’t let them talk about her in her presence, but she’d never heard servants speak like this, and it was so hard to move. To interrupt Grivi in the midst of more emotion than she’d ever heard an Imbati express aloud? It seemed cruel.\n “I took the Mark in her name,” Grivi said. “My vow of service binds us two, alone. Will you compromise that with your selfishness?”\n “Such a question,” Ustin said, her voice level, disapproving. “I don’t know.”\n “You may be excused, Ustin,” said Grivi.\n A swish of curtains suggested Ustin was making a swift departure. Selemei carefully waited more than a minute, then shifted her head, and moaned as if she’d just awakened.\n “Grivi . . . ?”\n He helped her to turn over. She sneaked a glance at his face, his broad forehead illustrated with the manservant’s lily crestmark, but he wore the same patient, agreeable expression as always.\n It felt dishonest not to mention what she’d overheard. But she’d bumped up against Imbati secrets before, and heard that very same toneless I don’t know—if she brought it up, she’d only mortify him to no purpose. Guilty, she lay on her back and stared at the ceiling vaults, with Pelli’s head tucked underneath her right arm. In her sleep, Pelli turned, and her face pressed into the side of Selemei’s breast. Selemei fell into a doze, but woke again when a small warm hand found its sleepy way onto her belly. She patted it gently.\n “Mama,” Pelli murmured.\n “Sweet Pelli. I’m glad you had a sleep.”\n Pelli wriggled herself into a ball, bottom in the air, then lifted her head and placed it beside her hand so all Selemei could see was the fuzz of orange hair. Maybe she could hear tummy gurgles in there.\n “Am I your pillow, big girl?” Selemei asked.\n “Baby tummy,” said Pelli.\n “Yes, you were in there once.”\n “Pelli sissy?” Pelli turned her head, pale eyes wide. “Baby more?”\n Hurt, incredulity, indignation, flashed her skin hot. But it wasn’t Pelli’s fault. “No, no babies in there,” Selemei answered. Slowly, she sat up and gathered Pelli onto her lap. “Now, how about we get dressed and go to your cousin’s party?”\n “Mama party!”\n “Yes, I think we should all go together.”\n No place was safe from questions.\n Even with the help of their Imbati, they were not among the first to arrive. The noise of chattering guests already filtered through their host’s velvet curtains into the vestibule, where the First Houseman greeted them. No sooner had their arrival been announced when the six-year-old guest of honor burst through the curtain and barreled into Aven, Corrim, and Pelli, shouting,\n “I’m real! I’m real I’m real I’m real!”\n Selemei caught Aven with one hand before she could be entirely bowled over; with the other, she gripped tightly onto Imbati Grivi’s supporting arm. “Gently, Pyaras.”\n “Of course you’re real, young Pyaras,” Xeref chuckled, and ruffled the little boy’s dark hair. “Congratulations on your birthday.”\n “I’m real!” Pyaras’ waving arm had an odd smudge of red on it.\n “What are you saying?” asked Aven. “What’s on your arm? Blood?”\n “I’m not going to DIE like my mother!” Pyaras crowed. “I’ve been STAMPED! I’m real!”\n “Pyaras, will you cut it out!” said Corrim, trying to avoid being pummeled.\n Pelli jumped up and down and joined in the shouting. “Real! Real! Real!”\n “Go play,” said Selemei, and gave them a shove as the First Houseman pulled the curtain aside. “Corrim, if you want quiet, look for Tagaret and your older cousins in the private areas of the suite.” Pyaras and Pelli ran off together hand in hand; Corrim and Aven more slowly followed.\n Selemei shot a glance of sympathy at Administrator Vull, Pyaras’ father, who stood waiting to greet them. “Sorry about that,” Vull said, flushed in embarrassment. “Our doctor has a sense of humor—she stamped Pyaras as well as the confirmation papers.”\n “We’re just so glad to see him happy,” Selemei replied soothingly. “I’m sorry we missed the big announcement.”\n “The Pelismara Society welcomes him,” said Xeref. “The Race will benefit greatly from his life and health.”\n Vull’s face stilled a moment. He and his partner Lady Indelis had been seen as one of the Race’s great hopes until her death three years ago. Selemei sent thanks to Mother Elinda for placing her soul among the stars.\n “Come, Vull,” said Xeref. “Let’s go further in—I see some people I’d like to talk to.”\n Selemei squeezed her Grivi’s hand in preparation to walk in, but he rumbled, “Mistress, the public rooms are too crowded; visiting members of the Household have been invited into the servants’ Maze.”\n She held tighter. “Not yet, Grivi, please. Help me to where I can sit.”\n “Yes, Mistress.”\n She could have walked the distance by herself, probably. But navigating among gentlemen, fast-moving children, and the wide skirts of ladies was much easier with Grivi’s support. He settled her into a spot on one of the sitting room’s purple couches, then withdrew behind a nearby curtain. He’d hear her through the service speakers if she called.\n Half a breath later, a rustle of young ladies found her.\n “Selemei, it’s been too long!” That was Lady Keir, who had often joined her for a game of cards with Tamelera. Her golden skin was flushed, and her dark eyes a little too bright, though Selemei had never known her to drink. “Are you—” she leaned forward confidentially, braids swinging around her face, “—well? I mean, any news?”\n Selemei reached a hand toward her, and pretended the question was only an idle inquiry about her well-being. “No particular news, Keir. I’m quite well. And you?”\n Keir giggled. “I’m well, I’m well. Such an auspicious day, you know, I wouldn’t have missed it . . . ” Suddenly she seized Selemei’s hand, looking furtively around the room. “You must help me, I haven’t yet managed to get pregnant—Erex is very patient about it, but I’m dying to, oh, just looking at the darling children, it makes me so jealous—”\n “May Elinda bless you, dear,” Selemei said. “And may Heile keep you in health.”\n “By the way, I suppose you’ve met my friends? They would love to have your blessing, too.”\n Selemei did know the friends, who were only new to Keir because she’d partnered late, and moved from Third Family to First just this year. She squeezed all their hands and blessed them, though it hurt her heart. Keir was the oldest of the four, at twenty, and the only one without a history of pregnancy. None had yet borne a confirmed child.\n “I can’t believe this party,” one them muttered. “Pyaras is six! He’s been healthy as an Arissen since the day he was born. It’s showing off, that’s what it is.”\n Selemei looked over too late to see who had spoken, but she wasn’t about to allow the guest of honor to be impugned by comparison to a Lower. “Don’t you remember, Cousins, they had this party all planned three years ago?” she said. “When Lady Indelis miscarried?”\n Her words created an instant of excruciating silence. Everyone knew how that had ended.\n “I’m hungry,” Lady Keir announced suddenly. “Anyone want some of those delicious mushroom tarts?” She walked away quickly, the others fluttering and murmuring behind her.\n Selemei sighed. Her temper wasn’t steady today; maybe she should have stayed home. She stared at the purple piping at the edge of the couch, avoiding people’s eyes.\n “Selemei? My love?” A warm touch on her shoulder.\n “Xeref!” She took the hand he offered, and stood with relief. “Are we leaving?”\n Xeref frowned. “So soon? I wasn’t thinking to, I admit, but I couldn’t leave you looking so troubled.” His face was rueful. “Walk with me? I’ve been speaking with the First Family Council.”\n “All right—let’s not hurry.”\n She felt quite steady on his arm, walking through the cast bronze door into the dining room. Most of the men had gathered here, standing about in jewel-colored velvet suits and raising celebratory glasses of sparkling yezel. She only recognized three. Their host, Vull, wore aquamarine, while Xeref’s colleague from the cabinet, Fedron, wore emerald. The third man she recognized was Erex, Lady Keir’s partner, who wore topaz. He had pale skin and clubbed fingertips, and kept his Imbati woman near him even when all the others had stepped out.\n “Erex was just telling me he’s been promoted,” Xeref told her. “Arbiter of the First Family Council.”\n “Congratulations,” said Selemei.\n Erex bowed graciously. “A pleasure to see you, Lady. In fact, you are a paragon among us. All honor to your gifts to the Race.”\n “Good to see you, Erex,” she said. “I believe the Arbiter position will benefit greatly from your kindness. You’re welcome to seek out my children anytime to see how they are doing.”\n “Let’s not forget your organizational skills,” added Xeref. “It’s a heavy responsibility to monitor the health and continuance of the First Family. I’m sure you’ll do well.”\n “To all our benefit,” Selemei agreed. “Is it too early to ask you, Arbiter, how you assess the prospects of the First Family’s next generation?”\n Erex smiled. “Ah, in fact, not too early at all. I confirmed a new partnership arrangement just this morning. In fact, it’s doing quite well.” He blushed. “We’re all giving it our best efforts, aren’t we?”\n Today, in this home, the platitude was insulting. “Indeed we are,” she said. “Though some of us are giving our efforts, while others are giving up our health, and others, like Lady Indelis, have given their lives.”\n Vull looked stricken; Erex laid one hand on his chest, and Fedron exclaimed, “Lady!”\n “Am I wrong?” she demanded. “For the good of a boy like Pyaras, at least, I imagine you could think of some way to protect our mothers better. Aren’t you all men of importance?”\n “Lady, you have no idea how—” Fedron began, but Xeref grabbed his arm.\n “Excuse me,” said Selemei. She turned away too quickly, and her left leg twinged. She shifted to her right. She stepped again, and the leg didn’t buckle, but suddenly she was wobbling and couldn’t seem to correct it. Worse, by now she was out the door where the only things to grab onto were random party guests. She hopped onto her right foot and managed to stop in an utterly undignified manner.\n Out of nowhere a pair of hands steadied her—strong wiry hands, attached to arms in pale gray sleeves. A pale gray coat marked the Kartunnen caste. Selemei looked up and found she’d been rescued by the confirming doctor. The tall woman had painted her face, as only the Kartunnen did: she had black lines on her eyelids and light green on her lower lip. Her coat flared to her knees, and was finely embroidered with designs in the same light gray.\n “Thank you, Kartunnen,” Selemei said.\n “Please excuse my imposition, Lady.” But the Kartunnen didn’t immediately let go.\n “I’m all right,” Selemei insisted. “I can stand.”\n “Yes, Lady.” The doctor folded her arms, tapped her fingers, took a breath as if to speak, but let it out silently.\n “Thank you for being here,” Selemei said. “You made Pyaras very happy with that stamp.”\n “He’s worth the trip, Lady,” said the doctor. “I’d take six of him over anyone else here.” Her half-green smile pulled sideways. “Except maybe that poor desperate girl.”\n “What do you mean?”\n “Nothing really. If you’ll permit, Lady, I’d prefer to talk about you. Have you had therapy for that leg?”\n She shouldn’t have been surprised. Kartunnen’s specialized education made them audacious. “Of course,” she explained. “My Grivi and I worked on it. He helped me immensely.”\n The doctor nodded. “I believe you should consider finding a proper Kartunnen therapist. With respect, women’s Imbati receive quality medical training, but sometimes they can be . . . too close to you, to see things clearly.”\n How should she respond to that? Was that presumption? For a doctor to speak that way of a Higher like Grivi? But what if she was right?\n “How long has it been since your injury?” the doctor asked.\n “Two years.”\n The doctor lowered her voice. “Pardon, but if it were me, I’d try not to get pregnant until I’d had it looked at.”\n Now, that was most definitely presumption. “Oh, it’s that simple, then, is it?” Selemei snapped.\n People in the crowd around them turned to look. The doctor bowed formally, and spoke toward the floor. “My sincere apologies, Lady.”\n The urge to have her thrown out lasted only a split second, replaced by perverse curiosity. This doctor could answer questions. Selemei gathered her composure and smiled, her heart pounding.\n “Well, that’s all right, of course, doctor,” she said. “No trouble at all.”\n Deliberately, Selemei looked away toward a wysp that had drifted in. The bright spark was no larger than her smallest fingernail, and moved aimlessly, caught in the wake of one person’s movement, then another’s, casting twinkles through the gathering. Younger children pointed and grinned at it, while the older ones mimicked the adults’ casual ignorance. Selemei waited until nearby conversations gradually resumed. The doctor still watched her warily, and threaded a strand of red hair back behind one ear. When it seemed safe enough, Selemei stepped closer.\n “Doctor,” she whispered. “Is it that simple? For—” she almost said for Lowers, but stopped herself. “For someone like you?”\n The doctor gritted her teeth. “Will you have me punished, Lady?”\n “Certainly not. May Mai strike me.”\n “There are many ways, but here are three,” the doctor said, and counted on her long fingers. “One, exemerin. Two, ambnil. Three, swear off men.” Her eyes flitted briefly across the crowd, and she smirked. “Easier for some than for others.”\n “Thank you, Kartunnen.”\n “Everyone!” a voice shouted. A series of quick claps cut through the murmur of conversations. “Everyone, we have an announcement!”\n Selemei turned. The men from the dining room were emerging, Vull and Xeref in the lead.\n “I’d like to thank Vull for hosting us on such an auspicious occasion,” Xeref said. “A healthy boy joins us in the Pelismara Society with his proud father looking on. But in my heart, I can’t help but wonder, and perhaps you have, too, my cousins—how much more auspicious would this day be if Lady Indelis could be here?”\n A sigh swayed the crowd; Vull nodded, pressing a fist over his mouth.\n “Too many mothers give their lives in the name of the Race,” said Xeref. “The First Family could grow stronger and happier if they were still with us. That’s why Fedron and I will be bringing a new proposal to the Eminence, in the name of Lady Indelis. Our proposal will allow women whose lives have been endangered in childbirth to retire from their duties to the Race and dedicate themselves to the upbringing of their families. We appreciate your support.”\n The crowd broke into murmurs—some shocked, but it seemed, some approving.\n Xeref made his way to her side and took her arm. “Are you ready to go home, my love?”\n “Yes, please!” Just look at the childlike mischief in his eyes . . . She managed to suppress a grin, but couldn’t help glancing at him, over and over. When they passed the wysp on their way into the private rooms to gather children and servants, it seemed similarly attracted by his energy; it swirled around and through his coattails, not drifting off until they’d left the party and started down the hall toward home. As soon as no one was looking, Selemei’s grin escaped to her face.\n Me, legally retired? Ah, Xeref!\n Of course, it was always challenging to get the children settled after the excitement of a party. Selemei kissed Corrim goodnight, fingering a lock of his hair. Now that he was eleven, he professed himself too old for such intimacies, but she’d get away with it as long as she was able. Such soft, soft curls—the perfect cross between Xeref’s straight hair and her own.\n “Mother?” Corrim turned his head, pulling the curl from her grasp. “Has Father made a lot of laws?”\n She frowned. “I think so.”\n “Which ones?”\n “He’s participated in votes for all of them. I’m not sure how many times he’s proposed his own; you should ask him.”\n “Do you think the Eminence Indal will like this new one?”\n She should have known he’d hear; rumors were as swift and unquenchable as wysp-fire. “I hope so.”\n “When is Brinx coming home?”\n Selemei glanced to the other brass-framed bed, which the Household had perfectly arranged with sheets turned back for whenever her eldest returned from his evening with friends. “Late, sweet boy. Please don’t wait up.”\n Corrim grunted, but when she leaned down to him, accepted a kiss.\n “Mistress?” came a disembodied voice from behind the servants’ curtain. “Please, Mistress, if you would attend your daughter?”\n Oh, no. I could have sworn Pelli was sleeping like a stone . . . “I’m on my way.”\n Selemei walked on her Grivi’s arm into the hallway, and together they hurried to the girls’ room. He pulled open the heavy bronze door for her.\n Mercy . . .\n Pelli was sleeping like a stone, arms and legs flung wide, her covers tossed off and her pillow on the floor. The muffled sobs came from the other bed.\n “Aven?” Selemei whispered.\n Aven sat bolt upright, still sobbing, and reached for her with both hands. Selemei limped to her bed and sat down. Aven’s hands clutched hard enough to hurt, and she wormed into Selemei’s lap.\n “Aven, my sweet Aven, what in the name of mercy?” Selemei murmured, stroking her back. “I’m here, everything’s all right, I promise. What’s wrong?”\n Aven sobbed something into her shoulder.\n “I don’t understand.”\n “Mama, you almost died!”\n Mercy, indeed. She’s so smart. For a second, it hurt to swallow. “My darling,” she managed, “that was about Lady Indelis.”\n Aven pulled back and scowled, sobs turned to outrage. “No it wasn’t.”\n “All right, I’m sorry. I’m sorry, you’re right.” She found Aven’s hands and gave them a tug. “But I didn’t die. By Elinda’s forbearance I’m here now, sweet one, and I love you.”\n “It’s not fair.” Aven’s arms lifted from her waist to drape over her shoulders, and the girl nuzzled into the crook of her neck. “Why do we have the decline anyway, when Lowers don’t?”\n “I don’t know, love.” Every parent faced this moment. Somehow it never got any easier, even after going through it with each of her older children. “I guess, we have to remember that each of us has our time. We can take good care of ourselves, but we don’t get to choose. Some people are never born. Some are never confirmed, and live hidden. Some are here one day and gone the next. My mother used to tell me that Mother Elinda loves the Race the most of all the people of Varin, and puts us in special constellations.”\n “That makes no sense.” Even her daughter’s voice was frowning. “Mother Elinda puts souls into us, she doesn’t just take them out. If she really loved us, she’d give us babies to end the decline, not kill us.”\n “Sweet one—”\n “And how do we know the people who die are in the sky, anyway? It’s the sky.” She waved an arm toward the vaulted stone ceiling.\n Selemei could feel all four levels of city and rock above. Only travelers, Venorai farmers, and Arissen firefighters ever saw the sky; it was a long way up to the gods her mother had wanted her to believe in.\n “I suppose we don’t know,” she sighed. “But we do have Imbati and Kartunnen who care for our health. And if your father passes his law, then fewer of us will die.”\n Aven shook her head. “Mama . . . ”\n “Please, darling, don’t worry. Come here.” She pulled Aven in again, and leaned against her springy hair. Across the room, Pelli sneezed in her sleep and turned over, apparently unaware. Could they be saved? And what about her firstborn daughter, Enzyel, whose trials were already beginning?\n A click came from the door latch; Selemei looked up. This was Xeref, sticking his head in. What did he want? She raised eyebrows at him.\n Xeref didn’t call for her, but came in and sat with them on the bed. She had no idea what he intended until he wrapped his arms around them both. After a moment’s surprise, she relaxed into his shoulder. Aven, too, seemed comforted.\n When at last Aven began to nod off, Selemei nudged Xeref until he stood, then returned her daughter’s head to the pillow and tucked her in.\n Xeref offered her a hand up. She took his arm, and walked with him slowly out the door.\n In the hall, the light of the sconce fell across his features. Untouched by Aven’s fear of death, he looked quite as delighted as he had at the party this afternoon. Her own excitement welled up again. She seized his hands between hers.\n “Xeref, thank you,” she said. “What this means to me—I can’t—” She pressed his hands to her heart, and then to her lips. They unfolded warm and soft to cup her cheeks.\n Xeref bent close to her. “I had to do it.”\n She turned her face up and kissed him. How could she not? His lips were so sweet, and it had been so long! His mouth opened into a whole world where they existed only for each other. She tried to put her body and soul into that sacred place, and only when she gulped a breath did she realize she was already undressing him in her mind, while he pressed against her, eager and proud with the desire that had never dimmed.\n The desire that could kill her if it were fully satisfied.\n She pushed him away, gasping.\n “I—I’m sorry,” he stammered. “I didn’t mean to—”\n “Go away,” she cried. “By Sirin and Eyn, please!”\n His face full of pain, Xeref staggered away and vanished into the master bedroom.\n All the inner parts of her tugged after him, but Selemei did not follow.\n Naturally, rumors about Xeref’s proposal were everywhere. Selemei had discovered a new talent: extinguishing conversations faster than atmospheric lamps at nightfall. No question in her mind what the talk was about. However, she’d prefer to know how far the information had changed, and how those changes might reflect on the First Family.\n There was only one possible course of action.\n Any lady of intelligence developed tools for unlocking the truth. Today was a day to employ her favorites: soothe the spirit with tea, amuse the tongue with cakes, and tease the honesty out. The Household had already completed arrangements in the sitting room: white silk cloth over the slate-topped table, silver spoons, teacups of silver-rimmed glass. Considering the delicacy of the topic, Selemei had chosen to invite only one friend from the Ninth Family and one from the Eleventh, both Family allies. Now all she needed—\n “Excuse the interruption, Mistress,” the First Houseman said, stepping from behind his curtain, “But your cousin, the Lady Keir, wishes to speak with you.”\n “Now?” Selemei pressed a knuckle to her lips. Should I turn her away? Or let her see preparations meant for others? “I’ll come to her,” she decided.\n On Grivi’s arm, she walked to the vestibule where she ducked around the edge of the velvet curtain. Keir stood waiting, twisting her golden hands even more tightly than the twists her Imbati woman had made in her hair.\n “Cousin?” said Selemei. “Are you all right?”\n “Is it really true?” Keir asked. “About what Xeref is planning?”\n What had she heard? One hour later, it might have been easier to answer. “Only what he announced at Pyaras’ party.”\n “But that’s awful.”\n “Awful? What do you mean?”\n Keir wrung her hands. “Well, do you think it’s fair? That we have to almost die before we can get out of it? And what does that even mean, ‘almost’?”\n What? Get out of it before you’ve even started? Shock stole her ability to speak the words. A good thing, too, because behind that automatic protest loomed an intimate recognition as terrifying as a glimpse of sunlight. Selemei swallowed hard.\n “Oh, Keir—cousin.” She took a deep breath. “How difficult it must have been to come to me with your thoughts. Thank you for trusting me.” She opened her arms, and Keir embraced her. Selemei resisted the urge to stroke her like a child. “I know how difficult this is. I can’t imagine what you’ve heard out there.”\n Keir sighed, but unfortunately, didn’t give any hint of what she’d heard.\n Selemei drew another steadying breath. “So, I’m thinking—today, in a few minutes, I’ll be speaking with some friends about this. If you’ve no prior commitments, then perhaps you would like to join us?”\n “Oh!” Keir pulled back, dabbing her cheeks with her fingers. “I’d love to! Which friends? Do I look like I’ve been crying?”\n “No, please, don’t worry about that. I’m expecting Lady Ryoe of the Ninth Family—she’s always been a great comfort to me during my recoveries—and you know Lady Lienne of the Eleventh Family from our games of dareli.”\n “Does Lady Ryoe play?” Keir asked. “Since we’re missing a fourth?”\n “Well, not today, all right? You may freshen up in my rooms as you like. The others will be here in a moment.”\n Keir bustled off at once, but her long-haired manservant stayed behind.\n “Imbati?”\n “Your pardon, Lady,” the Imbati curtsied, inclining her tattooed forehead. “Your generosity in this invitation is much appreciated, but I must express concern.”\n “About Keir?”\n She leaned her head to one side. “My Mistress decided to visit you because she is deeply moved by this topic. I fear that in conversation she may become . . . impassioned, even in the presence of outsiders.”\n And possibly risk Family secrets. Selemei nodded. “I understand. I’m already planning to tread carefully. I’ll protect her, I promise.” The servant bowed and followed her Mistress deeper into the suite.\n Selemei sent her Grivi to the dining room to speak with the Household Keeper about how to accommodate an additional guest. He’d only just stepped away when the doorbell rang again. The First Houseman emerged from the vestibule, seeming perturbed to find her unattended.\n “Is there a problem?” she asked.\n “Mistress, your other guests have arrived, but they’ve brought a companion. Lady Teifi of the Second Family.”\n Selemei frowned. This could not be coincidence, and it would be rude to confront the motive of an unexpected guest. If she pushed ahead in her own inquiries, was rockfall inevitable? To protect Keir, should she give up on her questions altogether?\n “They are all welcome,” she said. She took a deep breath, weighing the words “tell,” “inform,” and “alert” for how far to mobilize the Household. Best to be cautious. “Please alert the Household to the change of plan.”\n “Yes, Mistress.”\n Grivi returned swiftly, apologizing for his absence at a critical moment; Selemei reassured him and allowed him to escort her to her seat. She kept sharp eyes on her guests as they entered. Lady Ryoe wore a smile that sparkled like the ruby pins in her sandstone hair; she came close for a kiss on the cheek before she sat down in the chair at Selemei’s left hand. Lady Lienne’s walk was tight; so also her mouth, and her gray sheath gown; she whispered close to Selemei’s ear.\n “My sister insisted.”\n Selemei looked past her shoulder to Lady Teifi, who was taking a seat on the facing couch. She and Lienne did resemble each other, though Teifi’s long straight hair was sifted gray instead of pure black. Selemei kissed Lienne’s cheek.\n “You’re both welcome. Please, have a seat. Our Household Keeper will be pleased to know that her tea cakes are held in such high regard.”\n Under the watchful gaze of her younger sister, Teifi returned the smile, but the faint blue tinge of her lips matched a chill in her eyes. “I wouldn’t have missed them.”\n Keir entered then, through the double doors from the back of the suite. She hesitated a moment at the sight of Lady Teifi, but there was only one chair left, at Selemei’s right. She took it, flashing a nervous smile. “I’m Selemei’s cousin, Keir. Had you already started talking about it?”\n “Not at all,” Selemei said quickly. But when it came to proposing a less fraught topic of conversation, her mind whirled and came up blank.\n Fortunately—showing impeccable timing—the Household Keeper appeared in her black silk dress, carrying the cakes. Her presentation was never the same twice; today she brought a sculpture of a fountain, five crystal spouts rising to different heights from a slate basin below. Atop each spout balanced a glass bowl delicate as a bubble, and inside each bowl lay a pearl-white cake garnished with a single red marshberry. Selemei herself could not help joining in the general sigh of admiration. Tea-pouring and the passing of cake bowls extended her reprieve, while the conversation turned to sweets, art, sweets as art, and where to find the most skilled Keepers. Selemei pressed her fork into the pliant surface of her cake, dared a bite. But every pause clutched at her, begging to be filled with harmless normality.\n Here was a topic that might be harmless enough. “By the way, those are lovely hairpins you’re wearing today, Ryoe.”\n Ryoe chuckled, licking berry juice from her lips. Her pale hand fluttered up to her hair. “Rubies are the gem of this year, Selemei. We’re all wearing them—even you.”\n “Me?” Her own dress was sapphire blue, but then she remembered the bracelet on her wrist. Lienne wore rubies on the neckline of her dress, Teifi wore them in a band down the center of her bodice, and Keir wore them in a spiral brooch at her shoulder. Selemei’s confidence faltered.\n We’re wearing blood. All of us.\n She tried to cover her consternation with a sip of tea, but too soon; it burned her lip. Nothing could be harmless when the truth hid everywhere. She set down the cup.\n “All right, I know what you’re all here for. You want to know about Xeref’s proposal, and I want to know what you’ve heard, and how you are thinking about it.” To protect Keir, she assumed her cousin’s argument like a cloak: “Personally, I don’t think it goes far enough.”\n Keir sat straighter. “You don’t? But I thought you said—”\n “What a thing to say!” Teifi cried.\n Selemei smiled, carefully, and folded her hands on her lap so they wouldn’t shake. She could handle this; it wasn’t the first time she’d been the target of all eyes at once.\n “I’m not afraid to say it,” she replied. “Xeref wants to prevent deaths like that of Lady Indelis. He thought the best way would be to allow ladies who had come close to death to retire from their duties. His intent is not to hasten the decline, but to allow ladies to raise their own children—and actually, also, to allow them more recovery time from birth injuries before they must consider pregnancy again.” That was a good idea! Sometimes she surprised herself.\n “Birth injuries.” Lady Keir shuddered visibly. “Mercy of Heile.”\n “I understand your fear, Keir,” Selemei said reassuringly. “That’s why it’s important to allow time for complete recovery. After all, a healthier mother will bear a healthier child.”\n “It won’t work,” said Lady Ryoe. The reminder of blood glinted from her hair as she shook her head. “I mean, retirement sounds good, but who’s going to enforce it? We can’t send Arissen guards into bedrooms.”\n “That’s true,” Selemei admitted.\n “Then—forgive me—who is going to tell our gentlemen no?”\n Selemei winced. Her heart wanted to protest, but how recently had she tasted this fear, despite how deeply she trusted Xeref? She almost looked over her shoulder at Grivi. “Well. We’ll just have to think of something, I imagine. The wording of the proposal hasn’t been finalized yet.”\n “This is ridiculous,” Lienne muttered. “Lowers have children when they want to.”\n “Lowers, ugh!” Teifi grunted. “There are plenty of them.”\n Lienne’s pale cheeks flushed. “Having too many children is killing us, Teifi, and it still isn’t stopping the decline. If we’re all going to die anyway, do we have to be miserable while we’re doing it?”\n “Lienne,” said Ryoe, “I had no idea you were so upset. Is something wrong?”\n “What’s wrong is that you’re even considering this nonsense,” Teifi said. “Politics is gentlemen’s business.”\n “But this is about our lives,” protested Keir.\n “And it’s our children who stand to lose their mothers,” said Lienne.\n “I can’t believe you, Sister,” Teifi hissed through her teeth. “That you’d associate yourself with selfish cats who would turn their backs on the future of the Race!”\n “Teifi, stop!”\n Selemei spoke measuredly into the shocked silence that followed. “I don’t believe it’s selfish to try to understand the impact of the rules that gentlemen impose on our lives. The fact is, the proposal in its current form was my partner’s idea, and it’s uninformed in many ways, and incomplete. This is why it’s so important for us to discuss it.”\n “The Race requires a higher form of loyalty,” Teifi said. “These are the burdens of power.”\n “Oh?” Selemei asked, clamping down on a surge of anger and forcing a smile. “And would you like to tell us about the number and health of your children, then? How your sacrifices have rewarded you with success?” She’d heard enough about her from conversations with Lienne and Tamelera to know that Teifi couldn’t answer that.\n A muscle tightened in the older woman’s jaw.\n Lienne threw a keen glance at her sister, and stood up. “Selemei, I’m so sorry, we’d better go.”\n She took a deep breath. “Darling, what a shame.” She squeezed Lienne’s hand, trying to catch her eye. “Please let’s talk another time.”\n Lienne and Teifi’s swift departure left the other guests in a fluster, and they soon excused themselves, also.\n “Is there tea left?” Selemei sighed.\n Imbati Grivi lifted the pot, nodded, and refreshed her now-cooled teacup. Selemei sighed, pressing its edge into her lower lip, inhaling the steam. In a way, the utter failure of her subtlety had taught her what was out there—fear, despair, thirst, fury, and lots and lots of arguing. Keir had come out unscathed, at least.\n But her own satisfaction with Xeref’s proposal had not. Teifi demonstrated that any legislation of this nature would be strongly resisted; and Ryoe was correct that gentlemen would seize upon any excuse to dismiss restrictions on their behavior, even if it passed.\n “Grivi,” she said, “how soon can we be ready to go out?”\n “I know of nothing that would prevent us going now, Mistress.”\n “I need to discuss this with Xeref. Our proposal needs some revisions.”\n Once she had given herself permission to go to Xeref’s office—this was official legislative business, after all—her resolve outpaced her ability to walk there. Selemei left the suites wing and began to cross the central section, but her left hip twinged; she squeezed her Grivi’s hand for a pause. By the tall bronze doors of the Hall of the Eminence, she cast an eye about, but saw only Imbati child messengers flitting through, and Arissen guards, powerful and still in their orange uniforms. No one to care if she shook her leg a bit.\n After a few seconds, she tested her weight on the foot. Workable. A bit more slowly, they crossed into the offices wing. Xeref’s was the first door on the left.\n All five young men in the front office stopped what they were doing as she walked in. One of them was her son, Brinx. He sprang up from the steel desk he’d been leaning on, and straightened the hem of his malachite-striped coat.\n “Mother? Holy Sirin’s luck!” he exclaimed, grinning. “Fedron sent me over here only ten minutes ago; we’ve been going over the minutes of the last Cabinet meeting. If you’d come five minutes earlier, I’d have been busy; five minutes later, and I’d have been back next door.” He kissed her cheek. “Would you like to come see where I work?”\n Selemei smiled. As a child, Brinx had told stories to her for hours—even conversed with the vaulted ceilings when no one else was available. These days, she was seldom the recipient of that bright attention.\n “I’d love to, treasure, but I’ve come to see your father.”\n Brinx pulled a sober face. “Of course. Shall I take you in? I don’t think he has another meeting for at least sixteen minutes.”\n “Yes, please.”\n Brinx resumed bubbling while she followed him to the inner door. “You’re lucky that he’s in there by himself right now. He’s had all sorts of meetings today, and messengers—we’ve gotten five of them at least. Six, I think, actually. Yeah, six. It’s because of the stir, of course. The one Father started when he announced his Indelis proposal. We’ve never been so busy—” He pushed the door open a crack. “Sir? Father, Mother’s here.”\n “Selemei? Come in, come in!” Xeref came to her quickly; his blue eyes searched her with concern, but when she smiled at him, he brightened. She released Grivi’s hand to take his.\n “Everything’s fine, dear,” she said. “I need to talk to you about the proposal.”\n “I hope you’re not worrying, Mother,” said Brinx. “Our conversations are going well.” He raised one finger. “‘Give them the respite, gentlemen. Think first of the health of your partner if you wish a healthy child, and the blood of the Race will grow stronger!’”\n “We don’t vote for another week or so,” Xeref explained. “This is the part where we sound people out and argue for the idea. Our most powerful argument is exactly what Brinx says, and people are responding well to it. I’m optimistic.”\n Hearing her earlier thought put so differently made her doubt any of these gentlemen were serious about real retirement. “Have you changed any part of the proposal?” she asked. “Added anything?”\n “No. Why do you ask?”\n “Well, have you talked with anyone about how to enforce it?”\n “Mother, don’t worry,” said Brinx. “Kartunnen will do as they’re told.”\n Kartunnen? She flashed him a look. “It’s not them I’m worried about, Brinx, it’s the gentlemen. No one will want to give up their chance to benefit the Race. They’ll cling to excuses.” The incredulity on his face forced her to search for examples that filled her with distaste. “No, she wasn’t injured enough; or, no, we had a good doctor so she wasn’t really in any danger.”\n Brinx pursed his lips into the same wanting-to-protest moue that he always had as a child. She rolled her eyes and turned to her partner.\n “You know they will, Xeref.”\n Xeref looked at her in silence for a moment. “Yes,” he sighed. “I imagine they will. Should we specify that the doctor must have assessed the risk of death at greater than fifty percent?”\n She shuddered. “Do Kartunnen do that? Isn’t that . . . heartless of them?”\n “Not every time, I don’t imagine.”\n “Fifty percent seems low,” put in Brinx. “Maybe it should be sixty.”\n “Brinx,” said Xeref, “you might want to think carefully before you say something like that. I wrote the proposal for your mother.”\n “Wasn’t it for Lady Indelis?” Brinx exclaimed, but his face fell quickly from puzzlement to shock. “Oh. Mother, I’m so sorry. I had no idea.”\n Selemei found his hand and squeezed it. “Well, you can see, can’t you, why we can’t have this be negotiable?”\n “I see what you’re saying,” said Brinx. “The problem is, negotiation is exactly what this part of the process is for.”\n “But, treasure, that’s what I’m doing right now. Negotiating it.” Selemei turned back to Xeref. “How many men do you know who would be willing to bargain the continuation of their families against their partners’ lives? How many are doing this already? Speaking over a doctor’s word in the name of ending the decline?” Xeref was too frustrating in his silence. “Xeref,” she insisted. “You know how easy it is to speak over a doctor’s word. How dangerous it is.”\n “Father, did you—” Brinx began, but Xeref raised his hand and stopped him with a glance.\n “Selemei, my jewel, you’re right. But no one will agree to give up such power to Kartunnen.”\n “The power doesn’t need to be in the Kartunnen,” she explained, carefully restraining her tone. “Neither should it be; as Lowers, they lack final authority. Put this in the law itself. Make a list of risks, of injuries, and how serious they are. Take it out of everyone’s hands, as if it were the will of Elinda.”\n “Father, you’d still have to get the list from a Kartunnen,” said Brinx.\n “Brinx, I know how to get lists from Kartunnen,” Xeref replied, and Brinx blushed. “Thank you, Selemei. I’ll send my Ustin tomorrow morning.”\n “Come see my desk, Mother,” said Brinx.\n “I’m not finished, though,” Selemei said. “There’s another problem. A more serious one. A more private one.”\n “Which one?” Xeref asked.\n She squirmed inside. Might this be easier to discuss if Brinx weren’t here? Possibly, but saying ‘rape’ was awful, regardless. She dodged the word. “Well, we’ve talked about the will of Mother Elinda, but we haven’t spoken about her partner.”\n “Father Varin?” Brinx raised his eyebrows. “Do you mean what punishment to levy for transgression? That’s for the joint cabinet to decide.”\n She sighed. “Brinx, love, I’ll lend you my copy of the Ancient Stories when your brother has finished reading it.” Selemei opened her hands to Xeref, who was staring at her silently, with a wrinkle deepening over his nose. “Remember, Father Varin gnashes the wicked in his fiery teeth in atonement for his own transgressions.” Still, no recognition in Xeref’s eyes. “The transgressions that led Mother Elinda to reject him.”\n “Oh!” Xeref cried suddenly. “But that’s . . . oh, that’s—oh dear.”\n “Father, what?”\n “But Selemei, would they really?”\n What a question! She turned it around. “Perhaps you mean to ask whether gentlemen would really be willing to sacrifice their desires for their partners’ safety? Some would—you would. But most gentlemen are not you. Must I speak with the ladies of the Pelismara Society to give you a number?”\n Xeref ran one hand through his silver hair, uncomfortably.\n “What are you talking about?” Brinx demanded.\n “Master,” said Imbati Ustin. “I can verify, by Imbati witness, three rapists among those First Family gentlemen known to me. If you wish it, I can investigate and expand my knowledge to assess the scope of the problem across the Pelismara Society. It could have a substantial impact on this proposal’s implementation.”\n In the Imbati’s icy voice, it felt terrifyingly real. Selemei swore. “Name of Mai, who?”\n “I don’t know, Mistress, I’m sorry.”\n Selemei gaped at her. For whom was she protecting that information? Would she tell Xeref if he asked?\n Brinx, who had been spluttering, found words. “Father, you must reprimand your Ustin.”\n “You think so?” Xeref narrowed his eyes. “Why is that?”\n “Accusing her betters of such a thing! I can’t think of anything more presumptuous.”\n “Brinx,” Xeref said slowly, “Please think what you’re saying. Ustin has worked as my personal and political assistant and bodyguard for twelve years. In all that time she has never failed to safeguard me or my information, nor have I caught her in any inaccuracy. Her qualities are guaranteed by the certification of the Imbati Service Academy, just as your servant’s are. And this information is quite relevant to our success.”\n Brinx flushed. “I know. I’m sorry, Father. And I do really want to help you pass this proposal.”\n “If this is uncomfortable for you, why don’t you just let me talk with your mother? Fedron’s got several people he’s negotiating with, and I’m sure he’d appreciate your help right now.”\n “Yes, of course, Father. I’ll see you at dinner.”\n It was quite common for a room to feel silent after Brinx stepped out of it, but this silence was one Selemei hesitated to step into. Her mind whirled in horror and suspicion of the men she knew. Xeref stared into the distance, dismay written deep into the lines of his face.\n “This . . . ” He sighed. “I don’t know.”\n That was not what she’d expected him to say. “What don’t you know?” she asked. “I had no idea this was such a huge problem. The question is, how do we address it?” She looked to his Ustin for support, but Ustin didn’t speak. The manservant’s mark arched across her pale forehead like the bars of a closed gate.\n “No, Selemei,” Xeref said. “We can’t address it.”\n “Why not?”\n He rubbed his forehead. “This is a legislative proposal, which will be discussed and voted on by the cabinet. We can’t lose sight of that. Proposals with divided goals fail, even when their goals are entirely ordinary. And . . . I really don’t want this one to fail.”\n Oh, gods, if it failed! She gulped a breath. “I need to sit down.”\n “I’m sorry, love,” said Xeref. “By all means.”\n Grivi was swift to deliver one of the metal chairs that faced Xeref’s desk; Selemei sat with relief and tried to gather her thoughts. This proposal no longer felt like it was about her, but about Ryoe, Lienne, and Keir—and about her own daughters. To fail would be a disaster. But what if they succeeded, and the law were meaningless to those who most needed it?\n “Ladies are vulnerable,” she said quietly.\n “You’re right,” Xeref agreed. He took the other chair, which Ustin brought for him. “As Lady Indelis was vulnerable.”\n “Or as I was,” she said. “In a medical center, helpless to the wishes of doctors and family.”\n He shook his head. “I’m sorry.”\n “I’m not angry,” she assured him. “But some ladies are also vulnerable at home. And we can’t send Arissen into bedrooms to enforce this law.” The very idea was appalling.\n “Imbati are already there,” Xeref mused. “But we don’t want to put such power in the Imbati, either.”\n She raised her eyebrows at him. “Dear, it’s hardly a reasonable demand on them, even if we did.”\n “True.”\n Selemei ran her eyes about the office as if the answer might be hiding here somewhere, hanging among Xeref’s numerous certificates or tucked between the law books on his shelves.\n “Wait,” she said, “even if we can’t do anything about the gentlemen, this proposal aims to prevent dangerous pregnancies. So, what about the medicines?” What had that Kartunnen mentioned at the party? Amb—something . . .\n Xeref looked like she’d stuck him with a pin. “Those are illegal.”\n “So? We’re proposing a new law, aren’t we?”\n “A gentleman would never consent to compromise his fertility.”\n “I would, if it meant I were never put at risk again.”\n He blinked at her. “You would?”\n “Isn’t that what we already decided?”\n Xeref didn’t answer, but shook his head in consternation. Then, beside her left ear, Grivi rumbled in his throat.\n “Yes, Grivi?”\n “Mistress, you should be aware that contraceptive medications, when properly used, have no permanent effect on fertility.”\n “Well. All right, then.”\n “Even for Grobal?” Xeref asked.\n “I know of no genetic contraindications, sir,” said Grivi.\n “I’m just not sure anyone would agree to it. Could one really ask a man to waste his value to the Race?” Xeref frowned at the floor, and began cracking his knuckles, one after the other.\n She realized, then. He was frightened. “Dear—what if we tried it?”\n He twitched, and shook his head. “You’re suggesting—no. I could never ask my Ustin to procure something illegally.”\n “Master,” said Ustin, “I can procure something for myself with perfect legality.”\n That was it! Ustin was a woman, and would have done this before. Then all she’d have to do was get her hands on it, and then . . .\n Selemei put her hand over Xeref’s and squeezed. “Think of it.”\n The triangular white pill was small, almost indistinguishable from the marble of the bathroom counter. Selemei forced herself to see it, to confront it, to confront what she had to do. Grivi’s unwillingness to aid her in any aspect of the medication only magnified her sense of transgression. After seven days, it had become no easier.\n I am not harming anyone. I’m doing this for Enzyel, for Aven, for Pelli—and for myself. The Kartunnen have deemed it safe. Imbati Ustin herself has used this. A Grobal is not so different from a Lower that it will affect me differently. It is not harming me.\n It is not harming me.\n She swept it up and swallowed it before she could lose her nerve.\n That was it.\n She chased it down with an extra glass of water just to be sure. Her body had been feeling a little different, but that could have been her mind’s suggestion. Stripped of the magic that younger women had always begged her to imbue them with, she felt . . .\n Don’t say hollow. I’m more than that. I’ve already contributed five healthy children to the Race.\n Her triumphs were written in her body, where no one could take them away. Pale ripples in the skin of her belly and hips proved she had received Elinda’s gift, that she could grow like the moon to nurture souls. Her breasts had earned their delicious softness with each precious suckling touch.\n She raised her head and looked her reflection in the eye. And now you’ve contributed to the content of a legislative proposal, so what do you think of that?\n A strange light crept over her face from beneath, turning its features unfamiliar. Selemei glanced down; a wysp had entered the room, and now turned circles beside her knee. She smiled at it.\n The wysp understood. But she was going to do this anyway.\n She raised both hands over her head, allowing Grivi to slip the sleeves of her silk robe over them. Then she closed the robe and took his hand to walk out to the bedroom where Xeref was waiting.\n Xeref pushed up on one elbow at the sight of her. His worry-wrinkles were deeper than usual—he looked even more concerned than he had yesterday, if that was possible. She allowed Grivi to seat her on the edge of the bed; once Grivi vanished under his curtain, she took a deep breath.\n “I’m all right, Xeref,” she said. And told her body silently, you are all right; show him. She pulled her legs up on the bed and beckoned. Xeref moved close to her side, and put his arm around her shoulders. His warmth, his stability, his soft silver hair faintly scented with perfume . . . simultaneous waves of nostalgia and longing crashed together inside her, brimming in her eyes and stealing her breath. She leaned into him.\n “I’ve missed you so,” Xeref said.\n All she could manage was a nod.\n “It was harder to wait this time.”\n Hardest to wait when that wait might never end. She nodded into the crook of his neck and shoulder. She could feel his soft-furred, warm skin against her side, against her breast. She reached for his arm and stroked it from elbow to fingers, found the outer edge of his hand and squeezed it as hard as she could.\n “Xeref, I didn’t mean to push you away. I mean—I didn’t want you gone, I just was so scared to—”\n The words brought back the reality of what they were attempting. She jerked back and found him staring at her in dismay. So he’d arrived at the very same thought. She blew out a breath between her lips. Carefully, carefully.\n “We’re not doing this for politics. I—I’m not doing this for politics.” The words sounded false.\n Xeref seemed to crumple in on himself. “Nobody could possibly agree to this,” he muttered. “Why did I ever make you—?”\n “You didn’t make me; I convinced you. And Ustin helped me.”\n He glanced toward the service curtain on his side of the bed, and heaved a sigh.\n “Please don’t blame her,” Selemei said.\n Xeref shook his head. “I don’t, really. She does her job well. Too well, some might say.”\n “There’s no such thing as an Imbati who serves too well.” Selemei shrugged. “This is the only possible solution to our problem. And for her, this isn’t political; it’s normal.”\n “We aren’t like them,” Xeref said sadly. “Fevers that kill Grobal scarcely touch them. Who’s to say you haven’t done something terrible with this medicine, and will never conceive a child again?”\n “But I don’t want to conceive a child again.”\n “Ha!” The laugh burst from him all at once, like a bark.\n Her face burned. “Xeref, I thought we agreed!”\n “No, Sirin and Eyn, I’m so sorry. We do; of course we do. It’s just, hearing you say it . . . ” He rubbed his face with both hands. “I wish there were a way for this to be normal for us.”\n “Passing the law would make it normal. Except we can’t pass the law until we try this. It’s normal for Lowers . . . ” A thought struck her suddenly. “What if we were Lowers?”\n “You’re not serious.”\n Impetuously, she tossed her bathrobe back from her shoulders. “We’re both naked. Who’s to say we haven’t just set our marks aside? We could be Arissen—Residence guards, who’ve shed their castemark color.”\n He raised his eyebrows skeptically. “I can’t imagine anything less romantic.”\n “Not guards, then. What if we were Kartunnen? I’m a dancer.” She shimmied a little and ran her hands down the curve of her breasts and belly. “And you’re a . . . ”\n “Hm-mm.” That sound was still skeptical, but there was something of a chuckle hidden in it, too. “No; I can’t.”\n She huffed at him. “Oh, come on. You’re . . . you’re my accompanist. And you play drums, with your feet!” She leaned over and shook one of his feet through the quilted silk. “And you play pipes of course, because you have such—” she found his hand “—marvelous—” she twined it in hers “—fingers.”\n He gave her a real chuckle this time, one that awoke heat in her stomach. “You’re so beautiful. My Selemei.”\n She placed three fingers over his mouth. “I can’t imagine who you’re talking about.”\n “Someone . . . ” He took a deep breath. “Uh, someone in a song.”\n “That’s right, because we can sing, too.”\n “And we paint ourselves every morning. Like this.” He licked one finger, and ran it over her lower lip.\n Selemei pounced and caught the finger in her mouth. It didn’t stay long; Xeref’s mouth replaced it. Whenever her conflicting fears tried to rise up, she just kissed harder, and clutched him more tightly against her. Her leg twinged once, when he knelt between her knees, but she squirmed into a better position, and once he entered her she forgot everything but their ecstatic unity.\n Xeref shifted beside her afterward, his panting gradually giving way to gentler breaths. Then he laughed. “Well. I know how to convince the cabinet to add medicine to our law.”\n Selemei let out a sigh, and the weight in her mind floated away. “Sirin and Eyn,” she swore. “Part of me wants to do that ten times before morning. The other part of me is—a little tired.”\n “Tired, my love? I’m sure if I can muster a bit more energy at my age, you can, too.” He stroked her face, her neck. His hand settled around her left breast. She stretched beneath his touch.\n “Mm,” she said. “I didn’t say I couldn’t.” It troubled her, though, to be reminded of his sixty years. “Are we so old, Xeref?”\n “I suppose we are. Does it matter?”\n “I don’t know. I felt old, thinking of what it meant to retire. Thinking it would be the end. But I still wanted to.”\n “Of course you did.”\n “But now—maybe it doesn’t have to be.” She turned her head to look into his eyes. “If you can convince them, Xeref, it doesn’t have to be.”\n “Do you know what else doesn’t have to end?” Xeref asked. His smile made her catch her breath.\n Selemei breathed against his lips. “Tonight.”\n “Let our law pass today,” Selemei murmured. “Sirin bring us luck to let it pass. Please, let it pass.” Her Grivi was in the midst of fastening the buttons at the back of her gown—she’d picked feldspar-gray today, to inspire herself with the steadiness of stone. Feeling nervous wouldn’t help. Only the cabinet representatives of the Great Families were allowed into the Cabinet room for the vote, but she was determined to go, even just to wait outside for the result.\n “There you go, Mistress,” Grivi said.\n “Thank you, Grivi.” She took his hand and they walked out across the private drawing room. Maybe this once, Xeref would let her walk there with him. Grivi pushed open the bronze double doors into the sitting room.\n The sitting room was full of strange Imbati, all dressed in black, all marked with the crescent-cross tattoo of the Household. The vestibule curtain and the front door both stood open wide. Selemei shook her head, blinking.\n “What’s going on?”\n Two Imbati emerged from Xeref’s office, carrying something. It looked like a stretcher.\n Wait, those were Xeref’s feet!\n “Xeref!” she cried. “Gods, what happened?”\n She half-hopped, half-ran to his side, fell to her knees and grasped his hand. Pressed her lips to it, but he didn’t respond.\n “Please excuse us, Lady, we must get him to the Medical Center as quickly as possible.”\n “Oh! Yes . . . ” She released Xeref’s hand and scooted backward. The black-clad stretcher-bearers moved so fast that he was out the door in half a breath.\n Selemei sat, panting. At last she reached up, found her Grivi’s hand, and tried to stand. Her left foot caught on the hem of her gown, but he caught her when she stumbled, freed the fabric, and helped her the rest of the way up.\n Arriving on her feet, she found Xeref’s Ustin standing directly in front of her.\n “Mistress,” Ustin said. “I was attending the Master’s preparations in his office. He summoned the First Houseman to send you a message, because he was concerned you would not be ready in time. Then he stood up and collapsed.”\n “In my witness,” the First Houseman agreed.\n “Heile have mercy,” Selemei whispered. “Let him reach the Medical Center in time. Elinda forbear.” She cast her eyes toward the front door, now shut; the sitting room, now empty of the Household emergency team. You would almost think nothing had happened.\n And how could it have? If she stayed in this moment, unbreathing, unthinking, nothing would have happened.\n Her body corrected her, of course; she gasped and shook herself. “I should go to him.”\n “Mistress.”\n The Imbati was still in front of her. She frowned. “What, Ustin?”\n “The Master had no opportunity to record his vote for today’s Cabinet meeting.”\n No opportunity to record his vote. She heard the sounds; missing emotional register, they resolved only slowly into meaning. Did that mean . . . their proposal might fail?\n “It has to pass,” she murmured.\n “With your permission, Mistress, I can escort you to the Cabinet room.”\n She started to understand it. “So I can tell them. And then go to the Medical Center.”\n “Yes, Mistress.”\n “All right, then, let’s go.”\n The hallway was walkable. She had to take a brief stop on the spiral staircase to the second floor, Ustin above her, Grivi behind. She gripped tight to the cold iron rail, pressed her right hand against the central stone column, and started up again. Ustin murmured to her as she emerged into the hall.\n “You understand, Mistress, that because he didn’t record his vote, I could not deliver it.”\n She nodded. “That’s why I’m doing it.”\n Ustin hesitated a second, her lips pressed together, but then she resumed course into the central section of the Residence. Selemei kept walking. Grivi’s arm beneath hers was muscular and solid.\n Since the Heir’s suite faced the front of the Residence, she’d always known the Cabinet chamber was down the hall toward the back of the building, but she hadn’t realized it was on the left side. The bronze door was engraved with the repeating insignia of the Grobal. There should have been people here, standing in the hall—cabinet members. Shouldn’t there?\n “Where are they?” Selemei asked.\n “I believe they have gone in, Mistress,” Ustin replied. “Please be aware, Grivi and I are not permitted into the room during the meeting. You are the only one who can represent the First Family.”\n “Mistress,” Grivi objected, in a low growl.\n “I’ll only be a moment, Grivi.”\n She let herself through the door.\n All talk in the windowless room stopped immediately. So many eyes, staring at her, and all of them belonged to men. The men sitting around the big brass table. The men in the heavy portraits staring down from the walls. She recognized the man at the head of the table—that had to be the Eminence Indal, because he had a noble nose, and wore the white and gold drape of office around his shoulders. Next to him, golden-skinned and curly-haired, sat the Heir Herin—everyone agreed how handsome the Heir was. The others were strangers . . . no, here was one more she knew. Fedron, her cousin in the First Family.\n Fedron stood up. “Lady Selemei, what are you doing here?”\n Her voice felt tiny, as if she spoke across a crevasse. “I’m representing the First Family. Xeref—” The ground beneath her shuddered; or it could have been her legs. She found a chair to hold onto. “Xeref collapsed. They took him to the Medical Center.”\n “What?” cried Fedron. “When?”\n She blinked at him. “Now. I came directly.”\n Everyone started talking at once. Several of the men leapt up from their chairs; some of them seemed angry at each other. She quickly lost sight of the Eminence and the Heir behind a clump of worried cabinet members. The portraits still stared down from the walls, but Xeref meant nothing to them. Only Cousin Fedron appeared to remember she was here.\n “I’m so sorry, Cousin, you must be distraught.”\n “I don’t have time for that. I need to be here for the vote,” she explained.\n Fedron cast a sideways glance, maybe looking for one of the other men. “We can’t possibly vote now, under the circumstances. Perhaps when Xeref returns.”\n “We can’t?”\n “Are you unattended?”\n She shook her head. “No, of course not. They’re waiting outside for us to vote. We should really vote.”\n “Cousin, we can’t vote today,” Fedron said, with exaggerated patience. “The Eminence and several of the members have already left.”\n “They have?” She looked around. It did seem emptier than a moment ago. The Eminence really was gone. That wasn’t how it was supposed to happen.\n None of this was how it was supposed to happen. But now she had somewhere she needed to be. The Medical Center. Selemei took a deep breath and smoothed down her gray skirts. Cautiously, she turned back toward the engraved door and made her way through it.\n In the hall, a few cabinet members were talking and arguing. Imbati Grivi and Imbati Ustin stood waiting for her. They looked all wrong—not calm at all. Grivi’s tattoo was furrowed, and he cast a gaze of anger at Ustin, whose face twitched in a battle to conceal some strong emotion. Ustin managed to master herself, but then cast a glance down the hall.\n “Mistress—”\n Grivi stepped between them. “Ustin, that’s enough!”\n Startled by his ferocity, Selemei sought after the target of Ustin’s furtive glance. Someone was hurrying up the corridor toward them.\n “Brinx?”\n Her son’s handsome face was nearly unrecognizable—his eyes red, and his mouth twisted. “I can’t believe you, Mother!” he shouted. “Why didn’t you come find me, to tell me?! How could you come here at a time like this?”\n Time shrank to a pinpoint. If he spoke again, she didn’t hear it. Why hadn’t she recognized the signs? Hadn’t she noticed how cold Xeref’s hand felt against her lips? Why had she never wondered why Ustin accompanied her here instead of staying with her master? Why had she not realized only disaster could make Imbati show emotion?\n Now all the stones crashed together, and the bottom dropped out of the world.\n This was obviously the funeral of an important man. The Voice of Elinda wore full priestly regalia, dark blue robes and a heavy silver moon-disc around her neck. She sang the service in a contralto of liquid grief. The Eminence Indal and the Heir were here, and every member of the cabinet, and nearly half the Pelismara Society, too, all crowded into the chapel on the Residence’s second floor.\n Selemei couldn’t feel it. Her eyes and throat hurt, but no tears came.\n All she could do was hold Aven’s hand, and curl an arm around Corrim, who clung to her, muffling his sobs in her stomach. Pelli’s Verrid had decided to take her for a walk when she started squirming; Brinx sat on the far side of his sister Enzyel and her Eighth Family partner because he wasn’t speaking to anyone. Selemei leaned her head down against Corrim’s curls, reversing the room in the corner of her eye.\n A shinca tree trunk glowed silver in the back, casting eerie clarity across the gathering. Since shinca could not be removed, the stone wall would have been built around it long ago; and in this room, the ceiling had been designed with arches to look like its branches. That should have been the front of the room. It had been, once. She and Xeref had spoken vows to each other in the warm aura of the tree, invoking the blessed names of Sirin and Eyn. She’d imagined their partnership just as invulnerable—the illusions of a seventeen-year-old child.\n “Mother,” Aven whispered. “Mother.”\n Selemei lifted her head. The Voice of Elinda was walking toward them with arms outstretched. One golden hand held a box of precious wood; the other a basket of silver wire heaped with yellow mourning silk.\n “Corrim,” she murmured. “Let me stand. It’s all right—please, just don’t fall on the floor.” He crumpled sideways, gulping back tears, and she managed to get up, though her left leg felt numb from sitting too long on the metal bench.\n “May the wounds of grief become the gifts of remembrance,” said the Voice.\n Selemei took the box, and pulled a mourning scarf from the basket. “Thank you, Mother Elinda.” The children were supposed to receive their scarves next, but actually Aven took three because Pelli was gone and Corrim wouldn’t look up. While the Voice moved on to Enzyel and Brinx, Selemei helped Aven and Corrim get their scarves fastened around their arms, snug just below the elbow with the ends fluttering down.\n Around her, other people began standing, but there was no hurry to go anywhere. She opened the glossy lid of the box. The sight of Xeref’s name engraved on the crystal spirit globe inside brought such a tide of grief it nearly overwhelmed her, and she snapped it shut.\n “Lady Selemei,” said a man’s voice, heavy with tears. “May Xeref take his place among the stars, and may Heile and Elinda continue to bless you and your family.”\n She looked up; it was Administrator Vull, holding young Pyaras by the hand. He offered her his other hand, and she took it.\n “Thank you, Administrator.”\n “Cousin, please. Or just Vull. We have too much in common to insist on formality, don’t we?”\n Her breath hitched, and she closed her eyes to wrestle it back into control. “I suppose we do, Cousin.”\n Vull nudged his son, and Pyaras said with admirable sobriety, “I’m very very very very sorry.” Then, impulsively, he hugged her.\n Selemei stroked his head. “Thank you, Pyaras.” The boy watched her over his shoulder as his father led him away.\n There was a nudge at Selemei’s elbow. She turned to find Imbati Ustin pressing a note into her hand. It read, Do you wish to attend the next Cabinet meeting?\n She stared. “Ustin, now is really not a good time.”\n “Mistress,” said Grivi. “I believe your daughter wishes to speak to you.”\n Selemei turned back and took Enzyel in her arms. The girl was taller than her, now, and still growing—oh, gods help her, that was Xeref’s height, would she also inherit the defect that had led to his aneurysm?\n “May Heile preserve you,” she said, fervently against her daughter’s shoulder. “Are you all right?”\n “Oh, Mother, I think I should be asking you that question.”\n “I—” Trying to answer that would release the flood. She shook her head. “I love you, Enzyel. I wish you could come for dinner sometimes.”\n “I’ll be at the dinner tonight. I’ll try to come by more. And—” Enzyel leaned so close Selemei was enveloped in her cloud of curls. Her daughter’s sweet breath warmed her ear. “I’ve got good news.”\n Oh, sweet Elinda, no . . .\n “I’m pregnant.”\n Selemei’s hands fisted involuntarily. She tried to say congratulations, but fear had cramped her guts, and what came out sounded like a sob. She fought to control herself while Enzyel’s gentle hand caressed the back of her neck. “You’ll—” Selemei gulped another breath. “You’ll take care of yourself, won’t you. Don’t just rely on your Imbati. See a Kartunnen doctor at the Medical Center as well.”\n “I will, Mother, I promise.”\n Grivi murmured behind her, “Do you wish to retire, Mistress?”\n Selemei nodded. She stepped carefully toward the aisle, holding Grivi’s hand across the bench that had separated them. A man she didn’t know stood half blocking her exit into the aisle, watching her.\n “Excuse me,” said Selemei.\n “My condolences on your loss, Lady Selemei,” the man said. “I’m Silvin of the Second Family.”\n “Thank you.”\n “But, let’s face it, it could have been worse.”\n She could only blink at him.\n “It could have been you. Think of the tragedy, if your great gift had been lost to the Race! You must give your Family Council my name when they suggest a new partnership for you.”\n Disgust knocked her back a step. Before the man uttered another word, Grivi appeared between them, looking directly into his face.\n “You will excuse us, sir,” he said, his deep growl all the more disturbing for its utter calm.\n The man and his servant quickly backed off and vanished in the crowd rather than risk a physical confrontation. Grivi’s shoulders rose once with a deep breath, and then he offered Selemei his hand again.\n “Bless you, Grivi,” she whispered.\n “I am here to protect you, Mistress.”\n “Selemei! Cousin, are you all right?” That was Lady Keir, who hurried up and embraced her. “I saw what happened . . . ”\n She grimaced. “Fine enough.”\n Arbiter Erex caught up with his partner a moment later; he fanned his chest a little, breathing fast. “Cousin, I’m so sorry.” He gestured to the compact Imbati woman behind him. “Please allow my Kuarmei to help escort you home.”\n Selemei shook her head. “It’s kind of you, but I’ll be fine. I have Grivi and Ustin with me, and I’ll have Verrid too, soon enough.” She began walking toward the exit.\n “If you’re sure,” Erex said. “That was disgraceful behavior. In fact, my Kuarmei got his name; we’ll be reporting him to his Family Council. Rest assured, you won’t have to consider tunnel-hounds like him when the time comes. Someone like Administrator Vull would be a much better match.”\n Selemei almost stumbled. She gritted her teeth and clung to Grivi to keep going. “Come, children,” she said. “It’s time to go home.” She would have run if she could. Her eyes burned, and she scarcely raised her eyes from the floor until they had collected Pelli and Verrid and were all the way downstairs, safe in their home vestibule, the front door shut and locked and the children dismissed to the care of the Household. “Where’s Ustin?”\n The tall Imbati woman presented herself with a bow.\n Selemei took a deep breath. “Imbati Ustin, I know you’ve been concerned about securing lodging while you’re considering new employment inquiries. Please feel welcome to stay in our Household.”\n “Thank you, Mistress.”\n “And in return, I’d like you to make certain I attend the next Cabinet meeting.”\n They were playing kuarjos, or trying to. You had to do something once the cousins, friends, and well-wishers left—and it helped her ignore the piles of condolence gifts that filled their private drawing room. Selemei sat across from Aven, who occasionally hiccupped to hold back tears but still had grasped the rules pretty well. When Selemei picked up an emerald-helmed warrior, Pelli snatched it from her hand and ran away giggling.\n Selemei only sighed, and Pelli slowed, falling into a droop.\n “Pelli, big girl, may I have that back? Bring over your puzzle if you want to play. Bring it over here next to us.”\n Pelli lifted the emerald-helmed warrior and stared at it.\n Selemei turned her attention back to the board and pointed to a junction. “I’ll put it there, whenever Pelli brings it back.” She glanced over. “Please, baby.”\n Aven moved one of her pieces forward on a left diagonal.\n “Not there,” said Corrim. It was the first he’d spoken in hours. He draped himself over the back of the couch next to her. “She’ll get you in entrapment. Use the inverse move instead.”\n Aven pulled a face at him. “Mother, what happens if a piece crosses the whole board?”\n It walks right off into darkness, like at the edge of the city-caverns. Like at the end of the world. Like in my dreams. And then it has to keep going anyway. One breath, one step, in this place with no air and no light.\n Pelli’s soft fingers were tickling her hands. Selemei took a breath, and stroked them, and found the golden warrior had been returned, wearing a hat of twisted white paper. “Thank you, big girl. All right, so, Aven. The game changes once a warrior is able to cross the board, because—”\n The vestibule curtain swished open, revealing Imbati Ustin.\n “Mistress.” Ustin bowed. “I apologize for the interruption. I’ve learned that an emergency Cabinet meeting has been called for tonight. If you wish to attend, we must hurry.”\n Hurry? What should I do? Selemei stood, searching the space around her for reasons to feel prepared. I should tell the children. “Children, I’m going to step out for a few minutes. It won’t be long. Corrim, why don’t you take my place at kuarjos? Pelli—” She bent and kissed her. “I love you, big girl. Be back soon, all right?”\n “Mama back,” Pelli answered.\n Selemei searched the room again, but found only absence and grief. “Am I ready?” she asked.\n Grivi offered his arm. “You are dressed for guests, Mistress. That will be perfectly appropriate.”\n Ustin nodded. “I’ll brief you on our way.”\n Selemei tried to project confidence on her way to the front door so as not to alarm the children. It would be all right. Fedron would be there. She wouldn’t be alone.\n And she had to be there.\n “Mistress,” said Ustin, walking behind her right shoulder. “We must have you seated in the Cabinet room before any of the other members arrive. Can you walk faster?”\n “Oh, yes.” She’d been fighting the urge to run along the carpeted hall; all she needed to do was give in slightly. And hold tighter to Grivi’s hand. She skipped a little, taking extra hops on her right foot.\n “There are two types of votes, Mistress,” said Ustin. “Procedural votes are the ones that allow cabinet business to continue. For those, simply follow your cousin Grobal Fedron’s lead.”\n “All right.”\n “There are two legislative votes scheduled, so far as I know, in addition to the Indelis proposal.”\n “Two?” The carpet ended where the corridor gave into the Residence’s central section. Selemei misstepped. Pain stabbed down the back of her left leg. “Aah!”\n She hung on Grivi’s arm. The pain had flashed and gone, but not gone completely; it echoed. She gritted her teeth. This isn’t going to work. Why am I even trying?\n Elinda help me, how can I not?\n “Mistress,” Grivi murmured, “May I carry you?”\n She shook her head vigorously. “No, no. It’s already bad enough—if people saw us . . . ” Catching a silent exchange of looks between Ustin and Grivi, she frowned, and then realized the problem. The Cabinet chamber was upstairs. “How can I get upstairs, Ustin? I have to be there!”\n “I have an idea,” Ustin replied. “Grivi, if you both would please meet me at the door of the Household Director’s office.” She loped off beneath the arch into the public foyers of the central section.\n “Mistress,” said Grivi, slowly. “Can you walk?”\n Hard to answer that question, but, “I will.” She managed it by focusing on the floor. Polished stone in one room, a carpet with geometric patterns in black and green. Ancient tile in the foyer before the Hall of the Eminence, worn to white mostly, but near the walls, still showing an intricate branching design in gold. Step by step.\n The Imbati Household Director kept an office just beside the main front entrance; its bronze door was uncurtained because of the frequency of messengers, and today it stood open. Ustin returned to them as they drew nearer.\n “I’ve spoken to Assistant Director Samirya,” she said, in a low voice. “We have permission. Let’s take her elbows.”\n Grivi gave a reluctant-sounding grunt, but then Selemei found herself lifted a finger’s breadth from the floor and ushered at high speed toward the door. Just as they reached it, the two Imbati turned her sideways—and they went through.\n Selemei gulped. This was not Grobal territory. On a tall metal stool sat a golden-skinned woman with straight hair pulled severely back from her crescent-cross Household tattoo. She looked up from an ordinator screen full of glowing green symbols, and regarded them with a fierce unwavering gaze.\n “This once, Ustin,” she said.\n Selemei was swept sideways again, and found herself in a tiny room with featureless metal walls, so close between Ustin and Grivi that they could not help but touch her. She clasped her hands together so as not to give offense in return.\n The room lifted.\n Selemei gasped. “An elevator?”\n “It’s for messengers,” Grivi rumbled.\n “And emergencies,” added Ustin. “I just hope we’ll be in time.”\n Perhaps this brief respite had been just what she needed, because her leg took her weight better when she tested it. Here on the second floor, the open entrance of the elevator was covered with a curtain. Ustin stepped out, but swiftly ducked back in again.\n “Gro—people in the hall, Grivi,” she said. “Let’s cross, while we still have Samirya’s permission.”\n “Cross?” Selemei asked. She leaned on Grivi to enter the main hallway. Over there, beneath the arches, stood the cluster of men in question; strangers from other Families, with their Imbati. Even this far off, their raised voices sounded aggressive.\n “Cabinet members, but they’re still attended,” said Ustin. “I’m guessing we have maybe three minutes before they go in.”\n Again the two Imbati lifted her by the elbows, sweeping her across the hall, where Ustin lifted a curtain and let them through a door. Here the corridor was narrow and dim, and Grivi could only support her from behind. She tried to hurry, in spite of the risk. She didn’t belong here. What argument could Ustin possibly have used to justify allowing a Higher like her into the servants’ Maze?\n Around a corner to the right was more light, through a series of windows on the left side. She gratefully used their stone sills to support herself, and then a door opened on her right.\n She could feel eyes staring down at her as she entered—but they were only the painted eyes of dead Eminences. The room was empty.\n Ustin and Grivi helped her ensconce herself in one of the tall-backed brass chairs. Xeref’s chair. It had none of his warmth or softness.\n “Mistress.” Ustin pressed a paper into her hand. “These are the votes you will need to cast. The most important thing is, you must say you occupy this seat for the First Family.”\n “I’m representing the First Family.”\n “Mistress, if you will: I occupy this seat . . . ”\n “I occupy this seat for the First—”\n Click.\n Ustin’s gaze snapped to the main door. Faster than the turning handle, she leapt to the Maze door and disappeared.\n Selemei’s heart flipped; she tried to swallow it back into place and keep breathing. Three men walked in, conversing, then a fourth. The fifth man was first to notice her. He was broad-bodied, golden-skinned, and bald as a stone.\n “Hello?” That single word filled the chamber. “What are you doing here?”\n She thought of Imbati Ustin. “I occupy this seat for the First Family.”\n Now the others saw her. “What?” “Who—wait, wasn’t she the lady who . . . ?” “Xeref’s partner?” “What in Varin’s name is she doing?”\n “I occupy this seat for the First Family.”\n “I’m sorry, Lady, you’re going to have to leave,” said the bald man.\n She grabbed the lower edges of the chair, winding her fingers through gaps in the brass. “I occupy this seat for the First Family.”\n They were talking about her, now, and more of them poured in every second. She couldn’t see Fedron.\n “Can we have her removed?” “But, I mean, the poor thing—” “This can’t be serious.” “She’ll go soon enough.”\n “What’s this?” asked the Eminence Indal. He leaned on a cane of rich dark wood. His manservant, a single figure in black silk against the jewel colors of the other men, murmured in his ear while they went to the head of the table. “What’s this?” He sniffed through his noble nose and shifted his white and gold drape as he sat. And looked right at her.\n Selemei lost her breath.\n “No problem, your Eminence.” The Heir waved his golden hand magnanimously. “She’s just grieving, we can ignore her.”\n “But, cabinet business,” objected a man with bulging eyes.\n “Our main point of business is the empty seat.” That was the bald man’s resonant voice. “That is why Speaker Orn pressured us to convene this meeting at such short notice.”\n Selemei closed her fists tighter, until the brass hurt her fingers. “I occupy—”\n Fedron burst in the door with a desperate look on his face.\n “—this seat for the First Family.”\n Fedron gaped at her, panting. “Wh—Selemei? Cousin?”\n Somehow his presence stopped the words up in her throat. She shoved them out. “I occupy. This seat. For the First Family.”\n Fedron deflated, and fell into the chair beside her. “Well, hand of Sirin . . . ”\n “We should just get started,” someone said.\n The Manservant to the Eminence struck reciting stance, his clear baritone cutting through any further murmurs of objection. “I call to order this meeting of the Pelismar Cabinet, and serve as a reminder of the Grobal Trust: giving to each according to need, the hand of the Grobal shall guide the eight cities of Varin.”\n “So noted,” said a red-faced man sitting at the Eminence’s right. “First order of business, acknowledgment and certification of the empty seat. Which is empty, in spite of appearances.”\n Selemei took a breath, but it was no use; hopeless certainty stole the words from her tongue. It was just as they’d said: they were ignoring her. While the men leaned forward to press buttons below the personal ordinator screens embedded in the table before them, her own screen—Xeref’s screen—was dead.\n Dead love, dead hopes.\n The Manservant to the Eminence pulled a small device from his pocket, bowed, and intoned, “A unanimous vote is required to certify an empty seat. I count one vote in dissent. The seat remains occupied by the First Family.”\n “Wait, now,” said the man with the bulging eyes. “Fourteen to one? Fedron, you’re not serious.”\n Fedron folded his arms. “Does that seat look empty to you?”\n Selemei looked at her cousin, but he didn’t meet her gaze.\n The red-faced man beside the Eminence gave a noisy sigh. “The seat remains occupied in the presence of a legitimate substitute. Indal’s Jex, you’ll carry the cabinet’s petition to the Arbiter of the First Family Council to investigate the legitimacy of the substitute.”\n The Manservant to the Eminence bowed. No animosity on his face, but Imbati only showed feelings when they meant to—unlike the other cabinet members, who scowled and scowled while Fedron continued to avoid looking at her. Only the bald man with the big voice held pity in his face. They all argued about one topic after another. It went on so long that Selemei’s fingers cramped around the curled brass of her chair; she had to extricate them painfully and rub them together in her lap. She combed through the men’s portentous words for the Indelis proposal, but in vain. The paper Ustin had given her proved useless, for the voting screen before her remained blank.\n “Right,” declared the big-voiced man at last, “if there is no further business, the meeting shall adjourn.”\n “Seconded.”\n Selemei’s heart shrank; she didn’t dare protest into the silence that followed.\n The Manservant to the Eminence bowed again, and intoned, “So it shall be. This meeting is adjourned.”\n If the last two years hadn’t trained her to move slowly, she might have tried to run from the room. Selemei stood, and pushed back her chair, swallowing grief.\n “That was some nerve,” said a man somewhere to her left. “Get back to your children.”\n She dropped her gaze, but her cheeks blazed. She watched the placement of her feet, moving out from between the chairs.\n “Lady—Selemei, is it?” When she looked up, the Heir was staring down at her. His face was young, handsome, chill as gold.\n “Yes.”\n “You realize we’ve given you a gift.” As he spoke, he stepped closer, looming over her.\n She shook her head.\n “Our patience, in the name of your bereavement. You know there are other ways to respond when someone disrupts cabinet business.”\n Mai help her—would he lay hands on her? Selemei took a nervous step backward.\n Her left leg collapsed. She grasped for the nearest chair, felt fingers slip on the unkind brass, knocked her elbow, and hit the floor, the chair nearly coming down on top of her. She sat, immobilized by pain and shame while the Heir walked away without a backward glance. Gulps of air kept her from sobbing but couldn’t stop tears creeping onto her cheeks.\n “Cousin?” Fedron crouched beside her. “Let me help you up.”\n She nodded. Pretended this was just a room, not a room full of eyes and sneers. Gritting her teeth, she got her right leg under her. With Fedron’s help, she managed to stand, and limp to the door where the manservants were waiting.\n “Grivi,” she said the moment she saw him, “I’ll need you to make an appointment with that doctor. The one who was at Vull’s.”\n Grivi interposed himself beneath her arm with a murmur of thanks for Fedron and a cutting glance for Ustin.\n “Let me walk you home,” Fedron said.\n She hadn’t expected that. They moved slowly, at her limping pace. But a bigger surprise came in the spiral staircase, where Fedron allowed his manservant to pass him and turned to face her.\n “I’m grateful to you, Cousin,” he said.\n “What?” Grateful! Had she heard him right?\n “Sure, you were misguided, but that was a big favor you tried to do for the Family. Someone overheard that we were inviting Garr back from Selimna to claim the seat at the next scheduled meeting, so they convened this one early. You know, to certify it empty before he could get here.”\n She couldn’t tell whether to be flattered or insulted, and ended up mostly confused. “Garr and Tamelera are coming back?”\n Fedron rubbed his hand across his forehead. “Well, I’m afraid it’s not so straightforward at this point.”\n “What happened to the Indelis proposal?”\n A strange expression flashed across his face. “Don’t you worry about that.”\n How many times had she been told not to worry? “I do worry about it, Cousin. That’s why I was there.”\n “Let me talk to Erex first, all right? And then we’ll discuss it.”\n We’d better. But she was too exhausted and hurt to argue. She needed Aven; she needed Pelli, and Corrim. Just to hold them, and cry, with no eyes watching.\n Selemei screamed and woke. A nightmare, not of wandering in darkness this time, but of standing exposed in sunlight, under the judging eyes of Father Varin himself. She panted while her heart slowed, rubbing her coverlet to remind her hands of soft silk and reality. Her body came into focus.\n Everything hurts.\n Each bruise that woke to identify itself roused another horrible memory of the Cabinet meeting. She couldn’t force those events into sense, no matter how many times she tried. She called, “Ustin?”\n The Imbati woman didn’t appear. But then, she probably wasn’t expecting to be called, because . . . Selemei’s throat closed. She looked away from the place where Xeref should have lain. Deliberately, she rearranged her pillows and pushed herself back to sit. Mercy, it hurt . . . but how much worse might it have been without Grivi’s care? She tried again, though her voice quavered.\n “Imbati Ustin, may I speak with you?”\n Ustin emerged this time, so silently she might have come, wysp-like, straight through the wall. She wore a black silk dress that showed off her muscular shoulders, not the suit she had normally worn on duty. “Mistress?”\n This was already all wrong. “I’m very sorry,” Selemei said. “It’s not fair of me to demand you call me Mistress now, is it?”\n Ustin bowed; a single pale braid swung forward of her shoulder. “Lady Selemei.”\n Selemei inhaled what calm she could manage. “I went to the Cabinet meeting, but it went so badly—I wonder if I might discuss it with you.” Ustin’s sober silence felt like disapproval, though her face didn’t change. “If you consent to advise me, I’ll pay you for your time.”\n “I am willing, Lady,” Ustin replied. “Unfortunately, I have a very incomplete picture of what happened, having been limited to what Grobal Fedron told us, and what I could overhear from other members leaving.”\n “Well . . . we can start with what Fedron said. He said the meeting was called in emergency because Garr and Tamelera were coming back from Selimna. How would they have anything to do with anything?”\n “Lady, are you aware that the seat my Master held was at-large?”\n The term wasn’t entirely unfamiliar. “I’d heard that. It means he’s—” She gulped down a pang. “—he was, not the only First Family cabinet member.”\n “Yes, Lady. Each of the twelve Great Families is assigned a single inalienable seat. Beyond that, only two seats remain. In those, any Family’s representative may sit.”\n “But we happened to hold it.” She closed fists, remembering her fingers tangled in the chair. “And they wanted to declare it empty, but I was sitting in it.” Another piece fell into its slot. “That’s what Cousin Garr was supposed to do—sit in the seat so Fedron wouldn’t have to admit it was empty.”\n “Lady,” Ustin said, “I’m sure you know that any competition among twelve Families for a single empty seat would be fierce.”\n That was an understatement. Selemei nodded. “The cabinet rushed to meet so that Garr would come too late—and they would all have been itching to fight one another—but then I was there. They tried to pretend I wasn’t—except Fedron said I was. Why would he . . . ?” She patted down the question with both hands. “No, of course he would. He had to have been in a panic when he thought they’d outmaneuvered him.” That face he’d made, arriving in the seat beside her . . .\n The corner of Ustin’s mouth twitched slightly upward. Selemei chose to interpret that as approval.\n “But I still don’t see how any of this has anything to do with the Indelis proposal. I was listening. It was never even mentioned.”\n A shadow of something strangely like sadness flitted across Ustin’s face. “Lady, no vote can occur if a proposal has no sponsor.”\n The men didn’t care. Not even Fedron had sustained his sponsorship once tragedy struck. “I could have sponsored it, if I’d known,” she said. “I thought I was there to cast his vote. But that’s why you brought me, as a sponsor. Is it?”\n Ustin didn’t immediately respond. Selemei braced herself for I don’t know, but then the Imbati answered, “Lady, you recall we were jointly involved in a conversation about the seriousness of the risks Grobal ladies face. I continue to share my Master’s belief in the proposal’s benefits for ladies and their children.”\n For me. And for my children. Without a law to protect her, she’d have men approaching her constantly; and how could she refuse to entertain partnership arrangements that the Family Council might propose?\n “I could still sponsor it,” she said. “Fedron has acknowledged me in the seat.” Only once the words were out did their shuddering import take shape. To do that, I would have to claim to be a legitimate cabinet member. It perfectly explained Fedron’s ambivalence. “The Family still wants Garr there.”\n Ustin nodded. “Lady, we can be certain of that. Grobal Garr is a man of influence, and was the First Family Council’s choice of substitute. However, the Cabinet bylaws which allow a Family to provide a substitute imply that said substitute shall then fill the seat on a permanent basis.”\n “They imply . . . ? Gnash it, Ustin—that’s why the Eminence is sending his man to the First Family Council. He thinks I’ve claimed the seat!”\n Ustin’s face remained impassive. “Technically, Lady, you have.”\n “And that’s why Fedron wants to talk to Erex. Maybe I saved the seat, but I just delayed their problem! And then I fell down, and embarrassed myself in front of everyone . . . ”\n That seemed to startle Ustin. “Lady, you fell? I’m sorry.”\n The shame flooded back. Selemei pressed her hands to her face, shaking her head. “If I hadn’t had to rush there—or if I’d just been holding onto something—”\n “The Luck-bringer’s hand is not always kind.”\n Her mother had often said so. Selemei instinctively raised her head for the traditional response. “But Blessed Sirin sees far, and does not explain his choices.” She sighed. “That’s why my Grivi will be taking me to the Medical Center today.”\n As if recognizing her need, Grivi stepped out from beneath his curtain and bowed respectfully.\n “Good morning, Mistress. Allow me to dress you for your appointment?”\n “Yes, thank you, Grivi. Ustin, you may be excused. Thank you for your help.”\n The Imbati woman bowed and withdrew.\n “Mistress,” Grivi said gruffly, “if you wish Ustin to advise you, perhaps you should inquire.”\n “But I did; I asked her in,” Selemei said. “I did offer to pay her.”\n Grivi looked down at his hands silently for several seconds. At last he said, “Mistress, I believe you requested to see Doctor Kartunnen Wint, who confirmed Grobal Pyaras at his party?”\n “Yes . . . ”\n “Please be aware that we’ll have to go a little farther than the Medical Center for your appointment.”\n “Oh. All right.” Vull kept a doctor outside the Medical Center? But perhaps Wint was worth it; she certainly had made an impression at the party.\n After she was dressed and had eaten breakfast with the family, Selemei assured the children she’d be home soon—with extra kisses for Aven and Pelli—and she and Grivi walked across the gravel paths of the Residence gardens to the Conveyor’s Hall. Selemei winced with every step. Thirty-seven should have been too young to walk like an old woman. It should have been too young to be widowed, too. Her former self dragged at her—the Selemei who had run and hidden behind that carefully tended hedge on her right, joined by a handsome man who gently kissed her amid the voluptuous scent of imported surface soil. It made her too conscious of the effort Grivi must be expending to keep her steady, to keep her moving. And conscious, too, of strange glances he cast toward her.\n Was he unhappy?\n She watched him. In the Conveyor’s Hall, Grivi seated her in a chair by the stone wall. He left the green-carpeted reception zone, crossing the road that passed under the Hall’s massive entrance arch and ended against the wall to her left. The zone beyond was crowded with vehicles of varying sizes; Grivi procured a one-passenger skimmer from the Household staff, and adjusted its control column to upright for a standing driver. Then he came and fetched her to it, slowing attentively at the spot where carpet met stone. He was always thoughtful—he didn’t engage the skimmer’s repulsion until she was fully settled. If he had some complaint, she couldn’t detect it.\n Driving felt quite normal. The skimmer hummed; the cool wind of their passage refreshed her; and outside the gate of the Residence grounds, broad circumferences busy with vehicles and colorful Lower pedestrians made a pleasant distraction. Grivi accelerated up a steep rampway of reinforced limestone that lifted them above slate roofs, and through the bore to the fourth level.\n In this neighborhood, the cavern roof hung much lower. Grivi turned their skimmer into an outbound radius, and then into a circumference where the building façades formed a continuous wall on either side. The road ended against a melted limestone column as broad as a storefront. Above the roofs of the buildings, the slope of another level rampway was visible, passing up and behind the column’s ancient mass. Grivi brought the skimmer to a stop. Its hum faded, and it sank to rest on the stone. The front wall of their destination had high oblong windows and bore chrome script identifying doctors Wint, Albar, and Sedmin. A bright globe lamp, green as the sphere of Heile, goddess of health, hung above glass front doors.\n Selemei took Grivi’s arm, passing a pair of wysps that drifted along the sidewalk, and entered through the glass doors that parted before them.\n The crowd in the room within plunged into silence. Only a small boy with the castemark necklace of a Melumalai merchant continued to run in circles until he nearly tripped over Grivi’s feet, then looked up and bawled in terror. His father rushed up, gaped helplessly at Selemei for a second, then turned to Grivi and blurted, “May your honorable service earn its just reward, Imbati, sir,” before scooping the boy up and hiding behind a large group of thick-belted Venorai. The Venorai had the look of farmers—all were muscular, with striking sun-marked skin. One older man looked bright red, and a couple young women were covered with brown spots, and the rest were solid brown—they were all embracing each other, and she couldn’t guess which one was here to see a doctor. Maybe the red one?\n An inner door opened. Two Kartunnen men emerged: both wore green lip-paint and gray medical coats. The taller of them made a deferent approach to two Imbati mothers and their child; the shorter one came up to Selemei, and bowed.\n “Lady Selemei, if you will please follow me.” He made a second bow to Grivi, but did not greet him. He led the two of them back through the door, paused a moment to key a sequence on a wall panel, then took them down a long bare hall and opened a numbered door.\n Doctor Kartunnen Wint stood in the room within. Selemei recognized her instantly, though this time the style of her gray coat was more functional. She had the same red hair, tied in a knot behind her head. She bowed. “My practice is honored by your patronage, Lady Selemei.”\n “Doctor Wint. I was surprised not to find you at the Medical Center,” Selemei admitted. “Grivi, you may undress me now.”\n “Yes, Mistress.” He began undoing her buttons.\n “Lady, I did work at the Medical Center,” Wint replied. “But after the death of Lady Indelis, I couldn’t bear to stay. Administrator Vull nonetheless has maintained his family’s relationship with me, for which I’m grateful.”\n “I’m sure. That was a terrible tragedy.” That Vull would continue to bring his family to her spoke eloquently for the doctor’s skills. Selemei pulled her hands out of her sleeves and raised them over her head.\n “May I ask what brings you here, Lady?”\n “My leg. I fell yesterday.” Grivi lifted the gown off her; she lost the doctor for a moment behind layers of silk. When Selemei glimpsed her again, Wint still looked inquisitive. “Well, I stepped back on it, and fell. I’d been overusing it. Pushing through pain earlier in the day. And you said, at the party, that I should see a Kartunnen therapist.”\n Wint blushed, and glanced at Grivi. “I did, Lady.”\n “So.” She indicated her own body. “Please proceed.”\n “Lady, would you consent to lie facedown on this table?”\n “Of course.” With Grivi’s help, she climbed up to the padded surface. The slick material was cold on her right cheek, and all down her body.\n “What kind of injury was this, Lady?”\n “Birth injury.”\n “All right, that’s what I thought. How far down your leg does the pain go? Does it go below your knee?”\n “Yes.”\n “Have you had any bowel problems or incontinence, Lady?”\n “No, thank Heile.”\n “Fever or weight loss?”\n “No.”\n “What forms of treatment or testing have you previously pursued, Lady?”\n “Grivi, please tell her.”\n While Grivi explained the tests and treatment she’d received in the Medical Center and the therapies thereafter, the doctor examined her back, rear, and legs. She pressed firmly, but did manage to avoid the bruises from the fall. Then she followed that up with some kind of pricking tool.\n “Thank you, Imbati, sir,” Wint said, when Grivi had finished. “May your honorable service earn its just reward. Lady, can you please stand for me?”\n Once she was standing, Wint asked her to lift her leg, straighten her knee, lift her big toe, and stand on her toes. It went decently. It was hard to know if she should hope to perform better or worse.\n “Doctor,” Selemei asked, “what do you think? Can you fix it?”\n The doctor pinched her own forehead with her thumb and forefinger. “I’m afraid it’s too early to say, Lady. I’d like to recommend a course of exercises, and request that you undergo further tests.”\n Selemei’s mouth fell open in dismay. “But this is like starting over! I thought—” What had she thought? That Wint would have Heile’s hands, to heal with a touch? That if her leg could be fixed, it would change the past? Nothing would erase the sight of her fall from the cabinet members’ memories! Nothing could bring Xeref back!\n The truth tried to drown her. Selemei gulped air, struggling to stay above it, and covered her face with both hands. It was dark in the space behind them, warm, and damp. She did not want to cry in front of the doctor.\n Grivi said softly, “I’m here to protect you, Mistress.”\n Selemei swallowed hard. “Doctor,” she managed, “I’d like to get dressed.”\n “Of course, Lady.”\n The layers of silk gave her a moment’s privacy; she could focus on her hands and her sleeves, and speak as if this were about someone else. “Of course you’d want tests, doctor; here I am walking in, and you don’t know me or my case. I’m sure Grivi could have the Medical Center send over what we’ve already done. I probably should resume therapy—probably never should have stopped, childish of me, really . . . ”\n “I’m sorry I can’t do more today, Lady,” the doctor said. “However, there may be one way to prevent falls while we pursue longer-term improvement. Might I suggest a cane?”\n Selemei blinked at her for a few seconds. Then it occurred to her, “The Eminence Indal carries a cane.”\n “Does he indeed, Lady?”\n “He takes it into the Cabinet meetings.”\n The doctor bowed. “Two doors down from here is a shop where you might be able to find something suitable.”\n “Thank you, Doctor. I’ll look, and I’ll get back to you.” Grivi had finished his work at just the right moment; she took his arm.\n “Thank you, Lady. I’ll send you a report on what we’ve discussed, and a list of suggested actions.”\n “I’ll look forward to it.”\n Selemei walked on Grivi’s arm out through the main hall, hurrying through the waiting room so as to cause a minimum of disturbance to the Lowers there. It wasn’t difficult to find the shop Doctor Wint had suggested; it was staffed by Kartunnen and carried a variety of medical devices. None of the canes here were made of wood, but that only made sense—this was not a neighborhood which could support such high prices. There was a bin of black canes, but they seemed too Imbati; another bin held aluminum canes, but they seemed too Low. Selemei scanned a glass case of artist-designed canes intended for Kartunnen until she found a graceful one which did not use Heile’s green in its design.\n “Purchase this one, if you would, Grivi.”\n Grivi looked down at his hands, clasped before his waist, and said quietly, “Mistress? Must you purchase a cane?”\n “Sorry?”\n “I can accompany you at parties, if you wish. Even if the rooms are crowded.”\n Oh, no. That was why he was unhappy. This morning she’d asked Ustin for advice before she even called for him. She’d asked Kartunnen Wint for medical assistance that Grivi had always provided. And now, buying a cane meant she wouldn’t need him for walking, either. For the first time, she understood what he’d said—‘if you wish Ustin to advise you, perhaps you should inquire.’ He didn’t mean ask; he meant write an employment inquiry. That was uncharacteristic sharpness for him, but now that she thought about it, he must have been upset ever since that first day, when Ustin approached her during Pelli’s nap.\n “I’m sorry, Grivi,” she said. “You serve me well, and always have. Please don’t worry; ladies don’t hire gentlemen’s servants.”\n His shoulders rose and fell with a breath. “If I may presume, Mistress.”\n “Please.”\n “Ladies don’t attend Cabinet meetings either.”\n “That was a disaster, Grivi.”\n “Mistress . . . ”\n “If you differ, Grivi, please tell me.”\n “You have now attended two meetings, Mistress, more than any other lady can say. In neither case did you flee. And your persistence has won you the provisional support of the First Family’s cabinet member. Your intelligence is certainly a match to Master Xeref’s, a long suspicion of mine that was confirmed when you spoke to Ustin this morning. If you are to continue in this, you will need her services more than mine. But I do wish to know one thing.”\n His honesty was sobering, almost frightening. She whispered, “What’s that?”\n “Is this your wish, Mistress?” Emotion colored his voice on that phrase, and he bowed his head. “I have vowed myself to your service, vowed to make your wishes my own. And if this is your wish, so let it be. But please be sure.”\n How could she answer, when she wasn’t sure of anything anymore, even her next footstep? “Thank you, Grivi,” she said. “I don’t know. I wish—I just don’t know.”\n Grivi bowed. “If you will excuse me a moment, I’ll purchase the cane.”\n Of course she’d been summoned before the Arbiter of the First Family Council. Of course she had. The letter delivered by Erex’s Kuarmei had made her feel sick to her stomach; now she squeezed her fear into it with one sweaty hand, taking care not to hurt Grivi with the other as they walked. Selemei turned Ustin’s excellent political advice over and over in her head, but there was no guarantee Erex would listen. Chances were, he’d scold her and send her home to grieve.\n They reached the hallway. Erex’s office was across from Fedron’s; at her back, she could feel Xeref’s office whispering of emptiness. She shivered, squeezed Grivi’s hand, and knocked on the Arbiter’s office door. The door swung silently inward.\n “Lady Selemei,” intoned Erex’s Kuarmei from behind the door.\n “Come in, Cousin.” Erex stood before his desk with fingers tented against his lips. He gestured to a cushioned chair. “Please, sit down.”\n Gnash it. Gnash all of it. She let herself be led to the seat, and seated in it. If she hadn’t feared her leg might fail her, she might have preferred to face Erex nose to nose. On the other hand, his position of Family authority lent him more magnitude than his physical size. Selemei clasped her hand tightly around her left wrist; sharp rubies pressed into her skin.\n My blood is precious. The Family doesn’t deserve my life.\n Erex leaned back on the front edge of his desk. “I’ve been thinking of you and your family in this difficult time,” he said. “How have you been feeling?”\n She didn’t trust this kindness. “I’m coping.”\n “And how are the children?”\n She almost told him. The boys were suffering most after the loss of their parent and mentor; Xeref had been less close to the older girls, so they were less affected; while Pelli was sad, but didn’t truly understand. But this was a distraction, possibly even a trap. “As well as can be expected, given the circumstances.”\n Erex waited. Testing her with silence. Selemei stared at her hands, at a single sparkling ruby drop that had escaped her grip, and outlasted him.\n Erex cleared his throat. “Cousin, I received a messenger from the Eminence Indal yesterday. Do you know what he came to ask me?”\n She nodded, but kept her eyes on the sparkling ruby, as if it were a wysp that could give her good luck.\n “In fact, I was shocked,” Erex said. “Indal’s Jex stayed for several minutes, to pressure me into providing an immediate answer. And I might have, if I hadn’t already spoken to Fedron. He told me to wait.”\n Selemei spoke softly. “Cousin Fedron understands the bind the First Family is in.”\n “He does,” Erex agreed automatically. Then he twitched, as if he’d suddenly awakened. “Do you?”\n Selemei’s heart banged inside her chest. She tried to keep her breath level, and hold Ustin’s advice steady in her mind. “The bind the First Family is in,” she said slowly. “Yes. I understand that the Family failed to deliver its chosen substitute to a critical meeting, and that if I hadn’t been there, we would no longer have any claim to the seat. At the same time, I realize it would be very difficult at this point for us to sue for permission to seat a second replacement.”\n The Arbiter clearly hadn’t expected her to answer. He seemed flustered for a second, but then resumed his scolding. “In fact, Selemei, we could be embroiled in the courts for years because of you.”\n “Because of me?” she asked. “Not because the Family couldn’t keep quiet about their plan to bring Cousin Garr back from Selimna?”\n Erex frowned. “Who told you that?”\n Ustin would have said, I don’t know. “Isn’t it public?” she asked. “Speaker Orn informed every member of the cabinet. If I hadn’t attended the meeting, the Third and Fifth families would be using their connections to the Heir and the Eminence to bully their way into our seat right now.” She shifted with a deep breath, readying for a risk. “And actually, there’s no need for any legal dispute.”\n “That’s where you’re wrong, Cousin. Every Family has an interest in ousting us. They’ve wanted to see the First Family weakened for years.”\n Her racing heart tried to leap out her throat, but she said it. “They can’t do anything if I become the First Family’s cabinet member.”\n “You’re not serious.”\n Selemei released her wrist and leaned forward. “Cousin, let me try. It would keep us out of legal trouble. The others in the cabinet might let me stay, because they’ll think the First Family has been weakened.” She couldn’t help a bitter laugh. “Especially after I fell down in front of the Heir.”\n Erex stared. For a moment she thought she had reached him, but then he shook his head.\n “This isn’t you talking, Cousin. You know the right things to say, but you must have learned them from someone else.”\n Gnash it! She didn’t speak the words aloud, but in her blood, anger burned with the heat of Father Varin. “I am being advised by Imbati Ustin,” she said. “In precisely the same way that you are advised by your Kuarmei.”\n Erex glanced at his manservant. Imbati Kuarmei stood coiled and still, her face expressionless. “My Kuarmei is a gentleman’s servant,” Erex said. “So is Imbati Ustin.”\n “By tradition. But there’s no law saying she can’t be mine. It would be quite simple for me to compose an inquiry.” And Grivi’s earnestness had convinced her of one thing. “The Imbati Service Academy would witness the contract without objection.”\n Erex started to reply, thought better of it, then circled behind his desk and leaned one hand on it, frowning. With the other, he started flipping through a stack of thick papers.\n “You understand, I’m sure, that I represent the Family, and it’s my job to know what’s best for you,” he said. “I would expect you to know that promoting the Race must come before our personal desires. It’s clear you’re feeling much better, and I’m glad of that. In fact, you were always quick in recovery. We should take advantage of that, going forward.”\n Now she recognized the papers, and felt Varin’s heat drain out of her. Gods have mercy—those were partnership solicitations. Elinda’s gentle breath raised hairs on her neck, cold as the space between stars.\n This was an entirely different fight, one in which she stood alone. Xeref could no longer claim her. The law he’d written to protect her was powerless. Nothing Ustin had said was remotely relevant—indeed, how could it be? Even Grivi, who always swore to protect her, could do nothing here. He could only wait, and hope to keep her alive after she’d already been used.\n Tears pricked in her eyes. She’d been here before: sitting in just such a chair, in another office a few doors down the hall. The Arbiter of the Fourth Family Council had smiled at her paternally, indifferent to her fear of eager and powerful older men. He’d told her what Erex told her own Enzyel not long ago—what he was telling her now: that she should be grateful at the prospect of a partnership that would sever her from her parents and every cousin she had ever trusted.\n There was a difference, this time. Erex wasn’t sending her out. He was trying to keep her in.\n “I still have a family, you know,” she said.\n Erex made a small, tight grimace, not exactly a smile. “That won’t be a problem.”\n Selemei closed both fists. “I’m afraid it will.”\n “Please, Cousin. Let’s be serious. These men are—”\n Selemei stood up. “Yes, let’s be serious. I have no partner in the First Family, and that means I’m not your cousin.”\n “What?”\n “I belong to the Fourth Family.”\n Erex waved hands at her. “Selemei, you can’t mean that. Your children are First Family; surely you wouldn’t wish to be separated from them!”\n “I don’t,” she agreed. “But I wouldn’t be. At least, not while the suit remained—embroiled, as you say—in the courts. I imagine that could take quite a long while. I’m thirty-seven now. So many things could happen while you waste your resources on a legal fight. I could lose my fertility. I could die. I could make public statements regarding the dealings of the First Family.”\n To see him twitch gave her shameful pleasure.\n “Or, you could set those papers aside, and write a letter to the Eminence Indal informing him that I am Xeref’s legitimate replacement.”\n “Crown of Mai,” Erex swore. He sank back into his chair, shaking his head, but he did move the pile of papers to one side, and took up a pen and a blank sheet.\n Selemei watched him write without moving. “Grivi,” she whispered. Grivi moved closer, though he kept a cautious distance from Erex’s Kuarmei; he watched until Erex folded the paper and instructed Kuarmei to deliver it, then returned to his station behind her shoulder.\n When Kuarmei had left the office, Erex sighed, “You’re right in one sense: it would save me a great deal of trouble. It won’t work, though. They’ll never let you keep it.”\n Selemei stood up, straightened her skirts, and took Grivi’s arm. “I guess we’ll see.”\n Selemei walked by herself. Place the cane at the same time as the left foot, shift weight, then step onto the right foot and move the cane forward. She’d worked her way up—from the private drawing room to the sitting room, then the bedroom and the dining room with its chairs, until she even tried walking around Pelli’s room. That proved quite the challenge, since Pelli loved the shiny cane, and danced around her making wild sounds of delight—and it gave her a confidence she hadn’t expected. Her second turn around the sitting room, however, felt like procrastination. Corrim and Aven would be home from school soon, and she had to face some uncomfortable conversations.\n Would Brinx be angry if she interrupted his work? Would he hate her for trying to take Xeref’s place?\n And how could she dismiss her Grivi, who had always stood by her, especially when she didn’t know if this would last?\n Click-swish: the front door. It was still too early for the children. Unless someone was ill . . . she held her breath.\n “Good afternoon, Master Brinx,” came the First Houseman’s voice.\n “Brinx!” Selemei cried. “Is everything all right?”\n Brinx walked in through the vestibule curtain with a strange look on his face. “Mother, Fedron just sent me home saying I needed to talk to you. He said there was some important news for the Family, but you had to be the one to tell me.”\n “Oh, Brinx, treasure . . . ” Adrenaline tingled through her spine, in her fingertips.\n “What’s going on? Are you taking a partner?”\n “No, treasure, it’s not that. It’s a bit more—unprecedented?”\n He stared at her for a second. “Unprecedented? Is that why everyone’s acting so weird about this? Even Erex wouldn’t say a word, and I can always get him to say something.”\n Selemei took the leap. “Treasure, I’m going to be taking your father’s seat in the Cabinet meeting this afternoon, representing the First Family.”\n “What?”\n “And Fedron and Erex will be supporting me.” I hope.\n Brinx was rarely speechless, but this time she appeared to have overwhelmed him. His attempts to respond flashed wildly across his face, one after the other. May Sirin grant that he not conclude in anger.\n “Please understand,” she said. “It’s for the Indelis proposal. Your father and I designed it . . . ” The words touched the unhealed wound in her heart; her voice quavered. “I couldn’t bear to let Xeref’s last gift to us vanish without defending it.”\n “Oh!” Brinx exclaimed, and his face melted. “Oh, Mother. I—yes, of course it’s for Father . . . ” He came close, wrapping his arms around her without another word. Under her cheek, his chest heaved. His arms tightened, and he gave a ragged gasp. The grief he’d been trying to hide burst out, powerful as the river Endro beneath the city.\n “My treasure,” she murmured. She closed her eyes and rubbed his back with her free hand, riding the river with him while he sobbed. When she opened them again, she discovered Aven and Corrim had come home without her noticing, and now stood by the vestibule curtain staring at them, perhaps in shock at seeing the eldest in tears. Selemei beckoned them into the embrace, and for a time they all held one another. Then she cleared her throat.\n “Let’s hang the globe.”\n Brinx released her slowly, and put his arm around Corrim. Aven took Selemei’s hand. They walked together through the double-doors into the private drawing room. Here, the moon-yellow of mourning was everywhere: scarves had been draped over couches and chairs, and though the gifts had been opened, the hundreds of yellow cards that had accompanied them still hung along the stone walls. In the days since the funeral, the Household had installed a wire that dangled from the stone vault of the ceiling in one corner. Someone had also clearly been listening behind the walls just now, because no sooner had they all entered than Imbati Ustin and Imbati Grivi emerged from the master bedroom. Ustin set up a stepladder beneath the wire, while Grivi brought the globe in its wooden box, and held it out to Selemei with a bow.\n “Pelli?” Selemei called. “Can you come out, big girl?”\n The door to the girls’ rooms opened, and Pelli trotted out with her Verrid following behind her. “Mama?”\n “We’re going to hang the globe for your father,” Selemei explained. “It’s fragile and we’re going to be very careful.”\n “Care-ful.” Pelli trotted up, and patted Selemei’s skirts as softly as she did her sleeping sister, laying her cheek against the silk. She then proceeded to do the same to Brinx’s leg, and to Corrim and Aven.\n Selemei opened the box that Grivi still held. She extracted the globe from its padded nest, careful to protect the hook and wire attachment dangling from the top. She lifted it to her lips and kissed the engraved glass twice—once for Enzyel, and once for herself. Then she passed it to Brinx for a kiss, and he passed it to Corrim; Aven took it for herself and then held it out for Pelli, with Imbati Verrid standing attentively by.\n Pelli leaned her white cheek to it and whispered, “Cold . . . ”\n Aven brought it back, then, but Selemei shook her head. “Thank you, darling, but I can’t use the ladder. Brinx, will you hang it?”\n Brinx nodded. He climbed the three steps and reached up—the globe had to be hung higher than the carven cornices, or it would not appropriately represent a star—and attached the hook and wire. The element at the center of the globe lit: dimmer than a wysp, promising neither cheer nor fortune, only a solemn, enduring reminder.\n “Thank you,” said Selemei. She kissed them, eldest to youngest, each one so alive, so precious, so fragile. “I’m sorry, but I need to ask you to stay out of the sitting room for a few minutes. I have to go out at four, and I’d like to speak with Grivi and Ustin in private before I go.”\n The two servants walked out with her. Surely they knew what this was about; surely they could see how she dreaded it. She didn’t sit down, but faced them with her back to Xeref’s office door. Grivi was the broader of the two, his strength evident even through his formal manservant’s suit; Ustin stood out for her height, the muscles of her arms hidden inside long black sleeves. The similarity of their bodyguard stances hid the fundamental differences in training that made this conversation necessary.\n “You both know what I’m going to do,” Selemei said. You know it’s crazy. “I don’t know if it will work.”\n Ustin nodded acknowledgment; Grivi remained motionless.\n “I’m going to try one more time to represent the First Family on the Eminence’s Cabinet.” Saying it sent a rush of cold up behind her ears. “This time they won’t be confused. I won’t have any benefit of the doubt. If I make any errors, or even if I don’t, they may vote me out. Therefore, I would like to request that Ustin act as my manservant, just for this afternoon.”\n “I am willing,” said Ustin. “Grivi?”\n Grivi said nothing.\n “I’m so sorry, Grivi,” said Selemei. “I don’t want to be unfair to you. You’ve always been faithful. You have kept me upright so many times—truthfully, you have kept me alive. But I have to try this.”\n Grivi’s reply was barely more than a whisper. “Mistress, you witnessed my vow of service. Please understand how difficult it is for me to watch you put yourself in danger.”\n “I do understand. But if I let you protect me now, I won’t be able to protect anyone else. This isn’t just for the sake of my own life, or even my daughters’ lives, but for all the ladies of the Race. I have to try to pass the Indelis proposal. This is my wish.”\n Grivi bowed. “So let it be, then. May I be excused?”\n “Yes. I’m really sorry.”\n A good deal of her courage departed with him. Just for this afternoon, she’d said, but it still felt final; in good conscience she’d have to consent to release Grivi from his contract if he requested it, even if she failed. She walked slowly to the nearest couch and sat down, staring at the kuarjos-board without really seeing it. “I don’t know how to do this, Ustin. I’m not Xeref.”\n “Mistress, let’s focus on today,” said Ustin. “You’re correct in your concern: it’s more than likely the cabinet will again attempt to declare the seat empty. Fedron supported you in the last vote, and I imagine he will support you again, but we can’t be certain he won’t have come under outside influence up to and including blackmail. For this, and for the Indelis proposal, you need to cultivate allies.”\n “Fedron is it, though.” Selemei shook her head. “Unless he can bring allies of his own. I don’t know any of the others. Who is the bald man? The one with the big voice—he was kinder than most of them.”\n “That is Cabinet Secretary Boros of the Second Family, Mistress. He had a cordial relationship with Master Xeref; they spoke often, and occasionally co-sponsored proposals. He would make an excellent ally. His good opinion is respected.”\n “What am I supposed to do, though, invite him to tea?”\n “I don’t believe there’s time for that just now, Mistress. We should be going, so we don’t have to hurry.”\n “All right.”\n Perhaps she’d practiced too much walking today. The way to the meeting felt interminable; the cane was awkward in the cramped spiral stairway. When she reached the top, Selemei realized how far they still had to go, and huffed in frustration.\n “How did Xeref ever do this?”\n “It’s true the walking was easier for him, Mistress. But you must remember, he didn’t do the job alone. He had four assistants.”\n She couldn’t imagine having assistants. “And he had you.”\n “Yes, Mistress.”\n They passed the Heir’s suite—merciful Heile, please don’t let the Heir come out and see me—and entered the hallway. Several men stood not far ahead. Cabinet members. She was starting to recognize some of them.\n “Tell me who they are, Ustin,” she whispered.\n “You know Secretary Boros. Behind him is Amyel of the Ninth Family, one of Master Xeref’s allies. Beside him, Caredes of the Eighth Family . . . ”\n The men stiffened and grew quiet as they drew closer. Selemei held tighter to the handle of her cane, placed it more carefully, stepped in measured cadence with her head high. The door was just beyond them. She’d have to walk between Secretary Boros and Palimeyn of the Third Family. Palimeyn was leering at her, holding something in his hand—it looked like a glass, but he didn’t hold it like a drink. Still several steps away from them, she hesitated.\n “Excuse me, gentlemen.”\n “Good afternoon, Lady Selemei,” said Boros.\n Palimeyn took a single step forward.\n Ustin flashed past her, and for a split second, she thought she’d attacked Palimeyn. The Third Family man grunted and stumbled backwards. His manservant feinted toward Ustin, but then backed off also.\n Selemei clung to her cane, her heart pounding.\n Ustin returned. She’d taken the glass; Selemei didn’t like the look of its brownish contents. “My apologies, Lady.”\n Boros looked between her and Palimeyn, frowning. “I think we should go in,” he said. “Lady Selemei, will you come with me?” He offered his elbow.\n “Thank you,” she said, but placed both hands on her cane until his arm dropped. Then she followed him in, noticing that Ustin still blocked Palimeyn from approaching her. It was alarming—and felt worse because Ustin had to stay behind on the threshold. Selemei ignored the staring eyes of the ancient Eminences, refusing to rush just because so many men were coming in around her, and walked steadily to Xeref’s chair—her chair, Mai willing. Ignoring hissed insults, she leaned her cane against the table, carefully pulled the chair out, and sat down. She almost wound her hands in the chair again, but this time, folded them in her lap. She tried to barricade her ears against the whispers, and waited for Fedron to take the seat beside her.\n Just stay calm. Just stay.\n Fedron was late. Well after the Heir and Eminence had already been seated, he backed in the door, harried by another man who must have been yelling at him for some time. She heard only, “ . . . if you know what’s good for Varin and the Race!” before the man relented and went to his seat. She counted chairs—he was Fifth Family. Fedron grunted, and took the chair beside her with scarcely a glance in her direction.\n “Let’s get started,” said red-faced Speaker Orn. The Manservant to the Eminence intoned his ceremonial speech; before the final words were fully out, the Fifth Family man stood up.\n “First order of business must be the empty seat.”\n Fedron grasped the edge of the table with one hand. “The seat is occupied; we already voted on this in the last session.”\n “You’re pathetic, First Family,” the man retorted. “You fail to bring your substitute. You bring us—” He waved a hand at Selemei. “—this, instead. You’re still trying to cling to power after the battle is already lost. Well, no one’s laughing.” While he spoke, his gaze never left Palimeyn of the Third Family, as if everyone else were just the audience for an impending confrontation between them.\n “I agree,” Palimeyn said. “Let’s vote on the empty seat.”\n The Heir said softly, “Your Eminence?”\n The Eminence sniffed through his noble nose. “I agree; we should vote.”\n Selemei shivered. This was entrapment, carefully planned, kuarjos-pieces precisely placed. The Heir was Third Family, and the Eminence was Fifth. Those two families and their representatives would have spent the days since the last meeting wearing down the other cabinet members. How many had been harassing Fedron? How long would he endure this for the sake of a female cousin?\n “Fine,” said Speaker Orn. “Cast your votes.”\n She couldn’t watch them. These were men with years of history between them, layer upon layer of alliances and schemes, and here she’d been dropped into it blindfolded.\n The Manservant to the Eminence examined his vote reporting device, and bowed. “A unanimous vote is required to certify an empty seat. I count six votes in dissent. The seat remains occupied by the First Family.”\n Had she heard that right? Six? For a split second she glimpsed the kuarjos-pattern: herself, standing upon her post with Fedron beside her; Third and Fifth Families attempting to surround them, but behind their backs, another, contrary configuration. Someone hadn’t been paying attention to the rest of the board.\n Fedron emitted a ridiculous sound, like a strangled giggle. He cleared his throat. “Well, I’m glad that’s settled. Turn on her voting screen, please.”\n The square screen lit in front of her. An instant’s flash of green, then black, with a green date indicator in the upper left corner. In the upper right corner, it read, Xeref of the First Family. Selemei stiffened, bracing for the wash of grief, but by Elinda’s grace, she felt only warmth.\n “Thank you,” she whispered.\n Selemei watched Fedron as they proceeded to business. His near eyebrow would rise, and he’d cast her a glance, then move his finger to the vote button. It wasn’t difficult, though at times it was tricky to tell when a procedural vote had been called for. Slowly, her muscles unclenched. She tried to read the potential for allyship in the expressions on the men’s faces, golden or pale; she counted chairs and identified the Fourth Family’s cabinet member—he would be a cousin, and she should try to reach out to him, perhaps through his Lady.\n Then the Seventh Family’s member brought a proposal. She stared at him unabashedly, trying to remember every word he used: “Pursuant to our discussions, I move for a vote on the Selimnar Imports proposal.” Pursuant, and move, those were the keys she needed. She took a deep breath, and let it out slowly.\n A wysp drifted into the room, impudently, through an ancient Eminence’s face.\n Let your luck come to me, wysp . . .\n Fedron leaned toward her. “The First Family supports the Selimnar Imports proposal,” he whispered.\n Selemei nodded, and pressed the correct button. She waited for the Manservant to the Eminence to make his announcement of the vote result, and said it. Blood hummed in her ears; she hoped her voice wouldn’t crack.\n “Pursuant to our discussions, I move for a vote on the Indelis proposal. In memory of Xeref of the First Family.”\n Discomfort shifted through the men. Someone down the table to her left muttered, “Varin’s teeth.” But many faces fell solemn at mention of Xeref, and those men might support her. One of them was bald-headed Secretary Boros.\n “I’ll second,” said Fedron.\n On the screen in front of her, the words appeared: Indelis proposal, brought by Xeref of the First Family.\n She pressed her button in support.\n For you, love.\n The Manservant to the Eminence bowed. “I count four votes in support, twelve in dissent. The measure is retired.”\n Selemei sat, unable to breathe for several seconds. She wanted to scream, or run, but this was no longer blood in her veins—it was some awful distillation of grief and shame. The air tasted of dust.\n Fedron nudged her. “Selemei. Next vote, support.”\n These were someone else’s hands, fingers pressed to the table surface in front of her. No, they were hers, just impossible to move. Next vote, support. She forced one up, pressed the button. Made herself heartless, a machine to act at Fedron’s instructions, while passing seconds pulled her inexorably away from the moment when it should have gone right.\n No rockfall could have crushed her heart more utterly than this failure. Selemei lay exhausted on her bed, feeling its beat inside her chest, wondering why it still persisted. She’d failed to save Enzyel and Keir from the duties that would inevitably tear their bodies apart; she’d failed to save Lienne from the draining obligation that had so embittered her sister. The Race’s decline ground on, loved ones were plucked away, and one day only Pyaras would remember his mother’s name.\n “Mistress,” said Ustin quietly.\n Selemei heaved a sigh. “What is it, Ustin?”\n “If you permit me to hear what happened, I may be able to advise you.”\n The suggestion was made mildly enough, but anger flashed inside her. Selemei pushed up on one elbow. “You’re always one step ahead, aren’t you?” she said. “Here I’ve been thinking you guess what I want before I do, but really, you planned this whole thing. Why would you push me? Was it so you could wield power by being close to a cabinet member?”\n Ustin replied coolly. “I have served a cabinet member already for twelve years, Mistress. My Master cannot speak for me, but I believe he would vouch for the quality of my service. For more, you would have to contact the Service Academy. I am certain they could quickly find me other employment.”\n Guilt quenched her anger. Of course the Service Academy would stand by Ustin’s certification. And naturally someone who had been privy to the First Family’s cabinet secrets would be a coveted prize for a new employer. Xeref had said she does her job too well. Even now, Selemei couldn’t see how serving well could be a flaw.\n She sat up. “My fault,” she said. “I shouldn’t have accused you. I remember you saying you believed in the goals of the Indelis proposal. I shouldn’t be surprised that you’d want me to carry out Xeref’s plan once he was gone.”\n Ustin’s brows rose, arching her manservant’s mark. “Mistress, I shall presume.”\n Selemei steeled herself. When Grivi had taken her in confidence, it had been shocking enough; but Ustin was a formidable weapon intended for gentlemen, her loyalty pledged to no one. “Please do.”\n “Mistress, the Indelis proposal was entirely your idea,” Ustin said. “If you recall, I was not welcome at the confirmation party for your small cousin, but I stayed in the Maze and listened in case I was needed, and I heard what you said to the gentlemen of the First Family Council.” She struck reciting stance, one hand held behind her back. “‘Some of us are giving our efforts, while others are giving up our health, and others, like Lady Indelis, have given their lives. I imagine you could think of some way to protect our mothers better. Aren’t you all men of importance?’”\n “Mai’s truth,” Selemei whispered. She recognized every word, but in the Imbati’s voice, they had changed from a frustrated outburst to a powerful demand. Her skin prickled.\n “Especially after your act of courage in refusing further duties, your words struck Master Xeref deeply,” said Ustin. “You are why he created the proposal, and why he named it for Lady Indelis. He may have put your idea into the proper language of legislation, but even then, you persisted until you approved of its terms, because you understood what would benefit the ladies of the Grobal in a way he did not.”\n Selemei shook her head, amazed. Intentionally or not, Ustin had just answered a question that she’d been unable to forget. “So, that’s why you came in to find me while Pelli was sleeping. You wanted to talk to me about my courage.”\n Ustin looked her in the eye. “Courage is like a wysp,” she said. “It moves through barriers.”\n “I’m sorry I couldn’t move through this one,” Selemei sighed. “The Indelis proposal has been retired.”\n “Retired,” Ustin agreed solemnly, “with a vote of fourteen to one.”\n That wasn’t right. Selemei frowned. “No; the vote was twelve to four.”\n Ustin’s eyes widened. The corners of her mouth bent slightly upwards. But they didn’t stop there; her lips parted over her teeth, and she was smiling—really, truly smiling. Selemei had only seen her Imbati nurse-escort smile once, after she’d gone to a public event at age five and been very, very good. Now, as then, it was puzzling and strangely exciting. Selemei got to her feet.\n “Ustin, what is it?”\n “Mistress, you won.”\n “I don’t understand. Of course I didn’t.”\n “Respectfully, Mistress, I differ.”\n Selemei stared at her. “All right, Ustin, explain.”\n Ustin inclined her head. “Mistress, you presented yourself before the cabinet. You claimed the at-large seat. You negotiated for and won the First Family’s support. You attended today’s meeting, even though Grobal Palimeyn tried to sabotage you. And in spite of cooperation between Third and Fifth families to stop you, you kept your seat and were permitted to vote.”\n “Ustin, I have been nothing but humiliated. The Heir knocked me down at the last meeting. Palimeyn of the Third Family would have succeeded today if you hadn’t stopped him. My proposal failed miserably.”\n “Mistress, a man who intended to stop a threat from a rival might hire an assassin. Grobal Palimeyn only intended to throw blood on you, to force you home to change your clothes.”\n Her stomach lurched. “Heile have mercy.”\n “I can only conclude that your fall was effective in convincing them that you do not pose a real threat. Your failure to pass the proposal today has no doubt sealed that impression. Their goal was to weaken the First Family; now they believe they have succeeded. But you managed to attract three allies with no effort at all, and now you sit among them, wielding a voice and a vote.” With the grace of long practice, Ustin got to her knees and bowed her tattooed forehead all the way to the floor. “Please, Lady. Accept my vow of service. I would be honored to continue to serve the First Family’s cabinet member.”\n Selemei’s heart pounded. Suddenly, everything looked different. Yes, she’d sponsored a proposal that had been retired. It had felt like the end—but maybe it didn’t have to be.\n With a voice and a vote, now she could negotiate laws over years. The next time she walked into a meeting, she need not be a machine. She could be a cabinet member the same way she was a mother: falling and standing up again, yet always persisting, nurturing the future.\n “Thank you,” she said. “I accept.”\n Juliette Wade combined a trip to the Gouffre de Padirac with her academic background in linguistics and anthropology to create the world of Varin, a grand experiment in speculative ethnography. She lives the Bay Area of California with her husband and two children, who support and inspire her. Her fiction has appeared in Clarkesworld, Analog, and Fantasy & Science Fiction. She runs the Dive into Worldbuilding video series and workshop at www.patreon.com/JulietteWade."}