{"fingerprint": "V8pTfKjrZcCPVv4qmkqo4Y/fefg=", "sitename": "Clarkesworld Magazine", "title": "Soul's Bargain by Juliette Wade", "author": "Juliette Wade", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wade_07_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Soul's Bargain by Juliette Wade", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7170 words, short story\nSoul's Bargain\nA reading from the Book of Eyn the Wanderer:\nIn those days there were many who admired Eyn for her divine beauty, no less than for her wildness, forgetting her fierce loyalty to her lover, Sirin the Luck-Bringer. One among these was a mortal, Ruver of Meluara, renowned for his strength and speed. As many times as she rebuffed him, yet Ruver persisted in his suit, until at last, despairing of further talk, Eyn turned her back and resumed her exploration through the orbits of the dark unknown. Ruver followed running, and coming upon her from behind, cried out her name and caught in his bare hand the tips of her wild white hair. Yet Eyn had already cast off her mortal guise, and the touch of her hair struck Ruver dead.\nIn terrible anger did Eyn bear Ruver’s body back, and placing him before Father Varin, demanded his soul be gnashed in flame for this presumption. Yet then did Mother Elinda touch her with a gentling hand, and bid her look back across the distance to the place where Ruver had died. “He did wrong to follow you, yet see how far he reached beyond the deeds of other mortals.”\nAt this, Eyn relented, and gave Ruver’s soul to Mother Elinda, who placed him in the heavens as a shining star. Eyn declared, “Let his light serve as a reminder to all mortals that great things may be achieved in the name of love.”\nAs her assistant Irim finished his reading, Pelisma glanced instinctively toward him, but her failing vision could no longer distinguish him from the vague shadows. Even the bright electric lights on the ceiling gave nothing but a faint glimmer. She ached to think that not so long ago, limestone labyrinths had been her playgrounds. Now she had to rub the velvet of the couch she sat on to feel grounded again.\n“Groundbreaker, you seem distressed,” Irim said. “I couldn’t help but think of your deeds when I read this passage this morning. Was I wrong to guess that you’re a ward of Eyn?”\nPelisma shook her head. “No, Irim; I am.” Though she’d long since lost the habit of attending chapel, her life’s work in building this cavern city had been born of love. She cherished her vivid memory of the day the river Trao changed course through a sinkhole and came thundering in at the gate. A heart-shattering, magnificent sight! She’d mustered the citizens, set explosives, and blasted a new outlet to save the city from inundation. In return, the city’s Firstmost had appointed her Groundbreaker, and renamed the city of Lake’s Gate: Pelismara, in her honor.\nNow that she considered it, she hadn’t entirely left behind Eyn’s inspiration. Surely the goddess would be disappointed in her now, though—bound by her people’s adulation and her own blindness into tiny orbits that held nothing but the known.\nA light brightened on her right, and she tried not to flinch.\nAlmost nothing.\n“Irim,” she asked, “Is there a wysp nearby?”\n“Don’t worry,” said Irim. “That was me; I moved out from between you and the lamp. There’s a wysp in the room, but it’s currently drifting near the window.”\nShe shoved down the irrational fear and tried to change the subject. “So. What do we have in today’s project updates?”\nIrim’s footsteps walked nearer, while paper rustled softly. “Good news. Building the agricultural scaffolds around openings to the surface has been an unqualified success. With harvest numbers in, it looks like we can abandon those two surface fields that experienced wysp-fire disasters this year, without risking a citywide shortage.” He hesitated. “Pelisma, I’m sorry; I didn’t mean to mention wysps. I hope I haven’t alarmed you.”\n“No, not really.” Wysps were a fact of life. It wasn’t their existence that filled her with dread, so much as their new unpredictable behavior—approaching her closely, for no apparent reason. She’d never felt superstitious about floating sparks she could see. “Irim,” she confessed. “I feel like they’re following me.”\nIrim’s hand gently touched her forearm, a habit he’d developed for which she was unreasonably grateful. “Perhaps they follow you out of love,” he said. “As Ruver followed Eyn.”\n“What?” Pelisma glanced toward him, and ended up frowning at shadows. Irim reading from the Books was no surprise—he was kind and devout, qualities she’d always appreciated. But why should he cast her wysp problem in religious terms? Unless . . . “Irim,” she said, “I hope you don’t mind me asking, but are you a sectarian?”\nIrim gave a nervous laugh. “Ah, you’ve got me. Heretic, yes.”\n“I don’t mean that. I’m trying to understand what you’re saying.”\nThe couch cushion creaked as Irim sat beside her. “Groundbreaker, I—well, you’ve saved so many lives. I believe it would be natural for souls to be drawn to you.”\nSouls. Then the rumors about sectarians were true. Imagine the lonely dead, not placed in Elinda’s care where they belonged, but taking the form of wysps and drifting through people’s lives. Approaching them. Threatening and killing them? She shuddered, feeling suddenly as though a pit gaped beneath her feet.\nFrom a rational perspective, she should ask Irim questions, and let him explain how his faith addressed her fears. But right now, she wasn’t sure she could handle a theological argument. Losing her eyesight had been difficult enough; lately it seemed she was also losing her composure.\nIf she couldn’t stay rational, she would no longer be worthy of her post—and if she could no longer work for her people, for Pelismara, then what would her life be worth?\n“It’s kind of you to say so,” she said. “I believe I’d like to see my physician about this wysp issue.”\n“Doctor Olanen?” Irim asked. “Why?”\nPelisma rubbed her fingers over the couch velvet, so solid and certain. A life of cave work had taught her the solid reliability of limestone walls, level rampways and buttresses, atmospheric lamps and ventilators. Wysps were incorporeal, and thus trickier, but they had been observed in detail. Tracking their behaviors in the mines and fields had significantly reduced the risk of wysp fires. Since she could no longer make such observations herself, she must ask someone to do it for her. How else could she banish this fear?\nNot wishing to insult Irim, she said, “I’d just like to hear his opinion. Please, Irim.”\n“Of course, Groundbreaker. I’ll call him at once.”\nPelisma sat still in her brass chair during her doctor’s examination, re-analyzing every wysp experience she could recall. In the city-caverns, wysps came and went without harm, and mostly without notice. In the wild cavern systems outside the city boundaries, any wysp appearance spurred quick checks of the methane detectors, but only rarely did they cause explosions. Thinking of it, she could almost feel the tremors in her bones.\nWysps were everywhere; they could appear anywhere, often emerging out of solid rock. But what might cause them to appear?\nAs he had for the last year, Doctor Olanen always began by shining bright lights into her eyes from various directions. Then he checked her chest, back, and neck with gentle hands—the same routine that always left her feeling old and infirm. Shouldn’t it have been different this time? She’d told him to look for wysp attraction factors, not heart murmurs!\nThe doctor’s hands moved away, and Irim’s breathing quickened. Pelisma sat straighter in her chair, because Groundbreakers didn’t bend with bad news.\n“Yes, Doctor?”\n“Nothing,” said Doctor Olanen. “I can’t detect any change in your physical condition that might attract wysps. Your general health is excellent, and you’ll be happy to hear that your retinal deterioration is slowing.”\n“Well.” She tried to keep her tone light. “Thank Heile for mercy.”\nIrim touched her forearm, and instantly, she thought of souls. The stars kept to their orbits, so it was written; they cared for themselves far above, beyond the layers of rock and wilderness. Wysps, though, were unpredictable. Not entirely unlike the living . . .\nOh, heavenly Mother Elinda!\nDoctor Olanen cleared his throat. “Groundbreaker, are you sure the wysps’ behavior changed after your vision trouble began?”\n“Yes, absolutely sure. Irim would be able to tell you the precise timing. Please, Irim?”\n“Of course,” said Irim. “The wysps started approaching her closely about two months after the vision loss began restricting her routines. At first we didn’t realize the phenomenon was systematic. Only recently did we think back and realize that they’d been drifting in more frequently for some time.”\n“So you have witnessed this yourself,” the doctor said. “Not to suggest that our Groundbreaker is imagining things, but—”\n“I most certainly have witnessed it.” Irim sounded indignant. “Haunting behaviors are well-documented. Have you spoken with the survivors of wysp incidents, Doctor?”\n“I’ve treated plenty of wysp burns,” Doctor Olanen replied, brusquely. “They’re hunting behaviors, and they are well documented, but only on the surface. Underground, wysps drift randomly. You’re telling me the Groundbreaker is somehow witnessing an anomaly never recorded in more than two hundred years?”\nIrim replied quietly. “In two hundred years, there has been no one like our Groundbreaker.”\nPelisma winced.\n“Sorry.” Irim touched her forearm soothingly, but then hissed in a breath. Even without the faint new glimmer in her sight, she knew wysps were near.\n“How many?” she asked.\n“Three,” said Doctor Olanen. “They’re small, but quite—uh, bright.”\n“They generally are,” she agreed. “Are they drifting, or moving closer?”\nNo one answered. Bodies scuffled, and someone—Irim?—yelped. Pelisma opened her mouth to ask what was happening, but impatience seized her so suddenly she held her breath.\nRidiculous, this whole thing! None of us know anything! What can I do? What do the wysps want? Can they want? I have to do something—have to, just have to figure this out!\nA cold stethoscope pressed against her chest. She shuddered, gulped down the feeling and managed to say something without seeming irrational.\n“What happened?”\n“It’s all right,” said Irim, sounding shaken. “They’re gone now.”\nNot permanently, she didn’t imagine. “Irim, are you hurt?”\n“No, Groundbreaker. I tried to block one getting too close to you, and it floated straight through me—may Mother Elinda stay her hand.”\n“Did any of them touch me?”\n“No.”\n“Then why did you assess me again, Doctor?”\n“Its proximity seemed to alarm you,” Doctor Olanen replied. “Beyond a slightly elevated heart rate, though, everything is normal.”\nPelisma took a deep breath, and rubbed the cold brass of her chair. There was no question of uttering the words ‘increasing emotional instability’ in the presence of her doctor, if he already thought she was imagining things.\n“Doctor Olanen, you saw that, I’m sure,” Irim said. “Do you feel inclined to alter your professional opinion?”\n“I couldn’t say based on a single observation,” the doctor replied. “I confess, that’s not a behavior I’ve seen before. Wysp burns fall within my expertise, but their behaviors do not. I’d like to report it to a colleague of mine who researches wysps in Herketh. She might be able to shed more light on the problem.”\nSudden inspiration brought Pelisma to her feet. “A researcher—perfect! I’ll go speak with her.”\nIrim seemed flustered by the suggestion. “Groundbreaker, why not order her to come to you? If wysps seek you out during the surface voyage, we have no idea what they might do. Caution is recommended.”\nUntil this moment, caution had been all she had. “Irim, it’s only five hours travel before we’ll be back underground in Herketh, and I’ve never heard of a wysp entering a moving vehicle. We’ll have no cause to clear land or build fires. Besides, I know I’ll be safe if you’re with me.”\n“Pelisma—”\nShe smiled. “I will even let you drive.”\nAt last, some action! This was much better than foundering in anxiety and despair. As Eyn was her witness, she’d prefer to face danger out on the surface, if it meant she was still alive.\nIrim was quieter than usual today as he led her out to their vehicle. Nervous about the surface voyage, he said—but recent advances in hover technology meant that floater travel had not been seriously dangerous for a number of years. His reticence felt weightier than that, laden with the unspoken question that now lay between them.\nUnbearable. Every second made her more impatient to leave this awkwardness for the adventure of surface travel. Had he known her feelings, Irim would probably have said she was more like Eyn than ever.\nIrim helped her out to the edge of the open square, and laid her left hand on the flat cold metal of the floater car while he opened the door.\n“Groundbreaker,” he said, “are you sure we should be doing this?”\n“We must do something, Irim. I don’t prefer to wait and see whether a wysp finally sets me on fire.”\n“Mercy!” Irim said. “That’s true enough.” He guided her into the passenger’s seat.\nPelisma stroked the soft fabric of her seat, and tried to distract herself. “Could you update me on the latest construction, please? How does it look? Is our residence still so lonely?”\n“Not quite,” Irim replied, with more cheer. “We’ll be neighbors with lawyers and judges soon. They’ve started on the Court columns, and it looks like they’ll match our portico. With the shinca trunk lighting up the whole square, I think it will be beautiful.”\nPelisma smiled in relief, imagining it. The shinca tree had been what first drew her to this cavern for the residence of the Firstmost and top staff: alone in the center of a flat basin, it pierced through the ceiling stalactites, reaching up toward its branches on the surface far above. Its silver-white glow sharpened everything around, while its warmth softened the chill of the deep regions.\nOnce Irim had engaged her seatbelt, he moved across to the driver’s side. The other seatbelt clicked, and then the vehicle hummed and lifted. They drove up the rampway to the fourth level.\n“Lots of construction here, too,” Irim said. “You just wait; this will be the center of town one day.”\n“Perhaps so,” she agreed, but as the vehicle angled up one rampway after another, and the sounds of life and business grew louder, she couldn’t help feeling dissatisfied. Is this all the ambition we have left? To beautify and perfect a confined existence? It was all the wysps’ doing. The fear that now pursued her was the same fear that kept all of Pelismara below ground: a terrifying vision of death by unquenchable flame.\nIrim couldn’t be right. What possible wrongs could inspire the dead to visit such punishments upon the living? All her studies, and every event in her life converged upon one fundamental truth: that there was nothing so destructive, nor so implacable as nature, and that meant wysps must be a part of it.\nShe could feel it as they drove out. Yrindonna Forest rippled all around them, trackless except for the radio-transmitting waymarkers that allowed a driver to track direction while skirting dense thickets and enormous trees that could not be safely cleared away. The hiss of vegetation brushing against the floater’s roof and windows roused vivid memories of her last surface drive—the time they’d flushed a flock of kanguan, or that graceful, muscular oryen that had leapt out so close to their path . . .\nLulled by the floater’s weaving motions, she’d been drifting in and out of sleep for probably two hours when Irim swore.\n“Varin’s teeth! Oryen!”\nThe vehicle swerved, flinging her into her seatbelt. They hit something—a horrible crack came from Irim’s side of the floater, the vehicle rebounded at a strange angle, and suddenly they were spinning wildly. Pelisma clutched her seat.\nMake it stop, make it stop, oh, make it stop!\nThey slammed side-first into something solid. The windshield shattered, pelting her face, body and hands with chunks of glass.\nPelisma still held on, sick and disoriented, half-choking on the pounding of her heart. Had they really stopped spinning at last? She found her voice.\n“Irim?”\nIrim didn’t answer.\n“Irim! Oh, Elinda forbear!” Grief and fear rose as if to drown her, but she forced them down. No sentimentality, now: his side of the floater was hit twice, but he might not be dead. She fumbled for her seatbelt, and managed to release it. Reaching across the space between them, she found Irim’s leg: warm, sprinkled with chunks of glass. Carefully, she felt her way up his body. He was slumped against the far side of the floater, which had bowed inward.\n“Irim, can you hear me? If you can hear me, make a sound.”\nThe only answer was birdsong, wafting in on a cold breeze heavy with the complex scent of invisible green. Irim’s neck was wet with blood, but when she probed with her fingers, his neck and skull seemed unbroken.\nThere was a pulse beneath his jawline.\nPelisma gasped in relief. She should try to bandage the cut, or cuts, on his head . . . No; first, she should radio for help so someone at least knew they were in trouble . . .\nShe sniffed.\nSmoke?\nShe searched the air with her hands. Intense heat was coming from the rear of the floater, just where the fire extinguisher was supposed to be. Fire—and it was growing fast, which meant wysps would come.\nI can’t leave Irim here.\nHer fingers shook, but by Sirin’s grace, the driver-side seatbelt gave her no trouble. Pelisma gulped down panic and turned away, walking her hands across the dashboard to the passenger door. The latch clicked open easily enough, but the door was jammed. She threw her shoulder into it; on her second attempt, it popped open, and she shoved it outward. Already the smoke had her useless eyes stinging. By the time she got back to Irim, the air tasted thick. Coughing, she worked his nearer leg out of the seat, pulled at his arm and squatted to get him over her shoulders. Grip assured, she put her legs into getting him out. Some part of him was stuck; she heaved until her knees shook.\nSweet Heile, don’t let me break him . . .\nAt last he came free, and she fell face-first into the passenger’s seat.\nShe lay, panting and wheezing into the cloth. It was almost better here, but worse disaster was coming, and they might have only seconds. Thank heavens Irim was not a large man. Pelisma lifted him, but couldn’t stand—only managed to flop the two of them out the door into the brush. Bushy vegetation scratched at her face and hands, but the air was breathable. She wriggled out from under Irim and hauled at him again. Won them maybe a foot. Hauled again. A little more.\nThe fire was now a dreadful wall of heat, crackling and popping as it advanced. Surely it had already ignited whatever vines and leaves were about, possibly also the tree that they had struck. She fought for a better grip under Irim’s shoulders and surged backward, two steps, three, four, then turned her ankle and fell with Irim’s body across her legs.\nShe lay, chest heaving, limbs throbbing, waiting for death to find them.\nAll at once, the fire went out.\nWysps. Pelisma held her breath.\nIt was an eerie inverse of explosions underground. The wall of heat had vanished, as if sucked straight out of the universe. There was no more wild shapeless light; the hissing and popping had stopped. Pelisma put her arms around Irim as best she could. He was the one who had first explained to her the pattern of the survivor tales: having extinguished a wildfire, wysps could grow a hundredfold—not merely identifying anyone close enough to have caused it, but pursuing them mercilessly and punishing them with flame, while leaving the wilderness untouched.\nOn the surface, wysps ruled absolutely.\nShe couldn’t hold her breath any longer. She surrendered, breathing in loud gasps. Maybe she should have been angry to be delivered to the mercy of the wysps just when progress had seemed within reach, but all she could feel was remorse. For Irim—thoughtful, faithful Irim, lying here in her lap about to die because of her own rashness.\nA flicker came into her vision. Not just a shift in the trees overhead, because it grew brighter, until her eyes filled with light. Mercy—if she could see the wysps so well, imagine how big they must be! She tensed for the oncoming flames. Remorse swelled beyond measure, flooding her, drowning her.\nOh Irim I’m so so sorry how could I have brought this upon you?\nIrim groaned.\n“Irim!” She sat convulsively, patting over his head, shoulders, and back as if to fight the wysp-flame—but there was none. “Irim,” she cried. “Irim, are you all right?”\nThe weight of his head lifted. “Pelism . . . ” It turned into a sigh, and he fell back into her lap. But he wasn’t screaming. There were no flames, and the light in her vision faded again to shadow.\nThe wysps had spared them. But why?\nIn the forest, there were no reasons. The ground felt like solid ice, leaching heat through her too-thin clothes. The air was a turbulent ocean of sound, in which she could detect nothing familiar. Pelisma rocked back and forth, stroking Irim’s head. He was unconscious again, but he was warm. He was solid.\nShe was less so. Remorse, panic, hope and despair shuddered through her in waves.\nHelp us, o Wanderer, don’t let us die here; bless our path, and show us a way to return!\nWhat if a predator smells our blood?\nElinda, don’t take Irim from me! What will I do without him?\nThat sound—could it be a vehicle? No, it must have been a bird’s wings . . .\nAfter a thousand such waves, she could scarcely find words in her head to describe the tides overwhelming her reason. The air darkened, and the temperature continued to drop.\nWe’re going to die . . .\n“Irim,” Pelisma called, shaking him. “Irim, please.”\nStill, he didn’t answer. She leaned over him, sobbing, until she was too exhausted to continue. Long shuddering breaths didn’t seem enough to pull her fully together.\nWhat had become of her ability to stay rational in the worst of situations? Even facing the cascade and the destruction of her city, she’d been all focus, all action. But she had to face up to the truth. Since the blindness—really, since the wysp problem—she’d been increasingly emotional. Maybe this was age affecting her mind . . .\nNo, you can’t afford to say that. You’re not dead so long as you can still think.\nWhy hadn’t she thought of it before? Yrindonna forest was vast, and not all of its trees were cold. Shinca trees, too, had their crowns here, and those gave off warmth in every season.\nThough logic suggested there must be one somewhere nearby, she felt no evidence of heat in the air. Swirling breezes made it impossible to be sure what lay beyond the reach of her hands. That meant she’d have to search, in such a way that she wouldn’t lose Irim. She shifted his weight off her legs, and instantly felt ten times colder.\nHow can I leave him? What if I can’t find him again? He’ll die! I can’t let Irim die—\nIrim moaned.\n“Irim!” she cried. “Can you hear me?”\n“Pelisma . . . ?”\n“Oh, blessing of Heile. We need to move, Irim, or we’ll freeze. Can you move?”\nHe grunted. “I . . . can try. Where to?”\n“Tell me if you can see the light of a shinca crown anywhere near.”\nIrim was silent for several seconds. “Yes. I do.”\n“But?”\nHe panted a moment. “You know, we will have been expected in Herketh by now. They’ll have sent back a radiogram and the Firstmost will send searchers to our last registered waymarker . . . ”\n“Irim . . . ” She reached for his hand, and found it, sticky with blood. “I’m not sure we have time to wait.”\nHe made an uncomfortable sound. “Shinca crowns attract wysps. More than you ever see in the city-caverns.”\nMore chances to roll the same deadly dice. “Irim, the wysps have left us alive so far,” she said. “Maybe—” She took a deep breath. “Maybe we should consider that their mercy.”\nThat silenced him. Finally he said, “All right.”\nOn their first attempt to get him up, Pelisma lost her balance and nearly landed on top of him. Picking herself up for a second attempt, she braced herself better; Irim hissed in pain but managed to stand, leaning against her shoulder. They stumbled along for a few feet, but then she turned her bad ankle on a stone and fell to hands and knees, nearly bringing Irim down with her.\nCarefully, now. They couldn’t afford a bad fall, or Irim wouldn’t be able to get back up.\n“Let’s slow down,” Pelisma said. “Don’t lose your balance trying to guide me; talk me through. Tell me what obstacles you see.”\n“All right.”\nShe reined herself to a creep, testing with her feet as though navigating a limestone tunnel with an uncertain floor. Irim’s instructions were halting, and he often paused for words, but they were a way to navigate the uncertain dark. Slowly, so slowly, light grew around them.\n“Almost there,” Irim panted. “There’s a big fallen tree. Let me rest a second; we’ll have to climb over.”\nThey leaned against it for a moment. Its bark was rough, covered with ticklish moss. When Pelisma regained her breath, she felt her way over it. A wind came rushing through the forest, bringing with it the distinct wickering sound of wings. This time it also brought the breath of warmth that promised the presence of a shinca tree.\nNo sooner had she reached the other side than there was a sharp pain on her left wrist. She slapped her hand to it, and discovered the prickly body of a large insect between her fingers. Other tickles along her skin were suddenly explained; she tried to brush the bugs off, but they clung and bit, forcing her to crush them one by one. Heile’s mercy but they could bite!\nSuddenly the sound of wings came at them in a rush.\n“Pelisma!” Irim cried. He reached her, seizing her arm just as the flood rushed over them. Bird bodies bumped against her, wings struck, and feathers whipped against her face.\nThen they were gone.\n“Are you all right?” Irim asked.\n“Yes.” In fact, there was a distinct improvement. “I think they’ve eaten those bugs.”\n“There are thousands of birds,” Irim said. “They’re all perched up in the shinca’s branches.” The flood of wing-sounds began again, but this time grew quieter, as if the birds had gone off in another direction. “A whole crowd of them just flew away, but more keep coming.”\nShe could only guess from his tone that they must not look actively dangerous. “Perhaps they need the warmth also,” she said. “If we stay low beside the ground, I hope they will let us be.”\n“I hope so, too.”\nNearer the shinca, her eyes filled with formless light. The ground felt softer, flat and springy with something that might have been moss. The green scent of it heightened with every step, and the warmth drew her nearer until she touched the shinca’s glass-smooth trunk. Marvelous, marvelous heat! She set her back against it and sank down onto the moss.\nAhhhh!\nFor an instant, nothing existed in the world except heat, light, and the life pounding back into her frozen limbs.\n“Pelisma!” Irim cried.\nShe shook herself, and tried to shove the feeling away—but the warmth was too wonderful to ignore. “Irim, are you all right?”\n“A wysp,” he stammered. “A wysp—it came so close, and it was so big—it was full of fire!”\n“But it’s been hours since our fire . . . ” Could it have been following her all this time? The thought made her shudder.\nAn explosion of wings burst from the shinca crown above, drawing an invisible arc in the forest air before them. Amidst it came a feral growl, and then a shriek, before the arc completed its circle behind their head.\nPelisma pressed her back harder against the shinca. Now was not the time to lose touch with reality. “Irim, something is hunting the birds.”\n“Cave-cat,” Irim muttered. “I can’t see it clearly, but I doubt one bird will satisfy its appetite. We’re not safe here.”\n“How can we move? At least here, we have the shinca at our backs.” A cave-cat was definitely fierce enough to overpower one old woman and one half-broken man. The only mercy was that it was tangible. What could anyone do against an intangible predator?\nHow small we are here! Lost, surrounded by wilderness, cut off from all human help, and that cave-cat could pounce any second—we’ll be erased—\nThe lonely fear spiked, overwhelming her.\n“Get!” Irim snapped. “Get away!”\nShe shook her head. “What—?”\n“Wysp,” said Irim grimly. “Same one I saw before—it’s bigger than my hand. Look, as far as the cave-cat goes, we’ll be all right. The weapon I brought is still in my pocket. But for the wysp I’m not so sure.”\n“A weapon?” That turned her stomach. “Irim, that’s dangerous!”\n“What choice do I have?”\n“Cave-cat or no, an energy-thrower will only make the wysps more deadly.” She cast about for something to give him pause. “What if they’re souls I failed to save in the Trao flood, and they’re following me to take revenge?”\nIrim grunted. “I think you’d be dead already.”\nShe couldn’t argue with that. “Still, what if you miss the cat, and set the forest on fire instead? Our miraculous escape from the crash will be for nothing.”\n“Groundbreaker—I’m not sure we’ve escaped at all.”\nSo he sensed it, too. She shivered despite the heat at her back. “Why?”\n“That giant wysp is still here. Hovering, like it’s waiting for us to join it.” He grunted in pain. “And see? The cave-cat is back . . . ”\nIn her mind, the wysp seemed to be Mother Elinda’s herald, announcing her intent to take their spirits into her peace-giving arms. Would she bear them upward to the heavens, or would they remain here to haunt their own city for eternity?\nI’m not ready to die!\nIn defiance of the vision, she asked, “Can you tell me what it looks like?”\n“What what looks like? The cat?”\n“The wysp.”\n“Why do you care what it looks like?!”\nHe sounded near panic. She reached out and found his arm—unfortunately, not the one with the weapon. “Irim, give me the weapon. Please.”\n“I should just shoot now. The cat’s close enough.”\nShe tightened her grip on his arm. “The wysps will kill you if you miss.”\n“Hey, I know!” he cried suddenly. “I’ll shoot the wysp!”\n“You’re not serious—”\n“I am. It’s big enough to hit, and whatever discharge it creates should also scare the cat away.”\n“Don’t.”\n“Groundbreaker, you know all about taking risks to defy the odds. When the river came into Pelismara, you stopped it with the most incredible explosion anyone had ever seen! Besides, I’d happily give my life to save yours.”\nHe must still be concussed, not thinking clearly; if the wysp survived the hit, it might easily kill them both. Will it be fire that destroys me? Or teeth and claws? No, she had to keep her head, not give in to fear . . . . “Irim, please, humor a blind woman. Just tell me what the wysp looks like.”\nIrim gave an exasperated sigh. “It looks like—I guess, like a tangled ball of spider-silk set on fire.”\nThe image blossomed unexpectedly in her head, a gorgeous conspiracy of memory and imagination. “Beautiful,” she murmured, and in an instant the feeling exploded out of her control.\nGreat heavens, what I would give to see it, really to see this beautiful, warm, miraculous thing!\nThe weird desire was so strong it brought tears to her eyes, and throbbed within her like ripples nudging against a riverbank. Was her mind finally crumbling?\n“No,” Irim cried. “Get away, you!”\nThe wysp—it was still here. It was so brilliantly clear in her imagination, and the desire so strong, it seemed larger than she was. Let me see it . . . see it . . .\n“Irim,” she murmured, “Do you feel anything?”\nIrim’s voice tightened. “Pelisma, move away!”\nThinking was becoming difficult; moving, impossible. “No.”\n“But it’s too close to you—I can’t shoot it!”\nShe shook her head. “Irim, don’t try. Don’t worry about me. Protect yourself—you’re young, accomplished, and I’m just an old woman who can’t even see a wysp . . . ”\nLet me see it . . . see it . . .\nHis voice quivered. “But I have to save you. You’re the hero of our city.”\nIf only she could wrest the weapon from his hand! “Irim,” she pleaded. “I didn’t save Pelismara with dynamite and explosions. I saved it by creating an outlet. By letting the river flow through.”\nLet me see it, oh please, let me see it . . .\nWait. Flow through? She could feel her control eroding in the flood. If she just let go, would the surge pass by and become manageable? Or would she lose her sanity forever? She wouldn’t surrender without praying for one last bargain.\nO Wanderer, I’m ready to give myself up; only help poor frightened Irim home.\nShe stopped fighting.\nSearing heat stabbed into her head and spread outward in a shock wave of agony. Faintly, she heard herself scream.\nEverything was lost in light.\nPelisma opened her eyes.\nGlory blazed above her. A shinca crown: one perfect crystalline column dividing in two, then in two, then in two again and again, a glowing fractal tree transforming into a cloud of needlepoints against a solid black sky.\nI’m dead.\nBut she could still feel her body. If anything, her blood felt, not cold, but too warm. It hummed, and there was more of it than there should have been, filling her to the brim. Maybe that wasn’t her blood at all.\n“Breathe,” Irim’s voice begged. “Don’t leave me, Pelisma, breathe!”\nShe drew a breath, surprised it had anywhere to enter, with her so full. She couldn’t look away from the perfect clarity of the shinca crown. If she moved, surely this apparition would vanish, shrouded again by the vague shadows of her vision.\nShe whispered, “Irim . . . ?”\n“Thank Heile!” he exclaimed. “When that wysp flew through you, I thought you were dead for sure. But it’s gone now.”\n“It . . . ” Her voice sounded normal enough, but words came slowly. “It flowed through?” The pain was gone, and the strange desire too, but a feeling of presence remained. Had that emotional deluge not been her own at all? Had it been the wysp manipulating her?\nHow delightful!\nBut it wasn’t, it wasn’t! It shouldn’t be possible to feel anything resembling innocent excitement in such circumstances!\nUnless the feeling wasn’t her own.\n“Irim, the wysp flowed in,” Pelisma said. “I don’t think it flowed out again. It’s still here.”\n“Heile have mercy,” Irim said. “Has the spirit spoken to you?”\n“Spoken!” she cried. “It doesn’t speak at all!” Icy panic shot down her nerves, but melted inexplicably before it could reach her fingertips. Suddenly she wanted nothing more than to hold someone and apologize. She hugged herself, looked down instinctively—\nAnd saw a glowing golden shape against the black.\nWas this her imagination? It couldn’t be sight—but the shape was that of her own body. Her clothes, her fingernails, even the wrinkles on her knuckles, all lay like a tracery of dark lace over a golden glow within. She held her hands up, considering the folds of her palms for the first time in months, hardly daring to blink. If it wasn’t sight, then what was it?\n“Pelisma, what’s going on?” Irim asked.\nShe could hardly speak. “Irim—Irim, I can see. Do wysps see? Well, I suppose they must.” This excitement was real! She looked around.\nIt was not the forest of her memory, glowing with green. It was not the black of night, nor yet the vague mass of shadow usually detected by her failing eyes. The wilderness had changed: now it was rendered in finely detailed layers of transparency, as if built entirely of smoky crystal. It had scents, too, in a strange organization she could scarcely comprehend. Shinca stood out even from great distance, each raising a blazing crystalline crown toward the dark sky, around which wysps swirled in complex patterns. Beneath her feet, soil and rock rippled outward like deep, clear water.\nThis was not a human world. And it was no longer cold, except to Irim. Irim, who was wounded and needed rescue.\n“Irim,” she said, “stay by the tree. I’m going back to the waymarkers.”\n“Pelisma, you can’t! That cave-cat’s still out there.”\nHe was right, of course. She searched the strange landscape, but how could she identify a cave-cat in this new sense, among twenty thousand utterly unfamiliar things? “Do you see the cat?” she asked. “Can you show me where it is, so I can figure out what it looks like?”\n“What it looks like?” Irim took a deep breath and grasped her hand firmly. “Groundbreaker, it’s my job to protect you. Eyesight like yours does not get cured—certainly not in an instant. We have no idea what that wysp did to you, or why.”\n“I’m not cured,” she said. “I understand that. It’s not exactly seeing, anyway. Irim—” She squeezed his hand. “I’m not sure how to tell you this, but the wysp—it’s not human.”\n“It might be a quiet soul—”\n“It can’t be. Not unless there are folk who see through stone, for whom shinca and wysps are more real than people.”\n“Is that what you see?” He was silent a moment. “But they must be spirits of some kind. Where else would they all come from?”\nWhere else, indeed? She sought for wysps in the shinca crown above her head, and as if she’d called them, several immediately converged on her position.\nIrim gave a hoarse cry and fired his weapon.\nZzap!\nFire exploded from the shadows, a voracious living nightmare screaming alarms down every nerve in her body.\nIt felt like the river pouring in at the gate, faster every second. If she didn’t act, it would consume everything she cared about, every living thing! Pelisma leapt toward the flames, opened her mouth—\nAnd swallowed them.\nEnergy blazed inside her, buzzing to the tips of her fingers and toes, tingling in her lips, and it was full of outrage for those who would put her world at risk. She whirled, looking past the bright silver-gold column of the shinca, and found a fainter light, the imprint of accumulated heat scented with fear and anger. Out of that imprint came a quavering voice.\n“Pelisma?”\nPelisma opened her mouth to answer, but the energy within her rose in a sudden, terrifying tide. In an instant, she realized what it meant.\nNo! Not Irim, I mustn’t hurt Irim!\nShe turned, barely in time. White flame poured from her mouth, crackling in the air.\nIrim screamed.\nShe tried to stop, but there was no containing this flood. Horrified, she turned further; the edge of the torrent touched the shinca, and somehow, vanished into it.\nThat’s it.\nShe faced the tree fully, pouring this hate out in the one place where it could do no harm. Anger surged in her heart, but she fought against it.\nNo, you don’t understand! Poor Irim, poor fellow, he didn’t mean it, he doesn’t deserve to die!\nAt last the fire drained away. She fell against the shinca, shivering. Slowly, her horrified exhaustion softened with an incongruous feeling of comfort and regret.\n“Irim?” she asked, trembling. “In the name of Heile, tell me I haven’t killed you . . . ”\n“Stay away from me!”\nPelisma fell to her knees. Tears tumbled from her eyes. “Irim, it was an accident, I promise. It won’t happen again.”\nVoices called across the forest.\nShe raised her head. “Help!” she shouted. “Please, help us!”\nThe searchers came. They wrapped her in blankets, brought a stretcher for Irim. She could see its metal struts perfectly; also, the waymarkers and the vehicle that stood waiting.\n“It’s lucky you found a way to signal us,” the driver rumbled. “Otherwise we might not have found you for hours.”\n“Lucky indeed,” agreed the medic. The faint shadows that were her hands moved swiftly and busily over Irim. “The Wanderer must have been watching over you.”\n“Thanks be,” Pelisma agreed, and found Irim echoing her precisely.\n“You’ll be safe underground soon.”\n“Thank you,” Pelisma said.\nThey would be safe, wouldn’t they? How could she be sure, when the wysp might control her actions? She touched Irim’s shoulder, and her sick guilt was diluted with another incongruous feeling of tender and sorrowful care.\nShe hadn’t killed him, though. She had to remember that. When the wysp took over, she’d managed to communicate mercy.\nTo communicate.\nA pattern clicked into place, suddenly.\nHer blindness had brought feelings of sorrow and helplessness, but the serious emotional instability had begun with the presence of wysps. Since she’d hidden her feelings from Irim, there would have been no way to link them with the moment of a wysp’s approach—but here in the forest, her feelings had resisted control every time wysps were nearby.\nWhat if these incongruous emotions weren’t weakness, or age, but communication?\nImagine what it could mean to achieve real communication with this thing that was the most capricious, dangerous force in all Varin! A question leapt into her mind, full of unfiltered, helpless anger.\nWhy, wysp? Why did you turn me against my most trusted friend?\nFor an instant she found herself back in that moment, when the fire of Irim’s weapon had mixed with her memory of the Trao thundering in at the gate. The familiar awful conviction rose within her, that if she did not act, her world would be swept away.\nNot her world: their world.\nPerhaps wysps did have souls: souls suited to this wilderness as her own people were to the city-caverns, each just as easily threatened, but with no way to communicate until disaster threw them together.\nOh, praise be!\nWas this joy hers, or did it belong to both of them? Could she ever untangle the wysp’s meanings enough to answer questions about fire, and trees, and food grown beneath the sun—those questions her people so desperately needed to have answered?\nAll at once, she remembered Irim’s voice, reading reverently. Great things may be achieved in the name of love.\n“Blessing of Eyn,” Pelisma breathed. Surely the Wanderer had brought her to these events. Blindness had turned her people’s confinement into her own, changing her heart and bringing the wysps—her people’s threat turned into a personal need. What else could have driven her out into this voyage of discovery? And now her path was clear: she must learn everything possible about the wysps, their vision, and their world.\nThink how she might then change her own.\nJuliette Wade combined a trip to the Gouffre de Padirac with her academic background in linguistics and anthropology to create the world of Varin, a grand experiment in speculative ethnography. She lives the Bay Area of California with her husband and two children, who support and inspire her. Her fiction has appeared in Clarkesworld, Analog, and Fantasy & Science Fiction. She runs the Dive into Worldbuilding video series and workshop at www.patreon.com/JulietteWade."}