{"fingerprint": "gwuP22uVPtfjz6w0oYqdiCE565I=", "sitename": "Clarkesworld Magazine", "title": "Sunwake, in the Lands of Teeth by Juliette Wade", "author": "Juliette Wade", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wade_04_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sunwake, in the Lands of Teeth by Juliette Wade", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "21590 words, novella\n Sunwake, in the Lands of Teeth\n The scent of dying penetrates my sleep. I lift my head, sniff, turn ears to a sound of panting.\n Ar, no . . . the scent issues through the slots in my private door. Someone dies, at this moment, in my confronting room!\n I scramble to fours among my den room furs, stand to hind-toes, reach for the door. Call, belatedly, “Bow-bow: tell me who seeks Ru-rulii.”\n I have used Cold words—marked by the opening hunt-calls—to claim dominance over my visitor. Yet who, dying, would respond? Have my heavy-furred neighbors delivered a dying creature to me out of hatred? Do they show so vicious, vengeful at my new influence in Ro-roghell?\n “Hnnn,” whines a low voice. “Dazh. Suffer me . . . ”\n Suffer me to tread your territory, he tries to say—politeness, from the nearly dead? I pull back the bolt, step forth without saying make welcome.\n Wauuunn!\n This is my own lost youth prostrate on the pebble floor: a half-starved adolescent gutter-hound, his mane hardly more than a pup’s nape-ruff threaded with a few long hairs. A wound in his thigh throbs, livid, turning black. And beneath its stench lurks the smell of the riverbank, the Stinking District where I spent my indigent puphood.\n As I wrinkle my nose in shock, he draws breath again.\n “Help . . . ”\n A thought bites me: only the human scientists can cure this. When I lift him, he howls. His blood-fever heat penetrates the downy fur of my arms and chest. I hesitate only an instant so as not to strike him against the edges of my outer door, then hurry into the road and down the hill.\n I have regained much strength in the year since I returned to my beloved Lowlands from La-larrai City. Though burdened, and on hind-toes, I don’t stagger. If only I could run full fours, to shorten the distance. Below us, Ro-Roghell sleeps in the cool gray before sunwake: square tent-homes with their leather walls tied down, hardly stirred by the faint breeze.\n Dazh has shown brave and strong: not only to cross the river from the Stinking District in such condition, but to climb the hill to reach me past the Cold iron houses of my heavy-furred neighbors. The heavy-furred are descendants of the ice-hunters who once annexed our lands, and these, my neighbors, were chosen by Majesty Gur-gurne to dominate the people of Ro-roghell. They would contempt Dazh, possibly even kill him for his presumption. Me, they contempt already for my Lowlander’s thin fur; they speak of me behind doors as an upstart shiverer who fought on the Barbarian front and failed to die. Yet I bear Majesty’s favor, and live in my own Cold house, which Majesty Gur-gurne himself awarded me for my service in the war.\n Indeed, why should Dazh seek me? One like him, contempted by all, would wait for no help from anyone. But perhaps the people of the Stinking District still recall my birth, and have heard of my interdependence with creatures who know no Rank. Likely, Dazh hoped for human help from the first.\n I press my feet faster around the down-sloping curve, panting with the stink of the wound and with the heat of my heart-striking burden. I have given the human scientists my Warm house—one of the ancient warren-houses, tunneled into the boundary between hill and river-flat. There I spy their fat-lamp, aglow in welcome: humans know better than to keep a welcoming flame in the usual place above the door, where the hill-grasses might ignite; their lamp glows in a twisted urrgai horn plunged into the ground. They rise early!\n I struggle to free one hand for the latch, but the door swings inward. My scent will not have penetrated to their den rooms, even could their flat noses detect it. But humans need not use nose to guard; they have brought their own tools across star territories.\n The human scientist Rizvi stands welcome in their confronting room. Opulent swaths of decorative fabric cover everything but her fur-naked brown face—she baffles me. Today she wears yellow like viini grass, bright against the pebble-pressed walls.\n “Liaison Rulii! What?” she cries. No linguist, she; and her body-talk muffled by cloth, yet she makes her meanings known.\n “Bow-bow,” I demand, “Help me; this pup dies without your medicine.” My arms strain, but there is no appropriate place to lay Dazh. They will not wish his blood to stain the visitor cushions, which they impractically insist on leaving about their confronting room at all times.\n “This Aurrel wants us?” asks Rizvi.\n “Hark-hark: else he would not have come to me.” Her brows rise. “He wants human help. Quick, he dies.”\n “Quick,” she echoes. “Bring him.”\n Behind the slotted inner door, a branching tunnel leads us to a room muddled with strange smells. Round roof windows are pale circles at this early hour, no rival for the too-bright human lights. On tables of wicker and wood, humans work with metal cases and complex gleaming structures: like a distillery of ihlu crafted of silver and jewels. Their long, long narrow fingers tickle chiming sounds from glass and metal. Our entry startles them into motion like birds, but they do not retreat. They clear a table.\n Dazh moans as I lay him down, yet at last someone can help him. When I step backward, the human scientists gather around. Dazh is too sick to thrill or fear at their alienness: those impossibly flat faces, the blunt teeth, their manes of all lengths subtly shaded, their bodies hidden under the extravagant cloth that is their unifying affectation.\n Unnoticed now, I fall to haunches by the wall. My heart gradually slows, but does not bring the recovery I hope for. The ache in my limbs only worsens, tightening my war scars, burrowing into muscles where it cannot be eased.\n Ar, no—this is no longer the pain of my effort. This is the old, inescapable need.\n I have forgotten to take my medicine.\n I brought this upon myself. Years ago, in La-larrai City, I accepted a place on Majesty’s Cold Council—the first of Lowland race ever to do so, and in Majesty’s company I hoped to raise my nape-bitten people. Yet in the far north, shadowed by the snowy peaks of the Dominator’s Teeth, there is only one way a thin-furred Lowlander can escape shiver-shame and expulsion from polite company: to chew the green shoots of the molri tree. Molri, with its gift of blood-heat, and its inevitable betrayal of pain and need-sickness.\n Without humans, I might have died of it by now. But the human scientists devised a replacement medicine, urged to the project by their linguist, Parker.\n Parker, who no longer speaks to me.\n I sigh, and lower my nose upon my hands. The humans continue to speak in their languages. Hidden behind their bodies, Dazh no longer moans. I hope he does not fear. Hope, too, that he does not die. His life, more than any effort of mine, may yet prove that humans and Aurrel can trust their new interdependence—and, further, that soft human fingers have begun to subvert the control of the heavy-furred ice-hunters over my beloved Lowlands.\n Ar, Parker! Will you permit me to see you now, huntmate, to tell you our quarry is at last in sight? Have you seen how human cloth now hangs in the confronting-rooms of the rich of Ro-roghell—have you helped your scientists speak to Aurrel people of their health, their hunts? And now, a child of the Stinking District has trusted humans with his life. Wauuunn, Parker-my-brother!\n But this, too, I brought upon myself. I can’t hope for remedy.\n Human footsteps approach in the tunnel. Someone enters in a scurry, speaking a language like a horn playing alongside a grinder. I force myself up to haunches; Rizvi turns away from Dazh with her eyes wide.\n “Rulii,” she says. “A messenger comes.”\n I stand quickly to hind-toes, swallow down my pain. “Thank-thank: I shall answer.”\n I must, else the humans be taken from Dazh when he needs them most. As I walk through the tunnel, however, I scent the new arrival. She is a stranger to me—but mixed with her identity drifts another, foul and familiar: the favor-scent of the one who sent her.\n Majesty Gur-gurne.\n My skin prickles, and my mane-hackles rise. This messenger seeks me, in singular, for Majesty would never dignify humans with a direct message. He shows impatient of their very presence on Aurru. With this messenger, Majesty must intend to enforce Cold dominance upon me, even here in the Warm lands.\n My lips curl away from my teeth, but I force them closed as I reach the slotted door. With my right thumbs, I disentangle from my mane the lock of Rank-beads that mark me Royal Liaison, so it hangs before my shoulder.\n “Bow-bow!” I command through the slots. “Name your intent. Will you grapple?”\n “Belly to you, Liaison Rulii,” she replies, her Warm words accepting my higher Rank. “No challenge offered; only words. Suffer me to tread your territory.”\n This is fortunate, since I am too ill to fight well. The humans’ cushions may yet survive. “Bow-bow: make welcome; I come.”\n The messenger bows to haunches before me. False humility. She knows her own beauty: a strong fine muzzle, dense fur, and a mane streaked with white. She carries her short ears with the Cold pride of the superior race. Beneath the stink of Majesty, her odor is tinged with distaste. Does she disdain my scars, scarcely covered by my Lowlander’s fur? Bite-bite—but I hold back the urge to anger, for she will bear report of me back to Majesty in La-larrai City.\n “I bring you greetings,” she says. “Majesty Gur-gurne hungers for Lowland quarry. We have learned of a coming Barbarian offensive, and Majesty intends to confront lazy soldiers, to nip their hinds to act before Barbarians can. But first upon his path he will meet with your human scientists, and speak to them of their projects. He takes foot in Ro-roghell at three days’ pace.”\n Shock stirs my sluggish blood. Three days?\n “Thank-thank!” I bark too loudly. I refuse to show my teeth. “Majesty grants me Cold honor, yet, sniff-sniff: how should a human scientist speak to him without warming his Cold and exalted presence? Does he think of this? Does he bait me?”\n Her fine lip curls scorn. “Liaison Rulii, behold Majesty’s generosity.” With a toss of her mane, she stands, opens a beaded belt-purse at her waist, and taps a skin roll into my hand. I must suffer her to watch me open it.\n Oh, the message I find stamped within the roll! Majesty has granted our linguist Parker the Rank of Liaison, chilling him sufficiently that he may request royal audience. This is what he desired from the first! My feet urge to move, to run to him. But he is not here. I bow respect to the messenger.\n “Thank-thank: Majesty’s generosity chills me to awe.”\n “Upon the three-day morning, then,” she replies, and backs from the room.\n With surprise past, I can no longer believe what I see in my hand. Why would Majesty grant Parker Rank now, when he never has before? The scent of hidden intent sours my excitement, and I shake my mane. My pain rouses, snarling. I must return home for my medicine—yet how can I, without first informing the humans that their place here is in danger?\n My ears turn: someone is coming. Rizvi’s scent drifts through the slotted door; then she enters like a timid reghi, one careful foot placed before the other. “Dazh will live,” she says.\n “Thank-thank.” I can manage no more. This should be news of joy, but my ache tries to swallow me.\n “Rulii . . . ” Rizvi lowers her head, pats her belly—her chosen compromise for a submissor’s respectful Warm phrases. From somewhere within her clothes, she draws a small case of smooth metal, which she places upon the pebbled floor. Then she steps out.\n I know that case. I have just such a one, hidden at home within my den-room furs. Rizvi shows her knowledge of me more intimate than I had guessed, her manners better than I deserve. It is a gift from beyond star-territories, to rescue me from myself.\n I open the case with hands shaking. Inside it, unnatural light glows through layers of glass vials. I remove the instrument, steady it beneath my finger pads, and press a vial in with my thumbs—snap—like clicking teeth. I have accustomed myself to this habit; the fine needle pushes easily into the skin of my wrist. I may snarl at the sting, but it’s nothing compared to the ache of my war scars, the torn gums I suffered when I chewed the molri sticks, the hidden wounds left in my heart by my years on Majesty’s Cold Council. A small price indeed for the calm relief that now spreads through my blood.\n When no echo of my need remains, I replace the empty vial and instrument in the case and draw myself up to stand. I have a message to deliver.\n I find Rizvi with her back to me, in the room where humans work their strange distillations. Most of the humans have returned to their work, but she now waves open hands at Dazh, who shows agitated, attempting to rise.\n “Bow-bow: do not move, Dazh-dazh,” I say, quickly.\n Dazh shakes his head. “Belly, Rulii, thank—but I must not stay.”\n “Hark-hark: I stand responsible for your safety. Humans know best which action will aid in your healing. Hint-hint: please, lie still.”\n He subsides to one elbow. Rizvi looks up at me, releases a breath. “Thank. He not understand me. Dazh—” she turns back to him. “You live. For now, stay.”\n Dazh squirms, a discomfort I recognize.\n “Hark-hark,” I explain, “Riz-rizvi does not claim intimacy with you, Dazh-dazh. Her language has no Cold words.” Then a terrible thought shudders me. Have I saved this pup only to have Majesty send him to death upon Barbarian teeth in the coming days? “Riz-rizvi, hark-hark: I must tell you. That messenger came with Majesty Gur-gurne’s favor. Majesty himself arrives at three days’ pace, desiring to speak. We must prepare. Hint-hint: If Dazh-dazh remains in your care, he must be kept out of scent, else Majesty will create him soldier.”\n Rizvi sucks a breath, her dark eyes white-rimmed. “Majesty comes? To speak? How do we speak?”\n This, at least, I may remedy. “Hark-hark: Majesty has granted your linguist Par-parker sufficient Rank to speak to him directly.” My hope swells enough that I dare the words: “Sniff-sniff: Riz-rizvi, would Par-parker permit me to speak to him myself, to tell him such important news?”\n Rizvi’s scent thickens. She swallows, a movement of fear like a small animal hiding in her throat. “Rulii—” She closes fists, swallows again. “Parker is lost.”\n I don’t always bite when I’m afraid.\n No surprise that Rizvi backs from me, though—two steps, then three, before she remembers herself. She looks around at her scientists. Though most do not speak Aurrel, three have understood well enough that they now freeze, watching.\n Can I blame them if they show scared? They know what I did to Parker. Even now the memory sickens me: I played with him, having eaten too much molri; when I became ill he offered to call his scientists to help; yet molri-pleasure is always followed by molri-aggression, and in my instinctive fear I bit him, threw him—human blood on my teeth, Parker-my-brother limp against the wall—wauuunn!\n “Please,” Rizvi says, pats her belly. “Please, Rulii. Speak to me in singular.”\n Alone, she means. I nearly drop to fours in shame, but humans prefer hind-toes and I have no wish to alarm them further. With Dazh watching anxious, I back from the room.\n Rizvi takes me to one of the den chambers, off another tunnel near the confronting room. With my heart at running pace and my feet restless, I do not trust myself not to flush her from the chamber accidentally. I say nothing.\n “We know—something, of Parker,” Rizvi says. She sneaks a prey-like glance up to my greater height. “He went away, to—make new discoveries.”\n I force myself to haunches, make myself smaller, speak low. “Sniff-sniff: why?”\n “I discovered—diinnneey, yani . . . a thing, in blood. Lowland Aurrel have some ice-hunter mother-mothers, also some Hnnwan.”\n I snort. Does she claim that Lowlanders have mixed with ice-hunters and Barbarians? Ridiculous! But that thought leads to a worse. “Sniff-sniff: where did he go?”\n “The hill of urrgai teeth west of Gha-ghallo.”\n I almost bark, pant for control. “Bite-bite: Riz-rizvi, Par-parker is lost in the Barbarian lands? With Majesty upon us at close pace and Barbarian attack not far behind? This is news of horror!”\n She turns her small brown nose side to side. Light glints rich yellow and gold from her head-covering. “Listen, listen, he was—soft. He knew laws. He has a box.”\n “Sniff-sniff: a box?”\n “Humans, we made a . . . a box. He hid, in singular; he watched. He not speak to Barbarians.”\n I shake my mane. “Hark-hark: Riz-rizvi, I understand his care, but even if he has a box, I fear Majesty is too Cold for such distinctions. Par-parker must speak to Majesty upon his arrival, or he may choose to banish humans entirely.” What then will become of my life’s hunt? To return to molri now would kill me!\n “We heard Parker speak, where he hides,” Rizvi says. “If he lives, if I ask an officer, we send a shuttle—”\n “Bow-bow! Not a shuttle.” My ears cringe at the thought. “If you send one, every Au-aurrel or Barbarian at a day’s pace will hear, and Majesty will learn of it. Not soldiers, for they would talk. He must be found and returned in secret, else humans be blamed.”\n Her gaze wavers. “Maybe he not live? He is silent two days.”\n Wauuunn, Parker! But I can’t deny this possibility.\n “Riz-rizvi, sniff-sniff: how long must Dazh-dazh remain in your care?”\n Her lips vanish a moment, pressed into her shallow mouth. “Days?”\n “Bow-bow: let me speak to him, then, so he will consent to your attention. Then, I will find Par-parker.”\n She nods her head, flashing yellow; together we return to the table where Dazh lies. Already he shows improved, no longer panting with fever. The wound is utterly changed, the dead and dying flesh removed, now only a red pit in his thigh covered over with . . . saliva? Looks like saliva, but I’m certain it is not.\n “Hark-hark,” I say. “Dazh-dazh, I have been called to hunt. Bow-bow: stay with the humans, with this female, Riz-rizvi, until I return.”\n He shows indignant, rising again on both hands. “Belly, I wish to go with you. Do not leave me here among barbarians.”\n “Sniff-sniff: yet did you not wish to be brought to them?” For that, he has no answer. “Hark-hark: you did, for without them you would be dead already. My hunt takes me into the Lands of Teeth, where death snaps soldiers whole.”\n “Thank,” he says. Ducks his head, yet his scent grows daring. “Sniff, I heard you, before—please don’t tell them to hide me. I must be created soldier!”\n “Hark-hark: never.”\n “But every child of the riverbank wishes for this. How should every one of us not envy your success? The great Rulii, who fought from the Stinking District to General of Majesty’s army!”\n “Bite-bite: this you call my success? You understand nothing!” I bite down on the anger that burns my tongue; still, it struggles to escape. “Bow-bow: I go; you do as Riz-rizvi tells you, or I will no longer stand responsible!”\n I stride toward the tunnel, flushing humans from my path. The moment the outer door thuds shut behind me, I leap to fours and run.\n This is not success. I may tell myself my life’s hunt is noble, but I have been less predator, more prey, constantly in defiance of natural order. At every pace I have striven for escape. Escape from the riverbank, escape from the low Rank that flung me again and again upon Barbarian teeth, escape from the front, escape from shiver-shame—from molri—then from the lands of ice and snow.\n Becoming General was my most dangerous mistake. Now, nowhere can I escape from Majesty’s Cold attention. Humans have offered me a different path, but I must make my stand here, in my beloved Ro-roghell, else die in the attempt.\n I eat scout’s-endurance in preparation for the fasting hunt: a careful ration of salt meat cooked in urrgai fat. This is the flavor of memory, and creates Rulii soldier once again—brings Warm huntmates’ voices to my ears, Ugluu’s in my left, Llohi’s in my right. Our strength-of-three would feast together, and scout five days hungry. I would help them fasten spring-knives and helmets, and tie their armor turtlewise for fast travel; they would help me with my own battle gear. Such things are not meant to be accomplished alone, but I manage. Last and most necessary is the case that contains my medicine, tucked into my belt-pouch.\n Sun stands near its peak when I leave my house and run full fours down the hill—speed is my best ally if I wish to arrive at the hill of teeth before dark. Crowds in the market district beside the animal pens slow my passage to the river bridge where the fishers weave their traps, but on the other side, the road is clear. Residents of the Stinking District stare, but do not approach me.\n I climb the hills to the high crossroads, scent for observers in the winds that rush up the grassy slopes from north and south; finding none, I hook leather slippers over my fingers and toes so as not to leave my personal scent upon this well-trodden road. I head west toward the front.\n With each stride, running feels better. The gait of the scout returns to my limbs more easily than I had feared—perhaps the firm grip of my armor-straps reminds me. My heart eases into rhythm, and I find I’m eager to face danger in the search for Parker. My feet beat a message: I am no Councilor now, no pretender, no subject. Only Rulii!\n A long slope exhales me down into grassland, where the wind from the north moves differently: now a vast flow uninterrupted by hills, scenting of urrgai and herds of small bounding reghi. While still some altitude remains to me I glimpse a supply string far ahead upon the road: one hundred urrgai at least, some of them drawing supply carts.\n Here is why Ro-roghell hungers for a peace they have almost forgotten: this many urrgai could feed all the stark-ribbed pups in the Stinking District. How many of those pups watched, pained in the gut and mouth-watered, as this string passed them by? How can I blame Dazh for wanting to join soldiers who never run hungry?\n I bark warning to the herders, then come down swiftly upon the string. A quick succession of rumps; the occasional hoof-thud near my ear. Urrgai are never hurried: the horn-blunted beasts scarcely turn their heads. Fortunately for the secrecy of my hunt, none of the herders are known to me.\n The message of my feet becomes a chant that lulls me into distance, but hours betray my weakness. My shadow, no longer shrunken by my feet, begins to stretch toward my tail, then creeps further east as the tired sun pushes it longer—and so far yet to go!\n At last a gust of wind brings news that I have reached the front. This wind scents of Aurrel and Barbarian soldiers, ash, prey animals, and haali-blossom stink. Ugluu and Llohi hated the smell of haali; a moment, I wish for our strength-of-three, one companion at each shoulder, and my pace slows further. But when I was called to the Cold lands, I chose molri, and cut all ties. In a year free of blood-poison, I have regained much of my wasted strength; yet the sun hangs too low, my armor wears looser than it once did, and my intimacies are gone.\n May this hunt allow me to salvage the last one.\n Gha-ghallo huddles close to the fighting, a soldier’s city of small leather tents ringed by fences of bound grass. Both tents and fences are supported by dismembered pieces of the carts used to bring supplies. I leave the road, and creep low on a careful downwind path—for though I must not be recognized, how else should I assess the war, the dangers ahead? My eyes lose focus while breezes bring the city to life in my nose.\n Dust, grass, wood, ash.\n Urrgai, manure, meat, ihlu.\n My people, many of them: strangers all intermixed.\n I sniff for blood, for medicine, but scent little. The war has ebbed, indeed; in my day it rushed over us swift as snowmelt floods. I creep further along the fences, where a different scentpoint may reveal more.\n Someone familiar comes to my nose.\n I crouch lower. I do not know to fear or thrill, that I might find a huntmate lost for six years—most will have moved, or died. This one feels young in my memory, not much older than Dazh, perhaps one of the near-pup messengers of my later days before Majesty called me to La-larrai: Ghuula? Burrzhi? Olorr?\n “Burrzhi,” I whisper, my best suspicion. I can’t be sure without showing myself, and I must keep secrecy.\n But.\n I shall soon go into danger. Who can say whether I shall return wounded in the dark, carrying Parker, pursued by a belling mob? Why should I not seek a huntmate here? Should this hunt turn teeth upon me, ready help might sway our lives, our deaths.\n I turn away from the forward path, run awhile beside the fences until the wind shifts. Just beyond a wooden gate, I edge into the upwind breeze. Tension knots my muscles; I must not stay. A moment, to be sure my scent carries, then quickly I retreat downwind, bellying low between grass-shadows. I watch the gate. The sun melts slowly against the horizon, my conspirator in stealth.\n If guards emerge, I will have to run.\n Barks, laughs, and growls burst from somewhere nearby. Soldiers, who have over-drunk of ihlu.\n Then someone alone pushes open the wooden gate. I tense.\n A low bark. “Rulii?” Then a deprecating snuff. “But, bite, he runs in Ro-roghell.”\n A familiar voice; the right voice.\n “Bel-belly,” I call. “Burr-burrzhi?”\n A soft thump, as he drops to fours. His footsteps come closer. I scent him so clearly; also the favor of a superior, recently stroked into his mane. His head emerges from the grasses—wauuunn, when I knew him he had two ears! But in his mane he wears a captain’s beads.\n “Thank-thank,” I say, standing to fours, “that you come to speak to me, Burr-burrzhi.”\n His mouth gapes, and his forehead wrinkles, showing shocked. “Rulii? Now fish leap above the sun! Has Majesty sent you to offer Rank dispute to our general?”\n I bow to haunches, lower my head. “Hark-hark: no such offer. I don’t run to Gha-ghallo tonight, but scout into the Barbarian lands. Sniff-sniff: what will I find?”\n Burrzhi snorts down his scarred muzzle. “The war goes slowly in this last year, but not well. The Barbarians have moved their capital closer, from here northwest, and the lands are more dangerous than they were. The mobs have re-created themselves flower-hounds, and haali grows everywhere, a shield for ambush. I hear murmurs asking why we must still fight.”\n Would that I could share Majesty’s news of a coming offensive; yet without his favor I dare not. “Thank-thank: I have smelled the haali; your warning is well taken.”\n Burrzhi shakes his mane, near-black in the sunset. “Worse, I have scented alien on the west wind.”\n “Alien!” My heart jumps alert. “Sniff-sniff: when did you smell this last?”\n “Last night on the gusts. Belly, Rulii, but I have heard of the alien strangers come to Ro-roghell. I am happy to see you escaped their barbarous nudges. They are not to be trusted.”\n I will not show my teeth, but how can I reply? For I shall never run free of humans. Nor do I wish to! The last human officer who visited from star territories did hide her motives from us; but so did I from her. And, bite-bite: not to be trusted? Can such truly be said of any people entire?\n Of Parker, I could not believe such a thing. He would not belly to a Barbarian dominator. He cares for our trust in him—else why should he have danced around Majesty’s laws so carefully? But I must not speak of him to Burrzhi.\n “Hark-hark, Burr-burrzhi: I hunt in secret, but may soon be in need of aid. Bow-bow: if you hold care for me, keep nose to the west wind, for my quarry has gone to ground in the Barbarian lands, and I may return pursued.”\n He leans his cheek to mine. “Happy news, then, Rulii: I command the scouts.”\n “Bel-belly: happy scouts.” I lower my head. “Thank-thank: I am pleased that we find each other, to enter once again into interdependence.” Also, in raising this alert, may I leave Burrzhi better prepared to face Majesty in the days ahead.\n “Thank, Rulii,” he replies. “Run well.”\n The road does not extend far beyond Gha-ghallo, but my fighting years rise up to remind me the way. With sun below set, I keep to fours, moving more slowly through grasses tall to my chin. Hind-toes would be no better: I would reveal myself to watchers, and my eyes could do little to open the distances ahead. Here and there, old urine marks the grasses—Barbarian scouts. Once I find a camp has left a wide bald spot, a month old. I tread its edge, soft slippered hands and feet, and search the wind for more news of camps and armies. It brings mostly news of Burrzhi’s flower-hounds.\n Haali bushes have been planted everywhere, nursed for survival in this place where they do not thrive. It is against natural order. Over and over I find large clumps heavy with blood-centered blooms, carefully placed with intent to confuse. A perfect hiding place for scouts, provided they could tolerate the sickly smell. Though I keep as far from the bushes as I can, yet with each hour, my nose numbs further. The wind sends moonlit ripples to break upon my face: hush, hush.\n Then the grasses speak. My ears turn: something moves, too loud, too large for duun or reghi. The wind shifts for a mere second, but enough to betray the creature for a Barbarian male.\n A scout, ready to attack or to report my presence.\n Rulii-soldier rouses in my blood. Cautiously, I lift hands, just enough to glimpse my destination: the hill of urrgai teeth, that unexplained hump of earth amid the plain, from which massive moon-frosted stones sprout like the grass-crushing molars of our prey. Are there more, now, than when I saw them last?\n I sight my quarry racing across my path.\n I dash forward. Leap, leap—ears and nose guide my aim—leap once more above the grass, and now I see as I fall upon him: leather armor, loose ears, and long limbs, the familiar slim shape of the enemy in gleam and shadow. His hinds crumple beneath my greater weight. He yelps and whines, squirms and bites at me.\n I cuff his teeth aside and seize his neck in my jaws. A brief slide of armor, and I gulp a new grip, this time find fur-flesh-and-sinew down to the crunch of bone.\n His sounds cease.\n I release quickly, lips pulled back. The taste of Barbarian blood I have never liked, no matter how many I killed on the battlefield for my huntmates, my people, my greater ambition. This time, though, it is far worse—it drags of my shame, the memory of my teeth sinking into Parker’s soft flesh.\n I back from that thought, snort blood and haali from my nose, lift my head and listen for more scouts. Barbarian scouts run in strength-of-three as ours do, the better to fight a single larger foe, the better to scatter for escape.\n I hear nothing but grass-whispers. So I am already betrayed.\n Time shrinks to a single breath. How close is the Barbarian force? I must scent Parker at the hill of teeth, else my hunt fails!\n I pull off my slippers and run. Full fours and full length, the last caution stripped from my muscles. Grass whips my chestplate hissing like the angry zhaa; night air rushes into my lungs. The wind turns, and now I smell them: a large mob at close pace.\n Ar, misery, shall I turn back?\n Yet—wauuunn!—how should I outrun a rested mob set upon me after so many hours? Only among the teeth, sheltered by giant stones, have I any chance to fight before they tear their vengeance from my sinews.\n A belling cry rises from the approaching mob. Something bursts wet against my head. Haali smell overwhelms me—ah, I can’t breathe, I can’t breathe! Now I will never find him!\n Ahead from the hill of teeth bursts a strange call: “Ruuuuuu!”\n My ears twitch, remind me: Rulii-soldier, even should your nose be useless, eyes and ears will not let you die. But who would call from such a place, unless—\n Parker!\n I push faster. Gagging, I falter, for I am not truly Rulii-soldier of so long ago. But I reach the first stone tooth, scrape some of the stinking liquid from my face. I cast an eye back.\n Barbarians run black amid the silver grasses. Dark heads leap in the mob, now here, now there, a river tumbling over stones. Armor or no, they will tear me apart.\n “Rulii!” Parker steps out toward me.\n I shake my mane, gulp down sickness. “Parker, hide if you can’t fight!”\n “No, Rulii, come in here! Quick!”\n I follow and find Parker standing before a dark square opening. He waves hands. Yes, into the black space to escape the barking river, the bites that will shred me skin-flesh-bone. I gather my hinds and jump.\n In the black, my shoulder slams into a wall.\n A clang of metal, a flash of light. Unlike lightning, it remains bright, eye-shocking.\n Thunder comes, pounding against a metal door which Parker has just closed. The mob has reached us. Their hands, their weapons beat on our walls, and our tiny room shudders with sound.\n I gag again and fumble in my belt-purse for a cloth. My hands shake with the running hours. My cheek feels sticky with haali-juice. Oh I shall vomit!\n “Take this!”\n A wet cloth lands by my hand. I slap it to my face, rub and rub against the spot, then at last find less tainted air. I gasp breath after breath until my lurching stomach calms.\n I look around.\n This is Rizvi’s box. The room is tiny as the locker above the water-source where I hang my meat. A metal shelf contains many human instruments, four of them displays. Should I touch their surfaces, I know I will feel no pigment—in Rizvi’s company, I have tested this. The displays show grasslands in every direction, even the mob struggling outside. As their eagerness dies, the thunder slowly ebbs, until they only peer and pry at the door.\n “They can’t break in,” Parker says. “They have tried.”\n Yes, that is the voice I have wept for! Parker’s voice, his perfect Warm words—with eyes turned away, I could believe he had been suckled at the next nipple. From the first, I never could use Cold words with him—never stand his dominator.\n I wish I could smell him.\n And now I understand this Barbarian weapon, worse even than Burrzhi warned me. A sling, not for a stone, but for the juice of haali, to snuff the enemy’s senses. Such a skill I have never seen from Barbarians before. No wonder Burrzhi said the war had changed.\n “Hnnnn . . . ” I rub my nose between finger-pads and thumbs; shake my head, but it makes no difference. Why must it be my nose? Rather let my hands be weighted!\n “Rulii,” Parker says. “Why have you come here?”\n I look at him. He has grown new fur since we last spoke. Dense curls hide the brown skin along his jaw, his cheeks, and neck, joining by his ears with the black mane that stands thick from his head. His body-talk is all fear: backed into the corner, wide eyes, nostrils flared.\n I make myself smaller: press back to the wall beside the door, sit on haunches, tuck my chin. “I have come to see you safe, Parker.”\n “Safe!” He shakes his head, eyes widening further. “Ghaaad, there’s blood all over you . . . ”\n Surely this is insult; were he to stand my dominator, I should hear it in his Cold words. He wounds me, but after what I did to him I can’t be surprised. I answer softly.\n “The blood is not mine.” Though it and mine are of one color, and Parker’s also.\n “You killed someone?”\n “Yes. I killed a scout who would have stopped me reaching you. He and his would have killed me quite as willingly. We huddle trapped now because his huntmates betrayed me to the mob.”\n Parker lays long-fingered hands against his face—so flat, the tip of his nose scarcely shows. “Ghaaad.”\n “Parker,” I say, still careful in gentleness. “These are the Lands of Teeth; here, war and death surround us like skin, like fur. You should know this.”\n “I do know this. Yet I also met teeth when I ran in La-larrai City.” His words are calm, but his breath harsh in fear. “You were not to be told that I was here.”\n “Ar, Parker, I understand. I have shown barbarous to you indeed. Yet I don’t lie when I say I have no other friend. Am I to hear of your danger, yet abandon you to Barbarian mercies? Do you forget me so entirely?”\n Parker’s hands stretch his face-skin downward, release. He wrestles his breath for control, and at last his dark eyes meet mine, cautiously. “I don’t forget you, Rulii. You chose me for huntmate, when I ran alone among your people. No other would.”\n “And you chose my life, Parker, when you could have chosen my death. Every day I remember your generosity in freeing me from molri.” I lower my chin. “Perhaps this is why I felt it as ambush, when Rizvi said I should find you in the company of those who wish me dead.”\n A glance, his dark eyes less wide now. “Rulii—” He shifts feet. “They wish you dead? You, in singular?”\n “I dominated as general once. I killed a great many of their soldiers.”\n “And another tonight.” His lips pull back from his teeth—disgust. “Well. I am not in their company. Nor do I prefer them.”\n Slowly I unfasten my armor. “Parker, I must ask you about this box.”\n Parker tenses, but says nothing.\n “Your scientists built it; I know. But do your people stalk us in more places than just this one?”\n “Two,” he says. “One in the wilderness where we landed first. And one in the crags bordering La-Larrai City. We had to observe; else I could not have learned your language, known to approach you in singular.”\n I must trust him in this. Without him, I could have hunted all my life and never brought such change to my people. “Rizvi explained to me that, hiding here, you show care for the laws. Yet this distinction, Majesty may not care to recognize as you do. Likely he will notice you now speak the Barbarian dialects as though you had run here from the beginning.”\n He shrugs, like guilt. “Their language is a cousin to the Warm words. Closer than I expected.” His body eases slightly as his tongue treads his singular expertise.\n “Had you asked me, Parker, I could have told you this.”\n He tenses again: wraps his arms across his chest, tucks one hand into his elbow. A human defensive move. “Perhaps you have forgotten me, then. I have always said I prefer to learn of a people in their own words. These people name themselves Hnnwan, and precious their children just as Aurrel do.”\n “Belly, Parker,” I say, while I set my armor aside. “Yet we remain at war. And here, tonight, we pay a dangerous price for that which you prefer.”\n “I’m sorry.” Parker slides down the wall; his long legs fold up. He breathes as if to speak, once, twice, yet remains silent. He rubs his fingers over the cloth tubes that cover his legs. “I did not mean to hide from you, Rulii. When you bit me, you were not yourself. I have always understood that. I tried to return to you; wanted to walk beside you, La-larrai to Ro-roghell. Our plan, our hunt, our triumph. But though my body was healed, yet my blood ran with fear.”\n I begin to scent his meaning. “Ahh, Parker . . . ”\n “I could not return to you, only to bring you my shiver-shame which would destroy our project.”\n My head feels heavy. This fear of shiver-shame, I taught him, and not without reason. In the snowy chill of La-larrai I submitted myself to molri rather than be expelled for such weakness.\n Parker sighs. “I thought long. I had lost my courage and likely would lose any Cold honor I might have gained. I thought awhile to abandon Aurru for other star territories.”\n “Ar, no!” I lower my useless nose upon my aching hands. “Wauuunnn, belly, Parker, sorry. I understand this. You offered to help me. And you did more; you saved me from molri, though I did not understand your intent. I repaid you shamefully then, and now come to you wet with blood—it’s no wonder you shrink from me. Understand, I would sooner tear out my teeth than injure you again.”\n He nods. “Then I thought: I have run here on Aurru many years. What do I hunt for, if not the knowledge of this place, its languages and people? Better to brave the Lands of Teeth and risk the wrath of Majesty than to lose all I have hunted for so long—” He glances at me. “So I thought then. But I was discovered. A Hnnwan scout ambushed me, and as we grappled, stole my communicator. Though his blood answered a question, I have food left for only two more days. Suddenly I stood to lose far more.” He shows me his hands, a human submission move. “Until you came.”\n I rise slowly to sit. “Parker, there is a greater risk. Rizvi did not break your trust without cause. This morning we received a messenger: Majesty Gur-gurne himself comes to Ro-roghell, hungry to speak with you in singular. He has created you human Liaison and named you sufficiently Cold to speak in his presence.”\n Parker laughs—a laugh like a whine, mouth open upon his blunt white teeth, chin lifted to show his furred throat. “Ah, Rulii! A year earlier, this news would have saved us great trouble.” One of his hands moves to his side, low by his hip where he felt my teeth.\n “Indeed. Yet he takes foot in Ro-roghell in two days, and none but you or I may speak to him. I scent he intends us ill.”\n Parker wipes a hand across his lips. “He shall certainly bring ill to Rizvi and my huntmate scientists if we die.”\n “We will not die.” I toss my mane. “I shall tie on my armor, and yours; we shall run swift as wind, and fight if necessary; our soldiers wait to defend us in Gha-ghallo as we come.”\n Parker’s body tenses. He knows I bark too loud. Humans are not runners; I doubt greatly his clothes serve as armor; and we are surrounded, watched by the mobs.\n “Rulii,” says Parker, “How shall we avoid ambush if you can’t smell?”\n “Indeed, we shall not,” I admit. “I can only think to wait, to rest. The haali will diminish with time.”\n “I hope so.” Tension near Parker’s eyes shows him more deeply worried. He busies himself with displays, then opens a large panel on the wall which folds down to create itself a ledge. Onto this he climbs. “I also hope you are not troubled to sleep on the floor.”\n “I am not troubled,” I say. But as I lay my head between my hands, I remember what Rizvi told me of the discovery that sent him here. “Parker, did you truly study the blood of the Barbarian who attacked you?”\n “Yes. Much as I studied yours, before.”\n When he found my molri. “What question did his blood answer?”\n “What is the connection between heavy-furred ice-hunters, Hnnwan, Lowlanders?” Parker looks down at me, gleam in his eye. “Do you wish to know?”\n I lean my head to one side. Take a breath—his discoveries always shake me. “Yes.”\n “Long ago, ten thousand years, a group of ice-hunters came to the Hnnwan lands and stayed among them. All Lowlanders are born of their children. And still, now, children are born between them.”\n “You saw all this in blood?” But I must believe him: if humans had not seen more than color in blood, he could not have saved my life.\n “I did,” Parker says, sadly. “The scout I fought had an Aurrel father.”\n I shudder. Rulii-soldier has seen enough to know what this means. But to us, tonight, it hardly matters. Tomorrow lies in wait. Little chance remains that we will not be torn in pieces, and Rizvi be left helpless to greet Majesty when he takes foot in Ro-roghell.\n One thought brings comfort: today I have found him, Parker-my-brother; he is still alive, and he speaks to me.\n Let sleep restore both of us, or this will not last.\n Between the leaps of my running dream a Warm voice calls from the past:\n “Rulii. Huntmate.”\n The sound binds me first in armor, then in grief, for this is my fellow scout Llohi, gone four years and more, her voice hoarse with mourning. I must run to her.\n Instead, a warm, soft touch, as if with a hairless tail-tip, comes on the back of my hand. Two more join it: three touches now, side by side by side just above my claws.\n Ah, but they are alien fingers. Rousing, I smell Parker for the first time. Parker pulls his hand away; he crouches beside me, implausibly balanced upon his hind-toes.\n “Rulii,” he says. “Someone is here outside. Someone who knows your name.”\n I reply with words born out of sleep: “But Llohi runs no more.”\n Parker shakes his head. “Look.”\n His displays show the stones, and the grasslands, wide and pale with sunwake soon to come. Near our door someone paces on fours, showing exhausted—no Barbarian, but one of my own Lowland people. Such indeed was Llohi: the same dark-streaked mane, the same pale spots across her shoulders. Turned away as she is, at first I see only a body of ribs and scars, a tail held low, ears turning fore and back as if she expects attack imminent. Then she turns her face.\n “Ar, it is!” I sit up on aching haunches, wrinkle my forehead. “Llohi, alive after so long? What happened to you?”\n “Rulii,” she calls again, hoarse through the report of human instruments. “Wauuunnn, huntmate. Come out, that we may escape together.”\n “Who is she?” Parker asks.\n A wound to my soldier’s heart, I do not say. “She is open teeth ready to bite, Parker. What else can she be?” I shake my mane. “Once I ran scout beside her, but she was taken by the Barbarian mobs. We believed her executed. For her to be alive after so long hunting among Barbarians . . . ”\n “It means the Hnnwan know you’re here.” Parker grunts. “She may speak of escape, but she lies. A trap.”\n “Her hunt has not been much rewarded in these years.” Indeed, her condition rivals mine when I suffered molri-sickness. My joints ache in sympathy, and I reach for my case of medicine. “She is here to lure me out. We should answer her.”\n “No!” Parker cries. “Why?”\n I sigh. Pride, hope have no purpose now. “Today we are prey. Cornered, watched, and my nose scarcely recovered. Fight as I may, Parker, I could not stop the mob waiting to kill us. But the Barbarians—”\n His mouth-corners turn down, showing indignant.\n For him, I concede. “—the Hnnwan, to send Llohi they must have some unique intent. This will be the intent of a high general, the Hnnwan Head, or even the Nose herself in singular. Perhaps, not to kill.”\n Parker’s brows draw together. “The Hnnwan Nose is a person? Not the Head?”\n “The Nose leads the Head, Parker. So she has always done.” Ar, so many questions he could have asked me in safety! I snort, toss my mane. But the gesture multiplies my ache, threading pain along my muscles, the daily painful reminder.\n I open my medicine case, prepare the vial and needle. Glance at Parker, who shifts feet and looks away while it bites, insect-like, into my blood. The slow relief makes me sigh.\n “If we go out, they will take your armor,” Parker says. “They will take your medicine.”\n “I can fight without armor.” He understands, though, too well. My muscles tense at the thought of need-sickness. “You must take my medicine, Parker. They will strip me of all I have, but you they may not.”\n He speaks low, almost a growl. “I don’t know.”\n Now Llohi has stopped pacing; she sits on haunches outside the door. In the display I see her pant. Her thinness pains me every time I look.\n “Do you have meat, Parker?” I ask. “For two days, did you tell me? And shall you eat it all, and then you and I starve together while Majesty flushes Rizvi and her scientists from Ro-roghell? Or shall we chance that the Nose’s wishes do not include our deaths?” Majesty’s may yet, but we can escape only one pair of jaws at a time. “Think, Parker—should we go to Llohi, and live, you will scent more of Hnnwan ways than any other human.”\n Now Parker laughs, deep in his chest. “You do know me, Rulii. I hope you’re not wrong.” He glances at the display where Llohi sits between giant stones with sunwake behind her, and rubs a hand over his mouth. “Go,” he says. “Approach her. But don’t let her kill you.”\n “If you truly have meat, Parker, let me give it to her.”\n He nods and fetches three slick packets. Between us we tear them open: there is jerky inside. Then he presses his hand to the wall. A hiss, and the door disappears sidewise into a crack. I don’t bring my armor with me, only the jerky in one hand. My nose has recovered enough to smell her, and a mix of favor-scents in her mane. Perhaps she serves the Hnnwan now, and will try to kill me. Or perhaps not. I walk on hind-toes to feign I trust.\n “Bel-belly,” I call her as I used to, unthreatening. “Llo-llohi, huntmate. I have meat.”\n “Meat?” She comes on fours, a cautious nose first from behind a mass of lichen-spangled rock. But at the sight of me she stands. Her mouth gapes wet. “Rulii! So they didn’t lie to me.”\n I offer the jerky. She snatches it from my hand and sits to haunches. Three convulsive gulps and it’s all gone. She pants, but her scent is not so frightened now, nor angry. “Ooo, rrr,” she coos, softly as if to a pup, and shakes her mane. “What can have brought you to this terrible place?”\n “Hark-hark: the trapped human is my huntmate.”\n A snort. “Strange huntmate.”\n “Sniff-sniff: and have you no strange huntmates now?”\n Her tongue flickers over her lips. Her ears move here, there, searching the wind.\n I coax with another question. “Sniff-sniff: do they hunt for me and the human Par-parker?”\n “Hnnnn . . . ”\n “Hark-hark: sure, they must. But I leap to run as your huntmate again.”\n Her reserve breaks. She closes the distance between us, stands and presses her muzzle up beneath my chin.\n “You have changed, Rulii.”\n “Bel-belly: long running changes all of us.” I nod forward into her complex favor-scents. Amid layers of Barbarian favor, something disturbs me: a scent I should not know, but do. I have scented this one many times in La-larrai, always while I waited outside Majesty’s ice-fang door. “Sniff-sniff,” I ask. “Llo-llohi, have you run before in La-larrai?”\n “No!” she barks, backs from me. Shakes her mane. “I already told them; I’m not to be used by ice-hunters.”\n But perhaps by Barbarians? No matter that I suspect so, I must not incite her. “Bel-belly: forgive me.”\n Her ears twitch, and again she licks her lips. “Rulii, they come.”\n Yes—I hear them barking. My feet urge to run, as does my heart, but I only call, “Huntmate, ready yourself!”\n Parker emerges from his small hiding place. He has added another layer of gray clothes, perhaps with intent to confuse, for I can’t see my metal case. His dark eyes rest solemn upon Llohi.\n “Hark-hark,” he says, daring Cold words to claim dominance over her. “We place trust in you, Llo-llohi, huntmate of Ru-rulii. Bow-bow: stay close to us, and keep us from deadly jaws.”\n She licks her lips again, but stands to match his height. “The Nose hunts,” she says, almost whining. “My own running is aimless and of no value. I lead huntmates to death.”\n “Hark-hark!” I stand at her side. “Llo-llohi, I value you at my shoulder.” I beckon with my head to Parker. “Look, we are strength-of-three.”\n “Wauunnn,” says Llohi.\n Parker glances at me, shifts feet, showing anxious.\n But only one path lies before us. We leave the urrgai-teeth to face the mob. In the light of sunwake they are no longer simple shadows; spots and mottled patterns of white and brown move constantly among them. Spots are common among Lowlanders, but never ice-hunters; it never meant much until now. I guess their numbers above five hands. I take care not to curl my lip, though the Barbarians gape aggressively, showing full arcs of lower teeth. Once the mob has us surrounded, the nearest hand of them stands to hind-toes: six flop-eared soldiers in leather armor studded with iron, fierce enough to kill, though they stand only to my shoulder. They share some favor-scents with Llohi, but none to match the strange one I recognize from Majesty’s private room.\n “The Snapper comes at last beneath our claws,” a soldier declares. One of his loose jowls is spotted, the other gray.\n Parker gives a quiet grunt of surprise to hear me named so. I don’t move, though the high-pitched Barbarian dialect makes my mane-hackles rise. Llohi’s ears and tail show submissive, yet she keeps courage enough to stay at my shoulder.\n “We speak only to the Nose,” says Parker. Ar yes, he has learned much of their language while hidden behind his displays—even his tone hums higher, as if he speaks from throat and nose rather than chest.\n “Wai!” the jowled soldier barks irritation. “Now the draped frog speaks? Shall we next hear demands from the wind, or the grass? Or perhaps from the one who abases herself before our Nose like a hlig?”\n Llohi hints a growl, deep in her throat.\n “Growl, do,” the soldier says. “That won’t convince the Nose of your loyalty. Maybe nothing will.”\n “Bite-bite!” I interrupt in Aurrel. Once their ears turn to me, I use their dialect. “I know the Nose; she wishes to snap me with her own teeth. Take us to her, or she snaps you in my place.” I hint a step toward him.\n The jowled soldier tenses—an urge to run, which he defeats by the width of a hair. Not so certain, is he, that I don’t mean to break his neck this instant!\n He barks aloud: “Weight them!”\n Soldiers mill and bump. Two approach holding blocks, blunt hinged jaws of southern rrghin-wood which they close around my hands. Worn smooth, these blocks, and stained with the blood of past prisoners. Llohi barks outrage as the latch shuts, and the nearest Barbarian hops back from her, dances position. Two more soldiers come for Parker, but these blocks will not admit hands of Parker’s shape. Should our captors force him, he will sustain injuries—\n I growl, lunge toward the soldiers with the remaining blocks. They drop heads and back from Parker. So his hands are safe—the ease of their surrender worries me. The mob closes around us, nipping at my shoulders, pushing at my back. I walk; no choice. Amidst the dense bodies, I could not jump to fours even should my hands be freed. The heavy blocks rub my wrists, and strain muscles in my shoulders.\n Parker flexes his fingers, looks at Llohi, then at me. Llohi has been permitted fours, but she stays nearby.\n “Llo-llohi,” I call. “Sniff-sniff: will you not walk with us?”\n She moves closer, but snorts disbelief. “Rulii, your human can’t stand strength-of-three! He runs like a lop-legged roullu.”\n I glance at Parker, who says nothing. He is my friend, I want to say. If only that word could work the singular power on her that it does on humans! But I myself, despite years running alongside Parker, still struggled to accept the idea of interdependence without Rank. To anyone else, friend is only meaningless alien mouthing.\n “Bow-bow: then at least, tell us why you were sent to bait us out. Sniff-sniff: what do they want with us?”\n Llohi only snuffs in reply. But perhaps I scent an answer: loyalty must be what has kept her alive so long. If her loyalty has been questioned, she might use us to prove herself.\n Within an hour, this walking, all on hind-toes, wears my hips to exhaustion. The blocks bruise my wrists, pull burning ropes through my shoulders and neck. Gusts of scent from the clumps of haali make me snort in disgust, make me envy Parker’s snuffed nose. All the while Parker walks unbowed, shows no pain—to walk is the human’s surpassing talent. Llohi licks her lips still, and her ears never cease to move. At times she yelps—I think, bitten by soldiers out of the mob. The mob moves, bumps, flows always around us: Barbarians permit touch to huntmates as they would to littermates.\n At last we enter a wide region free of haali, and I spy the encampment ahead, upon the crest of a low hill. The wind, which blows from behind us, tells me nothing—but I have spent so long avoiding such a place! Ice thuds through my veins, and the vain old wish for molri’s careless pleasure rears its head.\n We climb slowly into the camp. The scent from La-larrai is here, faint and layered. Most Barbarian soldiers sleep uncovered, but officers mob in large dome-tents, layered over with furred leather. The leather is reghi, for Barbarians do not raise urrgai as we Lowlanders do, and a mob would expend much effort in any hunt to bring a wild one down. Each skin dangles a bounder’s long skinny hinds; the tents almost appear covered by human fingers.\n At every side, Barbarian eyes emerge to contempt us. They don’t seem busy enough for soldiers preparing an offensive. I scent three possible paths ahead: we are taken to the Head to be torn apart; we are proposed as hostages in the war; we are penned and starved. Anyway, we have no more hope of secrecy.\n I tense, look to Parker.\n Parker’s brown eyes meet mine; for the hundredth time, he glances down at my weighted hands, wriggles his long brown fingers. True, he could free me in an instant. But as I have done from the first, I shake my head. Where should we escape to, and how? I learned early that humans can’t run; by now, I would run little better.\n The breeze balks suddenly, then swings, carrying a sickening smell of blood and waste. As the ground slopes downward again, I see the cage. It is twisted of fang-wire to imitate the domed form of the Barbarian tents, but lacks any kind of floor or covering. Inside are six captives, all Lowlanders strange to me. One has recently been wounded. Their ears turn; their mane-hackles rise. One of three paths, immediate death before the Nose, recedes in my estimation. Hostages, then, or starvation—I glance at Llohi’s standing ribs, her scars.\n Llohi growls, soft and low in her throat. Her scent sharpens. “I was told to bring them to the Nose.” One of the caged captives bares teeth at her.\n “Wai!” replies the jowled Barbarian soldier. “Quiet, Aurrel.”\n The entrapping mob squeezes inward on all sides. A member of the leading hand unlocks the entrance to the cage, and they shove me forward, down the slope. Not until the barrier of wire is almost upon me do I sense that Parker and Llohi have been pushed in a different direction.\n “Parker!” I cry.\n “Rulii, I won’t leave you,” he shouts. But he’s wrong. I came into danger to keep him from Barbarian jaws—and he has my medicine! We must not be separated . . .\n “Parker! Brother Parker!” I lift the blocks they have hung upon me, shove the nearest Barbarians so they fall and scramble back. But more take their place: so Barbarians have always fought. If I attack, will they remain calm, or simply kill me despite the wishes of the Head? I see Parker and Llohi speaking, protesting to captors who will not listen. “Wauuunn, Parker!”\n Barbarians close on me like jaws; they shove me into the cage of fang-wire.\n The other six captives advance up the mudded slope, panting, hackles raised.\n I shake my mane. “Bow-bow, speak to me! I offer no dispute, no threat.”\n They continue forward. Outside comes laughter from what remains of the Barbarian mob, watching us turn upon one another. Do they not care for the Nose’s favor? Or was this her plan from the first? What have these soldiers lost, that they would attack me?\n Only one of the prisoners retains Rank beads, half-lost in her matted mane. She retains some strength, too; she leaps forward, too short a jump to strike. As I flinch she catches my hands. The weights fall free.\n Ar, relief! Without thinking, I drop to fours, but my hands have numbed, and I stumble.\n She turns to the others. “Bow-bow: enough, all of you. This is once-General Ru-rulii, now Majesty Gur-gurne’s personal representative out of La-larrai. To grapple amongst ourselves will only weaken us.”\n “Thank-thank!” I gasp. Sit to haunches, so I may rub life back into my hands.\n “I am named Dunurr,” she says.\n “Hark-hark, then, Dun-dunurr. We are caged together; we must run together as huntmates. I shall bring you all a chance to escape.”\n Some of the others snort, but Dunurr shows satisfaction in her body-talk, her scent.\n Do I deserve her trust? Do I not deceive them? But perhaps I can indeed bring them from this place. Parker remains yet uncaged: my human brother with his subtle glances and dexterous fingers. He will not forget me again.\n Time is an insidious enemy, to steal my strength from within; I fight my fear with planning. The latch of our cage is enclosed in a shell of rrghin-wood, much like the weights I wore; whenever the guard has turned away, I have attempted to defeat it, but have only managed to injure myself on the wall of fang-wire. Surely Parker’s long fingers would not struggle as mine do, but he is not here.\n I must believe Parker safe, unwounded. I must believe he shall return before night—or surely, before tomorrow sunwake when need-sickness will betray me utterly.\n I stand to hind-toes and gaze beyond the woven wire to the encampment. All but the nearest tents are hidden behind the crest of the slope. No sign of Parker, nor do I smell him—my nose is assaulted with the smell of our cage, and even during brief turns of the wind, his scent is drowned in those of our enemies. But the scent from La-larrai is here. Whoever spoke to Majesty behind his ice-fang door has walked along the wall of our cage, often and recently.\n “They will come for you.” Dunurr has sidled up to me again. The wind pushes her dark mane around her face.\n “Hark-hark: I expect nothing else,” I reply. “But my huntmates run free. They will return for me, and we may escape.”\n Her laugh is bitter. “Aliens are aliens, and Llohi is no huntmate to anyone. You will meet the Teeth first.”\n I don’t wish to stay long enough to meet the Nose’s honor guard. “Sniff-sniff: why do you say so of Llo-llohi?”\n “Why do you think she lured you here? The Barbarian Nose searches for an Aurrel spy. We have all been questioned, but only Llohi runs free; she believed that capturing you would deflect suspicion. Indeed, she wishes for the Nose’s favor.” An indignant snort. “But that, the Nose keeps for the Teeth, her beloved children. It’s an elusive quarry, indeed, that Llohi would trade our company, our lives for.”\n Dunurr’s words pain me. I shake my mane. The scent I recognize is certainly the spy; I don’t know to laugh or howl that Llohi has chosen not to betray her Barbarian dominators. “Bel-belly, Dun-dunurr: we must seek some opportunity to escape, to find Par-parker. Once freed from this cage, and fighting together, we might overwhelm sentries and gain enough distance to run.”\n A glance at me, showing skeptical. “We might.”\n Yes, we might. I could not carry Parker long, nor I believe would the others consent to do so, yet I must believe this possible.\n A new voice speaks; ice stabs into my blood. “Wai! Dunurr, still dream of escape, do you?”\n Dunurr growls. “Rregl . . . ”\n For a Barbarian, Rregl is the largest I’ve ever seen: near as big as Dunurr. His ruff stands thick at the back of his neck; something in his face seems familiar. Fur grows unusually long and uneven before his ears, under his chin. Spots dapple his flanks below a woven leather vest bearing two red stripes of Rank. He has come upon us from downwind while we spoke in ignorance.\n “And do I hear the Snapper wants to find his kept human?” he asks, then throws his head back and laughs in a low register. “That Parker creature is the most useless thing I’ve ever seen.”\n To this, Dunurr does not object. I won’t, either; it serves me better if they think him so.\n Rregl lifts his head in a signal bark. By instinct I stand, though I can’t catch its meaning.\n Dunurr murmurs, “He summons the Teeth, Rulii.”\n Yes, here they come down the hill, walking on hind-toes. I have heard tell of the fighters who guard the Head—but I never imagined them so tall, so broad. Were Parker to look into their blood, no doubt he would find Aurrel in every one.\n They gather around Rregl just outside the wall of fang-wire: a small group of two hands, each in a leather vest with a single red stripe crossing the chest, marking them his submissors. Rregl reaches inside the rrghin-wood shell and unlatches our wire cage; the submissor Teeth drop to fours in dense formation to stop any of us should we try to run.\n “Rulii,” Rregl says. His accent doesn’t deform my name as Barbarian mouths so often do. “Out. The Nose demands you.”\n I stand, for dignity, and to show that I will not flee. But as I draw near, Rregl’s scent strikes my nose. Shock raises hairs all down my back. This is the scent from La-larrai! How can it belong to a guard captain in the Barbarian lands? I say nothing as I walk to flank him. With each exhalation I doubt, yet each inhalation again confirms the impossible:\n I have found Majesty’s spy; he is one whom the Nose most deeply trusts.\n And now he leads me into the jaws of death.\n In waning light, and surrounded, I crest the hill among the tents. Rregl stalks at my hind haunch. With each step I contempt him more, that he would claim my huntmate’s skin for his own protection. The scavenger!\n This time I am pushed to a broad area where the grass has been cut short; likely reghi were grazed here to prepare the camp. Before us stands a bright red tent many times the size of the others, all draped with the dyed skins of the bounders. My escorts push me into it. Furred leather divides against my face, and I find myself in a broad circle lit by fat-lamps in globes of glass. I scent Parker, Llohi, both here somewhere and unwounded. I blink; my eyes adjust.\n “Bow before the Head!” Rregl barks. Pain breaks in my right flank—he has hit me with a whip. I fall to haunches, lower my head, but risk a glance up.\n The Head sits before me on stools made of Aurrel thigh-bones: the Nose nearest, Eyes and Ears in appropriate positions behind her. Fullblood Barbarians, these, smaller than the Teeth, each one’s vest woven of red leather with stripes in black. The gray muzzles of the Ears reflect their role as advisors, and the Eyes stare aggressively.\n The Nose stands. She carries herself with such Cold dignity that I wonder she is truly born of this flop-eared people. On her forehead she wears a jewel set in a stylized setting of copper wire, tied firmly behind her ears and beneath her chin with plaited leather: as she turns her head, it returns lamplight in red. Her eyes settle on me: one warm gold, one the cold blue of ice. I scent now why Llohi finds her Coldness compelling.\n “I thank you, my valued pups,” she says to the Teeth, with maternal gentleness. But they can’t all be her own offspring; they are too close in age, too different in markings—and I believe she would sooner gut an Aurrel than take him for consort. “Come, human Parker, I have done as you asked. Will you now speak?”\n “Yes,” Parker replies. “With Rulii here I will speak.”\n “Good.” She tosses her head. “And I will not contempt you for hunting alongside him.”\n An Eye growls behind her. “The Snapper has killed ten hands and three.”\n “Come, let’s not speak of a war no one wants.” The Nose gapes a half-smile. “We speak of humans. Your people mistook, Parker, when you chose to take foot in the far north. Aurrel were never suited to nose your bait. You should have chosen Hnnwan.”\n Parker says nothing, but presses his full lips into his mouth. His arms twitch as if at a desire to fold them.\n “My valued Rregl brought me this interesting thing. See?” From a pouch that hangs at her vest, the Nose draws a small, gleaming object I have seen before. After I bit and threw him, Parker spoke into one of those, to call for help. Parker grasps for it, but she moves it out of reach, examines, turns it between thumbs and finger-pads. “Now. Is it for such interesting things that you hoard and precious them, Snapper?”\n “No,” I answer, truthfully.\n “You see?” the Nose looks to Parker. “Aurrel do not have a mind to enjoy art, tools, instruments. Hnnwan do. I could take you to the dune lands, show you our Glasstown. Do you not wonder at our lamps? Do you realize our children drink from bowls finer than those possessed by Majesty Gur-gurne himself? What, is it for their size that you chose Aurrel over Hnnwan when you took foot here from your star territories?”\n I can smell her anger; I think Parker detects it well enough in her face, her voice. He spreads his hands—a human gesture I know well, but she may not recognize. “Great Nose, I did not choose the course of my people’s hunt here. As talker, I run as submissor among humans.” His dark eyes seek mine.\n For the first time, I wonder who did choose: was it their scientists? Their officers?\n An Ear speaks from her place beside the leather wall, in a shivering voice. “Submissor or not, you, a talker, came into our lands. Should we not expect talk?”\n Parker huffs a breath, but does not mention Majesty Gur-gurne or the laws that enforced his caution, his choice of hiding place. “Amid a war, should I have expected talk?” he asks. “When Rregl found me, he showed more eager to hunt.”\n “Parker,” I gasp, unable to keep silent. “Rregl? Was it Rregl who found you?”\n The Nose snaps to look at Rregl, scent and body-talk all disapproval. “You were not to hunt him, pup.”\n Rregl turns his guilt into a lash of his whip, stinging my shoulder like a wasp. “Silence before the Nose! If I had meant to hunt him, he would not now stand alive. He was my quarry to deliver to my great mother.”\n I snap my teeth shut. But Rregl is a spy—did he act for the Nose in this? Or for Majesty?\n “He was not your quarry,” Llohi growls. “You had your chance to lure him, and failed. Even allowed him to wound you! I was the one who brought him in.”\n “And we all know why, traitor—”\n “Enough!” the Nose barks. “Parker, the Head is willing to forget human mistakes, even your association with Aurrel rapists and killers. We are civilized. We must now enter into interdependence with you. We wish human instruments.”\n Hnnn—would humans share such things with Barbarians when they never shared them with us? One glance at Parker tells me the answer. His scent now is fear, and there is movement in the fur of his throat.\n “Great Nose,” he says, “I recognize the quality of Hnnwan civilization. Your interest honors me. Yet, as talker—as submissor among my people—I may not promise instruments to anyone.”\n “Then begin by explaining those I have seen.” She holds up the object they stole from him. “This speaking shell. The shrieking iron bird that carries people.”\n Parker bows his head. “That is a communicator. Humans fly in shuttles.”\n One of the Eyes gives a snort. “He drags feet, great Nose.”\n “No, forgive me,” says Parker. “I can’t explain them.”\n “Or you don’t wish to.”\n “Great Nose, I’m not a scientist—”\n “I didn’t bring you here to teach words I don’t understand!” the Nose snaps. She meets eyes with other members of the Head; her scent changes ominously. “I understand, now, human. This is because of the war. You refuse to explain because you’ve chosen the Aurrel aggressors. Again.”\n Parker’s eyes widen, rimmed white. “No, Great Nose—”\n “Put him with the huntmates he has chosen!” she snaps. Three of the Teeth shove Parker toward me. If we are returned to the cage, perhaps this time Parker may allow us to escape . . .\n But when I try to go to him, the Nose barks, “Not you, Snapper. You remain here.”\n “Parker!” I whisper.\n He knows my danger, once he is no longer with me. But rough hands are upon him, and teeth surround him, ready to snap. Grimacing, he must suffer them to lead him out.\n Now, only Llohi stands my huntmate, and perhaps not even she—wauunnn!\n “Snapper,” says the Nose, slowly. Each motion of her tongue strokes my name with hatred.\n I bow. “Great Nose, I did not come here to fight. I came only to find the human Parker who was lost.”\n Her Cold eye flashes upon me. “That was your first mistake, then. Your second was killing my scout.”\n Ar, I see where this path leads. I shall not shiver, but dare a leap of risk before I face death.\n “Great Nose, I will not mistake again. You must know: Rregl runs as spy for Majesty Gur-gurne.”\n “Wai!” she cries, and lunges for my face.\n I flinch—she will tear me open!—but instead she only grasps me. Her teeth cut keen discomfort atop my muzzle and under my chin, and her breath scents of blood.\n I hold very still.\n Llohi has moved nearer; I scent her fear, hear her lick her lips.\n “Nose.” This is the voice of an Ear, hoarse but unwavering. “Think of our search. We know the Snapper runs second to Majesty Gur-gurne; make him explain himself.”\n The Nose releases me, leaving pricks of pain behind. She backs by the bare distance of a breath. “Speak, Snapper. I think you lie to spare your wretched skin.”\n “Great Nose. I have never seen Rregl before today, but I have scented him. In La-larrai City, his odor issued from Majesty’s private rooms while I waited outside for audience. They have spoken together at length, at least three times.”\n Rregl shifts with a growl, but the Nose moves with shocking speed. She drags him by the muzzle down upon the layered skin floor, pins him there with one hand on his ear.\n “You!” she snaps.\n “Hnnn . . . ”\n “I know your blood; you vowed to outgrow it. Do you now reject the honor of my adoption? Did your mother’s life teach you nothing of Aurrel barbarians?”\n A thought of horror bites me: Rregl’s features did seem familiar—and Majesty has tolerated him. Could Gur-gurne have sired him amid the fighting? By what ignoble violence, and upon whom?\n Llohi howls triumphantly. “See, Great Nose, I have not betrayed you!”\n Rregl whines, with his head still held against the ground. “I followed your command, Mother! Not to hunt but to capture the human, for the good of our people! Believe me or not, as you wish, but Llohi is not innocent. She intends to help the Snapper escape.”\n “No!” cries Llohi. “He lies!”\n “Teeth, hold him,” orders the Nose. She releases Rregl to them, turns, considers me and Llohi with her two-color eyes. “Two Aurrel have done me a service,” she croons. “Llohi brought me my quarry; Rulii showed me a spy. Perhaps they should be rewarded.”\n I don’t trust the way she speaks; I remain silent.\n “Great Nose, no reward,” says Llohi. “But, just once, believe me.”\n “Come, Llohi!” the Nose barks. “You, Rulii, shall fight until death for my entertainment. Whichever survives may go free.”\n Wauunnn—I, kill a huntmate?\n We are shoved out into the merciless light near sunset. Signal barks echo through the camp; the Teeth spread out to surround us in a broad circle. If I ran full fours, I could break their thin barrier, but outside it too many Hnnwan are gathering: scavengers drawn to death. Who here would not wish to watch two Aurrel barbarians attempt to kill each other?\n Llohi’s every breath is a horrified whine.\n Rregl has been dragged out beside us. Considering him now in this harsh light, I understand something new: the fur around his face is not uneven. It has been clipped. Left untouched awhile like Parker’s, it would grow to a full mane. In Majesty’s presence, he could pass for Aurrel, pretend to stand ally. Here, he clips for the same reason: to gain acceptance among Barbarians.\n “Bel-belly, Llo-llohi,” I say, low. “What can we do?”\n “We won’t grapple long, Rulii. I am already dead.”\n “Hnn, hark-hark, even should I kill you, they will only tear me apart. Could we break free together?”\n “As much chance of that as to escape the prisoner cage,” she sighs. “No. This trap has closed. Just grant me the first jump.”\n Two heavy-shouldered Teeth shove between us, force us to opposite sides of the circle. I’ll do as she asks, if only to honor our old interdependence. Does she lie, and hide a spring-knife to end me? Shall I attempt to flee alone? No; to do so would be to invite a different snap of death, while Parker yet remains prisoner. But shall I attempt to kill her, show myself barbarian for a Barbarian’s pleasure?\n I glance at the Nose, who has had her stool of bones brought to her by a submissor, and indulgently strokes favor into his mane. “Ready!” she calls.\n Llohi, I, confront one another across the broad space of grass stubble. I pant one breath, two. I would have trusted her with my life not so long ago. Were I not surrounded by enemies, fearing for Parker and awaiting Majesty’s arrival, I might choose instead to end my life in Cold honor as Rulii-soldier.\n A sound pierces the breath of anticipation: “Ruuuuuuuuu!”\n Parker’s cry!\n My ears turn, so my head: next, Aurrel war-howls shiver the darkening air. Ranks of Barbarians burst like ants underfoot.\n Llohi dashes, not toward me, but toward the sleek-furred Nose on her bone stool.\n Upon reflex, I leap after.\n My thoughts race to catch up: Parker has escaped, has brought the other prisoners to attack! Llohi planned to jump at the Nose! The Nose will maim her! I must get there first!\n I’m not fast enough. The Nose rises with her singular speed, to make meat of the unready. But Llohi knows her, adjusts; they clash teeth. The Eyes close ranks to bite at Llohi, who snarls, tangles, struggles.\n I close the last distance. Grab one Eye by neck-shoulder and fling him in the face of Teeth closing in. Llohi goes for the Nose again, fails to grasp but shoves her scrambling backward.\n The Barbarian mob are not ants; they’ll close on us in another breath, in spite of our huntmates. If the Nose wins, Llohi dies; but if Llohi wins and the Nose dies, we die with her, because we can’t run, unless . . .\n I knock Llohi down, leap at the Nose, and snap—she does not turn teeth in time. Someone’s jaws bite at my right shoulder, but too late: I have grasped their leader’s neck.\n I stand, straining, to hind-toes.\n Llohi bites at the squirming body in my teeth, but I cuff her away.\n “Wai!” cries a voice unlike the others. Parker—ar, yes, Parker!—appears beside me. How well he knows me, for he grasps my intent instantly. “Bow-bow! Hold,” he shouts in Aurrel, then, lithe in his tongue, continues in our captors’ language: “We have snapped the Nose! Should you wish her to live, back now. We leave this place without hunters.”\n The Nose’s struggles have slowed; I lower her just enough to loosen the grip that blocks her air. She heaves for life against my tongue.\n Every Barbarian yet standing backs from us; every tail is lowered. Out of the jaws of death, now with the entire camp as my prize! Were I still General, such quarry would have seen me richly rewarded by Majesty. We can’t keep it, however; we need our lives more.\n Parker approaches, tugs at the Nose’s body in a place I can’t see; soon he produces the object she taunted us with. He studies it a moment, touches it; it glows from somewhere inside. “Rizvi.” This is the only thing I understand among the tense words he says to it. And then to me he says, “Rulii, this way.”\n I flank him; we walk with purpose from the circle, and Barbarians clear our path.\n Once among the tall grasses, though, we struggle to gain distance. My fight-passion wanes with the daylight, and pain begins in my straining jaw, my neck, my tooth-raked shoulder. Parker still holds the glowing thing in his hand, and murmurs into it. It murmurs back. Perhaps it gives him direction, when his nose will not. Slowly, one by one out of the grass, other Aurrel converge with us: the Ranked female prisoner, Dunurr, and two males whose scents I recognize from the cage. The wounded one does not appear; likely he and the others have been torn apart.\n I suck air around my teeth—would that I could breathe through my mouth! I drop to fours, but the moment my captive finds feet, she struggles, and I must dangle her again. Exhaustion will find me soon.\n “Rulii, wait,” says Parker. He searches his clothes again, this time extracts something I can scarcely see in this gap between sunset and moonwake. He brings it close, grapples for the hands of the Hnnwan Nose, smaller even than his, while her breath pleads objection between my teeth. “It’s wire,” he says at last. “I’ve tied her hands behind her back; you can let her go.”\n Behind her back? Is that possible? I won’t let go without caution; this Barbarian can still bite. When I release her, though, she falls on her face, cursing us in the name of worms and hlig, the lowest of the low. Her hands are not truly behind her, but wound to one another by wire which crosses her back. At last I can gulp the air, toss my mane.\n “We have to move,” says Parker.\n I know this. “Southeast—is Gha-ghallo,” I pant. “Suffer me—a few more breaths, first.”\n “Rulii,” barks Dunurr. “Someone comes.”\n Our weakness shows in a desperate scramble to face the enemy—but instead, Llohi limps out of the grass.\n “Llo-llohi,” I cry. “Hark-hark: you run still! This is news of joy!”\n “For now,” she replies.\n Dunurr hints a growl. “Traitor. Shall she not bring enemies upon us?”\n “Par-parker, bow-bow,” I say. “Take up the prisoner, quickly.” I hate to use Cold words with him, yet the others will take offense if I address him so intimately. Parker obeys, drags the Nose to her feet. She is our best, our only defense. Now, “Bel-belly, Llo-llohi,” I say, “we have no time to care for your wounds.”\n “I know. I have scented Rregl among a mob sent to follow us at hunter’s distance downwind.”\n They have permitted him freedom? No time to wonder. “Bow-bow: don’t hurt the Nose. If she dies we lose all protection. No matter your condition, Parker can’t run.”\n She huffs, full of amusement though her scent speaks of distaste. “I understand.”\n At last, with an enraged hostage and mistrustful allies, we begin the long night’s walk to Gha-ghallo.\n Beneath a lowering moon, we straggle across the lands I once ran so easily. Close to Gha-ghallo, yet still out of howl; and slower with every pace. The Hnnwan Nose has become too exhausted for hind-toes. At present, it is Dunurr who drags her by her neck-ruff, while Llohi keeps careful distance. Though the Nose has not resisted, we dare not release her to fours, because the Barbarian mob trails us still. Among us we split the burden, yet this work wears us like a long hunt does its prey. The mob taunts us now with closeness; we will soon be brought to ground.\n “Rulii,” Parker says, walks beside me in a faint bubble of green light from his speaking instrument. “What can we do?”\n I breathe in the scents of our company, the dirt, the grasses. Our tired footsteps whisper in a fragile peace, which the next breeze might disperse. “Before long we must turn and grapple, else have no fight left in us. Sniff, Parker, can you not bring human help?”\n He shakes his dense, curled mane. “I have spoken with Rizvi of our danger. But a shuttle would be a mistake.”\n I shake once, nose to tail; it gives me little relief. “Parker, I once told Rizvi no shuttles, because shuttles shriek their presence across great distance, and Majesty Gur-gurne was not to hear of your disappearance. But now—”\n “Now Majesty will hear of this surely, for his spy still runs free. Shall he not banish me in any case?”\n I feel my mane-hackles rise, but my strength ebb. He has matched my thoughts exactly. “Were you to leave us, Parker—you know my life’s hunt would end hungry. I could not run longer.”\n Parker grumbles discomfort. “As I told the Nose, I am not Ranked to summon shuttles,” he says. “I have asked Rizvi to call an Allied Systems Officer, but messages travel slowly across star territories.”\n Not good news, with our lives in danger. “Better to get help from Gha-ghallo, then, if we can. For the question of Majesty, I can think only to offer him the Nose in return for his continued favor.”\n “NO!”\n This bark, sharp as a fang, pierces the night. Llohi joins us, lips pulled back from her teeth. “Do you understand nothing, Rulii?”\n “Wauuunn,” I reply. “What choice do Majesty’s threats leave me?”\n “The Nose leads with sharp teeth to her enemies, generous hands to her own people,” says Llohi. “She shows mercy to war pups whom others would contempt, raises them to her own.” A snort. “Even if she never showed such mercy to me.”\n “Bel-belly: more mercy than Majesty himself,” I can agree. “I understand what it means to wish better for my people. Yet it is not her mercy upon which our lives, deaths shall depend, but his thin patience.”\n “Wai! Iirr-aa! Hia-hia! Haurr!”\n Signal barks?\n I whirl: Dunurr has stopped, snarling, shaking the Nose, though the Nose makes no further sound.\n “Stop!” Llohi snaps. “Leave her, she has called the mob to retreat!”\n Dunurr drops the Nose into the grass, faces Llohi as if for Rank dispute.\n I move between them, teeth bared. Scant moonlight suffices to convey my message: it’s not time to grapple. I turn ears to the darkness a moment, but no answering signals return from it.\n I move to where the Nose struggles in the grass. “Speak, Nose, if you care to argue for yourself.”\n “Hnn—unbind me, Snapper, if you would negotiate.”\n A risk. But if we don’t invite speech, we invite the mob. “Bow-bow, Par-parker: release her hands.”\n Parker approaches in his green bubble of light; casts me a glance, showing doubtful, but unwinds the wire.\n The Nose painfully gathers herself to haunches, tests fingers against the crushed grass. As I thought: unable to bear her full weight. It should still be some time before she can run on fours. “You must not trust Gur-gurne,” she says. “He lives to rape and destroy.”\n “No one must trust him,” I agree. “He is too Cold to be trusted. Yet he may snap my throat if I don’t provide tribute won, to justify my incursion into Hnnwan lands.”\n Her ice-blue eye gleams. “Hrr, wai! He wanted incursion.”\n “Ar, did he?” I snort. “Surely you don’t claim he would reward me.”\n “No; he’d punish you as I did—for enjoyment. The incursion of Parker, he accepted as perfect tribute. He might not have expected you to follow the human, but he will relish that gift, just as he relishes war.”\n “This Barbarian barks without meaning,” interrupts Dunurr. “Majesty strides in this war with victory as his quarry. He fights for the safety of the tribute nations.”\n “No,” the Nose growls. Were she not surrounded, she should most likely bite.\n Dunurr feints a lunge at her.\n “Bow-bow: wait,” I say. “Nose, how should he want war?”\n She answers easily. “He fights to win safety for his people, and for himself in singular.”\n One of Dunurr’s companions, behind her in the dim, barks a rough laugh. “He stands safe now. He runs in La-larrai.”\n “Hrr, yes,” the Nose answers, all contempt. “Safe among a few submissors of his own fur, while in the far distance, thousands of Lowlanders at his command fling bodies against us, and we at them.”\n I back one step, shake my mane. To hear a Barbarian speak so, know so intimately of the secret I have suspected for half my life! It confuses me. “What? So he has always done. Our lives to him are grass.”\n “Just so,” says the Nose, intent now. “Grass tied tight into a wall, lest it break loose and grow vengeful teeth. The perfect strategy for his own hunt—until humans came.”\n Parker nudges close by my shoulder, showing nervous. “We should move.”\n “Surely you see,” the Nose continues. “The war slowed when humans came to Ro-roghell. Soldiers could be replaced with haali bushes. Pups were born and happily parented among the companies. Wai! we thought, will a messenger come to offer peace? Only instead does my Tooth Rregl come, speaking of covert movement of the enemy, urging for new weapons, new strategies, quick action before the Aurrel can fully mobilize. Incitement.”\n I shake my mane. If she speaks true, then Majesty himself provides incitement to both sides. And I scented no evidence of any coming offensive.\n The Nose tests her hands again; her scent sours and she breathes a faint hnnn. “Then one day Rregl comes scented all excitement, tells me of a human come to our lands, a talker bearing the instruments we have sought. In all certainty he speaks, yet, mark! When sent by my command, he takes days to find him.”\n As the first hint of sunwake now creeps into the sky, I begin to scent her meaning. I had wondered that Rregl was the one to find Parker—how was he to learn of a human carrying tools into the Lands, except from Majesty?\n “Parker—” I shake my head, murmur in Aurrel. “Majesty knew of your presence here from the first. With intent, he sent Rregl to flush you from your careful shelter, into the bite of his own laws.”\n Parker utters one of his own words that hisses and ticks. “But not to flush me in singular, I think. To flush all humans from Aurru.”\n “And then, in sending a messenger to me in singular, he baited me into a rescue.”\n Parker’s voice is a growl. “We can’t argue our intent, nor our people’s interdependence, if we are both dead.”\n Wauuunn, can it be true? Do I scent the end of our project, and my own death imminent? Panic rouses my need, though full sunwake needs some time yet. When it subsides, it leaves a deep ache behind. “Hnnn, Parker . . . ”\n Dunurr approaches in the deep grass-shadows, still tensed for Rank dispute and scenting anxious. “Rulii, why do you listen to Barbarian lies? We may as well offer our bellies now! Will the mob obey signals to retreat, or understanding their leader was forced, come upon us belling?”\n She is correct to scent danger. “Thank-thank, Dunurr,” I say. “We must go.”\n “Rulii,” says Parker. “To move risks worse, if we spend our fight strength needlessly. We need help.”\n He should say so! His people are those who possess shuttles, weapons—yet always they have backed from aggression, and kept instruments to themselves. If I insist to involve them, will they not judge the price too great, and leave Aurru of their own will? Yet we do need help, and further, we need proof that the Hnnwan Nose speaks true, which can only come from Rregl, or from Majesty himself, or both.\n I scent a way forward, narrow as a single hair.\n “Sniff-sniff.” I wave to one of Dunurr’s companions. “How close does the hunting mob run now? Can you scent them? Bow-bow: go, and return swiftly.”\n He makes a single sighting leap into the air, and runs crosswind into the grasses.\n “Nose,” I say, low. “If Barbarians, Lowlanders both are victims of Majesty, are we truly enemies? My killing orders always came from him, and still, now, he runs to incite us against one another—perhaps even to kill Parker, who might negotiate between us. But what if we find proof of his intent?”\n She snuffs. “How?”\n “Run my huntmate in this and I shall guarantee your safety. We shall bait Rregl here, and in Ro-roghell, put Majesty to the test.”\n The Nose says nothing, but her scent changes.\n “This is a risk,” says Parker. “Should she turn teeth—”\n I lean to his ear. “We may die, yes. But we may die in any case. We have allies in Gha-ghallo, perhaps within reach. Shall we not attempt to uncover Majesty’s scheme? To break his hold upon Lowlander and Barbarian lives alike?”\n Parker hesitates, shifts feet. He has told me of human reluctance to stand between the teeth of enemies here, yet Majesty has now betrayed his people also; he does understand me. “If we can live so long . . . ”\n Panting breaths approach—Dunurr’s companion. “General,” he says, “Except Rregl, these are Barbarians, not Teeth. They have retreated, but not far, from here downwind, where I suspect they attempt to understand the Nose’s intent.”\n “Thank-thank. Bow-bow: now we move. Dun-dunurr, run to within howl of Gha-ghallo and summon Captain Burr-burrzhi and his scouts to fight for us.”\n “Ar, bite! Must we call you General now?”\n “Bow-bow! Orders upon the instant, else die with us!”\n Her ears flick back, but with no more objection, she leaps to fours and away. May she run swift as wind, and the scouts faster!\n “Llo-llohi, you shall remain here with Parker and the Nose.” Llohi gapes as if to laugh; her flickering ears suggest she doubts still, but she makes no sound.\n “You set me for bait,” the Nose snorts. Her understanding of our language surpasses my expectation.\n “No; you three are lower jaw,” I explain, in hope she will understand honor meant, and hunt with us. To Dunurr’s two companions I add, “Bow-bow: we three move as upper jaw, with your guidance to avoid the enemy.”\n “This way, General.”\n We crouch low as riverbottom llirr, seeing little more between the grasses than we would in mud. Nose-to-tail, intent, but limping since we ache in every limb. As our path curves, I lift my nose to where the wind brings me faint report of those we left behind. I should struggle to count them were they not each so distinct: Aurrel, Hnnwan, human. This scent I hope will pose mystery enough that Rregl will think before he acts.\n Creep, creep further—ar, I fear my limbs shall fail in a fight! But I must breathe deep, keep on, believe I remain yet Rulii-soldier. The night still ages; impending sunwake grays the open sky, and the breeze weakens. If this be my final strength, I must use it well.\n My ears bring me sounds of a charge through the grass, ahead and to our right.\n In silent agreement, we leap toward it. But a swift pain penetrates to my bones, steals half my stride. The ache eases as I run—how I had longed to do this!—but I can’t recapture my place between my huntmates. I leap once, sight the mob ahead: two hands of Barbarians who crush the grass, speed toward the bait head by head by head.\n Rregl is not there.\n My weakness turns strange advantage: no longer between huntmates, I turn back toward our first intended path. Two strides, and I dare another sighting leap.\n Ar, here he is, too close!\n Perhaps he intended to seize us three from behind; now he gapes teeth as Barbarians do—\n I don’t try to land, but roll to one side. Good fortune carries him past, and me unharmed, though his armor has scraped my flank. I roll to my feet, turn teeth and bite—slash blood from his hind knee but can’t hold. Ar, his teeth at my nape! I thrash him off.\n Now he comes for my shoulder; I bite for his neck. We each snap mostly mane, though our shoulders clash.\n Already I am all pain. He has walked as far as I, but he has youth—also, has not had to carry a prisoner. And sunwake breathes downfall at the back of my neck. I won’t beat him.\n I scramble up, run.\n Crushed grasses guide me in the mob’s path toward the Nose, Llohi, Parker. My dash has surprised Rregl, for his harsh breath trails me at some distance. My effort can’t match his, but so long as they are not too far ahead . . .\n I spy the mob by their tails, their spots. No breath even to howl, so I will use this surprise in aid of my friend. I stride, leap; when I come down two pairs of hinds splay beneath me; I bite fast one and two. The taste of Barbarian blood. Yelps of pain and rage, and teeth turn to tear me. I bite again, gasp for breath, bite, push forward, not even a stride’s distance but can’t see Parker, Rregl will pounce upon my hinds! Though blind to where he comes, I hop to one side. Rregl barks—surprise? A Barbarian screams. Still I push forward; I must be all teeth else they will down me. Sudden enemy feet pound my back, teeth seize my nape—I roll—the teeth tear away, but my legs do not bear me up again. I have not won Dunurr enough time.\n Rregl stands over me on fours; his eyes glitter hate.\n I gasp, “Bel-belly: Majesty Gur-gurne uses you, Rregl. This is not honor.”\n He doesn’t answer. Soldiers squeal and he looks up, away.\n I follow his gaze, though it puts my neck at risk. Ar, Llohi! Parker! Llohi comes on fours atop Barbarian backs, Parker less nimble on his two wades through beside her, spring-knife in hand, which she must have given him. In the instant of my enemy’s inattention I gather, struggle, find my feet. Ar, we are strength of three now, hearts strong in interdependence, and teeth sharp! We shall die with courage!\n Rregl leaves us to his soldiers this time. They are too many, and all teeth, taking blood everywhere they lunge. Llohi crumples first. I lose her under Barbarian attackers.\n Parker shouts, stumbles—I glance to him—here’s Rregl, who fastens his teeth on my already-wounded shoulder. Wauuunn! I roll to crush him, but my strength is not enough. I am down in the tumble crush of bodies, scent death coming to snap—\n “Wai! Rrrrrrai-ii! Uurrr hia! Hau!”\n The struggle stops at once; unique amidst my agony I feel the sick pull of fangs withdrawing from my flesh. I gasp for air.\n The Nose walks, tall on hind-toes, between Barbarian subjects who back from her path. They lower their heads, lick her hands. Rregl sits to haunches, bows, calls out:\n “Great Nose, we here deliver you from Aurrel barbarians. I shall send scouts to muster our troops in support. I shall kill these now, and thus prove to you my loyalty.” He steps forward, but she gapes a full set of teeth—unblooded.\n “You? Deliver me from Aurrel barbarians?” she demands. “Do you think that proves your loyalty? And do you think you deserve three lowly kills?”\n “Kill them yourself, then, Mother.”\n Llohi breathes still, but flows with blood; Parker has balled his body like a brogh though he possesses no natural armor, only shreds of cloth; here I lie while throbbing wounds and my own need-sickness tear me apart.\n The Nose says, “Not yet.”\n Sunwake brushes the sky with color; distant howls reach my ears.\n Is this Dunurr, Burrzhi come at last? But sure the distance is yet too great, the speed of death too sudden while we lie at their mercy.\n Rregl’s ears have turned to the faraway howls; he steps foot to foot, impatient. “Mother!” He gapes, gathers his hinds to leap.\n The Nose moves first. The shock of their skulls rings out; she snaps, downs Rregl by his muzzle in the grass, while Barbarians whine in confusion.\n “If you knew only one loyalty, Rregl,” she growls, “you would not have offered to kill the human.”\n Then another kind of whine grows in the air, high and loud—oh, it shrieks in my head! A shadow slashes across us.\n It is the shuttle.\n The mob breaks at the shuttle’s shriek to run. The Nose has flattened herself upon Rregl, and the huge thing lands. Humans emerge to stand among us—three of our scientists, I recognize—but in the bright of sunwake their colored cloth blazes like fire. They carry weapons in their hands. One raises a weapon, which belches a green flash upwards into the sky. Any Hnnwan who still hesitated are soon fled.\n Parker unwinds painfully, cries out to them in his language. I understand none of it.\n The Aurrel howls grow louder. My ears recognize an unexpected cry: “Hold, Barbarians!”\n Ar, no—Burrzhi believes we lie now at human mercy! I struggle to fours, manage only three, unable to put any weight on my right hand. My head spins.\n “Bow-bow!” I shout. “Captain Burr-burrzhi, hold! Do not—my friend—” Words and legs fail me at once.\n “Rulii!” Parker’s voice.\n “Parker-my-brother, do not . . . ”\n “I understand,” Parker says, solemn. “I will speak to Captain Burrzhi.”\n I sigh back into the grass.\n I live, still. This is some surprise.\n Further, I suspect I have become one of the first Aurrel ever to fly—a strange distinction. I remember little more than the sense of rocking. Now I lie exhausted under the weight of doom, eyes on a circle of bright light: a roof-window above my head. This is my own Warm house in Ro-roghell. I feel no pain, yet I shake in hands and feet; every fiber of me feels sick, wrong.\n I should not lie helpless. I must rise, else Majesty’s jaws close on us all!\n I strain, lift my head. Look there: Llohi lies motionless but for the rise and fall of her breath; and beyond her, the soldier who stood my scout in our doomed strategy. My neck is tired; I lie back again.\n Now footsteps approach—Parker’s, must be Parker’s, those are human footsteps, and his walking gait is longer than that of the other scientists. Yes: here he comes, stands above me, showing grave concern. He has shorn his neck- and face-fur, revealing pup-soft brown skin.\n “Rulii?”\n Ar, how can such a creature have become so normal to me, so welcome?\n I draw breath. Strange that I feel no pain, while I lie in unbearable distress that binds the base of every hair. “Parker. You—impress me. You wield a knife well.” My voice also shakes.\n “Thank,” he says, “and may I wield this better. Lie still.”\n I don’t feel his weapon, only recognize its influence in the comfort that begins in my right arm, spreads inward and through me. My medicine—ar, relief! Yet I could weep, for even relief weighs me with despair.\n “See how even my blood is bound to you, Parker,” I sigh. “Majesty must not brand humans barbarians. He must not remove you from Aurru. Not this, above all else he has done.”\n “I did not mean to bind you,” Parker says. “I meant to free you.”\n I close my eyes. “I bound myself first. Such was my choice, to further my life’s hunt. If I yet live, it’s because yours is the gentler trap.”\n Parker makes a face of pain, rubs one hand over his thick mane. Carefully, he removes a needle from my arm, waves a lighted instrument over it; next I bend it, I find it whole.\n “Rulii,” he murmurs, “were Majesty to banish humans, would you leave Aurru with us?”\n I don’t growl, for he would never intend me hurt or outrage. “You know I would not. I have already driven away siblings in my larger pursuit. I no longer fear death. Already I have lived longer than I thought possible, many times over. Even today, because you called your shuttle.”\n “I shouldn’t have,” he says, shrugs shoulders but cannot hide his nervous scent. “I reassured Burrzhi to return to his camp. Then we flew you here, and your companions; also the Nose, and her captive, the large Hnnwan, Rregl. I have trespassed on the expertise of Allied Systems Officers to change our rules of action.”\n I understand this; to place expertise above Rank is the human’s way. “Do you risk your place here, then?”\n He chuckles, still anxious. “Perhaps not, if Majesty has truly created me Liaison.”\n “He has; summon Rizvi for the skin-roll, if you wish to see it.”\n Parker nods. Makes no move. “Rulii, I shouldn’t laugh. My place here is at risk. But better I face banishment than cause your death, cast your people back into war for what I did. I began this. I, in singular, risked the banishment of all humans from Aurru when I walked into the Lands of the Hnnwan.”\n “Parker, hnnn . . . ”\n “I told myself I put no one in danger because my intent was good, because I did this for science,” he says. “I lied to myself and to my huntmates. You once told me I was no scavenger; yet in this I have shown no more honor than prey.” He huffs a sigh, pats the place above his hip where once I bit him. “You knew better than you imagined.”\n “No, Parker, no.” I gather myself upon my elbows on the padded table. “That day—I didn’t hunt you; I threw you as I would have thrown a Barbarian in battle.”\n His furred brows leap up, but he doesn’t chide me for naming them so. “How thin is the fur of manners,” he says. “Beneath it each of us—Hnnwan, Aurrel, human—shows barbarous in our own way.” He touches my arm through my thin fur, meets my gaze with dark eyes serious. “I will fight them before I let them take me from here. I don’t wish to leave you. Rulii-my-brother.”\n Wauuunn! I must not think of him punished by his people, nor of humans banished, but only of the single pace before my feet. “Parker, we run scarcely ahead of Majesty.”\n “Belly,” he agrees, walks to the door. “I shall bring Rizvi.”\n But it is not Rizvi who comes next; instead the young Dazh walks in on fours, his still-wounded leg raised carefully out of use. He scents all excitement, tosses his head before remembering his greeting. “Belly to you, Rulii!”\n I jump down from the table, rather than force him to hind-toes on a single foot. “Sniff-sniff: Dazh-dazh, how do you heal?”\n “Rizvi obeyed your orders. She has tended my wound, defeated my pain.” An instant, he gapes a full smile, but his ears twitch. “Now . . . she commands my help with her instruments, baits me to learn her language.” Showing embarrassed, he covers his nose; on a single hand, a single foot, he wobbles off-balance.\n Though he lightens my heart, yet I must be sure to speak in seriousness. “Hark-hark: you would do well to take her as huntmate.”\n “Hnnn . . . But Rulii, I should instead belly to you.” He falls to haunches, the wounded leg not fully bent. “All of Ro-roghell knows of your courage, your battles, your rescue of four Aurrel prisoners!”\n “Bite-bite: do they so?” Ar, and what of the two Barbarians?\n He shrinks, bows head before my insult. But secrets melt faster than ice; among so many witnesses, much was bound to seep forth. Even Burrzhi scents too sharp to have missed the identity of our new guests. What did Parker say to him?\n I shake my mane; I must sight forward, not behind. “Dazh-dazh,” I say, “Hark-hark: you know that Majesty comes upon us at close pace. He will put you in danger.”\n Dazh straightens. “I will not hide. Let him create me soldier!”\n “Bel-belly: you shall not hide.” It would be impossible now, anyway: his days here have filled the air with his scent. “Yet I will not have Majesty hurt you. Riz-rizvi’s is the better hunt for you.”\n Dazh squirms a little, though it is not distaste I detect in his scent. Curiosity? He pants a breath, tumbles out, “Belly to you, Rulii, ar! Please, let me hunt at your hind haunch as I have dreamed from a pup!”\n I toss my head. “Bite-bite: do you so easily reject Riz-rizvi who saved you?”\n “Hnnnn . . . ” Dazh ducks head, shifts feet; were he whole, I think he should belly to me indeed. “No, no. I thank Rizvi each day for her care—Rulii, belly, please, I will do anything you say. Suffer me! Suffer me to do anything you say . . . ”\n My heart objects to adoration, but in one respect he scents true: Rizvi can’t protect him from Majesty’s attention so well as I. I raise my right hand to him.\n He quivers, nose to tail, and nods to meet my outstretched hand. His mane is not fully grown, so I stroke favor-scent from between my fingers into the dense hairs of his ruff. Now, as my submissor, he will await a command.\n “Bow-bow: Dazh-dazh, by my word you will continue your work with Riz-rizvi. Now, summon her to me.”\n Tail joyful, he opens the door, but finds the passage blocked: Parker, Rizvi stand there already. Their eyes speak of fear.\n “Majesty comes!” Rizvi announces, her mouth in an unaccustomed scowl.\n Fatigue drags me all at once, but I can feel no surprise that Majesty works to trap us in yet one more way. “Sniff-sniff: how so?”\n Parker licks his lips. “Our instruments have spied him leaving a riverboat upstream in Zhi-zhirr, but he does not stay; he will take foot in Ro-roghell tonight.”\n My mane-hackles rise; and I with them. “Bow-bow: then somehow we must stand ready.”\n The fear of teeth is as old as Aurru itself: Majesty’s teeth scare me no matter how many times I have faced them. How should we force him to reveal his schemes without inciting him to bite? He is terrifying even at a dinner table; it seems folly to bring him to a confronting room, but what other lock could protect the Nose, Rregl? Before his demands, all backed by violence, our plan seems fragile as a spinner’s web. Likely enough he will burst it, even should none of its many strands fail.\n Alone, unarmored, unthreatening, I go to meet Majesty and twelve heavy-furred submissors upon the East Riverside road. They run still on fours after their journey from Zhi-zhirr. They don’t bare teeth as we approach one another; I can’t guess how many spies they may have met, how much they may have heard of my departure, our return.\n Today Majesty’s smell disgusts me. Powerful—not only with the scent of his favor, but the scent of my old need rising from his molri-cured leathers. Across those armored shoulders roll the heavy strands of his mane, weighted with silver-glass beads of royal ice. His mane is less dark than when I last ran in La-larrai, as if the ice has touched him with Cold.\n As his submissor, it is for me to speak first, yet I struggle to find words. I have changed more than he: now I see through the dense fur of nobility to the barbarian beneath.\n “Bel-belly,” I manage, using Cold words as his exalted honor demands, so as not to taint the royal chill that surrounds him. “Majesty, make welcome to Ro-roghell.”\n “Bow-bow: Ru-rulii, I will see the human talker, Par-parker, at once.”\n Straight to his purpose! He makes no mention of my injuries—but after the human healing instruments, they show older than they are. I bow to haunches, lower my nose to my hands. “Bel-belly: the talker Par-parker eagerly awaits you in my Cold house.”\n Majesty snorts—surprise, disbelief? “Bow-bow: break the way, Ru-rulii.”\n I rise to hind-toes, lead enemies through my Lowland city. The day’s heat has passed its crest, and the wind breathes cool from the river; my downy-furred people work the animal pens, the fish-traps, the workshops and forges with mouths open, seeking its relief. No relief, it seems, for the heavy-furred ice-hunters behind me, who smell of frustration. Will a few more minutes aid Parker, Rizvi, Llohi, the others in their preparations? I don’t know, but I haven’t run here long enough to die yet.\n We climb the hill. Carefully, I give no attention to the door of my Warm house, where the human scientists huddle. A royal submissor behind me snorts distaste at their smell, but Majesty remains singular in his intent. I suspect he scents Parker’s passage up the hill earlier this afternoon; the Hnnwan, fortunately, didn’t pass this way on foot.\n The few Cold houses of Ro-roghell, with their iron walls, peaked roofs, and heavy-hinged doors, stand pretender above this city of tents and tunnels. Majesty ignores all but my own, highest upon the hill, though the residents here would surely belly to him. Someone has remembered to light the fat-lamp in the urrgai horn above my door.\n I bow. “Bel-belly, Majesty: tread my territory and make welcome.”\n As the Coldest predator among us, he has no reason to fear, and does not hesitate. I push past a submissor to be sure I enter at his hind haunch; I must stand present for this, and be sure to exclude as many of his fighters as possible.\n My confronting-room is intended to tell a lie: that Parker’s, my incursion into Barbarian lands was made with intent to rescue prisoners of war. Parker wears rich clothes of blue and silver, showing himself the representative of human power, with no hint that he was trapped by Barbarians. His body-talk is calm and noble despite the nearness of teeth. To the right of my slotted inner door stands Llohi, scarred and thin but unbowed, scented with the favor of Barbarians which we hope may confuse the scent of true Barbarians that wafts through the door-slots—and beside her, Dazh?!\n Ar, Dazh, why would you break your promise to stay away?\n Arrayed against those three in the too-small space, Majesty and two royal submissors loom large and dangerous. I place myself carefully beside my empty fireplace, to guard the neutral space between Majesty and Parker.\n “Bow-bow.” Majesty shakes a threatening chime from his beads of royal ice. “I have come to hear you speak, human. So speak.”\n Parker bows. “Bel-belly to you, Majesty Gur-gurne,” he says. No fear in his voice, though all here can recognize it in his scent. “In Cold honor I have received your gift of Rank. In the name of humans, I bid you make welcome to the home you have granted us in this your Lowland tribute nation. Thank-thank: with your favor, we run well in our hunts.”\n The two submissors snort surprise at his skill, but though pride fills my breast I will not let them distract me. I watch Majesty Gur-gurne. He tenses shoulders and hips as if he might attack; instinct tenses me in response.\n “Bite-bite,” he barks, “Fine Au-aurrel manners from a traitor! Your—thing that flies and shrieks—it has betrayed you. You have consorted with Barbarians, in violation of our laws.”\n Parker glances at me. “Bel-belly, Majesty: Ru-rulii and Captain Burr-burrzhi enlisted my help to rescue war prisoners from the Barbarians.”\n A snort, perhaps even an insult I might expect, but Majesty gapes. His eyes bulge as if at the sting of a swamp hirrzhil.\n He charges.\n I lunge to block Parker—Llohi, Dazh cry out in shock—iron clangs protest against iron—and I land, untouched.\n What?\n “Bite-bite: I’ll kill you for this, Rre-rregl!” Majesty howls, shoulder against the inner door. “I’ll tear out your throat myself!”\n Our suspicions confirmed! But with restraint now cast aside in rage, will he turn on us? Else his submissors mistake the object of his command, and we all die? I gather myself to grapple, but the submissors show confused—a gap of uncertainty into which I leap.\n “Bel-belly, Majesty: no one here threatens you.”\n “Bite-bite, Ru-rulii!”\n Gur-gurne turns ears, faces me, enormous with rage. Wauunnn! I must not flinch, nor cringe, though I have lost pace in my hunt, and my strategies have become scattered grass. Remember, Rulii, the ice-hunter’s fury is mostly fur . . .\n “Sniff-sniff: Majesty?”\n “Bite-bite: have you lost your nose along with your judgment? No; more likely you know that the human talker broke our laws, but ignore the extent of his transgression. Hark-hark: these you keep locked in your den are not war prisoners. He has fraternized with the Barbarian Nose herself, interfered to slow our conflict.”\n “Sniff-sniff: has the war slowed? Bel-belly: if we faced defeat, surely by now Gha-ghallo, Ro-roghell would be overrun with Barbarian mobs.” At least I need not feign my consternation. My trap has worked too well; now it works to snap me, too. What can I say to distract him? “Sniff-sniff: do you mean Par-parker has intervened to bring us peace? Hark-hark, Dazh-dazh, perhaps I was wrong to say you would be created soldier.”\n I am wrong to involve Dazh—can’t even see his response, for Majesty holds me in his stare.\n “Bite-bite: peace, Ru-rulii? Do you forget so quickly that we fight to preserve natural order? Would you scatter our efforts to scavengers? I’ll kill you first.”\n Dazh howls, “No!”\n He jumps at Majesty.\n I fling myself at him, but, sure, it is too late—\n By luck Dazh is more wounded than I: my shoulder hits him in the side, flings him against the outer door with a sharp yelp. No time to wonder whether I’ve broken him, whether he chanced to touch Majesty in his misguided leap. I turn terror into anger:\n “Bite-bite! Dazh-dazh, this is not the way to serve me, nor to save me. Bow-bow: Get out! Go back to where you began!”\n Dazh utters no sound, but stares at me. I stand panting, showing as large, as angry as possible—his life depends on my contempt, but I can’t manage it truly. Do my enemies see how my heart cries to do this to him?\n A heavy-furred royal submissor cuffs Dazh in the head, and another laughs, strikes him in his wounded leg. Dazh whines, but pulls the iron door inward, stumbles on fours into late afternoon light. I glimpse his eye, cast back—then another royal submissor blocks the light, steps in.\n They are four now, well-fed and muscled; we are only three scarce recovered from our hunt, and one of us human.\n “Hark-hark, Ru-rulii,” says Majesty, with calm now in his voice that his scent belies. “You can’t have known of this human talker’s deception. Bow-bow: give the two Barbarians to me; when they are dead and the humans flown from Au-aurru forever, I shall reward you.”\n My mane-hackles rise, unbidden, with a new certainty: Majesty will not suffer me to run much longer. He knows nothing of my human medicine; can’t know that his offer is meaningless, even were I to believe it. I must at least try to protect Parker.\n “Hark-hark: Majesty, when you raised Par-parker’s Rank, his superiors in the Allied Systems rejoiced; now they too have chilled Par-parker until he stands able to propose terms in the human presence on Au-aurru. He now speaks for all his people across star territories.”\n Parker steps to my shoulder, tall, certain in my eye-corner though he still smells of fear.\n Llohi comes to my other side, unexpected. “Hark-hark, Majesty: you have not deceived us. We know you do not wish for peace, nor for victory. We will not allow you to harm your pup Rre-rregl, who has stripped bare your intent, nor shall we deliver up the Hnn-hnnwan Nose.” A deep bark of “Wai!” bursts from the slots of the inner door, answered by a high laugh.\n Here we stand, exposed; I expect outrage, attack, worse, yet Majesty says nothing. The first rule in strength-of-three is loyalty; I can only commit to the path we now run.\n “Bite-bite,” I say, “we have uncovered your scheme to trap Par-parker, to flush him into Hnn-hnnwan jaws, to blame him for the banishment you have long planned for humans. But perhaps you have downed a quarry you did not intend, for humans feel no further need to recognize your authority.”\n Now Majesty growls, low and dangerous. “Bite-bite: and whose authority do you suppose he recognizes? Yours, Ru-rulii? When you’ve shown your quality as Warm as the stinking child you permitted into my presence?”\n I can’t answer him, but Parker speaks. “Hark-hark: yes, the authority of Ru-rulii for the Lowland Au-aurrel, and the authority of the Head for the Hnn-hnnwan people. Humans who cross star territories, who negotiate with worlds, need not tolerate betrayal.”\n Majesty bares his long teeth. His submissors urge foot-to-foot, ready to lunge. Anticipation brings the cold sensation of teeth penetrating my flesh. I begin to wish my empty hearth did contain firebrands against the northern Cold, that I might use them.\n Snap!\n This sound is not teeth, but the bolt of my inner door. The Nose enters, small and predatory, showing fearless in ears, scent, arcs of sharp teeth. I see she has freed Rregl from his weights, for he now stands her second.\n “I too recognize the authority of Rulii,” she says. “And of the human Parker, to call a breath-peace amid our war.”\n “Bite-bite: then you will all die,” Majesty barks. “Every life in this house will fall prey to the natural order of Au-aurru. Bow-bow: open the door!”\n He calls his soldiers. My hairs stand, but none of us move; even the Nose’s speed would not suffice to stop the submissor who now opens the outer door. Majesty has nine more outside, refreshed, ready, and we are already trapped—\n The door swings wide on afternoon light, warm breeze . . .\n A multitude.\n So many Lowlanders that beyond a body-length, the road itself disappears beneath them. Is this all of Ro-roghell? Herders, fishers, half-trained soldiers, blacksmiths in leather aprons who carry iron hammers, even some from the Stinking District! Majesty’s submissors I spy here, there, none in strength-of-three but isolated all, heads held low, surrounded by our people. Humans, too—scientists with weapons stand by, not a one shunned by Aurrel companions.\n Nearest stands Dazh, on one foot but grimly gaping, leaning on Rizvi.\n “Rulii,” he says, “I have found a better way to save you.”\n I shake my mane in shock. The submissor at the door gapes a moment, then looks back to Majesty. Majesty blinks.\n I speak quickly into this breath of silence. “Bow-bow, Par-parker, Llo-llohi, come.” We emerge from my house in strength-of-three, the Nose following with Rregl.\n Majesty and his two emerge last. Their presence raises a miasma of fear from the crowd, but they hold position.\n “Bow-bow: submissors, with me,” Majesty barks. “We return to Zhi-zhirr.”\n But they must not reunite for strength. “Bow-bow,” I announce, “in Cold honor we shall escort them from Ro-roghell.”\n As the crowd slowly parts for Majesty, those who have isolated his submissors remain flanking them down the hill road.\n “Hark-hark, Ro-roghell,” I cry. “Majesty Gur-gurne departs, and as he turns tail a great change comes to our city. Our human talker Par-parker has returned from a secret hunt in the Hnn-hnnwan lands. At great risk to himself, he took language, knowledge as his quarry—but also the peace you have so long desired.”\n Barks of surprise, disbelief rise from the assembled people. Even Dazh shakes his head.\n “Hark-hark! You, your families, have fought all your lives. You know the cost of war: in labor, in urrgai, in the lives of those we love. Our bodies have fed scavengers in the name of faraway dominators and their Cold complacency. We have hated the violence the Hnn-hnnwan have brought to us, but ignored the violence done by ice-hunters who claim to protect us. When humans came, they brought us silver, but they also brought reasons to keep tools, food, people here in safety. The war slowed—we breathed deeper again at last—and, we have learned, so did the Hnn-hnnwan. Only one person, Majesty Gur-gurne in singular, shuddered at this change and sought to rouse us once again to blood. He feared we would see how he used us against one another.\n “Ro-roghell! You were summoned because when Par-parker, Ru-rulii, and a representative of the Hnn-hnnwan rejected Majesty’s urgings, he wished to tear us flesh from bone, to deliver us to the silence of grass. He has failed.”\n The crowd’s scent sweetens. A single incredulous howl rises into the cooling breeze. I hear them inhale as one, but interrupt them.\n “Bow-bow!” I cry. “I must have a messenger to deliver this news to Captain Burr-burrzhi and the soldiers of Gha-ghallo. Hark-hark: Majesty will return, and we must be ready. And, bow-bow: look here at the representative of the Hnn-hnnwan who offers us this breath-peace!”\n The Hnnwan Nose stands, advances into sunlight where her red stone blazes. Rregl stays behind, closely watched by Llohi.\n “Bow-bow: suffer her to make welcome here. Hark-hark: Au-aurrel, Hnn-hnnwan shall speak together, with Par-parker and humans to guarantee the truth of our intent. May our talks bring interdependence out of strife, life out of death.”\n Now howls burst from all throats, a cry of change into the wind that carries across the Lands of Teeth. I lower my head.\n Beside me, Parker smiles his blunt smile. “Hnnwan, Aurrel—a very old interdependence made new.”\n Llohi laughs. “So was mine with Rulii, who convinced me you could run strength-of-three.”\n “Great Nose,” I say. “Let us leave behind talk of Barbarians, and hunt together in the name of Aurrel and Hnnwan.”\n “In this I name you Rulii,” she replies. She scents now of satisfaction, and glances approval with her eyes of Warm and Cold. Merciless fighter turned brave diplomat when she scented opportunity for her people—indeed, her life’s hunt is not so different from mine. “We must send to my people; we have much to do.”\n I can’t call this joy in my heart: I know I still stand between powerful jaws. Majesty Gur-gurne will return with armies, and Parker’s Allied Systems superiors come to take him, with consequences for his scientists and for our people that I can scarcely imagine.\n Yet even in this danger, I no longer hunt alone. I will inhale this breath of peace, and push forward—for a life’s hunt never ends until the body’s final pace.\n And I run still.\n Juliette Wade combined a trip to the Gouffre de Padirac with her academic background in linguistics and anthropology to create the world of Varin, a grand experiment in speculative ethnography. She lives the Bay Area of California with her husband and two children, who support and inspire her. Her fiction has appeared in Clarkesworld, Analog, and Fantasy & Science Fiction. She runs the Dive into Worldbuilding video series and workshop at www.patreon.com/JulietteWade."}