{"fingerprint": "C9jHO92PeZ742KCVaJ0zadisbG0=", "sitename": "Clarkesworld Magazine", "title": "When Home, No Need to Cry by Erin K. Wagner", "author": "Erin K Wagner", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wagner_03_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: When Home, No Need to Cry by Erin K. Wagner", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3610 words, short story\n When Home, No Need to Cry\n She had never slept so well as when she was in space. Even when she dreamed that gray, dome-headed aliens were tapping at the windows of the shuttle.\n Karen sat up in the bed when she heard the bot coming, though it took some painful effort. The bot entered the room with little scuttling noises, its belt and wheels rasping against the linoleum. It moved slowly between the clutter of furniture, a small blue light blinking on what served for its head. The silhouette of it vaguely resembled a cat: sloped back, head tucked tight into chest, a wisp of a tail trailing behind. The doctors had modeled its main function on that of a feline, and the design of the shell had followed.\n “It smells death,” Karen had said, bluntly, when her sister came to visit. They were twins, and the pain in her sister’s face made Karen think that she should feel the same.\n “It can smell? It can’t,” her sister half-scolded, half-asked, focusing on anything but the point.\n “Near enough,” she answered.\n Her sister glanced around, though there wasn’t much to draw the eye. White linens, white curtains, white stucco walls and ceiling, almost untouched by the colorful afghans and overstuffed chair she had moved into the space. “We could still take you home,” she said, but Karen could sense it still, the reluctance, the guilt.\n “No, Sara. It’s good here mostly.”\n In the predawn light, though, watching the bot pause ever so briefly at the foot of her bed, Karen wondered about the extent of her lie. Her time in space had given her two centimeters on her sister. But the radiation had stolen something more. The doctors called it a mass, a tumor, something that took up space and energy, but it felt always to her like a hollow there behind her right breast, a nothingness that threatened everything. It was as if her body anticipated the surgery that would never come.\n The bot clicked forward, beeped on some register almost beyond human hearing. It paused at the foot of her bed and she stared at it, daring it to send its silent alarm to the residents on call. They stared at each other a moment, if Karen could call the blue light something akin to an eyeball. There was a hesitation and then a miniscule shifting of the wheels that she interpreted as a tacit truce. Not today. And in the matter-of-fact activity of the bot—which acknowledged her enfeebled state, recognized that she was waiting here for death—there was an odd sort of comfort, she supposed. Skirting the truth took too much energy.\n Her vitals reported and updated constantly on a small transparent tile embedded in the foot of the bed. The text read backwards for her since it was oriented for the doctors’ eyes. It was a habit of hers, once the bot had shoved off, to study that tile, challenging herself to puzzle out even the most convoluted of medical terms, tears welling up in the corners of her eyes as she refused to blink. Blinking was a concession, a small defeat she accepted every day. She wiped her eyes, rubbed the tears into her cheeks, and lay her head back on the pillow. She listened to the pulse of the blood rustling, thumping, in her ears.\n And that made up the early morning hours. Only twelve more hours until one could reasonably tuck one’s feet under the blankets and call it bedtime.\n “I’ll be alright,” Karen said, but the words felt weak, even to her own ears.\n The director shook his head, dug his finger into his ear, and grumbled something under his breath.\n “What was that?” She didn’t know what else to ask to move the conversation forward.\n “We’re a research foundation,” he said. And now he looked almost shamefaced. “Not Make-A-Wish. Do you know how much money we lay out for each launch?”\n “Yes.” Was it something about the way she stood now, hunched over her waist a bit, curling inwards, that caused people to forget that she had been an astronaut first? An astronaut before a cancer patient?\n “Of course you do, Karen.” Conciliatory. “You were one of the best. Don’t get me wrong. I’m not denying that.”\n “You are,” she said. “You are denying that if you can’t trust my own assessment of the situation. I can do this mission. Look. Look at your objectives.” She shoved the paper at him again. “Another experiment on plant growth in zero-g. I think I can handle a BRIC canister, even in my condition.”\n He took the paper, did not look at it, crumpled it as he folded it. “Let’s face reality here.” And then he paused, as if he could not do as asked.\n “Yes, let’s,” she answered. But she felt the sinking, plummeting sensation of coming disappointment. She wanted to believe in the confidence of her own voice.\n “What would we do?” he asked. Finally. And he had the good grace to meet her eyes. “What would we do if you died up there?”\n And when he said it, she realized there was nothing she wanted more. She licked her lips.\n “Right.” She reached out a hand for the back of the chair facing the director’s desk. “That’s the issue.”\n “Why don’t you sit down, Karen?” There was the pain in the wrinkles at the corner of his eyes, the discomfort in watching her.\n “I’m fine,” she said. She was grasping for an argument, something that would make her case for her. Sitting down and admitting how tired she was even now, just watching him shuffle papers nervously on his desk, that would not be it.\n “You’ve sent out automated missions,” she finally said, tentatively, as if feeling her way forward in the dark. “You’ve done it before. You could retrieve the shuttle.”\n He sighed, leaning forward, resting his arms on the desk. “Karen,” the ever-so-slight pause before the admonition, “you should be taking care of yourself. You should be thinking about recovery.”\n “Recovery?” The slight choking, the cough in the base of her throat. “This is my recovery.” She jabbed her finger, once, twice for emphasis, into the cushion of the chair back. “You let me go up, that’s the only help for me.” And again, she realized how true it was only as she said it. The revelations were quiet and desperate.\n “You’re going to force me to be the bad guy here?” And now he pushed back from the desk, bracing his shoulders, setting his mouth.\n The anger was hot behind her eyes. “I guess so.”\n And she saw it, the spark of hate in the way he scooted back his chair, stood up, arms braced against the desk.\n “No.” The pause. “And stop asking.”\n Karen brushed her teeth with deliberate care, still almost surprised, after all these years of being grounded, that she could use water freely in rinsing and spitting. There was an ache, a small sharp pain, in one of her back molars. The staff, if they found out about it, would insist on a visit to the dentist, and she had no desire to see him, nor was the health of her teeth high on her list of priorities.\n She stumbled, leaving the bathroom, barely catching herself on the foot of the nearest bed before she took a spill. She cursed, loudly, rousing the resident from his sleep.\n “Sorry,” she waved her hand, motioning him to ignore her, to go back to sleep. “Sorry, I tripped.” And she wondered, briefly, how space had wrecked his body and why he was here for the residents to study. He rolled his eyes, red and bloodshot, and turned over in the bed.\n She reached her own bed, hated how relieved she was to sink down onto the mattress, to take a full breath. Space, as a private capitalist venture, had pushed bodies to breaking. She knew this and she had criticized—in podcasts, in televised interviews, in the last of the print papers—the corporations who had funded her own missions. And yet now, feeling her skin like a body-wide bruise, she could think of nothing else but launching again. Even if the bone-crushing press of acceleration were the last thing she felt.\n The bot assigned to her unit, differentiated by the color of the stripes on the mound of its back, rolled into the room, accompanying a resident back to her bed. The blue light of its eyeball strobed towards Karen, and scanned her over. She could feel it happening, though there couldn’t possibly be anything that she could feel.\n “Screw you, kitty-cat,” she said and lay down. She could think of no other way to kill the time before lunch.\n “I’ll be alright,” Karen said. But, inside, in a deep corner she didn’t dare acknowledge, she hated how alive Terry looked. He couldn’t be more than one or two years younger than her.\n “What the director says, goes.” He had kept his hair cut to regulation length, even though he was ground-control now.\n “What does he know?” She tried to speak casually, tried to remember what it was like to joke with Terry the night before a launch. Everything was funnier though, everything brighter, with the nervous anticipatory butterflies in the stomach. “He’s never been up himself.”\n Terry shook his head, don’t get me in trouble now as subtext.\n “Terry.” Maybe he would understand. She moved an inch closer. “I can’t die down here. Not in that place.”\n He filled her glass again and pushed it across the table, creating a bit of distance between them.\n “They’ll take good care of you.”\n She stared down at the beer, the foam spilling over. “Peddling their crap now?”\n He had the courtesy to look hurt and a little affronted.\n “It’s fuckin’ plants, Terry. The shuttle’s no bigger than my grandpa’s minivan.”\n He held up a hand, authoritative, someone’s boss now. “You and the hyperbole. I can’t help you, Karen.” He dipped his chin and avoided her eyes. “And I don’t know that I would if I could. You’re my friend. I don’t want to see you suffer.”\n “You look really broken up.”\n He looked up, lines around his mouth, jaw taut. “This is what we’ve come to? After what happened?”\n She could feel her body tightening, squeezing up around that hole behind her breast, trying to press into that vacuum.\n “See where that got us,” she whispered.\n And they refused to talk anymore about it, about the night when they had both woken from dead sleep to what they thought were lights flashing and alarms ringing from the shuttle’s console. But it had been quiet, the noise an illusion. They had felt unsettled for the next day and the day after that until the unease had settled into routine, a nervous jumpiness at the back of the brain, the base of the skull. It was both something and nothing, nothing to be reported.\n “One more, for old times’ sake?” Terry held up the pitcher. There was hardly enough for one left.\n “They’ll scold me if I come back drunk,” she said. He laughed, then smiled uncomfortably when her expression didn’t shift. “The bots can tell just by looking at you.”\n “A little alcohol never hurt anyone.”\n “Chemo and alcohol don’t mix.”\n Terry grunted and nodded his head, though it was probably the first he’d heard of it. When she caught his eyes again, they were wet, sparkling in the dim light.\n “I didn’t realize it was that bad.” He cleared his throat. “Old school, chemo.”\n “I blame space,” she said, letting him off the hook, leaning back into the booth. “Bad for the body,” she joked.\n He was still tense, his arms resting too quiet on the table. “Why do you want to go back then?”\n She swallowed and wished she could find her anger again. “Good for the soul.” It was cheesy and she wasn’t sure what she actually thought about souls. But space seemed a good place to find out. Especially at the end.\n “Help a friend out.”\n He didn’t say no right away.\n Karen felt for the cards in the bedside table without looking, smoothing out a playing space on the bedspread at the same time. She shuffled with practiced ease and laid out the cards for solitaire. One slipped off the bed, twisting in midair. She sighed and then, suddenly angry, wiped all the cards away. They hit the floor tiles with a soft patter. A man across the room craned his head off the pillows.\n “Sorry.” She waved her hand in apology. “Sorry.” She shifted off the bed with effort and collected the cards. Her fingers trembled, almost impossible to see. But the bot passed by, and she was sure that it had somehow sensed her hesitation, her near-drop of the ace of spades.\n She dumped the cards in the drawer without replacing them in the box. She felt nauseous after that morning’s round of chemo. The doctors had ruled out radiation and gene therapy early on for reasons that Karen could have, but had refused to, follow. The chemo made her feel ill, but at least it was something. When the doctors had told her the cancer was rare and unresearched, she was worried they might ask her to sacrifice that too, her life to science.\n She peeled back the foil lid on the jello she had taken for lunch from the cafeteria. It was bright red. She let it sit on her tongue, the flavor so bright it was almost acidic. As she swallowed, she glanced at her email. Nothing from Terry. But there was a new crossword of the day. She opened it, setting the jello aside, and swiped her finger across the screen of her phone to construct words from selected letters. The little black squares, the empty spaces between answers, danced in front of her eyes, even she when closed them. Black dots wandered across the red at the back of her eyelids.\n And so she spent the early afternoon, drifting in and out of sleep.\n Karen woke to the sound of alarms, ones that imitated the noise of klaxons and three-bell emergencies. The urgency she felt was almost out of place, as if she expected to be on the deck of a ship at open sea, the waves crashing down on the plank or rearing up tall in front.\n “Terry,” she said. She threw off the sheet, her feet drifting, the force of her motion propelling her towards the control panel before she had time to consciously decide on any action.\n He was not far behind her, and she saw the fear in his eyes, momentary but there. It was only when she looked at him that she realized there was no sound, that his fear seemed absurd in the silence.\n “What did you hear?” She performed a mental survey of the panel as she asked. There were no abnormal readings, no blinking lights. Her hand still reached out, looking for something to fix or alter. He didn’t answer. He scratched his neck below his ear.\n “I thought we were in trouble,” she said, finally, when the silence had stretched out too long.\n “So did I.” But he did not seem convinced that the trouble had passed.\n “Check the hatch doors, I guess.” She tried to steer them back into a routine. The pressure was on her, she felt, to reassert normalcy.\n “I felt like I was drowning,” he whispered. “Like a kid at the beach, head pushed down under the waves. Unable to find my way up.”\n It was the same panic she had felt, down to the memory of salt water in her nose. “It’s alright, Terry.”\n He shrugged, his face clearing a bit. “I imagine we won’t know. Not until twenty years from now and we look back and we realize what we lost tonight. What we misplaced while sleeping.”\n Karen tried to write her sister a letter. It was hard to remember how to form some of the letters in cursive. She felt infantile struggling with the loop of the capital G.\n “They stole it!” One of the other patients was struggling to get out of his chair, yelling at the aide. “Five quarters, all there. Set oldest to newest.” He pointed with a trembling finger. His jaw was slack, tongue lolling while he tried to catch his breath. The aide moved with long-suffering patience to help him walk to his bed.\n Karen shook her head clear and refocused on the letter. Her chest hurt, but the doctors told her this particular pain was likely psychosomatic. You didn’t necessarily feel the cancer where it was eating at you.\n She wasn’t sure what to say that wouldn’t sound hollow or dull. Small talk didn’t translate well to cursive. She amused herself to think that some later researcher might find her letters stuffed in a forgotten box at an archive, the letters of one of the first privately-employed astronauts. She imagined the researcher with a handheld light, hair glowing soft in that light, eyes lit up with curiosity.\n She glanced back at the paper. Her sister would probably throw it out, unaware it was Karen’s only will and testament. And paper seemed antique, now that she thought of it. Perhaps an email would do just as well. She couldn’t seem to find the energy right then, though. And it was important she rest. She folded the paper up once and then again, until it was a small, tight square. She slipped it into the drawer of the bedside table with the playing cards.\n She sat on the side of the bed, unlatching her watch and taking out her lenses. She curled under the weighted blanket and thought how good it felt, to be so heavy, to leave an imprint on the mattress.\n She slept until it was dark.\n The dark was disorienting, because no one in the ward had turned on any lights. Karen fumbled for her watch and glanced at the time. It was almost nine. She could hear the gentle click of the nurses’ shoes in the hallway, the flicker of the night lights. Terry would be waiting.\n “It will be my ass,” he said as the waiter cleared their table. “There’s no way they’ll think you snuck in by yourself. Or that they won’t find the false weights I signed off on.”\n “You’re decorated. You’re a hero. What can they do to you?” He snorted, because they both knew the answer to that.\n “I won’t compromise the mission,” she followed up softly. “It was only automated anyways.”\n “Only.” He stood up and straightened his jacket. “And then they deal with your corpse.” And he bit his lip as if the words had hurt him coming out.\n She didn’t say anything, ducked her head as she zipped up her coat.\n “I don’t understand,” he said again. “I never wanted to go back. Not afterwards.”\n “It’s all I can think of now,” she answered. She couldn’t tell him why. She couldn’t tell herself.\n Outside the institution, as she waited on the sidewalk and tried to hail a cab, Karen looked up at the night. It was expansive, stars winking between the spires of buildings. She placed a hand over her chest and tried to dull the pain there.\n She had not taken any of her medicine with her. She’d taken hardly anything but her old ID and a card to pay the cab.\n The air was warm on her cheek. She breathed in as deeply as she could and refused to cough. She glanced back, but no one was running after to fetch her back. It was not, after all, in theory, an involuntary facility.\n “I never want to go back,” she whispered to herself, and she meant it as fully as Terry had. The place was, if anything, too well known. And it scared her, more than anything else. It was a slow panic, and it did not come with klaxons and bells, but it was panic she felt, looking back at the shadows between the columns, the lights at the windows. A panic as steady as her own heartbeat.\n “Where you going?” The cabdriver rolled down his window.\n She gave him the address to her old workplace.\n They threatened to abort the mission when they found out. But the amount of money already spent, the orbit achieved, the data streaming in from the ship’s computations, made the threat hollow. Karen knew their priorities. She was not one of them.\n She woke up to the eternal twilight of the shuttle’s dim lights. Beneath their own heliotropic lamps, small leafed plants nodded at her. They were so bright a green it hurt her to look at them.\n She swung her legs out of bed and they drifted ahead of her. It took a little bit more effort each day to catch on to something, to pull her pants on, to find and cook some of the emergency rations stowed on the shuttle.\n Karen stopped, as part of her morning routine, at the shuttle’s small window. It was made of thick, layered, silicate glass, and she could sense the distance it created between her and the vast hollow of space. She put one hand on the glass and pressed as hard as she could as if she might break through. She knew that it pressed back, the darkness and the light of it, the alien life of it. It was nothing and it was everything.\n She did not cry, though the instinct was there. She was home, and there was no need to.\n Erin K. Wagner is a speculative fiction writer, interested in examining how the human responds to the inhuman. She grew up in southeast Ohio on the border of Appalachia, but now lives in central New York, where she hikes in the Catskills and listens for ghostly games of nine-pins. She holds her Ph.D. in medieval literature and teaches literature and writing in the SUNY system. She splits her time between academic research, investigating how medieval English writers navigated their own religious identities, and creative writing. Her stories have appeared in a variety of publications, from Apex to Luna Station Quarterly, and her novella The Green and Growing is available from Aqueduct Press."}