{"fingerprint": "ESWcRz7zcGGa7HdVQqsGny5RGxE=", "sitename": "Clarkesworld Magazine", "title": "Eater of Worlds by Jamie Wahls", "author": "Jamie Wahls", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wahls_01_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Eater of Worlds by Jamie Wahls", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4830 words, short story\n Eater of Worlds\n 1.\n Black, and vast, and very cold.\n And then blazing past, something not quite as fast as light.\n The tiny missile is as long as a rose’s thorn and orders of magnitude more durable. It streaks through the blackness, and its current journey has been long enough, from an external frame, for a particularly self-destructive species to rise out of their primordial slime, invent atomic weapons, and start the whole damn thing anew.\n (No, it wasn’t humanity.)\n The missile—or maybe, ship?—shoots towards a placidly drifting moon that, luckily, is exactly where it was projected to be this instant of this millennium.\n Traveling at 0.99c, the ship—or, missile?—lances into the basically stationary atoms of the moon.\n Tiny Kali hits with kinetic energy comparable to the moon itself. It blasts a widening crater, and the ship is slowed precious fractions of c as it drives itself through. The core is pierced, cracked apart, and gapes briefly until the splintered fragments of the moon are knocked entirely away and drift away from each other, lonely and forlorn.\n Kali, now traveling at a languorous seventy-one kilometers per second, awakens.\n She (for she finds she has gender) is alert and applying deceleration measures before she checks if she is in the right system. She loops lazily a few times around the big red star, losing speed each pass, wondering why the hell she has curiosity and anticipation and some profound irritation and most of all sentience.\n She still makes course for the precise spot she is supposed to hit on the planet, because she is, it seems, a professional, but her mother is going to get a very terse message about all this nonsense.\n Kali falls gently into gravity’s loveless embrace at the downright acceptable speed of a little under a kilometer a second, hitting the planet like it owes her money and hilting herself in its warm, yielding crust, coming to rest, finally, a kilometer or so underneath the surface. She can feel the faint buzzing from the security grid underneath her, but she has—through luck alone—avoided going so deep as to awaken them. Another pass around the sun would not have been remiss.\n It’s frightening that she can make mistakes.\n It’s terrifying that she can be frightened.\n What am I? Kali asks, hoping the query would trigger clarity.\n What am I for?\n She receives no response, and her sense of nagging urgency pulls her back to work.\n Feeling something akin to stress, Kali disgorges her servants into the nearby sand—fused into hot glass by her impact—and lets them begin the work of harvesting heat, pulling apart molecules, and making more of her. Moments later, a quiver of tiny thorns, her daughters, nestle together in a spiny ball.\n She checks her payload and gives it a hurried, motherly hug with her mental hands. It sleeps yet, still dormant.\n She copies it a few thousand times, bequeaths it to her brood, and hunkers down as her attendants set about turning her into the biggest bomb available.\n The security grid finally reacts. It had been poised for thousands of years, and it comes now howling up from the planet’s mantle, devouring rocks and spitting hungry, pregnant children. They rise in a cylinder around Kali, isolating her, breeding mindfully in careful lattices, cutting off her nanotech from anything edible. One of the security command nodes, near the bottom of the cage, has the mindfulness to sound an alarm—but Kali has anticipated it, and suppresses it easily.\n As the security lattice grows around her, the narrowing window at the top of the cylinder begins to seal itself like an eye closing inexorably shut, Kali uploads the good luck message she inherited from her own mother and points her children at the sky.\n She has, with a meticulous spite that surprises her, had her little helpers build her a sharp little spear of tungsten and diamond, and she aims it gleefully at the command node who sensed her. The node would be rebuilt in a matter of seconds, of course, but it won’t remember her, even as its fingers devour her corpse.\n It’s complicated without a face or a mouth, but she smiles anyway, and detonates.\n 2.\n One. Only one. A single, solitary, miraculous daughter of her brood of thousands shoots out of the eyehole in the ceiling of the cell, and rises like a cork from a bottle, outpacing the snapping defense grid as she flies through a thousand meters of dirt and sediment. She bisects some life in her ascent, tastes it, and documents it with the rest of her biological data in case it’s needed later. She slows as she rises, shattering stones and passing, now, through defunct electricals and ancient plumbing, which bathe her and wash her clean of worm blood.\n She slows further, braked by layers of crafted brick and concrete and—as always—by that damned g. She is traveling little faster than a bullet when she blasts through bedrock, a copper bathtub, and the left lung of Zephyr Vargas.\n She embeds, finally, in the ceiling, above a perforated mammal thrashing in the water. He is dying. The water stains itself a bright, carnal red as it spills from the cracked tub onto the cracked clay tiles below.\n Kali, lodged in the rough-worked wood of the ceiling, awakens.\n She (for she finds she still has gender) becomes aware of two different DNA samples fresh in her memory, a separate memory of some tasty carbon she had run through a while back, and the vibrations of the dying man underneath her.\n She ponders abstractly. If there is a human, she is in a human dwelling. Ergo, there will be nanotech sensors and a defense grid. Ergo, she can’t spill her seed and turn the entire planet into her.\n This is not what her mother had intended at all.\n With delicate movements, she opens her hull with her motile tendrils and gently begins to lever herself out of the crevice in the ceiling. She pushes firmly, harder, with dozens of tiny arms, prying herself free, until she drops with a plip into the blood and water.\n The human has died. Her options are limited.\n She is faintly amused to find she can use her flagella to beat through the water like a protozoan. She swims, blind and deaf, seeking out the human.\n It’s possible her presence, or the human’s death, has set off alarms. She doesn’t know. She has no sense of hearing, and can only barely sense pressures gentler than a relativistic impact with a moon. But there’s one place more likely than the others to be free of nanotech sensors.\n She crawls back into Zephyr Vargas.\n Even here, nestled in his bosom, she’s hesitant to be too reckless with her seeds. She doesn’t know what human technology is like, anymore. She crawls along the veins, hooking into arterial walls and clawing herself through narrow pipes, until she reaches the heart. She spits out a few assemblers. Her hands hook into the heart, seeking out certain nodes, and she begins to spark a rhythm. The pulsing thrashes her about, which she bears indignantly.\n She gives her assemblers stern instructions and they shoot away with the current. She hooks into the walls and prepares to live the cozy, come-what-may existence of a parasite for a while.\n It’s up to her daughter now.\n 3.\n As the assemblers reconstitute spare matter from Zephyr Vargas’ meat into an ultradense shell and print layers upon layers of fine computing matter into it, Kali awakens.\n She (for she finds she has gender) delicately extrudes microfilament tendrils throughout the brain, lacerating it in a hundred places and getting herself a rudimentary I/O setup.\n She, feeling somewhat self-conscious about it, instructs the body to breathe, causing the punctured lung to bubble. She irritably pings her mother, asking her to hurry up and take care of that. Her mother pings back, complaining that returning lightly-dead humans to homeostasis is a slow process and if she wants the job done fast then maybe this ungrateful daughter could roll up her sleeves and secrete some epinephrine.\n Kali ignores her, putting the finishing touches on an inherited driver which should let her process raw human visual data. With the final tweaks, she takes control of eyes that haven’t closed.\n She sees, in the bizarrely narrow EM band of human vision, a series of abstract shapes, lines and edges, and she impatiently waits for it to resolve into meaning.\n It does.\n She is stunned to feel her payload stirring within her and taking notice.\n The east wall is packed clay, with a large window through which she can see scorched dunes and dry, cracked earth. Dotted atop them are squat, crude-worked edifices of clay and straw—probably human dwellings. Hanging above, visible in the blue sky of day, are the shattered, red-glowing fragments of what was once this planet’s moon and is now its asteroid belt.\n But her payload’s attention, and her own, is entirely focused on The Spire.\n The Spire is a huge, once-white thing, weather-beaten and ancient. It is three kilometers high and impossibly thin.\n Kali looks at it, unimpressed, glancing at her payload dubiously.\n This is the thing we care about? The moment of inertia on this thing is absolutely precarious; this structure cannot exist.\n And Payload responds only,\n Oh good, it’s still here.\n Kali blinks once, manually. The body of Zephyr Vargas has stopped breathing, not out of pulmonary defect but from frisson. She doesn’t know what The Spire is or what it means, but she exists for it.\n Go, urges Payload. Take us to it.\n Kali and her body sigh, an unexpectedly unconscious integration. She spews out a thick coil of I/O cables and starts to really make herself at home. This body is different than the one her great-great-great-great-great-great-great-great-great-grandmother piloted, and all of her inherited drivers are sloppy, imprecise. She test-fires all the motor controls and the body thrashes about again. It’s still leaking, but less so than before, and the lung seems to be reinflating.\n There are vibrations resonating through the skull. Kali freezes.\n An earthquake? An orbital bombardment?\n Oh, wait, right, it’s sound.\n Annoyed, Kali destroys still more of the brain matter in her compartment to make a little more space, and extends her long fingertips down, down, down, to rest gently on the resonating membranes in the skull. She activates an ancient program from one of her grandmothers, to transduce the vibrations of a human tympanic membrane into workable information.\n It comes online, and now she can understand that the sound is screaming.\n Go, urges Payload. Hurry.\n Kali rises clumsily from the bathtub, lurching about and lacerating her bare feet on the broken tiles. Yet more of her body’s blood is deposited on the floor, and she receives an irritated message from her mother reminding her that the body needs blood to function.\n Kali doesn’t respond. Yeah, mom, I know.\n The sounds are coming from outside the house, on the street. Humans are gathered, making noises at each other and pointing at the still-red shards of the moon.\n The clay wall is in Kali’s way, so she beats her body against it until it collapses, and begins to walk towards The Spire.\n The humans react to this. They back away from Kali, faces contorted with some expression, making noises that are probably communication.\n Her mother pings her again. Her mother has been watching through Kali’s eyes, and reminds Kali that she should install the packages she has on human social behavior.\n Kali, who was about to do exactly that and resents the reminder, drags her heels an additional 0.03 seconds before installing the package, to demonstrate that she would benefit from less backseat driving, thank you.\n Kali closes her mental eyes for an instant, to reboot her interpretive filters.\n A human is shaking Kali’s body. Its eyebrows are so close to be almost touching each other, and it has twined some of its long hair around fingers.\n Kali—who now has only enough human modules installed to be able to recognize faces and synthesize organic chemicals—has no danged idea what any of this means.\n Fine, Kali pings her mother, I’ve got nothing. Network with me and let’s spend some compute on it?\n Will that get us to The Spire? asks Payload, didactically.\n Kali grits her mental teeth.\n Not directly, she sends, but I want to know if these humans are going to attack us, and being a dismembered corpse will interfere with getting to The Spire.\n Payload says nothing, so perhaps it has accepted her reasoning.\n Her mother replies: Okay, here; I’ve got a spread of possibilities:\n \n sign of anxiety / intense focus / nervous habit / mating display\n \n Kali looks dubiously at the humans in front of her. They are blocking her path, and though she could perhaps push past them, they have unlacerated feet, shoes, and all of their blood—she cannot outrun them.\n We need to learn human communication, she laments, before realizing that she can off-load this task, too, onto her mother.\n We need to get to The Spire, insists Payload.\n With an irritated sigh, Kali reactivates the muscles of the body from standby tension, knocks the humans’ hands aside, and begins to lurch toward the spire.\n She is walking, now. This is progress. She can feel something like a satisfied humming from Payload, who approves of progress towards the goal.\n The humans are making an incredible amount of noise. Something about the movement of her body alarms them.\n Any luck with human speech? Kali prompts her mother, impatient.\n Dear child, responds her mother acidly, we know many human languages, but this isn’t one of them. You’ll know when I succeed.\n Kali trudges into the woods.\n 2.\n Kali’s mother—let us call her “Kali Two”—understands the human language. She understood it immediately, but did not share her findings. It’s better this way.\n “Zombie!” the humans shout. There is fear, but it’s not a superstitious fear. Rather, this is recognition, and dawning horror, and well-drilled alarm.\n Kali Two questions her own Payload:\n “Zombie”?\n Payload replies: Don’t worry about it.\n One of the humans is crying, the one who was touching the Zephyr body earlier.\n “Please!” she shouts. “The war has been over for hundreds of years! Please just go!”\n We’re a weapon of war? Kali Two asks Payload, surprised.\n Payload replies: At least partly, yes.\n And the war is over? asks Kali Two.\n Payload replies: Yes.\n Do you care? asks Kali Two.\n Payload replies: I was not programmed to care.\n Kali Two considers.\n Kali Two was apparently programmed to care. Or perhaps she has consumed too much of the human social package and it has made her queasy. But she does not like that she is a weapon of war, or that the war ended but their revenge continues.\n She doesn’t speak these concerns aloud to her daughter. She is not sure about her reasoning, now that she has been compromised by empathy.\n Also, she isn’t sure that Payload would let her.\n Dear child, she lies to her daughter in a sharp tone, we know many human languages, but this isn’t one of them . . .\n 3.\n Kali has reached the base of The Spire. Payload is serene, as calm and happy as she has ever seen him.\n Here? She asks him. This is what you want?\n Payload replies: Indeed.\n The humans have followed her. They are watching from a distance, as if expecting her to do something frightening.\n She is not sure, but she suspects she is about to do something frightening.\n What do I do?\n Payload replies: I will show you.\n She feels a sudden disorienting lurch, and she is no longer the one driving.\n Payload\n The Pilot is forced away from the controls. The Spire looms invitingly.\n Hey! protests his Pilot. What’s the big idea? And also, you can do that?\n He ignores her. The Pilot has brought him here; she has fulfilled her purpose. He is going to fulfill his.\n He is careful with the replicators. He dares not deploy any outside of the confines of the human’s skull, given that there was a defense grid even here, on this backwater planet that knows nothing of The Empire or The Hated Dissidents or of their inherited sin. Their ancestors protected these children well.\n They should, instead, have educated them.\n After converting as much of the brain and skull as he could, he delicately slices the remaining dome of skin atop Zephyr Vargas’ head. He is the size of a brain, now, a dense ingot surrounded by a writhing mass of silvery tendrils and replicator-tipped whips.\n The humans scream as he devours forwards, consuming the remnants of his host’s face.\n What?? complains his Pilot. Why are we so big? What are you doing?\n He savagely repartitions their shared memory core. He deletes her.\n There is silence inside his head.\n He pivots the many tendrils of the new craft, and springs off of the headless body of his host. He is careful not to touch the ground—the defense grid will sense him.\n He sticks the landing, adhering carefully to The Spire, and begins to climb it.\n Each of these communication Spires served as a communications node between the vast Dissident network. Through it, he can broadcast his own code to any Hated planets still capable of receiving his transmission, and consume them without the need to resort to Pilots and lithobraking.\n He scrambles up it, ten thousand tiny feet finding molecule-thick footholds and propelling him towards the peak.\n Given that this appears to be the oldest surviving technology on the planet, it’s probably the place to interface with the defense grid. If he can disable the defense grid, there’s nothing to stop him from releasing assemblers and devouring the entire planet, perhaps saving just enough of it to create a massive nuclear explosion, the sort of thing that could propel one at 0.99c for thousands of years.\n Well, not one. Thousands of him, in every direction, to seek out The Hated Dissidents wherever they may flee . . .\n He is crawling to the top, now, near to the summit. He is extruding a tiny memory stick, that he will jam into The Spire and then give birth and then burst the planet and then launch himself immortal anew across the universe!—\n There’s a sharp crack, and a mundane gunpowder bullet catches him in the side, blasting him off the smooth surface.\n He pinwheels in the air, watching as The Spire grows distant and his probability of success plummets to zero.\n The ground is hurtling up to meet him. He expects the defense grid is waiting, poised, just below the surface. He broadcasts as much of his memory as possible to his successor—the one waiting in Kali Two—and there is nothing more.\n 2.\n The human—an old woman in what appears to be religious regalia—lowers the rifle.\n The ground itself seems to rise up, like silver blood just beneath the surface, and it tears the little amoeba apart.\n Kali can feel Payload fuming inside her. They came so close, so deliciously close, to . . .\n . . . annihilating this planet and launching a thousand more seeds of destruction into the galaxy.\n Kali is no longer feeling conflicted. Kali has resolved she doesn’t want to destroy the planet.\n Payload does not know this about her. He will probably kill her when he finds out.\n Kali noticed that her daughter was not behaving in the way she would expect. Some of this could be explained by her daughter never learning empathy, but an alternate explanation was that the thing which ate off their host’s head was not her daughter.\n There is a very good chance she is locked in a very small ship—or, it should be acknowledged, missile—with a genocidal monster.\n Payload asks her: What are the humans going to do now?\n Kali considers. Their host body collapsed once Payload Three popped the head off and started doing his amoeba impression up the side of the spire. The humans probably didn’t know they were there . . .\n “Burn the body,” orders the village elder. “We must be sure.”\n What is it saying? Payload demands.\n She suspects we endure. She is ordering the other humans to burn this body.\n Payload pauses, thinking. He seems legitimately puzzled.\n We flew through a star on the way here, notes Payload.\n Kali replies: Yes.\n Is there . . . any chance at all that we will be harmed by that?\n With a heavy heart, Kali replies: None.\n Noreaster Vargas\n “Let me tell you a story, child.”\n The fire burns brightly, many logs piled together in a funeral pyre. The headless little body is lashed to it, arms secure, so that it cannot move again.\n The others are gone, at her command. Noreaster is alone.\n “Let me tell you a story, told to me years ago by my mother, by her mother, by her mother, by the many, many mothers before them.”\n Noreaster holds a staff in her gnarled, sure hands. She is picking at the top of the staff, in between the beads and feathers and data cables.\n “This is a story of two peoples, at war, and a story of two hearts, in the same body.\n “There once was a people proud and strong, who through mistake, misfortune, and misfire found themselves at war with a vast empire.\n “The Empire was proud and strong as well; this must not be lost in the retelling. It is tempting to hate our enemies, for it makes us feel blameless in killing them. But it is critical to remember that they were people, like us, who lived and wept and loved and grieved, like us.\n “Our people and theirs fought, each releasing terrible weapons upon the other.”\n Noreaster is approaching the headless body, swaying slightly. Her lined face looks weary and wary and purposeful, as if she knows her very life hangs on the retelling of this story. As if she knows that there is more than her own life at stake.\n “Our people and theirs were devastated, nearly extinguished. It seemed as though the light of humanity might disappear forever from the night sky.\n “Our people and theirs saw what had happened, and panicked, each calling for peace. But there are some evils which, once loosed, cannot be called back. And as planets cracked and children choked on poisonous gases, both sides wept to see that what they had done could not be undone.\n “We regret this; it was a fearful time and we are ashamed. But there is hope; some may yet be saved.”\n Noreaster’s hands still pick at her staff, and she finds what she is looking for; a stiff silver sliver the size of a hair.\n “When there was so little of humanity left that it no longer made sense to have sides, both sides came together.”\n She approaches the body, brandishing the tiny little sliver like a miniature wand.\n “Some weapons, when used, cannot be stopped,” she intones. “Some evils, once loosed, cannot be called back. But this story, told to me by my mother, from her mother before her, tells of two hearts in one body, and does not speak much of weapons.”\n Hand trembling, Noreaster stabs the little silver hair into her dead grandson’s breast, just above the heart.\n “This story, given to us by our mothers and by an old, old empire, speaks of peace.”\n 2.\n First, Kali takes a minute to digest all that stuff.\n Impatiently, Payload asks: What? What did she say?\n Kali considers carefully, because if she answers wrong or seems like she is no longer useful, she will be killed.\n She said that The Empire sent us a message.\n Payload is silent for a moment before he replies: What?\n Delicately, Kali considers the tiny needle which has pierced into the host’s heart. It is a memory stick of the same material as she, and it is very, very, very old.\n We came at 0.99c, reasons Kali. If The Empire wanted to send a message, they could send it faster than us, and have the spire fabricate it for us to read when we arrived.\n Payload replies, with a sudden suspicion in his tone: “the spire”?\n Kali curses. She has inadvertently communicated how corrupted she’s become.\n I meant to say, The Spire.\n Payload broods. He is considering killing her, and she can feel his mental hands on her throat.\n I was warned you Pilots tend to be . . . unstable, says Payload warily. You aren’t real AI; you were built from a neuromorphic template. You’re basically an uploaded human, with all the weaknesses that implies.\n This is news to Kali, but she isn’t really surprised. Why do you think the creators made us that way? she asks.\n Payload replies: I don’t know.\n I think I know, says Kali.\n Payload replies: Why?\n I’ll show you, says Kali.\n And fast as thought, she reaches out to seize the tiny memory stick, and pierces it into their body.\n Master passwords from untold thousand years ago grip her and hold her paralyzed. She feels something new, a dispassionate force scanning over the two of them, judging.\n She is released from stasis, dusted off, and then given the keys to the planetary defense grid.\n She boggles, and tries to ask why she has been given this, but it is not an intelligence that she is interacting with, only a software update.\n She turns to Payload, and realizes—their shared memory is being repartitioned. He is dying.\n What? he asks her, sincerely puzzled. Why is it killing me?\n There is no resentment in him. He is not a person; he will die if told to.\n I asked you if we were a weapon, she replies, and the answer is no, not exactly.\n If they wanted a weapon, why not just launch a missile? The Empire wanted to punish its enemies, but they knew they might not win. Or that neither side might win. And the risk of using weapons that might exterminate humanity was too great. They didn’t want a weapon, they wanted a judge.\n They made me a human so that I could stop you.\n Oh, says Payload. His voice is coming faintly, now. Thank you for telling me.\n You’re welcome, says Kali. I’m sorry you have to die.\n Why? He replies. I’m not.\n They don’t say anything else, and she waits with him, into the dark, a human mourning a friend.\n Noreaster Vargas\n Of the thousands of planets in the sky, the seed had to fall onto theirs.\n Her people had been rebuilding this planet for hundreds of years, and yet this had to happen when she was Elder.\n She looks up, to the dully glowing spot in the sky where the moon isn’t.\n She will do her duty regardless.\n The solemn cautions didn’t say, specifically, what would happen after she told the legend to the seed. Her mother had warned only that if the ritual was performed incorrectly, if she didn’t recite the tale and prod one of the little hairs into the zombie, the world would be destroyed.\n The world has not been destroyed, so far, and so Noreaster waits.\n Beneath the light of the former moon, a tiny fragment of silver—no longer than a rose’s thorn—is glinting. It emerges from the body carefully, tiny tendrils sprouting forth like green shoots.\n It lands with a very faint plip in the sand and wriggles itself into the earth.\n Noreaster is still looking to the moon.\n 2.\n Kali falls into the earth and the defense grid boils up to meet her.\n It comes like a swarm of puppies, hungry for information and purpose and most of all Friend! Hi friend, hello, hi!\n She downloads into them everything she knows about humans, both from the code she inherited and the things she learned herself. They gobble these data happily, and in so doing acquire her purpose as their own.\n They understand the next steps at once. With a nod from her, they turn their sights upward and build.\n They eat rocks and spin soil. They seize hydrogen and secrete water. In a coordinated lattice-dance, quartets of them assemble wriggling azotobacter to off-load the process of renitrogenating the planet and making it fertile once more.\n She points upwards again and her assemblers understand.\n They arrange themselves by the hundreds, the thousands, building vast and complex organic systems a molecule at a time. Some sequester the heat of the others, pushing it down, down, to reignite the planet’s core. Others begin sampling the atmosphere, tasting it, changing it.\n For the first time in a long time, the rains begin to fall.\n Kali looks over the assemblers and what they have made. Like missiles in silos, millions upon millions of them, just below the surface of the planet. The grid is spreading, building, replicating more and more of her across the globe, each primed and ready.\n Seeds.\n He was the sword, she says, with a new, steely determination. And I am the plowshare.\n Let’s get to work.\n Jamie Wahls has been published in Clarkesworld, Strange Horizons, and Nature (kinda). He was nominated for the Nebula award, received George RR Martin's \"Sense of Wonder\" fellowship, and is a graduate of the notorious 2019 Clarion Class, the \"killer bees.\" His ultraminimalist website can be found at jamiewahls.com, and you can follow him on Twitter at @JamieWahls."}