{"fingerprint": "WjfvqnTxJkrX227ZWa70YBfNoWs=", "sitename": "Clarkesworld Magazine", "title": "Night of the Cooters by Howard Waldrop", "author": "Howard Waldrop", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/waldrop_05_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Night of the Cooters by Howard Waldrop", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7390 words, short story, REPRINT\nNight of the Cooters\nSheriff Lindley was asleep on the toilet in the Pachuco County courthouse when someone started pounding on the door.\n“Bert!” the voice yelled as the sheriff jerked awake.\n“Gol Dang!” said the lawman. The Waco newspaper slid off his lap onto the floor.\nHe pulled his pants up with one hand and the toilet chain on the water box overhead with the other. He opened the door. Chief Deputy Sweets stood before him, a complaint slip in his hand.\n“Dang it, Sweets!” said the sheriff. “I told you never to bother me in there. It’s the hottest Thursday in the history of Texas! You woke me up out of a hell of a dream!”\nThe deputy waited, wiping sweat from his forehead. There were two big circles, like half-moons, under the arms of his blue chambray shirt.\n“I was fourteen, maybe fifteen years old, and I was a Aztec or a Mixtec or somethin’,” said the sheriff. “Anyways, I was buck naked, and I was standin’ on one of them ball courts with the little bitty stone rings twenty foot up one wall, and they was presentin’ me to Moctezuma. I was real proud, and the sun was shinin’, but it was real still and cool down there in the Valley of the Mexico. I look up at the grandstand, and there’s Moctezuma and all his high muckety-mucks with feathers and stuff hangin’ off ’em, and more gold than a circus wagon. And there was these other guys, conquistadors and stuff, with beards and rusty helmets, and I-talian priests with crosses you coulda barred a livery-stable door with. One of Moctezuma’s men was explainin’ how we was fixin’ to play ball for the gods and things.\n“I knew in my dream I was captain of my team. I had a name that sounded like a bird fart in Aztec talk, and they mentioned it and the name of the captain of the other team, too. Well, everything was goin’ all right, and I was prouder and prouder, until the guy doing the talkin’ let slip that whichever team won was gonna be paraded around Tenochtitlan and given women and food and stuff like that; and then tomorrow A.M. they was gonna be cut up and simmered real slow and served up with chilis and onions and tomatoes.\n“Well, you never seed such a fight as broke out then! They was a-yellin’, and a priest was swingin’ a cross, and spears and axes were flyin’ around like it was an Irish funeral.\n“Next thing I know, you’re a-bangin’ on the door and wakin’ me up and bringin’ me back to Pachuco County! What the hell do you want?”\n“Mr. De Spain wants you to come over to his place right away.”\n“He does, huh?”\n“That’s right. Sheriff. He says he’s got some miscreants he wants you to arrest.”\n“Everybody else around here has desperadoes. De Spain has miscreants. I’ll be so danged glad when the town council gets around to movin’ the city limits fifty foot the other side of his place, I won’t know what to do! Every time anybody farts too loud, he calls me.”\nLindley and Sweets walked back to the office at the other end of the courthouse. Four deputies sat around with their feet propped up on desks. They rocked forward respectfully and watched as the sheriff went to the hat pegs.\nOn one of the dowels was a sweat-stained hat with turned-down points at front and back. The side brims were twisted in curves. The hat angled up to end in a crown that looked like the business end of a Phillips screwdriver. Under the hat was a holster with a Navy Colt .41 that looked like someone had used it to drive railroad spikes all the way to the Continental Divide. Leaning under them was a ten-gauge pump shotgun with the barrel sawed off just in front of the foregrip.\nOn the other peg was an immaculate new round-top Stetson of brown felt with a snakeskin band half as wide as a fingernail running around it.\nThe deputies stared.\nLindley picked up the Stetson.\nThe deputies rocked back in their chairs and resumed yakking.\n“Hey, Sweets!” said the sheriff at the door. “Change that damn calendar on your desk. It ain’t Wednesday, August seventeenth; it’s Thursday, August eighteenth.”\n“Sure thing, Sheriff.”\n“And you boys try not to play checkers so loud you wake the judge up, okay?”\n“Sure thing, Sheriff.”\nLindley went down the courthouse steps onto the rock walk. He passed the two courthouse cannons he and the deputies fired off three times a year—March second, July fourth, and Robert E. Lee’s birthday. Each cannon had a pyramid of ornamental cannonballs in front of it.\nWaves of heat came off the cannons, the ammunition, the telegraph wires overhead, and, in the distance, the rails of the twice-a-day spur line from Waxahachie.\nThe town was still as a rusty shovel. The forty-five-star United States flag hung like an old, dried dishrag from its stanchion. From looking at the town you couldn’t tell the nation was about to go to war with Spain over Cuba, that China was full of unrest, and that five thousand miles away a crazy German count was making airships.\nLindley had seen enough changes in his sixty-eight years. He had been born in the bottom of an Ohio keelboat in 1830; was in Bloody Kansas when John Brown came through; fought for the Confederacy, first as a corporal, then a sergeant major, from Chickamauga to the Wilderness; and had seen more skirmishes with hostile tribes than most people would ever read about in a dozen Wide-Awake Library novels.\nIt was as hot as under an upside-down washpot on a tin shed roof. The sheriff’s wagon horse seemed asleep as it trotted, head down, puffs hanging in the still air like brown shrubs made of dust around its hooves.\nThere were ten, maybe a dozen people in sight in the whole town. Those few on the street moved like molasses, only as far as they had to, from shade to shade. Anybody with sense was asleep at home with wet towels hung over the windows, or sitting as still as possible with a funeral-parlor fan in their hands.\nThe sheriff licked his big droopy mustache and hoped nobody nodded to him. He was already too hot and tired to tip his hat. He leaned back in the wagon seat and straightened his bad leg (a Yankee souvenir) against the boot board. His gray suit was like a boiling shroud. He was too hot to reach up and flick the dust off his new hat.\nHe had become sheriff in the special election three years ago to fill out Sanderson’s term when the governor had appointed the former sheriff attorney general. Nothing much had happened in the county since then.\n“Gee-hup,” he said.\nThe horse trotted three steps before going back into its walking trance.\nSheriff Lindley didn’t bother her again until he pulled up at De Spain’s big place and said, “Whoa, there.”\nThe black man who did everything for De Spain opened the gate.\n“Sheriff,” he said.\n“Luther,” said Lindley, nodding his head.\n“Around back, Mr. Lindley.”\nThere were two boys—raggedy town kids, the Strother boy and one of the poor Chisums—sitting on the edge of the well. The Chisum kid had been crying.\nDe Spain was hot and bothered. He was only half dressed, with suit pants, white shirt, vest, and stockings on but no shoes or coat. He hadn’t macassared his hair yet. He was pointing a rifle with a barrel big as a drainpipe at the two boys.\n“Here they are, Sheriff. Luther saw them down in the orchard. I’m sure he saw them stealing my peaches, but he wouldn’t tell me. I knew something was up when he didn’t put my clothes in the usual place next to the window where I like to dress. So I looked out and saw them. They had half a potato sack full by the time I crept around the house and caught them. I want to charge them with trespass and thievery.”\n“Well, well,” said the sheriff, looking down at the sackful of evidence. He turned and pointed toward the black man.\n“You want me to charge Luther here with collusion and abetting a crime?” Neither Lindley’s nor Luther’s face betrayed any emotion.\n“Of course not,” said De Spain. “I’ve told him time and time again he’s too soft on filchers. If this keeps happening, I’ll hire another boy who’ll enforce my orchard with buckshot, if need be.”\nDe Spain was a young man with eyes like a weimaraner’s. As Deputy Sweets said, he had the kind of face you couldn’t hit just once. He owned half the town of Pachuco City. The other half paid him rent.\n“Get in the wagon, boys,” said Lindley.\n“Aren’t you going to cover them with your weapon?” asked De Spain.\n“You should know by now, Mr. De Spain, that when I wear this suit I ain’t got nothin’ but a three-shot pocket pistol on me. Besides”—he looked at the two boys in the wagon bed—“they know if they give me any guff, I’ll jerk a bowknot in one of ’em and bite the other’n’s ass off.”\n“I don’t think there’s a need for profanity,” said De Spain.\n“It’s too damn hot for anything else,” said Lindley. “I’ll clamp ’em in the juzgado and have Sweets run the papers over to your office tomorrow mornin’.”\n“I wish you’d take them out one of the rural roads somewhere and flail the tar out of them to teach them about property rights,” said De Spain.\nThe sheriff tipped his hat back and looked up at De Spain’s three-story house with the parlor so big you could hold a rodeo in it. Then he looked back at the businessman, who’d finally lowered the rifle.\n“Well, I know you’d like that,” said Lindley. “I seem to remember that most of the fellers who wrote the Constitution were pretty well off, but some of the other rich people thought they had funny ideas. But they were really pretty smart. One of the things they were smart about was the Bill of Rights. You know, Mr. De Spain, the reason they put in the Bill of Rights wasn’t to give all the little people without jobs or money a lot of breaks with the law. Why they put that in there was for if the people without jobs or money ever got upset and turned on them, they could ask for the same justice everybody else got.”\nDe Spain looked at him with disgust. “I’ve never liked your homespun parables, and I don’t like the way you sheriff this county.”\n“I don’t doubt that,” said Lindley. “You’ve got sixteen months, three weeks, and two days to find somebody to run against me. Good evening, Mr. De Spain.”\nHe climbed onto the wagon seat.\n“Luther.”\n“Sheriff.”\nHe turned the horse around as De Spain and the black man took the sack of peaches through the kitchen door into the house.\nThe sheriff stopped the wagon near the railroad tracks where the houses began to deviate from the vertical.\n“Jody. Billy Roy.” He looked at them with eyes like chips of flint. “You’re the dumbest pair of squirts that ever lived in Pachuco City! First off, half those peaches were still green. You’d have got bellyaches, and your mothers would have beaten you within an inch of your lives and given you so many doses of Black Draught you’d shit over ten-rail fences all week.\n“Now listen to what I’m sayin’, ’cause I’m only gonna say it once. If I ever hear of either of you stealing anything, anywhere in this county, I’m going to put you both in school.”\n“No, Sheriff, please, no!”\n“I’ll put you in there every morning and come and get you out seven long hours later, and I’ll have the judge issue a writ keeping you there till you’re twelve years old. And if you try to run away, I’ll follow you to the ends of the earth with Joe Sweeper’s bloodhounds, and I’ll bring you back.”\nThey were crying now.\n“You git home.”\nThey were running before they left the wagon.\nSomewhere between the second piece of corn bread and the third helping of snap beans, a loud rumble shook the ground.\n“Goodness’ sakes!” said Elsie, his wife of twenty-three years. “What can that be?”\n“I expect that’s Elmer, out by the creek. He came in last week and asked if he could blast on the place. I told him it didn’t matter to me as long as he did it between sunup and sundown and didn’t blow his whole family of rug rats and yard apes up.\n“Jake, down at the mercantile, said Elmer bought enough dynamite to blow up Fort Worth if he’d a mind to—all but the last three sticks in the store. Jake had to reorder for stump-blowin’ time.”\n“Whatever could he want with all that much?”\n“Oh, that damn fool has the idea the vein in that old mine that played out in ’83 might start up again on his property. He got to talking with the Smith boy, oh, hell, what’s his name—?”\n“Leo?”\n“Yeah, Leo, the one that studies down in Austin, learns about stars and rocks and all that shit . . . ”\n“Watch your language, Bertram!”\n“Oh, hell, anyway, that boy must have put a bug up Elmer’s butt about that—”\n“Bertram!” said Elsie, putting down her knife and fork.\n“Oh, hell, anyway. I guess Elmer’ll blow the side off his hill and bury his house before he’s through.”\nThe sheriff was reading a week-old copy of the Waco Herald while Elsie washed up the dishes. He sure missed Brann’s Iconoclast, the paper he used to read, which had ceased publication when the editor was gunned down on a Waco street by an irate Baptist four months before.\nThe Waco paper had a little squib from London, England, about there having been explosions on Mars ten nights in a row last month, and whether it was a sign of life on that planet or some unusual volcanic activity.\nSheriff Lindley had never given volcanoes (except those in the Valley of the Mexico) or the planet Mars much thought.\nHooves came pounding down the road. He put down his paper. “Sheriff, sheriff!” he said in a high, mocking voice.\n“What?” asked Elsie. Then she heard the hooves and began to dry her hands on the towel on the nail above the sink.\nThe horse stopped out front; bare feet slapped up to the porch; small fists pounded on the door.\n“Sheriff! Sheriff!” yelled a voice Lindley recognized as belonging to either Tommy or Jimmy Atkinson.\nHe strode to the door and opened it.\n“Tommy, what’s all the hooraw?”\n“Jimmy. Sheriff, something fell on our pasture, tore it all to hell, knocked down the tree, killed some of our cattle, Tommy can’t find his dog, Mother sent—”\n“Hold on! Something fell on your place? Like what?”\n“I don’t know! Like a big rock, only sparks was flyin’ off it, and it roared and blew up! It’s at the north end of the place, and—”\n“Elsie, run over and get Sweets and the boys. Have them go get Leo Smith if he ain’t gone back to college yet. Sounds to me like Pachuco County’s got its first shootin’ star. Hold on, Jimmy, I’m comin’ right along. We’ll take my wagon; you can leave your pony here.”\n“Oh, hurry, Sheriff! It’s big! It killed our cattle and tore up the fences—”\n“Well, I can’t arrest it for that,” said Lindley. He put on his Stetson. “And I thought Elmer’d blowed hisself up. My, my, ain’t never seen a shooting star before . . . ”\n“Damn if it don’t look like somebody threw a locomotive through here,” said the sheriff.\nThe Atkinson place used to have a sizable hill and the tallest tree in the county on it. Now it had half a hill and a big stump and beyond, a huge crater. Dirt had been thrown up in a ten-foot-high pile around it.\nThere was a huge, rounded, gray object buried in the dirt and torn caliche at the bottom. Waves of heat rose from it, and gray ash, like old charcoal, fell off it into the shimmering pit.\nHalf the town was riding out in wagons and on horseback as the news spread. The closest neighbors were walking over in the twilight, wearing their go-visiting clothes.\n“Well, well,” said the sheriff, looking down. “So that’s what a meteor looks like.”\nLeo Smith was in the pit, walking around.\n“I figured you’d be here sooner or later,” said Lindley.\n“Hello, Sheriff,” said Leo. “It’s still too hot to touch. Part of a cow’s buried under the back end.”\nThe sheriff looked over at the Atkinson family. “You folks is danged lucky. That thing coulda come down smack on your house or, worse, your barn. What time did it fall?”\n“Straight up and down six o’clock,” said Mrs. Atkinson. “We was settin’ down to supper. I saw it out of the corner of my eye; then all tarnation came down. Rocks must have been falling for ten minutes!”\n“It’s pretty spectacular, Sheriff,” said Leo. “I’m going into town to telegraph off to the professors at the university. They’ll sure want to look at this.”\n“Any reason other than general curiosity?” asked Lindley.\n“I’ve only seen pictures and handled little bitty parts of one,” said Leo, “but it doesn’t look usual. They’re generally like big rocks, all stone or iron. The outside of this one’s soft and crumbly. Ashy, too.” There was a slight pop and a stove-cooling noise from the thing.\n“Well, you can come back into town with me if you want to. Hey, Sweets!”\nThe chief deputy came over.\n“A couple of you boys better stay here tonight, keep people from falling in the hole. I guess if Leo’s gonna wire the University, you better keep anybody from knockin’ chunks off it. It’ll probably get pretty crowded. If I was the Atkinsons, I’d start chargin’ a nickel a look.”\n“Sure thing, Sheriff.”\nKerosene lanterns and carriage lights were moving toward the Atkinsons’ in the coming darkness.\n“I’ll be out here tomorrow mornin’ to take another gander. I gotta serve a process paper on old Theobald before he lights out for his chores. If I sent one o’ you boys, he’d as soon shoot you as say howdy.”\n“Sure thing, Sheriff.”\nHe and Leo and Jimmy Atkinson got in the wagon and rode off toward the quiet lights of town far away.\nThere was a new smell in the air.\nThe sheriff noticed it as he rode toward the Atkinson ranch by the south road early the next morning. There was an odor like when something goes wrong at the telegraph office.\nSmoke was curling up from the pasture. Maybe there was a scrub fire started from the heat of the falling star.\nHe topped the last rise. Before him lay devastation the likes of which he hadn’t seen since the retreat from Atlanta.\n“Great Gawd Ahmighty!” he said.\nThere were dead horses and charred wagons all around. The ranch house was untouched, but the barn was burned to the ground. There were crisscrossed lines of burnt grass that looked like they’d been painted with a tarbrush.\nHe saw no bodies anywhere. Where was Sweets? Where was Luke, the other deputy? Where had the people from the wagons gone? What had happened?\nLindley looked at the crater. There was a shiny rod sticking out of it, with something round on the end. From here it looked like one of those carnival acts where a guy spins a plate on the end of a dowel rod, only this glinted like metal in the early sun. As he watched, a small cloud of green steam rose above it from the pit.\nHe saw a motion behind an old tree uprooted by a storm twelve years ago. It was Sweets. He was yelling and waving the sheriff back.\nLindley rode his horse into a small draw, then came up into the open.\nThere was movement over at the crater. He thought he saw something. Reflected sunlight flashed by his eyes, and he thought he saw a rounded silhouette. He heard a noise like sometimes gets in bob wire on a windy day.\nHe heard a humming sound then, smelled the electric smell real strong. Fire started a few feet from him, out of nowhere, and moved toward him.\nThen his horse exploded. The air was an inferno, he was thrown spinning—\nHe must have blacked out. He had no memory of what went next. When he came to, he was running as fast as he ever had toward the uprooted tree.\nFire jumped all around. Luke was shooting over the tree roots with his pistol. He ducked. A long section of the trunk was washed with flames and sparks.\nLindley dove behind the root tangle.\n“What the dingdong is goin’ on?” he asked as he tried to catch his breath. He still had his new hat on, but his britches and coat were singed and smoking.\n“God damn, Bert! I don’t know,” said Sweets, leaning around Luke. “We was out here all night; it was a regular party; most of the time we was up on the lip up there. Maybe thirty or forty people comin’ and goin’ all the time. We was all talking and hoorawing, and then we heard something about an hour ago. We looked down, and I’ll be damned if the whole top of that thing didn’t come off like a mason jar!\n“We was watching, and these damn things started coming out—they looked like big old leather balls, big as horses, with snakes all out the front—”\n“What?”\n“Snakes. Yeah, tentacles Leo called them, like an octy-puss. Leo’d come back from town and was here when them boogers came out. Martians he said they was, things from Mars. They had big old eyes, big as your head! Everybody was pushing and shoving; then one of them pulled out one of them gun things, real slow like, and just started burning up everything in sight.\n“We all ran back for whatever cover we could find—it took ’em a while to get up the dirt pile. They killed horses, dogs, anything they could see. Fire was everywhere. They use that thing just like the volunteer firemen use them water hoses in Waco!”\n“Where’s Leo?”\nSweets pointed to the draw that ran diagonally to the west. “We watched awhile, finally figured they couldn’t line up on the ditch all the way to the rise. Leo and the others got away up the draw—he was gonna telegraph the university about it. The bunch that got away was supposed to send people out to the town road to warn people. You probably would have run into them if you hadn’t been coming from Theobald’s place.\n“Anyway, soon as them things saw people were gettin’ away, they got mad as hornets. That’s when they lit up the Atkinsons’ barn.”\nA flash of fire leapt in the roots of the tree, jumped back thirty feet into the burnt grass behind them, then moved back and forth in a curtain of sparks.\n“Man, that’s what I call a real smoke pole,” said Luke.\n“Well,” Lindley said. “This won’t do. These things done attacked citizens in my jurisdiction, and they killed my horse.”\nHe turned to Luke.\n“Be real careful, and get back to town, and get the posse up. Telegraph the Rangers and tell ’em to burn leather gettin’ here. Then get ahold of Skip Whitworth and have him bring out The Gun.”\nSkip Whitworth sat behind the tree trunk and pulled the cover from the six-foot rifle at his side. Skip was in his late fifties. He had been a sniper in the War for Southern Independence when he had been in his twenties. He had once shot at a Yankee general just as the officer was bringing a forkful of beans up to his mouth. When the fork got there, there were only some shoulders and a gullet for the beans to drop into.\nThat had been from a mile and a half away, from sixty feet up a pine tree.\nThe rifle was an .80-caliber octagonal-barrel breechloader that used two and a half ounces of powder and a percussion cap the size of a jawbreaker for each shot. It had a telescopic sight running the entire length of the barrel.\n“They’re using that thing on the end of that stick to watch us,” said Lindley. “I had Sweets jump around, and every time he did, one of those cooters would come up with that fire gun and give us what-for.”\nSkip said nothing. He loaded his rifle, which had a breechblock lever the size of a crowbar on it, then placed another round—cap, paper cartridge, ball—next to him.\nHe drew a bead and pulled the trigger. It sounded like dynamite had gone off in their ears.\nThe wobbling pole snapped in two halfway up. The top end flopped around back into the pit.\nThere was a scrabbling noise above the whirring from the earthen lip. Something round came up.\nSkip had smoothly opened the breech, put in the ball, torn the cartridge with his teeth, put in the cap, closed the action, pulled back the hammer, and sighted before the shape reached the top of the dirt.\nMetal glinted in the middle of the dark thing.\nSkip fired.\nThere was a squeech; the whole top of the round thing opened up; it spun around and backward, things in its front working like a daddy longlegs thrown on a roaring stove.\nSkip loaded again. There were flashes of light from the crater. Something came up shooting, fire leaping like hot sparks from a blacksmith’s anvil, the air full of flames and smoke.\nSkip fired again.\nThe fire gun flew up in the air. Snakes twisted, writhed, disappeared.\nIt was very quiet for a few seconds.\nThen there was the renewed whining of machinery and noises like a pile driver, the sounds of filing and banging. Steam came up over the crater lip.\n“Sounds like a steel foundry in there,” said Sweets.\n“I don’t like it one bit,” said Lindley. “Be danged if I’m gonna let ’em get the drop on us. Can you keep them down?”\n“How many are there?” asked Skip.\n“Luke and Sweets saw four or five before all hell broke loose this morning. Probably more of ’em than that was inside.”\n“I’ve got three more shots. If they poke up, I’ll get ’em.”\n“I’m goin’ to town, then out to Elmer’s. Sweets’ll stay with you awhile. If you run outta bullets, light up out the draw. I don’t want nobody killed. Sweets, keep an eye out for the posse. I’m telegraphing the Rangers again, then goin’ to get Elmer and his dynamite. We’re gonna fix their little red wagon for certain.”\n“Sure thing, Sheriff.”\nThe sun had just passed noon.\nLeo looked haggard. He had been up all night, then at the telegraph office sending off messages to the university. Inquiries had begun to come in from as far east as Baton Rouge. Leo had another, from Percival Lowell out in Flagstaff, Arizona Territory.\n“Everybody at the university thinks it’s wonderful,” said Leo.\n“People in Austin would,” said Lindley.\n“They’re sure these things are connected with Mars and those bright flashes of gas last month. Seems something’s happened in England, starting about a week ago. No one’s been able to get through to London for two or three days.”\n“You telling me Mars is attacking London, England, and Pachuco City, Texas?” asked the sheriff.\n“It seems so,” said Leo. He took off his glasses and rubbed his eyes.\n“’Scuse me, Leo,” said Lindley. “I got to get another telegram off to the Texas Rangers.”\n“That’s funny,” said Argyle, the telegraph operator. “The line was working just a second ago.” He began tapping his key and fiddling with his coil box.\nLeo peered out the window. “Hey!” he said. “Where’s the 3:14?” He looked at the railroad clock. It was 3:25. In sixteen years of rail service, the train had been four minutes late, and that was after a mud slide in the storm twelve years ago.\n“Uh-oh,” said the sheriff.\nThey were turning out of Elmer’s yard with a wagonload of dynamite. The wife and eleven of the kids were watching.\n“Easy, Sheriff,” said Elmer, who, with two of his boys and most of their guns, was riding in back with the explosives. “Jake sold me everything he had. I just didn’t notice till we got back here with that stuff that some of it was already sweating.”\n“Holy shit!” said Lindley. “You mean we gotta go a mile an hour out there? Let’s get out and throw the bad stuff off.”\n“Well, it’s all mixed in,” said Elmer. “I was sorta gonna set it all up on the hill and put one blasting cap in the whole load.”\n“Jesus. You woulda blowed up your house and Pachuco City too.”\n“I was in a hurry,” said Elmer, hanging his head.\n“Well, can’t be helped. We’ll take it slow.”\nLindley looked at his watch. It was six o’clock. He heard a high-up, fluttering sound. They looked at the sky. Coming down was a large, round, glowing object throwing off sparks in all directions. It was curved with points, like the thing in the crater at the Atkinson place. A long, thin trail of smoke from the back end hung in the air behind it.\nThey watched in awe as it sailed down. It went into the horizon to the north of Pachuco City.\n“One,” said one of the kids in the wagon, “two, three—”\nSilently they took up the count. At twenty-seven there was a roaring boom, just like the night before.\n“Five and a half miles,” said the sheriff. “That puts it eight miles from the other one. Leo said the ones in London came down twenty-four hours apart, regular as clockwork.”\nThey started off as fast as they could under the circumstances.\nThere were flashes of light beyond the Atkinson place in the near dusk. The lights moved off toward the north where the other thing had plowed in.\nIt was the time of evening when your eyes can fool you. Sheriff Lindley thought he saw something that shouldn’t have been there sticking above the horizon. It glinted like metal in the dim light. He thought it moved, but it might have been the motion of the wagon as they lurched down a gully. When they came up, it was gone.\nSkip was gone. His rifle was still there. It wasn’t melted but had been crushed, as had the three-foot-thick tree trunk in front of it. All the caps and cartridges were gone.\nThere was a monstrous series of footprints leading from the crater down to the tree, then off into the distance to the north where Lindley thought he had seen something. There were three footprints in each series.\nSweets’ hat had been mashed along with Skip’s gun. Clanging and banging still came from the crater.\nThe four of them made their plans. Lindley had his shotgun and pistol, which Luke had brought out with him that morning, though he was still wearing his burned suit and his untouched Stetson.\nHe tied together the fifteen sweatiest sticks of dynamite he could find.\nThey crept up, then rushed the crater.\n“Hurry up!” yelled the sheriff to the men at the courthouse. “Get that cannon up those stairs!”\n“He’s still coming this way!” yelled Luke from up above.\nThey had been watching the giant machine from the courthouse since it had come up out of the Atkinson place, before the sheriff and Elmer and his boys made it into town after their sortie.\nIt had come across to the north, gone to the site of the second crash, and stood motionless there for quite a while. When it got dark, the deputies brought out the night binoculars. Everybody in town saw the flash of dynamite from the Atkinson place.\nA few moments after that, the machine had moved back toward there. It looked like a giant water tower with three legs. It had a thing like a teacher’s desk bell on top of it, and something that looked like a Kodak roll-film camera in front of that. As the moon rose, they saw the thing had tentacles like thick wires hanging from between the three giant legs.\nThe sheriff, Elmer, and his boys made it to town just as the machine found the destruction they had caused at the first landing site. It had turned toward town and was coming at a pace of twenty miles an hour.\n“Hurry the hell up!” yelled Luke. “Oh, shit—!” He ducked. There was a flash of light overhead. The building shook. “That heat gun comes out of the box on the front!” he said. “Look out!” The building glared and shook again. Something down the street caught fire.\n“Load that son of a bitch,” said Lindley. “Bob! Some of you men make sure everybody’s in the cyclone cellars or where they won’t burn. Cut out all the damn lights!”\n“Hell, Sheriff. They know we’re here!” yelled a deputy.\nLindley hit him with his hat, then followed the cannon up to the top of the clock-tower steps.\nLuke was cramming powder into the cannon muzzle. Sweets ran back down the stairs. Other people carried cannonballs up the steps to the tower one at a time.\nLeo came up. “What did you find, Sheriff, when you went back?”\nThere was a cool breeze for a few seconds in the courthouse tower. Lindley breathed a few deep breaths, remembering. “Pretty rough. There was some of them still working after that thing had gone. They were building another one just like it.” He pointed toward the machine, which was firing up houses to the northeast side of town, swinging the ray back and forth. They could hear its hum. Homes and chicken coops burst into flames. A mooing cow was stilled.\n“We threw in the dynamite and blew most of them up. One was in a machine like a steam tractor. We shot up what was left while they was hootin’ and a-hollerin’. There was some other things in there, live things maybe, but they was too blowed up to put back together to be sure what they was, all bleached out and pale. We fed everything there a diet of buckshot till there wasn’t nothin’ left. Then we hightailed it back here on horses, left the wagon sitting.”\nThe machine came on toward the main street of town. Luke finished with the powder. There were so many men with guns on the building across the street it looked like a brick porcupine. It must have looked this way for the James gang when they were shot up in Northfield, Minnesota.\nThe courthouse was made of stone. Most of the wooden buildings in town were scorched or already afire. When the heat gun came this way, it blew bricks to dust, played flame over everything. The air above the whole town heated up.\nThey had put out the lamps behind the clock faces. There was nothing but moonlight glinting off the three-legged machine, flames of burning buildings, the faraway glows of prairie fires. It looked like Pachuco City was on the outskirts of hell.\n“Get ready, Luke,” said the sheriff. The machine stepped between two burning stores, its tentacles pulling out smoldering horse tack, chains, kegs of nails, then heaving them this way and that. Someone at the end of the street fired off a round. There was a high, thin ricochet off the machine.\nSweets ran upstairs, something in his arms. It was a curtain from one of the judge’s windows. He’d ripped it down and tied it to the end of one of the janitor’s long window brushes.\nOn it he had lettered in tempera paint COME AND TAKE IT.\nThere was a ragged, nervous cheer from the men on the building as they read it by the light of the flames.\n“Cute, Sweets,” said Lindley, “too cute.”\nThe machine turned down Main Street. A line of fire sprang up at the back side of town from the empty corrals.\n“Oh, shit!” said Luke. “I forgot the wadding!”\nLindley took off his hat to hit him with. He looked at its beautiful felt in the mixed moonlight and firelight.\nThe thing turned toward them. The sheriff thought he saw eyes way up in the belittling atop the machine, eyes like a big cat’s eyes seen through a dirty windowpane on a dark night.\n“Gol Dang, Luke, it’s my best hat, but I’ll be damned if I let them cooters burn down my town!”\nHe stuffed the Stetson, crown first, into the cannon barrel. Luke shoved it in with the ramrod, threw in two 35-pound cannonballs behind it, pushed them home, and swung the barrel out over Main Street.\nThe machine bent to tear up something.\n“Okay, boys,” yelled Lindley. “Attract its attention.”\nRifle and shotgun fire winked on the rooftop. It glowed like a hot coal from the muzzle flashes. A great slather of ricochets flew off the giant machine.\nIt turned, pointing its heat gun at the building. It was fifty feet from the courthouse steps.\n“Now,” said the sheriff.\nLuke touched off the powder with his cigarillo.\nThe whole north side of the courthouse bell tower flew off, and the roof collapsed. Two holes you could see the moon through appeared in the machine: one in the middle, one smashing through the dome atop it. Sheriff Lindley saw the lower cannonball come out and drop lazily toward the end of burning Main Street.\nAll six of the tentacles of the machine shot straight up into the air, and it took off like a man running with his arms above his head. It staggered, as fast as a freight train could go, through one side of a house and out the other, and ran partway up Park Street. One of its three legs went higher than its top. It hopped around like a crazy man on crutches before its feet got tangled in a horse-pasture fence, and it went over backward with a shudder. A great cloud of steam came out of it and hung in the air.\nNo one in the courthouse tower heard the sound of the steam. They were all deaf as posts from the explosion. The barrel of the cannon was burst all along the end. The men on the other roof were jumping up and down and clapping each other on the back. The COME AND TAKE IT sign on the courthouse had two holes in it, neater than you could have made with a biscuit cutter.\nFirst a high whine, then a dull roar, then something like normal hearing came back to the sheriff’s left ear. The right one still felt like a kid had his fist in there.\n“Dang it, Sweets!” he yelled. “How much powder did Luke use?”\n“Huh?”\nLuke was banging on his head with both his hands.\n“How much powder did he use?”\n“Two, two and a half cans,” said Sweets.\n“It only takes half a can a ball!” yelled the sheriff. He reached for his hat to hit Luke with, touched his bare head. “I feel naked. Come on, we’re not through yet. We got fires to put out and some hash to settle.”\nLuke was still standing, shaking his head. The whole town was cheering.\nIt looked like a pot lid slowly boiling open, moving just a little. Every time the end unscrewed a little more, ashes and cinders fell off into the second pit. There was a piled ridge of them. The back turned again, moved a few inches, quit. Then it wobbled, there was a sound like a stove being jerked up a chimney, and the whole back end rolled open like a mad bank vault and fell off.\nThere were one hundred eighty-four men and eleven women all standing behind the open end of the thing, their guns pointing toward the interior. At the exact center were Sweets and Luke with the other courthouse cannon. This time there was one can of powder, but the barrel was filled to the end with everything from the blacksmith-shop floor—busted window glass, nails, horseshoes, bolts, stirrup buckles, and broken files and saws.\nEyes appeared in the dark interior.\n“Remember the Alamo,” said the sheriff.\nEverybody, and the cannon, fired.\nWhen the third meteor came in that evening, south of town at thirteen minutes past six, they knew something was wrong. It wobbled in flight, lost speed, and dropped like a long, heavy leaf.\nThey didn’t have to wait for this one to cool and open. When the posse arrived, the thing was split in two and torn. Heat and steam came up from the inside.\nOne of the pale things was creeping forlornly across the ground with great difficulty. It looked like a thin gingerbread man made of glass with only a knob for a head.\n“It’s probably hurting from the gravity,” said Leo.\n“Fix it, Sweets,” said Lindley.\n“Sure thing, Sheriff.”\nThere was a gunshot.\nNo fourth meteor fell, though they had scouts out for twenty miles in all directions, and the railroad tracks and telegraph wires were fixed again.\n“I been doing some figuring,” said Leo. “If there were ten explosions on Mars last month, and these things started landing in England last Thursday week, then we should have got the last three. There won’t be any more.”\n“You been figurin’, huh?”\n“Sure have.”\n“Well, we’ll see.”\nSheriff Lindley stood on his porch. It was sundown on Sunday, three hours after another meteor should have fallen, had there been one.\nLeo rode up. “I saw Sweets and Luke heading toward the Atkinson place with more dynamite. What are they doing?”\n“They’re blowing up every last remnant of them things—lock, stock, and ass hole.”\n“But,” said Leo, “the professors from the university will be here tomorrow, to look at their ships and machines! You can’t destroy them!”\n“Shit on the University of Texas and the horse it rode in on,” said Lindley. “My jurisdiction runs from Deer Piss Creek to Buenos Frijoles, back to Olatunji, up the Little Clear Fork of the North Branch of Mud River, back to the creek, and everything in between.\n“If I say something gets blowed up, it’s on its way to kingdom come.” He put his arms on Leo’s shoulders. “Besides, what little grass grows in this county’s supposed to be green, and what’s growing around them things is red. I really don’t like that.”\n“But Sheriff! I’ve got to meet Professor Lowell in Waxahachie tomorrow . . . ”\n“Listen, Leo. I appreciate what you done. But I’m an old man. I been kept up by Martians for three nights, I lost my horse and my new hat, and they busted my favorite gargoyle off the courthouse. I’m going in and get some sleep, and I only want to be woke up for the Second Coming, by Jesus Christ himself.”\nLeo jumped on his horse and rode for the Atkinson place.\nSheriff Lindley crawled into bed and went to sleep as soon as his head hit the pillow.\nHe had a dream. He was a king in Babylon, and he lay on a couch at the top of a ziggurat, just like the Tower of Babel in the Bible.\nHe surveyed the city and the river. There were women all around him, and men with curly beards and big headdresses. Occasionally someone would feed him a large fig from a golden bowl.\nHis dreams were not interrupted by the sounds of dynamiting, first from one side of town, then another, and then another.\nThis story is in memory of Slim Pickens (1919-1983)\nOriginally published in Omni Magazine, April 1987.\nHoward Waldrop is widely considered to be one of the best short-story writers in the business, having been called \"the resident Weird Mind of our generation\" and an author \"who writes like honkytonk angel.\" His famous story \"The Ugly Chickens\" won both the Nebula and the World Fantasy Awards in 1981. His work has been gathered in the collections: Howard Who?, All About Strange Monsters Of The Recent Past: Neat Stories By Howard Waldrop, Night of the Cooters: More Neat Stories By Howard Waldrop, Going Home Again, the print version of his collection Dream Factories and Radio Pictures (formerly available only as in downloadable form online), a collection of his stories written in collaboration with various other authors, Custer's Last Jump and Other Collaborations, and a big retrospective collection, Things Will Never Be the Same: Selected Short Fiction 1980-2005. Waldrop is also the author of the novel The Texas-Israeli War: 1999, in collaboration with Jake Saunders, and of two solo novels, Them Bones and A Dozen Tough Jobs, as well as the chapbook A Better World's in Birth!. He is at work on a new novel, tentatively entitled The Moone World. His most recent book is another new collection, Horse of a Different Color. He lives in Austin, Texas."}