{"fingerprint": "xO4udI2syDNJSKSQlT43PN4dqh4=", "sitename": "Clarkesworld Magazine", "title": "Retrieval by Suzanne Walker", "author": "Suzanne Walker", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/walker_11_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Retrieval by Suzanne Walker", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3680 words, short story\n Retrieval\n I stood at the edge of the shrine for nearly half an hour before I finally willed myself to move closer. It was in the middle of a graveyard, at the bottom of a hill behind the city’s spaceport, so every few minutes the silence was punctuated by the whine of engines pushing their ships through the thick autumn clouds.\n I wasn’t sure which was built first, the port or the shrine, but the proximity seemed sacrilegious no matter who made the choice. The wind blew my hair in front of my face, whistling as it passed through the sparse trees that lined the south edge of the burial grounds, and I suppressed a shiver. Beyond the trees, the towering Protectorate capital loomed, and I wished my stomach clenched in hatred, not fear. It had been ten years since I’d returned to Kinrev, and I no longer resembled round-faced child in the image the Protectorate had on file. The problem was, I now looked like my father.\n “This is where your gods dwell? Beneath the ground?” My teacher, Ferrier, stood to my right. She was dressed as I was, plainly in a brown jumpsuit, with her gray hair pulled tight at the nape of her neck. It felt strange to see her without a gun and knife strapped to her side—we’d had to check all weapons at the spaceport, and part of me was surprised she hadn’t tried to pick a fight about it. I’d never seen her surrender them willingly.\n “Beneath the ground,” I echoed. My voice sounded strange in my ears. “Sheltering their children in death.”\n “Hmm.” Ferrier pursed her lips but said nothing. I turned away, glancing outward towards the graveyard, wondering where they’d buried my mother. She’d been killed in one of the final battles against the Protectorate, before they crushed the rebellion and executed my father lightyears away from Kinrev. I remember clutching his hand and watching as we returned her to the gods, body and soul, but the location was lost along with most memories of home.\n At least she died planetside. I faced the shrine once more, and my knees trembled when I lowered them. I was taking a risk, coming here, but I hadn’t been home to my gods since I was a child. I wanted their blessing, before I set out on this retrieval.\n No grass grew around the shrine, and I traced out the patterns in the soil, still known to my hands after all these years, the dirt soft beneath my fingertips. I kept my book of old Kinrevan prayers on me, but I knew the prayer for the dead by heart. My message would reach the gods this way, even if they couldn’t hear me.\n “I set out to return my father to you,” I murmured. “Guide me, even if you cannot see where I may go. Show me the true path.”\n They didn’t answer—they never did—but still I knelt there, tracing over the message again in the hope that it would reach them. That maybe this time, the gods would honor my family’s service.\n “Riva?” Ferrier’s hand gripped my shoulder. I looked up to see her brows knit together in concern, and she glanced up the hill at the soldiers who patrolled the graveyard’s edge. “It’s time.”\n We made it back to the spaceport and out the system without any problems, but I still couldn’t breathe freely until we made it to the next star. Ferrier had enough resources to procure fabricated IDs for us, so that I could return to Kinrev despite my status as a daughter of dissidents, but that did little to disperse the dread that lodged in my gut whenever I saw my birth planet.\n Ferrier was silent in the pilot’s seat beside me, but I was grateful for her presence all the same. I’d become a full Retriever two months before, with rights to my own ship from the Guild, but I hadn’t claimed one yet. I doubted I would until I found my father. And if my old mentor disapproved, she kept such thoughts to herself.\n “Do you think your gods were looking out for you, when they sent you to me?”\n I glanced at her in surprise. The Guild frowned on Retrievers belonging to any sort of faith. Beliefs of the afterlife varied too much between planets, and it was best not to cling to any one doctrine in our line of work. I had been lucky in Ferrier, who tacitly allowed my nightly prayers, but she’d never spoken of it outright before.\n “I . . . I never thought of them as sending me.” I said. “I looked for you, the minute I found out the Guild existed.”\n Ferrier smiled a humorless smile. “I’ve never known a child to go looking for a ghost seeker.”\n I raised my eyebrows. “You can’t have known too many children, then, before me.”\n She chuckled softly, and reached over to squeeze my hand.\n “You know it’s going to be different, this time. Nothing prepares you for when it’s family.”\n I drew in a deep, shuddering breath, releasing it in time with the clanging of the pipes in the engine room. “I know.”\n I was going to miss this ship, when I finally settled into my own. Its central chamber was almost cavernous, an endless series of pipes and hoses crisscrossing from the top of the dome down to the floor, where we temporarily housed the spirits we retrieved from the darkness of space. I spent most of the journey fixing the pipes, tinkering with blocked avenues I knew Ferrier would never bother to repair, and the work kept me from thinking too much about my father.\n Yet still the prayer for the dead echoed in my head, enough to make me wish my parents hadn’t been so determined to raise me in the faith. The gods are tied to the earth, and your soul must be tied to the gods, if you are to find any peace in the afterlife. A death in the cold emptiness between the stars condemned one to an eternity of torment.\n The Protectorate had known this, when they’d ordered the first deep space executions, and no amount of public outcry could dissuade them. It went against the very tenets of Kinrevan faith, so much so that I’d been shocked to see that the old shrines still existed. If the government dishonored the gods so much, you’d think they’d have torn down their temples.\n The old grief took hold of me every so often as I worked in the pipes, and I told myself every time that I did this for my father: not for me, not for vengeance, not for anything beyond the gods’ embrace that he deserved.\n I never knew if I was lying to myself.\n Here’s the problem with deep space: even when you’ve got an exact location pinned down, it can be days before you find anything. We didn’t have an exact location for my father. His friends had managed to obtain flight patterns from around the time he died, but that still left us with more than half a dozen sites to check.\n Two weeks, three sites, no ghosts. And each site felt more and more like failure.\n But in the nothingness between the Sarinen system and the Ilenian nova, something flared out of the corner of my eye. I sat up straight for the first time in days, and beside me, Ferrier slapped her hand down on the dashboard in satisfaction.\n “It’s a weak signal, but it’s there.” I could hear joints cracking when she stood up, and she gave me an unreadable expression. “Are you ready?”\n I wasn’t, but I followed her through the main bay and into the prep room. A series of portable holding chambers lined one side and a handful of patched, worn spacesuits lined the other. Though I’d passed through it more times than I could count, my hands began to shake at the sight of the airlock. This time, I knew who waited on the other side.\n Ferrier pulled down two of the suits from their hooks in the wall and handed me one. It was heavy, dank, and smelling of dried sweat, most of it my own. I could already feel perspiration running down my arms as I climbed into the suit, punching my fists through the arms so that I might still the shaking. The glass of the helmet was fogged in spots, but I could still see Ferrier standing near the airlock. Her voice came through a tinny speaker from the back of my head.\n “You’re taking point on this, my girl, but I’m here. I’m here, understand? Only do this if you feel you can.”\n I nodded and reached for a holding box to strap to my back. I hooked the hose to my belt and watched Ferrier do the same, and she gave me a wordless salute before she opened the airlock. There was a carved hollow where my stomach should have been, and my throat was so tight I wasn’t sure if I could breathe properly.\n The forward door opened, and the emptiness between the stars carried me forward. My breath sounded heavy within the helmet, and I took care to keep it even while I looked out around me. This was a silence I could never get used to, even now, more sinister somehow than the long, quiet nights spent with Ferrier. There was no boat beneath my feet, no engines that could ferry us to safety should disaster strike—just me and the fear carried in my breath.\n “Look for a light between the stars.”\n Ferrier’s words echoed in my ear, lessons from my first retrieval. Without a nearby star as a beacon, everything somehow seemed even darker than usual. I floated upright relative to the ship, my eyes straining from the search, but I couldn’t see anything. I moved away from Ferrier slowly, using the microjets in the spacesuit boots to push myself around and behind the ship.\n Something flickered in the bottom corner of my helmet, and I turned, slowly, the pulsers in my gloves barely firing. It was a fleeting flash of blue, now, and my breath caught in my throat when I stopped to behold a luminous figure, rippling back and forth before the spattering of stars behind. It wavered more rapidly, struggling to take shape, and it reached out towards me as if to capture the form of my bulky, padded body.\n There were days now where I struggled to remember my father’s face, when I had to rush to my bunk and pull out an old picture and trace through the dust with my fingertips before he was clear in my mind again. But the figure before me shifted once more, and there was no mistaking the particular way his beard formed, or the scar that connected his temple to the base of his jaw. His eyes were clouded, muddled, before they blinked with what I prayed was a dawning recognition.\n “Daddy?”\n He couldn’t hear me—he couldn’t—but the word seemed to spark something in him, for his face suddenly twisted into a sneer of malice that I had never seen him wear while alive. I frowned in confusion, wondering if I should speak again, before my view suddenly exploded with blue, and I was thrown backward, hurtling fast toward the ship.\n I screamed, but the sudden intake of air cost me, and a sharp pain radiated through my chest. The force of the creature—not my father, not my father—pushed hard against the suit. I hit the hull of the ship with a great thud that reverberated down my back, and my head slammed back against my helmet. Sparks swam in front of my eyes, and I could barely see that the creature’s form expanded into giant hands that twisted themselves around the base of my helmet. I tried to struggle, but my arms had taken on the weight of lead, and I couldn’t react quickly enough to the creature, whose arms had multiplied to snake around my back, pressing the suit deep into my skin. I felt a sharp twist against my spine, and my eyes widened in terror—it was trying to tear off the oxygen tank.\n There was another flash of light, and the creature released me for a moment, mouth open in a silent scream of rage. Ferrier hovered above me, her weapon aimed at the both of us, and the substance of the creature seemed to leech away from itself, spiraling toward the funnel-shaped opening of Ferrier’s blaster. I pried its spindling fingers off of the base my helmet, but not before it pushed me away with one final twist to the tank strapped to my back. A sharp hissing noise rushed through my ears, and I could see the oxygen level rapidly failing on my helmet monitor.\n “Get inside!” Ferrier shouted. “Pull yourself in and shut the airlock!”\n “But—”\n “Go!”\n I was feeling light-headed now, my breaths coming in short, sharp gasps that burned my lungs. I fumbled before I held the tether, the thick gloves of the suit doing me no favors. I made the mistake of looking behind me, though my vision had begun to swim, and saw the creature reaching towards me, mouth moving in what would have been an ear-shattering howl, if I could hear. I bit down on my inner lip hard enough to taste blood, the metallic scent blooming in the oxygen-starved space of my helmet, and I turned back to my hands on the tether. My vision was almost completely gone, and it took all my strength to focus my eyes so that I saw nothing but one hand moving in front of the other, one then two.\n I don’t know how I made it into the airlock, or how I had the strength to key in the combination to the aft door and cross through back to the holding bay. All I know is that I found myself collapsed on the floor of the hold, knees drawn tight to my chest, head pounding, the room spinning all around me. I didn’t want to move, didn’t want to feel anything ever again, and it was only the thought of Ferrier returning with my father, murderous and merciless, that caused me to stumble to my feet, trip out of the spacesuit and out towards the main cargo bay.\n The nausea came as soon as I opened the holding door, but I managed to wait until I was in the privacy of my own bunk before throwing up in the garbage bin.\n Even the reused, flat air of the ship was a gift to me, after what had happened to the spacesuit, and I almost cried from the relief of it. I lay curled in my bunk for what felt like hours, shaking uncontrollably, until I finally tired of the weakness in my limbs and the smell of stale vomit sitting in the trash. I cleaned out the bin and left for the main hold, pacing the length once or twice before I stumbled into the galley, on the verge of collapse once more. I found refuge in one of the hard chairs attached to the table and tried to take a deep, steadying breath.\n The door hissed open to reveal Ferrier. She gave me one quick glance before she headed toward the sink in the corner. I couldn’t look at her, could hardly focus enough to stay upright in my chair, so I stared down at my boots. Both of us tended to get lax about cleaning while on a job, and there were still crumbs from the previous day’s meal on the floor, caught between the indented grooves in the steel.\n Weathered hands suddenly covered my own, and a steaming cup was pressed toward me.\n “Here.”\n The cup was warm, with the scent of ginger root and something stronger curling up to soothe my battered nerves. I inhaled deeply before taking a sip, and suddenly I was thirteen again, Ferrier caring for me after my first, harrowing walk into space.\n Ferrier took a seat across from me at the table, but the cup was nearly cool between my hands before I could look up to meet her eyes. Ferrier was always quick to tell me when I’d been wrong, and I’d never failed so badly as I had here. But instead of admonition, her face reflected something of my own pain.\n “He’s in the holding chamber. If you want to see him.”\n My eyes filled with tears I’d been holding back since we docked on Kinrev. I’d seen the echoes of so many who died in space over the years, trapped in the void with no sense of peace or rest. Though the Guild disagreed, I often thought my religion made me better equipped for the job than most, because I understood that the soul needs something solid to ground it. Some can handle the isolation, the weightless eternity. Others can’t. Part of a Retriever’s job is to reorient a spirit in their ships’ pipes, to calm it in preparation for its return planetside. But for some, it’s far too late.\n This wasn’t the first ghost who had tried to kill me, and it wouldn’t be the last, yet somehow I never considered that my own father would be one of them. His death had been deliberately cruel, but I’d held on to the hope that he could endure, whole, until I came for him. Retrieving him had been my purpose for so long, and now . . .\n “Riva . . . ” Ferrier reached out and took both my hands within her own. “Have your gods ever been confronted with a retrieved soul?”\n I choked out a sob, and Ferrier enveloped me in an embrace. She doled out physical affection so rarely, but I gave in to grief now, crying until my head ached and my eyes were washed raw.\n “No. And I don’t know if they’ll take him like this.”\n We kept my father’s ghost in one of the heavy metal boxes that lined the cargo hold. Every so often it would shake violently and move incrementally toward the doorway, and I double-checked the lock every few hours despite knowing it was airtight. I kept vigil one night, my throat tight as I sat beside him, running my hand gently across the smooth metal plates that kept him confined. We tried to free him into the pipes, another night, but his claw-like hands came rushing for Ferrier’s throat the minute he was released. After that, he remained in the holding chamber.\n My eyes still stung from all the tears I’d shed on the journey home, but they filled once more when the gray clouds of Kinrev came into view. Our false trader’s ID worked a second time, although now we would have to wait for the cover of night to take the box that held my father to the shrine.\n My message from before had been raked clean, and the shrine stood cold before me. We had brought nothing with us save the holding box, no tools that might undo the action of release. My hand trembled as it ran across the release handle, and I murmured the prayer of the dead aloud once more. It wasn’t worth ascribing it to soil—if the gods didn’t sense my father’s presence, they would soon enough.\n I opened the container, and an unholy shriek rent the air. A twisting streak of blue shot up and punctured the sole light overhead, and there was nothing but darkness and a howling storm. My hair came free of its braid and blew in front of my face, nearly blinding me. The force of the wind pulled me toward the shrine, but the spirit seemed to have no target, this time, just a blinding, purposeless rage.\n “Stop!” I could barely hear myself over the rushing sound in my ears. “We’ve brought you home!”\n I don’t know why I said it, but the words must have reached him, because the howling noise slowly faded down to a dim roar. The wind diminished, and the creature shrank until it was only a head or so taller than my father would have stood in life. It resembled nothing human, but it stayed relatively still, and I stepped forward, hand outstretched as his had been out in the void.\n My hand slipped through a thick, almost gelatinous substance that was colder than the air in winter. It swirled and crashed around my hand, winding itself slowly up my arm as if unsure how to react. Then the cold began to seep away, and I fought back sudden tears.\n Ferrier stood staring at us, mouth agape, and it was clear she’d never seen anything like it in her life.\n The hollow of the shrine glowed beneath me, and slowly, the creature that had been my father sank into the ground. I fell to my knees, not caring if anyone heard my wordless cry, and my voice echoed out through the silence. For a moment, I could hear nothing but the wind whistling through the trees. Suddenly, I was thrown back, a blast knocking me straight to the ground, and I wheezed, struggling to recover the wind that had been knocked out of me. Ferrier had collapsed, clutching her heart with her hand, and I followed her gaze to where I had been kneeling a moment before. The shrine had exploded, and out of the wreckage rushed not just my father but half a dozen other creatures, so bright and blinding I knew they couldn’t be mere ghosts.\n I shaded my eyes with a shaking hand, and knew before seeing that they were headed straight for the capital. The Protectorate’s bastion had been built to keep out the living, not the dead.\n Ferrier clutched at my shoulders with her hands. “Is that . . . are those . . . ”\n “They know now,” I murmured through my tears. “He’ll find peace. One way or another.”\n Suzanne Walker is a Chicago-based writer and editor. She is co-creator of the webcomic/graphic novel Mooncakes along with artist Wendy Xu (Lion Forge, 2019). She is a former contributor to Women Write About Comics and has spoken on numerous panels, with topics ranging from disability representation in sci-fi/fantasy to the importance of fair compensation for marginalized SFF creators. Her non-fiction work has been published in Classical World and Barriers and Belonging: Personal Narratives of Disability."}