{"fingerprint": "tJPAIRa/kldHscYsB3yU67/NuJo=", "sitename": "Clarkesworld Magazine", "title": "Fatima's Wound by Kali Wallace", "author": "Kali Wallace", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wallace_12_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fatima's Wound by Kali Wallace", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3550 words, short story\n Fatima's Wound\n Second Counselor Azo is the last to leave. As Fatima seals her into a silver coffin, Azo asks, “Will you follow?”\n The decades fade from her face, the lines soften, and she is young again, as frightened and uncertain as when she came to the prison as a novice.\n Fatima smoothes a curl of hair from her brow. “Soon.”\n Azo nods and closes her eyes. Fatima slides the coffin lid into place. There is a hiss, a gurgle. She cannot see Azo’s face. She sends the pod into space. It joins the others, last in a glittering long line tying the prison to the object.\n Fatima retreats to the meditation room. Somebody has left incense burning; the smell is green and spicy, unfamiliar. There are rugs and pillows scattered about the floor, cups of tea cooling on trays, the detritus of people who no longer exist. They’re all gone now: counselors and novices, guards and prisoners, indistinguishable in their silver coffins. Their hearts beat and their minds race still, locked away in their pods, but they are gone, and falling, and will be forgotten.\n Fatima drags a pillow to the center of the room. Cross-legged, hands on knees, she lifts her face to the windows. The light thrums a steady dark blue. Object, anomaly, portal. All those and more. Explosion. Gateway. It has had as many names as there have been eyes to look upon it. Mouth, ravenous. The color burns at the back of her eyes.\n To Fatima the object has always been a wound. Her wound, with possessiveness that is part pride, part shame.\n When she was young she saw a man die impaled on a broken metal rod. He had been trying to climb a turbine shaft to the surface--to freedom. He didn’t make it far. He fell twenty meters, thirty, struck a scrap heap with a wet thunk. A length of iron protruded from his chest. His eyes wide with surprise, his mouth a slack O. The scavengers fell upon him before his last breath gurgled from his throat.\n Fatima was too little and too slow to win that fight. A black-haired boy pushed her so hard she smashed her nose and bit through her tongue. The boy laughed as she crawled away.\n When he and his friends were gone, Fatima crept over to the corpse to pry the yellow teeth from his jaw. She could not stop staring at the wound in his chest, that ragged eruption where a metal bar had entered and a life escaped. She remembers the stink of him, blood and waste, oil and dust. She remembers the brown of his eyes, the sickly mine-pale skin that had never seen the sun. His mouth, red and damp. The ceaseless groan of windmills overhead. She remembers the wet cracking sound of each rotten tooth breaking free.\n Most of all she remembers that hole in his chest.\n Fatima had thought those memories long lost, but here they are again, filling the quiet around her like a noxious gas.\n Her wound is darker now, but still beautiful. They have been feeding condemned prisoners into the wound for so long that few remembered Fatima had been here from the beginning. Give me your guilty, she had said, and across the galaxy worlds obeyed. Give me your monsters, and they did. Its intricate silver structure is as sharp and lovely as a crown of blades, ringed by a halo of dust.\n It would be perfect if it weren’t for the thing emerging from its center.\n Nothing has ever come out of the wound before.\n In the first panicked moments after its appearance, they had named the thing a dozen times: ship, station, weapon. Invader. Abomination. It is impossibly large, a city of razor spires with no lights. Every name they chose slid from its oily black sheen and fell away to silence.\n Azo’s question echoes in Fatima’s mind like an old, old memory, as distant as the scrabble of children’s bare feet on stone. Will you follow? The gurgle of a man’s breath, failing, the distant grind of metal on metal.\n Before, before, Fatima was speaking to a murderer.\n A general from some war-torn empire. If he had a name, she had never bothered to learn it. They had ceased to have names centuries ago. There is nothing in the galaxy more ordinary than a violent man.\n “Does it frighten you?” Fatima asked.\n The general had not looked at the wound once since he stepped into the room. The view unnerved the prisoners, made them flinch and squirm in their skin. Some tried to move the chair, but it was bolted to the floor. Others refused to sit. A few could not look away and stared until their eyes burned.\n “Most think it’s going to be larger,” Fatima said. She spoke softly to hide her boredom. She had no interest in this man’s crimes. He was like all the others, and soon he would cease to exist. “Or terrible. Most think it’s going to be terrible, but it’s beautiful, isn’t it?”\n The novice counselors whispered amongst themselves that the wound looked different to everyone. It had been a long time since Fatima had cared if that was true.\n The general did not look. “Quite.”\n “Is it what you expected?”\n “I had no expectations. I haven’t thought of it at all.”\n He was not a good liar.\n “Look at it,” Fatima said. “Go on. What harm can it do? It is there whether you see it or not.”\n “Does it mean so much to you, Counselor?”\n “I can look at it all day.” But she did not need to. She knew every surge of color, the mournful blues and triumphant yellows, the furious reds and seductive purples. She knew every turn of the fearsome silver ring, and how the dust that had once been a moon drifted. “It’s lovely. I’m not the one turning my head.”\n The general’s lips twitched. “Very well.”\n He straightened his shoulders. Unclenched the muscles of his jaw and his neck. Uncrossed his legs. Placed both feet flat on the floor. Wavering blue and green lit his face in silhouette, cast his skin in watery shades.\n “You can’t see the planet,” he said.\n “It’s behind the wound at this time of day.”\n “The wound? Is that what you call it? What a curious name.” He raised one hand to point, dropped it self-consciously. “Are those . . . ?”\n “Yes,” said Fatima. “You can see three of them right now. The third is very close to the horizon.”\n He squinted, searching for the third in the tangle of quivering light. “Who are they?”\n “I don’t know.” She didn’t care. They were already dead.\n “How many of us have you sent off like that?”\n “Since the prison was established--”\n “Not your order,” the general said. “You, First Counselor. How many of those little pods have you sent into that nightmare?”\n Even his questions bored her. How would he react if she told the truth? Thousands, tens of thousands, entire helpless armies and grasping cities before anybody knew what I was doing--is that the answer you want? Do you want to know how little you matter, how insignificant and meaningless you are, a speck of a flesh in a swarm that has been a blight on the galaxy since before either of us was born? Her disgust was reflexive, more habit than fervor. He was such a feeble pointless creature.\n Fatima folded her hands in her lap. “That’s not what you want to know.”\n “No. I suppose not. Have you heard the stories?” He wasn’t looking at the wound anymore. He had endured only a few seconds. She had expected more from him. If not courage, at least a spark of curiosity. “Surely you’ve heard the stories. They say we don’t die when we reach the horizon. They say we pass on through, and on the other side there is a world populated by the worst humanity has to offer.” The general laughed. “That’s what they say.”\n “I know,” Fatima said.\n “Is that what you believe?”\n “No.”\n “No?”\n “No.”\n She could no longer recall how it had felt when every condemned prisoner was different, every litany of crimes a fresh cut from skin to bone, every execution a triumph. She had done only two things of note in her long, long life: one an act of destruction, the other of creation. Evidence of both danced before her in lively light, but she could not remember when she had felt anything besides numbness for either one.\n Tendrils of blue shimmered into green. The general contemplated his brief future. Around the perimeter two silver spokes became three, blended into one, every transformation so smooth it might have been a dream. The rising green reminded her of the first time she had seen the sky. She had not known until she escaped that it was winter on the surface; she had not even known what winter was. There were no seasons in the undercities, no sunlight or rain. The climb through the old turbine column had exhausted her. She had expected with every tremble of her arms to fall as that nameless man had fallen before. When she reached the surface, aching and weak, she had collapsed on frost-burned grass and watched eerie green curtains dance across the sky.\n “They say,” said the general, when the silence had drawn too long, “they say the people who built it were--Counselor?”\n Fatima blinked.\n There was something wrong with the wound.\n “Counselor?”\n The green light quivered still, but there was a--\n A rip.\n “What is that?” The general, frightened.\n There was a tear opening across the wound.\n A black gap in the light.\n It was small from this distance, but the perspective was misleading. It had to be massive.\n Massive, and growing. The green light flitted into blue again, whirled around the tear, that dark hole where no hole should be, rippling and racing.\n “Counselor?” The general’s tunic rustled as he turned. She could smell his sour breath. “It’s not supposed to do that?”\n She could not answer. Her throat had closed, her tongue grown numb.\n “Is something--”\n Don’t ask, she thought desperately.\n Don’t ask.\n Don’t ask.\n Don’t.\n “Is something coming out of it?”\n Fatima was on her feet. She didn’t remember standing. The general was beside her.\n He was right. It wasn’t a tear in the light. It was a shape emerging.\n A whisper: “What is it?”\n Outside the room somebody was screaming. Footsteps pounded in the corridor. There was ice in Fatima’s chest. She had forgotten what fear felt like, and how easily it could be mistaken for hope.\n Alone in the meditation room, Fatima watches the planet crawl into view.\n In the foreground the wound is restless, uneasy. It pulses with the blood in her veins. She has always been able to feel it. She used to wonder if she would die when the light finally failed. She breathes. The planet is a marble of continents and clouds and oceans. It is beautiful.\n Fatima had taken Azo to the planet’s surface before her elevation to Second Counselor. They had walked together through the empty streets of a long-abandoned city. The builders had favored arches: every building a bridge over nothing, every neighborhood a weave of soaring curves. Every few steps carried them from shadow to sunlight to shadow again.\n “It was the same people, wasn’t it?” Azo had said. The air was sticky and humid, green in taste and smell. Azo’s black hair escaped from her shawl in spirals. “They were the same people who built the object.”\n Azo had never given the wound a personality. She had never ascribed to it motives and desires. She only ever called it the object. Prisoners found her manner cold and unsatisfying. She did not pity them, nor did she comfort them. Fatima had always liked that about her.\n Fatima asked, “Do you find it beautiful, this city?”\n “Yes,” said Azo.\n “Its builders thought it beautiful as well.”\n “They’ve been gone a long time,” Azo said, as much a question as an observation.\n Fatima had intended to explain it all: the moon honeycombed with animal warren cities beneath fields of grinding windmills, passages so small their inhabitants crawled more than they walked, thousands of mines filled with thousands of miners digging for wealth they would never enjoy, riches they could never taste, generations who lived and died without ever seeing the surface, and all the while here, here in this city and the others like it, they knew and did not care, did not flinch, not until she forced them to. She had meant to share it all with Azo, as she had with every previous Second Counselor, but Fatima could feel every joint in her body, every creak in every bone. The wild was slowly reclaiming the city, but the creeping forests did not like the taste of metal.\n It was late afternoon. Soon the sun would set, and the object would rise.\n “They destroyed themselves,” she said.\n She did not say: they deserved it.\n She felt a distant tumble of her old pride: You may have built a glittering world on our backs--a taunt to the city’s ghosts--but I struck the wound that brought you down.\n Their footsteps were the only sound in that dead city.\n In the station, in the meditation room, Fatima feels a pinch deep in her gut. At first she does not recognize the sensation. It has been so long since she last felt hunger.\n The novices who tended the kitchens are gone with all the others. One by one in their silver pods, falling. To put together a meal she will have to scavenge through the station. She will pretend to be a child again, sneak into a forbidden domain, dart from corner to corner on soft feet, search through the stores and supplies until she has a fistful of food to cram into her mouth, chew and chew and swallow before anybody sees.\n “Are they still awake?” asked the general.\n “It’s possible.”\n “You don’t know?”\n Fatima shrugged. She did not care that her answer perturbed him. “We can’t speak to them. They can’t speak to us.”\n After the screaming, after the wide-eyed disbelief, after the storm of questions that had no answers, there was nothing to do but watch.\n A group had gathered in the mess. They sat in pairs or threes, drinking tea and worrying in low voices. Guards with prisoners with counselors with novices, boundaries broken.\n They were waiting. The first of the three falling pods was nearly at the wound’s horizon. It was no more than a speck now. It should not have been visible at all, but it shone against the black surface of the emerging structure’s four long fingers--blades, spires, towers. Nobody could agree on a name. It grew ever larger. Intrusion. Protrusion. Thing.\n The pod carried a woman called Sister Kindness. Fatima only knew her name because others had shared it as they watched. The woman came from a system where two fragile moons had been battling over their parent planet for generations. Sister Kindness’s contribution to the war had been to devise a contagion that sterilized the enemy population. She had used herself as a vector, traveling through ravaged cities, trailing grief and despair in her wake.\n She had gone to her end calmly, with a smile. Her coffin had been falling toward the object for ten days. It would swallow her down before Fatima’s tea grew cool.\n The general said, “I suppose it’s better that way. I thought this place--this station--would be bigger. Uglier, certainly, like one of those grim black orbital prisons in the Sound. Have you ever been there? No? Stupid question, I suppose. Nobody goes to the Sound if they can help it. Where are you from, Counselor?”\n He had grown talkative since the thing appeared, his nervous chatter fueled by fear.\n “Nowhere important,” said Fatima. She turned her clay cup in a circle on the table.\n “I don’t know your accent.”\n “You wouldn’t. There are few of us left.”\n “What happened to the others?”\n This is what it has come to, Fatima thought. Sharing a table with a murderer, a grasping creature who would have committed genocide on four worlds if only he had been as clever as he was ambitious. Drinking weak tea and pretending her fingers didn’t itch with the urge to point at the wound and say, there, there, the moon that was but is no more, that is where I come from. Do you like what it’s become? Tell me it’s beautiful. Tell me how it frightens you, you miserable hateful little man. Tell me how you love it.\n A voice rose in alarm: “Look! There!”\n Sister Kindness had reached the end of her journey.\n The spectators lurched from their chairs, jostling for a better view. Fatima and the general stood at the back of the crowd. The room smelled of too many bodies in too small a space, sweat and fear and sour breath. Second Counselor Azo watched from the doorway. Her expression was blank, her eyes narrow.\n The silver pod vanished into the light, but it returned a second later, brighter, a bold spark of white. If Sister Kindness was still alive, she would be feeling the heat as the shielding burned away. She would not be smiling anymore. The gel filling her lungs would not allow her to scream until it boiled away, and then she would have only moments before her blood boiled as well.\n The wound swallowed Sister Kindness in her silver pod. White light flared, and faded, left a sting of afterimage on Fatima’s eyes.\n Someone dared a huff of disappointment. Another risked half a word. The room was darker now, a creeping twilight.\n The thing in the wound changed.\n The sharp black fingers, each as long as a range of mountains, quivered like grass in a gentle breeze. They shimmered with iridescent light, a blur of expectant motion, and when they steadied again there were five instead of four.\n A murmur shivered through the room.\n It did not look like a hand. Fatima curled her fingers at her side and felt the ache in her knuckles. It did not look like a hand.\n “I’m ready,” said the general.\n Fatima looked at him. “What?”\n “To go. There. I’m ready.”\n He spoke quietly, but others overheard.\n “Now?” Fatima asked. “Why?”\n He smiled, and she could see in his face the young man he had once been, the one who had gathered armies with rousing speeches and razed colonies with the wave of his hand. He said, “You were right about me, First Counselor. I’m a coward. I don’t want to be here when the rest of that thing arrives.”\n “And I,” said another prisoner.\n The guard beside her nodded. “Yes.”\n Yes. Yes. The word was a flame caught in a dry wind, a spark at the end of a fuse. Yes. It’s time. Falling is bad, but waiting is worse. They were ready.\n Fatima tears bread into chunks and brushes crumbs away. She has stripped her robe off and lies now in only her tunic, tucked in a nest of cushions and blankets. Her veined legs do not bend as easily as they did when she was a child. There is spilled tea on the floor. She doesn’t care. There is no one left to see.\n The black-haired boy who broke her nose had been called Ram.\n She remembers him now. They had fought over food in the tunnels, biting and scratching and screeching like animals, but later he was the one who told her about the way to the surface, the abandoned turbine and the broken ladder. He was going to go, he said, as soon as he had supplies. Fatima had not waited that long. Even then she had a bloody black wound hidden where her heart should be, and with every day it grew larger, and colder, and heavier, spreading through her veins until she was nothing but a vessel of darkness.\n He was there still when she returned years later. Ram had never escaped. The brown eyes that had once danced with violent mischief were flat and angry now. But he listened, he and all of the others, they listened when Fatima told them about the white city beneath the sun, the decadent bridges that never fell, the feasts where party-goers raised mocking toasts to their moon.\n Another pod reaches the object. Another bead snapped from the long silver necklace. Flares, fades, and the thing grows again. It is almost organic in appearance, a spiky black plant pushing from the wound, from whatever black heart might be hidden in its fist of knives.\n Give me your worst, she had said.\n Give me your monsters, when all of her own were gone.\n The thing grows with exquisite patience. But she can be patient too. She does not blame the others for fleeing. How terrible it is to feed a hunger for so long it ceases to feel like desire, like anything at all, and how marvelous to remember.\n The incense has burned itself out, but its fresh green scent lingers, a scratch at the back of her throat."}