{"fingerprint": "Ixn4F/5fOst21W8mH+vIhIHN0SM=", "sitename": "Clarkesworld Magazine", "title": "Poetry, Philosophy, and Welsh: A Conversation with Jo Walton by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/walton_interview_2018/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Poetry, Philosophy, and Welsh: A Conversation with Jo Walton by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Poetry, Philosophy, and Welsh: A Conversation with Jo Walton\n Words are a kind of music. Writers who listen know this better than most. The crescendo of action gets punctuated by silence making both all the more palpable. The proper combination of words swirl through a reader’s mind forming characters and stories as varied as the depths of the imagination. A poet knows the musical value of words.\n In the introduction of her new collection, Jo Walton writes how she feels like more of a poet than a short fiction author. In her collection, it’s evident that the poet informs the short fiction author and vice versa. From familiar trappings of fairytale fantasy to the most rock solid of hard science fiction, the fiction collected in Starlings showcases the depth and breadth of her storytelling and poetry.\n Jo Walton is a fiction author and poet. She has won the John W. Campbell, World Fantasy, Mythopoeic, Nebula, and Hugo Awards. Her newest collection Starlings was published by Tachyon January 23rd.\n In your introduction for Starlings, you talk about not so much being a short story writer, but more of a poet. Can you elaborate on this?\n Poetry is often my natural response to things. And it feels odd and uncomfortable to say that, it feels pretentious and fake, because culturally we often class poetry as “high culture” in a way that makes saying that feel like making a claim about all kinds of things that have nothing to do with actual poetry. I have always written poetry, I’ve always read poetry. Sometimes poetry is easier for me than actually talking. When John M. Ford died—he was a friend, and he was a writer I admired, and his death was very sudden and shocking—I wrote a sestina in which the end words were the last words of titles of his books. And that sounds like a very abstract distanced thing, but I did it in the early hours of the morning with tears running down my face and that was my grief response, my raw response. (It’s in my NESFA collection Sibyls and Spaceships and it’s on my website if you want to read it.) I have a poem bio in the Starlings collection that says a poem is much easier than writing a short bio listing your accomplishments, and for me that’s true.\n Whereas short fiction, though I read it, has never come naturally. I almost never have an idea and think it’s a short story idea. I’ll have an idea and think it’s a novel idea. I’ll want to say something and it’ll come out as poetry. But short stories are almost always a deliberate effort, an exercise in form. So, this collection collects all the short things I’ve written over almost twenty years, and it’s barely enough for a book, we had to put a play and some poetry in too.\n And on the topic of poetry, who would be one poet you feel influenced you most throughout your short fiction?\n I can’t answer that with one. I think the answer is T. S. Eliot, and Tolkien, and Auden, and the Romantics especially Keats. T. S. Eliot and Tolkien were contemporaries, though we don’t think of them that way.\n Voice and tone play an important role in this collection. What comes first when writing, the voice or the plot?\n Voice every time. Voice—or what I call “mode,” which is voice plus a bunch of related things, is what I need before I can write anything. I can have all the plot in the world and without the right voice it’s just a handful of vacuum.\n Do you ever know beforehand if an idea will be a poem or a piece of short fiction? Do you simply write and see what form it takes?\n Because I start with voice, I always know if something’s poetry or prose. I sometimes simply write when I have no idea of world or plot or anything, to see if a character with a voice will lead me to those things. I have a friend, Yves Meynard, who is bilingual and is a published writer in both English and French. And he says that when he has a story idea, the idea itself will be in one language or the other, from the first conception of the story he knows which language he’ll write it in. Similarly, I’ll know the mode right away. The long poem in Starlings “Not in this Town” is a version of Euripides’ The Bacchae and I had the idea for it after I’d seen a production of it. The idea included the meter. I was walking from the theater to the metro and I thought “I’ll write a version of it set in the US in rhyming couplets in a sort of ballad meter” and because it would be long and it would be a lot of work, and because there’s no demand for something like that, I didn’t actually write it for a couple of years. (I wrote it after I had set up my Patreon, because that felt like there was a demand and it was worth it.) But before I’d written a word of it I knew what mode it would be. The acorn was there, predicting the oak. I’ve had that with novels too.\n What struck me about your most recent collection was the sheer variety of voices. Do you ever find inspiration for characters in your life or do you pull completely from your imagination?\n Life sometimes, definitely. The character with Alzheimer’s who talks to real aliens in “Unreliable Witness” started from my Aunt Jane. But as you write a character they become more themselves and less whatever you started from.\n In The Just City you tackle a lot of philosophy and in particular the work of Plato. What was it that first interested you about Plato?\n I read Mary Renault’s The Last of the Wine and The Mask of Apollo and I wanted more Plato, so I read Plato. What continued to interest me in Plato was the whiplash effect where I’ll be reading him and I can go from “this is silly and wrong” to “YES” in one paragraph. I find that very productive.\n How is writing for a role-playing game different than writing something like a short story or novel?\n So, when you write stuff for RPGs it’s like all the things you need for a story without writing the story, because the GM will be bringing the plot and the players will be bringing the characters, and you’re giving them the rest of it, the universe (the background) and the way the universe works (the rules) and minor characters and so on.\n RPG writing combines a lot of the skills of tech writing with a lot of the skills of fiction writing, and it’s paid a fraction of what you get for writing either of the others, so it’s pretty amazing anyone does it at all.\n Actually, running a game is a whole lot like writing a novel, except that you can’t go back and change anything and the characters are more self-propelled. But if I’m running a game, I don’t normally write down anything, except the names of places and minor characters so I’ll remember them for next time. I just do it all out of my head.\n History permeates a lot of your work. What is it about looking to the past that inspires you?\n It attracts me in exactly the same way SF does, it’s interesting different human societies, full of people having interesting adventures, and changing the world. History is fascinating. And it never runs out. Even if I lived for centuries, there would still be cultures and periods I know only the sketchiest thing about, because there’s just so much. It’s great. I read a lot of biographies and nonfiction history, sometimes as research, and sometimes when it’s just for fun it ends up being research in the end anyway.\n Since you’ve extensively reviewed a number of novels retrospectively, how do you think time tends to effect perception of a novel?\n When a novel is read in a time and place very different from the one it was written for, the reader’s experience is very different from the experience the writer was expecting. When I read Tale of Genji, a lot of things Murasaki took for granted are very strange to me, for instance the way marriage works and the way ghosts work. There’s a gap that isn’t the gap she was expecting because she wasn’t thinking about a reader from seven hundred years in the future reading in translation. If that gap gets big enough, something can be incomprehensible, it’s not just that you can’t experience it as the original reader would, you can’t get into it at all, you can’t understand why anything is happening. I’m not the reader Tolstoy imagined either, but I didn’t need footnotes for War and Peace, whereas I really did for Tale of Genji. I loved Tale of Genji, but I’m sure I only experienced a fraction of what Murasaki expected the reader to perceive. Novels are written in their time for readers of their time, but we’re going to read them in our own time and bring our own worlds and selves to them. We can’t stop being who we are. If I read an American SF book from the fifties and women just exist as prizes, I sigh, I can’t unsee that about it, but I don’t judge it the same way as if I read an American SF book written now where that’s the case. But that’s still very close in time and culture to us. When I look at the women in Tale of Genji I’m having a much more difficult time.\n Reading through the poetry on your website, I noticed a common theme of death. What are your thoughts on writing as a therapeutic way of dealing with loss?\n Death. Yes. There’s a lot of it about. And we, as a society, don’t have good ways of dealing with it. Modern medicine is very good, and most of us no longer lose siblings and parents when we’re young. It happens, it happened to me, but it’s unusual, whereas in earlier centuries it would have been normal. And because we don’t get familiar with real death early, many people who are not religious are just flummoxed when they have to face it—their own death, and the death of people they care about. They have no way of responding. Culturally we’re in denial about death, we have turned Halloween into a sexy joke instead of a ritual of dealing with death, many people manage to live for decades without death coming close to them, and then when it does, they just don’t know how to cope. People sometimes turn to religious ways of coping out of desperation, just because religion gives some kind of response you can have. But unless you actually believe in souls and afterlives and etc., that’s also very unsatisfactory when you’re grieving.\n In my poetry that deals with death, especially in my Death Sucks sonnets I try to make a secular humanist space for it, an acknowledgement of how much it sucks and a way of coping. In one I say,\n I’ve got no comfort. Life goes on, it’s tough,And new people get born—is that enough?\n In another,\n Go hug your friends, and sing, or paint, or write,Now while we may, against impatient night.\n These are responses people can honestly have to death, much more honest than briefly pretending to believe in God. They seem to work, too. People have used these sonnets in funerals, quoted them in obituaries, and I quite often get email from people who find them valuable.\n As for therapeutic writing—transmuting something to art isn’t easy. It can be comforting, because it’s making something, and making something, anything, a poem, a cake, a tea tin, is an act against entropy and is inherently cheering. And there’s this thought of maybe it can help somebody else. There’s a thing in one of my Petrarch sonnets,\n Oh hear, my friends, the dead, the lost, and you,The living who may read these words and knowOne day about some other thing, that JoWas here and felt the same and it was true.\n I have often had that moment of recognition of something somebody else has said in art, and I love the thought that I can encapsulate things usefully. But in my experience, often writing that is done as therapy is too raw. You need some distance for that act of transmutation to work.\n What other projects do you have in the works?\n I’ve recently finished a fantasy novel about Savonarola called Lent which should be coming out from Tor at the end of this year or the beginning of 2019. I’ve been describing it as “Savonarola Groundhog Day.” It’s about Savonarola in Florence between the years 1492 and 1498. It’s the most historical novel I’ve ever written, almost all the characters are historically real people.\n What is the one piece of writing advice that has always stuck with you?\n In Rumer Godden’s autobiography, she said when she had small children she went to bed when they did and got up in the very early morning before them, to write before they were up, so that the writing got the best part of her, rather than trying to write tired in the evening after they were asleep. This was very useful to me when my son was small. I wrote my first three novels largely before 8 AM.\n What is your favorite saying in Welsh?\n I feel like I ought to quote something really profound but I can’t think of anything. My most frequent saying in Welsh is “Ach y fi” which means “yuck” only much stronger. My favorite hilarious thing is that the colloquial Welsh for “how are you doing?” sounds exactly the same as the dumpling served in dim sum “shumai” so whenever I am at dim sum and the carts are going round and the people are calling out “Shumai!” I always want to respond that I’m fine and how are they? Every time!\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}