{"fingerprint": "nZS86AM8L5S8aHTH76hh/chjOI4=", "sitename": "Clarkesworld Magazine", "title": "Breaking the Gender Barrier: A Conversation with Regina Kanyu Wang and Yu Chen by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wang-chen_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Breaking the Gender Barrier: A Conversation with Regina Kanyu Wang and Yu Chen by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Breaking the Gender Barrier: A Conversation with Regina Kanyu Wang and Yu Chen\n Regina Kanyu Wang was born and grew up in Shanghai, spending the first thirty years of her life there. She occasionally left for brief periods—the longest being one or two months—mainly for education or work. She did a writing residency in Las Vegas, summer school in Helsinki, and spent time in Nordic and Baltic fandom. She traveled extensively for conventions and events, primarily in the US and Europe. At the end of 2020, she moved to Oslo to work on her PhD with the CoFUTURES project. “The Nordic region is my spiritual hometown!”\n Kanyu Wang’s first book was on food culture and cuisine in Shanghai and Suzhou, published under a pen name. Despite feeling underqualified, and having published at a young age, the book received praise from editors and readers. She also published a few children’s science fiction stories in newspapers before publishing “Of Cloud and Mist” in Mengya.\n She had been reading genre fiction since primary school but couldn’t find many friends who shared the same interests until university. Kanyu Wang joined the university science fiction club immediately. They usually went to neighboring university events, ultimately deciding to found an association of university SFF clubs and hold an annual Shanghai Science Fiction & Fantasy Festival.\n In 2012 she earned her degree in management sciences and in 2014 her MFA in creative writing, both from Fudan University. In 2014 she also won a Best Fan Xingyun Award. In 2015 her story “Back to Myan” won the monthly SF Comet prize, held by Chinese SF fans. She also won several Xingyun Awards: Gold for Best Movie Script for Of Cloud and Mist, coauthored with Anna Wu; Silver for Best New Writer and another Silver for Best Fan. In 2016, the year she became Overseas Market Director for Storycom, “the first professional story commercialization agency in China,” she won two more Xingyun Silver Awards and was short listed for a third.\n Regina Kanyu Wang writes science fiction, nonfiction, and academic essays in both Chinese and English. “My voice in English is completely different from Chinese! I tend to be bound to humans and heavy narrations when writing in Chinese but seem to experiment with nonhuman perspectives and more vivid and humorous tones when writing in English.” She has published two story collections in Chinese: Of Cloud and Mist 2.2 and The Seafood Restaurant; as well as a short novel in Italian, and a forthcoming collection in German, plus short stories and critical essays across various platforms, including Mithila Review, Galaxy’s Edge, and Clarkesworld. In 2021 she coedited a special issue of BSFA magazine Vector with Yen Ooi, and she coedited The Making of The Wandering Earth: A Film Production Handbook with Jiaren Wang, due from Storycom in March 2022.\n Besides all of this, Regina Kanyu Wang is, or has served as, co-secretary-in-general and standing council member of the World Chinese Science Fiction Association, board member of the Plurality University Network, and cofounder of SF AppleCore and Asia Science Fiction Association.\n Yu Chen was born in Hai’an county (海安县) of Jiangsu province (江苏省), located on the southeast coast of China. Her hometown is traditionally known as the “Land of Fish and Rice” and is famous for top scorers on China’s college entrance exam. At nine years old, she traveled to Beijing for the first time with her parents and wanted to go to a university there. Ultimately, she went to the Chinese department of Nanjing University in 2000, which ended up being a suitable major. Before graduation, she published anthology Continue to Grow, a collection of prose by young writers.\n Yu Chen always liked reading, especially fantasy novels, “partly because my life is too ‘normal,’ and reading gives me countless different wonderful lives.” She wrote for a time, even publishing essays in newspapers and magazines and two books. Engaging as a professional in publishing, for her, created a need to separate the personal from the professional: “Suddenly I hoped that my spare time life could keep a distance from my work. Instead of writing, I watch movies, travel, make videos . . . Over the past twelve years, it takes a lot of time to be a mother. Raising a child is a happy but troublesome thing, and my son is my biggest work.”\n By 2004, Yu Chen had accumulated the necessary number of points to become an official Shanghai resident. She worked, made friends, got married, had a son, and also went back to university. After graduation, she worked as an editor in Shanghai Literature and Art Publishing House, a job that lasted eighteen years. The initial twelve years were primarily with bimonthly literary magazine Fiction World. She also edited books, some of which were revised and expanded from pieces in the magazine, such as Han Song’s Hospital trilogy. Beginning in 2017, she focused exclusively on editing books, from mainstream to genre to social science books. She also edited books on science fiction theory, such as Mingwei Song’s New Wave of Chinese Science Fiction—which will be translated into German and Russian.\n A few years ago, while working as a professional in publishing, Yu Chen graduated from Tongji University with an MFA, studying in the department of cultural industry. Her graduation project focused on science fiction publishing with fusion media. “Before the epidemic, I often took short trips after work with my family, mainly in China and Southeast Asia. But after 2020, I hardly leave Shanghai, where daily life is probably least affected by the epidemic.” Over the course of her career, she has planned and established SFF column “Tales from Nowhere,” organized and participated in numerous SFF forums, conventions, workshops, and conferences, and published more than ten SFF books, including Han Song’s Exorcism, which won the Best Original Book Award of the 29th Galaxy Awards of Chinese Science Fiction. Yu Chen now works for Children’s Epoch, the first children’s journal of New China, founded by Ms. Soong Ching-ling in 1950.\n The Way Spring Arrives and Other Stories is coedited by Yu Chen and Regina Kanyu Wang. “Written, edited, and translated by a female and nonbinary team, these stories have never before been published in English and represent both the richly complicated past and the vivid future of Chinese science fiction and fantasy.” The book is due from Tordotcom publishing March 8, 2022.\n How did you become readers of genre fiction? What were some of the first genre books or stories that were important to you, and why?\n Regina Kanyu Wang: I started to absorb genre fiction/games/cartoons/manga when I was a kid. At that time, I didn’t have any idea of what genre was at all, but all the works I enjoyed most were with fantastic elements, like Sailor Moon, The Legend of Sword and Fairy, Zwei!, Sakura Wars, and Trinity Blood. I encountered Science Fiction World-Young Adults Version at a newspaper stand and was attracted by the cover as well as the science fiction stories inside. I subscribed to the magazine for years, until it became Fantasy World, and I began to read fantasy. I love Chinese fantastic worldbuilding like Novoland (九州) and Yunhuang (云荒). I didn’t really begin to read much science fiction until I entered university, when I fell in love with stories like Hyperion.\n Yu Chen: I grew up in a small town in the southeast coast of China in the 1980s. It was not easy to get books except for textbooks at that time. One of my tenth birthday gifts was Arabian Nights, which may be the first genre fiction I remember. Then it came to 1999, I encountered Science Fiction Worldvia my classmates. I have subscribed to the magazine for more than twenty years. In 2006, the famous Three-Body Problem was serialized in this magazine, and I was lucky to be one of the early readers. That’s fantastica! Personally, I prefer novels with broad backgrounds of possible worlds, which tell stories about really important essences. I love so many genre books, such as Robert J. Sawyer’s Golden Fleece, Ursula K. Le Guin’s Earthsea fantasy series, George R. R. Martin’s A Song of Ice and Fire, Robert Jordan’s The Wheel of Time, and our Chinese fantastic worldbuilding like Novoland (九州).\n In the US and the UK, some readers and writers see “literary” and “genre” as very different categories. Are there similar ideas with Chinese fiction, are these important distinctions?\n RKW: Oh, definitely. I did my master’s in creative writing and was trained by established literary authors like Wang Anyi. My goal for graduation was to write a science fiction story that could be appreciated by the literary literature community. My first complete story was “Of Cloud and Mist” (《云雾》). It is a fifty thousand-character novella written in Chinese, serialized in Mengya (《萌芽》, a large literary magazine in China) that won the Chinese Nebula Award (星云奖, Xingyun Award for Chinese Science Fiction), and that was translated and published in Italian. In the beginning, I thought the boundary was not that clear. Later on, I continued to write but found that literary magazines and science fiction magazines have very different tastes and requirements. I was stuck in the middle for a long time because the editorial suggestions from both sides can be completely different. Science fiction editors want fast-paced stories, hooking plots, and interesting science fiction ideas, while literary editors want stories with “literariness,” good language, and well-rounded characters. I mostly publish in literary magazines these days. In recent years, the situation has changed, more science fiction stories are published in literary magazines and more literary authors began to write science fiction, since it has turned into a popular genre in China.\n YC: Professor Mingwei Song wrote a treatise saying that Chinese science fiction writers were “seen” by dominant literary circles around 2010. Before that, “literary” and “genre” were considered different categories. Shanghai Literature and Art Publishing House, which I used to work for, is a first-tier literature publishing house in China, where literariness comes first. I once invited Han Song to write a short story for the newly set science fiction column of our literary magazine in 2013. In the next few years, a very short piece was expanded into the Hospital trilogy and won important literary awards in China. In this example, “literary” and “genre” can all win. Of course, there are other views. For example, Professor Yan Feng recently proposed that science fiction has surpassed literature and covers all aspects of our life.\n How did The Way Spring Arrives and Other Stories come about, how did it develop, and what were the biggest challenges to making this anthology happen?\n RKW: Back in 2019, Emily Xueni Jin and I went to New York for an event. We had a lunch with Lindsey Hall and Ruoxi Chen and then visited the Tor office. During that lunch, we thought it would be great if Tor and Storycom could collaborate on some projects. Storycom had been in partnership with Clarkesworld for years and published dozens of Chinese science fiction stories translated into English. We were all excited about the idea of an all-female-and-nonbinary anthology of Chinese speculative fiction in translation.\n I brought the idea back to China and Yiwen Zhang, CEO of Storycom, highly supported this idea. Storycom specialized in film adaptation, and we looked for help from an experienced external editor, Yu Chen. Yu Chen has published Han Song’s trilogies and Mingwei Song’s essay collection, working with many literary and genre authors. I reached out to authors in batches, Yu Chen made the first round of selections, Lindsey and Ruoxi provided feedback, and we continued to provide more recommendations. The whole process was quite smooth. The biggest challenge is the same one when we work internationally: to make wire transfers abroad, which is a nightmare, lol.\n YC: In September 2019, Regina Kanyu Wang invited me to participate in this international project. Partly because I have edited a dozen books about science fiction over the past decade, and I am familiar with the works of domestic science fiction writers. An all-female-and-nonbinary anthology of Chinese speculative fiction in translation! That’s great! It was my honor to make the first round of selections. I read about one hundred wonderful works, then selected more than thirty of them to develop the outline of the content, plus short comments from the editor’s view. On this basis, we had the final anthology, including seventeen works by fifteen authors. At the beginning, we had different preferences on fantasy, and after communication, we reached an agreement, showing rich and colorful Chinese fantasy stories from throughout the world.\n During this epidemic, the people all over the world are isolated, but our project goes on smoothly through this network. This is also very sci-fi! The Chinese version of the book was published by Shanghai Literature and Art Publishing House recently, and I’m also the editor. As Shelley said, “If winter comes, can spring be far behind?” The Way Spring Arrives will bring us confidence and hope.\n Were there specific things you were looking for in your selection process? When you were making selections, what were the most important things for you, what were your priorities?\n RKW: The one most important criterion during the selection process was to find good stories. We also tried to select stories that are deeply rooted in the Chinese or larger Asian context for this anthology. Due to length limitations, we had to focus on shorter pieces and give up some novelettes and novellas that we loved. And of course, we only looked for stories by women and nonbinary authors. Some may say that there has never been all-male science fiction anthology, but if you look at the tables of contents of many anthologies that have been published, there are many with all-male or mostly male authors. So, we were quite strict on this gender priority.\n YC: I agree that the one most important criterion was to find good stories. For translated works, you may lose the verve of Chinese language, or misread the cultural background, these things are inevitable, but a good story can be popular all over the world. The other most important criterion was the Asian background. We gave up some wonderful stories that were clearly influenced by Hollywood films, and instead we chose more stories that retell myths and legends in order to show our long history and diverse cultures.\n How did collaboration work for you, both in terms of who did what, and in terms of whether or not it all went smoothly?\n RKW: As I mentioned before, we had quite a smooth collaboration process, not only between Yu Chen and me, but also with Lindsey, Ruoxi, and Emily. Although the two of us are listed as editors of the book, this project could not come to life without many other people’s efforts. That is why we decided to include a full list of acknowledgements with everyone who has helped behind the scenes. The one thing that is key to this project is communication. We maintained communication during the whole process and gave everyone full transparency, so the collaboration was quite joyful.\n YC: As an editor of a publishing house, collaboration runs through all my work. Publishing a book has countless links, communication is everywhere. Step by step, if we make a little progress every day, in the end our efforts will bear fruit. That’s magic! I’d like to thank all those who have helped or will help with this project, including those on the full list of acknowledgements, as well as the unknown workers in the production links. I’d also like to thank all readers who are willing to buy and read this book. I hope to hear your comments.\n The oldest story in the anthology was originally published in 2002: “Baby, I Love You” by Zhao Haihong. But half of the selections are new or from within the past five years. What do you see as some of the most important recent transitions or changes in Chinese genre fiction? And do the stories here speak to those changes in specific ways?\n RKW: The most important transition is definitely the popularity of Chinese science fiction. Back in 2002, science fiction was regarded as children’s literature; but with the success of Liu Cixin’s Three-Body trilogy, The Wandering Earth film, and many more, science fiction has turned into a cultural phenomenon in China. There are more science fiction authors, especially women authors, within the past five years. Meanwhile, as a fantasy reader, I also have to say that Chinese fantasy has overpassed its golden era. Although writers continue to write online novels and large IPs are adapted into TV dramas, Chinese fantasy magazines have all ceased publication. That is why I reached out to some fantasy authors that I had loved since my teenage years for stories and translated them into English.\n YC: According to my observation as an editor, over recent years, the literariness of Chinese genre fiction is constantly improving. More college students encounter science fiction on campus and begin to write. More literary writers join the camp of writing fantastic literature. More scholars publish serious critiques about genre fiction. This anthology also reflects this change. Chi Hui’s “The Woman Carrying a Corpse” is completely special among her works, as it’s more like a literary fable. Shen Dacheng and Xiu Xinyu are not science fiction writers in the usual sense.\n One aspect of bringing translated fiction to Western audiences, is that many of the readers engaging with this book have no idea which authors are important or respected within the context of their own cultures. Who, for you, are the “big name” authors in this anthology, and who are the “up and coming” authors that really excite you?\n RKW: If we consider Weibo (China’s equivalent to Twitter) follower numbers, fantasy authors like BaiFanRuShuang, Chu Xidao, and Shen Yingying are definitely big names. Within the science fiction genre, Ling Chen and Zhao Haihong are representatives of authors who began to publish in the 1990s, Chi Hui, Xia Jia, and Chen Qian followed in the 2000s. Gu Shi and Anna Wu started to publish in the 2010s and soon won their fame, while Xiu Xinyu, Nian Yu, and Wang Nuonuo were all born in the 1990s and are the newer generation of rising stars.\n Many of them write crossing genres, but Count E may be the most typical case, with a large readership for not only science fiction and fantasy but also slash writing. Shen Dacheng, on the other hand, mostly publishes in literary magazines and has won many literary awards.\n YC: Compared with the status of male writers in the domestic science fiction world, there are not any so-called “big name” authors in this anthology. That’s why we need an all-female-and-nonbinary anthology. Female writers have received more attention in recent years, but they deserve more and more. Within the science fiction genre, Ling Chen and Zhao Haihong are senior, and the latter was called the princess of the Chinese science fiction world by some people. However, as Kanyu points out, we try our best to choose representative writers from different genres. The most important thing is that we give priority to the work. For example, we all liked Wang Nuonuo’s two stories, so we decided to pick them both.\n Social and political nuance in fiction is sometimes missed or misunderstood when reading translated work. Are there a few pieces here that are fairly daring in their subjects or subtext, in one way or another, in ways that Anglophone readers might miss?\n RKW: Firstly, I want to say that our translators have done wonderful jobs on translating the nuances of the stories. There are a few stories that have more subtext. For example, “Blackbird” is a story about death. In Asian society, women are always afraid of getting old. You see advertisements of young beauties without any wrinkles. Actresses who are above their thirties can hardly find any characters that are suitable for their real ages. The protagonist’s resistance of death and elegant gestures in a nursing house implies this age anxiety in Asian society. In “The Portrait,” readers familiar with traditional Chinese ghost tales may find similar story frames, but the author smartly overturns the traditional narration. We made this anthology so that Anglophone readers who are not familiar with these kinds of subjects and subtexts can enjoy the stories themselves, and so that those who know about these ideas can get more as well.\n YC: Maybe we can engage with these translated works with a more open mind. After all, people who like fantasy stories are the boldest. In their wild dreams, customary rules are the first things to be overturned. Even by domestic standards, many works in this anthology are innovations, such as “The Name of the Dragon” and “Dragonslaying.” The dragons in the two stories are not consistent with the traditional Chinese dragon image, and there are even greater gaps with Western dragons.\n If someone will read only two or three stories to see if the book is for them, which stories would you tell them to read, and why?\n RKW: Wow, this is such a hard question! I cannot select any two or three stories because they are so different but equally good!\n I can only point out that if you enjoy science fiction, you can start with “What Does the Fox Say?,” “The Restaurant at the End of the Universe: Tai-Chi Mashed Taro,” “Baby, I Love You,” “A Brief History of Beinakan Disasters as Told in a Sinitic Language,” and “The Mountain and the Secret of Their Names.”\n If you enjoy mythology, folktales, and ghost stories, you can start with “The Tale of Wude’s Heavenly Tribulation,” “The Way Spring Arrives,” “To Procure Jade,” “New Year Painting, Ink and Color on Rice Paper, Zhaoqiao Village,” and “The Portrait.”\n If you enjoy fantasy, you can start with “A Saccharophilic Earthworm,” “The Alchemist of Lantian,” “The Name of the Dragon,” and “Dragonslaying.”\n If you enjoy literary fiction with speculative elements, you can start with “The Stars We Raised,” “Blackbird,” and “The Woman Carrying a Corpse.”\n If you want to learn about the larger context of these stories, you can start with “The Futures of Genders in Chinese Science Fiction” and “Net Novels and the ‘She Era’: How Internet Novels Opened the Door for Female Readers and Writers in China.”\n If you want to learn about the translation of these stories, you can start with “Translation as Retelling: An Approach to Translating Gu Shi’s ‘To Procure Jade’ and Ling Chen’s ‘The Name of the Dragon,’” “Is There Such a Thing as Feminine Quietness? A Cognitive Linguistics Perspective,” and “Writing and Translation: A Hundred Technical Tricks.”\n YC: Kanyu’s answer is an excellent guide for this book. Everyone has their own Hamlet. I can’t guess which story you will love, but you may find some interesting elements in these works and follow your heart.\n Are there stories here that you think will surprise Anglophone readers?\n RKW: Another hard question! I want to answer it from a different perspective. The anthology itself does not follow the traditional way of ordering the table of contents. We mixed stories and essays as well as the genre of stories. Some readers may find it surprising. But if you read carefully, you can see that all the pieces are ordered in a way that the stories and essays together form a larger narrative. Thanks to our wonderful collaborators Lindsey and Ruoxi for making this decision!\n YC: We need to read books outside our comfort zone from time to time, “surprise” often means new experiences and broader boundaries. There might be some “surprise” in plots, or words, or backgrounds, especially in some typical Asian stories. For instance, the story of “Dragonslaying” happens in the Chinese fantastic worldbuilding Yunhuang (云荒), while “The Tale of Wude’s Heavenly Tribulation” is related to traditional Taoist culture. However, these are extremely excellent fantasy works of Chinese contemporary female writers; we think the anthology will be enjoyable to anglophone readers on the whole.\n Do some of the stories in The Way Spring Arrives stand in conversation with Western, Chinese, or other genre narratives in important ways?\n RKW: Definitely. Take the title story “The Way Spring Arrives” as an example. It is a blur with mythology and science fiction, fantasy and romance. You can see it as being in conversation with Western science fiction narratives as well as Chinese mythology narratives. The author is not restricted but takes advantage of different genre traditions and makes up her own style. “What Does the Fox Say?” is another example. It is originally written in English, thus targeting the Anglophone readers, and follows Western genre narratives, but the theme of the story, AI writing, also mimics the way authors whose native languages are Chinese try to learn the way of writing science fiction in English, following the Western way.\n YC: Many authors in this anthology read Western science fiction from childhood, and they are familiar with Western genre narratives. For example, Anna Wu tells a series of Chinese historical stories related to a restaurant at the end of the universe, paying tribute to classic works of Douglas Adams. “A Brief History of Beinakan Disasters as Told in a Sinitic Language” is another example. The title itself describes the striving of cross-ethnic and cross-cultural conversations on a cosmic scale.\n Is there anything else you’d really like readers to know about The Way Spring Arrives, the authors and their stories, the essays, or yourselves and your work?\n RKW: I want to emphasize the importance of translators for this book. From the very beginning, we decided to cherish the translations as well as the creation of the original stories and essays. We tried to match each story with a suitable translator, whether the translator had more experience or was an emerging one. We made matches based on translators’ former works, some trial paragraphs, as well as their own interests. Their names appear together with the authors and their craft is fully acknowledged. We are excited about this vibrant team: some of them have translated a number of speculative fiction pieces before, like Cara Healey, Carmen Yiling Yan, Elizabeth Hanlon, Rebecca F. Kuang, and Emily Xueni Jin; some of them have abundant experience in translating other genres, like Judy Yi Zhou, Mel “etvolare” Lee, and Gigi Chang; some of them are writers themselves and are interested in speculative fiction translation, like Ru-Ping Chen, Yilin Wang, and Judith Huang. We are happy about the chemistry between the original stories and the translations. Some translators also contributed essays about their craft.\n Apart from that, we also have essays from Xueting Christine Ni, who is a writer and editor as well as translator, whose Sinopticon 2021: A Celebration of Chinese Science Fiction just came out, and also Jing Tsu, who is a literary scholar and cultural historian of modern China at Yale University, whose Kingdom of Characters: The Language Revolution That Made China Modern just came out.\n We hope the book can offer a gateway to a larger context with multiple layers and plural extensions.\n YC: In addition, I would like to recognize the inspiration of our designer.\n The cover of the English version has showy eye-catching flowers. The cover art was created by artist Feifei Ruan. She is good at combining the beauty of Chinese traditional art with the fashion of Western modern design, and she emphasizes visual narration, which is effective in posters for science fiction drama Doctor Who. Christine Foltzer has also done a wonderful job of the cover design.\n The cover of the Chinese version is a minimalist style. At first, designer Zhu Yunyan tried to combine Chinese brush painting with Western photography. Later, she decided to choose abstract images instead of concrete ones. Finally, we have the gilded red dots, which is the binary code of the book title, and binary code is considered to be the language that aliens can understand.\n Both versions have been highly praised.\n What else are you working on, what do you have coming up that readers should know about?\n RKW: I am now working as a PhD fellow of the CoFUTURES project at the University of Oslo, where we work on contemporary global futurisms, science fiction, and futures thinking. My project focuses on contemporary Chinese science fiction, especially from gender and environmental perspectives. Part of my research project is a series of video interviews with women in Chinese science fiction, in which we discuss science fiction, future, gender, environment, and more. The interview series is also supported by the Applied Imagination Fellowship of the Center of Science and Imagination at the Arizona State University. It will be released both in Chinese and English.\n Apart from that, I also continue to work on my own science fiction stories and hope to bring them to more readers in every corner of the world.\n YC: The Chinese version of The Way Spring Arrives and Other Stories is the last book I edited for Shanghai Literature and Art Publishing House. Now I work for Children’s Epoch, the first children’s journal of New China founded by Ms. Soong Ching-ling in 1950. Science fiction has been booming in China for several decades, and it’s still a blue ocean. As female science fiction is getting more and more attention, children’s science fiction is another fast-growing genre, I want to do something in this field over the next few years. Let’s look forward to a wonderful future of Chinese science fiction.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}