{"fingerprint": "GjyHEqAEM1GZ7uW3piQ8vNg+e2o=", "sitename": "Clarkesworld Magazine", "title": "The Orbiting Guan Erye by Wang Zhenzhen, translated by Carmen Yiling Yan", "author": "Wang Zhenzhen; Carmen Yiling Yan", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wang_03_21/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Orbiting Guan Erye by Wang Zhenzhen, translated by Carmen Yiling Yan", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4560 words, short story\nThe Orbiting Guan Erye\n“Old Liu, what do you say we keep a bird here in the space station?” I turned my head and asked, setting down my tablet.\nOld Liu’s full name was Liu Zixuan. He was three years older than me, the ranking officer in this humble little space station, commanding exactly one subordinate, one of the top mechanical grapple operators in orbit, Lil’ Zhang—that’s me. Hearing the name Zixuan, you’ll likely picture some fresh-faced pretty-boy with rosy lips and perfect teeth, but no such luck, he was an old-school Beijing Bloke. You couldn’t call him beefy, quite, but he didn’t leave you room for daydreams.\nFortunately, though, Old Liu had a lively mind—you rarely got bored talking to him. He chatted about Beijing with me all the time: the fermented mung bean milk of Tiantankou, the chitterling stew of Ping’anli, the birds of the Summer Palace, the fish of Goldfish Pool. He liked to say that outer space gave him too much of a stuffy feeling, so he needed to air out his memories of his homeland on the regular to do a good job at work. Under his subtle influence, I developed a bit of a hankering for the Beijing life too.\n“Keeping a bird? What’s a layabout without any practical know-how like you doing, thinking about that?” he asked.\n“See for yourself,” I drawled, and tossed the tablet to him. The tablet screen displayed a short story titled “Feathered Friend,” by Arthur C. Clarke. The story was straightforward—a crew member on a space station was secretly keeping a canary, in a minor breach of regulations. But no one could have guessed that an accident would send the space station’s oxygen levels plummeting, while the alarm system happened to break down at the same time. In this dangerous situation, the canary reacted first and passed out, alerting the crew and ultimately saving all their lives.\nI fully trusted the air circulation system in the space station, and I’d never properly tried to care for a pet before. But I wouldn’t mind adding an adorable little backup to the space station, especially when it wouldn’t cost us much of anything.\nOld Liu soon finished reading the story. He was quiet for a moment, chin in hand, then said, “Wouldn’t work.”\n“How would you know, if you’ve never done it before?”\n“Simple. In space, birds can’t eliminate waste. They’re not like humans—they don’t have separate urethrae and anuses, just a cloaca where urine and feces come out together. You wouldn’t want questionable white fluids floating everywhere in the space station, would you?”\n“Urk . . . ” My stomach turned when I considered it.\n“More importantly, birds can’t voluntarily control their waste elimination. It’s fine on Earth where gravity helps out—makes the waste drop like a bomb from a plane, fwish! But in a zero-gravity environment, the bird can’t eliminate waste. The little thing’s going to clog to death on its own crap and piss.”\nI had to admit, he made a vivid analogy. I immediately thought of the aerial bombers newly added to our country’s military. They really did need a rail launcher to properly toss out the missiles.\n“Fine, I admit you’ve got a point . . . ” I shrugged. “You really did put all your skill points into this kind of random trivia!”\n“Hah. What Beijing Bloke wouldn’t know how to care for flower, fish, and fowl?” he returned.\nAt that point, a dispatch from the Tiangong main station interrupted our conversation. He waved the tablet, indicating that I should take it.\n“Hello? Are you there, Lil’ Zhang? You guys might be getting work to do.”\n“Space Station B5-H35 here, message received. Main Station, what’s the situation?” I answered.\n“Lidar detected some weird little thingies. No danger of collision with you guys, but they’re not supposed to be there. You guys should take a look.”\n“Thingies? Where?”\n“They’re probably military satellites launched during the Cold War. Couldn’t find anything on them in the database. I’ll send you the monitoring data. If you look out from the observation dome, toward Tianque, you’ll see it within plus or minus ten degrees.”\nI grabbed the telescope and directed my gaze toward Tianque—the wreckage of a large-scale space station. Two years ago, a meteor had struck Tianque while it was still in the process of construction, snapping the main axle into three pieces; not only was repair impossible, the collision had produced a large amount of space junk. As a result, not many people ventured into this region of space even now. It had even proved troublesome for our space station, preventing us from expanding our operations. Part of the daily routine for me and Old Liu in this beat-up little space station was monitoring the movement of this wreck.\nBut today, something really had changed within the environs of Tianque. In my field of vision, about three degrees southwest of the wreck, a formation of little bright dots had appeared. They were extremely close to us, their relative velocity near zero. Even against the glittering backdrop of the Milky Way, they were clearly visible, like silver chains floating in the void. And obviously, if they were moving along an orbit, they couldn’t be a meteor shower.\n“I’ve got visual confirmation. Data received. I’ll try to grab one,” I answered.\n“Roger that. Thanks for your work.” The Tiangong main station cut off the transmission.\nIt might sound hard, operating a cable-controlled grapple with three axes of movement to grab a small satellite, but I’m an old hand. I aimed the microwave radar toward the flashing dots. Soon, the screen indicated that the chains of lights were in fact twelve little CubeSat satellites arrayed in a three by four formation along the same orbital path, advancing in equally spaced ranks as if fastened together by a giant invisible net. At the same time, the computer gave me the time at which they’d be closest to us, approximately one hour later. I sat myself in the operating cabin, made my adjustments, then struck up a conversation with Old Liu.\n“I’ve never seen satellites in such a tight formation. Old Liu, you’ve got lots of experience. Have you seen anything like this?” I asked.\n“I haven’t. It kind of looks like when you send multiple satellites up on the same rocket, before the payload has had a chance to disperse through orbital maneuvers.” He craned his neck to take a look, then shook his head. “But any launch that’s gotten to this stage should be complete. This looks more like . . . someone created this formation on purpose.”\n“But . . . who’d be bored enough to do something like that?” I told him, “We have a tiny window of opportunity this time, only enough for me to fetch one back. How about you take a guess what’ll be in it?”\n“Didn’t you say you wanted to keep a bird up here in space? Maybe you’ll pick up a canary,” Old Liu ribbed me, shrugging his shoulders.\n“Hah.” With that, I returned my attention to the observation platform.\nThere’s not much to say about the process of grappling on to a target. You just steer the grappling hook into the target’s orbital path, fire off the RCS thrusters a couple dozen times to cut down on your velocity relative to the target, wait for it to “bump” into the hook, clamp down, and reel the cable back in. Other than the three axes of movement and the zero-gravity environment, it’s not fundamentally different from operating an arcade claw machine. Because whichever satellite I grabbed would be followed by more satellites on the same orbital path, I decided to get the front-most satellite. To avoid a collision, I had to reel the cable in quickly, but it didn’t add too much hassle to the task. Soon, we had the strange CubeSat inside the hold of the space station.\n“Is this some kind of joke?” I said. The object in front of me could barely be called a satellite. The cube was a little smaller all around than even a standard 10 x 10 x 10 cm CubeSat, without any visible sensor components on its surface. It was assembled from six sheets of galvanized iron bolted together—some of the screws hadn’t been tightened properly, the nuts gone missing without a trace. Its crudeness put the shoddiest of Soviet manufacturing to shame.\nBut Old Liu was in high spirits. “Either way, let’s take a look at the payload first.” He unscrewed the top with practiced movements and lifted it away. Unexpectedly, the moment the box was opened, a cloud of icy vapor boiled out of the container, forming a layer of frost over my goggles and skin. Startled, I backed away on instinct, only to lose my balance and start spinning in the middle of the space station. When Old Liu finally grabbed and steadied me, and I’d recovered from my shock, I at last discovered the real face of the payload—some foam, clearly used for shock absorption, and a crystal-clear ecosystem sphere steaming with cold. The water inside it had completely frozen. Through it, I could see a fish frozen inside the ice.\n“Old Liu . . . what is this sphere?” My voice shook a little. I turned toward Old Liu, only to find him goggling as well. It took a while before he cleared his throat and came up to put his arm around the sphere.\n“Er, scientifically speaking, this ought to be a frozen ecosystem sphere. It looks like there’s a carp and some vegetation embedded in the ice.” He hefted the glass sphere and added, “It feels about five kilos.”\n“Sure, but I want to ask . . . why would this thing end up in orbit?”\nIn this instant, possibilities swam through my mind. What kind of person would take a five-kilogram ecosystem sphere thousands of miles up into outer space, then toss it outside to drift in orbit? What would their purpose be?\nDong!\nOld Liu gave a hard rap on my spacesuit, bringing me to reality. “Don’t woolgather, take a close look at this.”\nI responded belatedly, picking up the ecosystem sphere and inspecting it closely. Only then did I discover that the ice in the sphere looked a lot clearer than normal ice. There was hardly any distortion; I could even clearly see the patterns on the carp.\n“It looks like the kind of crystal structure produced by flash freezing . . . ” Old Liu chipped off a bit of ice and examined it under the microscope. After a while, he suddenly remarked, “Lil’ Zhang, we can’t keep a bird, but do you want to keep a fish?”\n“Keep a fish?” I looked at the sphere of ice in Old Liu’s hand, which showed no signs of thawing, and asked, dubiously, “This fish? It’s been frozen into a lump. How are we supposed to keep it?”\n“Haha, ye of little knowledge. If my guess is correct, before this ecosystem sphere was tossed into space, it was first flash frozen with liquid nitrogen. With an animal as hardy as a carp, supercooling temperatures will only freeze it on the outside, forming a hard shell, but it won’t damage the circulatory system. The ice shell would even help it survive the g-forces of a rocket launch. In other words, if we toss it into water to defrost, it’ll soon be alive and kicking, guaranteed.”\n“But . . . even if it works, we’ll be in trouble if the main station finds out,” I said, shrugging.\nHe chortled. “So what if they find out? We’re investigating the origins of this mysterious ecosystem sphere, so we have no choice but to keep evidence. If nothing else works, I can always write up an observational report on fish gill function in a zero-gravity environment and hand it to them. They can’t object to scientific research.” Old Liu tossed the glass sphere to me as I spoke.\nI caught the sphere and looked at it for a while, at the carp, as pure and glittering as something made of crystal. It felt like I was anticipating the arrival of a new friend. That persuaded me. I set the mystery of this ecosystem sphere’s appearance aside, as my mind already began to consider what name to give this space fish.\nThe folks in Tiangong main station were all out of ideas regarding the appearance of the ecosystem sphere in near-Earth orbit, so they didn’t stop us from keeping the fish. Meanwhile, our new pal soon proved Old Liu right. In a day’s time, with the melting of the ice, he’d revived from his frozen condition. He hadn’t fully adjusted to the zero gravity, and he looked a little frail, but his life was definitely in no danger. Raising fish in space was already a fairly mature experimental technology; that night, Old Liu designed a custom system, adding a loop to both the water and air circulation systems and running them through a small glove box, allowing for automatic water replacement and manual oxygenation. All we had to do was toss in feed, and the fish would thrive.\nThree hours later, the little guy had fully adjusted to the zero-gravity environment of outer space, nimbly tumbling and turning in six degrees of freedom. He’d sometimes even blow out a string of big bubbles, surrounding himself with them, then pop them one by one with slaps of his tail, having a blast all on his own. Based on that behavior, I wanted to name him Bubbles, but Old Liu refused, insisting on calling him “Second Master.” It was a reference to the Peach Garden Brothers from Romance of the Three Kingdoms—he was Old Liu, as in Liu Bei, the fish was Second Master Guan, as in Guan Yu, and I was Lil’ Zhang, as in Zhang Fei—three brothers in outer space who had only one another to depend on. The fish’s status in the space station had really shot up with our getting acquainted, clearly overtaking that of a mostly idle grapple operator like me. Caving to Old Liu’s tyranny, I had no choice but to respectfully address him as “Second Master.”\nAt first, Second Master gave us a lot of scares. The first time we saw him turn over belly-up and stop moving, we thought he was sick. But when we got closer, Second Master started happily swimming around again. It made sense, after some thought. There was no up, down, left, or right in outer space. In the water, Second Master chose a direction to face purely at random. Every day, when we assumed our positions, Second Master was in a new orientation. The odds of him taking a “normal” orientation were actually pretty small.\nYou lose track of time in a space station. Amid the daily routine of dry tasks, Second Master became our closest pal. Fish couldn’t speak; sometimes, this made him an even better listener for pouring your heart out to. He had no choice but to be there for you in his primitive way, to receive you, to accept what you entrusted to him.\nDuring this time, Second Master’s origin continued to puzzle us. Old Liu made a thorough search of Earth’s microsatellite databases and research programs, but failed to turn up any records of five-kilogram frozen ecosystem spheres being launched into outer space. Even after analyzing the ecosystem sphere’s structure and construction, we couldn’t make heads nor tails out of its launcher’s motives. Without further leads, we even started to wonder if some supernatural hand lay behind the riddle of Second Master’s origin.\nBut our lack of clues didn’t last for too long. Soon, news came from the Tiangong main station. Our orbit was once again going to take us by that parade of CubeSats, and this time, the window of opportunity would be long enough for me to grab two of them.\nI took a seat at the console. To relieve my anxiety, I asked Old Liu, same as last time, what he thought we’d haul back this time around.\n“At most, we’ll end up with another Second Master,” Old Liu guessed unimaginatively.\nSince the last time we’d seen these satellites, their formation had grown slightly more scattered and messier, although they were still very close together. Visual observation showed that some of these crude galvanized iron boxes had lost their lids; their small, scattered components could be a serious threat to our space station. For safety, I chose to take the same strategy as my first retrieval attempt, starting with the front-most satellite to minimize disturbance to the formation.\nThe first retrieval proceeded without a hitch, but something went wrong while I was reeling the second satellite back in. The hold suddenly shook violently.\nI cursed. “What happened?” I yelled behind me.\n“A micrometeoroid hit the water tank. Don’t worry, auto-repair activated,” Old Liu answered heavily.\nI took a deep breath and continued to operate the grapple, carefully towing the satellite into the airtight hold. Despite the shock, the retrieval process went through without any harm done.\nThe two sheet metal boxes looked identical to the one from before. They were just as crudely constructed, with several screws missing without a trace—the earlier hit to the space station had probably come from one of those screws. Thankfully, there hadn’t been a huge difference in relative velocity, and our space station had taken precautions in a region with relatively high levels of space junk, or the consequences would have been unimaginable.\nOld Liu picked up one of the boxes, flipped it over, and discovered that the bottom face had a round hole in it. He deftly removed the sole remaining screw in the lid, lifted it, and, seeing the “payload” that drifted out, once more descended into a state of shock.\nThis metal box held a huge, extraordinary . . . flashlight.\nThe flashlight thoroughly exceeded the dimensions of your average household flashlight. It was at least three times the diameter, and more than twice the length. Fortunately, it hadn’t been turned on, or the effect in the hold would be nothing short of a small flash grenade exploding.\n“Hey, Old Liu?” I asked.\n“Hm?”\n“What’s the cheapest rates on a commercial rocket launch?”\n“For a heavy launch, seven or eight thousand yuan per kilo. For a small launch, forty or fifty thousand per kilo?”\n“Then . . . what kind of crazy rich person would spend that much money to send this random crap into space?”\n“Don’t stress about it, the world of rich people is beyond your comprehension.”\n“Thanks, that made me feel zero percent better.”\n“You’re welcome.” Old Liu turned and picked up the other metal box. “What do you think is in this one?” he asked. “Last time, we picked up a fish Second Master Guan. Maybe this time, we’ve picked up a real Second Master Guan!” he said, giving it a rap.\nWe’d thought that after two astonishing unboxings, nothing could surprise us anymore. But reality had a knack for finding ways to rock our puny minds.\nWhen we lifted aside the galvanized metal lid, the first thing to emerge was a gold-colored cap, followed by a face. It was a familiar face, a face the color of jujubes, with brows like silkworms, narrow phoenix eyes, and a long, flowing beard. Following it came the body, holding an ingot of gold, drifting slowly out. Only then could we ascertain that this time, the payload wasn’t “Second Master,” but a real, actual icon of Second Master Guan, drifting in orbit two thousand six hundred kilometers from Earth until we managed to pick it up.\n“Old Liu . . . this wouldn’t happen to be something you chucked out there just to mess with me, would it?” I said slowly, staring at the statuette as it rotated lazily in midair.\n“Why would you think that, at a time like this . . . ” He’d frozen for a moment before turning to look at me. He’d clearly received a considerable shock too.\nOnce again, I descended into thought. Who would go to that much effort to deliver an ecosystem ball, a flashlight, and a statue of Second Master Guan into orbit? Was this some kind of art project? Or some kind of ritual?\n“Don’t sweat it too much, drink some water to cool down.” Old Liu patted me, kicked off the wall, drifted over to the drinking water dispenser, and poured me a cup. Maybe I’d sunk too deep into overthinking; even the water seemed to taste strange today, faintly acidic and displeasing.\nAs I sipped water and pondered, Old Liu suddenly gave a shout, interrupting my train of thought.\n“Stop woolgathering, something’s wrong with Second Master!” He urgently pulled me over to the water tank. To be honest, Second Master didn’t seem any different than usual, idle in the water, gently waving his gills. But normally, once we got near, he’d start swimming merrily around. Today, he didn’t react at all.\n“Is he sick?” Old Liu asked. When it came to Second Master, even he couldn’t completely keep his cool.\n“Don’t worry, fish are hardy animals. Was he like this earlier?” I felt a pang too, and had to toss the matter of the weird taste in my mouth out of mind.\n“No, he was darting around just fine ten minutes ago. I didn’t think he’d suddenly stop moving.” Old Liu had calmed down and was beginning to analyze the situation in front of us. “Is it hypoxia?”\n“I don’t think so. If it’s lack of oxygen, we’d be feeling tired too. Maybe there’s a problem with your water aerator.”\nOld Liu immediately twisted the valve on the aerator. Bursts of oxygen-rich water pumped in through the pressurization unit. The system looked just fine.\nSo the aerator wasn’t the problem. I sat cross-legged in midair, considering other possibilities. The weird taste from the water earlier still lingered in my mouth. That strange salty taste in particular was making it hard to focus. All I wanted was to rinse my mouth out.\nBut even before I went to get water, I suddenly felt like I’d woken from a dream. The most disastrous possibility of all appeared in my mind. I hurriedly told Old Liu, “It’s the water. There might be a problem with the water circulation system.”\nOld Liu tensed all over. “Instead of hypoxia, what if it’s nitrate poisoning? I’ll go check.” He suddenly gave me a long look, then silently departed. Five minutes later, the tank’s water replacement system came to life. Ten minutes later, Bubbles flicked his tail, beginning to move again.\nNot long after that, Old Liu came back with an awkward expression. He looked at me without speaking.\n“Go ahead, I’m mentally prepared for whatever you have to say,” I said heavily.\n“Okay. Possibly because of the overly high calcium content in the fish feed, the purification process in our water circulation system has been under additional strain this whole time. As of last night, the system had reached its limit—only to receive an additional shock from the space junk that hit the water tank earlier, which caused the system to completely overload. Due to all the calcium-based precipitate clogging up the filtration system and lowering its efficiency, the amines from the urine weren’t fully purified away and absorbed . . . they flowed into the water tank, resulting in nitrate poisoning.” Old Liu described the cause of this malfunction with professionalism and scientific language.\n“Great. So, I have another question.”\n“Go ahead.”\n“This is water from the circulation system?”\n“ . . . Yes.”\n“Water shouldn’t have a salty taste, right? Can you tell me where this salty taste came from, then? Do you need a drink to cool down too?” I waved the leftover water from earlier in front of him.\nAt this point, all the water in the tank had been replaced, and Second Master was waving his gills, as if he had woken up. Faced with my soul-piercing question, Old Liu could only laugh painedly, turn away, and start poking at Second Master.\n“Hah,” I said coldly. “Second Master really is your lucky carp. I’ll spare you this time.” I threw the water pouch aside and prepared to rinse my mouth.\n“Wait!” Old Liu suddenly called out, stopping me. “What did you just say?”\n“I said I’d spare you. What, you want to drink it after all?”\n“No, the thing about Second Master.”\n“Second Master is your lucky carp. What’s wrong?” I asked, not understanding.\n“I think, I’ve figured out the riddle of Second Master’s origin.” Old Liu pondered for a while, then suddenly seemed to have realized something. He grabbed the tablet and started looking something up. After a while, an advertisement that could only display on the dark web appeared in front of me, resolving all our confusion. Below is an excerpt from the ad copy—the name of the company is redacted to avoid suspicion of sponsorship:\nStill stressing over your horoscope? Anxious about your astrological outlook? With eight internationally renowned space feng shui experts to provide manual calculations and every rocket handmade, XX Spacecraft is here to provide the highest-quality, most reliable destiny alteration services. Whether astrology, I-Ching, horoscopes, or tarot, we’re here to help. Seize your fate by the neck![ . . . ]\nService description:\nSend a lucky carp: This service gives you the opportunity to send a lucky carp into space, to improve your fortunes on an astronomical scale. To prevent the carp from getting crushed into pulp during flight, we use flash freezing ecosystem sphere technology. This service is only 199,880 yuan. Quantities are limited, so buy now!\nLucky star watching over you: This service provides a feng shui flashlight handmade by a master to brighten your future from near-Earth orbit. This service is only 99,980 yuan. Quantities are limited, so buy now!\nAppeal to a higher power: This service provides an icon of your choosing (God of Fortune, Guanyin, Yue Lao, Jesus) to direct your destiny from on high. This service is only 169,980 yuan. Quantities are limited, so buy now![ . . . ]\nOkay, I’ve got to say, the stars hold very different significance to different people. Fortunately, we never tried to grab one particular satellite—it exploded before the fourth crossing of our orbits. It wasn’t a bomb, just a harmless red flash-bang, but it shone for a full day and night in its orbit. Apparently that one was called “Star of Bethlehem,” for wealthy people who wanted their kid to grow up a prophet.\nBut at least, the problem was resolved, and all three members of our space station remained alive and well. Unlike the ending of “Feathered Friend,” we didn’t report the whole thing to the higher-ups, just the origin of the weird satellites. That’s why, next time you go vacationing in space, you won’t see a “fishy friend” in every space station. After all, I still want to be able to show my face around these parts, without providing ammo for others to take the piss out of me.\nAlso . . . when you’re studying the geography of space, if, alongside the “von Karman orbit” and the “Tsiolkovsky orbit” and the “Qian Xuesen orbit,” you see a certain “Second Master Guan orbit,” please don’t wonder at it. Trust the textbook. It’s to commemorate two spacefarers who made celebrated contributions to humanity’s exploration of outer space: Old Liu and Lil’ Zhang.\nTranslated and published in partnership with Storycom.\nWang Zhenzhen, a sci-fi writer and undergraduate at SUSTech, is known for telling realistic stories in a humorous style. His stories \"Minesweeper\" and \"Whose Funeral,\" published in Science Fiction World, were respectively selected as The Sci-Fi Stories of the Year for 2018 & 2019. He won the Fifth Morning Star Awards for Best Short Story for \"The Orbiting Guan Erye.\"\nBorn in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest."}