{"fingerprint": "jIyDx/OHlrPUFTAg5SyvoJX6KEY=", "sitename": "Clarkesworld Magazine", "title": "Three Oranges by D. Elizabeth Wasden", "author": "D Elizabeth Wasden", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wasden_02_11/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Three Oranges by D. Elizabeth Wasden", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "3580 words, short story\nThree Oranges\nOrange stained the entire room. Orange juice. Zest. Peels. I scratched at the moist peel over a flowerpot and covered the shavings with soil. The flowerpot had cracked this time. I should buy another. I told myself this on numerous occasions.\nI dipped my hands in the washbasin, then toweled my hands dry. Soil, mixed with orange zest, clung beneath my fingernails. It pushed right up against the soft skin of my finger and worked against my skin, like a rat gnawing against a belly. Had I not had an appointment, I would have excavated the mixture. Scrubbed my hands clean. Perhaps removed a bit of skin with it.\nBut neither I nor Hermes wore clean hands, and I suspected he might appreciate the irony of wearing my guilt in the open—if he noticed at all.\n“Give Prokofiev more commissions,” I told Hermes when he suggested I convince the composer to return to Russia. “The capitalists are fucking him over. He’s getting frustrated. He even told one of the ballet directors that he was tiring of life in Paris. That Russia seemed to ‘beckon to him.’”\nHermes was a field operative from Ukraine, glad to have a full stomach and to not be a Russian, whereas I was from Russia and glad to not be from Ukraine. I often wondered which of us had fared better. Me, with my postings in Berlin then Paris, or he, flitting about the Continent.\n“To trade the City of Light for the dark of Moscow.” Hermes shook his head.\n“Ah, but it’s easier to see light when one is in shadow.”\n“It’s also easier to draw insects to the light and to—” He slapped the table. The thin, spindly legs shook with the sharp smack. I glanced over at the window. The cracked flowerpot held steady. A small, spindly orange tree had already burst through the soil. It shook with his movement. He dusted off his hands. “The Cockroach wants him back now.”\nHermes had shared Osip Mandelstam’s almost deadly poem about our Great Leader, and we often referred to Stalin as Cockroach or Cockroach with Whiskers or any variety of phrasing that would have gotten us shot. Should have gotten us shot.\n“What’s the rush?” I asked.\n“You can’t keep them forever. They’re not yours to keep.” His voice sounded different. Quieter. More predatory. “Where are they, hmm? You never share them anymore.”\nI held up my hands and smiled. He was correct: I did not share them with anyone. Perhaps he had informed Cockroach. Bastard.\nHe said, “Orion, there are plenty of other stars in the sky.” He laughed. I did not. “You won’t like this at all. It gets worse.” Hermes blew out smoke from his nose like a dragon and gazed down. He thumped the cracked surface with his thumb. “You are to use the Oranges to convince him.”\nI shrugged and tapped a cigarette on the table. Loose tobacco jumped from the cigarette, and I swept it away with my hand. The apartment was fairly sparse. We sat, suspenders hanging from broad shoulders, at a small, square table. There were two other chairs besides the ones we occupied, and one of them was fairly comfortable. Thick, purple curtains hung in front of the apartment’s single window. It was a horrible color, like soft, bruised flesh.\n“Fine. I can do that.” I sniffed. Moor had brought me the Oranges when I was in Berlin. Moor was a Caucasian, not an African. Armenian, I think. It was one of the few things I clearly remembered about those days. That and the street fights.\nHermes cleared his throat. There was more. “Cockroach wants the Oranges returned to Moscow with the composer.”\nFuck. “Why?” I lit my cigarette. My hands did not shake.\nHe shrugged. “Who can say?”\nFuck. “You must have heard something.”\nHe crushed his cigarette on the table next to the ashtray. “I think you can guess why he might want Three Oranges returned. You’ve certainly spent enough time with them.” He laughed.\nI would kill the Cockroach with my bare hands. Wrap my suspenders around his throat and pull and squeeze. I would watch his tongue roll and dip in and out, out and in. The tongue that would find all of the crevices and secrets of my Oranges because no one could refuse the Cockroach.\n“Relax,” Hermes said. He had already unscrewed a flask and offered it to me as if he were reading my thoughts. It was a disconcerting proposition. What the Center did not need were omniscient handlers and field agents. “Get this done quickly, and I wouldn’t be surprised if there wasn’t a promotion.”\n“Here or in Moscow?”\n“Is something wrong with Moscow?” He planted his elbows on the table and leaned forward.\nI did not move. “I’d rather not return to Moscow. In fact, I’d adamantly decline.”\nHe laughed again. “Oh, no, you wouldn’t. You don’t decline the Cockroach, and you don’t tell him you’re more comfortable in Paris and would rather stay, thank you very much. I’d advise you to express some measure of homesickness. Like the composer.”\n“Why don’t you keep the promotion? I’ll keep Paris.”\n“Get him to return to Moscow within the week. You’ll stay in Paris, and I won’t say anything about the Normandie. What do you say?”\nMy stomached tightened, and my legs became dead weight. I gave him a crooked smile; I could appreciate his position. Hermes had shared the news about Kirov’s death in 1934, and since then, I had purchased passage on the Normandie. I shouldn’t have been surprised that he knew or that he would use it as leverage. He was protecting his own ass.\nHermes was a colonel. Perhaps he could convince the chief and the chief could convince the Cockroach to keep me in Paris. Perhaps not.\n“If not, I do hope you’ll let me know.” I took a drink and returned his flask. Cognac.\nThe door creaked shut behind him. I followed him a few minutes later, the flowerpot tucked inside my coat, pressed against my side. It bulged outward like a large tumor.\nNight had fallen. The city vibrated with conversation and jazz and whispered promises over cocktails.\nThe Oranges had been with me since Berlin. Berlin had been cut off, but the Oranges were still mine. Mine. When I returned home, I placed the flowerpot under a bright light and ran my fingers up and down its small stems.\n“Grow, damn you,” I said, sliding into a chair with a wine bottle. I washed the taste of cognac out of my mouth and wished for the taste of orange.\nI do not recall the rest of the night.\nWithin a few weeks, the orange tree grew, burying its great roots in the rug beneath it. Eventually, three beautiful orange blooms sprouted, then came the Three Oranges.\nI plucked them from the tree. Rubbed them across my lips, flicked my tongue over them. Tasted them. Knew them. Never let it be said that I have no control, for I placed them in the pocket of my greatcoat.\nI decided to meet Prokofiev in a car—a big, shiny black one that swallowed the passenger’s vision and made him forget about Paris. Those black holes were magical, I must confess. Immediately, the victim’s esteem and spirits would plummet and sink into the floorboard.\nI brought the Three Oranges and scratched at their peels until citrus filled the air. The fairies must have giggled as I tickled their skin. Winter lingered outside, and steam rose from streets, smoke from houses. The door opened, and Sergei Sergeyevich stepped inside.\nI was obvious, all wrapped in leather, bald head, fur hat in my lap, with hard, penetrating eyes. I drew him nearer than he would’ve liked, bent toward him, my lips sending warm breath onto his ear. He sat stock-still. I brandished the Three Oranges, wielded them like hand grenades, laughed, and slid back into my seat after he accepted them.\n“From the motherland.” I smiled. I wanted to break each of his fingers.\n“What shall I do with them? Juggle them?” Prokofiev asked and exhaled all of his worry. He chuckled. Thought that, perhaps, I was there to fucking critique Love for Three Oranges? That insulted me. This was hard, so hard, and he laughed. “If this is some sort of message, you should speak clearly.”\n“What do you think you should do with them?” I pressed one thumb hard against the other and noted all of the colors my thumb could become. Pink. Red. Purple. Blue. White. Streaks of white against a pink background. Yellow on some days. “The longing you must feel—without them for so long. I don’t think you’d prefer to juggle them at all.”\nHis eyes brightened. For a moment, he held the Oranges in his hands, turning them over and caressing them with his thumbs. No doubt imagining things beyond juggling. I pressed harder.\n“Do you have water, then?” he asked, now subservient and meek. Hopeful. Oh, how he smiled and the light in his eyes danced, in spite of the black hole of the car. He was Paris. I was Moscow.\nI turned over an almost empty bottle of vodka and shook the remainder of it onto the car’s floor.\nHe tried to capture the Oranges in the crook of his arm. They rolled back and forth against his coat, awkwardly tumbling across the wool. The first fell as he jostled for the door handle. Strange how uncoordinated some of us are in the moments we most need our agility. Strange how those nimble fingers could betray him at such a time.\nI picked up the first Orange, and I jabbed my thumb into its flesh, digging back and forth. Juice burst onto our faces, our jackets, our hands. He abandoned his escape attempt and watched.\nMy tongue flickered like a serpent’s. I thought of the Cockroach and the Composer in Moscow, taking turns with the Oranges, discovering just where to press and where to rub.\nThe first Orange exploded and opened like a magnificent flower, and I devoured it as I unpeeled the rest of it, tossing aside the peels haphazardly as if undressing a woman. The first fairy, red and white and tiny and angelic, emerged from the discarded, spent peel.\n“Do you have water?” she asked. “Water. Please, water.”\nI wiped my hands on my knees. His lips had parted, but he said nothing and no longer moved.\n“Have you been away for so long that you’ve forgotten them? That you’ve forgotten the rules?” I asked.\n“Water or I’ll perish!” the fairy said.\nShe pressed her hands together. I had not warned her. Her pleading was genuine and excruciating.\nHow she begged. She slid onto the seat, already withering like a days-old cut flower. Water or death. A rather slow death for something so small. I had watched her closely as she perished, slowly drying out, flesh splitting like cracked earth in a drought, tender cheeks splitting like an over-ripe tomato. Blood eased out of the wounds, slow like lava, then the muscle tore apart like frayed rope. Tendons unraveled. Organs shrank and wrinkled, folding on top of themselves until they no longer existed. The fairy would still scream as her bones too disintegrated, turning into dust.\nProkofiev’s face—Oh, now it was priceless. I bit my lip and tasted blood so I wouldn’t laugh.\n(Some of my colleagues at the Center enjoy over-the-top torment. Treatments involving rats and tubes and stomachs or fucking spouses or children in front of subjects or beating subjects then sodomizing them with clubs and sticks and bottles. “Why am I here?” Silence. Crack. “Where am I going?” Silence. Crack. I sympathize with my friends back east. They have their own problems, the Cockroach nibbling at their backs and heels instead of wiggling his antenna from a distance. One has to have a bit of fun. Still, how crude. How unimaginative. How undelightful. Nothing at all like this.)\nProkofiev patted his pockets and threw the contents on the seat. A silk handkerchief (I kept it), a carnation (stepped on it), a thick brass key (threw it out the window), a pipe (sold it thirty years later for a tidy sum), papers (burned), pencil (broke in half), passport (he had the foresight to remember to pick that one up)—piss-all to drink. Hah! I bit my tongue again. Piss-all to drink.\nI retreated to my corner, hands resting in my lap, fingers interlocked. One Orange lay on the floorboard next to the dying fairy.\nHe held the last orange between his knees. It bulged, soft and sweet.\n“I wouldn’t open it,” I told him. I unfolded myself and placed my hand on top of the Orange. He jerked at my movement, as if I had touched him instead. I placed one foot on the other Orange. “Not here.”\nWe watched the fairy fall apart and die. He picked up the discarded peels, followed the minute dimples with his thumbs. Tears rolled down his cheeks. I managed to whistle the “March” from Love for Three Oranges.\n“In Moscow,” he said. He swallowed hard. I already knew he’d return.\n“In Moscow,” I agreed. “You realize you have a choice, though. Return the Oranges to me. You live in Paris. Or elsewhere. Forget about the motherland. You needn’t return to Moscow at all.” My head swam. I needed a cigarette. I wanted him to say yes. More than that, I wanted him to say no. “But the Oranges must.”\nI took the Orange from between his knees and gave it a gentle squeeze.\n“You can replant them. Return them to life.”\nI nodded. “The peels usually suffice. Squeeze enough juice from them.” I squeezed again. “Scrape it out with a penknife. If not?” Again, I squeezed. “As long as there is one, there are three. They’re like a trinity, Citizen Prokofiev. Almost holy.”\nHe stared at the Orange. “All three will return with me. To Moscow.”\n“All three.” I pressed my palm against my chest. I could barely feel my tired heart beating. “I promise.”\nHis skin was still quite pale but some measure of red had begun to flush into his cheeks. “You promise.” He snorted. “I won’t go until I have them.”\nHe had no cause to believe my promises, less so in the darkness of the car. The fairies would return as long as something remained of them. So he clambered out, scooping up his passport, and ran down the street. His jacket flapped behind him in a quick rhythm like the flapping of a bird’s wing.\nHad Prokofiev appeared brighter in the car or on the street? He was dull to me in both environments. Gray.\nI crushed the second Orange underfoot, smashing it until the lump flattened into dry pulp and her screams ended.\nWhen I stepped out of the car, it drove away and disappeared, but I took that last Orange with me.\nWe stopped at a cafe, me and my Orange. We shared a seltzer water and cigarettes. No one noticed as she expanded.\nShe sat in the chair next to me, a fully-grown (and developed) woman. She wore a long, red dress, pearls, and long, black gloves that were smooth to the touch. I held her hand in mine and squeezed too hard, as if she were my thumb back in the car.\nShe wrenched her hand from mine. “That hurts, Stepan.”\n“I’m sorry.” I wasn’t sorry. “Our time.”\nShe stared at me. I found it both hard to look away and to not do so. “Is short.”\nI blinked. “You’re certain he will accept?” I was.\n“I am. His love for us is boundless.” She glared at me accusingly. I deserved it. She was right. She was pouting.\nHis love. “What if there was another option?”\nIt was her turn. She blinked at me with her heavy, dark lashes. “I didn’t think there were any other options.”\nAs if she could know what her options were. “We could sail for North America. Canada.”\n“Don’t be foolish, Stepan.”\n“I’m not. It could be done. You remember the Normandie.”\n“Why? There’s nothing for us there. You don’t love me.” She rolled her eyes.\n“Love you.” I thought of the dead fairies in the black car.\n“Yes. Love.”\nAn impossible thing. “No.”\n“Don’t ruin the evening, then. And don’t ruin your career.” She placed her hand on top of mine and stroked my knuckles. “You have such beautiful hands. They are instruments, Stepan. Different than his, but you should have no shame in your art.”\nWe drank and ate well that night. When we returned to the apartment, I unpeeled her again. She tasted and smelled like the dead fairies in the car. We made love in the dark, black as the inside of that fucking car.\nSome time before dawn, our eyes met. Neither of us blinked.\n“I could learn to love you. I could try. I do try.” My voice was quiet, desperate.\n“You haven’t it in you, Stepan,” she said, then rolled over and pulled a cigarette out of the case. I propped myself up on my elbows as she lit it, illuminating the off-white walls and all of its imperfections. I slid down, haloed in shadow by her shoulder. “Don’t take it personally. I know you’ve tried. For that, I am grateful.”\n“If I set you free,” I said, “where would you go?”\n“If you set me—where . . . ?”\n“Yes. Now. Where would you go?”\n“I don’t know.”\nI sat upright and pushed her shoulder into the bed. She stared at me, smoke trailing from her nose.\n“Would you go to him? Would you go to him?”\n“I—” She paused. “No. I wouldn’t. I wouldn’t, Stepan, I promise.”\nAs she finished the sentence, she clawed at my face, but I struck quickly with my knife, scratching death across her throat. I held her by her shoulders, and she flailed, cutting at my face with her nails. She lacerated my forehead open just above the left eye before I gained control.\nWe were both liars. I knew she would return to him. She knew I would never let her leave.\nAs she bled out, I gathered the peels and placed them in a moistened handkerchief. I slipped it inside my pocket, along with all of my operational funds. And I ran.\nIn my dream, I placed the Three Oranges in an orange car. They drove away, my beautiful fairies still encased in their peels. I wanted to watch my oranges drive an orange car, but the Cockroach nipped, nipped, nipped, and drew blood. My gun liquified in my hands. I vomited bullets. He cut me down, and I fell to my knees, screaming.\n“Do you really think us so helpless, Stepan?” the Oranges said as the Cockroach dragged me back to Moscow. Their voices were beautiful, calm, bright. “Our magic is unexplainable, and yours comes from mere terror. We’re fairies, Stepan. You’re only a man.”\nI kept the orange peel moist, wetting the handkerchief every day. Prokofiev returned to Moscow.\nI scraped orange zest into pots, placed large lights above them, and never allowed the soil to dry.\nHermes died in 1937 or 1938, along with almost everyone else I knew. Almost.\nIn the 1940s, the Center and I threatened one another, baring our teeth across an ocean, but the old Cockroach interceded. He was almost jovial about letting me go, although I did not imagine my information was as dangerous to the Center as they might have suspected at that point.\nI read about Prokofiev in the papers occasionally. They printed his image and discussed his great works.\nOne day, Citizen Prokofiev was not alone. Her face radiated in the gray background of the photograph. She was a monochrome sun in the overcast dawn. A star in the night sky. A lit cigarette in a black car. I laughed at the realization. The fairies truly controlled their magic.\nI cut out her image, leaving Prokofiev alone in his frame, folded her.\nI keep her close always.\nI continued to seek out Prokofiev, to read about the public details of his life. Highs and lows. Mostly lows. Misfortunes. Denunciations. Pleas. These things no longer amused me as much as they once did.\nNow, the flowerpot stands in front of my south-facing window. I water the barren soil once every few weeks, never allowing it to dry. I have waited decades for the soil to break, for a sprout to appear. Nothing grows there, not even in the summer.\nEventually—and on the same day—Prokofiev and Stalin die. What becomes of the Three Oranges? Who will they haunt now? I do not know. I wonder. I scan newspapers for clues. I read American magazines. I cannot find answers in Frigidaire ads and articles about the World Series.\nI do not think their deaths a coincidence, but I have no contacts remaining in the Center. If I were to get the Americans’ attention, would they tell me what they knew about the Oranges in exchange for those old lists, for names and networks and codes, in exchange for my freedom and safety? In exchange for the last of my magic? I wonder these things in the dark winters, the nights as black as cars.\nIt is always cold in Canada.\nThere are no oranges."}