{"fingerprint": "LpNopyIoI2M5v8UxD5ibmhRM0g4=", "sitename": "Clarkesworld Magazine", "title": "Giants by Peter Watts", "author": "Peter Watts", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/watts_09_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Giants by Peter Watts", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7990 words, novelette, REPRINT\n Giants\n So many eons, slept away while the universe wound down around him. He’s dead to human eyes. Even the machines barely see the chemistry ticking over in those cells: an ancient molecule of hydrogen sulphide, frozen in a hemoglobin embrace; an electron shuttled sluggishly down some metabolic pathway two weeks ago. Back on Earth there used to be life deep in the rocks, halfway to the mantle; empires rose and fell in the time it took those microbes to draw breath. Next to Hakim’s, their lives blurred past in an eyeblink. (Next to all of ours. I was every bit as dead, just a week ago.)\n I’m still not sure it’s a good idea, bringing him back.\n Flat lines shiver in their endless march along the x-axis: molecules starting to bump against each other, core temp edging up a fraction of a fraction. A lonely spark flickers in the hypothalamus; another wriggles across the prefrontal cortex (a passing thought, millennia past its best-before, released from amber). Millivolts trickle down some random path and an eyelid twitches.\n The body shudders, tries to breathe but it’s too soon: it’s still anoxic in there, pure H2S gumming up the works and shutting the machinery of life down to a whisper. The Chimp starts a nitrox flush; swarms of fireflies bloom across Pulmonary and Vascular. Hakim’s cold empty husk fills with light from the inside out: red and yellow isotherms, pulsing arteries, a trillion reawakening neurons stippling across the translucent avatar in my head. A real breath this time. Another. His fingers twitch and stutter, tap a random tattoo against the floor of his sarcophagus.\n The lid slides open. His eyes, too, a moment later: they roll unfocused in their sockets, suffused in a haze of resurrection dementia. He can’t see me. He sees soft lights and vague shadows, hears the faint underwater echo of nearby machinery, but his mind is still stuck to the past and the present hasn’t sunk in yet.\n A tongue dry as leather flicks into view against his upper lip. A drinking tube emerges from its burrow and nudges Hakim’s cheek. His takes it in his mouth and nurses, reflexive as a newborn.\n I lean into what passes for his field of view: “Lazarus, come forth.”\n It anchors him. I see sudden focus resolving in those eyes, see the past welling up behind them. I see memories and hearsay loading in the wake of my voice. Confusion evaporates; something sharper takes its place. Hakim stares up at me from the grave, his eyes hard as obsidian.\n “You asshole,” he says. “I can’t believe we haven’t killed you yet.”\n I give him space. I retreat to the forest, wander endless twilit caverns while he learns to live again. Down here I can barely see my own hand in front of my face: gray fingers, faint sapphire accents. Photophores glimmer around me like dim constellations, each tiny star lit by the glow of a trillion microbes. Photosynthesis instead of fusion. You can’t get truly lost in Eriophora—the Chimp always knows where you are—but here in the dark, there’s comfort to be had in the illusion.\n Eventually, though, I have to stop stalling. I sample myriad feeds as I rise though the depths of the asteroid, find Hakim in the starboard bridge. I watch as he enters painstaking questions, processes answers, piles each new piece on top of the last in a rickety climb to insight. Lots of debris in this system, yes: more than enough material for a build. Call up the transponders and—what’s this? No in-system scaffolding, no half-constructed jump gate, no asteroid mining or factory fleet. So why—?\n System dynamics, now. Lagrange points. Nothing on this side, anyway, even though there are at least three planetary bodies in—whoa, those orbits—\n Our orbit . . .\n By the time I join him in the flesh he’s motionless, staring into the tac tank. A bright dimensionless point floats in the center of that display: Eriophora. The ice giant looms dark and massive to port, the red one—orders of magnitude larger—seethes in the distance behind. (If I stepped outside I’d see an incandescent barrier stretching across half the universe, with the barest hint of a curve on the horizon; tac reduces it to a cherry globe floating in an aquarium.) A million bits of detritus, from planets to pebbles, careen through the neighborhood. We’re not even relativistic and still the Chimp hasn’t had time to tag them all.\n None of those tags make sense anyway. We’re aeons from the nearest earthly constellation; every alphabet, every astronomical convention has been exhausted by the stars we’ve passed in the meantime. Maybe the Chimp invented his own taxonomy while we were sleeping, some arcane gibberish of hex and ASCII that makes sense to him and him alone. A hobby, perhaps, although he’s supposed to be too stupid for anything like that.\n I slept through most of that scenery. I’ve been awake for barely a hundred builds; my mythological reservoir is nowhere near exhausted. I have my own names for these monsters.\n The cold giant is Thule. The hot one is Surtr.\n Hakim ignores my arrival. He moves sliders back and forth: trajectories extrude from bodies in motion, predict the future according to Newton. Eventually all those threads converge and he rewinds time, reverses entropy, reassembles the shattered teacup and sets it running again. He does it three times as I watch. The result never changes.\n He turns, his face bloodless. “We’re going to hit. We’re going to ram straight into the fucking thing.”\n I swallow and nod.\n “That’s how it starts,” I tell him.\n We’re going to hit. We’re aiming to hit, we’re going to let the lesser monster devour us before the greater one devours it. We’ll lower Eriophora by her own bootstraps, sink through roiling bands of hydrogen and helium and a thousand exotic hydrocarbons, down to whatever residual deep-space chill Thule’s been hoarding since—who knows? Maybe almost as long as we’ve been in flight.\n It won’t last, of course. The planet’s been warming ever since it started its long fall from the long dark. Its bones will survive the passage through the stellar envelope easily enough: five hours in and out, give or take. Its atmosphere won’t be so lucky, though. Every step of the way Surtr’s going to be stripping it down like a child licking an ice cream cone.\n We’ll make it through by balancing in the ever-shrinking sweet spot between a red-hot sky and the pressure cooker at Thule’s core. The numbers say it’ll work.\n Hakim should know this already. He would have awakened knowing if not for that idiotic uprising of theirs. But they chose to blind themselves instead, burn out their links, cut themselves off from the very heart of the mission. So now I have to explain things. I have to show things. All that instantaneous insight we once shared, gone: one ancient fit of pique and I have to use words, scribble out diagrams, etch out painstaking codes and tokens while the clock runs down. I’d hoped that maybe, after all these red-shifted millennia, they might have reconsidered; but the look in Hakim’s eyes leaves no doubt. As far as he’s concerned it all happened yesterday.\n I do my best. I keep the conversation strictly professional, focus on the story so far: a build, aborted. Chaos and inertia, imminent annihilation, the insane counterintuitive necessity of passing through a star instead of going around it. “What are we doing here?” Hakim asks once I’ve finished.\n “It looked like a perfect spot.” I gesture at the tank. “From a distance. Chimp even sent out the vons, but—” I shrug. “The closer we got, the worse it turned out to be.”\n He stares at me without speaking, so I add context: “Far as we can tell something big came through a few hundred thousand years back, knocked everything haywire. None of the planetary masses are even on the ecliptic any more. We can’t find anything orbiting with an eccentricity of less than point six, there’s a shitload of rogues zipping around in the halo—but by the time those numbers came back, we were already committed. So now we just buckle down through the heavy traffic, steal a gravity-assist, get back on the road.”\n He shakes his head. “What are we doing here?”\n Oh, that’s what he means. I tap an interface, timelapse the red giant. It jerks in the tank like a fibrillating heart. “Turns out it’s an irregular variable. One complication too many, right?” Not that we’ll be able thread the needle any better than the Chimp can (although of course Hakim’s going to try, in these few hours left to him). But the mission has parameters. The Chimp has his algorithms. Too many unexpected variables and he wakes up the meat. That’s what we’re here for, after all.\n That’s all we’re here for.\n One more time, Hakim asks: “What are we doing here?”\n Oh.\n “You’re the numbers guy,” I say after a moment. “One of ’em, anyway.” Out of how many thousand, stored down in the crypt?\n Doesn’t matter. They probably all know about me by now.\n “Guess it was just your rotation,” I add.\n He nods. “And you? You a numbers guy too, now?”\n “We come back in pairs,” I say softly. “You know that.”\n “So it just happened to be your rotation as well.”\n “Look—”\n “Nothing to do with your Chimp wanting its own personal sock-puppet on hand to keep an eye on things.”\n “Fuck, Hakim, what do you want me to say?” I spread my hands. “That he might want someone on deck who won’t try to pull the plug the first chance they get? You think that’s unreasonable, given what happened?” But he doesn’t even know what happened, not first-hand. Hakim wasn’t up when the mutiny went down; someone obviously told him, down through the epochs. Christ knows how much of what he heard is truth, lies, legend.\n A few million years go by and suddenly I’m the bogeyman.\n We fall towards ice. Ice falls towards fire. Both spill through the link and spread across the back of my skull in glorious terrifying first-person. Orders of magnitude aren’t empty abstractions in here: they’re life-size, you feel them in your gut. Surtr may be small to a textbook—at seven million kilometers across, it’s barely big enough to get into the giant’s club—but that doesn’t mean shit when you meet it face to face. That’s not a star out there: that’s the scorching edge of all creation, that’s heat-death incarnate. Its breath stinks of left-over lithium from the worlds it’s already devoured. And the dark blemish marching across its face isn’t just a planet. It’s a melting hellscape twice the size of Uranus, it’s frozen methane and liquid hydrogen and a core hot and heavy enough to bake diamonds. Already it’s coming apart before my eyes, any moons long since lost, the tattered remnants of a ring system shredding around it like a rotting halo. Storms boil across its face; aurorae flicker madly at both poles. A supercyclone pinwheels at the center of the dark side, fed by turbulent streamers fleeing from light into shadow. Its stares back at me like the eye of a blind god.\n Meanwhile, Hakim pushes balls around inside an aquarium.\n He’s been at it for hours: a bright blue marble here, a sullen red basketball over there, threads of tinsel looping through time and trajectory like the webbing of some crazed spacefaring spider. Maybe pull our center of mass to starboard, start gentle then ramp up to max? Break some rocks on the way, suffer some structural damage but nothing the drones won’t be able to patch up in time for the next build.\n No?\n Maybe cut smooth and fast into full reverse. Eri’s not built for it but if we keep the vectors dead along the centerline, no turn no torque just a straight linear one-eighty back out the way we came—\n But no.\n If only we hadn’t already fallen so far down the well. If only we hadn’t slowed down to open the trunk, all these N-bodies wouldn’t have been able to get such a grip on us. But now we’re only fast, not fast enough; we’re big but still too small.\n Now, the only way out is through.\n Hakim’s not an idiot. He knows the rules as well as I do. He keeps trying, though. He’d rather rewrite the laws of physics than trust himself to the enemy. We’ll be deaf and blind in there, after all; the convulsions of Thule’s disintegrating atmosphere will fog our sight at short range, the roar of Surtr’s magnetic field will deafen us in the long. There’ll be no way of telling where we are, nothing but the Chimp’s math to tell us where we should be.\n Hakim doesn’t see the world like I do. He doesn’t like having to take things on faith.\n Now he’s getting desperate, blasting chunks off his toy asteroid in an attempt to reduce its momentum. He hasn’t yet considered how that might impact our radiation shielding once we get back up to speed. He’s still stuck on whether we can scavenge enough in-system debris to patch the holes on our way out.\n “It won’t work,” I tell him, though I’m wandering deep in the catacombs half a kilometer from his location. (I’m not spying because he knows I’m watching. Of course he knows.)\n “Won’t it now.”\n “Not enough mass along the escape trajectory, even if the vons could grab it all and get it back in time.”\n “We don’t know how much mass is out there. Haven’t plotted it all yet.”\n He’s being deliberately obtuse, but I go along with it; at least we’re talking. “Come on. You don’t need to plot every piece of gravel to get a mass distribution. It won’t work. Check with the Chimp if you don’t believe me. He’ll tell you.”\n “It just has told me,” he says.\n I stop walking. I force myself to take a slow breath.\n “I’m linked, Hakim. Not possessed. It’s just an interface.”\n “It’s a corpus callosum.”\n “I’m just as autonomous as you are.”\n “Define I.”\n “I don’t—”\n “Minds are holograms. Split one in half, you get two. Stitch two together, you get one. Maybe you were human back before your upgrade. Right now you’ve got about as much standalone soul as my parietal lobe.”\n I look back along the vaulted corridor (I suppose the cathedral architecture might just be coincidence), where the dead sleep stacked on all sides.\n They’re much better company like this.\n “If that’s true,” I ask them all, “then how did you ever get free?”\n Hakim doesn’t speak for a moment.\n “The day you figure that out,” he says, “is the day we lose the war.”\n It’s not a war. It’s a fucking tantrum. They tried to derail the mission and the Chimp stopped them. Simple as that, and perfectly predictable. That’s why the engineers made the Chimp so minimalist in the first place, why the mission isn’t run by some transcendent AI with an eight-dimensional IQ: so that things will stay predictable. If my fellow meat sacks couldn’t see it coming, they’re more stupid than the thing they’re fighting.\n Hakim knows that on some level, of course. He just refuses to believe it: that he and his buddies got outsmarted by something with half his synapse count. The Chimp. The idiot savant, the artificial stupidity. The number-cruncher explicitly designed to be so dim that even with half the lifespan of a universe to play around in, it could never develop its own agenda.\n They just can’t believe it beat them in a fair fight.\n That’s why they need me. I let them tell each other that it cheated. No way that glorified finger-counter would’ve won if I hadn’t betrayed my own kind.\n This is the nature of my betrayal; I stepped in to save their lives. Not that their lives were really in danger, of course, no matter what they say. It was just a strategy. That was predictable too.\n I’m sure the Chimp would have turned the air back on before things went too far.\n Thule’s graduated from world to wall while I wasn’t looking: a dark churning expanse of thunderheads and planet-shredding tornadoes. There’s no sign of Surtr lurking behind, not so much as a faint glow on the horizon. We huddle in the shadow of the lesser giant and it’s almost as though the greater one has simply gone away.\n We’re technically in the atmosphere now, a mountain wallowing high above the clouds with its nose to the stars. You could draw a line from the hot hydrogen slush of Thule’s core through the cold small singularity of our own, straight out through the gaping conical maw at our bow. Hakim does just that, in the tac tank. Maybe it makes him feel a little more in control.\n Eriophora sticks out her tongue.\n You can only see it in X-ray or Hawking, maybe the slightest nimbus of gamma radiation if you tune the sensors just right. A tiny bridge opens at the back of Eri’s mouth: a hole in spacetime reaching back to the hole in our heart. Our center of mass smears a little off-center, seeks some elastic equilibrium between those points. The Chimp nudges the far point farther and our center follows in its wake. The asteroid tugs upward, falling after itself; Thule pulls us back. We hang balanced in the sky while the wormhole’s tip edges past the crust, past that abraded mouth of blue-sanded basalt, out past the forward sensor hoop.\n We’ve never stretched ourselves so thin before. Usually there’s no need; with lightyears and epochs to play in, even the slowest fall brings us up to speed in plenty of time. We can’t go past twenty percent lightspeed anyway, not without getting cooked by the blueshift. Usually Eri keeps her tongue in her mouth.\n Not this time. This time we’re just another one of Hakim’s holiday ornaments, dangling from a thread in a hurricane. According to the Chimp, that thread should hold. There are error bars, though, and not a lot of empirical observation to hang them on. The database on singularities nested inside asteroids nested inside incinerating ice giants is pretty heavy on the handwaving.\n And that’s just the problem within the problem. Atmospheric docking with a world falling at two hundred kilometers a second is downright trivial next to predicting Thule’s course inside the star: the drag inflicted by a millionth of a red-hot gram per cubic centimeter, stellar winds and thermohaline mixing, the deep magnetic torque of fossil helium. It’s tough enough figuring out what “inside” even means when the gradient from vacuum to degenerate matter blurs across three million kilometers. Depending on your definition we might already be in the damn thing.\n Hakim turns to me as the Chimp lowers us toward the storm. “Maybe we should wake them up.”\n “Who?”\n “Sunday. Ishmael. All of them.”\n “You know how many thousands of us are stacked up down there?” I know. Hakim might guess but this traitor knows right down to the last soul, without checking.\n Not that any of them would pat me on the back for that.\n “What for?” I ask.\n He shrugs. “It’s all theory. You know that. We could all be dead in a day.”\n “You want to bring them back so they can be awake when they die?”\n “So they can—I don’t know. Write a poem. Grow a sculpture. Shit, one or two of them might even be willing to make their peace with you before the end.”\n “Say we wake them up and we’re not all dead in day. You’ve just pushed our life support three orders of mag past spec.”\n He rolls his eyes. “Then we put everyone back down again. So it spikes the CO2. Nothing the forest won’t be able to clear in a few centuries.”\n I can barely hear the tremor in his voice.\n He’s scared. That’s what this is. He’s scared, and he doesn’t want to die alone. And I don’t count.\n I suppose it’s a start.\n “Come on. At the very least it’ll be a hell of a solstice party.”\n “Ask the Chimp,” I suggest.\n His face goes hard. I keep mine blank.\n I’m pretty sure he wasn’t serious anyway.\n The depths of the troposphere. The heart of the storm. Cliffs of water and ammonia billow across our path: airborne oceans shattered down to droplets, to crystals. They crash into our mountain at the speed of sound, freeze solid or cascade into space depending on the mood. Lightning flashes everywhere, stamps my brain stem with half-glimpsed afterimages: demon faces, and great clawed hands with too many fingers.\n Somehow the deck stays solid beneath my feet, unmoved even by the death throes of a world. I can’t entirely suppress my own incredulity; even anchored by two million tonnes of basalt and a black hole, it seems impossible that we’re not being tossed around like a mote in a wind tunnel.\n I squash the feed and the carnage vanishes, leaving nothing behind but bots and bulkheads and a ribbon of transparent quartz looking down onto the factory floor. I kill some time watching the assembly lines boot up in there, watching maintenance drones gestate in the vacuum past the viewport. Even best-case there’s going to be damage. Cameras blinded by needles of supersonic ice or sheets of boiling acid. The whiskers of long-range antennae, drooping in the heat. Depending on the breaks it could take an army to repair the damage after we complete our passage. I take some comfort from the sight of the Chimp’s troops assembling themselves.\n For an instant I think I hear a faint shriek down some far-off corridor: a breach, a decompression? No alarms, though. Probably just one of the roaches skidding around a bend in the corridor, looking for a recharge.\n I’m not imagining the beeping in my head, though: Hakim, calling down from the bridge. “You need to be up here,” he says when I open the channel.\n “I’m on the other side of the—”\n “Please,” he says, and forks me a live feed: one of the bow clusters, pointing at the sky.\n A feature has emerged from the featureless overcast: a bright dimple on the dark sky, like a finger poking down through the roof of the world. It’s invisible in visible light, hidden by torrents of ammonia and hydrocarbon hurricanes: but it shimmers in infrared like a rippling ember.\n I have no idea what it is.\n I draw an imaginary line through the ends of the wormhole. “It’s in line with our displacement vector.”\n “No shit it’s in line. I think the wormhole’s—provoking it, somehow.”\n It’s radiating at over two thousand Kelvin.\n “So we’re inside the star,” I say, and hope Hakim takes it as good news.\n If nothing else, it means we’re on schedule.\n We’ve got so little to go on. We don’t know how far we are from the ceiling: it keeps ablating away above us. We don’t know how close we are to the core: it keeps swelling beneath the easing weight of all this shedding atmosphere. All we know is that temperature rises overhead and we descend; pressure rises from beneath and we climb. We’re specks in the belly of some fish in empty mid-ocean, surface and seabed equally hypothetical. None of our reference points are any more fixed than we are. The Chimp presents estimates based on gravity and inertia, but even those are little more than guesses thanks to wormhole corruption of the local spacetime. We’re stretched across the probability wave, waiting for the box to open so the universe can observe whether we’re dead or alive.\n Hakim eyes me from across the tank, his face flickering in the light of a hundred cam feeds. “Something’s wrong. We should be through by now.”\n He’s been saying that for the past hour.\n “There’s bound to be variability,” I remind him. “The model—”\n “The model.” He manages a short, bitter laugh. “Based on all those zettabytes we collected the other times we hitched a ride through a red giant. The model’s shit. One hiccup in the magnetic field and we could be going down instead of out.”\n “We’re still here.”\n “That’s exactly the problem.”\n “It’s still dark.” The atmosphere’s still thick enough to keep Surtr’s blinding interior at bay.\n “Always darkest before the dawn,” Hakim says grimly, and points to that brightening smudge of infrared overhead.\n The Chimp can’t explain it, for all the fresh realtime data he stuffs into his equations. All we know is that whatever it is, it hasn’t budged from our displacement vector and it’s getting hotter. Or maybe closer. It’s hard to tell; our senses are hazy that far out, and we’re not about to stick our heads above the clouds for a better view.\n Whatever it is, the Chimp doesn’t think it’s worth worrying about. He says we’re almost through.\n The storm no longer freezes on impact. It spits and hisses, turns instantly to steam. Incessant lightning strobes the sky, stop-animates towering jigsaw monsters of methane and acetylene.\n God’s mind might look like this, if He were an epileptic.\n We get in the way sometimes, block some deific synapse in mid-discharge: a million volts spike the hull and a patch of basalt turns to slag, or Eri goes blind in another eye. I’ve lost count of the cameras and antennae and radar dishes we’ve already lost. I just add it to the tally when another facet flares and goes dark at the edge of the collage.\n Hakim doesn’t. “Play that again,” he tells the Chimp. “That feed. Just before it fratzed.”\n The last moments of the latest casualty: Eri’s cratered skin, outcroppings of half-buried machinery. Lightning flickers in from Stage Left, stabs a radiator fin halfway to our lumpy horizon. A flash. A banal and overfamiliar phrase:\n No Signal.\n “Again,” Hakim says. “The strike in the middle distance. Freeze on that.”\n Three bolts, caught in the act—and Hakim’s onto something, I see now. There’s something different about them, something less—random—than the fractal bifurcations of more distant lightning. Different color, too—more of a bluish edge—and smaller. The bolts in the distance are massive. These things arcing across the crust don’t look much thicker than my own arm.\n They converge towards some bright mass just barely out of camera range.\n “Static discharge of some kind,” I suggest.\n “Yeah? What kind, exactly?”\n I can’t see anything similar in the current mosaic, but the bridge bulkheads only hold so many windows and our surface cams still number in the thousands. Even my link can’t handle that many feeds at once. “Chimp: any other phenomena like that on the surface?”\n “Yes,” says the Chimp, and high-grades the display:\n Bright meshes swarming over stone and steel. Formations of ball lightning, walking on jagged stilts of electricity. Some kind of flat flickering plasma, sliding along Eri’s crust like a stingray.\n “Shittttt . . . ” Hakim hisses. “Where did they come from?”\n Our compound eye loses another facet.\n “They’re targeting the sensors.” Hakim’s face is ashen.\n “They?” Could just be electricity arcing to alloy.\n “They’re blinding us. Oh Jesus fuck being trapped inside a star isn’t bad enough there’s gotta be hostile aliens in the bargain.”\n My eyes flicker to the ceiling pickup. “Chimp, what are those things?”\n “I don’t know. They could be something like Saint Elmo’s Fire, or a buoyant plasma. I can’t rule out some sort of maser effect either, but I’m not detecting any significant microwave emissions.”\n Another camera goes down. “Lightning bugs,” Hakim says, and emits a hysterical giggle.\n “Are they alive?” I wonder.\n “Not organically,” the Chimp tells me. “I don’t know if they’d meet definitions based on entropy restriction.”\n No conventional morphology there. Those aren’t legs exactly, they’re—transient voltage arcs of some kind. And body shape—if body even applies—seems to be optional and fluid. Auroras bunch up into sparking balls; balls sprout loops or limbs or just blow away at Mach 2, vanishing into the storm.\n I call up a tactical composite. Huh: clustered distribution. A flock gathered at the skeletal remains of a long-dead thruster nozzle; another flickering across an evagineering hutch halfway down the starboard lateral line. A whole party in Eri’s crater-mouth, swarming around our invisible bootstrap like water circling a drain.\n “Holes,” Hakim says softly. “Depressions. Hatches.”\n But something’s caught my eye that doesn’t involve any of those things, something unfolding overhead while our other eyes are fixed on the ground—\n “They’re trying to get in. That’s what they’re doing.”\n A sudden bright smudge in the sky. Then a tear; a hole; the dilating pupil of some great demonic eye. Dim bloody light floods down across the battered landscape as a cyclone opens over our heads, wreathed in an inflammation of lightning.\n Surtr’s finger stretches down from Hades, visible at last to naked eyes.\n “Holy shit . . . ” Hakim whispers.\n It’s an incandescent tornado, a pillar of fire. It’s outside reaching in, and if anything short of magic can explain its existence it’s not known to me or the Chimp or the accumulated wisdom of all the astrophysicists nesting in our archives. It reaches down and touches our wormhole, just so. It bulges, as if inflamed by an embedded splinter; the swollen tip wobbles absurdly for a moment, then bursts—\n —and fire gushes down from the heavens in a liquid cascade. The things beneath scatter fast as forked lightning can carry them; here in the bridge, the view sparks and dies. From a dozen other viewpoints I see tongues of soft red plasma splashing across Eriophora’s crust.\n Some rough alarm whispers fuck fuck fuck fuck at my side while Eri feeds me intelligence: something happening back at that lateral hutch. All those cams are down but there’s a pressure surge at the outer hatch and a rhythmic hissing sound crackles in along the intercom.\n Hakim’s vanished from the bridge. I hear the soft whine of his roach receding at full throttle. I duck out into the corridor, grab my own roach from its socket, follow. There’s really no question where he’s headed; I’d know that even if the Chimp hadn’t already laid out the map in my head.\n Way back along our starboard flank, something’s knocking on the door.\n He’s in the prep compartment by the time I catch up, scrambling into an EVA suit like some panicky insect trying to climb back into its cocoon. “Outer hatch is breached,” he tells me, forgetting.\n Just meters away. Past racks and suit alcoves, just the other side of that massive biosteel drawbridge, something’s looking for a way in. It could find one, too; I can see heat shimmering off the hatch. I can hear the pop and crackle of arcing electricity coming through from the other side, the faint howl of distant hurricanes.\n “No weapons.” Hakim fumbles with his gauntlets. “Mission to the end of time and they don’t even give us weapons.” Which is not entirely true. They certainly gave us the means to build weapons. I don’t know if Hakim ever availed himself of that option but I remember his buddies, not so far from this very spot. I remember them pointing their weapons at me.\n “What are we doing here?” I gesture at the hatch; is it my imagination, or has it brightened a little in the center?\n He shakes his head, his breathing fast and shallow. “I was gonna—you know, the welding torches. The lasers. Thought we could stand them off.”\n All stored on the other side.\n He’s suited up to the neck. His helmet hangs on its hook within easy reach: a grab and a twist and he’ll be self-contained again. For a while.\n Something pounds hard on the hatch. “Oh shit,” Hakim says weakly.\n I keep my voice level. “What’s the plan?”\n He takes a breath, steadies himself. “We, um—we retreat. Out past the nearest dropgate.” The Chimp takes the hint and throws an overlay across my inner map; back into the corridor and fifteen meters forward. “Anything breaches, the gates come down.” He nods at an alcove. “Grab a suit, just in—”\n “And when they breach the dropgates?” I wonder. The biosteel’s definitely glowing, there in the center.\n “The next set goes down. Jesus, you know the drill.”\n “That’s your plan? Give up Eri in stages?”\n “Small stages.” He nods and swallows. “Buy time. Figure out their weak spot.” He grabs his helmet and turns towards the corridor.\n I lay a restraining hand on his shoulder. “How do we do that, exactly?”\n He shrugs it off. “Wing it for fucksake! Get Chimp to customize some drones to go in and, and ground them or something.” He heads for the door.\n This time the hand I lay on him is more than a suggestion. This time it clamps down, spins him around, pushes him against the bulkhead. His helmet bounces across the deck. His clumsy gloved hands come up to fend me off but there’s no strength in them. His eyes do a mad little jig in his face.\n “You’re not thinking this through,” I say, very calmly.\n “There’s no time to think it through! They might not even get past the gates, maybe they’re not even trying, I mean—” His eyes brighten with faint and ridiculous hope. “Maybe it’s not even an attack, I bet it’s not, you know, they’re just—they’re dying. It’s the end of the world and their home’s on fire and they’re just looking for a place to hide, they’re not looking for a way in they’re looking for a way out—”\n “What makes you think that inside’s any less lethal to them than outside is to us?”\n “They don’t have to be smart!” he cries out. “They just have to be scared!”\n Fingers of faint electricity flicker and crackle around the edges of the hatch: heat lightning, maybe. Or maybe something more prehensile.\n I keep Hakim pinned. “What if they are smart? What if they’re not just burrowing on instinct? What if they’re the ones with the plan, hmm?”\n He spreads his hands. “What else can we do?”\n “We don’t give them the chance to breach. We get out of here now.”\n “Get—”\n “Ditch the ice giant. Take our chances in the star.”\n He stops struggling and stares, waiting for the punchline. “You’re insane,” he whispers when I fail to deliver.\n “Why? Chimp says we’re almost through anyway.”\n “He said that half an hour ago! And we were an hour past predicted exit even then!”\n “Chimp?” I say, not for the AI’s benefit but for Hakim’s.\n “Right here.”\n “Say we max the wormhole. Throw out as much mass as we can, shortest path out of the envelope.”\n “Tidal stress tears Eriophora into two debris clouds of roughly equal mass, each one centered on—”\n “Amend that. Say we optimize distance and displacement to maximize velocity without losing structural integrity.”\n I can tell by the wait that there are going to be serious confidence limits attached to the answer. “Eriophora is directly exposed to the stellar envelope for 1300 corsecs,” he says at last. “Give or take 450.”\n At 2300 Kelvin. Basalt melts at 1724.\n But the Chimp hasn’t finished. “We would also risk significant structural damage due to the migration of secondary centers-of-mass beyond Eriophora’s hardlined displacement channels.”\n “Do we make it?”\n “I don’t know.”\n Hakim throws up his hands. “Why the hell not? It’s what you do!”\n “My models can’t account for the plasma invagination overhead or the electrical events on the hull,” the Chimp tells him. “Therefore they’re missing at least one important variable. You can’t trust my predictions.”\n Down at the end of the compartment, the hatch glows red as the sky. Electricity sizzles and pops and grabs.\n “Do it,” Hakim says suddenly.\n “I need consensus,” the Chimp replies.\n Of course. The Chimp takes his lead from us meat sacks when he gets lost; but looking to us for wisdom, he wouldn’t know whose to follow if we disagreed.\n Hakim waits, manic, his eyes flicking between me and the hatch. “Well?” he says after a moment.\n It all comes down to me. I could cancel him out.\n “What are you waiting for? It was your fucking idea!”\n I feel an urge to lean close and whisper in his ear. Not just Chimp’s sock puppet now, am I, motherfucker? I resist it. “Sure,” I say instead. “Give it a shot.”\n Wheels begin to turn. Eriophora trembles and groans, torqued by vectors she was never designed for. Unfamiliar sensations tickle my backbrain, move forward, root in my gut: the impossible, indescribable sense of down being in two places at once. One of those places is safe and familiar, beneath my feet, beneath decks and forests and bedrock at the very heart of the ship; but the other’s getting stronger, and it’s moving . . .\n I hear the scream of distant metal. I hear the clatter of loose objects crashing into walls. Eriophora lurches, staggers to port, turns ponderously on some axis spread across too many sickening dimensions. There’s something moving behind the wall, deep in the rocks; I can’t see it but I feel its pull, hear the cracking of new fault lines splitting ancient stone. A dozen crimson icons bloom like tumors in my brain, Subsystem Failure and Critical Coolant and Primary Channel Interrupt. A half-empty squeezebulb, discarded decades or centuries or millennia ago, wobbles half-levitating into view around the corner. It falls sideways and slides along the bulkhead, caught up in the tide-monster’s wake.\n I’m standing on the deck at forty-five degrees. I think I’m going to be sick.\n The down beneath my feet is less than a whisper. I give silent thanks for superconducting ceramics, piezoelectric trusses, all reinforcements brute and magical that keep this little worldlet from crumbling to dust while the Chimp plays havoc with the laws of physics. I offer a diffuse and desperate prayer that they’re up to the task. Then I’m falling forward, upward, out: Hakim and I smack into the forward bulkhead as a rubber band, stretched to its limit, snaps free and hurls us forward.\n Surtr roars in triumph as we emerge, snatches at this tiny unexpected prize shaken free of the larger one. Jagged spiders leap away and vanish into blinding fog. Wireframe swirls of magnetic force twist in the heat, spun off from the dynamo way down in the giant’s helium heart—or maybe that’s just the Chimp, feeding me models and imaginings. I’m pretty sure it’s not real; our eyes and ears and fingertips have all been licked away, our windows all gone dark. Skin and bones will be next to go: warm basalt, softening down to plastic. Maybe it’s happening already. No way to tell any more. Nothing to do but fall out as the air flattens and shimmers in the rising heat.\n I’m saving your life, Hakim. You better fucking appreciate it.\n Yeats was wrong. The center held after all.\n Now we are only half-blind, and wholly ballistic. A few eyes remain smoldering on the hull, pitted with cataracts; most are gone entirely. Charred stumps spark fitfully where sensors used to be. Eri’s center of mass has snapped back into itself and is sleeping off the hangover down in the basement. We coast on pure inertia, as passive as any other rock.\n But we are through, and we are alive, and we have ten thousand years to lick our wounds.\n It won’t take anywhere near that long, of course. The Chimp has already deployed his army; they burned their way out through the slagged doorways of a dozen service tunnels, laden with newly refined metals dug from the heart of the mountain. Now they clamber across the surface like great metal insects, swapping good parts for bad and cauterizing our wounds with bright light. Every now and then another dead window flickers back to life; the universe returns to us in bits and pieces. Surtr simmers in our wake, still vast but receding, barely hot enough to boil water this far out.\n I prefer the view ahead: deep comforting darkness, swirls of stars, glittering constellations we’ll never see again and can’t be bothered to name. Just passing through.\n Hakim should be down in the crypt by now, getting ready to turn in. Instead I find him back in the starboard bridge, watching fingers of blue-white lightning leap across the hull. It’s a short clip and it always ends the same way, but he seems to find value in repeat viewings.\n He turns at my approach. “Sanduloviciu plasma.”\n “What?”\n “Electrons on the outside, positive ions on the inside. Self-organizing membranes. Live ball lightning. Although I don’t know what they’d use as a rep code. Some kind of quantum spin liquid, maybe.” He shrugs. “The guys who discovered these things didn’t have much to say about heredity.”\n He’s talking about primitive experiments with gas and electricity, back in some prehistoric lab from the days before we launched (I know: Chimp fed me the archive file the moment Hakim accessed it). “We’re the guys who discovered them,” I point out; the things that clawed at our doorstep were lightyears beyond anything those cavemen ever put together.\n “No we didn’t.”\n I wait.\n “They discovered us,” he tells me.\n I feel a half-smile pulling at the corner of my mouth.\n “I keep thinking about the odds,” Hakim says. “A system that looks so right from a distance and turns out to be so wrong after we’ve committed to the flyby. All that mass and all those potential trajectories, and somehow the only way out is through the goddamn star. Oh, and there’s one convenient ice giant that just happens to be going our way. Any idea what those odds are?”\n “Astronomical.” I keep a straight face.\n He shakes his head. “Infinitesimal.”\n “I’ve been thinking the same thing,” I admit.\n Hakim gives me a sharp glance. “Have you now.”\n “The way the whole system seemed primed to draw us into the star. The way that thing reached down to grab us once we were inside. Your lightning bugs: I don’t think they were native to the planet at all, not if they were plasma-based.”\n “You think they were from the star.”\n I shrug.\n “Star aliens,” Hakim says.\n “Or drones of some kind. Either way, you’re right; this system didn’t just happen. It was a sampling transect. A trapline.”\n “Which makes us what, exactly? Specimens? Pets? Hunting trophies?”\n “Almost. Maybe. Who knows?”\n “Maybe buddies, hmm?”\n I glance up at the sudden edge in his voice.\n “Maybe just allies,” he muses. “In adversity. Because it’s all for one against the common enemy, right?”\n “That’s generally good strategy.” It felt good, too, not being the bad guy for a change. Being the guy who actually pulled asses out of the fire.\n I’ll settle for allies.\n “Because I can see a couple of other coincidences, if I squint.” He’s not squinting, though. He’s staring straight through me. “Like the way the Chimp happened to pair me up with the one person on the whole roster I’d just as soon chuck out an airlock.”\n “That’s hardly a coincidence,” I snort. “It’d be next to impossible to find someone who didn’t—”\n Oh.\n The accusation hangs in the air like static electricity. Hakim waits for my defense.\n “You think the Chimp used this situation to—”\n “Used,” he says, “or invented.”\n “That’s insane. You saw it with your own eyes, you can still see—”\n “I saw models in a tank. I saw pixels on bulkheads. I never threw on a suit to go see for myself. You’d have to be suicidal, right?”\n He’s actually smiling.\n “They tried to break in,” I remind him.\n “Oh, I know something was pounding on the door. I’m just not sold on the idea that it was built by aliens.”\n “You think this whole thing was some kind of trick?” I shake my head in disbelief. “We’ll have surface access in a couple of weeks. Hell, just cut a hole into Fab right now, crawl out through one of the service tunnels. See for yourself.”\n “See what? A star off the stern?” He shrugs. “Red giants are common as dirt. Doesn’t mean the specs on this system were anywhere near as restrictive as Chimp says. Doesn’t mean we had to go through, doesn’t even mean we did. For all I know the Chimp had its bots strafing the hull with lasers and blowtorches for the past hundred years, slagging things down to look nice and convincing just in case I did pop out for a look-see.” Hakim shakes his head. “All I know is, it’s only had one meat sack in its corner since the mutiny, and he’s not much good if no one will talk to him. But how can you keep hating someone after he’s saved your life?”\n It astonishes me, the degree to which people torture reason. Just to protect their precious preconceptions.\n “The weird thing,” Hakim adds, almost to himself, “is that it worked.”\n It takes a moment for that to sink in.\n “Because I don’t think you were in on it,” he explains. “I don’t think you had a clue. How could you? You’re not even a whole person, you’re just a—a glorified subroutine. And subroutines don’t question their inputs. A thought pops into your head, you just assume it’s yours. You believe everything that miserable piece of hardware tells you, because you don’t have a choice. Maybe you never did.\n “How can I hate you for that?” he asks.\n I don’t answer, so he does: “I can’t. Not any more. I can only—”\n “Shut the fuck up,” I say, and turn my back.\n He leaves me then, leaves me surrounded by all these pixels and pictures he refuses to accept. He heads back to the crypt to join his friends. The sleeping dead. The weak links. Every last one of them would scuttle the mission, given half a chance.\n If it was up to me none of them would ever wake up again. But Chimp reminds me of the obvious: a mission built for aeons, the impossibility of anticipating even a fraction of the obstacles we’re bound to encounter. The need for flexibility, for the wet sloppy intelligence that long-dead engineers excluded from his architecture in the name of mission stability. Billions of years ahead of us, perhaps, and only a few thousand meat sacks to deal with the unexpected. There may not be enough of us as it is.\n And yet, with all that vaunted human intellect, Hakim can’t see the obvious. None of them can. I’m not even human to those humans. A subroutine, he says. A lobe in something else’s brain. But I don’t need his fucking pity. He’d realize that if he thought about it for more than a split-second, if he was willing to examine that mountain of unexamined assumptions he calls a worldview.\n He won’t, though. He refuses to look into the mirror long enough to see what’s looking back. He can’t even tell the difference between brain and brawn. The Chimp drives the ship; the Chimp builds the jump gates; the Chimp runs life support. We try to take the reins of our own destiny and it’s the Chimp who hammers us down.\n So the Chimp is in control. The Chimp is always in control; and when minds merge across this high-bandwidth link in my head, surely it will be the mech that absorbs the meat.\n It astonishes me that he can’t see the fallacy. He knows the Chimp’s synapse count as well as I do, but he’d rather fall back on prejudice than run the numbers.\n I’m not the Chimp’s subroutine at all.\n The Chimp is mine.\n Originally published in Extreme Planets,edited by David Conyers, David Kernot, and Jeff Harris, 2014.\n Peter Watts—author of Blindsight, Echopraxia, and the Rifters Trilogy, among other things—seems especially popular among people who don't know him. At least, he wins most of his awards overseas except for a Hugo (won thanks to fan outrage over an altercation with Homeland Security) a Jackson (won thanks to fan sympathy over nearly dying from flesh-eating disease), and a couple of dick-ass Canadian awards you've probably never heard of. Blindsight is a core text for university courses ranging from Philosophy to Neuropsychology, despite an unhealthy focus on space vampires. Watts's work is available in nineteen languages."}