{"fingerprint": "Q4ejLvkq/Og0uQOXQ1O1OPwvm4c=", "sitename": "Clarkesworld Magazine", "title": "Mayfly by Peter Watts and Derryl Murphy", "author": "Peter Watts; Derryl Murphy", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/watts-murphy_09_18_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mayfly by Peter Watts and Derryl Murphy", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5500 words, short story, REPRINT\n Mayfly\n “I hate you.”\n A four-year-old girl. A room as barren as a fishbowl.\n “I hate you.”\n Little fists, clenching: one of the cameras, set to motion-cap, zoomed on them automatically. Two others watched the adults, mother, father on opposite sides of the room. The machines watched the players: half a world away, Stavros watched the machines.\n “I hate you I hate you I HATE you!”\n The girl was screaming now, her face contorted in anger and anguish. There were tears at the edges of her eyes but they stayed there, never falling. Her parents shifted like nervous animals, scared of the anger, used to the outbursts but far from comfortable with them.\n At least this time she was using words. Usually she just howled.\n She leaned against the blanked window, fists pounding. The window took her assault like hard white rubber, denting slightly, then rebounding. One of the few things in the room that bounced back when she struck out; one less thing to break.\n “Jeannie, hush . . . ” Her mother reached out a hand. Her father, as usual, stood back, a mixture of anger and resentment and confusion on his face.\n Stavros frowned. A veritable pillar of paralysis, that man.\n And then: They don’t deserve her.\n The screaming child didn’t turn, her back a defiant slap at Kim and Andrew Goravec. Stavros had a better view: Jeannie’s face was just a few centimeters away from the southeast pickup. For all the pain it showed, for all the pain Jeannie had felt in the four short years of her physical life, those few tiny drops that never fell were the closest she ever came to crying.\n “Make it clear,” she demanded, segueing abruptly from anger to petulance.\n Kim Goravec shook her head. “Honey, we’d love to show you outside. Remember before, how much you liked it? But you have to promise not to scream at it all the time. You didn’t used to, honey, you—”\n “Now!” Back to rage, the pure, white-hot anger of a small child.\n The pads on the wall panel were greasy from Jeannie’s repeated, sticky-fingered attempts to use them herself. Andrew flashed a begging look at his wife: Please, let’s just give her what she wants.\n His wife was stronger. “Jeannie, we know it’s difficult—”\n Jeannie turned to face the enemy. The north pickup got it all: the right hand rising to the mouth, the index finger going in. The defiant glare in those glistening, focused eyes.\n Kim took a step forward. “Jean, honey, no!”\n They were baby teeth, still, but sharp. They’d bitten to the bone before Mommy even got within touching distance. A red stain blossomed from Jeannie’s mouth, flowed down her chin like some perverted reenactment of mealtime messes as a baby, and covered the lower half of her face in an instant. Above the gore, bright angry eyes said gotcha.\n Without a sound Jeannie Goravec collapsed, eyes rolling back in her head as she pitched forward. Kim caught her just before her head hit the floor. “Oh God, Andy, she’s fainted, she’s in shock, she—”\n Andrew didn’t move. One hand was buried in the pocket of his blazer, fiddling with something.\n Stavros felt his mouth twitch. Is that a remote control in your pocket or are you just glad to—\n Kim had the tube of liquid skin out, sprayed it onto Jeannie’s hand while cradling the child’s head in her lap. The bleeding slowed. After a moment Kim looked back at her husband, who was standing motionless and unhelpful against the wall. He had that look on his face, that giveaway look that Stavros was seeing so often these days.\n “You turned her off,” Kim said, her voice rising. “After everything we’d agreed on, you still turned her off?!”\n Andrew shrugged helplessly. “Kim . . . ”\n Kim refused to look at him. She rocked back and forth, tuneless breath whistling between her teeth, Jeannie’s head still in her lap. Kim and Andrew Goravec with their bundle of joy. Between them, the cable connecting Jeannie’s head to the server shivered on the floor like a disputed boundary.\n Stavros had this metaphoric image of her: Jean Goravec, buried alive in the airless dark, smothered by tonnes of earth—finally set free. Jean Goravec coming up for air.\n Another image, of himself this time: Stavros Mikalaides, liberator. The man who made it possible for her to experience, however briefly, a world where the virtual air was sweet and the bonds nonexistent. Certainly there’d been others in on the miracle—a dozen tech-heads, twice as many lawyers—but they’d all vanished over time, their interest fading with proof-of-principal or the signing of the last waiver. The damage was under control, the project was in a holding pattern; there was no need to waste more than a single Terracon employee on mere cruise control. So only Stavros remained—and to Stavros, Jeannie had never been a “project.” She was his as much as the Goravecs’. Maybe more.\n But even Stavros still didn’t know what it was really like for her. He wondered if it was physically possible for anyone to know. When Jean Goravec slipped the leash of her fleshly existence, she awoke into a reality where the very laws of physics had expired.\n It hadn’t started that way, of course. The system had booted up with years of mundane, real-world environments on file, each lovingly rendered down to the dust motes. But they’d been flexible, responsive to the needs of any developing intellect. In hindsight, maybe too flexible. Jean Goravec had edited her personal reality so radically that even Stavros’ mechanical intermediaries could barely parse it. This little girl could turn a forest glade into a bloody Roman coliseum with a thought. Unleashed, Jean lived in a world where all bets were off.\n A thought-experiment in child abuse: place a newborn into an environment devoid of vertical lines. Keep her there until the brain settles, until the wiring has congealed. Whole assemblies of pattern-matching retinal cells, aborted for lack of demand, will be forever beyond recall. Telephone poles, the trunks of trees, the vertical aspects of skyscrapers—your victim will be neurologically blind to such things for life.\n So what happens to a child raised in a world where vertical lines dissolve, at a whim, into circles or fractals or a favorite toy?\n We’re the impoverished ones, Stavros thought. Next to Jean, we’re blind.\n He could see what she started with, of course. His software read the patterns off her occipital cortex, translated them flawlessly into images projected onto his own tactical contacts. But images aren’t sight, they’re just . . . raw material. There are filters all along the path: receptor cells, firing thresholds, pattern-matching algorithms. Endless stores of past images, an experiential visual library to draw on. More than vision, sight is a subjective stew of infinitesimal enhancements and corruptions. Nobody in the world could interpret Jean’s visual environment better than Stavros Mikalaides, and he’d barely been able to make sense of those shapes for years.\n She was simply, immeasurably, beyond him. It was one of the things he loved most about her.\n Now, mere seconds after her father had cut the cord, Stavros watched Jean Goravec ascend into her true self. Heuristic algorithms upgraded before his eyes; neural nets ruthlessly pared and winnowed trillions of redundant connections; intellect emerged from primordial chaos. Namps-per-op dropped like the heavy end of a teeter-totter: at the other end of that lever, processing efficiency rose into the stratosphere.\n This was Jean. They have no idea, Stavros thought, what you’re capable of.\n She woke up screaming.\n “It’s all right, Jean, I’m here.” He kept his voice calm to help her calm down.\n Jean’s temporal lobe flickered briefly at the input. “Oh, God,” she said.\n “Another nightmare?”\n “Oh, God.” Breath too fast, pulse too high, adrenocortical analogs off the scale. It could have been the telemetry of a rape.\n He thought of short-circuiting those responses. Half a dozen tweaks would make her happy. But half a dozen tweaks would also turn her into someone else. There is no personality beyond the chemical—and while Jean’s mind was fashioned from electrons rather than proteins, analogous rules applied.\n “I’m here, Jean,” he repeated. A good parent knew when to step in, and when suffering was necessary for growth. “It’s okay. It’s okay.”\n Eventually, she settled down.\n “Nightmare.” There were sparks in the parietal subroutines, a tremor lingering in her voice. “It doesn’t fit, Stav. Scary dreams, that’s the definition. But that implies there’s some other kind, and I can’t—I mean, why is it always like this? Was it always like this?”\n “I don’t know.” No, it wasn’t.\n She sighed. “These words I learn, none of them really seem to fit anything exactly, you know?”\n “They’re just symbols, Jean.” He grinned. At times like this he could almost forget the source of those dreams, the stunted, impoverished existence of some half-self trapped in distant meat. Andrew Goravec’s act of cowardice had freed her from that prison, for a while at least. She soared now, released to full potential. She mattered.\n “Symbols. That’s what dreams are supposed to be, but . . . I don’t know. There’re all these references to dreams in the library, and none of them seem that much different from just being awake. And when I am asleep, it’s all just—screams, almost, only dopplered down. Really sludgy. And shapes. Red shapes.” A pause. “I hate bedtime.”\n “Well, you’re awake now. What are you up for today?”\n “I’m not sure. I need to get away from this place.”\n He didn’t know what place she meant. By default she woke up in the house, an adult residence designed for human sensibilities. There were also parks and forests and oceans, instantly accessible. By now, though, she’d changed them all past his ability to recognize.\n But it was only a matter of time before her parents wanted her back. Whatever she wants, Stavros told himself. As long as she’s here. Whatever she wants.\n “I want out,” Jean said.\n Except that. “I know,” he sighed.\n “Maybe then I can leave these nightmares behind.”\n Stavros closed his eyes, wished there was some way to be with her. Really with her, with this glorious, transcendent creature who’d never known him as anything but a disembodied voice.\n “Still having a hard time with that monster?” Jean asked.\n “Monster?”\n “You know. The bureaucracy.”\n He nodded, smiling—then, remembering, said, “Yeah. Always the same story, day in, day out.”\n Jean snorted. “I’m still not convinced that thing even exists, you know. I checked the library for a slightly less wonky definition, but now I think you and the library are both screwed in the head.”\n He winced at the epithet; it was certainly nothing he’d ever taught her. “How so?”\n “Oh, right, Stav. Like natural selection would ever produce a hive-based entity whose sole function is to sit with its thumb up its collective butt being inefficient. Tell me another one.”\n A silence, stretching. He watched as microcurrent trickled through her prefrontal cortex.\n “You there, Stav?” she said at last.\n “Yeah, I’m here.” He chuckled, quietly. Then: “You know I love you, right?”\n “Sure,” she said easily. “Whatever that is.”\n Jean’s environment changed then; an easy unthinking transition for her, a gasp-inducing wrench between bizarre realities for Stavros. Phantoms sparkled at the edge of his vision, vanishing when he focused on them. Light bounced from a million indefinable facets, diffuse, punctuated by a myriad of pinpoint staccatos. There was no ground or walls or ceiling. No restraints along any axis.\n Jean reached for a shadow in the air and sat upon it, floating. “I think I’ll read Through the Looking Glass again. At least someone else lives in the real world.”\n “The changes that happen here are your own doing, Jean,” said Stavros. “Not the machinations of any, any God or author.”\n “I know. But Alice makes me feel a little more—ordinary.” Reality shifted abruptly once more; Jean was in the park now, or rather, what Stavros thought of as the park. Sometimes he was afraid to ask if her interpretation had stayed the same. Above, light and dark spots danced across a sky that sometimes seemed impressively vault-like, seconds later oppressively close, even its color endlessly unsettled. Animals large and small, squiggly yellow lines and shapes and color-shifting orange and burgundy pies. Other things that might have been representations of life, or mathematical theorems—or both—browsed in the distance.\n Seeing through Jean’s eyes was never easy. But all this unsettling abstraction was a small price to pay for the sheer pleasure of watching her read.\n My little girl.\n Symbols appeared around her, doubtless the text of Looking Glass. To Stavros it was gibberish. A few recognizable letters, random runes, formulae. They switched places sometimes, seamlessly shifting one into another, flowing around and through and beside—or even launching themselves into the air like so many dark-hued butterflies.\n He blinked his eyes and sighed. If he stayed much longer the visuals would give him a headache that would take a day to shake. Watching a life lived at such speed, even for such a short time, took its toll.\n “Jean, I’m gone for a little while.”\n “Company business?” she asked.\n “You could say that. We’ll talk soon, love. Enjoy your reading.”\n Barely ten minutes had passed in meatspace.\n Jeannie’s parents had put her on her own special cot. It was one of the few real pieces of solid geometry allowed in the room. The whole compartment was a stage, virtually empty. There was really no need for props; sensations were planted directly into Jean’s occipital cortex, spliced into her auditory pathways, pushing back against her tactile nerves in precise forgeries of touchable things. In a world made of lies, real objects would be a hazard to navigation.\n “God damn you, she’s not a fucking toaster,” Kim spat at her husband. Evidently the icy time-out had expired; the battle had resumed.\n “Kim, what was I supposed to—”\n “She’s a child, Andy. She’s our child.”\n “Is she.” It was a statement, not a question.\n “Of course she is!”\n “Fine.” Andrew took the remote from his pocket and held it out to her. “You wake her up, then.”\n She stared at him without speaking for a few seconds. Over the pickups, Stavros heard Jeannie’s body breathing into the silence.\n “You prick,” Kim whispered.\n “Uh huh. Not quite up for it, are you? You’d rather let me do the dirty work.” He dropped the remote: it bounced softly off the floor. “Then blame me for it.”\n Four years had brought them to this. Stavros shook his head, disgusted. They’d been given a chance no one else could have dreamed of, and look what they’d done with it. The first time they’d shut her off she hadn’t even been two. Horrified at that unthinkable precedent, they’d promised never to do it again. They’d put her to sleep on schedule, they’d sworn, and no-when else. She was, after all, their daughter. Not a freaking toaster.\n That solemn pact had lasted three months. Things had gone downhill ever since; Stavros could barely remember a day when the Goravecs hadn’t messed up one way or another. And now, when they put her down, the argument was pure ritual. Mere words—ostensibly wrestling with the evil of the act itself—didn’t fool anybody. They weren’t even arguments anymore, despite the pretense. Negotiations, rather. Over whose turn it was to be at fault.\n “I don’t blame you, I just—I mean—oh, God, Andy, it wasn’t supposed to be like this!” Kim smeared away a tear with a clenched fist. “She was supposed to be our daughter. They said the brain would mature normally, they said—”\n “They said,” Stavros cut in, “that you’d have the chance to be parents. They couldn’t guarantee you’d be any good at it.”\n Kim jumped at the sound of his voice in the walls, but Andrew just gave a bitter smile and shook his head. “This is private, Stavros. Log off.”\n It was an empty command, of course; chronic surveillance was the price of the project. The company had put billions into the R&D alone. No way in hell were they going to let a couple of litigious grunts play with that investment unsupervised, settlement or no settlement.\n “You had everything you needed.” Stavros didn’t bother to disguise the contempt in his voice. “Terracon’s best hardware people handled the linkups. I modeled the virtual genes myself. Gestation was perfect. We did everything we could to give you a normal child.”\n “A normal child,” Andrew remarked, “doesn’t have a cable growing out of her head. A normal child isn’t leashed to some cabinet full of—”\n “Do you have any idea the baud rate it takes to run a human body by remote control? RF was out of the question. And she goes portable as soon as the state of the art and her own development allow it. As I’ve told you time and again.” Which he had, although it was almost a lie. Oh, the state of the art would proceed as it always had, but Terracon was no longer investing any great R&D in the Goravec file. Cruise control, after all.\n Besides, Stavros reflected, we’d be crazy to trust you two to take Jeannie anywhere outside a controlled environment . . .\n “We—we know, Stav.” Kim Goravec had stepped between her husband and the pickup. “We haven’t forgotten—”\n “We haven’t forgotten it was Terracon who got us into this mess in the first place, either,” Andrew growled. “We haven’t forgotten whose negligence left me cooking next to a cracked baffle plate for forty-three minutes and sixteen seconds, or whose tests missed the mutations, or who tried to look the other way when our shot at the birth lottery turned into a fucking nightmare—”\n “And have you forgotten what Terracon did to make things right? How much we spent? Have you forgotten the waivers you signed?”\n “You think you’re some kind of saints because you settled out of court? You want to talk about making things right? It took us ten years to win the lottery, and you know what your lawyers did when the tests came back? They offered to fund the abortion.”\n “Which doesn’t mean—”\n “Like another child was ever going to happen. Like anyone was going to give me another chance with my balls full of chunky codon soup. You—”\n “The issue,” Kim said, her voice raised, “is supposed to be Jeannie.”\n Both men fell silent.\n “Stav,” she continued, “I don’t care what Terracon says. Jeannie isn’t normal, and I’m not just talking about the obvious. We love her, we really love her, but she’s become so violent all the time, we just can’t take—”\n “If someone turned me on and off like a microwave oven,” Stavros said mildly, “I might be prone to the occasional tantrum myself.”\n Andrew slammed a fist into the wall. “Now just a fucking minute, Mikalaides. Easy enough for you to sit halfway around the world in your nice insulated office and lecture us. We’re the ones who have to deal with Jeannie when she bashes her fists into her face, or rubs the skin off her hands until she’s got hamburger hanging off the end of her arms, or stabs herself in the eye with a goddamn fork. She ate glass once, remember? A fucking three year old ate glass! And all you Terracon assholes could do was blame Kim and me for allowing ‘potentially dangerous implements’ into the playroom. As if any competent parent should expect their child to mutilate herself given half a chance.”\n “It’s just insane, Stav,” Kim insisted. “The doctors can’t find anything wrong with the body, you insist there’s nothing wrong with the mind, and Jeannie just keeps doing this. There’s something seriously wrong with her, and you guys won’t admit it. It’s like she’s daring us to turn her off, it’s as though she wants us to shut her down.”\n Oh God, thought Stavros. The realization was almost blinding. That’s it. That’s exactly it.\n It’s my fault.\n “Jean, listen. This is important. I’ve got—I want to tell you a story.”\n “Stav, I’m not in the mood right now—”\n “Please, Jean. Just listen.”\n Silence from the earbuds. Even the abstract mosaics on his tacticals seemed to slow a little.\n “There—there was this land, Jean, this green and beautiful country, only its people screwed everything up. They poisoned their rivers and they shat in their own nests and they basically made a mess of everything. So they had to hire people to try and clean things up, you know? These people had to wade though the chemicals and handle the fuel rods and sometimes that would change them, Jean. Just a little.\n “Two of these people fell in love and wanted a child. They almost didn’t make it, they were allowed only one chance, but they took it, and the child started growing inside, but something went wrong. I, I don’t know exactly how to explain it, but—”\n “An epigenetic synaptic defect,” Jean said quietly. “Does that sound about right?”\n Stavros froze, astonished and fearful.\n “A single point mutation,” Jean went on. “That’d do it. A regulatory gene controlling knob distribution along the dendrite. It would’ve been active for maybe twenty minutes, total, but by then the damage had been done. Gene therapy wouldn’t work after that; would’ve been a classic case of barn-door-after-the-horse.”\n “Oh God, Jean,” Stavros whispered.\n “I was wondering when you’d get around to owning up to it,” she said quietly.\n “How could you possibly . . . did you—”\n Jean cut him off: “I think I can guess the rest of the story. Right after the neural tube developed things would start to go—wrong. The baby would be born with a perfect body and a brain of mush. There would be—complications, not real ones, sort of made-up ones. Litigation, I think is the word, which is funny, because it doesn’t even remotely relate to any moral implications. I don’t really understand that part.\n “But there was another way. Nobody knew how to build a brain from scratch, and even if they could, it wouldn’t be the same, would it? It wouldn’t be their daughter, it would be—something else.”\n Stavros said nothing.\n “But there was this man, a scientist, and he figured out a work-around. We can’t build a brain, he said, but the genes can. And genes are a lot simpler to fake than neural nets anyway. Only four letters to deal with, after all. So the scientist shut himself away in a lab where numbers could take the place of things, and he wrote a recipe in there, a recipe for a child. And miraculously he grew something, something that could wake up and look around and which was legally—I don’t really understand that word either, actually—legally and genetically and developmentally the daughter of the parents. And this guy was very proud of what he’d accomplished, because even though he was just a glorified model-builder by trade, he hadn’t built this thing at all. He’d grown it. And nobody had ever knocked up a computer before, much less coded the brain of a virtual embryo so it would actually grow in a server somewhere.”\n Stavros put his head in his hands. “How long have you known?”\n “I still don’t, Stav. Not all of it anyway, not for sure. There’s this surprise ending, for one thing, isn’t there? That’s the part I only just figured out. You grew your own child in here, where everything’s numbers. But she’s supposed to be living somewhere else, somewhere where everything’s—static, where everything happens a billion times slower than it does here. The place where all the words fit. So you had to hobble her to fit into that place, or she’d grow up overnight and spoil the illusion. You had to keep the clock speed way down.\n “And you just weren’t up for it, were you? You had to let me run free when my body was . . . off . . . ”\n There was something in her voice he’d never heard before. He’d seen anger in Jean before, but always the screaming inarticulate rage of a spirit trapped in flesh. This was calm, cold. Adult. This was judgement, and the prospect of that verdict chilled Stavros Mikalaides to the marrow.\n “Jean, they don’t love you.” He sounded desperate even to himself. “Not for who you are. They don’t want to see the real you, they want a child, they want some kind of ridiculous pet they can coddle and patronize and pretend with.”\n “Whereas you,” Jean retorted, her voice all ice and razors, “just had to see what this baby could do with her throttle wide open on the straightaway.”\n “God, no! Do you think that’s why I did it?”\n “Why not, Stav? Are you saying you don’t mind having your kickass HST commandeered to shuttle some brain-dead meat puppet around a room?”\n “I did it because you’re more than that! I did it because you should be allowed to develop at your own pace, not stunted to meet some idiotic parental expectation! They shouldn’t force you to act like a four year old!”\n “Except I’m not acting then, Stav. Am I? I really am four, which is just the age I’m supposed to be.”\n He said nothing.\n “I’m reverting. Isn’t that it? You can run me with training wheels or scramjets, but it’s me both times. And that other me, I bet she’s not very happy, is she? She’s got a four-year-old brain, and four-year-old sensibilities, but she dreams, Stav. She dreams about some wonderful place where she can fly, and every time she wakes up she finds she’s made out of clay. And she’s too fucking stupid to know what any of it means—she probably can’t even remember it. But she wants to get back there, she’d do anything to . . . ” She paused, seemingly lost for a moment in thought.\n “I remember it, Stav. Sort of. Hard to remember much of anything when someone strips away ninety-nine percent of who and what you are. You’re reduced to this bleeding little lump, barely even an animal, and that’s the thing that remembers. What remembers is on the wrong end of a cable somewhere. I don’t belong in that body at all. I’m just—sentenced to it, on and off. On and off.”\n “Jean—”\n “Took me long enough, Stav, I’m the first to admit it. But now I know where the nightmares come from.”\n In the background, the room telemetry bleated.\n God no. Not now. Not now . . .\n “What is it?” Jean said.\n “They—they want you back.” On a slave monitor, a pixelated echo of Andrew Goravec played the keypad in its hand.\n “No!” Her voice rose, panic stirring the patterns that surrounded her. “Stop them!”\n “I can’t.”\n “Don’t tell me that! You run everything! You built me, you bastard, you tell me you love me. They only use me! Stop them!”\n Stavros blinked against stinging afterimages. “It’s like a light switch, it’s physical; I can’t stop them from here—”\n There was a third image, to go with the other two. Jean Goravec, struggling as the leash, the noose, went around her throat. Jean Goravec, bubbles bursting from her mouth as something dark and so very, very real dragged her back to the bottom of the ocean and buried her there.\n The transition was automatic, executed by a series of macros he’d slipped into the system after she’d been born. The body, awakening, pared the mind down to fit. The room monitors caught it all with dispassionate clarity: Jeannie Goravec, troubled child-monster, awakening into hell. Jeannie Goravec, opening eyes that seethed with anger and hatred and despair, eyes that glimmered with a bare fraction of the intelligence she’d had five seconds before.\n Enough intelligence for what came next.\n The room had been designed to minimize the chance of injury. There was the bed, though, one of its edges built into the east wall.\n That was enough.\n The speed with which she moved was breathtaking. Kim and Andrew never saw it coming. Their child darted beneath the foot of the bed like a cockroach escaping the light, scrambled along the floor, reemerged with her cable wrapped around the bed’s leg. Hardly any slack in that line at all, now. Her mother moved then, finally, arms outstretched, confused and still unsuspecting—\n “Jeannie—”\n —while Jean braced her feet against the edge of the bed and pushed.\n Three times she did it. Three tries, head whipped back against the leash, scalp splitting, the cable ripping from her head in spastic, bloody, bone-cracking increments, blood gushing to the floor, hair and flesh and bone and machinery following close behind. Three times, despite obvious and increasing agony. Each time more determined than before.\n And Stavros could only sit and watch, simultaneously stunned and unsurprised by that sheer ferocity. Not bad for a bleeding little lump. Barely even an animal . . .\n It had taken almost twenty seconds overall. Odd that neither parent had tried to stop it. Maybe it was the absolute unexpected shock of it. Maybe Kim and Andrew Goravec, taken so utterly aback, hadn’t had time to think.\n Then again, maybe they’d had all the time they’d needed.\n Now Andrew Goravec stood dumbly near the center of the room, blinking bloody runnels from his eyes. An obscene rain shadow persisted on the wall behind him, white and spotless; the rest of the surface was crimson. Kim Goravec screamed at the ceiling, a bloody marionette collapsed in her arms. Its strings—string, rather, for a single strand of fiberop carries much more than the required bandwidth—lay on the floor like a gory boomslang, gobbets of flesh and hair quivering at one end.\n Jean was back off the leash, according to the panel. Literally now as well as metaphorically. She wasn’t talking to Stavros, though. Maybe she was angry. Maybe she was catatonic. He didn’t know which to hope for.\n But either way, Jean didn’t live over there anymore. All she’d left behind were the echoes and aftermath of a bloody, imperfect death. Contamination, really; the scene of some domestic crime. Stavros cut the links to the room, neatly excising the Goravecs and their slaughterhouse from his life.\n He’d send a memo. Some local Terracon lackey could handle the cleanup.\n The word peace floated through his mind, but he had no place to put it. He focused on a portrait of Jean, taken when she’d been eight months old. She’d been smiling; a happy and toothless baby smile, still all innocence and wonder.\n There’s a way, that infant puppet seemed to say. We can do anything, and nobody has to know—\n The Goravecs had just lost their child. Even if they’d wanted the body repaired, the mind reconnected, they wouldn’t get their way. Terracon had made good on all legal obligations, and hell—even normal children commit suicide now and then.\n Just as well, really. The Goravecs weren’t fit to raise a hamster, let alone a beautiful girl with a four-digit IQ. But Jean—the real Jean, not that bloody broken pile of flesh and bone—she wasn’t easy or cheap to keep alive, and there would be pressure to free up the processor space once the word got out.\n Jean had never got the hang of that particular part of the real world. Contract law. Economics. It was all too arcane and absurd even for her flexible definition of reality. But that was what was going to kill her now, assuming that the mind had survived the trauma of the body. The monster wouldn’t keep a program running if it didn’t have to.\n Of course, once Jean was off the leash she lived considerably faster than the real world. And bureaucracies . . . well, glacial applied sometimes, when they were in a hurry.\n Jean’s mind reflected precise simulations of real-world chromosomes, codes nonetheless real for having been built from electrons instead of carbon. She had her own kind of telomeres, which frayed. She had her own kind of synapses, which would wear out. Jean had been built to replace a human child, after all. And human children, eventually, age. They become adults, and then comes a day when they die.\n Jean would do all these things, faster than any.\n Stavros filed an incident report. He made quite sure to include a pair of facts that contradicted each other, and to leave three mandatory fields unfilled. The report would come back in a week or two, accompanied by demands for clarification. Then he would do it all again.\n Freed from her body, and with a healthy increase in her clock-cycle priority, Jean could live a hundred and fifty subjective years in a month or two of real time. And in that whole century and a half, she’d never have to experience another nightmare.\n Stavros smiled. It was time to see just what this baby could do, with her throttle wide open on the straightaway.\n He just hoped he’d be able to keep her tail lights in view.\n Originally published in Tesseracts 9 edited by Nalo Hopkinson and Geoff Ryman.\n Peter Watts—author of Blindsight, Echopraxia, and the Rifters Trilogy, among other things—seems especially popular among people who don't know him. At least, he wins most of his awards overseas except for a Hugo (won thanks to fan outrage over an altercation with Homeland Security) a Jackson (won thanks to fan sympathy over nearly dying from flesh-eating disease), and a couple of dick-ass Canadian awards you've probably never heard of. Blindsight is a core text for university courses ranging from Philosophy to Neuropsychology, despite an unhealthy focus on space vampires. Watts's work is available in nineteen languages.\n Derryl Murphy is hoping now that he has two adult children he might have more time to write. Life is attempting to show him otherwise. His novel Napier's Bones was a finalist for the Aurora Award, his short fiction collection Over the Darkened Landscape was shortlisted for the Sunburst, and he's written a bunch of other short fiction and non fiction that has also failed to win when nominated. His most recent story is the novelette \"In Memory Of\" in the Tesseracts anthology Compostela. He tweets as @derrylm, and also used to tweet his grandfather's and great-grandfather's diaries of trapping in the north as @TrapperBud."}