{"fingerprint": "wT53rCrqLTrAMKvZNfVvZaStcQg=", "sitename": "Clarkesworld Magazine", "title": "Human Nature: A Conversation with Peter Watts by Julie Nováková", "author": "Julie Nováková", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/watts_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Human Nature: A Conversation with Peter Watts by Julie Nováková", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Human Nature: A Conversation with Peter Watts\n Deep sea, deep space, and deep dark corners of the human mind—these are some of the domains in which Peter Watts truly excels. His Hugo-nominated novel Blindsight opens with the main character trapped in a shuttle, reminiscing, escaping . . . from what? As we dive into the story, we encounter one question after another, all of them fascinating and urging us forward.\n At the end, with his readers awe-struck and hungry, Watts leaves more questions than answers. Some of them might be addressed in his soon to be published novel Echopraxia, which is a sequel to Blindsight, but other, even more profound questions will without a doubt stem from the answers. Peter Watts is a master of thought experiments. That much was apparent even from his earliest short fiction in the nineties.\n Being a marine biologist by study, Watts set his first novel Starfish three kilometers below the sea surface to a rift in the Juan de Fuca subduction zone. But in this deep-sea environment, something is different, and it’s not only the strange outcast crew of Beebe Station. The success of Starfish was followed by publishing the two next books of the Rifters trilogy, Maelstrom and Behemoth.\n However, Watts isn’t at home just in the deep sea—deep space, be it the edge of the solar system in Blindsight or vastly distant stars like in the Hugo-winning novelette “The Island,” is another environment he can depict so convincingly we can almost see the wonders of cosmos and the strange alien life forms before our own eyes. Watts’s aliens have been often praised for being truly alien and at the same time very believable. His insight into an alien’s mind in The Things, published here in 2010, led to another Hugo nomination. Peter Watts’s fiction is full of brilliant ideas, the kind that urges us to ask: What if?\n A friend of mine once commented about Watts: “He thinks of really interesting things.”\n It’s a simple statement but also a very accurate one. Let me introduce you the man who thinks interesting things.\n Your upcoming novel Echopraxia is a sequel to Blindsight, taking us inwards the Solar System to the Icarus Array this time. Have you already had an idea for this story when you were writing Blindsight?\n You know, I’m not entirely sure. It’s natural, in the course of writing a novel, to mull over what might happen after the last page—so in that vague sense I was certainly thinking of a follow-up. At the same time, I knew that Blindsight would be a hell of a hard act to follow, whether or not it was any good in terms of literary merit. The thematic question of consciousness vs. intelligence is pretty fundamental to the human condition; what the hell do you do for an encore?\n So while I was idly contemplating the idea of a sequel, the book I really expected to write after Blindsight was a near-future technothriller. It would have been a complete change of pace, and whether people loved it or hated it they’d be less inclined to compare it to Blindsight because it would have been so obviously a different creature. A straight-up sequel would, I thought, have a much harder time getting out from the shadow of its predecessor.\n So what happened? I pitched about five different proposals to my agent, and he said the Blindsight sequel was head and shoulders above the others. And here we are.\n Judging from the snippets you posted on your blog, Echopraxia seems to me that it won’t have a hard time fulfilling high expectations.\n Yeah, well, it’s not as though I posted any of the crappy bits. Those snippets were probably high-graded.\n Besides the prospects of meeting Siri Keeton’s dad as one of the main characters and learning more about vampires and their role in the society, I was deeply intrigued by the Bicameral Order—a religious group whose predictions exceed those of science. Can you give us some hints about the methods they use, or their ideology and aims?\n Hints. Hmmm.\n The Dharmic faiths—you know, that school of thought that somehow, centuries ago, managed without benefit of MRI or TMS to figure out that all sensation, that the self itself, is an illusion—those Dharmic faiths were the mother of the modern Bicameral Order. (Neuroscience was the father; it was a winter-spring relationship.) But the Bicams aren’t really a religious order in the conventional sense, except insofar as their origins trace back to those ancient faiths. Oh, and also in the sense that they undergo religious experiences—the so-called “rapture”—in the course of their work.\n Then again, that whole transcendence/speaking-in-tongues thing happens when the part of the brain responsible for mapping body parts and boundaries fucks up. The mind loses its sense of where the body ends and the rest of the universe begins, so it literally ends up feeling connected to all of creation. The Bicams experience that because they’re members of a hive mind. Sharing sensory systems, linking minds one to another—such connections really do dissolve the boundaries between bodies. So for them, religious rapture is an unavoidable side effect of networked existence.\n Oh, and I guess they’re also a religious order in the sense that they’re faith-based—but faith has a very specific meaning here. There are certain sublevels of reality which are, even in principle, immune to empirical investigation. Anything below the Planck length gets very iffy; you can conjecture and model and hypothesize all you like, but as long as there’s no way to test those conjectures you’re not talking conventional science. (The various flavors of string and brane theory are regarded by many as philosophy, not science, for exactly that reason.) The Bicamerals have—at enormous personal cost, as it turns out—rewired themselves to explore reality past those limits, and the proof of their methodology is that they own half the patent office by the time Echopraxia opens. But it’s not a scientific methodology. It can’t be, by definition. We don’t really have a word for what they do; but faith comes closest.\n They’re also a religious order in the sense that they believe in God. But that’s not just faith: they have their reasons. Know your enemy and all that.\n I guess maybe they’re pretty religious after all.\n You often explore topics related in many ways to religion in your works. When you mentioned the near-future technothriller, were you talking about your other upcoming project, Intelligent Design? Can you give away a little of what can we be looking forward to in this novel?\n Well, yes, the title cuts two ways; I see the novel as both a straight-ahead Wattsian thought experiment (albeit hopefully more accessible than some of my previous efforts), and as a kind of metacommentary on the arguments of the IDiots who keep trying to sneak creationism into science classes. But in terms of what you can look forward to? You can look forward fifteen or twenty years to an ice-free Arctic, remote-controlled feral lobsters, genetically-engineered giant squid, submarine skirmishes between the US and Canada over wellheads on the Beaufort Shelf, and sentient money.\n Assuming the damn thing even gets off the ground. And if “looking forward” is the right term.\n Your novels tend to be elaborately structured in order to express innovatory ideas, especially Blindsight, where you modeled each of the central characters to reflect some part of consciousness. When you start writing a novel, do you have a highly detailed outline to which you try to stick or just a short synopsis, or do you use some different approach altogether?\n That first thing—Cory Doctorow once said I didn’t write outlines so much as “novels without dialog”—but it never works out. I usually get somewhere between halfway and three-quarters done before I realize that Plot Point C contradicts Plot Point G, or some new scientific discovery trashes some vital bit of narrative tech I’ve rested half the story on. At which point I pretty much have to throw away the outline and start flying by the seat of my pants, stitching up the seams in the crotch as they split.\n Speaking of scientific discoveries requiring changing the story, you’ve repeatedly mentioned that you don’t think that being a scientist is a good prerequisite for being a good science fiction writer. Since scientists are often trained by peer-reviewers’ responses to use unnecessarily difficult writing in their papers, it often tends to make the work seem more complicated.\n Yet, more scientists are trying to express their findings as simply as possible and even don’t fear using humor (For example, I recently saw a sub-title: The good, the bad, and the ungulate). Do you think it’s getting better or are these just exceptions?\n My sense is, things are getting better. The use of personal pronouns, which was verboten back when I was going through grad school, is pretty common in the technical literature these days. It’s not uncommon for research papers in journals to be chaperoned by relatively nontechnical summary articles aimed at the nonspecialist (though perhaps still not accessible to Josephine SixPack).\n Hell, Nature regularly publishes science fiction. I can cite studies demonstrating a strong correlation between bafflegab and publication—one shows that the more opaque the writing style, the more prestigious the journal in which the paper ultimately appears—but those are all over a decade old by now. I don’t know if their findings are still relevant.\n In fact, the pendulum may be swinging too far in the other direction, what with scientists bending over backwards to “reach out” and “communicate with the masses.” I hear this refrain with increasing frequency: it’s scientists who are at least partly to blame for the public’s skepticism over evolution and climate change and vaccination, because they don’t try hard enough to communicate their findings to the general public. (Neil deGrasse Tyson is one of many who toe this line.)\n I don’t buy that. It’s been pretty firmly established that Human Nature is so rife with Confirmation Biases and Backfire Effects that even if you present someone with ironclad, irrefutable, expert evidence that their cherished beliefs are wrong, they’ll just dig in their heels and clutch those beliefs even closer to their bosoms (bosa? bosii?), while at the same time vilifying the expert who contradicted them. It’s not that they don’t understand the arguments; it’s just that they’ll reject anything that’s inconsistent with their preferred worldview.\n So what we seem to be getting is an increased dumbing-down of complex scientific issues to pander to people who read at a grade-three level. Scientific American turned into Psychology Today sometime when I wasn’t looking. Psychology Today turned into the fucking National Enquirer. The internet slowly fills with TED talks rife with charismatic delivery and vacuous content. And people still don’t give a shit about climate change.\n That’s one of the most discussed problems in science—should scientists try harder to educate the public, or is it a wasted effort? I personally hope it isn’t though the evidence points elsewhere. Another problem—in fact, the one that drove you out of academic science in the mid-90s—is the politicization of science. Do you think the situation has in any way improved over time? After all, the policy of science publishing seems to be changing with more open-access publishing and demands for clear acknowledgment of any competing interests along with making used datasets accessible to everyone. Do you consider this a good trend?\n If that is in fact the trend, then yes. I approve. I’ll have to take your word on that score, though; I haven’t been keeping close track since I left academia myself, so whenever the issue pokes through onto my radar it’s generally in relation to some so-called “scandal” in which Republican ideologues demand endless transcripts and e-mails of political enemies in an attempt to stifle scientific research (the Virginia attorney general’s harassment of Michael Mann is a particularly clear-cut example).\n I don’t consider that a particularly good trend.\n Daniel Brüks, the protagonist of Echopraxia, is a scientist too; a field biologist, a living fossil in his time, if I may cite from the official synopsis. Do you think that field work will become redundant soon or will there be a use for it centuries from now?\n Here’s a couple of snippets from Echopraxia that address that:\n \n Physics, officially. Cosmology. High-energy stuff. But it was all supposed to be theoretical; as far as Brüks knew the Bicameral Order didn’t perform actual experiments. Of course, hardly anyone did, these days. It was machines that scanned the heavens, machines that probed the space between atoms, machines that asked the questions and designed the experiments to answer them. All that was left for mere meat, apparently, was navel-gazing: to sit in the desert and contemplate whatever answers those machines served up. Although most still preferred to call it analysis.\n \n and\n \n “No, I mean, what were you even doing out in the field? There any species even left out there that haven’t been RAMrodded and digitized?”\n “The extinct ones,” Brüks said shortly. Then, relenting: “Sure, you can virtualize anything in the lab. Still doesn’t tell you what it’s doing out in the wide wet world with a million unpredictable variables working on it.”\n \n We’re already going down that road: for years now, mathematicians have been using automated “proof assistants” that presume to test and verify theorems—but we have to take their word for it, because apparently their automated analyses are opaque to human understanding. Science itself is becoming an act of faith.\n That said, whether Brüks is right about the value of field work depends largely on how long it takes before Moore’s Law lets us model those “million unpredictable variables” in electrons. I’ll hazard no guesses as to how long that’s likely to take.\n Regarding predictions of future (though it’s not the purpose of science fiction), many of your science fictional ideas had acquired their real-world analogs quite quickly (“head cheeses,” outside metabolism, guilt-response-modulating drugs, deep-sea tourist cruises). Doesn’t it sometimes almost scare you how fast are these things happening?\n Oh yes. That’s the problem with basing your fiction on cutting-edge research; it doesn’t stay cutting-edge for long, and in my experience the stuff always fades in the rear-view mirror years before I would have expected it to. I suspect my books will stale-date pretty quickly.\n This goes back to what you mentioned earlier, regarding my opinion that scientists don’t necessarily make the best science fiction writers. I try, I really do—but it’s a real effort to push beyond the current state-of-the-art. It’s probably a vestigial reflex from my days as a scientist, when unwarranted speculation was frowned upon.\n In another novel you’re planning, Sunflowers, you venture into the very far future. It’s set on the relativistic ship Eriophora, known to your readers from the Hugo-winning novelette, “The Island.” The characters can literally watch the rest of the universe grow old, even though their own technology and culture stay essentially the same. How did you cope with presenting a universe far from now, seen through the eyes of characters similar to us?\n Hell, that’s the easy part—just steal the light show from the end of 2001: A Space Odyssey. If the characters are similar to us, that’s all they’d be able to comprehend when confronted with a truly transcendent future anyway.\n But I didn’t have to face that issue in “The Island;” the bioDyson entity that Eriophora encounters there was presumably a natural phenomenon, not some posthuman piece of magitech. We may not encounter it for another few billion years, but it could be quietly photosynthesizing away right now for all we know.\n I also ducked that challenge in the two other stories I’ve written in the sequence so far, “Hotshot” (which appears in Jonathan Strahan’s latest anthology Reach for Infinity), and “Giants” (which appears in an invisible book put out by Chaosium, although it may be appearing elsewhere soon since those bozos haven’t paid any of their authors and are therefore in breach of contract, not to mention burying the release itself so virtually no one knows the fucking anthology even exists. But I digress.). “Hotshot” takes place this century, just before Eriophora sails, so the culture shock isn’t so much of a challenge. “Giants” is another weird-phenomenon-outside-the-ship-tangly-domestic-discord-inside story.\n I’m still working up the courage to confront what we’ve become after millions of years of cyclical rise-and-fall. I have the seeds of an idea: a small ship pops out of a freshly booted gate, a ship containing a single posthuman from one of humanity’s immortality phases. She rides along with our crew and brings them some news from home—but rather than going into suspended animation between builds, she just wanders through the caverns and corridors of the ship for thousands of years while Sunday and her buddies sleep away the eons. Something profound happens to her during that time, but she refuses to talk about it afterward.\n That’s all I’ve got so far. But obviously, I’m going to have to grab this particular bull by the balls more than once before the cycle is finished.\n Creating characters outside the scope of today’s humanity is a challenging task; and as you mentioned in one older interview, many authors avoid showing the Singularity directly and rather go around it somehow. In my view, you’re very good at making especially those characters who don’t fit typicality and often are partially products of advanced technology. Was it difficult to write them, particularly Theseus’s crew in Blindsight? How hard do you have to imagine you’re Siri Keeton?\n Ooooh.\n Some of the more superficial aspects of my characters didn’t take much work at all, since I Tuckerised real-world characters at least insofar as physical appearance and (roughly) profession went. Siri was more personal; I’m nowhere on the spectrum, and I like to think I have a vastly more refined set of social skills than our protag, but one or two of his more emotional moments do spring from autobiography.\n I did know someone who was dying, and it took me forever to screw up the courage to reach out to him simply because I didn’t know what to say (it turned out to be easier than I’d feared). I also had a tendency to shut down and go into what a former partner termed “battle-computer mode” when dealing with emotionally sticky issues; I’d see the tears rise in her eyes and feel nothing more than a sort of cold contempt that she’d resorted to such cheap emotional trickery so early in the game. (Or maybe that wasn’t me so much as that particular relationship, which kinda sucked in a lot of ways. Certainly it’s been years and years since I’ve felt the urge to boot up that mode.) Regardless; those were bits of Siri that came out of me.\n You have to remember that I cheated when delineating that character, though. The story is told in first-person flashback, after Siri Keeton was traumatically rehumanised. The man in the narrative was repressed and shut down and in utter denial about who he really was; but the tale was told from the perspective of a much more self-aware Siri looking back on his earlier behavior. That let me humanize the telling, even during those parts of the tale when he wasn’t especially human. It meant he wasn’t really so alien after all.\n Julie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council."}