{"fingerprint": "MoCY4zX7xuBUMDoTl04YrkmXKXg=", "sitename": "Clarkesworld Magazine", "title": "Starfish and Sunflowers: A Conversation with Peter Watts by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/watts_interview_2019/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Starfish and Sunflowers: A Conversation with Peter Watts by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Starfish and Sunflowers: A Conversation with Peter Watts\n Peter Watts has been selling fiction for twenty years. He has won a number of awards for fiction including an Aurora Award for short story “A Niche,” a Hugo Award for novelette “The Island,” and a Shirley Jackson Award for short story “The Things.” He has been a finalist or been nominated for a host of other awards, including the Sunburst, the Theodore Sturgeon, the Campbell, BSFA Awards, and Locus Awards. His work has been translated into over twenty languages and translations of his fiction have received a Seiun Award, a Grand prix de l’Imaginaire, and many other nominations.\n Watts is a biologist who spent years “paid by the animal welfare movement to defend marine mammals; by the US fishing industry to sell them out; and by the Canadian government to ignore them.” In 2010, he was found guilty of resisting a US Customs and Border Protection officer and since then has been unable to reenter the US. Nonetheless, he continues to sell work, with short stories “Kindred” and “Cyclopterus” appearing in anthologies Infinity’s End and Mission Critical respectively, and The Freeze-Frame Revolution published by Tachyon. Known for his brash wit, Watts’ collection of nonfiction writing, Peter Watts is an Angry Sentient Tumor: Revenge Fantasies and Essays, came out from Tachyon in November 2019.\n In 1990, your award-winning story “A Niche” came out in anthology Tesseracts 3. Years later, following Blindsight’s publication by Tor in 2006, you had the Locus Magazine interview in March 2008, where you said you’d “lost all motivation to write,” and talked about being disheartened by the publishing process. With even more publications to your credit since then, including 2018’s The Freeze-Frame Revolution and more recently Peter Watts is an Angry Sentient Tumor (both published by Tachyon), how have your feelings about publishing changed or evolved?\n Tor was really my only significant interface with the publishing community back during the Disheartened Era. In the years since, though, I’ve interacted with a whole wide range of publishers across the world (I’m available in 21 languages now, I think), a whole wide range of new audiences, and a wider range of writing gigs ranging from video games to (I kid you not) Norwegian black metal science opera. Most of those other publishers, most of those other audiences, have been great.\n In 2008, I was limited to a single habitat; in the decade since I’ve emerged into an entire ecosystem, and it’s done me a world of good. In fact, I can’t stop thinking about the irony; while the planet itself is turning to shit at an ever-accelerating rate, my own life—personally, selfishly—is better than it’s ever been. (At some point, of course, those two trajectories are bound to collide. It will not be pretty.)\n Perhaps Tor has changed in the years since; or perhaps, if I got back into bed with them, I’d end up in a gray funk all over again. But I doubt it, because I’ve got eggs in different baskets now. The trophic network is more complex and more resilient.\n The Freeze-Frame Revolution is the fourth installment in Sunflowers, starting with award-winning story “The Island.” When you wrote that first story, had you already planned the series to this point? What else do you have in store for Sunflowers?\n I had planned something—just not a series of conventional stories. “The Island,” as a stand-alone, functioned as an interrogation of the whole stargate trope—all those ready-made superhighways left behind by ancient races that have conveniently gone extinct and left us all their toys to play with. It’s a great device (if overused), but what about the poor bastards who had to build those gates in the first place? So, there was that.\n At its heart, though, I always thought that the premise of a repurposed asteroid, inching its way around the galaxy and building a stargate every millennium or so, would make a kick-ass basis for a video game. Each build would be a mission level; each would be preceded by centuries that would act as a reset button. You’ve got the standard running-into-someone else’s territory scenarios, but you’ve also got the what-has-humanity-turned-into-in-the-past-thousand-years scenarios, where you have no idea what might come out the gate behind you once you’ve built it. And the ongoing conflict between the Chimp and the Human crew provides another source of ongoing conflict that ties the epic together. So, I started writing Sunflowers as a kind of testing ground for a video game, and I haven’t entirely given up hope that that might happen.\n I gotta say, though—after ten years and a half dozen unrelated video game gigs—that hope is dimming.\n Some have cited dialogue as one of the strongest elements of your recent fiction. Has this changed since your earlier pieces? Do you have specific strategies or techniques for developing great dialogue?\n Not really. In fact, I’m kinda surprised to learn that “some”—anyone, really—have singled out my dialogue for praise. I’ve been told by someone I trust implicitly that all my characters sound essentially the same, that they’re all just different facets of me. I’ve always regarded that as a weakness in my own craft.\n Just out of curiosity, who are these wonderful people who like my dialogue? Are they influential? Are they rich?\n You have also been lauded recently for your ability to weave information into the story, which is a provocative contradiction to your Locus interview statement: “Let’s face it: the climax is a three-page infodump (albeit an infodump replete with torture and mutilation).” Have you changed the way you approach putting information into a story, or is this more about length—shorter fiction vs. novel?\n If I’ve changed, it’s just because experience might have improved my technical craft: a change of degree, not of kind. I’ve always tried to avoid infodumps; when I can’t see any way to avoid them, I try to make them less boring by inserting them into a more dramatic context. So a first draft conversation around a conference table ends up taking place during an invasive and painful decontamination procedure in the final version. Someone who starts off pondering the biochemistry of a certain microbe while sitting in a chair might, by the time the book makes it into print, find herself being forced to work through the same questions under torture. Anything to avoid endless pages of talking heads spouting facts at each other.\n The main downside is that casual readers are more likely to decide I’m just some kind of closet sadist. In fairness, though, you could say that about pretty much anyone who writes fiction.\n As a scientist, do you adjust scientific language and concepts for a broader readability, or are you more of a “if they can’t keep up they aren’t my audience” kind of writer?\n First off, you have to remember that my scientific background is in marine biology; when I’m writing beyond that limited sphere, I have no more science expertise than any doofus off the street. At best, I have a better appreciation of how science, in general, works.\n But believe it or not, it’s closer to that first thing. Sure, the actual dialogue may be opaque—my characters may just whistle incredulously and exchange significant looks at a “5 Tesla” reading, without As-you-know-Bobbing about it—but I like to think anyone who’s paying attention won’t have any trouble figuring it out. Context makes it clear they’re talking about some kind of magnetic field—the whistles make it obvious that 5 Tesla is really fucking high.\n If the concept doesn’t fit into those kind of cracks then I’m more likely to wax poetic, try and jam in some metaphorical imagery to convey the essentials—the problem with that being, I’m told, sometimes my metaphors and imagery get so elliptical that no one can figure out whether I’m describing something literally or whether I’m just on drugs.\n A good rule of thumb is: if one of my characters tosses off a fifty-dollar word and it just hangs there unilluminated, chances are it’s pure background color, unimportant to the plot. In Jaws, Quint challenged Hooper to tie a sheepshank; no one complained when the movie ended without explaining how you’d actually do that.\n In your previous Clarkesworld interview (Issue 95, August 2014) you talked a bit about plot and structure. Is your overall approach to writing novels different than shorter fiction?\n Definitely. Short stories have to be way more efficient. Ninety percent of the stories I’m asked to write come with an upper word limit; I generally spend half my time writing the damn thing, and the other half trying to cut it down so it fits.\n Are there projects you had to give up on, things that were permanently trunked, or have you found ways to make all of your stories viable?\n Well, there are projects that seem to be stuck in Development Hell, to steal a term from the movie industry. I’ve had one book simmering on the back burner since 2011 and I’ve still made barely any headway. But I haven’t given up on it yet.\n Overall, though, the question doesn’t really apply. Pretty much every short story I’ve written in the past decade has been in response to someone asking for it, so there’s always been a built-in market; I don’t have to do the unsolicited-submission thing any more. (Which is just as well; my success rate was pretty pathetic when I did.) For the most part, the folks who’ve done the soliciting have found my work acceptable (and honestly I’m not always sure I would have, if I’d been in their Blundstones). The only story of mine that wasn’t published by the person who solicited for it was “The Things,” and that was only because I was unwilling to sign a contract allowing the publisher to walk away if Universal ever came after me for copyright infringement. And I don’t have to tell you that even that story ended up finding a good home, and doing pretty well for all concerned.\n You’ve made a lot of your previously published fiction available for free online at your website: https://rifters.com/real/shorts.htm including the aforementioned “A Niche” and “The Island.” But on the other hand, does that affect potential income through reprint rights sales and so on? What is the thinking behind this?\n It’s an old story by now, but if I hadn’t gone Creative Commons, I don’t think we’d even be doing this interview. As far as I can tell Blindsight had been written off as DOA before it was even released—teensy print run, no real promotion, cover design that departed radically from my earlier titles (not, I think, in a good way). Unsurprisingly, it tanked on release: a prophecy, self-fulfilled. But then Blindsight started generating buzz on its own merits, to the point where demand exceeded supply. (Granted this was not an especially high bar to clear, given the print run.) There were genre outlets that listed Blindsight as their top seller several weeks running, based on zero physical sales because they had no actual copies in stock; the rank resulted entirely from back orders.\n For some reason, Tor seemed reluctant to go to a second printing. (To this day I’m not sure why; the answers I got kept changing.) Eventually I concluded that if I wanted people to read the damn book, I’d have to provide that option directly. So I followed Cory Doctorow’s lead and put Blindsight out on my website under a CC license. And I figured, what the hell: might as well put the rest of my backlist out while I was at it. It wasn’t so much a principled stand as a Hail Mary.\n To circle back to your question about potential income, I’d already written that off by then. I saw only two realistic scenarios: one in which sales tanked, my career was over, and nobody could read Blindsight vs. one in which sales tanked, my career was over, and anyone with an Internet connection could read it. I did not foresee any scenario in which sales tripled the week after I set the book free, followed by continuous reprintings, multiple translations, and multiple awards. (All for overseas editions, curiously; none for the original English, although it got nominated across the board. This leads me to suspect that my translators are better writers than I am.)\n As it happened, that third scenario is the one that transpired. I came along at this sweet spot in time when going the Creative Commons route was still newsworthy. Cory boosted it on Boing Boing; Scalzi boosted it on Whatever; Kathryn Cramer not only gave me free ad space on her website, she built the bloody ad. All these folks and others amped the signal to the point where Blindsight hit some kind of critical mass and became self-sustaining—and the rest is history. Obscure, trivia-bonus-question history, but history nonetheless.\n Tor still isn’t especially happy about it, though. Every now and then they try to get me to take down the backlist—at one point they even made a (slightly) sweeter e-royalties deal contingent on that—but you’ll notice the backlist is still live. Next year they’re releasing Blindsight in a new “Tor Essentials” edition (part of a new line they’re running to compete with Gollancz’s “Masterworks”), so I guess it’s still earning for them. We don’t talk much, though. Patrick Nielsen-Hayden dropped me an email last year informing me of the new edition, and I wrote back saying Cool, can we maybe get some new cover art?, but he never got back to me.\n The table of contents for Peter Watts is an Angry Sentient Tumor offers everything from “Why I Suck” to “Pearls Before Cows: Thoughts on Blade Runner 2049.” Is there an organizational principle at work behind what pieces were in the collection? Are there new pieces only available in the book?\n You’ll have to ask Jacob (my editor at Tachyon) about any grand organizational architecture; I handed him a bunch of pieces and he made the selection. I did serve them up according to theme—Reviews, Writing, Science, and so on—but they all ended up getting mooshed into a single unpartitioned volume.\n Tumor is a reprint collection; the only piece that hasn’t previously appeared anywhere on the planet is my Introduction. That said, you’d have to be one hard-core fan to have seen it all before. If you’ve only followed my blog you won’t have seen the Nowa Fantastyka columns that appeared only in Poland; if you’ve devoured those columns in their original Polish you might not have seen essays that appeared in places like Aeon and The Daily. It doesn’t break physics to posit a fan so devoted they’ve stalked me across the Internet and into every dead-tree venue I’ve ever written for, but it is vanishingly unlikely.\n Who is the audience for Angry Sentient Tumor?\n That’s a really good question. Perhaps a better one would be: Is there an audience for Angry Sentient Tumor? Is there a Sentient Tumor demographic? I guess we’ll see.\n I just discovered last night that—unless someone hacked the Amazon website as part of some cruel hoax—it got a starred review from Booklist, which is hopeful. They described it as a fusion of Hunter S. Thompson and John Scalzi, which sounds like an especially gruesome sort of transporter accident. They also described me as “self-depreciating.” I’m still trying to figure out whether that was deliberate.\n For folks who haven’t read your fiction, what is the best place to start?\n I’m not certain. Blindsight is certainly the novel that put me on the map, but a lot of folks regard it as hard-core and not for the novice. Starfish is more accessible (and was a NYT Notable to boot, so you don’t even have to feel genre-shame while reading it), but it was my first novel so maybe the prose isn’t as smooth as it might be. Freeze-Frame Revolution is, well, short.\n Maybe start off with a couple of short stories, get a taste of me before committing to anything really substantive. As you’ve already mentioned, a lot of them are available for free on my website.\n Oh, now that I think of it: a very recent story of mine, of which I am quite proud, is also quite obscure; it was published earlier this year in the Slovenian Magazine ŠUM, released in conjunction with the Venice Biennale exhibition by Marko Peljhan. It’s called “The Wisdom of Crowds,” it’s about the use of crowdsourcing to determine the target of a hypersonic glide vehicle with an explosive payload of 300 kilotons, and it’s not quite like anything I’ve written before. Does Clarkesworld still do reprints?\n Also, possibly but not necessarily related, which is the work you are most proud of, and why?\n You’re expecting the usual suspects. And sure: I’m proud of the “The Things” because it started out as Lamarckian fanfic and grew into something with more layers than I would have expected. I’m proud of Blindsight because it managed to say something reasonably new, and back it up with footnotes. (Interestingly, I recently read it for the first time since it came out in 2006—I had to go over a fresh set of galleys for that “Tor Essentials” edition I mentioned—and I gotta say, I didn’t think it was all that special. I mean, it was well written and decently plotted and all, but I’ve spent 13 years now hearing from folks who found it a mind-blowing and life-changing experience. Rereading it from start to finish, my mind wasn’t blown once. Of course, I could obviously see all the plot twists coming, and having written the damn thing I couldn’t really be expected to find the neuro-gazing especially surprising either. Still. I probably shouldn’t pay so much attention to my own PR.)\n But I think what I’m going to settle on is my video game adaptation: Crysis: Legion. Because let’s face it, the basic conventions of the alien-invasion FPS are pretty dumb; any civilization capable of hopping across the galaxy is going to be capable of squashing us like bugs. Positing that a few Navy SEALs in a Chinook helicopter could take down an alien spaceship is roughly analogous to suggesting that a bunch of lemurs could take down an F-16—and yet these kind of conceits are pretty much essential to a lot of games (at least, I’ve never seen a successful video game that embraced the “Bambi vs. Godzilla” vibe. Maybe Alien: Isolation comes closest.)\n The challenge in writing the Crysis adaptation was being faithful to the game’s story—absurdities and all—while retconning it all to make some kind of sense. To interrogate the game from within the game, to posit scenarios that would make it plausible, add stuff around the edges to give it some kind of substance. One advantage to adapting an FPS is that the protagonist tends to be pretty blank; they’re a vessel designed to contain the player’s persona, after all—so I was free to insert backstory and character development to my furry little heart’s content. It also helped that this particular FPS was scripted by Richard Morgan, so I had a lot more substance to work with.\n Still, it was a challenge simultaneously being faithful to, and retconning, and even metacommentating up, the source material. It’s not my best work. It may not even be good work (although I personally think it has a certain tawdry charm). But it forced me to flex creative muscles I’d never used before, albeit in a confined space—you might almost call it a kind of literary bansai—and I’m proud of what I managed to pull off within those constraints.\n Of course, it absolutely tanked commercially. Sold about 4 copies.\n What are you working on now that fans can look forward to?\n Those are actually two separate questions. I’m working on stuff, but I don’t know if fans will be looking forward to it.\n My agent would like me to be writing All Sunflowers All the Time; apparently it sold well (I have to admit the first-year royalties were pretty nice). But while I do have an overall epic arc plotted out for the whole series—extending from the 22nd century to at least halfway to the heat death of the universe—we’re really talking multiple volumes, and I have no desire to embark on such a big project on spec. At the same time, I gravely doubt that any publisher would be willing to commit to such a project from a mere midlister such as myself. (They certainly wouldn’t be eager to embark on a deal in which a bundled video game was part of the deal, which it would be if I had my druthers.) I’ve promised Howard that I’ll work up a proposal for such a project—and I will—but my hopes are not high.\n Then of course there’s Intelligent Design, which has been the Next Big Project for so long now that Julie Novakova asked me about it the last time I did a Clarkesworld interview back in 2014. I’ve made no further progress since then because other stuff keeps coming up with larger and/or more immediate payoffs.\n A bit of background. Starfish is the only novel of mine that was, when I sent it off, truly as good as I knew how to make it at the time. I sent off all my others feeling that I could have made them better, but I needed to make deadline. So with ID I vowed to go back to basics: to write without a contract—and hence, without a deadline—so I wouldn’t have to send it out until it was damn well ready. The unintended consequence is that without a deadline, I still haven’t got around to writing the fucking thing. But I still fully intend to. I was planning on diving into it this very fall, in fact, until . . .\n I ended up working on a VR cyberpunk game with a feisty little start-up out of Tel Aviv. I have no idea whether it’ll go anywhere—I’ve done gaming gigs on and off for the past twenty years, and not one of them has yet made it to market—but in the short term it’s a new medium, it’s an exciting concept (there’s greater thematic depth than you usually find in games of this sort, although I can’t share details), and the people themselves are a joy to work with. I imagine that will keep me busy for the next few months, anyway.\n If not, I can always blog.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}