{"fingerprint": "B3CSOgV7pAFyhjXZX5MRVo7mKQc=", "sitename": "Clarkesworld Magazine", "title": "Bringing the Pieces Together: A Conversation with Jacob Weisman by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/weisman_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bringing the Pieces Together: A Conversation with Jacob Weisman by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Bringing the Pieces Together: A Conversation with Jacob Weisman\n Poet, essayist, fiction writer, editor, publisher, and more, Jacob Weisman founded Tachyon Publications in 1995 to “champion the creative storytelling of authors who inspire us through intelligent prose and imaginative worlds.” Weisman went from running fanzine Thirteenth Moon to publishing authors such as Charlie Jane Anders, Daryl Gregory, Nancy Kress, Joe R. Lansdale, Tim Powers, Brandon Sanderson, Lavie Tidhar, Jo Walton, Peter Watts, Jane Yolen, and more. Tachyon’s books have won a broad spectrum of awards, including Locus awards, Hugo awards, and Nebula awards (complete list here). Weisman’s forthcoming Mingus Fingers, coauthored with David Sandner, about jazz legend Charles Mingus and a struggling musician who can see what no one else can see, is due from Fairwood Press in November.\n You had the successful, World Fantasy Award-winning The New Voices of Fantasy in 2017, coedited by Peter S. Beagle. Now you have the November 2019 release The New Voices of Science Fiction coedited with Summerland author Hannu Rajaniemi. How did you pick your coeditors for these anthologies?\n The New Voices of Fantasy was created with Peter S. Beagle in mind. I’d published several of his story collections and one anthology, The Secret History of Fantasy, so we had a very good working relationship. I also felt that this was the perfect book for Peter. He had very much been one of the loudest new voices himself back in the early 1960s, just as he is now an elder statesman. Peter had started his career precociously, selling his classic novel, A Fine and Private Place, at the age of 19 and publishing it by the time he was 20. I couldn’t imagine a better collaborator for this book.\n The decision to work with Hannu Rajaniemi was somewhat different. I enjoyed working with Peter on the fantasy volume and I knew I wanted to publish a companion volume dedicated to SF. Hannu had been in the fantasy volume I’d edited with Peter, I’d recently published Hannu’s short story collection, and he’d just moved to San Francisco. Everything with Hannu just fell into place.\n What is your favorite part about putting these anthologies together?\n The excitement of many of the authors to be included in the book. Some of them have already been in multiple anthologies and may even have published a novel or two. Others, though, may have only published one or two stories and this is their first experience as a featured author. Hopefully that attention will give them added confidence as they move forward in their careers.\n What does “new voices” mean for these books, and are there other unifying elements to the selections? How does an anthology such as this differ from a “Year’s Best”?\n In the science fiction book, we were not just looking for new stories by new authors, we wanted to explore what sorts of futures concerned these writers. My generation had been obsessed by what would happen to Western civilization after the bomb. The writers that Peter and I were reading were grappling with the implications of new technologies—virtual reality, social media, or 3D printing—but were equally as concerned with what might come next.\n I’ve never edited a best of the year collection, but I imagine that it must be a much different experience. In New Voices, I got to select stories from multiple years and I only had to read stories by new authors, not every single story published that year. We weren’t necessarily working to represent the entire field—which is something I feel best of the year collections often do—just what we thought was important, or groundbreaking, or showed an interesting new perspective.\n These are both entirely reprint anthologies, but different editors have different processes. For example, some have submissions, even for reprint anthologies, while others pull from what they find along the way in their own readings. What your selection process? How do you find pieces, and how do you sort out with your coeditors which pieces to use?\n I read through entire runs of magazines for the years in question and scoured short story collections and anthologies. Occasionally I asked a magazine editor for help. Sheila Williams, Neil Clarke, and Gordon Van Gelder all pointed me to stories and authors that they felt shouldn’t be overlooked. My staff also provided much-needed support, helping me to track down stories and sometimes reading alongside me. James DeMaiolo, Tachyon’s chief publicist, did a lot of the grunt work for The New Voices of Fantasy while Jaymee Goh, our new superstar associate editor, filled that role for The New Voices of Science Fiction.\n I should point out there was in fact one original story included in the fantasy anthology, Eugene Fischer’s “My Time Among the Bridge Blowers.” But we never set out to commission originals.\n My understanding is that some “Year’s Best” editors try to avoid too much replication of content. Is this a consideration in this (or any of your other) anthologies?\n I prefer to publish the best works I can find. I’m proud of the stories we’ve included that were largely undiscovered, like Ben Loory’s “The Duck” or Jason Sanford’s “Toppers.” At the same time, I’m reluctant to exclude stories merely because they’ve been widely anthologized, as long as the story genuinely merits its inclusion.\n Were there stories that you both wanted to put in the anthology but which couldn’t be used for one reason or another?\n There were one or two close calls, but in the end, we got everything we wanted.\n Genre definitions have long been debated within the SF community. A lot of the pieces in The New Voices of Science Fiction seemed more story or character focused, rather than “hard SF.” Was this deliberate; or do you feel it’s even an accurate assessment? Were there discussions between you and Rajaniemi around what constitutes “science fiction”?\n We felt that as long as we could point to the science fiction element and say “there, that’s it,” we were OK.\n Hannu has a very impressive background in science and mathematics. We don’t talk about that stuff very much because I’m pretty sure I wouldn’t be able to keep up my end of the conversation. Hannu’s stories are written with an elegant flare that I tried to find in the stories we included. Hannu, in his fiction, is ultimately more concerned by the implications of the science rather than the science itself. (At least that’s what I think. You’d have to ask him to be sure.)\n My favorite story by Hannu is “Deus Ex Homine,” which has transhumans, heavily augmented infant soldiers, enslaved AIs, and all kinds of other stuff somehow crammed into little more than a dozen pages. But the point of that story is that ultimately scientific breakthroughs are exponential and have the potential to move beyond our ability to keep pace. Jamie Wahls’ “Utopia, LOL” reflects that beautifully.;\n Other stories like Alexander Weinstein’s “Openness” take place much closer to the here and now, but still have that elegance.\n From a glance at the website, it looks like Tachyon has 38 anthologies, including this latest one. What are the advantages and disadvantages in doing a reprint anthology versus an anthology with a few new stories versus an anthology with all new stories?\n 38? That is a lot of anthologies.\n In an original anthology you would have the opportunity to actually edit the stories, which can be gratifying. A reprint anthology is more of an argument, like a mathematical proof that you lay out for the reader. In most cases the story runs exactly as it was previously published. The editorial advantage is that you can choose to publish only the very best stories, stories that may very well incorporate another editor’s helpful insights.\n Anthologies seem popular right now, and a lot of presses, indie to big 5, are putting them out. Are there specific things that make one anthology sell better than otherwise? Or does it come down to random elements of the market?\n Random elements of the market, mostly. Good editors and great authors also help.\n Tachyon is best known for producing original fiction in beautiful editions by authors with some traction in their careers, most often novellas and trade paperback novels, occasionally collections. How did you start putting out anthologies, and where do they fit in to the grand scheme of the business?\n There’d been a long period where publishers had decided that they couldn’t sell anthologies. We published one to test the waters back in 2006, Feeling Very Strange: The Slipstream Anthology edited by James Patrick Kelly and John Kessel. It was an insightful book and sold very well. Jim and John followed that up with Rewired: The Post-Cyberpunk Anthology, which did even better. We asked Ann and Jeff VanderMeer to edit a new weird anthology, very creatively titled The New Weird. That was a tremendous book for us.\n When Jeff lost his day job, we hired him and Ann to coedit the very first anthology anybody had ever done of steampunk fiction, creatively titled Steampunk. The anthology hit at just the right time. A week after we published it, The New York Times ran a cover story about steampunk. The following week the Los Angeles Times ran their own cover story about steampunk, this time actually mentioning our book. For many years it was the bestselling title we’d ever done.\n We still publish anthologies, although perhaps not as many. There’s a lot more competition now. Some of that is a result of our earlier successes, showing other publishers that it could be done. There’s also a lot of anthologies that are produced through crowdfunding. Our most recent anthologies include The New Voices anthologies, Nightmares: A New Decade of Modern Horror edited by Ellen Datlow, and The Unicorn Anthology edited by Peter S. Beagle and myself.\n Can you tell us about any future anthologies you may be considering?\n I’d like to do a body horror anthology with Ellen Datlow. And I’d like to continue the New Voices anthologies, perhaps in other genres or subgenres. I haven’t worked that last part out, but I will.\n What else does Tachyon have coming up?\n We have a lot of great projects coming up. Novels by Carrie Vaughn, Lavie Tidhar, and David Liss. An essay collection by Peter Watts titled, Peter Watts is an Angry Sentient Tumor. A new line of YA and Middle Readers that will launch in September 2020 with a new novel by Daniel Pinkwater. And, much in keeping with the New Voices, a slew of debut books: a novella by R. B. Lemberg, The Four Profound Weaves; and novels by newcomers Kimberly Unger and Elly Bangs.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}