{"fingerprint": "vyhb6akp1MCbXJryDBXvrEVLnvU=", "sitename": "Clarkesworld Magazine", "title": "Short Stories and Sad Endings: A Conversation with Martha Wells by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wells_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Short Stories and Sad Endings: A Conversation with Martha Wells by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Short Stories and Sad Endings: A Conversation with Martha Wells\n Martha Wells grew up in Texas reading science fiction and fantasy from a young age, getting books at her local library. In her teens, she was writing Star Wars and Godzilla fanfic, complete with maps of Monster Island. She received a BA in anthropology at Texas A&M but took other classes as well, including a science fiction and fantasy writing class taught by Steven Gould, where she wrote one of her first fantasy stories.\n Wells’ debut fantasy novel The Element of Fire came out in 1993, earning her a Compton Crook/Stephen Tall Award nomination and making her a contender for the 1994 Crawford Award. It also started the Ile-Rien series: Nebula Award-nominated The Death of the Necromancer in 1998 and later Fall of Ile-Rien entries The Wizard Hunters (2003), The Ships of Air (2004), The Gate of Gods (2005), and collection Between Worlds: the Collected Ile-Rien and Cineth Stories (2015). City of Bones came out in 1995 and Wheel of the Infinite in 2000, both standalones. 2006 saw the publication Reliquary in the Stargate Atlantis universe, the first of several media tie-ins for properties including Star Wars and Magic: The Gathering.\n Her Hugo Award nominated The Books of the Raksura series, launched in 2011 with The Cloud Roads, includes The Serpent Sea (2012), The Siren Depths (2012), The Edge of Worlds (2016), and The Harbors of the Sun (2017), as well as collections The Falling World & The Tale of Indigo and Cloud (2014) and The Dead City & The Dark Earth Below (2015). In 2013 and 2014 she published YA novels Emilie and the Hollow World and Emilie and the Sky World.\n Science fiction novella All Systems Red, the first book in the Murderbot series, changed everything. It landed nominations for the American Library Association’s Alex Award, the Philip K. Dick Award, the Romantic Times Reviewers’ Choice Award, the Prometheus Award, and it won Hugo, Nebula, and Locus awards. The series includes Artificial Condition, Rogue Protocol, and Exit Strategy, and continues to garner accolades and awards recognitions.\n In 2017, Wells gave a landmark World Fantasy Convention toastmaster speech, “Unbury the Future,” calling for listeners to seek out and acknowledge the long history of women in science fiction, many of whom, she contended, had been overlooked. Her speech was widely discussed and lauded. The text is available here.\n Looking at your body of work, you have played in a number of different sandboxes, from your own worlds (short fiction, stand-alones, and series) to Stargate and Star Wars media tie-ins to the Dominaria Magic: The Gathering expansion. What was the most fun, or best part of working in those other worlds? And what was the most challenging aspect of it?\n They were all very different. I was a Stargate fan and a Star Wars fan from the beginning, so those were both very fun to work on. Working with a team for Magic: The Gathering was a great experience. I think the most challenging aspect in working with established worlds and characters is trying to get the characterization and voices right, either to match the actor performances for the movie or TV show, or with MTG to make new characters fit into the established world.\n Are there other kinds of projects you are hoping to do—comic books, video games, etc.? Or are you more interested in focusing on your own worlds via novels and short stories?\n Not really right now. At the moment, I’m focusing on my own worlds.\n What is your writing process? Are you a sprinter, a planner, or something else; do you write daily or here and there?\n I plot a little bit in advance, but I’m mostly a pantser. I try to write daily, but it’s not always possible, particularly when I’m having trouble figuring out the plot.\n Are there aspects of writing that are more challenging for you? And if so, how do you deal with that?\n It really depends on the story. Some come together pretty quickly, and I move from first draft to revision without any problem. Others I end up rewriting and rewriting, rearranging chapters, and discarding chunks of plot for new chunks that end up getting replaced later. I don’t have any specific way to deal with it except to keep working on the story.\n Your debut novel, The Element of Fire, came out in 1993 and your first short story sale, “Thorns,” came out in 1995. What was the process of breaking in like for you? Did it take you a while to start selling fiction? And if so, how did you deal with that? Or did things fall into place quickly?\n My first agent sold my first novel to Tor when I was twenty-seven, so it probably looks like things fell into place quickly for me, but I had been submitting and getting rejections for short stories for about seven years by that point. The most difficult period of my career was after my ninth book, around 2008, when the slow career crash I had been having for the past two years bottomed out.\n I wasn’t able to sell any fiction at any length for about two more years, until 2010, when my new agent Jennifer Jackson sold the first two Raksura books. It was a very hard time. I’d had to leave my last day job due to a toxic work environment, and The Cloud Roads had been turned down by so many publishers. I had just about given up on my writing career and was canceling convention appearances and trying to decide what to do next when the book sold to Night Shade.\n Breaking in was hard, especially because of my anxiety, but the career crash period was worse for me, and it was a hard slog even after the Raksura books came out. As an older woman, the attitude I kept running into was basically that my career was over and I needed to stop. At a convention, a younger male writer asked me to leave a panel on fight scenes because no one would be interested in what I had to say. (I didn’t leave.) There were a lot of those kind of incidents.\n Your books have been described as “tight, tense, entertaining adventure . . . ” How do you write effective tension and/or effective action?\n Mostly a lot of experience. I’ve been writing action-adventure for about twenty-seven years, not counting all the stories and fanfic I wrote before I sold my first book, so I’ve been working on pacing for a long time. I also like to use a very tight point of view, and I think that helps me with the tension and action. The rule I try to follow is that the reader doesn’t have to know everything that happened in a complicated action scene, they only have to know the parts that directly impacted the POV character.\n I noticed you have relatively few stand-alone short stories—most of your short fiction takes place in the worlds of your novels. And overall, the bulk of your short fiction came out in the later 2000s. Are you more comfortable at novel length? Was there a transition somewhere in your writing? Or is this really just a matter of what interests you in terms of story?\n I am more comfortable at novel length. I didn’t sell any short stories until after my second novel was published. And short stories tend to take a long time for me to write. I just sold a short story to Uncanny Magazine that took me a year to write.\n You started receiving nominations and accolades early in your career, but more recently, you had some big wins: Hugo, Nebula, and Locus awards for All Systems Red; Hugo and Locus awards for Artificial Condition, among other accolades, such as the BooktubeSFF Award. Does this recent success have an impact on your writing? Is there a sense of pressure, does it instill confidence, or does it just make you want to keep writing great SF?\n Earlier in my career, I had one Nebula nomination for The Death of the Necromancer in 1998, but that was basically it. After my career crash, I never really expected to be at a point where I would be winning awards. I have problems with anxiety, so basically everything that happens produces more anxiety, so while it’s been incredibly wonderful and exciting, it does up the pressure a lot.\n How do you strike that balance in your fiction: crafting a story that is entertaining but also meaningful?\n I don’t see it as striking a balance, I just try to write from the point of view of the character, and what affects them the most, what they’re concerned with, and I just tell their story.\n How did The Murderbot series happen for you? What was the initial inspiration, how did it develop, and from All Systems Red to Exit Strategy, did the story go as planned from the beginning, or were important changes made along the way?\n When I started working on All Systems Red, I thought it was going to be a short story with a sad ending. I realized it was going to need to be longer to really tell the story, so I decided on novella length, but I didn’t really know how I was going to end it until I got there. I thought it would be a stand-alone, but when Tor.com bought it, they asked for a second novella and I decided to write Artificial Condition. I didn’t decide to do the other two novellas until after it was finished, though there were some discarded plot elements in Artificial Condition that I later used in Exit Strategy. So when I started All Systems Red, I had no idea it would be a series, or where the story was going, or where I would eventually end up.\n Is it important to write fiction with meaning and social/political commentary? Or can a story just be a fun story?\n I think it’s impossible to separate the social and political commentary from the story. If you’re a person living in a society, your existence is social and political, and whatever you write is going to reflect that, whether you understand it or not.\n The newest Murderbot novel, Network Effect, is coming out in May. What can you tell us about this book?\n It’s set after Exit Strategy and involves Murderbot running into ART from Artificial Condition again. I don’t want to say too much more because really everything other than that is a spoiler.\n You also have some new short fiction out, “Obsolescence” in Take Us to a Better Place. Is there anything you can tell us about this story?\n The idea of the anthology (which is free in ebook) was to imagine the future of healthcare. My story is a murder mystery in a space station and is a comment on corporate healthcare for profit and the danger of people being abandoned and cut off from their support systems.\n For folks who haven’t read your work, where is the best place to start?\n It depends on what you like best. If you like secondary world fantasy with alien characters, probably start with The Cloud Roads, the first book in the Books of the Raksura series. It’s a complete series with five novels and two novella collections. And it’s all available in ebook, audiobook, and paperback.\n In your 2017 World Fantasy toastmaster speech, you said, “We might know that C. L. Moore wrote for Weird Tales, but I grew up thinking she was the only one, that a woman fantasy writer from that time period was like a unicorn, there could only be one, and that she was writing for an entirely male audience. But there were plenty of other women, around a hundred in Weird Tales alone . . . ” In light of this speech and the things it stands for, what is the single most relevant thing readers and genre writers can do today to effect positive change?\n Read and recommend new writers. There are so many incredible books coming out now by new writers from a variety of different backgrounds and viewpoints. I think it’s especially important for writers. It’s very frustrating when I’m on a panel with writers who haven’t read or can’t name a recent book, who only talk about books published ten years ago or twenty years ago. I know people get too busy to read much but I feel you have to stay current with the field.\n Who are a few new writers or what are a few stories/books you’d really like people to read?\n Some of them have been around for years or have won some major awards, but I’d recommend writers like R. F. Kuang, K. Arsenault Rivera, Jeannette Ng, Nicky Drayden, Rebecca Roanhorse, C. L. Polk, P. Djèlí Clark, Saad z. Hossain, Jessica Reisman, Kate Elliott, N. K. Jemisin, S.A. Chakraborty, Kelly Robson, Yoon Ha Lee, L. X. Beckett.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}