{"fingerprint": "H5J1Bfd6KroTgbWGMGwGmZWaeLs=", "sitename": "Clarkesworld Magazine", "title": "Words with Wings: A Conversation with Fran Wilde by Chris Urie", "author": "Chris Urie", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wilde_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Words with Wings: A Conversation with Fran Wilde by Chris Urie", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Words with Wings: A Conversation with Fran Wilde\n I met Fran Wilde years ago through a mutual friend and fantasy author. In the time that I’ve known her, she’s published brilliant short fiction and incisive articles on the art of fiction. Her debut novel Updraft, was released from Tor Books this past September.\n Updraft is the story of Kirit Densira and her attempt to save her family and home from the oppressive reign of the Singers. In a world high above the clouds, Wilde weaves a complex tale filled with multi-faceted characters and a setting unlike any other. Towers of living bone jut out from clouds and people fly on hand-crafted wings.\n Fran Wilde’s short stories have appeared in Asimov’s, Beneath Ceaseless Skies, Nature, and Tor.com. She also hosts an interview series called Cooking the Books, all about the intersection between food and fiction.\n Now that your debut novel is out, how has it changed your writing life?\n Right now, what’s changed is finding time to write while traveling and blogging to promote Updraft.\n For better or for worse, I love both traveling and blogging, and that can be distracting.\n I’ve been having a lot of fun with the blog posts (see my Questionable Answers post at Chuck Wendig’s Terribleminds, for an example). I wouldn’t do as many blog posts if they weren’t fun, and I think I did forty-six iterations of fun in September, plus the regular Cooking the Books and Book Bites posts I do on my website.\n Doing readings and appearances for Updraft has been equally amazing. Getting the opportunity to appear with authors like Seanan McGuire, Greg van Eekhout, and Adam Rakunas on the west coast, meeting booksellers, and then traveling on the east coast with my fellow Tor debuts—Seth Dickinson and Ilana Myers in October has been amazing. Plus local Philadelphia events, especially Doylestown Bookshop, Main Point Books in Bryn Mawr PA, and the incredible launch at Barnes & Noble Rittenhouse Square—all were and are great opportunities to connect with readers and talk with them. I love that.\n Which means I have to pry time loose from my schedule to write . . . a very different experience for me. (I get hermit-ish when I write.) I’ve been finding moments, especially on my days off and on the planes and trains (I can’t write very much in cars), and it hasn’t been too big a difference, but it’s still a shift. Who knows? Sometimes changing things up energizes the writing too.\n Updraft features a deep and dynamic setting. What were some of the difficulties in worldbuilding such a complex society?\n The main fiddly bits weren’t so much a difficulty as a memory game. Remembering which towers produced what items, mapping out what the wind flows were around each tower and around the city itself, and how best to approach and leave towers at what angles. Also counting the tiers and keeping track of what tier my characters were on or near for certain scenes required careful mapping. I found it really fun.\n What can readers expect from next book set in the Updraft universe?\n Cloudbound is about leadership at its heart. And gravity. A lot of gravity. (The title should be a pretty solid clue for Updraft readers). Also monsters. There are familiar characters (yes, fans of a particular character, he’s back) and new ones. More wing fights. And new towers to explore . . .\n If you could have a pair of wings from your book, what would they look like?\n Mine would be sepia/tea-stained like Ezarit’s but with wind-whorls like Kirit’s. Ezarit’s wings have a stylized kestrel on them, which is perfect for her character. My wings would be light and fleet and furlable, with the fine-tuned controls the singers have. I might have a pair of darker wings too. Hmmmm . . .\n You cut your writing teeth in the short fiction realm. What has writing short fiction taught you?\n Concision.\n I was tempted to leave it at that, but also, short fiction teaches the power that two words, placed side-by-side have over each other, when not crowded by other words. And the power of editing and revising.\n Food can be an often-overlooked aspect of fiction. Your podcast Cooking the Books highlights the importance of culinary creations. How does food add depth to a story?\n Food isn’t necessarily an overlooked aspect of fiction for many authors—so many people write beautiful food! I think it’s easy to get caught up in the world of a book and miss the careful work writers are doing with food, line-of-supply, economics, and kitchen/dining culture when they talk about food.\n What Cooking the Books has allowed us to do is to talk about a lot of craft and worldbuilding techniques that come up when food is involved. As well as other issues including socioeconomics, war, cultures and cultural appropriation, and gross-out humor. To name a few. Plus, apparently, cannibalism, sometimes.\n Food gives writers a way to reveal parts of a world, a setting, or a relationship without using exposition. Who eats and who doesn’t, what do they eat, where does that food come from and how does it get to the table, what foods are scarce vs. plentiful. What foods reveal power structures because of their expense, and which reveal different biological leanings due to their edibility vs inedibility. There are so many more questions beyond this, and luckily, we’ve got forty-three episodes and counting at Cooking the Books, some podcasts, some text, to whet your appetite.\n (Caveat: we are also known for our *terrible* puns and our recipes.)\n Is it true Joe Haldeman once taught you how to make a pizza in a foxhole with plastique?\n That is totally true.\n Joe and Gay Haldeman were among the first interviews I did for Cooking the Books and I’d done a lot of research on a couple of topics, including food in The Forever War and The Forever Peace, plus a ton on the history of MREs and C-rations.\n But when our Skype call began, Joe broke into a mischievous smile and asked whether I would want to know how one cooked pizza in a foxhole with plastique (the short answer: very carefully) and I tossed all my research out the window and said: GO!\n You seem to travel far and wide to every convention under the sun. What is it about cons that you love so much?\n Aw, I wish I could go to more cons, actually. What I love? The conversations and the community. I like learning new things and meeting new people. Hearing what they have to say. I also like seeing friends I haven’t seen in a long time.\n Even when I have a big panel list of my own, I try to go to panels and readings in my down time. Sometimes this is hard because cons are tiring too, but often I find that sitting in a panel, just listening, is a great way to recharge.\n What projects are you currently working on? More short stories I hope!\n I’m working on several short stories, a novel or two, revisions, and a secret project to be named later. I’m also preparing for the spring launch of my first Tor.com novella, “The Jewel and Her Lapidary,” which is set in my gem universe, and I’m very excited about that.\n Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem."}