{"fingerprint": "JZf15HOV4L3Khh4hFcGHSQ+9LNo=", "sitename": "Clarkesworld Magazine", "title": "The Odyssey Problem by Chris Willrich", "author": "Chris Willrich", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/willrich_06_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Odyssey Problem by Chris Willrich", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5770 words, short story\nThe Odyssey Problem\nWhen the sparkling golden glow fades and my skin stops feeling like mites are crawling all over it, the Room is gone, and I am shivering in a vast bright chamber and strange people clad in orange, red, and blue pajamas are asking me how I am. I don’t know what to say. I feel lighter, and the air feels cleaner; I am giddy and frightened. The Room is my only home, and now it is gone. Sometimes, in the old times, people would open the door of the Room and someone would stare at me and ask questions. I would never answer. The questions weren’t for me but for my jailers. I didn’t talk much then. I used to promise to be good, but it didn’t seem to matter.\nThese new people do want me to speak, but I am so bewildered I can’t manage to say anything, not even I am so bewildered I can’t manage to say anything. I am taken through a series of corridors, all blazingly bright and full of calming colors, and finally into a place with many beds beneath machines that make gentle sounds. People in blue wave devices over me and inject me with something. I sleep.\nWhen I wake it still seems too bright, but I feel somewhat better, clearer-headed. I am given food, something like what I am used to in the Room but fresher and tastier. I eat with caution at first, then greed. The water is clean. It is like a dream.\nA woman in an orange shirt speaks to me. I look closely. She seems slightly different from the people I’ve seen before at the door of my Room. It is not just her skin color but the shape of her head. I do not think my language is her first language either. She asks, “How are you feeling?”\n“Better,” I say.\n“That’s good. You must have questions.”\nDo I have questions? I wonder. I have food and drink and space to move. I am clean. People are behaving kindly to me. Questions seem superfluous. But I feel as though the woman in orange has a desire to answer questions. So it is for her sake that I try to form them. “Where I am I? Who are you?”\n“This must all seem strange to you. You are aboard the Odyssey.”\n“The-o-di-cy?”\n“It doesn’t translate well. It literally means the story of a man named Odysseus, a traveler from another world long ago and far away. But the connotation is ‘great journey.’ My Odyssey is a Research-Contact-Diplomacy Scout of the Federated Cultural Republic. I am Captain Temple. Do you have a name?”\n“I . . . I don’t remember . . . ”\n“You’ve been terribly treated; I don’t wonder that you’ve lost that memory. The doctor’s begun mental therapies. Perhaps it will come back to you.”\n“I lived in the Room . . . always.”\nCaptain Temple frowns. “Yes. We’ve encountered such Rooms several times in this part of the galaxy.”\n“I don’t understand. There is only one Room. The one in . . . ” I struggle to recall the name of my home. “Emulvain Town. There can only be one Room. Only one person needs to be in it.” I recall hearing this when my jailers answered questions of the people who came to stare at me. “There is only ever need for one Room, one prisoner. I remember that.”\nCaptain Temple’s face is strange to me, so I cannot be certain of her expressions. But I think she is angry. It frightens me, but it becomes clear it’s not me she is angry at. “Do you understand that there are other worlds? Beyond Emulvain Town and its planet?”\nI remember things taught to me before I was chosen for the Room. “Yes.”\n“There are people on some of those worlds. Some resemble your people as much as I resemble you. Others are very different. They have all sorts of ways of living, and all manner of machines. For example, this vessel is similar in basic concept to the watercraft of your home planet, but larger and much more powerful, and it sails space, not the sea.”\n“Yes.” I remember seeing flags fluttering on the boats in the harbor during Summer Festival, long ago.\n“There were once beings as far beyond us as this vessel is beyond your ships. Farther. They were powerful and cruel. They created the Rooms and scattered them on less advanced planets. Each Room has the potential to beam enough energy to power millions upon millions of devices. In time the Room can make a planet a paradise. Abundance for all. No scarcity.”\n“The Room is necessary,” I say.\n“That’s what your people told you, is it? Your world became a utopia because you had a Room. But the beings who made the Rooms gave them special locks of sorts. They can only be activated if an intelligent being is inside, constantly suffering. Like you.”\n“I was necessary.”\n“We think the ones who built the Rooms were trying to make a cruel argument about complicity, testing it out on living worlds. The Rooms aren’t really for you, they’re just talking points in a debate waged by gods.” The captain looks away as if sickened. “I can’t judge your people, really, but I was able to rescue you. I’ve rescued and resettled several victims like you. FCR contact protocols allow interference in cases of outside meddling—”\n“Captain.” A man in blue touches her shoulder. “My patient needs rest.”\n“I’m sorry,” says Captain Temple to both of us. She smiles at me. I think the showing of teeth is meant kindly. “We’ll talk later. Get some rest.”\n“Captain?” I ask, because I know answering questions is something that matters to her, and also because this question matters to me. “What . . . what happens to me?”\n“Once we’re back from these unknown spaces there are many worlds that would take you in.”\n“Can I go home?”\nThe frown returns to her face. “Yes. But it won’t be the same. If a living victim is ever removed from a Room—”\n“Captain,” the man in blue objects again.\n“Rest,” she says.\nMy world is on fire. I learn that days later when I am much recovered and free to roam the Odyssey. That is why Captain Temple frowned. I see the occasional broadcasts that are still possible with the loss of most of the world’s power. When I left the Room my people broke the terms and the Room self-destructed. Civilization toppled like a bunch of toy buildings with the rug tugged out from under them. I am hated by many, celebrated by others. Some even claim me a god who once suffered in flesh, and who has now visited righteous punishment upon the emulvain.\nAll I am certain of, watching the broadcasts, is that I do not want to go back.\nI start learning in earnest as the Odyssey leaves orbit to continue exploring the galaxy. (Among the first things I learn is the meaning of the terms orbit and galaxy.) The crew says I can have a place in the Federated Cultural Republic when they eventually return there. At first I’m eager to study to become a ship’s crew member. They are very polite about that. I gather that refugees from backward worlds (and I must remember, even if my world wasn’t backward before, it is now) often want to become crew. We wish to be treated as special, the only members of our various species who can surpass the dirt and excrement and narrow dimensions of our origins and join the heroes of the stars—as if this salvation was something we had earned. Dazzled, we imagine becoming indispensable to our rescuers.\nI still have that feeling when I tour the engine room.\nThe woman who guides me is wearing red and has devices covering one ear and the opposite eye. Her skin color looks exotic compared to both mine and the captain’s. I ask, perhaps rudely, if loss of organs is a hazard of engineering work. She laughs and says the only hazard of engineering work is drinking too much mipsir. “No, I lost an eye and an ear in a battle with demonkeepers,” she says as she leads me among angled clear pillars swirling with shades of blue like schools of fish made of moonlight. “There was enough neural damage that prosthetics worked better than regrowing the organs. I’m used to it now.”\nI choose among my many questions. “You have battles? There were no battles in Emulvain Town. Only in old stories for little children.”\n“Sadly, kid, we do have battles. Not among ourselves. Arguments, sure. But the planets of the FCR learned long ago that cooperation is better than violence. But it’s a big galaxy, and high technology is no guarantee of high morals, as you well know.”\n“Yes.”\nShe waves a hand. “Out there are cultures that like to impose their will on others. They have no problem wrecking planets in the name of their beliefs.”\n“Like you did.” The words slip out of me as I imagine my planet viewed from space, fires visible on the nightside.\n“What?”\n“Never mind.” I feel I have said something wrong, and for a moment I am afraid they will drag me into a narrow room. Will I feel that way all my life? I wonder. But the engineer in red still seems friendly, just confused. I ask, “Can you show me the, the . . . ” I am learning many new words, and the ship’s Al-Jazari Mechanism whispers new ones in my ear all the time. But I stumble on this one. “Schopenhauer Core? Schoenberg Core?”\nThe engineer laughs. “Right planet, wrong thinkers! It’s called the Schrödinger Core. And sure.”\n“So the person who invented it was Schrödinger?” I ask as she floats me down a wuxia shaft to the lower levels of Engineering. I am asking as much to keep everyone liking me as to learn new things. And I fear being led to another Room, and the questions distract me from that feeling.\n“No, it’s named for the Schrödinger Gems that power our Varuwult Drive. But the gems were named for Schrödinger. He was a scientist who helped one of our member worlds first understand many weird phenomena. He’s famous for a parable about a cat that’s both dead and alive at the same time. The gems are exotic matter with some of that same quality—macroscopic quantum effects—so they got named after the parable.”\nI focus on the simplest of my questions. “A cat?”\n“A small, furred creature. But these aren’t cats.”\nShe’s brought me to a chamber where we can glimpse, through what seems but surely isn’t frosted glass, a set of crystals hovering in a circle of blue lightning. Each crystal seems to shatter and reform so quickly that the fractured and the solid Schrödinger Gems appear superimposed upon each other, broken/whole all at once. I clutch my head and the engineer steers me away from the sight.\n“Easy now,” she says. “A lot of people get that reaction the first time.”\nI’m still holding my hands to my head. “Do you—hear screaming?”\n“Sometimes people experience that the first few times.” She laughs. “The mipsir helps.”\n“What . . . what was Schrödinger’s parable?”\nShe begins telling me about a cat who is stuffed into a small box, and who may be alive or dead, and is in fact somehow alive and dead at the same time. I lose track of the kindly engineer’s explanation and feel tight in my chest. I make polite excuses as soon as I can so I can return to my room. “You’re bright, you know,” says the engineer as she waves me on my way. “You ask good questions. And you’re young yet. If you study hard while you’re on Odyssey, you might make it into the academy on Haivinth, or enlist.” I don’t really understand, but I make myself smile at the compliment.\nI do study when I get back to my quarters. They’ve given me what seems to me a grand cathedral, though I’m assured it’s just the room of a junior officer who volunteered. Its windows look out on either the star-mottled void or the Varuwult Abyss’ seething clouds of color. I shudder for a while, experiencing a strange feeling of solitude and safety. When I do my research I talk to the Mechanism while sitting under a blanket in the corner.\nMy eyes flutter. Sleep is coming, and I fear my dreams. Abruptly, without knowing where the idea comes from, I ask the Mechanism, “Are the Schrödinger Gems alive?”\n“The scientific consensus is no,” it replies. It sounds like a soft-spoken teacher from before the Room. “No crystalline life-forms have been discovered. However, certain panpsychist beliefs attach to the crystals. It is known that the Branching Way believes . . . ”\nIt tells me more, but I fall asleep.\nWhen I awaken it is to a blaring alarm, and the light is tinted red. I leave my quarters, and as I’ve been taught, I ask a panel of glass in the corridor how to get to the captain. Glowing golden arrows in the air lead me through hallways and wuxia shafts to a sort of shadowed steel courtyard with black walls shining with lights and symbols, with a kind of round platform rising at its center like a theater stage. Scores of people mill about on the “street,” drawing pictures of light in the air, sparkles around them forming words. I never fully learned to read, but I doubt these words are in my language anyway. Up on the “stage” are more people, also drawing with light. Above it all is what seems a dark dome speckled with lights. I realize they are stars. Covering some of the stars is something that looks like a huge silver moon covered with holes through which green light blazes forth. I soon realize by its motions it is an object outside our ship.\nCaptain Temple looks down from the stage. “Child! You should go back to your room!”\n“I don’t want to be alone,” I say in a very quiet voice, but somehow the captain understands and beckons me up.\n“Definitely a demonkeeper ship, ma’am,” says a gold-shirted person in a levitating chair surrounded by glowing displays floating in the air. “Over twenty hooshool from any of their known bases.”\n“Please use their chosen name for themselves,” Captain Temple says. “Even if they’re shooting at us. Perhaps especially if they’re shooting at us.”\n“Yes, ma’am. Definitely a Branching Way ship, ma’am.”\n“We are in a dangerous situation,” Captain Temple says as I reach the top. “The Branching Way is maybe a thousand years ahead of us in technology, so every encounter with them must be handled with great care. You need to stay to one side and not get involved.”\n“What do they want?”\n“I don’t know yet. They’ve fired a warning shot but haven’t spoken. We’ve been at odds for centuries. We keep trying to get through to them, but they think we’re backward primitives.”\nA man in red with a surprising number of eyes says, “Captain, they are responding.” Looking up, I see the silver surface of the Branching Way vessel covered with strange twisting writing. “The glyphs say, ‘We know your mission, Odyssey, but you are not welcome here. We will purge the galaxy of the Rooms, and with far less collateral damage. Depart this region.’”\n“Reply,” says the captain, “‘We consider this region free space. And we could help each other. We have destroyed several Rooms already, and we have someone aboard with direct experience of one.’”\nI see the writing change upon the Branching Way ship. “They’re replying,” says the officer in red. “‘Send the victim of the Room to us, and we will spare you the indignity of a destroyed ship and a captured crew. You are little better than those who use the Rooms. We will not leave this child in your hands, barbarians.’”\nCaptain Temple raises her voice. “Send this! ‘We are not barbarians. All are cared for in our Republic. There is no starvation, no exploitation, no war. We do not even eat meat.’”\nThe officer in red’s many eyes squint at his display. He says, “They reply, ‘You are a hierarchical, humanoid-dominated, tribalistic incoherence. You abandon planets to misery with your contact protocols, when you could do much good. You kill innocent plants with relish when you could easily subsist on artificial food. And you torture the gems in your engines. If you are civilized, you are only barely so.’”\n“‘Absurd! Just to address one of your claims, even if the gems were living, they, like the plants, would be of such low order their use would be entirely moral. At worst it would be no more immoral than agriculture. Trillions of intelligent life-forms depend upon the drive.’”\nThe officer in red’s eyes blink as though catching dust. “They say, ‘Enough. Send the child or your ship will be destroyed, and you will all face judgment.’”\nOdyssey shakes. Green fires burst from the Branching Way vessel and the space around Odyssey is blazing blue.\nI can’t understand the displays around me, but I can sense that most of the people in this room are terrified. Their hands shake. Sweat is on many a strange brow. Their initially calm voices are becoming a frantic babble.\n“I’ll go,” I tell the captain. “Whatever it is, it can’t be worse than the Room.”\nThe captain says, “You would do that for people you’ve only just met?”\n“You hadn’t even met me, and you saved me. Of course I will.”\n“They aren’t even humanoid. You may feel very misunderstood and lonely. And despite their claims, I don’t know that they’d treat you well.”\nAlarms are blaring all through this gallery. “Tell them,” I say.\nAgain the glow. Again the feeling that mites are swarming all over me.\nI am not alone this time, however. Captain Temple is holding my hand as we appear aboard the other ship.\nAt first, I think we’ve accidentally arrived on a planet. We are surrounded by purple trees and an abundance of green flowers. Things like winged jellyfish flit through the air. The blue sky above is filled with holes through which the stars blaze in blackness. I see Odyssey through one of them, a tiny white sphere with glowing spindles stretching behind it.\nBarely before I can take this in, something gelatinous, many-tentacled, and huge as my quarters on Odyssey grabs me and pulls me close, tearing me away from Captain Temple.\n“Hug,” it says, and one tentacle injects my head in what seems a dozen places. There is no pain, only numbness.\n“Let her go!” Captain Temple is demanding.\n“Contemplate,” it tells her, and she vanishes. Then the thing sets me down gently upon red, straw-like grass.\nI take a nap.\nI have a dream of being in the Room, shivering in my own filth. A voice comes into my head. It is nothing like the voices of my jailers or their visitors. Nor could it be any of Odyssey’s crew, nor the beings of the Branching Way. It is a voice almost not a voice, but more like the afterimage of words written in fire. That is a strange thing because I’d still been learning to read when I was chosen for the Room. It says:\nIT IS AS I PREDICTED. EVERY LESSER CULTURE ACCEPTS THE SAME BARGAIN. THERE IS ALWAYS A POINT WHERE THE ILLUSION OF MULTIPLIED JOY BECOMES AN EXCUSE FOR HORROR.\nI CONCEDE (comes a response like writing in another hand) THINGS PROGRESSED AS YOU PREDICTED. YET YOUR METHODS PROMOTE THE HORROR YOU DECRY. I WILL STIR MINDS TO OPPOSE YOU IN EVERY SPIRAL ARM AND FIELD OF GRASS. HOLD, ADVERSARY! ONE BECOMES AWARE. LET US WITHDRAW.\nThen all is quiet (or equally valid, the thought-image of the words blurs) and in the silence of the dream the door of the Room opens, not upon the dim hallway in Emulvain Town but upon a forest of purple trees. Everything is misty and my heart trembles with a feeling of imminent potential.\nI awaken in joy. All seems brighter. It is as if I’ve arisen, not just from sleep, but from a shadowy distortion of life. Now, my body seems to tell me, the true life can begin.\n“How do you feel?” comes the voice of the gelatinous being. It is a fresh and lively sound, like crackling ice. I see it looming over me like a glacier filled with rainbows.\n“Better,” I say.\n“Good. We do not fight except at great need. But our rules allow us to rescue captives. I’m happy to have saved you.”\n“I wasn’t a captive,” I object, sitting up. “And you didn’t save me. I volunteered to come, to save them. They were kind to me.”\n“You have a generous spirit. But I’m afraid your understanding is limited. As of yet.”\n“Captain Temple came with me. She refused to let me come alone.”\n“That is true and speaks well of her. In her Republic there are beings with promise, portents of better things to come. She is one of them. I assure you we have treated her well.”\n“You seem to think the people on Odyssey are bad.”\n“Bad? No, child, not ‘bad’ in their own context. They’re a young culture yet. They are still quite singular.”\n“What?”\n“How to say it? Cultures at that stage are focused on numbers as distinct entities, and the metaphor of discrete numbers guides their thinking. They think of sapient beings as purely individual. They also think of sapience as a binary yes-and-no state. You are sapient or you aren’t. In fact sapience is a continuum. All matter has a grain of consciousness, and all life has a dollop of it, and the amount of the stuff of intelligence increases as you move along the continuum; plants, to Schrödinger Gems, to complex animals, to one such as you, and on up to the beings in our own Branching Way.”\n“The gems . . . they really are alive? I wasn’t just imagining it?”\n“Oh yes. I have given you and the captain a serum that enhances your perception of the mentality of all living things. It will aid you in outside-compassion and inside-compassion. Look without and within.”\nEach blade of grass has a tiny blossom on it that looks like a white spiral . . . there are clouds beneath the dome of the sky that drift, combine, and tear apart like alien continents . . . fruits hang on purple trees, pale as the moons over Emulvain Town . . . the stalks of red grass are like tall buildings with tiny many-legged black creatures scurrying like strange city dwellers amid the towers . . .\nIt is like being freed from the Room again. The clouds and trees and grass and creatures have a kind of glow about them that words are unequal to. It is as if natural things had once been all blurred background and now are brightly lit foreground.\nClosing my eyes, I try also to “look within.” I giggle with delight at what I find. My body is a world full of tectonic inhalation and exhalation, volcanic heartbeats, oceans of blood, electrical storms of nerve endings. And my mind is that world’s chief city. There is not a single “me” dwelling there but many. There is a me for every shade of emotion. There is a me who’d belonged to the Room, and who is my will to survive. There is a me who’d known a life before the Room, who is my sense of wonder. There is a me who’d been born aboard Odyssey, a me of curiosity. And there is a me here who stands in the midst of all the others. That version of me opens her eyes and says, “I’ve been trapped. They were trapped.”\nMy companion understands. “And now all your selves are free of tyrannies like your planet and like the Republic. And they will multiply and flourish. They are welcome to live in this worldlet, or, if they like, they may leave the rest of you and go where they wish.”\n“Leave . . . me? Us?”\n“You are thinking in terms of an abstraction, child. If a personality wishes to leave its original body we will free it, by giving it a separate body. Many bodies are possible. Even one such as this.”\n“What does that do to the original?”\n“The original mind expands into the void left behind. In time all is well.”\nI . . . we . . . shiver a little, but the feeling of joy and emancipation is so strong I/we can’t be concerned.\n“Do you wish to stay?” my companion asks.\n“What of Captain Temple and the Odyssey?”\n“We have ceased our attack. But having stepped freely aboard this worldlet, by our most sacred laws she was entitled to awakening.”\n“Take me . . . us . . . to her.”\n“Of course.”\nI/we ride within the gelatinous being, its translucent organs consenting to shuffle aside for us as I bounce within it. Though it looks like ice, its insides are warm. A natural air tube connects us with the outside. It is snug and pleasant, and my many selves mostly enjoy the ride.\nWe find the captain leaning beneath another tree, with a being nearby I at first mistake for a thorny bush. Then we see eyes on the thorns and spot rootlike hands and feet, three of each. “She is many!” the thorned being calls out, and my host answers, “This one is many too.”\nWe are bounced out of my host and land on our feet. We go to the captain. Her eyes are closed. “Ma’am?” I say, as we would aboard the Odyssey.\nShe smiles and focuses on us. “It is good to see you again, child. All of us think so. It’s hard to believe we feared the demonkeepers. The Branching Way, that is.”\n“I . . . we . . . know how you feel. Why did you call them that, we wonder? ‘Demonkeepers.’”\n“We’ve been afraid of them and ‘demonkeepers’ sounds sinister. The Branching Way energy source is analogous to a legend from one of our worlds called a Maxwell’s Demon. It is a particle of matter they believe to be sapient, and which can manipulate the movements of other particles. In so doing it creates order out of entropy, power out of chaos.”\n“If it’s sapient . . . does it do it willingly?”\n“It’s summoned. How to explain . . . it’s summoned out of sapient substrate of the ship itself. It’s similar in concept to the process by which a wayward personality is allowed to be taken from a whole person. Have they talked about that? In this case the particle of thought can’t be reduced. It is only itself. And as it is born willing to serve, it can’t do otherwise.”\n“Wait!” There is a storm across the world of our body; our skin chills. “So they create slaves?”\n“You needn’t put it so crudely, child. The so-called demons love their work by definition. It cannot be otherwise. And they are happier than we.”\nOur various selves are arguing, but there is a fragile consensus. “Captain, we have to speak out against this.”\n“There is nothing to speak out against. Not here. No, it is to our own backward civilization that we must return to, to end the barbaric practice of trapping and torturing the Schrödinger Gems. We cannot look away from that. From there we will fight against hierarchical organizations like the Fleet, and the eating of living things—”\n“Plants, you mean?”\n“Yes. But first the gems.” The captain looks at the members of the Branching Way. “Friends. We ask that you release the part of us that longs to return to Odyssey.”\n“That is its right,” says the thorn-being, and it and the captain vanish, leaving us beside the gelatinous being on the hill.\n“There is so much wonder to be found,” we say, “and so much joy. But we must challenge your use of the Maxwell’s Demons.”\n“That is a naïve way of describing the Bright Joyous Ones.”\n“Nevertheless.”\n“You are very young yet. In the Branching Way you will be kept healthy and strong and be freed of diseases and mental turmoil you are not even aware of now. In time you will understand that there is nothing wrong with birthing a being like what you call a ‘Maxwell’s Demon,’ if it is guaranteed joy. It is much better than reproducing in a backward system, where your offspring are bound to know sorrow.”\n“We can’t speak to that.”\n“You have no grievances toward your parents? They who conceived and birthed you knowing there was a nonzero chance you would be one day fed to the Room?”\nWe lean back against the purple tree, contemplating its pale fruit. “We don’t think they knew any better.”\n“But you do. Or you will.”\n“We will stay, friend. But we think we will challenge your perspective. Just a little.”\nBut suddenly something is wrong. There is no red light, no siren, but the wind roars and the flying creatures shriek and scatter and sanguine leaves blow across our view. “We see,” says the gelatinous being to the air. “We will take action.”\nOur icy-looking friend leans toward us, all warmth and rainbows. “There is a crisis.”\n“Another ship?”\n“No, not another ship. A crisis within you.”\n“What?”\n“You are holding a personality against their will. A defiant, contrary one that can never fully accept happiness. By our sacred laws they must be freed from you.”\n“What? You can just declare that a part of someone’s mind wants to be free?”\n“Injustice is injustice, on any scale. The separateness of beings is an abstraction. It cannot be used to justify evil. Once that one is free of you, you can all know joy again.”\n“We know joy now!”\n“You are very young.”\nEverything goes dark.\nThere are two of me now, or rather two bodies that look like me. One remains with the Branching Way as they journey through the galaxy on their grand missions. What is beamed back with the captain to the Odyssey (that dilapidated scow trapped in this muddy little bay of the cosmic gulf) is, I’ve come to understand, the part of me that is most contrary. It is simultaneously the part of me that condemns the enslavement of the Bright Joyous Ones and the part of me that forgives my parents for giving me up to the Room. What was left behind knows unambiguous joy.\nWhat do I know? (For I am merely an I now without my friend’s serum.) Perhaps a few things, light and dark.\nCaptain Temple is not the same. She’s been relieved of duty pending a review on her home world. Over mugs of mipsir, we come to understand one another. She once thought herself to stand on an ethical and moral peak, and now she knows it was just a tall hill. She is desperate to claim the giddy heights, and so she will labor to free the gems. It will be a hard road. There will be a resignation, and research, and a movement, and a challenge that may extend past her lifetime. It seems to suit her, this goal.\nI, who came from a valley of shadow, find it easier to accept my lowly state. Only once do I suggest to her that the creation of intelligent beings that have no choices may be worse than confining (perhaps) animal intelligences to our engines. And only once do I suggest that the destruction of the Rooms might be more urgent. Her furious gaze is more eloquent than her words. For demons and Rooms do not stand as condemnations of her or her culture. So they do not really matter.\nI can’t prove my own intuitions, and I am but a sinner from the valley. But I am quite sure that there are, somewhere, mountains of understanding that dwarf those upon which my other self stands. A dream-memory nags at me, a sense that if I could shake off my illusions, I could gaze down upon all those peaks of understanding like a fiery bird on the wing. The memory fades.\nYet a week later I have one more encounter with the heights.\nIt may be mad coincidence. It may be that I misremember my own thought processes. But it seems to me on the very day I make my choice of future, the beaming room activates of its own accord, and my other self appears on the grid, tunic torn and burned.\nOn hearing the news, I rush from Odyssey’s library to the medical core. I see my mirror self telling the blue-clad doctors, “Our ship ventured into the Gossamer Rift, where none of the Branching Way had gone before. There a Cosmic Child scolded us on our crimes. It told us we erred.”\n“Was it about the Bright Joyous Ones?” I ask, stepping forward with hands still full of memory crystals from the library.\nThe other’s eyes spear me. “It told us we were criminals because we had the capacity to turn all the matter of our ship into self-willed Bright Joyous Ones and did not choose to do so. So it did it for us.” They point a shaking hand toward their body. “Our friends threw us into the long-range beam at the last moment. To find my only home. You.”\nThe other looks this way and that at what I see as a soothing place of healing and knowledge, and what they see as an ancient torture chamber. And neither of us is wrong.\nThe problem, you see, is ever with us.\nI drop memory crystals flickering with labels like signposts to my chosen future: Emergency Shelters for Planetary-Scale Crises, Principles of Global Power Generation, Basics of Trans-Species Medicine, and Low-Technology Agricultural Sufficiency. I want to envelop my other self with wings.\nLike Captain Temple did for me, what seems so long ago, I take their hand. Imperfect flesh to imperfect flesh.\nI say, “This is not your only home.”\nChris Willrich’s work has appeared in such venues as Asimov’s, Beneath Ceaseless Skies, Fantasy & Science Fiction, Lightspeed, Strange Horizons, and Tales from the Magician’s Skull. His books include The Scroll of Years (Pyr, 2013) and its sequels. He lives in Mountain View, California with his family."}