{"fingerprint": "TYkPQeTiwNFyStTqFD16G+LLMZU=", "sitename": "Clarkesworld Magazine", "title": "Interview with Sean Williams by Tobias S. Buckell", "author": "Tobias S Buckell", "date": "2022-01-01 00:00:00", "source": "https://clarkesworldmagazine.com/williams_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Interview with Sean Williams by Tobias S. Buckell", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nAn Interview with Sean Williams\nSean Williams calls Adelaide, Australia, his home. Living in the flat and dusty South Australian landscape, his fantasy novels, particularly the Books of the Cataclysm, strongly resonate with the landscape he calls home.\nI first became aware of Sean shortly after winning the Writers of The Future contest in 2000. Sean, a winner from years previous, had lived the sort of career I dreamed of having. And his books sat in my shelf of a bursting canon of Commonwealth writers from Scotland, Canada, and Australia that I felt forced new life into my favourite sub-genre: Space Opera. With co-author Shane Dix his Geodesica series really packed an intense amount of invention, world building, and adventure into some crazy fun reads.\nI’m not the only who digs on Sean’s work. He’s snagged the Ditmar and Aurealis awards several times. I caught up to him via email with a series of questions that, if only he didn’t live clear on the other side of the Earth from me, I would have loved to have asked him over a drink:\nYou live in South Australia, and seem to be part of a wave of Australian writers that are really building up and getting attention worldwide. Do you attribute that to any sort of zeitgeist? And what do you think living in that particular area brings to your work, or the work of your peers, that isn’t being done in other places?\nHarlan Ellison gave a talk to a bunch of people in Canberra back in the 1990s in which he described the scene then as a Golden Age of Australian speculative fiction. If it was gold then, I don’t know what it is now. Platinum, perhaps, or something even more precious. The scene has really exploded in the last decade, with so many new writers coming up the ranks and so many of us old pros selling overseas that it’s very difficult now to remember what it was like when I first started. Then, you could’ve counted the number of US sales on a couple of hands. Now, there are established writers like Sara Douglass, Greg Egan, Garth Nix, Trudi Canavan, and Lian Hearn continuing their already successful careers, with relatively new names like Karen Miller, Joel Shepherd and Justine Larbalestier bursting onto the world stage behind them. It’s a very exciting time, whatever you call it.\nThe issue of “Australianness” is a vexed one, one I’ve been pondering for many years, because it’s almost impossible to pin down, let alone identify the source. In my writing, particularly in my fantasy series, my personal background and experiences come forward through the landscape, which is very different from the Tolkienesque stage: no big mountains, no flowing rivers, no forests, no snow. I can’t write about these things with any kind of truth because I’ve never personally experienced them. Where I grew up, here in SA, there are no mountains, rivers, forests, or snow. It’s flat and old and dry and full of its own kind of magic. That’s what I try to capture in my novels; that’s where my heart lies.\nIt used to bother me that other Australian fantasy writers don’t often use this landscape too. I used to think that it was a kind o post-colonial betrayal of our heritage. Now I know that my version of Australia is different from that experienced by most Australians. Most Australians live on the continent’s East coast, where there are mountains, rivers, forests and snow, and their version of Australia is just as valid as mine. The Outback is just one part of a very large continent, and it’s one a lot of people here never experience.\nFollowing up on the question about your location, do you find it tough to reach readers in the US?\nMost of my books seem to reach them, which is great. Certainly the science fiction has no problem with the tyranny of distance. In fact, my agent first took me on because the book I had shopped to him read like it had been written by an American (I took that as a compliment <g>). The fantasy is trickier. The Books of the Change, my YA fantasy series that is particularly steeped in Australianness, never sold in the US, and I wonder sometimes if that’s because of a certain nervousness about the setting. I don’t know. It puzzles me, but I don’t lose any sleep over it any more.\nOr do you mean physically reaching readers in the US? That is a concern. I’d love to come across more often, to cons or to do signings, but the length of the trip is starting to weigh on me as I get older. Coming across once a year for the Writers of the Future contest celebrations and sticking around for WorldCon if it’s nearby is about all I can manage at the moment. It’s nothing personal, honest. 🙂\nIn your Books of the Cataclysm series, you seem to be trying to create your own religion, but one that is based on a synthesis of myths, legends, and religious beliefs from around the world. It’s as if all our religions were looking into a small portion of a larger room, and you’re stitching it together for great effect. Did you plan this out before writing your novels, or did it come organically as you wrote?\nI spent a very long time working on the religious background to the Books of the Cataclysm. Really, it started when my father chose to become a priest during my early high school years. I witnessed the study he undertook from the sidelines, and became fascinated with the idea of faded myths—stories (such as Noah’s Ark) that one culture appropriates from another and adopts as their own. Once it occurred to me that all religion can be viewed as a bunch of great stories that people take entirely too seriously, it was just a short hop sideways to the atheist I remain today—one who denies the existence of both deities and the afterlife but is endlessly fascinated with other people’s fascination with the same.\nIn constructing the world of the Cataclysm, I asked myself two questions. The first was: what kind of religion could I buy into, if I had to? The second begins with the thought that, if there really is some truth to one religion, maybe there’s some truth to all of them but none of them get it entirely right. If that’s the case, what is the bigger picture everyone isn’t quite seeing? What’s the elephant the three blind men keep misidentifying?\nYears of reading about religion encouraged me to keep several aspects: reincarnation, for instance, and also the idea of an afterlife. So my made-up religion has a cycle of life that takes a person through death to an afterlife, but doesn’t stop there; they can die in that afterlife and move to another one; they then die there too, and find themselves back where they started, in this world, in a new life. Some cultures have the idea of more than one soul, so that tied in nicely too.\nSimilarly, it’s a pantheistic world, with deities and demons and angels and whatnot, but there is a big kahuna who stands in as the One God. The suggestion that it might be an alien intent on eating human souls does separate it a tad from what most religions tell us God is today, but I can imagine how a glimpse of one could be mistaken for the other.\nThe other thing I was trying to do in the Books of the Cataclysm was to see what a theistic universe might look like in which the principles of Darwinism also operated. Most modern writers working in this area (that I’ve come across, anyway) tend to deal with the two concepts as though they’re mutually exclusive, as though the Scopes trial meant the two could never be put back together. By putting the two back together—by operating on the assumption that both the pantheon and the environment it exists in are mutable—I found an immensely complex landscape opening up before, one I could barely contain in four fat books.\nI sometimes joked with Lou Anders that if the books didn’t do well, I could always found my own religion. It’s still tempting to set up the website and see what happens. The idea of waging a spiritual war against the invader of the afterlife must surely appeal to someone, surely . . . *smile*\nYou also additionally seem to be able to jump into various genres without hesitation. Your earlier books, co-written with Shane Dix, are sheer adventurous Space Operas, but then you move from spaceships to magically powered airships in your Cataclysm series. What do you seek out in different genres when you’re writing these very different books?\nNothing more sophisticated than variety, probably. There are times I wish I was good at writing one thing, which I could churn out indefinitely, without confusing marketing departments or bookstores or even readers (although I think most of my fans cope with it perfectly well). But like a lot of people, maybe most people, I read wildly and I get ideas in lots of different genres, and I become stale if I stick in one spot for long. So it’s not as if I’m looking for something, specifically, when I hop from genre to genre. I’m drawn there by the stories that demand to be told.\nThat said, there certain issues you can explore in space opera that are extremely difficult to even talk about anywhere else. If I want to see what a million year-old human might be like, say; or if I want my characters to interact with a mind as large as an entire galaxy; or if I want to explore the nature of a life form that evolved in the fiery chaos of the post-Big Bang inflationary period; etc. I don’t think I’ll ever get tired of writing space opera, because that would be like getting tired of space itself, and that is inconceivable to me.\nIn your SF novels you explore the changing nature of humanity, through evolution and technology. Can you talk a bit about ways you think we’re changing right now?\nThere’s been a lot of talk recently about Generation Y’s new take on privacy. New for most people: I’ve always thought the issue handled hysterically by the media and commentators on the Internet (but that’s a whole other topic). That’s a hefty social change creeping up on us that may make a big difference to the way we go about life this century. People’s attitudes to body modification are changing: not just augmented breasts, but enhanced physical performance, life extension, and various reproductive options are all being seriously explored at the moment. This isn’t news, and again the knee-jerk reactions are still strong, but I’m sure that when someone faced with age or just wanting to be fitter in generally is handed the option to improve their lot, why wouldn’t they take it? We’re greedy. We love life, and we’ll take it if we can get it.\nThere are so many hurdles ahead, and so many social divides we’ll have to get across. Euthanasia and abortion are just two that the US and other countries (like my own) will need to grapple with if we’re going to have sustainable cultures wherein people can expect to live long, happy lives.\nI am hopeful, but bracing myself for the rocky road ahead.\nHow do these views then, affect the way you approach writing characters in your novels?\nFundamentally. For every future society I’ve created—from my first novel, Metal Fatigue, set at the end of this century, to the one I’m working on at the moment, set over a million years in the future—I try to consider what concerns the characters will have on a day-to-day level, as well as across the broader canvas of the story. How do they eat, sleep, clean their teeth, dress, procreate, defecate, whatever? What kind of intimate problems will absorb their attention? How will they resolve them?\nI also spend a lot of time finding ways to make them characters that we can identify with, since there’s a likelihood that people in the future will be as alien to us as we would seem to our Cro Magnon ancestors. I’ll confess to being very harsh on space opera that has people just like us wandering through the pages. We don’t have Cro Magnon types any more, so why would our descendants—unless there’s a conscious reason for it, like human development has been frozen genetically or perhaps as a kind of fashion or ideological statement, or whatever? If I can’t see the reason embedded in the fabric of the culture, then I won’t keep reading—and I try to be just as hard on my own books. So far, I’ve had several cultures in which present-day humans exists as part of a spectrum of human experience, existing side-by-side with other more or less evolved types, but I’ve also had modern humanity preserved by faulty transporter “cloning” and by the kind of cultural momentum I think our own culture—the most observed and recorded in history—will generate. As time passes, our legacy will loom very large over subsequent generations, particularly as members of our present generation may live across many more to come. In my latest novel, Saturn Returns, several characters are referred to who were born in our time and are still alive, playing important roles, in the year 879,000AD.\nYou also write a dark fantasy series for children. What is the difference between the way you approach these books and your other books?\nWhen I’m writing fantasy, I have to switch off the part of my brain that wants to know how everything works. Not entirely, of course: characters and cultures still need to be thought through, and the magic system I use has to be internally consistent as well. But the nuts and bolts of it all have to stay behind the curtain; otherwise I’d never get off page one.\nWhen I’m writing for kids, the only concession I make is that I need to get from A to B more quickly than I could with adults. There’s no time for lingering descriptions or in-depth characterisation. It has to be immediate, concise, vivid, from the plot down—or up, or out, depending on how you imagine stories coming together. I love the fact that I can get down a whole novel’s worth of story—world-building, character arcs, the lot—into a book that’s one third the size of my usual novels. It’s both immensely challenging and immensely liberating. My adult books are shrinking because of it. Sometimes I wonder if after this series I’ll ever be able to write a fat fantasy novel again.\nIn all my fantasy books, bar one, there have been kids or young adults involved. That’s a very clear break from my SF novels, which are uniformly peopled by characters with adults concerns (even if some of them are technically very youthful, such as the gestalt mind Isaac Deangelis in Geodesica). I enjoy the emotional intensity of younger characters, and I think that fits better in fantasy. The kids’ series I have coming out next year contains some of the rawest, most painful writing I’ve ever attempted. Why I felt freer to go that way with a book for 10 year-olds rather than a book for adults is still something I’m trying to nut out.\nIn addition to Space Opera, Fantasy, and YA literature, you’ve also written media novels. Did you enjoy that experience as much as writing your own original fiction?\nOh yeah. Who wouldn’t enjoy writing lines for the Doctor or Darth Vader? Well, maybe not everyone, but I certainly do. And I get paid for it, which makes it a bit of a no-brainer for me.\nMy take on media writing is this: I’d never write a book about people I’m not passionately engaged with. (Why would I? It’s bloody hard work and the money isn’t that great.) So if I click with a particular franchise and the project sounds like fun, I’ll try to work it into my schedule of original novels. If a media project fails any of those criteria, I won’t do it. I want to be absolutely sure I can give a media book as much attention as I would one of my own because my fellow fans of the franchise deserve nothing less.\nThere are franchises I’d never write for because I don’t know them well enough, or just don’t care enough. And there are franchises I would cut off my left arm to write for. We don’t always get what we want, but I feel very lucky that I’ve been able to work in the universes I have—by they my own or George Lucas’s or whoever’s. That I plan to keep doing it even though sometimes it means taking a pay-cut speaks volumes, I hope.\nWhat are you reading these days, for your own enjoyment?\nLet’s see what’s in my to-read stack . . . A memoir on deafness; an anthology of colonial Australian Gothic fiction; novels by Angela Carter, Patrick O’Brien and Lee Child; The Player of Games by Iain Banks; two anthologies containing pieces by writers who’ve been imprisoned, tortured or killed for speaking out against injustice in their home countries; and a long line of books by friends (including two of your own, TB) that I feel bad for not having got to sooner. Some of this is for work, but in a real sense all reading is for work these days. Even when my conscious critical faculties are off, I’m still absorbing technique subliminally. It’s the best way to learn.\nWhen I’m busy writing speculative fiction, my reading-for-pleasure tends to be crime and thrillers. Between deadlines is when I catch up on genre stuff. I think my brain can only take so much of one genre at a time. Or maybe I’m too close to the field now—after 25 novels in 10 years, or whatever the count is—to switch off those critical faculties like I did when I was a kid. That would be a shame, though, so I’ll run with my first theory . . .\nThanks a bunch for answering these questions!\nMy pleasure!\nCalled \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.\nHis Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"\nHe currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs."}