{"fingerprint": "uN8yltKNeOyWwwhv5CEkAc2aIR8=", "sitename": "Clarkesworld Magazine", "title": "Daddy's World by Walter Jon Williams", "author": "Walter Jon Williams", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/williams_12_15_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Daddy's World by Walter Jon Williams", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10250 words, novelette, REPRINT\nDaddy's World\nOne day Jamie went with his family to a new place, a place that had not existed before. The people who lived there were called Whirlikins, who were tall thin people with pointed heads. They had long arms and made frantic gestures when they talked, and when they grew excited threw their arms out wide to either side and spun like tops until they got all blurry. They would whirr madly over the green grass beneath the pumpkin-orange sky of the Whirlikin country, and sometimes they would bump into each other with an alarming clashing noise, but they were never hurt, only bounced off and spun away in another direction.\nSometimes one of them would spin so hard that he would dig himself right into the ground, and come to a sudden stop, buried to the shoulders, with an expression of alarmed dismay.\nJamie had never seen anything so funny. He laughed and laughed.\nHis little sister Becky laughed, too. Once she laughed so hard that she fell over onto her stomach, and Daddy picked her up and whirled her through the air, as if he were a Whirlikin himself, and they were both laughing all the while.\nAfterwards, they heard the dinner bell, and Daddy said it was time to go home. After they waved goodbye to the Whirlikins, Becky and Jamie walked hand-in-hand with Momma as they walked over the grassy hills toward home, and the pumpkin-orange sky slowly turned to blue.\nThe way home ran past El Castillo. El Castillo looked like a fabulous place, a castle with towers and domes and minarets, all gleaming in the sun. Music floated down from El Castillo, the swift, intricate music of many guitars, and Jamie could hear the fast click of heels and the shouts and laughter of happy people.\nBut Jamie did not try to enter El Castillo. He had tried before, and discovered that El Castillo was guarded by La Duchesa, an angular forbidding woman all in black, with a tall comb in her hair. When Jamie asked to come inside, La Duchesa had looked down at him and said, “I do not admit anyone who does not know Spanish irregular verbs!” It was all she ever said.\nJamie had asked Daddy what a Spanish irregular verb was—he had difficulty pronouncing the words—and Daddy had said, “Some day you’ll learn, and La Duchesa will let you into her castle. But right now you’re too young to learn Spanish.”\nThat was all right with Jamie. There were plenty of things to do without going into El Castillo. And new places, like the country where the Whirlikins lived, appeared sometimes out of nowhere, and were quite enough to explore.\nThe color of the sky faded from orange to blue. Fluffy white clouds coasted in the air above the two-story frame house. Mister Jeepers, who was sitting on the ridgepole, gave a cry of delight and soared toward them through the air.\n“Jamie’s home!” he sang happily. “Jamie’s home, and he’s brought his beautiful sister!”\nMister Jeepers was diamond-shaped, like a kite, with his head at the topmost corner, hands on either sides, and little bowlegged comical legs attached on the bottom. He was bright red. Like a kite, he could fly, and he swooped through in a series of aerial cartwheels as he sailed toward Jamie and his party.\nBecky looked up at Mister Jeepers and laughed from pure joy. “Jamie,” she said, “you live in the best place in the world!”\nAt night, when Jamie lay in bed with his stuffed giraffe, Selena would ride a beam of pale light from the Moon to the Earth and sit by Jamie’s side. She was a pale woman, slightly translucent, with a silver crescent on her brow. She would stroke Jamie’s forehead with a cool hand, and she would sing to him until his eyes grew heavy and slumber stole upon him.\n“The birds have tucked their heads\nThe night is dark and deep\nAll is quiet, all is safe,\nAnd little Jamie goes to sleep.”\nWhenever Jamie woke during the night, Selena was there to comfort him. He was glad that Selena always watched out for him, because sometimes he still had nightmares about being in the hospital. When the nightmares came, she was always there to soothe him, stroke him, sing him back to sleep.\nBefore long the nightmares began to fade.\nPrincess Gigunda always took Jamie for lessons. She was a huge woman, taller than Daddy, with frowzy hair and big bare feet and a crown that could never be made to sit straight on her head. She was homely, with a mournful face that was ugly and endearing at the same time. As she shuffled along with Jamie to his lessons, Princess Gigunda complained about the way her feet hurt, and about how she was a giant and unattractive, and how she would never be married.\n“I’ll marry you when I get bigger,” Jamie said loyally, and the Princess’ homely face screwed up into an expression of beaming pleasure.\nJamie had different lessons with different people. Mrs. Winkle, down at the little red brick schoolhouse, taught him his ABCs. Coach Toad—who was one—taught him field games, where he raced and jumped and threw against various people and animals. Mr. McGillicuddy, a pleasant whiskered fat man who wore red sleepers with a trapdoor in back, showed him his magic globe. When Jamie put his finger anywhere on the globe, trumpets began to sound, and he could see what was happening where he was pointing, and Mr. McGillicuddy would take him on a tour and show him interesting things. Buildings, statues, pictures, parks, people. “This is Nome,” he would say. “Can you say Nome?”\n“Nome,” Jamie would repeat, shaping his mouth around the unfamiliar word, and Mr. McGillicuddy would smile and bob his head and look pleased.\nIf Jamie did well on his lessons, he got extra time with the Whirlikins, or at the Zoo, or with Mr. Fuzzy, or in Pandaland. Until the dinner bell rang, and it was time to go home.\nJamie did well with his lessons almost every day.\nWhen Princess Gigunda took him home from his lessons, Mister Jeepers would fly from the ridgepole to meet him, and tell him that his family was ready to see him. And then Momma and Daddy and Becky would wave from the windows of the house, and he would run to meet them.\nOnce, when he was in the living room telling his family about his latest trip through Mr. McGillicuddy’s magic globe, he began skipping about with enthusiasm, and waving his arms like a Whirlikin, and suddenly he noticed that no one else was paying attention. That Momma and Daddy and Becky were staring at something else, their faces frozen in different attitudes of polite attention.\nJamie felt a chill finger touch his neck.\n“Momma?” Jamie said. “Daddy?” Momma and Daddy did not respond. Their faces didn’t move. Daddy’s face was blurred strangely, as if it been caught in the middle of movement.\n“Daddy?” Jamie came close and tried to tug at his father’s shirt sleeve. It was hard, like marble, and his fingers couldn’t get a purchase at it. Terror blew hot in his heart.\n“Daddy?” Jamie cried. He tried to tug harder. “Daddy! Wake up!” Daddy didn’t respond. He ran to Momma and tugged at her hand. “Momma! Momma!” Her hand was like the hand of a statue. She didn’t move no matter how hard Jamie pulled.\n“Help!” Jamie screamed. “Mister Jeepers! Mr. Fuzzy! Help my Momma!” Tears fell down his face as he ran from Becky to Momma to Daddy, tugging and pulling at them, wrapping his arms around their frozen legs and trying to pull them toward him. He ran outside, but everything was curiously still. No wind blew. Mister Jeepers sat on the ridgepole, a broad smile fixed as usual to his face, but he was frozen, too, and did not respond to Jamie’s calls.\nTerror pursued him back into the house. This was far worse than anything that had happened to him in the hospital, worse even than the pain. Jamie ran into the living room, where his family stood still as statues, and then recoiled in horror. A stranger had entered the room—or rather just parts of a stranger, a pair of hands encased in black gloves with strange silver circuit patterns on the backs, and a strange glowing opalescent face with a pair of wraparound dark glasses drawn across it like a line.\n“Interface crashed, all right,” the stranger said, as if to someone Jamie couldn’t see.\nJamie gave a scream. He ran behind Momma’s legs for protection.\n“Oh shit,” the stranger said. “The kid’s still running.”\nHe began purposefully moving his hands as if poking at the air. Jamie was sure that it was some kind of terrible attack, a spell to turn him to stone. He tried to run away, tripped over Becky’s immovable feet and hit the floor hard, and then crawled away, the hall rug bunching up under his hands and knees as he skidded away, his own screams ringing in his ears . . .\nHe sat up in bed, shrieking. The cool night tingled on his skin. He felt Selena’s hand on his forehead, and he jerked away with a cry.\n“Is something wrong?” came Selena’s calm voice. “Did you have a bad dream?” Under the glowing crescent on her brow, Jamie could see the concern in her eyes.\n“Where are Momma and Daddy?” Jamie wailed.\n“They’re fine,” Selena said. “They’re asleep in their room. Was it a bad dream?”\nJamie threw off the covers and leaped out of bed. He ran down the hall, the floorboards cool on his bare feet. Selena floated after him in her serene, concerned way. He threw open the door to his parents’ bedroom and snapped on the light, then gave a cry as he saw them huddled beneath their blanket. He flung himself at his mother, and gave a sob of relief as she opened her eyes and turned to him.\n“Something wrong?” Momma said. “Was it a bad dream?”\n“No!” Jamie wailed. He tried to explain, but even he knew that his words made no sense. Daddy rose from his pillow, looking seriously at Jamie, and then turned to ruffle his hair.\n“Sounds like a pretty bad dream, trouper,” Daddy said. “Let’s get you back to bed.”\n“No!” Jamie buried his face in his mother’s neck. “I don’t want to go back to bed!”\n“All right, Jamie,” Momma said. She patted Jamie’s back. “You can sleep here with us. But just for tonight, okay?”\n“Wanna stay here,” Jamie mumbled. He crawled under the covers between Momma and Daddy. They each kissed him, and Daddy turned off the light. “Just go to sleep, trouper,” he said. “And don’t worry. You’ll only have good dreams from now on.”\nSelena, faintly glowing in the darkness, sat silently in the corner. “Shall I sing?” she asked.\n“Yes, Selena,” Daddy said. “Please sing for us.”\nSelena began to sing,\nThe birds have tucked their heads,\nThe night is dark and deep\nAll is quiet, all is safe,\nAnd little Jamie goes to sleep.\nBut Jamie did not sleep. Despite the singing, the dark night, the rhythmic breathing of his parents and the comforting warmth of their bodies.\nIt wasn’t a dream, he knew. His family had really been frozen. Something, or someone, had turned them to stone. Probably that evil disembodied head and pair of hands. And now, for some reason, his parents didn’t remember.\nSomething had made them forget.\nJamie stared into the darkness. What, he thought, if these weren’t his parents? If his parents were still stone, hidden away somewhere? What if these substitutes were bad people—kidnappers or worse—people who just looked like his real parents? What if they were evil people who were just waiting for him to fall asleep, and then they would turn to monsters, with teeth and fangs and a horrible light in their eyes, and they would tear him to bits right here in the bed . . .\nTalons of panic clawed at Jamie’s heart. Selena’s song echoed in his ears. He wasn’t going to sleep! He wasn’t!\nAnd then he did. It wasn’t anything like normal sleep—it was as if sleep was imposed on him, as if something had just ordered his mind to sleep. It was just like a wave that rolled over him, an irresistible force, blotting out his senses, his body, his mind . . .\nI won’t sleep! he thought in defiance, but then his thoughts were extinguished.\nWhen he woke he was back in his own bed, and it was morning, and Mister Jeepers was floating outside the window. “Jamie’s awake!” he sang. “Jamie’s awake and ready for a new day!”\nAnd then his parents came bustling in, kissing him and petting him and taking him downstairs for breakfast.\nHis fears seemed foolish now, in full daylight, with Mister Jeepers dancing in the air outside and singing happily.\nBut sometimes, at night while Selena crooned by his bedside, he gazed into the darkness and felt a thrill of fear.\nAnd he never forgot, not entirely.\nA few days later Don Quixote wandered into the world, a lean man who frequently fell off his lean horse in a clang of homemade armor. He was given to making wan comments in both English and his own language, which turned out to be Spanish.\n“Can you teach me Spanish irregular verbs?” Jamie asked.\n“Sí, naturalmente,” said Don Quixote. “But I will have to teach you some other Spanish as well.” He looked particularly mournful. “Let’s start with corazón. It means ‘heart.’ Mi corazón,” he said with a sigh, “is breaking for love of Dulcinea.”\nAfter a few sessions with Don Quixote—mixed with a lot of sighing about corazóns and Dulcinea—Jamie took a grip on his courage, marched up to El Castillo, and spoke to La Duchesa.\n“Pierdo, sueño, haría, ponto!” he cried.\nLa Duchesa’s eyes widened in surprise, and as she bent toward Jamie her severe face became almost kindly. “You are obviously a very intelligent boy,” she said. “You may enter my castle.”\nAnd so Don Quixote and La Duchesa, between the two of them, began to teach Jamie to speak Spanish. If he did well, he was allowed into the parts of the castle where the musicians played and the dancers stamped, where brave Castilian knights jousted in the tilting yard, and Señor Esteban told stories in Spanish, always careful to use words that Jamie already knew.\nJamie couldn’t help but notice that sometimes Don Quixote behaved strangely. Once, when Jamie was visiting the Whirlikins, Don Quixote charged up on his horse, waving his sword and crying out that he would save Jamie from the goblins that were attacking him. Before Jamie could explain that the Whirlikins were harmless, Don Quixote galloped to the attack. The Whirlikins, alarmed, screwed themselves into the ground where they were safe, and Don Quixote fell off his horse trying to swing at one with his sword. After poor Quixote fell off his horse a few times, it was Jamie who had to rescue the Don, not the other way around.\nIt was sort of sad and sort of funny. Every time Jamie started to laugh about it, he saw Don Quixote’s mournful face in his mind, and his laugh grew uneasy.\nAfter a while, Jamie’s sister Becky began to share Jamie’s lessons. She joined him and Princess Gigunda on the trip to the little schoolhouse, learned reading and math from Mrs. Winkle, and then, after some coaching from Jamie and Don Quixote, she marched to La Duchesa to shout irregular verbs and gain entrance to the El Castillo.\nAround that time Marcus Tullius Cicero turned up to take them both to the Forum Romanum, a new part of the world that had appeared to the south of the Whirlikins’ territory. But Cicero and the people in the Forum, all the shopkeepers and politicians, did not teach Latin the way Don Quixote taught Spanish, explaining what the new words meant in English, they just talked Latin at each other and expected Jamie and Becky to understand. Which, eventually, they did. The Spanish helped. Jamie was a bit better at Latin than Becky, but he explained to her that it was because he was older.\nIt was Becky who became interested in solving Princess Gigunda’s problem. “We should find her somebody to love,” she said.\n“She loves us,” Jamie said.\n“Don’t be silly,” Becky said. “She wants a boyfriend.”\n“I’m her boyfriend,” Jamie insisted.\nBecky looked a little impatient. “Besides,” she said, “it’s a puzzle. Just like La Duchesa and her verbs.”\nThis had not occurred to Jamie before, but now that Becky mentioned it, the idea seemed obvious. There were a lot of puzzles around, which one or the other of them was always solving, and Princess Gigunda’s lovelessness was, now that he saw it, clearly among them.\nSo they set out to find Princess Gigunda a mate. This question occupied them for several days, and several candidates were discussed and rejected. They found no answers until they went to the chariot race at the Circus Maximus. It was the first race in the Circus ever, because the place had just appeared on the other side of the Palatine Hill from the Forum, and there was a very large, very excited crowd.\nThe names of the charioteers were announced as they paraded their chariots to the starting line. The trumpets sounded, and the chariots bolted from the star as the drivers whipped up the horses. Jamie watched enthralled as they rolled around the spina for the first lap, and then shouted in surprise at the sight of Don Quixote galloping onto the Circus Maximus, shouting that he was about to stop this group of rampaging demons from destroying the land, and planted himself directly in the path of the oncoming chariots. Jamie shouted along with the crowd for the Don to get out of the way before he got killed.\nFortunately Quixote’s horse had more sense than he did, because the spindly animal saw the chariots coming and bolted, throwing its rider. One of the chariots rode right over poor Quixote, and there was a horrible clanging noise, but after the chariot passed, Quixote sat up, apparently unharmed. His armor had saved him.\nJamie jumped from his seat and was about to run down to help Don Quixote off the course, but Becky grabbed his arm. “Hang on,” she said, “Someone else will look after him, and I have an idea.”\nShe explained that Don Quixote would make a perfect man for Princess Gigunda.\n“But he’s in love with Dulcinea!”\nBecky looked at him patiently. “Has anyone ever seen Dulcinea? All we have to do is convince Don Quixote that Princess Gigunda is Dulcinea.”\nAfter the races, they found that Don Quixote had been arrested by the lictors and sent to the Lautumiae, which was the Roman jail. They weren’t allowed to see the prisoner, so they went in search of Cicero, who was a lawyer and was able to get Quixote out of the Lautumiae on the promise that he would never visit Rome again.\n“I regret to the depths of my soul that my parole does not enable me to destroy those demons,” Quixote said as he left Rome’s town limits.\n“Let’s not get into that,” Becky said. “What we wanted to tell you was that we’ve found Dulcinea.”\nThe old man’s eyes widened in joy. He clutched at his armor-clad heart. “Mi amor! Where is she? I must run to her at once!”\n“Not just yet,” Becky said. “You should know that she’s been changed. She doesn’t look like she used to.”\n“Has some evil sorcerer done this?” Quixote demanded.\n“Yes!” Jamie interrupted. He was annoyed that Becky had taken charge of everything, and he wanted to add his contribution to the scheme. “The sorcerer was just a head!” he shouted. “A floating head, and a pair of hands! And he wore dark glasses and had no body!”\nA shiver of fear passed through him as he remembered the eerie floating head, but the memory of his old terror did not stop his words from spilling out.\nBecky gave him a strange look. “Yeah,” she said. “That’s right.”\n“He crashed the interface!” Jamie shouted, the words coming to him out of memory.\nDon Quixote paid no attention to this, but Becky gave him another look.\n“You’re not as dumb as you look, Digit,” she said.\n“I do not care about Dulcinea’s appearance,” Don Quixote declared, “I love only the goodness that dwells in her corazón.”\n“She’s Princess Gigunda!” Jamie shouted, jumping up and down in enthusiasm. “She’s been Princess Gigunda all along!”\nAnd so, the children following, Don Quixote ran clanking to where Princess Gigunda waited near Jamie’s house, fell down to one knee, and began to kiss and weep over the Princess’ hand. The Princess seemed a little surprised by this until Becky told her that she was really the long-lost Dulcinea, changed into a giant by an evil magician, although she probably didn’t remember it because that was part of the spell, too.\nSo while the Don and the Princess embraced, kissed, and began to warble a love duet, Becky turned to Jamie.\n“What’s that stuff about the floating head?” she asked. “Where did you come up with that?”\n“I dunno,” Jamie said. He didn’t want to talk about his memory of his family being turned to stone, the eerie glowing figure floating before them. He didn’t want to remember how everyone said it was just a dream.\nHe didn’t want to talk about the suspicions that had never quite gone away.\n“That stuff was weird, Digit,” Becky said. “It gave me the creeps. Let me know before you start talking about stuff like that again.”\n“Why do you call me Digit?” Jamie asked. Becky smirked.\n“No reason,” she said.\n“Jamie’s home!” Mister Jeepers’ voice warbled from the sky. Jamie looked up to see Mister Jeepers doing joyful aerial loops overhead. “Master Jamie’s home at last!”\n“Where shall we go?” Jamie asked.\nTheir lessons for the day were over, and he and Becky were leaving the little red schoolhouse. Becky, as usual, had done very well on her lessons, better than her older brother, and Jamie felt a growing sense of annoyance. At least he was still better at Latin and computer science.\n“I dunno,” Becky said. “Where do you want to go?”\n“How about Pandaland? We could ride the Whoosh Machine.”\nBecky wrinkled her face. “I’m tired of that kid stuff,” she said.\nJamie looked at her. “But you’re a kid.”\n“I’m not as little as you, Digit,” Becky said.\nJamie glared. This was too much. “You’re my little sister! I’m bigger than you!”\n“No, you’re not,” Becky said. She stood before him, her arms flung out in exasperation. “Just notice something for once, will you?”\nJamie bit back on his temper and looked, and he saw that Becky was, in fact, bigger than he was. And older-looking. Puzzlement replaced his fading anger.\n“How did you get so big?” Jamie asked.\n“I grew. And you didn’t grow. Not as fast anyway.”\n“I don’t understand.”\nBecky’s lip curled. “Ask Mom or Dad. Just ask them.” Her expression turned stony. “But don’t believe everything they tell you.”\n“What do you mean?”\nBecky looked angry for a moment, and then her expression relaxed. “Look,” she said, “just go to Pandaland and have fun, okay? You don’t need me for that. I want to go and make some calls to my friends.”\n“What friends?”\nBecky looked angry again. “My friends. It doesn’t matter who they are!”\n“Fine!” Jamie shouted. “I can have fun by myself!”\nBecky turned and began to walk home, her legs scissoring against the background of the green grass. Jamie glared after her, then turned and began the walk to Pandaland.\nHe did all his favorite things, rode the Ferris wheel and the Whoosh Machine, watched Rizzio the Strongman and the clowns. He enjoyed himself, but his enjoyment felt hollow. He found himself watching, watching himself at play, watching himself enjoying the rides.\nWatching himself not grow as fast as his little sister.\nWatching himself wondering whether or not to ask his parents about why that was.\nHe had the idea that he wouldn’t like their answers.\nHe didn’t see as much of Becky after that. They would share lessons, and then Becky would lock herself in her room to talk to her friends on the phone.\nBecky didn’t have a telephone in her room, though. He looked once when she wasn’t there.\nAfter a while, Becky stopped accompanying him for lessons. She’d got ahead of him on everything except Latin, and it was too hard for Jamie to keep up.\nAfter that, he hardly saw Becky at all. But when he saw her, he saw that she was still growing fast. Her clothing was different, and her hair. She’d started wearing makeup.\nHe didn’t know whether he liked her anymore or not.\nIt was Jamie’s birthday. He was eleven years old, and Momma and Daddy and Becky had all come for a party. Don Quixote and Princess Gigunda serenaded Jamie from outside the window, accompanied by La Duchesa on Spanish guitar. There was a big cake with eleven candles. Momma gave Jamie a chart of the stars. When he touched a star, a voice would appear telling Jamie about the star, and lines would appear on the chart showing any constellation the star happened to belong to. Daddy gave Jamie a car, a miniature Mercedes convertible, scaled to Jamie’s size, which he could drive around the country and which he could use in the Circus Maximus when the chariots weren’t racing.\nHis sister gave Jamie a kind of lamp stand that would project lights and moving patterns on the walls and ceiling when the lights were off. “Listen to music when you use it,” she said.\n“Thank you, Becky,” Jamie said.\n“Becca,” she said. “My name is Becca now. Try to remember.”\n“Okay,” Jamie said. “Becca.”\nBecky—Becca—looked at Momma. “I’m dying for a cigarette,” she said. “Can I go, uh, out for a minute?”\nMomma hesitated, but Daddy looked severe. “Becca,” she said, “this is Jamie’s birthday. We’re all here to celebrate. So why don’t we all eat some cake and have a nice time?”\n“It’s not even real cake,” Becca said. “It doesn’t taste like real cake.”\n“It’s a nice cake,” Daddy insisted. “Why don’t we talk about this later? Let’s just have a special time for Jamie.”\nBecca stood up from the table. “For the Digit?” she said. “Why are we having a good time for Jamie? He’s not even a real person!” She thumped herself on the chest. “I’m a real person!” she shouted. “Why don’t we ever have special times for me?”\nBut Daddy was on his feet by that point and shouting, and Momma was trying to get everyone to be quiet, and Becca was shouting back, and suddenly a determined look entered her face and she just disappeared—suddenly, she wasn’t there anymore, there was just only air.\nJamie began to cry. So did Momma. Daddy paced up and down and swore, and then he said, “I’m going to go get her.” Jamie was afraid he’d disappear like Becca, and he gave a cry of despair, but Daddy didn’t disappear, he just stalked out of the dining room and slammed the door behind him.\nMomma pulled Jamie onto her lap and hugged him. “Don’t worry, Jamie,” she said. “Becky just did that to be mean.”\n“What happened?” Jamie asked.\n“Don’t worry about it.” Momma stroked his hair. “It was just a mean trick.”\n“She’s growing up,” Jamie said. “She’s grown faster than me and I don’t understand.”\n“Wait till Daddy gets back,” Momma said, “and we’ll talk about it.”\nBut Daddy was clearly in no mood for talking when he returned, without Becca. “We’re going to have fun,” he snarled, and reached for the knife to cut the cake.\nThe cake tasted like ashes in Jamie’s mouth. When the Don and Princess Gigunda, Mister Jeepers, and Rizzio the Strongman came into the dining room and sang “Happy Birthday,” it was all Jamie could do to hold back the tears.\nAfterwards, he drove his new car to the Circus Maximus and drove as fast as he could on the long oval track. The car really wouldn’t go very fast. The bleachers on either side were empty, and so was the blue sky above.\nMaybe it was a puzzle, he thought, like Princess Gigunda’s love life. Maybe all he had to do was follow the right clue, and everything would be fine.\nWhat’s the moral they’re trying to teach? he wondered.\nBut all he could do was go in circles, around and around the empty stadium.\n“Hey, Digit. Wake up.”\nJamie came awake suddenly, with a stifled cry. The room whirled around him. He blinked, realized that the whirling came from the colored lights projected by his birthday present, Becca’s lamp stand.\nBecca was sitting on his bedroom chair, a cigarette in her hand. Her feet, in the steel-capped boots she’d been wearing lately, were propped up on the bed.\n“Are you awake, Jamie?” It was Selena’s voice. “Would you like me to sing you a lullaby?”\n“Fuck off, Selena,” Becca said. “Get out of here. Get lost.”\nSelena cast Becca a mournful look, then sailed backwards, out the window, riding a beam of moonlight to her pale home in the sky. Jamie watched her go, and felt as if a part of himself was going with her, a part that he would never see again.\n“Selena and the others have to do what you tell them, mostly,” Becca said. “Of course, Mom and Dad wouldn’t tell you that.”\nJamie looked at Becca. “What’s happening?” he said. “Where did you go today?”\nColored lights swam over Becca’s face. “I’m sorry if I spoiled your birthday, Digit. I just got tired of the lies, you know? They’d kill me if they knew I was here now, talking to you.”\nBecca took a draw on her cigarette, held her breath for a second or two, then exhaled. Jamie didn’t see or taste any smoke.\n“You know what they wanted me to do?” she said. “Wear a little girl’s body, so I wouldn’t look any older than you, and keep you company in that stupid school for seven hours a day.” She shook her head. “I wouldn’t do it. They yelled and yelled, but I was damned if I would.”\n“I don’t understand.”\nBecca flicked invisible ashes off her cigarette, and looked at Jamie for a long time. Then she sighed.\n“Do you remember when you were in the hospital?” she said.\nJamie nodded. “I was really sick.”\n“I was so little then, I don’t really remember it very well,” Becca said. “But the point is—” She sighed again. “The point is that you weren’t getting well. So they decided to—” She shook her head. “Dad took advantage of his position at the University, and the fact that he’s been a big doner. They were doing AI research, and the neurology department was into brain modeling, and they needed a test subject, and—Well, the idea is, they’ve got some of your tissue, and when they get cloning up and running, they’ll put you back in—” She saw Jamie’s stare, then shook her head.\n“I’ll make it simple, okay?”\nShe took her feet off the bed and leaned closer to Jamie. A shiver ran up his back at her expression. “They made a copy of you. An electronic copy. They scanned your brain and built a holographic model of it inside a computer, and they put it in a virtual environment, and—” She sat back, took a drag on her cigarette. “And here you are,” she said.\nJamie looked at her. “I don’t understand.”\nColored lights gleamed in Becca’s eyes. “You’re in a computer, okay? And you’re a program. You know what that is, right? From computer class? And the program is sort of in the shape of your mind. Don Quixote and Princess Gigunda are programs, too. And Mrs. Winkle down at the schoolhouse is usually a program, but if she needs to teach something complex, then she’s an education major from the University.”\nJamie felt as if he’d just been hollowed out, a void inside his ribs. “I’m not real?” he said. “I’m not a person?”\n“Wrong,” Becca said. “You’re real, alright. You’re the apple of our parents’ eye.” Her tone was bitter. “Programs are real things,” she said, “and yours was a real hack, you know, absolute cutting-edge state-of-the-art technoshit. And the computer that you’re in is real, too—I’m interfaced with it right now, down in the family room—we have to wear suits with sensors and a helmet with scanners and stuff. I hope to fuck they don’t hear me talking to you down here.”\n“But what—” Jamie swallowed hard. How could he swallow if he was just a string of code? “What happened to me? The original me?”\nBecca looked cold. “Well,” she said, “you had cancer. You died.”\n“Oh.” A hollow wind blew through the void inside him.\n“They’re going to bring you back. As soon as the clone thing works out—but this is a government computer you’re in, and there are all these government restrictions on cloning, and—”\nShe shook her head. “Look, Digit,” she said. “You really need to know this stuff, okay?”\n“I understand.” Jamie wanted to cry. But only real people cried, he thought, and he wasn’t real. He wasn’t real.\n“The program that runs this virtual environment is huge, okay, and you’re a big program, and the University computer is used for a lot of research, and a lot of the research has a higher priority than you do. So you don’t run in real-time—that’s why I’m growing faster than you are.\n“I’m spending more hours being me than you are. And the parents—” She rolled her eyes. “They aren’t making this any better, with their emphasis on normal family life.”\nShe sucked on her cigarette, then stubbed it out in something invisible. “See, they want us to be this normal family. So we have breakfast together every day, and dinner every night, and spend the evening at the Zoo or in Pandaland or someplace. But the dinner that we eat with you is virtual, it doesn’t taste like anything—the grant ran out before they got that part of the interface right—so we eat this fast-food crap before we interface with you, and then have dinner all over again with you . . . Is this making any sense? Because Dad has a job and Mom has a job and I go to school and have friends and stuff, so we really can’t get together every night. So they just close your program file, shut it right down, when they’re not available to interface with you as what Dad calls a ‘family unit,’ and that means that there are a lot of hours, days sometimes, when you’re just not running, you might as well really be dead—” She blinked. “Sorry,” she said. “Anyway, we’re all getting older a lot faster than you are, and it’s not fair to you, that’s what I think. Especially because the University computer runs fastest at night, because people don’t use them as much then, and you’re pretty much real-time then, so interfacing with you would be almost normal, but Mom and Dad sleep then, cuz they have day jobs, and they can’t have you running around unsupervised in here, for God’s sake, they think it’s unsafe or something . . . ”\nShe paused, then reached into her shirt pocket for another cigarette. “Look,” she said, “I’d better get out of here before they figure out I’m talking to you. And then they’ll pull my access codes or something.” She stood, brushed something off her jeans. “Don’t tell the parents about this stuff right away. Otherwise they must might erase you, and load a backup that doesn’t know shit. Okay?”\nAnd she vanished, as she had that afternoon.\nJamie sat in the bed, hugging his knees. He could feel his heart beating in the darkness. How can a program have a heart? he wondered.\nDawn slowly encroached upon the night, and then there was Mister Jeepers, turning lazy cartwheels in the air, his red face leering in the window.\n“Jamie’s awake!” he said. “Jamie’s awake and ready for a new day!”\n“Fuck off,” Jamie said, and buried his face in the blanket.\nJamie asked to learn more about computers and programming. Maybe, he thought, he could find clues there, he could solve the puzzle. His parents agreed, happy to let him follow his interests.\nAfter a few weeks, he moved into El Castillo. He didn’t tell anyone he was going, he just put some of his things in his car, took them up to a tower room, and threw them down on the bed he found there. His Mom came to find him when he didn’t come home for dinner.\n“It’s dinnertime, Jamie,” she said. “Didn’t you hear the dinner bell?”\n“I’m going to stay here for a while,” Jamie said.\n“You’re going to get hungry if you don’t come home for dinner.”\n“I don’t need food,” Jamie said.\nHis Mom smiled brightly. “You need food if you’re going to keep up with the Whirlikins,” she said.\nJamie looked at her. “I don’t care about that kid stuff anymore,” he said.\nWhen his mother finally turned and left, Jamie noticed that she moved like an old person.\nAfter a while, he got used to the hunger that was programmed into him. It was always there, he was always aware of it, but he got so he could ignore it after awhile.\nBut he couldn’t ignore the need to sleep. That was just built into the program, and eventually, try though he might, he needed to give in to it.\nHe found out he could order the people in the castle around, and he amused himself by making them stand in embarrassing positions, or stand on their head and sing, or form human pyramids for hours and hours.\nSometimes he made them fight, but they weren’t very good at it.\nHe couldn’t make Mrs. Winkle at the schoolhouse do whatever he wanted, though, or any of the people who were supposed to teach him things. When it was time for a lesson, Princess Gigunda turned up. She wouldn’t follow his orders, she’d just pick him up and carry him to the little red schoolhouse and plunk him down in his seat.\n“You’re not real!” he shouted, kicking in her arms. “You’re not real! And I’m not real, either!”\nBut they made him learn about the world that was real, about geography and geology and history, although none of it mattered here.\nAfter the first couple times Jamie had been dragged to school, his father met him outside the schoolhouse at the end of the day.\n“You need some straightening out,” he said. He looked grim. “You’re part of a family. You belong with us. You’re not going to stay in the castle anymore, you’re going to have a normal family life.”\n“No!” Jamie shouted. “I like the castle!”\nDad grabbed him by the arm and began to drag him homeward. Jamie called him a pendejo and a fellator.\n“I’ll punish you if I have to,” his father said.\n“How are you going to do that?” Jamie demanded. “You gonna erase my file? Load a backup?”\nA stunned expression crossed his father’s face. His body seemed to go through a kind of stutter, and the grip on Jamie’s arm grew nerveless. Then his face flushed with anger. “What do you mean?” he demanded. “Who told you this?”\nJamie wrenched himself free of Dad’s weakened grip. “I figured it out by myself,” Jamie said. “It wasn’t hard. I’m not a kid anymore.”\n“I—” His father blinked, and then his face hardened. “You’re still coming home.”\nJamie backed away. “I want some changes!” he said. “I don’t want to be shut off all the time.”\nDad’s mouth compressed to a thin line. “It was Becky who told you this, wasn’t it?”\nJamie felt an inspiration. “It was Mister Jeepers! There’s a flaw in his programming! He answers whatever question I ask him!”\nJamie’s father looked uncertain. He held out his hand. “Let’s go home,” he said. “I need to think about this.”\nJamie hesitated. “Don’t erase me,” he said. “Don’t load a backup. Please. I don’t want to die twice.”\nDad’s look softened. “I won’t.”\n“I want to grow up,” Jamie said. “I don’t want to be a little kid forever.”\nDad held out his hand again. Jamie thought for a moment, then took the hand. They walked over the green grass toward the white frame house on the hill.\n“Jamie’s home!” Mister Jeepers floated overhead, turning aerial cartwheels. “Jamie’s home at last!”\nA spasm of anger passed through Jamie at the sight of the witless grin. He pointed at the ground in front of him.\n“Crash right here!” he ordered. “Fast!”\nMister Jeepers came spiraling down, an expression of comic terror on his face, and smashed to the ground where Jamie pointed. Jamie pointed at the sight of the crumpled body and laughed.\n“Jamie’s home at last!” Mister Jeepers said.\nAs soon as Jamie could, he got one of the programmers at the University to fix him up a flight program like the one Mister Jeepers had been using. He swooped and soared, zooming like a super hero through the sky, stunting between the towers of El Castillo and soaring over upturned, wondering faces in the Forum.\nHe couldn’t seem to go as fast as he really wanted. When he started increasing speed, all the scenery below paused in its motion for a second or two, then jumped forward with a jerk. The software couldn’t refresh the scenery fast enough to match his speed. It felt strange, because throughout his flight he could feel the wind on his face.\nSo this, he thought, was why his car couldn’t go fast.\nSo he decided to climb high. He turned his face to the blue sky and went straight up. The world receded, turned small. He could see the Castle, the hills of Whirlikin Country, the crowded Forum, the huge oval of the Circus Maximus. It was like a green plate, with a fuzzy, nebulous horizon where the sky started.\nAnd, right in the center, was the little two-story frame house where he’d grown up.\nIt was laid out below him like scenery in a snow globe.\nAfter a while he stopped climbing. It took him a while to realize it, because he still felt the wind blowing in his face, but the world below stopped getting smaller.\nHe tried going faster. The wind blasted onto him from above, but his position didn’t change. He’d reached the limits of his world. He couldn’t get any higher.\nJamie flew out to the edges of the world, to the horizon. No matter how he urged his program to move, he couldn’t make his world fade away.\nHe was trapped inside the snow globe, and there was no way out.\nIt was quite a while before Jamie saw Becca again. She picked her way through the labyrinth beneath El Castillo to his throne room, and Jamie slowly materialized atop his throne of skulls.\nShe didn’t appear surprised.\n“I see you’ve got a little Dark Lord thing going here,” she said.\n“It passes the time,” Jamie said.\n“And all those pits and stakes and tripwires?”\n“Death traps.”\n“Took me forever to get in here, Digit. I kept getting de-rezzed.”\nJamie smiled. “That’s the idea.”\n“Whirlikins as weapons,” she nodded. “That was a good one. Bored a hole right through me, the first time.”\n“Since I’m stuck living here,” Jamie said, “I figure I might as well be in charge of the environment. Some of the student programmers at the University helped me with some cool effects.”\nScreams echoed through the throne room. Fires leaped out of pits behind him. The flames illuminated a form of Marcus Tullius Cicero, who hung crucified above a sea of flame.\n“O tempora, o mores!” moaned Cicero.\nBecca nodded. “Nice,” she said. “Not my scene exactly, but nice.”\n“Since I can’t leave,” Jamie said, “I want a say in who gets to visit. So either you wait till I’m ready to talk to you, or you take your chances on the death traps.”\n“Well. Looks like you’re sitting pretty, then.”\nJamie shrugged. Flames belched. “I’m getting bored with it. I might just wipe it all out and build another place to live in. I can’t tell you the number of battles I’ve won, the number of kingdoms I’ve trampled. In this reality and others. It’s all the same after a while.” He looked at her. “You’ve grown.”\n“So have you.”\n“Once the paterfamilias finally decided to allow it.” He smiled. “We still have dinner together sometimes, in the old house. Just a normal family, as Dad says. Except that sometimes I turn up in the form of a werewolf, or a giant, or something.”\n“So they tell me.”\n“The advantage of being software is that I can look like anything I want. But that’s the disadvantage, too, because I can’t really become something else, I’m still just . . . me. I may wear another program as a disguise, but I’m still the same program inside, and I’m not a good enough programmer to mess with that, yet.” Jamie hopped off his throne, walked a nervous little circle around his sister. “So what brings you to the old neighborhood?” he asked. “The old folks said you were off visiting Aunt Maddy in the country.”\n“Exiled, they mean. I got knocked up, and after the abortion they sent me to Maddy. She was supposed to keep me under control, except she didn’t.” She picked an invisible piece of lint from her sweater. “So now I’m back.” She looked at him. “I’m skipping a lot of the story, but I figure you wouldn’t be interested.”\n“Does it have to do with sex?” Jamie asked. “I’m sort of interested in sex, even though I can’t do it, and they’re not likely to let me.”\n“Let you?”\n“It would require a lot of new software and stuff. I was prepubescent when my brain structures were scanned, and the program isn’t set up for making me a working adult, with adult desires et cetera. Nobody was thinking about putting me through adolescence at the time. And the administrators at the University told me that it was very unlikely that anyone was going to give them a grant so that a computer program could have sex.” Jamie shrugged. “I don’t miss it, I guess. But I’m sort of curious.”\nSurprise crossed Becca’s face. “But there are all kinds of simulations, and . . . ”\n“They don’t work for me, because my mind isn’t structured so as to be able to achieve pleasure that way. I can manipulate the programs, but it’s about as exciting as working a virtual butter churn.” Jamie shrugged again. “But that’s okay. I mean, I don’t miss it. I can always give myself a jolt to the pleasure center if I want.”\n“Not the same thing,” Becca said. “I’ve done both.”\n“I wouldn’t know.”\n“I’ll tell you about sex if you want,” Becca said, “but that’s not why I’m here.”\n“Yes?”\nBecca hesitated. Licked her lips. “I guess I should just say it, huh?” she said. “Mom’s dying. Pancreatic cancer.”\nJamie felt sadness well up in his mind. Only electrons, he thought, moving from one place to another. It was nothing real. He was programmed to feel an analog of sorrow, and that was all.\n“She looks normal to me,” he said, “when I see her.” But that didn’t mean anything: his mother chose what she wanted him to see, just as he chose a mask—a werewolf, a giant—for her.\nAnd in neither case did the disguise at all matter. For behind the werewolf was a program that couldn’t alter its parameters; and behind the other, ineradicable cancer.\nBecca watched him from slitted eyes. “Dad wants her to be scanned, and come here. So we can still be a normal family even after she dies.”\nJamie was horrified. “Tell her no,” he said. “Tell her she can’t come!”\n“I don’t think she wants to. But Dad is very insistent.”\n“She’ll be here forever! It’ll be awful!”\nBecca looked around. “Well, she wouldn’t do much for your Dark Lord act, that’s for sure. I’m sure Sauron’s mom didn’t hang around the Dark Tower, nagging him about the unproductive way he was spending his time.”\nFires belched. The ground trembled. Stalactites rained down like arrows.\n“That’s not it,” Jamie said. “She doesn’t want to be here no matter what I’m doing, no matter where I live. Because whatever this place looks like, it’s a prison.” Jamie looked at his sister. “I don’t want my mom in a prison.”\nLeaping flames glittered in Becca’s eyes. “You can change the world you live in,” she said. “That’s more than I can do.”\n“But I can’t,” Jamie said. “I can change the way it looks, but I can’t change anything real. I’m a program, and a program is an artifact. I’m a piece of engineering. I’m a simulation, with simulated sensory organs that interact with simulated environments—I can only interact with other artifacts. None of it’s real. I don’t know what the real world looks or feels or tastes like, I only know what simulations tell me they’re supposed to taste like. And I can’t change any of my parameters unless I mess with the engineering, and I can’t do that unless the programmers agree, and even when that happens, I’m still as artificial as I was before. And the computer I’m in is old and clunky, and soon nobody’s going to run my operating system anymore, and I’ll not only be an artifact, I’ll be a museum piece.”\n“There are other artificial intelligences out there,” Becca said. “I keep hearing about them.”\n“I’ve talked to them. Most of them aren’t very interesting—it’s like talking to a dog, or maybe to very intelligent microwave oven. And they’ve scanned some people in, but those were adults, and all they wanted to do, once they got inside, was to escape. Some of them went crazy.”\nBecca gave a twisted smile. “I used to be so jealous of you, you know. You lived in this beautiful world, no pollution, no violence, no shit on the streets.”\nFlames belched.\n“Integra mens augustissima possessio,” said Cicero.\n“Shut up!” Jamie told him. “What the fuck do you know?”\nBecca shook her head. “I’ve seen those old movies, you know? Where somebody gets turned into a computer program, and next thing you know he’s in every computer in the world, and running everything?”\n“I’ve seen those, too. Ha ha. Very funny. Shows you what people know about programs.”\n“Yeah. Shows you what they know.”\n“I’ll talk to Mom,” Jamie said.\nBig tears welled out of Mom’s eyes and trailed partway down her face, then disappeared. The scanners paid a lot of attention to eyes and mouths, for the sake of transmitting expression, but didn’t always pick up the things between.\n“I’m sorry,” she said. “We didn’t think this is how it would be.”\n“Maybe you should have given it more thought,” Jamie said.\nIt isn’t sorrow, he told himself again. It’s just electrons moving.\n“You were such a beautiful baby.” Her lower lip trembled. “We didn’t want to lose you. They said that it would only be a few years before they could implant your memories in a clone.”\nJamie knew all that by now. Knew that the technology of reading memories turned out to be much, much simpler than implanting them—it had been discovered that the implantation had to be made while the brain was actually growing. And government restrictions on human cloning had made tests next to impossible, and the team that had started his project had split up years ago, some to higher-paying jobs, some retired, others to pet projects of their own. How his father had long ago used up whatever pull he’d had at the University trying to keep everything together. And how he long ago had acquired or purchased patents and copyrights for the whole scheme, except for Jamie’s program, which was still owned jointly by the University and the family.\nTears reappeared on Mom’s lower face, dripped off her chin. “There’s potentially a lot of money at stake, you know. People want to raise perfect children. Keep them away from bad influences, make sure that they’re raised free from violence.”\n“So they want to control the kid’s entire environment,” Jamie said.\n“Yes. And make it safe. And wholesome. And—”\n“Just like normal family life,” Jamie finished. “No diapers, no vomit, no messes. No having to interact with the kid when the parents are tired. And then you just download the kid into an adult body, give him a diploma, and kick him out of the house. And call yourself a perfect parent.”\n“And there are religious people . . . ” Mom licked her lips. “Your Dad’s been talking to them. They want to raise children in environments that reflect their beliefs completely. Places where there is no temptation, no sin. No science or ideas that contradict their own . . . ”\n“But Dad isn’t religious,” Jamie said.\n“These people have money. Lots of money.” Mom reached out, took his hand. Jamie thought about all the code that enabled her to do it, that enabled them both to feel the pressure of unreal flesh on unreal flesh.\n“I’ll do what you wish, of course,” she said. “I don’t have that desire for immortality, the way your father does.” She shook her head. “But I don’t know what your father will do once his time comes.”\nThe world was a disk a hundred meters across, covered with junk: old Roman ruins, gargoyles fallen from a castle wall, a broken chariot, a shattered bell. Outside the rim of the world, the sky was black, utterly black, without a ripple or a star.\nStanding in the center of the world was a kind of metal tree with two forked, jagged arms.\n“Hi, Digit,” Becca said.\nA dull fitful light gleamed on the metal tree, as if it were reflecting a bloody sunset.\n“Hi, sis,” it said.\n“Well,” Becca said. “We’re alone now.”\n“I caught the notice of Dad’s funeral. I hope nobody missed me.”\n“I missed you, Digit.” Becca sighed. “Believe it or not.”\n“I’m sorry.”\nBecca restlessly kicked a piece of junk, a hubcap from an old, miniature car. It clanged as it found new lodgement in the rubble. “Can you appear as a person?” she asked. “It would make it easier to talk to you.”\n“I’ve finished with all that,” Jamie said. “I’d have to resurrect too much dead programming. I’ve cut the world down to next to nothing, I’ve got rid of my body, my heartbeat, the sense of touch.”\n“All the human parts,” Becca said sadly.\nThe dull red light oozed over the metal tree like a drop of blood. “Everything except sleep and dreams. It turns out that sleep and dreams have too much to do with the way people process memory. I can’t get rid of them, not without cutting out too much of my mind.” The tree gave a strange, disembodied laugh. “I dreamed about you, the other day. And about Cicero. We were talking Latin.”\n“I’ve forgotten all the Latin I ever knew.” Becca tossed her hair, forced a laugh. “So what do you do nowadays?”\n“Mostly I’m a conduit for data. The University has been using me as a research spider, which I don’t mind doing, because it passes the time. Except that I take up a lot more memory than any real search spider, and don’t do that much better a job. And the information I find doesn’t have much to do with me—it’s all about the real world. The world I can’t touch.” The metal tree bled color.\n“Mostly,” he said, “I’ve just been waiting for Dad to die. And now it’s happened.”\nThere was a moment of silence before Becca spoke. “You know that dad had himself scanned before he went.”\n“Oh yeah. I knew.”\n“He set up some kind of weird foundation that I’m not part of, with his patents and programs and so on, and his money and some other people’s.”\n“He’d better not turn up here.”\nBecca shook her head. “He won’t. Not without your permission, anyway. Because I’m in charge here. You—your program—it’s not a part of the foundation. Dad couldn’t get it all, because the University has an interest, and so does the family.” There was a moment of silence. “And I’m the family now.”\n“So you . . . inherited me,” Jamie said. Cold scorn dripped from his words.\n“That’s right,” Becca said. She squatted down amid the rubble, rested her forearms on her knees.\n“What do you want me to do, Digit? What can I do to make it better for you?”\n“No one ever asked me that,” Jamie said.\nThere was another long silence.\n“Shut it off,” Jamie said. “Close the file. Erase it.”\nBecca swallowed hard. Tears shimmered in her eyes. “Are you sure?” she asked.\n“Yes. I’m sure.”\n“And if they ever perfect the clone thing? If we could make you . . . ” She took a breath. “A person?”\n“No. It’s too late. It’s . . . not something I can want anymore.”\nBecca stood. Ran a hand through her hair. “I wish you could meet my daughter,” she said. “Her name is Christy. She’s a real beauty.”\n“You can bring her,” Jamie said.\nBecca shook her head. “This place would scare her. She’s only three. I’d only bring her if we could have . . . ”\n“The old environment,” Jamie finished. “Pandaland. Mister Jeepers. Whirlikin Country.”\nBecca forced a smile. “Those were happy days,” she said. “They really were. I was jealous of you, I know, but when I look back at that time . . . ” She wiped tears with the back of her hand. “It was the best.”\n“Virtual environments are nice places to visit, I guess,” Jamie said. “But you don’t want to live in one. Not forever.” Becca looked down at her feet, planted amid rubble.\n“Well,” she said. “If you’re sure about what you want.”\n“I am.”\nShe looked up at the metal form, raised a hand. “Goodbye, Jamie,” she said.\n“Goodbye,” he said.\nShe faded from the world.\nAnd in time, the world and the tree faded, too.\nHand in hand, Daddy and Jamie walked to Whirlikin Country. Jamie had never seen the Whirlikins before, and he laughed and laughed as the Whirlikins spun beneath their orange sky.\nThe sound of a bell rang over the green hills. “Time for dinner, Jamie,” Daddy said.\nJamie waved goodbye to the Whirlikins, and he and Daddy walked briskly over the fresh green grass toward home.\n“Are you happy, Jamie?” Daddy asked.\n“Yes, Daddy!” Jamie nodded. “I only wish Momma and Becky could be here with us.”\n“They’ll be here soon.”\nWhen, he thought, they can get the simulations working properly.\nBecause this time, he thought, there would be no mistakes. The foundation he’d set up before he died had finally purchased the University’s interest in Jamie’s program—they funded some scholarships, that was all it finally took. There was no one in the Computer Department who had an interest anymore.\nJamie had been loaded from an old backup—there was no point in using the corrupt file that Jamie had become, the one that had turned itself into a tree, for heaven’s sake.\nThe old world was up and running, with a few improvements. The foundation had bought their own computer—an old one, so it wasn’t too expensive—that would run the environment full time. Some other children might be scanned, to give Jamie some playmates and peer socialization.\nThis time it would work, Daddy thought. Because this time, Daddy was a program too, and he was going to be here every minute, making sure that the environment was correct and that everything went exactly according to plan. That he and Jamie and everyone else had a normal family life, perfect and shining and safe.\nAnd if the clone program ever worked out, they would come into the real world again. And if downloading into clones was never perfected, then they would stay here.\nThere was nothing wrong with the virtual environment. It was a good place.\nJust like normal family life. Only forever.\nAnd when this worked out, the foundation’s backers—fine people, even if they did have some strange religious ideas—would have their own environments up and running. With churches, angels, and perhaps even the presence of God . . .\n“Look!” Daddy said, pointing. “It’s Mister Jeepers!”\nMister Jeepers flew off the rooftop and spun happy spirals in the air as he swooped toward Jamie. Jamie dropped Daddy’s hand and ran laughing to greet his friend.\n“Jamie’s home!” Mister Jeepers cried. “Jamie’s home at last!”\nOriginally published in Not of Woman Born, edited by Constance Ash, 1999.\nWalter Jon Williams is an award-winning author who has been listed on the best-seller lists of the New York Times and the Times of London. He is the author of twenty-seven novels and three collections of short fiction, Frankenstein and Other Foreign Devils, Facets, and The Green Leopard Plague and Other Stories. In 2001 he won a Nebula Award for his novelette, \"Daddy's World,\" and won again in 2005 for \"The Green Leopard Plague.\" His novels include Aristoi, Hardwired, Days of Attonment,Voice of the Whirlwind, House of Shards, Metropolitan, City On Fire, The Praxis, The Sundering, Conventions of War, This Is Not a Game, and Deep State. He has also written for George RR Martin's Wild Cards project, for comics, the screen, and for television, and has worked in the gaming world, where he scripted the mega-hit Spore. His latest work is The Fourth Wall, a near-future thriller set in the world of alternate reality gaming."}