{"fingerprint": "pqw8oj08OgGR1KWfM312vur/ufw=", "sitename": "Clarkesworld Magazine", "title": "Charging A Brick Wall: A Conversation with Walter Jon Williams by Arley Sorg", "author": "Arley Sorg", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/williams_interview_2020/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Charging A Brick Wall: A Conversation with Walter Jon Williams by Arley Sorg", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\n Charging A Brick Wall: A Conversation with Walter Jon Williams\n With published fiction spanning three decades, you’ve probably read Walter Jon Williams, even if you don’t know it. He’s known for changing styles and writing both within genre and in defiance of genre definitions. His work has appeared on awards lists since the ’80s, including a Sidewise Award in ’96 for “Foreign Devils,” and Nebula Awards in 2001 for “Daddy’s World” and 2005 for “The Green Leopard Plague.” He’s appeared in best of’s, reader’s polls, and recommended reading lists a number of times, for publications such as Locus, Asimov’s, and SF Chronicle. His body of work includes gaming titles, films, and more. He also founded the Rio Hondo and Taos Toolbox workshops in New Mexico.\n George R. R. Martin said of Quillifer, “For all of you who need some great fantasy to read while you’re waiting for THE WINDS OF WINTER . . . try QUILLIFER, by Walter Jon Williams. WJW is always fun, but this may be his best yet, a delight from start to finish, witty, colorful, exciting and amusing by turns, exquisitely written. There’s a dash of Cugel and a dollop of Flashman in Quillifer, son of Quillifer, but this butcher’s boy remains uniquely his own man. I loved meeting him and look forward to seeing him again. Fortunately, Walter tells me the next book, QUILLIFER THE KNIGHT, is already complete and in the pipeline.”\n His most recent novel, Quillifer the Knight, is available from Simon & Schuster’s Saga Press, and his recent Praxis books are available from Harper Voyager. His collection, The Best of Walter Jon Williams, is due from Subterranean Press in 2021.\n You began your publishing career as Jon Williams with 1981’s Privateers and Gentlemen series: The Privateer, The Yankee, and The Raider, published by Dell. How did you break in? Were there other projects you tried to sell?\n There were LOTS of failed projects, including two entire novels I hadn’t been able to sell. I’d been writing seriously for five or six years, in every genre except poetry, romance, and porn, and the result had been zero sales.\n Imagine my surprise when my first professional sale was a three-book deal. I was lucky enough to be paid for what I fully realized was journeyman work.\n Hurrah! I was a professional, and had graduated from destitution to mere poverty!\n You’ve said, “After the market for historicals died, I began a new career as a science fiction writer.” But your first SF novel, Ambassador of Progress, came not long after, in 1984—just three years later. Had the market shifted that dramatically in such a short time? Was it difficult to switch?\n The dates of publication are deceptive. The privateer books were written 1979-1982, and published in 1981 and 1984, with the three-year gap in between making sure that all momentum was lost. Ambassador of Progress was written 1983-4, and published later in 1984.\n What happened was this.\n Spurred by the success of John Jakes’ The Kent Family Chronicles, publishers bought a lot of historical fiction in the five or six years following the American Bicentennial. They overbought, and the market collapsed under its own weight.\n So the good news was that I sold a bunch of books, and the bad news that these same books were part of a publishing trend overdue for collapse.\n (And by the way, the market for historicals by American writers never returned. There are best-selling historical novels now, but they’re almost all by British writers, and were successes overseas first. American writers interested in history ended up writing historical romance, historical mysteries, or alternative-history SF and fantasy.)\n After I filled my initial three-book contract for historicals, there was a second two-book contract that got in just ahead of the collapse. Because of the collapse, it was years before these last two books were published—in fact, so much time had passed that the publisher’s legal right to publish them had expired, a fact of which I conspicuously failed to remind them.\n During the interim between the two contracts, I wrote the first part of Voice of the Whirlwind, which I stalled out on, and the proposal for Ambassador of Progress. I wasn’t trying to switch careers to SF, necessarily, but I was trying to keep myself from being bored, and was interested in experimenting and expanding my range, because that’s what makes you a better writer.\n Due to a cartoonish series of mishaps, including twice getting lost in the Simon & Schuster mail room, the Ambassador of Progress proposal wasn’t read for a couple years, but it did sell to the first editor who actually read it, Jim Baen at Tor.\n Switching from historical fiction to SF involved my advances dropping by something like 45%, so while I had found a home, I was back to destitution again.\n When and how did you begin to get involved in the SF/F community? Did you find it helpful for your career or your writing process in any way?\n I attended my first science fiction convention in the early Seventies, and attended conventions regularly through that decade. After I began selling, I became something of an anomaly. A few years ago I was told, “We all knew you were a writer, but nobody had read anything you’d written, or even seen it. But you seemed nice enough, so we let you hang out with us.”\n When I was trying to break in, several authors did me the kindness of taking me seriously: Jack Williamson, John Maddox Roberts, and C. J. Cherryh. Gordon R. Dickson actually tucked the manuscript of my first novel under his arm and went around the Phoenix Worldcon trying to hand-sell it to editors. (It didn’t work, but I was astonished by his kindness.)\n You have a staggering amount of work out. Did you ever hit a career slump or a writing slump, where you struggled to sell work or to produce work?\n I’ve suffered through several career crashes—four or five, depending on how you count them, and some worse than others.\n My historical fiction career crashed, of course. There were two subsequent crashes that were so bad that they were at the “You’ll never work in this town again” level, and they both resulted in my being unable to sell a novel for five years.\n That’s ten years in which I could have been writing novels that readers could have enjoyed and I could have profited from, but those books are gone.\n I’m very bitter about it. Can you tell?\n When I started, I had no wife or children, so the only person I could fuck up was myself. I could live in a small apartment in a marginal neighborhood, and drive a four-wheel death trap, and I was gambling only with my own fate. So I could just keep writing, and that’s what I did.\n The first of the five-year crashes, I was married and my wife had a job, and I got work in Hollywood and writing games, so I was able to ride it out. But when I came back, much of my audience had faded away, and I had to find new readers somewhere.\n The second of the five-year crashes, in addition to writing proposals for books that didn’t sell, I digitized my backlist and put them out as ebooks, and even though I wasn’t selling anything new, I was suddenly making more money than I had in my entire career.\n But basically I’ve survived by being stupid and single-minded. The only job I’m qualified for other than writer is Walmart greeter. I have no job history, no advanced degrees, and outside of the very small world of science fiction nobody’s heard of me. It’s write or die, so writing’s what I do.\n Are there books or stories that were particularly difficult to write for one reason or another, and how did you overcome the challenges you faced?\n Yes, but I can never predict what will be hard and what will be easy. The first and third volumes of my Dagmar Shaw series were a joy to write, but the middle book was like trench warfare. Why? I have no idea.\n I deal with it the same way I deal with all obstacles: I put my head down and charge forward into the brick wall that’s blocking my way, and I keep doing it until I die or the brick wall falls down.\n What that means in practice is that I write every day, unless I’m out of town or there’s some big but necessary social function that intrudes on my writing time. I’m not a very fast writer, but I do it every day, and I win through persistence.\n Now, almost forty years after your first series, you have the latest in your Quillifer sequence: Quillifer the Knight, right after the Dread Empire’s Fall installment: The Accidental War. What does it take to stay relevant, and sell books/stories, and still remain part of the genre conversation?\n Am I in the genre conversation? I see no sign of it.\n I think once you turn fifty, the game changes. The editors who were buying your stuff die or retire, and maybe the readers think they know your work, and don’t need to follow you anymore. (One reason I try not to repeat myself.) Plus the field is all about finding exciting!!! new!!! writers!!!, which is great, because I was one of those guys once, but now I’m an older person who shows up at conventions or whatever, and the only people who know my work are the people my own age, and that’s depressing.\n I have readers, which is terrific, and I’m deeply appreciative of those who have followed me all this time, but if anyone out there is actually talking about me, they’re not letting me hear.\n As for the people who broke in and then disappeared, I think the answers come down to two: bad luck and children. If your career collapses (which is the new normal, and it almost certainly won’t be your fault), you might be able to fight your way through it, but if you’re raising kids, odds are you can’t. If you can no longer earn enough writing to keep your kids in shoes, and you’re anything like a responsible parent, then you quit writing and get a job. And maybe you’ll be lucky enough to come back in twenty years.\n And of course if your health goes bad, particularly in the States, it’s a game-ender. There is no backstop.\n “The Green Leopard Plague” won a Nebula in 2005. “Daddy’s World” won a Nebula in 2001. Jonathan Strahan, in his Locus roundup of noteworthy 2017 titles, called Quillifer “a fun swashbuckler.” Is there a difference between award-worthy fiction and fun fiction?\n Maybe it’s just me, but I have fun whenever I’m reading a good book regardless of genre or intent. I have fun reading the poetry of Philip Larkin, for heaven’s sake!\n The notion that there’s a hard wall separating serious fiction from fun fiction is illusory. Fiction can be fun without pandering to its readers’ expectations, and it can be serious while remaining amusing.\n Otherwise we wouldn’t have Mark Twain, would we?\n You co-run Taos Toolbox, you write tons of fiction (and have a fair amount of nonfiction out), and you’ve been up for a slew of awards. Who are the writers (or what are the stories) in the field now that impress you, and why?\n I always hate these questions, because I’m always afraid I’ll leave someone out and that person will be offended. Even so . . .\n The names that my paintball memory splatters across my consciousness at this moment include Kelly Robson, Amal El-Mohtar, Scott Hawkins, David Anthony Durham, Daniel Abraham, Kelly Link, Will McIntosh, Zen Cho, Sam J Miller, L. D. Colter, Simone Heller, Carmen Maria Machado, Max Gladstone, Andromeda Romano-Lax, and Arkady Martine.\n That many of these were, at some point or other, my students, does not bias my recommendations in any way.\n What are the projects you would really like to do that you haven’t done yet?\n I have more ideas for stories than I’ll have a chance to write in several lifetimes. In no particular order:\n I have two hundred pages of a novel about Benjamin Franklin. Friends who have read it say it’s my best, but it’s been rejected everywhere, not least because it’s neither one thing nor another. (It would be science fiction were it published in 1756.)\n I’d like to write a four-volume historical series about Hannibal and the Second Punic War. Never been done right, in my opinion. If I threw in dragons or something I could probably sell it as a stupid fantasy, but there’s something in me that resists that.\n A series of novels featuring Talleyrand as the central character.\n A massive overstory displayed in all media, including novels, web pages, film, podcasts, postcards, graphic novels, etc. It would require some collaborators and a metric fuck-ton of money. Any millionaires out there?\n The others I’ll keep to myself, because I may still write them.\n What can you tell us about your recent novels—the Quillifer books and the Praxis books—what is special about them to you, and what do you really want readers to know about them?\n At some point in the Nineties, my books started to grow in scope and got longer and longer. Eventually I wised up and split the huge stories into multiple volumes, which allowed me as much scope as I wanted, and also to be paid multiple times. Win/win!\n I’ve only recently realized that I’ve had a single project over the last twenty years, which is to examine the artifacts and tropes of genre, take them apart, and reassemble them in ways that make sense to me. It’s a very science fiction thing to do.\n The Praxis books are a far-future series chronicling the collapse of an interstellar empire. Since space empires really make no sense, I had this one assembled by a ruthless clique of alien conquerors, who subdue humans among other races, and who set up a social system headed by a pseudo-aristocracy of collaborators. When the alien conquerors die out, their subjects, led by descendants of the original turncoats, are left trying to hold the ramshackle construction together. Or not, as the case may be.\n The Quillifer series is a joyful homage to the pioneers of fantasy. Writing it is the most fun I’ve had in years. I not only am prodding and rearranging the matter of fantasy, I’m showing what an actual fantasy realm would look like when you’re strolling through it. Why would you not want to live in a world with turnspit dogs?\n It’s a tradition in high fantasy that a perturbed world must be renewed by a return to an idealized past—the rightful heir Aragorn (or Simba) becomes King, and then sets the realm to rights. Which is great as long as Aragorn (or Simba) stays alive, and is not replaced by King Snarl the Sociopath. I’ve never been much impressed by the claims of kings.\n Quillifer lives in a world less akin to the Middle Ages than to the North European Renaissance, and he’s not a lost prince looking for a throne, but a charming high-flyer looking for the main chance. A working-class kid on the rise, he’s not looking for some idealized kingdom of the past, but a world that will accept him for what he is, an agent of social change.\n I only hope that readers have as much fun with these books as I did.\n Do you feel like you are a completely different writer in important ways from the Walter Jon Williams who sold books ten or fifteen years ago? Or will readers find a consistent voice and style running through decades of work?\n I’d like to think I’ve grown and changed, which is what artists are supposed to do. You can only hope to bring your audience with you.\n I have more skills now. I adopt different voices and styles, depending on the work, but I think I’m fairly consistent in regard to theme: I write about money, power, crime, and class. Sometimes it’s serious, sometimes it’s funny, sometimes the subject is hidden by a kind of magician’s misdirection until I drop the cloak and reveal what’s been there all along.\n Which short stories stand out in your memory as some of your finest work, and why? For readers who have never read you, where should they start?\n “Daddy’s World”\n “Surfacing”\n “Wall, Stone, Craft”\n “The Green Leopard Plague”\n “Dinosaurs”\n “Prayers on the Wind”\n Or actually you can wait until later in the year, when Subterranean Press will release The Best of Walter Jon Williams, lavishly illustrated by Lee Moyer.\n I’m sure it’ll be worth every penny.\n Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate."}