{"fingerprint": "orM5dD1/aMugqytocQtcgeumjg0=", "sitename": "Clarkesworld Magazine", "title": "The Paradox of the Telescope: A Conversation with Robert Charles Wilson by Alvaro Zinos-Amaro", "author": "Alvaro Zinos-Amaro", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wilson_interview/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Paradox of the Telescope: A Conversation with Robert Charles Wilson by Alvaro Zinos-Amaro", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "Interview\nThe Paradox of the Telescope: A Conversation with Robert Charles Wilson\nI discovered Robert Charles Wilson’s work in February of 2009, with the slender and elegant novel Bios. Though I was in the middle of reading three or four other books at the time, once I started it I couldn’t stop. Compelling characters, interesting politics, an unnerving but wholly plausible science fictional set-up, and nothing extraneous—I finished it that same night. After Bios, I picked up more of his novels, but then I started focusing heavily on reading short stories and thought to myself, “It’s probably going to be a while before I get back to Wilson.”\nWrong.\nLater that same year, in the dealer’s room at WorldCon in Montréal, I chanced on a signed, first edition hardcover of his collection of stories The Perseids and Other Stories. I couldn’t pass it up. And I’m glad I didn’t. “Divided by Infinity” is just one of several stories that linger in the mind long after reading, and it reinforced my sense of having discovered a major science fiction writer. None of Wilson’s subsequent releases, which I now eagerly anticipate, have made me doubt that belief.\nRobert Charles Wilson’s first novel, A Hidden Place, was published in 1986. Since then he has written seventeen novels, including the Hugo Award-winning Spin, and the aforementioned collection of short stories, The Perseids and Other Stories. Other awards include the John W. Campbell Memorial Award for his novel The Chronoliths, the Philip K. Dick Award for the novel Mysterium, and the Theodore Sturgeon Memorial Award for his short story “The Cartesian Theater.” His work in translation has received the Seiun Award, the Kurd Lasswitz Prize, and the Grand Prix de l’Imaginaire. He lives just outside Toronto with his wife, proofreader, and music journalist Sharry Wilson. His most recent novel is The Affinities.\nYour work—particularly Spin (2005) and its two sequels, Axis (2007) and Vortex (2011)—powerfully conveys what Robert Silverberg once described as the “smallness of Us and the immensity of It.” Would you say science fiction is particularly well-suited to exploring this theme?\nI can’t think of a genre better suited to exploring it. But there’s more here than just the truism that we’re insignificant creatures dwarfed by a vast, uncaring cosmos. There’s the startling fact that we know this about ourselves. I think of it as the paradox of the telescope: What amazing and unprecedented creatures we are, that we can build a telescope and discover what small and insignificant creatures we are. And that’s not just a facile irony—I think it’s an invitation to awe rather than despair.\nYou’ve been called an heir to Theodore Sturgeon and Ray Bradbury, while also being compared to Olaf Stapledon and Greg Egan. Is combining intimacy and pathos with more cosmic, reality-bending perspectives a conscious decision on your part, or does it simply emerge from the kinds of stories you choose to tell?\nI’m not sure that’s a real dichotomy. The cosmos is only meaningful to the degree that it’s experienced by sentient beings, after all. And fiction as an art form is a finely-tuned device for generating a sense of intimacy and pathos in readers—a novel that doesn’t do that, at least to some degree, is fundamentally broken.\nThe way narrative can capture and evoke the shared experience of our lives—the scratch of snow against an icy window, a conversation at a garden party, the touch of a hand in a darkened room—is a big part of why I read and why I write. And what’s wonderful about science fiction is that it lets us treat the cosmic and the ordinary as a figure-and-ground reversal, a sort of literary Nekker cube.\nYour science fiction novels are remarkably varied. In what ways do you keep your curiosity and creativity primed, to sustain what Paul Di Filippo has called your “deliberate heterogeneity”?\nI think it’s just my own scattershot curiosity, in combination with a genre that lets me get away with indulging it. And while I don’t think of what I do as “genre-bending,” some of my novels are in a kind of dialogue with genres other than science fiction, which might make them seem more heterogeneous than they really are. Julian Comstock borrows its voice and structure from 19th-century American moralistic and adventure fiction, for instance, and Burning Paradise has a few nods to contemporary thrillers and horror novels.\nGiven the range of your science fiction works, have you ever considered writing a novel outside the genres of the fantastic altogether? How about non-fiction?\nI’ve thought about it, and I don’t rule it out, but there’s very little of what I want to do that doesn’t fit within science fiction, to be honest. As for non-fiction—I watched my wife Sharry Wilson go through the long process of writing her book Young Neil (ECW Press, 2014, about the early years of singer/songwriter Neil Young), and I don’t think I have what it takes to do that kind of sustained, detailed research.\nReaders have noted a tone of melancholy in works like Memory Wire (1988), Darwinia (1998), The Chronoliths (2001), Blind Lake (2003) and the more recent Burning Paradise (2013). Gary Wolfe, discussing your short stories, commented on their “heartbreaking sense of loss.” Has this been inspired by specific personal losses, or does it result from a more abstract existential worldview—or both?\nI guess I’ve experienced as much personal loss as the average North American of my age and background, but if there’s a sense of melancholy in my work I don’t think that’s the sole explanation. Nor am I sure about “a more abstract existential worldview,” but maybe that’s closer to the truth. We’re the first species on Earth to have evolved the kind of sentience that forces us to acknowledge (or deny) our mortality, both as individuals and as a species. I don’t know if that’s “heartbreaking,” but it’s certainly poignant. You can’t talk about time and change without giving at least a little thought to human ephemerality. “Man is in love, and loves what vanishes.”\nThe Affinities, just out, is your 17th novel; The Perseids and Other Stories (2000) is your only short story collection to date. Your bibliography suggests a shift away from short stories during the last decade or so. Can you talk a little about that?\nA temporary shift, maybe. I tend to write short stories in batches, and you’re right, it’s been a few years since the last round. I think of myself as a novelist first, and I read more novels than short fiction, so maybe that’s natural. But short fiction still interests me. Some of the writers I most enjoy reading do their best work at shorter lengths—Steven Millhauser, Ray Bradbury, Ted Chiang. It wouldn’t take much more than an interesting idea to lure me back into short fiction.\nI’m currently reading Millhauser’s collection Voices in the Night, and it strikes me how fragile these wonderful stories are, like delicate life-forms that can exist only in the ecosystem of short fiction. Millhauser seems to generate such ideas effortlessly. I don’t. Short stories are labor-intensive for me. But some ideas only work at shorter lengths, and yeah, I’ve stored up a few such ideas. We’ll see.\nThe first part of The Affinities deals with Adam Fisk finding a new family for himself in the Tau Affinity. The name Tau made me think of the five castes—Alphas through Epsilons—in Aldous Huxley’s Brave New World. Do you see The Affinities as tracing its lineage to this type of social science fiction, or do its roots lie elsewhere?\nI wasn’t thinking of Brave New World when I wrote The Affinities, though I’m flattered by the comparison. And this may be a petty distinction, but The Affinities isn’t social science fiction in the sense of “fiction based on the social sciences.” The Affinities imagines a kind of social technology derived from new discoveries in cognitive science. In other words, the imaginary technology is social but the speculative science undergirding it is cognitive and neurological.\nThe Affinities, of course, aren’t castes. No one’s obliged to join one, and you can leave at any time. In many ways, they’re the opposite of an authoritarian model of organization. They aren’t easy to govern from the outside, and they quickly evolve out from under the nominal control of their parent corporation. What makes them powerful is what they offer—an idealized family, an idealized politics, meaningful social support systems—and the open-ended way they evolve and compete.\nIn a way, the idea owes more to stories like H.G. Wells’ “The Door in the Wall” than to dystopias like Huxley’s Brave New World. The Wells story is a fable about a man who discovers a mysterious green door that admits him to a paradisiacal world in which all his longings are fulfilled—but if you leave, you may never find that door again. The Affinities begins with the narrator Adam Fisk hesitating at a door that seems to make a similar promise. Adam’s door-in-the-wall is a suite of neurological tests, and the paradise behind it is perfectly real. But it’s not the only paradise, and not everyone who knocks on the door can get in. That’s the moral and political dilemma at the heart of the book.\nIf there was a perfect Affinity for you, what would it be like?\nThe Tau tranche house, at least as Adam encounters it in the first part of the book, feels like a place I could happily live. And the most positive reactions I’ve heard are from readers who feel the same way. But it’s part of the premise that not everyone will find Tau particularly alluring. “Your mileage may vary” is built into the nature of the concept.\nOne of The Affinities’ central concerns is how human culture and individuals might be transformed, for better or worse, by the application of science to human dynamics. How do you get along with social media in the here-and-now?\nIndifferently and idiosyncratically. I enjoy interacting with readers on Facebook, for instance, but I can’t work up any real enthusiasm for Twitter. But that’s just me. I don’t have any weighty Cory-Doctorow-like insights to offer, and of course The Affinities isn’t about social media, though a couple of reviews have drawn the connection.\nIn a recent interview you mentioned that “cognitive science is opening big new doors for imaginative fiction to step through.” Who are some of your favorite pioneers—writers or scientists—of this frontier?\nTerrence W. Deacon is a professor of evolutionary anthropology at UC Berkeley who wrote a book called Incomplete Nature: How Mind Emerged from Matter. He invented the word “teleodynamics,” which I borrowed for The Affinities, mainly because it sounds so wonderfully science-fictional. Deacon’s book sketches out how we might begin to understand life and consciousness at the level of complex thermodynamics. It’s immensely interesting stuff, almost a blueprint for the next century’s work on abiogenesis and the evolution of consciousness. (One of Deacon’s graduate students just emailed me to say Deacon “thinks it is rather cool that teleodynamics got a mention in a science fiction book.”) Another book I keep going back to is Philosophy in the Flesh: The Embodied Mind and its Challenge to Western Thought by George Lakoff and Mark Johnson.\nBoth books are large, long, and technical, so I don’t necessarily recommend them to the casually curious. And I’m not a scientist or a philosopher, so I can’t evaluate them on that level. But they led me down some interesting speculative roads, and that’s already showing up in my fiction—in The Affinities in particular, and in a book I haven’t yet started to write, tentatively called The Cure.\nJohn Clute, in his review of Burning Paradise, posits that one of the novel’s main themes is “that we were not designed to survive our evolutionary success . . . having escaped our niche, we have nothing but ourselves to eat.” How do you feel about this interpretation, and how does this idea strike you in real life?\nA little bleak. It’s true, I think, that our technological success is taking us out of our comfort zone as a species. We haven’t evolved a lot of tools for dealing with slow, large-scale problems like global warming, and we have a bad habit of clinging to social and economic institutions even when they’ve outlived their usefulness or demonstrated toxic side effects.\nIn Burning Paradise an alien symbiotic entity has helped us address some of those problems, without our knowledge and for purposes that aren’t entirely altruistic. But the irony is that the aliens aren’t conscious, sentient beings. They’re essentially machinelike, and all they can do to achieve their ends is manipulate human nature as they find it. In other words, they haven’t made us do anything we couldn’t have done on our own. The paradise that burns is as much our creation as it is theirs.\nYou’ve been hard at work finishing a new time-travel novel called The Last Year. How does time travel in this novel differ or relate to its depiction in A Bridge of Years (1991) and The Chronoliths? What was the inspiration for The Last Year? Any tentative idea of its release date?\nA Bridge of Years and The Chronoliths were both fairly conventional time-travel stories, with the conventional concerns about how altering the past might alter the future. I didn’t want to write that kind of story again. The Last Year imagines a vast array of “pasts,” each one a distinct alternate universe. Nothing you can do in such a universe affects anything back home. If this were Bradbury’s “A Sound of Thunder,” you could shoot dinosaurs and trample Paleolithic butterflies to your heart’s content.\nSo we have a situation in which corporate interests are free. Treat the past as an exploitable commodity—say, by opening a luxury resort hotel in 1870s America, catering to wealthy tourists from the future but also to locals rich enough to pay for the opportunity to gawk at motion pictures and dioramas of The Word to Come. Cultural conflict is inevitable, of course, and it means such a project is unsustainable—either the locals are going to be fatally offended and bring the whole thing down, or this version of “the past” will change so dramatically that it loses the virtue of authenticity. But a few years is long enough to extract a significant profit, and who cares if it doesn’t last longer than that? There’s always another 1875. It’s a renewable resource.\nPart of the fun of the book is the uncensored dialogue between two Gilded Ages, each deeply suspicious of the other. The “last year,” of course, is the year when it all breaks down.\nI should be handing in the book next month, but there’s no publication date yet.\nAlvaro is the co-author, with Robert Silverberg, of When the Blue Shift Comes, which received a starred review from Library Journal. Alvaro's short fiction and poetry have appeared or are forthcoming in Analog, Nature, Galaxy's Edge, Apex and other venues, and Alvaro was nominated for the 2013 Rhysling Award. Alvaro's reviews, critical essays and interviews have appeared in The Los Angeles Review of Books, Strange Horizons, SF Signal, The New York Review of Science Fiction, Foundation, and other markets. Alvaro currently edits the blog for Locus."}