{"fingerprint": "XQPhahO6AAyE3HfKj7c4WRIuMqE=", "sitename": "Clarkesworld Magazine", "title": "The Children of Main Street by A.C. Wise", "author": "A C Wise", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wise_12_10/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Children of Main Street by A.C. Wise", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4070 words, short story\nThe Children of Main Street\nThe first thing the children of the colony learned after the ship landed was how to change genders.\nThey’d been born in the long dark between the stars; not one had ever set foot on Earth, on good, solid ground. They’d never known a fixed sky, just the star-shot dark tumbling past the ship’s portholes as they hurtled towards a new world.\nThey’d grown like weeds in the cracks of the ship, playing quiet games. Laughing and running were forbidden, making them always too loud, and too much in the way.\nWhen the ship finally touched down, when the doors hissed open, they ran. They ran under an alien sky, under twin moons, and breathed the dome-filtered air while their parents hid behind walls and fretted about creating Earth-like homes. A new world turned under their feet, and though they didn’t understand with their conscious minds, the children sensed in their bones that things were different here. The old rules did not apply. So they changed.\nThe colony doctors ran tests. They drew blood, hooked the children up to electrodes, and flashed them with x-rays—all to no avail. As a last resort, the grown-ups broke down and finally asked the children. The children simply looked at each other and smiled, some with secrets tucked in their cheeks, but most with pity in their eyes.\nFor better or for worse, the adults realized, this was the way of the world now—twin moons, an oddly colored sun, life under a giant dome, and children who flickered and changed as quick as passing storms. Some days the cul-de-sac at the end of Main Street would be filled with nothing but little boys, some nothing but little girls, and others the genders would be split evenly with no rhyme or reason.\nTiffany Webster stood in the kitchen doorway, gathering her nerve. Her son . . . no, her daughter now, sat at the kitchen table wearing a pink dress, head bent and face hidden by a curtain of silky brown hair. Pink shoes that matched the pink dress swung under the table, the little girl’s heels thumping the chair railing in an irregular rhythm.\nThe dress and shoes had been a present from Tiffany’s husband George, no doubt. George had had a much easier time adjusting. Despite the fact he’d always wanted a son, he seemed delighted to occasionally have a daughter now, too. He called it the best of both worlds.\nTiffany edged closer, peering over her daughter’s shoulder. Dust-laden sunlight, just a shade different from the sun back home, slanted through the window and illuminated the scatter of construction paper, crayons, glitter and glue spread across the table. Michael . . . Michaela . . . was making a Mother’s Day card. A sob lodged in Tiffany’s throat.\nI’m a horrible mother.\nThe thought was stark, cutting-sharp, but true. She’d been avoiding her son, now her daughter, for weeks. She couldn’t stand the sight of the quick-silver changeling who’d taken the place of her precious, little boy. She couldn’t be around her.\nTiffany didn’t trust herself not to grab the little girl by the shoulders, shake her until her head snapped back and forth on her slender neck, and demand to know where Michael had gone. The violence of the thought shocked her, it made her hands shake, but it wouldn’t go away.\nEver since Tiffany could remember, she’d wanted a child. She and George had talked about it on their honeymoon; he’d wanted it as much as she had. They’d spent nights lying in bed together, his stomach fitted against the curve of her spine, coming up with baby names.\nIt had been so hard, waiting as they went through the colony application program. They wanted that, too—a fresh new world, a place of their own. They’d been patient. Then, almost the moment they’d woken from cryo-sleep, ten years from planet-fall, they’d started trying for a baby.\nTiffany had gotten pregnant almost right away. When Michael was born, she’d been so happy. She’d been so proud, watching her son grow. Then she ship landed, and everything changed. A stranger—a girl with long, brown hair looked at her with Michael’s bright blue eyes and called her mommy.\nTiffany plastered a smile across her face, cheeks pulling so tight they hurt, and crossed the room. She touched her daughter’s silky hair, proud she could do so without flinching.\n“Michaela, honey, what do you want for breakfast?”\n“I’m Michael today, Mommy.” The little boy in pink turned, crayon poised mid-scribble. He had Michael’s face, Michael’s blue eyes and rounded cheeks, but he had Michaela’s long hair and wore Michaela’s clothes.\n“Oh.” Tiffany’s hand flew to her mouth, covering an absence of words. Her eyes ached, hot, stinging, and dry.\nTiffany stepped back, and continued backing away, shaking her head. She’d tried, she really had, but she couldn’t handle this stranger with her son’s eyes, her son’s face.\nMichael continued to watch her. Tiffany couldn’t tear her gaze away from her son, from the crayon in his hand, and the litter of paper hearts around him. Instead of hurt and confusion, Tiffany saw calm acceptance, an alien stillness she couldn’t fathom. It was as though he’d known this moment would come.\nTiffany bumped into the door, fumbling for the knob without turning around. The motion jarred loose tears, blurring Michael and Michaela into one. She slammed the door, and put both hands over her mouth again.\nStanding on the porch, Tiffany listened for footsteps. She imagined Michael’s chubby hand pressed against the other side of the door, still smelling of wax from gripping the crayon, fragments of color caught under his nails. She jerked away, took a deep breath, and turned around. Squaring her shoulders, Tiffany walked down Main Street.\nChildren ran shrieking around the cul-de-sac, laughing. Little Bobby Mercer had blonde braids, and little Becky Simmons had torn jeans and a bloody nose from a fight with another boy. Tiffany had known these children since they’d been born, and now they were strangers to her, all of them.\nTiffany left the cul-de-sac behind. Perfect houses lined the street, set on neat squares of lawn, planted with flowers and trees. It looked like home, but it was a lie. The dome arched between her and the sky, curving around their settlement like a parent’s protective arms. Beyond the dome lay gray dust; beyond the thin veil of sunlight lay darkness and cold stars.\nShe knew the same vastness, the same vacuum, surrounded earth, but she could feel it here. She was a long way from home, crushingly small, terrifyingly alone. It hurt. The distance wound out from her heart, a thread of physical pain, but she couldn’t follow it back home, not ever again.\nThey’d left earth during Kennedy’s second term, under the threatening shadow of war, but that was a lifetime ago—several lifetimes. Every one she knew back home was long dead. Her sister’s children, maybe even their children’s children, were bones and dust. For all she knew, there was no earth anymore. The sun might be an ember by now, its light winked out of the sky, taking the blue-bright ball of the earth with it. She and the other colonists might be the last humans in existence. And even they were barely human anymore.\nPressure built, pushing against her temples, filling the space around her lungs. Tiffany’s pulse kept time with her steps, which carried her to one of the gates where the four-wheel exploration vehicles, encased in protective plastic bubbles, passed through the dome and out onto the alien terrain.\nTiffany hid, watching the guards check each vehicle through. Her pulse slowed; the pressure eased. She memorized the timing, the way the inner gate locked, unable to open until the outer door completed its cycle. When the guard waved the next car through, Tiffany darted in behind it.\nThe gate hissed shut, muffling the guards’ shouts, dampening the sound of fists pounding on the door. The opposite end of the gateway opened onto the killing cold and the poison air. The four-wheeler drove out onto the alien terrain, and Tiffany Webster followed calmly behind it.\nSarah Beth Dolan stood at the sink, staring through the window at her son Timmy—who was sometimes her daughter Tamara—playing in the yard. Bubbles melted, the breakfast dishes forgotten under them, while the water cooled. Sarah Beth held a dripping plate in one hand, a dishtowel limp in the other.\nTimmy kicked a soccer ball against the fence, diving to save against an imagined goal as the ball bounced back. Grass stains smudged his bare knees. His hair, a brown mop, hid his eyes. Sarah Beth couldn’t remember what color those eyes were.\nShe remembered the doctor placing a squalling baby in her arms. Its face had been red and mashed, wisps of dark hair plastered against its still-soft skull. Its eyes were screwed up tight against the ship’s lights, its fists clenched, flailing at the unfairness of being born. It screamed.\nSarah Beth remembered thinking the baby didn’t look like her or her husband Mark; it didn’t really look like anything at all. She couldn’t even tell if it was a boy or a girl, not until the doctor told her. Now, she couldn’t remember what the doctor had said.\nShe knew the gap in her memory should frighten her, but Sarah Beth felt strangely calm. A sense of peace wrapped her like a warm blanket on a cold day. Maybe it was something in the light, or something in the air, slipping in despite the dome. Sarah Beth couldn’t give it a name, but things were different here.\nAll her life, she’d dreamed of going up among the stars. She’d followed the saga of the first colonists, the ones who’d built this place, and longed to be one of them. She’d watched, rapt, full of terror and awe as reports of the colonists’ disappearance began to filter in. But even that gave her hope. There were those who believed that the colonists hadn’t disappeared, they’d simply changed.\nWhen she’d been accepted into the colony program, Sarah Beth had been ecstatic. Deep down, she’d wanted to do more than see alien places; she’d wanted to be alien.\nShe’d never told anyone, not even Mark. But ever since she was little, Sarah Beth had known there was a seed buried deep in her chest, waiting to bloom. It filled her with a wanting she couldn’t name, a restlessness that manifested as a feeling of drowning on dry land. There had to be something more.\nShe wanted to be like the superheroes in comic books—the books her father had always said weren’t for girls; books she’d had to sneak into her brother’s room to read when her parents weren’t looking. An alien with a destiny, who didn’t belong on earth, but who was special somehow—Sarah Beth wanted to be more than just flesh and blood and bone.\nSarah Beth set the dripping plate on the counter and walked outside. She stood on the deck, and touched her cheeks; they felt hot and flushed against her palm. She took a deep breath, in and out.\nThey’d come so far across the stars, to a brand new land full of promise . . . and they’d tried to replicate the world they’d left behind. The perfect houses and gardens replicating Earth-life cloyed; they were ghastly. Looking at them day in and day out broke Sarah Beth’s heart. This wasn’t the life she’d dreamed. She couldn’t go on like her husband, pretending to care about the things that had been important back home. Accounting, tax laws, chat around the water cooler—those things meant nothing here.\n“Timmy?”\nThe boy looked up. He stopped the soccer ball expertly with one foot. Sarah Beth crouched, touching Timmy’s arm to assure herself of his solidity, as if he might shift before her eyes. With her other hand, she brushed the mop of hair from his eyes. They were blue-gray.\n“Can you teach me to how to change?”\nMark Dolan came home to find a strange man sitting on his couch. The man jumped up as Mark entered, released like a coiled spring.\n“Who . . . ?” Mark faltered.\nThe ship that carried them across the stars left no room for strangers. Mark knew every person under the dome, but this man, he’d never seen before.\n“Where’s Sarah?”\n“Mark, it’s me.” Sarah stepped forward.\nMark stared. The man’s cheeks appeared fresh-shaved, but a hint of stubble, like a shadow underneath the skin, persisted. He wore one of Mark’s suits, the gray jacket too large on his short, compact frame—the sleeves hanging past his wrists, the pant cuffs pooling over the polished wingtip shoes Mark wore to meetings.\n“Mark?” The man who claimed to be Sarah moved closer, nervously clasping his hands in front of him. Mark watched the man’s Adam’s apple bob.\n“Mark, it’s me.” The man touched Mark’s chest, thick, square fingers resting against Mark’s lapel. The stranger’s eyes begged for understanding; they were Sarah Beth’s eyes. “It’s okay, Mark.”\n“But you’re my wife!” Mark stepped out from under the man’s touch, staring. His left arm tingled.\n“I’m still your wife.” The stranger’s voice was deep and quiet.\n“But you can’t . . . I can’t . . . ” Mark’s ears rang; his mind reeled. The words came all at once. “How could you do this? How did you do this? With the children it was bad enough, but . . . my God! Didn’t you hear about Tiffany Webster? What were you thinking? We’ve been married for sixteen years!”\nSixteen years. The words lodged in Mark’s chest. It would be more if he counted the years they’d been asleep, side by side in their cryogenic pods.\nHe remembered waking up with Sarah Beth beside him. They’d been so shy; it was almost the way it had been when they were first dating, even though they’d been married for six years. They’d spent weeks getting to know each other again, talking about the strange dreams they’d had as they tumbled through the stars.\nThey’d walked the ship’s corridors holding hands, the way they’d held hands as high school sweethearts. In those weeks, she’d been a stranger to him, but she’d still been Sarah Beth, his wife, the woman he loved. And now . . .\n“I’m sorry, Mark.” The man’s eyes held genuine regret. “I still love you. I understand if you can’t love me, and . . . and I think that’s okay.” The man bit his lip.\n“What the hell are you talking about?”\nThe man touched the back of the couch, fingers flexing against the fabric, a nervous gesture that reminded Mark so much of Sarah Beth that he wanted to scream. He needed his wife back. He needed her arms around him, her voice telling him everything would be okay.\n“How can I explain? Things are just . . . different here.” The man met Mark’s eyes, pleading once more for understanding. He looked torn, but Mark could read his expression, all too familiar, and knew which way the man who claimed to be his wife was leaning.\n“No.” Mark heard the word, knew he spoke it, but it meant nothing.\nThe totality of the situation crashed down on him. Nothing had meaning anymore. The house squeezed claustrophobically tight around him. His chest echoed the house, crushing his heart and lungs. The very worst part was, deep down he knew the man . . . he knew Sarah . . . was right.\nEverything was different here—the patterns of stars, the twin moons, the strange-colored sun. The rules had changed. He never should have come. They never should have come—not just their family, but people, human beings.\nTheir neighbor Tiffany had walked right out of the dome and died in the cold dark under the alien stars. That was what awaited them out here; that was the choice—death or a world gone mad.\nMark opened his mouth. The back door flew open, interrupting him, and Timmy came thundering into the room.\n“Hey, Mom, hey, Dad.” Timmy addressed his parents in turn. “Can I go to Becky-Brad’s house tonight? There’s going to be a sleepover.”\n“Of course,” Sarah Beth answered at the same time as Mark said, “No.”\nMark put his hand to his head. The room spun.\n“Dad?”\nMark lowered his hand. His son looked at him, puzzled. Mark looked back and forth between the strange man and the strange child.\nHe pinched the bridge of his nose. He felt as though he hadn’t slept in years. He sighed. “Yes, of course, you can go.”\n“Thanks, Dad!” Timmy darted in, kissed his father on the cheek, kissed his mother, and ran up the stairs. Mark watched his son, bewildered.\nIn the space between breakfast and now, Mark had somehow lost both his wife and his son. They were running ahead, towards an unknown future, going somewhere he wasn’t even sure he wanted to follow.\nThree weeks later Mark said, “I’m sleeping with Anna Mancuso.”\nHe was amazed at the steadiness of his voice. Sarah Beth turned from the stove.\nHis wife looked like her old self again. Her changes were as liquid-smooth and quick as their son’s now, but Mark could barely look at her. Regardless of her appearance, she was a stranger. He’d tried to touch her, once, but the brief attempt left him physically sick. He’d come back into the bedroom long enough to gather a pillow and an extra blanket before retreating to the couch. They’d slept on separate floors of the house ever since.\n“Her husband ran off with another woman, though he’s calling himself Charlene now. They’re living together like . . . ” Mark trailed off, shook his head. “It doesn’t matter.”\nSarah Beth, who sometimes called herself John now, remained expressionless. Her eyes, which had been the only constant through her changes, had turned strange—a blue-grey reflecting the alien sky arched above the dome. For the sheer contrast, they made Mark think of the aching blue summer days he’d experienced in Iowa as a young boy.\nBack then they’d lived in a big, rambling farmhouse at the end of a road bordered by fields of wheat. Though the floorboards sagged, and the roof leaked during heavy rains, it felt like home. They’d moved so often during his childhood. Each time hurt, but somehow leaving the farmhouse felt like having his roots ripped out of the soil. He wanted something solid, some place to call home, and he’d followed Sarah Beth to the stars, thinking she was his home. She was supposed to be the one constant that would never change, but now . . .\nSarah Beth set the wooden spoon back into the pot of sauce, and lowered the burner. Mark had expected hysterics; he’d expected her to cry, or even hit him. Would she react like a man, or a woman? Would she try to solve their differences with words, or a knock-down, drag-out fight? He didn’t know. He didn’t know anything about Sarah Beth anymore.\nBut she did nothing. Her perfect calm was unsettling; it dropped his heart into his gut. Sarah Beth wiped her hands on a dishtowel and stood behind one of the kitchen chairs, bracing her hands its back. She regarded him steadily.\n“I understand.”\nWhat? What do you understand? Mark wanted to scream, but his tongue froze. How could she be so calm? She’d told him on the day she changed that she still loved him. She’d told him again—at least half a dozen times since — but the words meant nothing. They were like the word wife, like marriage, like boy and girl. Everything on this damned planet was different; nothing made sense anymore.\n“I should go.” Mark turned. Sarah Beth, who was sometimes John, watched him. Her alien eyes exerted physical pressure on the tension strung between his shoulder blades. At any moment, he would snap.\n“Call me,” Sarah Beth said. “If you ever want to come home, I mean. Tamara will miss you, but I know she’ll understand.”\nMark didn’t answer. He walked out the door and down the street to Anna Mancuso’s house. His hand shook as he rang her bell.\nAnna opened the door, her eyes red as though she’d been crying. Coats hung neatly from a row of hooks beside the door, shoes lined up beneath them. Mark noticed that Anna’s husband had left his shoes beside Anna’s, as though he might come back at any moment, or as though items that mundane simply didn’t matter anymore.\nLooking at Anna, Mark knew without a doubt that he didn’t love her. She was steady, she didn’t change; she was something to hold onto. He thought about Sarah Beth, about the way she’d been when they’d boarded the ship together. He kept the image in his mind as he took Anna’s face between his hands and kissed her—long and deep and searching.\nAnna kissed him back, clinging as though Mark was the last thing keeping her from drowning. He wondered if she had any illusions about love, or whether she understood what they had as well as he did. He realized he didn’t care. He backed her towards the kitchen, towards the table, which still smelled of furniture wax. The whole kitchen smelled clean, as though Anna had spent hours scrubbing.\nMark shoved one of the chairs out of the way with his foot, bending Anna back over the table. He fumbled with his belt, getting his pants down around his ankles and leaving them there. Anna responded, as though by rote, going through the motions of desire. Her gaze fixed on some point beyond his left shoulder as she unbuttoned her blouse.\nBy the time they were done, twin moons shone soft light through the kitchen window. They lit Anna as she turned her face away, showing the threads of gray just starting to lighten her hair. Given enough time, everything changed.\nMark gathered his pants, belting them perfunctorily. He didn’t look at Anna. He looked at the strange sky, wondering if he’d ever be happy again.\nIt wasn’t fair, the one who had been Sarah Beth-John considered as s/he looked down the hill at the human settlement below. The dome gleamed with reflected starlight, a soap bubble, thin and frail, struggling to hold back the night. S/he hadn’t meant to hurt anyone. Why did change have to be this way? Why did the most important things in the universe have to be full of pain? Why did the new have to rip the old apart before taking its place?\nS/he sighed. The child who had been Willy-Jane slipped long, thin fingers into Sarah Beth-John’s hand, and s/he offered it a smile. Timmy-Tamara took hir other hand. Its blue-gray eyes caught starlight; they seemed wide enough to hold the entire sky. The faint ache in hir heart faded as Sarah Beth-John turned and guided the children away from the view of the settlement below.\nS/he and the others—the ones who had been Catherine-Steve, Laura-Matt, Karen-Dave, Charlene-Charles—they’d tell the children stories of Earth-that-was with fondness in the years to come. Even if the humans didn’t believe it, even if they thought their former friends, lovers, and children mad, those that had changed still honored their past. It was a part of them, but it was a fragment of a larger whole. The universe was so much larger out here.\nMaybe someday the humans would understand. Maybe they’d come up into the hills, following in the footsteps of those who had come before them. Maybe they’d wake up one morning, and they wouldn’t be afraid anymore.\nTheir lungs would be new, their limbs long, their eyes blue-gray and wide enough to hold the stars. They’d walk out of the dome, and breathe the alien air; they’d step barefoot over the soft sands and croon-sing to their brother-sisters, asking to come home. They would be welcomed, as Sarah Beth-John and the others had been by those who had gone before them.\nOn that day, Sarah Beth-John would rejoice. Until then, she’d hold them in hir heart. S/he’d love them, just as s/he loved hir brother-sisters here above the human’s dome. It didn’t matter if it took forever, or if the change never happened. S/he could be patient. S/he could wait until the end of the world.\nA.C. Wise's fiction has appeared in publications such as Uncanny, Clarkesworld, Tor.com, and several Year's Best anthologies. Her work has won the Sunburst Award for Excellence in Canadian Literature of the Fantastic, as well as twice being a finalist for the Sunburst Award, twice being a finalist for the Nebula Award, and being a finalist for the Lambda Literary Award. She has two collections published with Lethe Press, and a novella published by Broken Eye Books. Her debut novel, Wendy, Darling will be published by Titan Books in June 2021, and a new short story collection, The Ghost Sequences, will be published by Undertow Books in August 2021. In addition to her fiction, she contributes review columns to Apex Magazine and The Book Smugglers."}