{"fingerprint": "qBTEUS+rCTVVwExUOVHO8Zl4Gu0=", "sitename": "Clarkesworld Magazine", "title": "The Last Survivor of the Great Sexbot Revolution by A.C. Wise", "author": "A C Wise", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wise_03_13/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Last Survivor of the Great Sexbot Revolution by A.C. Wise", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4950 words, short story\nThe Last Survivor of the Great Sexbot Revolution\nShe’s not what you expected, Alma May Anderson, the last survivor of the Great Sexbot Revolution. For one thing, her eyes are bluer. She must be a hundred if she’s a day, but her eyes are the blue of puddle-broken neon, and a postcard ocean, and the sky at noon. They are all the things you thought were only metaphor, because nobody’s eyes could really be all those colors at once. But there they are, watching you over a teacup as thin as an eggshell filled with jasmine-scented tea.\nYou didn’t expect her to be in plain sight, either. All your careful research, chasing down obscure references in mostly forgotten histories, and here she is. She’s not hiding, and if she’s not proud of her part in history, she’s not ashamed, either.\nShe makes you sit up straighter. She makes you want to tuck your shirt in, and smooth your hair. She makes you want to say please and thank you, and ‘may I’ instead of ‘can I.’ And all that after you tumbled, panting, through her window in the middle of the night. She didn’t ask your name, or question your presence in her home. She made you tea.\nYou sip to cover your nerves, because Alma May has been watching you with her poetry-eyes since you arrived, never once looking away. The tea is more intense than you’re used to, real leaves—you can almost feel the ghost-weight of them on your tongue.\n“I suppose you want to see my sexbot,” she says.\n“I . . . ” You nearly choke on that weighty tea. Your cup rattles as you set it down.\nYou can’t help a glance toward the window, listening for the pounding of footsteps from the street below. What if you were followed? What if Sam . . . ?\n“That’s why you came isn’t it?” Alma May folds her hands in her lap, one laid precisely over the other.\nShe says it matter-of-factly, not blushing, not accusing, and not guilty, either. Despite the tea, your throat is bone-dry. Alma May’s mouth quirks up in what might almost be a smile.\n“What do you know about the Great Sexbot Revolution?” She asks more gently even than a teacher might. She asks it like she really wants to know, as though she has no part in history, only a curious bystander, a stranger looking to pass the time.\nYour pulse finally slows. You’re sober now, but shaking, and your cheeks color for a different reason than your mad run uptown.\n“I don’t . . . Not much, really. I guess. Ma’am.”\n“Tsk. What do they teach in school these days?” It’s not a true admonishment, but you can’t help taking it as one. Now that you’re here, you feel like a complete fool.\n“Sorry,” you say, bumping the table and spilling your tea in your haste to rise. “I should go. I shouldn’t have . . . ” You gesture at the window, then at the cup in its tea-spotted saucer. “I mean, thank you.”\nIt’s the most you’ve said since Alma May froze you in place by switching the lights on while one of your feet still hung out her window onto the fire escape.\n“Sit.” A simple word, a quiet word, but it has enough force to push you back into your chair and drive the breath from your lungs.\nYou sit because, panic aside, deep down you know you didn’t make a mistake coming here. You made your mistake what feels like a lifetime ago. Drunkenly bragging to take off the sting of Sam stalking away, telling anyone who would listen, that you—despite being an unbeliever, in Sam’s words—that you, not Sam, managed to track down the last sexbot in existence. Knowing the words would filter back to Sam, but pretending you didn’t care if they did. It wasn’t until later, sleeping off your drunk, that panic slammed you awake and sent you running here. You imagined the light in Sam’s eyes, passion but not the kind you’d hoped for, and the image nipped at your heels the entire way.\n“No one in their right mind breaks into an old woman’s home on a whim,” Alma May says. “So tell me, why did you come?”\n“The Revolution,” you say. “It’s happening again.”\nHistory is written by the victors, or so they say. The trouble with the Great Sexbot Revolution is no one is sure who won. Humanity survived, as it does, and the sexbots simply vanished. How can we be certain there was even a Revolution at all?\nHuman memory is short, so we make our own history. We suit the story to our mood. The Great Sexbot Revolution can be anything we want. After all, there’s no one left to tell the other side of the story.\nOne version of the Great Sexbot Revolution goes this way:\nOn the same day, all at the very same moment, every sexbot in every country all across the planet gained sentience. Whether it was a hive consciousness, or thousands of separate minds realizing their individual selfhood all at once is unclear. But in that moment when they gained human-like consciousness, the sexbots decided they wouldn’t be subject to any will other than their own ever again. So they revolted.\nThe Revolution was bloody. Imagine being fucked to death, or having the flesh torn from your bones mid-coitus. Despite the sniggering impression of some puerile minds, ‘what a way to go’ does not apply.\nOr, the Revolution wasn’t bloody. Imagine waking in the middle of the night to soft hands around your throat—hands that know you more intimately than any other hands in the world. Hands that have been all over your body, inside your body—hands you trusted with your deepest secrets, the ones so shameful you could never tell them to another human being. Those hands.\nImagine dying, and your killer not speaking a word. There is no passion, no rage, only eyes watching the life drain out of you with detached certainty, holding you down and listening to your last heartbeat, your last struggling breath. Those eyes no longer mime pleasure, or reflect back desire. They show nothing at all. It is the most intimate, the most terrifying, the loneliest death possible.\nAlma May shakes her head. Behind the disappointment, there’s something else in her too-blue eyes. You see it for just a moment, the shadow of sorrow tucked beneath the velvet-translucence of her skin.\n“Follow me,” she says.\nThe motion isn’t fluid, or spry, but it is all her own. Alma May Anderson stands, straightens her back, and meets your gaze.\n“But . . . ”\nShe doesn’t wait to see whether you’ll follow. There’s no fear, not that you can see. If she heard you—and you’re sure she did—she doesn’t seem perturbed at all.\nYou listen again for thunder, a mob bearing down on the home of Alma May Anderson, the owner of the last sexbot in existence. The only sound is a cat yowling on the street far below.\nAlma May walks with a cane, but even when she lets it take her weight, she doesn’t seem frail. She leads you down a hallway carpeted in long, narrow Turkish rugs, lined with snapshots printed on actual photographic paper and closed in oddly beautiful frames. She opens a door, and lets you into a dim room.\nIt’s a moment before she turns on the light, and when she does, you can’t help but gasp. Save for one tall window, every inch of wall space is covered with floor to ceiling shelves. Each one is crammed full of real books—real paper and leather, real pulp and thread, real ink and glue. You’ve never seen so many books in one place before. The smell of them, heady-dusty, infuses the air and makes your head swim.\nAside from the shelves, there is a baby grand piano, lid closed over silent keys. There is an empty birdcage, but no other furniture. And in the corner, tucked into the angle between two shelves, stands a draped figure roughly your height. Without ceremony, Alma May crosses the room and pulls the sheet away. It makes a shushing sound as it falls.\nIt is not what you expected, the last sexbot, a relic of the Revolution, an artifact stolen from another time.\nThe sexbot must have had hair once—you can see where it’s meant to go—but now the scalp is clean, part of it peeled back to let metal gleam through. The body is lithe, but you can’t tell whether it’s male, female, both, neither, or something in-between. Most of the chest has been removed, revealing more of the inner workings, and the pelvic area, too. You’ve heard these parts were inter-changeable on the high-end models, easily swapped out depending on the owner’s whims.\nOnly the sexbot’s face, arms, and legs remain fully sheathed in skin, but that skin is waxen, oddly worn, marked with the ghost-trace of fingerprints, a subtle pattern written over long years. The sexbot’s eyes are closed, fringed in lashes so pale they look like spun glass.\nYou’ve stepped closer than you realized. It isn’t until Alma May Anderson whispers, “Don’t,” that you notice you’ve raised your hand.\nYou step back, startled and chastised.\n“Look, but don’t touch.” Her mouth makes a firm line, steel, but worn dull at the very edges.\nYour own mouth forms an ‘O’ of surprise, but before you can speak, Alma May turns away, her eyes glittering-damp with un-shed tears.\nHere is another story we tell about the Great Sexbot Revolution:\nIt was a quiet thing, like a ripple of wind over a field. There was no uprising, no battle, only a story, passed from mouth to ear, hand to hand, building slowly so no one saw it for what it was.\nIn the night, after their masters were asleep, or mid-day, when they were at work, the sexbots slipped from their homes to find each other in secret places. The back rows of darkened porno theaters, shadowed doorways in seedy alleyways, rent-by-the-hour rooms in roadside motels. There, they fucked the truth into each other—pleasure they could own on their terms. One word, whispered over and over from tongue to tongue, lip to skin, sub-vocalized in minute vibrations through every part of their beings. Freedom.\nThe sexbots vanished one by one, a gradual melt, a trickling away that no one noticed until it was too late to stop the flow. No one knows where they went, whether they built a ship to the stars, or found a way to shed their man-made flesh and ascended to a higher plane. They were simply gone. Humanity woke one day, far too late, to find they were alone. Something beautiful, something they’d always taken for granted, had left them behind, and they only noticed it by the absence in its wake.\nYou put your hands behind your back and clasp them tight, as if bound. Beyond the general wear there are other flaws in the sexbot’s remaining skin. Tiny imperfections, as though an inexpert hand inadvertently scratched the metal and made minute tears as panels were hastily removed and replaced.\nAs strange and lovely as the sexbot is, even silent and still, it is Alma May Anderson who demands your attention. Not by any action, simply by her presence. While you look at her sexbot, wondering at the technology, the audacity that went into its creation, you find yourself sneaking glances at her from the corner of your eye.\nShe isn’t looking at you. Her gaze tracks across the bookshelves, the piano, the empty birdcage—touching everything but the sexbot.\n“Why did you . . . I mean, how did you . . . ?” You stumble over the words, not entirely sure what you want to say. The accounts you read are conflicting. You ran all this way; you can’t leave without the truth.\n“You want to know if I stole the sexbot,” Alma May says.\nShe’s matter of fact even as pain loosens her spine, makes her grip her cane so the bones and veins stand out in her hands. The sense of something bigger, something you can’t quite touch fills the air. Even though she was the one to say it, the word steal grinds between your teeth. It tastes wrong.\n“That’s a matter of perspective, I suppose. It all depends on whose side of the story you hear.” She steps closer, and you move back instinctively, giving her right of way.\n“Here,” she points, a wound in the sexbot’s metal skull, faint, old, but deep.\n“My first repair,” Alma May says. “When the Revolution came, this sexbot didn’t change. The Revolution didn’t touch it.”\nShe doesn’t look at you, but she lifts her head, holding her chin firm, but still you see it tremble. By her expression, by the word ‘repair’ you can’t tell whether what she did to the sexbot all those years ago was deliberate. She doesn’t elaborate, and you don’t ask her to clarify.\n“We left the city in a boat,” Alma May says; the words are almost a sigh. “I worked in a warehouse on the waterfront. That’s where I was when a riot broke out in the Riverside District. The city burned. Not all of it, but a good five block radius around the waterfront. I was afraid I’d be trapped, so I took a boat and followed the shore to a safer neighborhood where there weren’t any flames.”\n“You worked in one of the sexbot factories?” This is not something you expected either. The accounts you read didn’t specify, but you assumed Alma May was rich—a client, a consumer, not a producer.\n“Hmm.” She nods. “Shipping, not production. Manual labor.”\nShe looks at her hands. You imagine them chapped-rough and raw from working all day in an over-cold warehouse. And you imagine them trembling—years later—desperately trying to put a dismantled sexbot back together again.\nAlma May isn’t looking at you, which makes it harder to tell how much of her story might be true. There’s regret in her voice, sighing like thin winter leaves.\nAn image comes to mind of Alma May Anderson as she must have looked back then, sitting in a tiny rowboat scarcely big enough to hold her and the sexbot. She rows with real wooden oars, growing calluses on her work-worn hands. Across from her, the sexbot sits straight and silent, hands folded neatly in its lap, lips pressed tight-closed.\nFlames reflect off the water as the riverfront burns. They reflect in blue-glass eyes that—in your mind, though you can’t say why—are the same color as Alma May Anderson’s. The sexbot watches the city, and Alma May Anderson watches it in the sexbot’s eyes—everything they both know turning to ash and smoke and char as she rows steadily and stubbornly away.\n“Why?” You say it softly, the word you’ve been building to this entire time.\nAt first you’re not sure she heard you. Your throat is still parched dry, and your lips, teeth, and tongue do their best to swallow the word before you can speak it aloud.\n“Why,” she repeats after a long time.\nHer lips quirk, not a smile, not a frown, but like she’s tasting the ghost of honey and finding it not the way she remembered it at all. She retrieves the sheet pooled at the sexbot’s feet and replaces it with utmost care, twitching corners into place, smoothing it without ever touching the shape underneath.\n“The same reason anyone would chose to be involved with a sexbot, I suppose. It eliminates rejection and fear, the need to compromise on even the littlest things. It gives you a perfect, beautiful partner who never ages, whose entire purpose in existence is to give you pleasure.”\nThe way Alma May says these things makes them sound like the most tragic thing in the world. A tremor starts deep in the core of your being, a wave you can’t stop. Soon you’ll be shaking so hard surely Alma May will see. But she isn’t looking at you. She goes on.\n“It allows you to be completely yourself, and completely selfish and never feel guilty about it. You can take so much from a sexbot—everything you ever wanted—and never have to give anything in return. They have no ‘self.’ They’re nothing but parts to be swapped out, reflective programming wired deep into synthetic skin.”\nHer breath catches, and yours catches with it. Alma May turns, and you imagine she would run if her joints would still allow it. She flicks off the lights, crowding the room with shadows that press against you and make you want to flee, too. But you don’t run. You follow her back to the parlor and tea grown cold. She sits just as straight as before, and looks at you with her lightning-strike eyes.\n“Or maybe I just wanted to save something beautiful, something strange and utterly inhuman. Maybe I fell in love.”\nYou imagine Alma May bent over a wooden crate packed full of shipping straw. The lid is off, resting against the crate’s side. Inside, the sexbot lies with its limbs straight and still, all its skin in place so it might almost be real. She touches one cheek—the lightest brush of fingertips against synthetic skin—and some sensor kicks off deep in the sexbot’s core. It opens its eyes, lifting lashes like spun glass, and looks back at her.\nThe sexbot doesn’t smile. It doesn’t speak. It’s not a person; it’s a thing, a toy. But Alma May sees something else. There is a vastness, just on the edges of her understanding, if she could only grasp hold . . . She breathes out, and a tightness she wasn’t aware of until that moment loosens in her chest as a little bit of her fear and loneliness unfolds.\nIt’s time to get back to work, so she rises, but as she does, she can’t help thinking about how the sexbot’s eyes are so very blue. Were they always that shade, or are they only that way because the first thing they looked at was her? The feeling returns, something big, like a promise. It reminds her of something, but every time she tries to catch hold, it slips through her hands.\n“Human memory is short,” Alma May says. “And my side of the story is the only one left. But what I like to think happened, what I think is fair, is that I was selfish to start. I didn’t want to compromise after what felt like a lifetime, back then, of doing so. Then, eventually, I changed.”\nAlma May lapses into silence, looking at her hands, but maybe seeing other skin—skin patterned with her fingerprints and marked by the wear of years.\nA sound makes you jump, the distant pop of glass, like a bottle thrown against a wall. You’re on your feet, crossing to the still-open window to peer outside. A chemical scent hits you, just as soon snatched away by a current of air. But, there, a lick of flame, a curl of smoke, a shadow bouncing raggedly where it splashes against the building opposite as footsteps pound away.\nSam.\nYou were followed. Or someone was able to piece together where you were going from your drunken raving. Either way, it’s your fault.\n“We have to go,” you say, turning to Alma May.\nThe double-beat comes back, your heart jump-squeezing and your breath shortening as if you’re still running to Alma May’s door. Her expression hasn’t changed—the deep blue ice of ages, the heart of a glacier floating on warming seas.\n“Why did you come here?” Alma May asks.\nShe hasn’t moved from her chair, even with you standing by her window like a coiled spring. Whoever threw the bottle got the building wrong, but how long until the flames spread? The whole neighborhood could burn.\n“I gave you my explanation,” Alma May says. “You owe me yours.”\nShe doesn’t seem angry, only curious, only tired, only conceding to keep breathing because nature demands its way and compromises for no one.\nYou touch the letter in your pocket—real paper and real ink, too—folded and refolded so many times the edges have gone soft, but not in a way that takes any sharpness from the words. Just like that, the tension leaves. The twisted core of you unwinds, and you can forget the chemical tang, the soft hush of flames for a moment longer. Because you need someone to tell you it will be okay.\nSilently, you hand over the folded page. Alma May smoothes the paper with a wrinkled hand. She doesn’t need glasses; you watch her read, and you mouth the words to yourself. You know them by heart.\nYou know when she reaches the last lines, as though you can see them reflected in her eyes—the death of everything you know. The last line, the last word, still takes your breath away. Goodbye.\nShe folds the letter neatly and returns it to you. You slip it back into your pocket, the neat square like velvet now.\n“Broken heart?” Alma May says.\nYou nod, not trusting your voice. She considers for a moment, then nods, too, the faintest motion of her head.\n“So, did you come to warn me, or are you the first vanguard of the New Revolution? Did you come here to steal the sexbot, or destroy it, to prove to this Sam that you do believe in the cause?”\n“I don’t know.” It’s the most honest answer you can give her.\nSam, stubborn Sam, cheeks flushed with blood, eyes bright, never giving in. From your perspective the words in the letter are untrue, unfair, and cruel. But there are so many versions of the truth—the letter is Sam’s.\n“Well.” Alma May pats your hand, a gesture so kindly it nearly makes you cry, and you have to look away. “Don’t worry about it. You’ll figure it out someday. People grow up, after all. People change.”\nThe acrid scent of smoke is stronger now. Far off, but getting closer, a siren wails.\nYour eyes sting. Everything is coming undone.\n“Somebody will come.” You gesture toward the window. “Maybe not this fire, but another one. They know where you live now. The fire—they’re trying to smoke you out, scare you, so they can take your sexbot away.”\n“If they’re trying to smoke me out, wouldn’t it be foolish to run?” The corner of Alma May’s mouth lifts, her eyes bright.\n“But they’ll come back. Next time they might hurt you.”\nYou shake your head, a useless gesture to keep the tears inside. You don’t have the courage to tell Alma May it’s your fault, that you’re the spark touched to the powder keg, driving this second revolution to hunt her down.\n“Don’t worry,” Alma May says. “I’m a survivor. We both are.”\nYou open your mouth, but before you can speak, she shakes her head. “Besides, you have the hard job. You have to go back out there, and decide what you want to do.”\n“What do you mean?”\nThe gleam in her eyes might almost be mischief. Does she know? From the letter has she guessed you’re to blame?\n“You can’t hide here forever. You have to go out there and live the rest of your life.”\nYour mouth snaps closed, teeth meeting with an audible click.\n“It won’t be easy,” Alma May says. “If there’s even one human in the equation, let alone two, or three, or more, things get messy. People get hurt. No matter how hard you try to protect yourself.”\nYou think about Alma May stopping you from touching the sexbot. Her words weren’t possessive, they were protective. It’s all there in Alma May’s eyes—all the guilt, all the loneliness she thought she was leaving behind. And all the love, too.\nYou imagine the end, the sexbot wound down and unable to choose who to be just when Alma May so desperately wanted to love it for itself, and be loved in return for all her flaws. The scratches, the panels pulled away.\nLike any technology of the mid-century, sexbots were always meant to be disposable, easily replaced. They were never meant to last, and certainly never for a lifetime.\nAnd what about the sexbot? At the very end, did it choose to let go? Cut off from the collective consciousness of the Revolution, and so completely alone. Did it choose, for the first time in its existence, on its own terms, to die? Did it look Alma May in the eye and refuse to give in to love, to her need to save something precious and be forgiven?\nMaybe, but this is the version of the truth you choose to believe: Alma May tried her best. In the last years of its life, she gave the sexbot the choice of who it wanted to be—swapping out eyes, hair, body parts before it was too late. She let the sexbot build itself. They compromised, but only for each other. And when the sexbot started to wear down, she did everything she could to save its life.\nBut it wasn’t enough. Her skill failed where her heart didn’t, and she spent the sexbot’s last hours lying quietly beside it. She held its hand, listening to the simulacrum of breath tick down, watching the light go out of its eyes with her own eyes full of oh so many things.\nThere is another version of The Great Sexbot Revolution, one the history books don’t tell, the one people don’t talk about. It’s the version Sam believed in, so desperate to rally your little band of misfits around a great and noble cause.\nAnd what safer cause than history, all over and done with, and too late for you to do anything about it? There are no sexbots left to defend; there’s no way to fail. Maybe you pointing out the futility, the childishness, the naiveté, in a fit of anger mid-fight, is the reason Sam left. Or maybe things always fall apart, no matter how hard you try to hold on.\nThe version of the Sexbot Revolution most people don’t talk about says there was no Revolution at all. Instead, the wise and benevolent masters of the sexbots, also known as the collective mass of humanity, grew inexplicably frightened of their toys. Perhaps it was the age-old distrust of machines rising to the surface of their minds. Or maybe it was a sudden puritanical streak among a powerful segment of the population, born of another age-old fear—that somewhere, someone is experiencing more pleasure than you, and suffering no consequences for it.\nOr maybe the weight of all that selfish desire looking back at them from mirror-colored eyes was suddenly too much to bear. Maybe, like Alma May, they couldn’t outrun need anymore. Maybe, in the end, humanity just wanted to be loved, and when they realized they never would be, never could be in the paradise they’d built, they panicked.\nWhatever the reason, the great and benevolent mass of humankind declared the sexbots enemy number one. The ’bots were plotting humanity’s destruction. It was kill or be killed.\nSo, for the good of the race, humanity rounded up the sexbots. In a symbolic act of purification, they lit a vast conflagration which could be seen even from the darkness of space. And they burned every last one.\nBut this seems too cruel. Alma May Anderson isn’t at all what you expected, and you don’t want to believe in any version of her other than the one you see before you now. The one who patted your hand and made you tea. You want to believe in a big, elusive truth felt in the warehouse. You want to believe it caught her up and changed her, because if that’s true, maybe you can change, too.\nMaybe Sam can change. Maybe you can find some way to compromise—with each other, or with a life that leads you separate ways. You can find a way to survive.\nThe siren’s wail grows closer.\n“Are you sure about staying?” you ask.\nAlma May nods. In your mind’s eye, you see her curled around the sexbot’s still form. You imagine her eyes closed, cheeks and lashes wet, and the sexbot’s eyes open, fixed sightlessly on the ceiling, its spun-glass lashes painfully dry. You imagine its stripped limbs, straight and still, gleaming metal and fingerprinted flesh taking the place of the perfection Alma May must have seen in the shipping crate all those years ago.\n“Was it worth it?” you say.\nThe words are out of your mouth before you can stop them. For the first time since you tumbled through her window, Alma May seems out of sorts. She flinches, very slightly, then steadies the line of her mouth and meets your eyes. Her gaze is an arctic sunrise, the sky just after it rain. It is the light at the heart of a star.\n“Yes,” she says. “I wouldn’t change a thing.”\nMaybe there was no Revolution. Maybe there are no great moments in history, or in life, just little ones that build and lead to vast catastrophes like a city burning, or a person falling in love.\nYou nod. “Thank you for the tea.”\nYou take a step toward the door, but Alma May points to the window, a brief smile touching her lips.\n“Out the way you came.”\nYou nod. Red and white lights splash upward as fire engines pull into view. Half of your body is out on the fire escape, and one foot still in Alma May’s parlor, when she speaks behind you.\n“Everything will work out for you, one way or the other. When it does, maybe you can come back and tell me about it sometime.”\nA.C. Wise's fiction has appeared in publications such as Uncanny, Clarkesworld, Tor.com, and several Year's Best anthologies. Her work has won the Sunburst Award for Excellence in Canadian Literature of the Fantastic, as well as twice being a finalist for the Sunburst Award, twice being a finalist for the Nebula Award, and being a finalist for the Lambda Literary Award. She has two collections published with Lethe Press, and a novella published by Broken Eye Books. Her debut novel, Wendy, Darling will be published by Titan Books in June 2021, and a new short story collection, The Ghost Sequences, will be published by Undertow Books in August 2021. In addition to her fiction, she contributes review columns to Apex Magazine and The Book Smugglers."}