{"fingerprint": "jObfJBk3cTPS0rcn49csoHiFxBY=", "sitename": "Clarkesworld Magazine", "title": "And If the Body Were Not the Soul by A.C. Wise", "author": "A C Wise", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wise_10_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: And If the Body Were Not the Soul by A.C. Wise", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8640 words, novelette\nAnd If the Body Were Not the Soul\nRo shoulders the courier bag, leaving the bike chained at the entrance to the Zone. Even here, at the edge, dampness permeates—the air green like a receding tide. The pavement is patchwork. Brick and stone shows through tears in the asphalt, wounds no one bothered to heal once the aliens moved in, once it was clear humans would never move back into the neighborhood and it became the Zone.\nWeeds grow in the gaps, flourishing in the damp. Ro places each boot carefully, avoiding the puddles reflecting sodium streetlights. On either side of the street, buildings stand with their doors shuttered against the gathering twilight. Some are ragged against the emerging stars, top layers blown away, evidence of the violence that emptied the neighborhood, made it unfit for human habitation, and eventually turned it into the Zone. But close to the ground, the world is still whole. If Ro doesn’t look up, it’s as though nothing has changed.\nExcept the Zone is haunted by waiting. The sense of impermanence is palpable—like the refugee camps and shanty towns of the early century, the ones the government planned to empty after the last great flood, or hurricane, but never did. The Zone was meant to be a way station, a temporary solution until the Immies (the word tastes dirty even in Ro’s mind, hateful, ugly, but there isn’t a better one because the aliens have never given the humans their true name) could be fully integrated into life on Earth. And yet . . .\nRo shrugs against the weight of emptiness and broken promises. At least Xal’s light is still on, welcoming. A bell over the door jangles; stepping inside, Ro can’t help smiling at this incongruously human touch. It’s like the shelves behind the glass counters, crammed floor to ceiling with human knick-knacks and oddities no Immie could possibly want, and no human would come here to buy. Charming, but sad in a way, too. Lonely.\nIt takes Ro a moment to pick out Xal’s form against the crowded shelves. Today, Xal’s flesh is the color of sand. It reminds Ro of the fish that disguise themselves from predators by lying flat against the ocean floor. There are variations, tiny glints of light. It is brown only in the way pigeons are simply gray, full of tones unseen until it is pointed out they were there all along.\n“Hi.” Ro sets the courier bag on the counter—this time full of gamboling ceramic kittens—and places the delivery slip on top.\nXal doesn’t respond, which isn’t unusual for an Immie, only for Xal. Ro hesitates. Payment is stacked neatly on the counter, as always. Perhaps Xal simply doesn’t want to talk. Ro turns, hiding disappointment.\n::Tone—Plea/Imperative: Ro. Wait.::\nXal’s voice is changeless, only the tone-statement betraying the edge of panic. There are no human or even human-like features to convey pain. But now that Ro looks closer, it is written in the restless knotting of limbs hanging beneath the bulk of Xal’s body.\nRo steps forward. Xal shifts, flickering in and out. Barely visible one moment, then sharply outlined the next. Sinuous lines gleam damp, twisting through a host of colors Ro can’t begin to name. Ro’s breath catches. There, an extra wetness, almost hidden by the tangled lines, a gash leaking fluid, smelling of salt.\n“What happened?”\n::Tone—Statement/Fear: An accident.:: Ro hears hesitation in Xal’s tone; in a human, it might sound like a lie. ::Tone—Statement/Honesty: An attack. In the human district, not far over the line. Just looking.::\nColors roll; Xal fades in and out again.\n“You were attacked?”\n::Tone—Affirmative/Sorrow: Yes.::\n“What can I do to help? Is there someone I can call?”\n::Tone—Alarm/Negative: No.::\n“Okay.” Ro holds up his hands, palms out, hoping Xal will understand the human gesture and feeling helpless.\nXal’s body clenches, shuddering, furling tight around the wound. A sound like keening, like an in-drawn breath, like music, traces Ro’s jaw and spine. Then the sound stops and Xal unfolds, becoming more solid.\nThe wound already looks less, but still, a tremor ripples out from Ro’s center. Disgust. Ro clenches teeth against the reaction, a reflexive hatred for the uselessness of all flesh. It isn’t fair; Xal is wounded, Xal needs help, and this isn’t the time. And yet the bone-achingly physical reaction remains, rooted in the very thing causing the revulsion. Flesh. Ro shudders, stepping closer to the counter as if to step away from skin, from muscle, leaving disgust behind.\n::Tone—Statement/Sincere: The pain is less. Ro. Thank you for staying.::\nA limb uncurls, a jerky, reflexive motion as though Xal is not entirely in control yet. It brushes Ro’s hand, braced against the countertop. A new sound, a new quality of pain, laced with surprise. Xal draws back, but not before the touch sparks—a snap like an electric shock and a taste like lemons.\nA scream locks in Ro’s throat. A sensation of dislocation without motion. A space of falling or flying, existing between the moment of contact and Xal’s touch withdrawn. Ro blinks away patches of violet light until the shop comes back into focus, bracing for a horror that never comes.\nThe lightness of Xal’s touch, unlike anything human. Ro lets out a breath, coming back to center.\nXal’s limbs are knotted in a new pattern now, anxious.\n::Tone—Statement/Fear: Ro. Apology. Pain was not intended.::\n“No. I . . . ” Ro’s breath—ragged—calms, but not fast enough. “It didn’t hurt. I don’t . . . ”\nFlying. Falling. Ro struggles to process the sensation of Xal’s limb, solid yet ephemeral. The memory of the touch remains, like a lost tooth wanting to be probed. It is a moment of slipping out from under the weight of skin and bones, of being somewhere else, yet wholly here.\nRo tries to draw back from the sensation, but there is nothing to withdraw from.\n::Tone—Query/Fear: Not hurt.:: Xal’s voice again. Ro’s mind thrums to an absence, reaching again for revulsion where there is none.\n“No. I should just . . . I’m sorry.”\nRo turns, bell jangling. The green scent of the streets is an assault, the slickness underfoot designed to trip un-careful steps. Even the shorter buildings lean in, edges all jagged. They outline an empty space, something that cannot be defined.\nOn the edge of hyperventilation, Ro bursts out of the Zone. Leaving the bike behind, leaving everything. Not questioning the source of the fear, just running. Then stopping, leaning against a building, a stitch lacing between two ribs.\n“Ro?”\nRo looks up, blinking, human buildings and a single figure resolving. Audra slows her bike, dropping one foot to the pavement. The courier satchel at Audra’s hip is empty; Ro remembers the bag left with the delivery in Xal’s shop, the bike chained to a post at the entrance of the Zone.\n“Are you okay? You look like you’re about to faint.”\n“I . . . ” Ro falters, tries again. “Something happened.”\n“What?”\nThere are no words. Only lemons and the snap of electricity. Ro rubs the spot Xal touched, chasing ghosts.\n“Come on.” Audra swings her leg over the courier bike, twin to the one Ro left behind. A tilt of her chin indicates the café across the street, glowing warm in the twilight. “We’re getting some tea into you. My treat.”\nAudra keeps a space and silence between them. Ro is grateful. But Audra’s gaze still slides in Ro’s direction, questioning. Inside the café, Audra pushes a cup of tea across the table.\n“What happened?”\n“I was making a delivery to Xal.” Ro hesitates, seeing an expression of distaste Audra is not quick enough to hide. “Xal was attacked, outside the Zone.”\nThe muscles between Ro’s shoulder blades tense, waiting for Audra to ask what an Immie was doing outside the Zone. But the question doesn’t come, and Ro swallows guilt at putting venom in Audra’s mouth before continuing.\n“Xal was hurt and . . . accidentally touched me.”\nAudra’s eyes widen. Small fingers of panic tap at Ro’s ribs from the inside. Xal’s tone-statements make things so much simpler. With Audra, Ro is lost. Is she jealous? Angry?\nAt last year’s office holiday party, Audra drunkenly tried to kiss Ro. They had only known each other a short time, and so it was Ro who mumbled apologies and made the effort to explain.\nIt’s not you, it’s me. I’m not . . . I don’t really date. I don’t like . . . And there, the explanation faltered. Because what could Ro say that Audra would understand? Audra was wholly comfortable in her skin, more so than anyone Ro had ever met. She dated men and women in equal numbers; affection—casual and intimate—came to her as naturally as breath. She drank the world in through her fingertips and remained thirsty for more.\nSo how could Ro explain a hatred of touch, of flesh? The discomfort of even having a body, let alone one identifying with a single, narrow gender and responding to others sexually?\nHow could Ro explain it then? How can Ro explain it now? How that night, Ro hadn’t fled, but had remained horrified. How this night, Ro had fled, but wasn’t disgusted.\nAudra shakes her head. Amazement? Ro still can’t tell. Xal’s touch was accidental; would emphasizing that help? Audra has been kind, understanding; Ro doesn’t want to see Audra hurt, but the gulf between them is so vast.\nAudra wraps her hands around her mug. Steam rises between them. She does not look at Ro.\n“So what happened?”\n“It tasted like lemons. And it was like being somewhere else.”\n“Xal tasted like lemons?”\n“No. I mean. I don’t know. Haven’t you ever smelled something and had the taste hit you at the same time? I’m explaining it badly.”\n“No.” Audra draws the word out. She looks at her hands, her expression guarded, like she wants to say more, but silence stretches between them.\nRo feels a pang of guilt, threaded with a flutter of panic, imagining Audra wants to put her hand over Ro’s. A comforting gesture; it’s what Audra would do if she was sitting with anyone else. Ro has seen it, the way Audra leans into their other co-workers—a nudge from her hip to emphasize a joke, a sympathetic hand on an arm, a head, comfortably resting on a shoulder. Even when it isn’t sexual, Audra is so casual with her body; Ro can’t begin to understand it.\n“I have to go back for my messenger bag,” Ro says, abrupt, standing.\n“But . . . ” Hurt flickers in Audra’s eyes, this time unmistakable.\n“I’m sorry,” Ro says.\nIt feels like fleeing again. The phantom of Xal’s touch lingers, but it doesn’t have half the weight of Audra’s gaze. Still, Ro rubs the spot again, pushing out the door. A light drizzle mists the air. Hairs rise on Ro’s arm, catching the moisture. Ro rubs harder, half expecting to see translucence and hollow bones like glass—flesh both there and not there in the aftermath of Xal’s touch.\nInstead of going back to the Zone, Ro goes home, climbing three flights to a small apartment, boots heavy on each step. Guilt prickles, and with it, something else. Curiosity.\nRo crosses to the window, touching the glass. It’s cool, and condensation forms a halo in the shape of a hand. Drawing away, there is a space left—defined by the imprint of four fingers, a palm, a thumb. And in the place of flesh, droplets of water cling to the window, heavy with the light and shimmering like stars.\nNerves flutter in Ro’s stomach. The memory of rain glistens on the bike, still chained at the Zone’s entrance. Ro brushes fingertips over the metal frame in passing. Never has the walk to Xal’s shop seemed longer. Never has the jigsaw of uneven pavement, brick, and stone seemed such an impediment.\nRo tries to think of anything written or said about physical contact between humans and Immies, but comes up empty. If it’s done, it’s a private thing. Does everyone taste lemons, feel the snap of electricity? The Immie community is so small. Maybe Ro is the first, the only one.\nBut who is there to ask? The other couriers don’t travel into the Zone. Scarcely any humans do. Ro has never seen another human walking the shattered streets. Which makes the kitschy human ornaments crowding the walls in Xal’s shop even sadder.\nRo pauses, wondering if Xal has ever made a sale, if the shipments Ro regularly delivers ever leave the shop again, or only sit there gathering dust.\nWhy, Ro wonders. Aliens came to their world. Shouldn’t people be excited, curious? But they don’t seem to be. It’s not fear exactly, but more a way of not seeing, Ro supposes. Turning a blind eye to what is inconvenient, uncomfortable. Like the government pretending the Zone is only temporary. Like the refugee camps that never empty. Like racial tension, poverty, homophobia. If the problem is ignored long enough, perhaps it will simply go away.\nRo pauses before pushing open Xal’s door; the bell jangles. The courier bag, now empty, waits on the counter. And Xal waits behind it, limbs no longer bunched in pain, but held inward careful, betraying tension. Ro’s throat is dry; it takes a moment to get the words out.\n“How are you feeling?”\nThere’s no sign of the wound. Ro can’t tell whether it’s healed completely, or whether Xal is simply hiding it. Limbs fold and unfold, a rippling effect unsettling the first time Ro saw it. Now it’s almost comforting.\nToday, Xal is gray-green, but with shades of violet. Ro thinks of sea anemones, rocks grown over with lichen, algae stirred by gentle waves.\n::Tone—Relief/Query: Unhurt, now. Are you well.::\nRo nods.\n“I’m sorry for running out yesterday. It’s just . . . ” Trying to explain things to Audra was awkward enough. They share common language, context.\n“I forgot my bag.” Ro points; it is a cowardly change of subject, but safer ground.\nRo touches the bag, but makes no move toward the door. Xal seems watchful, even without visible eyes. But what else? Hurt? Confused? Ro is suddenly aware of standing stiff, one arm crossed to hold the opposite elbow, lips parted as if to speak. Flesh again—bodies speaking a language Ro can’t understand. It’s all so useless. So . . .\n“I want you to touch me again.” The words come in a rush too quick for regret. Heat suffuses cheeks, another betrayal, and Ro almost flees.\nBut the shop bell stays silent. Ro’s boots remain planted on the floor.\n“I mean if . . . it didn’t hurt you? If . . . if it’s okay.”\nPulse beats under jawline, at wrists and elbows. Xal furls and unfurls, the there and not there-ness coming across as deliberation, physically rolling and weighing the request.\n::Tone—Hesitation/Query: It does not hurt. Why do you want this.::\n“I don’t know.”\nIt’s the most honest answer Ro can give. A paradox blooms, a strange, fractal bruise centered at the site of Xal’s last touch. It spreads outward, re-writing Ro’s hardwired code. Ro wants this. No, Ro needs this.\n“What was it like for you?” Ro’s eyes slide closed; it’s easier to speak this way, even if it means having to ignore the extra weight of tears just starting to frost lashes. “I don’t want to impose, is what I mean. I don’t normally like . . . But this was different. I tasted lemons.”\nThe ache is physical—a desire to step off the edge, precisely because it is unsafe, unknown. There are blank spaces defined by broken buildings, by the ghost of a handprint. They are defined by lack—not by something missing precisely, simply by something not there. They are possibility, made manifest.\nIn that brief moment, Ro had the sense of Xal’s touch being like the ideal of falling into the night sky, being weightless and rushing so fast between stars their light draws blood. That paradox bruising Ro’s skin—the contradiction of making the unknown known and erasing the infinite possibility—is too attractive.\n“I can’t explain.” Ro’s throat aches around the inadequacy of words.\nA heartbeat. A space of silence. Eyes open. Ro consciously remembers to breathe. Xal is watchful, even without eyes. There is the same sense of consideration in the roiling movements, colors flickering, limbs furling and unfurling.\n::Tone—Statement/Uncertainty: It is curious. No other humans come here. To touch would be to know more.::\nRo lets out a rush of breath.\n“You’re sure?”\n::Tone—Anticipation/Fear: The store is closed.::\nAt first, Ro doesn’t understand. Then Xal touches a switch and the lights dim, leaving only the faint glow of emergency lighting. Understanding crashes in: This is agreement, consent. Xal is giving them privacy.\n::Tone—Anticipation/Fear: Ro. Put your arm on the counter.::\nRo hesitates only a moment, breathes out, then rests both arms, wrist up, on the glass. In the dimness, Xal is both easier and harder to see. Red light from the emergency exit sign traces contours and makes flesh the color of water over gray-green stone glow.\nRo tries not to flinch, pressing arms against the countertop to keep from shaking. Xal’s . . . arm? Leg? Is there a human word for it? Extends slowly, waits the space of a heartbeat, then surrounds Ro’s flesh, passing through and into it.\nThe shop tilts. A scent like violets and seaweed, like gunpowder, fills the air. There is no weight to Xal’s touch, yet pressure builds in Ro’s bones. A sense of fullness pushing outward, but without pain.\nXal flickers, slow, slow, fast, slow, unfolding, folding, turning. There and not there. Ro feels it too, absent and present, within the shop and elsewhere. An elsewhere that cannot be described.\nPart of Ro reaches for something to anchor to in the here and now—long division, the names of past presidents, a list of capital cities. The larger part spins outward, spiraling from a weightless center, out through rings of stars, arms flung wide against the dark. Fragments of unknown worlds tumble past. Everything is vast and Ro is small and for a moment the sense of it is crushing.\n“No.” Ro jerks back, the word slipping out.\n::Tone—Query/Concern: Ro. Are you hurt.::\nXal’s shop snaps back into focus. Ro crashes back into a body too small to hold the sense of stars, and their loss is just as terrible as their presence.\n“I’m . . . ” A ragged breath. Ro places a hand over the skin Xal touched; it is solid, real. Colors ripple across Xal, the salt-scent in the room intensifying.\n::Tone—Shame/Sincerity: Apologies. I did not mean to cause pain.::\n“No. You didn’t. I’m sorry. I shouldn’t have . . . ”\nUnder the salt-scent, the smell of violets and gunpowder. Ro’s flesh prickles, as though swept by a cool breeze; the hairs rise. A sense of pressure, reaching, but never quite arriving, haunts the space between Ro’s bones. It isn’t desire—that’s too simple a word, too human. But there is wanting, need unfulfilled.\n“I want to try again. Please.”\n::Tone—Statement/Confusion: You were hurt.::\n“No. It didn’t hurt. I was just scared. But I want to try again.” Ro’s pulse thumps, arms trembling as they are pressed against the counter once more. “Please?”\nColor and movement speaks doubt as it rolls across Xal’s flesh—storm clouds, and the scent of oncoming rain. Dust—Ro can almost taste it. The same doubt fills Ro, but it can’t end here. Ro reaches after something to keep the moment from slipping away, and lands on Xal’s curiosity.\n“What did you feel?”\n::Tone—Statement/Uncertainty: Sunlight. A plank of wood. Many planks of wood. Water. Sunlight on water. The sensation of limbs in water. Smoke and charcoal.::\nHesitation between Xal’s words, searching for concepts to capture such simple, human things. The memory comes rushing back to Ro, sitting on a dock at the lake, toes trailing in the water, a grown up grilling hot dogs in the background and the air filling with shrieks as other children dove and splashed in the water. A slice of childhood, pulled through Ro’s skin and transferred into Xal’s mind through touch.\n“You saw my memories?”\nMore hesitation, then, ::Tone—Agreement/Affirmative: Yes.::\nThe information makes Ro’s head swim. Could it work both ways? An alien childhood, if there is even such a thing, slipping into Ro’s skin. There’s so much Ro doesn’t know about Xal, about the Immies in general. The need to know is overwhelming.\nRo looks to where Xal’s eyes would be on a human, trying to communicate need. The absence of Xal’s touch is a pressure as great as the touch itself. It’s only a matter of quality, of flavor—not better, or worse, just different.\nXal reaches out again. A sigh, a musical tone so unlike the sound of pain from the night before traces the length of Ro’s spine, the curve of Ro’s jaw. Touch.\nA needle, a thread draws through Ro’s skin, stitching it with the light of the universe. The taste of bitter greens, the feel of velvet, the scent of wood smoke. Ro’s mind substituting human concepts for unimaginable things. Nebulae bloom against Ro’s closed eyes.\n“Oh.” The word escapes in a breath. Language and thought failing. Space simultaneously narrows to the point of contact between them, and expands beyond calculation.\n“Oh.” There are no other words. “Oh.”\nAgain and again as the world spins away from them and Ro flies and falls.\n“Hey.”\nRo turns toward Audra’s voice, still holding the coffee pot. The scent of it, just on the edge of burnt, fills the small courier office above the shed where their bikes are racked.\n“Careful. You’re going to spill.” Audra points, and Ro starts, realizing the coffee is perilously close to the edge of the mug.\nEven before the first sip, Ro is shaky, nerves taut and singing.\n“Sorry.” Ro replaces the coffee pot, sips scalding heat.\n“Are you okay?” Audra frowns. “You look exhausted.”\nRo doesn’t remember returning to the apartment last night, only waking in a tangle of sheets this morning, eyelids sticky, limbs heavy. The world keeps wanting to slide away; the edges of Ro’s vision glimmer with light, like a migraine coming on, only without pain.\n“Any new jobs come in since yesterday?” Ro asks instead of answering Audra’s question.\nEven seen peripherally, Audra’s concern is clear. There are no mirrors in Ro’s apartment, but Ro imagines the shadow-bruises of sleeplessness, improperly combed hair.\n“A few.” Audra hands over the clipboard before pouring her own mug of coffee. Her knuckles are white, gripping the handle. It is a gesture of restraint; Ro has seen it before. If Audra doesn’t anchor herself to her mug, she will reach out a comforting hand to touch Ro’s arm.\nEvasion tastes as sour as a lie. Audra only wants to help, but what can Ro say? Audra might understand, but she might as easily be hurt. She might think Ro is sick, wrong for wanting this inexplicable thing, and that would be unbearable. It’s not that kind of desire, but it’s too hard to explain. There are no words for what it is, at least none that Ro knows.\n“Mind if I take the Thayer Street drop?” Ro’s voice cracks.\nThe sound is covered with more sips of coffee—too quick. The heat doesn’t help the flush coming to Ro’s cheeks. The truth must be written everywhere on Ro’s skin, the evidence of Xal wrapped around and through, highlighting the translucence of bones, hollowed like glass.\nRo is clattering down the stairs to the bike shed almost before realizing it.\n“Ro!” Audra follows, and Ro isn’t quick enough—fingers shaking and clumsy—to strap the package to the back of the bike and leave before Audra blocks the door.\n“What happened?”\nRo doesn’t answer. Can’t. Tears sting, hot and bright, but don’t fall.\n“Ro.” Audra’s voice is soft. She weaves between the bikes, comes within a few inches of Ro, and reaches out. But at the sharp intake of breath, she stops, her fingers falling short of brushing Ro’s wrist.\n“Sorry. I forgot.” Audra looks down, then back again. The hope in her eyes is crushing.\nRo shifts, putting the bike between them, and feels guilty doing so.\n“I went back to see Xal.” Ro swallows, gripping the bike.\nAudra’s eyes widen, drawing light from the gaps where the door of the shed doesn’t quite fit. All the darkness in them reminds Ro of falling through the stars. There is a sound that isn’t quite a sob, and it takes Ro a moment to realize its source.\n“Are you hurt?”\nRo gives a shake of the head, slight, but easier than words.\n“What happened?”\nRo’s lips press tight, fighting the sense of being overwhelmed without understanding its source. The loneliness of being trapped in a single body with its weight of flesh—Ro has always known it, but until feeling the alternative offered by Xal, it was bearable. Now the world is open, a wound no amount of thread can stitch closed.\nAudra’s fingers circle Ro’s wrist, insistent this time. Ro’s mouth flies open, but Audra’s grip tightens.\n“Please. I want to understand.”\nThe need to touch is written clearly in Audra’s eyes, as clear as Ro’s desire to pull away. Ro lets out a shuddering breath, doesn’t move. Pulse beats between them, in Audra’s fingertips, in Ro’s wrist. Maybe this is a language Audra can read; maybe Ro doesn’t need to say anything at all.\nAudra exhales, letting go, and Ro’s pulse falls back into a regular rhythm. How can Xal’s touch soothe, being so alien, while Audra’s induces only panic? Most of the world would consider it wrong, broken. But Ro knows it isn’t. There is no weight to Xal’s touch, no expectation.\n“I’m sorry,” Ro says, and at the same time, Audra says, “I’m sorry.”\nBreath and silence fills the shed. They look at each other across the bike between them. The light coming through the gap around the door shifts, leaving Audra’s face in shadow, stealing the illusion of stars from her eyes, but catching sylph-like in her dark curls.\nRo’s chest tightens. There are no words that won’t make things worse. It’s not you, it’s me, will only give Audra the impression Ro thinks the opposite.\nIf human touch could communicate the way Xal’s does, Ro would understand. And maybe, for Audra, it does. Maybe Audra experiences the world through the tips of her fingers, gives away pieces of herself with each touch, but gains just as much in return, never diminishing.\nBut Ro cannot say this, cannot ask without fear of giving Audra hope. It’s not that Audra has ever pressured Ro, or implied that maybe if Ro just tried it, met the right person, then things would be different. It’s that sometimes, Ro catches Audra looking and thinks there is a glimmer, faint, but wistful—wishing things were different between them—and it makes Ro’s heart ache.\n“Tell me,” Audra says, taking a step back, putting more space between them. She crosses her arms, holding herself in, holding back.\nAudra isn’t pulling back, running away, and relief surges through Ro. Whatever else they may be, at the core, they are still friends. The realization that Audra won’t leave, won’t shun, no matter what, brings a surge of emotion. It’s almost like love, vast and complicated, but even the thought of the word comes thick with ghosts—meanings and expectations layered upon it by all the lips that have spoken it before. Ro pushes it away and, halting, tries to explain. Audra listens, never interrupting.\n“Do you think there’s something wrong with me?” Ro asks, needing to hear the words aloud, needing to taste them in order to let them go.\n“No.” Audra’s tone is firm, but she looks lost as well. Scared. “I just don’t want you to get hurt, okay? Promise me you’ll be careful?”\nAudra hugs herself tighter. Ro nods, pressing lips together, tasting salt even without tears. The promise means nothing; they both understand. This is unknown territory, and there is no way to travel it without gathering bone-deep scars.\nSirens shatter Ro’s sleep. Pulse jack-rabbiting, pushing away sweat-tangled sheets and the remnants of a dream, Ro stumbles to the window. The sound is tied to the dream—one of being very far away, but very close, stretched thin, no blood or bone, no muscle, only skin and nerves pulled taut like a sheet over the world.\nOn the street below, red and blue lights spin in time with Ro’s pulse. A sudden spike of pain. Ro clasps the wound, but there’s nothing there.\nXal.\nPain arcs again, bringing flashes of violence, memories not Ro’s own.\nXal.\nJacket and pants pulled over rumpled pajamas. Feet shoved into unlaced boots. Clattering down three flights of stairs. Ro’s courier bike leans outside the apartment’s outer door. Grabbing it, Ro is gone. Falling. Flying. Pedaling madly into the night, toward the flashing lights.\nThe whole city is wet, smearing in Ro’s peripheral vision. Two cop cars park askew across the main entrance to the Zone. Ro stops the bike, lets it fall. A knot of people huddle, pointing. The cops struggle with a man whose hands are secured with a plastic zip tie. He thrashes, resisting as they push him toward the nearest car.\n“Fucking Immie got what it deserved, slurping and lurking around our streets. They need to fucking stay where they’re told or go the fuck home.”\nLight skips off shards of broken glass, blood red and deep blue. The man throws his head back; the cop’s nose makes a sickening crunch as bone connects with bone. Swearing, the cop lets go, but her partner is quick, sweeping the man’s legs and dropping him. The second cop gets a knee in the man’s back, holding him down against the tongue of uneven pavement extending from the mouth of the Zone. The man continues swearing, lips spit-flecked.\n“Fucking Immie. I hope it’s dead.”\nRo breaks into a run, ignoring a muffled shout from the cop with the broken nose. The door to Xal’s shop hangs open. Ro nearly slips in slickness trailing across the floor. Xal never made it to the safety behind the counter, and instead lies knotted in front of it, limbs drawn together in the universal language of pain.\nThere is no hesitation. Ro kneels, folding around and over Xal. Shockwaves of pain radiate outward, but Ro doesn’t let go. Stars spin, razor bright. The smell of matches, freshly-struck; a taste like a battery held on the tongue; the persistent thrum of rain.\n“It’s okay. It’s okay.”\nRo repeats the words, trying to stay conscious, trying to soothe. Xal’s pain is overwhelming, an assault of sensation. Lighthouse flash. The taste of apples. Green-wet stone. Stairs spiraling down.\nDesperate, Ro tries to pour sensation back into Xal—more childhood memories—introduce a new thread into the loop of feedback flowing between them. But the images keep coming, pounding Ro like fists, like stones. It’s impossible to concentrate. The rasp of wool, black crayons melting in the sun, the taste of cherries. The touch-taste-smell correlation stutters. Xal’s control slips, no longer translating sensations into human terms.\nRo screams. A note, sheer sound, shearing bone from bone, sloughing flesh. Ro’s mind reels, trying to process what there are no words for.\nA body—Ro’s, Xal’s, both, shudders. Collapses inward. Spins outward. The rush of wind, hot and dry and wet all at once. The crushing cold between stars. Stretching impossibly thin-fast-long across a cord of silver and all of it is everything all at once. Then, nothing.\nScraps torn from a quilt, broken fragments of a mirror, numb fingers trying to piece them back together and failing. Surfacing. Ro approaches a reflection etched on the underside of waves, surrounded by a distorted view of sky and trees and sunlight on the other side. Lips almost touch lips—reality kissing reflection—then Ro sinks again. A stream of bubbles, like pearls, like laughter, trail behind.\nHands. A voice. Audra’s?\nWheels hum fast through sterile corridors; too-bright lights overhead. Sharp-jabbed needles. Medicine smell. The steady pulse of machines. Then nothing again.\nRo comes back from very far away. The simple task of cracking open an eyelid is monumental. Dry lips part.\n“Water?”\nA straw touches swollen and bruised lips. Ro sucks greedily until the straw is withdrawn.\n“Not too much too fast. The doctors said.”\nRo turns, head even heavier than eyelids. Audra perches in a chair next to the bed, holding the water glass awkwardly in her lap. She looks as though she’s about to cry, or has just stopped.\n“I should call the nurse.”\n“Wait.” Ro tries to remember—in the haze of moments between then and now, was Audra’s name spoken in answer to the nurses asking if there was someone they should call?\n“What happened?” Ro tastes blood from cracked lips.\nAudra holds the water out again, automatic.\n“The police found you and Xal curled together on the floor. It looked like you’d been beaten to a bloody pulp. They thought you were dead.”\n“I don’t remember.”\n“Were you attacked?”\n“No. Xal was hurt. I . . . ”\nThere is no word for it, but Ro feels one trying to take shape on a tongue not meant for such sounds.\n“You have to stop this. Promise me you’ll stay away from Xal.”\n“I can’t.” It isn’t what Ro means to say, not meaning to say anything at all.\nFor a moment, Ro is afraid Audra will storm out, but she only crosses her arms tight around her body.\n“Ro, what are you doing?”\n“I don’t know.” Ro’s voice cracks. “I really don’t.”\nRo lies back on the pillow, closing eyes before they snap open again.\n“Is Xal okay?” It hurts, but Ro turns toward Audra.\n“Xal is fine, as far as I know.” Audra stiffens, her tone brittle and sharp.\nHurt shines in her eyes. Her mouth opens, but she closes it again, standing.\n“I’ll go get a nurse.”\nAudra’s shoes click and silence falls in their wake. Weary and bruised in ways that have nothing to do with skin, Ro curls into a ball, trying to recreate a knot of limbs so woven over and under and through each other they become one.\nRo toys with the hospital bracelet. It’s been three days, and Ro’s wounds have vanished as though they never existed. Still, Audra insisted on riding in the cab back to the apartment, and now perches on the arm of Ro’s battered couch, watchful.\n“What exactly did Lena say?” Ro paces to the window.\n“She just suggested you might want to take some time off, for your health.”\n“And she couldn’t be bothered to tell me in person?”\nRo glances back as Audra shrugs, looking uncomfortable.\n“I’m sure she’s just worried. We all are.”\nThe slope of Audra’s shoulders and the way she studies her feet keeps Ro silent. Don’t shoot the messenger.\n“I’m not fired?”\nAudra shrugs again. Of course word has spread. Ro declined the opportunity to talk to reporters doing follow-up stories on the attack, but it doesn’t matter. The stories are still out there, painting Ro as a misguided loner, the victim of an alien attack, a pervert. Maybe Lena is right to be wary, the other couriers right to withdraw. All except Audra.\n“Come with me,” Ro says.\nAudra looks up, alarmed. “What?”\n“Come with me to see Xal.”\nIf others understood what Ro experienced, maybe they wouldn’t be afraid. Maybe things can change. And where better to start with than Audra, living through touch—hand brushed to arm, palm squeezed to palm? Maybe this is something Ro can give Audra, like a gift. Something to bring them closer together in a way that balances both of their needs. And Xal, lonely, hungry for human experience. Ro’s pulse speeds with the thought.\n“Please? Trust me?”\nRo knows it isn’t fair. Audra has offered so much, unasked—what right does Ro have to ask this in return? Because there’s no way to explain to Audra without showing her what it is Ro is trying to do.\n“Okay.” Audra stands.\n“Now?”\n“Sure.” Audra’s smile holds an edge of sadness. “Why wait?”\nThe streets are silent, dusk just starting to fall. They walk with hands in pockets, watching their feet, watching the streetlights increasingly reflected as they draw closer to the Zone. Ro hears the hitch in Audra’s breath as they cross the line.\n“It’s okay.” Ro glances back, trying for a smile. “It’s an imaginary border.”\nAudra nods, looking sheepish. Ro tries not to hold too tight to the fragile ball of hope, lest it shatter.\nThe shop bell jangles; behind the counter, Xal unfolds—a gesture Ro interprets as turning to face them.\n::Tone—Alarm/Joy: Ro. You are not hurt.::\n“Not anymore.”\nXal knots and unknots, an anxious gesture.\n“This is Audra, my . . . friend. Is it okay that she’s here?”\n::Tone—Formal/Greeting: Audra. Welcome.::\n“Hi.”\n“I brought her here . . . ” Ro falters under the combined weight of Audra and Xal’s attention. “Audra is worried about me. I want her to understand. I thought . . . ” Ro tries not to blush, tries not to panic.\nAudra comes to the rescue, stepping forward while keeping careful space between her body and Ro’s. Her voice carries a hint of nerves, but not outright fear.\n“What happened the night you were attacked?”\n::Tone—Statement/Query: It is not fair to be restricted. Why cross the stars to see only one small corner of a different world.::\nRo’s breath catches.\n::Tone—Statement/Anger: Your government promises change. We will be free to go where we please. Nothing changes.::\nXal grows, unfolding new dimensions. Ro’s heart trips on the truth of the words, cracking. Again, it is a sensation too big to express, to hold. Human words are all too fraught. Ro needs an anatomy like Xal’s, one to unfold and express everything mere flesh cannot contain.\nAudra glances at Ro, eyes shining but cheeks dry. Ro holds her gaze, then nods, heart cracking again. There is understanding in Audra’s eyes, not fear. The way Audra and Xal both watch Ro is like being re-written—blood and bones, skin and heart. Ro is most surprised by Audra. Humans, it seems can unfold to reveal new dimensions, too.\nAudra pushes her sleeves up and rests her arms on the counter.\n“I want to understand.”\nXal flickers, shifting attention to Ro, asking an unspoken question.\nRo’s voice shakes slightly, addressing them both. “It’s okay. It’s safe. No one will get hurt.”\nXal unfurls, encompassing Audra’s arms. Ro releases a breath at the same time Audra sucks one in, sharp, but containing more surprise than pain. It is the sound of plunging into a cold lake on a hot day—pleasure and shock rolled into one.\nAudra blushes, the non-colors of Xal rippling across every bit of exposed flesh. The back of her neck is a sunset in deep sea shades; her arms are the color of starlight on a pond. She is there and not there. The scent of cherries and running water leak into the air.\n“Can I . . . ?” Ro doesn’t finish the sentence.\nPerhaps Ro closes the space, or perhaps Xal and Audra entwined unfold to welcome Ro—a circle, a thread, a knot without beginning or end.\nSparks jump the gap between Ro’s bones, suffusing flesh with light, like an x-ray, only brighter, more beautiful. Ro feels Audra’s body, Xal’s, all three occupying the same space and time. A moment of suffocation, a moment of panic, then everything opens with a smell like just-damp laundry snapping in the breeze. The shop warps, new segments forming like fractals of water freezing into ice.\nA pulse beats, not Ro’s own. A sensation belonging to—it must be Audra, because the memory—sharp and present—is so human. A bicycle, fiercely pedaled with bare feet to the crest of a hill before hands and feet are removed. It’s like flying—the glorious, stomach-dropping feeling of the world falling away, the rush of wind, the warmth of light and being suspended beautifully between earth and sky. Ro feels it, filtered through Audra’s flesh; from within, her body doesn’t feel an impossible weight against her bones. Ro understands, viscerally, how Audra revels in being blood, muscle, bone.\n“Oh.” Ro wants to dig fingertips into Audra’s flesh, into Xal’s, and hold onto this moment forever. But too soon, the connection is broken.\n“Wow.” Audra is the first to step back. “That was . . . intense.”\nHer pupils are dilated, her breath fast. Ro steps back as well, chill with a fresh awareness of the space between them. Something in Ro aches to close the gap, but the familiar horror is there as well: it wouldn’t be the same, couldn’t ever be the same, inside this skin.\n“You’re glowing.” Audra smiles.\nBits of light dance at the edges of Ro’s vision.\n“It’s beautiful.” Audra takes a half step, but stops.\nRo’s throat is closed—thick. Eyes squeeze shut, a deep breath, then Ro looks at Audra again just in time to catch the tail-end of disappointment, the smile fading. The back of Audra’s neck blushes, just blood colors now, the deep sea faded as she turns to Xal.\n“Thank you.” The faint quiver in her voice might be the after-shock of touch, or something else.\n::Tone—Formal/Pleased: You are welcome. Audra. Thank you for sharing memories and experience of your world.::\nThe ache lessens in Ro’s throat, fading to a sensation more like a bruise than a fresh wound.\n“The night you were attacked, the first night, it wasn’t the first time you left the Zone, was it?” Audra’s question surprises Ro.\n::Tone—Statement/Truthful: No.::\n“How many times?”\nRo grips the counter, watching Audra and Xal. How is it they understand each other so well, so quickly? Or is it only that Ro’s own curiosity blocked out certain aspects of Xal. Or perhaps because Audra is more used to processing sensation, she was less overwhelmed. Now that Ro thinks about it, it’s obvious. How could Xal have been happy—how could any Immie be happy—confined to the Zone? All the times Ro traveled to Xal’s shop, never once thinking Xal might want to leave, experience the wider world. Ro’s skin flushes hot, but neither Xal nor Audra is paying attention.\n::Tone—Statement/Truthful: The attack happened the fifth time.::\n“Where were you going?” Audra leans forward; Ro leans, too, gravity pulling them both toward Xal’s center.\nConcentric rings spread across Xal’s flesh, as though from a dropped stone. Now Xal is the color of moss, of sunlight, filtered through pine trees.\n::Tone—Statement/Confidential: Some are patient, but not all. There is a group who would see the Zone change, the border gone.::\n“Who?” Both Xal and Audra turn as though they’d forgotten Ro.\n::Tone—Statement/Anger: It is a small group. One is in your city government, working to change things from within. But it is too slow. Others would wait. Not all are so patient.::\nNot all, Ro thinks. Like Xal, restless, hungry for change.\n“Is that why you’ve been leaving the Zone alone? Trying to start fights?” Again, Ro is surprised at Audra’s words, her insight. How willfully blind has Ro been? How much time has been wasted that could have been spent helping?\n::Tone—Statement/Defensive: Violence is noticed. It is the quickest way to change.::\n“We want to help,” Ro speaks before Audra can, but glances to the side to see Audra’s lips pressed into a thin line. Breath held, waiting for Audra to object, but she does not.\nXal rotates without moving, encompassing both Audra and Ro with eye-less attention.\n::Tone—Formal/Request: Will you leave the Zone with me. To meet with my friend in the government.::\n“Is that wise?” Audra glances at Ro.\n“I think we should do it.”\nAudra hesitates, frowning, then shrugs, moving toward the door. Ro hurries to catch up. The air sings between them—Ro, a string pulled taut, thrumming a note of excitement, Audra simply tight, her note as yet un-played.\n“You don’t have to do this.” Ro’s voice is low so Xal, following behind, won’t hear.\nAudra shakes her head, but doesn’t answer. She keeps her hands in her pockets, gaze fixed on the wet stones.\n“Hey!” The shout draws Ro up short, bringing the realization they’ve crossed out of the Zone.\nXal crowds behind them, all three looking toward a knot of men and women emerging from the bar across the street.\n“You can’t be here.” One of the men points at Xal.\nTo Ro’s surprise, Xal slides past them, gathering limbs together the way a human would draw themselves up to stand tall.\n::Tone—Fear/Pride: It does not break any laws.::\nOf course not; the rules are all unwritten, enforced by silent consent, by looking the other way. Ro’s fingers clench—a body caught between fight and flight, heart pounding.\n“Fucking Immie! Get back in the Zone.” Another man joins the first, the rest of the group bunching closer.\n“We should go back,” Audra says.\n“No.” Ro turns deliberately, walking away from the group, further away from the Zone.\nXal and Audra follow, the weight of hostile gazes tracking them. Fear and hope mix in equal parts. Xal is right—if they spark enough conflicts, people can’t continue to look the other way. A bottle explodes, glass spraying at their feet.\n“Keep walking,” Ro murmurs, picking up the pace.\nA second bottle flies, higher this time, bouncing off Ro’s shoulder before hitting the ground.\n“I’m calling the cops.” Audra pulls out her phone.\nPounding footsteps, then one of the men grabs Ro’s shoulder. Instinct brings Ro’s hands up to break the contact with a shove. The man reels on slick, neon-stained pavement and loses his balance, landing hard. One of the women in the group laughs, nervous, unsteady.\nAnother projectile glances off Ro’s cheek, stinging. Ro touches the spot and fingers come away wet with blood. Audra whispers into her phone, voice low and urgent. Xal moves again, a solid mass between Ro and Audra and the group of men and women. The man Ro accidentally knocked down gets to his feet, his face red.\nFor a moment, no one moves. The red-faced man’s fingers curl, his jaw clenched. Ro sees the moment of decision, but isn’t fast enough to shout a warning.\nIt doesn’t matter. Xal is there, then not. The man’s blow never lands and he stumbles, but keeps his feet this time. One of the women casts about for something to use as a weapon.\n“We have to get out of here,” Audra says.\nXal holds a line between the two groups of humans. More people emerge from the bar, some merely curious, others spoiling for a fight.\n“We’re about to have a full-blown mob on our hands.” Audra plucks at Ro’s sleeve, not touching flesh.\nThis time, Ro doesn’t see the moment of decision, or even where the punch comes from. Fist connects with jaw, and Ro hits the ground. Shouts, feet scuffling. Someone yells. Ro looks up in time to see Xal lift one of the men, tossing him away. Xal’s colors and movements speak anger and distress.\nA siren cuts through the night, freezing everyone in place. As the cop cars stop, bodies scatter. Ro stands. Audra and Xal move closer, the three of them alone making no attempt to flee as the cops climb from their cars.\n“It might be a while, are you sure you wouldn’t . . . ” The officer assigned to babysit them glances nervously between Audra and Ro, trying to pretend he doesn’t see Xal at all.\nThey’re in an empty interrogation room, out of the way. They’ve given their statements, declined to press charges, and been assured no charges are being leveled against them, though the cop delivering the news didn’t look happy about it. He’d looked even less happy when Ro requested sanctuary, using the police station as a safe space to meet with Xal’s friend. Ro credits Audra with charming him into reluctantly agreeing.\n“No. We’re fine right here.” Audra smiles sweetly, seeming to enjoy the way Xal’s presence makes the cops uncomfortable, now that the immediate danger has passed.\nThe officer withdraws, and Audra pours two cups of coffee from the carafe he leaves behind. In the corner, Xal ripples in silence. Ro’s cheek is sore, but the blood has dried and there will be no lasting damage.\nBut the bruise goes deeper than Ro’s skin. Something has changed, but not changed enough. There has to be more; Ro feels it, the seed of an idea starting to grow. Talking to Xal’s friend is a first step, but they have to push harder if they want real change.\n“I want to go to the Immie homeworld,” Ro says, voicing the growing notion in a remarkably even tone. Xal and Audra register surprise—human and inhuman.\n“There should be ambassadors on both sides working toward change. You’re right, Xal, violence gets attention, but we can do better than that.”\nAs the words stop, Ro’s cheeks burn. Said aloud, it sounds ridiculous.\n::Tone—Statement/Uncertain: It might be arranged. Humans have never been, but it is not impossible.::\nXal unfolds from the corner, moving closer to the table in the center of the room. Audra puts her hand on the table, near but not touching Ro.\n“Ro?”\nRo turns.\n“If Xal can arrange it, if it’s possible, I have to go. I’m sorry.”\nAudra’s hand moves, not withdrawing, fingers curling in on themselves, a knot of confusion and pain.\n“I’m sorry,” Ro says again. And again, words are inadequate. For just a moment, Ro considers bridging the gap, touching the back of Audra’s hand, but it wouldn’t be the same. They shared a moment with Xal, but there’s still too much space between them. Necessary space, space Ro cannot bridge.\n“I thought . . . ” Audra looks down, studying the table’s faux-wood grain. “Maybe because of what happened . . . ”\nThe lines of her body pull inward. It hurts Ro to look at her, but their truths are too different. Audra must know that.\n“I can’t change who I am.” Ro doesn’t look away from Audra, hoping she’ll understand.\nOne of Audra’s shoulders lifts and falls again. It might be agreement, dismissal, or shrugging off an absent touch.\n“If I go, what will you do?” Ro asks.\n“I don’t know.” Audra traces circles on the fake wood; Ro can almost feel it through the tips of Audra’s fingers. “We’ll see what happens with Xal’s friend. Maybe I’ll join the cause. Maybe I won’t. I’ll keep working, and life will go on.”\nAudra looks up, and her expression does something complicated. Her eyes are bright, but the light in them reminds Ro of reflections glinting off broken glass.\n“My life doesn’t begin and end with you, you know.” The edge of a smile touches Audra’s mouth. “I do have other friends. Family.”\nThe smile becomes a grin. “I like you, Ro. We’re friends. I’ll miss you, but you’re not breaking my heart.”\nRo’s pulse trips. Audra sounds sincere, Ro believes her, but at the same time Ro doesn’t have enough experience to differentiate the temporary sting of rejection from something deeper. Maybe if Ro leaves and comes back, things will be better. Maybe they can learn a mode of friendship—better, deeper—one that doesn’t cause either of them pain.\nAudra’s fingers uncurl. She presses her palm flat against the wood.\n“Are you . . . ” Ro hesitates, uncertain how to end the sentence: Are you sure? or Are you okay?\nXal shifts closer, body forming a complicated pattern. The colors chasing across Xal’s skin are sunlight, leaves, and the sensation of flying, not falling. Xal unfurls a limb, brushing the back of Audra’s hand with the briefest of touches. The air smells of tangerines and Audra’s eyes widen, as if Xal whispered something just for her.\nAudra draws her hand away from the table, pressing it to her heart. Ro feels it, the steady thump of blood and life and warmth inside Audra’s skin. On the table, the ghost outline of Audra’s hand remains. Footsteps approach the door, but Ro’s attention remains fixed on the table. The fading shape, the memory of touch, outlines possibility. It is everything.\nA.C. Wise's fiction has appeared in publications such as Uncanny, Clarkesworld, Tor.com, and several Year's Best anthologies. Her work has won the Sunburst Award for Excellence in Canadian Literature of the Fantastic, as well as twice being a finalist for the Sunburst Award, twice being a finalist for the Nebula Award, and being a finalist for the Lambda Literary Award. She has two collections published with Lethe Press, and a novella published by Broken Eye Books. Her debut novel, Wendy, Darling will be published by Titan Books in June 2021, and a new short story collection, The Ghost Sequences, will be published by Undertow Books in August 2021. In addition to her fiction, she contributes review columns to Apex Magazine and The Book Smugglers."}