{"fingerprint": "bmKneEaTXHKUg022qXMN8y3mvuc=", "sitename": "Clarkesworld Magazine", "title": "In the Midst of Life by Nick Wolven", "author": "Nick Wolven", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wolven_02_16/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In the Midst of Life by Nick Wolven", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "15460 words, novelette\n In the Midst of Life\n 1\n Field Report #72276Doug LamLead Site InvestigatorSouth Asian Division\n :::ACCESS RESTRICTION: GRADE 3 AND ABOVE::::::CONTENTS EDITED FOR RELEVANCE AND CLARITY:::\n Division Controller’s Notes: psych flag, legal review recommended, immediate termination recommended\n *****transcript begins*****\n Well, you bastard, you got your wish.\n I know it’s you who reads these reports, Carter, and I know why. Now, listen.\n You’ll find the project file attached. It’s got everything you need. Site specs, environmental impact, legal briefing. Not to mention toxin assays, insurance payouts, the “local impact factor” (quite a euphemism, that). Plenty for your lawyers to chew on.\n It should be enough. Hell, it is enough. But I know it’ll never satisfy you. Look, I get why you’ve been asking for these spoken reports—these “informal debriefings,” as you people like to call them. A cute little ruse to get me talking off the cuff, guard lowered, saying what’s really been happening out here. And you can sit in your executive suite, poring over these braindumps of mine, waiting for me to become so cocky and foolish as to speak the awful truth.\n Well, here it is. What you’ve been waiting for, in that gray and shriveled little heart of yours. Grounds for my immediate termination.\n I’ll make it sweeter, Carter. I’ll paint the scene. Grab a drink, you son of a bitch. You’re going to want to savor this.\n I’m sitting in Belawan, in the spiritless hotel you booked us in, project notes on my laptop screen—acres of notes, Carter, reams of notes, because I’ve been trying for a goddamn week to figure out what just happened here. I’m on the balcony, which isn’t much of a balcony: concrete, like so much of this city, and cracked down the middle in a way that, under normal circumstances, would probably make me fear for my life. It’s a hot night here in northern Sumatra, but who am I kidding, every night is hot. The sun’s gone down somewhere behind me, beyond the black hills and the lost, dead forests, and all that’s left is a pink vision burning in the cloudy haze above the bay. The port, though, the port is always bright: rainbow streets under smoky air.\n Yes, the forces of development have been hard at work, here. The big container ships come in, the tea and palm oil go out, and you know as well as I do what happens next. The currents of global capital flow in and do their work.\n Capital, Carter. I’ve often wondered, what color is capital? In America, we like to say money is green, but that’s a throwback to the days of paper currency. I think money, pure money, must be the color of glass. Crystalline, like the buildings out here, the hotels and office towers popping up along the banks of the Deli River, south into the urban core of Medan. Shiny new palaces, raised in months from the blasted earth. You can almost forget, on a night like this, when the windows are lit and the bistros are buzzing and the voices of tourists ring through the shopping districts—you can almost forget what was done to make room for them.\n I’m getting ahead of myself. What I want you to see, Carter, is me, Doug, your old nemesis from the fifty-seventh floor. Potbellied, gray, not so young as I used to be, with my company-issued laptop, my unbuttoned seersucker shirt. Feet in soiled flip-flops propped on the rusty wreck of what might once have been a Taiwanese space heater. Voice recorder in one hand, whiskey and Coke in the other—the third of the evening, and unlikely to be the last. Looking down at the thin dark trickle of the river cutting through the clutter of vanishing slums.\n Let me spell it out. I’m done. D-O-N-E. With how much, exactly, I don’t yet know.\n You earned this, buddy. You fought for it. Twenty years, you’ve been dogging my career, waiting for this day. And I’m glad, truly. In a way, you deserve it: every single, strange word of what I’m about to tell you.\n 2\n A man can get sick of air travel, in time.\n I mean that literally. Sick. Physically ill. And not this inner-ear stuff HR’s been banging on about.\n It’s the height that does it. The remote perspective. There’s a sickness that comes of looking at life from too high up. The way buildings all look the same, so you can hardly judge the relative heights. Not till the sun angles low, evening comes, and darkness leaks out from below their walls. Long black shadows: the footprints of power.\n As soon as I landed, Karen grabbed me at the gate, rushed me through the terminal, loaded me on into a corporate copter. Up to the delta, for a look at the site. We followed the river to the Belmera bridge, then veered west, over the Australian zones and the marshes. Quite a patchwork, out that way. The big multinationals are putting up fences, painting their rooftops in grid-based patterns. From above, the land is a sea of corporate logos, rendered in pixels a meter square.\n We’d be doing four flyovers, Karen said, coming in from each cardinal point. Then a full fly-around at ninety meters. Something to do with the specs on the cameras. I joined her in the cockpit. Green lumps went by below, patches of wetland. Our target was nothing but a blip on the overlay. Karen flipped to a camera feed.\n I think you know Karen. Tiny woman, good negotiator, very generous with the company payouts. She did the relocation out of Lagos last year. Cleared nine hundred and fifty-three people out of an area half the size of Yankee stadium. These were families, big ones; they refused to be separated. The shanty town was centered on an old oil yard, row upon row of empty storage tanks. Folks were using propane torches to cut and join the units. Quite a complex. More trace toxins than you could log at a dump site. We had the property pegged for executive villas, ended up scraping it clean to a depth of five meters.\n Karen is who they send in when things get, shall we say, delicate. I watched her face as we came to the site. Not that Karen’s the type to reveal her emotions. But you can always tell when someone hasn’t been sleeping, or when she’s been wearing the same clothes for a week.\n “Tough clearance?” I tried to catch her eye. I’ve learned, Carter, that when you do a site investigation, the first thing you investigate is your own people.\n “Well,” Karen took the controls, “we’ll get to that.”\n She punched in a flight program. After the automatic flybys, we dipped in for our sightseeing run. The site specs are all on file, but to sum: it’s old marsh property, reclaimed about thirty years ago. Standard pylon-and-platform job. The Indonesian government laid the first foundations. When they fell apart, a company called Especia came in and tooled around with tent-style storage. After the price crash, the deed got passed around a few small Chinese players, one of whom raised the main construction. They did the usual awful job, left the building half-finished, then sold to a speculator during the boom.\n And that’s all she wrote, until about three months ago, when our folks bought the plot at sky-high prices. It’s a connective acquisition, knits together our coastal holdings. Blocks the Chinese from accessing the bay, plus gives us a nice belt of free trade around the oil barons. Our initial plan was to install high-speed transit, the usual mix of stop-off shops. Depending, of course, on the engineer’s report.\n And on getting the damn site cleared.\n Karen circled in a tight radius. The site didn’t have much in the way of construction. Just one big tower, taller than it ought to be, steel and composite on a bot-built frame. Finished up to the tenth floor, sheathed to the fortieth, nothing but girders and nets above that. There were already cracks where the composite had strained. It’s not meant to be structural, but they’re supposed to tweak the mix for flexibility. This was seriously cut-rate construction.\n “How many are there?” I asked.\n Karen told the copter to go in close, making a tight pass around the building’s northwest corner. I saw boards in the windows, dirty and unpainted, squares of plywood from the nearby tree plantations. People will use anything they can scavenge out here, but it’s weird not to see transparent windows. Usually on a site like this, there are a million signs of life. Clotheslines on the balconies, towels hung out to dry, rain catchers and aerials all over the structure. This place was a box. Sealed tight.\n Karen’s eyes were vague with sleep deprivation.\n “How many?” I said again. “How many people inside?” She stared.\n “Inside?” It took her at least ten seconds to answer. “Maybe five, nine hundred. Projected.”\n “Projected? Not estimated? Nobody’s run a count?”\n She had this way of looking at me, Carter. Hard to explain. Like the questions I was asking, perfectly natural questions, were all thunderingly beside the point.\n “We tried a count,” Karen said. “The first two teams did full evaluations. When I came in, I sent my own survey crew.”\n “But nobody has the numbers? Five to nine hundred, that’s quite a spread.”\n That look again. “Yeah. It is.”\n We were banking around the corner, tilting into the turn. I leaned over to scan the ground. It was mostly barren concrete, bleak as hell, but I glimpsed a ring of debris, strewn around the building’s foundation. Bales of stuff, big jugs, cardboard packages. Those fat bright drums the NGOs pass out. Like a storm had flooded through some relief agency’s warehouse, depositing the contents here.\n “What’s all that—?” I began.\n Karen was smacking the console, glaring through the windscreen, cursing like we used to curse when we were kids.\n “Shit! Piss on me! Knew this would happen.”\n A change of course. We were heading for the edge of the platform. A bunch of mobile units sat grouped in one corner, trucks and company cars, plus those human-chauffeured limos the political folks still drive. They had a little tent set up as a command center, wires running all over the ground. A former soldier stood out front, head-to-toe in body armor, striking the usual badass poses.\n “Well,” I said, “what’s all this?” Meaning it rhetorically, but Karen was too tired for nuance.\n “What do you think?” She ran a scan for landing sites. “It’s the fucking cavalry.”\n Here’s the first big shocker for you, Carter. The first great big reveal.\n I know we like to say the nationals are dead. They blew up their currencies, sold all their land, now they just take bribes and service debts. They write laws, we pay them to bend the laws, then we move in and do our thing. Simple, right?\n But it isn’t. Not on the ground. The local governments are eager to have us, true. Eager to have our money, eager to have our buildings. Problem is, they get a little too eager, know what I mean? In urban areas, the government types can be . . . aggressive.\n Soon as I saw the big Chrysler AT by the tent, I knew the city police were here. The chiefs go in for those army trucks: makes ‘em feel all big and tall. Inside the tent, we found quite a party. Not only Medan police, but a local suit, representing whatever was left of the government. Which accounted, no doubt, for the merc out front. Plus the contractor. Plus our biggest prospective tenant, a Chinese-French guy who represented a hotel consortium. Off in a corner, I saw Colm Kellans from our own team.\n You know how I feel about Colm.\n The contractor was the one doing the talking. “Hey, whatever you guys want to do, it’s not my dollar. You’re paying for my time. You make the schedule.”\n That’s the best rendition I can give of what he said. You know how it is with translation software.\n Anyway, it had an effect. Grim silence. Every human in that tent represented a complex system of international capital flows. And every moment we spent gabbing was a pile of money lost.\n Karen introduced me. Right away, they got back to business, speaking as if there had been no interruption. The police chief stood up, waving his hands.\n “This should be our job. We have legal authority. Let us go in and we’ll do the job for you. Tomorrow, when you come back, the building will be clear.”\n Again, my rendition. What he actually said was a lot less friendly. It got the point across, though.\n “Sure,” Colm answered. “We know how you’ll do the job, chief. Billy sticks and tear gas. Breaking legs and cracking heads. When you guys say ‘clear,’ you neglect to mention the blood we’ll have to wipe off the floors.”\n “Now, hold on.” This was Karen, doing her negotiator thing. “There’s got to be some way—”\n They ignored her. The police chief came back at Colm. “You don’t like our methods? What are your methods? What are your people planning to do about this problem?”\n Colm, he did that ex-marine thing. Stood up, real slow. Totally silent. Stretching his neck, taking his time. Looking at his fists, like it had just sort of occurred to him, hey, he used to kill people with those things. You can take the man out of the U.S. army, but you can never take the U.S. army out of the man.\n “Sonics,” Colm said. “High and low. Like we did with those condos in Rio de Janeiro.” He had a picture of the tower on the tent wall, projected from his phone. He punched at the image, showing how it would work.\n “Look. You got these boards in the windows, tenth floor on up. We can get a drone fleet with adapted canons, punch ‘em in with gel-bag rounds. Hit the top corners to knock out the nails. A second fleet of quadcopters will then fly up with the wave generators. If we get a shot through a single window on each side, that’ll be enough to build the resonance pattern. We hit them with the maximum nonlethal dose. Start at the top and work our way down. We can flush the whole building in a couple of hours.”\n “Except,” the chief pointed out, “for the bottom ten floors.”\n I was still trying to catch up with the proceedings. But I knew the chief was right. The bottom floors of the building had glass windows, painted black. We could punch ‘em in with the gel-guns, of course. But if this was the kind of situation I thought it was, the last thing we wanted to do was to fill the building with flying shards of glass.\n Colm gave the chief that old commando look, like pissant developing-country cops should know not to mess with a Western ex-army dude. “It’s a flush,” he said, giving each word this fierce emphasis. “We’re flushing these people. If we clear thirty floors, that’ll drive out the rest. Believe me. If there are as many people in there as we think, it won’t take much to start a rush for the exits.”\n “People will be trampled,” said the police chief. “You’ll have a stampede.”\n “My friend, that’s the entire point.”\n I noticed that the contractor was shaking his head. “What’s the matter?” I asked him.\n “Forget it,” he said, or something to that effect. “Subsonics, hypersonics, whatever. You don’t want to use any acoustic weapons in here. Can’t happen.\n Chinese guy, the contractor. Laconic. Mostly he just made faces, waved his hands. But I knew what he was saying. With a building like this, cheap steel and bad composite? If Colm started blasting soundwaves through the structure, that could bring the whole place crumbling down.\n “According to our engineer’s report . . . ” Colm began. Still playing the coolheaded soldier. But the contractor wasn’t having it. The guy spun in his folding chair, smacking the side of the tent to make the projected image shiver and ripple. He said a word in Chinese that the software couldn’t handle. No one needed a translation. I mean, who were we going to trust? Some pointy-headed engineer’s report, delivered out of an Atlanta office? Or the guy who actually built the buildings?\n This was getting ugly.\n At this point, Karen felt obliged to remind everyone that I, the company investigator, had arrived, and that I, the company investigator, was technically in charge. “What we need to do,” she told them, “is understand this situation. Only then will we know how to proceed.”\n And this is when things got weird.\n Because everyone in the tent suddenly got this funny look, like kids with a dirty secret. After about a minute of awkward silence, Colm pushed a binder across the table, the kind with a thumbprint lock.\n “I think you’ll want to take a look at this,” he said.\n Carter, it’s time for another hard truth.\n I know how things look from the home office. One big spreadsheet. Data points. And one of those data points is the head count.\n Twenty squatters cleared from woodlands in South Dakota. Eighty squatters cleared from unfinished townhouses in Jalisco. Seven hundred squatters cleared from an abandoned soccer stadium in Jakarta.\n Numbers.\n But when you’re in the field, you’re not thinking about numbers. You’re thinking about networks, groups, social dynamics.\n A squatter community is just that, a community. And every community has one, for better or worse: a leader. When you do a site clearance, that’s the person you want to talk to.\n “I sent you an email.” Colm looked at Karen as she thumbed open the binder. “Also a voicemail. You’ve been on the phone five hours straight. Anyway, there’s been a development. Turns out you were right. This is very far from an ordinary site clearance.”\n Karen flipped open the binder. The first thing I saw was a dark face. Male, middle-aged. Could have been from any country in the world.\n “That’s Abdul Shah,” said Colm.\n “Arabic?” I guessed.\n “American. Parents were Indo-Trinidadian Muslims. Immigrated when he was a baby.”\n Karen flipped through the file. Again, Carter, you have all this information, but I’ll give the rundown. Abdul Shah, until about half a year ago, was the type and epitome of nobody special. Grew up in Brooklyn, went to serve in Afghanistan in oh-eight. Seems to have been a typical kid, living for basketball and video games, till an IED flipped his truck on the road to Kandahar. After his discharge in twenty-ten, he took to wandering. Drifted down to the Caribbean, disappeared for a while, seems to have lived full-time as a beach bum. He shows up next in a Stanford MOOC on introductory neuroscience. In his forties, he goes back to Iraq as a visitor, then on to India. Tracing his roots, maybe. A decade later, he pops up in Sumatra. That’s where he set about making himself a gigantic pain in our asses.\n “That stint on Hassel Island,” Colm said, “is where he seems to have developed his ideas.”\n “Ideas?” I didn’t like where this was heading.\n Colm gave me a look, like: Don’t play stupid with me, you know how it is.\n I know how it is. We all know how it is. The people, the rootless people, the infinite people . . .\n They say demographic growth is slowing, even reversing. That’s no comfort to the billions of people caught between the trendlines. They wander from place to place with no jobs, no prospects, no home-sweet-home. I’ve heard there are more homeless in some countries than there are people with legal shelter.\n Cities won’t hold ‘em. Countryside can’t support ‘em. What they’re looking for, mostly, is a reason to keep going. I know it sounds trite. But some clichés are like dirt and death; there’s no getting rid of them. People, rich or poor, need something to believe in.\n “So this guy,” Karen said, tapping the binder, “Abdul Shah, he’s some kind of a . . . ”\n “He’s a crank,” said Colm.\n “A prophet,” said the police chief.\n “I was going to say ‘guru,’ ” Karen said.\n Colm pointed at the projected image of the tower. “He holed up there in August. Started preaching whatever it is he preaches. By September, he had about a hundred followers. By December, four hundred. Now there’s a whole congregation in there. They never leave the building. And that’s how we get to this lovely situation we’re in today.”\n “So this is no simple squatter population,” I said. “This is more of a—”\n “A cult,” said Colm.\n “A temple,” said the police chief.\n “This is getting interesting,” Karen said.\n I asked Colm, “When you say ‘preaching’ . . . ”\n Colm waved. “So far as we can tell, Shah is offering a fairly standard cocktail of bullshit. Touch of Islam, touch of Buddhism, touch of neuroscience. You know these guys. They grab a bit of the old, a bit of the new, stir it all together and act like they’ve discovered a whole new religion. The full profile hasn’t yet been established—”\n “Meaning you have no idea what he actually believes.”\n “The full profile hasn’t yet been established,” Colm repeated, giving a military stress to each word, “but we believe Abdul Shah’s ideas tend toward the apocalyptic.”\n Great. Within four hours of getting off the plane, I’d gone from running a squatter relocation to quelling a thousand-member suicide cult. “What about a cordon? Can we cut them off? How are they supplied?”\n “You want to try a siege?” This was the prospective tenant, sounding seriously piqued. His company was supposed to be on the property by year’s end.\n “A siege could be a problem,” Colm said. “Not because of the tower. Because of what’s happening outside the tower.”\n “These people have attracted support,” said the chief, “from the local community.”\n “They bring offerings,” Karen said. “Donations. Food and water. I noticed that when I came in.”\n I remembered that ring of debris around the tower’s base. Except, as I realized, it wasn’t debris at all.\n Those jugs, those bales of supplies, they were offerings. Tribute.\n Worse and worse.\n “Not to mention new recruits,” said Colm. “They show up every day. Word’s gotten out. This guy’s being greeted as some kind of visionary. A problem like this, it gets worse before it gets better. We need to nip this in the bud.”\n What we needed, I was thinking, was to get these crazies off our proverbial lawn. After that they could do whatever they wanted. Suicide cult or second coming or whatever.\n “I told you.” The police chief made a swinging motion, wielding an imaginary whip or club. “My guys, this is their job. Three riot teams, one at each major entrance. We can clear the building in a day.”\n “Sonics,” said Colm. “Trust me. Quick and clean.”\n They went back and forth, an argument I’d heard a hundred times. Still, I had a feeling, like there was something I’d forgotten.\n “What about the first teams?” I asked. “The survey teams? The people Karen sent in?”\n “What about them?” Colm said.\n “Don’t they have anything to tell us? What have they learned about the situation?”\n Silence. They were all making eyes at each other, even the guys who’d been arguing before. It gave me a shivery sensation, like with all the weird things I’d heard, I still hadn’t grasped how crazy this situation was.\n “The other teams,” Colm said at last, speaking slowly to emphasize how slow-witted I was, “haven’t come back out.”\n “And that,” said Karen, slapping shut the profile of Abdul Shah, “is what I’ve been trying to tell you.”\n 3\n Here I am again, Carter, back from a sandwich run. A man can’t live on whiskey and Coke alone.\n Maybe it’s the tropical climate. But there’s something ceremonial about these buildings of ours, don’t you think? Hotels, malls, offices, resorts: they all have the same monolithic appearance. Glassy slabs, smooth, sky high. An alien visitor might take them for memorials. Memorializing what, he’d have to wonder?\n That’s what I thought when I stood underneath Shah’s tower. It was oddly like a ziggurat, the way it narrowed in stages. Glass and stone for the first hundred feet, then composite and plywood, then a skeletal spire rising toward the sun. Where, I wondered, would Master Shah make his home? Was he the kind of cult leader who’d need to be close to heaven? Topmost floor, high in the South Asian clouds? Or the kind of elusive crackpot who’d want to burrow deep, behind a nest of barricades and guns?\n Karen and I were standing on the cement platform, just outside the ring of donations. Up close, I could see that the stuff was almost all food, the kind of rations starving people receive. Sacks of rice, jugs of water, unappetizing cubes of processed fish.\n “How long do we wait here?” I asked Karen. She gave an impatient little hiss.\n In the tent, Karen had told me her plan. Her morning hadn’t been idle. In the five hours she’d spent on the phone—five hours she’d been failing to get Colm’s messages—Karen had made contact with a mole inside the tower. If this person could be trusted, one of us would soon be inside.\n The typical squatter camp is a sobering place. But not a dangerous place. I don’t know what they tell you in the home office, but the rule in the field is that you minimize provocation. The first teams we send in are like embassies, establishing what you might call diplomatic relations. The optimal process is to strike a deal, arrange for relocation, offer payouts, alternate housing. It’s only when things break down that a guy like Colm steps in.\n Later, we send in the survey teams, medics, engineers, toxin abatement. All told, about twenty-five people might enter a building of this size.\n None of them, so far, had come back out.\n “So what’s your theory?” I looked over at Karen, who’d switched from coffee to pep pills. “What are we looking at here? Mass murder? Cannibalism?”\n Karen sighed. In the command center, she’d played a message, first and only communication from within Shah’s tower. It had been sent by a woman named Shayreen Scott, point person on the last survey team. Her message was nineteen seconds long.\n *****transcriber’s note: file #AB112235 intercut*****\n “Hi, everyone. I’m fine, but I want you to know that I and the other team members have decided to stay with this group for now. Please don’t worry about us or send anyone else into the tower. For the time being, I think it’s best if we break off contact.”\n *****end intercut file*****\n “Now if that’s a hostage message,” Karen said, “it sure doesn’t sound like one.”\n It didn’t sound like one to me, either. What it sounded like was a surefire sign that Shayreen Scott and her team had gone completely batty.\n Thankfully, Karen had ignored Shayreen’s request. She’d established contact. For four and a half hours, she’d run automatic redial on Shayreen’s phone. For half an hour, she’d held a frustrating conversation. By the time Karen picked me up at the airport, terms had been established.\n One person—one member of our team—would be allowed to enter the tower.\n Me.\n Oh, Karen put up a good argument. She was the better negotiator. She had more experience on-site. But she also hadn’t rested in the better part of a week.\n I pulled rank.\n So here I stood in the shadow that Shah’s tower cast like a gnomon on its surrounding dial of donations, looking at the glass doors reinforced with plywood, the rows of covered windows.\n “How long do I have?”\n Karen checked her phone. “If you go in now? Fifty-four minutes. I’ll try to get you more.”\n Fifty-four minutes. Less than an hour until the local police chief moved in with his clubs and gas. Sparking, most likely, a riot. Or mass suicide. Or worse.\n “There’s the signal,” Karen said, looking at her phone.\n “Wish me luck.” I was already walking.\n “Doug?” Karen resembled a squatter herself, standing there in her week-old clothes. She waggled her phone. “Keep in touch.”\n I had three phones on my person. One in my pocket. A bug taped to my chest. And a third, my only genuinely secret one, the miniphone I carried in a place I felt confident no one would check.\n I nodded at Karen and turned away.\n As I walked into the shadow of Abdul Shah’s tower, I thought of my kids. Two little girls. Except they weren’t little girls, they were grown-up women, and I often wondered where exactly I’d been while that was happening.\n But I knew.\n I’d been doing shit like this.\n The plywood slid aside as I came close. The door cracked open just wide enough for me to enter. No one stood on the far side. No smiling face popped out to welcome me. Only darkness and a breath of dusty air came from within Abdul Shah’s bizarre temple.\n I stepped inside.\n 4\n The first thing that happened was a woman’s voice said, “Stop.” I heard a scrape, a clink of chains. Someone locked the door behind me. The light from outside disappeared. A bulb came on, faint and ghostly, one of those rechargeable lanterns the survey teams carry. The woman stepped forward.\n “Shayreen Scott,” I said, recognizing her face from the file.\n She smiled.\n I’ll tell you what the file says, Carter. It says that Shayreen Scott, until she picked up this assignment, was a perfectly unexceptional nine-to-fiver. Someone who filed her reports, logged her expenses, never slacked off or did a lick of extra work. The pragmatic type.\n That didn’t fit with the woman I saw now. She had the eyes—kooky eyes. Fanatical. And a smile, broad, scary, like a born-again believer.\n She’d been in this place for all of eighteen hours.\n “Over there.” Shayreen pointed into the gloom. “You can leave your phone.”\n By ‘can,’ I figured, she meant, ‘you’d better.’ The room was an unfinished lobby, cheaply constructed. Against one wall, they had a pile of phones, headsets, gadgets, laptops, watches. Every type of personal tech, dumped on the floor in no discernible order. I wondered how to keep my phone from disappearing in the mix.\n “I wouldn’t worry.” Shayreen noticed my hesitation. “You won’t be wanting that thing back, anyway.”\n Because in another few minutes, her tone implied, I’d have other matters on my mind.\n A kind of marble slab, an unfinished desk, stood near the wall. I set my phone on top, noticing a slew of other phones already there, gathering dust, some of them among the newest models.\n “Hold it.” Shayreen turned me around. Gently, like she’d noticed a tarantula on my chest. “Thought so.” She opened my collar and found the wire. “You should understand,” she said, as she picked at the tape, “this isn’t a matter of security. This is for your own benefit.”\n No doubt. Shayreen set the bug on the desk, ready for later pickup.\n “Ready? This way.”\n It was like a theme-park ride, that building. I used to go to those places with my daughters, Disney World, Universal Studios. They always bring you through a little tunnel before you go on the big attractions. Putting you in the mood, making a break from the outside world. The halls in Shah’s tower had carpet on the floors, frosted glass wall sconces, rows of closed doors. I tried to picture the people who had lived here—until I remembered that, till now, nobody ever had.\n In three turns we came to an elevator bank. Shayreen hit the button. “You have electricity,” I blurted, forgetting this had been in the case file. Not that pirated electrics are unusual.\n Shayreen nodded. “Some.”\n “But no lights.”\n “No lights,” she said, in a way that made me understand this was intentional.\n Even in the elevator, no overheads came on. Which meant they had done some tricky things with the wiring. “Would you mind explaining to me,” I said, “what’s going on?”\n “Distractions.” Shayreen gestured at the overheads. “They’re very deliberate about limiting distractions. This?” She held up her lantern. I wasn’t sure if she meant the light itself, or me, or the whole situation. “This is an exception.”\n “Listen.” I got close, dropping my voice. “If you’re in any danger here, if you’re being held prisoner . . . ”\n Shayreen gave no answer. Only a glance of those kooky eyes.\n “Here we are.”\n We’d come to a high floor, not quite the top. I heard a faint noise, a distant thumping. Wind.\n Shayreen turned down a dark hall. Over her shoulder, I saw light at the end, crooked lines that shifted and changed. It was one of the tower windows, blocked with a board that thumped and trembled in the shore breeze.\n We left the hall. You’ll have to forgive me, Carter. This is where I start to doubt my own memories. I’m hard-pressed to swear that all of this really happened.\n The building, at this height, was far from finished—essentially, a metal-and-mineral shell. Along the naked ceiling, bundles of wires ran, hooked to lights that no one was using. Stacks of brick lay all around. The floor was bare cement, the internal walls incomplete. Far off, I saw rows of glimmering squares, outlines of boarded-up windows.\n But I couldn’t see much else. The place was packed, filled with shreds of hanging sheet. Clear rubber, tent material, bedsheets, even those rubbery strips they have in grocery stores. They hung from the ceiling, dividing the space into tent-like chambers, a maze of gauzy makeshift cells.\n And in those cells, quiet and still, lay the people.\n Shayreen had already gone far ahead. I hurried after her, skipping over jugs, boxes, empty food containers. Garbage had been scattered all over the floor. And buckets. Yikes, those buckets.\n “What is all this?”\n I winced at the volume of my voice. You could tell, looking around, that it was wrong to speak in that place. Shayreen’s lantern, weak even at its highest setting, lit only about ten feet of floor. Every once in a while, as she strolled along, a face passed through its feeble light. Old faces, young faces, women, men. The people lay on cots or pallets, even on the bare floor. Once, I saw a face I recognized, bearded and freckled, a man from one of our field teams. He lay silently, like the others, eyes closed. Serene.\n “These people . . . ?” I whispered.\n Shayreen turned to me. I didn’t need to see her face to know she was making hush-hush signals.\n “They’re concentrating.” Shayreen pulled me close. “They’re not asleep. They hear everything you’re saying. Be respectful.”\n “But what are they doing?” I asked.\n “Practicing.” And then, as if she thought she might have said the wrong thing, “They have to focus. It takes a great deal of discipline. They’re waiting.”\n “For what?”\n “To be visited.”\n A woman near us had begun to stir, rolling on her grungy blanket, moaning. In frustration? Pain? Shayreen pulled me away.\n “Come on,” she said, guiding me. “You’ll soon understand.”\n We walked the rows of silent faces. How many, in total? Five hundred? A thousand? Did they fill the building, I wondered, floor to roof, a town’s worth of people, lying silently in the dark? Concentrating, Shayreen had said. Practicing.\n Waiting.\n “Up here.” Shayreen pointed to an open door, a set of concrete stairs leading up. No guards blocked our way, no barriers. A dank wind blew down, the wind of the tropics, moaning through the empty halls. I heard it, whistling among the girders, rippling through construction nets that whipped from the building like shredded pennants. This was the wind of the Malacca Strait, the mighty breath of the Andaman Sea, blowing over a room of sleepers who were not actually, in fact, asleep.\n “What’s up there?” I asked.\n But Shayreen had vanished. Turning, I saw her lantern on the ground, between an army blanket and a strip of weather-tenting. Before the light went out, I caught a glimpse of her face. She had already lain down and closed her eyes. Now she rested with her fellows in the gloom, practicing, meditating, concentrating, waiting.\n In darkness, fumbling at the wall, I climbed the stairs.\n 5\n Here’s a question, Carter, you may not have been expecting.\n Ever move out of a large apartment?\n You know how it goes. You chuck out your knickknacks. The movers come in and saw your sofa in half.\n Soon enough it’s over, and you do a last walk-through. Checking for dropped cards, grandma’s old photos, the kind of damage that’ll attract the insurance folks. Maybe just saying a sentimental goodbye.\n That’s when it hits you. Like the walls are suddenly closer, the floors less expansive, the whole place contracting. Vacant, the apartment seems magically smaller. The very emptiness becomes surreally claustrophobic.\n That was the effect of Abdul Shah’s quarters. He had taken a floor of the building for himself, a broad, empty space, half as large as a soccer field. In the center was the elevator shaft, a cinderblock column, punching up through floor and roof. An incomplete staircase rose beside it, the framework complete, the stairs still to come. Sunlight blasted down this empty well, a column of tropical gold spilling out onto the floor. It would have made a natural spotlight for Abdul Shah to stand in, awaiting my arrival.\n He wasn’t there. It took me a minute to find him. I walked behind the elevator shaft, where the light was like a dusty pollen in the dark. A skinny figure stood against the wall, holding back the edge of a tarpaulin, looking out the glassless window.\n The first thing that struck me about Shah was his Americanness. Maybe that sounds presumptuous. But there’s a kind of poise we Americans have, like a man being pushed from behind. Look out, this posture declares, I have big plans, get with me or get out of the way! Even our priests and mystics have this quality, which is probably why they always turn into hustlers. I was surprised to see that Abdul Shah had it, too.\n The second thing I noticed was his bookish air. He wore thick-framed glasses, a trim little beard. Everything about him, down to his check shirt and corduroys, seemed to belong in a New England university. He didn’t look like a Brooklynite, a soldier, a beach rat, a visionary. He looked like the kind of scholar who studies those people.\n He waved me over.\n “Your people are gathering.” Abdul Shah held aside the tarp, making room for me to join him at the window. It was the only window I’d seen so far that hadn’t been boarded up. I crossed the floor, scanning the huge room as I did so. A cluster of equipment stood in one corner. Telescoping stands, tripods and bulbs, the kind of stuff you see at a photo shoot. A whiff of marshy odor came from outside, stinking of fish and coastal runoff, the salty tang of tidal mud. Looking down, I saw that the Medan police chief had begun to assemble his men around the tower, checking their shields and helmets and gear.\n Abdul Shah’s tone was matter-of-fact. “How long do you think we have?”\n I looked for Colm and Karen, but saw no sign of them. They must have gone back into the command tent. “Those aren’t my people down there,” I said. “Those are the Medan police.”\n “Close enough.” Shah spoke with a confidence that made me bristle. He dropped the tarp. He was a shortish man, slight of build, but with a quiet air that put me on my guard. “So? What’s the estimate? An hour? Two?”\n “Forty minutes,” I told him. “More like thirty-five.”\n Shah fell silent. Not alarmed, I sensed, but thinking things over.\n “In thirty minutes,” he said, “if nothing has changed, I’ll tell my followers to leave the building.”\n Reasonable terms. If he held to them.\n “If nothing has changed, eh?” I looked him in the eye.\n Shah smiled. “I think I deserve a chance to explain myself.” His arms hung limply at his sides, nothing moving but his lips. This, at least, gave him a guru-like demeanor, this unconscious scorn for wasted movement. “If I can’t change your mind in half an hour,” he said, “then by all means . . . ” A twitch of his finger indicated the floor, the hundreds of people lying below. “That is why you’re here, isn’t it? Let’s not waste time. You have an argument to make. I do, too. I assume this is what you expected, Mister Lam?”\n I thought about the people under us. Five hundred, nine hundred, maybe a thousand, all meditating or waiting or whatever it was they were doing. Eating cold rice and pissing in buckets. Followers of this man. I knew I had to speak carefully.\n “My argument,” I said, pointing out the window, “is those police down there. Plus a corporate security team equipped with the day’s best acoustic weaponry. You know what that means. Here’s the deal. I can arrange for temporary shelter for your people. Two, maybe three months in a refugee camp. Protected transportation. Onsite medical care. If this goes well.”\n Shah nodded. “I understand.”\n “And you?”\n “My argument,” he said, “is over here.”\n He pointed to the corner, the equipment I’d noticed earlier. Big, blocky devices stood mounted on poles. As we approached, I saw that these were speakers, powerful ones, the kind that get deep into the low ranges. Shah clicked on a lamp. He had five lamps in total, arranged in a square, one hanging from the exposed girders overhead. These weren’t ordinary light fixtures, but advanced machines that gave out a shifting, unsteady glow. Entrancing.\n I stood back. “And what’s all this for? Meditation?”\n “In a sense,” Shah said.\n I almost laughed. It was like something out of a cult-leader’s handbook. “And you need all this fancy equipment? No candles? No incense?” Seeing that the whole setup had been rigged to a MacBook resting on a stack of pallets, I bent over to study the screen. Shah smiled and gently folded shut the computer.\n “No incense,” he said. “Though it wouldn’t hurt.”\n He fiddled with the overhead lamp. A spiral bulb, bright as a tiny star, glared through a nest of reflectors and filters.\n “The candle,” Shah said, “is very much an artificial light source. Like any artificial stimulus, it produces particular effects. A dreamlike state. Heightened imagination. Theological inclinations, perhaps a weakness for Cartesian theology.” He winked. “The intent of this setup is . . . well, slightly different.”\n Shah tweaked a dial on the side of the lamp. A whine of machinery accompanied subtle adjustments. The light changed, breaking into a fluid, dappled pattern, a kind of spray of color and shadow. Like sunlight shimmering through leaves . . .\n “These are sunlamps,” Shah said. “Very advanced ones. If you head up to Bangkok or down to Bali, you’ll see them in the new resorts. They advertise these as ‘phototherapy.’ The radiation is filtered through several kinds of crystal and gas, designed to mimic ambient light. Not a raw blast of radiation, as you get in a tanning bed. More like the healthy glow of a forest.” He smiled again. “It’s not necessary to use these,” he said. “But I find it helps.”\n He reminded me of an English gardener, puttering around a tangled plot of roses. “So you sit here under these lamps,” I said, standing back with my hands in my pockets, “soaking up the rays, and . . . what? What’s the point?”\n Shah’s face betrayed surprise. He adjusted his glasses. “I’m sorry. That’s not the intent at all. I’m not going to sit here, Mister Lam. You are.”\n Of course. I should have known. I stepped into his thicket of tanning-salon accessories. “So I’ll squat down here, and you’ll work your mojo on me, and you think I’ll end up converting to your brave new religion? That’s the deal?”\n Shah adjusted one of the speakers, smiling that funny smile. “These speakers, now . . . these are from an American home theater system. They’re perfectly safe. Unlike the acoustic weapons you threatened me with, they’re designed to be pleasingly stimulating. The body . . . ” He broke off, scratching his chin. “Let me start again. The self, I should say, isn’t confined to the body. It isn’t here, or here, or even here.” He touched his chest, his belly, his cranium. “It’s out here.” Shah spread his arms. “In the sensorium. The environment. The self converges on the body, but it’s not contained in the body. Do you follow?”\n I sighed. He sounded exactly like the sort of babbling crackpot I’d expected. I shuffled to the center of his lights and speakers. “Just to clarify: I’ll sit here and put up with your little sensory therapy session. Twenty minutes, no more. And when this is over, whatever the effect, you’ll give the word and clear your people out.”\n “All I ask,” Shah said, “is that you have an open mind.”\n He had no prayer rug, no stool, no reed mat. He didn’t seem to care if I stood or sat. “And where will you be,” I said, “while I’m grooving to these good vibrations?”\n “I’ll be right here,” Shah said. “Talking to you. Because the words, Mister Lam . . . ” Again with that weird smile. “The words are the most important part.”\n It happens that, despite my background, I know a thing or two about the power of hypnosis.\n I can thank my wife for that. My second wife. Not Terry or Linda or Fey-Long, but Francine. She went in for New Age stuff. Aroma therapy, cryotherapy, drawing Jackson Pollock pictures in pig blood while neoprimitives in yoga pants shout in your ear. Francine was into some nutty stuff, but she taught me a lot of good lessons, too. She taught me how the nutty stuff works, or makes people think it works. About the uncanny power of suggestion.\n Hypnosis. It’s real, Carter. Not the wacky things you’ve heard, past-life regression and out-of-body trips. I mean the classic deal, mesmerism, the power of the voice. Those people who imagine alien visits and talking hippos, they aren’t faking it. They really see those things.\n The smartest thing Francine ever told me is that when a word’s in the air, it’s only a wave. When it enters your ear, it’s only a vibration. But when a word gets into your head, into your brain, it becomes a chemical. And chemicals, those are the keys to the soul.\n As I sat down amid Abdul Shah’s lamps and stands and sound generators, I honestly thought I was prepared. Prepared for something a little intense, even for a heavy trip.\n But I wasn’t prepared for anything like this.\n I can’t remember what Abdul Shah said. His words, at first, were ordinary words, the kinds of things any hypnotist might say. You feel relaxed. You’re very calm. He turned on his speakers. The light began to change. I wanted to open my eyes, but to my surprise I found I couldn’t move. The sound waves had taken hold of me.\n Imagine the ocean, the way it heaves on a windy day. The waves don’t simply break over your head, when you go swimming on a day like that. They squeeze you. They grab hold of your guts and ribs. They pump your lungs, press your heart. Pretty soon you have no choice. You’re forced to breathe in the rhythm of the sea.\n That was the effect, albeit more potent, created by Shah’s array of speakers. No sooner had it taken hold than Shah began to change his speech. Now he recited gibberish, or what sounded like gibberish. His voice skipped up and down, hitting odd pitches. It was more like singing than talking or chanting. A crazy kind of singing, like he was part of an ensemble, but all the other parts had been cut out. The light pounded against my eyes. I could feel the radiation from the lamps, a burning tingle.\n Before long, Shah changed it up again. He began to repeat odd sounds, varying them in a mixed-up rhythm. Noise and light, voice and thought, pulsed and combined in a calibrated pattern. I couldn’t think. I mean that literally—I seemed to have no control of my mind. But I understood, in the meaty way of the body, that this was all leading to a terminal event. Not like a rocket heading for a target, but like a net that slowly loosens—until at last I slipped through, falling into an abyss.\n Shah must have spoken a triggering word. His speakers and lamps delivered one final, precisely keyed, mind-busting blast. I realized that my mind was a shell, and that it was cracking, exposing a secret, internal place.\n And into that place came . . .\n Something.\n Only later, as I put my mind, Humpty-Dumpty-like, back together, did I find the words for what had happened.\n I’d been visited.\n 6\n “Mister Lam?” Shah bent over me, backlit by his array of lamps. Even in silhouette, face in shadow, he looked worried, uncertain, and very, very tired. “Mister Lam, your pants are calling you.”\n I blinked into the gaping void that remained of my short term memory. Where the hell had I gone? What the hell had happened? Gradually, I realized that Shah was right. A voice was rising out of my pants, emanating from the naughtiest part of my anatomy.\n “Doug? Doug? Can you hear me, Doug?”\n I staggered up. The light was different, softer. The air in the room felt different, too, less punishingly stuffy than when I had arrived. I stumbled past the lamps to the window, yanked back the tarp.\n The sun was setting over the western hills.\n Red marked the horizon. Pink beams slanted down the black, scoured valleys. Below, on the pavement, the riot police sat waiting, shields laid flat on the ground at their feet. A few played cards around an overturned water barrel. I could see the screen of their gambling machine flickering in the fading light.\n “Doug, I’m getting worried. Are you there? Can you answer?”\n I shoved a hand down my pants, fumbled at my groin, and ripped the wads of micropore tape off my skin. I lifted Karen’s miniphone on a strip of medical fabric. “I’m here, Karen. What’s up?”\n “What’s up? What’s up is that I’ve been fighting tooth and nail to buy you more time. Doug, what in the world’s going on in there? You’re not hurt, are you? Have you been restrained?”\n Hurt? I blinked at the miniphone in my fist, trying to remember the person I’d been this morning, that man named Doug Lam who participated without hesitation in ordinary conversations. Corporate stooge, experienced site investigator, moderately skilled negotiator. Was that me? “Karen?” I ran my tongue around my mouth. “How long has it been?”\n “Doug, I’m serious—”\n “I have no clock, Karen. They took my phone. Tell me, how long?”\n Her answer came back on a surge of static. “Six hours.” Karen’s voice rose. “I’ve been calling you, Doug, for six damn hours.”\n Glancing over my shoulder, I saw Abdul Shah, standing amid his collection of speakers, waiting for me to finish the call.\n “What’s happening?” Karen’s voice cracked with exhaustion.\n I was already talking, so fast I could hardly breathe. “Don’t let them do it. Karen. Don’t let them come in here. Get me as much time as you can.”\n “Doug, for God’s sake—”\n I’d already clicked off the miniphone, dropped it into my shirt pocket, and crossed the floor to face Abdul Shah.\n “Tell me.” I spoke simply, not commanding or begging, merely issuing a humble request. “Tell me what just happened.”\n He turned his back, fussing with something hidden behind his equipment. “This may take a moment.” Shah spoke over his shoulder, straightened, turned, used his heel to kick shut the door of a minifridge, and held out a dripping can. “Would you like a Sprite?”\n 7\n Usually, when people have an experience like this, they tell you it simply can’t be described.\n I dunno, man, it was surreal, y’know, like, intense, like, I couldn’t begin to describe it.\n Bullshit. The truth is, there are thousands of ways to describe what I’d been through. And all of them have been tried before.\n That was what Abdul Shah undertook to explain, as he turned down his lamps and clicked off his speakers and sat me down with a can of lemon pop.\n “It’s not so esoteric. Every culture has a version. Usually several versions. In the West, for instance, people talk about ghosts, bodily possession. There’s the concept of the muse: an invisible companion, offering vision and inspiration. Even the word genius goes back to the idea: a visitation from a presence that is like us, but more than us. It’s an old, ineradicable insight: that we are not alone in this world. That we are, at times, visited by spirits.”\n I watched his hands, thin, knobby fingers clawed around his soda can. Looking at those hands, you could believe he had lived a rough life, hunting insurgents through the Pashtun deserts, weathering storms on a Caribbean beach. Sometimes he reached out and stroked the dials on his arrangement of lamps and speakers. His arm trembled. Abdul Shah might look like a college professor, but he had a hermit’s fingers and bones.\n “This was more than that,” I said. “More than a spirit. It was . . . ”\n How to say it? I couldn’t stop looking at Shah’s equipment. A few home theater components, doodads from a sauna . . . it was the modernity of his operation that dazzled me. How did he manage to do what he did, with a rig borrowed from a California retreat?\n Shah straightened his glasses. “More than a spirit, yes. A feeling. But the feeling, the essence, is always the same. A doubling. A presence. Not happiness, exactly, but a sense of profoundly heightened perception. The Greeks spoke of a daimon, a kind of guiding personal deity. And of course, you know all about Buddhists, mystics, desert hermits, the many varieties of meditation. In Islam, Allah is not merely out there, like some kind of abstract deistic authority.” His hand moved vaguely toward the ceiling. “He is with us. Watching. He is here right now—if we will learn to notice him.”\n Shah was watching my own hands. He must have read something in them, a twitch of skepticism, a twinge of doubt.\n “I’m not religious, myself.” Shah laid his bony hand briefly over mine. “I was raised in America. I fought for America. My people go back to the scholars of North Africa—the original founders of modern science. It was science that led me to this.” His hand indicated the machines, the coiling wires, the MacBook glowing on its stand. “The irony is that in putting the old fantasies behind us—the gods and demons, the ghosts and spirits—we forgot about something more important. We forgot how to pray.”\n The evening wind slipped in around the hoardings, wet and cool with the mist off the bay. The sound it made was almost funny, like a child’s imitation of the howl of a ghost. I wanted to challenge Shah’s mystical theories, but the effects of his treatment still clung to my mind. The sensation was richer than what he described. A presence, yes, but also a kind of sadness, like a fleeting memory from long ago.\n Shah nodded and smiled, reading my thoughts. It occurred to me that he’d already had this talk with hundreds of people: those dazed and devoted followers, lying in the darkness below.\n “Understand.” Shah held up a palm. “Prayer isn’t magical. Like anything else, it’s a physical process. The neuroscientists are beginning to understand it in their own way. But so much of the art has been lost, there’s now very little for them to study. These people?” His head tipped toward the floor. “They’re learning to recover it. Not modern meditation. Not juice cleanses and therapy. The true, ancient art of opening the mind. This kind of prayer was only a fading memory in the mystery rites of Ancient Greece. It had already been half lost when the shrines of the Ancient Egyptians rose from the sands. It’s a way of worship known only to the first people, the early men and women, who lived with spirits all their lives. With practice, it can be relearned. The techniques I used on you are awkward and crude. But vital. We’re trying to break open a very heavy lock.”\n I shook my head. What Shah had done to me was anything but crude. I told him as much, but he chuckled and wiped his glasses.\n “Well, any man can fly, if you put him in a catapult and cut the rope. Controlling flight, that’s another story.” Shah stood and drifted among his equipment, tuning this, adjusting that, like an artist who can’t stop fiddling with his work. His voice, his manners, his every movement, had taken on some of the rhythms of his ritual, as if he were unconsciously attuned to secret sources of music.\n “The words,” Shah said, “they’re the challenging part. Suggestion, the power of speech: it can be very powerful, if used well. But it has to be tailored for different cultures. In a way, I find it easier to work in this country, honing my techniques in a foreign language. It helps me remember that words are only a technology—a very old tool for reprogramming the brain.”\n “But how did you learn—?” Nothing he had said, so far, came near to addressing what I wanted to know. “How did you figure out how to do this?”\n “To rewrite the mind? To access the wetware of the soul?” He smiled as he recited these familiar clichés. “I didn’t. Yes, I put together this setup. It took me decades. But the underlying techniques, the fundamentals—these were shown to me. Taught to me, I think you could say.”\n “By whom?”\n Shah didn’t answer. His eyes were on the far wall, watching the window he’d been gazing through when I arrived. The tarpaulin had pulled loose and stretched out to flutter like a flag in the evening sky. “You know,” Shah said, “we actually do very little, once we’ve truly learned to pray. It’s really a matter of clearing the mind, making room within oneself. It’s then . . . ”\n He paused. A strange buzzing had begun to shake the air, bristling and needling, like iron filings twitching toward a magnet. I set down my untasted Sprite. “It’s then?”\n Shah’s eyes were still on the window. He put out a hand, touching the frame as if to steady himself. “It’s then,” Shah said, as a fusillade of gel bags began to pound the walls, “that they come to us.”\n 8\n The modern gel-round is a tidy piece of munitions. A flexible sac of viscous polymer, cased and laced in an electric mesh, it can squeeze into nearly any shape. With the right launcher, it can be shot, in the form of an aerodynamic needle, over distances of five hundred feet or more. On impact, or at the spark of an embedded trigger, it flattens into a pancake and sheds most of its momentum. With that transition, it throws out a distinctive shockwave, a thump that’ll almost pop your ears.\n Colm had programmed his barrage with care. Four squares of plywood burst suddenly inward, making four holes in the centers of the walls. Splinters flashed in the sunset; eight nails pinged to the floor. Five holes now gaped to the night, ready to receive whatever Colm chose to throw through them.\n The buzzing grew louder. I followed Shah to the window, reaching out to catch the flapping tarp. The ground seemed to spin and tilt far below, dark under a purple sky. In the half light, I could see the police gearing up. Three sulfur lamps beamed on the fabric of the command tent. Two tiny figures stood out front. They might have been chatting or flirting or fighting, for all I could tell looking down from this height. I recognized Colm and the police chief by the colors of their uniforms: black and gray.\n Shah gazed straight ahead, to the eastern horizon, where Belawan blazed in the hollow of its harbor. A spot of darkness crawled slowly across the city lights. The buzzing grew louder—a feeling more than a noise, like a nail scraping along my skull.\n I pulled out my miniphone. “Karen? Hello?”\n Her voice came to me across a gulf of exhaustion. I wondered if I’d caught her sleeping. “Doug?”\n “What’s going on down there?”\n A pause. I reminded myself that this woman had been awake for the better part of a week, surviving on sugar and synthetic hormones. “Doug, I think I’ve done all I can.”\n Shah was still holding back the tarp, watching the angry shadows of Colm’s drones as they climbed slowly across the sky. I cupped my hand around the phone, trying to dampen the vibrations in the air.\n “Karen, Colm’s drone fleet is up here, gathering around the building. They’re sending out the preliminary signal. I thought we’d all agreed that this kind of acoustic assault would be a very bad idea.”\n Her voice seemed to recede each time she spoke, as if she’d set the phone down and run away, fleeing across the black marshes. “It’s a pissing match. You know how this goes.” A crackle of static nearly killed the signal. Karen’s voice crept into audibility. “The police chief says he’s waited long enough. He’s sending in his riot teams. Colm says that if the chief does that, he’s going to launch his own attack.”\n “They’re both crazy.”\n Another burst of fuzz. Colm’s drone fleet was mucking up the signal. “Get out.” Karen’s voice fought through the interference, repeating one injunction. “Get out . . . get out . . . ”\n I turned. Abdul Shah jerked as I grabbed his arm. He was stronger than he looked, skinny but firm. “Send the word.” I pulled him back from the window. “Tell your people it’s time to evacuate. Now.”\n Shah’s tongue darted along his lips. He had the expression he’d worn when I first told him how little time we had, not frightened, exactly, but thoughtful, calculating.\n “Listen.” I pulled him toward the stairs. “That buzzing? That’s the preliminary waveform. They’ll run that pattern for a bit, tuning up. It could go on for ten minutes. Could be thirty. We have a little time. But not much.”\n Shah looked over his equipment, tapping his teeth with his tongue, as if counting.\n “Shah.” I wanted to shake him. “You’ve got to send down the word. Tell your people what’s happening here.”\n His eyes settled on mine. “It’s as you said.” A smile passed across Shah’s lips. “They’re not really my people, Mister Lam.”\n The noise of the drones had settled into an ambient distraction. Shah’s voice rose like a melody above the discordant tones. “These people chose to stay here. To learn, to practice. I only teach them what I can.”\n I shook my head. We had too little time.\n “Shah!” I was shouting, now, overloud, the noise of the drones playing havoc with my hearing. “Tell them to leave!”\n Shah looked confused. A new sound rose over the background hum, a squawk that echoed off the naked walls. I recognized the cadences of north Sumatran Hokkien, Medan’s contemporary lingua franca. The police chief had brought out a megaphone.\n “Mister Lam.” Shah sank between my hands. “You don’t understand. I did tell them.”\n I released him. Outside the window, the hovering drones hung buzzard-like in the night, blotting bird-sized swatches of stars. Below, the riot police were assuming formation, blocking off the tower’s three exits. A ramming team approached the bolted front doors. I saw no fugitives fleeing the tower, no refugees huddled on the pavement below. Only that ring of donated food, all of it worse than useless now. And the bright sulfur lamps, and the gleaming helmets, and the tiny figures of Colm and the police chief, preparing to wage turf war over our corpses.\n “It was while you were in your trance.” Shah drifted to the window beside me, looking down at the commotion with that smug quietude that was the most cultish thing about him. “I spoke to your colleague. The woman who brought you to me. Shayreen. I explained that we were out of time.”\n The riot police had taken position: knots of manpower at every exit, a complement of carbon-fiber shields and clubs. My concern was with the point teams that would soon come charging up the stairwells, throwing out shock grenades and wielding batons. The lead ramming crew had already set up their unit, a black frame that fully surrounded the front doors. A pneumatic device, a kind of giant cattle-gun, it would scan the entrance for structural features, then punch it to pieces with a computer-controlled battery of steel bolts.\n “If the people are still here,” Shah said, “it must be because they want to stay. For as long as they can.”\n “Praying,” I said.\n Shah watched with resignation. “You understand. Don’t you?”\n A blaring command from the police chief’s megaphone broke into our conversation. Instantly, a series of concussions shook the building. A stutter of bolts. A crash of glass. The concrete floor shivered as the entranceway collapsed. With a rumble of boots, the cops came in, their shouts and footfalls echoing up the silent floors.\n Did I? I wondered. Did I understand?\n “Mister Lam?” Shah held my hand, pressing it between both of his. “Let me explain something to you.”\n 9\n Do you need the details, Carter?\n You have the engineer’s report. You know the facts. Is there any point in reciting a series of figures you’ll be hearing in courtrooms for the next ten years?\n Fifty million in unforeseen damages. The pylons, carbon-netted, seated on ten square acres of in-situ, bore-injected micropilings—half of those will have to be replaced. The platform, the vehicle fleet, the command center: gone. Even Colm’s drone fleet took a major hit. Half of them failed to find their backup recharge station.\n Shall I go on? Shall I tally the losses? The payouts to families of the Medan police? The mob of lawyers you’re going have to draft to untangle the thicket of indemnities? The insurance payments? The gifts and bribes?\n But all this is rather soothingly cut-and-dried, isn’t it? All this talk of dollars and contracts, it hardly touches the heart of the matter. Because when it comes to the key issue, Carter, the one you don’t want to talk about, the one no one ever wants to talk about . . .\n I suppose we’ll never know how many people were in that tower. How many bodies, waiting in the dark, trying to shut out the outside world, even as that world came for them with a vengeance.\n Kooks and fanatics, you’ll say. Dupes and fools. It sure feels good to use those words. Most of those people won’t even rate a glib dismissal, because no one will ever know who they were. Undocumented drifters, even before they came to Shah, even before one hundred thousand tons of slipshod construction buried them in steel and debris. Most of the dead will never be tallied. Not their bodies, not their teeth, not their DNA. They’ll rot in peaceful anonymity, beneath the coastal Sumatran mud.\n I bet you’d like to ask me one thing. I bet you’d like to ask if I know why. Why did they do it? Why did they stay? Even as the dust began to settle on their faces, even as the cracks were rising like black lightning up the walls—why did they claim those precious moments, those last few seconds of prayer and concentration? Do I know what they saw, what they hoped to see, in the final second when the floor fell away and the roof came crashing down?\n A lock, that’s how Abdul Shah described it. Breaking a lock to open the mind. He made it clear that I’d only begun the process; my session had been interrupted by Karen’s calls. I had caught a faint glimmer of the wonders to be seen.\n And if I’d been allowed to continue my study? If I had received what Shah called a “true visitation”?\n I can hear you muttering, Carter, out there in your air-conditioned office. You’re a college boy. You know your history. I know what you’re thinking, because I used to think it too. I looked on them all with contempt and disbelief—\n All those millions of seers and followers.\n All those countless dead fools and saints.\n 10\n They call it “wave warfare” for a reason. A lot of people think they know what that means. It’s all done with sound, intersecting shockwaves. Under the right conditions, those waves can kill.\n What fewer people know is that a sonic attack, as programmed by our people, comes in waves of intensity. The drones Colm deploys, they follow a script. They hit their victims hard, then dial down the assault. They allow for a rest, then crank things up. The intent is to stimulate predictable behavior. First, unease. Then confusion. Then panic. Then flight.\n The first wave hit us while Shah was halfway through his story. The buzzing of the drones became a tooth-numbing whine. This sound, I knew, was only a warning. The real attack would be inaudible at first, and it would come in stages. First a deformation of the eyes, disorientation and blurring sight. Next, a throb of pressure in the guts—not pain, exactly, but a sense of something wrong. After that, the hardcore waves would hit, running through our chests like a ripple of static. Our lungs would begin to quiver and squirm. The air would simply leave us, in a frittering whoosh, and our tissues and brain and our blood itself would let out a long black scream for oxygen.\n I braced myself, waiting for the attack to run its course. By the time it was over, Shah had fallen to the floor, twitching and drooling down his check shirt. I grabbed his arm and pulled him to his feet, knowing the real danger hadn’t yet come.\n “This way!”\n He ran in the wrong direction at first, trying to reach the stairs to the lower floors. I yanked him back, leading him past the elevator. Already, cracks had begun to lace the plaster, spilling chips and powder to the floor. The whole shaft hummed; I could hear it moaning like a tuba as soundwaves propagated past the lower floors. I pounded the button. I wasn’t surprised to get no response. The Medan police had found their way to the electrics.\n “Shah, stop.” He was still pulling for the staircase. I pointed at the nearby floor. A crack had zig-zagged out from one corner, following a scar-colored seam in the cement. “That was the first wave,” I told Shah. “In about five minutes, they’ll hit us again. We have exactly that long to get ourselves out of range, before this whole structure starts shaking like hammered glass.” I swung my pointing finger, along the crack, past the stairs. “We have no time to get down to the ground. But we can still try to go up to the roof.”\n Shah’s lips moved silently. Either he didn’t understand, or he thought I’d completely lost my mind.\n I had no time to argue. I dropped his arm and ran. The unfinished stairwell rose above, a twenty-foot column of empty space. Dust whirled down in spiral clouds, shaken loose by the sonic blast. A metal framework laced the walls, offering a scaffold for risers and steps that would never be installed. Rust and dirt gritted under my hand as I tested the strength of the nearest beam. It creaked, but the bolts held. It would make a serviceable ladder—for anyone crazy enough to dare the climb.\n “Up here.” Already poised on the lowest support, I squatted to peer at Shah through the door. “If we climb ten feet, we’ll be out of range. It’s only a couple of floors till we’re in the open. If we go that way,” I pointed down the other staircase, “we’ll be chased all the way by those sonic weapons. Right into the clubs of the police.”\n Shah stood where I’d left him, in the middle of the floor. The drones had begun to give out their warning whine. He reached out. That’s what I’ll always remember. At the last moment, Shah put out his hand. It was this image I held in my mind as the second attack hit and my vision blurred and everything around us began to break and fall.\n I leapt for a higher handhold. The stairwell moaned around me, an echo of the resonance pattern building outside. I scrambled for purchase, kicking my toes against the wall, remembering with dismay the dozens of chin-ups I’d been able to do as a younger man. A nail or bolt must have raked my arm. By the time I got halfway up the shaft, I was leaving crooked trails of blood on the wall.\n Adrenaline is a wonderful drug. Hearing the booming and cracking below, I groped for the next beam, then the next. Scrambling and heaving, muscles blazing, I dragged myself out of range of Colm’s weapons, crawling into that desolate stretch where the building stood open to the wind and stars. I clung like a baby to the nearest girder, holding fast to a structure that had begun to sway scarily with each gust. A shock of noise came from below, a pop and boom like a canon discharging. I was still trying to get a grip on the steel when the dust clouds began to circle and stir, a rumble of rotors climbed the dark, and Karen, guiding the company copter, plucked me away into the safety of the sky.\n 11\n The typical improvised explosive device is a load of cheap, often plastic explosives, triggered by spark and packed with shrapnel. Ordinary scrap metal, launched by the blast, can snip vital arteries and mangle limbs. For the enterprising terrorist, insurgent, or sadist, a disposable phone makes a handy trigger. But simple pressure plates are lower in cost, easy to construct, and a staple in the trade of dealing death.\n During the height of America’s oil wars, making such a bomb could cost somewhat less than buying a new video game system. The blast power ranged from an ineffective fizzle to a blow strong enough to flip an armored truck, launch an engine block onto a roof, or strip the face off a concrete building.\n This is the cruel technology that lies behind the strange fate of Abdul Shah.\n A subtle danger of an IED is the shock wave that ripples out from the blast. A surging front of compacted air, it slams the brain into the case of the skull, pops the ears with a drop in pressure, and hit its victims with a one-two punch, as a second wave of compressed air flows into the void left by the first. The result is a double-whammy blow to the head, a savage pulse of compression and expansion that rips through a brain at half the speed of a bullet, straining tissues, frothing blood, making the cerebrum swell like a sponge.\n This is the injury that flooded VA hospitals, thirty years ago, with a homecoming army of zombie soldiers. Men who were whole in body and sound of limb, but who frightened their families and puzzled their government by exhibiting bizarre swings in mood. Amnesia, personality changes, confusion: the symptoms tended to worsen with time. Blast Disease, the veterans call it in our day. A steady loss of mental function, atrophying limbs, crushing depression. Even, yes, hallucinations. A slow-acting epidemic that has soldiers Abdul Shah’s age committing suicide in droves.\n All this I learned in a late-night search through the history pages. Shah learned it, too, when he got his disability discharge, thirty years ago, and came home from the wind-whipped plateaus of central Asia. The army hospitals were too full to hold him. The homeland doctors had no idea how to treat him. His friends and family couldn’t understand why he seemed so lost within himself, so changed. Why did Shah ignore their questions, even their loving gestures, in favor of a strange and brooding obsession that he’d brought back with him from the Persian Plateau?\n He drifted west for a while, lured by the solitude of the American heartland, then wandered south to the Mexican border. Eventually, he found himself holed up in a cove to the south of St. Thomas, half a mile from the tourist traps of Charlotte Amalie, shielded by a forested ridge from the Norwegian boats and the bright town lights. Nothing lay ahead of him but the waters of East Gregerie Channel, a view past Cowell Point to the open sea. It was there, known and tolerated as a local eccentric, in a nylon tent rigged to the salt-whitened trees, that Abdul Shah begun to hunt within himself for the secret knowledge he had brought back from war.\n It was memory that sustained him, in those lonely years. The army doctors told him that the blast of the bomb had left a galaxy of bubbles fermenting in his brain. A rush of merciless pressure, a void of near-vacuum: these arcane forces had whipped Shah’s mind like cream, inciting a kind of decompression of the soul.\n Tiny bubbles . . . Shah pictured them sometimes, twinkling up from a place deep within him, effervescing into his conscious thoughts. They reminded him of memory, those bright seeds of death—the way stray moments can wink, evanescent, out of the gulf of the long-forgotten past. Sensory impressions: the texture of old wallpaper; the hard, clear odor of a sidewalk after rain. Images came to him unbidden, isolated, as he lay on the stones of his tropical beach. Sprinklers jetting in a city park, concrete pillars spitting bright falling water, his mother’s finger tracing arcs of liquid as she spoke the Arabic word for attraction. Gravity, magnetism, desire: the modern magic of unseen fields. And more: the green faces of children submersed in a city pool, hair storming in black licks around their cheeks; the sweet, dusty smell of a hardware store. Often Shah thought of the religious billboard that had loomed over the highway near his Brooklyn home, lurid with the painted gods of the Christians: a kneeling woman, a bearded man whom Shah, as a child, had mistaken for Santa Claus. And in the straw between them, a glowing, golden child.\n “We are the true Americans,” his mother told him once. “We came here, traveled here, chose to be here. That is the only true American: someone who claims this country as home.” Abdul had looked at his small hands and thought, I came here, yes. But where am I from?\n The memories—they were neither happy nor sad. They gripped him, however, because they were true. Time had sharpened their truth and confirmed their worth. As he sat on that Caribbean beach, watching the giant cruise ships travel past Sprat Point, the sights and sensations of Shah’s present life took on, themselves, the glamour of the past. The whining, bobbing progress of motorboats in the strait. The thump and rustle of startled iguanas leaping out of the shoreline pines. By day, Shah tramped among the island’s weedy ruins, British embrasures, abandoned World War II barracks, the fast-rotting detritus of a failed tourist center. Sometimes kids still kayaked out from the port, hiding with their beers and designer drugs in the fallen estates on the eastern shore; at night he heard their monkey-like cries whooping through the sea grape and the wooded heights. Civilization lay all around him, yet he felt himself as blessedly alone as a man alive in the last days of the earth. And in this state of strange and deepening joy, Shah thought about the desert road where he had nearly lost his life—and began to reconstruct, slowly and painfully, the vision he had been granted there.\n The bomb that wounded Abdul Shah was fashioned, records indicate, of one hundred-and-fifty-six pounds of PE-4 wired to a British garage-door opener, packed with propane tanks into a trash disposal unit. It detonated five feet to the left of the driver of Shah’s Humvee, shearing away two-fifths of the vehicle, killing three of the four passengers, flipping the chunk of metal that remained into a roadside drainage culvert.\n When Shah woke two days later, in the field hospital at Kandahar Air Field, groggy from blood loss, bandaged around the head, he found himself in a drafty compartment of a building rigged from cheap wood and old shipping containers. By that time he was already beginning to forget the details of the remote and peculiar place to which the near-fatal blast had delivered him. But in the silence of his tropical retreat, in the hermitage he fastened for himself, years later, out of twenty square yards of nylon tenting—incredibly, impossibly—it came back.\n An iconic image was his first recollection. A dark tunnel, a light at the end. Most dying people see nothing more. But Shah went further. He crossed the tunnel, reached the light. And he pushed his way—or perhaps he was forced—out of the confines of our world.\n His first thought was that the smoke from the bomb had enveloped him. Black smoke, oily, heavy and opaque. A moment’s observation convinced him, however, that the blackness around him was structured and firm. A kind of frozen darkness constituted the huge walls rising on every side, as well as the roof high over his head—a slick, greasy material that Shah would later compare to volcanic glass. Fashioned into thick columns, this substance stretched into the emptiness above, supporting a vaulted ceiling as remote as a stormy sky. The scale of the construction was cosmic, absurd, like a cathedral molded from the matter of dead suns. Striving later to describe what he had seen, Shah could find no analog, no explanation—save to say that this was nothing human beings had created.\n Lifting his head, he saw that his body itself was other than human—a form unrecognizable, even slightly insubstantial. Yet these words, Shah insisted—sight, head, body—were approximations to what he perceived. He “saw” nothing, “felt” nothing, but knew where he was, with the disembodied knowledge that arrives in dreams. And in this same manner, through this same strange clairvoyance, Shah realized that he was not alone.\n They lay all around him, thousands, perhaps millions of figures, reposing, prone, in the infinite dark. No shroud covered them, no sound disturbed their sleep. Shah surmised that they were neither dreaming nor awake, but resting in a state much richer than consciousness, more lucid than the unreal figments of dreams.\n A voice spoke, or a mind touched his (again, Shah struggled to find the proper words). He sensed a presence communing with him, both distant and near, like a monster beneath his bed.\n Be still. (But it was not a voice, Shah insisted, so much as an extension of that dreamlike understanding.) You have slipped through the barrier, but you will soon return.\n Where am I? Shah tried to speak. But speech, motion, even ordinary thought, all were impossible in that strange place. He could only think, with a speech-like force: What am I?\n If the voice had been capable of laughter, its mirth would have echoed endlessly in the recesses of that measureless space. You were visited. Now, for a moment, you have become the visitor. The currents that carried you here will soon reverse, and you will remember nothing of this place.\n Currents?\n You lie in the company of the last sleepers, at the end of time.\n As he heard those words (or received into himself, like a jolt of air, the knowledge implicit in those words), Shah understood . . . but it was rather as if he had begun to remember something he had always known.\n He had come to the edge of existence, the end of all worlds. A trick of time had delivered him here, to a place where the last living beings rested, the dwindling population of a dying universe. In this latter day, suns and galaxies had dissolved, the bonds of existence had grown dim. What Shah saw was a failing illusion, a shadowplay cast on a thinning screen. Soon, even this frail fabric would decay, and the life of the cosmos would come to its close. No civilizations would again be built, no new worlds or suns would reappear. But in this dying instant, this final tick of time, the beings around him practiced a last art. They had learned to return to what had come before, and to revisit the things that had been.\n Even as he learned this, Shah felt a pressure, as if the strange tide that had cast him here were now reversing, dragging him back to his old life. He struggled to move, sensing a different mind, one alien and strong, already striving to reclaim his body. Forcing himself to rise, Shah gained a last glimpse of the great vault in which those countless beings, faint and softly pale, lay like dreamers in a night with no dawn.\n They are revisiting the lives, said the voice, that have passed away, and remembering the moments of former ages. No future lies before them. The past cannot be changed. But they have this: the power to return to what was lost. Through the souls and bodies of those who lived before, they relive, a final time, what will never be again.\n Show me. Shah made his demand in desperation, even as the pressure grew on his mind, even as his spirit twisted and writhed like water above a drain. Show me what they see.\n Again, the voice laughed with a strength beyond sound. Very well. You will soon forget. But if you wish, you may visit with us, this one time—\n 12\n And here Shah’s story ended, in a burst of deadly sound.\n He told me all this in the empty room of his tower, in that brief respite between the charge of the police and the final assault of the sonic cannons. I believe he spoke for ten minutes at most, lingering on the smallest details. His leisurely manner, his painstaking account, maddened and baffled me at the time. But I don’t believe, now, he ever hoped to convince me. Only to convey, somehow, what it meant, what he had been trying to track or rediscover, in the course of his lonely and drifting life.\n The sun is rising, Carter, making gleams on the hotel towers. From the rooftop bistros along the river, I can hear the tinkle of coffee cups. I’ve talked into this recorder through the night, half hallucinating, half in a trance, sometimes reading the scraps of disjointed journals I wrote in a post-traumatic haze. I hope your transcribers and redactors can make something out of this marathon ramble. I tried, God knows. I tried to tell the truth.\n And why, I wonder. Why share this with you? Why tell this story to the man who has always hated me, always fought me, always sought to ruin me?\n Because you asked for it, I suppose. Because you were there for my first wife and my last, and for all the mistakes and lovers in between. Because you were with me in those days on the fifty-seventh floor, when we fought like two driven single men for the fortune and glory we thought we deserved. Because you know me, Carter, who I am and who I was, and you’re probably the only son of a bitch who does.\n Shah reached out. That’s the part that haunts me. He put out his hand, before the last blast hit, before the ground turned to dust beneath his feet. Even as he sank through his dissolving tower, through the crumbling ruins and the rising clouds, he kept his hand out, fingers curled, as if to take hold of something I couldn’t see.\n It was a violent wave of sound, tearing through Shah’s head on a desert road, that gave him the vision that changed his life. In later years, he studied the physics of sensation, the tangled mechanics of the human brain. Maybe, at the end, with new shockwaves in his skull, Shah found a way back to that world, the dreamers lying at the end of time. Maybe they showed it to him again, the vision he never had a chance to describe. It could be that in the last instant of his life, Shah reached for the hands of Egyptian priests, or the startled eyes of a prehistoric child. Or he may have visited you, or me, in forgotten moments of our idealistic past. Perhaps he looked into the void between the stars, and before he died, he watched suns rising over alien worlds you and I can never imagine.\n Quite probably, it all means nothing. Abdul Shah had a brain that by his own admission was full of holes. Men and women with his injuries are lying in the Walter Reed psych wards, now, hiding under their hospital beds from memories of historic wars.\n But I remember those six strange hours, the throb of soundwaves through my mind, and the visitation I nearly received. I remember other stray moments of my life, when a weird vibration passed through me, a second soul seemed to clasp my own, as if I had been possessed, invaded, by a presence greater than myself.\n I remember this:\n A day, years ago, when my first wife and I moved to a new home. We came east, leaving the desiccated outskirts of Phoenix for the humid greenery of the Georgia suburbs. No squatter camps troubled my thoughts back then, no sonic weapons, no impact assessments. I had recently accepted my position at Aerux. I was looking forward to starting my career.\n We were still settling in, when on a certain morning, we found we couldn’t stop our daughter from crying. She was only a baby, less than half a year old, and we held her, fed her, rocked her, soothed her, carried her on a weary circuit through the house. We ran in an hour through the usual cures, the breast, the diaper, the temperature, the light. But with her little fists, she fought free of our caresses, rolling in our arms, reaching, like a fierce little inchworm, for the windows and the world outside.\n I gave in. I took her outdoors. A spring rain had begun to fall, dripping from the roof of our tumbledown veranda, and I saw that her eyes were tracking every drop. I marched into the yard, the rain drizzling on us both, gentle and cool, a prickling presence on my skin. In the open, with my wife yelling at me from the door, I looked into my daughter’s eyes.\n What are they thinking, our little ones? We look into their faces, but we can’t know what they see, what they understand with their bright new minds. My daughter’s mouth hung open. At five months, she was already full of memory. We had come from a land of dry earth and empty skies, and I realized she had never seen the rain.\n Maybe I’m a fool. Maybe Abdul Shah duped me, as he seduced so many other lost souls. But I know this: that a full ten minutes passed, on that long-ago day, in which my daughter scarcely moved or breathed, but lay with reverent stillness in my arms, watching water fall from the sky. I could have sworn at the time, and I would still swear now, that something came to visit us then, hovering behind her eyes. I felt so joyous I was afraid. She lowered her eyes and looked into my mine, and an awesome intelligence stared into me, full of wonder and longing and a strange, vast regret. It was as if my daughter understood, not only sensations I had forgotten, but ones I hadn’t yet begun to feel. As if she knew, even in that early stage of life, that she was seeing all things for the first and last time.\n *****end transcript*****"}