{"fingerprint": "BlEZLpYnxJ8o5Iptxl8mQJfNKi8=", "sitename": "Clarkesworld Magazine", "title": "Streams and Mountains by Nick Wolven", "author": "Nick Wolven", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wolven_05_17/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Streams and Mountains by Nick Wolven", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8860 words, novelette\n Streams and Mountains\n Man discovers fire. Man discovers philosophy. Man discovers boredom.\n What is it about the squatting position, Mary Ellund wondered, looking down at Paul’s bent back, that calls to mind contemplative pursuits?\n The breeze picked up, the forest shivered. A thatch of red cedar boughs, two hundred feet above, shook down droplets on her head. Mary pulled up her field hat and tugged the drawstrings tight under her chin. Staggering down the uneven trail, she had to catch at nearby tree trunks to keep from falling in the mud. The Cascade Mountains were wet this time of year, as they were most times of year, with the exception of the punishing summer droughts. A dewy coolness hung in the air. The earth was plush with moss. Both Mary and the young scientist below her were black to the shins with mud.\n “Yup,” said Paul, squatting in the muck. And then, in what Mary had noticed was a tic for him, “Yuh-up.” His finger traced an oblong impression in the ground. “Very cool.”\n Paul was a nice kid, a brilliant kid. But he had the maddening daftness of a brainy boy. Mary stood above him, trying to see what he saw. Paul shifted on his haunches, poking at the turf. Like a caveman on the verge of a prehistoric eureka, she thought. Wheels and fire. Language and religion.\n “Are we close?” Mary wiped her neck, wondering how it was possible to sweat so much in such chill weather.\n Paul squinted, blinked three times, and traced the oblong shape again.\n “Here’s where the heel went in. See the pressure ridge? That’s what we call a mid-tarsal break. Means the foot flexes more than a human foot. And the toe. You can see how it curled, gripped.” He blinked again. “That’s a really wonderful big toe.”\n Paul Yu, he’d told her, smiling at the rhyme, was from Wisconsin U. He was a top biologist from what had become the country’s top biology school. But he wasn’t a terribly good explainer.\n Mary squatted to study the footprint. She saw a single cuplike depression, filled with brown water, a few floating, spinning blades of grass. If not for Paul, she’d never have known it was a footprint, much less the notorious footprint they were seeking.\n “Can you date it? I mean, can you tell when it was made?”\n “Oh, yuh-up.” Paul, as usual, answered a slightly different question than the one she’d asked. “They’re around here. Definitely. Somewhere nearby.”\n It was then Mary felt it. Like an intake of breath, a gathering of attention.\n Paul squatted on his heels below her, very still, looking down the trail to the far side of the valley. When Mary moved to stand, he twitched a finger. She crouched in the moss, half obscured by a spray of ferns.\n And saw them.\n Four creatures stood on the far side of the gully. One male, three females. Even at a distance, Mary identified the sexes, though at this remove the animals made no sound. They browsed a stand of huckleberries high up the northern slope, in a shadowed band where firs grew thick and the hush of the rain seemed to gather like a shroud. The male—oh, but he was a beautiful specimen, wonderfully tall, furred with brown across his massive chest. Mary reflected with a girlish joy that his movements, though slow, even ponderous, had a dignity in life they would not have had on film.\n “They’re so—” she began, and wondered what to say next. Strange? Solid? Real? But she noticed Paul staring.\n Right. Mary reached for her belt. She felt terribly exposed, squatting on the trail, but it would be dangerously conspicuous to dart for cover. She forced herself to move with a hunter’s patience as she touched the device that hung at her hip.\n Her thumb fumbled plastic and steel. The creatures continued their foraging, eating with the loose-lipped gusto of gorillas, stuffing whole branches into their mouths and pulling out denuded sticks. Even as Mary’s mind overflowed with adjectives—so stately! so exotic! so sad!—she felt the button under her thumb and pushed it down.\n The click of the shutter seemed to crack through the forest, loud as a falling stone. The little band across the valley never noticed. They went on with their meal as Mary’s recorder whirred. Mary could hear the shutter working, the device zooming in and out. Tiny lenses ticked like an optometrist’s phoropter.\n There was no need for her to move, to take aim, to disrupt in any way the sublime unreality of the moment. Once activated, the recorder was automatic.\n Mary let her soul settle into a state of rich receptivity. Neolithic men must have felt this way, she thought, as they stalked their game through archaic forests. Now only scientists were quite so observant.\n She felt as if a book had closed, a curtain fallen, when Paul whispered, “Do you have enough?”\n “Yes.” Mary straightened, knees cracking. At her movement, the creatures turned. By the time she stood erect, they had disappeared, vanishing over the ridgetop into the wild.\n In camp, Ken and Malia were setting out lunch, stuffing packets of soup into the porto-heater, propping up camping chairs amid rain-sodden ferns. They paused in their work, waiting, as Mary and Paul came down the trail, Mary cradling the recorder like a relic at her chest.\n “Well?” Ken had the look he’d been wearing all morning, the tightlipped pout of a man who expected to be enraged.\n Mary brought the recorder to her tablet, propped on a cooler by the tent. Within three feet, the devices synched, began a transfer. “We saw them.”\n “You did. And?”\n Mary turned to Ken. In spite of herself, she liked what she saw: lean hiker’s body, clad in denim and plaid, sacks of miso soup clutched in each strong fist. Whatever else you might say of him, Ken Takamura was a striking man.\n “And,” she said with a sigh, “the reports are true. Actually, it’s worse than we feared.”\n Ken cursed. He was twenty years Mary’s junior, unknown to her till this week, but he turned his back like a father disappointed in his child. At a motion of his hand, a sack of soup slopped into a bowl. Ken smacked the porto-heater shut. With a thrust of his chin he indicated Mary’s recorder.\n “You have pictures?”\n Mary lowered her eyes. All the fantasy and joy of the morning, the delight of their discovery on the trail, drizzled away into the muck underfoot.\n “Follow me.”\n With their instant meals warmed and devoured, the soda cans drained, trash carefully cached, coffee perked and the creamer supplied, Mary led everyone into the tent.\n The drizzle of the mountains had built to a squall, one of those rattling gusts that swept the valleys, shaking reservoirs of rain from the cedars, setting the ferns to frenzied kowtowing.\n Most of the tent was taken up with a table, lightweight and collapsible, scattered with papers. Mary set up her equipment, plugged the recorder into the tablet, the tablet into the printer, the printer into the power source. She slipped in a gravure. The system puffed as it went to work.\n “I took a look at the digitals back on the trail. I think we should all take some time to talk this over. Going by what Paul and I saw, we need to be absolutely sure we get this right.”\n Their faces, gray in the rainy light, were grim. Like hospital visitors, Mary thought, wishing away bad news. She shifted behind her equipment, defensive.\n “You really think this is necessary?” Ken crossed his arms. “This little dog and pony show? You don’t want to get back to D.C.?”\n Ken, Mary thought, Ken is the difficult one. On every field investigation, she’d dealt with a person like this. People—especially people who worked for the government—bristled at the presence of D.C. bureaucrats nosing around their turf. Plenty of folks disapproved of her very line of work.\n Mary took the first gravure from the printer, held it up for all to see. “I’ll tell you what we’re going to do. We’ll review this as a group. We’ll discuss it as a group. I want to hear what everyone has to say.”\n The picture made its way around the table. Mary knew the research on human attention: people spend more time with printed media. She always marveled when she saw the effect in person. How people linger on a physical printout, turn it over, even stroke it—all quite different from the skimming and skipping with which humans greet digital documents. Hence Mary’s use of gravures in her work. They felt important, weighty, real.\n “That’s a picture of the youngest female,” Mary said. “I don’t think you’ll need a medical degree to see what’s happening.”\n Even Paul spent time with the gravure, blinking as he held it at arm’s length. He’d been at Mary’s side, living the moment, inhaling its strangeness, its truth. But he needed this picture, in some primitive way, to convince him it was credible.\n “We’re sure this is verifiable? Not a hoax?” Malia frowned as she passed the picture to Ken. Malia worked with Mary at the Executive Bioethics Agency, in offices formerly part of the EPA. A law school whiz who’d switched to regulation, she’d made a wise choice. Biotech was booming. And with it, biohazards.\n Size brought bureaucracy. Malia’s title at the agency was Acting Relations Manager. What that meant, Mary had no idea. Some unholy hybrid, she gathered, of a DC lawyer and a PR flack.\n “What kind of hoax do you think it would be, Malia?”\n “A prosthesis? A publicity stunt? A group of protesters who snuck into the park? So far, we only have photodocumentation. We could be dealing with nothing but a woman in a suit.”\n “I spent ten years as an OB/GYN.” Mary cocked an eyebrow. “I’ve seen fake pregnancies. That’s no prosthesis.”\n “It’s definitely not a woman in a suit.” Paul tapped the gravure. “Not with this gait.”\n “Maybe it’s an outside specimen,” Malia persisted. “Something introduced from outside the park.”\n Mary spread her hands. “Ken? Thoughts?”\n “I can tell you this.” The forest ranger reached for a pocket. “Whatever happened, it happened inside the boundary.” Ken pulled out an image of his own, what the foresters called a snap-map. A cube the size of his fist, it unfolded to show data-rich views of the North Cascades National Park.\n “We maintain seven perimeters, automatically patrolled.” Ken traced ragged lines on the map. “One along the boundary, including the national border. Five areas within that. This one has everything west of Ross Lake. There’s a special zone, just for the range of the—” He hesitated. “The creatures. Anything crossing those borders gets noticed, logged, reported. I mean anything. These are microcams. Pollen-sized. We don’t install them, we dump them. Like, from planes. We’re talking millions of eyes. Comprehensive surveillance.”\n “Artificial eyes,” Malia said.\n Ken’s jaw jutted. “We have seventy-two federal rangers working for the protection of these animals. If you’re implying that they aren’t doing their jobs—”\n Malia showed her palms.\n “Look.” Ken hit the snap-map, zooming in on their current location, a CGI icon of their base camp. “The Parks Service didn’t want to take these critters in. It was your report, ten years ago, that got the president’s ear, set up this preserve. I was opposed to it then. I’m opposed to it now. But I’ve done my job. All my people have done their jobs. We’ve kept a watch on these things. We’ve kept them safe.” He folded his arms. “No protesters in our woods. No pranksters, no hoaxers. Whatever happened here, it’s not our fault.”\n Mary could see this man was going to try her patience. But there were plenty of people out there like him. They couldn’t be ignored.\n “All right, Ken. No one’s laying blame. We’re trying to figure out how this could have happened.”\n “You’d better get rolling.” Ken slapped the picture to the table, scooted it back. “From the look of things, the situation’s about to undergo”—he raised his eyebrows—“a rather drastic change.”\n Mary caught the gravure with a slapping hand. Face down, it showed nothing, white plastic, a blank. She sighed.\n Here they sat, park ranger, state biologist, two suits from the Federal Triangle. Four pros, four bureaucratic boffins, doing their jobs.\n But what they concluded, in this little tent, would ramify through news shows, tabloids, journals, would bleed, click by click, into the gossip of the globe. Would become one of those key events, shocking, historic, never fully understood, that shift the trendlines of biology, politics, ethics.\n She flipped the picture. A hairy figure, six-and-a-half feet tall, half concealed by berry bushes, peeped from the print. So stately in life, it looked humped, ungainly, here, caught midstep—and grossly unbalanced by the pale-furred swell below its dark-tipped breasts.\n The face. It was wrong, Mary thought, it was a monstrous. Like a joke played on the last million years of evolution.\n “Let’s start with the obvious.” Mary loaded the gravure back into the printer, wiped it, lifted her eyes, confronted those three solemn faces. “We have a pregnant sasquatch on our hands.”\n 2\n Weather is destiny, Mary thought. Weather is history, weather is psychology, weather is the past and the future.\n Then: Stop it, she chided herself. Don’t get mystical. Clear head, clear sight. That’s the way to get through this.\n Mary ducked under the overhang, outside the tent where they’d been at it for hours, hunched over the plastic table. Checking pictures, checking possibilities. Despite all this effort, they’d made little progress. They’d reached nothing remotely close to an agreement.\n Mary blinked in a blast of rain. Running her OB/GYN practice, years ago, she’d learned to deal with people in denial. Some denied they were pregnant. Some denied they were infertile. She knew the loopy feelings that the subject of reproduction stimulates, how arguments go in circles, how people get stuck. Even scientists.\n They were in danger of that now, badgering each other over side issues, shying clear of the key, deep questions. Mary needed a break. So she stood out here, with her coffee and thoughts, waxing mystical in the rain.\n Forested slopes rose above, culminating the bluish peak of Liumchen Mountain. Beyond was the Canadian border. Not much to see from here, only green and mist drifting up, the valley receding into a conquering grayness.\n It was a somber country. Drizzled, dim, and softly, sadly charming. Mary saw why so many poets had prowled for inspiration in these valleys, summered as firewatches on the stony heights. One hundred years ago, Jack Kerouac, zany Quebecois quester, had tramped the stark snows of Desolation Peak, dreaming of Dharma bums.\n They’d all believed in going back to the land, back then. They’d believed in mind-busting drugs and clear spring water and the cleansing effects of public nudity. What to call it, really, but a high-minded retreat into primitivism?\n Mary sipped coffee. Farther up, further north, lay the Fraser River Valley, the deep strange country of Harrison Lake. That was where it had started: the Bigfoot myth. In British Columbia, the Indian Agent J.W. Burns had collected tales from Native Americans. Salish inhabitants had told him of hairy wild folk prowling the Port Douglas hills. Sásq’ets, in the native tongue, meant “benign-faced one.” Or, according to a different source: “clam-eater.”\n Mary had loved it all as a kid. Not Bigfoot, exactly, not the beast itself. She loved the woods, the mystery, the vision of dark northern forests full of secrets. It had all seemed credible when she was a girl, with life a steady succession of discoveries. Even the land on which she stood hadn’t been mapped until 1989, a mere eleven years before she was born.\n “Mary.”\n She jumped, slopping coffee. Ken must have tiptoed out of the tent. A big man, well over six feet, he glared with a kind of possessiveness at the woods. The rain had increased, bringing on an early evening. Soon darkness, not mist, would hide these hills from sight.\n “You just about done out here?”\n Mary mopped spilled coffee. “Sorry. Needed to catch my breath. This is getting exhausting.”\n “You can’t waste time,” Ken said. “You need to decide what to do.”\n Mary let the moment lengthen, watching rain shimmer down the hills.\n “It must be nice,” she said after a moment. “Living here.” She considered Ken’s casual attire, lumberjack shirt and pants. For the assignment, he’d shucked his ranger’s uniform, adopted this everyman outfit. Rather like a plainclothes cop, she thought, working undercover on a delicate case. “Are you from this area?”\n “Nope.” Ken’s mouth was a line. “From Kyoto. Family came over when I was ten. To the States, I mean. We settled in San Francisco.” He held out a hand, caught a palmful of rain. “I didn’t come to Washington till after college. Always wanted to be a forest ranger.”\n “For the solitude,” Mary guessed.\n Ken glanced at her with narrowed eyes. “For the work.” He sniffed. “I’m not a nature buff. You know, we have slugs up here ten inches long? If it’s not snowing, it’s raining. If it’s not raining, something’s burning. But someone’s got to stand guard—over the forests.” He laid a hand on a nearby cedar. “Do you know why Japan is one of the world’s great powers? It’s a small island country. It’s remote. Little mineral wealth, scant fossil fuels. It’s got a unique culture, but that’s not the main reason.” He looked at Mary silently, enjoying her suspense. “Our forests. That’s why we’re still going strong. We always looked after our forests. You protect your forests, you protect everything. Soil, freshwater, flora, and fauna.”\n “I bet Gary Snyder would agree with you, there.”\n “Who?”\n Mary dumped out the last few drops of coffee, rinsed her travel mug in the rain. “A poet. American. He came to this place when he was young—to these mountains. Fell in love with the countryside. Wrote a lot of poems about it, dragged other writers out here. Later, he moved to Japan to become a Buddhist monk. He was one of those counterculture types, believed in getting back to our roots, returning to the wilderness. He believed it was a way to find transcendence.” She swished out her mug and slapped on the cap. “Ken, why do you think they did it?”\n The ranger scowled in puzzlement before realizing whom she meant. “Huh!” He shook his head. “Well, we know why they did it, don’t we?”\n “Do we? Do we understand them? Is there a way for us to really understand?”\n “You want to, what, read their minds? They’re sasquatches, Mary. Apes. Dumb brutes. They don’t have minds. Isn’t that the whole point?”\n “I suppose you’re right.” She turned back to the tent. “It just seems . . . ”\n Ken raised his eyebrows as she trailed off, holding up the tent flap for her to duck inside.\n “It seems,” Mary said, “like such a shame.”\n Inside the tent, the air had gone dark green. It was five PM, coming on sunset. They’d already wasted most of the day.\n “Well,” said Mary, going to the head of the table, “we’ve been at this long enough. What have we learned?”\n Malia had covered her workspace with gravures, printed versions of federal documents. “We’re making progress.” She licked a thumb, rubbed at a stain. “Ken IDed the sasquatches we saw, all four of them. I talked to folks in Archives. They pulled some records for us. We’ve got a bio on your subject, Mary.”\n “Great.” Mary cleared a space for her coffee mug. “Who is she?”\n “I think you mean,” Ken said, “who was she.”\n Malia sniffed at the correction, hunched over her keyboard. “Our pregnant sasquatch is Miranda Watson. Caucasian, female at birth, thirty-three years old. That’s her total age, including the human part of her lifespan. It’s been seven years, now, since she devolved. She was born in Madison, Wisconsin. A fellow cheesehead, Paul.”\n “I only went to school in Wisconsin.” Paul didn’t look up from his tablet. “I’m not from there.”\n “Looks like a typical suburban childhood,” Malia read on. “You know the story.” She looked around the table, shrugging. “Restless. Discontent. Miranda started showing interest in devolution in her teens. Her parents took her when she was seventeen to see the last living gorilla. A kind of pilgrimage. A life-changing event. The gorilla died shortly after. Miranda was hysterical. Aggressive therapy, behind in school.”\n Malia flicked a finger, scrolling through text. “Then Miranda hits twenty. A critical period. It was at this time her fascination became—well, I guess you’d call it a full-blown obsession.”\n “Silly term.” Paul sniffed at his tablet. “Devolution. So inaccurate.”\n Mary poured her fourth cup of coffee. “What kind of psychological profile are we looking at?”\n Paul frowned. “Shouldn’t we be focusing on physiology?”\n “We’ll get to the physiology.” Mary gestured with her mug. “Malia?”\n “Psychology? Well, it’s about what you’d expect.” Malia picked up a gravure on which she’d made pink highlights. “Here’s Miranda Watson, as profiled by the experts. IQ of eighty-seven, tested at eight years old. Strong inclinations toward introversion and intuitive thinking.” Malia scanned with a finger. “She rejected the customs of modern life. Became rabidly anti-industry. We see frequent attempts to run away from home. As a kid, she had a fascination with so-called feral children. As a teen, she joined the Anti-Learning movement. You know, ‘education is indoctrination,’ all that stuff. Her favorite game is BC-Simple. Her favorite book is Ishmael, by Daniel Quinn.”\n “So a hippie, basically,” Ken said. “One hundred years too late.”\n “Yes, but why.” Mary drew a circle with her mug over the table. “Why all this fascination with primitivism?”\n Malia’s mouth tightened. “Primitivism. That’s kind of a loaded word, don’t you think?”\n Here we go. Mary pursed her lips. “The trouble is, there’s no word for this kind of thing that isn’t loaded. This girl chose to become something . . . something different, something other, something less than human. We need to know why.”\n The subsequent silence told Mary she’d misstepped. Malia was pouting at her gravure. “I’m not entirely comfortable with those words. Less than.”\n “Every animal is different,” Paul said.\n “These aren’t animals.” Ken, at the far end of the table, went rigid as wood. “These are human beings—silly, entitled human beings—who made a choice—”\n Mary held up a hand. Another minute of this, and they’d spend another three hours arguing.\n “Maybe it’s time for the physiology. Paul?”\n Paul, not a fan of gravures, set his tablet on his knees. “Well, it’s typical stuff. At nineteen, Miranda Watson joined the Neo-Paleos. That name’s a bit of a joke. It’s an international group. A few hundred thousand people, headquartered in Denver—”\n Mary milled her hand while sipping coffee. “I know who they are.”\n “OK. So you know they pool their donations. Only certain members qualify for the treatments. Watson got approved at twenty-two. She was flown to Malaysia to undergo—again, hate this word—her devolution.”\n “Do we know who did it? Doctor? Clinic? Company?”\n Paul shook his head. Mary had expected that. Devolution was illegal worldwide. But some governments turned a blind eye, didn’t keep records. Looking to balance good business with international approval.\n “It could have happened in Malaysia,” said Paul. “It could have happened in Thailand. It could have happened in Vietnam. Once you go to the Tiger states, all bets are off.”\n Mary nodded, disappointed but not surprised. Her work at the Bioethics Agency mostly focused on Americans flying east for surgery. Thousands of botched cosmetic cases came flooding back from South Asia every year. The Indian Ocean suffered from a scourge of black-market butchers. Tasked with untangling indemnities, the Executive Bioethics Agency had ballooned to rival the NIH.\n “What we can do,” Paul said, “is reconstruct the process.” He pulled out an image of a sasquatch, an anatomical diagram. “So far, seventeen people have gotten this so-called Bigfoot treatment. Voluntary devolution. All Americans. There are three phases.”\n Paul tapped his shoulder. “First, musculoskeletal. Stature is increased. That’s done with bone implants. The muscles are built up with stimulated growth—electric, hormonal. They have a microsurgery unit go in and strengthen the anchorage points, ligaments, attachments. Hips and feet get altered, to create what’s called a compliant gait. And so on.”\n Paul flicked at the image, accessing a second layer of the file. This showed an internal view, guts and bones.\n “Second, visceral. Digestive tract has to be tweaked, to handle the rough diet. The heart gets a boost from a modulator—like a pacemaker, but smarter. That’s standard treatment for athletes, too. Then skin. It’s not difficult to stimulate this condition, hirsuteness. You know: the hairiness. It amounts to a simple genetic treatment.”\n “That’s not the issue,” Mary said.\n “The issue . . . ” Paul put all ten fingers to his scalp, as if to pluck his brain from his skull and set it aside. “The issue is this. The brain. What do you do about the brain? If you want to be a sasquatch, you have to think like a sasquatch. You have to live like one.”\n The others nodded, mulling over the implications.\n Paul put aside his tablet. “So. The science here gets a little hairy—er, so to speak. There are a lot of different ways to alter the mind, as anyone who takes antidepressants can tell you. But most of these treatments use the same technique. Engineered bacteria.” He tapped his scalp. “Inject them into the cerebral tissue. A few key segments are targeted. Wernicke’s area, Broca’s area, regions of the prefrontal cortex. Transcranial pulses guide the bacteria along pathways mapped in advance. They eat the synaptic connections. Almost literally, they rot the brain. That’s a rough description, of course, but you get the idea. When the damage is done, antibiotics eliminate the infection. NGF treatments build up compensatory areas—olfactory, sensorimotor, lower-order functions. To a limited extent—a very limited extent—you can mold the brain, eliminating advanced faculties in favor of—here’s another silly word—instincts. No more speech. No more abstract reasoning.”\n “Self-mutilation,” Ken said.\n Malia drummed pink nails on the table. “I think it’s sort of beautiful, actually.”\n “We’re not here to debate aesthetics,” Mary said.\n “How can you not admire them, though. Just a little bit?” Malia’s eyes grew dreamy. “The bravery to do that, to change your mind, to purify your soul? It’s heroic, in a way.”\n “These are kids,” Ken frowned. “Kids who made a terrible mistake. Who have done a terrible thing to themselves. Who, even before they did that thing, had obvious mental problems.”\n “But it’s not hard to understand.” Malia’s eyes, under her hair extensions, lifted to one of the tent’s small windows. “Who hasn’t dreamed of being . . . well . . . innocent again?”\n Ken’s fingers twitched. Tendons stood out in his wrists. “They decided to inflict brain damage on themselves. That’s not innocent. That’s crazy.”\n “I wouldn’t call it brain damage.” Malia stared into the forest, where the light had faded from green to blue. “It’s not a handicap, really. They’re out there, living in the wild. Surviving. How many ordinary people can do that?”\n Ken’s neck pulsed. He looks like a wildman himself, Mary thought. A beast on the verge of losing control.\n “The reason these . . . these things are surviving out here,” Ken pressed with his fists until the table bent, “is because we protect them. We set aside the park. There used to be grizzlies in these mountains. No more. Now, instead of bears, we have these so-called sasquatches, living in the same ecological niche. They’re not a wild population. They’re kept alive by—” Emotion choked him. “By legal fictions, popular delusions, federal regulations. It’s not even a breeding population.”\n Mary coughed into her hand. “Isn’t it?”\n Malia stood, eyes on the window. She pushed back her chair, went around the table, rose onto her toes, and looked out at the forest, lifting a finger to the mosquito netting.\n Mary was perturbed by the young woman’s manner. “Malia?” she asked.\n “It’s not fair to call it self-mutilation.” Malia ignored Mary’s question, speaking softly as she stared into the woods. Her long extensions whispered like rain on her nylon shirt. “There’s no higher or lower in nature. Only tradeoffs. Right, Paul? Back me up.”\n Paul, sitting with his back to her, wrinkled his nose. “I don’t like these big-picture debates. I prefer to talk specifics.”\n “Malia,” Mary sighed, “will you sit down, please?”\n Malia lingered at the window, stroking the screen. “I keep thinking I see them. Walking through the trees.” Her eyes hovered over the dripping filigrees of the forest. “You can worry about specifics, Paul. You’re the biologist. I have to think big picture. Mary and I both do. When we go back and make our report, we’re going to face thousands of questions, probably a meeting with the president, maybe a Congressional hearing. And when news gets out, we’re going to have several billion people weighing in on what we decide.”\n Don’t I know it. Mary stretched over the table, reaching for Paul’s anatomical image. “That’s why we need to know exactly what we’re doing. Paul, thanks, but . . . when it comes to this devolution process, I was under the impression that a standard part . . . ”\n “Yes.” Paul cut her short. “I was getting to that. I know what you’re going to say.” He tapped his anatomical image, jabbing the diagram’s belly. “Sterilization is the final step. Chemical castration. A hysterectomy. Maybe ovarian and testicular replacements.” His nose twitched. “This is done for obvious reasons.”\n “And it’s done for males and females, right?”\n “Correct.”\n “So what’s going on?” Mary held up her hands. “These are easy procedures. Compared to cerebral modification, sterilization is absolutely trivial. One fertile sasquatch might be an oversight. But two? Out of a population of seventeen? One male, one female? This has to be deliberate. An agenda. And agendas leave traces.” She slid the printouts around with her palms. “We know who the mother is. I think we can make a good guess about the father.”\n “Yuh-up.” Paul bent to his tablet. “That male we saw, on the trail. Most likely subject.”\n “And with two subjects . . . ” Mary frowned, finger curled under her mouth, thinking. “Malia, get in touch with Archives again. Have them do a report on that male. Bio, psych, everything they have. I’m willing to bet, if we compare these two case studies, we’ll turn up something that—”\n A crack made them all look up. Ken was on his feet, hunched, fists jammed into the table. The plastic had split under the pressure of his hands.\n “Ken, what the hell?”\n “What are you doing, Mary?” The ranger’s voice was low. His neck had swelled like a wrestler’s. The carotid arteries throbbed against his collar. “I mean, really, what the hell are you doing here?”\n Mary ran her eyes down the buttons of Ken’s shirt. How would an animal perceive him, she wondered, this big male creature, puffed up with rage? How would the sasquatches see him, with their modified brains, their surgically adjusted senses? Would they be alarmed? Intrigued? Afraid?\n “Malia. Paul.” Mary snapped her fingers, pointing at the gadgets that littered the table. “Get in touch with Archives, track down that male. Ken?” She snapped again, pointing at the tent flap. “Outside.”\n In the evening, the rain had dwindled to a latent freshness in the air. The sky above the mountains was murky blue, thick as a cerulean liqueur. But night had already filled the black hollows between the trees.\n Mary touched the automatic zipper. With a robotic whirr, the tent’s square door sealed them out in the chill.\n “Ken, if there’s something you want to say to me—”\n He was already talking. “Let’s get this over with, Mary.”\n “Excuse me?”\n “Look, I’m sure it’s fun to play detective.” Ken paced the dry clearing under the overhang, a restless animal hemmed in by dripping water. “I know it’s great fun for you D.C. types to come out here and strut and pose. Very exciting. Very Hollywood. But we all know where this has to end up.”\n “I’m not sure I do, Ken. That’s why we need to discuss it.”\n “There’s only one way this can end.”\n Mary sipped from her travel mug, realized it was empty, and searched for a place to set it down. Finding no free surfaces, she dangled it at her side. Ken held out his palms.\n “Why did you even come here?”\n “You know why.” Mary sighed. “We received a report—several reports, actually, from local hikers. There were multiple sightings. We opened a file—”\n “And? We could have confirmed the sighting for you. The rangers. We could have done what had to be done. All this could have been over by now, neat and clean. Without this—this—” His fists shook. “This rigmarole.”\n Mary dropped her voice. “That’s not how it works, Ken. You know it. These are tricky issues. The ethics agency—”\n “Tricky issues? You’ve confirmed your sighting. And you’re still here, wasting my time. Still looking for ways to cover your ass.”\n Mary longed for a place to sit. She wished she could have this conversation in an office, an environment to lend her a little authority. Not out here, bickering, in the woods, like teenagers squabbling on a bad camping trip.\n “There’s more to a site visit, more to a confirmation of a sighting, than a few minutes of film, Ken. When I file my report—”\n “To hell with your report!” Ken’s finger indicated the tent. “There’s one thing that matters here. You insisted on protecting these creatures. Your people, your agency. You set up this preserve. You wanted to pander to the delusions of the American public. Oh, poor sasquatches, what charming creatures. And now you’re paying the price.” He pointed at Mary’s hip, where the recorder still hung clipped to her belt. “When that film gets out . . . you’ll see. You know where this is heading. There’s only one morally responsible action you can take. And you’re dreading it.”\n Mary hated to play bureaucrat. But she knew there was a definite power in the schoolmarmish air with which she drew back her shoulders, stiffened her spine, pursed her lips, like a strict teacher. “It’s a delicate situation, I agree. That’s why we’re taking this slowly. That’s why I want your input. Every comma I put in my report, every comment I make to my director, every bit of information we can uncover—”\n “Bullshit.” Ken turned away, swatting at the triangular tips of ferns that extended into the lamplight. “You know the truth. There’s no way, no way on Earth, those things can be allowed to give birth to a human child.”\n Mary settled back against the wall of the tent, almost resting her weight on the flimsy plastic, so tired, so eager to be done with this assignment, that she came quite near to giving in.\n Because Ken was right. Dreadfully right. Wasn’t he? The Bigfoot treatment, as it was commonly called, affected only the subject who received it. It was a skin-deep, muscle-deep, bone-deep, brain-deep treatment.\n But it was not germ-line deep.\n The treatment consisted of dozens of procedures. But none of those procedures affected a patient’s gametes. None touched the egg cells or sperm cells. Only a few affected a patient’s DNA.\n Meaning any child born to such a creature . . .\n The cruelty of it hit Mary like slap. Her cheeks warmed, her skin tingled. Nature could be so ruthless, so indifferent. And the same was true, in many ways, of modern science.\n From the body of that towering beast would emerge, in mere weeks, a naked infant, a human child. It would have a human body, human bones, human organs. It would shiver with a human’s hairless skin.\n It would have a human’s needs: for society, companionship, nurture, care, nutrition.\n And it would have a sasquatch for a mother.\n What would that mother try to do? Suckle the infant? Feed it leaves?\n Smack its brains out? Crush it by mistake? Leave it under a tree to die?\n Or worse?\n Mary shivered with a childish frustration. It wasn’t right. It wasn’t fair. It wasn’t ethical to steal away a mother’s child. Yet how cruel, how careless it would be to leave a naked infant to suffer and starve in the woods.\n Either way, it would amount to an infringement of human rights.\n But were they human, the sasquatches? They had been human, once. They had now chosen to be otherwise. Weren’t their former, human selves responsible for the consequences of that choice? And as for their current forms—were they animals, really? Were they subject to the treatment that animals receive? Or were they something other, something unclassifiable, something in-between? And if so, would that make it easier, what Mary had to do? Or harder?\n Had she been ignoring the obvious? Had all this discussion, this argument, this investigation, been nothing but a way to put off a cruel choice?\n “They brought this on themselves, Mary.” Ken spoke quietly, looking into the forest. “The kids who got the treatment. This is their fault. Not ours.”\n Mary stared into the deepening shadows where only a few sparkling raindrops caught the light. The afternoon’s downpour, sifting from the canopy, masked all movement and muffled all sound. Almost anything might be hiding out there, crouched in the bushes just outside their lamp. A bear, a wolverine, five meters away. With her human senses, dulled and abused by urban environments, Mary would never know.\n “You know what frustrates me?” Ken spoke into his collar. “The shifting standards. These people decided to rot their brains. They claimed it was their human right. Self-determination. Ownership of their bodies. Now that they’ve done it, the rest of society insists on granting them animal rights. You say they’re a protected species, rare, vulnerable, unique. You give them a nice forest to live in, plenty of berries to eat, a whole lot of prime real estate all to themselves. But it can’t work both ways, can it?”\n His face, when he turned, was full of childish frustration, a boyish insistence on having clear answers.\n “You can’t be both innocent and responsible.”\n Mary didn’t answer. Her mind was on the forest, the steady patter and shiver of the trees, the haunting noises that floated from the hills. It was like something out of folklore, the quivering secrecy of this place. A branch snapped like a tiny firecracker, and Mary’s brain filled with primitive fear. She trembled to visions of monsters, wild predators, stealthy shapes emerging from the shadows . . .\n Ken ignored the sound. “I said before that I’m not a nature buff. That’s not entirely true. I used to love nature. I used to love gorillas. I thought we’d be able to keep them alive. I used to love mammoths, Tasmanian tigers. I thought we’d be able to bring them back to life. I used to love abominable snowmen. Yes, and Bigfoot. I used to believe such things existed.” He shook his head. “I thought there was more out here than banana slugs and garden spiders. But we grow up, don’t we? We all have to grow up.”\n “Mary?”\n They both gasped at once. Paul’s head was sticking through the tent flap. The robotic zipper, sealed to his throat, gave him the appearance of a grotesque mounted trophy. “We’ve got a profile on that male you wanted.”\n “Thanks, Paul.”\n “I thought you’d want to know, we already compared the two bios. The male’s name is Andrew Jones. Turns out he devolved five years before Watson. A different era, in biotech time.”\n Mary was still trying to shake it off, the sense of responsibility that clung to her like mud. She backed toward the edge of the clearing, forcing herself to concentrate. “Were you able to pin down the clinic?”\n “Aha. Right. That’s the thing.” Paul squinted, adjusting his glasses by crinkling his nose. “See, it wasn’t a clinic. Malia’s been looking at the group’s financials. There’s a pattern. It works like this: they save up money for a year or so, then pay for a member to get the treatment. After each treatment, they do a big funding drive. And here’s the interesting part. After these two particular treatments, the ones for Watson and Jones—after these, the organization did huge funding drives. Massive. Really milking their supporters. Malia thinks they must have spent nine, ten times as much as usual. There’s only one nation that can suck that kind of money into secret biotech. China. And there’s only one service—”\n It was like a ghost story, suddenly coming true. It was like a Native American myth.\n Mary had been backing away across the clearing, putting space between herself and Paul’s face. She stepped, now, from beneath the tent’s overhang, out into the chilly trickle of the rain. Water pricked her scalp. Wet ferns slid against her hand.\n And, quite suddenly, Mary sensed it behind her, a heaviness, a presence, like a condensation of the forest into flesh.\n No hairy hand fell on Mary’s shoulder. No feral fangs sank into her neck. But she might have been approached by a predator, so swift was her reaction.\n Mary spun, throwing up her hands. And choked back what could easily have been a humiliating scream.\n The face looking down at her, lit to savage effect by the lamplight, was dark and hollow-cheeked, thickly whiskered, fringed in long, wispy hair that resembled the silky mane of an Afghan hound. Thin lips parted over large square teeth. The eyes, chocolate-dark, held two glaring reflections of the white lamp behind Mary’s head.\n It was the male. And as Mary turned to face him, he dipped his head in a bow. She may have been mistaken, she may have been overwhelmed. But it seemed to Mary there was real human dignity in the gesture—human poise, as well as animal grace.\n The male stepped aside. With a swing of his arm, a tilt of his shoulders, he introduced another sasquatch: the female, his mate. Miranda Watson, or the being that had been Miranda Watson, stepped into the clearing. Mary saw the shine of sweat on her skin. Her incisors glinted in a grimace of strain. The symptoms were unmistakable. Hands curled under her belly, fingers knitted in tawny fur.\n “Ken.” Mary stumbled backward, embarrassed to find herself succumbing to a primitive instinct, retreating to the side of the nearest human male. Looking up, she was surprised to see the park ranger calm, even resigned, his mouth relaxed into a frown of acceptance. It was as if he’d known these creatures were here all along, nearby, waiting for the right moment to approach.\n “Whoa.” Paul blinked. Bowing under the tent’s overhang, the sasquatches exhibited all the grandeur of their surgically modified muscles, their enhanced bones. Early news reports had mocked them as “living gorilla suits,” “real-life Chewbaccas,” and various other glib conceits. Mary saw, now, how unfair those stereotypes were. The sasquatches put to shame every shaggy Halloween costume. They exposed the falseness of the classic hoaxes—the famous Patterson film of the sixties, the later CGI stunts. They moved with the adroitness of unselfconscious creatures.\n “I had no idea.” Paul’s head, still thrust through the tent flap, bobbed boyishly as he took the creatures in. “Even this morning, I didn’t really . . . It’s hard to believe, isn’t it? It really is hard to believe.”\n But the sasquatches, standing before them, smelling of the forest, were entirely credible and defiantly real. The only thing that strained belief was the thought that they had once been human.\n “What do you think they want?” Paul squinted. Looking into his creased face, Mary almost laughed. A smart kid, yes, but so very young.\n “I think that’s obvious, Paul.” With a confidence and composure that made Mary marvel, Ken stepped past her and unzipped the tent.\n While Ken held up the flap, the sasquatches shambled in like obedient dogs. Every movement they made was its own uncanny event. They gestured like humans, but carried their shoulders like apes; they rocked and swayed and bent their knees. As someone with a background in biology, Mary had always scorned talk of “missing links,” knowing evolution to be more incremental than epochal. These animals embodied such outmoded assumptions. They met Mary’s eyes with the frankness of children. They perched between conceptual categories: half-human, half-intelligent, half-innocent, half-wild.\n “Let’s not waste time, here.” Ken collapsed the table, folding the legs under the plastic top. From his pack he unclipped a thin sleeping bag.\n The female was already into the late stage of labor. Her attention turned inward. Her breaths came in puffs. Hunched over and cramped by her intensifying contractions, she let the male guide her down to the unrolled sleeping bag. Mary had ceased to think now of these beings as Miranda Watson and Andrew Jones. But she believed she saw a lingering humanity, shaped by habit and history and time, in their smallest gestures—especially in their consideration for each other, the way they attended to mutual needs. Who knew what memories—of suburban driveways, of franchise restaurants, of screen doors and swingsets and summer-lawn sprinklers—were stored up in those shaggy heads?\n Memories of doctors. Memories of trust. Memories of medical men and women.\n The male pawed gently at Mary’s hand. His fingers were unnervingly human, the nails brown and bitten short.\n Mary rocked on her heels. “I don’t know. It’s been a long time since I did this. Frankly, it’s been years.”\n The female shrieked. Mary winced. This was a feral creature, with modified, inhuman hips; what chance did it have of birthing a human child? Yet, kneeling on the tent floor, Mary saw that the time for such doubts had passed. A dark shape bulged amid the brown fur. The baby’s head was already emerging.\n From here, Mary knew, routine would be her guide. She wiped at the condensation clinging to her brow. Habits from her years in Baltimore came back, the sweaty, profoundly absorbing, athletic skill of midwifery. Mary’s hands knew where to press, what to hold, when to yield. She saw at one point that she’d unconsciously rolled up her sleeves, unbuttoned her collar, tied back her hair; even these minor preparations were hardwired by years of busy labor. Rags and fire, knife and water: necessary tools found their way to her hands, offered by Ken and Malia and Paul—even by the male sasquatch, who had discovered, of all things, a quart of whiskey in Ken’s luggage. Mary smiled at the deftness of the creature’s dark hands, the care with which he cradled the bottle. Old habits, she supposed, old addictions, and old memories die hard.\n She washed her hands in bottled springwater, cleansed and sterilized the knife. She covered the ground with towels. In the end, after all her instinctive preparations, Mary found that she had little to do. With the pleasure of deeply remembered experience, she relived the euphoria of her residency years, the exhaustion and invigoration that blur into a trance of expertise, the giddy, driven seasons of her youth when she had watched her fingers stitch incisions, palpate abdomens, lift wriggling infants through Caesarean slits. The joy of work, of using her body, of instinctual response, of service and care. Pausing to wipe her face, she noticed with a kind of distant surprise the bureaucratic detritus of their daylong meeting—the tablets, the gravures, the printers and recorders—piled haphazardly in the corners of the tent, like garbage from a party that had never been thrown.\n Their deliberations, their differences, were now thrust aside. They worked, together, with cloth and steel, with water and flesh, with hands and tools. A spray of blood spilled into the towels. Mary’s hands were steady. Her nerves leapt to the task with quickfire readiness. The best of life is habit, she thought, watching herself, her expert movements, with a detached and speculative pleasure. The best of us is instinct, unselfconscious—and the wet furry body came squirming into her hands.\n Furry?\n Paul and Ken crowded forward. The men stooped, rapt with a queasy curiosity. The women settled back into fatigued relief. Mary knelt on one knee, massaging the last blood through the pale, blue-veined umbilical cord. The male sasquatch stretched out a finger, tentative as a toddler. Mary shared his surprise.\n “Ken, do you have that knife?”\n With the cord cut and knotted, Mary hunted for unsullied towels. Only when the little bundle of fussing limbs and hungry lips had been laid on the mother’s breast did the surprise of the birth settle in.\n Furry. Yes, furry!\n Mary pulled aside the towel. They would have to run tests. They would verify the conclusion with exams and assays. But eyes and skin, fingers and palms, the breath in her chest and the pulse in her throat, all insisted on one evident truth.\n “Paul?” She looked up, helpless and wondering. The young biologist was smiling. This is it, Mary thought, even as she felt her cheeks tighten in an answering smile—this is what we live for, doctors and scientists, midwifes and naturalists—the vertigo, the shock of facing something indescribably ancient, yet dizzyingly new.\n “This is what I was trying to tell you, Mary!” Paul blinked furiously, crinkling his nose. “How we found the male. The expenditures. The Chinese.”\n “Slow down, Paul.” She laughed, enjoying his boyish excitement.\n “But listen. This is what we realized. There’s only one kind of treatment that can absorb a big outlay like that. And there’s only one country where you can get it done. Of course it’s still illegal. But we know who the groups are, we know what they’ve been doing. Who would have thought? It started with state research. A national eugenics program.”\n Eugenics. Mary sniffed. Dysgenics. Advance, decline, progression, regression. Such terms all seemed beyond silly, in this hot tent, with the strain of birth still heavy in the air, a furry prodigy wriggling in her hands. Improvement, alteration, death, life, birth—and yet it was all just evolution, in the end.\n She touched the curl of the chimplike ear, the snuffling, almost ursine snout. Years ago, hearing about these humans who became sasquatches, Mary had taken a wry delight in the irony. Wonders of science, fruits of rationalism, eons of reason and progress and technology, and this, this was what people chose to do. Now the early wonder came back as a flush in her throat—as she considered the steady groping of life toward ever-growing variety.\n “It’s a germ line change,” Paul babbled. “They got their gametes modified. Phenotype in one generation, genotype in the next. No wonder it cost them so much to have it done. Imagine the effort.”\n Mary couldn’t imagine it. A human being amounts to more than four billion years of accumulated mutations. And this little creature, she believed, bright-eyed and bawling, represented more than however many black-market dollars lay behind its creation. Mary cupped a hand around the infant’s head, guiding its searching lips to the nipple. What did one call a baby sasquatch? Infant? The immediacy of the question made her tremble.\n “This is going to be hell to explain to the public,” Malia said.\n Mary laughed. Yes, drafting her report would be difficult. And the infant, poor thing, would get a battery of tests. Her excitement faltered at thoughts of bureaucratic battles, Congressional inquiries, tabloid scandals, and public outcry ahead. People still hadn’t gotten used to genetic engineering. Now, humanity’s oldest notions would be overturned again.\n The father sasquatch squatted on the earth. Mary started as a hand dropped to her shoulder. She looked up to see Ken’s downturned face. His expression was solemn. He leaned over, reaching out to touch the infant’s cheek, drawing its bulbous, dark eyes to his face.\n “I guess this’ll be a big hassle for you,” Mary said to him. “You’ll have a new species to look after, now, Ken. A genuine new species. Assuming, of course, Paul’s explanation is correct.”\n Ken nodded. He’d have plenty of work ahead of him, Mary knew. New patrols, drone cameras, new onerous regulations. New battles to be fought over turf and official territory. The work of guarding the wilderness had always been thankless, but noble. Now here was a new wilderness, a new frontier, contained within one tiny, furry head.\n Assuming Ken didn’t find all this monstrous. Assuming he was willing to accept the burden.\n Burden, Mary thought. But that’s what life is. Always a burden, a heavy endowment, passing from bearer to bearer, breast to breast.\n “Streams and mountains,” she muttered, touching Ken’s hand.\n “What’s that Mary?” He knelt at her side, pushing aside the towel. They bent forward, together, marveling at the small perplexed eyes, the pink mouth, the details of the two tiny, kicking feet.\n “Gary Snyder. The poet I was telling you about. I was just remembering something he wrote.”\n And Mary quoted for them all, as the young cries went out, echoing through the dripping trees—\n Walking on walking,\n under foot earth turns.\n Streams and mountains never stay the same."}