{"fingerprint": "HJrdhGLX/8Dlm0YxMvR4fbVKEXs=", "sitename": "Clarkesworld Magazine", "title": "Confessions of a Con Girl by Nick Wolven", "author": "Nick Wolven", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/wolven_04_19_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Confessions of a Con Girl by Nick Wolven", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "7400 words, short story, REPRINT\nConfessions of a Con Girl\nSenior Thesis submitted to the Department of English, —— University, in partial fulfillment of the requirements for the degree of Bachelor of Arts\nAugust 22, 20—\nBy: Sophie Lee\nThe first thing to say, at the outset of my narrative, is it was not according to my own wishes to write this senior paper. The reason being for three reasons. Firstly, because, try as I might, I no longer believe I will ever be a “good writer,” which was the primary objective of pursuing an English degree. Which is a great disappointment to me, as being a good writer has been among the foremost of my lifelong passions.\nSecond, another reason is because I do not believe I am in any way a credit to such a prestigious university as I attended, being, as I am, a Con girl, which my title says. So I do not think I am worthy of the BA in English degree. And the only reason I am writing this now is because my Re-Engagement Process Counselor recommended I do so, as a step on my process to healing, and to put behind me all the painful experiences that have occurred.\nThirdly, the last reason I didn’t want to write this paper is because the thesis of the assignment is to explicate how I became a Con girl, what I did wrong, how I became a shame to everyone in my life, and the lifelong steps that brought me to this debacle. But, as I have confessed, I strongly doubt my ability to explicate how this happened. Would I conscientiously aspire to be a scourge on society, an embarrassment to my parents, a disappointment to my teachers and friends?\nEmphatically, no.\nYet, that is what happened.\nTruly, sometimes I believe I am no longer sure of anything. An example would be today. I was sitting outside my institution, in the yard with the high fence and the concrete sculptures of trees. And I was reflecting on my healing process, when a leaf blew into my hair—a real leaf, from a real tree outside our yard. And I lifted up a hand and crushed it—“as one does.” But when I looked at the crushed leaf, I had a feeling, what our Re-Engagement Process Counselor calls “an unprovoked grief episode.” I thought about how I had crushed that leaf for no reason, without even thinking, out of habit. I thought about how this is what I do, touch things and ruin them, without even trying. I thought about how I’m a Con girl, now, a negative member of society, who has to be put in this place, apart from everyone, because she has been such a harm to others. And it was like those times when they first brought me here, in those days when I couldn’t even talk or think, but only used to sit by myself, not moving.\nAll this, yes, because of a leaf, which, as anyone knows, has no nerves, and which anyhow this one was already dead.\nThis is the kind of thing that occurs with me nowadays, after everything else that has transpired.\nI am a Con girl. And in case you can’t tell, I’m still trying really hard to figure out how that could have happened.\nThe place to begin, I believe, is my last week of school. And the subject I will begin with is my End-of-Semester Meeting, with my assigned Learning Process Advisor, Mr. Barraine.\nNow, the thing I must stress at the outset is I believe Mr. Barraine to be a good person—flawed as we all are, but who isn’t flawed? I have never for once doubted that he wanted the best for me, and my life process. You can check out his Perma-Me profile online. Do it now. You will discover that Mr. Barraine has two little girls at home whom he cares for very tenderly. One of whom is afflicted with a disability, but which has nevertheless in no way lessened Mr. Barraine’s affection for her. There is a delightful video of Mr. Barraine and his daughters feeding bread crumbs to ducks in the park, and as the adorable birds waddle and gabble, you can see Mr. Barraine relating with his children and laughing, while in his eye there is the sparkle of genuine joy.\nMany commenters to this video have asserted that Mr. Barraine should not have been feeding the ducks in that manner, because bread crumbs are bad for them and disrupt their normal dietary habits, so feeding the ducks is in some aspects paramount to murdering them. But I in no way believe this should be taken as a mark against Mr. Barraine, who is not an ornithologist.\nI mention all this because on the day in question, Mr. Barraine was meeting with me to discuss my upcoming Final Academic Review, which under the circumstances, I realize, must have been for him a very trying experience.\nI arrived at his office punctually, and the first thing Mr. Barraine said was, “Hi, Sophie, I hope you’re doing OK.”\nAt which I almost started crying, because as Mr. Barraine knew, I was not doing OK, and there was practically no way I was going to do better, or anyway not in time to make a difference. But it was nice of him to say that.\nHe closed the door, and checked that it was closed, and covered the window, and checked that it was covered, and then he showed me where to sit, and said, “Shall we get started?”\nThen Mr. Barraine touched his palmscreen, and the pictures on the walls disappeared, and instead of sitting in an office with books and old-time paintings, we were sitting in the middle of a display of my academic records, which was not a nice place to be.\n“Let’s see what we have, here,” Mr. Barraine said, flicking his finger to sort through the files.\nAt that moment I did start crying, because I didn’t need to see those files to know what this was about. It was all displayed in my palmscreen, where my Pro/Con Holistic Score was glowing a shameful, awful yellow.\nMr. Barraine was respectful while I cried. I have always been grateful to him for what he said next. He said:\n“Now, Sophie, I want you to know that everything that happens in this interview is entirely private and unrecorded. So you can express whatever you feel without it affecting your holoscore. If you need to express some anger, go right ahead. You can even call me nasty names, if that’ll help. Do you want to try that? Do you want to call me nasty names?”\nHe smiled, and it was so nice of him to say that, in that particular way, that I laughed even while I was crying.\n“People have done that, you know,” said Mr. Barraine. “A lot of young people have sat where you’re sitting, and called me all kinds of nasty names.”\nAt that, I felt so bad for Mr. Barraine that I stopped feeling bad for myself, and like that, my tears cleared up and I was ready to begin.\n“Of course,” said Mr. Barraine, “if you in anyway violate the Campus Interpersonal Conduct Policy, that will have to be immediately reported. Now, let’s get going.”\nHe brought up a chart that showed my grades, and a chart that showed my peer networks, and a hundred other charts that showed a hundred different things. But at the center of it all was my Pro/Con holistic score, glowing on a display in the middle of the wall, so awful I could hardly look at it.\n“I’m looking over your records,” Mr. Barraine said, “especially at your holistic score, Sophie, and it seems like during the past few years, we’ve started to see—”\n“I’m in the yellow,” I said, feeling breathless. “I know. And I can explain.”\nBut what I want to underscore, at this juncture in my narrative, is that I have never been one to, as people say, “toot my own horn.”\nWhat follows is a quote from my family’s Vice Assistant Child-rearing Advisor, who prepared my first ever psychological profile:\nSophie . . . has incredibly well-developed sensitivities. Her reading of facial expressions is advanced for her age, and her various empathetic reactions are off the charts. As to her intellectual aptitudes, they show . . . potential for great improvement. The danger is that with such high sensitivities, Sophie may face unique life challenges. But with proper mood management, I believe she will grow up to be an extremely positive social member.\nNow, “the proper way to interpret praise,” as my Test Prep Advisor says, “is as a challenge to do better, not a reward for what you’ve done.” So I believe this is good advice, and see my above-average empathetic abilities, which my VACR so carefully documented, not as something I can take credit for myself, but as a responsibility unto which I have been given. Thus, I have always endeavored to use my empathetic and facial-reading talents, such as they may be, for the constructive support of others.\nAnd this is what I endeavored to achieve, for example, in my fourteenth year, when my mother decided that my father no longer fulfilled her needs as life partner. This was an example of a challenging experience. But I reminded myself that people differ, and sometimes achieving true intimacy means finding a partner who, as people say, “makes the grade.” Also because people achieve life aims at different rates. And the truth is, as we all observed, since we had gotten the extra funds for my Student Development Program, my father had no longer been putting as much effort into his own life process as previous.\nThus, when my mother sued my father for mishandling my Student Development money, I understood why she might feel the need to do that, but also how difficult it would be for my father not to be a part of my development anymore. And I did everything I could to express how I still loved them both and supported them, which I posted every day on my Perma-Me profile.\nAnd it was during this admittedly trying interval, that I noticed my efforts did not go unacknowledged. Because partway through the year, my teacher, Ms. Ebro, requested a private meeting with me. We signed the privacy waivers, and went into the school’s privacy room, and activated the privacy settings, and while we were in there, Ms. Ebro told me how she and the other teachers had observed what was occurring with me. How they had been following my mother’s video diary of the lawsuit online, plus the posts my mother had been putting on her RantSpace page, about my father and the divorce. Also they had been following the videos my father had been sharing on his RantSpace page, about my mother, in some of his more disinhibited moments. And they had seen the page my father’s girlfriend had made about my mother, and the posts my mother had written about me. And Ms. Ebro said it was truly shocking to see what some people will say online about their families.\nThis was a significant moment for me.\nBut what Ms. Ebro said was how she and the other teachers had been observing my own behavior in response to these developments. And how they appreciated my maturity. And she said that sometimes being brave and mature is at least as important as, per example, learning to solve for x or studying pond life.\n“After all,” Ms. Ebro said, “we know what kind of person you are, Sophie. And when I say that, I’m sure you know exactly what I’m referring to.”\nI did, but didn’t say so. But what truly affected me was what Ms. Ebro said next. She said she had talked to the other teachers, and they would be factoring these considerations into my holistic semester scores, in conjunction with my scholastic grades.\nAnd I admit, I may have overresponded a little when Ms. Ebro said all this. But it was not to my detriment. Because afterwards, my Pro/Con Holistic Score went very green. As I had just gotten my first palmscreen implanted, this was a source of significant comfort to me. I used to pull up the covers at night, and turn on my palmscreen, and sit in a kind of glowing green cave, and think about all the opinions that had gone into that holoscore, all the comments my peers had made about me, all the grades my teachers had submitted, all the assessments of my Student Development Team. And how all this information, so judiciously evaluated, was presented in this simple green light, to remind me of the support and positive feelings I had brought into the world.\nWell, that is just one example of a time when I demonstrated Pro behavior.\nThere were others, like when my Wealth Management Advisor had his collapse, or when my Physical Development Coach was accused of improper child handling. But what I want to talk about now is what happened with Roman Cheryshev.\nThis was in sophomore year of college, when Roman Cheryshev was a freshman in my Consciousness through Confrontation seminar. And the thing about Roman was, he was very bright, but he was not the kind of person whose company other people enjoyed. I don’t know how Roman got to be in our institution, which is a prestigious institution. But the fact is, only a month after he got in, Roman’s Pro/Con Holistic Score was moving toward the yellow. At first I thought he might be from a culture where Pro/Con standards are different from ours. But no, he was from New Jersey. Then someone told me Roman’s parents had homeschooled him for the Comp-Sci track, and hired a service to manage his scores, which I know is a thing that happens. But I believe it is an ill-advised thing, as in, what will transpire when such a young person enters, as people say, “the real world”?\nIn any event, Roman was not socially fluent, which made me feel a lot of empathy for him. In seminar, he would become upset when people told him ways in which his behavior was entitled and offensive, which was not only a very Con reaction, but also contrary to the very aims of the course. But I reflected how difficult it must be to be without strong social capacities, so I became his friend.\nThis proved difficult. Partly because my peer network kept giving me Con votes for bringing Roman to social occasions, impacting on my holoscore very negatively. But also because Roman, for whatever reasons, also kept giving me Con ratings! I don’t understand why he would give me a Pro rating one night and a Con the next, inasmuch as we spent all our time the same way, which was with me listening while Roman expressed his anger. Roman did have a lot of anger. To confront someone about their Pro/Con votes is, of course, a very Con behavior, but when I hinted at my feelings, Roman said:\n“What, you think you’re special, Sophie? You think you deserve some kind of reward for hanging out with me? Is that what you’re trying to say?”\nI told Roman I didn’t think I was special, and what I enjoyed about him was his honesty.\nAt which he said, “Well, I think you’re full of s**t, how’s that for honesty? But whatever.”\nWhich was the kind of thing Roman often said to me.\nThis was when we were hanging out in his room almost every night, eating pizza and talking about Roman’s feelings. And that was where we were one Saturday night, when Roman suddenly got a funny look. Now by this time, confessedly, my Pro/Con Holistic Score was not so green as previous. I had brought Roman to several events with my peer network, where he experienced issues related to inappropriate touching. So I was beginning to be conflicted about the friendship. Also, it may be that my sensitivity, though usually high, was not so high as ordinarily. In any event, when Roman did what he did, I reacted uncharacteristically, which I mean, by getting scared and kicking him in the face.\nThese are the words Roman said to me, that night, which I quote here not to be adverse, but only in the spirit of veracity.\n“B***h, what the f**k? Crazy t**t, you come here every night, playing on me, then I finally get the balls to make a move, you shoot me down? Seriously? Motherf**king c**kteasing c**t.”\nAs noted, I have set all this down not to cause hurt, but because it is in fact what Roman said to me.\nBut the upshot is, after this incident, my Pro/Con Holistic Score took a gigantic hit. And it was because Roman kept giving me Con votes! I tried to engage with him constructively about it, but he only told me I had “played him,” and how the worst thing a girl can do to a guy is give him those kinds of mixed signals. Then he told other guys I had “set him up,” and they all gave me Con votes, too! So I was receiving Con votes every day, and this, plus a few other, unrelated factors, was, as people say, “the perfect storm,” which made my holoscore begin to drop.\nAll this was what I explained to Mr. Barraine.\nBut Mr. Barraine said that wasn’t what he wanted to talk about, which was actually more regarding my academic records.\nAt which point he pulled up a file and said, “Sophie, now tell me honestly, do you know where this is going?”\nAt this time I was grateful no one else could see my face. Because in the file were the requirements for my major, which included my Peer Education Program.\n“We have a problem, don’t we?” said Mr. Barraine.\nThe problem was, for years, my Peer Education score had been going up and up, until it was very Pro, and then in the fifth year it began to go down, until it was very Con.\nBut I told Mr. Barraine I could explain, because this was in fact what I was trying to express to him.\nAnd the thing I explained was, firstly, how much I appreciated the innovative spirit of our institution. Because a student goes to college to learn, correct? But who do students learn from most? Our peers, indubitably! So I thought it was very credible of our institution to demand a full six years of Peer Education courses, which not only cuts down on the need for expensive professors, but is also empowering for the younger generation.\nThe problem was, in my fifth year Peer Education course, I had been put in a workshop with Damaris Fierte, who, as everyone knows, is known for her unstinting efforts at peer education.\nNow, at the time, Damaris Fierte had a deep green holoscore, whereas I, thanks to Roman, had only a pale green holoscore. So it was justifiable for her to educate me.\nBut still.\nThe workshop was on Personal Profile Management, in which we had to critique each other’s Perma-Me profiles. And it was my turn to be critiqued. And the first thing Damaris Fierte critiqued about my Perma-Me profile was how I had devoted so much of my time to associating with a person like Roman Cheryshev.\n“He’s a predator. An abuser. I mean, I don’t want to say this, but looking at your profile, Sophie, a person could get the impression—an employer, a potential contact—I mean, they could see you as some kind of enabler.”\nAt which I felt concerned, and explained how I had only felt sorry for Roman, and was trying to be his friend.\nAt which Damaris said, “So you brought him to my friend’s party? Where he inappropriately touched people? This was someone you wanted for a friend?”\nAt which I said, I didn’t consider Roman a close friend, exactly, but more like a—\n“What?” said Damaris. “If he wasn’t your friend, what did you want from him? Just to use him? Just for the Pro votes?”\nI was now beginning to see some of the workshop participants looking at me very problematically.\nThen Damaris said, “I think this is an important lesson in Profile Management, guys. Because when people look at your Personal Profile, an employer, a recruiter, what they want to see most is authenticity. If it seems like you’re taking on too many charity projects, or being nice to unpopular people just for the pity votes, I do think that can reflect on you very adversely.”\nAnd in the final analysis, the workshop ended up giving me a strong critique.\nBut what I want to say is what happened after.\nBecause I went to Damaris after class and said did she really have to give me such a strong critique? And I wasn’t trying to say my Perma-Me profile wasn’t in need of improvement. But given there was a need for improvement, couldn’t there be a more constructive way to go about it?\nThis was when Damaris unloaded on me.\nWhat she said was she had always had concerns. She said she could tell right away what kind of person I was, how I always overpromoted myself and my abilities. She said it was pathetic, how I talked, all the big words I tried to use, and when she looked at my Perma-Me profile, she didn’t think I belonged here at all, in this kind of prestigious institution. She said in fact we both knew exactly why I was here. And if there was one thing she didn’t like, Damaris said, it was a Yellow who acts like a Green, or a Red who thinks she’s a Yellow.\nAt this point I began to have strong feelings. Because I remembered a day, weeks ago, when we had critiqued Damaris’ Perma-Me profile. Which was, admittedly, the best profile I ever saw. Damaris was from New York City, and she went to a private school, and had a huge Child Development Team, and lots of money since she was born. In her profile, there were so many extra classes and volunteer jobs and enrichment programs, I wondered how her Child Development Team could have found time to plan so many activities.\nBut there was one part of her Perma-Me profile that Damaris kept trying to skip, even though the class kept wanting to go back to it. It was a video of Damaris auditioning for the college’s summer LEO business mentorship program. Which under the video, Damaris had written:\nDIDN’T GET IN, OH WELL, I’M JUST SO HAPPY TO HAVE HAD THE CHANCE FOR SUCH A GREAT AND FUN AUDITION!!!!\nBut if you looked at the video, Damaris did not look happy. If you have ever spent a lot of time throwing up, from nerves or any other reason, let me tell you, you know the signs.\nThe strong feelings were because I remembered my own time in the LEO program. And how I hadn’t even auditioned for it, but instead got in by special appointment. The coordinators had to rush me through the enrollment process, then the training process, until I was the last one to get on the rocket. Even then, when I was sitting in my flight seat, strapping in, I could hardly believe I had gotten this far, me, Sophie Lee, a tourist in space.\nWhen we got past the boost phase, into Low Earth Orbit, the program leader took us into the viewing chamber, and showed us the Earth so far below. The purpose of the program was to join business leaders on a trip to outer space, he said, and learn from their insights and leadership experience. It was business-sponsored, so it was a big honor. The program director had a company in financial services, and he said we had been chosen for this opportunity because of a time in our lives when we demonstrated exceptional leadership. Now was a chance for us to look down and think about the planet we might one day be leading, and what he wondered was, did any of us have anything we’d like to say?\nAt this point, I began to get a weird feeling in my stomach, and I unbuckled my harness and floated to the viewscreen, and looked down on the continents below.\nThen I turned and looked at the business leaders buckled into their flight chairs, and what I said was that the main thing I was thinking was not how small the Earth seemed from up here, but how big.\nAt this, the business leaders all smiled and nodded.\nI said it made me feel humble, thinking about what a challenge it must be, being a leader to such a huge place.\nThe business leaders now smiled and nodded very strongly.\nBut I kept feeling weird, and I said it seemed like such a big challenge, it actually seemed like an impossible challenge, like it was crazy to think you could try and control what was happening down there, or even really understand it.\nAt this point some of the business leaders stopped smiling and nodding, and I sensed it was time to go back to my seat and enjoy the complimentary low-grav spherical cocktails. But I still felt weird, so I kept talking.\nWhat I said was, when you thought about it, to the Earth, human beings were basically like bugs, no more special than any other species, whether endangered or no.\nWhat I said was, if you looked at it that way, what could an individual person, however accomplished, really count for?\nWhat I said was, didn’t it almost seem crazy, all the way up here, for any one person to be richer or more important than another, and if you thought about it, if something were to unfortunately happen, and our spaceship were to explode on reentry, would it even make a difference to anyone down there, except of course our families?\nAfter I said all this, none of the business leaders were smiling and nodding at all, and a lot of the other students were letting go of their cocktail spheres and looking at me, like, What’s the matter with you? Then, when we got back to Earth, I discovered my holoscore had dropped almost twenty percent, and all the business leaders had marked me down as being “definitely not leadership material.”\nSo that was what I told Damaris Fierte. And I said she was right about me. How I knew I didn’t belong here, in such a prestigious institution. In fact, what I said was that I envied her, because what I now realized was, the LEO business mentorship program was as big a risk as an opportunity, and in my case, having utterly blown it, I had totally tanked my holoscore.\nAt this Damaris looked at me a long time, and I could see her feelings had changed. Finally she said, “Sophie, you know, I think that’s the most honest thing I ever heard you say.”\nBut I blew it.\nBecause, the more I thought about it, the more I realized Damaris was right. How all this time, in college, even in my Childhood Development Program, I had been trying to be someone I was not, and to seem smarter than I was. And I was ashamed of myself.\nSo I said, “Damaris, the thing is, you really are a smart and amazing person. And you’re right, I don’t belong here, but you really do. And you should have been the one to go on the LEO trip, not me, because I truly believe one day you could be a great leader.”\nAt which she said, “No, no,” and looked sick again, shaking her head.\nBut I said, “No, seriously, I truly believe that.” And then I said what was probably the stupidest thing I ever said in my whole life, which was, “How come we’ve never been friends?”\nBut right away I could see I had majorly screwed up. Because Damaris stood back, and her mouth was open and she was panting, and she looked angrier than I’ve ever seen anyone get angry.\nAnd she said, “Sophie, see, this is exactly what I’m talking about! Everything you do, it always has to be a big calculation. You say all these nice things, and I really believed you, and now I see you’re just manipulating me to join your stupid peer network and boost your holoscore!”\nAt which I didn’t say anything, because I was so surprised.\n“This is truly shameful,” Damaris said as she walked away. “Truly, truly shameful. I can’t even educate you in how shameful this is.”\nAnd when I checked, I saw what I feared, which was that every person in Damaris’ peer network had given me an enormous Con vote.\nNow, coming from someone with Damaris’ score, that meant something.\nBut when I told all this to Mr. Barraine, he shook his head.\n“No, Sophie,” he said. “The Peer Education stuff, that’s only a sidebar. What we’re here about today is your major, especially your literature courses. And I have to tell you we’ve been noticing some very troubling signs.”\nAt this I was surprised, because, since entering college I have become, as my Student Career Coach likes to say, a “true lover of the word.”\nBut Mr. Barraine used his palmscreen to display some different records, which I didn’t recognize, and he said, “Does this mean anything to you?” And when I said, “No,” he said, “Are you sure?”\nThen he came around his desk, and pulled up a chair.\nHe said, “Sophie, do you know what the global rank of this institution is?”\nI did, and I told him.\nMr. Barraine said, “Do you know why we are ranked so high?”\nI said it must be because of the university’s immense positive contributions to society.\nMr. Barraine smiled. “Do you know what the Ivy League graduate enrollment rate among our alumni is? The first-year employment rate? The average salary at ten years? The estimated value of our name as an attractor of venture capital? The alumni fundraising score? Or how about this?”\nHe brought up another chart, which covered almost a whole wall, and this one I definitely recognized.\n“These are the private and public parties,” Mr. Barraine said, “who have agreed to invest in your education. Here’s the government’s contribution. Here’s AdverBetter. Here’s ThinkTrendTrack. Here are all the media and marketing groups that loaned money for your Student Development Team. They all contributed to the financing of your education, Sophie, because your holoscore positioned you, at the time, as an immensely high-potential individual. I think you know exactly what I’m talking about. The reason you’re in this school, Sophie, is because we don’t only educate students here. We educate the whole person.”\nMr. Barraine drew a round shape in the air, a little too round, I thought, inasmuch as it was supposed to be me. But this was not a time, I sensed, for critical remarks.\n“With my approval,” Mr. Barraine said, “you’ll soon be meeting with representatives of these parties for your Final Academic Review. They’ll be evaluating you for employment opportunities. And they’ll be interested in seeing, as early-access recruiters, what their investment in you has produced. You’ll tell them, I’m sure, all about your enjoyment of our rare animal handling workshops, our AI-training program, our maglev-equipped, five-story VR athletics facility. But you’ll also tell them, of course, about your passionate engagement in our many humanities classes specializing in improved empathetic response. I believe you would agree that improving empathy is one of the major benefits of a liberal arts education. But Sophie, tell me, what do you think these people will say if they find out one of our top empathetic performers is, in fact, as it seems, deeply biased?”\nI admit I responded inappropriately, by jumping out of my chair saying, “Biased? How?”\nMr. Barraine leaned back. “Do you really want to ask me that question, Sophie? Do you not see how going into specifics might, in fact, reify the very bias we’re discussing?” Then he pointed at the graphs and said, “These are your realtime empathetic assessments, which our team has been following closely.”\nNow I was especially surprised, because realtime empathetic assessment has always been my favorite part of the literature major. In this time when the humanities are, as they say, “in crisis,” what better case could there be for the profound utility of the narrative arts? How many days have I whiled away in the scanning machines, resting my head in the EEG helmet, listening to the soothing flow of words or the images comporting vivaciously on the screen, and living along with the travails of Jane Eyre and Anna Karenina, of Sula and Nel, of Carrie and Charlotte and Miranda and Samantha? How often has it been a profound comfort to me to know that, in some small way, my empathetic responses to these great works will improve my positive contributions to society?\nBut as I communicated this to Mr. Barraine, he shook his head. “The trouble isn’t with your enthusiasm, Sophie. The trouble is the correlations. We’ve been looking at your neurological readings, and we’ve been noticing some problematic reactions. It’s not that you lack empathy. If anything, you have the opposite problem. You’ve been empathizing, I have to inform you, with some very unacceptable people.”\nBut I stood over him, feeling hopeful, and said, “Mr. Barraine, I can explain.”\nAnd what I explained was how, when I’m in the scanning machines, engaging with all the powerful issues in the stories I’m experiencing, sometimes I start to worry I might have a problematic response. And at times, I get so worried that I make myself have the response, but only for the sake of understanding the response, as part of my ever-vigilant efforts not to have the response. So the realtime empathetic assessment machines, as I told Mr. Barraine, are probably only picking up evidence of my constant mental vigilance against such responses, and of my earnest and engaged grappling with even the possibility of such responses.\nIf that makes sense.\nBut Mr. Barraine looked at me for a long time, and said, “Sit down, Sophie.”\nSo I did.\nAnd he went on:\n“My job, Sophie, is to prepare you for your final review. These people you’ll be meeting are some of the smartest people in the world: politicians, technologists, advertisers, financiers. But the reason they want to meet with you is because that kind of smartness is no longer very valuable. Smartness is what computers have. And nowadays people are very expensive, and computers are very cheap. What’s valuable today, Sophie, is the ability to read human beings—to decipher their moods, their desires, their deepest longings and needs. That is the key to effective public relations. That is what recruiters want. That is the kind of skill the holoscore is meant to assess, and that is what your holoscore said you could do. It is what made you a competitive student, and what helped you attract so much investment, and what got you admitted to this institution.\n“Now, Sophie. What message do you think it will send if I let you meet with those recruiters, a graduating student of this college, and explain to them that after three million dollars and many years of top-tier education . . . well, what do you think they’ll say when they learn that, as you told me today, you befriended a sexual predator in your second year? When they find out you sabotaged the LEO business mentorship experience for a group of our top performers? When they see how your peers have been voting against you? Finally, what will they think when they look at your responses to these literary works, and learn how prone you are to empathizing with the wrong kinds of people?\n“Sophie.” He leaned forward. “I’m afraid I can’t approve you for graduation at this time.”\nI looked at Mr. Barraine, and I was feeling several feelings. Firstly, about how I was apparently a terrible person, but no one had told me in all this time. Second, how in my interacting with Roman and Damaris and others, I had misread all their social cues. Finally, how all those smart people were waiting to give me my review, and they had invested so much money in my education, and how would they feel when they found out the person they’d been educating had turned out to be selfish and cruel and biased?\nMostly, though, I thought about Mr. Barraine. How in that video on his Perma-Me profile, when one of his little girls got scared by the ducks, she turned and hid her face in his shirt. And it was like Mr. Barraine didn’t even need to think. He just kept smiling and tossing out bread crumbs, and with his arm he held her to him.\nThe next thing I knew, alarms were ringing, and Mr. Barraine was jumping away, wide-eyed and shouting and pounding on his palmscreen. And I saw how without even thinking about it, I had gotten out of my chair and pressed my face against his chest.\n“I need to report,” Mr. Barraine said, “a violation of the Interpersonal Conduct Code, class 25B, section H12. Note: nonsexual contact was initiated by the student during an approved private meeting. Repeat note: contact was student-initiated and nonsexual. I have disengaged and am now departing the location.”\nHe moved to the door, holding out his palmscreen to record how carefully he was keeping his distance from me. And I could see the tears on his shirt and face as he said, “Sophie, how could you? Of all the things to try and . . . I have daughters. I have a family.”\nThen, just before he left, he tapped his palmscreen. And the last thing I remember is looking at my own palm, and seeing the effect of the assessment he had given me, which was my Pro/Con holoscore, glowing a bright, ugly red.\nIt feels strange to be in a home for Con women. Everyone here is deep in the red, a confirmed negative influence on society. Yet during the day-to-day, you hardly know. We have meals and watch TV. One woman here was a daycare worker who took care of learning-disabled children. One day she passed out during her duties, and one of the children had a fall and died. She doesn’t talk, but some of us take turns sitting with her. Then there is a woman who attempted suicide four times, and a drug addict, whose name is Tina. One time, I told Tina about my struggles with Pro/Con voting, and she said:\n“Oh, man, my people never gave me no votes. If they had feelings, they just acted on ’em. Ha, ha, yeah, they hit you soft, that means they only hate you a little. But if they hit hard, well, then they must really love you.” Then Tina laughed, looking at my face, and said, “Oh, Sophie, that’s why I like you, girl, you always take things so serious.”\nShe said she wanted me to know they were all giving me Pro votes around here, though admittedly, given their own scores, it wouldn’t count for much.\nNobody can understand why I’m in this place. To be honest, I don’t understand either. I used to be at the top of the Pro ratings, attend a prestigious university, go to meetings with the country’s biggest business leaders. What I want now is for my narrative to be a help to others, and aid them in avoiding the pitfalls I have taken. There are times, though, when I feel like I will never understand, and always be deep in the red, no good to anyone.\nAs for what transpired after my meeting with Mr. Barraine? That particular time is hard to recall. They say that when the officials came, I was sitting in a chair in his office, and wouldn’t move. For weeks after, I wouldn’t speak or do anything. They had to bring me to a hospital and take care of me. I remember I was there when my mother came, and told me she was sorry for everything, and reminded me that while it is very easy to fall into the red, it can be very difficult to climb back out. Some of the underwriters of my education also came, and reminded me about the opportunities I could still have if I remembered my responsibilities and pulled myself together. But mostly I just sat there, doing nothing, except falling ever deeper into the red.\nI thought about the negative scores I had given people in my life, and the friends I had voted out of my peer network, and how one time my mother had wanted to talk about my father, and I had slammed the door. But mostly I thought about the reason this all started, which is the one thing I haven’t talked about, because to be truthful it still feels so weird.\nThis was in seventh grade, when they introduced an autistic boy into our school, as part of an experimental program. He was seriously autistic, so nobody wanted to be near him, because he would do things like grabbing you when you didn’t expect. But there were some people he liked, and one of those people was me.\nThen one day, some other kids were doing something to the autistic boy, and suddenly he started to howl and ran across the lunchroom, throwing his arms around me from behind. I don’t know what the other kids had done. All I knew is, the autistic boy was hugging me in a way where I couldn’t breathe. That was the day everything changed. Because people began to panic and shout, as there had been prior incidents. And the more they shouted, the harder the boy squeezed, until my head began to go dark.\nBut instead of struggling, I whispered to the boy, and reached up a hand and stroked his arm. After a while he loosened his grip. I felt very calm. And I turned around and hugged him back. It surprised everyone. When the boy’s parents saw the videos that had been taken, they started a Pro-Vote campaign on my behalf, even though the boy had to go into an institution because of what he did. And the campaign took off, and before I knew it, the Pro votes came in, millions of votes from around the world. And that was what made my holoscore go so deep into the green, and what made me seem like such a promising student, and why so many investors wanted to put their money into my Child Development Program. And that was why everything turned out the way it did.\nBut what I remembered, while I was lying all that time without moving, was how it actually felt, when the autistic boy grabbed me. How I was so scared I wanted to scream. But I was also so scared I couldn’t scream. He was so much bigger than me, and he wouldn’t let go, and people were screaming about how I might die. I couldn’t even say why I did what I did. It was like there was a different person inside me, who lifted up a finger and gently brushed his hands. When he responded, I knew what to do, and I stood and put my arms around him. Everyone became silent. I remember him shaking, and making puffing noises, like a cat when it can’t stop sneezing. Then he began to quiet down, and I stroked my hands along his back, and put my cheek against his cheek. It was like there was no one else. It was like there was just us two. I felt it go through him, a kind of hum, like a vibration I could feel in my hands. That was when I knew, just by the feel of him breathing—I knew he would be peaceful, this person in my arms.\nOriginally published in Asimov’s Science Fiction, November-December 2017."}