{"fingerprint": "pMxCD3L5jg52KMfXgy2ybRjqVQo=", "sitename": "Clarkesworld Magazine", "title": "Tongtong's Summer by Xia Jia, translated by Ken Liu", "author": "Xia Jia; Ken Liu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/xia_12_14_reprint/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tongtong's Summer by Xia Jia, translated by Ken Liu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5730 words, short story, REPRINT\n Tongtong's Summer\n Mom said to Tongtong, “In a couple of days, Grandpa is moving in with us.”\n After Grandma died, Grandpa lived by himself. Mom told Tongtong that because Grandpa had been working for the revolution all his life, he just couldn’t be idle. Even though he was in his eighties, he still insisted on going to the clinic every day to see patients. A few days earlier, because it was raining, he had slipped on the way back from the clinic and hurt his leg.\n Luckily, he had been rushed to the hospital, where they put a plaster cast on him. With a few more days of rest and recovery, he’d be ready to be discharged.\n Emphasizing her words, Mom said, “Tongtong, your grandfather is old, and he’s not always in a good mood. You’re old enough to be considerate. Try not to add to his unhappiness, all right?”\n Tongtong nodded, thinking, But haven’t I always been considerate?\n Grandpa’s wheelchair was like a miniature electric car, with a tiny joystick by the armrest. Grandpa just had to give it a light push, and the wheelchair would glide smoothly in that direction. Tongtong thought it tremendous fun.\n Ever since she could remember, Tongtong had been a bit afraid of Grandpa. He had a square face with long, white, bushy eyebrows that stuck out like stiff pine needles. She had never seen anyone with eyebrows that long.\n She also had some trouble understanding him. Grandpa spoke Mandarin with a heavy accent from his native topolect. During dinner, when Mom explained to Grandpa that they needed to hire a caretaker for him, Grandpa kept on shaking his head emphatically and repeating: “Don’t worry, eh!” Now Tongtong did understand that bit.\n Back when Grandma had been ill, they had also hired a caretaker for her. The caretaker had been a lady from the countryside. She was short and small, but really strong. All by herself, she could lift Grandma—who had put on some weight—out of the bed, bathe her, put her on the toilet, and change her clothes. Tongtong had seen the caretaker lady accomplish these feats of strength with her own eyes. Later, after Grandma died, the lady didn’t come any more.\n After dinner, Tongtong turned on the video wall to play some games. The world in the game is so different from the world around me, she thought. In the game, a person just died. They didn’t get sick, and they didn’t sit in a wheelchair. Behind her, Mom and Grandpa continued to argue about the caretaker.\n Dad walked over and said, “Tongtong, shut that off now, please. You’ve been playing too much. It’ll ruin your eyes.”\n Imitating Grandpa, Tongtong shook her head and said, “Don’t worry, eh!”\n Mom and Dad both burst out laughing, but Grandpa didn’t laugh at all. He sat stone-faced, with not even a hint of smile.\n A few days later, Dad came home with a stupid-looking robot. The robot had a round head, long arms, and two white hands. Instead of feet it had a pair of wheels so that it could move forward and backward and spin around.\n Dad pushed something in the back of the robot’s head. The blank, smooth, egg-like orb blinked three times with a bluish light, and a young man’s face appeared on the surface. The resolution was so good that it looked just like a real person.\n “Wow,” Tongtong said. “You are a robot?”\n The face smiled. “Hello there! Ah Fu is my name.”\n “Can I touch you?”\n “Sure!”\n Tongtong put her hand against the smooth face, and then she felt the robot’s arms and hands. Ah Fu’s body was covered by a layer of soft silicone, which felt as warm as real skin.\n Dad told Tongtong that Ah Fu was made by Guokr Technologies, Inc., and it was a prototype. Its biggest advantage was that it was as smart as a person: it knew how to peel an apple, how to pour a cup of tea, even how to cook, wash the dishes, embroider, write, play the piano . . . Anyway, having Ah Fu around meant that Grandpa would be given good care.\n Grandpa sat there, still stone-faced, still saying nothing.\n After lunch, Grandpa sat on the balcony to read the newspaper. He dozed off after a while. Ah Fu came over noiselessly, picked up Grandpa with his strong arms, carried him into the bedroom, set him down gently in bed, covered him with a blanket, pulled the curtains shut, and came out and shut the door, still not making any noise.\n Tongtong followed Ah Fu and watched everything.\n Ah Fu gave Tongtong’s head a light pat. “Why don’t you take a nap, too?”\n Tongtong tilted her head and asked, “Are you really a robot?”\n Ah Fu smiled. “Oh, you don’t think so?”\n Tongtong gazed at Ah Fu carefully. Then she said, very seriously, “I’m sure you are not.”\n “Why?”\n “A robot wouldn’t smile like that.”\n “You’ve never seen a smiling robot?”\n “When a robot smiles, it looks scary. But your smile isn’t scary. So you’re definitely not a robot.”\n Ah Fu laughed. “Do you want to see what I really look like?”\n Tongtong nodded. But her heart was pounding.\n Ah Fu moved over by the video wall. From on top of his head, a beam of light shot out and projected a picture onto the wall. In the picture, Tongtong saw a man sitting in a messy room.\n The man in the picture waved at Tongtong. Simultaneously, Ah Fu also waved in the exact same way. Tongtong examined the man in the picture: he wore a thin, grey, long-sleeved bodysuit, and a pair of grey gloves. The gloves were covered by many tiny lights. He also wore a set of huge goggles. The face behind the goggles was pale and thin, and looked just like Ah Fu’s face.\n Tongtong was stunned. “Oh, so you’re the real Ah Fu!”\n The man in the picture awkwardly scratched his head, and said, a little embarrassed, “Ah Fu is just the name we gave the robot. My real name is Wang. Why don’t you call me Uncle Wang, since I’m a bit older?”\n Uncle Wang told Tongtong that he was a fourth-year university student doing an internship at Guokr Technologies’ R&D department. His group developed Ah Fu.\n He explained that the aging population brought about serious social problems: many elders could not live independently, but their children had no time to devote to their care. Nursing homes made them feel lonely and cut off from society, and there was a lot of demand for trained, professional caretakers.\n But if a home had an Ah Fu, things were a lot better. When not in use, Ah Fu could just sit there, out of the way. When it was needed, a request could be given, and an operator would come online to help the elder. This saved the time and cost of having caretakers commute to homes, and increased the efficiency and quality of care.\n The Ah Fu they were looking at was a first-generation prototype. There were only three thousand of them in the whole country, being tested by three thousand families.\n Uncle Wang told Tongtong that his own grandmother had also been ill and had to go to the hospital for an extended stay, so he had some experience with elder care. That was why he volunteered to come to her home to take care of Grandpa. As luck would have it, he was from the same region of the country as Grandpa, and could understand his topolect. A regular robot probably wouldn’t be able to.\n Uncle Wang laced his explanation with many technical words, and Tongtong wasn’t sure she understood everything. But she thought the idea of Ah Fu splendid, almost like a science fiction story.\n “So, does Grandpa know who you really are?”\n “Your mom and dad know, but Grandpa doesn’t know yet. Let’s not tell him, for now. We’ll let him know in a few days, after he’s more used to Ah Fu.”\n Tongtong solemnly promised, “Don’t worry, eh!”\n She and Uncle Wang laughed together.\n Grandpa really couldn’t just stay home and be idle. He insisted that Ah Fu take him out walking. But after just one walk, he complained that it was too hot outside, and refused to go anymore.\n Ah Fu told Tongtong in secret that it was because Grandpa felt self-conscious, having someone push him around in a wheelchair. He thought everyone in the street stared at him.\n But Tongtong thought, Maybe they were all staring at Ah Fu.\n Since Grandpa couldn’t go out, being cooped up at home made his mood worse. His expression grew more depressed, and from time to time he burst out in temper tantrums. There were a few times when he screamed and yelled at Mom and Dad, but neither said anything. They just stood there and quietly bore his shouting.\n But one time, Tongtong went to the kitchen and caught Mom hiding behind the door, crying.\n Grandpa was now nothing like the Grandpa she remembered. It would have been so much better if he hadn’t slipped and got hurt. Tongtong hated staying at home. The tension made her feel like she was suffocating. Every morning, she ran out the door, and would stay out until it was time for dinner.\n Dad came up with a solution. He brought back another gadget made by Guokr Technologies: a pair of glasses. He handed the glasses to Tongtong and told her to put them on and walk around the house. Whatever she saw and heard was shown on the video wall.\n “Tongtong, would you like to act as Grandpa’s eyes?”\n Tongtong agreed. She was curious about anything new.\n Summer was Tongtong’s favorite season. She could wear a skirt, eat watermelon and popsicles, go swimming, find cicada shells in the grass, splash through rain puddles in sandals, chase rainbows after a thunderstorm, get a cold shower after running around and working up a sweat, drink iced sour plum soup, catch tadpoles in ponds, pick grapes and figs, sit out in the backyard in the evenings and gaze at stars, hunt for crickets after dark with a flashlight . . . In a word: everything was wonderful in summer.\n Tongtong put on her new glasses and went to play outside. The glasses were heavy and kept on slipping off her nose. She was afraid of dropping it.\n Since the beginning of summer vacation, she and more than a dozen friends, both boys and girls, had been playing together every day. At their age, play had infinite variety. Having exhausted old games, they would invent new ones. If they were tired or too hot, they would go by the river and jump in like a plate of dumplings going into the pot. The sun blazed overhead, but the water in the river was refreshing and cool. This was heaven!\n Someone suggested that they climb trees. There was a lofty pagoda tree by the river shore, whose trunk was so tall and thick that it resembled a dragon rising into the blue sky.\n But Tongtong heard Grandpa’s urgent voice by her ear: “Don’t climb that tree! Too dangerous!”\n Huh, so the glasses also act as a phone. Joyfully, she shouted back, “Grandpa, don’t worry, eh!” Tongtong excelled at climbing trees. Even her father said that in a previous life she must have been a monkey.\n But Grandpa would not let her alone. He kept on buzzing in her ear, and she couldn’t understand a thing he was saying. It was getting on her nerves, so she took off the glasses and dropped them in the grass at the foot of the tree. She took off her sandals and began to climb, rising into the sky like a cloud.\n This tree was easy. The dense branches reached out to her like hands, pulling her up. She went higher and higher and soon left her companions behind. She was about to reach the very top. The breeze whistled through the leaves, and sunlight dappled through the canopy. The world was so quiet.\n She paused to take a breath, but then she heard her father’s voice coming from a distance: “Tongtong, get . . . down . . . here . . . ”\n She poked her head out to look down. A little ant-like figure appeared far below. It really was Dad.\n On the way back home, Dad really let her have it.\n “How could you have been so foolish?! You climbed all the way up there by yourself. Don’t you understand the risk?”\n She knew that Grandpa told on her. Who else knew what she was doing?\n She was livid. He can’t climb trees any more, and now he won’t let others climb trees, either? So lame! And it was so embarrassing to have Dad show up and yell like that.\n The next morning, she left home super early again. But this time, she didn’t wear the glasses.\n “Grandpa was just worried about you,” said Ah Fu. “If you fell and broke your leg, wouldn’t you have to sit in a wheelchair, just like him?”\n Tongtong pouted and refused to speak.\n Ah Fu told her that through the glasses left at the foot of the tree, Grandpa could see that Tongtong was really high up. He was so worried that he screamed himself hoarse, and almost tumbled from his wheelchair.\n But Tongtong remained angry with Grandpa. What was there to worry about? She had climbed plenty of trees taller than that one, and she had never once been hurt.\n Since the glasses weren’t being put to use, Dad packed them up and sent them back to Guokr. Grandpa was once again stuck at home with nothing to do. He somehow found an old Chinese Chess set and demanded Ah Fu play with him.\n Tongtong didn’t know how to play, so she pulled up a stool and sat next to the board just to check it out. She enjoyed watching Ah Fu pick up the old wooden pieces, their colors faded from age, with its slender, pale white fingers; she enjoyed watching it tap its fingers lightly on the table as it considered its moves. The robot’s hand was so pretty, almost like it was carved out of ivory.\n But after a few games, even she could tell that Ah Fu posed no challenge to Grandpa at all. A few moves later, Grandpa once again captured one of Ah Fu’s pieces with a loud snap on the board.\n “Oh, you suck at this,” Grandpa muttered.\n To be helpful, Tongtong also said, “You suck!”\n “A real robot would have played better,” Grandpa added. He had already found out the truth about Ah Fu and its operator.\n Grandpa kept on winning, and after a few games, his mood improved. Not only did his face glow, but he was also moving his head about and humming folk tunes. Tongtong also felt happy, and her earlier anger at Grandpa dissipated.\n Only Ah Fu wasn’t so happy. “I think I need to find you a more challenging opponent,” he said.\n When Tongtong returned home, she almost jumped out of her skin. Grandpa had turned into a monster!\n He was now dressed in a thin, grey, long-sleeved bodysuit, and a pair of grey gloves. Many tiny lights shone all over the gloves. He wore a set of huge goggles over his face, and he waved his hands about and gestured in the air.\n On the video wall in front of him appeared another man, but not Uncle Wang. This man was as old as Grandpa, with a full head of silver-white hair. He wasn’t wearing any goggles. In front of him was a Chinese Chess board.\n “Tongtong, come say hi,” said Grandpa. “This is Grandpa Zhao.”\n Grandpa Zhao was Grandpa’s friend from back when they were in the army together. He had just had a heart stent put in. Like Grandpa, he was bored, and his family also got their own Ah Fu. He was also a Chinese Chess enthusiast, and complained about the skill level of his Ah Fu all day.\n Uncle Wang had the inspiration of mailing telepresence equipment to Grandpa and then teaching him how to use it. And within a few days, Grandpa was proficient enough to be able to remotely control Grandpa Zhao’s Ah Fu to play chess with him.\n Not only could they play chess, but the two old men also got to chat with each other in their own native topolect. Grandpa became so joyous and excited that he seemed to Tongtong like a little kid.\n “Watch this,” said Grandpa.\n He waved his hands in the air gently, and through the video wall, Grandpa Zhao’s Ah Fu picked up the wooden chessboard, steady as you please, dexterously spun it around in the air, and set it back down without disturbing a piece.\n Tongtong watched Grandpa’s hands without blinking. Are these the same unsteady, jerky hands that always made it hard for Grandpa to do anything? It was even more amazing than magic.\n “Can I try?” she asked.\n Grandpa took off the gloves and helped Tongtong put them on. The gloves were stretchy, and weren’t too loose on Tongtong’s small hands. Tongtong tried to wiggle her fingers, and the Ah Fu in the video wall wiggled its fingers, too. The gloves provided internal resistance that steadied and smoothed out Tongtong’s movements, and thus also the movements of Ah Fu.\n Grandpa said, “Come, try shaking hands with Grandpa Zhao.”\n In the video, a smiling Grandpa Zhao extended his hand. Tongtong carefully reached out and shook hands. She could feel the subtle, immediate pressure changes within the glove, as if she were really shaking a person’s hand—it even felt warm! This is fantastic!\n Using the gloves, she directed Ah Fu to touch the chessboard, the pieces, and the steaming cup of tea next to them. Her fingertips felt the sudden heat from the cup. Startled, her fingers let go, and the cup fell to the ground and broke. The chessboard was flipped over, and chess pieces rolled all over the place.\n “Aiya! Careful, Tongtong!”\n “No worries! No worries!” Grandpa Zhao tried to get up to retrieve the broom and dustpan, but Grandpa told him to remain seated. “Careful about your hands!” Grandpa said. “I’ll take care of it.” He put on the gloves and directed Grandpa Zhao’s Ah Fu to pick up the chess pieces one by one, and then swept the floor clean.\n Grandpa wasn’t mad at Tongtong, and didn’t threaten to tell Dad about the accident she caused.\n “She’s just a kid, a bit impatient,” he said to Grandpa Zhao. The two old men laughed.\n Tongtong felt both relieved and a bit misunderstood.\n Once again, Mom and Dad were arguing with Grandpa.\n The argument went a bit differently from before. Grandpa was once again repeating over and over, “Don’t worry, eh!” But Mom’s tone grew more and more severe.\n The actual point of the argument grew more confusing to Tongtong the more she listened. All she could make out was that it had something to do with Grandpa Zhao’s heart stent.\n In the end, Mom said, “What do you mean? ‘Don’t worry’? What if another accident happens? Would you please stop causing more trouble?”\n Grandpa got so mad that he shut himself in his room and refused to come out, even for dinner.\n Mom and Dad called Uncle Wang on the videophone. Finally, Tongtong figured out what happened.\n Grandpa Zhao was playing chess with Grandpa, but the game got him so excited that his heart gave out—apparently, the stent wasn’t put in perfectly. There had been no one else home at the time. Grandpa was the one who operated Ah Fu to give CPR to Grandpa Zhao, and also called an ambulance.\n The emergency response team arrived in time and saved Grandpa Zhao’s life.\n What no one could have predicted was that Grandpa suggested that he go to the hospital to care for Grandpa Zhao—no, he didn’t mean he’d go personally, but that they send Ah Fu over, and he’d operate Ah Fu from home.\n But Grandpa himself needed a caretaker too. Who was supposed to care for the caretaker?\n Further, Grandpa came up with the idea that when Grandpa Zhao recovered, he’d teach Grandpa Zhao how to operate the telepresence equipment. The two old men would be able to care for each other, and they would have no need of other caretakers.\n Grandpa Zhao thought this was a great idea. But both families thought the plan absurd. Even Uncle Wang had to think about it for a while and then said, “Um . . . I have to report this situation to my supervisors.”\n Tongtong thought hard about this. Playing chess through Ah Fu was simple to understand. But caring for each other through Ah Fu? The more she thought about it, the more complicated it seemed. She was sympathetic to Uncle Wang’s confusion.\n Sigh, Grandpa is just like a little kid. He wouldn’t listen to Mom and Dad at all.\n Grandpa now stayed in his room all the time. At first, Tongtong thought he was still mad at her parents. But then, she found that the situation had changed completely.\n Grandpa got really busy. Once again, he started seeing patients. No, he didn’t go to the clinic; instead, using his telepresence kit, he was operating Ah Fus throughout the country and showing up in other elders’ homes. He would listen to their complaints, feel their pulse, examine them, and write out prescriptions. He also wanted to give acupuncture treatments through Ah Fus, and to practice this skill, he operated his own Ah Fu to stick needles in himself!\n Uncle Wang told Tongtong that Grandpa’s innovation could transform the entire medical system. In the future, maybe patients no longer needed to go to the hospital and waste hours in waiting rooms. Doctors could just come to your home through an Ah Fu installed in each neighborhood.\n Uncle Wang said that Guokr’s R&D department had formed a dedicated task force to develop a specialized, improved model of Ah Fu for such medical telepresence applications, and they invited Grandpa onboard as a consultant. So Grandpa got even busier.\n Since Grandpa’s legs were not yet fully recovered, Uncle Wang was still caring for him. But they were working on developing a web-based system that would allow anyone with some idle time and interest in helping others to register to volunteer. Then the volunteers would be able to sign on to Ah Fus in homes across the country to take care of elders, children, patients, pets, and to help in other ways.\n If the plan succeeded, it would be a step to bring about the kind of golden age envisioned by Confucius millennia ago: “And then men would care for all elders as if they were their own parents, love all children as if they were their own children. The aged would grow old and die in security; the youthful would have opportunities to contribute and prosper; and children would grow up under the guidance and protection of all. Widows, orphans, the disabled, the diseased—everyone would be cared for and loved.”\n Of course, such a plan had its risks: privacy and security, misuse of telepresence by criminals, malfunctions and accidents, just for starters. But since technological change was already here, it was best to face the consequences and guide them to desirable ends.\n There were also developments that no one had anticipated.\n Uncle Wang showed Tongtong lots of web videos: Ah Fus were shown doing all kinds of interesting things: cooking, taking care of children, fixing the plumbing and electric systems around the house, gardening, driving, playing tennis, even teaching children the arts of go and calligraphy and seal carving and erhu playing . . .\n All of these Ah Fus were operated by elders who needed caretakers themselves, too. Some of them could no longer move about easily, but still had sharp eyes and ears and minds; some could no longer remember things easily, but they could still replicate the skills they had perfected in their youth; and most of them really had few physical problems, but were depressed and lonely. But now, with Ah Fu, everyone was out and about, doing things.\n No one had imagined that Ah Fu could be put to all these uses. No one had thought that men and women in their seventies and eighties could still be so creative and imaginative.\n Tongtong was especially impressed by a traditional folk music orchestra made up of more than a dozen Ah Fus. They congregated around a pond in a park and played enthusiastically and loudly. According to Uncle Wang, this orchestra had become famous on the web. The operators behind the Ah Fus were men and women who had lost their eyesight, and so they called themselves “The Old Blinds.”\n “Tongtong,” Uncle Wang said, “your grandfather has brought about a revolution.”\n Tongtong remembered that Mom had often mentioned that Grandpa was an old revolutionary. “He’s been working for the revolution all his life; it’s time for him to take a break.” But wasn’t Grandpa a doctor? When did he participate in a “revolution”? And just what kind of work was “working for the revolution” anyway? And why did he have to do it all his life?\n Tongtong couldn’t figure it out, but she thought “revolution” was a splendid thing. Grandpa now once again seemed like the Grandpa she had known.\n Every day, Grandpa was full of energy and spirit. Whenever he had a few moments to himself, he preferred to sing a few lines of traditional folk opera:\n Outside the camp, they’ve fired off the thundering cannon thrice,And out of Tianbo House walks the woman who will protect her homeland.The golden helmet sits securely over her silver-white hair,The old iron-scaled war robe once again hangs on her shoulders.Look at her battle banner, displaying proudly her name:Mu Guiying, at fifty-three, you are going to war again!\n Grandpa chuckled. He stood and posed as if he were an ancient general holding a sword as he sat on his warhorse. His face glowed red with joy.\n In another few days, Grandpa would be eighty-four.\n Tongtong played by herself at home.\n There were dishes of cooked food in the fridge. In the evening, Tongtong took them out, heated them up, and ate by herself. The evening air was heavy and humid, and the cicadas cried without cease.\n The weather report said there would be thunderstorms.\n A blue light flashed three times in a corner of the room. A figure moved out of the corner noiselessly: Ah Fu.\n “Mom and Dad took Grandpa to the hospital. They haven’t returned yet.”\n Ah Fu nodded. “Your mother sent me to remind you: don’t forget to close the windows before it rains.”\n Together, the robot and the girl closed all the windows in the house. When the thunderstorm arrived, the raindrops struck against the windowpanes like drumbeats. The dark clouds were torn into pieces by the white and purple flashes of lightning, and then a bone-rattling thunder rolled overhead, making Tongtong’s ears ring.\n “You’re not afraid of thunder?” asked Ah Fu.\n “No. You?”\n “I was afraid when I was little, but not now.”\n An important question came to Tongtong’s mind: “Ah Fu, do you think everyone has to grow up?”\n “I think so.”\n “And then what?”\n “And then you grow old.”\n “And then?”\n Ah Fu didn’t respond.\n They turned on the video wall to watch cartoons. It was Tongtong’s favorite show: “Rainbow Bear Village.” No matter how heavy it rained outside, the little bears of the village always lived together happily. Maybe everything else in the world was fake; maybe only the world of the little bears was real.\n Gradually, Tongtong’s eyelids grew heavy. The sound of rain had a hypnotic effect. She leaned against Ah Fu. Ah Fu picked her up in its arms, carried her into the bedroom, set her down gently in bed, covered her with a blanket, and pulled the curtains shut. Its hands were just like real hands, warm and soft.\n Tongtong murmured, “Why isn’t Grandpa back yet?”\n “Sleep. When you wake up, Grandpa will be back.”\n Grandpa did not come back.\n Mom and Dad returned. Both looked sad and tired.\n But they got even busier. Every day, they had to leave the house and go somewhere. Tongtong stayed home by herself. She played games sometimes, and watched cartoons at other times. Ah Fu sometimes came over to cook for her.\n A few days later, Mom called for Tongtong. “I have to talk to you.”\n Grandpa had a tumor in his head. The last time he fell was because the tumor pressed against a nerve. The doctor suggested surgery immediately.\n Given Grandpa’s age, surgery was very dangerous. But not operating would be even more dangerous. Mom and Dad and Grandpa had gone to several hospitals and gotten several other opinions, and after talking with each other over several nights, they decided that they had to operate.\n The operation took a full day. The tumor was the size of an egg.\n Grandpa remained in a coma after the operation.\n Mom hugged Tongtong and sobbed. Her body trembled like a fish.\n Tongtong hugged Mom back tightly. She looked and saw the white hairs mixed in with the black on her head. Everything seemed so unreal.\n Tongtong went to the hospital with Mom.\n It was so hot, and the sun so bright. Tongtong and Mom shared a parasol. In Mom’s other hand was a thermos of bright red fruit juice taken from the fridge.\n There were few pedestrians on the road. The cicadas continued their endless singing. The summer was almost over.\n Inside the hospital, the air conditioning was turned up high. They waited in the hallway for a bit before a nurse came to tell them that Grandpa was awake. Mom told Tongtong to go in first.\n Grandpa looked like a stranger. His hair had been shaved off, and his face was swollen. One eye was covered by a gauze bandage, and the other eye was closed. Tongtong held Grandpa’s hand, and she was scared. She remembered Grandma. Like before, there were tubes and beeping machines all around.\n The nurse said Grandpa’s name. “Your granddaughter is here to see you.”\n Grandpa opened his eye and gazed at Tongtong. Tongtong moved, and the eye moved to follow her. But he couldn’t speak or move.\n The nurse whispered, “You can talk to your grandfather. He can hear you.”\n Tongtong didn’t know what to say. She squeezed Grandpa’s hand, and she could feel Grandpa squeezing back.\n Grandpa! She called out in her mind. Can you recognize me?\n His eyes followed Tongtong.\n She finally found her voice. “Grandpa!”\n Tears fell on the white sheets. The nurse tried to comfort her. “Don’t cry! Your grandfather would feel so sad to see you cry.”\n Tongtong was taken out of the room, and she cried—tears streaming down her face like a little kid, but she didn’t care who saw—in the hallway for a long time.\n Ah Fu was leaving. Dad packed it up to mail it back to Guokr Technologies.\n Uncle Wang explained that he had wanted to come in person to say goodbye to Tongtong and her family. But the city he lived in was very far away. At least it was easy to communicate over long distances now, and they could chat by video or phone in the future.\n Tongtong was in her room, drawing. Ah Fu came over noiselessly. Tongtong had drawn many little bears on the paper, and colored them all different shades with crayons. Ah Fu looked at the pictures. One of the biggest bears was colored all the shades of the rainbow, and he wore a black eye patch so that only one eye showed.\n “Who is this?” Ah Fu asked.\n Tongtong didn’t answer. She went on coloring, her heart set on giving every color in the world to the bear.\n Ah Fu hugged Tongtong from behind. Its body trembled. Tongtong knew that Ah Fu was crying.\n Uncle Wang sent a video message to Tongtong.\n Tongtong, did you receive the package I sent you?\n Inside the package was a fuzzy teddy bear. It was colored like the rainbow, with a black eye patch, leaving only one eye. It was just like the one Tongtong drew.\n The bear is equipped with a telepresence kit and connected to the instruments at the hospital: his heartbeat, breath, pulse, body temperature. If the bear’s eye is closed, that means your grandfather is asleep. If your grandfather is awake, the bear will open its eye.\n Everything the bear sees and hears is projected onto the ceiling of the room at the hospital. You can talk to it, tell it stories, sing to it, and your grandfather will see and hear.\n He can definitely hear and see. Even though he can’t move his body, he’s awake inside. So you must talk to the bear, play with it, and let it hear your laughter. Then your grandfather won’t be alone.\n Tongtong put her ear to the bear’s chest: thump-thump. The heartbeat was slow and faint. The bear’s chest was warm, rising and falling slowly with each breath. It was sleeping deeply.\n Tongtong wanted to sleep, too. She put the bear in bed with her and covered it with a blanket. When Grandpa is awake tomorrow, she thought, I’ll bring him out to get some sun, to climb trees, to go to the park and listen to those grandpas and grandmas sing folk opera. The summer isn’t over yet. There are so many fun things to do.\n “Grandpa, don’t worry, eh!” she whispered. When you wake up, everything will be all right.\n [Author’s Note: I’d like to dedicate this story to my grandfather. August is when I composed this story, and it’s also the anniversary of his passing. I will treasure the time I got to spend with him forever.\n This story is also dedicated to all the grandmas and grandpas who, each morning, can be seen in the parks practicing taichi, twirling swords, singing opera, dancing, showing off their songbirds, painting, doing calligraphy, playing the accordion. You made me understand that living with an awareness of the closeness of death is nothing to be afraid of.]\n Originally published in Upgraded,edited by Neil Clarke.\n Xia Jia (aka Wang Yao) is Associate Professor of Chinese Literature at Xi'an Jiaotong University and has been publishing speculative fiction since college. She is a seven-time winner of the Galaxy Award, China's most prestigious science fiction award and has published three science fiction collections (in Chinese): The Demon-Enslaving Flask (2012), A Time Beyond Your Reach (2017), and Xi'an City Is Falling Down (2018). Her first English language short story collection, A Summer Beyond Your Reach, will be the first book published by Clarkesworld Books. She's also engaged in other science fiction related works, including academic research, translation, screenwriting, and teaching creative writing.\n Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\n Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\n Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\n He lives with his family near Boston, Massachusetts."}