{"fingerprint": "ybpM+jPGLsTlUub9MJlQesGnlJU=", "sitename": "Clarkesworld Magazine", "title": "Tick-Tock by Xia Jia, translated by Emily Jin", "author": "Xia Jia; Emily Jin", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/xia_05_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tick-Tock by Xia Jia, translated by Emily Jin", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4620 words, short story\nTick-Tock\nHim\nAlone in the darkness, he counts the tick-tocks.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nThere are sixty seconds in a minute.\nHis thumb slides from the tip of his index finger to the second knuckle.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nThere are sixty minutes in an hour.\nHe clears the counting on his left hand and carries a digit over to his right hand.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nRing-a-ring.\nThe alarm clock bleeps, waking him up from the darkness.\nThe wind blows at the curtains, letting in the sunshine. It’s a new day.\nHe rolls out of bed, washes his face, brushes his teeth, makes coffee, slides a toast into the toaster, fries an egg, eats breakfast, changes into a business suit, puts on a tie, goes downstairs, starts the car engine, and leaves for work.\nIt’s a bright, breezy day. A few puffy, white clouds are drifting across the clear, blue sky, the sight so beautiful that it almost looks like a cartoon image. He skims through his day schedule as he drives. There’s more work to do today than he had imagined.\nLately, he’s been overloaded with work. But his love for his job is enough to push him through.\nHe parks his car next to a school, opens his trunk, finds the box labeled “1” and takes out the costume and props inside.\nThe costume is a school uniform. He puts it on, half-tucks his shirt into his pants, steps into a pair of grubby sneakers, ruffles his hair into a bed head, and sprays toner onto his face to moisturize the skin.\nA smooth face, bushy eyebrows, and clear eyes: the perfect schoolboy package. Satisfied with the reflection in the rearview mirror, he does a few warm-up moves on the curb to stretch out his arms and legs. He can smell the fragrance of osmanthus flowers in the cool morning air.\nAll set. He gives himself a clap of encouragement.\nReady, action!\nHe races toward the school.\nGoing to be late for school, better hurry up . . . faster . . . he thinks. He gasps for air as he runs. His hair and unzipped sweater whip in the wind. The soles of his shoes are burning. He swings his arms frantically as if the extra motion could speed him up. Faster, faster . . .\nBam!\nHe runs smack into someone as he turns a corner. He stumbles, then falls to the ground, sprawling.\nOuch. He has hit his head so hard that he’s seeing stars. The world seems to be spinning before his eyes. He lies there, unable to get up.\n“Ah!” a girl’s voice rings above his head.\nHe looks up. He sees a pair of white sneakers, and then the hemline of a school uniform skirt.\nA girl with short hair is kneeling next to him. Eyes wide in surprise, she examines him carefully. The morning sun shines on her face, illuminating the tiny freckles on the sides of her nose.\n“Are you alright?” asks the girl.\nSomething hot is running down his chin. He realizes that his nose is bleeding.\nCut.\nHe sits up. Wiping his nose on his shirt, he evaluates the previous act. Was it natural enough? Was it too dramatic? Did he fall down correctly? What would an inexperienced high school boy do when he falls in love for the first time? Verisimilitude doesn’t matter; what matters is whether his performance could stir up the feeling of young, innocent love in an adult audience. Generating empathy is the key to a successful performance.\n“Are you alright?” the girl asks again, her voice timid.\nShe is so young, he thinks, this is what a real high school student is supposed to look like. He can never fake the look of youth no matter how good his acting or how flawless his makeup. As he gazes at the girl’s face bathed in sunlight, he feels the bittersweetness of a first crush slowly rising in his heart.\nLet’s redo it. He decides.\nHe rewinds the scene. The bloodstain on his shirt disappears, the girl returns to the other side of the road, and he appears back at his car.\nHe checks the rearview mirror again to fix his makeup and costume, warms up and gives himself another encouraging clap.\nReady, action!\nOnce again, he dashes toward the school.\nBam!\nCut.\nThe second performance is definitely better. Satisfied, he grins to himself.\nIt’s getting late. He heads off to the next scene, leaving the school behind.\nThe clouds are thinning. The sun, now brighter, casts the shadow of trees onto the road.\nHe parks his car in an underground lot and takes out the box labeled “2” from his trunk. The costume this time is a close-fitting gray uniform, looking rather futuristic. He tightens the belt, puts on a badge and slicks his hair back.\nHe enters an elevator. As the elevator ascends, he rehearses his lines silently.\nThe elevator gate opens. He walks out and strides onto the bridge, his head held high. The crew salutes him.\n“Captain, the wrap drive is ready.” His first mate calls out to him.\n“Forward!” he orders, with a wave of the hand.\nYou\nIn the darkness, you count the tick-tocks alone.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nThere are sixty seconds in a minute.\nYour thumb slides from the tip of your index finger to the second knuckle.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nThere are sixty minutes in an hour.\nYou clear the counting on your left hand and carry a digit over to your right hand.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nRing-a-ring.\nThe alarm clock bleeps, waking you up from the darkness.\nYou turn on the light in your windowless, messy room. It’s a new day.\nYou pour yourself a cup of cold water, drink it in one gulp, go to the bathroom to shower, dry up with a towel, change into clean clothes, make instant coffee, grab a sandwich from the fridge, and sit down at your desk.\nYou browse your inbox and your day schedule. There’s a lot to do. Better tackle these tasks one by one, you sigh.\nFirst of all, you create a new project: a high school romance. No need to build a new scene—you can use an existing template. Most shows about high school romance are largely identical, even the schools on the sets look pretty much the same. You display the miniaturized 3-D model of the school and the neighborhood on your dashboard. You change some of the shop signs and add a few cars and pedestrians to the scene. You adjust the lighting and the color, and use a filter to make the sky seem bluer and clearer. You set the time to September. With a final dash of cool morning breeze and the fragrance of osmanthus flowers, the scene is good to go.\nNext you design the female protagonist. Height, weight, measurements, outfit, hairstyle, facial features . . . you give her a pixie cut, tanned skin, some light brown freckles and lean, muscular legs like a deer. She resembles a girl whom you’ve had a crush on in the past.\nYou know for sure that the male protagonist will fall in love with her, because he is you, and you are him. You created him. Or, rather, you created an avatar of yourself in a virtual world. He feels and thinks exactly the way you do. With him as the protagonist, you spin thousands of stories. Through him, the consumers can immerse themselves in your stories. He becomes their eyes and ears.\nOther characters in the scene, however, are merely NPCs (non-person character) generated by 3-D modeling and algorithms. They can cry, laugh, sing, and dance, but nothing beyond those simple actions. The protagonist is the only RPC (real-person character) who can react genuinely to each scene, like a real living human.\nHe appears at the crossroad and changes his costume and hairstyle in accordance to the scene. You take the chance to adjust his statistics. Enhance speed, dexterity, and flexibility. After all, the upcoming scene involves a little more physical activity than usual.\nSince an RPC is based on a real human, you cannot change their character setting like you can do to the NPCs, or else the RPC will experience identity confusion. You have to create an ultimate role for him that overrides all those alternative characters, like an umbrella: you make him believe that he is an enthusiastic actor, and playing those characters is only a part of his daily job.\nHumans have mastered the skill of reducing cognitive dissonance. Even an RPC in a virtual world will rationalize everything around them and generate a self-consistent life story. The same thing goes for dreams. When we dream, no matter how strange the dream, our brains always make it feel real.\nDoes a virtual character dream? Occasionally you wonder.\nWhat would someone living in a dream, dream of? You don’t really know. You, on the other hand, haven’t dreamed in a long time.\nAll set. You put a finger on the “start” button.\nReady, action!\nEXT. IN FRONT OF THE SCHOOL — EARLY MORNING\nHe races toward the school.\n(Going to be late for school, better hurry up . . . faster, faster . . . )\nBam!\nHe runs smack into the female protagonist who is also running towards the school, as he turns a corner. He stumbles, then falls to the ground, sprawling.\n(Ouch.)\nA girl’s voice:\nAh!\nHe looks up. He sees a pair of white sneakers, and then the hemline of a school uniform skirt.\nA girl with short hair is examining him carefully, her eyes wide in surprise. The morning sun shines on her face.\nThe girl:\nAre you alright?\nSomething hot is running down his chin. He realizes that his nose is bleeding.\nYou press the “pause” button.\nWas it natural enough? Was it too dramatic? Did he fall down correctly? The key to a successful product is whether it can make the audience empathize with the protagonist. Even if the story is fictional, the emotional experience needs to be genuine.\nMaybe he thinks this scene could be done better, too. He is you and you are him. Often times you can feel what he’s feeling.\nLet’s redo it.\nYou click on the progress bar and drag it back to the starting point, resetting the scene. Again, you put your finger on the “start” button.\nReady, action!\nI\nThe alarm clock bleeps, waking me up from the darkness.\nThe light brightens slowly, illuminating my sleeping pod. The pod is so cramped that I barely fit. I lie there, ruminating on the dream I had last night. It was vivid, rich, colorful, exciting, and indeed emotional, in which I lived a hundred different lives: I was a detective, running around the city to track the traces left behind by the criminal mastermind; I was the daring and intelligent captain of a spaceship, ready to lead my crew into space for a grand adventure; I was a handsome ranger, roaming all over the land to seek romantic encounters; I was brought back to the time when I was a schoolboy having a crush for the first time, and my heart sped up whenever I passed by her homeroom . . .\nEvery alternate dream is a life that I long for, yet could never have. In reality, I am only an ordinary man living a mundane life in a big city, an average worker bee that strictly follows the rules and always plays it safe. In dreams, however, I get to do whatever I want. I can spend millions overnight and rule the world like a king. I can be anyone and go anywhere, no longer confined to my tiny work cubicle or even my physical body.\nThe screen in front of me lights up. A familiar tune plays as the advertisement comes on:\nDream Worker\nDream your dreams!\nA woman’s voice whispers in my ear. “Good morning! Did you have a good dream last night?”\nTwo options, “yes” and “no,” appear on the screen. I choose “yes.” A payment-processing page emerges.\n“Do you wish to proceed with the payment?”\nThe second I pay for last night’s dream, my account balance drops immediately. Dreams are expensive. As if I was dragged back into the cold reality all of a sudden by those numbers, I feel gloom slowly overwhelming the good mood from the dream.\n“Thank you. Hope you have a happy day!”\nIt’s time to wake up, go to work, and make money to pay for tonight’s dream.\nThe brain perceives time differently in a dream. Ten minutes of rapid eye movement sleep can become decades in the dreamworld, which means, I could experience a lifetime of power and wealth in a single night as long as I can afford to keep dreaming.\nWith dreams, who cares about life during the day, then? It doesn’t matter if your work is boring, if you’ve accomplished nothing, if you’re poor, inferior, lonely, or desperate. These troubles will soon pass. You only need to stick it out and wait patiently for the night to come again. What is repressed during the day will return to you when night arrives.\nOn all fours and facing backwards, I crawl out of the hexagonal sleeping pod, and follow my neighbors through the narrow corridor. The room consists of many walls that line up like bookshelves in a library. On each wall there are over three hundred sleeping pods installed, and in each pod lives someone just like me. There are countless numbers of rooms in the entire building. Similar to bees in a giant hive, we struggle to make a living through the day and return here at night for a dose of fantasy.\nOur era runs on dreams, just like how our past generation ran on coal and oil.\nI hear a strange sound in the corridor ahead. I halt, just in time to see the crowd splitting apart to make a path. Two men wrapped in white from head to toe are gliding towards our direction like two phantoms. They crawl into one of the sleeping pods and soon crawl out again, dragging a dead body behind.\nI recognize that pod as my neighboring pod. I don’t know the person who died, though, and I’ve never seen them around. When did they die? Last night? The thought of sleeping next to a dead body sends a shiver down my spine.\n“I have to say that it’s actually kind of nice to die when you’re high on a dream,” a mutter comes from the crowd.\n“Well, someone’s overdosed!” Another person snickers.\nI have seen people who died in their dream before. Most of them looked strangely ecstatic. A dream is like a mirror that reflects your desires. People who don’t know when to draw the line will continue lusting for more highs like drug addicts, until they drown in the abyss of their own desire.\nThe men in white put the body in a bag. As they zip up the bag, I catch a glimpse of the corpse. She seems already in her mid-age, black-haired and skinny. Her eyes are closed shut and her face is scrunched up, so I can’t really tell what she looked like before she died. The expression on her face, however, is indescribable. It’s not simply happiness, pain, or fear. In fact, she doesn’t even look human anymore.\nAlthough it was only a quick glance, I find the scene before my eyes utterly unforgettable. Perhaps her face will haunt me forever.\nI’ll be having nightmares, I think as I continue to follow the crowd through the corridor. Happy dreams get boring sometimes; an occasional nightmare can help spice things up a little bit.\nI can’t help but look forward to tonight.\nUs\nThe lights in the cinema gradually dims. The rich, sweet smell of butter popcorn permeates the air. When I reach for the popcorn, my fingertip accidentally brushes past another, smaller hand. All of a sudden, I feel a numbness rising from my feet and quickly traveling up, running through my body like an electric shock. It’s the feeling of first love, I recognize, and I haven’t felt it in a long time.\nThe hand withdraws soundlessly. I peer at the girl next to me. She immediately turns her head away, pretending that she hasn’t been looking at me. In the half-dark room, I can vaguely distinguish the small freckles on the sides of her nose. Right now, we’re on our first date.\nI know that this is a dream, because cinemas don’t exist in the real world anymore; yet I still let myself loose to immerse in this character and enjoy the moment.\nI muster up the courage to reach for her hand. She tries to pull away at first out of shyness, but after a moment of hesitation, she lets me take her hand. I feel her palm beneath my palm, curling up like a little bird. Encouraged, I hold her hand a little tighter.\nTake it slowly, I remind myself, a game is only fun when you play it step-by-step.\nThe dark movie screen flashes, and then a title text in white emerges:\nThe Secret Behind the Dream Factory!\nWhat is this? A movie trailer?\nBefore I can figure it out, the film already begins to play.\nClose up on the tranquil face of a sleeping man.\nNarrator:\nEvery night, when you crawl into bed, you are ready to leave the hassles of the day behind and enter the fantastical dreamworld brought to you by Dream Worker. However, do you know how your dreams are created?\nTV advertisements, posters, videos of product launch events, the confident beam on the face of the technical director . . . everything is all too familiar.\nAdvertisement:\nDream your dreams!\nNarrator:\nDream Worker provides customized dreams to every user. It can satisfy any wish: owning a harem or killing people like ants, becoming a superhero or a billionaire . . . you may think that your deepest desire is only a fleeting thought or a tiny part of your daydream, but Dream Worker can make it come alive and give you the most vivid immersive experience.\nA compilation of video clips with each scene flashing by:\nRomance, history, fantasy, war, horror, erotica . . .\nThe protagonist, however, is always the same person: the sleeping man in the beginning.\nNarrator:\nDream Worker claims that they collect data of the users’ browse history, purchase history, social media updates, books they’ve read, movies they’ve watched and music they’ve listened to, deduce each user’s taste, preference, and desires with an algorithm, and create customized dreams out of existing story templates.\nFor example, a user obsessed with James Bond would dream of going on a special mission at a vacation resort that they’ve wanted to visit recently. At the same time, food, cars, and fashion that they’ve seen in advertisements and their celebrity crushes will appear in the dream as well.\nTheir algorithm is a magic box that generates dreams automatically. There is no risk of leaking private information, because no one else besides you can see what is in your dreams.\nAn animation display:\nElements of a user’s daily life—eating, drinking, traveling, working—are recorded on cards, and those cards are thrown into a black box. The box then produces a colorful movie poster with the user’s face in the middle, surrounded by the elements on the cards.\nNarrator:\nHowever, this is not how the dream factory works in real life.\nIn the dream-generating black box, a person slaves away every day to polish the little details of your dream. That person knows your loves and hates, your fears and hopes, your joys and worries. They know how to please you.\nThey are you.\nThe screen turns black. A spot of light shines in the middle of the darkness. The camera descends slowly from above, gradually closing up on a myriad of cubicles bathed in light. In every cubicle there is a worker in blue-gray uniform diligently creating dreams. The camera shifts downwards again and locks its focus on one of the workers.\nThe glow of his dashboard illuminates his face. He’s the same man from before.\nNarrator:\nDream Worker collects your data and creates an avatar—maybe thousands of avatars—of you in virtual worlds. They are the workers of your personal dream factory.\nHowever, they believe that they are human just like you, and creating dreams is only their job. When you go to sleep at night, they wake up and go to work, producing spectacular dreams for their only audience, you.\nThe camera zooms in and focuses on the dashboard. It displays a battlefield. All of a sudden, a white horse leaps and lands in the middle of the enemy’s troops like a flash of lightening. With a slash of the sword, the hero on the horse beheads the enemy captain. The camera moves in for a low-angle shot fixed on the hero’s face. The camera zooms out again. Behind the small silhouette of the protagonist emerges an enormous projection of the dream creator’s expressionless face.\nThe protagonist and the dream creator share the same face, yet they never look at one another.\nNarrator:\nDespite that the system makes these workers believe that they are just like real people, they don’t actually need to eat or sleep. In fact, even if they tried, they wouldn’t be able to fall asleep. Every morning when you wake up, they will be thrown into a space of darkness and freeze there, unable to speak or move. All they can do is calculate the passing of time by counting seconds, and wait for the moment when you go to sleep again.\nAs the creator of dreams, they never dream.\nThe screen darkens again. Nothing is audible besides the ticking sounds of a clock.\nTick-tock, tick-tock, tick-tock . . .\nWhat the hell?\nI stare at the screen, confused. Was that an advertisement? Or was it just something I made up in my dream? Dreams, of course, are always a little absurd; but what I saw was way too real.\nI remember a joke that I’ve heard a lot: there’s a house-elf in every smart device that helps us make phone calls, pop popcorn, order takeout food, manage money, drive, clean our room, predict the weather, record our life . . . of course, it’s only a joke. As technology continues to develop, machines are gradually replacing human labor. Or, rather, humans are beginning to feel that their work is not so different from the work machines do. Big data and AI algorithms, in particular, are blurring the boundaries between humans and machines.\nI squeeze the girl’s hand again. She’s a few lines of code, a 3-D visual, a character in the dream; yet she feels real. I can love her the way I love a real human. No—even real humans can’t touch my heart the way that she can.\n“Exactly! Who can say that what you’re feeling is not true love?” A voice rings next to me.\nI turn my head to see that the girl is gone, and a stranger is sitting on her seat. I am holding his hand tightly.\n“Did you forget who I am?” The man looks at me. “Think carefully.”\nI study his face. There is nothing unordinary about his features.\nAll of a sudden, I remember: he is the man from the trailer I saw just now, the character I play every day in my dream.\nHe is me.\nHow strange. I have not realized until this moment. It’s always hard to remember who we truly are in a dream.\nHorrified, I want to shake his hand off, but I can’t. Our two hands seem to have grown into one.\nThe man chuckles. “Do you like the dream I made for you?”\nHis laughter sends a chill down my spine. His eyes, deep and dark like abysses, make me tremble with fear. The gaze of the other.\nThe man who has created all my dreams is here to seek revenge. He hates me, because I own what he cannot have; I know, if I were him, I would hate myself, too. Everyday when I wake up, he is imprisoned in the darkness, waiting for his turn to move while wallowing in despair and hatred. Now, he has found a bug in the system that allows him to come out, and he’s here to get me.\nWhat is repressed during the day will return to you when night arrives.\n“Are you scared?” The man chuckles again. “Why are you scared of yourself, then?”\nI don’t know what he wants to do to me. All I know is that as the creator of this dream, he has a thousand ways to kill me. I fumble desperately in the darkness.\nNo, this is my dream, and I’m the one and only protagonist, I think to myself. A protagonist doesn’t die. I must survive until the moment I can wake up.\nMy fingertips feel something hard and cold in the popcorn basket. I grab it.\n“Don’t be scared,” the man tightens his grip, “Here, follow me, I’ll show you what the sun looks like outside.”\nI whip out a loaded gun from the popcorn basket, press it to his forehead, and pull the trigger, firing shots one after another, until the entire clip is empty.\nBam! Bam! Bam! Bam! Bam! Bam!\nI smell gunpowder and blood.\nI sit there gasping for air, my chest heaving. My heart is racing fast. It’s dark all around. There is no one else in the audience, no witnesses and no one to scream out in horror for what I’ve just done.\nIn utter silence, all I can hear are the tick-tocks of the clock.\nTick-tock, tick-tock, tick-tock . . .\nI bend down and fumble for the dead body of the person whom I killed, but my fingertips feel nothing but thin air.\nEverything has vanished. I am left alone in the infinite darkness.\nI yell, I run, I fall down, I tumble, I stumble, I strike, I scream, I curse, I sob, I plead . . .\nNothing happens.\nNo sound, no light, no ending to the darkness, no exit.\nI lie down and curl into a fetal position. I can’t tell how much time has ticked past.\nPerhaps this is only a joke, or a temporary bug in the system. Perhaps after a few more hours I will be able to leave this place and wake up in the cramped, warm cabin.\nI remember the woman who died this morning. The way she was dragged out from the sleeping pod, her stiff, cold body, and the indescribable look on her face.\nI’ve heard that the human brain perceives time differently in a dream, where a night can feel like eternity.\nTo distract myself, I begin to count.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nThere are sixty seconds in a minute.\nMy thumb slides from the tip of my index finger to the second knuckle.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nThere are sixty minutes in an hour.\nI clear the counting on my left hand and carry a digit over to my right hand.\nOne, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve . . .\nOriginally published in Chinese and English in SFComet, 2015.\nThis is a new translation of the original Chinese version.\nTranslated and published in partnership with Storycom.\nXia Jia (aka Wang Yao) is Associate Professor of Chinese Literature at Xi'an Jiaotong University and has been publishing speculative fiction since college. She is a seven-time winner of the Galaxy Award, China's most prestigious science fiction award and has published three science fiction collections (in Chinese): The Demon-Enslaving Flask (2012), A Time Beyond Your Reach (2017), and Xi'an City Is Falling Down (2018). Her first English language short story collection, A Summer Beyond Your Reach, will be the first book published by Clarkesworld Books. She's also engaged in other science fiction related works, including academic research, translation, screenwriting, and teaching creative writing.\nEmily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature."}