{"fingerprint": "Ic+Cik+Otlt2jlChIRTQeEF/fQ8=", "sitename": "Clarkesworld Magazine", "title": "Your Multicolored Life by Xing He, translated by Andy Dudak", "author": "Xing He; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/xing_06_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Your Multicolored Life by Xing He, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "8270 words, novelette\nYour Multicolored Life\n1 – This World\nThe occasional breeze allayed the scorching midsummer heat, soothing the fever dreams of the sleepers in the mining scar. The remote blue sky was rooted to the earth, which here in the work zone was the blood red of hematite.\nZhang Hua crouched low. Nostrils flaring, he dragged a finger through the residue of food that remained in the paper ration box. He looked around, contemplating the smell of urine that pervaded the area. On either side of the peak, a drum-type robot was patrolling. Zhang Hua didn’t dare to look straight up at them.\nThe dreaming multitude began to stir. Zhang Hua was immediately alert, every fiber of his being ready for work orders. A slave laborer like himself dashed away from the edge of the scar, and then another, this one slower. The two machine guardians acted according to their programming, simultaneously abandoning their patrol routes and turning upon the first, and faster, runaway. They launched two scorching tongues of flame, and the human fell to the ground, barely struggling.\nThey hit their second target with bullets, and this slave fell, writhing and shivering, taking longer to die.\nZhang Hua watched it all with a grave expression. He didn’t join the crowd of agitated slaves at the top of the main ramp. He knew the odds of escape by simply fleeing were low, so he wasn’t shocked by what he’d seen. He’d never thought of doing it that way.\nThe night before, he’d lain in his thatch hut, tossing and turning and never finding sleep. As his body became visible to him in the passing darkness, a plan took shape in his mind. He’d been wracking his brain for days, and here finally was something that could work.\nRather than cautiously speaking during rest periods, it was better to mutter, lips barely moving, during work. As the afternoon work period started, Zhang Hua, a vigorous porter of iron ore, didn’t show the slightest fatigue. He initiated exploratory discussions of his plan. Several vigilant comrades gathered around him, and he made his proposal to slaves passing nearby.\nEveryone seemed to think it was feasible.\n“Should we include Ore-Head?” one laborer asked.\n“No,” Zhang Hua said. “He’s going to act as bait.”\nZhang Hua was more grim, callous, and farsighted than his fellow slaves. He knew Ore-Head for what he was: a fool who thought himself clever.\nAs Zhang Hua conspired with friends, Ore-Head was wantonly, and without fear of ridicule, publicizing his own theory of escape. He told anyone he came across that escape required at least three people: two to separately draw fire, giving a third the chance to escape. Based on the theory alone, Ore-Head considered himself a great mathematician. But this great thinker was going further, planning to put his theory into practice. He campaigned intensely, making a lot of noise trying to assemble followers. This interfered with Zhang Hua’s operations, whose first thought had been to beat the fool into submission, or death. But then Zhang Hua thought of a wiser counter-stratagem: exploit the idiot and whatever small group he assembled, as decoys.\nThe next day, Zhang Hua and Ore-Head were both still trying to attract followers. But a new problem arose: a slave named Bug-Eyes had died in the wee hours of the morning. This diminutive man, a porter of ore like Zhang Hua, had probably succumbed to exhaustion, though it may have been illness. The robot wardens forced a group of slaves to carry his body out of the scar like so much ore, and dump it over a cliff. Bug-Eyes had been Ore-head’s go-between, and central to his plan. Now that the little man was gone, Ore-Head was panicking.\n“I want to join up with you,” Zhang Hua said in a low voice, sidling up to Ore-Head.\nOre-Head could barely contain his excitement at these words. He hadn’t expected to attract such a strong and courageous person, someone who’d always looked down on him. It seemed this paragon of humanity was also short on manpower. Beggars couldn’t be choosers.\nOre-Head devoured his lunch ration. He tried to avoid staring at Zhang Hua, but couldn’t help the occasional conspirator’s wink. Zhang Hua ignored these, preparing himself mentally.\nAfter lunch, Zhang Hua scanned the scar, the peak, the south face of the mountain. He nodded at Ore-Head, who’d been waiting for this signal. Ore-Head sprang up and fled.\nAt the same time, another slave leapt to his feet, the only other person that Ore-Head had managed to recruit.\nBut Zhang Hua didn’t budge.\nOre-head became the first sacrificial victim.\nThree people weren’t enough. Humans were slower than robots, after all. Zhang Hua was indeed farsighted, and he was also quick-witted. Two slaves were enough to start drawing fire, it was true, but his plan diverged from Ore-Head’s there. Poor, foolish Ore-Head, who had begun to lose his nerve, and was now burning to death on the mountainside: he’d just needed a little push in the right direction. Now the regular army could take the field.\nZhang Hua charged up a mound of ore, brandishing a rod he’d extracted from the ore processing machinery, and swept a fire-spurting robot off its feet. A blow to the chest plate caused a short circuit, and then it was prone in the rubble, unmoving, silent. But Zhang Hua kept bashing until the machine was in pieces.\nElsewhere around the scar, Zhang Hua’s comrades were about similar business.\nThis was the only way. Only by destroying machine guards and commanders could human slaves really escape.\nWhen Zhang Hua and his comrades were fleeing down the mountainside, most of the scar’s slaves didn’t yet understand their sudden turn of fortune. But soon enough there were dispersing in amazement, the hematite abandoned.\nZhang Hua led his small group down the south face, his destination clear: the tree line, and the concealment of the forest.\n2 – That World\nAs You Ruo set out, the darkness of night was just beginning to retreat before a brightening in the east.\nHe had to begin his great journey by daylight. The dark made no difference to machine eyes, but could greatly affect human movement. Humans were physically inferior to the machines, without a doubt.\nBut no matter how inferior, humans didn’t have to succumb to machine logic, or cleave to the machine imperative, or take machine orders.\nYou Ruo could have arranged to launch his rebellious action at a safer moment, but he wanted to be a symbol, his journey a declaration. He’d been preparing for a long time, putting all kinds of goods in order. The work had been underway for a year. Meticulous thinking had allowed him to do all the planning in his head. He’d never dared to put pen to paper, like so many previous revolutionaries.\nYou Ruo secured his backpack. This was all he’d bring out of his home today, a shovel and a few other tools. His ostensible work was tending flora. He’d buried what he really needed near the border of this vast parkland furthest from his house. There, day by day, while muddling through his gardening and forestry chores, he’d secretly brought things along, and today he would gather them up.\nIt wasn’t warm or cold today, and the sun shone just bright enough. Good weather for launching a revolution.\nYou Ruo headed north from his home, passing a pond he’d excavated himself. At the time he’d meant to dig a small reservoir, so he could swim in the summer, but the machines soon put a stop to this. They were not miserly with water resources, but they’d feared You Ruo would drown, dying prematurely like a moth drawn to flame. After all, his well-being was paramount. The compromise was this little cistern pond, so shallow even frogs ignored it.\nGathering tools wasn’t difficult. You Ruo knew their precise locations, having walked this route daily to review the hiding places and burials. After fetching what he needed, he changed direction, heading southwest. He avoided some dwelling places and came to another supply burial under a flowerbed. Keeping everything in batches like this was minimally risky, and conserved advantage. He turned southeast, passing through a crowd of statues he had been carving for years, all crude and unfinished.\nOriginally, he’d planned to raise some animals around here, but this had also been prohibited.\nHe left the Sculpture Crowd behind, heading for the east side of Demarcation Forest. You Ruo had planted these woods with his own hands. He’d watched saplings reach gradually skyward, and he had named the forest, though it wasn’t really a line of demarcation.\nBut on its east side was an electrified fence.\nYou Ruo’s home was convenient for his current secret operations: far from crowds, located at the world’s desolate edge. This parkland had been allocated for medical therapies, including the treatment—or at least containment—of abnormal minds like You Ruo. He wandered the fields and woodlands, knowing countless machine eyes always watched him. His past escape attempts had brought down everything from kindly remonstration to machine force, but he’d never been harmed.\nThe machines always had his well-being in mind, after all.\nAs early as puberty, when You Ruo had been classified an exceptional and unconventional thinker, he’d been granted special consideration, and closely monitored. He was sent to special treatment wards, given special care, and allocated special resources for his growth and development. His life was custom-made. All care was taken to make him feel wanted, and not an object of discrimination.\nAnd so he’d learned to hide his real capabilities, to bide his time, and to wait for a relaxation of machine vigilance.\nIt was quite a discovery. He wondered if he was the first human to realize that the machines could indeed relax their vigilance. They ran on programs, algorithms, but they could alter these according to observation. Above all, they sought to avoid squandering resources. You Ruo had gradually come to understand this.\nSo, for the past six months, You Ruo had given a very meek and docile performance. He tried to seem like a normal human: content, domesticated, comfortable, and kept. At one point the machine administrators even asked him to move back among the general population of humans. You Ruo explained he wasn’t ready to socialize, that he needed another therapeutic period. The machines amicably granted this.\nNow he meant to exploit their mistake, and conveniently depart.\nAhead, through the trees, was the electrified mesh of the fence. You Ruo crept toward it. The electricity was merely a backup measure. Every time he’d approached the fence before with destructive intent, he’d been warned away by the machines. He’d always preferred the agony of electroshock, which he liked to believe somehow punished his caretakers as well. At any rate, it forced the machines to resuscitate him and transport him back to his room.\nRecalling all this now, he barely noticed the two robot guardians that haunted this place. They inspected and patrolled this section of the fencing, moving among the trees like spirits.\nI’ve always been a strange one, You Ruo thought, suppressing a wild joy in his heart. Today I will not go seeking the others. My first order of business in the free world will be to find shelter. I can always come back and arouse the domesticated to do as I have done.\nYou Ruo struggled to constrain his excitement. He gathered up a rubber watering hose and began watering the trees. He did his best not to raise his head and focused on the electrified mesh. He didn’t want his smiling expression recorded.\nToday, You Ruo’s strategy would be different than before. There would be no surprise attack on the electrified fence. This time he paid attention to the nearest security camera. He glanced at it quite a few times. A direct attack on the fence immediately brought riot suppression robots, but causing a security camera to shut down might read as a malfunction, and merely summon a machine tinkerer. Of course, the deactivating of the camera couldn’t be too obvious. The machine admins mustn’t perceive your involvement. Timing was everything.\nThe water arced further and further from the hose. At the right moment, it was suddenly firing into the security camera, at an angle rain would never hit it. The device probably called for help before going mute.\nHe had about five minutes before the repair bot arrived. And then it would need at least ten minutes to repair the camera. You Ruo dropped the hose, brought out his massive homemade shears, and approached the electrified fence. This section was blind without the camera, and could offer no resistance. When You Ruo was little, he’d used metal scissors to cut electrified wire. Back then, the current had automatically cut off, but of course now was different. The oversized shears in his hands were wooden, and dry, and would insulate him. The mesh crackled and sparked as it was cut.\nYou Ruo thought: This would’ve been more fun at night, a beautiful light show, like send-off party fireworks.\nHe cut a big square-shaped hole in the mesh.\nHe cocked his head a moment, appreciating his masterpiece. He packed away his tool and stepped proudly through the recently constructed gate.\nThe slow tinkerer bot finally showed up.\nAt first, You Ruo was solemn and dignified as he proceeded forward, neither urgent nor slow, his stride vigorous. But when the repair bot began tapping away at its work, You Ruo decided time was of the essence, and took off in a wild run.\nAs he ran, he kept looking over his shoulder, filling his vision with the world of his birth. There was sentiment in his heart, even though he was running away as fast as he could.\nI’ll come back! You Ruo screamed in his mind. I swear it!\n“I’ll come back!” he screamed aloud, unable to stop himself. “I swear it!”\nThe first step toward revolution was a success!\nYes, revolution. That was the word. He hadn’t spoken it aloud for years, but remembering it now, You Ruo couldn’t keep his blood from boiling with righteous indignation.\nBut there was something You Ruo didn’t know.\nThe robots had stopped paying close attention to him. They hadn’t been watching for six months. As long as he didn’t return to teeming streets and publicize his views, as long as he stayed in the wild, open country he loved, why waste time and resources?\n3 – The Edge of the World\nThe dark of the forest was deep and unfathomable. Years of falling leaves had made a thick loam here, like nothing Zhang Hua had ever seen. The roar of helicopters had been left behind, outside the forest. Zhang Hua and his companions had nearly been intercepted.\nNow he had to go on alone. The helicopters couldn’t enter the forest, but they could heat-sense from above, broadly, so there was no advantage in sticking together. The only plan was to split up and hope for the best. Zhang Hua pointed left and right, and his meaning was clear: run for your lives. He plunged into the primeval halls of the forest, leaving behind a party of comrades glancing at each other in dismay.\nThey soon scattered, their brief alliance dissolved.\nThe synthetic rations Zhang Hua had carefully gathered and stored on his person would last two days, at most, but he believed the forest was abundant in wild fruit. He dreaded running out of water more than starving to death. Where there were trees, there must be water, but finding it was another matter.\nWatching the sun through gaps in the canopy, he could tell the time of day, and toward nightfall he began to worry. This region, untouched and unconquered by humans, must be haunted by beasts of prey. It was said they feared fire, but Zhang Hua didn’t have the implements of fire on him. Worse still, he didn’t know which direction to go. His plan had been limited to escaping the work site. He hadn’t thought about what came afterward. During enslavement, freedom had seemed glorious, but on an empty stomach, abstract concepts of freedom were utterly worthless.\nAll he knew, in a vague way, was that some places didn’t suffer under machine control.\nNo ferocious beasts attacked that first night—something at least to rejoice over. Asleep and dreaming, Zhang Hua barely heard deep roars, remote, indistinct.\nHe groped about aimlessly for three days and nights. On the fourth day he began to feel unwell. The berries of this woodland, although fresh, were no match for synthetic rations when it came to cleanliness, and he doubted the potability of the water. Although he’d never eaten his fill in the past, his digestive tract had become used to a certain level of sanitation.\nHe felt his legs were only reluctantly supporting him, let alone carrying him forward. The canopy above grew sparse. It seemed he’d reached the far end of the forest, at last. This restored his spirits somewhat, and the excitement temporarily compensated for his physical weakness.\nSome time in the afternoon, the first small flake fell on Zhang Hua’s head. He flinched with fright, then realized this thing was harmless, a natural phenomenon.\nGlittering, translucent snowflakes drifted down, accumulating in a layer of white powder. Falling on Zhang Hua’s body, they were cold, and dissolved instantly. It had never snowed at the work site, where the phenomenon was merely a legend. Zhang Hua opened his mouth, and a dose of refreshing coolness entered his throat. At this point, he regarded snow as a thirst-quenching beverage.\nBut the snow grew more intense, the flakes larger, sticking to Zhang Hua’s body, which soon grew numb. His exposed skin was frozen, turning purple. The sky was going dark, and all around was a gray void. Passing through dense curtains of snow, he distractedly saw something in the distance, snow-covered buildings or houses. They seemed to be in good repair, out here in the middle of nowhere, like fairy palaces from folktales.\nAnd then he could take no more. After days of overexertion, and inadequate food and water, he swooned and fell into the snow.\nYou Ruo’s technological circumstances were far superior to Zhang Hua’s. But even though his tools were more than adequate, he was venturing into mires and primeval forests, worlds he’d never braved before. In the darkest of forest nights he didn’t dare turn on his electric torch, which was bright as daylight. Who knew what beasts it might attract? His journey was turning out much different from what he’d imagined, but his revolutionary zeal was undiminished.\nPassing through fields, fording rivers, the wild joy of his countenance never wavered. Starting out, he’d still felt some lingering fear of pursuit, but as that first day wore on, the fear had diminished until there was nothing left. Snacking when hungry, sipping purified water when thirsty, this carefree wandering life was actually quite satisfying. You Ruo wasn’t worried about provisions. He believed that before he finished everything he’d brought with him, he would find the utopia from legends, the land of peach blossoms. Besides, his rations were enough for ten days.\nSoon, You Ruo was losing his way in an undulating landscape of hillocks. He’d originally foreseen ascending the first of these and beholding a wide new expanse of flat country beyond. He hadn’t expected to conquer one of these hillocks after another, in seemingly unending succession, and getting thoroughly lost.\nBut in this undulating progress forward, he did not grow careless. He headed due east, consulting a compass once per hour to rectify his course. Although he didn’t know what was under the eastern sky, at least he was putting more distance between himself and his former world. Originally, he’d camped in suburban districts, the western extremity of that world, but now he was in true wilderness.\nAhead, the hills were higher, sheer, and sparsely wooded, like the alopecia-stricken skulls he’d seen in medical texts.\nYou Ruo hesitated. Night must fall eventually, and it would be difficult to find his way amid those copses and cliffs. Then again, high places had their advantages. They commanded wide views, perhaps allowing him to discover something new.\nSo, he began to mountaineer.\nAdding climbing to his physical exertions was not You Ruo’s idea of fun. He thought several times of giving up. About halfway up, on the waist of what was essentially a mountain, he pitched camp. The next day, he nearly tumbled off the mountainside twice. But his faith and conviction kept him going, carrying him through great difficulty to the summit.\nHe chased his breath for a long time. You Ruo was a large man.\nIn his world, men and women were well-built and proportioned. Caloric intake was regulated by the machines, but You Ruo had refused these limits, enjoying excess in food and drink. Eventually, as in much else, the machines treated You Ruo as a special case, and didn’t regulate his diet, merely providing suggestions. But he didn’t listen. Listening here would have signified something larger to You Ruo, and his body itself became an emblem of resistance to machine control. Not that he was a very effective symbol. Wandering parkland wilds, his mass didn’t cause many to ponder the wider implications of disobedience.\nNow, his night vision device revealed heat-generating bodies in distant lowlands: people residing in houses, and judging by their shapes, these weren’t the dwellings of his own people. You Ruo moved across the wide summit, wanting to see the community from a different vantage.\nHe stumbled, tripped, fell on something soft. He put out a probing hand and discovered something warm.\n4 – Communication\nZhang Hua opened his eyes, alert as a cat. His feral gaze fixed on You Ruo.\n“Easy does it,” You Ruo said. “Let me help you.”\nZhang Hua slowly digested this stranger’s words. He hadn’t talked with anyone in days, and You Ruo’s manner of speech was odd. Zhang Hua puzzled over the alien syllables sprinkled among the familiar, and the strange inflections, until meaning dawned upon him.\n“First eat a little something.”\nZhang Hua had been staring at the thing in You Ruo’s hand. Although he couldn’t see it clearly, he guessed it was food. He cautiously took the proffered foodstuff, gave it a few licks, and the delicious flavor did the rest. He devoured it in a frenzy, several times biting his own fingers and tongue.\n“Where have you come from?” You Ruo asked, handing over another piece, patiently waiting for Zhang Hua to finish eating. “East?”\nZhang Hua shook his head, not understanding. You Ruo pointed east, and Zhang Hua shook his head again. He’d lost his bearings.\n“Is everyone from your land like you?” You Ruo said, groping for some way to communicate. He struggled to imagine the difference between himself and Zhang Hua. “How do your people live?”\nZhang Hua wanted more food, but You Ruo showed no sign of willingness to share more.\nActually, there was more in You Ruo’s hand, but he had to consider his rationing against Zhang Hua’s considerable appetite. Luckily, they’d both seen the settlement below, where there was surely food.\nZhang Hua focused on his brain rather than his stomach, and began the arduous process of telling his story to You Ruo, explaining many things repeatedly, and doing his best to answer You Ruo’s barely intelligible questions. In the end, he’d made his place in the world, and that of his people, more or less clear.\n“Well, there it is,” You Ruo said, pensive, thoughtful. “Your people are also controlled by machines.”\n“Your people aren’t any better off?” Zhang Hua asked, desperate to know.\nYou Ruo began to preach. His tale was well-ordered, but excessive in rationality, making it hard for Zhang Hua to understand. Although You Ruo condemned his own people’s pampered way of life at every turn, the specific examples and anecdotes made Zhang Hua yearn for it, utterly. Zhang Hua listened to the account as if respectfully hearing a fairy-tale. He’d heard this sort of thing when he was a child. Now it seemed like a lifetime ago.\nIn his own world, Zhang Hua had not always been the lowest of slaves. In his early years he’d been a skilled worker under the machine domination, and had read about privilege and human rights in ancient texts. This sort of content had been sprinkled throughout reams of technical data, or implied by it, and so had not fallen into the abyss of the Historical Materials Ban. In the pages of those dry and dull specialist manuals, there’d been no descriptions of technology beyond a narrow scope, but reading enough of them had allowed Zhang Hua to vaguely perceive other ways of life.\nHe discovered that humanity had once been free. He discovered that humanity had ruled over machines. He discovered quite a lot from technical manuals, including the revelation that humanity had not always been as it now was. And so was born the seed of discontent within him.\nHis demotion to slave labor was not due to his thought crimes, which would have gotten him thoroughly decommissioned. It was because the technological innovations he’d been assigned to were declared complete. Thus, he was transformed overnight, from middle class technological servant to common laborer.\nThe topic of conversation gradually shifted to the settlement in the lowlands.\n“I’ve heard of people like them,” You Ruo said. “Savages, not under the control of my world or yours. Free and unrestrained. Their material standards must be quite low.”\n“In other words . . . going there would be bad,” Zhang Hua said. He could barely understand phrasing like “material standards.”\n“Not necessarily,” You Ruo said, feeling ideologically awkward. “At least they have freedom.”\nFreedom? Wasn’t this what Zhang Hua longed for? Otherwise, why did he hazard escaping the work site?\n“I want to go to your world,” he said to You Ruo.\nYou Ruo couldn’t believe his ears. “From what I understand, you obtained freedom with great difficulty. And now you want to hand it over, in exchange for . . . some leftovers?”\nZhang Hua didn’t understand the word “leftovers.” To him, it seemed everything You Ruo ate was a precious delicacy.\n“If you really want to go,” You Ruo said, “I can’t stop you. But you may regret it.” The rotund man turned, resolutely facing the sun and heading down the mountain. The silhouettes of the settlement were clear. You Ruo’s goal was clear.\nZhang Hua hesitated before catching up to the stranger. He couldn’t be sure if You Ruo’s world was really as wonderful as described. It sounded like a fantasy, the dream of some mad hermit. Moreover, Zhang Hua was lost. Perhaps following You Ruo was a bit safer, for now.\n5 – Among the Savages\nWhen they entered the village, almost everyone stopped their handiwork and labor, and quietly stared. No one seemed inclined to guard their leader, even as the two outsiders approached the largest thatch structure in the community, which You Ruo correctly took for the headman’s residence. The headman himself soon came out, calm and composed as he looked over his two strange guests.\nAt first there was no way to carry on a dialogue. Neither You Ruo nor Zhang Hua understood the headman’s stern, questioning utterances. There were a few vaguely familiar words, and that was all. But You Ruo was, as usual, completely prepared. He brought out a small interpreting device, and this resolved the communication problem.\nThe two of them were allowed to enter the headman’s home, and were taken to a long meeting hall. Zhang Hua’s nostrils flared, as he detected a neighboring dining hall’s cooking meat. The headman didn’t need You Ruo to interpret Zhang Hua’s expression. Servants were called upon, to treat the guests hospitably, and soon a clay basin of cooked meats was placed on the meeting table.\nThereafter, Zhang Hua didn’t hear a word of the talks between You Ruo and the headman. He devoured the roasted meats from the clay basin, rapacious, oblivious. The guard standing nearby allowed his envy to show through his wooden expression.\nThe meat was soon gone, and Zhang Hua pointed at the empty clay basin, wanting more. A savage brought in a basin of vegetable mush and set it down. Zhang Hua groaned in discontent, but reluctantly went to work on the mush. He’d been eating cheap synthesized rations for most of his life, and here the food was fresh at least, and he’d been starving for most of his journey.\nWhen they left the meeting hall, Zhang Hua couldn’t tell if You Ruo and the headman had reached some kind of agreement. You Ruo seemed content, judging by his expression. Perhaps that was part of his persuasion strategy. Zhang Hua couldn’t tell.\nThey entered a small enclosure off the long hall, apparently a guest room, and Zhang Hua immediately smelled danger. The door closing heavily behind them was just one clue. The greed in the savages’ eyes was another, and more convincing. To Zhang Hua it seemed saliva must soon flow from those eyes. He came from a long history of privation and starvation, and he couldn’t misinterpret the signs. Zhang Hua had been existing on the border of life and death continuously. He was very sensitive to danger, which was how he’d survived until now.\nHe did his best to convey his misgivings to You Ruo via gesticulation. You Ruo didn’t believe him at first, but Zhang Hua became emphatic, at last turning You Ruo’s doubt into half-belief. You Ruo carefully peered out a window. He had, after all, years of experience plotting against the machines.\nThe savages outside the window were whispering.\n“Should we run?” Zhang Hua said, leaning close to You Ruo. Zhang Hua also had covert experience, having frequently communicated escape plans to companions right in front of machine guards. He was sure the savages outside couldn’t hear his voice.\n“Why?” You Ruo said, expressionless, watching Zhang Hua’s unmoving lips.\n“They mean to eat us.” Zhang Hua’s muscles were tense. The first assent or order from You Ruo would send him fleeing.\n“Unlikely, before daybreak.” You Ruo’s expression didn’t change.\n“Murder at night is convenient.”\n“They’re bold.” You Ruo smiled. “They would kill us in broad daylight. They’ll want us fresh for breakfast, won’t they?”\nWhat happened next would settle the question, which wasn’t one of boldness. The savages were indifferent to day and night, and they couldn’t wait for the sun to rise. You Ruo was rich in fat and oil. Zhang Hua was sturdy with lean meat. This sort of chance didn’t come along every day.\nA group of men entered the room. Three were armed with short, dark blades, while others held crude clubs. Zhang Hua noticed some of the younger men licking their lips. He couldn’t help backing away, and nearly falling in the process.\nHungry indeed, You Ruo thought. And not even a token bit of ceremony before the slaughter.\nNot waiting for them to get closer, or crack gloating smiles, he brought out his weapon.\n6 – Leave-taking\nAlthough the door was obstructed, Zhang Hua easily rushed and broke through a thatch wall of the room. He and You Ruo fled, leaving a dead body behind.\nThe laser weapon had originally been used for killing wild animals, but in his panic, You Ruo had used it to discharge a lethal electric shock.\nThey hadn’t escaped without their own injuries. Zhang Hua’s foot had been cut open by a blade, and You Ruo was worse off: his whole body covered in bruises and lacerations. When at last they found a place to rest and gather their wits, Zhang Hua looked at You Ruo and his weapon, in amazement, and the portly man felt awkward.\n“One victory doesn’t mean much,” You Ruo said. “They’re barbarians, without proper reasoning faculties, and we took them by surprise.”\nZhang Hua wanted, more than anything, to propose visiting You Ruo’s wonderous world. But You Ruo beat him to the punch. “I want to go to your people, Zhang Hua,” he said.\nHaving been under You Ruo’s influence and tutelage the past two days, Zhang Hua roughly understood this sentence. But he shook his head, thinking he must have misheard.\n“To remedy the barbarism we just encountered,” You Ruo said, “we must change the world entire.” His tone was full of lofty sentiment. “That means changing the world of machine-controlled humanity!”\nThis sort of bold, visionary talk didn’t move Zhang Hua. All he could think about was You Ruo’s safe, well-fed world. To Zhang Hua, it was the legendary Kingdom of Heaven. He was very interested in that place. Too bad he could only understand it from You Ruo’s words and phrases: spacious accommodations, abundant food, and especially an idle life free of needless manual labor!\nAnd all this obtainable just by giving the machine administrators an identity authentication number.\n“The revolution will depend on your people,” You Ruo said, continuing his speech, “who have suffered the lowest depths of enslavement. In my world, people have become numb, apathetic, sleeping like the dead, their human spirit thoroughly lost!”\nSomewhat recuperated, You Ruo called upon Zhang Hua to begin their journey. You Ruo set off, his sentiments lofty, and Zhang Hua followed behind, laden with anxiety. When You Ruo’s revolutionary zeal surged, Zhang Hua ruminated more seriously than ever in his life. When You Ruo was moved to tears by his plans, Zhang Hua came to his own bold resolve.\nHe would go to You Ruo’s world, assume You Ruo’s name, and take his place and identity.\nAccording to common sense, Zhang Hua’s decision was weak-minded. But it was precisely his ignorance that allowed him to dare something so presumptuous and reckless. In his own world, Zhang Hua had been considered a very intelligent person.\nAt this point, despite appearances, the two of them were already walking separate paths. You Ruo always liked to preach revolutionary principles at Zhang Hua during mealtimes. Of course, he spoke at other times as well. Zhang Hua would listen, silent, his mind often wandering. This annoyed You Ruo. For the sake of food, Zhang Hua could sometimes produce a few words, even reproduce some of You Ruo’s. From this fragmentary information, You Ruo built an idea of the slaves’ situation, and that of their world.\nZhang Hua couldn’t understand You Ruo’s logic, no matter how hard he tried. Why had You Ruo spent so much time and energy fleeing to this desolate mountain wilderness? He followed You Ruo, his pace flagging, frequently falling far behind. You Ruo waited for him every time, shaking his head in frustration.\n“Forget it,” You Ruo finally said one day, his tone pitying. Zhang Hua had lagged behind again. “Go to my world.” You Ruo knew the nest of monsters he’d escaped filled Zhang Hua with yearning. Perhaps Zhang Hua should be allowed to experience it for himself.\nZhang Hua said nothing. You Ruo had saved his life, after all, possibly more than once. Zhang Hua couldn’t just lightly depart after all they’d been through. But he didn’t have the courage to follow You Ruo in emancipating the slaves, then call upon them to free the whole world.\n“There is no happiness there,” You Ruo said. He told his identification number to Zhang Hua. “In the end you’ll understand.”\nZhang Hua nodded. He didn’t know how to say goodbye, really. So, he took both of You Ruo’s hands in his and shook them with all his might. Then he turned and left in a hurry. Perhaps he feared You Ruo would change his mind.\n“In the end you’ll know it’s too late,” You Ruo said quietly, watching Zhang Hua depart.\nHe picked up a nearby tree branch, and leaning on it, turned and continued on his way.\n7 – Two Worlds\nAfter giving Zhang Hua a general physical examination, this world’s machine administrator was astonished: it hadn’t known a human being could transform to such a degree!\nIt gave orders to spare no resources in treating and curing everything.\nFor the malnutrition, he must be nourished. His skin burns must be treated and healed. The pathological change of his internal organs must be medicated. For the missing testicles, prosthetics would be provided. His health would be restored at all costs!\nZhang Hua had never slept so comfortably.\nIn his old life, when the daybreak bell rang, he would long for even one more moment of sleep. But this had been impossible. Any attempt to sleep more had brought down the lash of the electric whip. Sleep beyond the bell had become a beautiful dream for him, unattainable, remote.\nBut now that the dream had been realized, he found it difficult to enjoy its comforts. His internal clock would wake him with a start, and for the first few days he would even scuttle out of bed, helpless against the instinct. Then he would remember where he was, and go back to sleep. But even in deep sleep he would wake randomly sometimes, fearing the electric whip.\nThis state persisted for a month. And then the dread in his heart slowly withdrew.\nAdequate sleep was merely one part of Zhang Hua’s recovery. This world took meticulous care of him, which he wasn’t used to. He started creating disturbances soon enough. The first time he chose food for himself, having never seen so many delicious options in one place, he insisted on taking more than he needed, going so far as to cheat the machines and make them believe he wasn’t full. This accorded well enough with his You Ruo identity, but his digestive problems later that night did not, and he had no choice but to seek medical aid from the machines.\nDuring his general rehabilitation, Zhang Hua saw few other people. Except for a few enthusiastic caregivers and visitors, humans contacted him entirely by audio. All nursing was done by machine. Zhang Hua was, for the time being, unable to adapt to this sort of change. His slave identity, and the master status of machines, had been flipped. Now it was the machines that waited upon him.\nAbandoned by his guide, You Ruo took a winding, confused path to the region of the slave laborers. Eventually he reached this world’s central district, otherwise known as the Capital. His appearance shocked people: none of their physiques were so full-bodied and round, not even the petty technical bourgeoisie of this grim city.\nTheir gazes gradually turned from envy to hostility. They had been maintaining some minimal level of propriety toward him, but this soon vanished as the permeating enmity boiled over. Machine guards swept in to curb the incipient disturbance, caring nothing for the right and wrong of the affair. You Ruo ended up as injured as those who’d moved to attack him. Finally, covered with cuts and bruises, his clothing torn, You Ruo did all he could to break out of the encirclement of machines and hostile citizens, nearly losing his orientation in this blind rush.\nBut he wasn’t blind. His destination was the work site, the scar in the side of the mountain, the iron mine. The creatures of this city were perhaps incapable of joining his revolution, but he reckoned things would be different among the slave laborers. You Ruo had seen them, the toiling multitudes, from a distance. Here at last were Zhang Hua’s former workmates.\nHe believed in a fundamental instinct that would prompt them to join his struggle.\nAlthough You Ruo was bursting with revolutionary fervor, he was cool-headed when it came to specific actions. Rushing among the slaves to raise a blatant hue and cry, demanding rebellion against the machines, would certainly be futile, and possibly cost him his life. You Ruo needed a properly thought-out strategic countermeasure.\nHe made his way toward the work site, calling to the nearest laborers in a low voice. At first they were frightened, but as he got closer, presenting himself in all his alien rotundity, they couldn’t help staring in awe. Obviously, they’d never seen such a well-fed individual in their lives. You Ruo watched their expressions, approaching cautiously.\nAt least they don’t want to eat me, You Ruo thought, noting they weren’t reacting like the savages had. They were betraying suspicion, or awe, not that unsettling hunger. You Ruo would never forget that look.\nHe threw out some remaining crumbs of food from his pack. Several slaves fell, frantically gathering the gifts. Then more fell upon their comrades to fight for what they could. This feeding frenzy soon alarmed a machine guard, but it merely drove the slaves away with threatening words, then passed inches from a frightened You Ruo without any reaction. Its program was to guard slaves, and You Ruo wasn’t on its register.\nAfter it had gone, a bold group of slaves returned. They whispered to each other, their susurrating speech gradually growing louder.\n“Who is he?”\n“How is here at leisure, with nothing to do?”\n“Why aren’t you employed?”\nThis was asked a number of times, with increasing ire. The slaves were still wary of him, but now several leaders advanced to surround him, as if honor bound to do so. This happened to be their lunch break, so the machines were ignoring this potentially troublesome gathering.\n“Why are you all so worried about me?” You Ruo said, thoroughly puzzled. “It’s the machines that should concern you. They are your enemies!”\nHe outlined his revolution, to no effect. He preached until he was hoarse, and it made no difference. At first, they seemed to have no malicious intent, merely rifling through his pockets for food as he spoke. Unfortunately, there was nothing left.\nHe shouldn’t have started resisting. That was his mistake.\nInitially, he understood they were starving, and he spread his arms and let them search to their heart’s content. But when they started examining his weapons and instruments with the curiosity of children, he panicked. He slapped hands away, shoved, and soon he was struggling, gripped on all sides. His instincts took over, and he fought like a trapped animal.\nHis words had failed. Somehow, these oppressed people hadn’t understood, or cared, about the revolution. And now he was on the ground, and they were beating him, seemingly mad with bloodlust.\n“Kill him!” they screamed. “Kill him! Kill him!”\n8 – This World is Primary\nIn a room with almost no light, the thing that vaguely resembled a human opened its eyes.\nFor the first time in many years, a real human was standing before it.\n“After so long, it is surprising that the human body has not changed,” it remarked, suspended in its nutrient fluid. Speaking required no great effort. Although it hadn’t used speech to express ideas in ages, machine implants remedied this. “It’s no wonder, I suppose. You have lived in great comfort and enjoyed a relatively high position. It hasn’t been necessary to evolve.”\nHow did it know what You Ruo’s former life had been like? He said nothing, still frozen in astonishment. His mind was not reacting properly. At the same time, he was very curious. After all, the inner workings of machine society were being revealed to him.\n“Why do you wish to leave my world?” it asked.\nYou Ruo still couldn’t respond.\n“Say something, would you? I haven’t heard a human speak in so long.”\nFinally, You Ruo spoke, and for the first time, to a receptive listener. He held forth on his life and philosophy, nervous at first, but soon with great eloquence.\n“Life in my world is indeed relatively nice,” he said, “but doesn’t allow for an ounce of heretical thinking. Human history demonstrates this state of affairs cannot last. I’ve read my share of history, and I know human nature tends toward freedom.”\n“But,” it interrupted, “are you free now?”\n“Free . . . I don’t even know if I can survive in this world of yours.”\n“You’ll have that answer soon enough,” it said, its tone cold. “When you ran into Zhang Hua, he told you what it was like here. So why did you come?”\n“I believed that here . . . I could fully realize my worth.”\nIt seemed to sigh. “Really? You acted on such a trite and banal idea?”\n“What are you anyway?” You Ruo asked, growing anxious.\n“I am the administrator of this place.”\n“Machines are the administrators here.”\n“No,” it said firmly. “The real administrators are still humans.”\nYou Ruo waited for this humanlike thing to continue.\n“I’m not the only one, of course. There are twenty outstanding minds here, altogether. We supervise the machines. They have no power over us.” For a long time it didn’t speak, then went on with assurance. “The machines have an extraordinary capacity for obedience, after all. And human laborers are the cheapest.”\nYou Ruo was astonished.\n“We twenty minds are enough to run this world,” it said.\n“But . . . to what end?” You Ruo asked. “Reduced labor costs? Soaring profits? What’s it all for?”\n“For one thing, your world’s consumer goods are supplied by us.” It drank from a straw extending into its tank, possibly fortifying itself for the next revelation. “And we exchange knowledge, not just physical labor.” It told You Ruo how his world conducted massive scientific experiments here, experiments that required large scale, cheap human “participation.”\n“But what for?” You Ruo demanded, his worldview in total collapse.\n“To explore the cosmos. What else?” Now its tone was full of yearning. “Humanity’s field of view is too narrow. And its efficiency is too low, of course. At the moment, our sort of highly efficient labor arrangement makes immediate study of the cosmos possible.”\n“You still have high level scientists?”\n“No need. As I said, twenty outstanding minds are sufficient.” Now this human thing sounded amiable. “We, the twenty, give rise to unparalleled thinking, not to mention a functional government. Lower level administration is handled by the machines. No human can think faster than a machine, except for us.”\n“I still don’t understand,” You Ruo said. “Why retain my world? Why not implement your societal model across the planet?”\n“A fine question,” it said, “and one that we cannot answer at this time. Possibly it is down to historical causes.” This was a first, an admission of incomplete knowledge. “Whatever the cause, the result has been a compromise between our two worlds.”\nYou Ruo was dissatisfied with this answer.\n“If, one day, aliens pay a visit,” it said, “your people would make better envoys. We can admit that much.”\nThis thing isn’t human, You Ruo thought, sensing danger, his mind racing. It’s a puppet of the machines.\n“How did you come to decide on your mode of development?” he asked, growing desperate. “How did you settle on this particular evolutionary path, in terms of knowledge? As an outside observer, I’ve noticed some . . . room for improvement. Why not make it twenty-one outstanding minds?”\n“Because you are not qualified,” it replied with devastating candor.\nThis candid talk did not make the humanlike thing feel any sympathy for the visitor, or recognize a fellow talented mind. You Ruo was sent to prison. Three days later, he was brought to what seemed an execution room.\n“Are you sure you want to do this?” You Ruo said, his tone calm, his legs trembling. His revolution needed the sacrifice of martyrs, of course, and he had prepared himself for this. But it didn’t hurt to try.\nThe two slaves holding him remained expressionless, and unresponsive.\nPerhaps they’re deaf, You Ruo thought.\nHe had imagined his martyrdom many times, and some solemn, honorable way to die had always been conferred on him. He hadn’t expected this room full of people, the stink of sweat, and the countless children. Why was he being made to advance among these little ones?\nThe room was vast, making the little machine at the center seem almost comical. As he approached, a black marking on the machine’s surface made You Ruo shiver. He did not resist. All his former attempts at resistance had proved futile, so now he gave in. He was fastened to the machine in an unsteady half-sitting position. Below him was something sharp. He couldn’t lower himself any further because of that.\nYou Ruo suddenly saw a possibility for how the machine worked. For what it was. Not an execution machine after all.\nIt was the only possibility, really.\nThe machine activated. You Ruo screamed, and lost consciousness.\nThe two bloody testicles dropped into a discard receptacle.\nWhen he first woke, it was to piercing pain. When he found the source of the pain, he again lost consciousness. This time from despair.\nLater, he found he hadn’t yet been assigned specific work. He had to do some minimal level of healing first.\nHe endured, his spirit defeated, for three days. The pain was not yet gone, and he killed himself by biting off his tongue.\nHe obviously wasn’t a true revolutionary, psychologically twisted, abnormal enough to see it through. The world would have to wait, possibly many years, for a wiser, stronger person to emerge.\nTwo years later, Zhang Hua died of old age. He was thirty. His laborer’s constitution never adjusted to the easy living conditions.\n9 – The World Entire\nAfter Zhang Hua and You Ruo left this world and that, peace prevailed once again, and the sun showed its smiling face to the well-ordered land.\nTranslated and published in partnership with Storycom.\nXing He was born in Beijing. He has written many novels, including “Incomplete Magnetic Traces,” and he has written more than a hundred short stories, winning many Chinese literary awards. He was awarded the 1997 Beijing International Science Fair Galaxy Award in 1997. He loves to travel, and has visited Sweden, Poland, Egypt, South Africa, and other countries.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}