{"fingerprint": "wSriCLDLAPeaglUSaEeUnJWjk18=", "sitename": "Clarkesworld Magazine", "title": "The Strange Girl by Xiu Xinyu, translated by Emily Jin", "author": "Xiu Xinyu; Emily Jin", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/xiu_07_22/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Strange Girl by Xiu Xinyu, translated by Emily Jin", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "9350 words, novelette\n The Strange Girl\n She closed her eyes and imagined holding the boy in her arms: smooth pink skin, lush and fuzzy lanugo, monolid eyes that took after Shengyuan. She lowered her head, planted a kiss on his cheek, and lightly patted him on the back. The boy, as stubborn as babies could be, wriggled and kicked. A vibration; and then the pungent smell of urine. When the liquid gushed down her hands, she dreamed up a waterfall. Clear, robust, flowing endlessly. Her skin felt numb from the impact.\n In the darkness of the room, she washed her hands repeatedly, then fumbled her way back into bed. Shengyuan stirred. Sleepily, he turned over and buried his face in the curve of her neck, his soft hair rubbing against her chin.\n “Everything’s fine. I was using the bathroom,” she said.\n Something wasn’t fine. She listened quietly. It was an ordinary night in early spring, tranquil, utterly silent, so it couldn’t have been the chirps and squeaks. They’ve already stored away the household items that could potentially be allergens, including a blooming pot of tulips, a few stuffed toys, and a decorative carpet that they had bought on a trip to Turkey. The room felt emptier, for sure, but the issue wasn’t exactly the emptiness either.\n A certain kind of uneasiness has been prickling at her since the day they went to the hospital to register. Shengyuan, dressed in his best tweed suit, paced up and down the hallway. He kept his gaze glued to the walls and the floor as if he were performing a construction quality inspection. Meanwhile, she sat alone by the door of the waiting room as the nurse called out the names of patients waiting in line.\n “Is Lin Shengyuan here?” the nurse called out at last, her southern accent pronouncing Lin like Ling.\n They were guided into the assessment room around the corner. Today’s visit was only for the sake of putting things down on paper, an official confirmation, devoid of surprises; they had discussed the logistics over family meetings. All she had to do was nod. Shengyuan, on the other hand, was in charge of answering questions from the doctor and the lawyer.\n Do you want a child? Shengyuan responded with yes.\n Boy or girl? Shengyuan chose the former.\n Fertilization technology had undergone significant development over the past decade. General anesthesia was no longer required. It merely took five minutes for the doctor to implant the embryo and the other items in the package and fifteen minutes to educate them about the dos and don’ts. The second they stepped out of the hospital, job-seeking care workers loitering nearby rushed up to them, trying to sell their services. The duration and timing of the delivery . . . the weight and IQ level of the baby . . . by the time they elbowed their way through the crowd, they were exhausted and numb, their heads buzzing from information overload.\n Shengyuan’s father would move in with them to help. The decision was made a long time ago. The more trivial tasks, before and after childbirth, were up to them: diet, regulating hormones, checkups, baby formula, homework, parent-teacher conferences.\n “Who will go to the parent teacher-conferences?” she mused. “I hate teachers.”\n Shengyuan was preparing for bed, his voice muffled from toothpaste foam. “You hate what?”\n Her tongue quivered, about to betray her; but she shook her head and let the conversation drop.\n The first two months went by smoothly. Both of them went to work as usual. It wasn’t until another month later that the pregnancy symptoms started to kick in. No deep-fried food was allowed in the house, as the smell of grease would induce nausea. Shengyuan was so anxious that he ended up taking a long leave of absence from work. Colleagues—most were younger—came around to visit, bringing with them an assortment of health supplements. They were fascinated by the pregnancy-safe yoga mat and the smart prenatal education device and took turns experimenting with the body fat scale that measured in grams, like an overly zealous audience inspecting the magician’s props to decipher the tricks. Exercise can help prevent stretch marks. Don’t forget to apply body lotion. How painful is childbirth? I heard that if you get an epidural, you can give birth without pain. You know, people have died in labor in the past because it was such a torture! You’re basically exchanging your life for a child. Their voices were filled with an overwhelming expectation as well as an edge of uncertainty. How are you feeling so far? Big congratulations to you both!\n Are you sure? she wanted to ask Shengyuan. She was ready to abort the mission if he showed the slightest trace of regret. The peaceful, joyous little world they shared, between the two of them, was more than enough for her. She supposed that asking for more would make her greedy.\n Of course, she never asked him the question.\n Bastard was how the other children addressed me.\n Whenever I passed by, they would scream, scatter, hide behind adults, then peer at me with scrutinizing eyes. Sometimes, when Mother wasn’t looking, I would make faces at them. They would then raise the pitch of their screams, like a flock of easily startled sparrows. I’d never actually spoken to them, but I’d been observing them, and I knew each and every one of them by heart: I knew who was the crybaby and who had the nastiest nickname.\n Mother and I lived with Grandma on the top floor of a public housing complex built in the sixties. When the summer heat wave hit, our home was no better than a sauna house. The bathroom, with no windows, reeked of something like a dead rat. Mother and I slept in the living room together on a narrow fold-down sofa bed. Nights were tolerable, as I had cartoons to keep me company; daytime was more difficult. Fortunately, I was at an age when I still harbored curiosity about other people. I would usually pull out a piece of candy to chew on from my secret stash of sweets tucked away underneath the sofa cushion and head to the balcony. There, I watched my neighbors walk their dogs, shop for groceries, and play mahjong, as well as the other kids my age hanging out in the yard.\n Back then, cream was a luxury. On my seventh birthday, Mother brought home an entire cream cake decorated with Mickey Mouse. Wearing a cardboard crown on my head, I waited in the dark for the adults to light the candles, then closed my eyes earnestly to make a wish. The electric overhead lamp turned on again, and I looked at my family surrounding me. The room was clean and bright—rather like the future that I had conjured up for myself.\n Maybe there was some magic to the birthday ritual, or perhaps it was simply because I had closed my eyes and the moment of complete darkness had enhanced my perception. At this moment, I was struck by a great epiphany.\n In the pale lamplight, I saw that everyone around me looked exactly like their parents. One of my cousins, her plump lips and thin eyebrows took after my aunt. My other cousin clearly inherited his flat chin from my uncle. Mother and Grandma had the exact same nose tip. Though subtle, the way they frown, smile, wink, and grimace were almost identical. The similarity, I recognized, was an emblem of blood. Of closeness. Of kinship.\n I looked nothing like my mother.\n That was the moment I realized what bastard meant. I burst into tears. My family, gathered around me, looked at each other in confusion. At some point the cake was cut and split. Someone stuck the biggest slice of cake into my hand, the one with Mickey Mouse on it. One of Mickey’s ears was disfigured; the silky, rich cream smelled bitter. When I tightened my fingers around the cake, it transformed immediately into cold, grayish mush.\n Mother held my face between her palms and dabbed at my tears with her thumbs. Her fingertips were covered with thick, rough calluses from tedious housework that scratched against my skin. I silently endured the pain as her hands stroked my face, again and again.\n From the start, she was reluctant to having Shengyuan’s parents move in with them. Their one-bedroom apartment was too cramped for four people; renting another place for them to live would add another expense. After some very diplomatic negotiations, Shengyuan’s mother agreed to stay home while his father came to stay with them. Though the situation was not ideal, she knew it would be impolite to push them further. After all, Shengyuan was their youngest son, as well as the only one who moved to a different city.\n Before they could settle on an official move-in date, Shengyuan’s father arrived at their home unannounced, carrying a simple suitcase. A cold wave had hit the city, so he was wrapped in a dust-colored heavy jacket buttoned up to his chin. Standing stiffly by the gate, he almost resembled a terracotta warrior.\n Shengyuan and his father were similar in build. They both had monolid eyes, thin lips, and lush, curly hair—though the father’s hair was grizzly. They both went to mediocre colleges after attending mediocre high schools and graduated with degrees in architectural engineering. They both married at twenty-seven and planned for their firstborn in their thirties. They both preferred smooth, steady machines, and a smooth, steady life.\n Seeing Shengyuan’s father was like seeing Shengyuan in his sixties. They were so much spitting images of each other that it felt eerie to her.\n “You should’ve told us that you were coming,” said Shengyuan. “We would’ve come to pick you up.”\n “Should’ve told us,” she repeated mechanically. “ . . . should’ve come to pick you up.”\n Shengyuan’s father studied their faces carefully. His expression was enough to make her tense up. He was a quintessential “adult” who she instinctively wanted to keep at an arm’s length even after she had become an adult herself. He was somber, austere, and he always played by the rule book. The problem was she had no idea what was written on the rule book.\n She made sure she was being a good hostess, attentive to the most minute detail: she boiled water, made tea, washed some fruits, and laid out the guest bedding. Shengyuan’s father responded with a brisk and hard “thank you” to everything she’d done. He patrolled their living room with a tape measure in his hand, spending hour after hour measuring the size of their furniture so that he could reposition them. “To avoid bumping into them,” he said.\n “Just ignore Dad,” said Shengyuan. “He’s here to help us out. He won’t be an inconvenience.”\n Most of the time, Shengyuan’s father was as silent as a statue. He installed himself in the living room, reviewing project proposals and running codes. Shengyuan told her that the local architectural institute hired him back again, after he had already retired, for his expertise. Occasionally, he ordered them to go on walks, for the sake of the baby. He also insisted that they plan their weekly meals like a restaurant menu but one in which the proportions of the types of vegetables were meticulously calculated according to taste and nutritional value.\n “The rest of the family is behind this,” remarked Shengyuan. “Otherwise, why would he care so much?”\n She couldn’t bring herself to ignore Shengyuan’s father completely, though her attempts to interact with him almost always made her feel worse. She felt as if she were taking care of three people at once: Shengyuan’s son, Shengyuan’s father, and Shengyuan himself. Their identical faces melted into an indistinguishable whole, the token of an entire family’s rules and expectations.\n When she first met Shengyuan, she thought that the people in his family were treated like pawns. Everything they did was for the sake of the family.\n “I’d say that we’re more like raffle tickets,” said Shengyuan. “Dad and I are second prizes; my third uncle, who made it all the way to chief engineer at the provincial architectural institute, is probably a first prize. After all, he found jobs for so many people in the family.”\n “What about the appreciation prize?” she asked. “What kind of person gets to be the appreciation prize? You know, the kind of prize they give you to show appreciation for your efforts, even if you haven’t exactly accomplished much.”\n “Well, it’s not exactly the family showing their appreciation for you, is it?” responded Shengyuan. “It’s rather the other way around. You’re the one who’s supposed to show appreciation for them.”\n I couldn’t remember how exactly they took Mother from me. I remembered the day when it happened, though. It was the day after my seventh birthday. Apparently, Mother had committed some terrible crime and would serve a hundred years in prison.\n I used to think that she had abandoned me but now looking back, I realized that she had tried her best to give me a relatively carefree childhood. All that I have of her is memory fragments: holding my hand as we took a stroll in the park together; I picked a bright yellow tulip and tried to chew on its petals. She was the one who bought me the Mickey Mouse birthday cake.\n Occasionally I recall the face of Father, too. Grandma kept around a bunch of old photo albums, and I found a picture of him. He had pronounced brow ridges and a pair of bushy eyebrows. The corners of his mouth drooped downward. To be honest, he wasn’t exactly handsome, but Mother was in love with him, nonetheless. I couldn’t understand her love. Most people couldn’t. In the words of the police who came for her, her love was “fanatical.”\n My adoptive parents, on the other hand, were the most ordinary people you could find. They were in their late forties when they adopted me, having just sent their last child off to college. According to their social evaluations, they had “adequate parenting experience” to take care of me. My job, on the other hand, was to keep them company. Dispel their loneliness as empty nesters. I reckoned that I was no better than a pet or a potted plant. Belonging to the older generation, they held very conservative views toward dating in general. In turn, I played the role of the good, obedient daughter, and steered clear of all sorts of relationships throughout middle and high school.\n When I turned fourteen, my adoptive father was offered a pay raise with a relocation. Our family moved to Chengbei. Chengbei, bustling and colorful, was more magnificent than any metropolis that I had dreamed of. The walls of buildings were decorated with vibrant artwork. At night, the labyrinth of billboards radiated with light. Behind every tall glass door were sparkling chandeliers and extravagant music. After we settled down, my adoptive father bought a cake for the family to share. The cake, too, was exquisite: high-grade cream, blueberries imported from Chile, edible gold foil for embellishment. We lit the candles and took turns wishing for a happy new life.\n I became the new kid at school again. On my first day, our class president was charged with the task of taking me to collect my new textbooks. She halted just as we arrived back at our homeroom and spun around. “So you’re the strange girl?” she asked, raising her voice.\n I knew what she meant by strange. Compared to what I was used to hearing, “strange” was a polite way of putting it.\n “You do know that you’re different from us, right?” She shot a nasty look at the textbooks in my arms, as if I had stolen them.\n I hoped that I didn’t know. I held my breath and nodded quietly. Students looked up from their work and glanced in our direction, annoyance flashing across their faces.\n I went back to my desk and sat down. I mentally transported myself back to Grandma’s, standing on the top floor balcony. The sweetness of candy filled my mouth. I gazed down upon the entire world in silence. I was so tall that everyone else was like ants to me.\n Some people tried to talk to me, but I brushed them off. It wasn’t until literature class in the afternoon that I snapped out of my dream, when the girl sitting next to me patted me on the arm.\n “How are you feeling?” she whispered. “I mean . . . how do you live with yourself? I can’t even imagine being in your position.”\n Her question finally pushed me over the edge. My stomach was twitching from having skipped breakfast, and I had no patience left. I stood up abruptly, shoved the textbooks and stationery off my desk, and turned to her. “To hell with you,” I yelled.\n If I had been just a little more rational, I would’ve realized that she meant no harm. Her hand was soft and warm; her words, though oblivious, were not malicious. But why did it matter? I knew what they were trying to say anyway. Cursed. Weirdo. Monster. Who would want to marry you? You’re a bastard. School rules restricted them from saying those words aloud, but they had other creative ways to get the message across. Sometimes they filled my desk drawer with handwritten notes, which I shredded with my nails—jagged because I was always picking at them—and flushed down the toilet. Other times, they emptied the classroom’s trash can into my drawer. I came back to find my belongings buried beneath hair, cookie crumbs, and chalk stubs. I quietly returned them to the trash can.\n I couldn’t care less about other people. I measured my height regularly and jogged every morning. Every time I went to the bathroom, I carefully examined my reflection in the mirror. How tall will I become? When will my breasts start to grow? Will I have wisdom teeth? The process felt fun, like solving riddles that no one knew the answers to; I was collecting clues to decipher the mysteries posed by my future self.\n A few weeks later, the teacher found out about the “little inconveniences” in my desk drawer. He made me an after-school counseling appointment. It turned out that the counselor, who had a childish round face, had no experience with students at all. After she saw the score on my screening questionnaire, she called my foster family immediately.\n I didn’t know what my adoptive father had said to her on the phone. Her face crumpled. The mask of shallow, professional empathy fell off, revealing a look of utter pity that made me tremble. I turned around and ran out of the counselor’s office. It was a bright, crisp afternoon. Sunshine poured into the hallway from open windows, and the tiled floor glistened with a golden glamour that resembled the glow of a shimmering lake. I dashed down the hallway. I was running on water.\n Early summer weather was especially dry, with no rain for weeks. She developed a rash. The skin on her arm was raw and covered in spots. The emergency care doctor handed her two clear plastic bottles full of black, round pills, which reminded her of elixirs that she had read about in myths.\n “Never heard of this medication before, have you? It’s an anti-allergy pill that suppresses your immune system response.” acclaimed the doctor whose gaze was fixed lovingly on the bottles. “Only the experts recognize what a groundbreaking invention it is. Why, if it had been developed a decade ago, our entire world would’ve been different!”\n But no. Artificial wombs were invented first.\n She stowed the leftover medicine away in the bedside cabinet, between the folate and a few bottles of synthetic hormone pills. Their cabinet was a comprehensive collection of medications with varying specialized effects: reducing pregnancy vomiting, treating insomnia, strengthening the lumbar spine, and relieving joint pain.\n She had pictured various kinds of difficulties posed by pregnancy, but she couldn’t even begin to wrap her head around the heaviest burden—the feeling that the self was transformed into a cup, a pocket, a vessel designed specifically to hold and carry. Something was deeply rooted in the body and every second it grew a little larger. When she went out for walks with Shengyuan, they would deliberately avoid the crowd, embarrassed by how they looked like a mess.\n They had discussed the logistics of family-making before they got married, having a child at the right time was unanimously agreed upon—though, they never went into the details regarding what exactly was the right time. Shengyuan thought that now was the perfect time; she was skeptical.\n Shengyuan must’ve sensed the doubt in her mind, because he stopped speaking to her. For the five days leading up to the second checkup, they did their daily routines in silence: stirring the nutritional mix, washing up, and lying down. The silence between them was elongated into a rope that was stretched tight, with one end in Shengyuan’s hands and the other end in her own hands. As long as they both held on to the rope, the tension would carry on.\n Shengyuan and his father were already having breakfast when she woke up. They sat at the table, face-to-face, forks moving in unison. They were having the exact same toast and eggs. She could smell the burned sweetness of caramel.\n “Take it easy,” she said. “Don’t you always skip breakfast?”\n “He didn’t sleep well,” Shengyuan’s father chimed in. “He gets hungry when he’s tired.”\n Shengyuan nodded in agreement and flashed her a smile. “Come join us! You don’t want to miss Dad’s signature dish.”\n The rope was let loose. Someone must’ve talked Shengyuan out of his discomfort, analyzing the situation for him. Analyzing her. She realized that the Shengyuan before her was no longer the thirty-something adult that she committed the rest of her life to, but a child. Someone’s son.\n A pang of jealousy surged, though she couldn’t quite pin down what exactly she was jealous of: the hot breakfast, the words of Shengyuan’s father, or the smile on Shengyuan’s face?\n Five years ago, they had a simple wedding in Chengbei, in a cozy garden venue. The only guests invited were relatives and close friends. Before they exchanged rings and vows, Shengyuan whispered to her that no one in the world knew him better than her. She was a twenty-five year old who had fallen in love, and she was willing to believe anything. She reckoned that someone more experienced with the ebbs and flows of marriage would have known better.\n She retreated into their bedroom and stood in the corner to catch her breath.\n The next morning, she set the alarm for 5:00 a.m. The same routine repeated week after week, where she would rise early and make breakfast, noisily tinkling kitchen appliances against each other, until no one in the household could bear to sleep.\n Finally, Shengyuan’s father announced one day that he was leaving Chengbei early, with the excuse that there was family business to take care of. All of a sudden, the house belonged to them again. Though she appreciated the breather, she couldn’t help but notice that Shengyuan called his family almost every day, for at least three hours.\n “What is this about?” She approached him with her concern. “When can you really grow up and leave your birth family behind?”\n “What do you mean by leaving them behind?” asked Shengyuan. She could see that his confusion was genuine. “Family isn’t a signpost or a tavern. Family is the pair of shoes that will accompany us throughout our journey of life. You know it was my family that saved my life.”\n She knew what he was referring to. At the age of thirteen, he was injured terribly from a car accident, and one of his cousins donated him a liver. Being a part of a family so large and well-synchronized would give people the illusion that they were invincible. Immortal. That they were able to gaze at the world until the end of time with eyes that automatically renewed upon expiration. The family even subscribed them to a sizeable monthly pregnancy allowance, so that both of them could take long breaks from work and focus solely on the baby.\n She pursed her lips. Pain was prickling at her. She imagined herself confined to an enormous bed with white sheets, stitched together from pieces, bleeding, and unable to lift a finger. Her head buzzed. She was simultaneously waking up and falling asleep.\n My ninth plastic surgery appointment was only to adjust the tip of my nose. The cut was so tiny that I could barely see it. The surgeon said the wound would be ready for cleaning the next day.\n As I applied lotion, I examined my new face. No one noticed that I had been through plastic surgery. My adoptive mother could tell how I was growing to look like her, but she attributed the changes in me to the fact that people who live together would usually develop similar features: we both applied hand cream habitually, so our hands were equally as soft; we both took on the hobby of dancing, so we had the same thin shoulders and long necks. Her other biological children were the same. She was much older than I, but when we appeared side by side, no one would doubt that we were related by blood.\n Which meant that I could leave my past behind and pretend that I lived a normal life.\n I never visited Grandma again. I didn’t want my adoptive parents to think that I would abandon them for my old family. However, Grandma fell and hurt her knee, and I received her emergency call. I had to go on leave from work and return to my hometown, taking turns with my uncle in caring for Grandma.\n We got along well, like every other pair of grandma and granddaughter.\n After two decades of being estranged from home, I was able to accept everything, more or less, with calmness and rationality. The overwhelmingness of my own existence no longer made me burst into tears. More so, I realized that I was, in fact, more similar to Mother and Grandma than I gave myself credit for at the age of seven. There were differences, sure; but we had much more in common than I had expected.\n “It’s getting cold,” said Grandma. “Your mom used to be afraid of the cold. She was so stubborn, though, when she insisted on going out with you for a snowball fight, carrying at least seven heating pads with her. She was freezing when she brought you back, her tongue so numb that she couldn’t speak.”\n “I don’t remember anything about snowball fights,” I said, feeling a numbing sensation at the tip of my tongue as I spoke, as if snow were filling up inside me and sending a chill up my throat.\n “That’s the kind of person she is,” remarked Grandma. “Even if you give her a drawing compass, she will try to draw you a square.”\n I never visited Mother, either, until I turned eighteen. By law, I became the guardian of my parents when I reached adulthood, and I had to sign papers for Mother at the prison. Unlike what I had imagined all these years, the prison wasn’t dark and gloomy at all. It resembled more of a school or a bank, with slogans such as Love Your Work! splattered across the walls. After I signed my name, according to protocol, the guard asked me if I wanted to see my parents. I agreed.\n Father declined my visit. To him, I was a complete stranger.\n Mother, on the other hand, stood up at once upon seeing me. Her eyes scanned me up and down. She seemed older than I had remembered but surprisingly younger than the headshot that the prison put on her file. She was well-groomed, with her short gray hair brushed back and tucked behind her ears. The guard told me that she had been reading on her own while serving her sentence; that was probably why she retained her soundness and sharpness. Despite not looking anything like my seven-year-old self, she recognized me as her daughter from first glance.\n “You’re much taller than I am,” she said. “Your adoptive parents must’ve been good to you.”\n “Yes, they were good,” I said, lowering my gaze to the empty chair in front of me, unsure of whether I should sit down.\n Mother took a step forward. She clutched the bars with such force that her fingertips turned pale. Her nails were jagged. “Are you married?” she choked.\n Behind her was another slogan, written in blinding red, Any Improvement is Progress.\n “I’m only eighteen,” I said. I couldn’t bring myself to look at her, so I fixed my eyes on the iron bars. I could smell their rusty, pungent scent.\n “Don’t bother,” said Mother. “Eighteen or twenty-eight, what does it matter? Even if you live up to ninety-eight, no one is going to marry you—let alone have a child with you.”\n “I will marry,” I responded firmly.\n I had just been accepted to college. I had never received a single love letter in my life, nor had I ever shared a secret kiss behind library stacks. But in that moment, I was absolutely certain that I was going to marry someone, to belong to someone—to belong to a grand, everlasting family.\n Mother smiled, as if she had been expecting my answer all along.\n Patients in the plastic surgery clinic were used to giving each other emotional support. We huddled around in the waiting room and shared stories. After all, we were still young, and afraid of pain, failure, and other uncertainties. Some of the patients were like me, hoping to look more similar to their parents; others were rebels who flipped through the catalog of cheekbones and hair colors as if they were shopping for new phone cases, willing to tolerate endless cuts and pinches in order to look as different from their parents as possible. Some went as far as to trim their ears into the shape of diamonds.\n Whether we looked like our parents didn’t, in fact, matter.\n Appearance-wise, I was nothing like Mother, but I could feel an intense, intimate, and invisible resemblance reverberating in our blood. I belonged to Mother; or, more precisely, there were pieces of Mother ingrained within me and pieces of me imprisoned alongside her. My scalp tingled. Tears welled up in my eyes. I spun around and retched.\n The guard led me out. I never went back again.\n Shengyuan’s family was against plastic surgery. Their appearance was purely genetically determined: dark, lush hair, thin lips, and a slight hump on the nose bridge. Build-wise, some were taller, or slimmer, but in general the same shape. The first time she visited Shengyuan at his home, she wore her new ink-blue polka-dotted dress. An assortment of Shengyuan’s granduncles and uncles came over to meet her—five granduncles, maybe, and nine uncles—showering her with lucky red envelopes that amounted to tens of thousands in cash. Until this day, she couldn’t tell most of them apart, let alone remember their names.\n A pair of fifteen year olds left a deep impression on her. When she saw them, they were curled up on the sofa, playing cards and sipping coke. They were wearing the exact same clothes and hairstyle—though, they weren’t born twins. Apparently, they deliberately chose to look as identical as possible, so that they could pull pranks and cover for each other. The women in the family did not bear such uncanny resemblance to their daughters, yet she could still see the mothers in the daughters from the shapely figure and long neck they shared. The generations of men in Shengyuan’s family must have a very particular kind of taste when it comes to choosing a spouse, she mused to herself.\n “Rearing children is a hard job,” said one of the uncles who had a beard. “But then again, you reap what you sow.”\n She realized that she didn’t have to agree or disagree with him on the spot. She spoke to everyone with a smile that was rehearsed to perfection. Shengyuan’s cousins took turns telling her all of Shengyuan’s childhood stories: with extraordinary creativity as well as patience, he renamed everyone’s old toys that were passed down to him. Red Lightning the race car became Fiery Heart; Billy the Dinosaur was reintroduced as Giant Rex. Shengyuan, the youngest one of his generation, grew up with hand-me-downs. His life was a medley of faded jeans, pencil cases that were missing corners, and heaps of old toys. Only the names he called them by were brand new.\n “Hey, I’ve grown up,” complained Shengyuan, clearly embarrassed by his own stubbornness as a child.\n Grown up? The more appropriate description was grown old. On one of the nights, she tiptoed to the bathroom in the darkness as usual, only to find upon returning that their bedroom was lit. The bedside lamp was on, casting a cold glow on Shengyuan. He laid on his back, soundless and unmoving, his eyes open. His lips were devoid of color. He’d been having trouble sleeping. He was always tired and sluggish. She could see deepened wrinkles at the corners of his eyes. They were both aging faster, she noticed; as if the fetus had crystallized from drops and pieces extracted out of their own lives. Perhaps that was the way of life, an ultimate law of conservation.\n She crawled into bed and hugged Shengyuan, between them the distinct bump of the belly. A slight breeze seeped in through the window crack. The expansion of the uterus would deprive the internal organs of the space they used to have. They would be compressed, distorted, pressed into the diaphragm of the chest cavity. Could someone still be considered the same person, when everything contained within their body has shifted shape? What if they grew taller, slimmer, or older?\n After a long silence, she came to the epiphany that the uneasiness that she had been bearing all along was in fact, a feeling of strangeness. She felt estranged from her life.\n “Did I wake you up?” she asked.\n “Are you still lonely?” whispered Shengyuan. “I will always be by your side. We will have a child together. Are you still going to feel lonely?”\n She was about to utter yes, but she stopped herself short when she saw the look on Shengyuan’s face. His eyes were so bright and eager that his entire complexion lit up. She could see the attentiveness, anticipation, and devotion in his gaze. Without a doubt, she knew that he was trying to reassure her that she was loved. But she didn’t want to lie to him either. To lie was to hurt; though she wasn’t sure whether he understood that.\n “Hey, baby, you’ve grown up,” she said, running her fingers through Shengyuan’s fuzzy hair before she reached over to turn off the lamp. “You should know that loneliness isn’t necessarily a bad thing.”\n Dim lighting and alcohol usually led to leaked secrets. Pretending that I was listening, I kept my eyes fixed on the people on the dance floor. Through the thin veil that separated where we sat and the entangled bodies, I saw that everyone’s face was brimming with the desire of seeking for something. Pressing their torsos together, they twisted and turned. So intimate. So similar. The dance floor was the kaleidoscope that I remembered from my childhood: overflowing with varicolored shards that twisted and turned in the prism, generating infinitely unique patterns.\n “Isn’t she beautiful?” insisted the man sitting across from me as he knocked on the table to get my attention, clearly irritated.\n He slid his phone into my hands. I forced myself to bring my attention back to him and glanced at the screen. The picture he was showing me was the portrait of a woman in her thirties wearing a wrap dress. Her dress, green with white floral print, reminded me of a lush tropical plant. She had the facial features of someone born in the south.\n “My cousin-in-law,” he explained. “She’s the most beautiful one in my family, and the most romantic. Though I have to say that she isn’t exactly the brightest—a little too greedy.”\n “You should introduce her to me,” I said. “I love making friends with greedy people.”\n “But she isn’t supposed to give two people equal amounts of love! It’s not a permutation—not a proper subset—not an arithmetic sequence—” He snatched back his phone, his voice shaking from rage. “Not mathematical—”\n The night eventually concluded with him vomiting all over the floor. How repulsive. I snuck out when the bartender was mopping up the mess, leaving the bill to him. The biggest accomplishment of the night was the picture he showed me. Somehow the woman’s face struck a familiar chord. I looked her up online and realized that I had indeed seen her in the news. It turned out that the man I was seeing not only had a legendarily romantic cousin-in-law, but also a cousin who was a murderer (after catching his wife and his brother in bed together, he killed them, and then jumped out of the fifteenth-floor balcony). After the incident, his entire family was constantly haunted by the question of what had gone wrong. Which part of their genetic composition led to the tragedy? Would something similar happen again, to themselves, or to future generations?\n True, family was not a permutation, a proper subset, nor an arithmetic sequence; family was a sense of safety that came with disaster.\n “There is nothing new under the sun,” one of my law course textbooks said. “There aren’t new humans under the sun, either. Thus, our society is stable, and everyone bears their own responsibility.”\n People who shared the same genes were subject to joint indemnity, gene-leaking was an abuse of rights, the limited liability of genetic authorization, and so on. I sold my textbooks and notes the moment my exams were done, unwilling to look back at those phrases.\n “Contestants, please submit your application form to the box by the door,” said the staff at a beauty contest that I once partook in. The contest was all about marching around in heels and maintaining a perfect smile in the blinding spotlight. I left enough of an impression on the judges; they thought I had “distinct features” and recommended agents to sign me.\n Of course, no model agencies ever reached out because all the personal information that I had put down were made-up: a false phone number, a false identity, and most importantly, false genetic codes. Before dropping my application form into the submission box, I caressed its smooth pages, leaving behind the only thing that was real—my fingerprints. Well, the affirmation of the judges was also real. Their gazes, thick with admiration, were like sticky duct tape that held me together, preventing me from collapsing into a meaningless pile.\n In the same vein, I never gave much of myself to relationships. It was up to the other person to shower me with love and affection. I would close my eyes when they leaned in to kiss my cheek. Some would apologize for rushing into things, and then drive me home. Some would kiss me again. Some, in the middle of a dinner, would pull out a rose bouquet, get down on one knee, and present me with a ring in the sorrowfully beautiful music. However, as soon as I walked into the premarital registry with them, they would see my documents, flare up, and accuse me of lying.\n “You told me that you didn’t care about my family situation,” I said.\n “It’s not the same,” they responded. “You don’t even have a family.”\n Five months into the pregnancy, the nausea exacerbated. The vomit not only consisted of undigested food, but also foul-smelling mucus, a mixture of bile and gastric acid. She made sure to always smile whenever Shengyuan was present, so that he wouldn’t get overly anxious. Though, deep down inside, she suspected that Shengyuan hadn’t the slightest idea what was going on in her mind, nor did he know how much effort it took her to fall asleep every night.\n Many people would think that their husbands preferred boys because of selfishness. Knowing Shengyuan, however, she knew that he just didn’t want her to suffer more.\n Shengyuan’s father sent them an ultrasonic massage device that was apparently good for the baby.\n She remained skeptical toward the wonders of new technology, though. After all, a century ago, people claimed to have invented a drug that could cure cancer. It turned out that the new technology was a major toxicant that ended up contaminating the atmosphere, the oceans, and eventually all humans. It wasn’t until the twenties that people began to notice the drastic drop in fertility rates across the globe. After ruling out social factors like declining marriage rate, rising divorce rate, and aging population, medical researchers were able to pin down the cause of the problem: people were starting to become allergic to other people’s genes. Around two weeks into a pregnancy, the immune system, activated by the intrusion of the fertilized egg, would launch an attack. The uterus would spasm intermittently, shedding its lining in chunks. As a result, the miscarriage rate at ten weeks was over eighty percent, and the miscarriage rate at sixteen weeks was an absolute one hundred percent.\n For five years, no single human on Earth gave birth. The future of humankind was bleak until artificial wombs were invented. It was a struggle, but at least humans were able to reproduce and pass down their genes in a more effective way.\n Unfortunately, those artificial wombs were unable to operate on their own. Doctors must implant the womb, which bore the embryo, into the body of the patient via laparoscopy. After eight months’ wait, with the help of hormone-regulating medication, the child would come into shape. Psychologists had claimed that preserving the process of pregnancy was beneficial for strengthening the emotional connection between parents and child—like the old saying went, you reap what you sow.\n The pregnancy checkup room was across the hallway from the nursery. When she waited in line for her turn, she would peer through the glass and observe the newborns—eyes squeezed shut, skin red and covered in wrinkles. Even as newborns, they looked starkly different: varying thickness of lanugo, round or pointy heads, wider or narrower noses. She was fascinated by how complex those tiny creatures could be. However, no matter how intently she focused on them, she still couldn’t bring herself to imagine Shengyuan and herself having a baby like that.\n On their fifth anniversary, they exchanged love letters that detailed a hundred things they appreciated about each other. She liked Shengyuan’s sense of order, and the clean, crisp lines of his handwriting; Shengyuan had a fondness for the erudite vocabulary that she occasionally dropped into everyday conversations, and her “motherly gentleness.” His mention of “mother” frightened her, for reasons beyond the flashbacks of the Mickey Mouse cake and prison. Her mind kept on drifting to a particular outdoor day during elementary school, when she witnessed how a family of spiders, clustered around a tree, spun a web together so large that the entire tree was bounded in milky-colored chains. To her, “mother” was the tree; she couldn’t quite tell whether it was the spiders’ home, or the spiders’ prey.\n She held on to the ultrasonic massage device with two fingers and pretended to fumble around for the switch. Shengyuan took it from her and put it back into its box. “It’s fine. We don’t need to use it. It’s too new, anyway.”\n She nodded. She caught herself picking at her nails again, a habit she’s been unable to break since middle school. No matter how smoothly trimmed the nails were, as long as she could find the right angle, she was able to easily peel them apart.\n She started, “I’ve been thinking,” she squeezed a broken tip of a nail, trying to feel the prickly pain. “How do you feel about having a daughter?”\n The glass walls of the World Trade Plaza were plastered in lavish Christmas decorations: Banners that said Merry Christmas, golden ribbons, glittery cardboard snowflakes, and wish cards addressed to lovers. It was a deliberately crafted scene of blissful happiness. The snow grew heavier. At the last turn of the Chengbei main road was a small traffic jam. The driver of the car next to mine rolled down his window and flicked his cigarette. Car horns echoed in the distance.\n That was when I saw Shengyuan, trotting down the road. He was knocking on every car window to apologize individually. His fingers, frozen from the cold, were too stiff to bend, so it almost seemed as if he were tapping on the windows with his fist. Examining his face, I rolled down the window as he approached.\n “My tires are stuck,” he explained, grimacing. “There’s a pit up ahead. I panicked, and I drove into it. The traffic police should be able to tow my car out of the snow in about ten minutes. I’m so sorry.”\n “That’s okay,” I said, slipping a heating pad as well as my business card into his hand. I was intrigued by his good nature, by how he was able to retain his calm in the midst of a nerve-racking incident and bring himself to issue an apology to everyone.\n “What happened on that snow day was a careless incident,” Shengyuan acknowledged on our first date at an architecture exhibition. “Though, I’ve already experienced what it’s like to be in a car accident when I was a child, so I shouldn’t have panicked so much.”\n One by one, he explained the architecture models to me. The largest building was around tens of centimeters tall, equipped with glass windows that led to the rooms. To my surprise, the rooms were furnished; figurines scattered around as if they were busy with their own lives. I had the perspective of God. I was overlooking this miniature world and imagining a life different from my own.\n After leaving the exhibition, we took a stroll by the lake. It was a brisk, sunny fall afternoon. Water reflection transformed the rays of sunshine into bolts of lightning that stung my eyes. After I told him all about my family, he fell silent and turned to look at me. I reckoned that the reason his gaze was so penetrating was because he spent his days in front of design maps. In his eyes, I was transparent, and he could discern my genetic makeup as effortlessly as he dismantled skyscrapers into steel, concrete, and load-bearing data.\n “Which means you’re not mass-produced,” he remarked. “You’re a unique work of art.”\n I loved him and depended on him.\n I was so grateful for him.\n But now, I only wanted to smash the furniture into pieces and dig my nails into my own arm. The curtain fluttered in the wind, and the light flickered, as if we were on a boat caught in the storm, sailing toward an unknown island—or a dangerous reef.\n Shengyuan did not speak. Silence has always been his way of showing resistance. I took a step closer to his turned back. Slowly, I repeated my question, chewing on each word, “why can’t we have a daughter?” I’ve asked him the same question too many times.\n “I’m worried about the pain,” he said. “It’s only going to hurt more.”\n “When have I ever whined to you about pain? Think about the number of plastic surgeries I’ve been through. I endured some of them without anesthesia. Why do you think pain would be an issue for me?”\n He spun around. “You want a divorce, don’t you?” He crossed his arms at his chest and pressed his back into the wall. “You’re tired of us, because we’re all the same.”\n “Because it’s not our child,” I said. “It’s yours. He only belongs to you.”\n “You don’t understand. I am the one who belongs to him, a complete stranger to me. I will only grow as tall as he could grow; he never shed a tear in his life, so I can’t even goddamn cry no matter how much I want to!”\n Shengyuan’s face twisted. In the heat of the moment, my mind flashed back to the story about the man who killed his wife, his brother, and then himself. What had glitched in their genetic code? I was paralyzed with fear.\n Shengyuan didn’t cry; he never cried. He was a broken porcelain statue glued back together, about to crack and shatter any second. I stood in numbness, waiting for him to lose control.\n Nothing happened. He simply closed his eyes, cupped his hands over his ears, inhaled, and exhaled. That was his way of repairing himself, a special skill that everyone in his family possessed—it was what had drawn me to him in the first place.\n I quietly walked over and placed my palm on his protruding belly. Beneath the warm, soft skin was a miniature version of Shengyuan, safe and snug, reverberating with his heartbeat in synchrony.\n The artificial wombs were not there to relieve the humans of their allergies to the genes of other humans. They simply allowed us to conceive. If we wanted children, we had to give birth by ourselves and to ourselves, with the exact same genetic composition—men bore men, and women bore women. The new method of reproduction was not only effective, but also sensible, both legally and ethically: we were most familiar with ourselves, and we carried the sole responsibility for ourselves.\n A handful of people started experimenting with alternative family structures. They dedicated all of their energy to procreation and spread out like a massive colony of ants with a clear division of roles and tasks, sharing all property and social connections. The majority preserved the traditional model, where they entered relatively stable exclusive marriages and raised children together with their spouse.\n No one I knew of conceived naturally, except for Mother, who had always been a hopeless romantic and a rebel. In order to truly “become one” with Father—body, genes, and everything—she illegally took an overdose of a kind of black, round pill that could suppress the human body’s immune system response. She conceived, in a way that was almost brutal, and was lucky enough to give birth to me. After my parents’ violation of the law was found out, Father was incarcerated immediately, and Mother was released on a bail. She was permitted to take care of me until I turned seven. The drug toxicity, as a result of over-ingestion, continued to torment her even as she served her sentence in prison. She passed away before her fiftieth birthday.\n “If someone else made a mistake, I could forgive them,” said Shengyuan, his voice quivering. I saw the familiar look of fear and guilt on his face. “But I can’t bring myself to do it. I’m sorry.”\n “What are you sorry for?”\n “For not being able to do the wrong thing.”\n The next checkup was scheduled right before the Mid-Autumn Festival. Shengyuan filled out the information survey, handed her his belongings, and walked into the assessment room alone. She gazed at Shengyuan’s silhouette and felt a rush of melancholy. He no longer resembled his father, cousin, and nephew, all the men in his family, but instead became a spitting image of herself. When she grabbed Shengyuan’s phone, keys, and ID card, she felt like she was holding on to all of the connections between Shengyuan and the greater society in her hands.\n The closer to the due date, the more anxious Shengyuan grew about giving birth. Restless, he had to lie on his back day and night in order to squeeze in a few hours of sleep. His uterus expanded day-to-day, pressing on his organs and stretching him open, leaving bright red creases on the skin of his abdomen. He told her all about his frenzied dreams of the pregnancy: once he was giving birth in the vast wilderness but after his belly was cut open, he saw that he was not carrying a fetus, but a puddle of blood. Another time he lost his ability to speak, and he was flattened into a thin, crisp, translucent piece of leathery material that reminded him of a shed snakeskin.\n He had briefly considered terminating the pregnancy, but soon he realized that it was no use trying to change the will of the family—because everyone in his family was, quite literally, himself.\n She found herself beginning to understand Shengyuan. The kind of understanding she harbored this time was different from the kind of epiphany she experienced at seven and the kind of perceptiveness she gained at twenty-five. Now, at the age of thirty, her recognition came with a reassuring weight. It felt like pressing a blunt blade into the skin: a little bit of pain, but no wound and no blood. She knew that Shengyuan was at the bottom of his class during middle school. In order to get into his father’s alma mater, he stayed up late every day to do extra work. He was so sleep-deprived that he accidentally fell off the stairs and broke a leg. She knew that Shengyuan had also contemplated plastic surgery but ultimately dropped the idea when his mother intercepted him on the way to the hospital, tore up the surgery contract, and slapped him.\n They continued to receive gifts from Shengyuan’s father, most were pregnancy-related smart devices. Those gifts were carefully stored away on the top shelf of the closet. They were grateful for each other; like an ordinary couple from the old times, they supported each other emotionally through the rest of the pregnancy with hugs instead of dopamine pills.\n She took Shengyuan in her arms, kissed him, and patted him on the back, in the same way she embraced her son in her imagination. They both knew that there was nothing to worry about. Shengyuan would not die in labor, because no men in his family had died from childbirth; in fact, there was a ninety percent chance for him to live to the age of eighty-three, just like everyone else.\n Her genetic composition, on the other hand, was brand new. Even the most skilled doctors were unable to predict whether her knee joints would start to make clicking sounds at forty, whether she would suffer from cardiac atherosclerosis at fifty, and whether she would eventually develop pulmonary edema like Mother and pass away one morning with foam at her mouth.\n At last, they gave up the thought of having a daughter. They were worried for the risks of bringing another fragile life into the world.\n The five-hour-long checkup passed by quickly. It was all well. They headed downstairs, holding on to each other’s hand. Shengyuan’s body temperature has been lower than usual since he became pregnant. His fingertips were cool, reminding her of fall, right around the corner. Bright yellow leaves wilted, shriveled, and spiraled down, landing with a rustle. All the leaves of one tree were similar. Every leaf knew which tree they belonged to.\n By fall, their child would be born, a son, without any surprise or doubt. But in the moment of anticipation, she allowed herself to imagine another girl—a stranger who would never come to life. The strange girl would have Shengyuan’s eyebrows and her eyes, Shengyuan’s complexion and the shape of her face. She would be braver than them all, and different from everyone else.\n Originally published in Chinese in Dajia Vol. 6, November 2021.\n Translated and published in partnership with Storycom.\n Emily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature."}