{"fingerprint": "BJ3AJiE1J/riUHQ/2WUBoUd8A3I=", "sitename": "Clarkesworld Magazine", "title": "Farewell, Adam by Xiu Xinyu, translated by Blake Stone-Banks", "author": "Xiu Xinyu; Blake Stone-Banks", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/xiu_03_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Farewell, Adam by Xiu Xinyu, translated by Blake Stone-Banks", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4610 words, short story\nFarewell, Adam\n1. Me\nAfter stopping my medication for just a week, I passed the test with ease.\nIt wasn’t too much trouble. My parents never cared what I was up to. My friends probably thought I was already dead. Doctor Liu was upset but knew me well enough to know I hadn’t made the decision out of selfishness, whether for my own dream of the spotlight or financial gain.\nThe recruitment notice had said they were searching for five “sensitive and fragile” people. Many signed up. Young fans looking to play a part in the behind-the-scenes life of a pop star were sifted out. The down-and-out, lured by a generous payday, took practice tests in hopes that the real test would classify them among the “sensitive and fragile.”\nI had no need for practice. A glance at my obviously depressed state told them all they needed to know.\nPhysical exam. Contract. Informed consent. NDA . . . It took half a month to clear the bureaucratic hurdles, but that was immaterial in the face of the decade I signed up for in that vast building. I was escorted in by employees wearing black uniforms and faces as serious as a funeral.\nI bathed, changed clothes, and bid farewell to my former life. It had been a long time since I had said goodbye to anyone.\n“Goodbye,” the last employee said as he stepped toward the door.\n“Actually, one small question.” My voice sounded brittle. It had been a while since I had spoken. “Why is he called Adam? Don’t we believe Nvwa made the first men?”\nIt was a stupid question. I said a lot of stupid things when depressed.\nThe employee just stared back as though uncertain he should waste his breath on such a dull question. His hand gripped the door handle, released it, then gripped it again. Perhaps he tolerated my question because he realized I was indeed “sensitive and fragile” and “stupid.”\n“The reason’s simple. When Nvwa made the first men from yellow clay, she gave them no names.” He left and shut the door.\nNo name. Just like me and the other ninety-nine.\nThe device I wore looked like headphones. It was designed to look familiar, so that we would feel more at ease toward everything about to happen.\n“Close your eyes,” said a voice. I wondered if there was anything alive behind it.\nAs I lay on the bed, I made sure the machine delivering my nourishment was functioning correctly. I shot one last glance over that barren place I had inhabited so long, the physical world.\nI clenched my eyes shut.\nIt was night. So, with the four “sensitive and fragile” others, I slipped into Adam’s dream.\n2. Adam\nAt this moment, I’m thinking of Tchaikovsky, that restless sublimity that pervades his work. Heard. Glimpsed. Tasted. All senses colliding, intertwining. But as they say, truth once born can only wither.\nI dip brush to pigment, fill the canvas with saturated colors, searching for a new center, a new symmetry to the work. Sometimes I think it’s already enough. These moments are enough. These moments are eternal. But then I realize I still have so long to live.\nThey call me an idol. Not that I need to be careful about maintaining my image. There are no skills that need practicing. Singing, dancing, performing, sketching, painting, replicating the world. Already, my command of these arts is unparalleled. Among all singers and painters, they say I’m the most extraordinary. As I must be. After all, I have a one-hundred-person team consulting on my every movement.\nFive more newcomers have just integrated. I didn’t feel their entry into the one-hundred-person team. At least everything still feels natural enough, which is good. It means they’ve been absorbed into the greater will, absorbed into Adam. In turn, Adam has been absorbed into my own subconscious.\nSo far, I’ve been able to separate my emotions from Adam’s. In the face of his rabid fans, I just don’t care, and that makes Adam upset. People like to see Adam upset. The uncanny, beautiful breed of fresh-faced pop stars is too much for the masses. More and more, people are drawn to the defects in his character. They believe defects are more real. Don’t they know nothing is real?\nAt the evening’s art auction, fans are still gathering, all wearing matching rescue worker uniforms, waving shiny placards. All young girls. When they catch my eye, their excitement becomes palpable. Faces blush. I turn and methodically wave. They’re cute, much younger than me—especially if I add the years of the rest of the one-hundred team when calculating my age. I already feel old despite the expanse of years still ahead of me.\nOne fan in the front sensually pulls at her collar and blows me a kiss. Her skin is porcelain, breasts full, the very portrait of Salome. Sublime, yet with a solemn foreboding about her. I shut my eyes so I can imagine returning her kiss, then open to fix on her again in the light.\nThen he saunters, late like always but always turning up. This is my seventeenth encounter with him. Considering the popularity and price of admission to my events, it’s obvious he has time and money.\nI want to smile.\nBut I shouldn’t. How could I have such a stupid idea?\nOr perhaps, it’s Adam who wants to smile? The elaborate system of inputs and algorithms through which we control him is just another system . . . but I sense it growing its own personality. It becomes upset, suppressed, oversensitive, even suspicious.\nHis cold face winks at me with deliberate slowness. It’s as though he’s communicating in some indecipherable code. Perhaps one of the one-hundred-person team in the control system should be able to decipher his code. Or perhaps not. But I know there is something wrong, some foreboding I cannot name, as though I have just glimpsed the darkest cloud in the bluest sky. Torrential rains blacken the horizon, always.\nI shift my attention toward the ecstatic fans in the back. But no matter what I try, I can’t force him from my sight. He doesn’t participate in the auction, just stares the whole time at me. So halfway through the evening’s auction, I walk out.\nIn the night’s dream, I am again in boundless water. I have suggested to the company that they research how to control my dreams, but it seems they haven’t found a solution. They tell me it’s just a stress response stemming from the contact between my subconscious and Adam’s body. They have no idea when the dreams will stop.\nI dream of the water, slowly rising, always. The flood is without end. So many times have I been inundated, pulled under, only to open my eyes on nothingness.\n3. Me\nThey let five of us celibates in. They required we be celibate at the time of our selection and ideally afraid of women. Of course, they did this because his dopamine levels were abnormal and it was so difficult to stabilize Adam’s emotions. Recently, Adam had almost fallen in love. Among the one-hundred-person team, about sixty of us were still in our early twenties. Even celibate, we were a pack of hormonal animals.\nThey would never allow Adam to love or marry. After all, his obsessed fans were mostly girls. They wanted the girls to dream of filling that gap in his life, dream of comforting his “sensitive and fragile” soul. That was how fanaticism thrived.\nAdam became irritable, gloomy. At these times, fifteen of our most “sensitive and fragile” people would take over seventy percent control rights in order to make Adam’s sadness appear more real.\nAdam never cried, though when I was alone, I would sometimes cry at night. I didn’t know why. I suppose crying made me feel a little better, but in the long run “a little better” doesn’t help. Perhaps the reason Adam never cried was that the other ninety-nine believed it too embarrassing for a man to cry.\nNo women had joined us. At least not then.\nI’d been inside for more than three months already, but it was still weird to look in the mirror. In it, I saw a handsome face, a face too handsome. It was precisely this handsomeness that had made Adam courageous enough ten years earlier to enter the media’s limelight and to be cast across every type of platform. It was this handsomeness that made the entertainment companies pay huge sums of money to sign contracts with his parents. It was this handsomeness that made him, at the age of fifteen, surrender his body to this puppet life, in which meaning could only be found in cascades of staged encounters and disguises constructed for lusting fans.\nBecause the company’s questionnaire was so exhaustive, its predictions were generally accurate. The algorithm evolved Adam into the most worshipped of idols. To be honest, I empathized with him, but more than that, I was jealous. Adam was the cynosure.\nI hated eggs. It wasn’t just the taste. I was also allergic. Unfortunately, the other ninety-nine didn’t have this problem. So Adam every morning had to eat eggs. And every morning, I had to endure that disgusting taste.\nTen years. I had to persist here for a full ten years.\nWhen I emerged, I would be thirty-five years old, crow’s feet at the corners of my eyes, white hairs behind my temples. But I would have money, a lot of money, more than enough money. I would be able to hire a great voice teacher, afford sessions in the finest recording studios, perhaps even hold a few small concerts of my own.\nSo I waited.\n4. Adam\nI am in the boundless water again.\nWhen I wake, my eyes fix on the ceiling. I remain motionless for a long while. In these moments of waking from a long dream, the ceiling reminds me of the shimmering sea.\nThe 8 AM alarm rings. I shut it off, roll over, and see if I can’t get back to sleep. I’m supposed to do a talk show at ten, but decide to skip. My assistant will understand. He knows I haven’t been sleeping well.\nI roll back into sleep, but the dream is changed.\nIt is no longer a soundless, flavorless, senseless thing. There is a long, drawn-out hum permeating the water, like a whale song or the whistle of an ocean liner. Or rather the snoring of such monsters, whether biological or steel. I have never lived by the sea. But as I dream of these mist-shrouded waters, they become more like the waters of the deep sea, blue and green. I hear the indistinct murmur of waves, sporadic cries of seabirds. Is something alive waiting beneath me in the depths?\nWater flows in, flows out. And I wait.\nWith the exception of my strange dreams, other aspects of my life are progressing more smoothly. The new album is more successful than anyone imagined. That cute head of the fan club continues to pen her love letters to me. She’s quite an interesting girl actually.\nA boy who I saved from drowning ten years ago has just tested into a top-name university. We agree to meet on Friday evening so I can treat him to a congratulatory dinner.\nWhen we meet, the dinner proceeds normally at first, but then a young boy in a school uniform shows up. His uniform looks absurd next to the crowd’s evening wear. The boy ogles me, steps closer.\nThere will always be crazy fans willing to do anything to track me down. A few no doubt will succeed, like flies hopping back and forth that won’t be swatted away. They wear me down.\nI step back and wait for my bodyguards to drive the boy away. He’s escorted out without incident, without speaking, without screaming “Adam, I love you.” But all the time, he’s looking at me in this strange way. It’s hard for me to pinpoint how I know that look in his eyes. But something in his eyes wrenches me.\nWhen he’s gone, the crowd calms, returns to normal. It’s then I notice my assistant is staring at me too.\n“He look familiar?” my assistant asks. “The boy’s father is a member of the one-hundred-person team, a middle school teacher who signed up to earn money for the boy’s education. His son misses him. His son has always wanted to see you. He thought to see you would be like seeing his own father.”\nThey must always know the intimate details of my followers. Without a doubt, this is what guarantees my safety. I nod, think back on the child’s eyes. My face feels hot, my heart cold. I tremble as though an electric current passes through me. The hairs on my body stand on end as though the air has suddenly grown chill. I feel strange, almost ill.\nI kneel then on the ground, cover my face, cry. It is the only time I can remember crying. But that doesn’t matter, the people will like to watch me cry.\n5. Me\nIt became increasingly difficult to tell myself from Adam.\nPerhaps that was a hazard of the job. In the first few years, when Adam was sleeping, we would often take short breaks. We could leave our rooms, walk the halls, sit in the lounge, and stare at each other in silence. After a while, we might eat something, watch a movie or crack a few jokes.\nWe almost never speak of our former lives. It was only those hired with the responsibility of “cheerful conversation”—mostly C-list actors and former journalists—who gossiped about their experiences. Of course, no one actually cared about their experiences. Adam was the only one that mattered. Adam, young and handsome, sought after. It was only through this system that any of us would have a chance to experience something like that great life of Adam’s. We were the mud Nvwa had flung, unrecognizable, still evolving from the primal chaos. Only Adam had been given a name.\nDuring the third year inside, there was one small change. As part of the system’s optimizations, it was requested we bind ourselves even more deeply to Adam. Our daily cycles of work and rest all had to synchronize with Adam’s. Even our dreams had to become his dreams. We had to become him each and every moment. The assistant didn’t tell this to our faces, just forwarded on a twenty-five-page addendum to our contracts defining the new rules. We had only a few minutes to read and confirm we would continue to participate.\nI saw no other choice, so I lost myself entirely. Adam lost himself entirely.\nAnd the charade of “we” became our truth.\nThey optimized the algorithm, modulating the one-hundred-person team to make Adam more stable. To use an ancient Chinese phrase, they were searching for the zhongyong, the golden mean. Even if they integrated those with more intense personalities, the output should be the same: a golden mean of anxiety, a golden mean of melancholy, a golden mean of ecstasy.\n“Not good enough,” was the company’s only response.\nNo one can be loved forever, but the new algorithm did offer some protections. It wouldn’t make Adam do anything too extreme, too stupid. Still the company was right. For an idol, it was “not good enough.” Far from good enough.\nAt Adam’s last exhibition, someone splashed one of his works with paint.\nThe world’s love comes in limited quantities. The more love there was for Adam, the less love there was for others. The perpetrator was someone with a heartache, and the girl who had caused his yearning happened to be a member of Adam’s fan club. It went down like this: after a cry of alarm, after the chaos, while everyone was waiting to see Adam’s reaction, Adam just began to laugh in embarrassment. The reaction was even worse than no reaction. Embarrassment, laughter . . . as though Adam were just an ordinary person.\nFor three straight weeks, Adam’s popularity metrics declined. The company began work on a dynamic weighting mechanism for the algorithm. The objective was to optimize Adam’s reactions to make them more distinctive. It was decided that in certain conditions, the system would shift control to the optimal person among the one-hundred-person team who would then act for Adam.\nI wasn’t sure how well the new algorithm worked for Adam, but I got used to it and liked it. On a few mornings upon waking from some strange dream, when Adam would walk absentmindedly into the kitchen to select his breakfast, the system would select me from among the most “sensitive and fragile.” I was able to stop him from eating eggs.\nThese small victories brought me some happiness. Perhaps they even made Adam happy. Perhaps we were even gradually becoming each other. I do not know.\n6. Adam\nIt’s a hot day, the day of the awards ceremony.\nAfter some time away, I should be delighted and excited. At least, I shouldn’t feel like this, so strangely anxious. Perhaps, there’s an issue with the algorithm or the hundred-person team. My assistant reminds me that the algorithm has never had a significant issue. This only increases my irritation.\nI’m twenty-six years old. A truly talented artist would have published a memoir by this age. But I’ve been too busy being chased by fans, being cheered on by the bright-eyed crowd to do the next meaningless thing and grab the next meaningless award.\nBut of course I have to participate in the charade. My assistant reminds me I have already signed the contract, signed on for thirty years. The money will bring my dear mother and father a true fortune. They already have a second child. They delight in watching my performances and showing off my success.\nI take a deep breath as I prepare for the stage, where I will soon receive the Best Vocal Artist Award. I’m not even sure what “best vocal artist” is supposed to mean, but if that’s what people say I am, then—\nThen I see him again.\nThe one from the performance. The one from the auction. The one from the opening ceremony. That familiar face that always shows up. His appearance is more gaunt, but his clothing is even more exquisite. This new look makes his figure even more imposing, makes me think of Beethoven.\nI’m overwhelmed. I flash a smile, but he doesn’t smile back.\n“What are you looking at?” my assistant asks. I just shake my head.\nI never expected things would develop to this point. As I go to accept the award, he pulls out a pistol, aims it at my chest, shoots . . . I fly backwards.\nFortunately, the paranoid Adam insisted on a bulletproof vest. As I look toward my would-be killer, I see no expression on the man’s face, yet in it I still recognize grief. His face may still be young, but there is white hair behind the temples. From some angles, he looks so familiar. From some angles, he looks just like me.\nMy assistant wraps me in a thick blanket. “That guy was your childhood friend,” he says. “You’re successful. He’s poor, a failure. He’s jealous and thinks he can extort—”\n“He wants to kill me,” I interrupt.\nShowing no hint of fear, my assistant pats me on the back. It’s as though he’d known long ago everything that would happen. “Yes, because we ignored his attempt at extortion,” he says. “Anyway, he won’t get close to you again.”\nI know the attempted murder will win us tomorrow’s headlines.\nI stare through the distant door to the commotion outside as the man is escorted into a police car. The light from outside stings as I peer into its glare. In the flickering light, instead of a cold and steeled killer, a tired man stoops, shrugs. His silhouette reminds me of an old man. He still seems familiar, but now just slightly. Since connecting into Adam, so much information has flooded my mind, such a dazzling life since the age of fifteen, if only a few vague shards of memory before that age. Even the memory of jumping into the water to save the child is a blur. The company doesn’t care about the past. It only cares about the future. So must I.\nIt’s possible the man didn’t want to actually kill me. It’s possible he only wanted to grab my attention. It’s possible he only wanted to make me remember, to return to that childhood we had spent together. We were friends once—friends, what a weird word.\n“Can I give him some money?” I ask. “Anonymously?”\nMy assistant takes a deep breath. “And then make it seem like the company confirms it hired a killer to wound you as some publicity stunt? Adam, are you really this dumb?” My assistant looks sad. Most of the time, he’s a mindless workaholic and won’t even tell me his name, says it would be unprofessional. But when things fall apart, he treats me like an older brother would. He reaches to fix my hair. For a moment, I feel this is real.\n7. Me\nThe whole dorm couldn’t sleep, though I was no longer sure what it meant to be asleep or awake anymore. When Adam slept, I wandered his dreams, not that there was anything there. Only boundless water that would sooner or later pull us under.\n8. Adam\n“Have you decided yet?” my assistant asks. From his tone, I can tell he’s losing his patience. After all, the banquet is almost over, and he’s already urged me seven times.\nI nod, sip from my glass of wine. After I refuse to take the stage, everyone starts whispering. But even if I spoke to them, none of these people could decipher the dreams that torture me. There is no cipher, only the boundless water.\n“I’ll tell them you’re drunk, but get it straight. Any contract violation will cost us dearly,” my assistant says. “If we cut out, earnings from all concerts during the first half will be gone, but I guess you’ve been needing your vacation. Just push off the shows and take a few weeks in your painting studio. You need a break.”\nI look at him, patiently wait for him to continue his little explanation. He knows what kind of explanation I’m waiting to hear.\n“There’s nothing for you to do now,” my assistant says. “Just get out of here. You have no right to change the one-hundred-person team. That was decided by the company. We agreed to that long ago.”\n“No, not necessarily,” I say. “I could cancel the contract altogether.”\n“Cancel the contract?” my assistant says. “You want that?”\n“I can leave Adam and cancel the contract. Push the rest out . . . ” It takes strenuous effort to pull these words from my mouth, like pulling heavy stones from wet pockets.\nThis might be the bravest moment of my life. The sad thing is I don’t know if the courage comes from me or from Adam.\nMy assistant stares back astonished. “So you forgot again, didn’t you, Adam?” He shakes his head, mutters as though talking to himself. “Yep, you forgot. You always forget the most important things. They say it’s too painful for you to remember. But listen, you can never leave Adam. You can’t leave because you are Adam. You are the will of the hundred. You are the body, that limp, paralyzed body. I can’t believe you really forgot again.”\nMy head droops. A few of my fingers bend absently, as though trying to grasp at the void. I remember something, say, “But I saved the child . . . ”\n“Right, you saved him, but the water still drowned him too.” My assistant laughs. “A lot of people were disappointed. His older brother wanted to take the body back, to lay him to rest, but we had signed an agreement with the parents and there was nothing to be done about the contract.”\nI hear the sound of waterfalls. I hear the sound of torrential rains. Something is calling from the distance. Once the one hundred rivers flow east into the sea, how will they return to the west? We are the countless drops of water that form the sea. Nothing can separate us, except perhaps death.\nI flash a smile at my assistant. I raise my wine glass, down it. I glance downstairs. Up here in the penthouse, the banquet hall is crowded with faces and noise. Below, all is quiet, vacant. From up here, the pool below is a perfect strip of blue. The soft waves will not be soft again, I think.\nIn the end, water will conquer all.\n9. Me\nI plummeted into the water.\nAdam plummeted into water.\nWe plummeted into water.\nI wasn’t the first to pull off the “headphones.”\nUpon waking, light was blurred. Sound muddled. My first thought was there must have been a malfunction.\nI realized I was not in that small room quiet as the grave. Over the years we had spent inside Adam, the whole building layout had changed.\nIt was crowded now. Well over one hundred shabby cots were placed right up against each other, leaving only narrow paths between them. I heard the creak of bed boards, the scuff of hard shoes on tile floors, human whispers.\nOld Doctor Liu was seated at my bedside. I could tell there was something he wanted to say.\nI blinked and became aware the noise had stopped. Suddenly there was no one else around. It seemed like everyone else had woken and left. When Adam died, the contract had been automatically annulled.\n“I told you that if you stopped taking your medication, you might die,” Doctor Liu said. “Seventy percent of it was your own choice. They wanted me to come and talk to you.”\nHe tried to smile, an embarrassed smile, a sorry-but-no-cure-for-what-you’ve-got smile.\n“The decision was made by the algorithm.” I heard my voice trembling. “It wasn’t my fault.”\n“No.” Doctor Liu brought a hand to his chin. “They want me to ask . . . if you would allow your identity to serve as a prototype for a new idol.” There was an equivocation in his voice, as though he were waiting for me to grasp something. Finally he said, “After all, you’ve become the new cynosure.”\nIn that last moment as Adam, it had been me in control, me who killed him. Just as there had been no shortage of people who wanted to kill Adam, there would be no shortage of people who wanted to avenge his death. His fans would want me dead.\nMy expression made my thoughts obvious. Doctor Liu added, “They will fully guarantee your safety.”\n“But I’m not some paralyzed body like Adam. I have my own will and—”\n“Of course, they will respect your will. The new team will just help carry out your will even better. Didn’t you tell me once you liked to sing? They will make you the greatest singer.”\n“A singer, me?” I heard myself retort. The last few years were a disintegrating hallucination, like the draining of a vast pool. The universe spun ’round the drain of my mind, until all that was left was hollow grief. I thought on Adam’s fall, that eternal fall, like an island slipping beneath boundless water.\nOnly in that moment did I realize he was really dead.\nOur friend. Our enemy. Our idol.\nFarewell, Adam.\nOriginally published in Chinese in Science Fiction World, January 2018.\nTranslated and published in partnership with Storycom."}