{"fingerprint": "f5TZXFkMeHYwmNMalAxICNo8W4g=", "sitename": "Clarkesworld Magazine", "title": "The Plague by Yan Leisheng, translated by Andy Dudak", "author": "Yan Leisheng; Andy Dudak", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/yan_08_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Plague by Yan Leisheng, translated by Andy Dudak", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5680 words, short story\n The Plague\n I knew I was mad. It had to be so. No one would volunteer to do what I did. I wore a biohazard suit every day, sealed tight from head to foot, and it didn’t bother me at all. Actually, I was quite at ease suited up. A normal person wouldn’t be so calm. No sane person, even someone fated to die, would be willing to do what I did. And yet, every day I dumped truckloads of corpses, like so much garbage, into the incinerator. Furthermore, I took a certain delight in it.\n I knew I was a madman.\n It’s hard to say when the Plague began to spread.\n When the first cases were announced, people didn’t comprehend the gravity of the situation. Some foolish biologists even celebrated. They’d finally discovered a new form of life. The virus that gave rise to the Plague was indeed novel, with silicon, rather than carbon, bonding with hydrogen and oxygen in molecular chains.\n All was well during the early stage of infection, apart from a slight stiffness in the joints. But two weeks in, the victim was suddenly unable to move. The skin became silicon dioxide—silica, stone. But the victim was not dead. The eyes could still blink and move. The victim could still force their body to stir, but the skin would crack like wax. I’ve seen many petrified corpses with jagged, bloodstained flesh. Soon after the skin, the internal organs began to turn. By week six, the body was thoroughly petrified. In other words, it took forty days or so for a living person to become a stone statue.\n No one knew how a virus like this could come into being. Antivirals and other pharmaceuticals were only effective against viruses made of protein. They were useless against our silicon-based Plague.\n Scarier still, it was highly infectious. Just breathing air could infect you, and in the early stages, because there were no symptoms, it was nearly impossible to detect. You could emerge from a crowd and already be infected, doomed.\n The only effective medicine was alcohol.\n It could postpone viral activity, but only bought you a week at best—even if you soaked yourself in it. Scientists said petrification resulted from infection by-products—inactive virus and viral debris—accumulating in cells. Alcohol didn’t kill the virus, but rather kept it active. So, alcohol was not a medicine per se, but more like a narcotic. In layman’s terms, keeping viruses active meant they “lived” longer, raising the level of active virus in the body. Thus, there would eventually be more infection by-product, and the body would petrify faster in the terminal stage.\n Regardless, people believed alcohol was some kind of miracle drug. Consumption went up exponentially.\n Of course, the Bureau of Statistics had been shuttered. The world no longer had countries as such. In the early days, some nations had not yet detected the virus, by whatever chance of fate. These took pleasure in the misfortune of infected countries, maligning them, even accusing them of creating the Plague. When the virus reached these accuser nations, they aggressively denounced the containment measures of their rivals, claiming not enough had been done. But when the Plague attained the force of a prairie fire, people no longer wasted breath on superfluous words. Ideologies didn’t matter. State systems and national prestige didn’t matter. Before the Plague, everyone was equal.\n Under these circumstances, a great, global harmony formed, an ideal Confucian society, marvelous to behold.\n The Emergency Management Institution was established. And for this sort of emergency, there was only one countermeasure: isolate the infected and issue protective gear to the uninfected. Luckily, this virus could not pass through a graphite filter, otherwise humanity would have nowhere to hide.\n When someone was discovered to be infected, their suit was immediately seized. A carrier was tantamount to a dangerous beast of prey, as far as uninfected humanity was concerned. The infected were quickly forsaken, excluded and exiled. The wealthy binge drank, regardless of their ability to handle liquor. Everywhere, the poor robbed and looted. They didn’t really need to, since two of three residences were already abandoned. These could be entered at leisure, the property within used as one pleased.\n My duty was dealing with the aftermath. To put it bluntly, I traveled around and collected stone statue corpses and transported them to municipal outskirts for burning. There was no pharmaceutical solution, so this was all we could do to wipe out the virus. Such work increased my risk of exposure, but more terribly, those we gathered were, as a rule, not yet fully petrified. Pitching these into the crematory oven, there often followed a heartrending scream. Two of my coworkers killed themselves, unable to bear the censure of conscience.\n It was not pleasant work, but somehow we got it done.\n I say I was mad because I did not fear their bloodcurdling screams. On the contrary, every time I threw a statue in the fire, I yearned for a desperate cry. After all, not all statues sing at sunrise like the Colossi of Memnon.\n That day, I sped through deserted streets in my truck, having collected just seven corpses, none of them knowing they could still scream as they died in the oven. When I pulled up to a kindergarten, an unmasked man carrying a bundle of cloth ran out.\n The virus acted on children faster due to their smaller size, so there’d been no children for some time. But there was no white sign on the building, which would’ve meant “unoccupied,” and no red sign signaling “infected within,” so that meant there could be people in there—uninfected, normal people.\n It was legal for the infected to loot unoccupied residences. Perhaps this kindergarten was vacant, but without the white sign, the fleeing man was technically a criminal. I was warranted to summarily execute him.\n I jumped out of the truck and drew my gun. “Halt!”\n He froze, watching me, clutching a heap of women’s clothing.\n “This is not an unoccupied domicile,” I said. “You’ve violated Article Eight of the Emergency Laws, and the penalty is death.”\n His face twisted stiffly with desperation. Still capable of such expression, he would be a moving, shedding viral vector for another week at least. “I didn’t know,” he said. “I’m new to the area.”\n “You don’t need to explain yourself. Just accept the penalty.”\n His face contorted further, by twitching degrees. Obscenities poured from his mouth.\n I fired. His skull detonated, painting radial gore on the wall behind. His body, now a true corpse, fell backward. Article 8 of the Emergency Laws stated that any infected person entering a residence of the uninfected, for whatever reason, was to be executed on sight. No exceptions.\n The uninfected had supported this inhumane law overwhelmingly, and so it passed.\n I entered the kindergarten.\n Life and death were trifles in those days. I’d just killed someone, and my heart hadn’t skipped a beat. My mind was on the job. The man had been in here and the residents, if any, might already be dead. Or they were infected. Either way, I had to know.\n “Hello? Anyone?”\n I found a long, awkward child’s painting in a classroom, titled “My Family.” In those painted scenes of exaggerated, ridiculous figures, the innocence of adorable children was discernible. The brushstrokes were clumsy, but at least the people depicted were healthy, free of infection.\n I found no one in the kindergarten. There were simple character lessons on a blackboard, not erased, but no sign of recent human presence. Perhaps this really was an uninhabited dwelling, and I had wrongly executed that man. But I felt no trace of guilt. He had merely died a few weeks early, nothing more.\n I went through several more classrooms. Behind was a row of dorm rooms, but no people. The place was uninhabited, apparently. I still had several signs in my truck. I would nail up a white one at the gate.\n Thinking to leave, I heard something stir beneath the corridor.\n I didn’t know what could be down there but a utility room. Certainly not people. But what had I heard? There were no rats anymore. They’d all petrified before humans, due to their size. Besides us, only elephants remained in the world, the longest-lived of the infected.\n I found a basement. I pushed the door but it didn’t budge. I retreated a step and kicked, and it came open with a bang.\n Down there was a toy workshop.\n At least it seemed so, since there were no less than thirty stone figures of children in all sorts of postures, even one seated on a chamber pot. All of them petrified.\n I smiled bitterly. Each child would weigh close to 60 jin, and thirty of them together would be at least 1800 jin. This would be some real physical labor. I lifted a boy who still grasped a toy car and got him on my shoulder, preparing to leave the basement.\n “You must not take him.”\n Someone emerged from a well-hidden door, a woman in a thick biohazard suit.\n “So, there’s someone here after all,” I said. “Why were you hiding?”\n She glared at me from behind her mask, as though to penetrate the base shamelessness she read on my face. “You’re a Crow?” she asked, unimpressed.\n I couldn’t restrain a bitter laugh. “Crow” was the vulgar name common people gave us. Our biohazard suits were black instead of the normal white, and we were harbingers of death, like crows.\n “Some would say.”\n “And you mean to take them away?”\n I looked at the statue in my hands, so much like a big toy figurine. “They are not handicrafts, after all.”\n “And you’ll have them burned?”\n “Got a better idea? By all means, contact Emergency Management, phone number zero one zero, eight nine four.”\n “I won’t have this conversation with you,” she said, growing impatient, “and you’ll not have these children.”\n “Look Miss, let’s not get sentimental. The ancients said, ‘Amputate the poisoned hand to save warrior.’ That’s the principle here. They’re lifeless, but as dangerous as time bombs. And you’re hiding them here. How can you ensure you won’t get infected?”\n “You’re wrong,” she said indignantly. “They’re not dead.”\n This was laughable. I’d come across many of these sentimentalists. If they had been allowed to create unrest, humanity’s extinction would have been nigh. “A person becomes a stone statue,” I said, “and you think they’re not dead?”\n “Correct. They are not dead, Crow, not at all. They’ve merely become another form of life. We humans don’t have much in the way of cellulose in our bodies, do we? But we cannot suppose plants, made overwhelmingly of cellulose, are not alive.”\n My temper rose. Was she really so impervious to reason? The government authorized us to use extreme measures when dealing with purposeful troublemakers, but I really didn’t want to draw my gun. “Miss, you say they’re alive, but where is their life activity? Plants cannot move, but they grow.”\n “They don’t seem to move,” she said, “because they’ve become this new form of life, sensing time differently from us. A second for them might take one of our days, or months or years. We cannot deprive them of the right to exist because they move slow.”\n I laughed. “Miss, scientists have certified that the petrified are no longer alive. They’re no different than statuary in a park. And if you want to become a Louvre exhibit, it’s all too easy.”\n “They’re liars!” she said, taking my hand. “Come see. I’ll prove it to you.”\n Through our gloves, I felt her hand, slender yet oddly hard. Surprised, I said, “You’re infected?”\n She forced a brief smile. “Two days now. Judging by average infection speed, I have about five days, so you must come and see.”\n She wanted me to have a closer look at the girl sitting on the chamber pot. The child’s expression was familiar to me, a universally human expression, that of anyone, young or old, post-defecation. She was lifting her skirt, and I saw now that her bottom was not quite touching the pot.\n “This child has been petrified two years,” the woman said. “Two years ago, not yet fully petrified, she sat on this chamber pot. Yet look at her today. What would you say she means to do?”\n “God, she’s standing up!”\n Eyes on the girl, the woman said, “That’s right. She knows she’s done her number two, and she knows she should stand. It’s just that she has slowed down, drastically. From her perspective, these past two years might just be a moment on a chamber pot. I doubt she even knows what has happened around her. We move so fast relative to her I doubt she sees us clearly. Throw her in the oven and she’ll be gone before the pain reaches her brain, granted, but it’s still murder. So tell me, are you ready to commit murder?”\n I felt dizzy. I’d been burning about two hundred people a day. By that reckoning, I’d murdered one hundred and forty thousand people in just over two years.\n Perhaps she was lying, but it was hard to convince myself of this. Petrification wasn’t quick as lightning. The boundary time between mobility and immobility was about thirty minutes. I’d seen many people force themselves to move during those thirty minutes, causing their original skin to crack. This little girl could not have maintained her just-off-the-pot, bottom-up position for thirty minutes, motionless. She would have moved. Her flesh would have split. It was smooth now, like a mirror. She must have risen after petrifying.\n But how could I believe a person turned to stone may still think, still move, and do these things thousands or millions of times slower than flesh and blood? It was hard to fathom. I was not an intellectual, not learned. I couldn’t believe another person’s mere words, no matter how dreadful, how tempting. I believed what I could see.\n My hand crept toward my holstered gun. When it came to things I didn’t want to understand, a gunshot was the best answer.\n But I didn’t fire.\n I saw her eyes. Behind her mask, they were pitying and unyielding, like I was nothing but a primitive reptile. I averted my gaze and said, “You should remove your suit and hand it over. You’re no longer qualified to wear it.”\n The next morning, I gathered a squad of petrified soldiers from a military camp. Then I returned to the kindergarten.\n She was outside, drying clothes in the sun. I parked the truck at the entrance, grabbed a bundle of food, and walked toward her.\n Her gaze was still rather unfriendly. “What have you come here to do?”\n “You have no food rations. I fetched some for you.”\n Food rationing was also an Emergency Management measure. Plants and animals alike had petrified, so food was scarce. Normal people got 18 kilograms each per month. Crows like us were rewarded for our hard work with an extra ten kilograms per month. The infected got nothing. They were left to their doom.\n She watched me. “Is this pity?”\n I couldn’t meet her gaze. “It’s respect.”\n “If that’s true, then promise me something.”\n “What?”\n “After I am stone, don’t burn those children.”\n I looked up, seeing the expectation in her eyes, and I didn’t have the heart to tell her the truth. I lowered my gaze again and said, “I promise.” I couldn’t tell her that it didn’t matter if they were a new form of life, if they could still feel or not. My duty was to burn them regardless. So, I had promised, to give her a little comfort in the time left to her. I didn’t know what I was doing. I’d given her some of my precious food, a possibly idiotic move. But I felt I had to. I couldn’t become a martyr, so I was stuck with being a spectator.\n I went back to the kindergarten a few days later. Her clothes were still drying outside. Probably she could no longer move. I went downstairs, and she was in the doorway, arms extended forward, hands up, like she was blocking my way. But she had indeed become stone. Even if she was still conscious, she didn’t know what I was doing. Perhaps she would be dust and ash before she could realize I’d broken my promise.\n I moved her aside.\n I hauled out the little statues first. When I finally got to her, I saw loathing and disdain in her eyes. Even then I dared not face her gaze as I carefully moved her into the truck. I had always been rough and incautious with statues, sometimes breaking off an arm or leg, but now I worked as if with fine porcelain that might shatter from the slightest bump. I prepared the truck bed with layers of her old clothes, then gingerly laid her down.\n I put up a white sign at the kindergarten gate.\n I returned to my residence and unloaded the children. I did not burn them. Moved by shame, I stood the woman at my entryway.\n Amid drifting white ash from the overworked oven, she stood at the threshold, hands out before her. The gesture seemed to embody an expectation, or a warding protection. Her surfaces were smooth. Her clothes were torn here and there but in no way reduced her dignity.\n But her gaze was full of loathing.\n Eyes petrified late. As petrification progressed, even if the victim couldn’t move, the eyes sometimes still did. But after another two days, she was completely stone. My shame persisted, and I began to seriously wonder if I was a bad person. She had become a statue, and I was using her as an ornament. As for burning the children, I’d convinced myself I was only waiting for her transformation to be complete.\n I took the other dozen or so statues I’d collected to the oven. I heard plaintive cries when I threw them in, but it didn’t satisfy me like before. My heart felt like it would burst.\n Even if there was no life after petrification, surely they were still alive now, just not as soft and pliable as the uninfected. Did we have the right to deprive them of existence?\n I returned to my quarters despondent. The children lay scattered in disorder. I carefully bypassed them and went inside.\n I went out in my truck the next day and encountered a security inspector on the road. With great approbation, he added a star to my loyalty card. I was now at the four-star level. One more and I’d be eligible for Emergency Management as a security official myself. He told me there were just five million or so uninfected left in the world, but due to efficient measures, there were now several infection-free regions.\n It seemed thorough eradication was not impossible after all.\n The bad news was of the ten thousand Crows in the world, a dozen on average killed themselves every month.\n The good and bad news both gave me a heavy heart.\n I threw my daily take of a few dozen into the fire. Perhaps they really were still alive, as she said. I’d disagreed verbally, but deep down I was wavering. As I threw the statues into the oven, I felt like an executioner.\n I returned to my residence and encountered her gaze at the threshold. It had changed. Maybe it was my imagination, but I no longer found loathing in her eyes—if stone eyes could emote anything at all.\n Was it because I had spared the children?\n I looked at the little statues piled carelessly on the ground. The little girl lay on her side, still in her chamber pot posture, completely ridiculous. I set about arranging each statue according to my memory, returning them to their original poses. I had no chamber pot, but due to her center of gravity, the girl could lift her bottom while standing.\n I came and stood before their stone guardian, and very slowly said, “If you can still hear words . . . know this, I am keeping my promise.”\n Of course, she didn’t respond.\n I entered my residence. UV radiation soaked my body in the disinfection lock.\n What is life? Something so fragile, anyway. Stone was sturdier than my flesh and blood, but if statues were still alive, they were also just heavy rubbish I could destroy at will.\n But did I have the authority to do so?\n Twenty-three days later, I was noticing the steady diminishment of my harvests, getting a dozen per day at best. Then again, if I was a murderer, killing one per day or two hundred made no essential difference.\n I ran into the security inspector again thirty days later. He’d been looking for me this time. Oddly, he hadn’t dared to come calling at my residence. Perhaps he’d once been a Crow like me and did not wish to trigger grim memories.\n “Congratulations,” he said, extending his hand. Taking it, I felt reassuringly soft muscle beneath the glove. “After some discussion, it has been unanimously agreed you should join security. You’ve done very well. Your sort of work has more or less eradicated the Plague.”\n I would have been overjoyed to hear this news a month before. Now I felt very little. “Really? Thank you.”\n “Let’s you and I head up to Emergency Management headquarters.”\n This was in a city to the north. Originally a metropolis of ten million souls, now it was home to just a few thousand. Emergency Management’s multistoried building was covered in immense, transparent shielding, completely separated from the external world. The shield was a layer of ionized air. Maintaining it consumed a lot of energy per day.\n The security inspector and I passed through strict sterilization protocols and finally went inside.\n The vast structure was two million square meters, like a small town. There was no need of biohazard suits within, so people wore a sense of superiority. This was not surprising. Most had been upper level figures in the institutions of the old nation.\n I was given a bit of a tour. People seemed to live and work in peace and contentment. Food was abundant, no different than pre-Plague times.\n “As of now, the virus has not been detected within two hundred square kilometers of here. It is estimated the shield can come down in five months.”\n I spotted the statue of a woman in a public square. She’d been a film star, famous just a few years before, and one of the first to get petrified. It was said she’d caught the virus overseas and brought it back with her.\n The statue was meticulously carved, so lifelike.\n “Are her films shown here?” I asked.\n “Yes, the Director General loves them.”\n I got closer for a better look and couldn’t help a chuckle. “Why not sculpt her clothes instead of dressing her in real ones? Kind of a waste for a bit more realism . . . ” Suddenly I understood, and in shock I said, “But . . . isn’t she contaminated?”\n “Not at all. According to rigorous inspection, after seven months, the petrified no longer carry virus. She’s been here over a year.”\n I laughed in disbelief. “But . . . then isn’t what we do . . . totally useless work? We could just keep them well apart, and wait, to eradicate the virus.”\n “It wouldn’t be the same. Burning the recently petrified has controlled proliferation to a great degree. You have made a huge contribution to humanity. So, let’s go have a look at the food processing base, shall we?”\n I followed him to Emergency Management’s core. Food from outside was unavoidably contaminated, so it was only here, completely sealed off from the external world, that safe food production could be assured. Currently, all food rations came from here, via null-gravity passages sent to various regions.\n Having gained a shallow impression from this brief tour, I was led back to the public square. We sat beside a fountain, and the security inspector said in a low voice, “The Director General will receive you this afternoon. He will speak with you, and you must be agreeable, and conformable, acceding to his wishes.”\n “Why?”\n “The Director General has supreme authority these days. No one may contradict him.”\n “But what will he say?”\n “Things that may be hard for you to accept. You must exercise self-restraint. You have a rare chance here. Value it, don’t blow it.”\n Something flashed through my mind. “Are the petrified still alive?”\n His expression darkened. “Who told you that?”\n “Don’t tell me it’s true.”\n He let that go and asked again who told me, adding, “It’s Category A classified.”\n “Is it true?” I said, this time with more force.\n We sat there staring at each other, and he looked away first. “Yes, it’s true. And lower your damn voice. There are lots of people around.”\n I stood and gestured at the film star. “And she’s still alive, and moving and thinking in slow motion?”\n “That’s right,” he said, standing, keeping his voice low. “A year ago, her hand was still raised above shoulder level. Now it’s below, as you can see. And her feet have also moved.”\n “So you’re saying I’ve been a murderer for the past two years?”\n “No need to be so coarse about it,” he said. “Rats are living things, but you used to catch and drown them without hesitation.”\n “They’re not rats! They’re people!”\n Suddenly resolute, he said, “Incorrect. They are no longer people. They’ve become a new form of life, a different species really, and when they threaten us, we have the right to annihilate them.”\n “The right?” A hollow laugh emerged from my throat. I recalled that woman’s words. What was authority, in the end? Nothing but a synonym for audacity. I was just one small screw in the meat grinder of authority. I could revolt, merely obliging the machine’s owner to change out a tiny, insignificant part.\n “I’ve changed my mind,” I said. “I wish to forgo my security qualification.”\n He looked at me in amazement. “Are you crazy? Do you realize that, although a Crow’s chance of infection is low, there’s still close to a hundred cases per year? Only security personnel—”\n “I appreciate your good intentions, but unfortunately I’m still troubled by this superfluous thing called ‘a conscience.’”\n He put a hand on my shoulder and said, “Listen, I get it. I came up from the Crows too. But there are many points of view from which to see this issue. Why not take some time to think it over?”\n I seized his hand and moved it away. “No need. I’ve done plenty of thinking.”\n “You’re being impetuous. The next batch of security qualification bids is in three months. Think about it, and hopefully change your mind by then.” He walked off several steps, then turned and added, “You know, this won’t change anything. When egg meets stone, the stone doesn’t even notice. Think about it.”\n I watched him head for the disinfection locks. I suppressed the impulse to call after him, stop him, tell him I’d been silly and swayed by personal feelings.\n Dusk was purpling the sky when I returned to my residence. At the entrance, I saw her gaze seemed to have softened. I snorted at this. For the sake of my worthless little conviction, was I passing on a once-in-a-lifetime opportunity? I wasn’t so noble. Only now did I truly admire my colleagues who had committed suicide.\n These days, it was impossible to live with an entirely clear conscience.\n The next day I went back out in my truck. Taking a detour from my usual route, I heard someone wailing in an abandoned shop. I parked and jumped out to have a look.\n Two burly, un-suited men were holding down someone in a suit—a woman, by the sound of her cries.\n I drew my gun and said, “Stop!”\n One of the big men looked up. With a breathless laugh, he said, “Crow, this is none of your business. Now beat it. Us guys only have a few days left. Why not let us have a little fun?”\n Their intended victim was a thirty-something woman. Through her faceplate I could see she wore earrings—unusual these days. I leveled my weapon. “Get out of here. Don’t have much time left? All the more reason not to harm anyone.”\n The speaker drew a knife from his waist, sneering. “Sermons from a stinking goddamn Crow. Do you really think I give a shit? Look what I’ve become. Beat it or shoot, if you have the guts.”\n I released the safety. A few months before, I would’ve fired without hesitation.\n He threw his knife. I dodged and the blade grazed my arm as it flew past. It stuck in the wall behind me. I fired. His body jerked, then collapsed with an odd grace. Blood flowed along the floor like a small serpent.\n The other man got up, looking repentant and terrified. I waved my gun and said, “Go. The farther the better.”\n The woman rose, in vain covering a tear in her suit, and fell to kicking the man. “Fire! Hurry! Kill him! Kill him!”\n I drew back from her and said to the man, “Go now! Or do you want me to fire?”\n He ran out.\n The woman turned to kicking me. “Why did you let him go? My dad used to be governor of this province, you know!”\n I pushed her away. “Miss, please take off your biohazard suit. You’re no longer qualified to wear it.”\n “No longer qualified?” she wailed. “How about you?”\n That was when I understood. The knife had cut open my suit. Not only that, it had opened my flesh, and blood flowed. It didn’t really matter, but I knew that millions of viruses had already poured into the wound. I began removing the suit. “Yes Miss, you’re right.”\n She watched in horror. With the suit off, I felt more than a little relaxed. “Go on, you next.”\n Back at my residence, I didn’t go inside. The sterilization lock was meaningless to me now. Because the virus had entered my bloodstream directly, via my wound, the infection would proceed quickly. The flesh around the cut was already solidifying. I lay down on the ground and watched the star-studded heavens.\n I hadn’t done this for ages. The vast, twinkling field of stars, thousands strong, was beautiful. The stars had existed since remote antiquity. Maybe some hosted planets with life, beings that had known all sorts of joys and sorrows, vicissitudes, partings, and reunions.\n I smiled bitterly, knowing I didn’t have much longer to appreciate the stars. What was the scope of a human life? Measured against ocean depths, Mount Sumeru was no different than a grain of corn. And compared to the boundless cosmos, what was an ocean? What was the arrogance of the King of Yelang? Laughable. Yelang had been a small barbarian kingdom in southern China during the Han Dynasty, insignificant, the conceit of its monarch parochial at best. But what about the Han Dynasty in the scheme of things? What right did it have to ridicule others?\n I slept in warm ash. As though still imbued with life, it floated and fell like fireflies. The moonlight was gentle and soft, and her gaze seemed to flow like a liquid. But I wasn’t dreaming.\n The security inspector must have come while I slept. He’d left me a big bundle of rations, enough for two months.\n I still went out every day, gathering statues and throwing them in the flames. Life is ever-changing and impermanent. But I was determined not to burn her, no matter what.\n Now, I am more or less immobile. The virus has done its work thoroughly, causing my body to petrify fast. Although my eyes retain their sight, I don’t know if that will continue. Will I be able to see when I’m completely stone?\n If I exert myself, it’s still possible to force movement. Under petrified skin, muscle tissue retains some power and flexibility. It is sufficient to move my body, but bound to cause skin fissuring. This doesn’t hurt, of course, though it’s appalling to behold. My nerve endings petrified long ago and cannot convey pain signals. Or they can, but it will take a long time. A year perhaps, or two, or a century or a millennium.\n I don’t want to leave too many gaping wounds on my body. I exert myself enough to cautiously move my feet, to make my body advance. How much a day? A micron? A nanometer? The meter I must travel is like an odyssey. But in a thousand years, or two thousand, I will embrace her, and my lips may touch hers.\n Calmly and quietly, I wait.\n “Students,” the professor on the stage said, “as you’ve probably learned in previous lessons, human civilization six thousand years ago was rudimentary. We used to believe this era was quite primitive, with nothing much beyond fire use, tech wise, but the recent excavation of two sculptures could render these ideas obsolete.”\n He drew back a white cloth and revealed two statues.\n “Everyone note how lifelike they are. Despite the excessive realism, their expressions are a bit flawed. The man’s passion is too fierce, the woman’s cold detachment overdone. But you can all see the anatomical proportions are masterfully balanced. They could almost model for art students.”\n After this joke, he said, “Problems of artistic expression don’t concern us, of course. Our research focus is elsewhere. In this class, I will lecture on that era’s technological level. We used to believe they didn’t produce ironware, but now there’s proof we could be wrong. Without iron tools, how could they have managed this? Look . . . ” He took a sheet of paper from the lectern and placed it between the two stone faces. “Take note. That’s just two millimeters between their lips!”\n Originally published in Chinese in Science Fiction World, October 2002.\n Translated and published in partnership with Storycom.\n Andy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles."}