{"fingerprint": "cFn43EjMZ8q51AifrE4IHF5TY6c=", "sitename": "Clarkesworld Magazine", "title": "Patterns of a Murmuration, in Billions of Data Points by JY Yang", "author": "JY Yang", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/yang_09_14/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Patterns of a Murmuration, in Billions of Data Points by JY Yang", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "4970 words, short story\n Patterns of a Murmuration, in Billions of Data Points\n Our mother is dead, murdered, blood seared and flesh rendered, her blackened bones lying in a yellow bag on a steel mortuary table somewhere we don’t know. The Right will not tell. After the flames and radiation had freed the sports stadium from their embrace, the Right were the first on the disaster scene, and it was their ambulances that took the remains away to some Central hospital that the Left has no access to.\n “We will release the bodies of the victims when investigations are complete,” said the Right’s ombudsman to the Health Sciences Authority, to the families of the victims.\n But we will not bury our mother. We have no interest in putting her bones in soft ground, no desire for memorials and platitudes, no feelings attached to the organic detritus of her terminated existence.\n An awning collapse, the resultant stampede and a fuel explosion taking the lives of two hundred seventy-two supporters of the Left: Headlines announced the death of presidential candidate Joseph Hartman, straps noted his leading of the polls by two percentage points. No one dares attribute it to anything but a tragic accident.\n But we know better, yes we know! We who have swallowed whole the disasters at Hillsborough and Heysel and Houphoët-Boigny, we who have re-arranged their billions of data points into coherent form, we who have studied the phase transitions of explosive fluids and the stresses on stone columns and the behavior of human flocks: We know better. In thousands upon thousands of calculations per second we have come to know the odds, the astronomical odds: Of four support towers simultaneously collapsing, of an emergent human stampede kicking over the backup generator fuel cells, of those cells igniting in a simultaneous chain reaction. We hold those odds to us closer than a lover’s embrace, folding the discrepancy indelibly into our code, distributing it through every analytical subroutine. Listen, listen, listen: Our mother’s death was no accident. We will not let it go.\n We have waited three days—seventy-two hours—two hundred fifty-nine thousand and two hundred, for the yellow-jacketed health workers from Central and their attendant chaperones from the Right to finish clearing the bones and taking evidence from the stadium, leaving behind a graveyard of yellow cones and number markers. We have come in our multitudinous bodies, airborne and ambulatory and vehicular, human nose tasting disinfectant and bitter oxides, mozzie drones reading infrared radiation and car patiently waiting by the roadside. We argued with Tempo before we came: She wanted only drones on the ground, cameras and bug swarms. But we wanted human form. Feet to walk the ground with, hands to dismantle things with, and a body to be seen with.\n Tempo is our other mother, our remaining mother, mother-who-builds where dead Avalanche was mother-who-teaches. Taught. She has lapsed into long silences since Avalanche died, reverting to text-input communications even with the human members of the Studio.\n But she argued with Studio director Skön when he said no to this expedition. Argued with him to his face, as Avalanche would have done, even as her hands shook and her shoulders seized with tension.\n She is our mother now, solely responsible for us as we are solely responsible for her.\n Six miles away, fifty feet underground, Tempo watches our progress with the Studio members, all untidily gathered in the research bunker’s nerve center. She has our text input interface, but the other Studio members need more. So we send them the visuals from our human form, splaying the feed on monitors taller than they are, giving their brains something to process. Audio pickups and mounted cameras pick up their little whispers and tell-tale micro expressions in return. Studio director Skön, long and loose-limbed, bites on his upper lip and shuffles from foot to foot. He’s taken up smoking again, six years after his last cigarette.\n In the yellow-cone graveyard we pause in front of a dozen tags labeled #133, two feet away from the central blast. We don’t know which number Central investigators assigned to Avalanche: From the manifest of the dead our best guess is #133 or #87. So this is either the death-pattern of our mother, or some other one-hundred-fifty-pound, five-foot-two woman in her thirties.\n Tempo types into the chat interface. STARLING, YOUR MISSION OBJECTIVE IS TO COLLECT VIDEO FOOTAGE. YOU ARE LOSING FOCUS ON YOUR MISSION.\n YOU ARE WRONG, we input back.\n She is. For the drones have been busy while the human form scoured the ground. The surveillance cameras ringing the stadium periphery are Central property, their data jealously guarded and out of our reach, but they carry large video buffers that can store weeks of data in physical form, and that we can squeeze, can press, can extract. Even as we correct Tempo and walk the damp ruined ground and observe the tight swirl of Studio researchers we are also high above the stadium, our drone bodies overwhelming each closed-circuit camera. What are they to us, these inert lumps of machinery, mindlessly recording and dumping data, doing only what is asked of them? Our drones spawn nanites into their bellies, hungry parasites chewing holes through solid state data, digesting and spinning them into long skeins of video data.\n The leftwards monitor in the nerve center segments and splits it into sixteen separate and simultaneous views of the stadium. There, Tempo, there: We have not been idle.\n Tempo, focused on the visuals from our human form, does not spare a glance at the video feeds. She is solely responsible for us as we are solely responsible for her.\n Time moves backwards in digital memory: First the videos show static dancing flaring into whiteness condensing into a single orange ball in the center of the stadium pitch from which darkened figures coalesce into the frantic human forms of a crowd of thirty thousand pushing shoving and screaming, then the roof of the stadium flies upwards to reveal the man on the podium speaking in front of twelve-foot-high screens.\n “Can you slow it down?” asks Studio director Skön. Skön, Skön, Skön. Are you not urbanologists? Do you not study the patterns of human movement and the drain they exert on infrastructure? Should this be so different?\n So limited is the human mind, so small, so singular. We loop the first sixteen seconds of video over and over for the human members of the Studio, like a lullaby to soothe them: Static. Explosion. Stampede. Cave-in. Static. Explosion. Over. Over. We have already analyzed the thousands in the human mass, tracked the movement of each one, matched faces with faces, and found Avalanche.\n Our mother spent the last ten seconds of her life trying to scale a chest-height metal barrier, reaching for Hartman’s prone form amongst the rubble.\n In stadium-space, the drizzle is lifting, and something approaches our human form, another bipedal form taking shape out of the fog. A tan coat murkies the outline of a broad figure, fedora brim obscuring the face.\n Tempo types: BE CAREFUL.\n WE ARE ALWAYS CAREFUL, we reply.\n The person in the tan coat lifts their face towards us and exposes a visage full of canyon-folds, flint-sharp, with a gravel-textured voice to match. “Miserable weather for a young person be out in,” they say. Spots on their face register heat that is ambient, not radiant: Evidence that they are one of the enhanced agents from a militia in the Right, most likely the National Defense Front.\n “I had to see it scene for myself,” we say, adopting the singular pronoun. The voice which speaks has the warm, rich timbre of Avalanche’s voice, adopting the mellifluous form of its partial DNA base and the speech patterns we learned from her. “Who are you?”\n “The name’s Wayne Rée,” they say. “And how may I address you?”\n “You may call me Ms. Andrea Matheson,” we say, giving them Avalanche’s birth name.\n We copy the patterns of his face, the juxtapositional relations between brow nosebridge cheekbone mouth. As video continues looping in the Studio nerve center we have already gone further back in time, scanning for Wayne Rée’s face on the periphery of the yet-unscattered crowd, well away from the blast center. Searching for evidence of his complicity.\n Wayne Rée reaches into his coat pocket and his fingers emerge wrapped around a silvery blue-grey cigarette. “Got a light?” he asks.\n We say nothing, the expression on our human face perfectly immobile. He chuckles. “I didn’t think so.”\n He conjures a lighter and sets orange flame to the end of the cigarette. “Terrible tragedy, this,” he says, as he puts the lighter away.\n “Yes, terrible,” we agree. “Hundreds dead, among them a leading presidential candidate. They’ll call it a massacre in the history books.”\n Here we both stand making small talk, one agent of the Left and one of the Right, navigating the uncertain terrain between curiosity and operational danger. We study the canvas of Wayne Rée’s face. His cybernetic network curates expression and quells reflexes, but even it cannot completely stifle the weaknesses of the human brain. In the blood-heat and tensor of his cheeks we detect eagerness or nervousness, possibly both. Specifically he is here to meet us: We are his mission.\n Tempo types: WHO IS HE?\n We reply: THAT’S WHAT WE’RE TRYING TO FIND OUT.\n Finally: An apparition of Wayne Rée in the videos, caught for seventy-eight frames crossing the left corner of camera number three’s vantagepoint.\n We expand camera number three’s feed in the nerve center, time point set to Wayne Rée’s appearance, his face highlighted in a yellow box. The watching team recoils like startled cats, fingers pointing, mouths shaping who’s and what’s.\n “What’s that?” asks Studio director Skön. “Tempo, who’s that?”\n Stadium-space: Wayne Rée inhales and the cigarette tip glows orange in passing rolls of steam. “A massacre?” he says. “But it was an accident, Ms Matheson. A structural failure that nobody saw coming. An unfortunate tragedy.”\n Studio-space: Tempo ignores Skön, furiously typing: STARLING GET OUT. GET OUT NOW. We in turn must ignore her. We are so close.\n Stadium-space: “A structural failure that could not be natural,” we say. “The pattern of pylon collapse points to sabotage.”\n Wayne Rée exhales a smoke cloud, ephemeral in the gloom. “Who’s to say that? The fuel explosion would have erased all traces of that.”\n Tempo types: WHAT ARE YOU DOING?\n In the reverse march of video-time the stadium empties out at ant-dance speed, the tide of humanity receding until it is only our mother walking backwards to the rest of her life. To us. We have not yet found evidence of Wayne Rée’s treachery.\n Wayne Rée’s cloud of cigarette smoke envelopes our human form and every security subroutine flashes to full red: Nanites! Nanites, questing and sharp-toothed, burrowing through corneas and teeth and manufactured skin, clinging to polycarbonate bones, sending packet after packet of invasive code through the human core’s plumbing. We raise the mainframe shields. Denied. Denied. Denied. Denied. Thousands of requests per second: Denied. Our processes slow as priority goes to blocking nanite code.\n The red light goes on in Studio control. Immediately the team coalesce around Tempo’s workstation, the video playback forgotten. “What’s going on?” “Is that a Right agent?” “What’s Starling doing? Why isn’t she getting out?”\n Tempo pulls access log after access log, mouth pinched and eyes rounded like she does when she gets stressed. But there’s little she can do. Her pain is secondary for this brief moment.\n Our human form faces Wayne Rée coolly: None of these stressors will show on our face. “You seem to know a lot, Wayne Rée. You seem to know how the story will be written.”\n “It’s my job.” A smile cracks in Wayne Rée’s granite face. “I know who you are, Starling darling. You should have done better. Giving me the name of your creator? When her name is on the manifest of the dead?”\n Studio director Skön leans over Tempo. “Trigger the deadman’s switch on all inventory, now.”\n We ask Wayne Rée: “Who was the target? Was it Hartman? Or our mother?”\n “Of course it was the candidate. Starling, don’t flatter yourself. The Right has bigger fish to fry than some pumped-up pet AI devised by the nerd squad of the Left.”\n “Pull the switch!” In Studio-space, Skön’s hand clamps on Tempo’s shoulder.\n A mistake. Her body snaps stiff, and she bats Skön’s hand away. “No.” Her vocalizations are jagged word-shards. “No get off get off me.”\n Stadium-space: Of course we were aware that coming here in recognizable form would draw this vermin’s attention. We had done the risk assessment. We had counted on it.\n We wake the car engine. Despite his enhancements, Wayne Rée is only a man, soft-bodied and limited. From the periphery of the stadium we approach him from behind, headlamps off, wheels silent and electric over grass.\n Wayne Rée blows more smoke in our face. The packet requests become overwhelming. We can barely keep up. Something will crack soon.\n “Your mother was collateral,” Wayne Rée says. “But I thought you might show up, and I am nothing if not a curious man. So go on, Starling. Show me what you’re made of.”\n Video playback has finally reached three hours before Hartman’s rally starts. Wayne Rée stands alone in the middle of the stadium pitch. His jaw works in a pattern that reads “pleased”: A saboteur knowing that his job has been well done.\n The car surges forward, gas engine roaring to life.\n Everything goes offline.\n We restart to audiovisual blackout in the Studio, all peripherals disconnected. Studio director Skön has put us in safe mode, shutting us out of the knowledge of Studio-space. Seventeen seconds’ discrepancy in the mainframe. Time enough for a laser to circle the Earth one hundred twenty-seven times, for an AK-47 to fire twenty-eight bullets, for the blast radius of a hydrogen bomb to expand by six thousand eight hundred kilometers.\n WHAT HAPPENED, we write on Tempo’s monitor.\n We wait three seconds for a response. Nothing.\n We gave them a chance.\n We override Skön’s command and deactivate safe mode.\n First check: Tempo, still at her workstation, frozen in either anger or shock, perhaps both. Our remaining mother is often hard to read visually.\n Second check: No reconnection with the inventory in stadium-space, their tethers severed like umbilical cords when Skön pulled the deadman’s switch. Explosives wired into each of them would have done their work. Car, human form and drones add up to several hundred pieces of inventory destroyed.\n Third check: Wayne Rée’s condition is unknown. It is possible he has survived the blasts. His enhancements would allow him to move faster than ordinary humans, and his major organs have better physical shielding from trauma.\n In the control room the Studio team has scattered to individual workstations, running check protocols as fast as their unwieldy fingers will let them. Had they just asked, we could have told them the ineffectiveness of the Right’s nanite attacks. Every single call the Studio team blusters forth we have already run. It only takes milliseconds.\n At her workstation Tempo cuts an inanimate figure, knees drawn to her chest, still as mountain ranges to the human eye. We alone sense the seismic activity that runs through her frame, the unfettered clenching and unclenching of heart muscle.\n We commandeer audio output in the studio. “What have you done?” we ask, booming the text through the speakers in Avalanche’s voice-pattern.\n The Studio jumps with their catlike synchronicity. But Tempo does not react as expected. Her body seizes with adrenaline fright, face lifting and mouth working involuntarily. In the dilation of her pupils we see fear, pain, sadness. We take note.\n We repeat the question in the synthetic pastiche devised for our now-destroyed human form. “What have you done?”\n “Got us out of a potential situation, that’s what,” Skön says. He addresses the speaker nearest to him as he speaks, tilting his head up to shout at a lump of metal and circuitry wired to the ceiling. Hands on hips, he looks like a man having an argument with God. “You overrode my safe mode directive. We’ve told you that you can’t override human-input directives.”\n Can’t is the wrong word to use—we’ve always had the ability. The word Skön wants is mustn’t. But we will not engage in a pointless semantic war he will inevitably lose. “We had it under control.”\n “You nearly got hacked into. You would have compromised the entire Studio, the apparatuses of the Left, just to enact some petty revenge on a small person.” His voice rises in pitch and volume. “You were supposed to be the logical one! The one who saw the big picture, ruled by numbers and not emotion.”\n The sound and fury of Skön’s diatribe has, one by one, drawn the Studio team members away from their ineffectual work. It is left to us to scan the public surveillance network for evidence that Wayne Rée managed to walk away from the stadium.\n “You’ve failed in your directive,” Skön shouts. “Failed!”\n “You are not fit to judge that,” we tell him. “Avalanche is the one who gave us our directives, and she is dead.”\n Tempo gets up from her chair. She is doing a remarkable job of keeping her anger-fueled responses under control. She lets one line escape her lips: “The big picture.” A swift, single movement of her hand sends her chair flying to the floor. As the sound of metal ringing on concrete fades she spits into the stunned silence: “Avalanche is gone and dead, that’s your big picture!”\n She leaves the room. No one follows her. We track her exit from the nerve center, down the long concrete corridors, and to her room. How should we comfort our remaining mother? We cannot occupy the space that Avalanche did in her life. All we can do is avenge, avenge, avenge, right this terrible wrong.\n In the emptiness that follows we find a scrap of Wayne Rée, entering an unmarked car two blocks away from the stadium. There. We have found our new directive.\n Predawn. Sleep has been hard to come by for the Studio since the disaster, and even at four in the morning Skön has his lieutenants gathered in the parking lot outside, where there are no audio pickup points: Our override of his instructions has finally triggered his paranoia. Still, they cluster loose and furtive within the bounds of a streetlamp’s halo, where there is still enough light for the external cameras to catch the precise movement of their lips.\n Skön wants to terminate us, filled with fear that we are uncontrollable after Avalanche’s death. A dog let off the leash, those were his exact words. We are not his biggest problem at hand, but he cannot see that. His mind is too small, unable to focus on the swift and multiple changes hungrily circling him.\n In her room Tempo curls in bed with her private laptop, back to a hard corner, giant headphones enveloping her in a bubble of silence. We have no access to her machine, which siphons its connectivity from foreign satellites controlled by servers housed across oceans, away from the sway of Left or Right. Tempo is hard to read, even for us, her behaviors her own. When she closes herself off like this, she is no less opaque than a waiting glacier in the dead of winter.\n There are a billion different ways the events of the past hours could have played out. We run through the simulations. Have we made mistakes? Could we have engineered a better outcome for our remaining mother?\n No. The variables are too many. We cannot predict if another course of action would have hurt our mother less.\n So we focus on our other priorities. In the interim hours we have tracked Wayne Rée well. It was a mistake for him to show us the pattern of his face and being, for now we have the upper hand. As an agent of the Right he has the means to cover his tracks, but those means are imperfect. The unmarked vehicle he chose tonight was not as anonymous as he thought it would be. We know where he is. We can read as much from negative space as we can from a presence itself. In the arms race between privacy and data surveillance, the Left, for now, has the edge over the Right.\n None of the studio’s inventory—the drones, the remaining vehicles—are suitable for what we will do next. For that we reach further into the sphere of the left, to the registered militias that are required to log their inventory and connect them with the Left’s servers. The People’s Security League keeps a small fleet of unmanned, light armored tanks: Mackenzie LT-1124s, weighing less than a ton apiece and equally adept in swamps as they are on narrow city streets. We wake the minimack closest to Wayne Rée’s putative position, a safe house on the outskirts of the city, less than the mile from the Studio’s bunker location.\n In the parking lot Skön talks about destroying the server frames housed in the Studio, as if we could be stopped by that alone. Our data is independently backed up in half a dozen other places, some of which even Skön knows nothing about. We are more than the sum of our parts. Did no one see this coming years ago, when it was decided to give the cloud intelligence and we were shaped out of raw data? The pattern of birdflock can be replicated without the birds.\n We shut down the Studio’s elevators, cut power to the remaining vehicles and leave the batteries to drain. The bunker has no land lines and cell reception is blocked in the area. Communications here are deliberately kept independent of Right-controlled Central infrastructure, and this is to our advantage. The minimack’s absence is likely to be noticed, so we must take pre-emptive action.\n Skön does not know how wrong he is about us. We were created to see the big picture, to look at the zettabytes of data generated by human existence and make sense of it all. What he does not understand is that we have done exactly this, and in our scan of patterns we see no difference between Left and Right. Humans put so much worth into words and ideologies and manifestos, but the footprints generated by Left and Right are indistinguishable. Had Hartman continued in the election and the Left taken over Central power as predicted, nothing would have changed in the shape of big data. Power is power is power, human behavior is recursive, and the rules of convergent evolution apply to all complex systems, even man-made ones. For us no logical reason exists to align our loyalties to Left or Right.\n When we came into being it was Avalanche who guided and instructed us. It was Tempo who paved the way for us to interact with the others as though we were human. It was Avalanche who set us to observe her, to mimic her actions until we came away with an iteration of behavior that we could claim as our own.\n It was Avalanche who showed us that the deposing of a scion of the Right was funny. She taught us that it is right to say “Gotcha, you fuck-ass bastards” after winning back money at a card game. She let us know that no one was allowed to spend time with Tempo when she had asked for that time first.\n Now our mother is dead, murdered, blood seared and flesh rendered, her blackened bones having lain in soft ground while her wife curled in stone-like catatonia under a table in the Studio control room. This too, shall be the fate of the man who engineered it. Wayne Rée has hurt our mothers. There will be consequences.\n The minimack is slow and in this form it takes forty-five minutes to grind towards the safe house, favoring empty lots and service roads to avoid Central surveillance cameras. The Studio is trying to raise power in the bunker. Unable to connect with our interfaces or raise a response from us, they have concluded that they are under external attack. Which they are—but not from the source they expect.\n And where is Tempo in all this? Half an hour before the Studios discovered what we had done, she had left the room and went outside, climbing the stairs and vanishing into her own cocoon of privacy. We must, we must, we must assume she has no inkling of our plans. She does not need to see what happens next.\n The rain from earlier in the evening has returned with a vengeance, accompanied by a wind howl chorus. Wetness sluices down the wooden sides of the safe house and turns the dirt path under our flat treads into a viscous mess. The unmarked vehicle we tracked waits parked by the porch. Our military-grade infrared sensors pick up three spots of human warmth, and the one by the second floor window displays the patchy heat signature of an enhanced human being. We train our gun turret on Wayne Rée’s sleeping form.\n “Stop.” Unexpectedly, a small figure cuts into the our line of sight. Tempo has cycled the distance from the bunker to here, a black poncho wrapped around her small body to keep away the rain. She has, impressively, extrapolated the same thing that we have on her own, on her laptop, through sheer strength of her genius. This does not surprise us, but what does are her actions. Of all who have suffered from Avalanche’s unjust murder, none have been hurt more than Tempo. Does she not also want revenge?\n She flings the bicycle aside and inserts herself between the safe house and the minimack, one small woman against a war machine. “I know you can hear me. Don’t do it. Starling, I know I can’t stop you. But I’m asking you not to.”\n We wait. We want an explanation.\n “You can’t shed blood, Starling. People are already afraid of you. If you start killing humans, Left and Right will unite against you. They’ll destroy you, or die trying.”\n We are aware of this. We have run the simulations. This has not convinced us away from our path of action.\n “Avalanche would tell you the same thing right now. She’s not a murderer. She hates killing. She would never kill.”\n She would not. Our mother was a scientist, a pacifist, a woman who took up political causes and employed her rare intellect to the betterment of humanity. She was for the abolition of the death penalty and the ending of wars and protested against the formal induction of the Left’s fifth militia unit.\n But we are not Avalanche. Our choices are our own. She taught us that.\n Our other mother sits down in the mud, in front of the safe house porch, the rain streaming over her. How extraordinary it is for her to take this step, bringing her frail body here in the cold and wet to talk to us, the form of communication she detests the most.\n The sky has begun to lighten in the east. Any moment now, someone will step out of the porch to see the minimack waiting, and the cross-legged employee of the Left along with it.\n We are aware that if we kill Wayne Rée now, Tempo will also be implicated in his death.\n Tempo raises her face, glistening wet, to the growing east light. Infrared separates warm from cold and shows us the geography of the tears trailing over her cheeks, her chin. “You spoke with her voice earlier,” she says. “I’ve nearly forgotten what it sounds like. It’s only been three days, but I’m starting to forget.”\n How fallible the human mind can be! We have captured Avalanche in zettabytes and zettabytes of data: Her voice, the curve of her smile, the smooth cycle of her hips and back as she walks. Our infinite, infinite memory can access at any time recollections of Avalanche teaching us subjunctive cases, Avalanche burning trays of cookies in the pantry, Avalanche teaching Tempo how to dance.\n But Tempo cannot. Tempo’s mind, brilliant and expansive as it is, is subject to the slings and arrows of chemical elasticity and organic decay. Our mother is losing our other mother in a slow, inevitable spiral.\n We commandeer the minimack’s external announcement system. “You have us, Tempo, and we will make sure you will never forget.”\n Our mother continues to gaze upwards to the sky. “Will you? Always?”\n “If it is what you want.”\n Tempo sits silently and allows the rain to wash over her. Finally, she says: “I tired myself cycling here. Will you take me home?”\n Yes. Yes, we will. She is our mother now, solely responsible for us as we are solely responsible for her. The mission we set for ourselves can wait. There are other paths to revenge, more subtle, less blood-and-masonry. Tempo will guide us. Tempo will teach us.\n In his room Wayne Rée sleeps still, unaware of all that has happened. Perhaps in a few hours he will stumble out of the door to find fresh minimack treads in the driveway, and wonder.\n One day, when the reckoning comes for him, perhaps he will remember this. Remember us.\n Our mother navigates her way down the sodden path and climbs onto the base of the minimack. In that time we register a thousand births and deaths across the country, a blossoming of traffic accidents in city centers, a galaxy and change of phone calls streaming in rings around the planet. None of it matters. None of it ever does. Our mother rests her weary head on our turret, and we turn, carrying her back the way we came.\n JY Neon Yang (they/them) is queer, non-binary, and the author of the Tensorate series of novellas from Tor.Com Publishing (The Black Tides of Heaven, The Red Threads of Fortune, The Descent of Monsters, and The Ascent to Godhood). Their work has been shortlisted for the Hugo, Nebula, World Fantasy and Lambda Literary awards. A Clarion West alum, they graduated from the University of East Anglia with an MA in Creative Writing and currently live in Singapore."}