{"fingerprint": "dnrdVeLKDmlRBlh42JgMeSnXyBs=", "sitename": "Clarkesworld Magazine", "title": "A Stick of Clay, in the Hands of God, is Infinite Potential by JY Neon Yang", "author": "JY Neon Yang", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/yang_05_20/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Stick of Clay, in the Hands of God, is Infinite Potential by JY Neon Yang", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "10640 words, novelette\nA Stick of Clay, in the Hands of God, is Infinite Potential\nfor Rhiannon\nCONFIG A\nTo the pilot, Phoenix smells like blood. Or at least the mech smells like the pilot’s mouth tastes every time it bites down and the copper floods in, so that’s close enough. It’ll have to do. The pilot likes it better in here than out there anyway, because outside the pilot has a troublesome body that bleeds when cut and won’t listen to what it wants, but in here the pilot has no body and no shape, only Phoenix-shape, and Phoenix is shaped like a knife, or a missile, or a swift punch, something meant to rend and destroy. Phoenix bends the shape of the universe to its will. Some say the mech looks like an angel, with the fan of thrusters haloed around its shining fist of a head, but in Phoenix the pilot feels like a bird of prey. All beak and talon, pursuing apostates that flee before its shadow like frightened rabbits.\nToday the rabbits are C-class single-unit fighters, glazed in the gold and green of apostates, streaking from a battlefield spangled with wreckage and ionized fuel. Weak-boned things: eggshell hulls and wispy shields, spitting angry needles of blue light until the pilot crushes them in the palms of its hands. They dodge and weave frantically, hoping their agility will let them escape, but it’s no use. C-classers were never meant to face mechs. Puny surface fighters designed to take out ground turrets and windows in government offices are no match for the fifty-foot juggernauts that are mecha units. Snap, snap, pop. Each one makes a satisfying crunch as the pilot destroys them.\nPhoenix pulses with breath while the pilot works, and it soaks up the beat of the mech’s heart as it does its job. No, “soaks up” is the wrong descriptive. “Inhales” is better. The pilot inhales the mech’s heartbeat. Her heartbeat. While it sits in Phoenix’s glowing head, spine jacked into neural net, she is in the chest, her body floating in a sea of amniotic fluid, and when her heart beats the mech around her shivers and drums with power. That’s her, whom the pilot belongs to. That’s her, Phoenix’s holy sigil. A God-given boon, without which the mecha fighter is inert stone and plasma. A blessing. A wonder. A beloved miracle. The pilot kills another enemy and there goes the responding twitch in its senses, a reminder that she is there and feels everything that it feels. Was the twitch an expression of delight? Perhaps. It hopes so.\nThe C-classers are down to a handful. The apostates must be in bad shape, sending them as the last line of defense. How pitiful. Beneath the field of slaughter lies the candied atmosphere of Amar-7, pinks and blues hiding a surface ulcerated by an apostate base. Halfway to the center of apostate territory, these installations have grown increasingly tedious to dispose of. Sameish. Deficient. Unchallenging. Battles fall into an easy routine, and the pilot tires of routine. Beside it the other three mechs—Garuda, Strix, and Roc—are cleaning up the stragglers. No more shall come from the surface, except perhaps unarmored civilian shuttles. The denizens of the surface in a last-ditch exodus, hoping their sheer number will let some get past the line of hostiles. But it won’t. The pilot has been there before, seen the results. Whatever ships the four mechs miss, the mothership will take out. There is no escape for them.\nA shadow passes over them: giant wings circling overhead, just out of orbital range. The Räsvelg waits to see what the apostates will do. Will they flee like roaches? Or wait to die in their dens like dogs? Minutes tick by and no movement in the swirls of troposphere. So they have chosen the path of cowardice, preferring to give in to death rather than to fight. That’s fine. It’s their choice. The mothership pings the mech battalion with new orders. It’s time to finish the job.\nThe pilot receives the Räsvelg’s command with pure euphoria. It sweeps Phoenix forward with the other mechs, drilling red-hot through Amar-7’s atmosphere. It already knows what they will find on the other side of this vapor wall: crunchy domes of plexiglass and soft warrens of clay, crumbling at first touch. One shot of energy will carbonize them; nothing fired in return will scratch the adamantine mechs. The battle might last fifteen minutes, give or take a few. Those on the surface will know exactly what hit them, and then they will know nothing at all.\nLittle joy exists in razing that which offers so little challenge, but a victory is a victory. Every moment spent in Phoenix is a chance to be something else. A chance to live and act with precision and direction. A chance to be in a body that fits. Only here does the pilot feel like an embodiment of the promise it was meant to be: perfection made flesh. A flawless tool for her purposes, flensed of selfishness and self-loathing. This is the closest thing to euphoria that the pilot knows. As it punches through the final layer of troposphere and descends upon the apostate base, guns blazing, it feels her power in its guts, as if her body is its body, and emotion rushes through it so strong that it could weep.\nCONFIG B\nA clip of free time lies between the end of battle and the official debrief. In this transition, the mech pilots and holy sigils make a loose semicircle in the docking bay, sitting and standing half out of flight suits, reconnecting with gut and nerve, with fingers and toes. Slowly easing back into humanity. Eight souls in total, one pilot and one sigil per mech. Eight extraordinary beings, selected and made to perform extraordinary tasks—\n- Helianthus (he): Strix’s sigil, flame-haired and recalcitrant;\n- Rosa (she): Strix’s pilot, sweetly smiling but hollow inside;\n- Grimoire (they): Roc’s sigil, who would not spit on you if you were on fire;\n- Gauntlet (he): Roc’s pilot, who would fight literally anybody and anything;\n- Sparrow (they): Garuda’s sigil, large eyes always on the verge of tears;\n- Kestrel (she): Garuda’s pilot, who almost never speaks her mind, but when she does it is with insight so honed it flays meat to the bone. Like the time she said “It’s not love for her that drives you. You’re lying to yourself, that’s why you’re miserable.”\nThat particular canard was addressed to you. Phoenix’s pilot. The other members of the battalion call you Stick (and sometimes Sticker), a nod to your stoop and your awkward angles. When Kestrel said “her” she meant her, the last member of the mech battalion. She. Phoenix’s holy sigil. Versus is the name they gave her, but in the white halls of the Grand Cathedral they call her God’s perfect weapon, and that is always how you think of her. Versus the immaculate soldier, jaw wired with determination, curls cropped to the bone of her scalp. Outside of Phoenix she has a girl’s face and a girl’s body, half soft and half angles, simultaneously incomprehensible and yet the answer to all your questions. Versus is everything you’ve ever wanted. To look at her is to fill yourself with an ineffable glut of desire, sticky and sweet.\nGod’s perfect weapon sits an agonizing distance away, wrists loose and elbows on knees, gaze on the scuffed floor. Brows knitted. “Something wrong, Versus?”\nIt’s Rosa, who always asks the questions. Versus looks up. “That wasn’t a military base.”\n“They haven’t been for a while,” says Helianthus, voice rough with irritation. “We’re a ways into enemy space now, it can’t all be war stuff.” And he’s right. Past the defensive barrier of skin, burrowed deep into flesh, the Räsvelg has reached the gut and gristle of apostate society on its way to the heart. It can’t all be war stuff. There are other things that get in the way, which must be torn asunder to get to the prize.\n“That was a civilian installation we burned,” Versus says through the gaps in her teeth. “It was somebody’s home.”\nHelianthus crosses his arms, deepens his slouch against the wall. Deep sarcasm flavors his voice. “Everyone’s got to live somewhere. Even despots and mass murderers.”\nGrimoire snorts. “Pretty rich talking about mass murderers here, friend.”\n“Versus is right,” Rosa says. “The people who lived on Amar-7 weren’t soldiers or even scientists furthering the war. They were just ordinary people trying to live their lives.”\n“They needed to die,” you say.\nThe others turn with varying speed and intensity. Surprised. Not used to hearing from Stick, the silent one. Rosa frowns. “Needed to die?”\n“We have an objective, and they stood in our way. Therefore they had to be eliminated.” As Rosa struggles to formulate a reply, you continue: “In war, anything that obstructs us from our goal is an enemy.”\n“Wow. Stick.” Gauntlet runs a hand over the stubble of his hair. “I knew you were cold, but damn. That’s cold.”\n“This is our job. It’s what gives us purpose. What else is there?”\nRosa uncrosses her legs. Both feet flat on the floor, eyes narrowed, she says: “Maybe it’s what gives you purpose, Stick. But we weren’t all made to be war machines. Some of us were people before this.”\n“Rosa.” Versus gets up, taut with disquiet. “That’s enough.”\nThe other woman looks away. Grows silent. Around Versus the holy sigils and pilots shuffle wordlessly, eyes to their feet or the bones of their hands. The fight is over, the discussion at an end, halted by the same ones who started it. No one argues with the will of God’s perfect weapon. As it is. As it should be.\nOf course it was Rosa creating trouble. It was Rosa, after all, who objected to you at first. Not you, necessarily. Not in so many words. But it was her who went to Versus and said, I can’t bear to call your pilot an it. That’s not—That’s awful. I can’t. Can’t they pick something else? Can’t we use they?\nVersus said, those are the pronouns it uses. It’s not bothered by them, what’s the problem?\nThe problem, Rosa said. The problem is that the people who thought they owned me used to call me an it. I heard it, every day, for years, as a child. And I’m sorry, but I can’t hear it now without thinking of them. I’ve tried so hard to forget. Please. It’s such a loaded word. You can’t possibly be okay with this idea. Are you?\nI’m sorry, Versus said. I didn’t know. That’s awful, I’m sorry. I’ll bring it up.\nIn the end, a compromise: no pronouns, just Stick in the place of it/its, which everyone, even Versus, takes a little too readily to. And it works. It’s not what you asked for, but on the other hand, no one’s unhappy.\nStick is an appellation decided by consensus. Your makers never named you, referring to you as “it,” “the subject,” or with one of the many labels pulled from your file. Project Hou-Ou. Cb48. Male Specimen 15. They grew you from a bone, like Eve, and like Eve they tested you and then ejected you into the world with no armor and no instructions. Versus is your Adam, and on the first day your Adam asks your name, thinking simply that God would provide. She looks at you, perfect and breathtaking, and you, still grappling with language, say: It does not have a name. But it’s the wrong answer. Versus finds your namelessness indefensible, so the Räsvelg’s pilots and sigils designate a call sign you don’t hate and print it on your jackets. Stick is fine. But the first time Versus says, well, in my trials with him—or something similarly banal—you flinch as if slapped.\nIt, you say. It, not him. I’m not a him.\nBut aren’t you a dude? Gauntlet blurts, mouth the fastest part of him as usual. Yet instant understanding flits through Versus. Noted, she says firmly and fusslessly, which leads to Rosa’s later, private protest, and then the compromise. But you’re still an it even as the word is silenced, the syllable fitting over you snug as a membrane, a film. It when you wake up, it when you sweat through training, it when you sit in the fluorescence of the mess hall with the chatter of the other pilots and sigils surrounding you. Most damningly of all, it still in the freedom of Phoenix’s cockpit where all pretense is stripped away, where you are purpose and nothing but purpose. A tool, a miracle, an it. God’s perfect weapon.\nThe commandants load on the praise in the post-Amar-7 briefing, pleased with the battalion’s development in the year since the campaign began. Faster. More efficient. Fewer cuts to the kill. A map on the glass charts the Räsvelg’s progress through apostate space, a bullet fired from the gun of the Pope and Holy Emperor, clearing the way for the army of the Lord. The thin line of your progress dives ever-closer to its goals. Babel-9. The apostate home base. The capital of blasphemy and rebellion. “Three more battles to the end,” says Holy Commandant Basil, pointing out each target with a bony finger. “By this time next week, the war could be over.”\nHe tuts as joy sweeps the room, a chittering wave passing through the ranks of lieutenants and armchair generals, none of whom will ever see the inside of a mech. “Don’t get so excited. You know the obstacles that lie between us.”\nA hush falls at the reprimand. Into that empty gap someone whispers “The Beast . . . ” and someone else silences them, but it’s too late. The damage is done. Tension grazes the surface of the room. The battalion’s faces turn grim, but it’s her reaction that catches you. She turns her face to hide it, but you catch the barest flash of a familiar sorrow.\nYou know Versus well enough to recognize this sadness, which comes upon her late at night in your shared quarters, before you are banished to your own bunk. She spends long hours in the common bathroom that has been arbitrarily designated the ladies’ room because the girls all hang out there, and you suspect that it is in this place that she expresses her unnamable, wordless grief. You are afraid to follow her there, and therefore this sorrow is an aspect of her that she keeps to herself, and you know nothing of it except that it is there. You’ve grown to accept its existence, confined as it is to the walls of her private spaces. But now it rears its head in the light of the situation room. Why? She is soon to face her greatest enemy. Should she not be ecstatic at the culmination of her purpose? The destiny she was chosen for? The reason you were made for her?\nThe Beast. The Adversary. The wicked blade of the Devil. You will face it soon. The entirety of your existence has been a buildup to this moment of triumph (for you are sure that it will be a triumph). You will meet the creature you were made to destroy, vanquish it, and win victory for the righteous. You should be rapturous with joy. But her ambivalence gives you pause. And you thought you knew her, she whose flesh is your flesh, whose pulse dictates your pulse, whose thoughts should be your thoughts. Yet she is, in this moment, opaque to you. A gap, an unexpected loss in the codons of the narrative that make up your life. Your Adam, God’s perfect weapon, is now a question mark, and you don’t understand. Nor do you have an answer.\nCONFIG A\nThe holy mechs were God’s gift to His children, revealed to the blessed prophet Saint Laurent as the flanks of the last human starfleet traversed the hollow voids of space. Not quite stone and not quite living but somewhere in between, woken only by the blood of holy sigils who are born and not made. Shepherds and guides of humanity, drawn to habitable planets, leaping galactic distances like mere streams, the mechs were instruments of peace until the Devil, in his subterfuge, tempted the apostates away from the loving light of God and toward darkness and violence and war. In this time of evil, where brother turned against brother, the mechs were reforged, plowshares beaten into blades, the beacons for God’s children turned into holy weapons to defend the faithful and the meek from the wicked.\nPhoenix and The Beast are inextricably linked, twinned through some ineffable design. There are two versions of this story, both of which the pilot has heard. The first is the bullet point wiki pumped into its head during training. Phoenix and The Beast are armored units, unique amongst the known mechs, impenetrable shields paired with a banquet of weapons for cutting, crushing, vaporizing, vanquishing. Originally designated Heavy Constructor Units 1 and 2, they were so slow when plugged with other holy sigils that they were unusable. She was specifically selected and trained as a child for her ability to bring Phoenix to maximum operational capacity. And the pilot, being her perfect mirror, achieves syncopation rates in the unit unrivaled by any other pilot in the army. Together they are a relentless weapon destined to meet The Beast before the final battle, for its rival twin is likewise the most formidable weapon the apostates possess, their ultimate line of defense.\nThe second version of the story is the gospel, which the pilot likes better, and which gets whispered from ear to mouth to ear, not in secrecy but in reverence—\n—In the time before the darkness, when the light of God still reached all, a prophetess spoke of two children, a boy and a girl blessed with holy blood, who would be called to fulfill an important destiny in years ahead. Although they did not understand it, the council of cardinals followed the counsel of the Lord to search all of humanity for signs of this blessed pair. Scouts were guided by His Grace to the treasure they sought, and it was she, one half of a pair of holy sigils whose blood and bodies woke the stately limbs of the twinned mechs and let them dance like hawks. Yet no pilot in all the army suited her, so one was made: a Stick shaped from the clay of her, a creature unlike her in every way. Yet in the embrace of the Phoenix they were seamless, pilot and holy sigil, perfection in the eyes of God, enjoined by divine will. When the apostates turned to wickedness and The Beast followed them, the girl and her pilot became the last beacon of hope against the encroaching darkness.\nThis is the version of the story the pilot recites to itself. It smoothes over all the awkward parts, like how it exists feeling like a collection of ill-fitting parts, or how it cannot look in a mirror for fear of seeing its body all wrong, or how it has to constantly fight sinful thoughts of wishing it would emerge from the womb that is Phoenix with the right body, in her body. The story it retreads to remind itself that it was made perfect, and to want otherwise is sin.\nPhoenix streaks toward the factory planet Ajde Prime, the tip of an arrow that comprises the other three mechs. The pilot is back in its place of comfort, this bodiless swell of agency and violence, surrounded by her existence, which overrides its own. Phoenix is the great swallower, consumer of the doubts saddled in its organic body and the questions weighing down its outside-mind. Here, it is free. Free not to worry, free not to think too hard, free not to be anything but the perfect weapon. The uncertainty of the last few days has left it hungry for the finality of destruction. Ajde Prime is unimpeachable as a target: the site of the apostates’ major shipyard, where they make the host that drives their war machine. Surely even that cotton heart of Rosa’s would find no objections in its destruction.\nBut something is wrong. Ajde Prime should be ringed by the fiercest defenses, guarded in the thousands by the sleek and sharp-toothed warships it pumps out. Yet the space around the system has remained silent and prayerful since the Räsvelg dropped out of hyperspace, and continues to be so as the mechs approach the gray-ringed planet, placid in the cool light of its sun. No swarm of angry fighters from the surface. No enemy squadrons. The orbital cannons lie sleepy and inert. It looks like Ajde Prime has been abandoned, as though they have been ghosted by their adversaries. Phoenix scans the surface for heat signatures and finds nothing but geology. Curious, confused, it hangs midair, arms empty, canons idle. Waiting for instructions.\nThe Räsvelg considers the situation carefully and slowly. It is, in all probability, a trap. Perhaps an overwhelming force hides in the gravity well of the planet, or perhaps they have rigged the surface with thermonuclear devices. A possibility with some precedence, the pilot knows. But in its amniotic fluid it feels no fear and no doubt. It waits only for instruction.\nInstruction, then: the Räsvelg orders the mechs to investigate the surface with full caution, Phoenix in front with weapons cranked, Strix, Garuda, and Roc as backup. Past the ice rings they go, through the crystalline atmosphere, and into the oxygen-starved environment of Ajde Prime. Mercury waves beat upon sulfurous shores and acid rain thickens the air. In these infernal environs the glass-walled domes of the apostates sit dark and gleaming, devoid of light and life. The pilot approaches them carefully, intensely alert for any wires it might be tripping, but the surface of Ajde Prime is silent. Was this a massacre, perhaps? Or an evacuation?\nAs if in answer an image flickers into its head, beamed through the same channels through which the Räsvelg transmits orders. An override. What comes through is a picture of a young person, gender unknown, shorthaired and excruciatingly beautiful. It would stop the pilot’s heart, if pilot-as-weapon were reliant on its pathetic body.\nThe image speaks. It’s a recording, a message. Not a conversation. The stranger has a smile like a star field, expansive and glittering. “Don’t panic, just a courtesy call. Apollo, at your service. Artemis sometimes, but not today. You’ll notice that your target, which you expected to be a bustling metropolis of thousands, is unexpectedly, hmm, vacant, you could say. It seems like somebody, can’t imagine who, tipped them off that you were coming. Convinced them it was in their best interests to leave. Of course, there was some resistance, but I think we did pretty well. Don’t you think?”\nThe pilot drifts, stunned and silent, unable to hold a thought. The stranger—this sometimes-Apollo and sometimes-Artemis—continues. “Aren’t you glad for the thousands of lives you’ve not ended today? Alright, maybe that doesn’t appeal to you. Maybe you think they deserve the death you would have brought them. That’s fine. Let me offer you something else, then. Ajde Prime was the main military industrial outpost of the Republic. Now that it’s been shut down, their production of warships has been put on hold. That should please you and your masters, no?”\nThe pilot has no way of replying and no words to reply with. The situation is baffling, unexpected, inexorable. The stranger speaks grandly but with a smirk, and the pilot cannot tell how much of their spiel is genuine. But what’s real is the emptiness below them. Ruse or not, Apollo/Artemis has gutted their objective.\nThe beautiful mirage leans closer, looming larger in the pilot’s headspace. “Listen, don’t you have doubts, sometimes? All of you, operators of these superweapons, bringing destruction wherever you go . . . doesn’t it bother you? The lives taken by your hands, the families and communities crushed under your feet . . . have you never stayed awake and thought about them? The Church says this holy war is necessary to cleanse the world of sin, but the blood you have shed, is that not also sin?”\nThe psychic closeness of the stranger, the intensity of their shadowy eyes: it feels like they are speaking to the pilot and the pilot alone. It cannot draw away, cannot blink, cannot shut out the parade of questions.\n“Have you never thought, there must be another answer? Never considered paths other than the one laid out before you? Never imagined other ways of being?”\nThe pilot thanks God it needs no breath right now. It is a trap; it’s definitely a trap. How else would this stranger know—? Forbidden thoughts flood in and the pilot fights to shut its mind down. It cannot let her see the doubts that cloud its mind, cannot let her know that its heart wavers in the dark corners of its consciousness.\nBut the strangest thing happens. From Phoenix’s heart, the seat of the holy sigil where she resides, comes a great shiver of emotion, a pulse of joy that sweeps the body of the mech. It recognizes the sensation as the same euphoria it feels when it is pilot. It has never felt its joy reciprocated—until now. Versus, suddenly enervated and excited, as she has never been.\nWhat does it mean?\nWhat has it missed?\nCONFIG B\nFresh out of her suit, unencumbered in the sliver of freedom before the commandants descend on them, Versus shimmers with excitement: a brightness in her eyes, a novel energy in her movements. Everyone has seen the message—all four mechs got it. But the Räsvelg didn’t; the moment the battalion exited atmosphere there came the demands to explain, what happened down there, you went radio silent. No answers for them—not immediately anyway, the pilots still processing what the hell just happened, so the battalion was hauled back to the ship.\nVersus scans the tiny decompression room. “Nothing happened down there, right?” Looking carefully and purposefully at each of you. “We saw Ajde Prime completely abandoned. No indication where they’d gone. Nothing left behind. Just the husk of a planet. Empty. Silent. Right?”\nThe girls—Rosa and Kestrel, mostly—nod. Sparrow looks away; Helianthus only frowns. Gauntlet bursts out, “But—!” and is instantly silenced by Grimoire’s hand on his wrist. “Versus is right, Gaunt. There was nothing there.”\nVersus’ gaze fixes upon you, seeking confirmation. She wants you to lie, knowingly, and you’re not sure why. But how can you refuse? She is blessed, after all, and you are only Stick. You push down the vile swarm of doubts rising in your throat and nod.\nWordlessly you sit through panels of questioning and disbelief. The higher-ups on the Räsvelg seem upset that their target evaporated without a fight, as though their holy mission is meaningless without bloodshed. Church superiors are deeply suspicious of this boon; it upsets their narrative of the apostates as war-frenzied animals. Finally, it is the Pope Ficus who says: God blessed us with His perfect weapon. As long as she remains with us, our mission is sacrosanct. It must continue as planned. So it is decided that you will cut deeper into the ventricles of apostate society. One more pit stop on the way to Babel. Whatever this incident at Ajde Prime was, it does not matter. You will take this blessing at face value.\nThat evening, after dinner, Versus tugs you by the wrist. “Come with me.”\nShe leads you to the bathroom and frowns—uncomprehending—when you physically resist her at the door. “What’s wrong?” she asks, as you pull your wrist from her grasp.\n“I can’t go in there.”\n“Why not?”\nWhy not? “That’s the girl’s bathroom.”\n“It’s not. Why would you . . . ?” Puzzlement collapses into disbelief. “That’s ridiculous, Stick. Gender segregation isn’t a thing in this day and age anymore. You do know this, don’t you?”\n“It’s just you and Rosa and Kestrel . . . ”\n“We’re the ones who talk. Come. I want to show you what we talk about.”\nThe thrill of being allowed is immediately overridden by the fear of deviance—not of breaking the rules, but of fitting in badly, like a misplaced puzzle piece. “I can’t.”\n“Stick.” She sighs. “Would it help if I said I’m not really a girl?”\n“What do you mean?”\nShe takes your hand again. “Nevermind. Just come.”\nDizzy and confused by her words, you allow her to lead you into the bathroom; it’s easier than fighting her. Inside, walls of steel glow with amber light. In the common area, away from the individual stalls, Kestrel and Rosa sit, animated by a swell of excitement you’ve never seen from them.\n“They pulled it off. I can’t believe it. I saw it but I still can’t—”\n“I know—Even I thought it was a mad plan, but—”\n“We’re blessed, surely we are. How did they—?”\n“They wouldn’t tell me, but—”\nVersus clears her throat lightly. The conversation chokes as the two look up and realize who stands next to her.\nPreemptively, Versus says: “I thought I’d invite Stick to join in our meetings.”\n“Oh.” Rosa folds her hands over her lap. “I see. I just didn’t think Stick would be interested in our conversation.”\n“I think Stick might agree with some of our philosophies,” Versus says.\n“That surprises me. After all Stick, you seemed pretty strident about our conquest. Have you changed your mind?”\n“Stick has doubts like we do. Don’t you?”\nGod’s perfect weapon is looking at you. You’ve been found out, betrayed by the ugly emotions exposed in Phoenix’s cockpit. Versus knows your weaknesses now. Is she testing you?\nKestrel says, gently: “Did the message we saw on Ajde Prime make you realize something, Stick?”\n“You . . . ” There must be something you can say that does not incriminate you further. “You know who left the message, don’t you?”\nRosa shoots Versus a furious look, but Kestrel only laughs. “Yes. I see you’ve guessed it, or something like it. Apollo is my twin. Born together, enlisted together, tested into the pilot program together. They had the blood of a holy sigil, I did not. Ironic, since we were meant to be identical.”\n“Your twin is an apostate . . . ”\n“Not an apostate.” Another laugh. “You couldn’t tell Apollo what to do, even when we were kids. They ran off and joined a group of conscientious dissenters—people who don’t believe this artificial war our leaders have concocted is necessary. It’s full of people from our ranks, but full of people from the other side too. And because they’re Apollo, they’re one of the leaders now. There’s a commune planet—whose location I can’t really disclose—but that’s where I want to be. Eventually.”\nButtoned-up Kestrel has let her mask slip; you’ve never seen her this relaxed. Untangled, her story makes sense now, a solid braid of cause and effect. All this while, behind the veneer of a brisk and competent pilot, she has been hiding the truth of a rebellious twin. “So you knew what would greet us on Ajde Prime . . . ?”\nKestrel flips a hand. “Hardly. Apollo told me they had plans, but I thought they were doomed to fail. I don’t know how they pulled it off. Timing? A long tail of preparation? An unbelievable helping of luck, most probably.”\n“A miracle,” Rosa says.\n“A miracle,” Versus repeats, firmly. She sits beside Rosa and gestures to the space next to Kestrel, for you. “God is good to us. He shows us the way where our leaders will not. He opens the paths for us to follow.”\nYou sit slowly, disoriented and silent. Kestrel takes your hand, and you jump at the touch of her fingers in all their warmth. She has on a kindly smile, but your voice is lodged in your lungs. The conversation continues around you as you struggle for footing on ground that keeps shifting.\nRosa clasps Versus’ hands. “Have you heard? There’s a rumor going around the officers’ quarters. The Beast is on the move now. We might end up fighting him sooner than expected.”\n“I see. No, I haven’t heard.”\n“Are you alright? You’ve gone pale.”\n“I—” Versus exhales, looks to the ceiling. “I don’t want to fight him. I really, really don’t.”\nIs she afraid of The Beast? Is that what drives these doubts of hers? You stare at her like you could pick her apart, revealing if it’s fear that lurks in her soul—or something else.\n“You know you don’t have to, don’t you? Versus, we’re all ready to make a move. Even Tweedledum and Tweedledee. The whole battalion can leave at any time. But we’re not leaving you behind.”\n“That’s not—” Her voice cracks, and the unfamiliar note chills every knot in your spine. You’ve never seen her like this, never, could not have imagined it ever. She trembles like a bulkhead about to splinter, fingers twisted, eyes to the ground. “Jordan is a believer, he’s never going to abandon his post and betray our teacher. And I can’t leave him to rampage unchecked. As long as The Beast fights, I have to oppose him.”\n“Allie, you know that’s not true. What he does is between him and God, and no one else. You’re only responsible for your own fate.” Rosa leans forward. “Every battle we fight, every moment we linger on in this rich man’s war, we make it worse.”\nVersus sighs and her shoulders slump forward. Kestrel says, “Have you prayed on this, Alicia?”\n“I have. I have prayed for an answer for so, so long, yet God has not given me a sign. I don’t know—maybe I should beg His forgiveness, but . . . ”\n“Have you considered,” Rosa says, “that the miracle we witnessed today might have been one such sign?”\n“I . . . have, yes.”\n“I always say prayer takes time,” Kestrel says, “but we’re running out of time.”\n“Yes. Prayer.” Versus straightens up, eyes bright. Holds out her hands. “Let us pray.”\n“Let us pray,” Rosa agrees.\nA circle forms, Kestrel’s warm hand in your left and Versus’ dry one in your right. “I will pray for the souls of the lost,” Rosa says, “and for those on Ajde Prime. God keep them safe.”\n“I pray for my sibling,” Kestrel says. “For their safety and the success of their mission.”\nVersus makes a throat-sound, then pauses to draw in a long breath, long enough that your skin starts to chill. Everyone waits. Finally she says, her eyes downcast: “I pray for The Beast.”\nNow it’s your turn. What should you pray for? For guidance? For clarity? For victory in battle? For more esoteric things, like the realization of your want to be mech, permanently, or perhaps a name that makes sense to you, that is yours? Or maybe a body that feels like it’s on your side. That you don’t feel betrayed by every time you catch your reflection.\nEveryone is looking at you. You reach for the closest, easiest thing. “I pray for happiness,” you say. “For joy. For euphoria.”\nThe four of you lower your heads, and you pray.\nIn your bunk, flat on your back, vision a starless vista of ceiling, sleep evades you. The breathing from the lower bunk tells you that God’s perfect weapon is similarly awake.\n“Versus,” you begin.\n“What is it?”\n“What did you mean when you said you’re not really a girl? Earlier.”\n“Ah.” Her voice is dark, glossy. “Does that bother you? It’s nothing. Not much, anyway. I just don’t think I’m a girl, it’s a feeling I’ve had for a long time. I’m in-between. Not one or the other. But that’s largely inconsequential. I have a job to do. Or maybe a job to not do. In any case that’s what I’m focusing on. I can worry about myself later.”\n“But it does matter,” you say. “The prophecy said you should be a girl . . . ”\n“I know. I mean, I don’t like the prophecy very much. Or at all. But I suppose that’s why I’ve never mentioned it. I don’t want to upset people, or . . . draw scrutiny. I’m not really bothered if people think of me as a girl. There are other things that bother me more.”\n“Like The Beast.”\nA volcanic sigh. “Like The Beast.”\nSilence creeps back into the room. After a while, she says, “I’m sure you have questions about that.”\n“I don’t know.”\nHer weight shifts audibly in the bunk below. She’s sat up, speaking into the dark. “Jordan and I were found as children. They singled us out from the blood banks. We were ten. They came to our schools and they had lists of names and everything. After extensive tests we were the only two left. It’s been obscured by the Church, but the prophecy—the program—was really about making sigils who were also pilots. It’s tied up with why the schism happened . . . but that doesn’t matter now. Jordan and I were part of the program. We were cultivated together for . . . how many years was it? Seven? Ten? No, it has to be seven. The schism happened when we were seventeen. So, seven years. We trained together, lived in the same house . . . we weren’t allowed outside on our own. Of course not. In that time, Jordan was family. My twin brother. We did everything together. Then the schism happened, and our teacher, the man who led us . . . he left to become an apostate. Jordan went with him. They were always closer than I was. This was . . . five years ago? Ten? Time doesn’t make sense anymore. That was what happened. We haven’t seen each other since.”\nThe expressionless ceiling doesn’t blink as you stare. Versus’ words rattle in your head like bullet casings, or untethered ships, an empty collection of sounds and syllables that should have meaning attached, but you can’t decode them.\nA shuffle of synthetic against synthetic from below. It goes on for a while, then Versus appears at the edge of your bunk, standing on tiptoe, the hard square of a transflat in her hand. “Here.” It lights up with a photo album, a scroll through the tender years of Versus’ life. There she is, birthday cake, there she is again, draped over the edge of a radioactive blue pool, there she is nestled in the yellow arms of a tree. A different Versus, with skinnier arms and teeth that look too big for her face. In every picture there is a boy beside her, bright-eyed and velvet-cheeked, his grin wider than hers. The pilot of The Beast, as a child, and then as an older child. He and Versus look nothing alike, clearly they’re not related, but there’s a sameness to them that makes them look like a pair. Most of the pictures are taken in one house, with arched windows and fake vines plastered to the cornices. It looks nice. Is it nice? You have no baseline to judge this with.\nVersus watches the passage of her life with a fond smile. Her voice has gone soft and rounded with a timbre you’re unfamiliar with. “When we were chosen, we were rebaptized. Given new life, given over to service in God’s name. Jordan was my brother, but he was more than that. They preached that our souls were twinned, you know? It was important to us. I loved him. And . . . I don’t want to fight him, but he made his choices. Now it’s come to this.”\nThe slideshow of Versus’ other life continues. Versus in a red skirt patterned with flowers. Versus in blue jeans, shredded at the knee.\nShe says, “It still confuses me sometimes, frightens me even, how everything turned out. How you can live with someone for so long, and think you know them to the last atom, to their soul, and find out you were wrong.”\n“I see,” you say. It’s a lie. Or maybe it’s not a lie. Versus is right.\nShe looks curiously at you. “Stick,” she says, “why did you ask me about the gender thing? Of all the facts you learned today, why was that the one that bothered you the most?”\nYou look at the bones of your hands. The light from the transflat carves crescents of shadow behind your knuckles. “How did you know?”\n“I didn’t,” she says. “I figured it out. It wasn’t like an angel descended on a beam of light and told me what my gender was. It’s an ongoing process. Little feelings, here and there, that maybe my gender was more of a question than I thought. Things weren’t right, or didn’t fit right. Eventually I realized what it meant.” She places her fingers, firm and cool, over your wrist. “It could be an ongoing process for you too.”\nYou nod and she frowns, concerned by your silence. “You’ve had a lot to take in. Are you alright? Do you want to talk about anything?” But you don’t. What good would talking do? How could talking ever solve any of your problems?\nIt really isn’t about Versus’ gender, except that it is. You thought you knew which side of the divide she was on. It informed the map of your life. You used to reason with yourself like this, sometimes: Eve was grown from the rib of Adam, yet Eve turned out woman while Adam turned out man, so it follows that you should be opposite of Versus, the same way Eve was opposite of Adam. Yet this burning desire for your body and existence to perfectly mirror hers won’t leave you alone, and this is what drives your extraordinary resonance in Phoenix. Your need to change yourself is not driven by your selfish desires, but a side effect of what you were designed for; you have to yearn toward her being or the connection won’t work. She is the vessel for God’s will and so are you. A tool, a miracle, an it. God’s perfect weapon.\nBut that’s been turned upside down. There’s a Versus you never knew, a Versus who doubts her mission, a Versus who has a history you knew nothing about. A Versus before she was Versus. And if Versus isn’t who you thought she was, if she’s not even the gender you thought she was, then where does that leave you? In a body you understand less than before, with a mission that has been muddled beyond comprehension.\nWhat are you supposed to do?\nCONFIG A\nThe big fight, when it comes, is entirely unexpected. A jerk out of hyperspace, and the corridors go angry with red light and black smoke. The mech battalion falls out of bed and scrambles into battle, adrenaline-drunk. The apostates have tracked down the Räsvelg and dragged it into Newtonian space using forbidden technology, the Devil’s tools. By the time the pilot mounts itself in Phoenix’s cockpit, the enemy is a series of flashing blips on the horizon. The Beast, tailed by two support mechs. Half-familiar shapes, gilded in the shimmering livery of the apostates. The Räsvelg is halfway from its destination the next system over. The apostates have decided not to wait for their arrival, taking matters into their own hands.\nThe Beast and its companions have the silhouettes of trees, of centipedes, of bones: all spindle and angle and wrong. They’ve taken God-given mechs and defiled them. Twisted them to unholy purpose. The sight of this blasphemy sets the pilot’s soul alight, burning its doubts to white powder. This is what it was made for. Its ultimate battle. Kill or be killed.\nThe Beast agrees. The abomination rushes its enemies in an arc of pure hunger, and God above it moves so fast, its entire arm is a gleaming blade of destruction. The pilot joyously leaps to meet it—\nNo.\nThe pilot has never heard Versus speak while they are joined. Shock jars its grip on control, and in that glistening half-second Versus pulls on the brakes and Phoenix comes to a sudden, juddering halt. I don’t want to. I won’t.\nWhat is she doing, what is happening? The resonance that comprises God’s perfect weapon has been shattered. The pilot fights Versus for dominance, but it cannot win, not when she is the holy sigil, the heart and engine of the mech, and The Beast is nearly upon them, ready to strike—\nThe Beast vanishes. The stars vanish. The universe around them vanishes. Phoenix vanishes from under the pilot, as though subatomized in the flick of an eyelid. Pink light fills its consciousness.\n“There you are.”\nThe pilot knows that voice. That rich velvet belongs to Apollo/Artemis. The dissidents are here, but how? Were they tracked, was there collusion? What did Apollo do?\n“Sorry about the surprise.” Apollo/Artemis’ voice curls around the pilot’s spine, or whatever it is that passes for a spine here. “It’s me, your friend Apollo. In the flesh. Or, well. In the mind.” A silvery laugh. “Shouldn’t have entered the atmosphere of Ajde Prime, huh? We left a few surprises for you. Almost shocked no one checked for nanites, but that’s the problem with the papacy, isn’t it? You’re all so full of yourselves, you never thought that the planet itself might be a trap.”\nThe dissidents have won control of the mechs, somehow. Are the nanites in the fighters, or in their bodies? In fact, it doesn’t matter. Some kind of neural net has a hold of them. The pilot’s body? Mind? Is trapped in this vast gummy pink, like sugar, but spun with spidersilk, suffocating and inexorable. It tries to rip something free, an arm, a leg, anything. Its perception of the universe has been sublimated by this wooly expanse, and the longer it stays here the more it feels like there is nothing to the universe but this soft blankness. Where is The Beast? Where is the rest of the battalion? Where is Versus?\nHere she comes, rising enormous and avian through the fog. A wild swoop of emotion. Where is he? What have you done with him?\nApollo speaks into both their minds. “Sorry, had to intervene. Would have been bad if you two killed one another. Trying to avoid that, you know?”\nThe other holy sigils and pilots are elsewhere in this ether, faint but familiar pings of contact, generous in their calm. Rolling with this turn in their fortunes, better than the alternative.\nVersus speaks to Apollo. I know you. We’ve never met, but I know you.\n“Same. Listen, you’ve got to withdraw from here. I have him too, all three of them, but I can’t hold them back for long, the nanites will give out.”\nI want to talk to him.\n“I thought you might. Not sure if that’s gonna work, though. Might be a bad idea.”\nPlease, let me try. I have to.\nAll this time the pilot has experienced Versus as a neutral presence in Phoenix: a heartbeat, a body that powers the mech like a battery. Inert. She’s never been wired with naked determination like this, lit with the kind of fire that would burn cities to cinders. Versus has come alive the way she is in the flesh, bold and sharply defined as she is on the Räsvelg. All this time, the pilot’s wants have smothered the truth of her apathy when they are joined. It never knew.\nA white swell surges toward them, cetacean and threatening. The Beast is on the hunt through the gelatinous pink. He seethes with fury: he cannot believe he has been thwarted so close to his goal. His frustration poisons the ether in waves. The Beast wants nothing but to kill and to vanquish and to destroy; war has broken and shaped him into a creature that craves violence above all. His bloodthirst tugs at the pilot with an ache of familiarity, horrifying and sticky as a broken tooth. That’s what I look like, it thinks.\nJordan.\nVersus’ entreaty only draws the white whale toward them at double speed. There’s nothing there but rage and rows of teeth that shine as he yawns open to swallow them whole.\nApollo intervenes. In this liminal space they are the end and the beginning, the morning and the evening star, and The Beast freezes in place, jaw unhinged, close enough to touch. Jordan, Versus says. It’s me. It’s Alicia. You remember, don’t you?\nDoes he? Where is the child from that house with the windows and the plaster vines, who put bunny ears on people in photos and wore silly pirate costumes to parties? Is that child still alive in the belly of the beast? Or is there nothing left but rage and teeth?\nJordan, listen. We don’t have to fight. I don’t want to fight. Let’s run away. Let them sort out their problems on their own.\nFuck you. The Beast speaks like an avalanche. Like stones being crushed. His voice is exactly as the pilot has pictured.\nThis isn’t like you. You’re not an angry person, you’re not hateful. I remember you, you were a kind kid. You’ve changed, but it doesn’t have to be this way.\nShut the fuck up. You sound like a loser.\nJordan, I’m serious. Let’s leave now, we can go with Apollo. I miss you. This war isn’t worth us killing one another.\nFuck you. Go on and run then. I’ll cut you down like the coward you are. I’ll see you in hell.\nThe Beast disappears without breath or sound, and all that’s left is the boggy pink. “That’s enough of that,” Apollo says. “Hey sis—Versus—y’all got to go now, the net is fraying. I’ll hold the apostates while you call a retreat, but you’ve got to get out. The time for reason is over. Now’s for survival. But hey—” he says, a parting shot that sparks through the pilot’s consciousness—“don’t keep me waiting too long, alright?”\nThe cotton candy universe vanishes, and they’re back in the lightless void of space, fighting distance from the crooked jaws of the Beast and its associates. Still inert, trapped in Apollo’s grip. The pilot, returned to the comfort of Phoenix, which is solid, which is all that it knows, is back in control of itself. It wrenches toward its foe, seeing the God-given opportunity to destroy its defenseless target.\nBut Versus tugs back. Stops the pilot from doing its job, just as she did before. Versus is radioing the Räsvelg, calling for a retreat, and the ship’s commanders, relieved of their panic at the sudden suspension of their most precious war units, agree at once. They are withdrawing, leaving the frozen apostates behind. The pilot no longer recognizes the shape of the world.\nCONFIG A\nThe commandants are in an uproar. The dissidents have been a longtime spine in the side of the Church, but they’ve never been a threat until now. There’s no script, no verse, no commandment that teaches how to deal with this. They’re on their own, until the apostates learn to find them again.\nWhile the higher-ups are locked in for hours of shouting and recriminations, Versus calls a clandestine meeting of her own, defying orders to stay in quarters until further notice. It’s an emergency. They’re just about to find out that your battalion lied in the last debrief; time is running out for you and this group of traitors-in-waiting. No, not in waiting: that is incorrect. Traitors in truth and flesh. Just undiscovered. The crime has been committed, it cannot be undone. It’s part of who you are now, woven into your bones as surely as your blood makes endless pilgrimage in your veins. It was Versus who led you to this, all of you but you in particular. You let her do this to you.\nThe eight of you cram into the bathroom-conference room, now claustrophobic with bodies. Everyone is here, even mousy Sparrow tucked under Rosa’s arm. It really is a gender-neutral bathroom after all. You breathe very slowly and carefully and try not to let your skin touch anyone else’s.\n“What do we do?” Helianthus asks, grumpily. He makes it sound like this is a minor inconvenience, like someone’s broken the foodmaker in the mess hall.\n“We have to leave,” Versus says. The doubt has been distilled from her voice and all that’s left is conviction, pure and clear and stinging. The Beast, her last tether to the Church, has been peeled from her soul. “The plans we’ve made? Now’s the time to put them in motion.”\nA murmur of assent. Kestrel says, “Are you sure, Allie?” Not to cast doubt, but to fortify her resolve.\n“I am.” The passage of Apollo’s intervention has changed her, broken her spine and reforged it into steel. She emerged from the wet cradle of Phoenix a different person. You thought she was a weapon before, but you realize you never understood the word.\nThe rest of the battalion seems sad, but determined. Frightened. Eager. As Rosa rubs Sparrow’s shoulders, a glassy realization—they’ve talked about this before—cuts you. Everyone in this room has had private conversations about this, whole fora about sedition and doubt and disbelief, and it was all hidden from you. It recasts every conversation you’ve had with them, every argument you’ve watched them have. Suddenly you’ve found yourself in a group of strangers. Ice climbs your spine and lodges in the base of your skull.\nThe Beast felt so familiar in Apollo’s neural net. Like recognizing. Like mirrors for each other. You are the Beast, standing in disguise among a group of humans. Ugly and yellow as old bone.\n“Ten minutes,” Kestrel says. “Apollo’s people are close by. There’s a satellite planet. I just have to give the signal.”\n“And they’ll be here?” Gauntlet asks.\n“Yes,” Kestrel says. “We have to be ready to move out by then.”\nThe battalion will take the holy mechs. The Church might be able to make new pilots, pray for new sigils, but the mechs are irreplaceable. The consequences of their betrayal will be unthinkable, unknowable, unchartable. Before you yawns a great chasm of uncertainty with no bottom.\nGauntlet slaps his palms together. “Aight then, let’s go.”\n“Wait.” Rosa reaches out and catches him by the sleeve. “Let us pray, first.”\n“Let us pray,” Versus affirms.\nIn the tiny gender-neutral bathroom everyone joins hands, heads bowed. In the tightness and anxiety of the circle nobody notices that you’re standing apart. Your hands are hidden, tucked behind your back, nails biting into the flesh of your palm.\nIn your shared quarters Versus is cramming what little she has into a duffel bag. “We have to hurry,” she says, her voice tight with—what is it, nervousness? Excitement? You can’t tell. You feel lightyears away from her, even though she is close enough to touch. “That prayer cut out all the buffer time we had. We shouldn’t have done that.” Then she freezes, halfway through zipping up, struck by her own words. “What am I saying? Of course we should have.” She sighs, then looks at you. “Stick, what’s wrong? You haven’t packed.”\nNo one has asked for your opinion in this entire process. Not a single person, not even Versus. It was just assumed that you would follow obediently. Now she comes toward you, brows knitted. “Stick, you’re coming with us, aren’t you? We can’t leave you behind. I mean. I suppose we can. But I don’t want to.”\n“Why would you think I’d want to do this?”\nShe blinks, startled. “Because you aren’t happy here.”\nYou frown.\n“You aren’t, are you? You aren’t happy with what they’ve made of you. What they want you to be. You aren’t happy.”\nYour mouth is dry is as the chasm between stars. “I don’t know how to be.” It’s an alien word, an alien concept, a thing that happens to other people while you stand on the outside and watch. What does happy mean? What is it, an emotion? A series of things happening? A state of being?\n“Come with us,” she pleads, taking your hands. “We’ll find out.”\nFear spasms through your forearms, and you pull your hands from hers, embarrassed and afraid. “I can’t.”\n“Stick . . . ”\nMaybe happiness is a lack, an absence. Maybe it’s the void left behind that uncertainty, doubt, and self-loathing would otherwise occupy. Maybe it’s the feeling, that precious feeling, that you only ever feel in one place, under one condition.\nYou say, “I’m not like you. I can’t be happy living in a house with other people, a nice house with windows and vines on the ceiling. I wasn’t made for that. I was made to be a weapon. I’m only happy being a weapon.”\nShe tilts her head. “You think violence is all you’re good for?”\n“Yes.”\n“Fine.” She goes back to her bag, unzips it. Time is spiraling away while you’re having this conversation; Versus should just leave. But she doesn’t. She pulls a long, stony thing out of the bag. A knife. Unsheathed, its black blade gleams like a smile.\nShe marches back to you, puts the knife in your hand and takes your wrist. Tucks the sharp, obsidian edge under her chin, where jaw and neck meet. “Do it. If only violence makes you happy, then do it.”\nYou’re frozen. Her grip on your wrist is so strong that you cannot pull back, and if you slide yourself free you will cut her throat open. Even letting go of the blade might harm her.\n“What’s wrong? Can’t do it? Why not, Stick? I’m a traitor; I’ve conspired with my fellows to commit high treason. If your mission is so important, you have to stop me, don’t you?”\n“Versus, stop.”\nShe lets you go and your shaking hand snaps instantly to your chest, fingers curled around the knife’s handle like a vise. It’s surprisingly light, well-made, carbon fiber? Ceremonial, or a memento.\n“There, Stick. It’s not the violence that drives you, is it? It’s not violence that matters to you. You’re just chasing the things that make you happy. That make you feel whole. So that makes you human, like any of us. You deserve to be human.”\n“But—” What about the unmatched euphoria that only comes when you are Phoenix, when you are mech, when you are it? Is that not by design? “There’s something wrong with me. I’m broken.”\n“No. That’s untrue.”\nHer face is soft and sad; the thought of cutting into her fills you with nausea. You push down the horrifying images of her with her neck sliced through, her blood all over your hands and her tunic and the floor. This isn’t anything like the fire and brimstone of Phoenix’s cockpit. The world has been smashed open like a candy egg and you can’t make sense of anything that’s spilling out of it. You look at the flesh on your own wrist, filled with blood and tendons. It’s you, it’s this body, it’s always been.\nBut if your body is a problem, it can be solved. And the tool to do so is in your hand.\nVersus closes her hand around your wrist again. Gently this time, but with enough pressure to let you know that she’s prepared to stop you from doing the rash thing that’s leaped into your mind. You haven’t said a word, but she knows anyway. “Don’t.”\nTime hasn’t stopped. The two of you can’t stay locked here much longer. You’re holding her back. Versus has already made her choice, she knows what she wants. You, on the other hand, know nothing about anything. She should let you do the rash thing. “I’ll only burden you.”\n“You won’t,” she says. “I promise.”\nShe says: “Come with me, Stick. Please.”\nShe says: “They made you a weapon, just as they turned me into one. They fed us sweet lies to keep us happy at our jobs. But we aren’t weapons, Stick. We aren’t objects, no matter how much they want us to be. We don’t have to stay the way they made us.”\nYou shiver. You shake your head. You’re haunted by the Beast, angry even when offered a chance at peace. If he couldn’t be redeemed, how can you? “I don’t know any other way to be.”\n“Because it’s the only choice you’ve ever had. But there can be more. Will be more.”\nYou lick your lips. There’s terror there, in the dryness. But there’s also hope and the freedom of the unknown, which is almost as frightening. Versus isn’t letting you go, and maybe Versus knows better than you what makes a monster and what makes a person. She’s seen the other side of the mirror, after all. “I don’t know how to be human.”\nA small smile. “Nobody does.” A squeeze of the hand. “But let’s figure it out together.” Her skin against yours is warm. Her wrist against your wrist, the blood pulsing within. Same as the blood pulsing through you. A resonance.\nCONFIG C\nIn the end, I still don’t know if it was the right thing to do. We took the mechs, the main offensive force of the Church, and ran without looking back. The vacuum that resulted didn’t collapse structures, but it tilted the war back in favor of the apostates. They’re still fighting, as far as we know. Maybe we could have ended the war earlier, if we’d stayed in it. But maybe we would have made it worse. It’s impossible to know now. What’s important is we got out.\nThese days there is the yellow sky of an M-class planet, a field heaped with flowers and herbs, a house on a hill that looks like a glass cathedral. These days Helianthus, who goes by Lars, has cultivated an excessive number of fruit trees, an orchard really; there are never enough hands to help with the harvest, never enough mouths for all the jars of preserves we make. Kestrel, who these days goes by Nike, is helping her twin run the resistance. She’s here and there, but she visits when she can. Sparrow, who these days goes by Jasper, is a painter. Gauntlet and Grimoire took off and established a satellite commune on the southern continent, I hear it’s doing well. And on the downslope of the hill, Versus, who these days goes by Alicia, has their head in the lap of Rosa, who these days goes by Nishi. “Do you think he’ll ever come around?” they ask. “I miss him still.” And Nishi, who’s running her fingers over the bronzed expanse of Alicia’s shoulder, says, “There’s always hope.”\nApollo/Artemis is just as beautiful in person. They spend most of their time away—war’s still not over, still so much to do—so their sweetness comes in bursts, like ripened boughs in the summer. When the buttery light touches their curls in the morning it outlines them in goldenrod perfection and the world comes to a standstill for as long as it takes them to slide into consciousness. I’m learning to paint—Jasper is teaching me—in hopes that one day I’ll be able to capture the euphoria of these evanescent moments with brush and pigment.\nAs for me, I still don’t know. There’s lots of things I’m still figuring out. I’ve picked a name, but I still let my old warmates call me Stick, from time to time. They’ve earned it. About my pronouns—I’m figuring that out, too. I still don’t know. I’m allowed. Apollo/Artemis says it’s taken them their whole life so far to sort out the names and words they like to use, and if someone as sure of themself as they are is still working it out, then I’ve got time. See, the one thing I’ve learned, and keep learning over and over again, is that there’s no one answer to everything. I’m lurching toward understanding, one day at a time. Same as everybody else.\nJY Neon Yang (they/them) is queer, non-binary, and the author of the Tensorate series of novellas from Tor.Com Publishing (The Black Tides of Heaven, The Red Threads of Fortune, The Descent of Monsters, and The Ascent to Godhood). Their work has been shortlisted for the Hugo, Nebula, World Fantasy and Lambda Literary awards. A Clarion West alum, they graduated from the University of East Anglia with an MA in Creative Writing and currently live in Singapore."}