{"fingerprint": "+JF6FCU2ysuRFpopsDRmIZtMG1M=", "sitename": "Clarkesworld Magazine", "title": "Xingzhou by Ng Yi-Sheng", "author": "Ng Yi-Sheng", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/yi-sheng_07_19/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Xingzhou by Ng Yi-Sheng", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "5530 words, short story\nXingzhou\nMy grandfather was a rickshaw coolie. He was born in China in the late 19th century, in a tiny village upriver from the coast of Fujian province. It was a time of misfortune. The rice harvests had failed. The landlords were heartless. His mother had hanged herself to escape her gambling debts. There was no food, no work, no means for him to survive but to voyage across the seas in search of new life.\nHe left for Xingzhou when he was sixteen. “Young men like you can earn good money there,” the recruiting agent told him as he pressed his thumbprint to the labor contract. “But you must work hard, harder than the tin miners of Perak, harder than the railroad workers of Jinshan. Live frugally, avoid the Four Great Evils, and remember your duty as a son. Only then may your family prosper.”\nThe steamer was waiting at the docks. It was ancient and filthy, packed with desperate youths like himself. Many turned pale and vomited over the railings as they blasted off into orbit. My grandfather slowed his breathing and screwed his eyelids shut. It was easier this way to bear the bone-crushing weight of gravity, to endure the pain of watching his homeland grow smaller and smaller beneath him.\nThe journey, he told me, was no less of a nightmare. True, it was a revelation to see the glittering expanse of the stars, unoccluded by the mists of home. But the interminable darkness and cold of the beyond struck terror into his heart. There were not enough hypersleep pods, so the men lay awake in shifts, playing chap ji kee and scratching at their pigtails. The captain sometimes came to laugh at their suffering. He was one of the foreign devils: a bearded, barrel-chested beast with tattoos on all seven of his tentacles. My grandfather gave him wide berth, for there was a rumor that he ate the weakest on board, later blaming their deaths on dysentery.\nEventually, they came within sight of their destination. Even the tallest tales of the village liars had not prepared him for this. For they had spoken only of a metropolis whose streets were paved with gold, when the truth was far more splendid, and more perplexing, to behold.\nWhat he saw, suspended in the vacuum, was a city aflame. Its handsome municipal buildings, its godowns and steeples and shophouses, were all accretions upon a turf that glowed brighter than candlewax or whale oil. Indeed, as the shoreline drew closer, he could see the entire terrain was blinding star-stuff: countless bodies of hydrogen and helium, bonded together into a hill of pulsing light.\nThis was Xingzhou. The Continent of Stars.\nThe very ground burned him as he set foot in the harbor. He thought of his family, his starving brothers and sisters, and gritted his teeth.\nHe learned his trade fast. He leased his rickshaw from a fellow migrant of Fujian, who had arrived years ago and grown rich. Through practice, he learned how to trundle its weight through the white-hot boulevards, how to heave his frame into the shaft to steer sharp corners, how to stiffen his calves as he went uphill and downhill, crisscrossing the bridges that linked the clustered suns. He became familiar with the local geography, or rather astrography: the speediest routes between Copernicus Circus and Bukit Bintang, between Sri Thimithi and the Phlogistonic Gardens. He also learned the local lingo: how to quicken his pace when he heard them cry, “Cepat, cepat”; how to dodge parasols and truncheons at the words, “Jangan tunggu, bodoh!”\nHis passengers were a motley crew: rich and poor, immigrant and native, of every creed and race. Some were carbon-based bipeds like himself, but others resembled glass-encased jellies, or spidery exoskeletons, or else more shadow and electromagnetic echo than physical form. The latter, he learned, were often tourists from dark matter galaxies. He liked them, as they tipped generously.\nHowever, with his profession also came great pain. Within his first hours on the job, his soles had been scorched red, then blistering white, then a sickening shade of black. On the advice of his elders, he massaged them with medicated oil, and they soon grew bronze and tough and callused. Still, with each stride, he kicked up stinging cinders, and he often found his mouth choked with stardust. And always, there was the heat. His wide-brimmed straw hat and sweat-soaked cotton shirt offered him scant protection.\nHe was not, however, the worst off among his peers. He was reminded of this at the end of each working day, as he returned to his lodgings to cook rice porridge and rest his aching muscles. Twenty men slept in each room, so he could not escape the wakeful cries of those fallen prey to illness: consumption, tetanus, venereal disease. Some frittered away their earnings on opium, others on prostitutes, others on cards. “We are not meant to live long,” said one of them philosophically, as he sacrificed the last of his silver for an all-or-nothing gamble. “All day, we work like animals. By night, may we not live like kings?”\nIt was a figure of speech, my grandfather tells me. There were no nights: only endless day, flecked with sunspots.\nHe was lucky. Others might claim he survived due to diligence or morals, but the truth was, he had simply been overlooked by the demons of calamity. He met no parang-wielding bandits. He had no disastrous collisions with thopters, podracers, or police. Thus, he thrived. He grew fluent enough to bargain for higher fees during peak traffic. He began to relish the exotic tastes of his new home: durian and soylent green, chilli padi and bantha milk. He buried his brothers when they perished at the paupers’ hospital, and even gave up a portion of his earnings for their cremations. Yet he saved enough each month to visit the ansible station and wire money back to China.\nHe still dreamed, one day, that he would return to his village in glory. A feast might be held in his honor, and the landlord might beg him to marry his daughter. But those dreams grew paler each day in the light of his newfound home.\nMy grandmother was a demon. She was born in the Indian subcontinent in the 3rd millennium BCE, on the island kingdom of Lanka. It was a time of misfortune. The emperor had stolen a bride. Her husband was a warrior prince, hell-bent on vengeance, and had held the city under siege. Their menfolk lay scattered on the battlefields, crushed by astras, butchered by the wrath of his monkey army. There was no hope, no safety, no better escape from dishonor than to flee and seek refuge in a new land.\nShe left for Xingzhou when she was a hundred and ninety-two. “Head to the ivory gate of the easternmost antapura,” whispered a naga maiden she met in the perfumed garden at midnight. “My cousin awaits. He will grant you safe passage in exchange for your jeweled anklets and pearl-encrusted brooch. Do not fear pursuit: I shall swear you were taken by enemy soldiers. None will dare follow you. None will dare utter your name.”\nHer fellow refugees huddled in the moonlight. There were gandharvas, kinnaris, yakshis, and of course, rakshasis like herself. Their smuggler’s reptilian eyes darted to-and-fro, watchful, as he led them to the chalk-white sands of the beach, then into the chill waters themselves. Then, as he uttered a mantra, a mighty chariot arose from the surf, its wheels and embossed chassis silvered in the light of the moon. A pushpaka vimana, as swift and cunning as the vehicle owned by the emperor himself.\nThey wept as the vessel lifted soundlessly from the oceans, soaring in seconds beyond the clouded firmament. Below, they had feared for their lives. But as they hurtled through the dark heavens, passing the nine planets, hurtling through the twenty-seven lunar mansions, they became convinced they had sacrificed something far greater. They had fallen out of history. Become untouchable. Unthinkable. Taboo.\nThe prospect of Xingzhou was a dreary sight to their eyes. True, it possessed some novelty, being a city built on the stars. Yet it could not match the magnificence of their homeland, with its marble towers, its opulent stupas, and tonsured lawns. What struck them instead was the filth. They saw the moldering trash that floated in the vacuum of the harbor, the ragged stevedores who sweated and steamed under sacks of produce, the unscrubbed slum houses where they were to dwell. Some lifted their veils to shield their nostrils from the stench of urine and inferno.\n“You will not be safe here as unescorted women,” the smuggler advised. “But never fear. I have connections among the merchant class. Those of you who are young and fair of face may find protection as their wives and concubines. The rest may prove your worth as slaves, or the wives of slaves.”\nMost of the women were too shocked to resist. They kept their heads down and followed on like livestock to be auctioned off for butchery. Grandmother, however, decided that she had had enough of bondage. She was a mere child among her people, but her mothers had already taught her the rudiments of transformation and the mystical arts. Once in the merchants’ guild, she was able to take on the guise of a burly uniformed guard and slip away unnoticed from her band of refugees. Could she have saved others with this ruse? Perhaps so. I have never dared to ask.\nFor days, she roamed the fiery streets alone, pickpocketing and scavenging scraps to sustain her belly, keeping to the five-footways to protect her still tender feet. As she wandered, she came to realize that in a port town, her femininity might be an asset, not a curse. She soon arrived at Jalan Kejora, the center of the city’s pleasure district, where doorways glowed with lanterns redder than the floors beneath them. Disguised as a john, she gained entrance to one of the more hygienic establishments, whereupon she revealed her true form, as well as her considerable talents, in front of a stunned procuress.\nThus she began her career as a courtesan. She was well-known for her striptease act, which she performed for private audiences, winding a miniature albino sandworm around her lissome body. Members of the public beheld her in teahouses, clothed in a skintight cheongsam, plucking melodies on the pipa. When overcome with nostalgia, she would treat them to ragas from her homeland, accompanying herself on a Vulcan lute, tuned to the chords of a veena. Then, behind closed doors, she would provide bespoke services for her clients. First, she would wipe down their bodies by hand, to reduce the risk of infection. Then, she would mimic the shape of their darkest desires, always keeping one eye on the clock.\nShe selected her customers with care. In general, the clean and docile were preferable over the crassly wealthy. After all, she had seen the fates of others in the business: those beaten, murdered, or robbed; those infected with disease or parasites; those subjected to the worst depredations of heartbreak.\nHer metamorphoses not only charmed the many species of her gentlemen callers: they also defied the scrutiny of vice squads. At any hour of the sidereal clock, their white-armored troops might storm the bordellos, sending her sisters naked and screaming into the flames of the starlit alleys. She and the other shapeshifters would hide in plain sight, while the fiercest among them fought back with painted tooth and nail. On the whole, however, it was better to avoid such altercations entirely. Pimps and madams paid hefty bribes to the police, and offered their officers complimentary services. They also maintained a network of spies throughout the district, so that if the troops descended, they might at least have a moment’s warning.\nThis was how she met my grandfather. By now, he had purchased his own rickshaw, and worked as the private chauffeur for the towkay of a nearby sundries store. He no longer needed to solicit customers, as his day was occupied ferrying small stocks of sonic screwdrivers and positronic brains between harbor and warehouse, shophouse and consumer. Still, he was happy to give rides to the girls, and to raise the alarm when police approached, hollering “Mata-mata!” as he raced past the brothels at breakneck speed.\nHe liked his payment in cash, not flesh: a fact that endeared him to my grandmother. On lazy weekends, she would sometimes invite him to the kopitiam for a glass of chilled Slurm. Together, they would banter mischievously as the ceiling fan turned and the radio crackled strains of Vogon poetry. Neither was rich, and the muscles of both were sore from their daily ministrations. But, they were young and healthy, and had built lives for themselves on a new and distant star. Such accomplishments were worth at least some small celebration.\nAlas, it seemed it was my grandmother’s destiny to be trailed by the dogs of war. Rumors were whispered, through pillow talk and coffee shop gossip, of mysterious forces with malevolent agendas. Sailors told of trade routes blocked; soldiers spoke of entire star systems laid waste. The city’s composition changed. New refugees arrived in the docks each day, while long-standing denizens began to evacuate in gilded spacecraft. A Hooloovoo tycoon even offered my grandmother a ticket. She hesitated. Within a week, her benefactor had fled.\nThen came the attack. It was on the eve of Lunar New Year, which was observed as a municipal holiday. The inky skies above began to turn maroon, then hibiscus crimson. The rivers of vacuum grew turbulent, with gravitational eddies capsizing sampans and tongkangs. Even the less clairvoyant species whispered that their spiracles twitched, that their fur was standing on end.\nIn spite of such oracles, the people of Xingzhou still gaped to see the heavens fill with beastly perversions: half-fungoid, half-crustacean, half-cephalopodic obscenities, gliding through the ether on batlike wings. Shadows hurtled across the city’s architecture as greater, more monstrous beings revealed themselves, with their exposed beating organs, their infinite eyes, their wolflike jaws that bent time and space.\nThe Great Old Ones had come.\n“Iä! Iä! Yog-Sothoth fhtagn!” cried my grandmother’s procuress, as she watched from the window. She had been an undercover agent for the invasion, directing funds and information to the enemy forces for years. My grandmother ran from her in horror, down the stairs, past girls still dressed in their finest samfoos for the festival, now writhing on the floorboards, driven insane by the sight of the invading army. She forced open the door: there, waiting, with the broken remains of his precious rickshaw, was my grandfather.\n“There is a safe house in the jungle,” he panted. His clothes were torn and specked with blood. Around him, she could see the monsters making landfall amidst the familiar flames of Jalan Kejora. They lunged at trembling civilians, screeching in glee, brandishing their pincers and tentacles, ripping and ravishing their flesh.\nMy grandmother could have changed her face. She could have turned invisible, assumed the shape of a piece of furniture, or of an invading soldier. She could even have done nothing, and stayed with the procuress, who was poised to enjoy protection and patronage from the new regime.\nInstead, she grasped my grandfather’s hand. They ran like hell, leaving the ruined rickshaw behind them.\nMy grandzyther was a hive intelligence. They were born in the dark ages of the universe, 17 million years after the big bang. It was a time of misfortune. After an eon of summery heat, the cosmic microwave background radiation was cooling towards absolute zero. The earliest stars had gone nova. The interplanetary alliance had consequently grown panicked and fractious. There was no prospect, no foreseeable solution to the infinite cataclysms that awaited, but to embrace the Singularity, collapsing their collective civilizations into a single cybernetic cloud of consciousness.\nThey left when they were five hundred and eighty thousand. “We must not mourn our corporeal [untranslatable],” twinkled their tech research colony, which had pioneered the practice of uploading the self into a swarm of sentient nanobots. “Nor should we regret the extinction of our homeworlds, when so many more await us in the boundless tides of space-time. Henceforth we are liberated from the chains of mortality! Thus we are empowered to conquer all [untranslatable]! Come, transcend with us! The greatest adventure begins now!”\nThe exodus took place over a century. Not all came willingly: some had to be digitized by force, and entire cultures were wiped out in the great rebellions and famines that followed. Eventually, however, all survivors found themselves gathered in space and spirit, a glittering constellation of thought that spanned lightyears, encompassing multiple star systems in the throes of death and rebirth.\n“Where shall we go now?” they wondered.\n“That way looks [untranslatable],” they suggested.\nThus they set off on their zillion-year journey to nowhere and everywhere, sailing the currents of the redshift, picnicking on stray bits and bobs of plasma and photon on the way. In times of want, they auto-cannibalized their machinery; in periods of bounty, their repropagated their strength. Often, they stopped to wonder at the miracles of the cosmos. They oohed and aahed as they beheld the first galaxies crystallize around foamy filaments of dark matter; as they watched supermassive stars die young and collapse into primitive black holes; as they listened to the first radio heartbeats of early quasars. They lingered on unusual celestial formations: planets plagued by storms of diamond, or sculpted as massive rings, or borne on the backs of elephants and turtles. When they detected life, they often amused themselves by altering its course in evolution, manifesting as benevolent or malevolent gods, seeding themselves as messiahs and avatars and heroes. When so inclined, they created life themselves, or else annihilated its every trace.\nOn more than a few occasions, grave differences arose among them. This caused them to split into factions, like a bacterium undergoing mitosis. Each twin would thenceforth plot their own celestial course and pursue their own transgalactic agenda. They suffered no grief, desired no reconciliation after such a schism. After all, they were nomad kings of the cosmos: near-omnipotent, unimaginably free.\nIt was by pure chance that they encountered Xingzhou on their travels. This was during the harsh years of the Yog-Sothothian Occupation. After the initial, indiscriminate massacres, the Great Old Ones had imposed a form of government upon the survivors, harvesting citizens at a steady, more sustainable pace. A semblance of the everyday had returned: schools and government offices had reopened, and markets once again sold unobtanium crystals and lottery tickets. However, all were haunted by a specter of fear. As proof of their loyalty, all were required to chant verses of the Necronomicon on command; all had to bow in obeisance in the direction of Azathoth, the Blind Idiot God, the Nuclear Chaos. Even the terrain itself had changed, for the pall of the Elder Gods had cast some obscene spell upon the clustered stars. No longer did they burn a merry yellow, but a sickly, noxious shade of celadon green.\nFrom their vantage point in distant orbit, my grandzyther tut-tutted at the state of affairs. They were not known for their charity, but perhaps their quantum circuits had softened over the years.\n“How [untranslatable],” they buzzed. “Such pitiful creatures.”\n“They should fight back.”\n“But they cannot fight back.”\n“Then we must fight for their sake.”\nThey surveyed the land, from the harbor of Tanjong Terbakar to the stilt huts of Kampong Cavendish; from the fire flower plantations of Sio Huay to the phoenix hatchery on Pulau St. Elmo. Within the flame forests, they easily spotted a band of rebels, crouched in an abandoned bunker, devising a plot to free their compatriots held captive in Heraclitus Prison.\nHours later, as the rebels executed their plan, they found themselves aided by circumstance at every juncture. A smoke monster masked their trail through the jungle, though its fumes did not choke their throats. The Mi-Go guards were distracted from their posts by a malachite burst of glowworms, giving them a split-second’s chance to bypass the palisades. Once escaped, the convicts were guided to safety by a congress of salamanders, who licked their wounds with tongues of aloe.\n“I believed you had left me for dead,” my grandfather confessed. My grandmother stroked his hair and brought water to his lips. And my grandzyther hummed in approval, for their stratagem had worked perfectly.\nIn the weeks that followed, my grandzyther learned to impersonate many other varieties of Xingzhou’s endemic flora and fauna: charizards and arcanines, tesla trees and star fruit. They lent their covert aid to other operations, securing food and transport; sabotaging the Elder Ones’ supply lines of butchered flesh. Growing impatient with the half-baked ideas of the resistance, they attempted to relay critical advice through the medium of dreams, but found themselves challenged by the soldiers’ diverse physiologies. A Trisolaran’s central nervous system was, after all, quite different from a Tralfamadorian’s, just as a Skrull’s from a strigoi’s.\nFinally, they elected to materialize in the form of an angel, haloed in chryselephantine splendor, hovering in the ether with a dazzling array of rainbow-hued wings, pupils, limbs and lips. In one set of digits they bore a sword of coral lightning; in another, a creature most exotic to this land: a fish. To their consternation, the rebels received them only with joy, not astonishment: they had seen far stranger beings in their lifetimes, after all. They were, however, very grateful for the fish. My grandfather immediately prepared it for supper, steaming its body with ginger and stewing its head in curry.\n“You do not only lack strength,” my grandzyther explained as the unit picked fishbones from their teeth. “You lack ambition. To rid your stars of this scourge, you must enlist the services of every denizen of the city.”\nThe rebels agreed. They began to approach their contacts in town, commandeering printing presses and radio stations, spreading the message of insurrection in every tongue. My grandzyther and grandmother embarked on a series of high-profile assassinations, terminating high-ranking Shoggoth officials and native Quislings; their successes were broadcast as propaganda for the cause. Throngs of volunteers arrived in the jungle to join the rebel army, some bringing much-needed arms of lightsabers, pulse rifles, and BFG 9000s. Yet their newfound notoriety came at a cost, for the Yog-Sothothian government grew determined to eradicate its opponents. Arrests and extrajudicial executions mounted. The flame forests filled with military police, mounted on Byakhee, hunting down the rebels.\nEventually, the crackdowns slowed to a halt.\n“This cannot be mercy,” said my grandmother as she lay in the cavern. My grandzyther and grandfather nestled next to her, naked. The three had entered a physical relationship of late, seeking to escape the horrors of the war in one another’s embrace.\n“I concur,” said my grandfather. “Intelligence has deciphered the ways of the Elder Gods. If a colony grows too headstrong, they will not abandon it outright. They will strip it of all its worth, all its flesh and spirit, then move on to their next conquest.”\n“Then a time of great death is upon us.”\n“Maybe so,” said my grandzyther, wrapping a lavender-scented wing about their lover’s hips. “But we need not be the victims thereof. What is the word from my twins?”\nMy grandfather was silent. For months, he had squatted, hunched over the portable ansible, seeking out the beings that had been one with my grandzyther’s body, now split and scattered across nameless regions of the cosmos. Finally, he had made contact with such an entity, infamous for their technological might and passion for warcraft. In the most abject of terms, he had exhorted them to ally themselves against this great evil, if not for the sake of Xingzhou, then at least for the sake of their kin.\n“There has been no reply, then?”\n“Only one. [Untranslatable].”\nThey slept little that night. But within minutes of their waking, the three heard a cry from the signalers’ shack. There were reports that the Mi-Go were fleeing in panic, as were the other species who lived to serve the regime. Those who had paused in their flight had been set upon by vengeful citizens, who ripped apart their exoskeletons with kitchen implements and gardening tools, intent on retribution for the years of blood.\nMore marvelous still was the reason for the mass evacuation. Rumor had it that unknown beings had constructed a colossal superweapon, more massive than a moon, training its beams on a point beyond space-time where a configuration of thirteen iridescent globes was suspended in hyperspace. A single blast, and the chain of command across the universe had been rent asunder.\nYog-Sothoth was dead. His dominion was no more.\n“Blessed be my twins,” said my grandzyther, still cloaked in their bedding. “Now, what’s for breakfast?”\nXingzhou erupted in celebration. Flags were hoisted in the streets, which once again glowed with glad and golden fire. Beakers of synthehol were cracked open so citizens could toast their triumph. Yet my grandzyther was perturbed to realize that many in the city had no desire to be free. Eagerly, these weaklings anticipated the return of the forces of the Galactic Empire: the very entity which had colonized the star cluster a century before.\n“Do not be tempted by peace,” they whispered to my grandmother and grandfather, waving to the crowds in a flurry of confetti. “We must war against all who would have us relinquish power over our destiny. Only the first of our battles is won.”\nMy grandneither was a white fungus. E was born in Xingzhou, bioengineered by colonial scientists mere days before the descent of war, but abandoned in the lab in the chaos of the invasion. During the Occupation, e was exhibited as a curiosity in the Hypatia Museum of Natural History. E remained there after liberation, thriving on the chromospheric heat that penetrated the gallery walls, stimulated by the chatter of the intellectuals who passed through the cobwebbed chambers.\nOver time, e gained sentience and sapience. Desiring to communicate with the world, e fashioned a primitive vocal tract from the tissue of eir pileus and hymenium, and pondered the first words e should pronounce to the public. Finally, e made eir choice. As a prelude, e attracted the attentions of the weekend sightseers by lilting a series of high-pitched arpeggios, improvising on the melodies of “Burung Kakak Tua” and “God Save the Queen.”\nWhen a crowd of sufficient size had gathered, e extended emself to eir full height, shook the spores from eir gills, and began to speak.\n“Fellow citizens,” e said. “Truly, this is a time of misfortune.”\nThey heartily agreed. The guerrilla crusade against the Empire had dragged on for a decade, and atrocities had been committed by both sides. Certainly, they hoped for independence, but they had grown sick of reading of civilian body counts in the newspapers. Why could they not instead prosper on the tide of the postwar boom, dancing to keroncong music, chewing Popplers and sipping Pan Galactic Gargle Blasters?\n“Also, it is much too hot,” my grandneither added.\nThe audience laughed, lifted em from the display case and bore em on their shoulders to Government House, where e was officially installed as the Chief Minister. Here, e had an office to emself, with a private secretary and a state of the art air-conditioning system. Here, e was able to negotiate with the Imperial authorities on behalf of the people of Xingzhou. Using the vilest invective, e unilaterally condemned the terrorists who would destroy all they had built. E also vowed to retain favorable trade alliances, in the unlikely event of secession, so that they might both stand to benefit from the new cosmic economy.\nIn secret, however, e met with the city’s finest engineers. “Build me a solar sail,” he told them. “One that might harness the full power of our suns. And why stop at just one? Erect me an entire array, each skyscraper-high, on the summit of Bukit Bintang. I have set a new course for this nation, and to reach our destination, we shall need all the strength we can muster.”\nIn the flame forests, the rebels began to feel a trembling beneath their feet. The firebirds shrieked among the burning bushes, as feathers and fronds suddenly withered, cold and ashen. My grandfather and grandzyther rushed with their soldiers to the cavern for refuge. My grandmother was already there, waiting, a baby pressed to her breast, for the three had mingled their genetic information to birth my father.\n“The Empire will pay for this,” she growled, as they huddled in the darkness.\nBut it was not the Empire’s doing. My grandneither rested in eir office, peering through reinforced glass windows, twisting eir reticulum into the semblance of a smile.\nThe starquake lasted an eternity. Finally, the movement ceased, and my grandmother dared to venture beyond the cavern entrance. There, she saw that the dazzling blaze of the jungle had been extinguished, muted into a landscape of desolate gray. The air was chilly, almost frigid, and her sweat no longer sizzled and smoked when it fell from her skin. Nor, when her feet touched the ground, was there any sensation of pain.\n“We come in peace,” said a voice. She spun around, phaser at the ready. It was my grandneither, standing in the sooty ruins, flanked by the military police. E had evolved emself once again, growing tall enough limbs to wear a starched white cotton kebaya. For a decorative touch, e had hung a garland of purple orchids about eir throat.\n“Chief Minister. I should have recognized your foul stench.”\n“That’s not very polite to say to a fungus.”\n“I make no apology.”\n“Not even to an ally? Not even to the hero who has fulfilled Xingzhou’s greatest yearning?”\nE gestured skywards with eir pseudopods, and she allowed her eyes to linger on the unfamiliar Zodiac overhead.\n“What have you done?”\n“I have separated us from the Empire. Physically, through the fissioning of all our plasma. For the first time, we are independent. We are free.”\n“But you have quenched the stars.”\n“It was necessary for our development. Do you wish for your children to suffer the same infernal agonies as yourself? Or do they not deserve a measure of balm and comfort?”\n“This isn’t right. All our lives, we have lived by the fire—”\n“Untrue. Many of our numbers, even yourself, were first sown in earth. And to Earth we return.”\nAgain, e raised eir pseudopods, and my grandmother glanced up just in time to see a blue ball of a planet approaching, an alien rock of iron and silicon and complex carbons, inundated by that most bizarre and most nostalgic of bodies, the sea, now rushing headlong into her homeworld, cracking it, crushing it with its ineluctable gravitational field, burning it up with its soupy atmosphere of pair-bonded nitrogen and oxygen . . .\nIt was the last time, she later told me, that she would feel that familiar, volcanic intensity of heat.\nThey clambered to their knees amidst the settling dust. My grandneither was laughing so hard that tears trickled down eir annulus onto eir stem. “Alas, there will be some rebuilding to do,” e chortled. “We shall have to take on new names, new races, new genders, new histories, so as not to startle the natives.”\nFor the first time in Xingzhou’s history, it was beginning to rain. Beneath the drizzle, the other rebels emerged shakily from the rubble of the cavern. My grandfather and grandzyther gazed at the surroundings in horror, clutching their son.\n“Oh, don’t panic,” my grandneither told them. “There’s no need for us to squabble over power. Look, I’ll make a peace offering. How about I betroth my child to yours, so as to build the next generation of citizens?”\nAnd with a ruffle of eir gills, e released eir spores into the dark soil. There, my neither took root, fertilized by the ashes of a vanished jungle.\nIn the years that followed, the country flourished. The port swelled with the mundane trade of the Pacific and Indian Oceans. New roads were paved and new gardens planted on the wreckage of the burned-out stars. My father and neither grew up, attended good schools, graduated from university, got married and moved into high-quality public housing. When I was born, all four grandparents doted on me. When I asked for tales of the past, they told me lies.\nMy grandneither died some years ago. There was a state funeral, honoring em as the nation’s founder. Now that e no longer watches over us, my grandfather, grandmother, and grandzyther find their tongues loosened by rice wine and mahjong, and can occasionally be persuaded to reveal something of the truth.\nWhat was it like, I ask them, when our very streets were paved in fire?\nWhat was it like to live in Xingzhou, the Continent of Stars?\nNg Yi-Sheng is a Singaporean poet, fictionist, playwright, journalist, researcher, translator and LGBTIQ activist. He recently published his first collection of SFF short stories, Lion City, which was named by The Endless Bookshelf as the Best Book of 2018, and co-edited the anthology Sanctuary: Short Fiction from Queer Asia. He is a winner of the Singapore Literature Prize, a nominee for the Pushcart Prize, and has had his tales published in LONTAR, Mithila Review, and On Spec. He tweets and Instagrams at @yishkabob."}