{"fingerprint": "yvsGNaK6j0GVU7FqQc9DPV4aSYM=", "sitename": "Clarkesworld Magazine", "title": "The No-One Girl and the Flower of the Farther Shore by E. Lily Yu", "author": "E Lily Yu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/yu_03_18/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The No-One Girl and the Flower of the Farther Shore by E. Lily Yu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "2860 words, short story\nThe No-One Girl and the Flower of the Farther Shore\nOnce there grew, in the dust and mud of a village in China, a girl who had only her grandmother to love, and then her grandmother died and was buried and she had no one at all. With no money to patch up the walls and lay new tiles on the roof, the small, smoky home that the two of them had shared slumped around her in the rain, and the little garden ran to nettle and thorn.\nIn the months that followed, the girl crept and gnawed and spat and caught small birds with her hands, like an animal. The garden gave her wild gourds and bitter greens to eat. The woods gave her kindling and dry cowpats where cows had been tethered to graze. Sometimes her neighbors brought her scraps, for pity.\nSometimes they shied stones at her.\nExcept when she visited her grandmother’s grave, the no-one girl rarely spoke. She cast her eyes low and bit her lip, and the villagers shrugged and said, well, that was the way of wild things. But anyone who saw her squatting beside the grave, knobbly elbows over knobbly knees, mumbling and rambling, would have thought her mad.\nThere she told her grandmother the changing of the seasons, and the birds she caught and the colors of their feathers, and the weather, and her wishes, small and large, as she had done when her grandmother was alive.\nFor many years now, at the mid-autumn festival, the village official offered a silver pin in the shape of an acorn and a gold brooch molded into a willow leaf as a prize for the most beautiful thing made in the village that year. Each year, the villagers presented embroidered cardboard and painted tin and silk cords knotted into dragons, and one man or woman, glowing with pride, bore the pin and willow leaf home. The no-one girl had seen these prizes from afar, on the breast of the tailor, or the carpenter, or the firework-maker, and thought them very rich and fine.\n“If I won them,” she said to her grandmother’s grave, as the wind carried to her the music and laughter of the festival, “I would touch them and taste them and eat their loveliness with my eyes. I would wear them for an hour to feel the weight of gold and silver, and then I would sell the gold brooch for enough flour for a year, then the silver pin for salt and vinegar and spices. But when I bring the little purple wildflowers without names, and the brown mushrooms from the wood, they laugh at me.”\nHer grandmother’s grave, mounded high and sparkling with tinsel, kept its own counsel, but the grass that grew thinly on it seemed to sway in sympathy.\nThat night, after the revelers were all asleep, the first rain of autumn scoured the village. Rain sang on roofs and fences and pattered through trees. The no-one girl shivered and dreamed of a white bird that circled her head, dropped a seed, and flew away into the dark.\nWhen she awoke, she went to her grandmother’s grave. From the mound sprang a single red flower like a firework, a flower the girl had never seen before, yet recognized, for late at night her grandmother had combed the girl’s long black hair and told her about the flower of the farther shore, which only grows where there has been death, and leads the dead wherever they must go. It had bloomed in the village where her grandmother had been born, a long way away, and there had been a deep sadness in her grandmother’s voice as she described it, working the comb through the knots in the girl’s hair.\nNow the flower of the farther shore had come to her. The girl clapped her hands at the exquisite beauty of it. She dug down to the bulb with her fingers and planted it in the garden among the wild gourds.\nAll that autumn and winter she tended the flower. After the petals faded and fell, slender leaves speared up, glowing with life and green throughout the cold winter. She fed the flower her secrets, burying them one by one, and watered it with drops of her blood, red as the flower had been, because there was no death in the garden, and the flower, her grandmother had said, needed death to live.\n“Grow, grandmother’s flower,” she whispered to it at night. “Bloom, flower of the farther shore.”\nLeaves and then snow covered the path to her grandmother’s grave, for the girl had ceased her visits, certain, as if it had been whispered to her, that her grandmother was gone. All her words and care were for her flower, whose leaves seemed to bend toward her, listening.\nSpring came, and the earth thawed. While everything else budded and sprouted and broke open, shouting life, the leaves of the strange plant browned and crumbled. But the girl continued to tend the bare patch, which she ringed with stones, as lovingly as one might a child.\nThese were easier days, after the winter’s illnesses and privations. Bark ran soft with sap, and weeds were still tender and sweet. Though the girl was never not hungry, she was not starved.\nNow and then the villagers looked over her wall or shouted through the gate to see if she was still alive, partly for kindness and partly because her land and home would be reassigned if she died. When they spied her chattering at her patch of earth, they stopped and stared.\n“Eh, what’s that?”\n“What are you growing there, girl?”\n“A flower of the farther shore,” she replied. They laughed and rattled sticks against the gate. One or two tossed stones at her, but only halfheartedly, so they pattered down among the wild gourds instead of stinging her arms.\nSummer meant fat pigeons, and the tiny, tender muscles of leaping mice caught when she poured creek water down their holes, and the odd spray of wildflowers, yellow and pink and white, dotting the muddy banks of the ditch. Summers she roamed far and free, up hills and down fields, idly pulling an ear of wheat or barley and chewing the sweet green kernels inside. Hawks hovered, dove, and killed. Cows swung their sleepy heads sideways at her and pissed pale yellow streams.\nEvery night she returned to the bare ring of stones, told it what she’d seen, and pricked her arm until it bled. The red drops ran in a fine line down her wrist and dripped from her fingertips to the thirsting earth. She was careful not to waste a drop.\nAt the equinox, or so said the flimsy almanac nailed to the door, the flower of the farther shore arose like a ghost in the night. It spread its curling red crown to greet the no-one girl when she unlatched the door and stepped outside. The girl gathered its petals together in her hands to smell their fragile fragrance, stroked its long green stalk, kissed its stamens until her mouth was gold with pollen, and spent the whole day sitting beside her flower, crowing and marveling.\nThose who looked over the wall made various noises of astonishment.\n“What a beautiful flower!”\n“Ah, what a sweet smell!”\n“How odd that someone like you should have grown such a thing.”\nThey drank its colors with their eyes and its odors with their noses, just as the no-name girl did, and she did not begrudge them one bit.\nThe butcher’s son came too, and looked long.\n“Aren’t you my treasure?” the girl said, paying him no mind. “Oh, but I will surely win the gold brooch and silver pin this year because of you.”\nAnd the butcher’s son said nothing but went quietly away.\nIn the night, the girl turned in her sleep, as though a soft thump and rustle reached her ears. She twitched and flung a hand out, as if somewhere in the garden, metal clinked against stone.\nMorning came, the morning of the festival, and the flower was gone.\n“Stolen!” the girl cried. “Stolen, oh stolen!” She sifted the loose dirt in the hole where the flower had grown, but there was nothing, not a fragment of root, not a crumb of hope.\nShe beat the ground with her fists, then pulled her hair with her dirty fingers, but there was no help for it. The flower had been stolen, the pin and brooch would be given to another, and there was nothing she could do.\nAching for justice, and rubbing her eyes with her knuckles, she hurried to the street of shops, where on an ordinary day beaded strings clacked in doorways and baskets of fish were sold from bicycles. Today, colored lanterns bobbed over low tables tied with ribbons. Throughout the day, people brought their beautiful things here, to be guarded by the village official when he was not deep in his cups, and by his more watchful wife when he was.\nThe no-one girl would have pulled his sleeve and cried for help, except that the butcher’s son was just at that moment presenting his entry: a flower in a pickle jar. It was her flower, the no-one girl saw, her stolen flower of the farther shore, but the petals had been painted white and gold, and cut raggedly, and the stamens trimmed short. To her eyes that had known its crimson wholeness, it was ugly as a wound.\nWhen the butcher’s son saw her, he turned red and glanced away.\n“What’s this?” the official said, tapping the end of his pen against the jar. “I’ve never seen its like.”\n“A flower I grew in the yard, where the soil is wet from the animals we slaughter. I sent off for the seed in the mail.”\n“It may be an unusual species, but these are common enough colors,” the official said. “And—faugh—it stinks like cheap perfume. Well, set it among the rest, and we’ll see.” Then he turned to the girl with a smile as big as sunflowers and said, “Now, what did you bring us this year? A pretty stone? A snail?”\nThe truth filled her mouth with bitterness, almost choking her, and her blood ran hot and cold. But she looked into the official’s wine-red face, and at the butcher’s son in his clean blue shirt, smelling of cooked meat, and knew she would not be believed, no, not the wild girl with no one, who talked and laughed to herself. The villagers who passed by had seen a red flower with a curling crown, not this gold-and-white pretender. Moreover, as she knew, there was often a ready stone in their hands.\n“Nothing?” the official said. She shook her head, teeth clamped together. “Well, get along with you, then. Go and enjoy the festival.”\nThe girl turned and ran, blind with her loss, blundering through the smoke of firecrackers and knots of people eating white moon cakes. The men and women she knocked against opened their mouths to scold, but seeing who it was, laughed and shook their heads.\nOnce she was home, the gate banged open and closed, the door unlocked and flung shut, did she allow the poor truth to leave her lips.\n“Ah, why did he have to mutilate my flower?” she cried. “If only he had simply stolen it and called it his! For it to become a painted lie! For its scent to be drowned in his mother’s perfume! Oh, I wish I had eaten the thing!”\nShe curled up and sobbed until her nose went numb. For it was not the loss of the flower alone that wounded her, but the sudden revelation that the world and its pins and brooches had been made for such as the butcher’s boy and not for one like herself.\nA cold rain fell that night. It fell on the revelers whose faces turned orange and blue in the light of the paper lanterns, who whooped and ran or staggered home through the rain; fell on the fan-maker as she was accepting the silver acorn and willow-leaf brooch, who quickly tucked her prize fan into her jacket; fell on the butcher’s son carrying his flower home, who turned his face upward to catch raindrops on his tongue; and it fell on the muddy girl sitting in her yard, staring at the hole where the flower had been.\nThe rain fell and fell, and the garden slicked to mud. Raindrops boiled on the girl’s shoulders. Rain streamed down the tangles of her hair.\nThen—as if the world had heard the unspoken wish on her tongue, the one wish she had not told her grandmother or fed to the flower, for only now did it put out its leaves—the girl began to disappear.\nShe grew transparent, like sugar, then smaller, ever smaller and smoother, melting and running into the wet earth with the rain.\nThe last sound she made, before her lips blurred, was a sigh.\nAs she sank, she expanded. What had been the no-one girl mixed with volcanic ash and ant eggs and ancient bones, leafmold and roots both thick as a man’s waist and fine as hair. She sank until she touched the enormous basalt pillars buried deep beneath the soil, forgetful of the fire that made them, and deeper still.\nAnd she understood, as she opened, as she poured forth and flowed, that though the no-one girl had appeared to eat and mumble and live alone, in truth she was part of everything, the over and the under, briefly divided from it, as a seed falls from a seedhead, but now returned. Her bones were basalt, her teeth trees, her belly full of mineral riches. She looked out from every leaf and every stone. There was her poor painted flower in the butcher’s yard, cast aside to wither; but it did not matter now. She had ten thousand flowers in her, tens of thousands, and the wind for her hair.\nThe villagers searched for the no-one girl, when they noticed the silence in her yard, but not for long. She was wild, after all, and everyone knew that wild things lived and died in their own way, or climbed into truck beds and rode to the city to vanish, and it was no use holding them. At any rate, they had their own concerns, their own sick parents and delinquent children and debts run up by liquor and gambling, and when winter came ravening, its breath all knives, they went home to their houses to grapple with their private disasters.\nOne morning in spring, as icicles wept themselves to nothingness, the butcher’s son stopped by the empty house, frowning. He scaled the stone wall, at some cost to his trousers; tried the warped door, which stuttered open; and rapped his knuckles against the sagging beams, listening for rot.\nBy the time summer softened the village, the old garden, cleared of rocks and nettles, put forth long pale melon vines and sweet swellings, yellow and green.\nSoon the ripe melons were picked and split and eaten. Then it was autumn. The first cold rain covered the village. In its wake, red flowers sprang up, sudden and strange: flowers as brilliant as firecrackers, slender-stalked and leafless, growing so densely that when the wind murmured in them they moved like a sea.\nThe butcher’s son picked armfuls of them, as many as he could carry, and went to the fan-maker’s home, flushing as bright as the flowers that he thrust forward when she came to the gate. Children bent to breathe their sweetness, then plucked them to play at wands, or taunt the goats until they ate them. But it did not matter how many they gathered; always, there were more.\nAll around, above, below, the everything girl laughed with spotless joy.\nAutumn after autumn the flowers filled the village, spilling outward for miles, until it was known to all as the village of the farther shore, and the old name drifted down into the uncertain recollections of the village elders, along with the story of the no-one girl.\nOnce the butcher’s son and the fan-maker were married, they moved into the empty house and yard that the butcher’s son had, over long months, cleaned and repaired. For their wedding he gave her a necklace and earrings of gold, heavy and soft.\nThe two of them lived happily and unhappily, as people are wont to do, falling out of love and into irritation and then back into fondness; having children, beating them, and scraping together the fees for school; growing old and blind and fretful, and moving about the yard with canes.\nAfter they both died, their eldest child came home from the city to sort through their belongings, putting aside what could be sold, what might be wanted, and what was worthless. As she folded clothes and untied boxes, stirring up decades of dust, she tossed onto the midden, as things unworthy of keeping, an acorn snapped off its pin, the silver paint flaking, and a willow-leaf brooch with gilt peeling from the brass.\nE. Lily Yu received the John W. Campbell Award for Best New Writer in 2012 and the Gar LaSalle Storyteller Award in 2017. Her stories have appeared in venues from McSweeney's to F&SF, including seven best-of-the-year anthologies, and been finalists for the Hugo, Nebula, Locus, Sturgeon, and World Fantasy Awards. Recent work appears in Hazlitt and Tor.com."}