{"fingerprint": "PPH0oyBxMPOzeeqoYVw+cSM4gYw=", "sitename": "Clarkesworld Magazine", "title": "Ether by Zhang Ran, translated by Carmen Yiling Yan and Ken Liu", "author": "Zhang Ran; Carmen Yiling Yan; Ken Liu", "date": "2022-01-01", "source": "https://clarkesworldmagazine.com/zhang_01_15/", "hostname": "clarkesworldmagazine.com", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Ether by Zhang Ran, translated by Carmen Yiling Yan and Ken Liu", "categories": null, "tags": null, "id": 0, "license": null, "comments": null, "source-hostname": "Clarkesworld Magazine", "text": "14650 words, novelette\nEther\n1.\nAll of a sudden, I’m thinking about an evening from the winter when I was twenty-two.\nA pair of pretty twin sisters sat to my right, chattering away; at my left sat a fat boy clutching a soft drink that he kept refilling. My plate contained cold chicken, cheese, and cole slaw. I don’t remember how they tasted, only that I’d reached for the macaroni and dropped some on my brand-new pinstripe trousers. I spent the entire second half of the meal wiping at the crescent-shaped stains on my trousers as the chicken cooled in my plate, untouched. To hide my predicament, I tried to strike up a conversation with the twins, but they didn’t seem very interested in college life, and I wasn’t knowledgeable about ponytail-tying techniques.\nThe dinner seemed to last forever. There was one toast after another, and I would raise my long-stemmed glass with whomever was standing, and drink my apple juice, perfectly aware that no one was paying attention to what I did. What was the banquet for, anyway? A wedding, a holiday, a bumper crop? I don’t recall.\nI sneaked peeks at my father, four tables away. He was busy chatting and drinking and telling dirty jokes with his friends, all his age, with the same thick whiskers and noses red from too much alcohol. He didn’t glance at me until the banquet was over. The fiddler tiredly packed his instrument, the hostess began to collect the dirty dishes and glasses, and my inebriated father finally noticed my presence. He staggered over, his bulky body swaying with every step. “You still here?” he slurred. “Tell your ma to give you a ride.”\n“No, I’m leaving on my own.” I stood, staring at the ground. I scrubbed at the stain on my trousers until my fingers were numb.\n“Whatever you want. Did you have a good time talking with your little friends?” He looked around for them.\nI said nothing but clenched my fists, feeling the blood rush to my head. They weren’t my friends. They were just kids, eleven or twelve years old, and I was about to graduate from college. In the city, I had my friends and my accomplishments. No one treated me like a little boy there, seating me at the children’s table, pouring apple juice into my long-stemmed glass in the place of white wine. When I walked into restaurants, a server would promptly take my jacket and call me mister; if I dropped macaroni on my trousers, my dining companion would wet a napkin and gently wipe it clean. I was an adult, and I wanted people to talk to me like one, not treat me like a grade schooler at some village banquet.\n“Fuck off!” I said at last, and walked off without looking back.\nI was twenty-two that year.\nI open my eyes with effort. The sky is completely dark now, and the neon lights of the strip club across the street fill the room with gauzy colors. The computer screen flashes. I rub my temples and slowly sit up on the sofa. I down the half glass of bourbon resting on the coffee table. How many times have I fallen asleep on the sofa this week? I ought to go online and look it up: what does holing up at home in front of a computer and falling into dreams of bygone youth mean for the health of a forty-five-year-old single man? But the headache tells me I don’t need a search engine to know the answer. This aimless way of life is murder on my brain cells.\n<Hey, you there?> Roy’s words appear on the LCD screen.\n<I’m here.> I find half a cigar in the ashtray, flick off the ash, and light it.\n<You heard? They opened a discussion group on how to tell the difference between bluefin and southern bluefin tuna sashimi by sight,> Roy says.\n<Did you join?> I exhale a mouthful of grassy smoke from my Swiss-manufactured cigar.\n<Nah. It looked even more boring than the last discussion group. You know, the “Long-Term Observation of the Probability Distribution of Heads vs Tails in Coin Flips” group.> Roy adds an emoticon: a helpless shrug.\n<But you joined that one.>\n<Yeah. I flipped a coin twenty times every day for fifteen days and reported my results to the group.>\n<And then?>\n<Turned out we got closer and closer to 50%.> Roy sends me a pained smiley.\n<You knew that would happen from the start,> I say.\n<Of course. But it’s so boring online that you have to find something or other to do,> Roy says. <Want to join the “Visually Differentiating Bluefin and Southern Bluefin Tuna Sashimi” group?>\n<I’ll skip it. I’d rather read a book.> The cigar has burned to a stub. I pick up the whiskey glass and spit out foul-tasting saliva.\n<Books, magazines, movies, TV . . . they all drive me crazy. The sheer dullness of everything will be the death of me.> Roy taps out a sticker—a big period—and disconnects.\nI close the chat window and sign into a few literary and social network sites, hoping for something interesting to read. But just as my online friend said, everything seems to grow duller by the day. When I was young, the Internet was full of opinion, thought, and passion. Exuberant youths filled the virtual world with furious Socratic debate, while the brilliant but misanthropic waxed lyrical about their dreams of a new social order. I could sit unmoving in front of a computer screen until dawn as hyperlinks took my soul on whirlwind journeys. Now, I sift through front pages and notifications and never find a single topic worth clicking on.\nThe feeling is at once sickening and familiar.\nOn a social media site I frequent, I click the top news article, “Citizens gather at city hall to protest hobbyist fishermen’s inhumane treatment of earthworms.” A video window pops out: a gaggle of young people in garish shirts, beers in their left hands and crooked signs in their right, standing in the city square. The signs read “Say NO To Earthworm Abuse,” “Your Bait Is My Neighbor,” “Earthworms Feel Pain Just Like Your Dog.”\nDid they have nothing else to do? If they really wanted to march and protest, couldn’t they have found an issue actually worth fighting for? My headache is returning in force, so I turn off the monitor. I flop onto the worn brown couch and tiredly shut my eyes.\n2.\nIn the scheme of an enormous aggregation of resources like this city, a low-income, forty-five-year-old bachelor is utterly insignificant. I work three days a week, four hours a day, and my main duty is to read welfare petitions that meet basic requirements and pick the ones I empathize with most. In an age where computers have squeezed people out of most employment opportunities, using my “emotional intuition” to approve or reject government welfare requests is practically the perfect job, no training or background knowledge required. The Department of Social Welfare thought some measure of empathy was needed beyond the rigid rules and regulations to select the few lucky welfare recipients (from petitions that had already passed the automated preliminary checks, of course), and therefore invited individuals from all strata of society—including failures like me—to participate in the process. On Monday, Wednesday, and Friday mornings, I take the subway from my rented apartment to the little office I share with three coworkers in the Social Welfare Building. I sit in front of the computer and stamp my e-seal on petitions I take a liking to. The quota varies day to day, but my work typically ends after thirty stamps. I use the remainder of the time to chat, drink coffee, and eat bagels until the end-of-shift bell rings.\nToday’s a Monday like any other. I finish my four hours of work and swipe my card to leave. I walk toward the subway station, not far away, the gray granite edifice of the Social Welfare Building behind me. The performer is there at the subway entrance as usual, a one-man band whose repertoire consists of ear-splitting trumpeting accompanied by a monotonous drumbeat. As always, he glares at me balefully as I approach, perhaps because I haven’t given him a cent these few years. It makes me uncomfortable. The trumpet begins, the sound of a cat scratching at a glass pane. My lingering headache from yesterday begins to stir. I decide to turn away and catch the subway one station up.\nThe ground is still wet from the drizzle earlier this morning. Ponytailed youths whiz by me on skateboards. Two pigeons perch on a coffee shop sign, cooing. The storefront windows reflect me: a thin, balding middle-aged man in a yellow windbreaker that used to be fashionable, with a brandy nose just like my father’s. I rub my nose and can’t help but think of the father I haven’t seen in so long. More precisely, I haven’t seen him since the banquet when I was twenty-two. My mother sometimes mentions him in her calls: I know that he still lives at the farm, that he’s raising cows, that he’s kept a few apple trees to brew hard cider, even though alcohol had destroyed his liver, and the doctors say that he’ll never drink again till science can cure his liver cancer.\nTo be honest, I don’t feel a bit of sorrow for him. Although my red nose and big-framed body are all inherited from him, I’ve spent my adult years trying to escape his shadow, trying to prevent myself from turning into a fat, selfish, bigoted old drunkard like him. Today, however, I find that the only thing I’ve successfully avoided is the fat. The greatest achievement of his life was marrying my mother. I don’t even have anything close to that.\n“Stop right there!” A shout cuts short my self-pity. Several figures in black hoodies are sprinting my way, dodging and weaving through traffic. Two cops waving police batons stumble past braking cars in hot pursuit. One blows his whistle; the other is shouting.\nThe drivers’ curses and the blaring of horns fill the air. I press myself against the coffee shop window. Keep out of trouble. In my mind’s eye, I see my father’s cigar-yellowed teeth flash amidst his whiskers.\nThe people in black hoodies knock over the trash bin by the street. They run past me—one, two . . . a total of four people. I pretend I don’t see them, but I notice that they’re all wearing canvas shoes. They’re all young. Who hasn’t worn dirty canvas shoes in their youth? I look down at my own feet, encased in dull brown leather lace-ups. The surface of my shoes is covered in creases from long wear, like the wrinkles on my forehead I try valiantly to ignore when I look in the mirror.\nSuddenly, someone’s hand blocks my view of my feet. He’s reaching into the pocket of my windbreaker, pulling out my right hand. I feel strange tickling sensations—he’s drawing something on my palm with his finger. Surprised, I raise my head. In front of me is the fourth person in black, small and thin, his eyes covered by his hoodie. He rapidly sketches something out on my palm, then pats my hand. “Do you understand?”\n“Hurry!” the other three people in hoodies are hollering. The fourth person tosses a glance back at the steadily nearing police and leaves me to run after his friends. The cops are right behind, puffing and panting. “Stop right there!” one of them shouts hoarsely. The other has his whistle in his mouth, blowing raggedly. I’m certain they turn and look at me as they pass by, but they don’t say anything, only run into the distance, waving their batons.\nThe pursuers and the pursued turn the corner at the flower shop and leave my sight. On the damp street, the cars begin to move again, the pedestrians weaving among them as if nothing has happened. But the warmth of a stranger’s fingertip still lingers on my right hand.\n3.\n“The usual?” the waitress in the diner below my apartment asks me. Her smile doesn’t reach her eyes.\n“Yeah—” I say automatically—“wait, add smoked salmon to the order.” The waitress, who already turned and started walking, makes an OK sign over her shoulder.\n“Did something happen? You changed your order.” Slim is a coworker at the Social Welfare Building, and my only acquaintance close enough to call a friend. He has the ability to sniff out the pheromones other people give off without fail. In the five minutes since he’s sat down, he’s identified a middle-age virgin, a pair of gay paramours, an aging housewife desperate enough to bed the pizza boy, a debauched teenager buying beer with his big brother’s ID card, and a sexually fulfilled paraplegic.\n“For real, though, how would someone in a wheelchair have a fulfilling sex life?” I pick up my beer glass and take a sip.\n“The higher the paralysis goes, the more likely he’s impotent.” Slim gestures at his own spine with a long, crooked arm. “Anyway, what about you? You’ve met the one, haven’t you? She’s a blonde, right?” His grayish eyes gleam with the pleasure of prodding at my privacy.\n“Stop kidding. I ran into some demonstrators this afternoon. You know, the sort of hooligans you see crying out on the news for earthworms’ rights.” I shake my head. “Thanks,” I say, taking the plate from the waitress. A meatball sandwich with pickles on the side—my dinner, forever and always.\n“Kids with too much time.” Slim shakes his head. “Speaking of which, did you know . . . the word ‘potato’ comes from the Arawa language of Jamaica.”\nDimly, I think his voice sounded strange just then, when he was saying the second half of his sentence, as if something got stuck in his throat or the cold beer caused a relapse of my tinnitus. “No, I didn’t know. Not that I’m interested in some language no one speaks anymore.” I stick a slice of pickle in my mouth.\nSlim widens his eyes in surprise. “You don’t care about this?”\nHis voice is back to normal. It was tinnitus, then. I should go see a doctor, if I haven’t reached my health insurance coverage limit this year. “I don’t give a damn,” I say with my mouth full.\n“Fine, then.” He lowers his head and toys with his beer glass. The waitress brings his dinner to the table, and passes me my smoked salmon as well.\n“Seriously, you two should go out and have some fun. Go to the strip club or something.” The waitress looks at our expressions, frowns, and leaves.\nSlim and I wordlessly turn our heads toward the gaudy club front across the street. I take two fries from his plate and stuff them into my mouth, then push my smoked salmon toward him. “Have you felt that we haven’t had any interesting topics to talk about lately?” I say.\n“You’re feeling it too?” Slim exclaims. “Beyond the sex lives I’ve sniffed out, I can barely find anything to talk about. I’ve found conversations so boring these last few years.”\n“Maybe we’re just getting old?” I unhappily retrieve my right hand from the plate of fries. There’s a noticeable age spot on the back of my hand. It appeared just recently, awkward like the stain on my trousers the year I was twenty-two.\n“I’m only forty-two! Jimenez was forty-one when he won the Welsh Open!” Slim cried, waving a French fry wildly. “The drudgery of work is making us this way. It’ll all be different once we retire. Don’t you agree, old buddy?”\n“I sure hope so,” I answer distractedly.\n4.\nI drink two more bottles of cold beer tonight. Waves of dizziness assault me once I’m through my apartment door. I make for my bedroom and collapse on the bed without bothering to shower.\nThe sheets smell strangely earthy. I don’t know if it’s because I haven’t changed them in so long, but on the bright side, the smell makes me think of the farm when I was little—not the farm that reeked of my father’s animal stench, but from before he started drinking, before he started abusing my mother. I’m thinking of the tranquil, peaceful farm where my mother, my sister, and I lived.\nI remember my older sister and me playing in the newly built granary, airy and filled with the clean fragrance of earth and fresh-cut wood. Sunlight spilled in through the little loft window, accompanying the smell of the cookies my mother baked.\nWhen we got tired from running, we sat down with our backs against the wall. My sister pulled my right hand over. “Close your eyes,” she told me. I obediently shut my eyes, the sunlight glowing dusky red on the inside of my eyelids. My palm tickled. I giggled and tried to pull my hand back. “Guess what word I’m writing.” My sister was laughing too, her finger scritching around on my palm.\nI thought a bit. “I don’t know. Write slower!” I complained. My sister wrote the word again, more slowly.\n“ ‘Horse?’ ” I slowly answered, looking at her.\n“That’s right!” My sister laughed and ruffled my hair. “Let’s play again! If you can get five words right, I’ll let you ride my pony for two days.”\n“Really?” I excitedly closed my eyes.\nMy palm started to tickle again. I barely held back my giggles. “It’s . . . ‘crow’ this time?”\n“That was ‘road,’ dumb-butt!” My sister flicked my nose, laughing, and jumped to her feet. “First one there gets the biggest frosted cookie!”\n“Wait for me—”\nI stretch out an arm. I open my eyes to fluorescent lighting and the ceiling, one corner stained with water. The family living above me forgot to turn off their bath tap again. I’ll get the apartment managers to teach them a lesson this time, I think, realizing that I’d woken up from my dream of childhood. My shirt smells sour from alcohol after a day of wear. My neck and back ache from my awkward sleeping position. It takes me five minutes to sit up, look at the alarm clock, and see that it’s only one in the morning.\nI feel better after a shower and a few glasses of water, but I don’t feel like sleeping anymore. I put on pajamas and sit on the living room couch. I flick on the TV; as usual, there’s nothing interesting at all on the late night shows. As I flip through the channels, I notice the ugly blotch on my right hand again. I scrub at it with my left hand, even though I know something like that can never be rubbed off.\nThe sudden faint itching on my palm makes me shiver. Wait, what’s this feeling? I—I recognize it from the dream, my sister scrawling childish character on my hand . . .\nToday at noon, the stranger in the black hoodie wasn’t tracing some mysterious symbols or gang signs on my palm.\nHe was writing. No, she was writing. The stranger was a woman. The black hoodie had hidden her other features, but that slender finger couldn’t have belonged to a man. What had she written?\nI frantically dig out pencil and paper and set them on the coffee table. I try with all my might to recall what I felt. The last word had been written by my sister before . . . yes, it’s “ROAD.”\nI write “ROAD” on the sheet of paper.\nThere was another word in front of it. She had written it quickly, very quickly. From my long years approving petitions, I’ve found that people will write words with pleasant associations that way, fast and fluid, words like “smile,” “forever,” “hope,” “fulfillment.” She’d written a short word, standing for something good, with two vowels . . . aha! “EDEN.” That’s right, the garden of paradise.\nI write “EDEN” before “ROAD.”\nEven before those words had come a string of numbers, Arabic numerals. She wrote them twice over for emphasis. I wrinkle my brow, carefully recalling every movement of her fingertip. 7, 2, 9, 5? No, the first number traced the outside edge of my palm, so there should have been another bend at the end. It was 2, then. 2, 8, 9, 5. I check my recollections again. That’s it.\nI write “2895” on the left.\nThe paper reads “2895 Eden Road”\nI flop down in front of the computer, open up a map site, and enter “2895 Eden Road.” The page shows Eden Road to be on the other side of the city from me, far from the downtown area and the slums near the financial center. But Eden Road doesn’t have a 2895. The building numbers end at 500.\nI rub my temple, translating each number back to a sensation on my skin, a tingling line traced on my palm. I stare at my hand. 2, 8, 9, that was right. 5 . . . oh, of course, it could have been an “S.” I type in “289S Eden Road,” and the map site shows me a four-story apartment building halfway down Eden Road. It’s at the outskirts of the city, forty-five kilometers from here. “Got it!” I triumphantly smack my keyboard and leap to my feet, only to fall back on my ass, dizzied by the blood rushing into my head.\nWhat would I find there? I haven’t a clue. But I do know that in the forty-five years I’ve lived by the book, I’ve never had an adventure where a woman in a black hoodie left me a contact address in a cloak-and-dagger manner —well, my path never seemed to cross with the ladies at all, loser that I am. Something interesting has finally appeared in my dull and listless life. Whether driven by the urging of my hormones, as sharp-nosed Slim would say, or my aroused curiosity, I decide to put on a windbreaker and go to 289S Eden Drive to find something new.\nDon’t make trouble, kid. As I prepare to leave, I see my father in the mirror opposite the door, his belly bulging, a bottle of gin in hand.\nOh, fuck you. I stride out the door like I did twenty-three years ago.\n5.\nI own a motorcycle, long unused. In college, I’d been as captivated by the latest high-tech toys as all the other young people were: the newest phone, tablet, plasma TV, electricity-generating sneakers, high-horsepower motorbike. Who doesn’t love Harley-Davidson and Ducati? But I couldn’t afford such expensive brand-name motorcycles. When I was twenty-six, I found a Japanese exchange student about to return home because his visa was expiring, and at last managed to buy this black Kawasaki ZXR400R with only 8000 miles from him. She was in excellent condition, her brake disks gleaming like new, the roar of her exhaust pipes mesmerizing. I couldn’t wait to ride over to my friends and show her off, but they’d long since grown bored of motorcycles. They came to the bars and talked about women with their brand-new Mercedes-Benzes and Cadillacs parked outside.\nFrom then on, I didn’t really have friends anymore. When I put on my tie and rode my Kawasaki to work, everyone would look askance at me and my ride, smacking of youthful rebellion. In the end, I gave up and locked my beloved motorbike away in storage. There she stayed as I grew older and met one failure after another in my career. In the blink of an eye, I’d turned into a forty-five-year-old single alcoholic. Sometimes, on a sunny day, I’d ask my beloved Kawasaki as I cleaned her: Old buddy, when do you want to go out for a ride again? She never answered me. Every time I thought I could work up the courage to take her out for a ride, the grotesque mental picture of a balding middle-aged man hunched over the sleek motorcycle turned my stomach. It reminded me of the sickening way my drunken father would self-assuredly hit on every woman he saw.\nI make my way down the battered apartment stairwell and unlock the dusty doors to the public storage room. I find my motorbike half buried in empty beer cans and pull the tarp aside. The Kawasaki 400R’s jet-black paintwork is covered with dust, but the tires are still full of air, and all the gears still gleam with oil. I uncap a small spare gas can and pour the contents into the tank, then turn the key, testing the ignition. The four-cylinder four-stroke engine howls to life without hesitation. My old buddy hasn’t let me down.\n“Asshole, do you know what time it is?” When I walk my motorbike out of the storage room, a beer bottle smashes to pieces at my feet. I look up and see the landlady yelling from the second story window, a nightcap on her head. I don’t apologize like I would have usually done. I just get on my motorcycle and rev the engine, the roar reverberating up and down the street. I loose the clutch at her shouts of “Are you crazy?” Amidst the squeal of tires and the smell of burning rubber, I whoop with excitement, and my apartment and the strip club retreat from me at breakneck speed.\nThe wind howls. I’m not wearing a helmet; I feel the air resistance mold the flabby flesh of my face into comical shapes, and the hair I grow long for my comb-over whips behind me. But I don’t care how many people might be around at one in the morning to see an ugly middle-aged man racing by on a motorcycle. At this moment, the endless monotony of my life has at least been broken by thirst for the pursuit of happiness.\nThe ride is over too quickly. The sign for Eden Road appears before I’ve had my fill of racing through the empty city streets. I decelerate and shift to second gear, turning my head to read the numbers on the doors. Looking at the map, the subway and light rail stations closest to Eden Road are two kilometers away; this is a place forgotten by the city’s development. The street isn’t wide, and dingy old cars line both sides of the road. The rundown three- and four-story buildings beyond them are crammed against each other, the majority looking more dilapidated than my own apartment building. Most of the streetlights are dark, and the Kawasaki 400R’s headlamps sketch an orange halo against the black street. A feral cat jumps out of a trash bin, eyes me, and pads off.\nAt this point, I’ve calmed down enough to wonder whether crossing the city at night for an unfamiliar district in search of a stranger’s cryptic address was a rational decision. Every telephone pole could conceal a knife-wielding mugger, maybe even a black market doctor in search of organs to steal. I want to escape my dreary life, but I definitely don’t want to escape it only to end up as a gory crime scene photo in tomorrow’s newspaper.\nI decelerate as much as I can, but it’s too quiet here, and the rumble of the Kawasaki’s engine sounds louder than a B-52 pressed back into active duty. Luckily, at this point, a bronze door plate appears in the headlights: 289A/B/C/D/S Eden Road.\nI stop by the roadside, kill the engine, and turn off the headlights. A deathly silence instantly engulfs me. On either side, Eden Road has fallen into darkness. In front of the door to the apartment building at 289 is the only light, a weak incandescent lamp; its shade wobbles in the wind, making muffled metallic scraping noises.\nDammit, I should have brought a flashlight. Cold sweat seeps from my back. Right, my cell phone. My cell phone. I pat my windbreaker all over and finally find my old-fashioned phone in an inner pocket. I turn on the flash; the football-sized spot of white light comforts me somewhat.\nI walk up and gently pull open the doors to 289 Eden Street. The doors aren’t locked. The glass pane in one door is broken, but there’s no glass on the floor.\nIt’s even darker inside. My cell phone barely illuminates a long-unused front desk with a yellowing ledger tucked behind it: this used to be a hotel. There are stairs on the right. I walk closer, shining my light on the walls. The letters A through D are written crookedly on the walls, followed by an arrow pointing up. There’s no “S.”\nI point my cell phone light up. The stairs lead into a pitch black second floor, and I can’t see anything. Don’t make trouble! my father repeats idly. I wave the irritating memory away. When the beam of light swings behind the staircase, I see that there are no stairs down. Typically, there would be a closet in the triangular region below a set of stairs, and I spot its door, painted discordantly green. The doorknob is unexpectedly shiny, seemingly at odds with the dilapidated building around me.\nI step toward the door, my old brown leather shoes tapping against the badly worn terrazzo. The brass doorknob is as smooth and oily as it looks. I try to turn it. There’s no lock on the door, and I push it open, revealing a long set of narrow stairs. My cell phone light doesn’t penetrate far enough for me to see how deep they go.\nI don’t hear anything. It’s as quiet as a grave. Should I go down? I weigh my options, looking at the battery percentage icon on my phone display. I make up my mind and start down.\nThe stairs are only wide enough for one person, and the walls press in on me. I shine the cell phone at my feet and count about forty steps before a wall appears in front of me, where the stairs double back. I continue forward—down toward the center of the earth, I suppose.\nIt’s not a fun experience. My heart thumps loudly, and my blood presses at my eyes. The sound of my footsteps bounces off the walls, echoing at times in front of me, at times behind me, and I look back more than once. Another forty steps later, my cell phone reveals a green wooden door ahead, slightly ajar. A big brass letter hangs on it: “S.” No light shines through the crack.\nI’m here, then, at 289S Eden Road. For a second, I’m not sure if I should knock. If the strange woman’s message was intended as a personal invitation, I’d be amiss to come at two in the morning, whether I knocked or not. If the message was an invitation for some sort of secret organization, how else was I supposed to enter? I lick my dry lips. I need a glass of whiskey. I’ll even settle for beer.\nI push the door open all the way and walk in. All I see is darkness. I raise my cell phone in my left hand to better illuminate my surroundings. In that moment, my scalp prickles so hard I can feel the plates of my skull being squeezed together. I can’t help but turn my tensed neck like a searchlight, shining my phone over each corner of the room.\nThis is pretty big as basements go, the walls plain, pipes and concrete everywhere, the air damp and moldy. A couple dozen—maybe a couple hundred—people in black hoodies sit cross-legged on the floor, hand in hand. No one’s talking. Even the sound of their breathing is as faint as the beat of a mosquito’s wings. Their eyes are closed.\nMy light shines on one face after another. Under the hoods, there are men, women, old people, young people, whites, blacks, Asians, and on each face is the same eerie expression of joy. No one reacts to my unexpected entrance; their eyes don’t even move under their eyelids. The air in the basement congeals in my lungs. I stand frozen at the doorway, my throat working uselessly.\nI need a drink. In my mind’s eye, my father always carries that bottle of gin, the clear alcohol sloshing against the glass. I’ll leave here first. Get out, ride my motorbike back to the apartment, then pour myself a full glass of whiskey. I swallow, feeling my Adam’s apple bob jerkily, and start to back out of the room, slowly, one step at a time. I reach out my right hand to pull the door shut. I stare at my hand to avert my gaze from the strange gathering, at the ugly splotch. I’ll go to the hospital tomorrow and get that damn laser surgery done, I decide, and have a doctor to look at my tinnitus while I’m there.\nThen a hand suddenly descends onto mine. The black-clad arm comes from the other side of the door, and the fingers are slender but strong. I feel every hair on my body stand on end. The flashlight falls from my left hand and goes dim. I’m left in darkness. I can’t move. I can’t think.\nA finger gently reaches for my palm. The familiar tingling sensation begins again. It was the mysterious woman from yesterday; I think I can read her fingerprint from her fingertip. Or is it just bioelectricity? I mentally read the words she writes: “Don’t be afraid. Come . . . share . . . transmit.”\nDon’t be afraid. Share what? Transmit what? Did I miss words between these? The hand pulls me forward, and I follow unthinkingly with clumsy steps, reentering the silent room. The air is like thick printer’s ink. The mysterious woman tugs me through the darkness slowly, toward the depths of the room. I’m afraid that I’m going to step on one of the sitting strangers in black, but our circuitous path is free from obstacles. At last, the woman stops and writes, “Sit.”\nI grope around, but there’s nothing around me. I sit down on the ice-cold cement, my eyes wide open, but I still can’t see anything. The woman’s breathing flutters at the edge of my hearing. Her left hand still rests against my palm, cold, the skin smooth. Her finger starts moving. I close my eyes and read the words she traces onto my palm: “Sorry. Thought. Knew. Don’t. Afraid. Friends.”\n“Sorry, I thought you already knew what this is about. Don’t be afraid. We’re friends. We’re all friends here.” With a bit of imagination, her touch could be translated into eloquent words. I still don’t understand why she didn’t just talk, but this isn’t bad either. My fear melts away like hail in sunlight. Slowly, I adjust to the blinding darkness and the touch in the center of my hand.\nShe moves closer and finds my left hand, pressing my finger against her right palm. I understand immediately. I write in her palm, “I’m fine. This is one heck of an experience.”\n“Slower,” she writes.\nI slow down and write one character at a time, “I’m. Great. Fascinating.”\n“You learn fast.” She draws a shallow crescent shape that I interpret as a smiley.\n“You. Meet. Here,” I write, followed by a question mark.\n“Yes, the society meets daily,” she replies.\n“What for? What kind of organization are you? Why did you invite me?”\n“We hold discussions through finger-talking. You’ll love it. I saw you on the street staring at that window, lost in thought, and supposed you must be lonely like me. You must find the world so dull.”\n“Me? Yes, I suppose. To tell the truth, I do find life stifling. But before I met you, I never thought to do something about it.”\n“Start now, then.” She draws another smiley. It’s at that moment that I think I’ve fallen in love with her, even though I’ve never seen her face, never smelled a woman’s perfume on her.\n“What am I supposed to do now?” I ask.\n“Members arrange themselves in a circle, each person linked to two others. Write with your left hand and let someone else write on your right. Whatever you want to hear about, whatever you want to say, is up to you. I left the ring just then to meet with you,” she replies.\n“I think I understand the gist.” I think some more. “Then I won’t be able to converse with someone like I’m doing now? I can only speak to the person on my left, and listen to the person on my right.”\n“That can’t be helped in the general gathering. But privately . . . whatever you want.”\n“If—just out of curiosity—I were interested in the person to the right of me. If we alternate writing between my right hand and his left, couldn’t we have a one-on-one conversation?”\n“That’s not allowed. The rules of the finger-talking gathering require facilitating a unidirectional flow of information. But you can make a topic and transmit it so that the person you’re interested joins.”\n“I don’t understand.”\n“Say you want to talk about the president with the person on your right. Spread the topic “What does everyone think of the president’s foreign exchange reserves policy?” to the person on your left. They might add in their viewpoint, or transmit the original topic unchanged. When the topic goes around and reaches the person to your left, he can now give you his opinion. Finger-talking gatherings aren’t meant for dialogues. The fun lies in sharing thoughts and transmitting opinions. I’ve been told this resembles the old, extinct topological structure of the Internet.”\n“Sounds complicated.” I don’t understand why they had to invent such a strange mechanism for having conversations. There are plenty of forums and discussion groups on the Internet, and chatting over a beer at bars is even better. But since my bizarre experiences have led me to this mysterious gathering, I’m not going to pass on a chance to try it out. “Can I join the gathering right now?”\n“There’s too much info being passed around for a beginner. Your slow speed of transmission will clog up the entire circle. We use a lot of abbreviations and references to increase efficiency, and you’ll need time to learn them,” she replies, and spends the next five minutes demonstrating those special abbreviations. “You don’t seem like a newbie,” she says, surprised at the speed at which I pick them up. She draws a big letter P to represent sticking out her tongue.\nMy sister’s and my little secret, I think. “Don’t worry, let me try it.”\n“Okay,” she says eventually. “I’ll move to your left. We’ll step forward three steps to one of the nodes in the ring. Pat the shoulder of the person on your right, and he’ll break the connection. Take his left hand in your right hand. Remember, you have to be quick.”\nWe exchange positions. She holds my left hand in her right and leads me forward until I can dimly feel the body heat of the person in front of me. I kneel, feel someone’s shoulder come into contact with my hand, and pat it. The person immediately moves to the right to leave me a spot. I sit down with the woman hand in hand, and the person finds my right hand and takes it.\nThe hand is a man’s, hard and knobby and powerfully muscled, but his finger is astonishingly nimble. My palm is instantly covered with rapid writing. He’s so fast that I can’t even identify every letter. I focus on capturing the keywords and abbreviations, and guessing the meaning of the sentence from there. Before my brain has time to take in each message, the next sentence assaults me—my skin evidently hasn’t become sufficiently sensitive for the flood of finger-talking information. As I frantically decipher the words, I pass on what I can to her on the left. “Opposition party . . . scandal . . . resignation crisis . . . secret police . . . pursuit . . . ” I can only retransmit some o the keywords in the message, but I’m hooked. No one brings up politics in my online groups anymore. I want to add my own viewpoint for her, but the next message has arrived already. “Spaceplane wreck . . . Jamaica. Scandal. Fuel leak. NASA’s lost government support? Russian attack.” The first part is the topic, and after it are everyone’s opinions. I think I’m getting used to this method of receiving information. She’s right, I’m not a newbie. But the fingers on my left hand can’t quickly and clearly transmit information no matter how hard I try. After a few attempts, I write dejectedly, “Sorry.”\nHer palm is cool and smooth, like the fresh new blackboard in my elementary school classroom. In response, she extends a finger and stealthily writes three words on my left hand: “I forgive you.”\nI can feel the corners of my mouth lift. “You just told me this is against the rules,” I write.\n“You’re getting better.” She breaks the rules again and adds a smiley face.\n6.\nKnocking on my door wakes me. I cover my ears with my pillow, hoping that whoever is at my door will go away. But five minutes later, I have no choice but to put on a night robe, shuffle into my slippers, and walk toward the living room. The knocker is persistent but unhurried. I look out the peephole; the brim of a policeman’s cap blocks my view. “Damn,” I mutter. I unlock the door and open it. “What can I do for you?”\n“Good morning.” The cop leaning against the wall takes off his cap and shows me his badge. “Can I have five minutes of your time, sir? It’s purely protocol,” he says listlessly.\n“Sure, five minutes.” I return to the living room and flop down on the couch. I pour myself half a glass of bourbon. The clock reads Tuesday 1:30 PM, and my night of tossing and turning has reactivated my headache. I pour the amber-colored alcohol down my throat and exhale slowly. My computer screen brightens: Roy left a message. I joined that discussion group after all. It’s a little more interesting than I thought.\nThe cop looks to be about thirty, short, with an old-fashioned mustache. He makes himself at home in my armchair. He looks around, sizing up my little apartment. “Nice place.”\n“It was nicer twenty years ago,” I reply.\nThe cop sets his cap on my coffee table and takes out a tablet and stylus from his pocket. After a moment of consideration, he tosses them aside and falls against the armchair’s backrest. “Even I know this is completely pointless,” he sighs.\n“Just doing your job, right?” I say sympathetically.\n“Yes, job.” He frowns as he unwillingly picks up the tablet. “Let’s see . . . you work at the Social Welfare Building. Mondays, Wednesdays, Fridays,” he reads.\n“That’s right,” I reply.\n“You’re forty-five and single. Last year, you were convicted of medical insurance fraud and sentenced to two weeks of community service.” He sounds mildly surprised.\n“The hospital got my coverage limits wrong! They apologized afterward,” I explain irritably.\n“We received a complaint today at 1:12 AM saying you were disturbing the neighbors?” The policeman idly combed at his mustache with the tip of his stylus.\n“Uh . . . ” Remembering the experiences of last night, I feel a surge of apprehension. Is the cop’s visit tied to the finger-talking gathering? I don’t think sitting in the dark in large groups and scribbling against one another’s palms is illegal, but my instincts tell me to say nothing, to keep this secret. Don’t make trouble, as my father used to say to me. “I had some beers last night. When I woke, I thought I’d take my motorcycle out for a spin, nothing more. I apologize if I disturbed the neighbors.”\n“I see. You were taking your motorcycle out for a spin.” The cop lethargically writes something on the tablet. “I understand a man’s need for adventure. Well, that’s it, then. You know we don’t take those neurotic old ladies’ complaints too seriously, but protocol is protocol.” He stands, sticks his cap under his arm, and stuffs the tablet and stylus back into his pocket.\n“That’s it?” I stand, in disbelief.\n“Thank you for your cooperation,” the cop recites, and turns to leave. I follow after him with my whiskey glass in hand. Just as I prepare to close the door, the short policeman turns and raises his black eyes to mine. “Right, you didn’t take your motorbike anywhere you shouldn’t go, I hope.”\n“Somewhere I’m shouldn’t go? Of course not,” I reply quickly.\n“Oh, your motorcycle went southeast, out of surveillance camera coverage. You must have come across some really unique little neighborhood. Crime rates may have fallen to their lowest in fifty years, but in my job you learn that there’s still all sorts of bad people in this world. Have a nice day, sir.” He pats my shoulder with a not-quite smile, puts on his cap, nods in farewell, and trots down the squeaking wood steps.\nI slam in the deadbolt and lean against the door, gasping for breath. Was the cop really onto something? Are the woman and the finger-talking gathering doing something illegal? That’s right. I’m an idiot. I smack my forehead, remembering that when I met her yesterday, she and her friends were being chased by two policemen.\nI need to see her again. The strange and strangely fascinating conversations of the finger-taking gathering ended at three in the morning. The people in black hoodies streamed out of the spartan basement of 289S Eden Road in silence, and I’d lost her among the crowd. I obeyed the rules of the gathering and didn’t call out for her. Later, I realized that I didn’t even know her name.\nI need to see her again.\n7.\nBy the time I log in, Roy has left. I sigh and turn off my computer.\nThe finger-talking gathering begins at midnight. I’d never waited so anxiously for sundown. I stand up, sit down, change the TV channel, sit blankly on the toilet staring into space. I repeatedly check my watch. To while away the time, I take the Bolívar No. 2 cigar I’d secreted away for so long out of the humidor. I open the precious aluminum cigar tube, carefully cut the closed end, and light it with a match. I take a deep drag and exhale it slowly. The rich, intense smoke of premium Cuban cigar makes me dizzy with pleasure, but guilt quickly follows. A thirty-dollar cigar? I don’t deserve it. A thing so splendid should remain forever in my crude humidor, to be admired from a distance the same way as the beautiful Kawasaki.\nAnd my motorcycle . . . it had functioned less smoothly on the ride home, the engine coughing weakly. I think the aging carburetor’s losing efficiency; my old buddy’s getting along in years, after all. I ought to use a safer, less traceable method of transportation to go to Eden Road. I turn my mind to that problem, idly clicking the TV remote through channels. The TV shows are as boring as the Internet. None of the topics from yesterday’s gathering appeared at all, never mind the accompanying bold discussion and critiques. Impatient and restless, I suck away at my cigar until the stub burns my fingers, then go to my bedroom and dig in my closet until I find a dark blue hoodie from my college years. I put it on, flip up the hood, and walk in front of my mirror.\nThe wrinkled hoodie bears the image of Steve Jobs—someone that this generation of young people might never have heard of—printed in black and white on its front. It fits well: I haven’t gained a pound since I graduated. From the depths of the hood floats the bloodless, hollow-cheeked, baggy-eyed face of a middle-aged man. It tries to smile, but coupled with the big brandy nose, it looks comical.\nThis is why I long for the finger-talking gathering. In darkness, no one needs to see your ugly face. All you have is the touch of a fingertip and a thought put into writing. I push back the hood and carefully comb my hair to the right, but I can’t cover the balding top of my head no matter what I do.\nThe sky is finally dark. I stack crackers and cheese, press down, and heat it in the oven. Then I open a bottle of beer and have myself a simple dinner. The cheese gives me heartburn. I can’t suppress the pounding of my heart. In my hoodie, I pace in the living room. The TV shows some guy with too much time carrying a massive sign in front of the city hall. The protestor is surrounded by a sizable audience, but no one seems to be joining him. I think I see a few people in black hoodies in the crowd. Is it them? I toss down the remote and pull up my hood, determined to go take a look.\nThere aren’t many people on the subway. A number of them pretend to be watching the commercials on the display screens while secretly sizing me up.\nTwo teenagers with fashionable mushroom-shaped hair discuss me quietly. “Who’s the guy on that old geezer’s sweatshirt?”\n“Some religious leader, probably. Like Luc Jouret or something.”\n“Uh, who’s that?”\nYou’re half right, ignorant kids. I pull my hood lower. In my time, Steve Jobs was as good as a religious leader, until the Internet degenerated into senselessness and everyone tossed aside their complicated smartphones for basic phones that could only make calls.\nI arrive at the city square half an hour later. The protestor stands in the middle of the brightly lit lawn. His sign is ridiculously huge, covered with several rows of garishly colored writing. I can’t see what it says with my deteriorating vision. Is this a side effect of overdrinking, like the tinnitus? My mother says that my father is blind as a mole now. I can’t imagine what he looks like, what remains of his bushy beard, red face, brawny arms, his massive beer belly, and I don’t care to find out.\nA crowd has gathered to watch him afar. A few cops are leaning against the side of their police car, chewing gum. Skater kids are showing off their tricks on the steps. In front of a TV van, a reporter and a camera man are chatting. In contrast, the protestor seems all alone. I walk closer, squinting at the sign. The red text on the top reads, “Wood-burning fireplaces are the leading cause of global warming.” Below it, “For every traditional fireplace you tear down, Mother Earth lives another day” is written in blue.\nI wrinkle my brow. The First Amendment wasn’t made for idle crap like this. Where are the incisive opinions from the finger-talking gathering? I approach the crowd, trying to find the people in black hoodies, but at this time the police come up and ask the protestor to leave for the sake of the grass, and the crowd disperses too. I can’t find anyone I recognize. Two cops turn their gazes on me questioningly. One of them points at the portrait on my hoodie, and the other guffaws in realization. I quickly turn and leave.\nWithout thinking, I ride the subway eastward and get off at the terminal station. I hail a taxi, telling the driver, “289 Eden Road.”\n“Eden Road?” the driver grumbles. “I hope you’re planning to tip well.”\nThe car turns onto a side road. The city around us grows more and more run-down, and the streetlights dwindle. When the taxi stops in the middle of the darkened Eden Road, my anxiety and hope rise as one. “Thinking of going elsewhere, pal? I know some good hotels.” The taxi driver takes my fee and opens the door for me.\n“No, it’s fine. I like quiet.” I get off, shut the car door, and wave. The taxi’s taillights brighten, then quickly diminish and disappear into the distance. It’s nine o’clock right now, but Eden Road is already silent as a grave. I walk toward the front door of 289 Eden Road with its missing glass panel. After some thought, I open the door and enter.\nI know I’ve arrived too early, but I thought that the anticipation would add to tonight’s gathering. Like yesterday, my heart is thumping, but this time it’s out of excitement rather than fear. I find the door at the back of the stairs by the light of the wobbly incandescent lamp and turn the brass doorknob. The dark, narrow forty steps appear before me. I’ve lost my cell phone, and neither do I have a flashlight. I adjust my hood, close my eyes, and walk into the deepening darkness. One, two, three, four, five . . . thirty-nine, forty. There’s a wall in front of me now. The stairs double back here. I grope around, exploring with my right foot until I find the next stair. One, two, three . . . thirty-nine, forty. Both my feet are on flat ground. The green door with the brass letter S should be in front of me. Filled with hope, I reach out.\nMy fingers touch cold concrete.\nHad I misremembered? I summon last night’s experiences to my mind. There was only this door at the end of the stairs. This door, and nothing else. I’m sure of it. I clearly recall the gleam of the brass S. I shuffle to the left and right, but touch only concrete wall on either side. The place directly in front of the stairs, where the door should have been, is also rough wall. The stairs have taken me to a dead end.\nI can feel the blood pounding in my head. My ears feel hot, and the headache is returning. Calm, I tell myself. I need to calm down. Breathe deeply. Breathe deeply. I take off my hood and suck in a slow breath. The cold, damp basement air fills my lungs, and my overheated brain cools down a little.\nOnce I’ve taken a few minutes to calm down, I start to look for the vanished door again, but there are no signs that there had ever been a door here. The rough wall scrapes my fingertips raw. I sit down, despairing.\nWhere are your friends now? My father’s face appears in the darkness, sneering carelessly.\nShut up! I yell. I bury my head in the crook of my arm and cover my ears.\nI told you, don’t make trouble. My father wipes a trickle of beer from the corner of his mouth. His breath is hot and foul. His arm is around my sister, whose blue eyes glisten with tears. My mother is to the side, crying.\nShut up! I scream.\nYou’re eighteen now. Get the hell out of my house. Get a job, or go to your goddamn university, but I don’t have to let you live under my roof anymore, my father roared, throwing the suitcase at my feet. My sister hides herself in the kitchen, tears running down her face as she looks at me. My mother is holding a pot; her face is expressionless.\nShut up! I scream hysterically.\nI don’t know how much time passed. You can’t tell time accurately in the dark. It might have been a nightmare, or maybe I’d never fallen asleep in the first place. I stand up slowly, letting the wall take some of my weight. I’ve been curled up too long; every joint cries out in protest. All I want to do is go back to my little apartment, down a big glass of whiskey, no ice, and turn on the TV. Forget my absurd dream from last night. Forget the lingering sensation on my palm. Forget that there ever was such a thing as the ridiculously named finger-talking gathering.\nI stride forward. My left foot strikes something. It rolls, then glows to life, a spot of white light illuminating the narrow space. It was the cell phone I lost at the door last night, my ridiculed, one-of-a-kind old fashioned smartphone.\nIt wasn’t a dream. Strength surges into me instantly. I pick up the phone; the battery is almost depleted, but it’s enough to let me properly examine the wall in front of me. Yes. This portion of the wall is brand-new, troweled together in a hurry with fast-setting concrete. Where the wall meets the floor, I see a wooden doorframe buried in the depths of the crack. The door is there, just hidden by people trying to keep it secret.\nI knock on the wall and find that the cement is too thick for me to break through. The people in black hoodies weren’t some hallucination. They’d simply changed their meeting place and forgot to tell me. I comfort myself with that.\nI wait there until two in the morning, but no one comes. I climb back up the stairs, walk to the subway station two kilometers away, and hail a taxi back to my apartment from there. Step by step, I climb up the squeaking stairs. My thoughts are in a muddle, but I still need to work Wednesday morning. As I open the door to my apartment, I plan to drink a glass, take a shower, and get some proper sleep.\nI freeze at the doorway. Someone in a black hoodie is sitting on my couch.\n8.\nI pick up the e-seal and stamp the social welfare petition on my display: a newly immigrated family with six children. The green indicator light on the e-seal turns red, telling me that I’ve used up today’s approval quota. I relax into my chair and work the cramp out of my wrist. There’s still half an hour until my shift ends.\nThe pretty blonde girl who shares my cubicle stands up to invites everyone to her birthday party. “We’d . . . welcome you too, if you have the time,” she says belatedly to me, out of what I know is forced courtesy.\n“Sorry, I have an important date the next day. But happy birthday!” I reply. She visibly gives a sigh of relief and puts her hand to her chest. “Thanks. That’s a pity. I hope the date goes well.”\nTo a girl her age, I’m from another generation, and I understand an out-of-place old man at a party can be a disaster. But the date wasn’t an empty excuse. I can still feel her message on my right palm: Tomorrow in the city square at 6 AM.\nI don’t know how she found me, how she got in my apartment, or how long she waited there. After a moment of surprise, I walked over and took her hand. The neon lights of the strip club flashed through the window, splashing her black hoodie with radiant colors. I still couldn’t see her face properly. “Sorry, we changed the meeting place. We couldn’t contact you in time,” she wrote.\n“Did I cause trouble for you?” I ask.\n“No. The situation’s complicated. Only a few core members went to the finger-talking gathering just now. We’ve had some internal disagreements.” At the end of the sentence, her finger tapped out a few hesitant ellipses.\n“About what?”\n“About whether to do something stupid.” She drew two wavy lines under “stupid.”\n“I don’t understand,” I write honestly.\n“If you’re willing to listen, I can tell you how the finger-talking gathering came to be, how we’re organized, the struggles between the factions, and our ultimate goal.” She wrote it in one long sentence.\n“I don’t want to know,” I reply. “I don’t want to turn these interesting conversations into politics.”\n“You don’t understand.” She draws a greater than sign, a sigh. I’m realizing that she expresses even the most basic emotions through writing. “You must have noticed how the Internet, TV, books have lost any semblance of intelligence.”\n“Yes!” I feel a rush of excitement. “I don’t know why, but every topic worth arguing over has disappeared. All that’s left is pointless bullshit. I’ve tried tossing provocative topics out in discussion more than once, but no one would reply. Everyone’s more interested in sashimi and earthworms. I noticed it years ago, but no one believed me. The doctor gave me pills to get rid of the hallucination. But I know this isn’t a hallucination!”\n“It’s not just these. Conversations with friends and the things you see on the street are becoming as bland as the Internet and the media.”\n“How do you know?” I nearly stood.\n“It’s all a conspiracy.” She pressed hard writing this, hard enough to hurt.\n“A conspiracy? Like the moon landing thing?”\n“Like Watergate.” Her writing grew agitated, harder to decipher.\n“I think you need to tell me everything.”\n“Then we’ll start with politics.”\n“Hold on . . . when’s the next gathering? Can I join?”\n“This is what we’re arguing about. Those in support of action think we should hold our next gathering in a public place, like the city square. We shouldn’t keep running and hiding. We should show what we believe in, no compromises,” she tells me.\n“I’m guessing that the police don’t like you guys very much.” I once again recalled the first time I saw her, chased by two panting cops.\n“They don’t have anything on the organization as a whole. It’s just some individual members who have criminal records, especially the activists,” she answers frankly.\n“You have a criminal record?” I ask, curious.\n“It’s a long story.” She was unwilling to say anything more.\nI work up my courage and ask the question at last. “What’s your name?”\nHer finger stilled. I tried to scrutinize her face under the hood, but the hoodie concealed her face entirely. It even hid any sex characteristics. I suddenly realized that my only evidence that she was female was her slender fingers. She could just as easily be a young man, I thought, though my heart utterly rejected the idea. I wanted her to be a woman like my big sister, flaxen-haired and soft-voiced and a little mischievous, freckles scattered over the bridge of her nose. The sort of woman I’d been seeking all my life.\n“You’ll know it in time,” she said eventually, avoiding my question.\n“Actually, I’m more curious about—” the exquisite sensation of my left finger on her right palm was interrupted by the sudden howl of a police siren approaching rapidly. She straightened, alert, and pulled her hood lower. “I’m leaving now,” she wrote rapidly. “If you want, be there tomorrow in the city square at 6 AM. Remember, this is your choice. This is your chance to change the world, or more likely, regret it to the end of your days. Either way, don’t blame anyone else, especially not me, for your own decision. And I might as well add, I think bald men are sexier.”\nShe squeezed my right hand with her delicate but strong fingers, got off the sofa, and vaulted out of the living room window. I hurried over to look down. She’d already climbed down nimbly from the fire escape and disappeared around the corner. I touched my balding head, somewhat dazed.\n9.\nFor a variety of reasons, I sank into a deep depression the year I was thirty-seven. The landlady persuaded me to go to her shrink, threatening that if I didn’t get treatment, she’d kick my ass out of the apartment. I knew that she just didn’t want me to OD and leave my corpse in one of her rooms, but I’m grateful to her all the same after the fact.\nThe man was a Swede with a beard like Freud’s. “I’m not a psychologist,” he said, once we’d talked some. “I’m a psychiatrist. We don’t consult here. We fix problems. You’ll need to take medications if you don’t want to dream every night of your sister’s grave.”\n“I’m not afraid of pills, doctor,” I replied. “As long as the insurance covers it. I’m not afraid of dreaming of the sister I love, either, even if she crawls out of the grave every time. I’m afraid of what’s happening around me. Do you feel it, doctor? Tick-tock, tick-tock, like the second hand on a clock. Here, there, endlessly.”\nThe psychiatrist leaned over, full of interest. “Tell me what you feel.”\n“Something’s dying,” I said in a low voice, glancing around me. “Can’t you smell it rotting? The commentary on the news, the newspaper columnists, the online forums, the spirit of freedom is dying. It’s dying en masse like mosquitoes sprayed with DDT.”\n“All I see is the advancement of society and democracy. Have you thought whether some paranoia-inducing mental disorder may be causing this suspicion toward everything, including the harmonious cultural atmosphere?” The psychiatrist leaned back, fingers interlaced.\n“You were young once too, doctor. You once had the courage to question everything.” My voice rose anxiously. “Back then, when we didn’t know who we’d become, but understood who we didn’t want to become. When there were battles and heroes all around us.”\n“I reminisce sometimes of my youth too. Everyone should. But we’re all grown people now, with responsibilities toward our family, our society, even our civilization and our descendants. I suggest you take these pills regularly when you go home to get rid of your unreasonable fantasies. Find an undemanding job, fish on the weekends, take a vacation once a year. Find a nice girl when the time is right—we haven’t discussed your sexual orientation yet, I realize, please don’t take that the wrong way—and start a family.” The psychiatrist put on his glasses, flipped open his notebook, and cut my protests off with a hand before I could voice them. “Now, let’s discuss the problems relating to your father and sister. Your childhood traumas had significant influence on my choices of medication. Is that fine with you?”\nThe treatment was effective. I gradually grew used to the tepid TV programs and online forums. I grew used to society being peaceful, simple, nice, indifferent. I grew used to seeing the shade of my father, and tried not to argue over things past. Then this person in a black hoodie barges into the monotony of my bachelor’s life and hands me a choice, a choice whose meaning I don’t understand. But I do know that finger-talking has brought me a sense of groundedness I haven’t had in a long time, made the things I felt that had slowly died off eight years ago return from the grave like beetles bursting from their underground cocoons in spring.\nI don’t know what “tomorrow in the city square at 6 AM” will signify. Normally, when I’m faced with a choice, I toss a coin. The answer naturally appears as the coin whirls through the air: which side do you hope will land face-up? But this time, I don’t toss a coin, because when I get off from work, leave the Social Welfare Building, I unthinkingly walk in the opposite direction from the subway station. Next to a spinning pole, I push open the glass door. I say to the fat man across from the mirror, “Hey.”\n“Hey, long time no see.” The fat man waves me in. “Same as usual?”\n“No.” I smile. “Shave me bald. The sexy kind of bald.”\n10.\nI startle awake at 3:40 in the morning and can’t sleep after that. I take a hot bath, change into my Steve Jobs hoodie and khaki pants, put on my sneakers, put in my earphones, and listen to the metal bands of olden days. At 5:00 exactly, I leave Roy a message, drink a cup of coffee, and leave my apartment. The sun hasn’t risen yet. The early morning breeze caresses my freshly shaved scalp, cooling my feverish brain. I take the first subway that comes, unperturbed by the strange looks I get from the sparse fellow travelers. At 5:40, I arrive at the city square. I stand in the middle of the green. The streetlights are bright, and the morning mist is rising.\nAt 5:50, the streetlights go out. The first ray of dawn illuminates the thin mist. People are slowly gathering. Someone in a black hoodie takes my right hand, and I pick up the arm of the stranger next to me. “Good morning” spreads palm to palm. More and more people are appearing in the city square, silently forming themselves into a growing circle.\nAt 6:10, the ring stabilizes with more than a hundred people in it. The participants of the finger-talking gathering begin to rapidly transmit information. I close my eyes. A drop of dew falls from the brim of my hoodie.\nThe person to my right is an old gentleman, by his flabby skin and the refined construction of his sentences; the person on the left is a well-preserved lady with a plump, smooth palm and a large diamond ring on her finger. The topic arrives: “Compared to the gutless bands of today, what bands ought we to remember forever?”\n“Metal. U2. And rock and roll, of course.” I immediately add my own opinion.\n”The Velvet Underground.”\n“Sex Pistols.”\n“Green Day. Queen. Nirvana.”\n“NOFX.”\n“Rage Against the Machine.”\n“Anti-Flag.”\n“Joy Division.”\n“The Clash.”\n“The Cranberries, of course.”\n“Massive Attack.”\n“Hang on, does dance music count? Add Pussycat Dolls, then.”\nI grin knowingly. The second topic appears, then the third. I’ve missed this sort of easy, organic discussion, even if it’s via a mode of information exchange out of a kids’ game. The fourth and fifth topics appear. My fingertip and palm are hard at work, avoiding typos while trying to use as many abbreviations as possible. I think I’m slowly mastering the skill of finger-talking conversation. The sixth topic appears, followed by the seventh. This seems to be the bandwidth limit for finger-talking gatherings. The commentary appended to each topic would steadily grow until everyone interested has finished speaking. The creator of the topic has the right and responsibility to end its transmission at a suitable time to make room for a new topic. The first and third topics have disappeared. The second topic, on the First Amendment, is still gaining comments. The creators of the other topics independently choose to stop transmitting. Only the second topic is left in the circle, and the participants come to unspoken agreement to stop carrying the topic itself, transmitting the commentary only to save bandwidth.\nIt’s an inefficient use of the network to transmit only one data packet at a time. Someone realizes this and starts a new topic in the lull. The network is occupied once again, but soon the data clogs up at one of the nodes.\nA memory from my distant college years suddenly surfaces. “Let’s look at a now-obsolete network topology structure,” the network systems professor had said behind the lectern, “the token ring network, invented by IBM in the seventies of the last century.” So the finger-talking gathering was really an unscientific token ring network reliant on the members’ responsible behavior. I hurriedly finish sending the enormous data packet of the second topic and use the bit of free time to consider how the system might be improved.\nA very brief message appears. It’s uneconomical, I think, but its contents make me gape. “To the sexy bald guy: my name is Daisy.”\nI can feel the serotonin forming in every one of my hundred billion neurons, the ATP sending my heart pounding furiously. Every living bit of me is jumping and hollering in victory. In the place of this message, I send out: “Hello, Daisy.”\nThe size of the second topic has slowed down the network so that it takes me ten minutes to receive the data from upstream. It’s clear that someone’s stripped down the commentary to the second topic to the essentials. After the compressed file is my topic “Hello Daisy” and its legion comments.\n“We love you, Daisy.” “Our daisy blossom.” “Pretty lady.” Then “Hello, Uncle Baldy!”\nI recall how I’d looked in the mirror before I let home: my skinny body, drooping cheeks, red nose and comical bald head, my outdated sweatshirt. I look like a clown. I smile.\nI’m writing my reply when a commotion ripples through the network. I open my eyes. The sun has long since risen, and the mist has disappeared without a trace. Every blade of grass in the city green sparkles with dew. The members of the finger-talking gathering have formed an irregular circle, linked hand in hand into a silent wall. Many people watch from a distance: morning joggers, commuters on their way to work, reporters, policemen. They look perplexedly at us, because we have no signs, no slogans, none of the characteristics they expect of a protest.\nA police car is stopped at the edge of the green, its exhaust pipes billowing white smoke. The car doors open, and cops get out. I recognize their leader, the short policeman who’d interviewed me. He’s still wearing the same apathetic expression and walking in the same careless swagger. He strokes his neat little mustache, considering us, then makes a beeline for me. “Good morning, sir.” He takes off his cap and presses it to his chest.\nI look at him and don’t say anything.\n“I’m afraid you’re all under arrest,” he says without energy. Six hulking black police vans glide silently into the city square. Riot police in full gear flood out, approaching us with batons and riot shields raised. Our onlookers don’t react at all. No one shouts, no one moves, no one even looks in the direction of the neat marching phalanx of riot police.\nI can tell the people beside me are anxious by the sweat on their palms. The second topic’s data package has disappeared. A single short message replaces it, traveling at the highest speed our network can sustain.\n“Freedom,” many fingers write rapidly and firmly into many palms.\n“Freedom.” Our eyes are open. Our mouths are shut.\n“Freedom.” We shout to the black machinery of the government in the loudest form of silence.\n“I love you, Daisy.” I send my last message before the riot police slam me roughly to the ground. The network has collapsed. I don’t know if the message will get to Daisy. Where was she in the network? I don’t know. Will I ever see her again? I don’t know. I’ve never really seen her before, but I feel as if I understand her better than anyway.\nDon’t make trouble. My father looks down at my squashed face. The riot cop is doing his best to mash me and the lawn into one.\nFuck you. I spit out grassy saliva.\n11.\nI’m getting ten minutes on the phone, and I don’t want to waste them. But beside Slim and Roy, I can’t think of anyone to call. Strangely, Slim spends the call talking about the Arawak language of Jamaica. Roy doesn’t pick up. I put down the receiver, at a loss.\n“Hey, old man, how much time do you have left to waste anyway?” The line behind me is getting impatient.\nI dial the familiar number without thinking. Like always, the phone rings three times before someone picks up. “Hello?”\n“How are things, Mom?” I say.\n“I’m well. How about you? Do you still get the headaches?” Through the receiver, I hear the scrape of a chair being dragged over. My mother sits down.\n“I’m much better nowadays. And . . . and what about him?” I say.\n“You never ask about him.” My mother sounds surprised.\n“Ah. I was just wondering . . . ”\n“He passed away last month,” my mother says calmly.\n“Oh. Really?”\n“Yes.”\n“Do you have anyone to take care of you?”\n“Your aunt is with me. Don’t worry.”\n“His grave . . . ”\n“Is in the church cemetery. A long ways from your sister.”\n“That’s good, that’s all I wanted to make sure. Then . . . have a good weekend, Mom.”\n“Of course, and you too. Good-bye.”\n“Bye.”\nShe hangs up. I rub the age spot on my right hand as if trying to wipe those memories away. My father, reeking of alcohol. My sister sobbing, my mother growing withdrawn and numb. The memories from my college breaks are far enough downstream in my life that they no longer seem so unbearable. “Old man, time is money! Tick-tock, tick-tock!” The person behind me taps at his wrist, imitating the tick of watch hands. I hang up the receiver and walk off.\nFor lunch, I end up sitting next to a red-haired guy with a man’s name tattooed on his face. His arms are garishly patterned, as if he were wearing a Hawaiian shirt. “That guy’s gay! Don’t go near him. And don’t let him grab your hand,” the Mexican who shared my cellmate had warned me—I’m guessing he meant well. I take my tray and move a bit aside.\nRedhead scoots closer, smirking. “Want to share my goat milk pudding? I’m not a big fan of lactose.”\n“Thanks, but I’m fine,” I say as politely as I can.\nRedhead reaches over. I snatch back my hand as if jolted on a live wire, but he manages to grab it anyway. He grips my right hand tightly and tickles at my palm with a fingertip.\nI can feel every hair on my body standing on end. “I don’t think I’d be very suited to this type of relationship. If you don’t mind . . . ” I struggle in vain. The bystanders are laughing raucously, smacking the dining tables like a drum.\nThe sensation becomes familiar. It’s finger-talking, the same abbreviations, rapid and precise. “If you understand, tell me.”\nI calm down and give Redhead a careful lookover. He still wears the same stomach-turningly lecherous expression as before. I hook my finger and tell him, “Received.”\n“Thank God!” His expression doesn’t change, but he writes an abbreviation for a strong exclamation. “I’ve finally found another one. Now, after lunch, go to the reading room. The philosophy section is against the east wall. No one ever goes there. On the bottom of the second shelf, between Hegel and Novalis, there’s a copy of the 2009 edition of Overview of the History of Philosophy. Read it. If you don’t understand how, pages 149 to 150 explain the basics. I’ll contact you afterward. For reasons of safety . . . I suggest you prepare to be thought of as gay. Now, hit me.”\n“What?” I say, caught off guard.\nRedhead leers with utmost lasciviousness and reaches for my ass. I flail out a fist and punch him in the nose.\n“Ow!” The bystanders burst into laughter so loud the guards look our way. Redhead scrambles upright, a hand over his bleeding nose, and leaves cursing with his meal tray.\n“What did I tell you?” My cellmate appears with tray in hand and gives me a thumbs up. “But you’ve got guts!”\nI ignore him and stuff food into my mouth. Once I finish, I go to the reading room alone. On the bottom Philosophy shelf, between Hegel and Novalis, I find the clothbound 2009 edition of Overview of the History of Philosophy. I sign it out from the librarian and take it back to my cell. The Mexican isn’t back yet. I lie on my cot and flip open the heavy covers. I don’t see anything special. From a glance, it’s just a yawning pit of references and citations.\nI flip to page 149, and see that someone’s replaced this page. In the midst of headache-inducing philosophy-related proper names is a sheet of yellowing paper clearly torn from another book. The front is covered with completely irrelevant medical information on joint protection, while the back is mostly methods of head massage and corresponding diagrams. At the bottom is a three hundred word simple overview of a newly invented type of low-error, high-efficiency Braille. However, the development of more practical visual surgery techniques had led to the decline of Braille, the book informed me. The new type of Braille was made obsolete before it was ever implemented.\nOh, of course. Braille. I shut the book and close my eyes. The outside covers only have the big embossed gold lettering, but on the inside cover, I find little bumps arranged in some sort of dense pattern. If you weren’t paying attention, they’d seem like some oversight in quality control left the paper unevenly textured. I refer to the instructions and slowly decipher the Braille. The information is heavily compressed; it takes me almost two hours to understand the text on the inside cover.\n“The finger-talking gathering welcomes you, friend,” the unknown author greets. “You’ve certainly felt the changes, but you don’t understand them. You’re lost, angry, considered crazy by other people. Maybe you’ve bowed to the way things are. Maybe you’re still looking for the truth. You deserve the truth.”\nI nodded.\n“This was an enormous program. The secretly ratified 33rd Amendment allowed the formation of a Federal Committee for Information Security to filter and replace information that could pose a threat to social stability and national security. After lengthy test trials, a high-efficiency system called ‘Ether’ slowly came together. At first, Ether only functioned to automatically monitor the Internet through network and Wi-Fi equipment. All text, videos, and audio it considered to be subversive would be put through hacking, sampling, and semantic network analysis. Once it found the forum hosting it, Ether would infiltrate all related conversations on that server. Everyone except the poster would see an altered post. In addition, the poster would be recorded by the database. For example, if you posted the topic ‘Senatorial Luncheon,’ it would be flagged as harmful. Ether’s supercomputers had free legal rein to override all network firewalls, and would intercept the data packet at the interface and replace all keywords. Everyone else would see your topic as the uninteresting ‘KFC Super Value Lunch.’ This way, the federal government gained total control over the Internet. The tragedy is that most people never realized what had happened. They only pessimistically believed that the spirit of liberty was gradually disappearing on the Internet—exactly what the government wanted.”\nI feel a chill at my back. The Mexican comes in at this time and throws his dirty towel on my stomach. “Buddy, you should join the group exercises now and then.”\n“Shut up!” I yell with all my might. The Mexican looks blankly at me. His expression shifts from surprise and anger to fear. He looks away, afraid to meet my bloodshot eyes. My fingers move shakily across the flyleaf of Overview of the History of Philosophy.\n“Following the success of Ether, the federal government’s control over radio, television, and print were a foregone conclusion. The few members of the media who refused to collaborate with the Information Security Bill were isolated using a technology from the same origin as Ether. Nanoelectronic technology had been used to tamper with data exchange, and the people in power soon realized that nanobots could similarly tamper with data exchange through visible light. Seven years after the enactment of the 33rd Amendment, they decided to release nanobots into the atmosphere. These tiny machines could remain suspended in air, using the silicon in soil and construction materials to self-replicate until the desired density was achieved. They were simple devices, activating once they reached the requisite density. They would detect subversive text—information in visible light waves—and subversive speech—information in sound waves—replace them with harmless data, and log their source. They could adhere to printed text and signs, polarizing light so that all observers beside the source would receive false optic data; they could alter the spread pattern of sound waves so all listeners except the source received false acoustic data. Since the source can receive the sound traveling through their bones, they’d hear the message they intended. These little demons floating the air made Ether omnipotent and omnipresent, like the mysterious substance undetectable to mankind that the philosophers said occupied all space—the original ether.”\nI remember the psychiatrist’s words, “All I see is the advancement of society and democracy.” I clench my fists and grind my teeth hard enough to be audible.\n“This is the era we live in, friends. Everything is a lie. The online forums are lying. The TV programs are lying. The person speaking across from you is lying. The protesters’ signs raised up high are lying. Your life is surrounded by lies. This is a golden time for the hedonists: no conflicts, no war, no scandal. When the conspiracy theorists are locked away in the mental hospitals, when the last revolutionaries fade away in front of their lonely computer screens, only our fragile and perfect tomorrow awaits. We will dance our stately, well-mannered waltz at the cliff’s edge, build our magnificent castle on quicksand.\n“Who am I? I’m a nameless soldier, one of the criminals who created Ether. I’m not important. The important thing is that you should see these changes. You should know the truth. Now the truth is yours, and you can choose the path that lies ahead. Our fingers are our most precious resource, because in the next twenty years, within the range of foreseeability, nanobots won’t be able to deceive humanity’s sensitive sense of touch. If you make the choice, you can join the finger-talking gatherings through your mentor at any time, and enter the last and only resistance group under Ether’s omnipresent surveillance. You will enter the only truth left in this world of lies.\n“The finger-talking gathering welcomes you, friend.”\nI close the heavy covers. Thoughts and images are stringing themselves together in my mind. I’ve seen the truth, but I have even more questions now, and only whoever wrote these words can answer them. I brush my palm across the short gray bristles of my scalp, knowing I’ve already made my choice.\nAt dinner, when I see Redhead, I make a beeline for him and take his hand. The cafeteria is instantly in an uproar. We’re going to be the butt of every joke, but I don’t care. I write in his palm, “I’m in.”\nHis smile is full of stories. “Welcome. The first gathering is in two days during group exercises, northeast of the woodwork factory. Our internal publications are in the Philosophy section, second shelf, bottom layer, flyleaf of Nietzsche’s collected works. Right, there’s a flax-blonde, freckled young lady in the female wing who wants me to ask ‘the sexy old bald guy’ how he’s doing. I think I’m talking to the right person.”\nI gape.\nIn that moment, I think of many things. I don’t think of how to change the world with our primitive method of communication, but of all the things my father left me. I thought my father’s beatings and curses had made me incapable of loving, but I’ve found that love is a piece of the human soul that can never be cut out, not just the tremble of hormones. I’d so hated my father, tried to reject every memory that included him year after year, but I’ve found that the child of an abusive father doesn’t have to stay broken. The pain at least is real. I hate lies, even well-meaning lies, more.\nI need to do as I did twenty-three years ago. I need to shout as loudly as I can to the guy trying to control my life, “Fuck you!”\nShe gives me courage, flax-haired, blue-eyed her. I grip Redhead’s hand tightly, as if I can feel the warmth of her body through his skin. On our palms are written love and freedom, burning hot. Love and freedom, searing through the skin, branding the bone.\n“I love you, Daisy—not you, don’t get the wrong idea.” Under countless eyes, I write it on Redhead’s palm.\n“Of course.” Redhead is ready with his familiar, mischievous smirk.\nOriginally published in Chinese in Science Fiction World, 2012.\nTranslated and published in partnership with Storycom.\nBorn in 1981, Zhang Ran graduated from Beijing Jiaotong University in 2004 with a degree in Computer Science. After a stint in the IT industry, Mr. Zhang became a reporter and news analyst with Economic Daily and China Economic Net, during which time his news commentary won a China News Award. His stories have won numerous Gold and Silver Chinese Nebula Awards, and three Galaxy Awards for Best Novelette. He runs a coffee shop in southern China and writes in his spare time. The Windy City, his short story collection, was published in 2015.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.\nBorn in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest."}