{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Robert Reed", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "/ALuNHbABFnUJd+8jUWpBXE4dpc=", "id": null, "license": null, "comments": "", "raw_text": "3810 words, short story  A Woman's Best Friend  The gangly man was running up the street, his long legs pushing through the fresh unplowed snow. He was a stranger; or at least that was her initial impression. In ways that Mary couldn’t quite define, he acted both lost and at home. His face and manner were confused, yet he nonetheless seemed to navigate as if he recognized some portion of his surroundings. From a distance, his features seemed pleasantly anonymous, his face revealing little of itself except for a bony, perpetually boyish composition. Then a streetlamp caught him squarely, and he looked so earnest and desperate, and so sweetly silly, that she found herself laughing, however impolite that was.  Hearing the laughter, the man turned toward her, and when their eyes joined, he flinched and gasped.  She thought of the tiny pistol riding inside her coat pocket: A fine piece of machinery marketed under the name, “A Woman’s Best Friend.”  The stranger called to her.  “Mary,” he said with a miserable, aching voice.  Did she know this man? Perhaps, but there was a simpler explanation. People of every persuasion passed by her desk every day, and her name was no secret. He might have seen her face on several occasions, and he certainly wasn’t the kind of fellow that she would have noticed in passing. Unless of course he was doing some nasty business in the back of the room—behaviors that simply weren’t allowed inside a public library.  As a precaution, Mary slipped her hand around the pistol’s grip.  “Who are you?” she asked.  “Don’t you know me?” he sputtered.  Not at all, no. Not his voice, not his face. She shook her head and rephrased her question. “What do I call you?”  “George.”  Which happened to be just about her least favorite name. With a reprimanding tone, she pointed out, “It’s wicked-cold out here, George. Don’t you think you should hurry home?”  “I lost my home,” he offered.  His coat was peculiarly tailored, but it appeared both warm and in good repair. And despite his disheveled appearance, he was too healthy and smooth-tongued to be a common drunk. “What you need to do, George . . . right now, turn around and go back to Main Street. There’s two fine relief houses down there that will take you in, without questions, and they’ll take care of you—”  “Don’t you know what night this is?” he interrupted.  She had to think for a moment. “Tuesday,” she answered.  “The date,” he insisted. “What’s the date?”  “December 24th—”  “It’s Christmas Eve,” he interrupted.  Mary sighed, and then she nodded. Pulling her empty hand out of the gun pocket, she smiled at the mysterious visitor, asking, “By any chance, George . . . is there an angel in this story of yours?”  A gust of wind could have blown the man off his feet. “You know about the angel?” he blubbered.  “Not from personal experience. But I think I know what he is, and I can make a guess or two about what he’s been up to.”  “Up to?”  She said, “George,” with a loud, dismissive tone. “I’m sorry to have to tell you this. But there’s no such thing as a genuine angel.”  “Except I saw him.”  “You saw someone. Where was he?”  “On the bridge outside town,” he offered. “He fell into the river, and I jumped in after him and dragged him to shore.”  The man was sopping wet, she noted. “But now what were you doing out on the bridge, George?”  He hesitated. “Nothing,” he replied with an ashamed, insistent tone.  “The angel jumped in, and you saved him?”  “Yes.”  That sounded absurd. “What did your angel look like, George?”  “Like an old man.”  “Then how do you know he was an angel?”  “He said he was.”  “And after you rescued him . . . what happened? Wait, no. Let me guess. Did your angel make noise about earning an aura or his halo—?”  “His wings.”  “Really? And you believed that story?”  George gulped.  “And what did this wingless man promise you, George.”  “To show me . . . ”  “What?”  “How the world would be if I’d never been born.”  She couldn’t help but laugh again. Really, this man seemed so sweet and so terribly lost. She was curious, even intrigued. Not that the stranger was her type, of course. But then again, this was a remarkable situation, and maybe if she gave him a chance . . .  “All right, George. I’m going to help you.”  He seemed cautiously thrilled to hear it.  “Come home with me,” she instructed him. And then she turned back toward the old limestone building that occupied most of a city block.  “To the library?” he sputtered.  “My apartment’s inside,” she mentioned.  “You live inside the library?”  “Because I’m the head librarian. That’s one of the benefits of my job: The city supplies me with a small home. But it’s warm and comfortable, with enough room for three cats and one man-sized bed.”  Her companion stood motionless, knee-deep in snow.  “What’s wrong now, George?”  “I don’t,” he muttered.  “You don’t what?”  “Go into the homes of young women,” he muttered.  “I’m very sorry to disappoint, but I’m not that young.” For just an instant, she considered sending him to a facility better equipped for this kind of emergency. And in countless realms, she surely did just that. But on this world, at this particular instant, she said, “You need to understand something, George. You are dead. You have just killed yourself. By jumping off a bridge, apparently. And now that that’s over with, darling, it’s high time you lived a little.”  Reverence has its patterns, its genius and predictable clichés. Many realms throw their passions into houses of worship—splendid, soothing buildings where the wide-eyed faithful can kneel together, bowing deeply while repeating prayers that were ancient when their ignorant bodies were just so many quadrillion atoms strewn across their gullible world. But if a world was blessed with true knowledge, and if there were no churches or mosques, temples or synagogues, the resident craftsmen and crafty benefactors often threw their hands and fortunes into places of learning. And that was why a small town public library wore the same flourishes and ornate marvels common to the greatest cathedrals.  George hesitated on the polished marble stairs, gazing up at the detailed mosaic above the darkened front door.  “What is this place?” he whispered.  She said, “My library,” for the last time.  George was tall enough to touch the bottom rows of cultured, brightly colored diamond tiles, first with gloves on and then bare fingers.  “Who are these people? They look like old Greeks.”  “And Persians. And Indians. And Chinese too.” She offered names that almost certainly meant nothing to him. But she had always enjoyed playing the role of expert, and when the twenty great men and women had been identified, she added, “These are the Founders.”  “Founders of what?”  “Of the Rational Order,” she replied. “The Order is responsible for twenty-three hundred years of peace and growth.”  George blinked, saying nothing.  She removed her right glove and touched the crystal door. It recognized her flesh, but only after determining that her companion was unarmed did the door slowly, majestically swing open for both of them.  “I can answer most questions,” she promised.  Like an obedient puppy, George followed after her.  Sensing her return, the library awakened. Light filled the ground floor. Slick white obelisks and gray columns stood among the colorful, rather chaotic furnishings. Chairs that would conform to any rump waited to serve. Clean, disinfected readers were stacked neatly on each black desk. Even two hours after closing, the smell of the day’s patrons hung in the air—a musky, honest odor composed of perfumes and liquor, high intentions and small dreams.  “This is a library?”  “It is,” she assured.  “But where’s the books?”  Her desk stood beside the main aisle—a wide clean and overly fancy piece of cultivated teak and gold trimmings. Her full name was prominently displayed. She picked up the reader that she had been using at day’s end, and George examined the nameplate before remarking, “You never married?”  She nearly laughed. But “No” was a truthful enough answer, and that was all she offered for now.  Again he returned to the missing books.  “But our collection is here,” she promised, compiling a list of titles from a tiny portion of the holdings. “You see, George . . . in this world, we have better ways to store books than writing on expensive old parchment.”  “Parchment?”  “Or wood pulp. Or plastic. Or flexible glass sheets.”  His eyes jumped about the screen. He would probably be able to read the words, at least taken singly. But the subject and cumulative oddness had to leave him miserably confused.  “This town isn’t a large community,” she mentioned. “But I like to think that we have a modest, thorough collection.” Mary smiled for a moment, relishing her chance to boast. “Anyone is free to walk through our door and print copy of any title in our catalog. But I’ll warn you: If we made paper books of every volume, and even if each book was small enough to place in those long hands of yours, George . . . well, this library isn’t big enough to hold our entire collection. To do that, we’d have to push these walls out a little farther than the orbit of Neptune.”  The news left the poor man numb. A few labored breaths gave him just enough strength to fix his gaze once again on the reader, and with a dry, sorry little voice, he asked, “Is this Heaven?”  “As much as any place is,” she replied.  George was sharp. Confused, but perceptive. He seemed to understand some of the implications in her explanation. With a careful voice, he read aloud, “’Endless Avenues. A thorough study of the universe as a single quantum phenomena.’”  “Your home earth,” she began. “It happens to be one of many.”  “How many?”  “Think of endless worlds. On and on and on. Imagine numbers reaching out past the stars and back again. Creation without ends, and for that matter, without any true beginning either.”  Poor George stared across the enormous room, voicing the single word, “No.”  “Every microscopic event in this world splits the universe in endless ways, George. The process is essential and it is inevitable, it happens easily and effortlessly, and nothing about existence is as lovely or perfect as this endless reinvention of reality.”  The reader made a sharp pop when he dropped it on the floor. “How do you know this?” he asked.  “Centuries of careful, unsentimental scientific exploration,” she replied.  He sighed, his long frame leaning into her desk.  “My earth is rather more advanced than yours,” she continued. “We have come to understand our universe and how to manipulate it. Everyone benefits, but the richest of us have the power to pass to our neighboring worlds and then back again.”  Once more, he said, “No.”  She touched him for the first time—a fond, reassuring pat delivered high on his back, the coat still wet from the river. “It takes special machinery and quite a lot of energy to travel through the multiverse,” she admitted. “Tying the natural laws into a useful knot . . . it’s the kind of hobby that only certain kinds of people gravitate towards.”  Poor George wanted to lie down. But he had enough poise, or at least the pride, to straighten his back before saying, “My angel.”  “Yes?”  “He was just a man?”  She laughed quietly, briefly. Then with a sharp voice, she warned, “My world embraces quite a few amazing ideas, George. But there’s no such notion as ‘just a man’. Or ‘just a woman’, for that matter. Each of us is a magnificent example of what the infinite cosmos offers.”  This particular man sighed and stared at his companion. Then with his own sharpness, he confessed, “You look just like my wife.”  “Which is one reason why your angel chose this world, I suspect.”  “And your voice is exactly the same. Except nothing that you’re telling me makes any sense.”  About that, she offered no comment.  Instead she gave him another hard pat. “There’s a private elevator in the back,” she told her new friend. “And first thing, we need to get you out of those cold clothes.”  Once his coat and shoes were removed, she set them inside the conditioning chamber to be cleaned and dried. But George insisted wearing every other article on his body, including the soaked trousers and the black socks that squished when he walked.  She stomped the snow off her tall boots and removed her coat. Then before hanging up the coat up, she slipped the little pistol from its pocket and tucked it into the silk satchel riding on her hip.  He didn’t seem to notice. For the moment, George’s attention was fixed on the single-room apartment. “I expected a little place,” he muttered.  “Isn’t this?”  “No, this is enormous.” Her ordinary furnishings seemed to impress the man, hands stroking the dyed leather and cultured wood. Artwork hung on the walls and in the open air—examples of genius pulled from a multitude of vibrant, living earths—and he gave the nearest sculptures a quick study. Then he drifted over to the antique dresser, lifting one after another of the framed portraits of her family and dearest friends.  She followed, saying nothing.  “Who are these two?” he asked.  “My parents.”  George said, “What?”  “I take it those aren’t your wife’s parents.”  “No.”  She quoted the ancient phrase, “’The same ingredients pulled from different shelves.’”  George turned to look at her, and he gave a start. His eyes dipped. He was suddenly like a young boy caught doing something wicked. It took a few moments to collect his wits.  “My DNA is probably not identical to your wife’s,” she assured. “Not base-pair for base-pair, at least.”  He wanted to look at her, but a peculiar shyness was weighing down on him.  She said, “George,” with a reprimanding tone.  He didn’t react.  “You know this body,” she pointed out. “If you are telling the truth, that is. On this other world, you married to somebody like me. Correct?”  That helped. The eyes lifted, and his courage. With more than a hint of disapproval, he said, “When I found you . . . ”  “Yes?”  “Where were you going?”  “To a pleasant little nightclub, as it happens.”  His hand and her smiling parents pointed at her now. “Dressed like that?”  “Yes.”  “You don’t have . . . ”  “What, George?”  “Underwear,” he managed. “Where is your underwear?”  Every world had its prudes. But why had that anonymous ‘angel’ send her one of the extras?  George quietly asked, “What were you going to do . . . at this club . . . ?”  “Drink a little,” she admitted. “And dance until I collapsed.”  George dropped his gaze again.  “You were married to this body,” she reminded him. “I can’t believe you didn’t know it quite well by now.”  He nodded. But then it seemed important to mention, “We have children.”  “Good.”  “Your figure . . . my wife’s . . . well, you’re quite a bit thinner than she is now . . . ”  “Than she was,” Mary said.  His eyes jumped up.  “In your old world, you are a drowned corpse,” she said. “You must have had your reasons, George. And you can tell me all about them, if you want. But I don’t care why you decided to throw yourself off that bridge. Your reasons really don’t matter to me.”  “My family . . . ” he began.  “They’ll get by, and they won’t.”  He shook his head sorrowfully.  “Every response on their part is inevitable, George. And neither of us can imagine all of the ramifications.”  “I abandoned them,” he whispered.  “And on countless other earths, you didn’t. You didn’t make the blunders that put you up on that bridge, or you pushed through your little troubles. You married a different woman. You married ten other women. Or you fell deeply in love with a handsome boy named Felix, and the two of you moved to Mars and were married on the summit of the First Sister’s volcano, and you and your soul mate quickly adopted a hundred Martian babies—little golden aliens who called both of you Pappy and built a palace for you out of frozen piss and their own worshipful blood.”  George very much wanted to collapse. But the nearest seat was the round and spacious bed.  He wouldn’t let himself approach it.  But she did. She sat on the edge and let her dress ride high, proving if he dared look that she was indeed wearing underwear after all.  “This club you were going to . . . ?”  “Yes, George?”  “What else happened there? If you don’t mind my asking.”  Jealousy sounded the same on every earth. But she did her best to deflect his emotions, laughing for a moment or two before quietly asking, “Did your Mary ever enjoy sex?”  Despite himself, George smiled.  “Well, I guess that’s something she and I have in common.”  “And you have me in common too,” he mentioned.  “Now we do, yes.”  Then this out-of-place man surprised her. He was stared at her bare knees and the breasts behind the sheer fabric. But the voice was in control, lucid and calm, when he inquired, “What about that tiny gun? The one you took out of your coat and put in your purse?”  “You saw that?”  “Yes.”  She laughed, thrilled by the unexpected.  Pulling open the satchel, she showed the weapon to her guest. “Every earth has its sterling qualities, and each has its bad features too. My home can seem a little harsh at times. Maybe you noticed the rough souls along Main Street. Crime and public drunkenness are the reasons why quite a few good citizens carry weapons wherever they go.”  “That’s terrible,” he muttered.  “I’ve never fired this gun at any person, by the way.”  “But would you?”  “Absolutely.”  “To kill?” he blubbered.  “On other earths, that’s what I am doing now. Shooting bad men and the worst women. And I’m glad to do it.”  “How can you think that?”  “Easily, George.” She passed the gun between her hands. “Remember when I told you that our richest citizens can travel from earth to earth? To a lesser degree, that freedom belongs to everyone, everywhere. It was the same on your home world too, although you didn’t understand it at the time.”  “I don’t understand it now,” he admitted.  “You are here, George. You are here because an angelic individual took the effort to duplicate you—cell for cell, experience for experience. Then your wingless benefactor set you down on a world where he believed that you would survive, or even thrive.” With her finger off the trigger, she tapped the pistol against her own temple. “Death is a matter of degree, George. This gun can’t go off, unless the twin safeties fail. But I guarantee you that right now, somebody exactly like me is shooting herself in the head. Her brains are raining all over you. Yet she doesn’t entirely die.”  “No?”  “Of course not.” She lowered the gun, nodding wistfully. “We have too many drinkers on this world, and with that comes a fairly high suicide rate. Which is only reasonable. Since we understand that anybody can escape this world at any time, just like you fled your home—leap off the bridge, hope for paradise, but remaining open-minded enough to accept a little less.”  George finally settled on edge of the bed, close enough to touch her but his hands primly folded on his long lap. “What are you telling me?” he asked. “That people kill themselves just to change worlds?”  “Is there a better reason than that?”  He thought hard about the possibilities. “This angel that saved me. He isn’t the only one, I take it.”  “They come from endless earths, some far more powerful than ours. There’s no way to count all of them.”  “And do they always save the dead?”  “Oh, they hardly ever do that,” she admitted. “It is a genuine one-in-a-trillion-trillion-trillion occurrence. But if an infinite number of Georges jump off the bridge, then even that one-in-almost-never incident is inevitable. In fact, that tiny unlikely fraction is itself an infinite number.”  He shook his head numbly.  She leaned back on her elbows. “Most of these benefactors . . . your angel, for instance . . . throw those that they’ve saved onto earths that feel comfortable with refugees like you. My world, for instance.”  “This happens often?”  “Not exactly often. But I know of half a dozen incidents this year, and that’s just in our district.”  George looked down at his cold wet socks.  “Unlike God,” she promised, “quantum magic is at work everywhere.”  “Do you understand all the science, Mary?”  She sat up again. “I’m a librarian, not a high-physics priestess.”  That pleased him. She watched his smile, and then at last she noticed that her guest was beginning to shiver.  “You’re cold, George.”  “I guess I am.”  “Take off those awful socks.”  He did as instructed. Then laughing amiably, he admitted, “There. Now you sound exactly like my wife.”  They were both laughing when something large suddenly moved beneath the big bed.  George felt the vibration, and alarmed, he stared at Mary.  “My cats,” she offered. “They’re usually shy around strangers.”  “But that felt . . . ” He lifted his bare feet. “Big.”  “Kitties,” she sang. “Sweeties.”  Three long bodies crawled into the open, stretching while eyeing the newcomer from a safe distance.  “What kinds of cats are those?” George whispered.  “Rex is the miniature cougar,” she explained. “Hex is the snow leopard. And Missie is half pygmy tiger, half griffon.”  With awe in his voice, George said, “Shit.”  “I take that to mean you didn’t have cats like this on your earth?”  “Not close to this,” he agreed.  She sat back again, sinking into the mattress.  And again, this man surprised her. “You mentioned Mars.”  “I guess I did. Why?”  “On my earth, we thought that there could be some kind of simple life on that world.”  “You didn’t know for certain?”  He shook his head. “But a few minutes ago, you mentioned something about Martians. Are they real, or did you just make them up?”  “They’re real somewhere, George.”  He frowned.  Then she laughed, explaining, “Yes, my Mars is home to some very ancient life forms. Tiny golden aliens that drink nothing but peroxides. And my Venus is covered with airborne jungles and an ocean that doesn’t boil because of the enormous air pressure. And Sisyphus is covered with beautiful forests of living ice—”  “What world’s that?”  “Between Mars and Jupiter,” she mentioned.  George blinked, took a big breath and burst out laughing.  That was when Mary told her blouse to fall open.  He stared at her, and the laughter stopped. But he was still smiling, looking shamelessly happy, begging her, “But first, Mary . . . would you please put your gun? Someplace safe. After everything I’ve been through, I don’t want even the tiniest chance of something going wrong now.” Robert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "text": "3810 words, short story\nA Woman's Best Friend\nThe gangly man was running up the street, his long legs pushing through the fresh unplowed snow. He was a stranger; or at least that was her initial impression. In ways that Mary couldn’t quite define, he acted both lost and at home. His face and manner were confused, yet he nonetheless seemed to navigate as if he recognized some portion of his surroundings. From a distance, his features seemed pleasantly anonymous, his face revealing little of itself except for a bony, perpetually boyish composition. Then a streetlamp caught him squarely, and he looked so earnest and desperate, and so sweetly silly, that she found herself laughing, however impolite that was.\nHearing the laughter, the man turned toward her, and when their eyes joined, he flinched and gasped.\nShe thought of the tiny pistol riding inside her coat pocket: A fine piece of machinery marketed under the name, “A Woman’s Best Friend.”\nThe stranger called to her.\n“Mary,” he said with a miserable, aching voice.\nDid she know this man? Perhaps, but there was a simpler explanation. People of every persuasion passed by her desk every day, and her name was no secret. He might have seen her face on several occasions, and he certainly wasn’t the kind of fellow that she would have noticed in passing. Unless of course he was doing some nasty business in the back of the room—behaviors that simply weren’t allowed inside a public library.\nAs a precaution, Mary slipped her hand around the pistol’s grip.\n“Who are you?” she asked.\n“Don’t you know me?” he sputtered.\nNot at all, no. Not his voice, not his face. She shook her head and rephrased her question. “What do I call you?”\n“George.”\nWhich happened to be just about her least favorite name. With a reprimanding tone, she pointed out, “It’s wicked-cold out here, George. Don’t you think you should hurry home?”\n“I lost my home,” he offered.\nHis coat was peculiarly tailored, but it appeared both warm and in good repair. And despite his disheveled appearance, he was too healthy and smooth-tongued to be a common drunk. “What you need to do, George . . . right now, turn around and go back to Main Street. There’s two fine relief houses down there that will take you in, without questions, and they’ll take care of you—”\n“Don’t you know what night this is?” he interrupted.\nShe had to think for a moment. “Tuesday,” she answered.\n“The date,” he insisted. “What’s the date?”\n“December 24th—”\n“It’s Christmas Eve,” he interrupted.\nMary sighed, and then she nodded. Pulling her empty hand out of the gun pocket, she smiled at the mysterious visitor, asking, “By any chance, George . . . is there an angel in this story of yours?”\nA gust of wind could have blown the man off his feet. “You know about the angel?” he blubbered.\n“Not from personal experience. But I think I know what he is, and I can make a guess or two about what he’s been up to.”\n“Up to?”\nShe said, “George,” with a loud, dismissive tone. “I’m sorry to have to tell you this. But there’s no such thing as a genuine angel.”\n“Except I saw him.”\n“You saw someone. Where was he?”\n“On the bridge outside town,” he offered. “He fell into the river, and I jumped in after him and dragged him to shore.”\nThe man was sopping wet, she noted. “But now what were you doing out on the bridge, George?”\nHe hesitated. “Nothing,” he replied with an ashamed, insistent tone.\n“The angel jumped in, and you saved him?”\n“Yes.”\nThat sounded absurd. “What did your angel look like, George?”\n“Like an old man.”\n“Then how do you know he was an angel?”\n“He said he was.”\n“And after you rescued him . . . what happened? Wait, no. Let me guess. Did your angel make noise about earning an aura or his halo—?”\n“His wings.”\n“Really? And you believed that story?”\nGeorge gulped.\n“And what did this wingless man promise you, George.”\n“To show me . . . ”\n“What?”\n“How the world would be if I’d never been born.”\nShe couldn’t help but laugh again. Really, this man seemed so sweet and so terribly lost. She was curious, even intrigued. Not that the stranger was her type, of course. But then again, this was a remarkable situation, and maybe if she gave him a chance . . .\n“All right, George. I’m going to help you.”\nHe seemed cautiously thrilled to hear it.\n“Come home with me,” she instructed him. And then she turned back toward the old limestone building that occupied most of a city block.\n“To the library?” he sputtered.\n“My apartment’s inside,” she mentioned.\n“You live inside the library?”\n“Because I’m the head librarian. That’s one of the benefits of my job: The city supplies me with a small home. But it’s warm and comfortable, with enough room for three cats and one man-sized bed.”\nHer companion stood motionless, knee-deep in snow.\n“What’s wrong now, George?”\n“I don’t,” he muttered.\n“You don’t what?”\n“Go into the homes of young women,” he muttered.\n“I’m very sorry to disappoint, but I’m not that young.” For just an instant, she considered sending him to a facility better equipped for this kind of emergency. And in countless realms, she surely did just that. But on this world, at this particular instant, she said, “You need to understand something, George. You are dead. You have just killed yourself. By jumping off a bridge, apparently. And now that that’s over with, darling, it’s high time you lived a little.”\nReverence has its patterns, its genius and predictable clichés. Many realms throw their passions into houses of worship—splendid, soothing buildings where the wide-eyed faithful can kneel together, bowing deeply while repeating prayers that were ancient when their ignorant bodies were just so many quadrillion atoms strewn across their gullible world. But if a world was blessed with true knowledge, and if there were no churches or mosques, temples or synagogues, the resident craftsmen and crafty benefactors often threw their hands and fortunes into places of learning. And that was why a small town public library wore the same flourishes and ornate marvels common to the greatest cathedrals.\nGeorge hesitated on the polished marble stairs, gazing up at the detailed mosaic above the darkened front door.\n“What is this place?” he whispered.\nShe said, “My library,” for the last time.\nGeorge was tall enough to touch the bottom rows of cultured, brightly colored diamond tiles, first with gloves on and then bare fingers.\n“Who are these people? They look like old Greeks.”\n“And Persians. And Indians. And Chinese too.” She offered names that almost certainly meant nothing to him. But she had always enjoyed playing the role of expert, and when the twenty great men and women had been identified, she added, “These are the Founders.”\n“Founders of what?”\n“Of the Rational Order,” she replied. “The Order is responsible for twenty-three hundred years of peace and growth.”\nGeorge blinked, saying nothing.\nShe removed her right glove and touched the crystal door. It recognized her flesh, but only after determining that her companion was unarmed did the door slowly, majestically swing open for both of them.\n“I can answer most questions,” she promised.\nLike an obedient puppy, George followed after her.\nSensing her return, the library awakened. Light filled the ground floor. Slick white obelisks and gray columns stood among the colorful, rather chaotic furnishings. Chairs that would conform to any rump waited to serve. Clean, disinfected readers were stacked neatly on each black desk. Even two hours after closing, the smell of the day’s patrons hung in the air—a musky, honest odor composed of perfumes and liquor, high intentions and small dreams.\n“This is a library?”\n“It is,” she assured.\n“But where’s the books?”\nHer desk stood beside the main aisle—a wide clean and overly fancy piece of cultivated teak and gold trimmings. Her full name was prominently displayed. She picked up the reader that she had been using at day’s end, and George examined the nameplate before remarking, “You never married?”\nShe nearly laughed. But “No” was a truthful enough answer, and that was all she offered for now.\nAgain he returned to the missing books.\n“But our collection is here,” she promised, compiling a list of titles from a tiny portion of the holdings. “You see, George . . . in this world, we have better ways to store books than writing on expensive old parchment.”\n“Parchment?”\n“Or wood pulp. Or plastic. Or flexible glass sheets.”\nHis eyes jumped about the screen. He would probably be able to read the words, at least taken singly. But the subject and cumulative oddness had to leave him miserably confused.\n“This town isn’t a large community,” she mentioned. “But I like to think that we have a modest, thorough collection.” Mary smiled for a moment, relishing her chance to boast. “Anyone is free to walk through our door and print copy of any title in our catalog. But I’ll warn you: If we made paper books of every volume, and even if each book was small enough to place in those long hands of yours, George . . . well, this library isn’t big enough to hold our entire collection. To do that, we’d have to push these walls out a little farther than the orbit of Neptune.”\nThe news left the poor man numb. A few labored breaths gave him just enough strength to fix his gaze once again on the reader, and with a dry, sorry little voice, he asked, “Is this Heaven?”\n“As much as any place is,” she replied.\nGeorge was sharp. Confused, but perceptive. He seemed to understand some of the implications in her explanation. With a careful voice, he read aloud, “’Endless Avenues. A thorough study of the universe as a single quantum phenomena.’”\n“Your home earth,” she began. “It happens to be one of many.”\n“How many?”\n“Think of endless worlds. On and on and on. Imagine numbers reaching out past the stars and back again. Creation without ends, and for that matter, without any true beginning either.”\nPoor George stared across the enormous room, voicing the single word, “No.”\n“Every microscopic event in this world splits the universe in endless ways, George. The process is essential and it is inevitable, it happens easily and effortlessly, and nothing about existence is as lovely or perfect as this endless reinvention of reality.”\nThe reader made a sharp pop when he dropped it on the floor. “How do you know this?” he asked.\n“Centuries of careful, unsentimental scientific exploration,” she replied.\nHe sighed, his long frame leaning into her desk.\n“My earth is rather more advanced than yours,” she continued. “We have come to understand our universe and how to manipulate it. Everyone benefits, but the richest of us have the power to pass to our neighboring worlds and then back again.”\nOnce more, he said, “No.”\nShe touched him for the first time—a fond, reassuring pat delivered high on his back, the coat still wet from the river. “It takes special machinery and quite a lot of energy to travel through the multiverse,” she admitted. “Tying the natural laws into a useful knot . . . it’s the kind of hobby that only certain kinds of people gravitate towards.”\nPoor George wanted to lie down. But he had enough poise, or at least the pride, to straighten his back before saying, “My angel.”\n“Yes?”\n“He was just a man?”\nShe laughed quietly, briefly. Then with a sharp voice, she warned, “My world embraces quite a few amazing ideas, George. But there’s no such notion as ‘just a man’. Or ‘just a woman’, for that matter. Each of us is a magnificent example of what the infinite cosmos offers.”\nThis particular man sighed and stared at his companion. Then with his own sharpness, he confessed, “You look just like my wife.”\n“Which is one reason why your angel chose this world, I suspect.”\n“And your voice is exactly the same. Except nothing that you’re telling me makes any sense.”\nAbout that, she offered no comment.\nInstead she gave him another hard pat. “There’s a private elevator in the back,” she told her new friend. “And first thing, we need to get you out of those cold clothes.”\nOnce his coat and shoes were removed, she set them inside the conditioning chamber to be cleaned and dried. But George insisted wearing every other article on his body, including the soaked trousers and the black socks that squished when he walked.\nShe stomped the snow off her tall boots and removed her coat. Then before hanging up the coat up, she slipped the little pistol from its pocket and tucked it into the silk satchel riding on her hip.\nHe didn’t seem to notice. For the moment, George’s attention was fixed on the single-room apartment. “I expected a little place,” he muttered.\n“Isn’t this?”\n“No, this is enormous.” Her ordinary furnishings seemed to impress the man, hands stroking the dyed leather and cultured wood. Artwork hung on the walls and in the open air—examples of genius pulled from a multitude of vibrant, living earths—and he gave the nearest sculptures a quick study. Then he drifted over to the antique dresser, lifting one after another of the framed portraits of her family and dearest friends.\nShe followed, saying nothing.\n“Who are these two?” he asked.\n“My parents.”\nGeorge said, “What?”\n“I take it those aren’t your wife’s parents.”\n“No.”\nShe quoted the ancient phrase, “’The same ingredients pulled from different shelves.’”\nGeorge turned to look at her, and he gave a start. His eyes dipped. He was suddenly like a young boy caught doing something wicked. It took a few moments to collect his wits.\n“My DNA is probably not identical to your wife’s,” she assured. “Not base-pair for base-pair, at least.”\nHe wanted to look at her, but a peculiar shyness was weighing down on him.\nShe said, “George,” with a reprimanding tone.\nHe didn’t react.\n“You know this body,” she pointed out. “If you are telling the truth, that is. On this other world, you married to somebody like me. Correct?”\nThat helped. The eyes lifted, and his courage. With more than a hint of disapproval, he said, “When I found you . . . ”\n“Yes?”\n“Where were you going?”\n“To a pleasant little nightclub, as it happens.”\nHis hand and her smiling parents pointed at her now. “Dressed like that?”\n“Yes.”\n“You don’t have . . . ”\n“What, George?”\n“Underwear,” he managed. “Where is your underwear?”\nEvery world had its prudes. But why had that anonymous ‘angel’ send her one of the extras?\nGeorge quietly asked, “What were you going to do . . . at this club . . . ?”\n“Drink a little,” she admitted. “And dance until I collapsed.”\nGeorge dropped his gaze again.\n“You were married to this body,” she reminded him. “I can’t believe you didn’t know it quite well by now.”\nHe nodded. But then it seemed important to mention, “We have children.”\n“Good.”\n“Your figure . . . my wife’s . . . well, you’re quite a bit thinner than she is now . . . ”\n“Than she was,” Mary said.\nHis eyes jumped up.\n“In your old world, you are a drowned corpse,” she said. “You must have had your reasons, George. And you can tell me all about them, if you want. But I don’t care why you decided to throw yourself off that bridge. Your reasons really don’t matter to me.”\n“My family . . . ” he began.\n“They’ll get by, and they won’t.”\nHe shook his head sorrowfully.\n“Every response on their part is inevitable, George. And neither of us can imagine all of the ramifications.”\n“I abandoned them,” he whispered.\n“And on countless other earths, you didn’t. You didn’t make the blunders that put you up on that bridge, or you pushed through your little troubles. You married a different woman. You married ten other women. Or you fell deeply in love with a handsome boy named Felix, and the two of you moved to Mars and were married on the summit of the First Sister’s volcano, and you and your soul mate quickly adopted a hundred Martian babies—little golden aliens who called both of you Pappy and built a palace for you out of frozen piss and their own worshipful blood.”\nGeorge very much wanted to collapse. But the nearest seat was the round and spacious bed.\nHe wouldn’t let himself approach it.\nBut she did. She sat on the edge and let her dress ride high, proving if he dared look that she was indeed wearing underwear after all.\n“This club you were going to . . . ?”\n“Yes, George?”\n“What else happened there? If you don’t mind my asking.”\nJealousy sounded the same on every earth. But she did her best to deflect his emotions, laughing for a moment or two before quietly asking, “Did your Mary ever enjoy sex?”\nDespite himself, George smiled.\n“Well, I guess that’s something she and I have in common.”\n“And you have me in common too,” he mentioned.\n“Now we do, yes.”\nThen this out-of-place man surprised her. He was stared at her bare knees and the breasts behind the sheer fabric. But the voice was in control, lucid and calm, when he inquired, “What about that tiny gun? The one you took out of your coat and put in your purse?”\n“You saw that?”\n“Yes.”\nShe laughed, thrilled by the unexpected.\nPulling open the satchel, she showed the weapon to her guest. “Every earth has its sterling qualities, and each has its bad features too. My home can seem a little harsh at times. Maybe you noticed the rough souls along Main Street. Crime and public drunkenness are the reasons why quite a few good citizens carry weapons wherever they go.”\n“That’s terrible,” he muttered.\n“I’ve never fired this gun at any person, by the way.”\n“But would you?”\n“Absolutely.”\n“To kill?” he blubbered.\n“On other earths, that’s what I am doing now. Shooting bad men and the worst women. And I’m glad to do it.”\n“How can you think that?”\n“Easily, George.” She passed the gun between her hands. “Remember when I told you that our richest citizens can travel from earth to earth? To a lesser degree, that freedom belongs to everyone, everywhere. It was the same on your home world too, although you didn’t understand it at the time.”\n“I don’t understand it now,” he admitted.\n“You are here, George. You are here because an angelic individual took the effort to duplicate you—cell for cell, experience for experience. Then your wingless benefactor set you down on a world where he believed that you would survive, or even thrive.” With her finger off the trigger, she tapped the pistol against her own temple. “Death is a matter of degree, George. This gun can’t go off, unless the twin safeties fail. But I guarantee you that right now, somebody exactly like me is shooting herself in the head. Her brains are raining all over you. Yet she doesn’t entirely die.”\n“No?”\n“Of course not.” She lowered the gun, nodding wistfully. “We have too many drinkers on this world, and with that comes a fairly high suicide rate. Which is only reasonable. Since we understand that anybody can escape this world at any time, just like you fled your home—leap off the bridge, hope for paradise, but remaining open-minded enough to accept a little less.”\nGeorge finally settled on edge of the bed, close enough to touch her but his hands primly folded on his long lap. “What are you telling me?” he asked. “That people kill themselves just to change worlds?”\n“Is there a better reason than that?”\nHe thought hard about the possibilities. “This angel that saved me. He isn’t the only one, I take it.”\n“They come from endless earths, some far more powerful than ours. There’s no way to count all of them.”\n“And do they always save the dead?”\n“Oh, they hardly ever do that,” she admitted. “It is a genuine one-in-a-trillion-trillion-trillion occurrence. But if an infinite number of Georges jump off the bridge, then even that one-in-almost-never incident is inevitable. In fact, that tiny unlikely fraction is itself an infinite number.”\nHe shook his head numbly.\nShe leaned back on her elbows. “Most of these benefactors . . . your angel, for instance . . . throw those that they’ve saved onto earths that feel comfortable with refugees like you. My world, for instance.”\n“This happens often?”\n“Not exactly often. But I know of half a dozen incidents this year, and that’s just in our district.”\nGeorge looked down at his cold wet socks.\n“Unlike God,” she promised, “quantum magic is at work everywhere.”\n“Do you understand all the science, Mary?”\nShe sat up again. “I’m a librarian, not a high-physics priestess.”\nThat pleased him. She watched his smile, and then at last she noticed that her guest was beginning to shiver.\n“You’re cold, George.”\n“I guess I am.”\n“Take off those awful socks.”\nHe did as instructed. Then laughing amiably, he admitted, “There. Now you sound exactly like my wife.”\nThey were both laughing when something large suddenly moved beneath the big bed.\nGeorge felt the vibration, and alarmed, he stared at Mary.\n“My cats,” she offered. “They’re usually shy around strangers.”\n“But that felt . . . ” He lifted his bare feet. “Big.”\n“Kitties,” she sang. “Sweeties.”\nThree long bodies crawled into the open, stretching while eyeing the newcomer from a safe distance.\n“What kinds of cats are those?” George whispered.\n“Rex is the miniature cougar,” she explained. “Hex is the snow leopard. And Missie is half pygmy tiger, half griffon.”\nWith awe in his voice, George said, “Shit.”\n“I take that to mean you didn’t have cats like this on your earth?”\n“Not close to this,” he agreed.\nShe sat back again, sinking into the mattress.\nAnd again, this man surprised her. “You mentioned Mars.”\n“I guess I did. Why?”\n“On my earth, we thought that there could be some kind of simple life on that world.”\n“You didn’t know for certain?”\nHe shook his head. “But a few minutes ago, you mentioned something about Martians. Are they real, or did you just make them up?”\n“They’re real somewhere, George.”\nHe frowned.\nThen she laughed, explaining, “Yes, my Mars is home to some very ancient life forms. Tiny golden aliens that drink nothing but peroxides. And my Venus is covered with airborne jungles and an ocean that doesn’t boil because of the enormous air pressure. And Sisyphus is covered with beautiful forests of living ice—”\n“What world’s that?”\n“Between Mars and Jupiter,” she mentioned.\nGeorge blinked, took a big breath and burst out laughing.\nThat was when Mary told her blouse to fall open.\nHe stared at her, and the laughter stopped. But he was still smiling, looking shamelessly happy, begging her, “But first, Mary . . . would you please put your gun? Someplace safe. After everything I’ve been through, I don’t want even the tiniest chance of something going wrong now.”\nRobert Reed is the author of nearly three hundred published stories, plus more than a dozen novels. He is best known for his Great Ship stories, including The Memory of Sky. And for the novella, \"A Billion Eves,\" which won the Hugo Award in 2007. He lives in Lincoln, Nebraska with his wife and daughter.", "source": "https://clarkesworldmagazine.com/reed_12_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Woman's Best Friend by Robert Reed"}