{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jason Heller", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "p/L/lANw+TLF8GywhWjHJVIyY1k=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Strange Stars  Science fiction and fantasy took up residence in me at an early age, and so did music. I grew up in the ’70s and ’80s, when pop culture had yet to divide itself into the billion tiny boxes you see today. It was a free-for-all, a game of mix-and-match, or at least it felt that way to me at the time. Being from a disadvantaged family, I didn’t have full access to all the pop culture I craved; my family couldn’t afford cable TV or a VCR or big collections of media. But I did possess two of the most potent resources a poor kid in the ’70s and ’80s could have: the public library and the radio.  It was a time when SFF and music were locked in a passionate embrace. I’d go to the small library in Port Charlotte, Florida, at least twice a week, where I’d load up my backpack with books culled from the science fiction section. (Now as then, “science fiction” was often shorthand for science fiction plus fantasy plus horror plus any other mode of storytelling that tested the membrane of reality.) Once home with my latest haul, I’d go to my room, crack open those crinkly, laminated hardcovers, and click on the thrift-store clock radio that sufficed as my stereo.  We’re talking 1983 or thereabouts. Music oozed out of the books. Science fiction seeped out of the radio. Amid all the authors whose worlds I tumbled into at the time—Frank Herbert, Fred Saberhagen, Roger Zelazny, Gordon R. Dickson, David Eddings, to name just a few—I discovered books that featured music as a main component.  In Anne McCaffrey’s Dragonsong, a teenage girl refuses to let her love of music be muffled by the close-minded society in which she lives. In John Varley’s Gaea Trilogy (Titan, Wizard, and Demon), a centaur-like race of aliens called Titanides speak a music-based language, use musical modes (Aeolian, Phrygian, Mixyloydian, etc.) as their middle names, and call their families “chords.” And in Alan Dean Foster’s Spellsinger, a young, aimless guitarist must harness the magic in his music to save the fantastical world in which he’s found himself.  Although the lighthearted Spellsinger wasn’t the deepest book I was reading at the time, it hit closest to home. Its hero, Jonathan Thomas Meriweather (or Jon-Tom for short), doesn’t hale from some far-off world or time. He’s a rock musician, from here and now—or rather, from there and then—the kind of post-hippie drifter that made up my mom’s social circle in the ’70s and ’80s. To summon magic, he’d whip out his magical ax, a guitar-like instrument called a duar, and shred some Hendrix riffs.  To me, rock music was a potent complement to magic. The mythology of rock took up prime real estate in my psyche, right next to Zelazny’s Amber or Herbert’s Arrakis. In the early ’80s, David Bowie’s “Ashes to Ashes” resurrected his doomed astronaut Major Tom, the main character from his 1969 song “Space Oddity”—a song that was still very much in rotation on the radio when I was a kid. In 1983, a different artist, Peter Schilling, put a synth-pop spin on Bowie’s mythos was with his hit single “Major Tom,” which was basically fanfic in song form—the sleekest, slickest filk yet devised. From Styx’s “Mr. Roboto” to Gary Numan’s “Cars” to Devo’s “Whip It,” my clunky little one-speaker clock radio became a wormhole that opened up into the future.  Or what I imagined the future might look like, far away from the drab, muggy doldrums of southern Florida.  That sense of convergence between SFF and music has never left me. As I got older and became absorbed by the work of Michael Moorcock, I learned of his intimate involvement with the groups Blue Öyster Cult and Hawkwind, to the point where he actually wrote lyrics for them (as did John Shirley, in the case of BÖC). Parliament-Funkadelic’s music transfixed me with its hallucinatory, Afrofuturist spectacle.  Emma Bull’s War for the Oaks reimagined the Minneapolis music scene as a place where supernatural battles take place on the stages of rock concerts, pioneering urban fantasy in the process. Iron Maiden infused their operatic heavy metal with soaring fantasy, speculation, and myth.  And throughout her many novels and short stories, Elizabeth Hand fabricates bands of all genres and scatters them, creating a gradually unfolding alternate history of popular music. The list goes on and on. A conversation was being had between SFF and music, one that stretches back decades. The more I eavesdropped on it, the more I wanted to participate.  If you’ve read Clarkesworld lately, you may have noticed that I’ve been obsessing a bit about the crossover between music and SFF. Over the past year I’ve written essays on Hawkwind, on Poly Styrene of the punk band X-Ray Spex, and on Marc Bolan of the legendary glam act T. Rex—all of which focus on those artists’ visions of SFF, as heard in their music—not to mention an extensive piece about the late David Bowie and his love of SFF that I wrote for Pitchfork. That’s only the tip of the iceberg; there are dozens, hundreds, of musicians and bands to be written about, each with a unique connection to SFF.  From where I stand as both a music journalist and an author/reviewer of SFF, we’re in a bit of a golden age of SFF music, second only to that ’70s/’80s heyday. Recording artists of all genres such as Janelle Monáe, Vernian Process, Grimes, Pictureplane, Bal-Sagoth, and Blind Guardian are keeping the flame alive by deftly weaving SFF into their music, and they’re not alone.  In 2013, David Bowie was inducted into the Science Fiction and Fantasy Hall of Fame, the first musician to be granted that honor. It had been 44 years since the release of “Space Oddity,” which crystallized the alchemy between science fiction and popular music. A few weeks after Bowie’s death earlier this year, Paul Kantner of Jefferson Airplane died; his 1970 solo record Blows Against the Empire, a science fiction concept album partly inspired by Robert A. Heinlein’s Methuselah’s Children (with Heinlein’s blessing), became the first and only rock album nominated for a Hugo Award in the Best Dramatic Presentation category.  The recognition of SFF music still has a long way to go—but thankfully, recognition isn’t what fuels most of the writers and musicians who continue to carve out the liminal space between SFF and music. Or those of us who grew up with their nose in fantasy novels and their ears glued to science fiction songs on the radio. Pop culture gave us rock stars; SFF gave us strange stars. Jason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "text": "Non-Fiction\nAnother Word: Strange Stars\nScience fiction and fantasy took up residence in me at an early age, and so did music. I grew up in the ’70s and ’80s, when pop culture had yet to divide itself into the billion tiny boxes you see today. It was a free-for-all, a game of mix-and-match, or at least it felt that way to me at the time. Being from a disadvantaged family, I didn’t have full access to all the pop culture I craved; my family couldn’t afford cable TV or a VCR or big collections of media. But I did possess two of the most potent resources a poor kid in the ’70s and ’80s could have: the public library and the radio.\nIt was a time when SFF and music were locked in a passionate embrace. I’d go to the small library in Port Charlotte, Florida, at least twice a week, where I’d load up my backpack with books culled from the science fiction section. (Now as then, “science fiction” was often shorthand for science fiction plus fantasy plus horror plus any other mode of storytelling that tested the membrane of reality.) Once home with my latest haul, I’d go to my room, crack open those crinkly, laminated hardcovers, and click on the thrift-store clock radio that sufficed as my stereo.\nWe’re talking 1983 or thereabouts. Music oozed out of the books. Science fiction seeped out of the radio. Amid all the authors whose worlds I tumbled into at the time—Frank Herbert, Fred Saberhagen, Roger Zelazny, Gordon R. Dickson, David Eddings, to name just a few—I discovered books that featured music as a main component.\nIn Anne McCaffrey’s Dragonsong, a teenage girl refuses to let her love of music be muffled by the close-minded society in which she lives. In John Varley’s Gaea Trilogy (Titan, Wizard, and Demon), a centaur-like race of aliens called Titanides speak a music-based language, use musical modes (Aeolian, Phrygian, Mixyloydian, etc.) as their middle names, and call their families “chords.” And in Alan Dean Foster’s Spellsinger, a young, aimless guitarist must harness the magic in his music to save the fantastical world in which he’s found himself.\nAlthough the lighthearted Spellsinger wasn’t the deepest book I was reading at the time, it hit closest to home. Its hero, Jonathan Thomas Meriweather (or Jon-Tom for short), doesn’t hale from some far-off world or time. He’s a rock musician, from here and now—or rather, from there and then—the kind of post-hippie drifter that made up my mom’s social circle in the ’70s and ’80s. To summon magic, he’d whip out his magical ax, a guitar-like instrument called a duar, and shred some Hendrix riffs.\nTo me, rock music was a potent complement to magic. The mythology of rock took up prime real estate in my psyche, right next to Zelazny’s Amber or Herbert’s Arrakis. In the early ’80s, David Bowie’s “Ashes to Ashes” resurrected his doomed astronaut Major Tom, the main character from his 1969 song “Space Oddity”—a song that was still very much in rotation on the radio when I was a kid. In 1983, a different artist, Peter Schilling, put a synth-pop spin on Bowie’s mythos was with his hit single “Major Tom,” which was basically fanfic in song form—the sleekest, slickest filk yet devised. From Styx’s “Mr. Roboto” to Gary Numan’s “Cars” to Devo’s “Whip It,” my clunky little one-speaker clock radio became a wormhole that opened up into the future.\nOr what I imagined the future might look like, far away from the drab, muggy doldrums of southern Florida.\nThat sense of convergence between SFF and music has never left me. As I got older and became absorbed by the work of Michael Moorcock, I learned of his intimate involvement with the groups Blue Öyster Cult and Hawkwind, to the point where he actually wrote lyrics for them (as did John Shirley, in the case of BÖC). Parliament-Funkadelic’s music transfixed me with its hallucinatory, Afrofuturist spectacle.\nEmma Bull’s War for the Oaks reimagined the Minneapolis music scene as a place where supernatural battles take place on the stages of rock concerts, pioneering urban fantasy in the process. Iron Maiden infused their operatic heavy metal with soaring fantasy, speculation, and myth.\nAnd throughout her many novels and short stories, Elizabeth Hand fabricates bands of all genres and scatters them, creating a gradually unfolding alternate history of popular music. The list goes on and on. A conversation was being had between SFF and music, one that stretches back decades. The more I eavesdropped on it, the more I wanted to participate.\nIf you’ve read Clarkesworld lately, you may have noticed that I’ve been obsessing a bit about the crossover between music and SFF. Over the past year I’ve written essays on Hawkwind, on Poly Styrene of the punk band X-Ray Spex, and on Marc Bolan of the legendary glam act T. Rex—all of which focus on those artists’ visions of SFF, as heard in their music—not to mention an extensive piece about the late David Bowie and his love of SFF that I wrote for Pitchfork. That’s only the tip of the iceberg; there are dozens, hundreds, of musicians and bands to be written about, each with a unique connection to SFF.\nFrom where I stand as both a music journalist and an author/reviewer of SFF, we’re in a bit of a golden age of SFF music, second only to that ’70s/’80s heyday. Recording artists of all genres such as Janelle Monáe, Vernian Process, Grimes, Pictureplane, Bal-Sagoth, and Blind Guardian are keeping the flame alive by deftly weaving SFF into their music, and they’re not alone.\nIn 2013, David Bowie was inducted into the Science Fiction and Fantasy Hall of Fame, the first musician to be granted that honor. It had been 44 years since the release of “Space Oddity,” which crystallized the alchemy between science fiction and popular music. A few weeks after Bowie’s death earlier this year, Paul Kantner of Jefferson Airplane died; his 1970 solo record Blows Against the Empire, a science fiction concept album partly inspired by Robert A. Heinlein’s Methuselah’s Children (with Heinlein’s blessing), became the first and only rock album nominated for a Hugo Award in the Best Dramatic Presentation category.\nThe recognition of SFF music still has a long way to go—but thankfully, recognition isn’t what fuels most of the writers and musicians who continue to carve out the liminal space between SFF and music. Or those of us who grew up with their nose in fantasy novels and their ears glued to science fiction songs on the radio. Pop culture gave us rock stars; SFF gave us strange stars.\nJason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "source": "https://clarkesworldmagazine.com/another_word_05_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Strange Stars by Jason Heller"}