{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "hp9aZsN8BZ9sfl20xOB8Az6L6rY=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Faulty Memories of a Time Long Past: A Conversation with Richard Ellis Preston, Jr.  The main character of Romulus Buckle & the City of the Founders is a gasbag gremlin, a balloon goose, and an air dog. Cap’n Buckle and his crew live in a post-apocalyptic world of devastation, steam power, and snow—constant snow.  Indeed, Richard Ellis Preston’s debut novel is powered by “red hot furnaces and boilers,” sizzling and hissing with swashbuckling adventure and extremely compelling world-building.  “A decision one must make in sci-fi world building is how accurate one is going to make the science,” said Preston. “Are you a Vernian (Jules Verne: hard science only, please) or are you a Wellsian (H. G. Wells: it’s a fancy time machine and it looks like it works—end of explanation—now, shall we go tangle with the Morlocks?) My Chronicles of the Pneumatic Zeppelin series lands squarely in the Wellsian camp.”  Why did Preston opt for the Wellsian approach?  “Firstly, I am a decent historian but a weak scientist,” said Preston. “Secondly, the zeppelin I wanted to have, one loaded with steam boilers and cannons and all sorts of fantastical metal contraptions surrounded by bags of flammable hydrogen, could never fly in reality. It would never get off of the ground.”  Preston was deeply engrossed in a WWII novel set in Russia when a friend introduced him to steampunk. He took a break from that weighty project, seeking a bit of fun and a certain degree of creative freedom.  “The steampunk subgenre can embrace elements of fantasy,” said Preston of his technically unrealistic airship, “so this is not a big problem as long as you make your world function within its own set of rules and stick to those rules—steampunk readers are ready and willing to suspend their disbelief in order to experience the story—but you had better damn well deliver the story.”  And deliver, it does.  Below, Preston and I talk about writing in general, The Chronicles of the Pneumatic Zeppelin in particular, and his work with his development editor at 47North, Jeff VanderMeer.   Where'd you start with Romulus Buckle & the City of the Founders?  I’d have to say I started with the sense that I wanted to do something big and epic and fun. It was a reaction to another project I have slowly been working on for the last eight years; that project is a trilogy set in WW2 Russia, with an expansive canvas and many characters, heavily researched, sunk deep inside a terrible period of human history. I traveled to Russia in 2007 to visit battlefields and interviewed surviving veterans in Moscow. The first book is nearly done, but the whole project was beginning to weigh me down—I love it dearly, but it was becoming my albatross. I decided to take a six month break from the Russia monster and write something different, something full of swashbuckling and empire—an excuse to immerse myself in the realm of the great adventure novels and movies, which I love. I wanted to do a sort of Saturday afternoon movie serial, something akin to Captain Blood, The Adventures of Robin Hood, Indiana Jones, Hornblower, Star Trek and King Solomon’s Mines.  I knew that I wanted the story to focus on a captain and his crew in a time of war, and I knew that I wanted strong female characters. But it was difficult to find a time and place that worked for the nebulous sense of what I wanted. For various reasons, all the periods of history and settings I considered—an 18th century warship, a WW2 submarine, a space ship—failed me. Then a friend of mine introduced me to steampunk and I immediately found the perfect environment for my story—a zeppelin crew in Victorian-inspired garb roaming a post-apocalyptic earth, complete with zebra-striped aliens—and everything took off from there.  Which of the characters is most like you and which is least like you?  That is a difficult question. Initially, I am going to dodge it by saying the obvious, by saying that I believe all of the main characters represent a part of me, as the author, in some way or another. The series rides on the backs of three core characters: Captain Buckle and his two female lieutenants, Sabrina and Max (an alien-human mix). But these characters are larger-than-life and heroic, which I am not. They struggle with titanic obsessions and needs and failures, and mine are smaller and less consuming (although I do have a lot of check marks in the ‘failures’ category).  And while Sabrina and Max are women, I am comfortable climbing into their heads and writing from a female perspective—I quite enjoy it—I simply relate to them as human beings (in Max’s case, a half-human being). Females are certainly capable of surprising and mystifying me but since I have been surrounded by women all of my life I feel like I have a decent appreciation of their way of interpreting the world. Of course, I could be completely deluded about that.  I have no idea which character is the least like me—but I have so much fun writing the bad guys it probably isn’t them.  In the final self-analysis, if forced to choose, I would say Romulus Buckle is the most like me (at least, the most like what I would want to be), because I have always wanted to be Indiana Jones.  What were some of the surprises and changes along the way?  Every new manuscript surprises its author over and over again, and the Romulus Buckle series (I have written the first two books) has been no exception. World-building, once in full swing, applies its own logic on you in reverse, (without pity, I might add) forcing you to abandon story elements which no longer fit in its expanding and ever-more-rigid environment. As characters flesh out and start speaking to you, rather than you speaking for them, they take on their own attitudes and priorities; choices you originally made for them suddenly ring hollow and insincere, and you have to rethink their story-driving motivations because your initial applications no longer fit the person who is emerging before your eyes.  One of the biggest surprises waiting for me was structural. I had never written this kind of episodic series before, and while I have worked out the major character and story arcs for the entire span of the series, it is difficult to predict exactly when and where certain things might happen (and I don’t want to lock myself into a preplanned structure too tightly, because it all balls up and changes anyway) or how many pages it will take to accomplish what I want to do.  When I was 500 pages into book two, Romulus Buckle and the Engines of War (I have to do a lot of editing after my first drafts) I realized that the conclusion of Part II was the end of the that book, and what I had planned for Part III was actually a full book in itself, hence becoming book three. All of a sudden, I had an extra book in the series. It will be interesting to see, as the series progresses, how accurate my original estimation of the number of books will prove to be. I now fully expect to discover that one of my later book ideas shall waffle too thin, story-wise, and I will end up merging two book ideas into one. Whatever works, works.  What should a sentence do? A paragraph? A chapter? A novel?  That is a great question to ask a writer, and one much discussed by brilliant people in endless books on writing and how to write. I’ll give it my best shot here and, with your permission I would like to tackle it from back to front. A fiction novel should entertain. When I, and most people, I think, pick up a work of fiction, they expect to be transported into another world and be engaged, to see and feel what the characters see and feel, whether the character is a Kansas doormouse or the Commodore of the Space Fleet of Orion. Many books have done this for me, and some have failed me. The failures were either bad books or fine books where the author’s method of communication simply did not jive with the way I absorb information. Faulkner is difficult for me to stick with, whereas I honestly feel like Michael Ondaatje dreams exactly the same way I do. Novels are art like painting is art, and who likes every canvas they see in a gallery? I hate the idea of my book not “clicking” for a reader who has selected my novel and wants to enjoy the journey, but I know it will happen.  What should a chapter do? Obviously, if the writer slices his or her book up into chapters, it allows more effective communication of the overall story. Life has breaks in it, and the end of the chapter signals to the reader that the story is coming to a natural break (or cliffhanger, which is a kind of break) and allows them to pause and reflect on what has happened so far. I decided to dice my Romulus Buckle books up into a lot of small chapters (I remembered Kurt Vonnegut using a similar short-chapter method in Cat’s Cradle, to great effect) for several reasons: the spinning revolver cylinder of rotating character perspectives allows me to leap back and forth between points of view in the same situations (helpful in a high-action novel) and these are adventure books—the many chapter headings are integral parts of the lighter, faster-moving story.  The paragraph, to me, is a moment. It can be one word or five hundred, but it tends to encapsulate one action or one string of thought. Paragraphs are easy—it is the sentences that are hard.  Sentences are harder than everything else combined, harder than finding the right word. All writers have done the exercise where you take a famous sentence and rearrange the words and the magic of the whole thing collapses. A sentence has to feel right, and sometimes the success of the sentence escapes explanation, logic and grammar rules. I know when a sentence is working and when it is not, and it can be agony coming back to a sentence again and again and failing to find the perfect construction you know exists, but escapes you. A good sentence is fine, but you want to achieve as many great ones as you can. I am not a great grammarian and that is embarrassing, because it is one of the tools of my trade; grammar is something I must constantly be aware of and work on. My favorite book on the subject of the sentence is How To Write a Sentence (and How To Read One) by Stanley Fish.  Can you talk a little bit about the process of building the world of The Chronicles of the Pneumatic Zeppelin?  World building is both an incredible and terrifying experience. There are so many ways you can box yourself in, especially with a series. I had done it once before, with a fantasy realm for a book that may never see the light of day, but the Snow World of the Pneumatic Zeppelin series required a much broader scope. I had a good grasp of my steampunk-themed story, main characters and the zeppelin right off the bat, so my world-building began in large strokes across the background canvas. I wanted the backdrop to be a world about to fall into war, a world of clans (nations) competing for resources with their ambassadors scrambling to secure alliances against the impending conflict. I used the political situation in Western Europe just before the outbreak of the Great War as a template (very, very loosely) for the unstable geopolitical environment in my Snow World. Once I had the major political players and their strengths/weaknesses/relationships set, I could weave the lives of my characters through that intricate web and formulate their loyalties, partnerships, hatreds and betrayals. The whole process was nowhere near as clean and crisp as that, but I think this is a good overview.  The events driving the series were largely set into motion by the actions of the previous generation, so I had to know who everyone in that generation was; I had to know those characters as well as the ones who actually appear in the books. I worked out detailed family genealogies and clan histories, largely because I feared that if I did not, I would trip myself up later. I know exactly who the original Founders are and how they and their descendants built the world which my characters are living in.  My earth was destroyed three hundred years ago by the “Martians” (no one knows where the aliens came from, so that name just stuck) and humanity was almost completely wiped out. The survivors rallied in a dangerous, highly-competitive, post-apocalyptic world, and since most historic documents had been lost, the new civilization, the new Victorian-inspired society, was engineered from faulty memories of a time long past. I worked out every aspect of the environment as best I could so I had all the major underpinnings cemented in my head before I got too far into the early drafts of the books. Lots of detail can wait until we meet a clan or a character, but I have to know how they perceive each other from the very beginning, and why. I am actually surprised at how little of this background actually makes a direct appearance in book one, City of the Founders, which is primarily a rescue mission story, but it does fuel a lot of the undercurrents beneath the scenes. Book one is sort of hermetically sealed because we spend most of our time aboard the zeppelin or racing through a prison warren. Book two, Engines of War, involves many clans meeting to form a hasty alliance and it opens up much more of the Snow World.  One thing that caught me off guard as I plunged into my series was how much information I had to keep track of. Crew lists, KIAs, replacements, family relationships, names of zeppelins and who built them, ambassadors, outposts, menus, uniforms, flags, colors, character descriptions, blueprints, cannon types, muzzle velocities, airspeed and on and on. I didn’t realize how quickly one might become uncertain of the eye color of a character after a week away from her. I assembled a huge story bible so I have all of that information in one place rather than spending a lot of time searching through pages of finished work trying to confirm the type of metal on someone’s watch or the mannerisms they possess. I wish I had a better memory.  How did it go working with Jeff VanderMeer?  Well, I am a Jeff VanderMeer fan now, so my answer is not objective. He is a really neat person. He is a great development editor and he helped me measure out the difficult balance of introductory elements in the first book and the pacing of the story in both books, among other things. He is of course an extremely accomplished writer, and I was thrilled when 47North brought him in to work with me on my first two books. He has a great sense of humor and I enjoyed working with him in the development process, which is of course painful for a writer on many levels—and it is a pain Jeff well understands and sympathizes with, so while he did apply the knife where it was needed, he did so gently. We even cooked up something of a friendship between our emails because we are both kind of silly, and I think that helped us be honest with each other during a process where he has to suggest gutting or Rubik’s-cubing my work in various ways (not that it does not need it, mind you) and I have to be tough enough to consider his suggestions with a stiff upper lip. I quickly learned to trust Jeff’s instincts: everything he brought to the table made the book better.  Lastly, what is it about airships that're just so cool?  Yes, über cool! They are one of those gigantic, mysterious machines that capture the imagination, and like the Titanic, they possess a tragic history. Most people are familiar with the Hindenburg and probably could not name another airship. Like the Titanic, the Hindenburg had a spectacular demise (the Hindenburg’s famously caught on film—“oh, the humanity!”) I think that the airship is akin to a great sailing ship and, in the tradition of the Golden Hind and the Victory, it captures the imagination in the same way—with the exception that the airship is an industrial-era machine, a product of the industrial revolution, and carries with it the conceit of man’s assumed triumph over nature. Very few people have ridden in an airship—I haven’t—and so it remains exotic to the average person, even today, in a way that airplane travel has not. Because of all of these aspects, it is easy to place a zeppelin in a world of air pirates or sky fleets because it simply “fits.”  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nFaulty Memories of a Time Long Past: A Conversation with Richard Ellis Preston, Jr.\nThe main character of Romulus Buckle & the City of the Founders is a gasbag gremlin, a balloon goose, and an air dog. Cap’n Buckle and his crew live in a post-apocalyptic world of devastation, steam power, and snow—constant snow.\nIndeed, Richard Ellis Preston’s debut novel is powered by “red hot furnaces and boilers,” sizzling and hissing with swashbuckling adventure and extremely compelling world-building.\n“A decision one must make in sci-fi world building is how accurate one is going to make the science,” said Preston. “Are you a Vernian (Jules Verne: hard science only, please) or are you a Wellsian (H. G. Wells: it’s a fancy time machine and it looks like it works—end of explanation—now, shall we go tangle with the Morlocks?) My Chronicles of the Pneumatic Zeppelin series lands squarely in the Wellsian camp.”\nWhy did Preston opt for the Wellsian approach?\n“Firstly, I am a decent historian but a weak scientist,” said Preston. “Secondly, the zeppelin I wanted to have, one loaded with steam boilers and cannons and all sorts of fantastical metal contraptions surrounded by bags of flammable hydrogen, could never fly in reality. It would never get off of the ground.”\nPreston was deeply engrossed in a WWII novel set in Russia when a friend introduced him to steampunk. He took a break from that weighty project, seeking a bit of fun and a certain degree of creative freedom.\n“The steampunk subgenre can embrace elements of fantasy,” said Preston of his technically unrealistic airship, “so this is not a big problem as long as you make your world function within its own set of rules and stick to those rules—steampunk readers are ready and willing to suspend their disbelief in order to experience the story—but you had better damn well deliver the story.”\nAnd deliver, it does.\nBelow, Preston and I talk about writing in general, The Chronicles of the Pneumatic Zeppelin in particular, and his work with his development editor at 47North, Jeff VanderMeer.\nWhere'd you start with Romulus Buckle & the City of the Founders?\nI’d have to say I started with the sense that I wanted to do something big and epic and fun. It was a reaction to another project I have slowly been working on for the last eight years; that project is a trilogy set in WW2 Russia, with an expansive canvas and many characters, heavily researched, sunk deep inside a terrible period of human history. I traveled to Russia in 2007 to visit battlefields and interviewed surviving veterans in Moscow. The first book is nearly done, but the whole project was beginning to weigh me down—I love it dearly, but it was becoming my albatross. I decided to take a six month break from the Russia monster and write something different, something full of swashbuckling and empire—an excuse to immerse myself in the realm of the great adventure novels and movies, which I love. I wanted to do a sort of Saturday afternoon movie serial, something akin to Captain Blood, The Adventures of Robin Hood, Indiana Jones, Hornblower, Star Trek and King Solomon’s Mines.\nI knew that I wanted the story to focus on a captain and his crew in a time of war, and I knew that I wanted strong female characters. But it was difficult to find a time and place that worked for the nebulous sense of what I wanted. For various reasons, all the periods of history and settings I considered—an 18th century warship, a WW2 submarine, a space ship—failed me. Then a friend of mine introduced me to steampunk and I immediately found the perfect environment for my story—a zeppelin crew in Victorian-inspired garb roaming a post-apocalyptic earth, complete with zebra-striped aliens—and everything took off from there.\nWhich of the characters is most like you and which is least like you?\nThat is a difficult question. Initially, I am going to dodge it by saying the obvious, by saying that I believe all of the main characters represent a part of me, as the author, in some way or another. The series rides on the backs of three core characters: Captain Buckle and his two female lieutenants, Sabrina and Max (an alien-human mix). But these characters are larger-than-life and heroic, which I am not. They struggle with titanic obsessions and needs and failures, and mine are smaller and less consuming (although I do have a lot of check marks in the ‘failures’ category).\nAnd while Sabrina and Max are women, I am comfortable climbing into their heads and writing from a female perspective—I quite enjoy it—I simply relate to them as human beings (in Max’s case, a half-human being). Females are certainly capable of surprising and mystifying me but since I have been surrounded by women all of my life I feel like I have a decent appreciation of their way of interpreting the world. Of course, I could be completely deluded about that.\nI have no idea which character is the least like me—but I have so much fun writing the bad guys it probably isn’t them.\nIn the final self-analysis, if forced to choose, I would say Romulus Buckle is the most like me (at least, the most like what I would want to be), because I have always wanted to be Indiana Jones.\nWhat were some of the surprises and changes along the way?\nEvery new manuscript surprises its author over and over again, and the Romulus Buckle series (I have written the first two books) has been no exception. World-building, once in full swing, applies its own logic on you in reverse, (without pity, I might add) forcing you to abandon story elements which no longer fit in its expanding and ever-more-rigid environment. As characters flesh out and start speaking to you, rather than you speaking for them, they take on their own attitudes and priorities; choices you originally made for them suddenly ring hollow and insincere, and you have to rethink their story-driving motivations because your initial applications no longer fit the person who is emerging before your eyes.\nOne of the biggest surprises waiting for me was structural. I had never written this kind of episodic series before, and while I have worked out the major character and story arcs for the entire span of the series, it is difficult to predict exactly when and where certain things might happen (and I don’t want to lock myself into a preplanned structure too tightly, because it all balls up and changes anyway) or how many pages it will take to accomplish what I want to do.\nWhen I was 500 pages into book two, Romulus Buckle and the Engines of War (I have to do a lot of editing after my first drafts) I realized that the conclusion of Part II was the end of the that book, and what I had planned for Part III was actually a full book in itself, hence becoming book three. All of a sudden, I had an extra book in the series. It will be interesting to see, as the series progresses, how accurate my original estimation of the number of books will prove to be. I now fully expect to discover that one of my later book ideas shall waffle too thin, story-wise, and I will end up merging two book ideas into one. Whatever works, works.\nWhat should a sentence do? A paragraph? A chapter? A novel?\nThat is a great question to ask a writer, and one much discussed by brilliant people in endless books on writing and how to write. I’ll give it my best shot here and, with your permission I would like to tackle it from back to front. A fiction novel should entertain. When I, and most people, I think, pick up a work of fiction, they expect to be transported into another world and be engaged, to see and feel what the characters see and feel, whether the character is a Kansas doormouse or the Commodore of the Space Fleet of Orion. Many books have done this for me, and some have failed me. The failures were either bad books or fine books where the author’s method of communication simply did not jive with the way I absorb information. Faulkner is difficult for me to stick with, whereas I honestly feel like Michael Ondaatje dreams exactly the same way I do. Novels are art like painting is art, and who likes every canvas they see in a gallery? I hate the idea of my book not “clicking” for a reader who has selected my novel and wants to enjoy the journey, but I know it will happen.\nWhat should a chapter do? Obviously, if the writer slices his or her book up into chapters, it allows more effective communication of the overall story. Life has breaks in it, and the end of the chapter signals to the reader that the story is coming to a natural break (or cliffhanger, which is a kind of break) and allows them to pause and reflect on what has happened so far. I decided to dice my Romulus Buckle books up into a lot of small chapters (I remembered Kurt Vonnegut using a similar short-chapter method in Cat’s Cradle, to great effect) for several reasons: the spinning revolver cylinder of rotating character perspectives allows me to leap back and forth between points of view in the same situations (helpful in a high-action novel) and these are adventure books—the many chapter headings are integral parts of the lighter, faster-moving story.\nThe paragraph, to me, is a moment. It can be one word or five hundred, but it tends to encapsulate one action or one string of thought. Paragraphs are easy—it is the sentences that are hard.\nSentences are harder than everything else combined, harder than finding the right word. All writers have done the exercise where you take a famous sentence and rearrange the words and the magic of the whole thing collapses. A sentence has to feel right, and sometimes the success of the sentence escapes explanation, logic and grammar rules. I know when a sentence is working and when it is not, and it can be agony coming back to a sentence again and again and failing to find the perfect construction you know exists, but escapes you. A good sentence is fine, but you want to achieve as many great ones as you can. I am not a great grammarian and that is embarrassing, because it is one of the tools of my trade; grammar is something I must constantly be aware of and work on. My favorite book on the subject of the sentence is How To Write a Sentence (and How To Read One) by Stanley Fish.\nCan you talk a little bit about the process of building the world of The Chronicles of the Pneumatic Zeppelin?\nWorld building is both an incredible and terrifying experience. There are so many ways you can box yourself in, especially with a series. I had done it once before, with a fantasy realm for a book that may never see the light of day, but the Snow World of the Pneumatic Zeppelin series required a much broader scope. I had a good grasp of my steampunk-themed story, main characters and the zeppelin right off the bat, so my world-building began in large strokes across the background canvas. I wanted the backdrop to be a world about to fall into war, a world of clans (nations) competing for resources with their ambassadors scrambling to secure alliances against the impending conflict. I used the political situation in Western Europe just before the outbreak of the Great War as a template (very, very loosely) for the unstable geopolitical environment in my Snow World. Once I had the major political players and their strengths/weaknesses/relationships set, I could weave the lives of my characters through that intricate web and formulate their loyalties, partnerships, hatreds and betrayals. The whole process was nowhere near as clean and crisp as that, but I think this is a good overview.\nThe events driving the series were largely set into motion by the actions of the previous generation, so I had to know who everyone in that generation was; I had to know those characters as well as the ones who actually appear in the books. I worked out detailed family genealogies and clan histories, largely because I feared that if I did not, I would trip myself up later. I know exactly who the original Founders are and how they and their descendants built the world which my characters are living in.\nMy earth was destroyed three hundred years ago by the “Martians” (no one knows where the aliens came from, so that name just stuck) and humanity was almost completely wiped out. The survivors rallied in a dangerous, highly-competitive, post-apocalyptic world, and since most historic documents had been lost, the new civilization, the new Victorian-inspired society, was engineered from faulty memories of a time long past. I worked out every aspect of the environment as best I could so I had all the major underpinnings cemented in my head before I got too far into the early drafts of the books. Lots of detail can wait until we meet a clan or a character, but I have to know how they perceive each other from the very beginning, and why. I am actually surprised at how little of this background actually makes a direct appearance in book one, City of the Founders, which is primarily a rescue mission story, but it does fuel a lot of the undercurrents beneath the scenes. Book one is sort of hermetically sealed because we spend most of our time aboard the zeppelin or racing through a prison warren. Book two, Engines of War, involves many clans meeting to form a hasty alliance and it opens up much more of the Snow World.\nOne thing that caught me off guard as I plunged into my series was how much information I had to keep track of. Crew lists, KIAs, replacements, family relationships, names of zeppelins and who built them, ambassadors, outposts, menus, uniforms, flags, colors, character descriptions, blueprints, cannon types, muzzle velocities, airspeed and on and on. I didn’t realize how quickly one might become uncertain of the eye color of a character after a week away from her. I assembled a huge story bible so I have all of that information in one place rather than spending a lot of time searching through pages of finished work trying to confirm the type of metal on someone’s watch or the mannerisms they possess. I wish I had a better memory.\nHow did it go working with Jeff VanderMeer?\nWell, I am a Jeff VanderMeer fan now, so my answer is not objective. He is a really neat person. He is a great development editor and he helped me measure out the difficult balance of introductory elements in the first book and the pacing of the story in both books, among other things. He is of course an extremely accomplished writer, and I was thrilled when 47North brought him in to work with me on my first two books. He has a great sense of humor and I enjoyed working with him in the development process, which is of course painful for a writer on many levels—and it is a pain Jeff well understands and sympathizes with, so while he did apply the knife where it was needed, he did so gently. We even cooked up something of a friendship between our emails because we are both kind of silly, and I think that helped us be honest with each other during a process where he has to suggest gutting or Rubik’s-cubing my work in various ways (not that it does not need it, mind you) and I have to be tough enough to consider his suggestions with a stiff upper lip. I quickly learned to trust Jeff’s instincts: everything he brought to the table made the book better.\nLastly, what is it about airships that're just so cool?\nYes, über cool! They are one of those gigantic, mysterious machines that capture the imagination, and like the Titanic, they possess a tragic history. Most people are familiar with the Hindenburg and probably could not name another airship. Like the Titanic, the Hindenburg had a spectacular demise (the Hindenburg’s famously caught on film—“oh, the humanity!”) I think that the airship is akin to a great sailing ship and, in the tradition of the Golden Hind and the Victory, it captures the imagination in the same way—with the exception that the airship is an industrial-era machine, a product of the industrial revolution, and carries with it the conceit of man’s assumed triumph over nature. Very few people have ridden in an airship—I haven’t—and so it remains exotic to the average person, even today, in a way that airplane travel has not. Because of all of these aspects, it is easy to place a zeppelin in a world of air pirates or sky fleets because it simply “fits.”\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/preston_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Faulty Memories of a Time Long Past: A Conversation with Richard Ellis Preston, Jr. by Jeremy L. C. Jones"}