{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "j3tQcXZMRgxG9U690aXIAloL8cg=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Talkative Creatures and a Mesozoic Cocktail: A Conversation with Michael Swanwick  Variety is the spice of short fiction. Within an hour, you can have an adventure under the seas of Europa, navigate Faerie, and be back on earth in time for an airship heist. One writer who has consistently surprised and delighted with his odd and eloquent stories is Michael Swanwick.  Not So Much, Said the Cat is Swanwick’s latest collection of short fiction. Within its pages, you’ll find stories featuring enhanced critter con men, a bar at the end of the Mesozoic Era, a tiny toy horse containing a spirit protector, and many more tales to tickle your imagination. True to form, Swanwick’s collection is eclectic, charming, and moving.  Michael Swanwick is the author of numerous short stories and novels. He’s a five-time Hugo Award winner, and his fiction has won the Nebula, Theodore Sturgeon, World Fantasy Award, and many other accolades. His short fiction has appeared in Clarkesworld, OMNI, Penthouse, Asimov’s Science Fiction, New Dimensions, and more. His newest collection of short fiction, Not So Much, Said the Cat will be published by Tachyon this August.   Why does the cat say “not so much?”  He’s a character in a story about a young teenaged girl’s attempt to rescue her father from Hell. Beelzebub is there for whatever reasons a cat would be sent to perdition, and when he delivers that line he’s telling the girl that she might be lovely to look at for other humans, but for a cat . . . Which he does simply because he’s a contrarian and in Hell honesty is an offense to local community standards.  I hadn’t thought of this before, but Beelzebub—“Not the famous one, obviously,” as he says—and I have a lot in common. We both enjoy telling the truth in unexpected ways.  You have a keen talent for breathing life into inanimate objects and bestowing sapience on animals. How is the personality of that character informed by what it is?  It’s just the same sort of thing a child does, playing with plastic dinosaurs in the sandbox. They have a genius for making toys act like themselves. Most of us are shamed out of this ability as we grow up, but somehow I’ve managed to retain it.  In this collection, you pull inspiration from cultures and folk tales from around the world. What keeps you coming back to tales from Northern and Eastern Europe?  Simply the fact that in my early decades those were the areas where the literature was richest and easiest to come by. I’m trying to up my game in other cultures—African cultures, in particular. But it’s not something you can get simply by reading a book. You have to read a lot of books, be moved by them, and then let their contents percolate through the subconscious for years before the stories will appear.  Do you ever travel for research or does the travel instead provide the inspiration?  Both. My Russian stories were inspired by things I saw and heard and felt on my visits there, The Dala Horse was inspired by my visit to Sweden, and so on. But when I decided to write Dancing With Bears, set largely in Moscow, a city I’d only ever spent four hours in, I knew I had to go. I stayed long enough that I dared go out into the city and get deliberately lost, knowing I’d be able to find my way back to my flat on the Garden Ring. A few weeks is far from enough time to enable someone to write a serious novel about Russia. But the Darger & Surplus books are comic, so all I really needed was a sense of the city and the complex emotions that various locations in it arouse in you.  When I decided to write Chasing the Phoenix, Marianne and I arranged to tour China to research the book, but the day before the flight, I came down with a minor viral infection. Beijing International has thermometer gates and whoever passes through one running a fever gets thrown in quarantine. Marianne went without me and took copious notes, which helped immensely. And last year, after the novel was written, we went on a tour with a group that included Ellen Datlow and Eileen Gunn, so I got to see some of that great country—but none of it was tax-deductible, alas!  Russia has figured in a number of your stories and novels, what is it about the country and culture that keeps you intrigued?  I don’t know why it is, but everyone who goes to Russia falls in love with it. I do know that Russians feel very much like Americans in some ways and very unlike us in others; so perhaps it’s this dissonance that intrigues. The closest I’ve come to codifying this is that America and Russia are like twin brothers in a fairy tale, one of whom got all the good luck and the other of whom got all the bad—and neither of whom deserved what he got.  How do you feel this collection differs from past compilations of your short fiction?  For me, each collection is like a journal written by my subconscious imagination, covering the years when the stories were written. So this is what I’ve done and thought and felt this decade. There are two out-and-out love stories, a pastiche/alternate world version of Gene Wolfe’s The Fifth Head of Cerberus, the latest Darger and Surplus adventure, a Mongolian Wizard story, and a lot more. It’s a varied collection.  Some of the stories contain more personal material than I’ve used before. Not many people are going to notice that. The opening of “For I Have Lain Me Down on the Stone of Loneliness and I’ll Not Be Back Again” recounts the time Gerry Adams walked by me on O’Connell Street on the eightieth anniversary of the Easter Uprising. And “The Man in Grey” is all about my relationship with the characters in my stories.  How do you think your short stories have evolved over the course of your career?  They’ve gotten more compact, more efficient. When I started writing, the novelette was my default length. Now it’s the short story. They also seem to have gotten more elegant. The science fiction is more and more phrased in a fantastic voice, and the fantasy is increasingly hard-headed, so they almost but not quite overlap. You can always tell which is which.  This may be the first collection where all the stories sound like they were written by the same author. I don’t know if that’s a gain or a loss, artistically.  Technology appears within your stories in subtle and unexpected ways. What do you think of tech, the internet, and AI today? Where do you think it is heading?  Our information technologies are at least a hundred years ahead of where, a quarter century ago, we would have predicted they’d be. That’s because there’s been so much profit at stake that every visionary who could be found was hired and given free rein to do whatever. Thus, its future is obvious enough that even a Silicon Valley CEO can predict it, and consequently isn’t very engaging to think about. (Well, except for the question of what artificial intelligence will be like, now that we know it’s not going to be at all like human intelligence.)  I’m much more interested in the disruptions that robotics is poised to visit upon us. Small things like whether it should be legal to send your children to school, unsupervised, in a self-driving car. Medium things like the fact that equipping a robot with a gun and a stamped, self-addressed padded envelope so it can anonymously mail the loot home will make armed robbery as easy as illegally downloading one of my novels is now. Big things like what kind of society we’re going to have when hyper-automation has eliminated employment for all but a small fraction of the population.  We’re all aware of the promises and dangers of biotech: An end to birth defects, and the advent of designer children. Extended lifespans, half of which will be spent in assisted living. Extinct species resurrected, and “wild” species tinkered with and improved upon until it’s acknowledged that there is no such thing anymore. But I think the neurosciences hold the greatest potential for change. Within the century we should have the ability to cure schizophrenia and other mental diseases, which will give us the ability to reshape the architecture of human thought. Put all this together, and we have the prospect of creating people who are no longer recognizably human, either physically or mentally.  Did you know that we have machines right now that can read minds? They don’t do it very well. But the first Wright Flyer wasn’t very much of an airplane either. The potentials there, both good and bad, are pretty obvious.  So Dickens had it right. The coming century will be the best of times and the worst of times. How we weather it will depend on how much thought we put into the consequences of our technology before they blindside us.  A few songs found their way into some of your stories. Are you a musician as well as a writer?  Hah! I was the only kid thrown out of the choir at St. Paul the Apostle Elementary School for my voice. In college, I wrote songs and played the guitar in coffeehouses—it was the Sixties and everybody did that—but beyond a certain, elementary level, I stopped getting any better at it and it’s been many years since last I tuned my guitar. So I’m just an appreciator of other people’s music.  It’s probably just as well. If I could sing, I’d be doing it all the time. You wouldn’t be able to shut me up.  If you found yourself in a bar at the end of the Mesozoic Era, what drink would you order?  A gin martini, dry, straight up, with a twist. Boodles, of course.  Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nTalkative Creatures and a Mesozoic Cocktail: A Conversation with Michael Swanwick\nVariety is the spice of short fiction. Within an hour, you can have an adventure under the seas of Europa, navigate Faerie, and be back on earth in time for an airship heist. One writer who has consistently surprised and delighted with his odd and eloquent stories is Michael Swanwick.\nNot So Much, Said the Cat is Swanwick’s latest collection of short fiction. Within its pages, you’ll find stories featuring enhanced critter con men, a bar at the end of the Mesozoic Era, a tiny toy horse containing a spirit protector, and many more tales to tickle your imagination. True to form, Swanwick’s collection is eclectic, charming, and moving.\nMichael Swanwick is the author of numerous short stories and novels. He’s a five-time Hugo Award winner, and his fiction has won the Nebula, Theodore Sturgeon, World Fantasy Award, and many other accolades. His short fiction has appeared in Clarkesworld, OMNI, Penthouse, Asimov’s Science Fiction, New Dimensions, and more. His newest collection of short fiction, Not So Much, Said the Cat will be published by Tachyon this August.\nWhy does the cat say “not so much?”\nHe’s a character in a story about a young teenaged girl’s attempt to rescue her father from Hell. Beelzebub is there for whatever reasons a cat would be sent to perdition, and when he delivers that line he’s telling the girl that she might be lovely to look at for other humans, but for a cat . . . Which he does simply because he’s a contrarian and in Hell honesty is an offense to local community standards.\nI hadn’t thought of this before, but Beelzebub—“Not the famous one, obviously,” as he says—and I have a lot in common. We both enjoy telling the truth in unexpected ways.\nYou have a keen talent for breathing life into inanimate objects and bestowing sapience on animals. How is the personality of that character informed by what it is?\nIt’s just the same sort of thing a child does, playing with plastic dinosaurs in the sandbox. They have a genius for making toys act like themselves. Most of us are shamed out of this ability as we grow up, but somehow I’ve managed to retain it.\nIn this collection, you pull inspiration from cultures and folk tales from around the world. What keeps you coming back to tales from Northern and Eastern Europe?\nSimply the fact that in my early decades those were the areas where the literature was richest and easiest to come by. I’m trying to up my game in other cultures—African cultures, in particular. But it’s not something you can get simply by reading a book. You have to read a lot of books, be moved by them, and then let their contents percolate through the subconscious for years before the stories will appear.\nDo you ever travel for research or does the travel instead provide the inspiration?\nBoth. My Russian stories were inspired by things I saw and heard and felt on my visits there, The Dala Horse was inspired by my visit to Sweden, and so on. But when I decided to write Dancing With Bears, set largely in Moscow, a city I’d only ever spent four hours in, I knew I had to go. I stayed long enough that I dared go out into the city and get deliberately lost, knowing I’d be able to find my way back to my flat on the Garden Ring. A few weeks is far from enough time to enable someone to write a serious novel about Russia. But the Darger & Surplus books are comic, so all I really needed was a sense of the city and the complex emotions that various locations in it arouse in you.\nWhen I decided to write Chasing the Phoenix, Marianne and I arranged to tour China to research the book, but the day before the flight, I came down with a minor viral infection. Beijing International has thermometer gates and whoever passes through one running a fever gets thrown in quarantine. Marianne went without me and took copious notes, which helped immensely. And last year, after the novel was written, we went on a tour with a group that included Ellen Datlow and Eileen Gunn, so I got to see some of that great country—but none of it was tax-deductible, alas!\nRussia has figured in a number of your stories and novels, what is it about the country and culture that keeps you intrigued?\nI don’t know why it is, but everyone who goes to Russia falls in love with it. I do know that Russians feel very much like Americans in some ways and very unlike us in others; so perhaps it’s this dissonance that intrigues. The closest I’ve come to codifying this is that America and Russia are like twin brothers in a fairy tale, one of whom got all the good luck and the other of whom got all the bad—and neither of whom deserved what he got.\nHow do you feel this collection differs from past compilations of your short fiction?\nFor me, each collection is like a journal written by my subconscious imagination, covering the years when the stories were written. So this is what I’ve done and thought and felt this decade. There are two out-and-out love stories, a pastiche/alternate world version of Gene Wolfe’s The Fifth Head of Cerberus, the latest Darger and Surplus adventure, a Mongolian Wizard story, and a lot more. It’s a varied collection.\nSome of the stories contain more personal material than I’ve used before. Not many people are going to notice that. The opening of “For I Have Lain Me Down on the Stone of Loneliness and I’ll Not Be Back Again” recounts the time Gerry Adams walked by me on O’Connell Street on the eightieth anniversary of the Easter Uprising. And “The Man in Grey” is all about my relationship with the characters in my stories.\nHow do you think your short stories have evolved over the course of your career?\nThey’ve gotten more compact, more efficient. When I started writing, the novelette was my default length. Now it’s the short story. They also seem to have gotten more elegant. The science fiction is more and more phrased in a fantastic voice, and the fantasy is increasingly hard-headed, so they almost but not quite overlap. You can always tell which is which.\nThis may be the first collection where all the stories sound like they were written by the same author. I don’t know if that’s a gain or a loss, artistically.\nTechnology appears within your stories in subtle and unexpected ways. What do you think of tech, the internet, and AI today? Where do you think it is heading?\nOur information technologies are at least a hundred years ahead of where, a quarter century ago, we would have predicted they’d be. That’s because there’s been so much profit at stake that every visionary who could be found was hired and given free rein to do whatever. Thus, its future is obvious enough that even a Silicon Valley CEO can predict it, and consequently isn’t very engaging to think about. (Well, except for the question of what artificial intelligence will be like, now that we know it’s not going to be at all like human intelligence.)\nI’m much more interested in the disruptions that robotics is poised to visit upon us. Small things like whether it should be legal to send your children to school, unsupervised, in a self-driving car. Medium things like the fact that equipping a robot with a gun and a stamped, self-addressed padded envelope so it can anonymously mail the loot home will make armed robbery as easy as illegally downloading one of my novels is now. Big things like what kind of society we’re going to have when hyper-automation has eliminated employment for all but a small fraction of the population.\nWe’re all aware of the promises and dangers of biotech: An end to birth defects, and the advent of designer children. Extended lifespans, half of which will be spent in assisted living. Extinct species resurrected, and “wild” species tinkered with and improved upon until it’s acknowledged that there is no such thing anymore. But I think the neurosciences hold the greatest potential for change. Within the century we should have the ability to cure schizophrenia and other mental diseases, which will give us the ability to reshape the architecture of human thought. Put all this together, and we have the prospect of creating people who are no longer recognizably human, either physically or mentally.\nDid you know that we have machines right now that can read minds? They don’t do it very well. But the first Wright Flyer wasn’t very much of an airplane either. The potentials there, both good and bad, are pretty obvious.\nSo Dickens had it right. The coming century will be the best of times and the worst of times. How we weather it will depend on how much thought we put into the consequences of our technology before they blindside us.\nA few songs found their way into some of your stories. Are you a musician as well as a writer?\nHah! I was the only kid thrown out of the choir at St. Paul the Apostle Elementary School for my voice. In college, I wrote songs and played the guitar in coffeehouses—it was the Sixties and everybody did that—but beyond a certain, elementary level, I stopped getting any better at it and it’s been many years since last I tuned my guitar. So I’m just an appreciator of other people’s music.\nIt’s probably just as well. If I could sing, I’d be doing it all the time. You wouldn’t be able to shut me up.\nIf you found yourself in a bar at the end of the Mesozoic Era, what drink would you order?\nA gin martini, dry, straight up, with a twist. Boodles, of course.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/swanwick_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Talkative Creatures and a Mesozoic Cocktail: A Conversation with Michael Swanwick by Chris Urie"}