{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeff VanderMeer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "FBPSzSyO/Fyc08Eprtzefb4BBKM=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Steven Erikson: No Lies, No Holding Back  Steven Erikson has built up a loyal and devoted following for his Malazan novels, which first began appearing from Bantam UK in the 1990s, when he made news by selling a series of ten novels in an extraordinary high-six-figure deal. Erikson is known for writing gritty, realistic fantasy fiction that subverts genre expectations and garners not only wide readership but also critical acclaim. His latest book is The Bone Hunters (Malazan Book of the Fallen, Book 6). I was privileged to be able to sit down and talk to Erikson at the American Library Association conference in Washington D.C. this summer and found him to be intelligent, funny, entertaining, and to, further, have the kind of clarity of thought that usually indicates clarity in the writing. Wanting to hear more about his views on fantasy, his writing, and his sordid past as a mainstream literary author, I conducted the following interview with Erikson via email in November.    How do you think you’ve changed as a writer over the years, and does writing novels get easier?  The first part of that question is a hard one to answer. I recently wrote a preface to a re-release of Gardens of the Moon, (the first in the series) that Bantam UK is planning, and in it I spoke of ambition; observing that through most of my career as both an unpublished and a published writer, I have often faced rejection wherein I have been criticized for being “too ambitious.” Looking back, then, I realized (with bemused surprise), that in this one area I have not changed one whit. If I’m not pushing things I just don’t see the point, and that’s what drives my writing—it did in my very first stories and it still does.  If there is one change I can observe without too much cynicism, it’s that I find I am less and less frustrated in facing that particular criticism. When young, I received it with disbelief. Now, I just shrug. Is this what scars do? Am I simply desensitized, or do I just not give a fuck anymore? I suspect that if I was as poor, as struggling, as I once was, then my feeling would be very different than it is right now. Is this what “comfort” purchases in a life? Could be.  Does writing novels get easier? Yes. I can carry more in my head, more levels, more angles. Word by word, sentence by sentence, resonances abound and proliferate. It’s as if, having written so many words by now (about two million in this series alone), the sweat and blood ordeal of communication has become the mental equivalent of muscle memory; and this frees the rest of my brain to work between the lines, to hunt down the submerged levels and the nuances of character, and to find and explore and make peace with that core of “unanswerables” that we generally toss together and call ’theme.’  It’s one thing to love language. Every writer starts with that. It’s another when language and the writer become lovers. Does that make sense, Jeff? [Absolutely—Jeff] The first is passive, the second is active engagement. It’s profoundly different, at least to me.  The scary side to this is that I read less from other fiction writers, year by year. As a lover with language, I may be getting jealous, possessive. Or, to put it in terms less obsessive, I have grown to become a more discriminating reader. I’ve no time for lazy writing or lazy writers.  You had a career before you started writing fantasy. What did you write, and where was it published?  My first career was as an archaeologist, but I think you mean my “career” as a writer before I started writing fantasy; and as you see I’ve rabbit-eared that word, since it hardly earned me a living. My first book was a “story cycle” entitled A Ruin of Feathers, in which I wrote a dozen or so short stories all involving an archaeologist traveling through Central America in the early Eighties. Write about what you know, right? That collection was actually my thesis from the Iowa Writers’ Workshop, and I received a Canada Council grant to finish it. The publisher was TSAR Books, a small publisher in Toronto. I got to paint my own cover, probably a sure recipe for disaster. The book is now out of print but, ironically, may soon see the light of day again, assuming I can ever get round to doing the revisions.  For my second publication, I was co-winner in the Anvil Press International 3-Day Novel contest; the book was a back-to-back thing with my novel on one side and the other co-winner’s novel on the other. When, after the public announcement of co-winning the contest, I received one of the most draconian contracts I had ever beheld, I balked, only to be told that I’d lose the award if I refused to sign away virtually all rights. I should have called their bluff—that’s a regret that still rankles. But I was young, desperate, insecure, etc.  I then published a third book, this one also with TSAR, that contained a novella and short stories, entitled Revolvo and other Canadian Tales. After moving to England I sold my first real novel, to Hodder & Stoughton (Sceptre Imprint), entitled This River Awakens, which I had written back in Winnipeg thanks to a Manitoba Arts Council grant. This book is also out of print.  All of these works were published under my real name, Steve Lundin. Whose writing career languishes in obscurity.  What is it about Fantasy that drew you in, initially, and what do you get from Fantasy you don’t get from other kinds of fiction?  Well, I’ve written all kinds of fiction and each satisfies in its own way. I am asked this question often and I have two answers, one intellectual, one visceral. I’ll take ’em in order. Intellectually, the Fantasy genre is the only genre (and I include literary fiction as a genre) where a writer can take a metaphor and make it real, which for me is as creatively liberating as I can get. The visceral is this: I grew up reading the stuff, and I simply love it. What drew me to archaeology, for example, was the sense of wonder in discovering remnants of lost and forgotten cultures. With Fantasy, I could actually create those cultures, from scratch, every detail, and then participate in recounting their histories, their engagements, their flowering, their death—to draw that back to the analogy, I could do everything that precedes any manner of “archaeological exploration,” and so recapture that sense of wonder and mystery.  Do you read a lot of Fantasy? Is there a sense of wanting to keep up with what other heroic fantasy writers are doing?  I read less and less, admittedly. Even the notion of “keeping up” doesn’t breed much enthusiasm in me. That being said, I am looking forward to Richard Morgan’s first take on the genre, and I’ll probably continue to follow a few series already begun, including Patrick Rothfuss’s debut series, and K. J. Parker’s Engineer trilogy. Oh, and Glen Cook’s new Black Company novels; Steve Donaldson’s final Covenant trilogy; Scott Bakker’s new work; and I may get back to resuming my reading of Robin Hobb, because she is such a superb writer.  Your books have been described as very realistic, as very complex, and as, at times, grim. How do you see your work, and are you ever surprised by how readers react to it?  How do I see my work? Well, there’s a certain amount of ruthlessness to it, but it’s pretty hard in my mind to actually match the brutality of the real world—at least not in a way that anyone would want to read. To say that I am inspired by reality is a statement that verges on the blackest, most caustic comedy. What I am witness to impels my writing; failing that, I would probably descend into despair. So I write in search of humanity. It’s odd, readers say that the Chain of Dogs storyline in my second novel, Deadhouse Gates, is relentless in its horror. To which I might (if I’m feeling particularly ungenerous) reply: try living in Sudan, or Zimbabwe; or how about the profligate misery of the homeless on the streets of Victoria? What I’m writing pales against the backdrop of what’s really out there. Mate, trust me, you don’t know relentless until you find yourself in hell with no way out. Now, I’m not in that kind of hell, but I’ve got eyes, and more often than not, what I see shows up in my writing eventually, sooner or later. That being said, I’d probably relent and seek to lessen the ferocity by adding that I seek to find gestures of humanity in the midst of suffering and chaos: love, friendship, the soul-saving ability to laugh. They exist, and they’re precious.  The thing with fiction, the thing with fiction, is that it is structured, in a way that reality isn’t. So as a creator you can strive for balance and maybe achieve a kind of satisfaction in the reader, a sense of completeness. That sense may have a tragic flavor, but I am a believer in Aristotle’s assertion that tragedy is cathartic. Tragedy as an art form, that is. Real tragedy, what we see every day thanks to a categorically psychotic media, is not cathartic. It has no resolution, rarely the promise of redemption, and seems fixed like a voyeur on the negation of human virtues (never mind the two-minute feel-good shit at program’s end, who are they kidding?).  So maybe fiction is the writer’s engagement with reality, a dialogue offering hope in the face of a reality seemingly bent on cynically destroying it. Makes it sound plaintive and pathetic, doesn’t it? Man, could be I’m just in a shitty mood.  Am I ever surprised by how readers take my stuff? Often. And baffled. Particularly in how thoroughly some of the characters are hated by the readers. Can I be perverse and take that as a measure of success?  How do you see the fantasy field today? Do you think it’s different than five years ago? If so, how?  I think the genre is getting grittier, possibly meaner. But I could be wrong. It’s hard for me to say since I feel myself withdrawing as a reader. Darker, maybe, a little less black and white . . . but then I read dust jackets on new fantasy novels and see the same old “evil overlord” and “lone hero” (or disparate collection of heroes) setting out against all odds to defeat it, blah blah. I’m probably picking up the wrong books. There are some now out there that are clear rejections of that trope—are they successful? I’ve no idea. I liked Tim Lebbon’s Dawn and Dusk novels. And Parker’s mad, nasty genius “hero” in the Engineer Trilogy. Rothfuss’s first novel was a bit more conventional but very well written. And now there are subgenres spinning off in all directions, which is both a good and a bad thing to my mind: good in that the genre is robust enough to spawn new tropes; bad in that a kind of segregation forms, where writers of a particular subgenre virtually cease reading fantasy works in the other subgenres and in the genre as a whole. As in science, specialization breeds isolation and before you know it, we’re all running blind and ignorant of everything else that’s going on around us. Huh, maybe like me.  I don’t know if the genre’s changed much beyond the budding effect mentioned above. It may be that it’s audience is changing, however, and at some point there will be a kind of feedback that jars all us writers in the genre, shakes us up, leaves us scrambling. Cultural sensibilities evolve, and the less sure of our collective footing the more likely we (as a society) are to yearn for the familiar in our entertainments: the more conservative our tastes become. There’s a danger the spin-off subgenres will prove, historically, to be shortlived; their audiences becoming ever smaller and ever more eclectic. But then, is there anything new in that? Cyberpunk’s pretty much dead, isn’t it? We can be in the middle of any moment, any movement of artistic expression, and suddenly find ourselves transformed into crusty fossils, wondering whathefuh?  Years ago, I thought I saw trends and movements, currents building that would sweep away all the old tropes of the genre. I don’t see that anymore. I don’t see much of anything, in fact. We all seem to be carving out our own spaces, and the cross-pollination is drying up. I go to cons and meet countless writers and haven’t read ninety-five percent of them, and I feel awful for that.  So, I’m probably the wrong guy to ask.  Outside of writing, what do you like to do? What do you really enjoy?  I paint oils (right now I’m doing a series of Malazan Portraits—various characters from my books). I fence, but after three decades of fencing my right hand belongs in a museum case, labeled Species Unknown, possible prosimian, 3.5 mya. I now wear a kind of molded exoskeleton to brace all the scarred ligaments, damaged joints, etc. It works after a fashion, but the therapist has to keep adding extensions. By the time we’re done it’ll probably encase my entire right arm up to the shoulder.  In any case, the painting is becoming a pretty serious hobby; it’s such a nice break to be standing while working, to work in colour and light and all the tactile stuff that comes with it.  I’m a snob when it comes to medium. I won’t use acrylic—the very idea of plastic paint that we then wash down the drains is horrifying. Of course, oils aren’t much better, even when using “natural” pigments, but at least dish-soap cuts and dilutes it to its constituent organics and inorganics; while the acrylic molecules never break down (some painter will probably trash me for my ignorance in this—my final defense is to shift tactics and loftily say that I prefer the textural and mixing qualities of oils).  I’d love to do some archaeology again, fieldwork, some dig, somewhere. Out in the real world. The real world still exists, doesn’t it? I’m sure it does. Somewhere. Jeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.  Jeff's novel Finch and writing book, Booklife, are forthcoming this fall.", "text": "Interview\nSteven Erikson: No Lies, No Holding Back\nSteven Erikson has built up a loyal and devoted following for his Malazan novels, which first began appearing from Bantam UK in the 1990s, when he made news by selling a series of ten novels in an extraordinary high-six-figure deal. Erikson is known for writing gritty, realistic fantasy fiction that subverts genre expectations and garners not only wide readership but also critical acclaim. His latest book is The Bone Hunters (Malazan Book of the Fallen, Book 6). I was privileged to be able to sit down and talk to Erikson at the American Library Association conference in Washington D.C. this summer and found him to be intelligent, funny, entertaining, and to, further, have the kind of clarity of thought that usually indicates clarity in the writing. Wanting to hear more about his views on fantasy, his writing, and his sordid past as a mainstream literary author, I conducted the following interview with Erikson via email in November.\nHow do you think you’ve changed as a writer over the years, and does writing novels get easier?\nThe first part of that question is a hard one to answer. I recently wrote a preface to a re-release of Gardens of the Moon, (the first in the series) that Bantam UK is planning, and in it I spoke of ambition; observing that through most of my career as both an unpublished and a published writer, I have often faced rejection wherein I have been criticized for being “too ambitious.” Looking back, then, I realized (with bemused surprise), that in this one area I have not changed one whit. If I’m not pushing things I just don’t see the point, and that’s what drives my writing—it did in my very first stories and it still does.\nIf there is one change I can observe without too much cynicism, it’s that I find I am less and less frustrated in facing that particular criticism. When young, I received it with disbelief. Now, I just shrug. Is this what scars do? Am I simply desensitized, or do I just not give a fuck anymore? I suspect that if I was as poor, as struggling, as I once was, then my feeling would be very different than it is right now. Is this what “comfort” purchases in a life? Could be.\nDoes writing novels get easier? Yes. I can carry more in my head, more levels, more angles. Word by word, sentence by sentence, resonances abound and proliferate. It’s as if, having written so many words by now (about two million in this series alone), the sweat and blood ordeal of communication has become the mental equivalent of muscle memory; and this frees the rest of my brain to work between the lines, to hunt down the submerged levels and the nuances of character, and to find and explore and make peace with that core of “unanswerables” that we generally toss together and call ’theme.’\nIt’s one thing to love language. Every writer starts with that. It’s another when language and the writer become lovers. Does that make sense, Jeff? [Absolutely—Jeff] The first is passive, the second is active engagement. It’s profoundly different, at least to me.\nThe scary side to this is that I read less from other fiction writers, year by year. As a lover with language, I may be getting jealous, possessive. Or, to put it in terms less obsessive, I have grown to become a more discriminating reader. I’ve no time for lazy writing or lazy writers.\nYou had a career before you started writing fantasy. What did you write, and where was it published?\nMy first career was as an archaeologist, but I think you mean my “career” as a writer before I started writing fantasy; and as you see I’ve rabbit-eared that word, since it hardly earned me a living. My first book was a “story cycle” entitled A Ruin of Feathers, in which I wrote a dozen or so short stories all involving an archaeologist traveling through Central America in the early Eighties. Write about what you know, right? That collection was actually my thesis from the Iowa Writers’ Workshop, and I received a Canada Council grant to finish it. The publisher was TSAR Books, a small publisher in Toronto. I got to paint my own cover, probably a sure recipe for disaster. The book is now out of print but, ironically, may soon see the light of day again, assuming I can ever get round to doing the revisions.\nFor my second publication, I was co-winner in the Anvil Press International 3-Day Novel contest; the book was a back-to-back thing with my novel on one side and the other co-winner’s novel on the other. When, after the public announcement of co-winning the contest, I received one of the most draconian contracts I had ever beheld, I balked, only to be told that I’d lose the award if I refused to sign away virtually all rights. I should have called their bluff—that’s a regret that still rankles. But I was young, desperate, insecure, etc.\nI then published a third book, this one also with TSAR, that contained a novella and short stories, entitled Revolvo and other Canadian Tales. After moving to England I sold my first real novel, to Hodder & Stoughton (Sceptre Imprint), entitled This River Awakens, which I had written back in Winnipeg thanks to a Manitoba Arts Council grant. This book is also out of print.\nAll of these works were published under my real name, Steve Lundin. Whose writing career languishes in obscurity.\nWhat is it about Fantasy that drew you in, initially, and what do you get from Fantasy you don’t get from other kinds of fiction?\nWell, I’ve written all kinds of fiction and each satisfies in its own way. I am asked this question often and I have two answers, one intellectual, one visceral. I’ll take ’em in order. Intellectually, the Fantasy genre is the only genre (and I include literary fiction as a genre) where a writer can take a metaphor and make it real, which for me is as creatively liberating as I can get. The visceral is this: I grew up reading the stuff, and I simply love it. What drew me to archaeology, for example, was the sense of wonder in discovering remnants of lost and forgotten cultures. With Fantasy, I could actually create those cultures, from scratch, every detail, and then participate in recounting their histories, their engagements, their flowering, their death—to draw that back to the analogy, I could do everything that precedes any manner of “archaeological exploration,” and so recapture that sense of wonder and mystery.\nDo you read a lot of Fantasy? Is there a sense of wanting to keep up with what other heroic fantasy writers are doing?\nI read less and less, admittedly. Even the notion of “keeping up” doesn’t breed much enthusiasm in me. That being said, I am looking forward to Richard Morgan’s first take on the genre, and I’ll probably continue to follow a few series already begun, including Patrick Rothfuss’s debut series, and K. J. Parker’s Engineer trilogy. Oh, and Glen Cook’s new Black Company novels; Steve Donaldson’s final Covenant trilogy; Scott Bakker’s new work; and I may get back to resuming my reading of Robin Hobb, because she is such a superb writer.\nYour books have been described as very realistic, as very complex, and as, at times, grim. How do you see your work, and are you ever surprised by how readers react to it?\nHow do I see my work? Well, there’s a certain amount of ruthlessness to it, but it’s pretty hard in my mind to actually match the brutality of the real world—at least not in a way that anyone would want to read. To say that I am inspired by reality is a statement that verges on the blackest, most caustic comedy. What I am witness to impels my writing; failing that, I would probably descend into despair. So I write in search of humanity. It’s odd, readers say that the Chain of Dogs storyline in my second novel, Deadhouse Gates, is relentless in its horror. To which I might (if I’m feeling particularly ungenerous) reply: try living in Sudan, or Zimbabwe; or how about the profligate misery of the homeless on the streets of Victoria? What I’m writing pales against the backdrop of what’s really out there. Mate, trust me, you don’t know relentless until you find yourself in hell with no way out. Now, I’m not in that kind of hell, but I’ve got eyes, and more often than not, what I see shows up in my writing eventually, sooner or later. That being said, I’d probably relent and seek to lessen the ferocity by adding that I seek to find gestures of humanity in the midst of suffering and chaos: love, friendship, the soul-saving ability to laugh. They exist, and they’re precious.\nThe thing with fiction, the thing with fiction, is that it is structured, in a way that reality isn’t. So as a creator you can strive for balance and maybe achieve a kind of satisfaction in the reader, a sense of completeness. That sense may have a tragic flavor, but I am a believer in Aristotle’s assertion that tragedy is cathartic. Tragedy as an art form, that is. Real tragedy, what we see every day thanks to a categorically psychotic media, is not cathartic. It has no resolution, rarely the promise of redemption, and seems fixed like a voyeur on the negation of human virtues (never mind the two-minute feel-good shit at program’s end, who are they kidding?).\nSo maybe fiction is the writer’s engagement with reality, a dialogue offering hope in the face of a reality seemingly bent on cynically destroying it. Makes it sound plaintive and pathetic, doesn’t it? Man, could be I’m just in a shitty mood.\nAm I ever surprised by how readers take my stuff? Often. And baffled. Particularly in how thoroughly some of the characters are hated by the readers. Can I be perverse and take that as a measure of success?\nHow do you see the fantasy field today? Do you think it’s different than five years ago? If so, how?\nI think the genre is getting grittier, possibly meaner. But I could be wrong. It’s hard for me to say since I feel myself withdrawing as a reader. Darker, maybe, a little less black and white . . . but then I read dust jackets on new fantasy novels and see the same old “evil overlord” and “lone hero” (or disparate collection of heroes) setting out against all odds to defeat it, blah blah. I’m probably picking up the wrong books. There are some now out there that are clear rejections of that trope—are they successful? I’ve no idea. I liked Tim Lebbon’s Dawn and Dusk novels. And Parker’s mad, nasty genius “hero” in the Engineer Trilogy. Rothfuss’s first novel was a bit more conventional but very well written. And now there are subgenres spinning off in all directions, which is both a good and a bad thing to my mind: good in that the genre is robust enough to spawn new tropes; bad in that a kind of segregation forms, where writers of a particular subgenre virtually cease reading fantasy works in the other subgenres and in the genre as a whole. As in science, specialization breeds isolation and before you know it, we’re all running blind and ignorant of everything else that’s going on around us. Huh, maybe like me.\nI don’t know if the genre’s changed much beyond the budding effect mentioned above. It may be that it’s audience is changing, however, and at some point there will be a kind of feedback that jars all us writers in the genre, shakes us up, leaves us scrambling. Cultural sensibilities evolve, and the less sure of our collective footing the more likely we (as a society) are to yearn for the familiar in our entertainments: the more conservative our tastes become. There’s a danger the spin-off subgenres will prove, historically, to be shortlived; their audiences becoming ever smaller and ever more eclectic. But then, is there anything new in that? Cyberpunk’s pretty much dead, isn’t it? We can be in the middle of any moment, any movement of artistic expression, and suddenly find ourselves transformed into crusty fossils, wondering whathefuh?\nYears ago, I thought I saw trends and movements, currents building that would sweep away all the old tropes of the genre. I don’t see that anymore. I don’t see much of anything, in fact. We all seem to be carving out our own spaces, and the cross-pollination is drying up. I go to cons and meet countless writers and haven’t read ninety-five percent of them, and I feel awful for that.\nSo, I’m probably the wrong guy to ask.\nOutside of writing, what do you like to do? What do you really enjoy?\nI paint oils (right now I’m doing a series of Malazan Portraits—various characters from my books). I fence, but after three decades of fencing my right hand belongs in a museum case, labeled Species Unknown, possible prosimian, 3.5 mya. I now wear a kind of molded exoskeleton to brace all the scarred ligaments, damaged joints, etc. It works after a fashion, but the therapist has to keep adding extensions. By the time we’re done it’ll probably encase my entire right arm up to the shoulder.\nIn any case, the painting is becoming a pretty serious hobby; it’s such a nice break to be standing while working, to work in colour and light and all the tactile stuff that comes with it.\nI’m a snob when it comes to medium. I won’t use acrylic—the very idea of plastic paint that we then wash down the drains is horrifying. Of course, oils aren’t much better, even when using “natural” pigments, but at least dish-soap cuts and dilutes it to its constituent organics and inorganics; while the acrylic molecules never break down (some painter will probably trash me for my ignorance in this—my final defense is to shift tactics and loftily say that I prefer the textural and mixing qualities of oils).\nI’d love to do some archaeology again, fieldwork, some dig, somewhere. Out in the real world. The real world still exists, doesn’t it? I’m sure it does. Somewhere.\nJeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.\nJeff's novel Finch and writing book, Booklife, are forthcoming this fall.", "source": "https://clarkesworldmagazine.com/erikson_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Interview with Steven Erikson by Jeff VanderMeer"}