{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Gabriela Santiago", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "qt/U0JF7kzvMzAqbva9yK8B6zc0=", "id": null, "license": null, "comments": "", "raw_text": "6850 words, short story  Malinche  The Eagle Knight came like a star in midday. I looked up, and I saw the profile of his helmet’s beak so sharp against the light, the golden feathers of his wings so bright in the glare of the sun. As though he were Huitzilopochtli himself.  And then he fell.  “What are you doing?”  The Eagle Knight was staring at me, his eyes almost as wild as his helmet-free hair. The light of my lantern cast dancing shadows on his face. He tried to prop himself up, but fell back onto the bed.  “When you die, it will be my duty to dismantle your wings to make useful mechanisms for the village,” I said. I turned my back to him, felt around the other wing for its daughter-of-tlaloc. Ignored the heat of his gaze on my shoulders. My fingers closed around the daughter, a small round pod; prized it away from the struts of the wings. “One of these will power a farmers’ clayslave for a year.”  His voice spat contempt, even through his pain. “What would a peasant girl know of daughters-of-tlaloc and tollani?”  I could have told him of the days I spent in the calmecac out on the frontier, one of the few girls so honored, watching as the priest-scholars conducted their first experiments with tollani. The thin copper wires connecting the potato to that small airtight lantern with windows of pale pink quartz. That burst of light, how my breath caught in my throat as we became small gods in that temple room.  I said nothing.  “I will not die,” he said. Now his voice was a whining plea. “I have a holy duty. I must warn the caravan . . . they must warn the city, the tlatoani . . . ”  His fingers scrabbled more at his blankets, and a deep hacking cough, wet with blood, rose in his throat as he tried to stand. An Eagle Knight, weak as a child before me.  I could feel my own tollani rising in my veins, bright and sparking and heady as octli gulped in secret from my father’s stores.  “Tell me,” I said. “I will pass on your message.”  “Why should—” he began, and then, for the first time that night, he truly looked at me. “Ah. Of course. It is your city too.”  It had been my city, though I had never seen it. We had been rich, had become richer when copper soared in price and our mines in the north had tripled in worth with the spreading knowledge of the ways tollani might be captured in lanterns, or in the daughters-of-tlaloc that could power more wings and mills and clayslaves than any man might desire.  My stepfather lost it all over a round of ullamaliztli.  “Tell me,” I repeated.  The ship creaked and groaned in the wind, men scurrying back and forth, pulling levers and turning gears. Entirely mechanical—not one span of wire, not one spark of tollani. But it flew over the waves, carrying the . . . they were not men.  They wore metal shells like the carapaces of beetles, and beneath, monkey hair sprouted out of skin that glowed with sickly light. They gabbled like monkeys too, when they saw me, and they brought forth their weapon—a sound like thunder and pain, like nothing I have known—they tried to catch me as I fell—  There was such pride in his voice, even then, even dying. I tried to remember what it had been like to feel such pride.  “I promise,” I said. “I will pass on your message.”  All the breath went out of him then, a sigh like the night wind outside the hut, and it carried away the last of his tollani, so that his eyes dulled and his heart slowed and stopped.  What a strange still thing a body is. To once hold an Eagle Knight and all that pride. To now be nothing but spare parts, flesh and bone. Less than a clayslave even, for those I could repair and call to rise again.  And in the morning, I did not say a thing.  I swept the floor of my owner’s house. When I was a child, I was told that it was the sacred duty of women—even noblewomen, such as I would one day grow to be—to sweep the floor. It kept the house clean not just of dirt, but of malicious influences; in that moment when dawn swept up over the horizon, a woman with a broom was a soldier against all the forces of chaos.  Now, I swept the floor only because my owner told me to, and if I did not, I would be beaten.  But once, I had wanted to sweep the floor.  I could remember wanting things, but not as if it had been myself who wanted them—no, it had been some other girl, some bright, loud, foolish girl, jumping up and down, hopping from foot to foot with the whirling force of all the things she desired.  To run away from my lessons and join the pochtecha and journey far and wide, perhaps even to that fabled capitol, Tenochtitlan. Or else to please my parents with my weaving and my lessons, so that they might arrange a good marriage for me and I might have many strong children who would earn honor in glorious battle. Or else so that I might become a scribe, or one of the rare women who stayed on to work in the temples, assisting the priests with their studies. I even wished at times for a life ending in childbirth or in picking up arms—the consolation my place at the warriors’ table in the heavens with the men instead of being consigned to the cold emptiness of Mictlan.  Where did she go, that girl?  I remembered how my mother said, “At least this way you will be fed, Tenepal.” My second name meant “she who speaks with liveliness,” and my mother had always smiled when she said it. She smiled then, but it was stretched tight and strange, and I did not believe I knew her.  By the time I finished the rest of my duties, others had already stripped away the feathers to add adornment to the cloaks and shields of the village, leaving the skeleton of hollow wooden rods and deer sinews and cactus-cloth string and rubber-coated copper wires for me to strip apart, and around them the muscles of small interlocking gears of iron. And of course, the daughters-of-tlaloc, heavy with power.  I dragged out the first of the broken clayslaves set aside until trade or plunder brought us parts to repair her—a field hand, the mechanisms within her legs corroded and crumbling with rust. I removed them and set them aside—perhaps our smith could yet salvage some scrap of iron from them—and attempted to replace them with gears and pulleys from the wings. It was a trickier job than I first supposed, as the replacements were of different sizes and gear ratios, and there was much makeshift jerry-rigging before I could make her walk in a straight line without her legs buckling beneath her.  “You have done good work today,” the priest said over my shoulder. “Will there be any parts to spare for the home lanterns when you are done?”  “It is doubtful, my lord,” I said, keeping my head bowed. “If you have need of the materials, perhaps it might be best that you take them now, and that I wait for another opportunity to finish my work here.”  “And risk our mayor’s wrath?” A dry chuckle. “I think not, little one.”  “More home lanterns could be installed,” I said—though I did not recognize my voice at first— “and much farther from the city square, if I were allowed to look at the son-of-tlaloc beneath the city square. I have an idea—it would take more wire, surely, and greater current of tollani, but if you look at my equations—”  “That is enough, Malinalli,” the priest snapped, and his voice was hard now, granite and marble. “You are good enough with your hands to do repairs. But leave the tollani to those ordained by the gods.”  “Yes, my lord,” I said, bending my head further. Who had spoken those words of defiance? That little girl, perhaps. I often thought her long dead until I heard her voice from my lips.  The next day, the priest and three warriors went into the jungle.  A week later, they returned with the aliens.  The creatures did not remove their armor, and I wondered if it was shelter from our sun, or supplied some element of their native land not to be found on our shores. The parts that could be seen through the armor were pale as the moon, reddening like the blush on a fruit. Their eyes were pale as jade, and their fur glistened like copper and gold.  Their leader was almost human, until he looked at you.  There was ice in his eyes, and lightning. I felt the field of his tollani animate not only his body, but the bodies of his men, moving them to do his bidding as he barked orders in his harsh tongue. There was power here, coursing beneath this strange exterior. He was a son-of-tlaloc, its wires wound tight, turning and turning and sending tollani coursing outward from him.  None of the strangers spoke Chontal, and so they and our warriors had made do with signs until this point. But when they sat down to feast, I was taken from my post. Their ice-eyed leader would speak in his monkey-babble, and then the old man next to him would speak, haltingly, in Nahuatl, and then I would repeat his words in Chontal. And then our mayor would reply, and the process would repeat itself, in reverse.  “We, ah, thank you for the—the, the bounty you have spread before us.”  “We thank you for the bounty you have spread before us.”  I looked around the gathering, at all who were assembled there. Proud provincial warriors, chafing under the dominion of the empire. Farmers grown lean but no less proud under the order of tribute to be sent to the capitol. Priests, stung by the fact that all their knowledge of the workings of tollani came from their conquerors.  And I tasted words like blood pooling on my tongue and pressing against my lips.  I was their slave. They had given me menial tasks beneath a noblewoman, they had beaten me, and now the slightest change of a word I spoke could make them nod, or shake their heads, or leap to their feet with javelins ready.  They were wires and circuits and switches in my hand.  “The Mexica are invaders in this land. They came as beggars before you. Who are they to set themselves up as kings?”  “The Mexica are invaders in this land,” I repeated, and the words were salt rich in my mouth, a swift dagger, lightning. “They came long ago, starving, broken. Yet now they lord themselves over the true sons and daughters of this earth.”  The alien leader’s eyes gleamed, and he leaned forward, and words poured from his mouth like a flooding stream. They came to me through his old advisor, slowly, haltingly, like beads sliding one by one down a chain. He spoke of the gold in the capitol city, a crucial ingredient in a cure for the great sickness that afflicted his planet. He spoke of a vision of the sons of Potonchán fighting side by side with his men, knocking open the storehouses of Tenochtitlan, punishing the foreign interlopers who had forgotten their place and bleeding the natives dry with their tributes and their sacrifices to thirsty gods.  “We will need, ah, servants. Twenty or so clayslaves. Whatever you can spare.”  “They request twenty of our finest clayslaves accompany them.”  Even slowed by the halting speech of the priest, the words were coming too fast. My mind was racing to keep up, to find a weak point, an advantage—  And then they gave it to me.  “We, ah, wish to purchase the—girl slave. As a translator.”  “You will need a new name,” Aguilar, the old one who spoke Nahuatl, told me. “For Hernán to call you.”  I shrugged. “Name me as you wish.”  And so we set out from Potonchán, and I did not look back.  One thought did strike me with something like sorrow: I would not be able to finish the repairs on my clayslaves.  Who would set their broken limbs now?  In the pale light of his primitive lantern there was only the glint of his teeth, sharp like a wolf. Hernán was heavy above me. He did not see me. I could be any woman. I could be any clayslave.  This, then, was not so different.  The strong took what they wished.  They did not notice what the weak stole from them.  “Our commander requires your presence,” Aguilar spat.  “One moment, my lord,” I replied in his own language, rising and following him, my face blank and my heart serene. I could speak it almost perfectly. Aguilar knew that soon, he would no longer be needed. He would be left behind at some encampment, and no longer have the bulk of the army to protect him.  If he had ever been a slave, he would have known better than to let himself become useless.  The scent of smoke grew stronger as we neared the center of the ruined village. There were still smoking embers in some of the places where huts had once been, and bodies lying hacked in half in their doorways. Hernán’s soldiers were rounding up the others, the women, the children, the infirm. They gazed at all around them in shock at all they had lost, their faces pinched tight, their shoulders hunched inward. They could not believe that the strangers had broken the rules of war.  The village had been going to send messengers to Tenochtitlan. They would send none now.  Oh, what was that feeling in my heart? It went so fast, like running hoofbeats, and everything around me was horror and beauty. My hands—my hands were shaking, but why? I longed to pick up a stone—the remnants of the city were beautiful, the fragile carvings of the calmecac, and the beauty made me want to smash them—and I could smash them—  And there was Hernán, casting off his helmet in weariness. His hair was plastered to his skull with sweat. There was a long red line along his cheek, angry against the ghost-paleness of his skin.  “Marina,” he said, “you claimed to have some knowledge of the workings of these infernal devils?” He gestured towards a pile of broken clayslaves. “I have some gunnery officers not unskilled in artificing, but the black magic that powers these clay demons makes Christian men such as they wary. Can you change their workings? Can you make them fight for us?”  My heart beat so quickly that I was surprised it did not burst through my chest; I could feel my blood so surging with tollani that I wonder I did not glow.  “Yes, my lord.” I had to keep my face blank. I had to keep him from seeing. “I could do such a thing.”  “Good,” he repeated, and gazing into the distance, into trees. “I grow tired of listening to Moctezuma’s tributaries telling me that he will not accept a meeting. We will come to him, and if he does not wish to meet then, it will be to his sorrow.”  He did not look at me while he said it. He looked to the trees. He was thinking of those unfaithful soldiers who had not followed him, of the man he had opposed in his own strange power struggles, of the faraway king who would call him a traitor if he did not bring back gold to justify his disobedience. He was speaking to them, not me.  He turned and left without further words, leaving me with Aguilar and the clayslaves. Aguilar began to speak, but I ignored him. He was less even than these smashed fragments of counterfeit humanity.  I ran my hands over their cracked clay skins, stroked their mangled wires and unmeshed gears. Their faces, so empty and lost and somehow plaintive.  Oh, my little lost ones. Oh, my little broken dolls, so eager to serve.  Let Hernán fight his little battles. You will fight for me.  Three months we marched, the autumn deepening, and what a sight we must have been to the inhabitants of Cholula as we swept down upon their city. Hernán and I at the head of the advancing wave, six hundred of the strangers in their heavy armor, riding atop their tall deer and pulling over a dozen of their cannons that shot thunder loud enough to put Tlaloc himself to shame. And shot through them like the warp and weft of cloth were the men of Potonchán and Tlaxcala and Cempoala, who had been won to our side by Hernán’s promises and the honeyed phrases I had put them in. And all around them, their bodies barely scratched by spears and arrows, my clayslaves, shielding them.  At the edge of the city, Hernán halted and called out over its walls, across the expectant hush before the storm of battle. My voice followed his, translating, an echo that rang out over that valley and remained somehow even in the silence, and I felt a roar welling up inside me in response, exultation.  Slowly, haltingly, an old man climbed the steps of the city wall to face us, and gave a harsh croak of surrender.  Hernán turned to me. “Shall we make the empire fear us, my love?”  He was looking right at me. He was looking right at me for the first time, and he saw me, my face left open to reveal my heart, and even if he saw only a fraction of the blood and knife edge joy I felt in my spirit, his own face showed that he recognized it.  “Yes,” I whispered.  We rode into the city, and made it bleed.  “Moctezuma will reply to this message,” Hernán said. There was blood on his face. Mine also. I could taste it when I wet my lips.  We surveyed the city square, packed with the Cholula’s minor nobility. They clutched their children to them, or if they were alone they clutched small treasures and trinkets, or their own arms, as if trying to impart some small measure of warmth. Hernán’s soldiers surrounded them in a tight circle, their tall deer neighing and snapping teeth if any noble strayed too close.  “And how will you send this message, my love?” But I already knew. Some of these people would be cut down. The rest would carry hearts or limbs to Tenochtitlan.  Hernán did not seem to hear me. “I have heard that they slaughter thousands upon the steps of their great temple in the capitol. Is this true?”  Suddenly I was not certain that I had calculated all my variables correctly.  “I have not seen . . . that is, my lord, I have never been . . . ”  “But you have seen sacrifices,” he pushed.  “Yes, my lord,” I said. “It is an honor—it repays the gods for the gift of life, of our tollani—”  He cut me off with an impatient gesture.  “Then let us give your gods a feast.”  In the crowd, was that—no, it could not be—he would have been sent to the capitol by now—he would never have been here in the first place—  And older. Yes, of course. By now, my little brother would be much older.  Hernán raised his hand, and thunder erupted.  My little brother had been solemn beyond his years. He smiled only for me, and even then he would not speak. He was small, so small my mother worried he would not live to see his third year.  Yet somehow he took up more room than me, and so I had to go.  My father lost our fortune, and I was sold into the hands of those who had once been only fit to be my servants.  No one ever suggested sending away my little brother instead.  And so we come to Tenochtitlan, the jewel of the empire, the fulfilled promise of the gods, the sanctuary of the long-wandering Cualha-Mexica.  We crest the hill just as the sun is rising, and in the morning light the buildings look as though they are made of gold. From the way the breath catches in the throats of the aliens, I know they think so.  I have no body. I am made of light, of fire, of tollani. I do not ride but float through the gates of the city, the soldiers around me like the long folds of my great cape.  I have come home, Mother. Are you proud of me? I have made my way home to your birthplace, to my birthright. I am home at last, Mother.  The people on the streets gape up at us, openmouthed, those suave city folk who would have called my family country bumpkins had we come here in my youth. They have never seen such a thing. Not just the aliens, though that would be enough. No, their mouths stay open at the sight of my army.  Clayslaves. Dozens upon dozens. They march in perfect unison, their singular tramp shaking the earth like an immense hand on the drum of the world. They each hold a single sword and what would be oddity in one is menace in a hundred. Their steps are clockwork, their eyes are a cold concession to human form, and stare straight ahead. They have no concept of betrayal.  They are my children, and they are beautiful, and I am bringing them home.  Ah, but this is the part of the story you already know, of course. How could you not? I have overseen the creation of the codices personally.  There was the bureaucrat—and he is only ever just “the bureaucrat”; I made that choice, cut his individuality from the narrative and reduced him to a type, one small piece of my large revenge—whimpering and trembling before Hernán, spouting some drivel about Quetzalcoatl. A child could have seen through this artifice—Moctezuma admitted us only in the hopes of learning our weaknesses.  And here was one weakness already, the light in Hernán’s eyes as I relayed the bureaucrat’s words. Oh, he liked being a god. He liked it a great deal.  (If he had known more of our faith, he might have guessed what was to come. The gods depend on humans, on their sacrifices. The great lean on the small.)  There was the banquet, and surely if you recall no other scene from the codex, you recall this one, lavishly illustrated, dishes piled high with roast dog, tadpole, maize, turkey, fish, mangoes, roast cactus. Ornate cups of strong octli. And the gifts.  The foolish, foolish gifts.  Were I to plot for a thousand years, I could not smear Moctezuma’s name more thoroughly than he did himself, in this moment of naivete.  He gave them gold.  It was what they wanted, was it not? Gold cups, gold plates, gold earrings and necklaces and figurines.  Oh, their eyes at the sight of the gold, like blazing suns set in their faces, their hands twitching eagerly at their sides . . .  Perhaps I should not blame Moctezuma. He was a soft citizen of Tenochtitlan, not of the northern frontier. He did not know what happened when you dangled fresh meat in front of wild dogs.  But in those days, blame rested sweet and warm on my tongue, slid satisfyingly down my throat, burned bright and jagged as lightning in my stomach.  So then there was the pretext. A letter arrived from the coast: a few of Hernán’s allies there had been killed by soldiers of the empire for supporting the Totonacs. Reason enough to take the emperor hostage.  Why should Moctezuma have expected it? He had welcomed them into his home, feasted them, given them honor and gifts.  I could have told him: you must always expect the least likely thing. You must always know that the unwritten rules will be broken. You must never be surprised when your entire world turns upside down.  I could have told him that many, many years ago.  So then the most powerful man in the world was Hernán’s captive, and through him the aliens ruled the city. The people quaked before Hernán as he walked through the streets, issuing his dictates.  And there, so slight as to almost be forgotten, whispering translations, whispering praise, whispering suggestions, changing only the few, the smallest, the most important words—  There, always, was I.  We won, and this should have been the end.  But humans are clumsy things, always outstretching their stories, always lingering on past the end of ink and parchment.  The taste for victory had taken me the way some are taken by coca or octli. It was not a lust for blood, though if blood were spilled in its pursuit I never minded. No, it was victory that I craved, pure and simple, that rising up and up and far above all those who had once towered over me.  At first it was enough to be by Hernán’s side, taking sips of the power that was his. And then later it was enough to step away from him, to organize the distribution of food, of slaves, of gold and other trophies.  And then Hernán left Tenochtitlan—we were, in the end, only one piece of the power struggle he was engaged in across the planet, and his opponents marched ever nearer, bringing censure from his king—and I feared that my hunger would overwhelm me, that I would snatch too much, too fast, that I would blunder my way from my anonymity.  So I turned instead to a different kind of victory.  Tollani.  Tenochtitlan had possessed its secret for generations now, and its wealth lit the city, even the poorest citizens with home lanterns dangling from their ceilings. But beyond its border the people were plunged into darkness. Oh, perhaps a temple here or a mayor’s house there had a son-of-tlaloc in the earth below; perhaps there was occasionally a good enough harvest to charge a few daughters-of-tlaloc to power clayslaves to cut down the maize in the next one. But with these small exceptions, the moon and stars brooked no competition when night fell. After all, sons-of-tlaloc were expensive, and there was only so far the wire could be extended from them before the cost became prohibitive.  So the common wisdom went.  Having already solved the problem of mass-producing daughters-of-tlaloc for my clayslave army, I did not feel that common wisdom had much more to teach me.  And so I turned for a time from politics and instead to my quarters, where I ordered soldiers to bring me wire and star-iron and smiths’ tools—sometimes even the smiths themselves, for neither a noblewoman nor a girl slave has much cause to be taught metalworking. I took care to say little but imply much, and each soldier was convinced—though I never said the words—that I was creating for Hernán a new weapon, one which would surely win their kings’ favor, and their passage home.  I was, of course, doing something much more interesting.  Who says that the tollani must flow only in one direction? Oh, in a daughter-of-tlaloc it made perfect sense. Its huizilopochtli and its xipe totec terminals must always be huizilopochtli and xipe totec, as north must be north and south be south. But in a son-of-tlaloc—  If its tollani could flow north and then south, and then back, and then again, and again—  If you placed a Four Gods Box along the line, sending the tollani not all at once, but cut into pieces with an increased potential difference—  Then only a very thin wire was needed. Then very little power was lost to heat.  Then, suddenly, it became cheap to send light streaming across the empire.  I called it the Two-Lord-and-Lady current, after Ometecuhtli/Omecihuatl, who contained all opposites within theirself, and thus created the world.  And, perhaps, I named it after myself as well.  I have made it sound easy. It was not, of course. Nothing worth having is. I sweated and labored, did and redid the calculations. There was a time I had to have a new smith brought in nearly every two weeks, their predecessors executed as they learned too much.  Thank gods it was never difficult to give the aliens an excuse to spill human blood.  And I made mistakes. There were fires. There were poor materials. There were my hands shaking as I took the last of the coca brought imported from the south, needing to stay up one night longer, needing to know the truth, to know I was right, to know that it could be done.  There were broken machines, there were moments I almost forgot myself and screamed at the soldiers to go away and leave me in peace, there was the light of the tollani next to my shaking hands, taunting me with how close the solution must be, if only I could see it!  There were many, many mistakes.  There was the festival.  The people in the streets were joyful. I could hear their laughter, their eager footsteps. I could not see them. How could I? I was in my quarters. I was on a mission.  Hernán was still far way, embroiled in his struggles, little knowing how soon he would need the strength they sapped from him. Moctezuma had begged Alvarado for permission to celebrate Toxcatl.  Alvarado had asked me.  “It can do no harm,” I told him, my eyes downcast submissively. “And while my lord Quetzalcoatl is gone, it might be best . . . ”  He decided then, the moment I said the god’s name. If I had said “Hernán” it would only have fired his determination to forbid it, cast in stone his desire not to be overshadowed by his commander.  But I said “Quetzalcoatl,” and that made him think of thousands of chests cut open, hearts offered up to the gods. Made him remember how many of us there were, and how few of them.  Sometimes, it was even easier to direct people than clayslaves.  I gave so little thought to it. I had so many more important things to pursue.  And so Toxcatl began.  You have seen the codex. There is no point in telling this part of the story.  It was important to keep Alvarado on my side, so I smiled and pretended to believe him when he said he had only consented provided that there were no human sacrifices, and that none carried any weapons. I agreed that there could have been no other action than that which his valiant men had taken. I concurred that while the massacre was regrettable, these savages must learn their lesson.  I smiled, and nodded, and pretended I did not see the stolen jewelry draped over the aliens: the necklaces of gold, silver, pearls, mother-of-pearl.  And the taste of my victory over the flow of tollani was ashes in my mouth.  The massacre called Hernán quickly back to Tenochtitlan. But it was too late.  Events had been set in motion, and I had been too blind to stop them.  There were riots. Hernán pushed Moctezuma out on a balcony, demanded that he calm the people.  Moctezuma had never had to calm people before. No one had dared question his power.  His body was left like a crumpled rag in the corner of his apartments, the blood staining the floor below, a broken clayslave that no daughter-of-tlaloc could bring back to life.  The aliens’ tall deer buck and rear, the whites of their eyes wide and panicked as the spears fall like rain on us, trapped on the Tlacopan causeway. A soldier to the right of me falls with a scream that becomes a gurgle, a javelin buried in his throat. There is so much screaming that I almost cannot hear the sound of my clayslaves shattering, ceramic shards bursting outwards under the blows of the people of Tenochtitlan. They have remembered who they are, and they are coming for the aliens and traitors.  Are you ashamed, Mother? Your daughter is fleeing the city of her birthright.  A javelin slams into the skull of the alien to my left, and blood splatters across my face.  Tell me, Mother, are you ashamed to see me driven from the city like a common whore?  “Onward!” Hernán cries, grabbing my reins slick with blood and viscera. “We must make it to Tlaxcala!”  Behind us, the backguard is falling, has fallen, is being hacked to pieces, is a river of meat and blood. I imagine I can see light glinting in the blood, the lost gold and jewels, the lost artillery.  I dig my heels into my tall deer, and an arrow clangs off the shield Hernán has raised over my head.  I will be back, Mother. I will be back.  Months later, I came back to a city of the dead.  We were ghosts.  Our footsteps rang too loud in the streets. The walls were lined with dead. New walls had been built of bodies stacked like stones. The bodies were covered in sores that wept, and the stench was a living thing that wrapped its body around the buildings and sank its claws into my flesh and pulled me down, down, down into the dirt.  Even the aliens were silent. Even they had never seen so much devastation.  We entered a house. A commoner and his family lay on the ground. Their features were crowded and melted and blurred from the oozing spots.  We left.  We entered another house. It was the house of a noble, richer than ever my family was, and so brightly painted that the colors seemed to sing.  All of the household were dead, and their corpses make no prettier a picture than those of the commoners.  The first survivors rose like wraiths at the edge of our sight, thin and shaking as they propped themselves upwards, their mouths gaping in soundless pleas for water. I bade the soldiers attend to them, and I wondered what had spared them? What spared the aliens? What spared me?  And then I saw the other survivors.  They had always been there, but they only now began to move.  The clayslaves.  They had marched behind us the entire time, slowly, steps faltering as their daughters-of-tlaloc dripped their last dregs of tollani into unoiled gears and springs, powered by small-tlalocs slowly being drained of energy. They stared with their unseeing eyes of malachite. They held their earthen hands up to me.  They blended into the walls, and no one else saw them but me, and no one else saw what I planned to do with them.  I waited until Hernán’s return.  He saw me when he entered, and he paused one second at my smile, but he did not see the clayslaves with the clay carefully chipped from the palms of their right hands, their wires exposed.  The strong do not see the weak.  This is my favorite page of the codex. The clayslaves rise—the weavers, the potters, the field hands, the scribes—their right hands grasping at the skin and armor of the aliens, the great torrents of tollani coursing through them with such strength that they seem almost pushed off the page.  There was no time for a proper sacrifice, and so the dead were tied with weights and cast into the lake, and the still barely living were dragged up the steps of the Great Temple and their beating hearts cut from them in the old fashion to feed the gods and cause them to smile on our enterprise. It was priests who did this last work, for already my clayslaves were busy on the next task, smelting ore and melting metal instruments down, searching out copper and iron wiring in every part of the city and bringing it to the craftsmen’s quarters, where the dead craftsmen’s clayslaves drew it into long, fine wires. These wires were picked up by other clayslaves and taken to the borders of our city, where they were woven into a great series of fences, nearly invisible, but coursing with tollani drawn from the turning wheel of the newly repaired son-of-tlaloc in the Great Temple.  Oh, how the aliens thundered across the bridge on their tall deer, the glint of their carapaces in the sun as though they were a stream of silver. Clayslaves shot arrows for the look of it, and they came all the faster, the wooden beams glancing off that armor, that thick, strong, impenetrable, metal armor—  They hit the first row of fencing and there was a scream, and a flare of light, and the sweet scent of sizzling fat—  And others broke past them, but there were so many gates—and some took to the water, but they should have looked to see the fish floating dead on its surface, the wires dangling down to its depths—  The clayslaves took those last few that fell from their horses before that last gate, smote them with their exposed hands—  And watching it all, clasped tight in the left hand of my personal clayslave, was Hernán.  “You taught me much, my lord. You had great weapons, true, and we never could have stood against your plague, but even without these you might have triumphed. Your genius was your alliances. The empire made too many enemies with its old habits of sacrifice.” I let my hand wander down Cortes’ face, tracing the rough skin. “And yet the gods must be thanked. How are we to reconcile?”  Hernán glared at me from where he was bound, tears streaming down his face from the pain that I could not entirely keep at bay with coca leaves, the rock beneath him already long bloodstained even without that shed by his exposed heart, his chest shredded by clay left hands.  “You have a cold heart, Marina,” he said through gritted teeth. “I have often wondered if your people did not sacrifice it for you, long ago.”  “I am not cold, my love,” I said. “Have I not given you a glorious last sight to behold?”  Hernán looked out from the pinnacle of the Great Temple, Tenochtitlan spread out in ruins like a body hacked to pieces. “I see nothing.”  He never had.  But perhaps I wanted him to, for I answered:  “Tenochtitlan has become a city of ghosts, but life will spring from it once more. We shall be as the king in the story Aguilar told me, waiting across the sea for the time that we are needed.” I left him behind on his pedestal for a moment to gaze out at my city, swarming with clayslaves, and dotted with a few pockmarked humans. Oh, my city. “There is some strength in the survivors we do not know. Our priests will study it and unlock it, as we unlocked the tollani of copper and iron. Our children will inherit this strength, and our children’s children, and we will build clayslaves until each house in this city is full once more. Across the sea your name will be forgotten until the day we come in our ships, bringing cleansing lightning to your land of death and disease. And home we will bring our prisoners, and sacrifice them atop our temples, and the gods will suckle at this water of life, and we will not provoke our neighbors.  “But do not think us ungrateful for what you brought us. We will not be wasteful.  “This will be a new age.”  Hernán’s heart jumped in its cradle of flesh and bone, its tempo speeding as I expounded my plans.  “You bitch,” he whispered. “You whore bitch.”  “You will die, my love,” I said, and I kissed him, and the blood as he bit my lip was sweet, as sweet as resistance always is compared to surrender. “You will die, but the tollani will keep your heart beating for months, and the gods will drink long and deep and delight in it. You will be a slow feast to be savored.”  “I loved you,” and the words were a demand to restore a world that I had already killed.  “Your love is dominion and death,” I said. “I thank you, but I do not accept it.”  And then I cut his throat.  I pulled his heart loose from the shelter of his chest, settling it in a new cradle of copper wire before him where it beat, evenly and ecstatically and for me, for the gods, for the future of Tenochtitlan.  He saw me then. He saw all of me.  I kissed him once more as the dawn light spilled over my city.  “I know it hurts, my love,” I whispered against his lips. “It is the birth of a new sun. And birth is always painful.” Gabriela Santiago is a writer, performer, and museum professional living and working in St. Paul, Minnesota. A graduate of Macalester College and the Clarion 2013 writing workshop, her short fiction has previously been published in Strange Horizons, Lady Churchill's Rosebud Wristlet, People of Colo(u)r Destroy Science Fiction!, and People of Colo(u)r Destroy Horror!, among others. She is also the creator of the annual science fiction cabaret Revolutionary Jetpacks. You can follow her @LifeOnEarth89 if you enjoy retweets of everything Katy Manning has ever said.", "text": "6850 words, short story\nMalinche\nThe Eagle Knight came like a star in midday. I looked up, and I saw the profile of his helmet’s beak so sharp against the light, the golden feathers of his wings so bright in the glare of the sun. As though he were Huitzilopochtli himself.\nAnd then he fell.\n“What are you doing?”\nThe Eagle Knight was staring at me, his eyes almost as wild as his helmet-free hair. The light of my lantern cast dancing shadows on his face. He tried to prop himself up, but fell back onto the bed.\n“When you die, it will be my duty to dismantle your wings to make useful mechanisms for the village,” I said. I turned my back to him, felt around the other wing for its daughter-of-tlaloc. Ignored the heat of his gaze on my shoulders. My fingers closed around the daughter, a small round pod; prized it away from the struts of the wings. “One of these will power a farmers’ clayslave for a year.”\nHis voice spat contempt, even through his pain. “What would a peasant girl know of daughters-of-tlaloc and tollani?”\nI could have told him of the days I spent in the calmecac out on the frontier, one of the few girls so honored, watching as the priest-scholars conducted their first experiments with tollani. The thin copper wires connecting the potato to that small airtight lantern with windows of pale pink quartz. That burst of light, how my breath caught in my throat as we became small gods in that temple room.\nI said nothing.\n“I will not die,” he said. Now his voice was a whining plea. “I have a holy duty. I must warn the caravan . . . they must warn the city, the tlatoani . . . ”\nHis fingers scrabbled more at his blankets, and a deep hacking cough, wet with blood, rose in his throat as he tried to stand. An Eagle Knight, weak as a child before me.\nI could feel my own tollani rising in my veins, bright and sparking and heady as octli gulped in secret from my father’s stores.\n“Tell me,” I said. “I will pass on your message.”\n“Why should—” he began, and then, for the first time that night, he truly looked at me. “Ah. Of course. It is your city too.”\nIt had been my city, though I had never seen it. We had been rich, had become richer when copper soared in price and our mines in the north had tripled in worth with the spreading knowledge of the ways tollani might be captured in lanterns, or in the daughters-of-tlaloc that could power more wings and mills and clayslaves than any man might desire.\nMy stepfather lost it all over a round of ullamaliztli.\n“Tell me,” I repeated.\nThe ship creaked and groaned in the wind, men scurrying back and forth, pulling levers and turning gears. Entirely mechanical—not one span of wire, not one spark of tollani. But it flew over the waves, carrying the . . . they were not men.\nThey wore metal shells like the carapaces of beetles, and beneath, monkey hair sprouted out of skin that glowed with sickly light. They gabbled like monkeys too, when they saw me, and they brought forth their weapon—a sound like thunder and pain, like nothing I have known—they tried to catch me as I fell—\nThere was such pride in his voice, even then, even dying. I tried to remember what it had been like to feel such pride.\n“I promise,” I said. “I will pass on your message.”\nAll the breath went out of him then, a sigh like the night wind outside the hut, and it carried away the last of his tollani, so that his eyes dulled and his heart slowed and stopped.\nWhat a strange still thing a body is. To once hold an Eagle Knight and all that pride. To now be nothing but spare parts, flesh and bone. Less than a clayslave even, for those I could repair and call to rise again.\nAnd in the morning, I did not say a thing.\nI swept the floor of my owner’s house. When I was a child, I was told that it was the sacred duty of women—even noblewomen, such as I would one day grow to be—to sweep the floor. It kept the house clean not just of dirt, but of malicious influences; in that moment when dawn swept up over the horizon, a woman with a broom was a soldier against all the forces of chaos.\nNow, I swept the floor only because my owner told me to, and if I did not, I would be beaten.\nBut once, I had wanted to sweep the floor.\nI could remember wanting things, but not as if it had been myself who wanted them—no, it had been some other girl, some bright, loud, foolish girl, jumping up and down, hopping from foot to foot with the whirling force of all the things she desired.\nTo run away from my lessons and join the pochtecha and journey far and wide, perhaps even to that fabled capitol, Tenochtitlan. Or else to please my parents with my weaving and my lessons, so that they might arrange a good marriage for me and I might have many strong children who would earn honor in glorious battle. Or else so that I might become a scribe, or one of the rare women who stayed on to work in the temples, assisting the priests with their studies. I even wished at times for a life ending in childbirth or in picking up arms—the consolation my place at the warriors’ table in the heavens with the men instead of being consigned to the cold emptiness of Mictlan.\nWhere did she go, that girl?\nI remembered how my mother said, “At least this way you will be fed, Tenepal.” My second name meant “she who speaks with liveliness,” and my mother had always smiled when she said it. She smiled then, but it was stretched tight and strange, and I did not believe I knew her.\nBy the time I finished the rest of my duties, others had already stripped away the feathers to add adornment to the cloaks and shields of the village, leaving the skeleton of hollow wooden rods and deer sinews and cactus-cloth string and rubber-coated copper wires for me to strip apart, and around them the muscles of small interlocking gears of iron. And of course, the daughters-of-tlaloc, heavy with power.\nI dragged out the first of the broken clayslaves set aside until trade or plunder brought us parts to repair her—a field hand, the mechanisms within her legs corroded and crumbling with rust. I removed them and set them aside—perhaps our smith could yet salvage some scrap of iron from them—and attempted to replace them with gears and pulleys from the wings. It was a trickier job than I first supposed, as the replacements were of different sizes and gear ratios, and there was much makeshift jerry-rigging before I could make her walk in a straight line without her legs buckling beneath her.\n“You have done good work today,” the priest said over my shoulder. “Will there be any parts to spare for the home lanterns when you are done?”\n“It is doubtful, my lord,” I said, keeping my head bowed. “If you have need of the materials, perhaps it might be best that you take them now, and that I wait for another opportunity to finish my work here.”\n“And risk our mayor’s wrath?” A dry chuckle. “I think not, little one.”\n“More home lanterns could be installed,” I said—though I did not recognize my voice at first— “and much farther from the city square, if I were allowed to look at the son-of-tlaloc beneath the city square. I have an idea—it would take more wire, surely, and greater current of tollani, but if you look at my equations—”\n“That is enough, Malinalli,” the priest snapped, and his voice was hard now, granite and marble. “You are good enough with your hands to do repairs. But leave the tollani to those ordained by the gods.”\n“Yes, my lord,” I said, bending my head further. Who had spoken those words of defiance? That little girl, perhaps. I often thought her long dead until I heard her voice from my lips.\nThe next day, the priest and three warriors went into the jungle.\nA week later, they returned with the aliens.\nThe creatures did not remove their armor, and I wondered if it was shelter from our sun, or supplied some element of their native land not to be found on our shores. The parts that could be seen through the armor were pale as the moon, reddening like the blush on a fruit. Their eyes were pale as jade, and their fur glistened like copper and gold.\nTheir leader was almost human, until he looked at you.\nThere was ice in his eyes, and lightning. I felt the field of his tollani animate not only his body, but the bodies of his men, moving them to do his bidding as he barked orders in his harsh tongue. There was power here, coursing beneath this strange exterior. He was a son-of-tlaloc, its wires wound tight, turning and turning and sending tollani coursing outward from him.\nNone of the strangers spoke Chontal, and so they and our warriors had made do with signs until this point. But when they sat down to feast, I was taken from my post. Their ice-eyed leader would speak in his monkey-babble, and then the old man next to him would speak, haltingly, in Nahuatl, and then I would repeat his words in Chontal. And then our mayor would reply, and the process would repeat itself, in reverse.\n“We, ah, thank you for the—the, the bounty you have spread before us.”\n“We thank you for the bounty you have spread before us.”\nI looked around the gathering, at all who were assembled there. Proud provincial warriors, chafing under the dominion of the empire. Farmers grown lean but no less proud under the order of tribute to be sent to the capitol. Priests, stung by the fact that all their knowledge of the workings of tollani came from their conquerors.\nAnd I tasted words like blood pooling on my tongue and pressing against my lips.\nI was their slave. They had given me menial tasks beneath a noblewoman, they had beaten me, and now the slightest change of a word I spoke could make them nod, or shake their heads, or leap to their feet with javelins ready.\nThey were wires and circuits and switches in my hand.\n“The Mexica are invaders in this land. They came as beggars before you. Who are they to set themselves up as kings?”\n“The Mexica are invaders in this land,” I repeated, and the words were salt rich in my mouth, a swift dagger, lightning. “They came long ago, starving, broken. Yet now they lord themselves over the true sons and daughters of this earth.”\nThe alien leader’s eyes gleamed, and he leaned forward, and words poured from his mouth like a flooding stream. They came to me through his old advisor, slowly, haltingly, like beads sliding one by one down a chain. He spoke of the gold in the capitol city, a crucial ingredient in a cure for the great sickness that afflicted his planet. He spoke of a vision of the sons of Potonchán fighting side by side with his men, knocking open the storehouses of Tenochtitlan, punishing the foreign interlopers who had forgotten their place and bleeding the natives dry with their tributes and their sacrifices to thirsty gods.\n“We will need, ah, servants. Twenty or so clayslaves. Whatever you can spare.”\n“They request twenty of our finest clayslaves accompany them.”\nEven slowed by the halting speech of the priest, the words were coming too fast. My mind was racing to keep up, to find a weak point, an advantage—\nAnd then they gave it to me.\n“We, ah, wish to purchase the—girl slave. As a translator.”\n“You will need a new name,” Aguilar, the old one who spoke Nahuatl, told me. “For Hernán to call you.”\nI shrugged. “Name me as you wish.”\nAnd so we set out from Potonchán, and I did not look back.\nOne thought did strike me with something like sorrow: I would not be able to finish the repairs on my clayslaves.\nWho would set their broken limbs now?\nIn the pale light of his primitive lantern there was only the glint of his teeth, sharp like a wolf. Hernán was heavy above me. He did not see me. I could be any woman. I could be any clayslave.\nThis, then, was not so different.\nThe strong took what they wished.\nThey did not notice what the weak stole from them.\n“Our commander requires your presence,” Aguilar spat.\n“One moment, my lord,” I replied in his own language, rising and following him, my face blank and my heart serene. I could speak it almost perfectly. Aguilar knew that soon, he would no longer be needed. He would be left behind at some encampment, and no longer have the bulk of the army to protect him.\nIf he had ever been a slave, he would have known better than to let himself become useless.\nThe scent of smoke grew stronger as we neared the center of the ruined village. There were still smoking embers in some of the places where huts had once been, and bodies lying hacked in half in their doorways. Hernán’s soldiers were rounding up the others, the women, the children, the infirm. They gazed at all around them in shock at all they had lost, their faces pinched tight, their shoulders hunched inward. They could not believe that the strangers had broken the rules of war.\nThe village had been going to send messengers to Tenochtitlan. They would send none now.\nOh, what was that feeling in my heart? It went so fast, like running hoofbeats, and everything around me was horror and beauty. My hands—my hands were shaking, but why? I longed to pick up a stone—the remnants of the city were beautiful, the fragile carvings of the calmecac, and the beauty made me want to smash them—and I could smash them—\nAnd there was Hernán, casting off his helmet in weariness. His hair was plastered to his skull with sweat. There was a long red line along his cheek, angry against the ghost-paleness of his skin.\n“Marina,” he said, “you claimed to have some knowledge of the workings of these infernal devils?” He gestured towards a pile of broken clayslaves. “I have some gunnery officers not unskilled in artificing, but the black magic that powers these clay demons makes Christian men such as they wary. Can you change their workings? Can you make them fight for us?”\nMy heart beat so quickly that I was surprised it did not burst through my chest; I could feel my blood so surging with tollani that I wonder I did not glow.\n“Yes, my lord.” I had to keep my face blank. I had to keep him from seeing. “I could do such a thing.”\n“Good,” he repeated, and gazing into the distance, into trees. “I grow tired of listening to Moctezuma’s tributaries telling me that he will not accept a meeting. We will come to him, and if he does not wish to meet then, it will be to his sorrow.”\nHe did not look at me while he said it. He looked to the trees. He was thinking of those unfaithful soldiers who had not followed him, of the man he had opposed in his own strange power struggles, of the faraway king who would call him a traitor if he did not bring back gold to justify his disobedience. He was speaking to them, not me.\nHe turned and left without further words, leaving me with Aguilar and the clayslaves. Aguilar began to speak, but I ignored him. He was less even than these smashed fragments of counterfeit humanity.\nI ran my hands over their cracked clay skins, stroked their mangled wires and unmeshed gears. Their faces, so empty and lost and somehow plaintive.\nOh, my little lost ones. Oh, my little broken dolls, so eager to serve.\nLet Hernán fight his little battles. You will fight for me.\nThree months we marched, the autumn deepening, and what a sight we must have been to the inhabitants of Cholula as we swept down upon their city. Hernán and I at the head of the advancing wave, six hundred of the strangers in their heavy armor, riding atop their tall deer and pulling over a dozen of their cannons that shot thunder loud enough to put Tlaloc himself to shame. And shot through them like the warp and weft of cloth were the men of Potonchán and Tlaxcala and Cempoala, who had been won to our side by Hernán’s promises and the honeyed phrases I had put them in. And all around them, their bodies barely scratched by spears and arrows, my clayslaves, shielding them.\nAt the edge of the city, Hernán halted and called out over its walls, across the expectant hush before the storm of battle. My voice followed his, translating, an echo that rang out over that valley and remained somehow even in the silence, and I felt a roar welling up inside me in response, exultation.\nSlowly, haltingly, an old man climbed the steps of the city wall to face us, and gave a harsh croak of surrender.\nHernán turned to me. “Shall we make the empire fear us, my love?”\nHe was looking right at me. He was looking right at me for the first time, and he saw me, my face left open to reveal my heart, and even if he saw only a fraction of the blood and knife edge joy I felt in my spirit, his own face showed that he recognized it.\n“Yes,” I whispered.\nWe rode into the city, and made it bleed.\n“Moctezuma will reply to this message,” Hernán said. There was blood on his face. Mine also. I could taste it when I wet my lips.\nWe surveyed the city square, packed with the Cholula’s minor nobility. They clutched their children to them, or if they were alone they clutched small treasures and trinkets, or their own arms, as if trying to impart some small measure of warmth. Hernán’s soldiers surrounded them in a tight circle, their tall deer neighing and snapping teeth if any noble strayed too close.\n“And how will you send this message, my love?” But I already knew. Some of these people would be cut down. The rest would carry hearts or limbs to Tenochtitlan.\nHernán did not seem to hear me. “I have heard that they slaughter thousands upon the steps of their great temple in the capitol. Is this true?”\nSuddenly I was not certain that I had calculated all my variables correctly.\n“I have not seen . . . that is, my lord, I have never been . . . ”\n“But you have seen sacrifices,” he pushed.\n“Yes, my lord,” I said. “It is an honor—it repays the gods for the gift of life, of our tollani—”\nHe cut me off with an impatient gesture.\n“Then let us give your gods a feast.”\nIn the crowd, was that—no, it could not be—he would have been sent to the capitol by now—he would never have been here in the first place—\nAnd older. Yes, of course. By now, my little brother would be much older.\nHernán raised his hand, and thunder erupted.\nMy little brother had been solemn beyond his years. He smiled only for me, and even then he would not speak. He was small, so small my mother worried he would not live to see his third year.\nYet somehow he took up more room than me, and so I had to go.\nMy father lost our fortune, and I was sold into the hands of those who had once been only fit to be my servants.\nNo one ever suggested sending away my little brother instead.\nAnd so we come to Tenochtitlan, the jewel of the empire, the fulfilled promise of the gods, the sanctuary of the long-wandering Cualha-Mexica.\nWe crest the hill just as the sun is rising, and in the morning light the buildings look as though they are made of gold. From the way the breath catches in the throats of the aliens, I know they think so.\nI have no body. I am made of light, of fire, of tollani. I do not ride but float through the gates of the city, the soldiers around me like the long folds of my great cape.\nI have come home, Mother. Are you proud of me? I have made my way home to your birthplace, to my birthright. I am home at last, Mother.\nThe people on the streets gape up at us, openmouthed, those suave city folk who would have called my family country bumpkins had we come here in my youth. They have never seen such a thing. Not just the aliens, though that would be enough. No, their mouths stay open at the sight of my army.\nClayslaves. Dozens upon dozens. They march in perfect unison, their singular tramp shaking the earth like an immense hand on the drum of the world. They each hold a single sword and what would be oddity in one is menace in a hundred. Their steps are clockwork, their eyes are a cold concession to human form, and stare straight ahead. They have no concept of betrayal.\nThey are my children, and they are beautiful, and I am bringing them home.\nAh, but this is the part of the story you already know, of course. How could you not? I have overseen the creation of the codices personally.\nThere was the bureaucrat—and he is only ever just “the bureaucrat”; I made that choice, cut his individuality from the narrative and reduced him to a type, one small piece of my large revenge—whimpering and trembling before Hernán, spouting some drivel about Quetzalcoatl. A child could have seen through this artifice—Moctezuma admitted us only in the hopes of learning our weaknesses.\nAnd here was one weakness already, the light in Hernán’s eyes as I relayed the bureaucrat’s words. Oh, he liked being a god. He liked it a great deal.\n(If he had known more of our faith, he might have guessed what was to come. The gods depend on humans, on their sacrifices. The great lean on the small.)\nThere was the banquet, and surely if you recall no other scene from the codex, you recall this one, lavishly illustrated, dishes piled high with roast dog, tadpole, maize, turkey, fish, mangoes, roast cactus. Ornate cups of strong octli. And the gifts.\nThe foolish, foolish gifts.\nWere I to plot for a thousand years, I could not smear Moctezuma’s name more thoroughly than he did himself, in this moment of naivete.\nHe gave them gold.\nIt was what they wanted, was it not? Gold cups, gold plates, gold earrings and necklaces and figurines.\nOh, their eyes at the sight of the gold, like blazing suns set in their faces, their hands twitching eagerly at their sides . . .\nPerhaps I should not blame Moctezuma. He was a soft citizen of Tenochtitlan, not of the northern frontier. He did not know what happened when you dangled fresh meat in front of wild dogs.\nBut in those days, blame rested sweet and warm on my tongue, slid satisfyingly down my throat, burned bright and jagged as lightning in my stomach.\nSo then there was the pretext. A letter arrived from the coast: a few of Hernán’s allies there had been killed by soldiers of the empire for supporting the Totonacs. Reason enough to take the emperor hostage.\nWhy should Moctezuma have expected it? He had welcomed them into his home, feasted them, given them honor and gifts.\nI could have told him: you must always expect the least likely thing. You must always know that the unwritten rules will be broken. You must never be surprised when your entire world turns upside down.\nI could have told him that many, many years ago.\nSo then the most powerful man in the world was Hernán’s captive, and through him the aliens ruled the city. The people quaked before Hernán as he walked through the streets, issuing his dictates.\nAnd there, so slight as to almost be forgotten, whispering translations, whispering praise, whispering suggestions, changing only the few, the smallest, the most important words—\nThere, always, was I.\nWe won, and this should have been the end.\nBut humans are clumsy things, always outstretching their stories, always lingering on past the end of ink and parchment.\nThe taste for victory had taken me the way some are taken by coca or octli. It was not a lust for blood, though if blood were spilled in its pursuit I never minded. No, it was victory that I craved, pure and simple, that rising up and up and far above all those who had once towered over me.\nAt first it was enough to be by Hernán’s side, taking sips of the power that was his. And then later it was enough to step away from him, to organize the distribution of food, of slaves, of gold and other trophies.\nAnd then Hernán left Tenochtitlan—we were, in the end, only one piece of the power struggle he was engaged in across the planet, and his opponents marched ever nearer, bringing censure from his king—and I feared that my hunger would overwhelm me, that I would snatch too much, too fast, that I would blunder my way from my anonymity.\nSo I turned instead to a different kind of victory.\nTollani.\nTenochtitlan had possessed its secret for generations now, and its wealth lit the city, even the poorest citizens with home lanterns dangling from their ceilings. But beyond its border the people were plunged into darkness. Oh, perhaps a temple here or a mayor’s house there had a son-of-tlaloc in the earth below; perhaps there was occasionally a good enough harvest to charge a few daughters-of-tlaloc to power clayslaves to cut down the maize in the next one. But with these small exceptions, the moon and stars brooked no competition when night fell. After all, sons-of-tlaloc were expensive, and there was only so far the wire could be extended from them before the cost became prohibitive.\nSo the common wisdom went.\nHaving already solved the problem of mass-producing daughters-of-tlaloc for my clayslave army, I did not feel that common wisdom had much more to teach me.\nAnd so I turned for a time from politics and instead to my quarters, where I ordered soldiers to bring me wire and star-iron and smiths’ tools—sometimes even the smiths themselves, for neither a noblewoman nor a girl slave has much cause to be taught metalworking. I took care to say little but imply much, and each soldier was convinced—though I never said the words—that I was creating for Hernán a new weapon, one which would surely win their kings’ favor, and their passage home.\nI was, of course, doing something much more interesting.\nWho says that the tollani must flow only in one direction? Oh, in a daughter-of-tlaloc it made perfect sense. Its huizilopochtli and its xipe totec terminals must always be huizilopochtli and xipe totec, as north must be north and south be south. But in a son-of-tlaloc—\nIf its tollani could flow north and then south, and then back, and then again, and again—\nIf you placed a Four Gods Box along the line, sending the tollani not all at once, but cut into pieces with an increased potential difference—\nThen only a very thin wire was needed. Then very little power was lost to heat.\nThen, suddenly, it became cheap to send light streaming across the empire.\nI called it the Two-Lord-and-Lady current, after Ometecuhtli/Omecihuatl, who contained all opposites within theirself, and thus created the world.\nAnd, perhaps, I named it after myself as well.\nI have made it sound easy. It was not, of course. Nothing worth having is. I sweated and labored, did and redid the calculations. There was a time I had to have a new smith brought in nearly every two weeks, their predecessors executed as they learned too much.\nThank gods it was never difficult to give the aliens an excuse to spill human blood.\nAnd I made mistakes. There were fires. There were poor materials. There were my hands shaking as I took the last of the coca brought imported from the south, needing to stay up one night longer, needing to know the truth, to know I was right, to know that it could be done.\nThere were broken machines, there were moments I almost forgot myself and screamed at the soldiers to go away and leave me in peace, there was the light of the tollani next to my shaking hands, taunting me with how close the solution must be, if only I could see it!\nThere were many, many mistakes.\nThere was the festival.\nThe people in the streets were joyful. I could hear their laughter, their eager footsteps. I could not see them. How could I? I was in my quarters. I was on a mission.\nHernán was still far way, embroiled in his struggles, little knowing how soon he would need the strength they sapped from him. Moctezuma had begged Alvarado for permission to celebrate Toxcatl.\nAlvarado had asked me.\n“It can do no harm,” I told him, my eyes downcast submissively. “And while my lord Quetzalcoatl is gone, it might be best . . . ”\nHe decided then, the moment I said the god’s name. If I had said “Hernán” it would only have fired his determination to forbid it, cast in stone his desire not to be overshadowed by his commander.\nBut I said “Quetzalcoatl,” and that made him think of thousands of chests cut open, hearts offered up to the gods. Made him remember how many of us there were, and how few of them.\nSometimes, it was even easier to direct people than clayslaves.\nI gave so little thought to it. I had so many more important things to pursue.\nAnd so Toxcatl began.\nYou have seen the codex. There is no point in telling this part of the story.\nIt was important to keep Alvarado on my side, so I smiled and pretended to believe him when he said he had only consented provided that there were no human sacrifices, and that none carried any weapons. I agreed that there could have been no other action than that which his valiant men had taken. I concurred that while the massacre was regrettable, these savages must learn their lesson.\nI smiled, and nodded, and pretended I did not see the stolen jewelry draped over the aliens: the necklaces of gold, silver, pearls, mother-of-pearl.\nAnd the taste of my victory over the flow of tollani was ashes in my mouth.\nThe massacre called Hernán quickly back to Tenochtitlan. But it was too late.\nEvents had been set in motion, and I had been too blind to stop them.\nThere were riots. Hernán pushed Moctezuma out on a balcony, demanded that he calm the people.\nMoctezuma had never had to calm people before. No one had dared question his power.\nHis body was left like a crumpled rag in the corner of his apartments, the blood staining the floor below, a broken clayslave that no daughter-of-tlaloc could bring back to life.\nThe aliens’ tall deer buck and rear, the whites of their eyes wide and panicked as the spears fall like rain on us, trapped on the Tlacopan causeway. A soldier to the right of me falls with a scream that becomes a gurgle, a javelin buried in his throat. There is so much screaming that I almost cannot hear the sound of my clayslaves shattering, ceramic shards bursting outwards under the blows of the people of Tenochtitlan. They have remembered who they are, and they are coming for the aliens and traitors.\nAre you ashamed, Mother? Your daughter is fleeing the city of her birthright.\nA javelin slams into the skull of the alien to my left, and blood splatters across my face.\nTell me, Mother, are you ashamed to see me driven from the city like a common whore?\n“Onward!” Hernán cries, grabbing my reins slick with blood and viscera. “We must make it to Tlaxcala!”\nBehind us, the backguard is falling, has fallen, is being hacked to pieces, is a river of meat and blood. I imagine I can see light glinting in the blood, the lost gold and jewels, the lost artillery.\nI dig my heels into my tall deer, and an arrow clangs off the shield Hernán has raised over my head.\nI will be back, Mother. I will be back.\nMonths later, I came back to a city of the dead.\nWe were ghosts.\nOur footsteps rang too loud in the streets. The walls were lined with dead. New walls had been built of bodies stacked like stones. The bodies were covered in sores that wept, and the stench was a living thing that wrapped its body around the buildings and sank its claws into my flesh and pulled me down, down, down into the dirt.\nEven the aliens were silent. Even they had never seen so much devastation.\nWe entered a house. A commoner and his family lay on the ground. Their features were crowded and melted and blurred from the oozing spots.\nWe left.\nWe entered another house. It was the house of a noble, richer than ever my family was, and so brightly painted that the colors seemed to sing.\nAll of the household were dead, and their corpses make no prettier a picture than those of the commoners.\nThe first survivors rose like wraiths at the edge of our sight, thin and shaking as they propped themselves upwards, their mouths gaping in soundless pleas for water. I bade the soldiers attend to them, and I wondered what had spared them? What spared the aliens? What spared me?\nAnd then I saw the other survivors.\nThey had always been there, but they only now began to move.\nThe clayslaves.\nThey had marched behind us the entire time, slowly, steps faltering as their daughters-of-tlaloc dripped their last dregs of tollani into unoiled gears and springs, powered by small-tlalocs slowly being drained of energy. They stared with their unseeing eyes of malachite. They held their earthen hands up to me.\nThey blended into the walls, and no one else saw them but me, and no one else saw what I planned to do with them.\nI waited until Hernán’s return.\nHe saw me when he entered, and he paused one second at my smile, but he did not see the clayslaves with the clay carefully chipped from the palms of their right hands, their wires exposed.\nThe strong do not see the weak.\nThis is my favorite page of the codex. The clayslaves rise—the weavers, the potters, the field hands, the scribes—their right hands grasping at the skin and armor of the aliens, the great torrents of tollani coursing through them with such strength that they seem almost pushed off the page.\nThere was no time for a proper sacrifice, and so the dead were tied with weights and cast into the lake, and the still barely living were dragged up the steps of the Great Temple and their beating hearts cut from them in the old fashion to feed the gods and cause them to smile on our enterprise. It was priests who did this last work, for already my clayslaves were busy on the next task, smelting ore and melting metal instruments down, searching out copper and iron wiring in every part of the city and bringing it to the craftsmen’s quarters, where the dead craftsmen’s clayslaves drew it into long, fine wires. These wires were picked up by other clayslaves and taken to the borders of our city, where they were woven into a great series of fences, nearly invisible, but coursing with tollani drawn from the turning wheel of the newly repaired son-of-tlaloc in the Great Temple.\nOh, how the aliens thundered across the bridge on their tall deer, the glint of their carapaces in the sun as though they were a stream of silver. Clayslaves shot arrows for the look of it, and they came all the faster, the wooden beams glancing off that armor, that thick, strong, impenetrable, metal armor—\nThey hit the first row of fencing and there was a scream, and a flare of light, and the sweet scent of sizzling fat—\nAnd others broke past them, but there were so many gates—and some took to the water, but they should have looked to see the fish floating dead on its surface, the wires dangling down to its depths—\nThe clayslaves took those last few that fell from their horses before that last gate, smote them with their exposed hands—\nAnd watching it all, clasped tight in the left hand of my personal clayslave, was Hernán.\n“You taught me much, my lord. You had great weapons, true, and we never could have stood against your plague, but even without these you might have triumphed. Your genius was your alliances. The empire made too many enemies with its old habits of sacrifice.” I let my hand wander down Cortes’ face, tracing the rough skin. “And yet the gods must be thanked. How are we to reconcile?”\nHernán glared at me from where he was bound, tears streaming down his face from the pain that I could not entirely keep at bay with coca leaves, the rock beneath him already long bloodstained even without that shed by his exposed heart, his chest shredded by clay left hands.\n“You have a cold heart, Marina,” he said through gritted teeth. “I have often wondered if your people did not sacrifice it for you, long ago.”\n“I am not cold, my love,” I said. “Have I not given you a glorious last sight to behold?”\nHernán looked out from the pinnacle of the Great Temple, Tenochtitlan spread out in ruins like a body hacked to pieces. “I see nothing.”\nHe never had.\nBut perhaps I wanted him to, for I answered:\n“Tenochtitlan has become a city of ghosts, but life will spring from it once more. We shall be as the king in the story Aguilar told me, waiting across the sea for the time that we are needed.” I left him behind on his pedestal for a moment to gaze out at my city, swarming with clayslaves, and dotted with a few pockmarked humans. Oh, my city. “There is some strength in the survivors we do not know. Our priests will study it and unlock it, as we unlocked the tollani of copper and iron. Our children will inherit this strength, and our children’s children, and we will build clayslaves until each house in this city is full once more. Across the sea your name will be forgotten until the day we come in our ships, bringing cleansing lightning to your land of death and disease. And home we will bring our prisoners, and sacrifice them atop our temples, and the gods will suckle at this water of life, and we will not provoke our neighbors.\n“But do not think us ungrateful for what you brought us. We will not be wasteful.\n“This will be a new age.”\nHernán’s heart jumped in its cradle of flesh and bone, its tempo speeding as I expounded my plans.\n“You bitch,” he whispered. “You whore bitch.”\n“You will die, my love,” I said, and I kissed him, and the blood as he bit my lip was sweet, as sweet as resistance always is compared to surrender. “You will die, but the tollani will keep your heart beating for months, and the gods will drink long and deep and delight in it. You will be a slow feast to be savored.”\n“I loved you,” and the words were a demand to restore a world that I had already killed.\n“Your love is dominion and death,” I said. “I thank you, but I do not accept it.”\nAnd then I cut his throat.\nI pulled his heart loose from the shelter of his chest, settling it in a new cradle of copper wire before him where it beat, evenly and ecstatically and for me, for the gods, for the future of Tenochtitlan.\nHe saw me then. He saw all of me.\nI kissed him once more as the dawn light spilled over my city.\n“I know it hurts, my love,” I whispered against his lips. “It is the birth of a new sun. And birth is always painful.”\nGabriela Santiago is a writer, performer, and museum professional living and working in St. Paul, Minnesota. A graduate of Macalester College and the Clarion 2013 writing workshop, her short fiction has previously been published in Strange Horizons, Lady Churchill's Rosebud Wristlet, People of Colo(u)r Destroy Science Fiction!, and People of Colo(u)r Destroy Horror!, among others. She is also the creator of the annual science fiction cabaret Revolutionary Jetpacks. You can follow her @LifeOnEarth89 if you enjoy retweets of everything Katy Manning has ever said.", "source": "https://clarkesworldmagazine.com/santiago_09_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Malinche by Gabriela Santiago"}