{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Joyce Frohn", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "VS9o5QBVJ3DjOTXVLG8JH5hr+l8=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Where's My Flying Car? The Future of Personal Aviation  It's 2009. Where's my jet-pack, my car-plane hybrid? Where are all of those neat vehicles that science fiction promised? Actually they are already here, along with things that no science fiction writer forecast. Aviation pioneers around the world are working hard to bring us the vehicles of the future. Some of them you can even buy, though getting permission to fly them around may be harder. Here is a quick glimpse of what the future looks like today.  Jet-packs  Jet-packs are the best-loved and least practical of all science fiction gadgets. Usually they are more noise than propulsion, but the new Martin Jet Pack has finally broken through the technical ceiling. Their packs can last up to a half-hour of flight time, which is more than double the previous record. This allows them to reach a height of 500 feet or travel 31.5 miles (one or the other, not both). Early jet packs also ran on explosive rocket fuel, but the Martin uses ordinary gasoline.  If you order a Martin you can expect to wait at least a year for delivery, but there is no license required and training comes with purchase. You do have to be over 5'5” and under 250 pounds to use it. Alone the machine weights 250 pounds, without the recommended parachute. It costs as much as a luxury car, but it is fun, if you like loud and a little rough. I've been told the steering is tricky so practice someplace empty before trying a city.    Could you fly to work using it? That's the biggest problem with things that take a long time to get to market: regulations can get there before you. You can't use a jet pack in many cities without getting a lot of permits. You need to check on noise ordinances and specific rules for jet-packs. If those aren't an issue, make sure you have a crew of at least three standing by to help you haul the jetpack someplace safe after landing. Hopefully they'll be adding a trailer or hauling system soon. Don't forget the earplugs; it's still really loud, as the video makes clear. You'll need concrete or tarmac to take off and land on.  Flying boats  There have been many plane/ boat crosses in the history of aviation, dating right back to the time of the Wright brothers. Most amphibious planes are hard to get into due to their seat height, and many can't take off from solid ground. The ICON is making waves. It can take off from land or water and its wings fold so it can go into the optional trailer. It runs on regular gas and has an MP3 player dock and water-proof leather seats. It can pull a water-skier, although they haven't found a volunteer yet.    This is the perfect vehicle for people who can't afford both a new plane and a new boat, though it does require a pilot's license. It costs $139,000, and if you order now you should get it by 2010. You can't use it to get to work unless you work on the waterfront, but you can fish from the pivoting pilot's seat. And you can take off from any river without filing a flight plan, as long as you're not landing at an airport.  Flying cars  The Terrafugia Transition is the best-known of the new car-plane hybrids being developed. It is said to have begun life as a research paper at MIT. They solved the puzzle of crossing an airplane and a car by making a plane that can turn into a barely street legal ground vehicle. The wings fold alongside the cabin. It can reach 65 miles per hour, and gets 30 mpg, on the ground. It also runs on regular gas, which is a good thing as aviation fuel is running at $5.50 an Imperial Litre. As a plane it has a range of 460 miles. One of the avaible options is a built-in plane sized parachute, which is a common option in new planes.    If you order a Transition now, hopefully you will get it by 2010. There were a lot of advance orders. It requires a standard sport pilot's license and a driver's license. The latter is probably harder to get, although it takes twenty hours of training to get the pilot's license and that can cost up to $3,000. A Transition costs $200,000 with the first $100,000 up front. You could drive it to work.  A little aside here about licenses: it is easier to fly a plane than drive a car. The US Government recognizes this. You must be sixteen to legally learn to drive a car; pilot's licenses start (with restrictions) at 12, with a full license available at 17.  There is said to be another roadable airplane in development, the Cara Vellair Roadable Aircraft. They have booked a space at EAAirVenture for August of this year, but they are staying silent on the web. The Martin JetPack, Icon and many other innovative vehicles have debuted at that show in other years.  Helicycles  The Moller Skycar is another interesting vehicle in development. It is a motorcycle/ helicopter cross. Helicopters and motorcycles both require extra licensing and extra skill. Airplane pilots half joke that, “Helicopters are spare parts flying in formation.” Combining the two most hazardous methods of transportation into one seems like asking for trouble. Also they have been working on it since 2003 without going into production. Don't hold your breath.  If this thing takes off, you could take it to work and take off from an empty parking lot. I wouldn't try either of these things, but you could.   Somewhat less risky is the motorcycle/autogyro combo from Holland: the PAL-V. This has a range of 340 miles, runs on ordinary gas and has a top speed of 125 miles per hour on land or air. It will be able to take off in a 30x100 meter space. The manufacturers are urging the Dutch government to scatter launch pads around various Dutch cities. It requires both licenses. Expect it in 2010, or maybe a year or two later. It looks very cool: exactly like you saw on the covers of the old pulps right down to the red and black paint job. If it ever goes into production you could drive it to work.  Gyrocopters  Gyrocopters are strange plane/ helicopter hybrids. There are several different companies that make them. You may remember seeing one in the Bond film, “You Only Live Twice”. They are mainly sold as kits that can take 200 hundred to 400 hours to assemble, depending on your skill level. Most types run on gas, though some need aviation fuel. They weigh about 250 pounds without the pilot and require 40-250 feet to take off, depending on model, weight and pilot skill level.  One of main advantages of gyrocopters is their safety. If the engine conks out, you ride down in a spiral with some glide, unlike a helicopter which always goes straight down with a resounding bump. However, they require special training beyond a regular pilot's license. Again you'll pay about as much as a luxury car. You couldn't take one to work unless you live a rural area, and they can't land at airports.  ParaPlanes  Another option is the ParaPlane. There are several different manufacturers, but only two basic kinds: backpack and go-cart. The wing is a parafoil parachute and the engine is a lawnmower or other small engine with a propeller. Steering is done with pull cords. Their takeoff speed is usually around 26 miles per hour. That is also their cruising speed. No license is required and they run on gas or a gas/oil blend. They can reach 10,000 feet, if the pilot is dressed warmly enough.    You can get a two-seater and buy training with a pilot or just buy one and learn as you go. The sane way to train for a parplane is to take parachuting lessons first, and then try flying but have a radio with an experienced paraplane operator on the line. The less sane but common method is to be launched and learn in midair. The ones with wheels are pulled by a car or truck to launch. Those without wheels are often launched by having the pilot strap the packed parachute and engine on and then get onto a chair on a trailer. The tow vehicle drives until it reaches 35 miles an hour and then stops. Hopefully the parachute will open and the pilot will start the engine before hitting anything. Some people are working on stationary launches, but the idea of being a human catapult can make folk nervous.  If any thing goes wrong with the engine, you are parachuting in a chair or a dune buggy. If your parachute fails, use the reserve. Some have crash cages and rollbars.  ParaPlanes usually require about fifty feet to take off and three feet to land. They can cruise at two feet off the ground if you want to. Look out for trees. If you live in rural area, they might not only be able take you to work; you could also use them at work. Ranchers have found that five to ten feet off the ground is ideal for rounding up animals. They are all banned from airports and populated areas.  There are some self-launching ParaPlanes - a good example would be the Parajet Skycar trying to fly/drive around Africa – and these should be considered a small plane, or dune buggy if they're on the ground. Even the biggest are not street legal. They can be adapted to use pontoons or skis. The price for these is in the twenty thousand dollars range, or a less if you buy used or get a kit and assemble it yourself. They can be used by anyone tall enough to use a go-cart. With a few lessons on the ground, a ten-year could fly one legally.  The smaller ParaPlanes can fit in the trunk of a car. They are too small to show up on most radar and can go from trunk to sky in 10 minutes with a tow. The most solid things on the smaller ones are the engine and the pilot. Without a pilot they weigh about 45 pounds. These small ones can be bought used for as little as $1,000. You can also get plans to assemble one from parts and pay about a thousand dollars. Used ones have turned up for sale for as little as $300.  The Future of Fuel  When it comes to alternative fuels, bio jet fuels are currently in the news. They are only the beginning. Smaller planes, gliders and paraplanes with solid frames can be converted to plug-ins. The Electra Flyer Company supplies the motors for $4,200. It takes about two hours to fully charge a plane's batteries for a day. The same company sells a generator that fits in the plane so that if you land someplace without electricity you can use gasoline to charge up your electric plane.  I haven't touched on planes that run on rocket fuel (the fabled NitrOx), or pure alcohol, which is favored by some acrobatic pilots. The main disadvantage of pure alcohol is the invisible flame, which is why many airports have banned it.  Curiouser and Curiouser  There are stranger things in the skies. Homebuilt personal dirigibles, personal hovercraft, wearable jets and hang gliders with motors are all out there. Any one of them might be the wave of the future, or be what science fiction writers will make fun of fifty years from now. No matter: the important thing is that the present is as strange and wonderful as any of us could wish.", "text": "Non-Fiction\nWhere's My Flying Car? The Future of Personal Aviation\nIt's 2009. Where's my jet-pack, my car-plane hybrid? Where are all of those neat vehicles that science fiction promised? Actually they are already here, along with things that no science fiction writer forecast. Aviation pioneers around the world are working hard to bring us the vehicles of the future. Some of them you can even buy, though getting permission to fly them around may be harder. Here is a quick glimpse of what the future looks like today.\nJet-packs\nJet-packs are the best-loved and least practical of all science fiction gadgets. Usually they are more noise than propulsion, but the new Martin Jet Pack has finally broken through the technical ceiling. Their packs can last up to a half-hour of flight time, which is more than double the previous record. This allows them to reach a height of 500 feet or travel 31.5 miles (one or the other, not both). Early jet packs also ran on explosive rocket fuel, but the Martin uses ordinary gasoline.\nIf you order a Martin you can expect to wait at least a year for delivery, but there is no license required and training comes with purchase. You do have to be over 5'5” and under 250 pounds to use it. Alone the machine weights 250 pounds, without the recommended parachute. It costs as much as a luxury car, but it is fun, if you like loud and a little rough. I've been told the steering is tricky so practice someplace empty before trying a city.\nCould you fly to work using it? That's the biggest problem with things that take a long time to get to market: regulations can get there before you. You can't use a jet pack in many cities without getting a lot of permits. You need to check on noise ordinances and specific rules for jet-packs. If those aren't an issue, make sure you have a crew of at least three standing by to help you haul the jetpack someplace safe after landing. Hopefully they'll be adding a trailer or hauling system soon. Don't forget the earplugs; it's still really loud, as the video makes clear. You'll need concrete or tarmac to take off and land on.\nFlying boats\nThere have been many plane/ boat crosses in the history of aviation, dating right back to the time of the Wright brothers. Most amphibious planes are hard to get into due to their seat height, and many can't take off from solid ground. The ICON is making waves. It can take off from land or water and its wings fold so it can go into the optional trailer. It runs on regular gas and has an MP3 player dock and water-proof leather seats. It can pull a water-skier, although they haven't found a volunteer yet.\nThis is the perfect vehicle for people who can't afford both a new plane and a new boat, though it does require a pilot's license. It costs $139,000, and if you order now you should get it by 2010. You can't use it to get to work unless you work on the waterfront, but you can fish from the pivoting pilot's seat. And you can take off from any river without filing a flight plan, as long as you're not landing at an airport.\nFlying cars\nThe Terrafugia Transition is the best-known of the new car-plane hybrids being developed. It is said to have begun life as a research paper at MIT. They solved the puzzle of crossing an airplane and a car by making a plane that can turn into a barely street legal ground vehicle. The wings fold alongside the cabin. It can reach 65 miles per hour, and gets 30 mpg, on the ground. It also runs on regular gas, which is a good thing as aviation fuel is running at $5.50 an Imperial Litre. As a plane it has a range of 460 miles. One of the avaible options is a built-in plane sized parachute, which is a common option in new planes.\nIf you order a Transition now, hopefully you will get it by 2010. There were a lot of advance orders. It requires a standard sport pilot's license and a driver's license. The latter is probably harder to get, although it takes twenty hours of training to get the pilot's license and that can cost up to $3,000. A Transition costs $200,000 with the first $100,000 up front. You could drive it to work.\nA little aside here about licenses: it is easier to fly a plane than drive a car. The US Government recognizes this. You must be sixteen to legally learn to drive a car; pilot's licenses start (with restrictions) at 12, with a full license available at 17.\nThere is said to be another roadable airplane in development, the Cara Vellair Roadable Aircraft. They have booked a space at EAAirVenture for August of this year, but they are staying silent on the web. The Martin JetPack, Icon and many other innovative vehicles have debuted at that show in other years.\nHelicycles\nThe Moller Skycar is another interesting vehicle in development. It is a motorcycle/ helicopter cross. Helicopters and motorcycles both require extra licensing and extra skill. Airplane pilots half joke that, “Helicopters are spare parts flying in formation.” Combining the two most hazardous methods of transportation into one seems like asking for trouble. Also they have been working on it since 2003 without going into production. Don't hold your breath.\nIf this thing takes off, you could take it to work and take off from an empty parking lot. I wouldn't try either of these things, but you could.\nSomewhat less risky is the motorcycle/autogyro combo from Holland: the PAL-V. This has a range of 340 miles, runs on ordinary gas and has a top speed of 125 miles per hour on land or air. It will be able to take off in a 30x100 meter space. The manufacturers are urging the Dutch government to scatter launch pads around various Dutch cities. It requires both licenses. Expect it in 2010, or maybe a year or two later. It looks very cool: exactly like you saw on the covers of the old pulps right down to the red and black paint job. If it ever goes into production you could drive it to work.\nGyrocopters\nGyrocopters are strange plane/ helicopter hybrids. There are several different companies that make them. You may remember seeing one in the Bond film, “You Only Live Twice”. They are mainly sold as kits that can take 200 hundred to 400 hours to assemble, depending on your skill level. Most types run on gas, though some need aviation fuel. They weigh about 250 pounds without the pilot and require 40-250 feet to take off, depending on model, weight and pilot skill level.\nOne of main advantages of gyrocopters is their safety. If the engine conks out, you ride down in a spiral with some glide, unlike a helicopter which always goes straight down with a resounding bump. However, they require special training beyond a regular pilot's license. Again you'll pay about as much as a luxury car. You couldn't take one to work unless you live a rural area, and they can't land at airports.\nParaPlanes\nAnother option is the ParaPlane. There are several different manufacturers, but only two basic kinds: backpack and go-cart. The wing is a parafoil parachute and the engine is a lawnmower or other small engine with a propeller. Steering is done with pull cords. Their takeoff speed is usually around 26 miles per hour. That is also their cruising speed. No license is required and they run on gas or a gas/oil blend. They can reach 10,000 feet, if the pilot is dressed warmly enough.\nYou can get a two-seater and buy training with a pilot or just buy one and learn as you go. The sane way to train for a parplane is to take parachuting lessons first, and then try flying but have a radio with an experienced paraplane operator on the line. The less sane but common method is to be launched and learn in midair. The ones with wheels are pulled by a car or truck to launch. Those without wheels are often launched by having the pilot strap the packed parachute and engine on and then get onto a chair on a trailer. The tow vehicle drives until it reaches 35 miles an hour and then stops. Hopefully the parachute will open and the pilot will start the engine before hitting anything. Some people are working on stationary launches, but the idea of being a human catapult can make folk nervous.\nIf any thing goes wrong with the engine, you are parachuting in a chair or a dune buggy. If your parachute fails, use the reserve. Some have crash cages and rollbars.\nParaPlanes usually require about fifty feet to take off and three feet to land. They can cruise at two feet off the ground if you want to. Look out for trees. If you live in rural area, they might not only be able take you to work; you could also use them at work. Ranchers have found that five to ten feet off the ground is ideal for rounding up animals. They are all banned from airports and populated areas.\nThere are some self-launching ParaPlanes - a good example would be the Parajet Skycar trying to fly/drive around Africa – and these should be considered a small plane, or dune buggy if they're on the ground. Even the biggest are not street legal. They can be adapted to use pontoons or skis. The price for these is in the twenty thousand dollars range, or a less if you buy used or get a kit and assemble it yourself. They can be used by anyone tall enough to use a go-cart. With a few lessons on the ground, a ten-year could fly one legally.\nThe smaller ParaPlanes can fit in the trunk of a car. They are too small to show up on most radar and can go from trunk to sky in 10 minutes with a tow. The most solid things on the smaller ones are the engine and the pilot. Without a pilot they weigh about 45 pounds. These small ones can be bought used for as little as $1,000. You can also get plans to assemble one from parts and pay about a thousand dollars. Used ones have turned up for sale for as little as $300.\nThe Future of Fuel\nWhen it comes to alternative fuels, bio jet fuels are currently in the news. They are only the beginning. Smaller planes, gliders and paraplanes with solid frames can be converted to plug-ins. The Electra Flyer Company supplies the motors for $4,200. It takes about two hours to fully charge a plane's batteries for a day. The same company sells a generator that fits in the plane so that if you land someplace without electricity you can use gasoline to charge up your electric plane.\nI haven't touched on planes that run on rocket fuel (the fabled NitrOx), or pure alcohol, which is favored by some acrobatic pilots. The main disadvantage of pure alcohol is the invisible flame, which is why many airports have banned it.\nCuriouser and Curiouser\nThere are stranger things in the skies. Homebuilt personal dirigibles, personal hovercraft, wearable jets and hang gliders with motors are all out there. Any one of them might be the wave of the future, or be what science fiction writers will make fun of fifty years from now. No matter: the important thing is that the present is as strange and wonderful as any of us could wish.", "source": "https://clarkesworldmagazine.com/frohn_04_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Where's My Flying Car? The Future of Personal Aviation by Joyce Frohn"}