{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neal Asher", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "qWjMNOiSujX4ZDJy2AyXZRvPEt8=", "id": null, "license": null, "comments": "", "raw_text": "8450 words, novelette  The Host  Something hit on the way in. Ivebek Cloon felt the weird distortion of the ship surfacing from U-space, which to him was like the hangover from a neuro-enhancer packed into a couple of seconds. A resounding crash ensued, along with the sensation of someone trying to drag the world away, like a rug from under his feet. Grav went off and he floated up from his bed, turning over, then it came back on hard and deposited him on his face, mostly on his nose. He lay there gasping, wiped away blood and pinched his nostrils closed, stood up and stared at the door, which had opened. He tried using his aug to talk to the AI, Mobius Clean, but, as ever, it didn’t bother replying. Just so long as he remained intact and alive was all that mattered to it—it knew that a little damage wasn’t worthy of note. He tested his nose with his fingers, the pain fading under his touch, the bleeding already stopped.  Ivebek grimaced. He still healed unnaturally quickly—faster even than someone running a military nanosuite—and still it took several impacts or stresses to damage him, and still he did not know why. He peered at the smear of blood on the floor. His nose should be broken now, his face swelling, yet all he had was a little blood on his fingers. After a moment, he returned his attention to the door.  He had no way of escaping his situation. If the door was open that probably meant it really didn’t matter if he wandered about. Maybe it hadn’t been locked all this time—he had never thought to try the damned thing. He stepped out, looked up and down the corridor and noted smoke toward the rear of the ship, and headed towards it. Even as he reached it, fan filtration began droning loudly and a breeze whipped it away. The smell of burning led him through a bulkhead door, then another and another. Finally, he came opposite an inspection window and peered inside, recognizing the U-space drive, only it didn’t look like a drive anymore, just scrap.  “You are at the wrong end of the ship,” said a voice via his aug. “Head to the bridge and strap yourself into the acceleration chair there. This is going to be rough.”  “What happened?”  “Some automated defense,” Clean replied, though it sounded doubtful.  “Why rough?”  “Grav engines are at minimal function. I am holding them together.”  “Are we landing somewhere?”  “Do as instructed.” That ended with an emphatic click—conversation over.  Ivebek turned around and headed to the front of the ship. The standard bridge contained two acceleration chairs before consoles and a slanted screen revealing starlit space but nothing else of note. He sat down and strapped himself in, assessing what he had learned from his brief exchange with the AI. They were landing, but it seemed someone might not want them to. That Clean, knowing Ivebek’s ruggedness, wanted him strapped in told him the landing would be rough. He tried to relax and, as ever, returned to the memory—his key to understanding all that was happening to him.  The desert had been hot, almost beyond the insulation and cooling capacity of his armored suit. Organic toxins filled the air but it contained enough oxygen to sustain him, just so long as the filters held up. He’d found the entrance in the side of a sandstone butte—a tunnel of nacreous mother-of-pearl delving inside, as if erosion had revealed a giant mollusk from some ancient sea here. He walked inside, checking his weapons as he did so. Light amplification through his HUD created the illusion of a bright place as he moved into darkness. Then . . . nothing.  It seemed such a small and inconsequential fragment of memory, but it had kept him alive. When Earth Central Security grabbed him on the Polity side of the Graveyard—that borderland lying between the human Polity and the alien prador—he was sure that would be the end for him. He’d committed theft and murder in the Polity while smuggling alien artifacts—Jain stuff supposedly, but he wasn’t so sure that was true, but it paid. He’d done worse in the Graveyard, hooking up with a crew selling cored and thralled humans to the prador. He had been a career criminal with more than enough marks against him to warrant a death sentence.  They’d questioned him, of course, first in a tiled cell. The agent concerned got all old fashioned on his arse with brass knuckles and a shock stick, then became puzzled and intrigued by how he absorbed damage. Perhaps that was why he had not executed him then and there, but passed him on. Aboard the ECS stealth ship they’d scanned him intensely, then used an interrogation aug to observe his mental responses to questioning and copy memories out of his mind. After that he had expected them to give him a short tour of an airlock, but it seemed something didn’t add up.  “Here,” the woman had said, placing a pulse gun on the table before him.  He’d stared at the thing. He should pick it up, shoot her, and do all he could to escape, though that seemed unlikely. What had he got to lose? He picked up the gun, pointed it at the wall, and triggered it. It surprised the hell out of him when it actually fired, and he dropped it like a poisonous insect.  “I thought so,” she said. “Something’s fucked with your mind as well as your body.”  He sat there baffled when she took the gun away again and left.  The stealth ship docked at an outlink station and troops carted him inside to deposit him in a garden, on a synthetic stone seat. They took off the manacles and left. He didn’t have a clue what was happening until the thing rose out of a pond swimming with multicolored fish. It looked like a crinoid six feet across, rippling feather tendrils attached to a central point.  “I am to examine you,” the forensic AI explained.  He ran of course, but had nowhere to go. The thing descended on him and grabbed him to begin its examination. A thousand worms seemed to writhe over his skin, then it abruptly released him and he thumped on his back in the grass. It retreated. He lay there feeling strangely heavy and solid, as if after a particularly hard workout, and that feeling had stayed with him since.  “They scanned you in the ship and found you impenetrable,” it said. “You are also impenetrable to me.” It sounded affronted. “You are opaque—a form of chameleonware has been inlaid in your skin. Can you explain this?”  He wanted to, he really wanted to. He knew what forensic AIs did to people like him. In pursuit of answers this thing could take him apart both physically and mentally and, if not satisfied with the results, put him back together and do it again. Painkillers, apparently, were not an option during this process, pain in fact being a necessary encouragement.  When he could find no reply it came at him again. He fought it this time, but its tendrils had as much give as braided towing cables. It inserted nanofibers into the interrogation aug still attached to his head. He felt all his memories rising for examination and then that memory. The AI simply dropped him again, backed off and folded into a ball just a few feet across. It stayed that way long enough for him to search the garden for a way out, drink from the pool, and wonder what those fish would taste like raw. Then it unfolded.  “We are going on a journey,” it told him.  And here he was. It did tell him a little of the circumstances. He had encountered an alien and that was integral in his memory of mother-of-pearl tunnels. It had tampered with his body and mind, altering it in ways the AI could not parse, though some of the results were plain: as well as unusual physical ruggedness he was no longer a killer—he possessed empathy. The AI had decided not to continue its examination because that memory would be of interest to her. He had no idea who she was, and the AI had not considered it worthwhile to tell him.  The ship shuddered and the star field began to swing to the right. A sun slid into view, the reactive screen damping its glare, then a world. He gazed down upon the yellow and white swirls of cloud over pastel terrain and could see no sign of oceans. The seat kicked him in the back as fusion flung the ship forward. Acceleration ramped up and up, and that he was feeling it confirmed problems with internal grav too. He felt himself sinking deeper and deeper into the seat, his arms turning to lead and an invisible stone coming to rest on his chest, and somehow it slid inside him—a solid core. Then he blacked out.  Ivebek regained consciousness to the roar of atmosphere over the hull. Misty claws of cloud reared up to grab at the ship. Piss yellow rain hit the screen and slid off its frictionless coating. Sun glare, a green-tinted yellow, briefly blinded him. The ship dipped into thicker cloud, snow swirling in view, then through—the cloud a gray-green ceiling above. He could just make out the features of mountain chains, valleys, and perhaps rivers. Lower still, with the ship shuddering alarmingly, he felt sure he could see jungles or forests, but with little green in them. With some time yet to pass before landing, or crash, he decided to try something.  “Almanac data,” he stated.  To one side, in the laminate of the screen, a long menu scrolled up with an arrow blinking beside the first entry. He lowered his gaze to the third entry, the arrow tracking his vision, and blinked deliberately. The aug connection flashed up in his visual cortex and he permitted it, then enabled a full download while speed-reading the introduction to a world designated X349. Until that moment he had not known the interrogation aug would respond like a standard version. A lot had been redacted from the data presented while, on occasion, a warning appeared telling him to avoid this proscribed destination.  Now he could see actual jungle down there, mainly purple and blue with minor swirls of green. The ship turned, flinging him from side to side, and now he had a view to the rear up toward the rumpled quilt of cloud, just before deceleration sank him into his chair again. This more than anything else told him how many drive systems were down—the AI forced to use the main fusion drive to decelerate. The pressure pushed him close to blackout then came off with another turn. Again he saw ahead, now low down over the vast jungle. The ship began hitting the treetops, then debris covered the screen as it sank lower and deceleration flung him against the straps. The ship vibrated so hard it felt like the muscles were being shrugged from his bones. A steady roar grew in volume until it hurt his ears, crescendoed with a crash that nearly put him through the floor, then another and another. The roar diminished, and finally the ship hit earth and stayed there, deceleration still forcing him against the straps, but then finally coming off with a thump. The debris slid from the screen and he gazed out at a blast field—jungle leveled and burning all around. He swallowed dryly, reached down, and undid the straps.  “Return to your cabin,” said the AI, via his aug.  Ivebek paced in his cabin—a ten-foot box with the minimum of facilities—listening to the creaks and groans of settling metal and a susurration that sounded like wind. His body felt tighter and harder after the buffeting in the bridge, while he felt as if he had pulled a muscle in his torso, and the nag wasn’t going away. He sat on the bed to read the almanac download again. He was gazing at the gap, where any information about intelligent life or previous civilizations on X349 had been redacted, when he felt it.  Someone was calling him and he felt an odd déjà vu, a nostalgia, as if this might be his mother summoning him in from playing in the ducts of the arcology where he grew up. This lasted for just a short time, but it seemed the wrong key to his mind. Next he felt hunger and thirst that would be relieved if he just got up and went over there. He turned his head, gazing at the wall of the cabin. He got up and went to his fabricator and input his needs, returned to the bed with a tray of printed pork and black beans and a beaker of blue banyan juice. These quelled the feelings only a little, but enough for a change of approach. He now felt withdrawal from the many addictive substances he had tried pulling at him, trying to get him to head to some destination where all his needs would be satisfied.  “There’s something in my mind,” he said.  “It is her, calling you,” replied Mobius Clean.  He pondered that for a long moment and realized he did not agree. It felt far too personal, intimate even. But perhaps that was how, whatever this was, operated. He suspected something like an induction warfare beam had been pointed at him. It wasn’t telepathy, couldn’t be that since Polity science had long ago disproved it . . . unless of course the AIs were lying.  “What the hell does this female want with me?” he asked.  Instead of answering the question, the AI said, “We are some distance from the site. You are to proceed alone. It will be necessary for you to defend yourself.”  A hatch opened in the wall and he gaped disbelievingly at what it revealed. His armored suit lay there, and his weapons. Rising from the bed, he walked over and peered down at it, noting as he did so that the gravity of this world sat just above Earth normal. He took the suit out and put it on, linking into its systems via his aug. He holstered his sidearm—a pulse gun—picked up his Brabeck Multigun, and jacked the combined optic, power feed and ammo tube into his pack, which he pulled onto his back. He then stood there checking diagnostics in his HUD, along with ammo and power levels. Everything had been topped up. He felt the urge then to never get out of this suit until he was either free or dead, but then acknowledged it likely Clean had put in some way of shutting it down. The weapons, he realized, were irrelevant, since he could no longer use them against others.  “Come outside,” Clean told him.  The suit gave him a little bit of assist in the higher gravity, but he cancelled it since he’d gone long enough without exercise. The nag in his torso was now a dull ache as he headed to the cabin door and it opened ahead of him. Remembering how he had come aboard he went to the hold, found the airlock standing open and the ramp to the outside down on smoking ground. The hold had been packed with equipment when he boarded, but appeared half empty.  Reaching the bottom of the ramp, he gazed back along the length of the ship to where a large section of armor had been debonded at the back end to open access. That was quick. A grav-sled he had originally seen in the hold stood beside this, the equipment piled on it swiftly disappearing as black spider mechs with clawed forelimbs and dodecahedral bodies carted it into the open section. He walked over and gazed inside, recognizing the compartment for the ship’s U-space drive. It was much changed in there now.  When he had peered through the interior inspection window the drive had been a blackened and twisted wreck. The two cylinders of complex technology supported in the middle of the compartment by glassy struts had been mashed as if giant hands had reached in and twisted them like someone wringing out a cloth. Most of the struts had been shattered, optics charred, s-con broken. Somehow braided meta-material had been turned into chunks not dissimilar to wood charcoal. Now the cylinders were straight, some of the struts back in place, coils of optics hung around the walls, and spider mechs were clearing out debris and stringing new s-con. This had all happened in less than an hour.  “I thought this kind of a repair of a U-space drive was supposed to be impossible without heavy infrastructure,” he commented. “Where are the vastly precise machines, intense energy sources, and gravity presses?”  “Now you know better.”  Wrapped around the drive cylinders, Mobius Clean bore the appearance of a tangled mobile sea fern, working so fast its limbs were a blur to the human eye, while the packed technology of the cylinders deformed, shifted, and changed shape.  “You could have likewise taken me apart and examined me,” he stated dully. “I still don’t really know why you stopped.”  “It was necessary,” was all Clean supplied.  Or had the AI stopped? Sure, that’s what he remembered, but the AI could have taken him apart and, putting him back together, implanted any memories it chose. Probably some way of tracing him would remain, some way of seizing control of him, some way of manipulating him. Polity AIs lied, manipulated, bent things to the shape they required, and the truth of that lay before him now.  Throughout the history of U-space travel the AIs established the myth that U-space engines could only be built in AI-controlled facilities using hugely complex and energy-hungry machines, and that some components could only be forged on the surfaces of brown dwarfs. The resulting engines, because of the complex interdimensional math involved, and the mental gymnastics in dealing with a continuum supposedly without conventional time or dimensions, required an AI to run them. All lies. The prador made such drives without AI and ran them with the transplanted and flash-frozen ganglions of their children, while here before him the forensic AI was practically rebuilding a drive that anywhere else would have been consigned to recycling.  Now Clean pulled away from the drive and rolled out of the hole in the side of the ship, coming to rest before him.  “I just scanned you to try and confirm what I have been told,” said the AI. “Apparently you are capable of breathing the atmosphere here and are immune to the viruses, microfauna and allergens of this world, so have no requirement for a suit. I, however, pointed out that unsuited you would be vulnerable to the macrofauna here. She agreed that this was the case.”  “And who is ‘she’?” he asked  Disregarding his question, yet again, Clean continued, “Whether you wish to open your suit to the air here is a matter for your own discretion.”  “Who is ‘she’ Clean? Why am I here?”  “You are here because your life is forfeit and an entity with which we wish to open larger communication showed an interest in you. You will go to her and what she does with you is of little matter to us. You may even survive it, in which case, bearing in mind that your propensity to kill has been removed, you may return to the Polity as a free citizen.”  “Entity? Some sort of alien?”  “Of a kind, according to a fragment of memory in your mind, you encountered before.”  “That memory.”  “Precisely. She will open communication with you once you set out. I have given her your aug code.” He wanted to argue, but before he could say anything, Clean added, “Of course you can stay here, in which case I will examine you.”  Ivebek turned away and began heading toward the dense jungle, glancing back along the path the ship had cut through it as it came down. Fires were still burning there because, he discovered on checking the almanac, they were fueled by the oxygen nodules in the roots of the plants, which they had extracted from the atmosphere to make this world uninhabitable for unadapted humans. An atmosphere he could now, apparently, breathe. He paused at the wall of tangled plant growth. Again he felt scanning from Clean, brief this time but more intense. In response something dense and leaden inside his torso seemed to tighten, and he felt a stab of pain. He walked on. Both the scan and the brief pain felt like threats or intentions to propel him forward. The pain he simply did not understand, but the scanning made him feel like a victim in the sights of a molester. But Clean did not want to touch him until he had served his purpose here. He was a bargaining chip being played by the AIs to open access to something alien.  His aug now signaled to him a connection request. He gazed at it blinking in his HUD—relayed there through the suit link. He winked at it to activate it.  “Come here to me,” she now said, the voice female and seductive. A moment after this a direction arrow appeared in the bottom of his HUD.  “Why should I?” he asked.  A long pause ensued while he considered how the classifications male and female might well not apply here. The voice the entity chose to communicate indicated nothing. It might not even have vocal cords or a mouth, or maybe it had a mouth he would not like to see.  “Personal survival,” she finally replied, utterly factual. “If you do not come, Ivebek, all protections will be rescinded and Mobius Clean will have you.” Oddly it didn’t sound like a threat. It sounded like mechanics: “If you drill a hole in a bucket, Ivebek, the water will run out.”  “Plain fact,” he replied. “But what do you want with me, and what are you?”  She ignored the question: “Tell me about your encounter.”  He stepped into the jungle, pushing between ribbon vines like faded plastic, worming between thick white trunks and half-burned debris, finally stepping out where the jungle had not been compacted and burned by the crash, to where he could walk easily between the plants. He thought about his past and felt something shift in his mind. Suddenly he realized he wanted to talk about everything that had led him finally to that encounter. On other levels he realized his mind had been given a firm prod.  “I was born on an arcology on Colouron,” he babbled, “and grew up with all my needs met by our post-scarcity society but for purpose and solitude.”  “Did you feel the ruling AIs should have supplied these?”  “They should have made it known that they were possible.”  He felt very uncomfortable with the question. The AIs had met the physical needs of a population that had, for no clear reason, grown much more than on other worlds. A large anti-AI sentiment had grown there too concerning AIs engineering and interfering with their society, and as a result of that it became a hive of Separatism. Only once he gained perspective from the outside did he discover that the AIs’ touch on Colouron was as light there as anywhere else, and that the problems there had been generated wholly by the society humans formed.  He continued, “I found out it was possible to leave once I officially became an adult and did so by runcible.”  “Why?”  “To find a purpose and give myself space to breathe.”  “Did you find these?”  Something was moving through the undergrowth over to his right, and he wondered if the distraction of this conversation was a good thing. Using his suit’s scanners in that direction he got an infrared image of a winged creature like a small pterodactyl feeding on an object like a large fruit or egg. He ignored it and moved on.  “I found solitude when I wanted it, which wasn’t so easy on Colouron, then through contacts I made a business venture.”  “Smuggling armaments back to Colouron itself as I understand it,” she said. “This purpose was satisfactory?”  “You know about me, so why are you asking?”  “I want to understand you and, through you, more about the Polity.” She paused for a second, then continued, “You became a smuggler because of contacts in your home arcology—it was something to do.”  “I made money at it.”  “Why did you require money, if the AIs could supply all your needs?”  “Some things lie outside the AI definition of ‘human needs,’” he replied tightly.  “Like the ‘purpose’ you mentioned?”  “Yeah.”  Again he wasn’t comfortable with this.  “From smuggling arms to Separatists you next proceeded to smuggling them to the Graveyard, and there you joined another organization that sold cored and thralled human beings to the prador.”  “More risk more revenue,” he said.  “And killing people.”  “Look, where is this going?”  “It was you who chose to start telling me your life story. I do not think you can object to me commenting on it.”  “You did something to me. You made me talk.”  “Are you sure? Or do you feel some need now to justify yourself?”  “Fuck you,” he said without heat.  “Has it not occurred to you to wonder if what you were truly seeking was not purpose, or revenue, but distinction from the crowd and power over other people?”  He now wanted to make a heated reply but could not find one beyond repetition of his last words. That was the thing, on Colouron you were one of billions with nothing to make you stand out. Societal structures existed, like the Separatists, and with effort you could climb to the top of any particular heap. But still you were a meat mechanism under the AIs to be fed, housed, and cleaned up after. He could see now that this did drive many from that world and to excellence, while his way of excelling had been through crime. The money had just been a way of keeping score. Simple as that, and he hated the clarity.  “I will now leave you to your thoughts while you deal with the exigencies of survival, which will be upon you shortly,” she finished. The link closed.  He halted and looked around. The jungle had grown thinner now, so he could walk a straight course for more than just a few paces. He became aware of movement behind him and turned. The creature humping between the trunks bore some resemblance to a huge armadillo, though its head possessed three stalked eyes. Below its piggish snout its mouth had far too many teeth. The central eye was focused on him while the other two were checking to either side before they too turned in. It opened its mouth and squealed like a pig, then charged.  Ivebek froze. He could not kill! The pig—for so he named it—came straight at him. At the last moment he threw himself aside into a shoulder roll, and it thundered past. Tearing up earth at the end of its charge, it turned. With shaking hands Ivebek selected thermite shells and fired into the ground before it, throwing burning jungle detritus into its face. The thing took this for a moment then veered aside and went crashing into the jungle to his left. He tracked its course, watching it disappear from sight. He sighed shakily. This should be no problem if the creatures here spooked so easily. As he turned forward again something slammed into his chest to send him staggering, closing numerous legs about him. He got a look into a collection of revolving mandibles as mobile antennae smeared yellow liquid over his visor, then felt a muted punch against belly and a fluttering pain in response. He had just been attacked by a creature like a giant ichneumon wasp.  He grabbed the thing in one hand and tried to pull it off as its lower abdomen flicked out then drove in again, trying to push a barbed sting through his armor. It clung tenaciously and he just did not know what to do, because again he could not kill. Then, not even conscious he had chosen to do so, he used assist, driving his fingers into his body with a crunch. Now managing to pull it away, he held it squirming before him then threw it to the ground. Perhaps it was organic memory, for he fired a single shot and blew it in half. Staring down at the still-moving creature he searched himself for a reaction, but found none. Perhaps his empathy did not extend to oversized insects. He went to step over it, then paused and looked back down at the thing.  Hadn’t he seen that before? Behind its head clung an object like a metallic worm cast. He prodded the thing with his toe and the creature made a desultory attempt to bite his boot. He looked up. Yes, he had seen it before.  The pig now stood ahead of him and there, on the armor behind its head, was another one of those casts. Some kind of parasite? The creature charged again and this time shots into the ground did not dissuade it. Reluctantly, he raised his aim, but then felt a stirring of joy when this elicited no reaction inside him. He shot it in the head and it crashed to a halt before him. Glancing ’round he could now see other movement in the surrounding jungle.  “Come on!” he said, hoping for more kills, but next felt a sudden self-disgust. Was this all he was. He lowered his weapon. The nagging pain in his torso arose again, almost rhythmic. He felt sure now that Clean had lied and that it had interfered with his body, because something was driving him to his destination. Sure as shit the pain would increase if he delayed.  He broke into a steady trot in the direction of the arrow in his HUD, meanwhile calling up an ammo inventory. He had used up twenty-three explosive shells out of five hundred and had not yet used the pulse gun option of his main weapon. However, he had no idea how far he had to go or how many more attacks there might be.  Another pig charged in from the right, its head down so he could not get a clear shot at it. He riddled its body with explosive shells, blowing away chunks of the thing to expose yellow flesh, squirting green blood, and bones like polished oak. He ran as the thing circled ’round and came back at him, trying to keep his distance and putting more and more shots into it until it came down. When he ceased firing he was able to hear a growing hum. The big wasps appeared, flying between the trees, abdomens hanging pendulous. He brought up targeting, keyed to his suit’s motor assist. Putting a crosshair on one of them he blinked for acquisition. The motors moved his arms, correcting where he could not, and he fired, blowing the creature apart with one pulse shot. But this lengthy procedure allowed others to get closer and they were coming in all around. They were sneaky too, taking fast flights between concealments, like they knew what his weapons could do. He began firing short pulse gun bursts where they seemed thickest, blowing many apart and bringing down steaming foliage, but still they drew closer. Turning to where fewer of them flew, he ran in that direction. Sticking his main weapon to a pad on the front of his suit, he drew his sidearm for closer shooting, his free hand on assist to beat the creatures away.  Abruptly he found himself stumbling down a steep slope. Tall trees shrank to dwarfs, cycads bloomed, and low greenery and blue-ery tangled his feet. He fell, struggled upright tearing one of the creatures from his back and slamming it into a tree. A few more steps, batting the things away, brought him to the edge of a slow deep river. He turned his back to it, holstered his sidearm, and detached his main weapon, firing short bursts again, shredding the flying creatures. The third pig hurtled downslope at him. Even the explosive shell annihilating its head did not stop it, and it crashed into him, hurling him and itself into the water.  Ivebek sank, just for a second until his suit compensated. Expanding around him as it filled gas pockets, it began to bring him to the surface again. His visor gave him a clear view all around as the water filled with giant snakes a foot in thickness, but seemingly without heads or tails. He surfaced to see one of the things looped up over him, the head now visible, a mass of stalked eyes and a letterbox mouth. It snapped down, closing that mouth over his main weapon, snatched that away and tossed it. It came down again and grabbed his shoulder even as he drew his sidearm. Hauling him up it shook him, then discarded him. He crashed down on the other side of the river and lay there on his back expecting further attacks, but none came. In retrospect, he realized there had only been one creature in the river. And reviewing memory, he saw it had one of those metallic casts on the side of his head.  He stood up, rubbing at his belly but hardly able to feel his hand through the armor. Counterintuitively the pain had receded—his torso just heavy and tight now. Next, using suit scanning, he located his main weapon in the river, which was now boiling with the coils of that creature’s body. He knew with utter certainty that it would not allow him to retrieve it, and that disarming him had been the purpose of its attack. Looking across to the other side he saw the wasps bobbing there as if from a disturbed hive, but they weren’t crossing. Two of the pigs were even now heading back into the jungle. Turning in the direction indicated by the arrow in his HUD, he saw a creature, like a manta ray with legs, appear from between the taller trees. When he raised his sidearm to aim at the thing it began to make its way down toward him, opening and closing a toothless mouth that did not seem designed for predation. Noting the metallic cast behind its four black button eyes, he lowered his weapon and tossed it down in the dirt beside him. The creature halted, turned clumsily, and headed back into the trees.  “You didn’t want me to have weapons,” he said, after opening the link.  “Even I can die,” she replied.  “Are there any creatures here you do not control?” he asked. “I really don’t want to abandon my last weapon if there is something that might attack me.”  “You are more intelligent than I supposed.”  “Many have made that mistake.”  “There are only two creatures on this world I cannot choose to control,” she said. “You and the AI Mobius Clean.”  “Who, it is apparent, doesn’t know that you can control the wildlife here. Else you would have told him I had no need for weapons.”  “Precisely.”  He stepped away from the sidearm and continued up the slope from the river. Pausing by some rocks, he flipped one over. This revealed creatures like woodlice, but white and circular. On closer inspection he saw more of those worm casts on their shells. She wasn’t lying. He flipped the rock back and continued on.  “You asked if what I sought was distinction from the crowd and power over others,” he said. “A hundred days ago I would have sneered at the question but now, I think, I can give you an honest answer. I delighted in power over others and exercised it whenever I could. I took cruel pleasure in the terror of those I cored and thralled. I enjoyed being the big man able to order others to kill. I was someone who did not deserve to live.”  “And why do you have that perspective now?” she asked.  “Because something changed me.”  “Perhaps you would like to tell me about that?”  The memories weren’t clear, but still he tried to put them in order.  “I met a man in the Graveyard who gave me the location, on a world, of an alien weapon and I went there to seek it out.”  He could clearly see the bar in his mind, the drink on the table before him, and Grayson Trada sitting opposite.  Trada was both excited and scared. “It’s real Jain stuff—you see the data.”  He certainly had and it really looked genuine.  “Why don’t you go after it, then?” he had asked.  “I trade information—too many agents in the Graveyard now and I really don’t want to be noticed by them. That ship has sailed as far as you are concerned.”  He had nodded agreement. He knew about the reward for his capture or proof of execution of sentence against him. Only recently he’s upped the count to four of those who had sought to claim the reward and failed. He slid a pack of etched sapphires across the table. Trada verified them and swiftly departed, glad to have such dangerous information off his hands. The coordinates Ivebek had loaded into a storage rod were detailed, and he felt much excitement about going after the items the data detailed.  “I landed and went to the coordinates given.”  Again he saw the desert and that mother-of-pearl entrance, but nothing of what happened in there. He told her how afterward he had paid off his crew at another location on his way out of the Graveyard. But all he could remember was his intense desire to head to a location in the Polity—a place he had avoided for a long time because of the warrants out for him. Necessity forced him to stop at a space station for his ship was old and required primitive deuterium fuel, and that’s where the Polity agent grabbed him.  “And what was that destination?” she asked.  He broke into a sweat as he tried to recover it from his mind. His torso ached in sympathy and gave him a couple of stabs. But he just couldn’t find the memory.  She now added, “It is almost as if your conscience was driving you, and that the destination was in fact the Polity, and the purpose was your capture.”  No, that could not be right, surely? Again he tried to excavate memory, but now began asking himself some pertinent questions. Why had he paid off his crew? Had it been entirely necessary to stop for fuel? Had it been necessary to leave his ship and board that space station, knowing the dangers? In retrospect, it did seem he had been seeking capture, but somehow that did not feel right at all.  The jungle thinned out around him while across the blue-green firmament the cloud began to fragment. On occasion he got himself a clear view to the horizon and a mountain chain there, the sun setting. He felt suddenly hot, feverish hot, and checked the internal temperature of his suit. Its setting had not changed, but still he felt uncomfortable.  “I think Clean has done something to me,” he said, but she did not reply.  He came out onto a clearing on a downslope, now seeing the mountains more clearly. The rock formations looked odd, rather more like they had been deposited in worms by a deposition welder than pushed up from below. Lying between him and them lone massifs of the same wormish construction stood up out of the jungle. He paused, eyed a boulder lying at the edge of the clearing, then went over and sat down. His guts gave him another stab, but he ignored that and, without thinking, reached up to the neck control on his headgear. The visor slid down into the neck ring while the helmet softened and rolled off his head and down to the back of the ring. Cool air hit him and he reveled in it, only a moment later realizing what he had done. He was capable of breathing this air, yet no human should be. He had opened himself to local biologicals to which, apparently, he was immune. He left the helmet undone, an odd spicy taste in his mouth and a smell like mint in his nostrils.  “Why am I here?” he asked.  “You would be more comfortable without your suit,” she replied. “There is nothing here to harm you and the path is easy from now on.”  On the one hand her observation seemed utterly reasonable, but abandon his suit? It was his only remaining defense against this world, and, besides that, it had been damned expensive. Still, he opened the side seam down his torso and felt some relief, like he had been wearing particularly tight clothing after a heavy meal.  “You didn’t answer my question,” he noted.  “Why are any of us here?” she replied. “To live, to continue, to consume, and to breed. Life continues to find its way forward.”  “You are being general when I was being specific.”  The nagging started up again and he stood. He no longer had the direction arrow in his HUD to follow but found he did not need it. Setting out between trees like giant flowering papyrus he trudged toward those mountains.  “Those are our base desires, written into our genomes,” she said, “but we build structures on top of them with our intelligence, and call them purpose. However, their bedrock remains the same. The power you sought over others, the uniqueness you craved, in the end were based on survival and the old impulse to display your fitness for breeding.”  “I don’t agree,” he said, abhorring the idea that his drives were so simple. “We are intelligent creatures who have outgrown our ancient programming.”  “How nice for you.”  “And what about you? I don’t even know what you are, but I’m guessing you’re not even remotely human. What about your impulses?”  “You would recognize them for they have their twins in the life of your original world, that is, if you know much about that original world.”  He halted, suddenly irritated by how sweaty and enclosing were his garments. Thumb controls on the wrist of each glove released them and he hooked them on his belt. His hands now felt cool and free and somehow less dirty.  “Try me,” he said.  “Consider the impulses of a mollusk that spreads its seed in the sea,” she said. “There is no need for it to display its fitness to breed, just the drive to relieve itself of that seed and let the currents carry it where they will.”  “You’re a mollusk?”  “Such definitions are not suitable for the alien.”  “Then what?”  “Consider such a creature were it to spread across worlds but was still driven to spread its seed. An intelligent creature, a moral creature.”  “I don’t understand.”  “You will.”  One of the massifs now lay ahead and he knew at once this was his destination, not the mountains beyond. He felt his eagerness to be there, though the passing thought that the eagerness might not be his own quickly died.  “The creature would send its seed out in ships or use other technological means,” he tried, but knew he wasn’t thinking clearly.  He really did feel feverish now, and his suit seemed to hang leaden on him. Why was he keeping it on? Its value to him now, in this situation with an alien ahead and Clean behind and him utterly powerless, was nil. Comfort and freedom seemed a better goal. He halted and disconnected the sleeves at the shoulders, stripped them off and simply dropped them. The relief was intense. Section by section he removed the rest and then, in a nod to the garment’s value, carefully stacked it on a rock. Now clad only in a thin shipsuit and slippers he felt free, and moved on.  “We are old,” she said, “and have grown far apart. The urge to spread our genome has remained, though muted, even as we lost or otherwise abandoned the technology that enabled its spread. Some believe this a willing retreat from our nature, for it did not sit well with our growing and, it has to be said, unnatural morality.”  Ivebek felt a sudden surge of horrible knowledge, but it lay just beyond his grasp.  “Consider the parasite that lays its eggs or some other form of genetic transfer in a host, a carrier,” she continued. “The natural way would be to take those carriers with it to the stars.”  “The technological answer,” he tried, knowing it was wrong.  “No, not if you are programmed that way by evolution, and then have little regard for the creatures you use, for then another option becomes available: hosts who themselves can travel, other star traveling races. Unfortunately, such races are inevitably intelligent themselves and, if your growing morality does not permit this, your survival becomes abhorrent.”  “And then what happens?” he asked, the horror of it beginning to impinge.  “Then you retreat and your society collapses. You begin to die out and, at some stage, there are few of you scattered across vast stretches of space.”  “And you no longer breed . . . ”  Gnarled wormish stone now lay before him rising up in a slope, and he hardly remembered the intervening miles. He chose a path leading to a point up above. He wanted to turn and run, but climbed. His torso felt thick, hard, and heavy and there were no more nags of pain for they were no longer necessary.  “Unfortunately, the urge to breed continues and, in many cases, becomes stronger. It is as if, with extinction threatening, the urge to racial survival increases. Some of these then set lures for the required host—lures they feel will bring them a morally acceptable carrier. Others fight the urge, but when a carrier wanders within their compass, instinct becomes difficult to fight.”  “You isolated yourself,” he said.  “I did, and I allowed only limited communication with other races. I retained some of my technology, but it wasn’t enough to stop Mobius Clean coming here. He made the moral argument that you are a killer, I discounted it because the other of my kind had changed you. I tried to damage his ship to prevent him landing, but he did, by which time I could fight my instincts no longer.”  “What is going to happen to me?” he asked, it almost coming out a sob.  The mother-of-pearl tunnel lay before him, and he crawled inside. He didn’t have to go far before she rose up to meet him, mussel flesh and frills, groping tentacles with their barbed bone-like blades.  “I’m sorry,” she said as she drew him into soft velvet warmth and split him from sternum to crotch. “My mate gave you some durability and I will try to keep you alive.”  Ivebek screamed, then screamed again as the fringed pod wormed out of the split, shrugging off ropes of his intestines. He gazed at stalked eyes inspecting him, other appendages trying to push him back together as the pod inched into a hot pink cavity. Then the world went away.  Ivebek returned to pain. He lay on his back gazing up at the sky, turned his head slightly to take in the slew of organic detritus spilled from the mother-of-pearl hole above. He started gasping—didn’t want to look down at his body.  “The one you first encountered lured you with the promise of something illegal in the Polity, sure this would bring it a suitable carrier,” said a voice it took him a moment to recognize as Clean. “It ameliorated its feelings of guilt by making you rugged enough to survive the process, and made the changes that drove you toward her.”  The AI now slid into sight above him. Feathery tendrils wrapped around him and hauled him from the ground. It wasn’t gentle and he bit down on a scream, but then groaned when he saw his guts hanging out. Sharp stabbing pains all over his body ensued and he felt the paralysis spreading from those points. The tendrils blurred over his injury, detritus flicked away, antibacterial and antiviral foam boiled. He felt his guts going back in and couldn’t scream. He blacked out for a second, then woke to the thrum of cell welding. Sharp stabs faded and he felt movement return to his limbs just as Clean dropped him. He landed with a thump, his torso aching but intact. He lay there in fragments of nacre, bones, and compacted worms of leaves, then he sat up.  “The biology . . . ” he managed.  Hovering above him, Clean writhed in green sunlight. “The first was, nominally, male, and she female. The requirement for genetic mixing is a facet of her kind as yours. The thing inside you was a sperm carrier.”  “And now?” He pushed down against the detritus and stood. In the jungle down at the bottom of the slope he could see the ship he had arrived in.  “She will produce young, thousands of them, and they will spread around this world and no further. We will watch and assist and learn and perhaps help them with their moral problem.”  “I didn’t really understand that.”  “Morality ceasing to act in concert with biology you should understand. Many humans have often ceased to eat meat because of their abhorrence of killing. These creatures”—Clean waved a tendril toward the massif behind—“grew and spread and preyed on other intelligent races. They then came to detest their own biology, their method of breeding, because their carriers were intelligent. It spelled racial doom for them, which we have now halted.”  Ivebek wanted to ask now about his own doom, but instead asked, “Why did the male change me as it did? Why am I no longer a killer?” He paused for a second, remembering those creatures in the jungle, and added, “Of intelligent creatures?”  “Because you had to survive more than being a carrier of the male’s sperm for its conscience to be satisfied.”  “I don’t understand.”  “You had to survive me, Ivebek Cloon. Return to the ship now, we are leaving.”  Ivebek nodded, thought about his armored suit down there in the jungle, his abandoned weapons.  Really, he didn’t need them now. Neal Asher was born in 1961 in Essex, Great Britain, and divides his time between there and the island of Crete. He's been an SF and fantasy junky ever since having his mind distorted at an early age by JRRT, Edgar Rice Burroughs, and E C Tubb. Sometime after leaving school he decided to focus on only one of his many interests because it was inclusive of the others: writing. Finally taken on by a large publisher, Pan Macmillan, his first full-length SF novel, Gridlinked, came out in 2001, and now in total he has over twenty-five books to his name, also available in translation across the world.", "text": "8450 words, novelette\nThe Host\nSomething hit on the way in. Ivebek Cloon felt the weird distortion of the ship surfacing from U-space, which to him was like the hangover from a neuro-enhancer packed into a couple of seconds. A resounding crash ensued, along with the sensation of someone trying to drag the world away, like a rug from under his feet. Grav went off and he floated up from his bed, turning over, then it came back on hard and deposited him on his face, mostly on his nose. He lay there gasping, wiped away blood and pinched his nostrils closed, stood up and stared at the door, which had opened. He tried using his aug to talk to the AI, Mobius Clean, but, as ever, it didn’t bother replying. Just so long as he remained intact and alive was all that mattered to it—it knew that a little damage wasn’t worthy of note. He tested his nose with his fingers, the pain fading under his touch, the bleeding already stopped.\nIvebek grimaced. He still healed unnaturally quickly—faster even than someone running a military nanosuite—and still it took several impacts or stresses to damage him, and still he did not know why. He peered at the smear of blood on the floor. His nose should be broken now, his face swelling, yet all he had was a little blood on his fingers. After a moment, he returned his attention to the door.\nHe had no way of escaping his situation. If the door was open that probably meant it really didn’t matter if he wandered about. Maybe it hadn’t been locked all this time—he had never thought to try the damned thing. He stepped out, looked up and down the corridor and noted smoke toward the rear of the ship, and headed towards it. Even as he reached it, fan filtration began droning loudly and a breeze whipped it away. The smell of burning led him through a bulkhead door, then another and another. Finally, he came opposite an inspection window and peered inside, recognizing the U-space drive, only it didn’t look like a drive anymore, just scrap.\n“You are at the wrong end of the ship,” said a voice via his aug. “Head to the bridge and strap yourself into the acceleration chair there. This is going to be rough.”\n“What happened?”\n“Some automated defense,” Clean replied, though it sounded doubtful.\n“Why rough?”\n“Grav engines are at minimal function. I am holding them together.”\n“Are we landing somewhere?”\n“Do as instructed.” That ended with an emphatic click—conversation over.\nIvebek turned around and headed to the front of the ship. The standard bridge contained two acceleration chairs before consoles and a slanted screen revealing starlit space but nothing else of note. He sat down and strapped himself in, assessing what he had learned from his brief exchange with the AI. They were landing, but it seemed someone might not want them to. That Clean, knowing Ivebek’s ruggedness, wanted him strapped in told him the landing would be rough. He tried to relax and, as ever, returned to the memory—his key to understanding all that was happening to him.\nThe desert had been hot, almost beyond the insulation and cooling capacity of his armored suit. Organic toxins filled the air but it contained enough oxygen to sustain him, just so long as the filters held up. He’d found the entrance in the side of a sandstone butte—a tunnel of nacreous mother-of-pearl delving inside, as if erosion had revealed a giant mollusk from some ancient sea here. He walked inside, checking his weapons as he did so. Light amplification through his HUD created the illusion of a bright place as he moved into darkness. Then . . . nothing.\nIt seemed such a small and inconsequential fragment of memory, but it had kept him alive. When Earth Central Security grabbed him on the Polity side of the Graveyard—that borderland lying between the human Polity and the alien prador—he was sure that would be the end for him. He’d committed theft and murder in the Polity while smuggling alien artifacts—Jain stuff supposedly, but he wasn’t so sure that was true, but it paid. He’d done worse in the Graveyard, hooking up with a crew selling cored and thralled humans to the prador. He had been a career criminal with more than enough marks against him to warrant a death sentence.\nThey’d questioned him, of course, first in a tiled cell. The agent concerned got all old fashioned on his arse with brass knuckles and a shock stick, then became puzzled and intrigued by how he absorbed damage. Perhaps that was why he had not executed him then and there, but passed him on. Aboard the ECS stealth ship they’d scanned him intensely, then used an interrogation aug to observe his mental responses to questioning and copy memories out of his mind. After that he had expected them to give him a short tour of an airlock, but it seemed something didn’t add up.\n“Here,” the woman had said, placing a pulse gun on the table before him.\nHe’d stared at the thing. He should pick it up, shoot her, and do all he could to escape, though that seemed unlikely. What had he got to lose? He picked up the gun, pointed it at the wall, and triggered it. It surprised the hell out of him when it actually fired, and he dropped it like a poisonous insect.\n“I thought so,” she said. “Something’s fucked with your mind as well as your body.”\nHe sat there baffled when she took the gun away again and left.\nThe stealth ship docked at an outlink station and troops carted him inside to deposit him in a garden, on a synthetic stone seat. They took off the manacles and left. He didn’t have a clue what was happening until the thing rose out of a pond swimming with multicolored fish. It looked like a crinoid six feet across, rippling feather tendrils attached to a central point.\n“I am to examine you,” the forensic AI explained.\nHe ran of course, but had nowhere to go. The thing descended on him and grabbed him to begin its examination. A thousand worms seemed to writhe over his skin, then it abruptly released him and he thumped on his back in the grass. It retreated. He lay there feeling strangely heavy and solid, as if after a particularly hard workout, and that feeling had stayed with him since.\n“They scanned you in the ship and found you impenetrable,” it said. “You are also impenetrable to me.” It sounded affronted. “You are opaque—a form of chameleonware has been inlaid in your skin. Can you explain this?”\nHe wanted to, he really wanted to. He knew what forensic AIs did to people like him. In pursuit of answers this thing could take him apart both physically and mentally and, if not satisfied with the results, put him back together and do it again. Painkillers, apparently, were not an option during this process, pain in fact being a necessary encouragement.\nWhen he could find no reply it came at him again. He fought it this time, but its tendrils had as much give as braided towing cables. It inserted nanofibers into the interrogation aug still attached to his head. He felt all his memories rising for examination and then that memory. The AI simply dropped him again, backed off and folded into a ball just a few feet across. It stayed that way long enough for him to search the garden for a way out, drink from the pool, and wonder what those fish would taste like raw. Then it unfolded.\n“We are going on a journey,” it told him.\nAnd here he was. It did tell him a little of the circumstances. He had encountered an alien and that was integral in his memory of mother-of-pearl tunnels. It had tampered with his body and mind, altering it in ways the AI could not parse, though some of the results were plain: as well as unusual physical ruggedness he was no longer a killer—he possessed empathy. The AI had decided not to continue its examination because that memory would be of interest to her. He had no idea who she was, and the AI had not considered it worthwhile to tell him.\nThe ship shuddered and the star field began to swing to the right. A sun slid into view, the reactive screen damping its glare, then a world. He gazed down upon the yellow and white swirls of cloud over pastel terrain and could see no sign of oceans. The seat kicked him in the back as fusion flung the ship forward. Acceleration ramped up and up, and that he was feeling it confirmed problems with internal grav too. He felt himself sinking deeper and deeper into the seat, his arms turning to lead and an invisible stone coming to rest on his chest, and somehow it slid inside him—a solid core. Then he blacked out.\nIvebek regained consciousness to the roar of atmosphere over the hull. Misty claws of cloud reared up to grab at the ship. Piss yellow rain hit the screen and slid off its frictionless coating. Sun glare, a green-tinted yellow, briefly blinded him. The ship dipped into thicker cloud, snow swirling in view, then through—the cloud a gray-green ceiling above. He could just make out the features of mountain chains, valleys, and perhaps rivers. Lower still, with the ship shuddering alarmingly, he felt sure he could see jungles or forests, but with little green in them. With some time yet to pass before landing, or crash, he decided to try something.\n“Almanac data,” he stated.\nTo one side, in the laminate of the screen, a long menu scrolled up with an arrow blinking beside the first entry. He lowered his gaze to the third entry, the arrow tracking his vision, and blinked deliberately. The aug connection flashed up in his visual cortex and he permitted it, then enabled a full download while speed-reading the introduction to a world designated X349. Until that moment he had not known the interrogation aug would respond like a standard version. A lot had been redacted from the data presented while, on occasion, a warning appeared telling him to avoid this proscribed destination.\nNow he could see actual jungle down there, mainly purple and blue with minor swirls of green. The ship turned, flinging him from side to side, and now he had a view to the rear up toward the rumpled quilt of cloud, just before deceleration sank him into his chair again. This more than anything else told him how many drive systems were down—the AI forced to use the main fusion drive to decelerate. The pressure pushed him close to blackout then came off with another turn. Again he saw ahead, now low down over the vast jungle. The ship began hitting the treetops, then debris covered the screen as it sank lower and deceleration flung him against the straps. The ship vibrated so hard it felt like the muscles were being shrugged from his bones. A steady roar grew in volume until it hurt his ears, crescendoed with a crash that nearly put him through the floor, then another and another. The roar diminished, and finally the ship hit earth and stayed there, deceleration still forcing him against the straps, but then finally coming off with a thump. The debris slid from the screen and he gazed out at a blast field—jungle leveled and burning all around. He swallowed dryly, reached down, and undid the straps.\n“Return to your cabin,” said the AI, via his aug.\nIvebek paced in his cabin—a ten-foot box with the minimum of facilities—listening to the creaks and groans of settling metal and a susurration that sounded like wind. His body felt tighter and harder after the buffeting in the bridge, while he felt as if he had pulled a muscle in his torso, and the nag wasn’t going away. He sat on the bed to read the almanac download again. He was gazing at the gap, where any information about intelligent life or previous civilizations on X349 had been redacted, when he felt it.\nSomeone was calling him and he felt an odd déjà vu, a nostalgia, as if this might be his mother summoning him in from playing in the ducts of the arcology where he grew up. This lasted for just a short time, but it seemed the wrong key to his mind. Next he felt hunger and thirst that would be relieved if he just got up and went over there. He turned his head, gazing at the wall of the cabin. He got up and went to his fabricator and input his needs, returned to the bed with a tray of printed pork and black beans and a beaker of blue banyan juice. These quelled the feelings only a little, but enough for a change of approach. He now felt withdrawal from the many addictive substances he had tried pulling at him, trying to get him to head to some destination where all his needs would be satisfied.\n“There’s something in my mind,” he said.\n“It is her, calling you,” replied Mobius Clean.\nHe pondered that for a long moment and realized he did not agree. It felt far too personal, intimate even. But perhaps that was how, whatever this was, operated. He suspected something like an induction warfare beam had been pointed at him. It wasn’t telepathy, couldn’t be that since Polity science had long ago disproved it . . . unless of course the AIs were lying.\n“What the hell does this female want with me?” he asked.\nInstead of answering the question, the AI said, “We are some distance from the site. You are to proceed alone. It will be necessary for you to defend yourself.”\nA hatch opened in the wall and he gaped disbelievingly at what it revealed. His armored suit lay there, and his weapons. Rising from the bed, he walked over and peered down at it, noting as he did so that the gravity of this world sat just above Earth normal. He took the suit out and put it on, linking into its systems via his aug. He holstered his sidearm—a pulse gun—picked up his Brabeck Multigun, and jacked the combined optic, power feed and ammo tube into his pack, which he pulled onto his back. He then stood there checking diagnostics in his HUD, along with ammo and power levels. Everything had been topped up. He felt the urge then to never get out of this suit until he was either free or dead, but then acknowledged it likely Clean had put in some way of shutting it down. The weapons, he realized, were irrelevant, since he could no longer use them against others.\n“Come outside,” Clean told him.\nThe suit gave him a little bit of assist in the higher gravity, but he cancelled it since he’d gone long enough without exercise. The nag in his torso was now a dull ache as he headed to the cabin door and it opened ahead of him. Remembering how he had come aboard he went to the hold, found the airlock standing open and the ramp to the outside down on smoking ground. The hold had been packed with equipment when he boarded, but appeared half empty.\nReaching the bottom of the ramp, he gazed back along the length of the ship to where a large section of armor had been debonded at the back end to open access. That was quick. A grav-sled he had originally seen in the hold stood beside this, the equipment piled on it swiftly disappearing as black spider mechs with clawed forelimbs and dodecahedral bodies carted it into the open section. He walked over and gazed inside, recognizing the compartment for the ship’s U-space drive. It was much changed in there now.\nWhen he had peered through the interior inspection window the drive had been a blackened and twisted wreck. The two cylinders of complex technology supported in the middle of the compartment by glassy struts had been mashed as if giant hands had reached in and twisted them like someone wringing out a cloth. Most of the struts had been shattered, optics charred, s-con broken. Somehow braided meta-material had been turned into chunks not dissimilar to wood charcoal. Now the cylinders were straight, some of the struts back in place, coils of optics hung around the walls, and spider mechs were clearing out debris and stringing new s-con. This had all happened in less than an hour.\n“I thought this kind of a repair of a U-space drive was supposed to be impossible without heavy infrastructure,” he commented. “Where are the vastly precise machines, intense energy sources, and gravity presses?”\n“Now you know better.”\nWrapped around the drive cylinders, Mobius Clean bore the appearance of a tangled mobile sea fern, working so fast its limbs were a blur to the human eye, while the packed technology of the cylinders deformed, shifted, and changed shape.\n“You could have likewise taken me apart and examined me,” he stated dully. “I still don’t really know why you stopped.”\n“It was necessary,” was all Clean supplied.\nOr had the AI stopped? Sure, that’s what he remembered, but the AI could have taken him apart and, putting him back together, implanted any memories it chose. Probably some way of tracing him would remain, some way of seizing control of him, some way of manipulating him. Polity AIs lied, manipulated, bent things to the shape they required, and the truth of that lay before him now.\nThroughout the history of U-space travel the AIs established the myth that U-space engines could only be built in AI-controlled facilities using hugely complex and energy-hungry machines, and that some components could only be forged on the surfaces of brown dwarfs. The resulting engines, because of the complex interdimensional math involved, and the mental gymnastics in dealing with a continuum supposedly without conventional time or dimensions, required an AI to run them. All lies. The prador made such drives without AI and ran them with the transplanted and flash-frozen ganglions of their children, while here before him the forensic AI was practically rebuilding a drive that anywhere else would have been consigned to recycling.\nNow Clean pulled away from the drive and rolled out of the hole in the side of the ship, coming to rest before him.\n“I just scanned you to try and confirm what I have been told,” said the AI. “Apparently you are capable of breathing the atmosphere here and are immune to the viruses, microfauna and allergens of this world, so have no requirement for a suit. I, however, pointed out that unsuited you would be vulnerable to the macrofauna here. She agreed that this was the case.”\n“And who is ‘she’?” he asked\nDisregarding his question, yet again, Clean continued, “Whether you wish to open your suit to the air here is a matter for your own discretion.”\n“Who is ‘she’ Clean? Why am I here?”\n“You are here because your life is forfeit and an entity with which we wish to open larger communication showed an interest in you. You will go to her and what she does with you is of little matter to us. You may even survive it, in which case, bearing in mind that your propensity to kill has been removed, you may return to the Polity as a free citizen.”\n“Entity? Some sort of alien?”\n“Of a kind, according to a fragment of memory in your mind, you encountered before.”\n“That memory.”\n“Precisely. She will open communication with you once you set out. I have given her your aug code.” He wanted to argue, but before he could say anything, Clean added, “Of course you can stay here, in which case I will examine you.”\nIvebek turned away and began heading toward the dense jungle, glancing back along the path the ship had cut through it as it came down. Fires were still burning there because, he discovered on checking the almanac, they were fueled by the oxygen nodules in the roots of the plants, which they had extracted from the atmosphere to make this world uninhabitable for unadapted humans. An atmosphere he could now, apparently, breathe. He paused at the wall of tangled plant growth. Again he felt scanning from Clean, brief this time but more intense. In response something dense and leaden inside his torso seemed to tighten, and he felt a stab of pain. He walked on. Both the scan and the brief pain felt like threats or intentions to propel him forward. The pain he simply did not understand, but the scanning made him feel like a victim in the sights of a molester. But Clean did not want to touch him until he had served his purpose here. He was a bargaining chip being played by the AIs to open access to something alien.\nHis aug now signaled to him a connection request. He gazed at it blinking in his HUD—relayed there through the suit link. He winked at it to activate it.\n“Come here to me,” she now said, the voice female and seductive. A moment after this a direction arrow appeared in the bottom of his HUD.\n“Why should I?” he asked.\nA long pause ensued while he considered how the classifications male and female might well not apply here. The voice the entity chose to communicate indicated nothing. It might not even have vocal cords or a mouth, or maybe it had a mouth he would not like to see.\n“Personal survival,” she finally replied, utterly factual. “If you do not come, Ivebek, all protections will be rescinded and Mobius Clean will have you.” Oddly it didn’t sound like a threat. It sounded like mechanics: “If you drill a hole in a bucket, Ivebek, the water will run out.”\n“Plain fact,” he replied. “But what do you want with me, and what are you?”\nShe ignored the question: “Tell me about your encounter.”\nHe stepped into the jungle, pushing between ribbon vines like faded plastic, worming between thick white trunks and half-burned debris, finally stepping out where the jungle had not been compacted and burned by the crash, to where he could walk easily between the plants. He thought about his past and felt something shift in his mind. Suddenly he realized he wanted to talk about everything that had led him finally to that encounter. On other levels he realized his mind had been given a firm prod.\n“I was born on an arcology on Colouron,” he babbled, “and grew up with all my needs met by our post-scarcity society but for purpose and solitude.”\n“Did you feel the ruling AIs should have supplied these?”\n“They should have made it known that they were possible.”\nHe felt very uncomfortable with the question. The AIs had met the physical needs of a population that had, for no clear reason, grown much more than on other worlds. A large anti-AI sentiment had grown there too concerning AIs engineering and interfering with their society, and as a result of that it became a hive of Separatism. Only once he gained perspective from the outside did he discover that the AIs’ touch on Colouron was as light there as anywhere else, and that the problems there had been generated wholly by the society humans formed.\nHe continued, “I found out it was possible to leave once I officially became an adult and did so by runcible.”\n“Why?”\n“To find a purpose and give myself space to breathe.”\n“Did you find these?”\nSomething was moving through the undergrowth over to his right, and he wondered if the distraction of this conversation was a good thing. Using his suit’s scanners in that direction he got an infrared image of a winged creature like a small pterodactyl feeding on an object like a large fruit or egg. He ignored it and moved on.\n“I found solitude when I wanted it, which wasn’t so easy on Colouron, then through contacts I made a business venture.”\n“Smuggling armaments back to Colouron itself as I understand it,” she said. “This purpose was satisfactory?”\n“You know about me, so why are you asking?”\n“I want to understand you and, through you, more about the Polity.” She paused for a second, then continued, “You became a smuggler because of contacts in your home arcology—it was something to do.”\n“I made money at it.”\n“Why did you require money, if the AIs could supply all your needs?”\n“Some things lie outside the AI definition of ‘human needs,’” he replied tightly.\n“Like the ‘purpose’ you mentioned?”\n“Yeah.”\nAgain he wasn’t comfortable with this.\n“From smuggling arms to Separatists you next proceeded to smuggling them to the Graveyard, and there you joined another organization that sold cored and thralled human beings to the prador.”\n“More risk more revenue,” he said.\n“And killing people.”\n“Look, where is this going?”\n“It was you who chose to start telling me your life story. I do not think you can object to me commenting on it.”\n“You did something to me. You made me talk.”\n“Are you sure? Or do you feel some need now to justify yourself?”\n“Fuck you,” he said without heat.\n“Has it not occurred to you to wonder if what you were truly seeking was not purpose, or revenue, but distinction from the crowd and power over other people?”\nHe now wanted to make a heated reply but could not find one beyond repetition of his last words. That was the thing, on Colouron you were one of billions with nothing to make you stand out. Societal structures existed, like the Separatists, and with effort you could climb to the top of any particular heap. But still you were a meat mechanism under the AIs to be fed, housed, and cleaned up after. He could see now that this did drive many from that world and to excellence, while his way of excelling had been through crime. The money had just been a way of keeping score. Simple as that, and he hated the clarity.\n“I will now leave you to your thoughts while you deal with the exigencies of survival, which will be upon you shortly,” she finished. The link closed.\nHe halted and looked around. The jungle had grown thinner now, so he could walk a straight course for more than just a few paces. He became aware of movement behind him and turned. The creature humping between the trunks bore some resemblance to a huge armadillo, though its head possessed three stalked eyes. Below its piggish snout its mouth had far too many teeth. The central eye was focused on him while the other two were checking to either side before they too turned in. It opened its mouth and squealed like a pig, then charged.\nIvebek froze. He could not kill! The pig—for so he named it—came straight at him. At the last moment he threw himself aside into a shoulder roll, and it thundered past. Tearing up earth at the end of its charge, it turned. With shaking hands Ivebek selected thermite shells and fired into the ground before it, throwing burning jungle detritus into its face. The thing took this for a moment then veered aside and went crashing into the jungle to his left. He tracked its course, watching it disappear from sight. He sighed shakily. This should be no problem if the creatures here spooked so easily. As he turned forward again something slammed into his chest to send him staggering, closing numerous legs about him. He got a look into a collection of revolving mandibles as mobile antennae smeared yellow liquid over his visor, then felt a muted punch against belly and a fluttering pain in response. He had just been attacked by a creature like a giant ichneumon wasp.\nHe grabbed the thing in one hand and tried to pull it off as its lower abdomen flicked out then drove in again, trying to push a barbed sting through his armor. It clung tenaciously and he just did not know what to do, because again he could not kill. Then, not even conscious he had chosen to do so, he used assist, driving his fingers into his body with a crunch. Now managing to pull it away, he held it squirming before him then threw it to the ground. Perhaps it was organic memory, for he fired a single shot and blew it in half. Staring down at the still-moving creature he searched himself for a reaction, but found none. Perhaps his empathy did not extend to oversized insects. He went to step over it, then paused and looked back down at the thing.\nHadn’t he seen that before? Behind its head clung an object like a metallic worm cast. He prodded the thing with his toe and the creature made a desultory attempt to bite his boot. He looked up. Yes, he had seen it before.\nThe pig now stood ahead of him and there, on the armor behind its head, was another one of those casts. Some kind of parasite? The creature charged again and this time shots into the ground did not dissuade it. Reluctantly, he raised his aim, but then felt a stirring of joy when this elicited no reaction inside him. He shot it in the head and it crashed to a halt before him. Glancing ’round he could now see other movement in the surrounding jungle.\n“Come on!” he said, hoping for more kills, but next felt a sudden self-disgust. Was this all he was. He lowered his weapon. The nagging pain in his torso arose again, almost rhythmic. He felt sure now that Clean had lied and that it had interfered with his body, because something was driving him to his destination. Sure as shit the pain would increase if he delayed.\nHe broke into a steady trot in the direction of the arrow in his HUD, meanwhile calling up an ammo inventory. He had used up twenty-three explosive shells out of five hundred and had not yet used the pulse gun option of his main weapon. However, he had no idea how far he had to go or how many more attacks there might be.\nAnother pig charged in from the right, its head down so he could not get a clear shot at it. He riddled its body with explosive shells, blowing away chunks of the thing to expose yellow flesh, squirting green blood, and bones like polished oak. He ran as the thing circled ’round and came back at him, trying to keep his distance and putting more and more shots into it until it came down. When he ceased firing he was able to hear a growing hum. The big wasps appeared, flying between the trees, abdomens hanging pendulous. He brought up targeting, keyed to his suit’s motor assist. Putting a crosshair on one of them he blinked for acquisition. The motors moved his arms, correcting where he could not, and he fired, blowing the creature apart with one pulse shot. But this lengthy procedure allowed others to get closer and they were coming in all around. They were sneaky too, taking fast flights between concealments, like they knew what his weapons could do. He began firing short pulse gun bursts where they seemed thickest, blowing many apart and bringing down steaming foliage, but still they drew closer. Turning to where fewer of them flew, he ran in that direction. Sticking his main weapon to a pad on the front of his suit, he drew his sidearm for closer shooting, his free hand on assist to beat the creatures away.\nAbruptly he found himself stumbling down a steep slope. Tall trees shrank to dwarfs, cycads bloomed, and low greenery and blue-ery tangled his feet. He fell, struggled upright tearing one of the creatures from his back and slamming it into a tree. A few more steps, batting the things away, brought him to the edge of a slow deep river. He turned his back to it, holstered his sidearm, and detached his main weapon, firing short bursts again, shredding the flying creatures. The third pig hurtled downslope at him. Even the explosive shell annihilating its head did not stop it, and it crashed into him, hurling him and itself into the water.\nIvebek sank, just for a second until his suit compensated. Expanding around him as it filled gas pockets, it began to bring him to the surface again. His visor gave him a clear view all around as the water filled with giant snakes a foot in thickness, but seemingly without heads or tails. He surfaced to see one of the things looped up over him, the head now visible, a mass of stalked eyes and a letterbox mouth. It snapped down, closing that mouth over his main weapon, snatched that away and tossed it. It came down again and grabbed his shoulder even as he drew his sidearm. Hauling him up it shook him, then discarded him. He crashed down on the other side of the river and lay there on his back expecting further attacks, but none came. In retrospect, he realized there had only been one creature in the river. And reviewing memory, he saw it had one of those metallic casts on the side of his head.\nHe stood up, rubbing at his belly but hardly able to feel his hand through the armor. Counterintuitively the pain had receded—his torso just heavy and tight now. Next, using suit scanning, he located his main weapon in the river, which was now boiling with the coils of that creature’s body. He knew with utter certainty that it would not allow him to retrieve it, and that disarming him had been the purpose of its attack. Looking across to the other side he saw the wasps bobbing there as if from a disturbed hive, but they weren’t crossing. Two of the pigs were even now heading back into the jungle. Turning in the direction indicated by the arrow in his HUD, he saw a creature, like a manta ray with legs, appear from between the taller trees. When he raised his sidearm to aim at the thing it began to make its way down toward him, opening and closing a toothless mouth that did not seem designed for predation. Noting the metallic cast behind its four black button eyes, he lowered his weapon and tossed it down in the dirt beside him. The creature halted, turned clumsily, and headed back into the trees.\n“You didn’t want me to have weapons,” he said, after opening the link.\n“Even I can die,” she replied.\n“Are there any creatures here you do not control?” he asked. “I really don’t want to abandon my last weapon if there is something that might attack me.”\n“You are more intelligent than I supposed.”\n“Many have made that mistake.”\n“There are only two creatures on this world I cannot choose to control,” she said. “You and the AI Mobius Clean.”\n“Who, it is apparent, doesn’t know that you can control the wildlife here. Else you would have told him I had no need for weapons.”\n“Precisely.”\nHe stepped away from the sidearm and continued up the slope from the river. Pausing by some rocks, he flipped one over. This revealed creatures like woodlice, but white and circular. On closer inspection he saw more of those worm casts on their shells. She wasn’t lying. He flipped the rock back and continued on.\n“You asked if what I sought was distinction from the crowd and power over others,” he said. “A hundred days ago I would have sneered at the question but now, I think, I can give you an honest answer. I delighted in power over others and exercised it whenever I could. I took cruel pleasure in the terror of those I cored and thralled. I enjoyed being the big man able to order others to kill. I was someone who did not deserve to live.”\n“And why do you have that perspective now?” she asked.\n“Because something changed me.”\n“Perhaps you would like to tell me about that?”\nThe memories weren’t clear, but still he tried to put them in order.\n“I met a man in the Graveyard who gave me the location, on a world, of an alien weapon and I went there to seek it out.”\nHe could clearly see the bar in his mind, the drink on the table before him, and Grayson Trada sitting opposite.\nTrada was both excited and scared. “It’s real Jain stuff—you see the data.”\nHe certainly had and it really looked genuine.\n“Why don’t you go after it, then?” he had asked.\n“I trade information—too many agents in the Graveyard now and I really don’t want to be noticed by them. That ship has sailed as far as you are concerned.”\nHe had nodded agreement. He knew about the reward for his capture or proof of execution of sentence against him. Only recently he’s upped the count to four of those who had sought to claim the reward and failed. He slid a pack of etched sapphires across the table. Trada verified them and swiftly departed, glad to have such dangerous information off his hands. The coordinates Ivebek had loaded into a storage rod were detailed, and he felt much excitement about going after the items the data detailed.\n“I landed and went to the coordinates given.”\nAgain he saw the desert and that mother-of-pearl entrance, but nothing of what happened in there. He told her how afterward he had paid off his crew at another location on his way out of the Graveyard. But all he could remember was his intense desire to head to a location in the Polity—a place he had avoided for a long time because of the warrants out for him. Necessity forced him to stop at a space station for his ship was old and required primitive deuterium fuel, and that’s where the Polity agent grabbed him.\n“And what was that destination?” she asked.\nHe broke into a sweat as he tried to recover it from his mind. His torso ached in sympathy and gave him a couple of stabs. But he just couldn’t find the memory.\nShe now added, “It is almost as if your conscience was driving you, and that the destination was in fact the Polity, and the purpose was your capture.”\nNo, that could not be right, surely? Again he tried to excavate memory, but now began asking himself some pertinent questions. Why had he paid off his crew? Had it been entirely necessary to stop for fuel? Had it been necessary to leave his ship and board that space station, knowing the dangers? In retrospect, it did seem he had been seeking capture, but somehow that did not feel right at all.\nThe jungle thinned out around him while across the blue-green firmament the cloud began to fragment. On occasion he got himself a clear view to the horizon and a mountain chain there, the sun setting. He felt suddenly hot, feverish hot, and checked the internal temperature of his suit. Its setting had not changed, but still he felt uncomfortable.\n“I think Clean has done something to me,” he said, but she did not reply.\nHe came out onto a clearing on a downslope, now seeing the mountains more clearly. The rock formations looked odd, rather more like they had been deposited in worms by a deposition welder than pushed up from below. Lying between him and them lone massifs of the same wormish construction stood up out of the jungle. He paused, eyed a boulder lying at the edge of the clearing, then went over and sat down. His guts gave him another stab, but he ignored that and, without thinking, reached up to the neck control on his headgear. The visor slid down into the neck ring while the helmet softened and rolled off his head and down to the back of the ring. Cool air hit him and he reveled in it, only a moment later realizing what he had done. He was capable of breathing this air, yet no human should be. He had opened himself to local biologicals to which, apparently, he was immune. He left the helmet undone, an odd spicy taste in his mouth and a smell like mint in his nostrils.\n“Why am I here?” he asked.\n“You would be more comfortable without your suit,” she replied. “There is nothing here to harm you and the path is easy from now on.”\nOn the one hand her observation seemed utterly reasonable, but abandon his suit? It was his only remaining defense against this world, and, besides that, it had been damned expensive. Still, he opened the side seam down his torso and felt some relief, like he had been wearing particularly tight clothing after a heavy meal.\n“You didn’t answer my question,” he noted.\n“Why are any of us here?” she replied. “To live, to continue, to consume, and to breed. Life continues to find its way forward.”\n“You are being general when I was being specific.”\nThe nagging started up again and he stood. He no longer had the direction arrow in his HUD to follow but found he did not need it. Setting out between trees like giant flowering papyrus he trudged toward those mountains.\n“Those are our base desires, written into our genomes,” she said, “but we build structures on top of them with our intelligence, and call them purpose. However, their bedrock remains the same. The power you sought over others, the uniqueness you craved, in the end were based on survival and the old impulse to display your fitness for breeding.”\n“I don’t agree,” he said, abhorring the idea that his drives were so simple. “We are intelligent creatures who have outgrown our ancient programming.”\n“How nice for you.”\n“And what about you? I don’t even know what you are, but I’m guessing you’re not even remotely human. What about your impulses?”\n“You would recognize them for they have their twins in the life of your original world, that is, if you know much about that original world.”\nHe halted, suddenly irritated by how sweaty and enclosing were his garments. Thumb controls on the wrist of each glove released them and he hooked them on his belt. His hands now felt cool and free and somehow less dirty.\n“Try me,” he said.\n“Consider the impulses of a mollusk that spreads its seed in the sea,” she said. “There is no need for it to display its fitness to breed, just the drive to relieve itself of that seed and let the currents carry it where they will.”\n“You’re a mollusk?”\n“Such definitions are not suitable for the alien.”\n“Then what?”\n“Consider such a creature were it to spread across worlds but was still driven to spread its seed. An intelligent creature, a moral creature.”\n“I don’t understand.”\n“You will.”\nOne of the massifs now lay ahead and he knew at once this was his destination, not the mountains beyond. He felt his eagerness to be there, though the passing thought that the eagerness might not be his own quickly died.\n“The creature would send its seed out in ships or use other technological means,” he tried, but knew he wasn’t thinking clearly.\nHe really did feel feverish now, and his suit seemed to hang leaden on him. Why was he keeping it on? Its value to him now, in this situation with an alien ahead and Clean behind and him utterly powerless, was nil. Comfort and freedom seemed a better goal. He halted and disconnected the sleeves at the shoulders, stripped them off and simply dropped them. The relief was intense. Section by section he removed the rest and then, in a nod to the garment’s value, carefully stacked it on a rock. Now clad only in a thin shipsuit and slippers he felt free, and moved on.\n“We are old,” she said, “and have grown far apart. The urge to spread our genome has remained, though muted, even as we lost or otherwise abandoned the technology that enabled its spread. Some believe this a willing retreat from our nature, for it did not sit well with our growing and, it has to be said, unnatural morality.”\nIvebek felt a sudden surge of horrible knowledge, but it lay just beyond his grasp.\n“Consider the parasite that lays its eggs or some other form of genetic transfer in a host, a carrier,” she continued. “The natural way would be to take those carriers with it to the stars.”\n“The technological answer,” he tried, knowing it was wrong.\n“No, not if you are programmed that way by evolution, and then have little regard for the creatures you use, for then another option becomes available: hosts who themselves can travel, other star traveling races. Unfortunately, such races are inevitably intelligent themselves and, if your growing morality does not permit this, your survival becomes abhorrent.”\n“And then what happens?” he asked, the horror of it beginning to impinge.\n“Then you retreat and your society collapses. You begin to die out and, at some stage, there are few of you scattered across vast stretches of space.”\n“And you no longer breed . . . ”\nGnarled wormish stone now lay before him rising up in a slope, and he hardly remembered the intervening miles. He chose a path leading to a point up above. He wanted to turn and run, but climbed. His torso felt thick, hard, and heavy and there were no more nags of pain for they were no longer necessary.\n“Unfortunately, the urge to breed continues and, in many cases, becomes stronger. It is as if, with extinction threatening, the urge to racial survival increases. Some of these then set lures for the required host—lures they feel will bring them a morally acceptable carrier. Others fight the urge, but when a carrier wanders within their compass, instinct becomes difficult to fight.”\n“You isolated yourself,” he said.\n“I did, and I allowed only limited communication with other races. I retained some of my technology, but it wasn’t enough to stop Mobius Clean coming here. He made the moral argument that you are a killer, I discounted it because the other of my kind had changed you. I tried to damage his ship to prevent him landing, but he did, by which time I could fight my instincts no longer.”\n“What is going to happen to me?” he asked, it almost coming out a sob.\nThe mother-of-pearl tunnel lay before him, and he crawled inside. He didn’t have to go far before she rose up to meet him, mussel flesh and frills, groping tentacles with their barbed bone-like blades.\n“I’m sorry,” she said as she drew him into soft velvet warmth and split him from sternum to crotch. “My mate gave you some durability and I will try to keep you alive.”\nIvebek screamed, then screamed again as the fringed pod wormed out of the split, shrugging off ropes of his intestines. He gazed at stalked eyes inspecting him, other appendages trying to push him back together as the pod inched into a hot pink cavity. Then the world went away.\nIvebek returned to pain. He lay on his back gazing up at the sky, turned his head slightly to take in the slew of organic detritus spilled from the mother-of-pearl hole above. He started gasping—didn’t want to look down at his body.\n“The one you first encountered lured you with the promise of something illegal in the Polity, sure this would bring it a suitable carrier,” said a voice it took him a moment to recognize as Clean. “It ameliorated its feelings of guilt by making you rugged enough to survive the process, and made the changes that drove you toward her.”\nThe AI now slid into sight above him. Feathery tendrils wrapped around him and hauled him from the ground. It wasn’t gentle and he bit down on a scream, but then groaned when he saw his guts hanging out. Sharp stabbing pains all over his body ensued and he felt the paralysis spreading from those points. The tendrils blurred over his injury, detritus flicked away, antibacterial and antiviral foam boiled. He felt his guts going back in and couldn’t scream. He blacked out for a second, then woke to the thrum of cell welding. Sharp stabs faded and he felt movement return to his limbs just as Clean dropped him. He landed with a thump, his torso aching but intact. He lay there in fragments of nacre, bones, and compacted worms of leaves, then he sat up.\n“The biology . . . ” he managed.\nHovering above him, Clean writhed in green sunlight. “The first was, nominally, male, and she female. The requirement for genetic mixing is a facet of her kind as yours. The thing inside you was a sperm carrier.”\n“And now?” He pushed down against the detritus and stood. In the jungle down at the bottom of the slope he could see the ship he had arrived in.\n“She will produce young, thousands of them, and they will spread around this world and no further. We will watch and assist and learn and perhaps help them with their moral problem.”\n“I didn’t really understand that.”\n“Morality ceasing to act in concert with biology you should understand. Many humans have often ceased to eat meat because of their abhorrence of killing. These creatures”—Clean waved a tendril toward the massif behind—“grew and spread and preyed on other intelligent races. They then came to detest their own biology, their method of breeding, because their carriers were intelligent. It spelled racial doom for them, which we have now halted.”\nIvebek wanted to ask now about his own doom, but instead asked, “Why did the male change me as it did? Why am I no longer a killer?” He paused for a second, remembering those creatures in the jungle, and added, “Of intelligent creatures?”\n“Because you had to survive more than being a carrier of the male’s sperm for its conscience to be satisfied.”\n“I don’t understand.”\n“You had to survive me, Ivebek Cloon. Return to the ship now, we are leaving.”\nIvebek nodded, thought about his armored suit down there in the jungle, his abandoned weapons.\nReally, he didn’t need them now.\nNeal Asher was born in 1961 in Essex, Great Britain, and divides his time between there and the island of Crete. He's been an SF and fantasy junky ever since having his mind distorted at an early age by JRRT, Edgar Rice Burroughs, and E C Tubb. Sometime after leaving school he decided to focus on only one of his many interests because it was inclusive of the others: writing. Finally taken on by a large publisher, Pan Macmillan, his first full-length SF novel, Gridlinked, came out in 2001, and now in total he has over twenty-five books to his name, also available in translation across the world.", "source": "https://clarkesworldmagazine.com/asher_02_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Host by Neal Asher"}