{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rich Larson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "t/sNjPp5heQEOZf/KS+AzhGWaKM=", "id": null, "license": null, "comments": "", "raw_text": "5250 words, short story  Carouseling  Ostap is putting the finishing touches on a cartoon tardigrade when Alyce calls him. The render is blown up to the size of a sumo, its butcher-paper skin creased and wrinkled around chubby tendril-tipped legs, its eyeless head dominated by a lamprey mouth. He’ll need to make it less terrifying before he sends it to the art department.  He shrinks it away and answers the call. “Hujambo.”  “Hujambo, yourself, handsome,” Alyce says. “You know you don’t have to learn Swahili before you come visit, right? There’s English pretty much everywhere. And babeltech for everywhere else.”  “Sawa,” Ostap says, using up another third of his Swahili vocabulary. “How was the lab today? The test run?”  “Nothing blew up. So, good.” Alyce’s cam comes on, filling half his goggles. Her dark hair is tied back and she’s wearing the pajamas with the miniature sheep on them. “Tomorrow’s a go.”  Ostap sees the familiar stucco wall of her bedroom behind her. There’s a slice of window that he knows overlooks Nyali Beach. He’s combed over the maps of her neighborhood a dozen times since she moved to Mombasa, trying to imagine her in every street view.  The lab is farther inland, outside the city, and lab is a small word for a super-facility with miles of machinery that make the old Hadron Collider look like a toy. Alyce has tried to explain to him what exactly goes on there, has tried to explain about the Slip, but Ostap was never much for formulas and when he let his eyes glaze over and drool dribble from the corner of his mouth he was only half joking.  “Time to shatter the rules of quantum mechanics?” Ostap asks.  “Yeah. Actually.” She pauses, her mouth set in a way Ostap knows is between worry and anticipation. “If this works, it’ll make history.”  “I can’t wait,” Ostap says. “I love it when you make history.” Her forehead is still creased; he tries to elicit her smile: “Do you worry about your ego expanding to dangerous sizes once you’re famous?”  “Does the universe worry about its constantly-expanding borders?” Alyce asks back, in a grandiose voice, and when Ostap laughs she finally does grin. “How about you? What are you working on today?”  When she asks she always makes it seem as if freelance art is just as important as mind-bending physics.  From the other half of his goggles, Ostap sends her the render plus an animation to make the tardigrade strut in place, its pudgy body wobbling slightly with every step.  “Still designing for that kid’s show,” he says. “This is Terry the Tardigrade, who teaches kids to not be . . . ” He trails off, winding his hand through the air.  Alyce rolls her eyes upward in concentration. “Microscopic.”  “Tardy,” Ostap says. “Teaches them to not be tardy. I’m helping raise good little meat drones.”  Alyce clicks her tongue. “Art School Ostap would be so ashamed.”  “Yes,” Ostap agrees. “But Art School Ostap was sort of a prick.” He revolves the render again. “I’m going to change the mouth. Make it smilier. It’s supposed to look friendly.”  “I thought it was like, be on time or Terry the Tardigrade will eat you?”  “I’ll change the mouth.”  Alyce laughs, her loud laugh that seems too big for her body, and for a moment Ostap wants to ask her then and there. But it wouldn’t be fair. Not on the eve of the test. He’ll ask her in Mombasa.  “Dance with me?” he says instead.  “Yes,” she says. “Yes. Definitely. Let me grab the linkwear.” She disappears off-screen and Ostap hears her rummaging. He minimizes her in his goggles and retrieves a padded shirt and gloves from their hook on the wall.  The linkwear shirt is all smartfabric, kinetic battery, feedback pads and sensors, linked wirelessly to its twin an ocean away. Small blue status lights wink on as he slides it over his head. Gloves next, tickling his palms with phantom pressure. Then he goes to the center of his bare apartment, stands in the footprints he marked with duct tape, and waits for Alyce to sync up.  Suddenly he can feel her in his arms, feel her chest pushed against his chest and her left arm draped perfectly over his right shoulder and her right hand clasped loose in his left. The familiar shape of her body trips some wire deep in his brain; for a second he thinks he can smell her citrus shampoo.  “Pick a song,” he says.  “Just a second. Here.”  The first notes of the melody bloom in his earbuds. It’s an old favorite, a slow kizomba song remixed by a Swiss-Angolan artist they were obsessed with a year ago. He sinks his hip into the piano and feels Alyce sink with him. The percussion kicks in, soft but steady, thumping in his earbuds like an electronic heartbeat.  He slides forward, one, two, marca, and they dance. He can’t feel the brush of her legs against his legs, but Alyce says that’s better, in a way; it makes him lead with his frame instead of cheating with little nudges to her thighs. He can’t feel her cheek against his cheek. But he can feel the warmth and pressure of her body, the subtle shifts of her weight, and when he closes his eyes it’s close enough.  Ostap glides around his empty apartment and guides her around hers, breaking and connecting, slowing and accelerating with the flow of the music. By now the exact dimensions of her room are cemented in his head and he doesn’t have to worry about banging her into her wall or nightstand. They dance another song, and another, then break so Alyce can get a drink of water from her fridge, then dance one final song and end with a dramatic dip two beats too early, which sets them both laughing.  When it’s nearly midnight in Mombasa, Ostap peels off his gloves. They tried sleeping in the linkwear once, but it wasn’t comfortable—it’s better saved for dancing or used together with Alyce’s wireless toys.  “You going to take the linkwear to work with you tomorrow?” he asks. “That way I’d be there for the history-making. You know, in spirit.”  Alyce laughs. “Maybe.”  “Goodnight. Good luck with the test.” Ostap pauses, grasping for syllables, then uses the last third of his newly-learned Swahili. “Ninakupenda.”  Alyce is quiet for a moment that seems like forever, then makes a satisfied noise in her throat. “I love you too.”  “My mistake,” Ostap says. “I thought that meant ‘I’m looking for the washroom.’”  “Sure.” Alyce’s lip twitches. “I love you too, asshole.”  Ostap kisses the air just before she ends the call.  SEVEN FEARED DEAD IN KENYA AFTER QUANTUM TEST FACILITY ACCIDENT  At approximately 5:30AM local time, emergency services responded to multiple automated and human reports of an incident at the Nguyen-Bohr superlab located outside the Kenyan city of Mombasa. First responders extinguished an electrical fire at the entrance of the facility, but upon entering were unable to locate the seven members of the science team logged as present at the time of the incident.  A witness described the scene as “unreal, catastrophic,” and drone-captured images [see below] show the extensive nature of the damage, in which large chunks of the concrete structure and surrounding earth seem to have been torn away.  The superlab, which is the largest of its kind in the world, is used to study quantum phenomena. An experiment involving possible FTL particle travel was scheduled to occur today, but due to the nature of the damage, no autologs have been recovered. The Mombasa Fire Brigade suggested that bodies may be unrecoverable for the same reason.  The last guests have left and Ostap is pouring out the leftover wine, balefully watching Merlot glug and splash into his steel sink. All he wants to do is drink. He wants to drink until the alcohol hollows him out to a dull happiness, spins him a warm protective cocoon to keep him that way until morning. Ostap was never a maudlin drunk.  But he was an alcoholic. Which is why an implant in his stomach, a tiny origami enzyme factory, now breaks down any alcohol long before he can absorb it. Alyce paid for half of the surgery, since he was still treading debt at the time. It felt like love then. It now feels like a middle finger from beyond the grave.  Ostap sets the empty bottle on the counter and looks around his apartment. There are still a few glasses here and there, dregs turning sticky in the bottoms. His roving end table has returned to its usual spot by the sofa with the remainders of the spring rolls and seaweed chips. Reginald, the autocleaner he and Alyce named together one silly night, is wiping a splatter of dipping sauce off the floor. Above it, the smartwall is still flickering clips and snaps of her. People wrote little notes on them with a stylus or just their fingers.  The memorial party was a bad idea. One of Alyce’s friends from Uni asked him to host it, because his apartment is central, and he agreed because he hardly leaves it anyways these days. And secretly, he hoped it might help in some way the wake and funeral had not.  Instead, the night was a collision of awkward physics types and over-dramatic artists, all of whom seemed to have come just to give him pitying looks or too-tight hugs or snippets of advice like you can always talk to someone and don’t start memory archiving or you’ll be in there forever.  And he had to thank them and pretend like he hadn’t spent the past week lying boneless on his couch watching every single second he and Alyce had recorded together. He’d tried to get rid of the goggle marks around his eyes with cold water and vigorous rubbing before people started arriving, but it hadn’t worked.  Almost worse than being pitied was having to pity them all back. Some of them had known Alyce since they were only kids, which made him feel a strange mixture of sympathy, because they had lost more of her than he had, and jealousy, for the same reason. He spent a good chunk of the party hiding in the bathroom, where the tiny knots he has felt in his stomach for weeks knotted themselves even tighter.  Now, staring at the wall of notes he agreed to upload somewhere, he wonders if he deserves to be sad at all. Compared to her friends and family who have known her forever, he is an interloper. His status is inflated only because he was the last person to be in love with her: as if sleeping with her for a year and one month makes his grief just as valid as theirs. He feels like he knew her better than anyone, but it’s a half-hormones illusion.  And he can’t even get drunk.  Reginald jostles him on its way to load the empty glasses into the dishwasher. Without thinking, Ostap gives it a savage kick. The little robot sails across the room; it manages to keep hold of the glasses but one shatters anyway when it smashes to the faux-wood floor.  Ostap watches Reginald rock back and forth on its white plastic shell, trying to right itself. Something about it triggers the tears that have been building up behind his eyes all night. They spill out and down his cheeks, salty hot, as he goes over to crouch beside the autocleaner.  “Sorry.” He flips it over gently. “Sorry, sorry, I didn’t mean it.”  He sits cross-legged, patting Reginald on the back as it starts to wolf down the shards of broken glass. He wipes his eyes with the back of his right hand then wipes his nose with the back of his left. Squints at the smartwall, which is cycling through snaps from Alyce’s last birthday: they went to an overpriced restaurant on the wharf where all the servers wore chamsuits to be less obtrusive, and spent half the evening thanking thin air.  The snap shows Alyce grinning, triumphant, because they managed to catch one in the background. A server had been rolling down the neck of their chamsuit to scratch themselves, placing a tiny sliver of skin beside a levitating drinks tray. From the look on your face, Ostap used to tell her, you’d think it was hard evidence of extraterrestrial life.  He slumps down so he’s lying on the floor of his apartment. He wants to clear the notes and images away, play music loud enough to swallow the sound of his undignified snuffling, but he can’t choke out either command. So he just lies there, listening to his own ragged breathing and to Reginald’s shuffling feet.  Then he hears something else: the soft rustling of smartfabric flexing against itself. He stops crying. Stops breathing. Dangling from the hook on his wall, the linkwear he hasn’t touched for a month is coming online. Ostap gets to his feet. The blue status lights pulse and he is drawn to them like a moth; he staggers to the wall, suspecting that he is dreaming again.  With trembling hands, he lifts the shirt off its hook and pulls it over his head. When the company gathered up all of Alyce’s things and shipped them back to her parents in Antwerp, the linkwear never made it. Ostap knows because he asked Alyce’s mother, who said no, nothing like that, probably some sticky-fingered neighbor made off with it.  But there’s another possibility. Maybe Alyce really did take it with her to the lab on the day things all went to hell. As a way for him to almost be there. Ostap puts on the gloves. With his pulse pounding, he goes to the taped footprints in the center of his apartment and closes his eyes.  They never recovered her body. Any of the bodies. Ostap saw the images, the way whole swathes of earth had been carved up and carried off by some invisible hand. He fantasized, for a little while, that Alyce had only been transported away, which meant she could return. But he thought that was only masochism.  The linkwear syncs. A familiar body presses against him and Ostap’s heart skips a beat. The proportions are right. The height, the shape. He reminds himself it could be saved data. A glitch. Feedback error.  He squeezes Alyce’s hand, and she squeezes back hard.  “Ostap Bender.” Ostap enunciates this time. “I’ve got some questions about the Nguyen-Bohr lab.”  Doctor Anunoby is on East Africa Time; hopefully she doesn’t realize it’s the middle of the night where Ostap is calling from.  “I’ve given statements already,” she says. “Use those. Don’t call my personal line.”  Ostap is standing on the tape marks again, still wearing the shirt and gloves. The last whisper of pressure came hours ago, but he doesn’t dare remove them. “I’m not a reporter. I found the line in Alyce’s contacts. She was my . . . ” Ostap’s throat clogs dry. He didn’t ask. He’d been planning to ask in Mombasa. “Alyce Kerensky was my partner.”  “Oh.” A pause. “I’m sorry for your loss.”  “You worked with her right up until last year,” Ostap says. “Same project. Right?”  “That’s right.”  “She told me a little about it.” Ostap inhales. “About the Slip.”  “Some of us called it that, yes.”  “It was the FTL theory. About how particles could skip, at the right energy levels.” Ostap has some of the literature in his left goggle, but he can barely wrestle through the abstract. In his right goggle he’s trawling the conspiracy forums, the ones he swore off, where people think the scientists were taken by aliens or kidnapped by government agents. “They would disappear and then reappear farther along the beamline. Like they were going into some kind of pocket and coming out again.”  There’s a long pause before Anunoby replies. “We don’t know what happened to Alyce and her team. We have no idea. The instruments were compromised. Half the hardware, just gone. There’s no precedent for it. It’s going to take years to try to sort out what happened, and if we ever do we’ll have local government up our asses about safety measures for, I don’t know. For rapture.”  “I think they’re in the Slip,” Ostap blurts. “I think they’re alive. At least, Alyce is. I felt her in our linkwear.”  “Oh.” Anunoby’s voice cracks slightly. “There’s a trauma group. For friends and family. I can send you the information.”  “That’s not what this is,” Ostap says. “She took the linkwear with her the day it happened. I mean. I think she did. And tonight I felt her squeeze my hand.”  “The amount of energy you need to put a particle in the Slip would vaporize human tissues.”  “Pretend I’m not losing my mind.” Ostap flexes his fingers in the gloves. “What should I do? If it happens again?”  Anunoby sighs. “Be ready for it. Try to backtrace the signal. Try to communicate with whoever’s on the other end. I’ll send you the trauma group info in the meantime.”  “Thanks.”  When it happens again Ostap is sprawled on the couch, half submerged in a dream, a caffeine spray still clutched in his hand. Alyce’s fingers against his chest make him turn his head instinctively, searching for her lips. He doesn’t find them. He jerks fully awake and his eyes fly open.  Alyce’s fingers drop away save one; it feels like her index. Ostap holds perfectly still, hardly breathing, as she draws a circle on his chest. A serpentine curve follows it, and he realizes it was an O, not a circle, and now she is finishing the S and starting the T. He waits until his name is complete, until she places the dot of the question mark:  OSTAP?  Ostap’s hands are shaking. He reaches until he phantom-feels Alyce’s torso, then writes back on her ribcage:  YES  She hugs him, wrapping both arms around him hard and clinging there. Ostap hugs back. The embrace is tight and desperate and he wants it to never end. She used to cling to him like that after sex sometimes, weaving her legs around him too and swearing she wasn’t an octopus, telling him she definitely only had four limbs and to disregard any extras he might feel.  Right now Ostap feels nothing but relief, an endorphin wave crashing over him. Alyce is alive. He looks over at the screen of his tablet, which is hooked up to the linkwear GPS node. According to the trace, Alyce’s signal is coming from nowhere at all. Cold slithers through his warm.  He finally peels an arm free and starts the next message. He gets the R backwards; hopefully she understands it anyways:  WHR U?  Then he stays perfectly still, concentrating as her invisible finger traces a reply.  LAB. NEVR LEFT.  Getting the linkwear through airport security is nerve-shredding—extra scans, extra interrogations—but Ostap makes it onto the plane without them confiscating anything. He stows his bag in the overhead, then slides past a white-haired woman to get to his seat. She gives him a curious glance as he loosens the seatbelt to fit it over his padded shirt. The pillow around her neck is so plump she can barely see over the top of it.  “Is that a comfort vest?” she asks. “One of those things that hugs you if you start having an anxiety attack?”  “Yes,” Ostap says, because that’s more or less how he explained it to security.  “No shame in that,” she says. “I get nervous still. I’ve been flying, what, fifty years. Still get nervous.”  “There’s always ginger ale,” Ostap says. “I think the ginger ale helps. And watching cartoons.”  He finds Alyce’s phantom hand, how he’s done every few minutes since they established contact, and squeezes. She gives two back.  He keeps picturing her in the Slip. She described it to him in painstaking detail, switching from drawing letters to tapping out Morse code that Ostap needed his goggles to translate. She says she’s still in the observation room, or at least somewhere that looks like it. But with some differences.  She’s only been there for a day at most. Her last memory is unexpected activity on the third beamline. Color is muted, everything a soft cold blue. Light and motion warp in strange ways, leaving misplaced reflections and lingering blurs.  Sometimes she thinks she sees flickers of the other scientists, of Bagley, Chiozza, Xu, and the rest, moving around the observation room. She can’t interact with them. Aside from the linkwear, none of her personal electronics work. None of the lab tech works.  She can’t detect air currents. She’s breathing, but she held her breath for just over seven minutes and showed no ill effects, meaning she might not need to. She is not sure—and this is where Ostap had to stop her and hold her—if she is still alive, in the strictest sense of the word. He told her he would take undead Alyce over dead Alyce any day. And that Dr. Anunoby would figure out a way to get her out.  “Been to Kenya before?” the white-haired woman asks. “I’m visiting my son. He’s on the coast.”  “I haven’t,” Ostap says. “I’ve been planning it for a long time, though.” He pauses. “Hujambo.”  “Oh, you’re going to blow them away. Where are the cartoons?”  Ostap helps her scroll through the kid’s channels until he finds her The Almost Adventures of Terry the Tardigrade. Then he puts his earbuds in and settles back in his seat, tapping his finger against Alyce’s palm:  OMW.  Dr. Anunoby is taller than he imagined her, spindly limbs in a black pantsuit, flyaway hair. She picks him out of the arrival rush and Ostap removes his glove to shake hands. His palm is already slick with sweat from the brief walk through the tarmac-shimmering heat between airplane and airport. Alyce warned him it was hot in March. Told him to bring good sunblock or he’d spontaneously combust on the beach.  Dr. Anunoby asks the perfunctory questions about his flight as she steers him to the exit, and Ostap can tell she has never been tardy in her life. A boxy black Chinese rental is waiting for them outside. He slides gratefully back into air conditioning. Dr. Anunoby slides in after him, eyeing the linkwear.  “So you’ve been communicating entirely by touch.”  “Yes. Well, Morse code. Haven’t thought up anything better.”  “May I?”  After a moment’s hesitation, Ostap peels off his right glove and hands it over. She puts it on, flexing her fingers, and he guides her hand to Alyce’s shoulder. For a terrifying instant he thinks Dr. Anunoby won’t feel anything, that she’ll frown and gently confirm that he is losing his mind. But then her eyes widen slightly. Ostap pulls up a Morse code translator for her and watches in silence, his bare hand clenched tight on his thigh.  “What are you saying?” he asks, when he fails to keep track of her pulses.  “Asking a very specific question about how we met,” Dr. Anunoby says.  “Just to be sure it’s not an elaborate hoax?”  She nods. “You don’t seem like the type for an elaborate hoax. But I need to ask. For my own peace of mind.”  Ostap watches out the window while he waits. They’re on the highway now, parallel to the Mombasa-Nairobi raised rail, driving in its shadow. Passenger pods flash like silverfish along the retrofitted magnetics. The soil is rust red and the trees are a lush dark green. When the car pulls off onto a smaller road, they have to drive through a scanner gate.  “Thank you,” Dr. Anunoby says, returning the glove. “It’s incredible. It’s really incredible.”  Ostap puts the glove back on and gropes for Alyce’s hand, interweaves his fingers with hers. “So?” he asks. “How are we going to get her back?”  Dr. Anunoby purses her lips as the car glides to a halt. “There’s something I didn’t tell you. I couldn’t tell you until I was sure.”  Ostap’s stomach churns. The tiny knots are back, coiled tighter than ever, carouseling. “What?”  “We’re starting to find bodies.” Dr. Anunoby pushes open the car door. “Come up the hill.”  She gets out and Ostap stumbles after her. The sun is too harsh for his flimsy airport shades; he squints his eyes behind them. The heat beats him around the head and shoulders as he follows her over gravel parking lot to a slope of red-brown earth. His knees are weak and watery, but he climbs it anyway. A breeze ruffles his hair and cools his sweaty forehead as they near the top.  When they crest the hill, he sees the damage the drone photos didn’t do justice. The external hub of the Nguyen-Bohr lab, now charred rubble, is large enough on its own. But the facility extended for miles beneath the surface, and has now been sectioned out in huge swathes by some unseen surgical blade.  For a moment Ostap’s eyes rebel at the scope of the scene, the unnatural composition. It looks more like effects, like something he would render in his goggles, than anything real. He can see layers of packed dirt, concrete, wiring, all neatly sheared to the same exact proportions. The electrical fires were a sideshow. The real damage was done by something else. Or maybe by nothing at all.  He looks at the massive pit where the observation room once was. There’s an emergency crew down there, reflective jackets gleaming in the sunshine. He can see them loading something onto a stretcher.  “The first one showed up just after you called me,” Dr. Anunoby says. “Bits of skeleton and muscle all mixed up with chunks of the floor. With metal and wiring. They scraped enough DNA to identify it as Dr. Simmons. Xu followed the same way about an hour ago. It’s like the . . . the Slip . . . is spitting them back out. But not intact.”  Ostap’s tongue is too dry to talk. He tries twice before he gets the first word out. “We can bring her back safe. Somehow.”  “We’re ants,” Dr. Anunoby says. She nods her chin at the destruction. “We don’t understand how this happened. No other facility in the world has the tech to run the test again, not even CERN, and if they tried it might end up even worse. We made a mistake.”  Ostap sinks to his haunches, spreads one hand in the hot dust for balance. His vision constricts like black rubber. He dimly feels Dr. Anunoby crouching beside him, pushing a water bottle into his free hand. He feels Alyce give his arm a questioning squeeze. His breathing slowly returns to normal.  “I can be the one to tell her,” Dr. Anunoby says, with a tremor in her voice. “If you want. It can be me. I think she already suspects.”  “Then why would I get to talk to her again?” Ostap demands, anger going off in his chest like a flare. He surges to his feet, wobbling only once. “If it’s for nothing? If there’s nothing I can do?”  For the first time, the linkwear feels like a straitjacket. He wants to rip it away and hurl it off the hill. Alyce squeezes his wrist again, tighter now. She knows something is wrong.  Dr. Anunoby shakes her head. “I’ll wait down there,” she says, and starts back down the hill.  Ostap barely hears her. He paces a tight frantic circle. He beats his hands against the ground; stops, flinches, wonders if Alyce can feel it. He shouts no particular word and the wind strips it away. Finally he sinks down to his knees and goes still.  Alyce’s finger presses against his chest. He repeats the letters aloud, wrestling each one out of his windpipe, and watches her message form in his goggles.  No way back  He waits for the question mark, but it doesn’t come. He runs his hands over the parts of her body he can reach, caressing her neck, her shoulders, her arms. He moves his finger to her palm.  No.  She pushes back, tap press press. He waits. Waits. The last letter forms and he chokes on a laugh.  Well fuck.  He hugs her as tightly as he can, closing his eyes, imagining the brush of her hair in his face, her temple against his neck. She clings back. He realizes, with a sick feeling all through his body, that he can ask her now. It will be grand and symbolic and mean nothing, because she’s not coming back. Not alive. It will be a farce. She’ll say yes because there is nothing else to say at the end of the world.  Ostap tells her about the bodies. Alyce is still for a long time, long enough to put panic in Ostap’s throat. Then she has messages for her parents. For her friends. Observations for Dr. Anunoby and her colleagues. She etches them out with trembling fingers and Ostap transcribes them all. It’s slow. Painstaking. The tension is piano-wire taut, because Ostap knows each letter might be the last one. He knows she might be the next barely body to arrive. The question is building up in his mouth.  The messages trail off, and Ostap tries to imagine what she’s feeling but can’t. He has his overshirt draped over his head to shield him from the sun, but it’s cooling off now. The sky is slowly turning red for sunset. Dr. Anunoby is still waiting, like a statue, beside the car. She is an ant. Ostap is an ant. Alyce is a particularly good ant. So he supposes it wouldn’t have mattered anyway.  Shaking badly, he starts to write:  Made history.  He waits.  Yes.  He writes again, heart thumping out of his chest. It’s slow, so slow. On each letter he thinks of a dozen other things he could turn it into.  We should  She squeezes him so tight he has to stop. He wonders, in a panic, if it’s happening. If she’s being ripped back out of the Slip. Then she finishes the sentence.  Marry.  This is why he had one more chance to talk to her. For this one unsullied surge of happiness. He knows it won’t last. Can’t last. But it is, and she is, and they are. He has a hundred more things he wants to say, the things he hopes are true: that he loves her more than he’s ever loved anyone, that he would follow her into the Slip and be ghosts or corpses with her, that he was going to ask her on Nyali Beach under the moonlight. He writes:  I do.  And she writes:  I do too.  Then Ostap gets to his feet and presses one last word into her skin:  Dance?  He feels her chest pushed against his chest. Her left arm over his right shoulder. Her right hand clasped in his left hand. He can almost feel Alyce’s heartbeat against his own. They dance with no music, one, two, marca. Ostap is sure he would be stepping on her feet if her feet were there, but it doesn’t matter.  They glide around the top of the rust-red hill and around the soft blue observation room, in and out of the Slip, until the light is gone and he can’t feel any part of her. Rich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "text": "5250 words, short story\nCarouseling\nOstap is putting the finishing touches on a cartoon tardigrade when Alyce calls him. The render is blown up to the size of a sumo, its butcher-paper skin creased and wrinkled around chubby tendril-tipped legs, its eyeless head dominated by a lamprey mouth. He’ll need to make it less terrifying before he sends it to the art department.\nHe shrinks it away and answers the call. “Hujambo.”\n“Hujambo, yourself, handsome,” Alyce says. “You know you don’t have to learn Swahili before you come visit, right? There’s English pretty much everywhere. And babeltech for everywhere else.”\n“Sawa,” Ostap says, using up another third of his Swahili vocabulary. “How was the lab today? The test run?”\n“Nothing blew up. So, good.” Alyce’s cam comes on, filling half his goggles. Her dark hair is tied back and she’s wearing the pajamas with the miniature sheep on them. “Tomorrow’s a go.”\nOstap sees the familiar stucco wall of her bedroom behind her. There’s a slice of window that he knows overlooks Nyali Beach. He’s combed over the maps of her neighborhood a dozen times since she moved to Mombasa, trying to imagine her in every street view.\nThe lab is farther inland, outside the city, and lab is a small word for a super-facility with miles of machinery that make the old Hadron Collider look like a toy. Alyce has tried to explain to him what exactly goes on there, has tried to explain about the Slip, but Ostap was never much for formulas and when he let his eyes glaze over and drool dribble from the corner of his mouth he was only half joking.\n“Time to shatter the rules of quantum mechanics?” Ostap asks.\n“Yeah. Actually.” She pauses, her mouth set in a way Ostap knows is between worry and anticipation. “If this works, it’ll make history.”\n“I can’t wait,” Ostap says. “I love it when you make history.” Her forehead is still creased; he tries to elicit her smile: “Do you worry about your ego expanding to dangerous sizes once you’re famous?”\n“Does the universe worry about its constantly-expanding borders?” Alyce asks back, in a grandiose voice, and when Ostap laughs she finally does grin. “How about you? What are you working on today?”\nWhen she asks she always makes it seem as if freelance art is just as important as mind-bending physics.\nFrom the other half of his goggles, Ostap sends her the render plus an animation to make the tardigrade strut in place, its pudgy body wobbling slightly with every step.\n“Still designing for that kid’s show,” he says. “This is Terry the Tardigrade, who teaches kids to not be . . . ” He trails off, winding his hand through the air.\nAlyce rolls her eyes upward in concentration. “Microscopic.”\n“Tardy,” Ostap says. “Teaches them to not be tardy. I’m helping raise good little meat drones.”\nAlyce clicks her tongue. “Art School Ostap would be so ashamed.”\n“Yes,” Ostap agrees. “But Art School Ostap was sort of a prick.” He revolves the render again. “I’m going to change the mouth. Make it smilier. It’s supposed to look friendly.”\n“I thought it was like, be on time or Terry the Tardigrade will eat you?”\n“I’ll change the mouth.”\nAlyce laughs, her loud laugh that seems too big for her body, and for a moment Ostap wants to ask her then and there. But it wouldn’t be fair. Not on the eve of the test. He’ll ask her in Mombasa.\n“Dance with me?” he says instead.\n“Yes,” she says. “Yes. Definitely. Let me grab the linkwear.” She disappears off-screen and Ostap hears her rummaging. He minimizes her in his goggles and retrieves a padded shirt and gloves from their hook on the wall.\nThe linkwear shirt is all smartfabric, kinetic battery, feedback pads and sensors, linked wirelessly to its twin an ocean away. Small blue status lights wink on as he slides it over his head. Gloves next, tickling his palms with phantom pressure. Then he goes to the center of his bare apartment, stands in the footprints he marked with duct tape, and waits for Alyce to sync up.\nSuddenly he can feel her in his arms, feel her chest pushed against his chest and her left arm draped perfectly over his right shoulder and her right hand clasped loose in his left. The familiar shape of her body trips some wire deep in his brain; for a second he thinks he can smell her citrus shampoo.\n“Pick a song,” he says.\n“Just a second. Here.”\nThe first notes of the melody bloom in his earbuds. It’s an old favorite, a slow kizomba song remixed by a Swiss-Angolan artist they were obsessed with a year ago. He sinks his hip into the piano and feels Alyce sink with him. The percussion kicks in, soft but steady, thumping in his earbuds like an electronic heartbeat.\nHe slides forward, one, two, marca, and they dance. He can’t feel the brush of her legs against his legs, but Alyce says that’s better, in a way; it makes him lead with his frame instead of cheating with little nudges to her thighs. He can’t feel her cheek against his cheek. But he can feel the warmth and pressure of her body, the subtle shifts of her weight, and when he closes his eyes it’s close enough.\nOstap glides around his empty apartment and guides her around hers, breaking and connecting, slowing and accelerating with the flow of the music. By now the exact dimensions of her room are cemented in his head and he doesn’t have to worry about banging her into her wall or nightstand. They dance another song, and another, then break so Alyce can get a drink of water from her fridge, then dance one final song and end with a dramatic dip two beats too early, which sets them both laughing.\nWhen it’s nearly midnight in Mombasa, Ostap peels off his gloves. They tried sleeping in the linkwear once, but it wasn’t comfortable—it’s better saved for dancing or used together with Alyce’s wireless toys.\n“You going to take the linkwear to work with you tomorrow?” he asks. “That way I’d be there for the history-making. You know, in spirit.”\nAlyce laughs. “Maybe.”\n“Goodnight. Good luck with the test.” Ostap pauses, grasping for syllables, then uses the last third of his newly-learned Swahili. “Ninakupenda.”\nAlyce is quiet for a moment that seems like forever, then makes a satisfied noise in her throat. “I love you too.”\n“My mistake,” Ostap says. “I thought that meant ‘I’m looking for the washroom.’”\n“Sure.” Alyce’s lip twitches. “I love you too, asshole.”\nOstap kisses the air just before she ends the call.\nSEVEN FEARED DEAD IN KENYA AFTER QUANTUM TEST FACILITY ACCIDENT\nAt approximately 5:30AM local time, emergency services responded to multiple automated and human reports of an incident at the Nguyen-Bohr superlab located outside the Kenyan city of Mombasa. First responders extinguished an electrical fire at the entrance of the facility, but upon entering were unable to locate the seven members of the science team logged as present at the time of the incident.\nA witness described the scene as “unreal, catastrophic,” and drone-captured images [see below] show the extensive nature of the damage, in which large chunks of the concrete structure and surrounding earth seem to have been torn away.\nThe superlab, which is the largest of its kind in the world, is used to study quantum phenomena. An experiment involving possible FTL particle travel was scheduled to occur today, but due to the nature of the damage, no autologs have been recovered. The Mombasa Fire Brigade suggested that bodies may be unrecoverable for the same reason.\nThe last guests have left and Ostap is pouring out the leftover wine, balefully watching Merlot glug and splash into his steel sink. All he wants to do is drink. He wants to drink until the alcohol hollows him out to a dull happiness, spins him a warm protective cocoon to keep him that way until morning. Ostap was never a maudlin drunk.\nBut he was an alcoholic. Which is why an implant in his stomach, a tiny origami enzyme factory, now breaks down any alcohol long before he can absorb it. Alyce paid for half of the surgery, since he was still treading debt at the time. It felt like love then. It now feels like a middle finger from beyond the grave.\nOstap sets the empty bottle on the counter and looks around his apartment. There are still a few glasses here and there, dregs turning sticky in the bottoms. His roving end table has returned to its usual spot by the sofa with the remainders of the spring rolls and seaweed chips. Reginald, the autocleaner he and Alyce named together one silly night, is wiping a splatter of dipping sauce off the floor. Above it, the smartwall is still flickering clips and snaps of her. People wrote little notes on them with a stylus or just their fingers.\nThe memorial party was a bad idea. One of Alyce’s friends from Uni asked him to host it, because his apartment is central, and he agreed because he hardly leaves it anyways these days. And secretly, he hoped it might help in some way the wake and funeral had not.\nInstead, the night was a collision of awkward physics types and over-dramatic artists, all of whom seemed to have come just to give him pitying looks or too-tight hugs or snippets of advice like you can always talk to someone and don’t start memory archiving or you’ll be in there forever.\nAnd he had to thank them and pretend like he hadn’t spent the past week lying boneless on his couch watching every single second he and Alyce had recorded together. He’d tried to get rid of the goggle marks around his eyes with cold water and vigorous rubbing before people started arriving, but it hadn’t worked.\nAlmost worse than being pitied was having to pity them all back. Some of them had known Alyce since they were only kids, which made him feel a strange mixture of sympathy, because they had lost more of her than he had, and jealousy, for the same reason. He spent a good chunk of the party hiding in the bathroom, where the tiny knots he has felt in his stomach for weeks knotted themselves even tighter.\nNow, staring at the wall of notes he agreed to upload somewhere, he wonders if he deserves to be sad at all. Compared to her friends and family who have known her forever, he is an interloper. His status is inflated only because he was the last person to be in love with her: as if sleeping with her for a year and one month makes his grief just as valid as theirs. He feels like he knew her better than anyone, but it’s a half-hormones illusion.\nAnd he can’t even get drunk.\nReginald jostles him on its way to load the empty glasses into the dishwasher. Without thinking, Ostap gives it a savage kick. The little robot sails across the room; it manages to keep hold of the glasses but one shatters anyway when it smashes to the faux-wood floor.\nOstap watches Reginald rock back and forth on its white plastic shell, trying to right itself. Something about it triggers the tears that have been building up behind his eyes all night. They spill out and down his cheeks, salty hot, as he goes over to crouch beside the autocleaner.\n“Sorry.” He flips it over gently. “Sorry, sorry, I didn’t mean it.”\nHe sits cross-legged, patting Reginald on the back as it starts to wolf down the shards of broken glass. He wipes his eyes with the back of his right hand then wipes his nose with the back of his left. Squints at the smartwall, which is cycling through snaps from Alyce’s last birthday: they went to an overpriced restaurant on the wharf where all the servers wore chamsuits to be less obtrusive, and spent half the evening thanking thin air.\nThe snap shows Alyce grinning, triumphant, because they managed to catch one in the background. A server had been rolling down the neck of their chamsuit to scratch themselves, placing a tiny sliver of skin beside a levitating drinks tray. From the look on your face, Ostap used to tell her, you’d think it was hard evidence of extraterrestrial life.\nHe slumps down so he’s lying on the floor of his apartment. He wants to clear the notes and images away, play music loud enough to swallow the sound of his undignified snuffling, but he can’t choke out either command. So he just lies there, listening to his own ragged breathing and to Reginald’s shuffling feet.\nThen he hears something else: the soft rustling of smartfabric flexing against itself. He stops crying. Stops breathing. Dangling from the hook on his wall, the linkwear he hasn’t touched for a month is coming online. Ostap gets to his feet. The blue status lights pulse and he is drawn to them like a moth; he staggers to the wall, suspecting that he is dreaming again.\nWith trembling hands, he lifts the shirt off its hook and pulls it over his head. When the company gathered up all of Alyce’s things and shipped them back to her parents in Antwerp, the linkwear never made it. Ostap knows because he asked Alyce’s mother, who said no, nothing like that, probably some sticky-fingered neighbor made off with it.\nBut there’s another possibility. Maybe Alyce really did take it with her to the lab on the day things all went to hell. As a way for him to almost be there. Ostap puts on the gloves. With his pulse pounding, he goes to the taped footprints in the center of his apartment and closes his eyes.\nThey never recovered her body. Any of the bodies. Ostap saw the images, the way whole swathes of earth had been carved up and carried off by some invisible hand. He fantasized, for a little while, that Alyce had only been transported away, which meant she could return. But he thought that was only masochism.\nThe linkwear syncs. A familiar body presses against him and Ostap’s heart skips a beat. The proportions are right. The height, the shape. He reminds himself it could be saved data. A glitch. Feedback error.\nHe squeezes Alyce’s hand, and she squeezes back hard.\n“Ostap Bender.” Ostap enunciates this time. “I’ve got some questions about the Nguyen-Bohr lab.”\nDoctor Anunoby is on East Africa Time; hopefully she doesn’t realize it’s the middle of the night where Ostap is calling from.\n“I’ve given statements already,” she says. “Use those. Don’t call my personal line.”\nOstap is standing on the tape marks again, still wearing the shirt and gloves. The last whisper of pressure came hours ago, but he doesn’t dare remove them. “I’m not a reporter. I found the line in Alyce’s contacts. She was my . . . ” Ostap’s throat clogs dry. He didn’t ask. He’d been planning to ask in Mombasa. “Alyce Kerensky was my partner.”\n“Oh.” A pause. “I’m sorry for your loss.”\n“You worked with her right up until last year,” Ostap says. “Same project. Right?”\n“That’s right.”\n“She told me a little about it.” Ostap inhales. “About the Slip.”\n“Some of us called it that, yes.”\n“It was the FTL theory. About how particles could skip, at the right energy levels.” Ostap has some of the literature in his left goggle, but he can barely wrestle through the abstract. In his right goggle he’s trawling the conspiracy forums, the ones he swore off, where people think the scientists were taken by aliens or kidnapped by government agents. “They would disappear and then reappear farther along the beamline. Like they were going into some kind of pocket and coming out again.”\nThere’s a long pause before Anunoby replies. “We don’t know what happened to Alyce and her team. We have no idea. The instruments were compromised. Half the hardware, just gone. There’s no precedent for it. It’s going to take years to try to sort out what happened, and if we ever do we’ll have local government up our asses about safety measures for, I don’t know. For rapture.”\n“I think they’re in the Slip,” Ostap blurts. “I think they’re alive. At least, Alyce is. I felt her in our linkwear.”\n“Oh.” Anunoby’s voice cracks slightly. “There’s a trauma group. For friends and family. I can send you the information.”\n“That’s not what this is,” Ostap says. “She took the linkwear with her the day it happened. I mean. I think she did. And tonight I felt her squeeze my hand.”\n“The amount of energy you need to put a particle in the Slip would vaporize human tissues.”\n“Pretend I’m not losing my mind.” Ostap flexes his fingers in the gloves. “What should I do? If it happens again?”\nAnunoby sighs. “Be ready for it. Try to backtrace the signal. Try to communicate with whoever’s on the other end. I’ll send you the trauma group info in the meantime.”\n“Thanks.”\nWhen it happens again Ostap is sprawled on the couch, half submerged in a dream, a caffeine spray still clutched in his hand. Alyce’s fingers against his chest make him turn his head instinctively, searching for her lips. He doesn’t find them. He jerks fully awake and his eyes fly open.\nAlyce’s fingers drop away save one; it feels like her index. Ostap holds perfectly still, hardly breathing, as she draws a circle on his chest. A serpentine curve follows it, and he realizes it was an O, not a circle, and now she is finishing the S and starting the T. He waits until his name is complete, until she places the dot of the question mark:\nOSTAP?\nOstap’s hands are shaking. He reaches until he phantom-feels Alyce’s torso, then writes back on her ribcage:\nYES\nShe hugs him, wrapping both arms around him hard and clinging there. Ostap hugs back. The embrace is tight and desperate and he wants it to never end. She used to cling to him like that after sex sometimes, weaving her legs around him too and swearing she wasn’t an octopus, telling him she definitely only had four limbs and to disregard any extras he might feel.\nRight now Ostap feels nothing but relief, an endorphin wave crashing over him. Alyce is alive. He looks over at the screen of his tablet, which is hooked up to the linkwear GPS node. According to the trace, Alyce’s signal is coming from nowhere at all. Cold slithers through his warm.\nHe finally peels an arm free and starts the next message. He gets the R backwards; hopefully she understands it anyways:\nWHR U?\nThen he stays perfectly still, concentrating as her invisible finger traces a reply.\nLAB. NEVR LEFT.\nGetting the linkwear through airport security is nerve-shredding—extra scans, extra interrogations—but Ostap makes it onto the plane without them confiscating anything. He stows his bag in the overhead, then slides past a white-haired woman to get to his seat. She gives him a curious glance as he loosens the seatbelt to fit it over his padded shirt. The pillow around her neck is so plump she can barely see over the top of it.\n“Is that a comfort vest?” she asks. “One of those things that hugs you if you start having an anxiety attack?”\n“Yes,” Ostap says, because that’s more or less how he explained it to security.\n“No shame in that,” she says. “I get nervous still. I’ve been flying, what, fifty years. Still get nervous.”\n“There’s always ginger ale,” Ostap says. “I think the ginger ale helps. And watching cartoons.”\nHe finds Alyce’s phantom hand, how he’s done every few minutes since they established contact, and squeezes. She gives two back.\nHe keeps picturing her in the Slip. She described it to him in painstaking detail, switching from drawing letters to tapping out Morse code that Ostap needed his goggles to translate. She says she’s still in the observation room, or at least somewhere that looks like it. But with some differences.\nShe’s only been there for a day at most. Her last memory is unexpected activity on the third beamline. Color is muted, everything a soft cold blue. Light and motion warp in strange ways, leaving misplaced reflections and lingering blurs.\nSometimes she thinks she sees flickers of the other scientists, of Bagley, Chiozza, Xu, and the rest, moving around the observation room. She can’t interact with them. Aside from the linkwear, none of her personal electronics work. None of the lab tech works.\nShe can’t detect air currents. She’s breathing, but she held her breath for just over seven minutes and showed no ill effects, meaning she might not need to. She is not sure—and this is where Ostap had to stop her and hold her—if she is still alive, in the strictest sense of the word. He told her he would take undead Alyce over dead Alyce any day. And that Dr. Anunoby would figure out a way to get her out.\n“Been to Kenya before?” the white-haired woman asks. “I’m visiting my son. He’s on the coast.”\n“I haven’t,” Ostap says. “I’ve been planning it for a long time, though.” He pauses. “Hujambo.”\n“Oh, you’re going to blow them away. Where are the cartoons?”\nOstap helps her scroll through the kid’s channels until he finds her The Almost Adventures of Terry the Tardigrade. Then he puts his earbuds in and settles back in his seat, tapping his finger against Alyce’s palm:\nOMW.\nDr. Anunoby is taller than he imagined her, spindly limbs in a black pantsuit, flyaway hair. She picks him out of the arrival rush and Ostap removes his glove to shake hands. His palm is already slick with sweat from the brief walk through the tarmac-shimmering heat between airplane and airport. Alyce warned him it was hot in March. Told him to bring good sunblock or he’d spontaneously combust on the beach.\nDr. Anunoby asks the perfunctory questions about his flight as she steers him to the exit, and Ostap can tell she has never been tardy in her life. A boxy black Chinese rental is waiting for them outside. He slides gratefully back into air conditioning. Dr. Anunoby slides in after him, eyeing the linkwear.\n“So you’ve been communicating entirely by touch.”\n“Yes. Well, Morse code. Haven’t thought up anything better.”\n“May I?”\nAfter a moment’s hesitation, Ostap peels off his right glove and hands it over. She puts it on, flexing her fingers, and he guides her hand to Alyce’s shoulder. For a terrifying instant he thinks Dr. Anunoby won’t feel anything, that she’ll frown and gently confirm that he is losing his mind. But then her eyes widen slightly. Ostap pulls up a Morse code translator for her and watches in silence, his bare hand clenched tight on his thigh.\n“What are you saying?” he asks, when he fails to keep track of her pulses.\n“Asking a very specific question about how we met,” Dr. Anunoby says.\n“Just to be sure it’s not an elaborate hoax?”\nShe nods. “You don’t seem like the type for an elaborate hoax. But I need to ask. For my own peace of mind.”\nOstap watches out the window while he waits. They’re on the highway now, parallel to the Mombasa-Nairobi raised rail, driving in its shadow. Passenger pods flash like silverfish along the retrofitted magnetics. The soil is rust red and the trees are a lush dark green. When the car pulls off onto a smaller road, they have to drive through a scanner gate.\n“Thank you,” Dr. Anunoby says, returning the glove. “It’s incredible. It’s really incredible.”\nOstap puts the glove back on and gropes for Alyce’s hand, interweaves his fingers with hers. “So?” he asks. “How are we going to get her back?”\nDr. Anunoby purses her lips as the car glides to a halt. “There’s something I didn’t tell you. I couldn’t tell you until I was sure.”\nOstap’s stomach churns. The tiny knots are back, coiled tighter than ever, carouseling. “What?”\n“We’re starting to find bodies.” Dr. Anunoby pushes open the car door. “Come up the hill.”\nShe gets out and Ostap stumbles after her. The sun is too harsh for his flimsy airport shades; he squints his eyes behind them. The heat beats him around the head and shoulders as he follows her over gravel parking lot to a slope of red-brown earth. His knees are weak and watery, but he climbs it anyway. A breeze ruffles his hair and cools his sweaty forehead as they near the top.\nWhen they crest the hill, he sees the damage the drone photos didn’t do justice. The external hub of the Nguyen-Bohr lab, now charred rubble, is large enough on its own. But the facility extended for miles beneath the surface, and has now been sectioned out in huge swathes by some unseen surgical blade.\nFor a moment Ostap’s eyes rebel at the scope of the scene, the unnatural composition. It looks more like effects, like something he would render in his goggles, than anything real. He can see layers of packed dirt, concrete, wiring, all neatly sheared to the same exact proportions. The electrical fires were a sideshow. The real damage was done by something else. Or maybe by nothing at all.\nHe looks at the massive pit where the observation room once was. There’s an emergency crew down there, reflective jackets gleaming in the sunshine. He can see them loading something onto a stretcher.\n“The first one showed up just after you called me,” Dr. Anunoby says. “Bits of skeleton and muscle all mixed up with chunks of the floor. With metal and wiring. They scraped enough DNA to identify it as Dr. Simmons. Xu followed the same way about an hour ago. It’s like the . . . the Slip . . . is spitting them back out. But not intact.”\nOstap’s tongue is too dry to talk. He tries twice before he gets the first word out. “We can bring her back safe. Somehow.”\n“We’re ants,” Dr. Anunoby says. She nods her chin at the destruction. “We don’t understand how this happened. No other facility in the world has the tech to run the test again, not even CERN, and if they tried it might end up even worse. We made a mistake.”\nOstap sinks to his haunches, spreads one hand in the hot dust for balance. His vision constricts like black rubber. He dimly feels Dr. Anunoby crouching beside him, pushing a water bottle into his free hand. He feels Alyce give his arm a questioning squeeze. His breathing slowly returns to normal.\n“I can be the one to tell her,” Dr. Anunoby says, with a tremor in her voice. “If you want. It can be me. I think she already suspects.”\n“Then why would I get to talk to her again?” Ostap demands, anger going off in his chest like a flare. He surges to his feet, wobbling only once. “If it’s for nothing? If there’s nothing I can do?”\nFor the first time, the linkwear feels like a straitjacket. He wants to rip it away and hurl it off the hill. Alyce squeezes his wrist again, tighter now. She knows something is wrong.\nDr. Anunoby shakes her head. “I’ll wait down there,” she says, and starts back down the hill.\nOstap barely hears her. He paces a tight frantic circle. He beats his hands against the ground; stops, flinches, wonders if Alyce can feel it. He shouts no particular word and the wind strips it away. Finally he sinks down to his knees and goes still.\nAlyce’s finger presses against his chest. He repeats the letters aloud, wrestling each one out of his windpipe, and watches her message form in his goggles.\nNo way back\nHe waits for the question mark, but it doesn’t come. He runs his hands over the parts of her body he can reach, caressing her neck, her shoulders, her arms. He moves his finger to her palm.\nNo.\nShe pushes back, tap press press. He waits. Waits. The last letter forms and he chokes on a laugh.\nWell fuck.\nHe hugs her as tightly as he can, closing his eyes, imagining the brush of her hair in his face, her temple against his neck. She clings back. He realizes, with a sick feeling all through his body, that he can ask her now. It will be grand and symbolic and mean nothing, because she’s not coming back. Not alive. It will be a farce. She’ll say yes because there is nothing else to say at the end of the world.\nOstap tells her about the bodies. Alyce is still for a long time, long enough to put panic in Ostap’s throat. Then she has messages for her parents. For her friends. Observations for Dr. Anunoby and her colleagues. She etches them out with trembling fingers and Ostap transcribes them all. It’s slow. Painstaking. The tension is piano-wire taut, because Ostap knows each letter might be the last one. He knows she might be the next barely body to arrive. The question is building up in his mouth.\nThe messages trail off, and Ostap tries to imagine what she’s feeling but can’t. He has his overshirt draped over his head to shield him from the sun, but it’s cooling off now. The sky is slowly turning red for sunset. Dr. Anunoby is still waiting, like a statue, beside the car. She is an ant. Ostap is an ant. Alyce is a particularly good ant. So he supposes it wouldn’t have mattered anyway.\nShaking badly, he starts to write:\nMade history.\nHe waits.\nYes.\nHe writes again, heart thumping out of his chest. It’s slow, so slow. On each letter he thinks of a dozen other things he could turn it into.\nWe should\nShe squeezes him so tight he has to stop. He wonders, in a panic, if it’s happening. If she’s being ripped back out of the Slip. Then she finishes the sentence.\nMarry.\nThis is why he had one more chance to talk to her. For this one unsullied surge of happiness. He knows it won’t last. Can’t last. But it is, and she is, and they are. He has a hundred more things he wants to say, the things he hopes are true: that he loves her more than he’s ever loved anyone, that he would follow her into the Slip and be ghosts or corpses with her, that he was going to ask her on Nyali Beach under the moonlight. He writes:\nI do.\nAnd she writes:\nI do too.\nThen Ostap gets to his feet and presses one last word into her skin:\nDance?\nHe feels her chest pushed against his chest. Her left arm over his right shoulder. Her right hand clasped in his left hand. He can almost feel Alyce’s heartbeat against his own. They dance with no music, one, two, marca. Ostap is sure he would be stepping on her feet if her feet were there, but it doesn’t matter.\nThey glide around the top of the rust-red hill and around the soft blue observation room, in and out of the Slip, until the light is gone and he can’t feel any part of her.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "source": "https://clarkesworldmagazine.com/larson_04_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Carouseling by Rich Larson"}