{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ppJKlCX3T4YxSBQs+5YE5aRI4sA=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Byzantium, New York, and Rose Petals: A Conversation with Arkady Martine  Marrying history and a far-flung future results in a partnership unique to science fiction. It allows authors and readers alike to explore the past, present, and potential future all at once. Like the best science fiction, it allows us to examine where we’ve been and where we may still go as a society.  A Memory Called Empire is Arkady Martine’s debut novel that introduces us to the Teixcalaanli Empire. Ambassador Mahit Dzmare is the ambassador to the empire from a small mining station but is quickly embroiled in the murder mystery surrounding her predecessor’s death. What she discovers is larger than a simple homicide and involves a web of secrets and an ever-expanding empire.  Arkady Martine is a speculative fiction writer and, as Dr. AnnaLinden Weller, a historian of the Byzantine Empire and a city planner. She’s published numerous short stories in places like Lackington’s, Uncanny Magazine, Shimmer, and Fireside. A Memory Called Empire is her debut novel available from Tor Books.   What made you start writing speculative fiction?  I write speculative fiction unless I’m trying very hard not to—it’s my native mode of expression. I grew up reading it: my father had a vast collection of pulp paperbacks and slightly-less-pulp-but-extremely-1970s paperbacks from when he was a young man, and he left them around pointedly where I could find them. We used to call it our “science affliction” problem. Our tastes have diverged as I grew up, but in a sense I’m always writing for him. It was a deep pleasure to get to give him an early proof copy of A Memory Called Empire.  But really, the language of speculative fiction is my language: I like taking concepts and ideas—hard ones, complex ones, usually sociological but sometimes technological—and spinning them through futures or magic or otherwise worlds to center them. And far-future science fiction is my favorite place to interrogate large philosophical and ethical questions from sideways angles. To get close enough to a problem like—oh, assimilation and cultural imperialism—to let a reader cut themselves on the sharp edges, but not close enough to bleed out.  How has your knowledge of the Byzantine Empire impacted writing your novel?  Enormously and entirely. The book is in a lot of ways the fictional version of what I did a postdoctoral project on at Uppsala University in Sweden. My research there was about the contacts between Byzantium and the “eastern frontier,” particularly Armenia, during the eleventh century—and how those contacts were remembered, represented, and narrativized by the people who lived through them. The project was very much about borderlands as trauma spaces, about history and memory as narrative repairs to a wounded sense of the world. This book came out of that project, and a lot of previous research into the history of imperialism, its methods and horrors and seductions. I used a lot of Byzantine things in it: the poetry contests are in fact lifted directly from middle period Byzantine court culture, and the succession crisis driven by a general being acclaimed maybe-emperor by his soldiers is a repeated kind of succession crisis in the Byzantine Empire, and . . . oh, there’s a ton more. Teixcalaan is a universalizing empire. The words for world and empire are the same. That’s intensely Byzantine.  What was your inspiration for writing this novel?  Two things: a piece of terrible juvenilia I was writing in my twenties, which had a few good ideas in it, one of which was a protagonist haunted—literally—by the ghost of the last person who had her job . . . I loved the idea of that, of being haunted by the past. Possessed by it. The identities of the past bleeding into the present. (Sometimes I think I’m a horror writer at some deep heart-level).  The other thing is the story of the Catholicos of the Armenian Apostolic Church, Petros Getadarj. It goes like this: in the year 1044 AD, the Byzantine Empire annexed the small Armenian kingdom of Ani. The empire was able to do this for a lot of reasons—political, historical, military—but the precipitating incident involved Petros Getadarj, who was determined to prevent the forced conversion of the Armenians to the Byzantine form of Christianity. He did this by trading the physical sovereignty of Ani to the Byzantine emperor in exchange for promises of spiritual sovereignty. When I started writing A Memory Called Empire, my inciting question was: what’s it like to be that guy? To betray your culture’s freedom in order to save your culture?  And then I thought: oh. These two things go together perfectly. Because it’s much more interesting to write about the person who has to clean up after that guy.  You’ve mentioned CJ Cherryh as one of your influences. How has Cherryh impacted your writing?  I think it’s Cherryh who said that every sentence should do at least three jobs? I took that perhaps too seriously. But more truly, Cherryh showed me how to successfully write protagonists and stories where the real, deep, terrifying conflicts are internal to the protagonist’s mind. Her narrators—especially Bren Cameron in Foreigner and Ariane Emory II in Cyteen—are so unreliable and so simultaneously aware of their unreliability that they cannot trust themselves or their interpretations. It’s claustrophobic and amazing, and I was writing like that anyway, but Cherryh gave me the tools to do it in a way that was exciting and kept moving forward.  Also, well. Thematically, A Memory Called Empire is a pretty direct response to the Foreigner series. (I’d love to put Nineteen Adze and Ilisidi in a room. Someone write me the fanfic.) The sequel to Memory, which is titled A Desolation Called Peace, has a lot of direct response to Cyteen. Both of those books (well, the first six Foreigner novels, plus Cyteen) were utterly formative to me as a reader, as a person thinking about ethics, as a person who felt very isolated as a teenager and young adult.  I reread Cyteen every year or so, if that says anything.  Empires are generally a given in some science fiction stories, but in your novel, you take great care in examining the influence of imperialism throughout the universe. How did you go about crafting these fine details?  Essentially, I feel as if empire is something that is either taken for granted in space opera—un-interrogated, simply present as a fact of worldbuilding—or rendered so evil as to be incomprehensibly bad (What does the First Order in Star Wars, for example, actually do for any of its citizens?) and empire is nastier than both those options. It is a kind of poison that gets into the groundwater, and it can be very, very pretty while it strangles a culture.  I’m an assimilated American Jew, myself. My immediate history is of being a somewhat-tolerated member of an imperialist power, not of being from a culture which was colonized. But these questions: the questions of what if you find yourself loving what is poison to you, even though you know it is poison—I mean, I wrestle with this all the time. I like Wagner operas, for instance. I have paid a great deal of money to see a full Ring Cycle, and I’d do it again. And yet I know what Wagner believed about my people, and how interlaced those beliefs are into all of his work.  It’s not the same as being from a colonized culture, of course. But it’s where I first got caught on the idea. And then I studied an empire that believed so profoundly that it was the mirror of heaven, the extant known universe, the only place where the world was true and right, and I found that empire beautiful, and I wanted to know why it was so easy to be seduced.  And thus, when I was constructing Teixcalaan, I wrote myself an empire that would seduce me. Utterly, completely, every self-hating inch of the way. And then I tried to make sure that it was also a terrible, totalitarian, panopticon state with an ideology of conquest, because nothing empire touches stays clean.  Poetry is at the heart of your novel. Who is one poet who has most influenced you?  Poetry is actually terribly difficult for me. I get struck by fewer poems than I wish I did, but the ones that do hit me are like spears through the throat. But . . . Lorca, I think. Lorca has the most intense influence, imagery, and strangeness and passion and some of the phrases that have stuck with me longest. The lines “and mad with horizons / she mixes in her wine / the bitterness of Don Juan / and the perfection of Dionysus,” for example, which are from his poem “Seville.”  How did being from New York influence your creation of The City?  . . . well, I’m from the center of the world, the only real place in the universe.  What do you think? 😀  Your novel is brilliantly paced, raising the stakes consistently as the story unfolds. How much planning went into the plot?  Oh god, less than I’d like. I plot by fractal growth, not by anything so useful as outlines. It’s like—putting together a supersaturated solution of ideas and concepts, throwing in everything I can think of and that I need, and then there’s a moment where the solution suddenly crystalizes, and that’s the shape of the book—and then the crystals grow as crystals do, in appropriate habits, and fractally. I write in linear order. So far. (I expect I may change, for different projects.) This seems to be how I make events complicated enough to feel like real political intrigue.  Mahit Dzmare is a multilayered and fascinating character. What, or who, influenced your creation of her?  A little of my own longing for places I don’t have, cultures I can’t be part of. A lot more of trying to write my own take on the trope of the poet-diplomat amongst an alien culture. Her sense of humor came with the rest of her, with none of my intention but all of my appreciation. Her ability to just keep going because it is necessary I think came from my wife, Vivian Shaw, but I was writing Mahit long before I met Viv, so. Maybe I just like women who can always do what one must.  What is one piece of writing advice that really helped you with this novel?  Forget about marketability. The only way to get through putting this many words on paper, in order, is to write exactly what you want to write, even if that’s endless descriptions of architecture and clothes and food, poetry contests and hyper-internal political considerations.  I’ve been delightfully surprised that doing this apparently meant I wrote something a lot of other people love, too.  The Teixcalaan have very distinct names and you’ve mentioned that they were influenced by Mesoamerican cultures. Can you go into detail about how you crafted these names?  I actually got Tor to put up some of my rules about Teixcalaanli names, here: www.torforgeblog.com/2019/03/26/whats-in-a-teixcalaanli-name.  But essentially I was trying to echo the Mixtec naming system, but also very strongly link the Teixcalaanlitzlim with their environment and the natural world around them. They care a lot about it, culturally, and I wanted to show that intimacy in the name system.  What projects are you working on next?  Right now I’m finishing up the direct sequel to A Memory Called Empire, which is titled A Desolation Called Peace. Yes, I thoroughly stole the title from Tacitus. But it’s the best line. It’s Tacitus writing in the voice of Calgacus, about Roman imperialism. Rome makes a desert and calls it peace. And the words for “desert” and “desolation” are sort of the same. A desolate place. An emptiness. The book I’m writing is about incomprehensibility and impossible wars. A lot of it happens on a Teixcalaanli battleship. There’s interstellar mail fraud. And a kitten. (Technically, several kittens.) Also a maybe-genocide, some extremely unwise kissing, and the usual dose of political machination.  I’m also working on two other novel-length projects. One is a “science fantasy” cowritten with my wife Vivian, which contains, in no particular order, a post-nuclear-war desertscape, mass-concentration-inducing minerals, a dead city that talks, a political romance, a prefab imperial colony town, a steppe kingdom with a city on a mountainside, a possibly-alien or possibly-magic local king, and a geologist/mining engineer who ends up becoming a cartographer (amongst other things). The other is the novel I’m currently calling “the one about drought politics, the Santa Ana winds, and arson investigation,” because I’m terrible at titles if I don’t get to steal them from Tacitus. That one is my cities and climate change novel, and to my fascination and despair, it seems to be about Los Angeles. As a New Yorker, I find this a bit distressing. But that’s what I get for really thinking about how Raymond Chandler books work, and whether they could fruitfully be combined with Peake’s Gormenghast and Tana French’s Trespasser.  I’ve also got an essay collection possibly in the works, which is tentatively titled Everyone’s World Is Ending All the Time; and a bunch of short fiction which I’m looking forward to getting back to as soon as I finish drafting this novel! I’m especially excited about the one called “The Flowers of Heliogabalus,” which has a murder mystery in a desert mansion shaped like a gypsum rose, an AI who might as well be a haunted house itself, and a murder victim who definitely didn’t strangle on rose petals because the ones in her mouth are far too fresh as compared to the time of death.  . . . Told you I was secretly a horror writer. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nByzantium, New York, and Rose Petals: A Conversation with Arkady Martine\nMarrying history and a far-flung future results in a partnership unique to science fiction. It allows authors and readers alike to explore the past, present, and potential future all at once. Like the best science fiction, it allows us to examine where we’ve been and where we may still go as a society.\nA Memory Called Empire is Arkady Martine’s debut novel that introduces us to the Teixcalaanli Empire. Ambassador Mahit Dzmare is the ambassador to the empire from a small mining station but is quickly embroiled in the murder mystery surrounding her predecessor’s death. What she discovers is larger than a simple homicide and involves a web of secrets and an ever-expanding empire.\nArkady Martine is a speculative fiction writer and, as Dr. AnnaLinden Weller, a historian of the Byzantine Empire and a city planner. She’s published numerous short stories in places like Lackington’s, Uncanny Magazine, Shimmer, and Fireside. A Memory Called Empire is her debut novel available from Tor Books.\nWhat made you start writing speculative fiction?\nI write speculative fiction unless I’m trying very hard not to—it’s my native mode of expression. I grew up reading it: my father had a vast collection of pulp paperbacks and slightly-less-pulp-but-extremely-1970s paperbacks from when he was a young man, and he left them around pointedly where I could find them. We used to call it our “science affliction” problem. Our tastes have diverged as I grew up, but in a sense I’m always writing for him. It was a deep pleasure to get to give him an early proof copy of A Memory Called Empire.\nBut really, the language of speculative fiction is my language: I like taking concepts and ideas—hard ones, complex ones, usually sociological but sometimes technological—and spinning them through futures or magic or otherwise worlds to center them. And far-future science fiction is my favorite place to interrogate large philosophical and ethical questions from sideways angles. To get close enough to a problem like—oh, assimilation and cultural imperialism—to let a reader cut themselves on the sharp edges, but not close enough to bleed out.\nHow has your knowledge of the Byzantine Empire impacted writing your novel?\nEnormously and entirely. The book is in a lot of ways the fictional version of what I did a postdoctoral project on at Uppsala University in Sweden. My research there was about the contacts between Byzantium and the “eastern frontier,” particularly Armenia, during the eleventh century—and how those contacts were remembered, represented, and narrativized by the people who lived through them. The project was very much about borderlands as trauma spaces, about history and memory as narrative repairs to a wounded sense of the world. This book came out of that project, and a lot of previous research into the history of imperialism, its methods and horrors and seductions. I used a lot of Byzantine things in it: the poetry contests are in fact lifted directly from middle period Byzantine court culture, and the succession crisis driven by a general being acclaimed maybe-emperor by his soldiers is a repeated kind of succession crisis in the Byzantine Empire, and . . . oh, there’s a ton more. Teixcalaan is a universalizing empire. The words for world and empire are the same. That’s intensely Byzantine.\nWhat was your inspiration for writing this novel?\nTwo things: a piece of terrible juvenilia I was writing in my twenties, which had a few good ideas in it, one of which was a protagonist haunted—literally—by the ghost of the last person who had her job . . . I loved the idea of that, of being haunted by the past. Possessed by it. The identities of the past bleeding into the present. (Sometimes I think I’m a horror writer at some deep heart-level).\nThe other thing is the story of the Catholicos of the Armenian Apostolic Church, Petros Getadarj. It goes like this: in the year 1044 AD, the Byzantine Empire annexed the small Armenian kingdom of Ani. The empire was able to do this for a lot of reasons—political, historical, military—but the precipitating incident involved Petros Getadarj, who was determined to prevent the forced conversion of the Armenians to the Byzantine form of Christianity. He did this by trading the physical sovereignty of Ani to the Byzantine emperor in exchange for promises of spiritual sovereignty. When I started writing A Memory Called Empire, my inciting question was: what’s it like to be that guy? To betray your culture’s freedom in order to save your culture?\nAnd then I thought: oh. These two things go together perfectly. Because it’s much more interesting to write about the person who has to clean up after that guy.\nYou’ve mentioned CJ Cherryh as one of your influences. How has Cherryh impacted your writing?\nI think it’s Cherryh who said that every sentence should do at least three jobs? I took that perhaps too seriously. But more truly, Cherryh showed me how to successfully write protagonists and stories where the real, deep, terrifying conflicts are internal to the protagonist’s mind. Her narrators—especially Bren Cameron in Foreigner and Ariane Emory II in Cyteen—are so unreliable and so simultaneously aware of their unreliability that they cannot trust themselves or their interpretations. It’s claustrophobic and amazing, and I was writing like that anyway, but Cherryh gave me the tools to do it in a way that was exciting and kept moving forward.\nAlso, well. Thematically, A Memory Called Empire is a pretty direct response to the Foreigner series. (I’d love to put Nineteen Adze and Ilisidi in a room. Someone write me the fanfic.) The sequel to Memory, which is titled A Desolation Called Peace, has a lot of direct response to Cyteen. Both of those books (well, the first six Foreigner novels, plus Cyteen) were utterly formative to me as a reader, as a person thinking about ethics, as a person who felt very isolated as a teenager and young adult.\nI reread Cyteen every year or so, if that says anything.\nEmpires are generally a given in some science fiction stories, but in your novel, you take great care in examining the influence of imperialism throughout the universe. How did you go about crafting these fine details?\nEssentially, I feel as if empire is something that is either taken for granted in space opera—un-interrogated, simply present as a fact of worldbuilding—or rendered so evil as to be incomprehensibly bad (What does the First Order in Star Wars, for example, actually do for any of its citizens?) and empire is nastier than both those options. It is a kind of poison that gets into the groundwater, and it can be very, very pretty while it strangles a culture.\nI’m an assimilated American Jew, myself. My immediate history is of being a somewhat-tolerated member of an imperialist power, not of being from a culture which was colonized. But these questions: the questions of what if you find yourself loving what is poison to you, even though you know it is poison—I mean, I wrestle with this all the time. I like Wagner operas, for instance. I have paid a great deal of money to see a full Ring Cycle, and I’d do it again. And yet I know what Wagner believed about my people, and how interlaced those beliefs are into all of his work.\nIt’s not the same as being from a colonized culture, of course. But it’s where I first got caught on the idea. And then I studied an empire that believed so profoundly that it was the mirror of heaven, the extant known universe, the only place where the world was true and right, and I found that empire beautiful, and I wanted to know why it was so easy to be seduced.\nAnd thus, when I was constructing Teixcalaan, I wrote myself an empire that would seduce me. Utterly, completely, every self-hating inch of the way. And then I tried to make sure that it was also a terrible, totalitarian, panopticon state with an ideology of conquest, because nothing empire touches stays clean.\nPoetry is at the heart of your novel. Who is one poet who has most influenced you?\nPoetry is actually terribly difficult for me. I get struck by fewer poems than I wish I did, but the ones that do hit me are like spears through the throat. But . . . Lorca, I think. Lorca has the most intense influence, imagery, and strangeness and passion and some of the phrases that have stuck with me longest. The lines “and mad with horizons / she mixes in her wine / the bitterness of Don Juan / and the perfection of Dionysus,” for example, which are from his poem “Seville.”\nHow did being from New York influence your creation of The City?\n. . . well, I’m from the center of the world, the only real place in the universe.\nWhat do you think? 😀\nYour novel is brilliantly paced, raising the stakes consistently as the story unfolds. How much planning went into the plot?\nOh god, less than I’d like. I plot by fractal growth, not by anything so useful as outlines. It’s like—putting together a supersaturated solution of ideas and concepts, throwing in everything I can think of and that I need, and then there’s a moment where the solution suddenly crystalizes, and that’s the shape of the book—and then the crystals grow as crystals do, in appropriate habits, and fractally. I write in linear order. So far. (I expect I may change, for different projects.) This seems to be how I make events complicated enough to feel like real political intrigue.\nMahit Dzmare is a multilayered and fascinating character. What, or who, influenced your creation of her?\nA little of my own longing for places I don’t have, cultures I can’t be part of. A lot more of trying to write my own take on the trope of the poet-diplomat amongst an alien culture. Her sense of humor came with the rest of her, with none of my intention but all of my appreciation. Her ability to just keep going because it is necessary I think came from my wife, Vivian Shaw, but I was writing Mahit long before I met Viv, so. Maybe I just like women who can always do what one must.\nWhat is one piece of writing advice that really helped you with this novel?\nForget about marketability. The only way to get through putting this many words on paper, in order, is to write exactly what you want to write, even if that’s endless descriptions of architecture and clothes and food, poetry contests and hyper-internal political considerations.\nI’ve been delightfully surprised that doing this apparently meant I wrote something a lot of other people love, too.\nThe Teixcalaan have very distinct names and you’ve mentioned that they were influenced by Mesoamerican cultures. Can you go into detail about how you crafted these names?\nI actually got Tor to put up some of my rules about Teixcalaanli names, here: www.torforgeblog.com/2019/03/26/whats-in-a-teixcalaanli-name.\nBut essentially I was trying to echo the Mixtec naming system, but also very strongly link the Teixcalaanlitzlim with their environment and the natural world around them. They care a lot about it, culturally, and I wanted to show that intimacy in the name system.\nWhat projects are you working on next?\nRight now I’m finishing up the direct sequel to A Memory Called Empire, which is titled A Desolation Called Peace. Yes, I thoroughly stole the title from Tacitus. But it’s the best line. It’s Tacitus writing in the voice of Calgacus, about Roman imperialism. Rome makes a desert and calls it peace. And the words for “desert” and “desolation” are sort of the same. A desolate place. An emptiness. The book I’m writing is about incomprehensibility and impossible wars. A lot of it happens on a Teixcalaanli battleship. There’s interstellar mail fraud. And a kitten. (Technically, several kittens.) Also a maybe-genocide, some extremely unwise kissing, and the usual dose of political machination.\nI’m also working on two other novel-length projects. One is a “science fantasy” cowritten with my wife Vivian, which contains, in no particular order, a post-nuclear-war desertscape, mass-concentration-inducing minerals, a dead city that talks, a political romance, a prefab imperial colony town, a steppe kingdom with a city on a mountainside, a possibly-alien or possibly-magic local king, and a geologist/mining engineer who ends up becoming a cartographer (amongst other things). The other is the novel I’m currently calling “the one about drought politics, the Santa Ana winds, and arson investigation,” because I’m terrible at titles if I don’t get to steal them from Tacitus. That one is my cities and climate change novel, and to my fascination and despair, it seems to be about Los Angeles. As a New Yorker, I find this a bit distressing. But that’s what I get for really thinking about how Raymond Chandler books work, and whether they could fruitfully be combined with Peake’s Gormenghast and Tana French’s Trespasser.\nI’ve also got an essay collection possibly in the works, which is tentatively titled Everyone’s World Is Ending All the Time; and a bunch of short fiction which I’m looking forward to getting back to as soon as I finish drafting this novel! I’m especially excited about the one called “The Flowers of Heliogabalus,” which has a murder mystery in a desert mansion shaped like a gypsum rose, an AI who might as well be a haunted house itself, and a murder victim who definitely didn’t strangle on rose petals because the ones in her mouth are far too fresh as compared to the time of death.\n. . . Told you I was secretly a horror writer.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/martine_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Byzantium, New York, and Rose Petals: A Conversation with Arkady Martine by Chris Urie"}