{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tamsyn Muir", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6aIVUd5RpDJLVv4Lvg/kzAzOD2w=", "id": null, "license": null, "comments": "", "raw_text": "5510 words, short story  Union  The wives come strapped ten to a transport, hands stamped by some Customs wonk. Their fingernails are frilled and raised freckles stipple each arm in shades of red and orange. Permit tags list their names: Mary. Moana. Ruth. Myrrh. Huia. Anna. Iridium. Coffee. Kōkako.  The Franckton crofters stand and watch from behind the barrier. They’ve knocked off midday work to come. You can practically see the pong of hot mulch and melting boot elastomeric coming off them. There’s even a man there from the New Awhitu Listener to take pictures.  Dripping sweat, the Customs detail sign off their quarantine. The wives seem indifferent to the heat. The air from the transport ruffles the thin plaits of their hair, each strand with its own line of fine bulges like a polyp. Everyone is close enough to see.  “If the Listener links any of those photos,” Simeon’s telling the photographer, “you’re dog tucker, mate.” Simeon’s got the gist of it already. The man knows Simeon’s reputation and is timidly pressing Delete.  The Mayor signs the receipt of goods slowly. She’s asking questions, gesturing at the wives, but she’s not getting answers, just filework and shrugging. The Ministry men take the tablet with the signature and you can tell they just want to get the hell out of there before something happens.  Later on when the croft pores over the paperwork, they discover the wives are lichen splices. No one’s ever heard of it.  When the news had broken that the Ministry was awarding them wives, the relief was so great in Franckton that it was more pain than pleasure. They’d spent the last fifty years incubating on Governmental loan and mortgaging over half the harvest each time. A lot of beers got sunk during all the frantic budgeting that came subsequently. The staunchest Union crofters forgot to do anything but tab up how many generations it would take before all they’d be paying for was the foetal scan.  Only Simeon was hostile; nobody was surprised. “It’s a disgrace,” he kept on saying. “It’s a nothing. We’re getting gypped. We’re the highest-revenue croft and they’re shutting us up, they’re paying us off, the next time we don’t say how high when they say jump we’ll get our subsidy slashed and you bastards are falling over yourselves to lick their arse . . . ”  He got told off by the Mayor for whinging. The sentiment was that there were only twenty wives to go round and he’d been assigned one and heaps of crofters hadn’t. It wasn’t as though they were all going to receive rose-splice wives and free beer and skittles. Of course it was a sop. It was a harvest cycle, and the Ministry wanted to keep them sweet so that there wouldn’t be a tanty chucked over the price of wheat or onions or oats come the buying time. All of Franckton was going into this with their eyes open; they weren’t naive . . . But they still planned a picnic and a pōhiri and someone agreed to sing for the welcome and everyone getting a wife washed their shirt.  When the wives finally landed and they got their first eyeful, they knew there wasn’t going to be a picnic or a pōhiri. They took up their tines and trudged back to the bunds without preamble. Only Simeon, by way of expressing his feelings, threw a big handful of grit at one of the whirring transports. It exploded into a cloud of dusty shrapnel. Some of the crofters cringed, but nothing happened.  The lichen-splice wives are pale and dry. Nobody really knows what to do with them. The last batch of kids had been nine years ago, with a bunch of hardy poppy wives and their minders. They were all hard cases and laughed and made jokes during the incubation, like poppy-wives should. The Mayor was getting treated for germline trouble with her chromosomes 5 and 10, so the Ministry had made them pay through the nose for gene insurance and they’d all been sore about it, but not too sore because it was the Mayor and the croft begrudged her nothing. Simeon had squabbled and said there should be a lawsuit. Some of the crofters agreed, but then there were children to take care of and nobody did anything.  The first thing the crofters hate is the names. Their wives have been given croft names, and that’s insult to injury, somehow. It’s ingratiating. They should have had city names and all been Florence or Hannah or Candy. So they all become “wife” by common fiat.  They seem obliging enough, but they never speak, except sometimes “Yes” or “No.” They move slowly in the Franckton heat, but unmindingly. They are slow in general to walk or to carry. They lid their eyes heavily when they talk and keep their mouths a little open, sometimes flickering their tongues.  Simeon holds forth in the pub almost every night about them. Most of the croft complaints are about how their wife stares or can’t cook the tea right or is stupid, or off-putting, or intractable, but Simeon goes further than that. “I don’t want to incubate with some knock-off government sack,” he says of his wife. “She looks like a spastic. She looks like a trisomy hutch.”  Some of the croft look away but they don’t protest, because you don’t with Simeon, it’s more trouble than it’s worth. Simeon says, “I bloody well mean it. And I tell you what, if they don’t bear good kids and look after them right, I’m blowing this wide open. I’ll strike. I want our next lot to have a future, not go on cringing like mutts for crusts. If all the crofts got up off their bums and stood together we’d have the world on a plate. Look at what we get when we don’t fight for it! Christ, look.”  Outside the pub and across the street two of the wives stand in the blue evening shade. Simeon stabs a finger in their direction. They do not chat or relax: they stare, first at each other, then at a crack in the daub house, then at a drying clag of mulch, then at each other again. Their tongues flicker in their mouths.  “I tell you what,” Simeon says again, “they scare me to death. They’re not right. We got fobbed off with something weird, and we’re just shutting up and taking it like we always do.”  One of the crofters has the bright idea to tell Simeon that he should have let the photographs go live, that everyone should have seen what had been done to Franckton. This crofter gets pranged with the beer mat.  “Don’t be stupid,” snaps Simeon, settling back. “We’ve got our bloody pride.”  Franckton has better results with the wives in the fields. The sun leaves white patches on their skin if they stay out too long in it, but the Mayor gets the children to weave them big scratchy shapeless hats. The wives have been taught to say, “Thank you, Aunty,” and for each hat a wife intones “Thank you, Aunty,” before subsiding back into silence. They’re still slow out there on the bunds, but they are just as slow heaving the stones between them as they are walking as they are everything else. It is simply how they move. They crouch down and poke back rocks into the spillways with their square, dry hands. They build back the gullies and do not care. When the children come around with the water they take one gourd together and sip miniature sips, darting their tongues inside the neck of the bottle. The other crofters take enormous gulps and dump the rest down the backs of their hot, dirty necks.  It gets to some of the croft. Nobody dares to be as bad as Simeon, who calls his wife “you” and who swaps sharp words with the Mayor about it almost daily, but there’s loads of complaint. The wives don’t learn. They don’t settle. They’re lazy. They make everyone uneasy. Plenty of splice wives are good for doing chores and croft work—so the catalogues always promise—and do it cheerfully and well, but these ones don’t, and it’s yet another black eye for them.  When Laura says in the pub, “I like my wife,” everyone’s surprised into silence before they bust a gut laughing. “Piss off! I don’t mind her. I wouldn’t want one that was talking my ear off all the time. And she sings sometimes . . . She’s not so bad.”  She gets ragged for this daily, but sticks to it: “Mary’s a good girl,” she goes on saying staunchly. “She gives it heaps, just doesn’t rush. Can’t believe you’re all moaning about how they don’t have tea on the table when the clock strikes six. My God! You lot don’t know you’re born.”  Those with wives start noticing that, wherever they go, a fine leafy build-up appears on the walls or countertops where they work. This is easily wiped off with a damp cloth, but causes no end of alarm. The build-up is a thin crust—a substrate with miniature flakes—dusty green in some houses, shrillingly orange in others. Simeon spits the dummy entirely and makes his wife sleep in the shed, and at this point nobody blames him, he’s sent a sample to the big lab in Awhitu and it matches the wives’ DNA. Like they’re shedding, the pharmacist had said helpfully. “Like they’re moldy,” said Simeon. “Bloody hell. It’s not clean. It’s filthy. It’s not right. They oughtn’t to, it’s a decay, they’re off-cut bargain-bin splices—” And he calls them a lot worse than off-cuts or bargain bin splices.  He sends a letter to the Ministry representative, a formal one, with a couple veiled threats chucked in. Other crofters are angry too, and they sign it. The Mayor won’t.  “It’s harmless,” she says wearily, “it’s a nothing. Just rub a bit of ti-tree extract on the counter, the pharmacy let me have it for cheap. And if you’re making Coffee sleep in the shed you better not whinge about her cooking.”  But Simeon won’t let his wife do any cooking now. She shouldn’t touch food, he says. Shouldn’t touch anything they’re not sure about. As per usual, some of the croft privately agrees, but also wishes he’d stop being a bit of a tosser.  The doctor comes to give the crofters their health certificates and the Mayor her latest injections. They can’t apply for the DNA license otherwise. He frowns over the Mayor’s scans—again—and gives her some chromosome duplicant on the sly, in exchange for a feed and some cash. “I’m sorry, Barbs,” he says. “You’ll be paying the premium again for the license.”  “But I’m not contributing,” she says, surprised. “Not after the last time. Didn’t we put that down on the form?”  “Doesn’t matter; still shows up on your insurance record, I’m afraid. It’s a generational issue. It’s not just your license, it’s all of Franckton’s.”  “That is daylight robbery,” says the Mayor, “not a deterrent.”  “It’s a damned shame is what it is,” says the doctor, “but there’s nothing you or I could’ve done about it. At least you’re not renting the cow to get the milk this time, eh?”  It’s true. They’re not coughing up for wife costs. Simeon still writes savage letters to the croft’s Parliamentary manager but now they’re getting answered by auto-message. They’ve got to take out a loan against the harvest, which stings, and nobody lets the Mayor put her personal savings in to help, but there’s softer words about the wives when the croft thinks about all the money they’re saving. Fewer people laugh at Laura. There’s enough to pay for a couple of multiples in kids. The last generation born of the whānau is old enough to babysit, but now there’s the wives to do the care, so they can stay at school instead. Not one crofter has got to stay at school past the age of twelve before. An out-of-towner can’t visit Franckton now without getting buttonholed and skited to for half an hour about their good fortune. They book the extraction and the foetal care unit for Christmas.  The weather gets hotter and hotter. The wives are in trouble.  A pruinose bloom settles on the northern oats bund. A feathery patina is discovered on the uppermost parts of the stalk—none on the roots—and it can be wiped off in much the same way as the house crust. The wives stand around dispassionately, hands stuck in their aprons, just watching. The croft explodes in tight-lipped fury. They call a meeting at the public house before the heat of the morning’s even in ripeness and everyone’s there but the children and wives.  “Here is what we know,” says the Mayor. “The growth isn’t parasitic. The crop isn’t spoiling—yet. We’ve probably caught this in time. We’ll take the girls off bund duty and go on from there.”  “That’s not what I know,” says Simeon.  He slams his mattock down on the table, in full flight. “Here’s what I know,” he says. “I know that we paid twenty thousand for seed DNA that wouldn’t get heat rot or spore. I know that we’ve been bled dry in licenses and mito checkers and quarantines and chromosome therapies, and that’s been long as I live, and I know that we’re bloody indentured slaves—” (“Too right,” says somebody) “—and that these wives, they looked nice on paper but they’re sabotage, they’re Ministry sabotage, trying to keep us down. Stop the crofts growing out of control. We’ve mortgaged those bloody oats and if they bloody spoil then we’re dead bloody meat.”  He says this very fast. The Mayor says, “Simeon—”  “We should ship them back now and to hell with the incubation, show them we don’t take hand-outs, eh,” he says, voice rising. “We don’t take hand-outs! We don’t take pay-offs, we don’t get tricked!”  A brief pause chills the air. “You’re paranoid, mate,” says Laura, and a mad hubbub breaks out.  There’s lots of noise. The crofters all shout to be heard. If Parliament wants the croft to stay small, why give them incubation rights? Well, it’s a con, isn’t it. Remember the story about the old horse. The gift horse, the Greeks. Why would the other crofts stand with them? The other crofts look out for themselves. Simeon’s going to get everyone arrested. Laura’s got her head in the sand. Simeon’s right. Everyone’s a coward. They should send back the wives. They shouldn’t send back the wives. They should have sent back the wives long ago. “If those oats fail I’ll send them back in a box,” bellows Simeon.  The Mayor whacks one big, hard hand down on the table. Everything on it rattles percussively.  “Shut up!” she roars. “Shut up, all of you!”  “You act like serfs, you get treated like serfs!” Simeon’s still ranting. “You all go along with it, you all let it happen!”  The Mayor yanks off her shoe, and she throws it square at Simeon. It clips him lightly on the shoulder. He turns very red. The quiet that ensues is greasy and awful. The breath of each crofter comes slight and small, so as not to make too much of a noise.  “I won’t have such talk,” says the Mayor slowly. “You besmirch us. You take away from the whole croft. You do us damage.”  The silence squirms like a child. The croft becomes aware that the wives have gathered in the doorway. They stand there with dull, slabby faces and their floppy hats in their hands. Only their tongues seem awake, spasmodically flicking behind their teeth, pattering against the inside of each cheek.  One of the wives says, “We’re sorry, Aunty,” and the rest follow in a monotone chant, “We’re sorry, Aunty,” all slightly out of time. Simeon’s wife says it last.  “I’m bloody out,” says Simeon, and he shoulders past them, stumbling. The door of the public house rattles on the doorframe when he slams it.  “Do you know what you’re sorry for?” says the Mayor, addressing the wives now. The wives do not speak. Some of them look at her, or out of the window, or at the floor, or at a fixed point nowhere in particular. Not a one blinks. The wheezing air conditioner ruffles the thin whippy polyps of their braids. The Mayor repeats, sternly: “There’s no use in being sorry for no reason. Wives are meant to help, not to cause trouble. There’s mold all over the oats. Do you know how to stop it?”  There is a long silence. One of the wives ventures, “It is very dry,” and the other wives pick up on this non-sequitur eagerly, blandly repeating: “It is very dry,” and one wife, Laura’s, says: “Getting drier.”  An impatient sigh rises from the crowd.  “Stay out of the fields,” says the Mayor. “You can go out and take over the goats from the children. They can spend their afternoon in the classroom instead. No going near the crops. Is that clear?”  By the blank expressions, it is not. But when the Mayor repeats, “Stay out the fields for now. Understand?” it’s greeted with a chorus of yes, Aunty. Then they file out of the building and stand around in the shade in an awkward gaggle. Some of them stare through the window. The crofters think it’s no use.  The wives are right about one thing: it’s dry and getting drier, and the dry season hasn’t even started. There’s no rainfall and no sign of one to come. The water levels in the Franckton tanks dip lower and lower.  It takes a few days, but the croft manages to wipe the crust off the oat spikelets without too much difficulty. Some of it succumbs, gets blotchy or the stem thickens and blights beyond repair—and the lack of rain’s not helping—but after a few days of holding their breaths they start to exhale. No further bloom forms. The kids all have a moan about extra school.  The wives drift around and keep watch over Franckton’s goats. There are only so many goats, and really most of the goats spend their time hiding in the goat ark away from the sun. The wives cluster in the shade and listlessly fold laundry, or don’t pretend to do anything at all but stare at the dust and the sky and the goat ark. They are unperturbed by the stifling heat and the grit whipping up everyone else’s sleeves.  They’ll harvest the standing grain the moment it’s ready. There’s no worry that it won’t be dry. The onions will come later. It’s another cost to get the silos and augers cleaned and tested, but when the results come in clean the croft wipes the sweat off their brow and gets the grain in. Everyone’s busy driving the trucks over from the depot, or checking up on the old harvester, talking about the price of phosphines, and nobody has time to worry about the goats or the wives.  Nobody even notices the goat’s sick. It just keels over one day. They find it with three of the wives clustered around, three matching expressions of pallid bemusement.  There is a fine crumbly crust all over the dead goat’s head. Wispy filaments are clustered thickly around its ears and damp, flared nostrils, protruding in bunches that deform the skin from beneath. Tiny sprigs sprout from each cornea of the bubbly blind eyes. The mouth’s full. Most of the growths are around the skull, though there are raised, crinkly plates of lichen painting the moist belly and anus.  All the croft gets out of the bunds without even scraping their boots. The only ones not in the public house are the vet and the vet assistant, checking and testing the rest of the stock. Everyone sits around, hats squeezed tight between their knees, hands quietly wrung together.  “I’ll do it,” says Simeon haggardly.  None of the croft answer. He says, “First crop, now stock. We’ve lost thousands if that herd’s gone. I always said we paid too much to get them in utero, but they’re good uncloned milch goats.” Everyone remains silent. “And it’s not just money. There’s us to think about as well—us and the young ones.”  When nobody says a word, not a word, he shouts: “You bastards. Pull finger already. Don’t make me make all the decisions when you’re just as scared as I am.”  The Mayor sets down the grainy photos of the dead goat and says, “Don’t tell us what we already know, Simeon. Make a proposal.”  “Single shot to the back of the head,” says Simeon.  Laura rises with red clutched fists, spluttering, but the crofters around her yank her down into her seat. The Mayor says, “We could send them back—”  “How long will that take? It’s days and days for the ambo to get through. They needed to be out of here yesterday. ”  Someone else suggests turning them loose, taking them out of the boundary and into the dusts, and the Mayor says shortly, “I wouldn’t turn a dog loose into that,” and Simeon says, “What if they got to another croft, for Chrissakes? Don’t pass the buck. It’s our problem. It’s not our fault but it’s our bloody problem.”  Laura barks, “You can’t be serious.”  “Deadly. You come up with a better plan, then. Go on.” When another crofter says that they’ll get arrested for this, they’ll get the officers in, Simeon laughs mirthlessly. “That’s what you’re bleating about? The plod getting us for property damage? The Ministry signed them over to us. If it’s the inquest you’re worried about, by God, just let me take the rap. I’ve been wanting my day in court for years. None of the rest of you will get blood on your hands, I’ll put them down. I’m not watching our stock die and our kids get sick and us bled dry for doctor bills—God, I could kill them all!” he ejaculates. “It’s what they wanted all along, they sent us toxic waste!”  He takes off his hat and he scrunches it between his hands. “I’ll do it,” he says. “And I’ll cop it when the Ministry comes.”  The Mayor says in a voice like grit, “I will call a vote. A show of hands, please, for those in favor.”  A couple of hands shoot up, immediate and grim. Simeon’s nodding. Others rise more slowly. The clock ticks the minutes. The final few are unwilling, like a held breath let out. The Mayor’s hand is among these stragglers. Laura’s the only one who doesn’t have her hand up in all the croft, and nobody meets her eye.  She’s crying out: “You arsehole, Simeon. You always hated them, admit it.” But Simeon’s already putting his hat on his head and heading out the door. Nobody rises to go with him. Nobody shifts from their seat.  They can see it from the window: the wives gathering up behind Simeon when he beckons, collecting them from the shady decks and from the field. They all troop together down the street, the wives placid, their tongues flickering in their mouths, some of them looking through the window back at the silent crofters with their thin eyelids half-down over their dusty eyes. Simeon disappears into his shed and reappears with his shotgun and the wives bob after him, one by one, down to the old abattoir.  At the first crack of gunshot the Mayor sits down at the table and covers her eyes, and she makes a low, guttural sound in the back of her throat. They count one, two, three. A flinching pause between each. At the twentieth it stops. Everyone waits for no reason at all in the silence that follows, a fidgeting, shuffling, throat-clearing quiet.  When she can apparently bear it no longer, the Mayor snaps, “You all go get your tools and dig a pit past the boundary. Tell the vet to burn the goat.” One of the croft asks about the kids. “Say to the children we sent them away. Enough of this, already!”  They wrap the wives in bits of old sacking and put them in a shallow pit past the croft boundary, and they cover them up in sand and gravel and spray the bed with fluorescent paint to mark where they’re laid. They burn the goat and keep the others under watch. They work until past the time when the light has all gone, fixing the bunds, taking the temperature in the silo, steaming the winnower in preparation to take it back to the depot. Those who had wives go home to empty houses and Laura doesn’t go at all, just cracks open tinnies in the public house and curses anyone who comes near her. Simeon doesn’t go home either but hoses out the abattoir.  “Thank God that’s over,” he repeats, cold and bluff, to anyone on the street he can collar, which isn’t many. “Bring on Christmas. That’s what I say.” He sits on his deck and cleans his gun by sickly solar light, and every so often says “Bring it on,” quietly, still somehow audible through closed croft doors and shuttered croft windows, the croft lying awake in their beds.  The onion harvest demands all Franckton’s attention. The weather station promises a lot of rain in a month’s time and that means hurry, to hoe down the stalks and get the crop ready for dry-curing. After that will be soil prep and nitrogen checkers and sifting and seed negotiation and prices. There’s too much to do. There’s twenty fewer pairs of hands to do it with. Christmas bears down on them, inevitable and hot, like a sunburn.  The rain starts off Friday as a percussive clap of thunder. The clouds gather in fat, hot, bluish puffs above the croft, and then they open up and the rain roars out. The onions get hauled off in haste to the gas room. The kids are chivvied, screaming, off to the fields to pick up abandoned clippers and pins, jandals slapping noisily on the macadam. The racks groan under the weight of stacked vegetables, frantically checked over for lichen must. One rack shows neck rot but that’s par for the course, to be honest, no matter how much they pay for fungal-resistant seed strains or official pesticides it’s never a done deal. Simeon says it just goes to show they had a near miss and everyone pretends they haven’t heard him.  The whole croft’s stuck inside, gloomily playing at cards or smoking. Friday, Saturday, Sunday, Monday, the rain comes down. The sealed road is steamy, liquidy. The warehouse is a blast furnace of dry onion air. The kids all cavil at the rain and the goats get put in the big shed when the ark proves to have a leak. The spraypainted place where the wives were bundled blurs into a watermark.  The thunder comes back and rolls around the plain up and down, booming and growling, startling everyone just when they think it’s gone away. There’s a lot of joyless boozing in the public house. Nobody has anything to talk about after they’ve used up the topics of the harvest, the rain. All the water sinks into the dust.  A few days before Christmas the croft wakes up and their wives are back. All over Franckton, the watery sunrise limns wives cooking breakfast, wives sitting patiently in chairs, wives making mash for the goats, wives standing in the corners with their tongues flickering in their mouths and their eyes looking nowhere. Laura doesn’t even notice her wife in her kitchen or the egg-frying smells until the plate is put in front of her on the table, and then she screams out loud.  The goats butt from behind the door in the big shed, bawling to be let out. The wives seem distantly astonished by all the fuss: crofters slamming open the peeling dust-screen doors, shouting, hauling on daggy bedrobes and slippers. Inside, Laura reaches out with a jittering hand to push aside the muddy polyppy strands behind her wife’s ear: sees the healing weal, powdery, an angry-looking half-closed hole, the dull sheen of a bullet inside the skull being slowly pushed out. Her wife jerks her head away a little, like she’s ticklish. Other than the weal she is a nice yellow-green color all over, her freckles a brilliant carmine, her nails as rippled as a riverbed.  The Mayor is panting down the street in her pajamas, an old mackintosh wrapped around her shoulders. She is calling for help.  In Simeon’s house, the door has been wrenched from its hinges. There is a fearful amount of broken crockery in the sink. Chairs have been pushed over. Next to the kitchen table lies Simeon, legs and arms akimbo. They can only tell it’s Simeon by the clothes, because his skull is a stoved-in mash, fuzzy with the must, sprouting and foliose at the mouth and eye-sockets. Spongy lobes of plant matter rim out down his neck. Gouts of bloody lichen have detonated out his chest, nestled down between brackets of white cracked rib. Long fronds radiate outwards from holes at the stomach: wet with blood, wet with matter, spiraling upwards, drying. He seems titanic in death, enormous and monstrous, half-person, half-explosion.  There are footprints everywhere in the dust, heaps of them. When they go to check on the shed out back there’s Simeon’s wife, sitting peacefully on her cot. She stares implacably past them, only occasionally reaching up to fret at the hole behind her ear. She yawns with a wet mouth and bright green teeth. When they ask her questions, she gives them a vague smile.  Laura finishes retching behind the goat ark and rejoins the croft, meeting for what feels like the umpteenth time in the pub. All the croft looks old all of a sudden. The Mayor’s mackintosh hangs off one shoulder as she sits in a groaning chair.  “Well,” she says, and seems unable to say anything but, “Well.”  “Well, what?” demands Laura. “What the hell are we going to tell the Ministry?”  The whole croft mulls this one over. They’ll have to register Simeon’s death. There ought to be someone who comes for the remains, but most of the time nobody does, that’s a fact. One of the crofters says that anyway it’s three days until Christmas, and nobody will come out to them before the new Ministry calendar year. And someone else says what about the extraction and care team.  “That’s not what I bloody meant,” says Laura, “what do we do?”  Franckton’s already paid for the foetal care team and all the licensing. They won’t notice the damage to the wives, will they? Probably not. They only look munted if you get up close, check them out carefully. Nothing a bath won’t fix, either. They’ve paid for everything. There’s the harvest to think about. The Ministry’s more trouble than it’s worth to talk to. This whole thing’s been a muck-up from start to finish.  “They’ve killed Simeon,” says Laura.  The Mayor has an expression like rock ice. She meets Laura’s terrified eyes, and Laura sees the fear reflected in hers, the fishlike darting of the pupil. There’s a shuffling outside. A lot of the wives have gathered by the door. The whole croft turns to look at them: twenty dull, dispassionate expressions, mud streaks on flexing fingers. Some of the wives have put on new aprons, but the ones who haven’t have big blooming brownish stains on each breadth. They look expectant. They look supremely calm. They look healthy and green and moist.  One of them is at the door and they didn’t even see her move.  “Do we look after the goats, Aunty?”  The Mayor stares at her—stares right through her. After a moment she says, “No. There’s clearing up today, after the rain. Tell—tell the other girls to go home.”  “Yes, Aunty,” she says, and she’s gone with the rest.  There’s silence in the pub. An empty, wavering silence, like a heat shimmer. Anticipatory. Laura says faintly, “We need to tell someone . . . ”  “We’ve got our bloody pride,” says the Mayor.  The crofters are all picking up their slippers and their mugs and are smoothing back their hair, drifting homewards to re-start the morning. Numbly, Laura does the same, retracing her steps, sliding open the mossie screen on her front door. The eggs on her breakfast plate are cold. Her wife is back and running plates under the dry-cleaner, laboriously picking off bits of dried food, singing tunelessly. Laura notices the bloody splotches on the hem of her dress.  “Welcome home,” says her wife.  Sweat beads at the middles of Laura’s palms.  The rest of the croft settles down and plans the pōhiri they’ll have to welcome the conception-care team, and a picnic. The Ministry announces that they’ll be given five percent off foetal mitochondrial therapy, on account of it being Christmas. Everyone contributing to a baby washes their shirt.", "text": "5510 words, short story\nUnion\nThe wives come strapped ten to a transport, hands stamped by some Customs wonk. Their fingernails are frilled and raised freckles stipple each arm in shades of red and orange. Permit tags list their names: Mary. Moana. Ruth. Myrrh. Huia. Anna. Iridium. Coffee. Kōkako.\nThe Franckton crofters stand and watch from behind the barrier. They’ve knocked off midday work to come. You can practically see the pong of hot mulch and melting boot elastomeric coming off them. There’s even a man there from the New Awhitu Listener to take pictures.\nDripping sweat, the Customs detail sign off their quarantine. The wives seem indifferent to the heat. The air from the transport ruffles the thin plaits of their hair, each strand with its own line of fine bulges like a polyp. Everyone is close enough to see.\n“If the Listener links any of those photos,” Simeon’s telling the photographer, “you’re dog tucker, mate.” Simeon’s got the gist of it already. The man knows Simeon’s reputation and is timidly pressing Delete.\nThe Mayor signs the receipt of goods slowly. She’s asking questions, gesturing at the wives, but she’s not getting answers, just filework and shrugging. The Ministry men take the tablet with the signature and you can tell they just want to get the hell out of there before something happens.\nLater on when the croft pores over the paperwork, they discover the wives are lichen splices. No one’s ever heard of it.\nWhen the news had broken that the Ministry was awarding them wives, the relief was so great in Franckton that it was more pain than pleasure. They’d spent the last fifty years incubating on Governmental loan and mortgaging over half the harvest each time. A lot of beers got sunk during all the frantic budgeting that came subsequently. The staunchest Union crofters forgot to do anything but tab up how many generations it would take before all they’d be paying for was the foetal scan.\nOnly Simeon was hostile; nobody was surprised. “It’s a disgrace,” he kept on saying. “It’s a nothing. We’re getting gypped. We’re the highest-revenue croft and they’re shutting us up, they’re paying us off, the next time we don’t say how high when they say jump we’ll get our subsidy slashed and you bastards are falling over yourselves to lick their arse . . . ”\nHe got told off by the Mayor for whinging. The sentiment was that there were only twenty wives to go round and he’d been assigned one and heaps of crofters hadn’t. It wasn’t as though they were all going to receive rose-splice wives and free beer and skittles. Of course it was a sop. It was a harvest cycle, and the Ministry wanted to keep them sweet so that there wouldn’t be a tanty chucked over the price of wheat or onions or oats come the buying time. All of Franckton was going into this with their eyes open; they weren’t naive . . . But they still planned a picnic and a pōhiri and someone agreed to sing for the welcome and everyone getting a wife washed their shirt.\nWhen the wives finally landed and they got their first eyeful, they knew there wasn’t going to be a picnic or a pōhiri. They took up their tines and trudged back to the bunds without preamble. Only Simeon, by way of expressing his feelings, threw a big handful of grit at one of the whirring transports. It exploded into a cloud of dusty shrapnel. Some of the crofters cringed, but nothing happened.\nThe lichen-splice wives are pale and dry. Nobody really knows what to do with them. The last batch of kids had been nine years ago, with a bunch of hardy poppy wives and their minders. They were all hard cases and laughed and made jokes during the incubation, like poppy-wives should. The Mayor was getting treated for germline trouble with her chromosomes 5 and 10, so the Ministry had made them pay through the nose for gene insurance and they’d all been sore about it, but not too sore because it was the Mayor and the croft begrudged her nothing. Simeon had squabbled and said there should be a lawsuit. Some of the crofters agreed, but then there were children to take care of and nobody did anything.\nThe first thing the crofters hate is the names. Their wives have been given croft names, and that’s insult to injury, somehow. It’s ingratiating. They should have had city names and all been Florence or Hannah or Candy. So they all become “wife” by common fiat.\nThey seem obliging enough, but they never speak, except sometimes “Yes” or “No.” They move slowly in the Franckton heat, but unmindingly. They are slow in general to walk or to carry. They lid their eyes heavily when they talk and keep their mouths a little open, sometimes flickering their tongues.\nSimeon holds forth in the pub almost every night about them. Most of the croft complaints are about how their wife stares or can’t cook the tea right or is stupid, or off-putting, or intractable, but Simeon goes further than that. “I don’t want to incubate with some knock-off government sack,” he says of his wife. “She looks like a spastic. She looks like a trisomy hutch.”\nSome of the croft look away but they don’t protest, because you don’t with Simeon, it’s more trouble than it’s worth. Simeon says, “I bloody well mean it. And I tell you what, if they don’t bear good kids and look after them right, I’m blowing this wide open. I’ll strike. I want our next lot to have a future, not go on cringing like mutts for crusts. If all the crofts got up off their bums and stood together we’d have the world on a plate. Look at what we get when we don’t fight for it! Christ, look.”\nOutside the pub and across the street two of the wives stand in the blue evening shade. Simeon stabs a finger in their direction. They do not chat or relax: they stare, first at each other, then at a crack in the daub house, then at a drying clag of mulch, then at each other again. Their tongues flicker in their mouths.\n“I tell you what,” Simeon says again, “they scare me to death. They’re not right. We got fobbed off with something weird, and we’re just shutting up and taking it like we always do.”\nOne of the crofters has the bright idea to tell Simeon that he should have let the photographs go live, that everyone should have seen what had been done to Franckton. This crofter gets pranged with the beer mat.\n“Don’t be stupid,” snaps Simeon, settling back. “We’ve got our bloody pride.”\nFranckton has better results with the wives in the fields. The sun leaves white patches on their skin if they stay out too long in it, but the Mayor gets the children to weave them big scratchy shapeless hats. The wives have been taught to say, “Thank you, Aunty,” and for each hat a wife intones “Thank you, Aunty,” before subsiding back into silence. They’re still slow out there on the bunds, but they are just as slow heaving the stones between them as they are walking as they are everything else. It is simply how they move. They crouch down and poke back rocks into the spillways with their square, dry hands. They build back the gullies and do not care. When the children come around with the water they take one gourd together and sip miniature sips, darting their tongues inside the neck of the bottle. The other crofters take enormous gulps and dump the rest down the backs of their hot, dirty necks.\nIt gets to some of the croft. Nobody dares to be as bad as Simeon, who calls his wife “you” and who swaps sharp words with the Mayor about it almost daily, but there’s loads of complaint. The wives don’t learn. They don’t settle. They’re lazy. They make everyone uneasy. Plenty of splice wives are good for doing chores and croft work—so the catalogues always promise—and do it cheerfully and well, but these ones don’t, and it’s yet another black eye for them.\nWhen Laura says in the pub, “I like my wife,” everyone’s surprised into silence before they bust a gut laughing. “Piss off! I don’t mind her. I wouldn’t want one that was talking my ear off all the time. And she sings sometimes . . . She’s not so bad.”\nShe gets ragged for this daily, but sticks to it: “Mary’s a good girl,” she goes on saying staunchly. “She gives it heaps, just doesn’t rush. Can’t believe you’re all moaning about how they don’t have tea on the table when the clock strikes six. My God! You lot don’t know you’re born.”\nThose with wives start noticing that, wherever they go, a fine leafy build-up appears on the walls or countertops where they work. This is easily wiped off with a damp cloth, but causes no end of alarm. The build-up is a thin crust—a substrate with miniature flakes—dusty green in some houses, shrillingly orange in others. Simeon spits the dummy entirely and makes his wife sleep in the shed, and at this point nobody blames him, he’s sent a sample to the big lab in Awhitu and it matches the wives’ DNA. Like they’re shedding, the pharmacist had said helpfully. “Like they’re moldy,” said Simeon. “Bloody hell. It’s not clean. It’s filthy. It’s not right. They oughtn’t to, it’s a decay, they’re off-cut bargain-bin splices—” And he calls them a lot worse than off-cuts or bargain bin splices.\nHe sends a letter to the Ministry representative, a formal one, with a couple veiled threats chucked in. Other crofters are angry too, and they sign it. The Mayor won’t.\n“It’s harmless,” she says wearily, “it’s a nothing. Just rub a bit of ti-tree extract on the counter, the pharmacy let me have it for cheap. And if you’re making Coffee sleep in the shed you better not whinge about her cooking.”\nBut Simeon won’t let his wife do any cooking now. She shouldn’t touch food, he says. Shouldn’t touch anything they’re not sure about. As per usual, some of the croft privately agrees, but also wishes he’d stop being a bit of a tosser.\nThe doctor comes to give the crofters their health certificates and the Mayor her latest injections. They can’t apply for the DNA license otherwise. He frowns over the Mayor’s scans—again—and gives her some chromosome duplicant on the sly, in exchange for a feed and some cash. “I’m sorry, Barbs,” he says. “You’ll be paying the premium again for the license.”\n“But I’m not contributing,” she says, surprised. “Not after the last time. Didn’t we put that down on the form?”\n“Doesn’t matter; still shows up on your insurance record, I’m afraid. It’s a generational issue. It’s not just your license, it’s all of Franckton’s.”\n“That is daylight robbery,” says the Mayor, “not a deterrent.”\n“It’s a damned shame is what it is,” says the doctor, “but there’s nothing you or I could’ve done about it. At least you’re not renting the cow to get the milk this time, eh?”\nIt’s true. They’re not coughing up for wife costs. Simeon still writes savage letters to the croft’s Parliamentary manager but now they’re getting answered by auto-message. They’ve got to take out a loan against the harvest, which stings, and nobody lets the Mayor put her personal savings in to help, but there’s softer words about the wives when the croft thinks about all the money they’re saving. Fewer people laugh at Laura. There’s enough to pay for a couple of multiples in kids. The last generation born of the whānau is old enough to babysit, but now there’s the wives to do the care, so they can stay at school instead. Not one crofter has got to stay at school past the age of twelve before. An out-of-towner can’t visit Franckton now without getting buttonholed and skited to for half an hour about their good fortune. They book the extraction and the foetal care unit for Christmas.\nThe weather gets hotter and hotter. The wives are in trouble.\nA pruinose bloom settles on the northern oats bund. A feathery patina is discovered on the uppermost parts of the stalk—none on the roots—and it can be wiped off in much the same way as the house crust. The wives stand around dispassionately, hands stuck in their aprons, just watching. The croft explodes in tight-lipped fury. They call a meeting at the public house before the heat of the morning’s even in ripeness and everyone’s there but the children and wives.\n“Here is what we know,” says the Mayor. “The growth isn’t parasitic. The crop isn’t spoiling—yet. We’ve probably caught this in time. We’ll take the girls off bund duty and go on from there.”\n“That’s not what I know,” says Simeon.\nHe slams his mattock down on the table, in full flight. “Here’s what I know,” he says. “I know that we paid twenty thousand for seed DNA that wouldn’t get heat rot or spore. I know that we’ve been bled dry in licenses and mito checkers and quarantines and chromosome therapies, and that’s been long as I live, and I know that we’re bloody indentured slaves—” (“Too right,” says somebody) “—and that these wives, they looked nice on paper but they’re sabotage, they’re Ministry sabotage, trying to keep us down. Stop the crofts growing out of control. We’ve mortgaged those bloody oats and if they bloody spoil then we’re dead bloody meat.”\nHe says this very fast. The Mayor says, “Simeon—”\n“We should ship them back now and to hell with the incubation, show them we don’t take hand-outs, eh,” he says, voice rising. “We don’t take hand-outs! We don’t take pay-offs, we don’t get tricked!”\nA brief pause chills the air. “You’re paranoid, mate,” says Laura, and a mad hubbub breaks out.\nThere’s lots of noise. The crofters all shout to be heard. If Parliament wants the croft to stay small, why give them incubation rights? Well, it’s a con, isn’t it. Remember the story about the old horse. The gift horse, the Greeks. Why would the other crofts stand with them? The other crofts look out for themselves. Simeon’s going to get everyone arrested. Laura’s got her head in the sand. Simeon’s right. Everyone’s a coward. They should send back the wives. They shouldn’t send back the wives. They should have sent back the wives long ago. “If those oats fail I’ll send them back in a box,” bellows Simeon.\nThe Mayor whacks one big, hard hand down on the table. Everything on it rattles percussively.\n“Shut up!” she roars. “Shut up, all of you!”\n“You act like serfs, you get treated like serfs!” Simeon’s still ranting. “You all go along with it, you all let it happen!”\nThe Mayor yanks off her shoe, and she throws it square at Simeon. It clips him lightly on the shoulder. He turns very red. The quiet that ensues is greasy and awful. The breath of each crofter comes slight and small, so as not to make too much of a noise.\n“I won’t have such talk,” says the Mayor slowly. “You besmirch us. You take away from the whole croft. You do us damage.”\nThe silence squirms like a child. The croft becomes aware that the wives have gathered in the doorway. They stand there with dull, slabby faces and their floppy hats in their hands. Only their tongues seem awake, spasmodically flicking behind their teeth, pattering against the inside of each cheek.\nOne of the wives says, “We’re sorry, Aunty,” and the rest follow in a monotone chant, “We’re sorry, Aunty,” all slightly out of time. Simeon’s wife says it last.\n“I’m bloody out,” says Simeon, and he shoulders past them, stumbling. The door of the public house rattles on the doorframe when he slams it.\n“Do you know what you’re sorry for?” says the Mayor, addressing the wives now. The wives do not speak. Some of them look at her, or out of the window, or at the floor, or at a fixed point nowhere in particular. Not a one blinks. The wheezing air conditioner ruffles the thin whippy polyps of their braids. The Mayor repeats, sternly: “There’s no use in being sorry for no reason. Wives are meant to help, not to cause trouble. There’s mold all over the oats. Do you know how to stop it?”\nThere is a long silence. One of the wives ventures, “It is very dry,” and the other wives pick up on this non-sequitur eagerly, blandly repeating: “It is very dry,” and one wife, Laura’s, says: “Getting drier.”\nAn impatient sigh rises from the crowd.\n“Stay out of the fields,” says the Mayor. “You can go out and take over the goats from the children. They can spend their afternoon in the classroom instead. No going near the crops. Is that clear?”\nBy the blank expressions, it is not. But when the Mayor repeats, “Stay out the fields for now. Understand?” it’s greeted with a chorus of yes, Aunty. Then they file out of the building and stand around in the shade in an awkward gaggle. Some of them stare through the window. The crofters think it’s no use.\nThe wives are right about one thing: it’s dry and getting drier, and the dry season hasn’t even started. There’s no rainfall and no sign of one to come. The water levels in the Franckton tanks dip lower and lower.\nIt takes a few days, but the croft manages to wipe the crust off the oat spikelets without too much difficulty. Some of it succumbs, gets blotchy or the stem thickens and blights beyond repair—and the lack of rain’s not helping—but after a few days of holding their breaths they start to exhale. No further bloom forms. The kids all have a moan about extra school.\nThe wives drift around and keep watch over Franckton’s goats. There are only so many goats, and really most of the goats spend their time hiding in the goat ark away from the sun. The wives cluster in the shade and listlessly fold laundry, or don’t pretend to do anything at all but stare at the dust and the sky and the goat ark. They are unperturbed by the stifling heat and the grit whipping up everyone else’s sleeves.\nThey’ll harvest the standing grain the moment it’s ready. There’s no worry that it won’t be dry. The onions will come later. It’s another cost to get the silos and augers cleaned and tested, but when the results come in clean the croft wipes the sweat off their brow and gets the grain in. Everyone’s busy driving the trucks over from the depot, or checking up on the old harvester, talking about the price of phosphines, and nobody has time to worry about the goats or the wives.\nNobody even notices the goat’s sick. It just keels over one day. They find it with three of the wives clustered around, three matching expressions of pallid bemusement.\nThere is a fine crumbly crust all over the dead goat’s head. Wispy filaments are clustered thickly around its ears and damp, flared nostrils, protruding in bunches that deform the skin from beneath. Tiny sprigs sprout from each cornea of the bubbly blind eyes. The mouth’s full. Most of the growths are around the skull, though there are raised, crinkly plates of lichen painting the moist belly and anus.\nAll the croft gets out of the bunds without even scraping their boots. The only ones not in the public house are the vet and the vet assistant, checking and testing the rest of the stock. Everyone sits around, hats squeezed tight between their knees, hands quietly wrung together.\n“I’ll do it,” says Simeon haggardly.\nNone of the croft answer. He says, “First crop, now stock. We’ve lost thousands if that herd’s gone. I always said we paid too much to get them in utero, but they’re good uncloned milch goats.” Everyone remains silent. “And it’s not just money. There’s us to think about as well—us and the young ones.”\nWhen nobody says a word, not a word, he shouts: “You bastards. Pull finger already. Don’t make me make all the decisions when you’re just as scared as I am.”\nThe Mayor sets down the grainy photos of the dead goat and says, “Don’t tell us what we already know, Simeon. Make a proposal.”\n“Single shot to the back of the head,” says Simeon.\nLaura rises with red clutched fists, spluttering, but the crofters around her yank her down into her seat. The Mayor says, “We could send them back—”\n“How long will that take? It’s days and days for the ambo to get through. They needed to be out of here yesterday. ”\nSomeone else suggests turning them loose, taking them out of the boundary and into the dusts, and the Mayor says shortly, “I wouldn’t turn a dog loose into that,” and Simeon says, “What if they got to another croft, for Chrissakes? Don’t pass the buck. It’s our problem. It’s not our fault but it’s our bloody problem.”\nLaura barks, “You can’t be serious.”\n“Deadly. You come up with a better plan, then. Go on.” When another crofter says that they’ll get arrested for this, they’ll get the officers in, Simeon laughs mirthlessly. “That’s what you’re bleating about? The plod getting us for property damage? The Ministry signed them over to us. If it’s the inquest you’re worried about, by God, just let me take the rap. I’ve been wanting my day in court for years. None of the rest of you will get blood on your hands, I’ll put them down. I’m not watching our stock die and our kids get sick and us bled dry for doctor bills—God, I could kill them all!” he ejaculates. “It’s what they wanted all along, they sent us toxic waste!”\nHe takes off his hat and he scrunches it between his hands. “I’ll do it,” he says. “And I’ll cop it when the Ministry comes.”\nThe Mayor says in a voice like grit, “I will call a vote. A show of hands, please, for those in favor.”\nA couple of hands shoot up, immediate and grim. Simeon’s nodding. Others rise more slowly. The clock ticks the minutes. The final few are unwilling, like a held breath let out. The Mayor’s hand is among these stragglers. Laura’s the only one who doesn’t have her hand up in all the croft, and nobody meets her eye.\nShe’s crying out: “You arsehole, Simeon. You always hated them, admit it.” But Simeon’s already putting his hat on his head and heading out the door. Nobody rises to go with him. Nobody shifts from their seat.\nThey can see it from the window: the wives gathering up behind Simeon when he beckons, collecting them from the shady decks and from the field. They all troop together down the street, the wives placid, their tongues flickering in their mouths, some of them looking through the window back at the silent crofters with their thin eyelids half-down over their dusty eyes. Simeon disappears into his shed and reappears with his shotgun and the wives bob after him, one by one, down to the old abattoir.\nAt the first crack of gunshot the Mayor sits down at the table and covers her eyes, and she makes a low, guttural sound in the back of her throat. They count one, two, three. A flinching pause between each. At the twentieth it stops. Everyone waits for no reason at all in the silence that follows, a fidgeting, shuffling, throat-clearing quiet.\nWhen she can apparently bear it no longer, the Mayor snaps, “You all go get your tools and dig a pit past the boundary. Tell the vet to burn the goat.” One of the croft asks about the kids. “Say to the children we sent them away. Enough of this, already!”\nThey wrap the wives in bits of old sacking and put them in a shallow pit past the croft boundary, and they cover them up in sand and gravel and spray the bed with fluorescent paint to mark where they’re laid. They burn the goat and keep the others under watch. They work until past the time when the light has all gone, fixing the bunds, taking the temperature in the silo, steaming the winnower in preparation to take it back to the depot. Those who had wives go home to empty houses and Laura doesn’t go at all, just cracks open tinnies in the public house and curses anyone who comes near her. Simeon doesn’t go home either but hoses out the abattoir.\n“Thank God that’s over,” he repeats, cold and bluff, to anyone on the street he can collar, which isn’t many. “Bring on Christmas. That’s what I say.” He sits on his deck and cleans his gun by sickly solar light, and every so often says “Bring it on,” quietly, still somehow audible through closed croft doors and shuttered croft windows, the croft lying awake in their beds.\nThe onion harvest demands all Franckton’s attention. The weather station promises a lot of rain in a month’s time and that means hurry, to hoe down the stalks and get the crop ready for dry-curing. After that will be soil prep and nitrogen checkers and sifting and seed negotiation and prices. There’s too much to do. There’s twenty fewer pairs of hands to do it with. Christmas bears down on them, inevitable and hot, like a sunburn.\nThe rain starts off Friday as a percussive clap of thunder. The clouds gather in fat, hot, bluish puffs above the croft, and then they open up and the rain roars out. The onions get hauled off in haste to the gas room. The kids are chivvied, screaming, off to the fields to pick up abandoned clippers and pins, jandals slapping noisily on the macadam. The racks groan under the weight of stacked vegetables, frantically checked over for lichen must. One rack shows neck rot but that’s par for the course, to be honest, no matter how much they pay for fungal-resistant seed strains or official pesticides it’s never a done deal. Simeon says it just goes to show they had a near miss and everyone pretends they haven’t heard him.\nThe whole croft’s stuck inside, gloomily playing at cards or smoking. Friday, Saturday, Sunday, Monday, the rain comes down. The sealed road is steamy, liquidy. The warehouse is a blast furnace of dry onion air. The kids all cavil at the rain and the goats get put in the big shed when the ark proves to have a leak. The spraypainted place where the wives were bundled blurs into a watermark.\nThe thunder comes back and rolls around the plain up and down, booming and growling, startling everyone just when they think it’s gone away. There’s a lot of joyless boozing in the public house. Nobody has anything to talk about after they’ve used up the topics of the harvest, the rain. All the water sinks into the dust.\nA few days before Christmas the croft wakes up and their wives are back. All over Franckton, the watery sunrise limns wives cooking breakfast, wives sitting patiently in chairs, wives making mash for the goats, wives standing in the corners with their tongues flickering in their mouths and their eyes looking nowhere. Laura doesn’t even notice her wife in her kitchen or the egg-frying smells until the plate is put in front of her on the table, and then she screams out loud.\nThe goats butt from behind the door in the big shed, bawling to be let out. The wives seem distantly astonished by all the fuss: crofters slamming open the peeling dust-screen doors, shouting, hauling on daggy bedrobes and slippers. Inside, Laura reaches out with a jittering hand to push aside the muddy polyppy strands behind her wife’s ear: sees the healing weal, powdery, an angry-looking half-closed hole, the dull sheen of a bullet inside the skull being slowly pushed out. Her wife jerks her head away a little, like she’s ticklish. Other than the weal she is a nice yellow-green color all over, her freckles a brilliant carmine, her nails as rippled as a riverbed.\nThe Mayor is panting down the street in her pajamas, an old mackintosh wrapped around her shoulders. She is calling for help.\nIn Simeon’s house, the door has been wrenched from its hinges. There is a fearful amount of broken crockery in the sink. Chairs have been pushed over. Next to the kitchen table lies Simeon, legs and arms akimbo. They can only tell it’s Simeon by the clothes, because his skull is a stoved-in mash, fuzzy with the must, sprouting and foliose at the mouth and eye-sockets. Spongy lobes of plant matter rim out down his neck. Gouts of bloody lichen have detonated out his chest, nestled down between brackets of white cracked rib. Long fronds radiate outwards from holes at the stomach: wet with blood, wet with matter, spiraling upwards, drying. He seems titanic in death, enormous and monstrous, half-person, half-explosion.\nThere are footprints everywhere in the dust, heaps of them. When they go to check on the shed out back there’s Simeon’s wife, sitting peacefully on her cot. She stares implacably past them, only occasionally reaching up to fret at the hole behind her ear. She yawns with a wet mouth and bright green teeth. When they ask her questions, she gives them a vague smile.\nLaura finishes retching behind the goat ark and rejoins the croft, meeting for what feels like the umpteenth time in the pub. All the croft looks old all of a sudden. The Mayor’s mackintosh hangs off one shoulder as she sits in a groaning chair.\n“Well,” she says, and seems unable to say anything but, “Well.”\n“Well, what?” demands Laura. “What the hell are we going to tell the Ministry?”\nThe whole croft mulls this one over. They’ll have to register Simeon’s death. There ought to be someone who comes for the remains, but most of the time nobody does, that’s a fact. One of the crofters says that anyway it’s three days until Christmas, and nobody will come out to them before the new Ministry calendar year. And someone else says what about the extraction and care team.\n“That’s not what I bloody meant,” says Laura, “what do we do?”\nFranckton’s already paid for the foetal care team and all the licensing. They won’t notice the damage to the wives, will they? Probably not. They only look munted if you get up close, check them out carefully. Nothing a bath won’t fix, either. They’ve paid for everything. There’s the harvest to think about. The Ministry’s more trouble than it’s worth to talk to. This whole thing’s been a muck-up from start to finish.\n“They’ve killed Simeon,” says Laura.\nThe Mayor has an expression like rock ice. She meets Laura’s terrified eyes, and Laura sees the fear reflected in hers, the fishlike darting of the pupil. There’s a shuffling outside. A lot of the wives have gathered by the door. The whole croft turns to look at them: twenty dull, dispassionate expressions, mud streaks on flexing fingers. Some of the wives have put on new aprons, but the ones who haven’t have big blooming brownish stains on each breadth. They look expectant. They look supremely calm. They look healthy and green and moist.\nOne of them is at the door and they didn’t even see her move.\n“Do we look after the goats, Aunty?”\nThe Mayor stares at her—stares right through her. After a moment she says, “No. There’s clearing up today, after the rain. Tell—tell the other girls to go home.”\n“Yes, Aunty,” she says, and she’s gone with the rest.\nThere’s silence in the pub. An empty, wavering silence, like a heat shimmer. Anticipatory. Laura says faintly, “We need to tell someone . . . ”\n“We’ve got our bloody pride,” says the Mayor.\nThe crofters are all picking up their slippers and their mugs and are smoothing back their hair, drifting homewards to re-start the morning. Numbly, Laura does the same, retracing her steps, sliding open the mossie screen on her front door. The eggs on her breakfast plate are cold. Her wife is back and running plates under the dry-cleaner, laboriously picking off bits of dried food, singing tunelessly. Laura notices the bloody splotches on the hem of her dress.\n“Welcome home,” says her wife.\nSweat beads at the middles of Laura’s palms.\nThe rest of the croft settles down and plans the pōhiri they’ll have to welcome the conception-care team, and a picnic. The Ministry announces that they’ll be given five percent off foetal mitochondrial therapy, on account of it being Christmas. Everyone contributing to a baby washes their shirt.", "source": "https://clarkesworldmagazine.com/muir_12_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Union by Tamsyn Muir"}