{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2014-07-22", "categories": "", "tags": "", "fingerprint": "qLbI7XCGwa2gm+s1psbPJ8krVek=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  China Dreams: Contemporary Chinese Science Fiction  China has a vibrant science fiction culture whose sheer size can sometimes surprise Western readers unfamiliar with it. For example, China’s largest science fiction magazine, Science Fiction World, has a current monthly circulation figure of around 160,000 (this is down from a peak of around 300,000, but copies are often read by multiple people as many high school students purchase them at newsstands and share with friends).  In contrast, the latest overall circulation figures for the big American SF print magazines are 27,248 for Analog, 23,192 for Asimov’s, and 10,678 for The Magazine of Fantasy & Science Fiction.1 Besides genre-specific magazines, some Chinese literary magazines, such as ZUI Found, are also open to SFnal work, and through these markets, the much larger “mainstream” readership is also exposed to science fiction, both translated and native.  The new online publication SF Comet, which hosts a monthly flash fiction contest for invited Chinese and Western science fiction writers (Nancy Kress and Mike Resnick are two recent participants), distributes contest entries to readers via WeChat (a mobile messaging application/platform) and Sina Weibo (a Twitter work-alike).  Although the contest is barely a few months old, it already has thousands of subscribers because readers enjoy the challenge of matching the anonymized entries to the names of the participating authors and voting for their favorite story via WeChat. (I tried guessing the authors during the last couple of contests, and though I failed miserably, I really enjoyed this way of experiencing flash fiction.)  Western fandom is starting to pay attention to Chinese science fiction. Beijing’s bid to host Worldcon, though it lost to Kansas City, nonetheless made waves at LonCon 3. However, until recently, few Chinese SF works are translated into English, making it hard for non-Chinese readers to appreciate them.  This situation is now being remedied to some degree. In recent years, Anglophone science fiction markets such as Apex, Clarkesworld, F&SF, Interzone, Lightspeed, and others have all published works translated from Chinese. In addition, academic journals such as Renditions and China-based English literary journals like Pathlight have also been publishing some excellent genre translations, though my impression is that few genre readers in the West are aware of them or have sought them out.2  Starting in November of 2014, Tor Books will publish English translations of Liu Cixin’s Three-Body trilogy, which is China’s best-selling hard scifi series. And Clarkesworld has recently announced a partnership with Storycom International Culture Communication Co., Ltd. to publish more Chinese SF stories in translation. In short, it is now at least possible for the interested Anglophone reader to read some of these works without knowing Chinese.  Thus, if you’re curious about Chinese science fiction, instead of listening to me, a very valid choice is to simply skip to the end of this essay and read up on the works cited in the bibliography.  Whenever the topic of Chinese science fiction comes up, I often hear Anglophone readers ask: “How is Chinese science fiction different from science fiction written in English?”  I usually disappoint them by replying that the question is ill defined and there isn’t a neat sound bite for an answer. Any broad literary classification tied to a culture—especially a culture as in flux and contested as China’s—encompasses all the complexities and contradictions in that culture. Attempts to provide neat answers will only result in broad generalizations that are of little value or stereotypes that reaffirm existing prejudices.  Thus, I limit myself here to providing context and describing specific authors and works. The title of this essay is a play on President Xi Jingping’s promotion of the “Chinese Dream” as a slogan for China’s development. Science fiction is the literature of dreams, and dreams always say something about the dreamer, the dream interpreter, as well as the audience. When reading Chinese science fiction through translation, the reader must constantly keep in mind the multiple layers of interpretation that are at play.  To start with, I don’t believe that “science fiction written in English” is a useful category for comparison (the fiction written in Singapore, the United Kingdom, and the United States, for example, are all quite different, and there are further divisions within and across such geographical boundaries).  Moreover, imagine asking a hundred different American authors and critics to characterize “American science fiction”—you’d hear a hundred different answers. The same is true of Chinese authors and critics, and Chinese science fiction.  Chinese science fiction has also undergone tremendous change over time. Over about a hundred years, it has moved from the late Qing Dynasty tales of technological optimism to the socialist utopias of the early years of the People’s Republic, to being suppressed as “spiritual pollution” in the 1980s, to a revival in the last two decades that has blossomed into a self-contained, rich literary tradition.3  Conclusions and generalizations that might have once been true about Chinese science fiction are no longer true. And thus I limit myself to discussing only works from the last decade or so (and with a particular focus on works that have been translated so that the reader may seek out the works themselves instead of blindly trusting my summary).  China is also going through a massive social, cultural, and technological transformation involving more than a billion people of different ethnicities, cultures, classes, and ideological sympathies, and it is impossible for anyone, even people who are living through these upheavals, to claim to know the entire picture.  If one’s knowledge of China is limited to Western media reports or the experience of being a tourist or expat, claiming to “understand” China is akin to a man who has caught a glimpse of a fuzzy spot through a drinking straw claiming to know what a leopard is. The fiction produced in China reflects the complexity of the environment.  This is all a rather long-winded way to say that I think anyone who confidently asserts a definitive characterization of “Chinese science fiction” is either a) an outsider who doesn’t know what they’re talking about; or b) someone who does know something, but is deliberately ignoring the contested nature of the subject and presenting their opinion as fact.  There is, in fact, a fairly vibrant body of academic scholarship about Chinese science fiction, with insightful and interesting commentary by scholars such as Mingwei Song and Nathaniel Isaacson. Panels on Chinese science fiction are quite common at academic conferences on comparative literature and Asian studies. However, my impression is that many (most?) genre readers, writers, and critics in fandom are not familiar with this body of work. The scholarly essays generally avoid the pitfalls I warn about and are nuanced and careful in their analysis. Readers seeking an informed opinion are urged to look up these works.  So, I will state that I do not consider myself an expert on Chinese science fiction. Although I have read a sizable number of works of Chinese SF and translated some of them from Chinese into English, I know enough only to know that I don’t know much. I know enough to know that I need to study more, a lot more. And I know enough to know that there are no simple answers.  A popular way for Chinese fans to describe the contemporary Chinese science fiction scene is to say that there are three prominent, active writers who belong to an older generation, the so-called “Big Three” of Liu Cixin, Wang Jinkang, and Han Song. In addition, there is a generation of younger writers who have generally achieved fame with short fiction, though many have also started novel careers.  It’s impossible to speak of contemporary Chinese science fiction without starting with Liu Cixin, who has been sometimes described as a “neo-classical” writer whose novels and short stories are compared to the works of Isaac Asimov or Arthur C. Clarke, but with a modern, “Chinese” sensibility. Liu has won China’s most prestigious literary genre awards multiple times, and his masterpiece, the Three-Body trilogy (consisting of The Three-Body Problem, The Dark Forest, and Death’s End), has been credited for single-handedly gaining Chinese science fiction respectability among the Chinese literary establishment. A massive work spanning the time from China’s Cultural Revolution to the end of the universe, the trilogy describes an alien invasion of Earth triggered by a Mao-era METI project, and the consequent scattering of humanity to the stars. Liu’s short fiction is similarly characterized by a grand imaginative scope, though he often roots his stories in the lives of China’s ordinary citizens who live far from the big cities and have little wealth.  The other two writers, Wang Jinkang and Han Song, are quite different. Wang Jinkang’s works are very much concerned with the intersection of science and ethics. His recent novel The Ant Life, for instance, features a young scientist who succeeds in creating a utopia by infecting the people of an isolated community with hormones extracted from ants to replace their selfish desires with altruistic ones directed to the good of the community as a whole. As one might imagine, this experiment backfires and unintended consequences come to dominate. Many of Wang’s stories are infused with this flavor of sociological SF.  Han Song, on the other hand, focuses his acerbic wit on the “science fictional” excesses of modern development, particularly as manifested in China’s breakneck rush toward “progress.” His High-Speed Rail, for instance, uses China’s high-speed train network as a postmodern metaphor to explore the rapid and grotesque devolution (or perhaps unmooring) of values in contemporary China through a series of surreal, dark, violent images.  In contrast to the Big Three, the younger writers of the new generation generally have done their best works so far only in short form (though this is changing). They make use of a variety of approaches and styles, and it’s very difficult to generalize about them in any useful way.  For example, this group includes the “science fiction realism” of Chen Qiufan (a.k.a. Stanley Chan), whose “The Year of the Rat” describes the plight of unemployed Chinese college grads being drafted to fight genetically engineered rats. The story can be read as a satire on the inequities and dislocations caused by China’s rapid development as well as providing a perspective on China’s low-wage manufacturing sector that may be unfamiliar to Western readers.  Chen’s debut novel, The Waste Tide, is a cyberpunk thriller set in China’s e-waste processing hub. Its detailed worldbuilding and meticulous attention to technical rigor are further enriched by trenchant observations concerning the complex linguistic landscape of China’s economically developed regions, where multiple topolects of Sinitic languages as well as English coexist and compete. This focus on linguistic topography should come as no surprise when one learns that Chen is fluent in Mandarin, Cantonese, Teochew, English, and once won Taiwan’s prestigious Dragon Fantasy Award for having written a science fiction story in Classical Chinese (a feat akin to one of us writing a science fiction story in Anglo-Saxon and then winning a Nebula or Hugo for it).  Next, encounter the “porridge SF” of Xia Jia, whose dreamlike, layered images defy easy genre classifications. In “A Hundred Ghosts Parade Tonight,” Xia’s rich prose sketches a fantastic world of ghosts that turn out to be a futuristic, abandoned theme park of post-human cyborgs.  In “Spring Festival: Happiness, Anger, Love, Sorrow, Joy,” Xia’s near-future vignettes of Chinese traditions transformed by technology are punctuated by supernatural acts of resistance and rebellion. Besides a career as one of China’s most popular science fiction authors, Xia is also an accomplished scholar (she holds a Ph.D. in comparative literature) and translator (she has translated works by Ray Bradbury, among others).  You’ll also find the overt, wry political metaphors of Ma Boyong, whose “City of Silence” pays homage to 1984 by upgrading the machinery of state surveillance with network technology and counters it with acts of resistance drawn from the experience of Chinese netizens.  Incisive, funny, and erudite, Ma’s works are deeply allusive, featuring surprising and entertaining juxtapositions of traditional elements from Chinese culture and history against contemporary references. The ease with which Ma marshals his encyclopedic knowledge of Chinese history and traditions also makes it a challenge to translate his most interesting works.  For example, he has written an imaginative history of coffee in China that applies the conventions of China’s rich millennia-long tea culture to coffee, as well as a wuxia (martial arts fantasy) novella featuring Joan of Arc, in which the tropes and expectations of wuxia are mapped to Medieval Europe. These stories are extremely entertaining for the reader with the right cultural context and shed light on the genres and sources Ma plays with, but would be neigh-impenetrable for a reader in translation without extensive footnotes.  Then there’s also Baoshu, a celebrated new writer whose meteoric rise onto the scene during the last few years has been propelled by a series of inventive, funny, and moving short stories. Last year, Baoshu published his debut novel, The Ruins of Time, which tells a tale of heroism and faith in a world trapped in a time loop, and which has just won the Xingyun (Nebula) Award for Chinese SF. Baoshu’s true “first” novel was a fanfiction sequel set in the world of Liu Cixin’s Three-Body series, and the playful, pastiche-laden style he first demonstrated there remains a key part of his appeal—and gives his translators plenty of headaches.  This is but a cursory and shallow glance at the scene of contemporary Chinese science fiction. Time and space limitations prevent me from going into depth about the surreal imagery and metaphor-driven logic of Tang Fei, the dense, rich language-pictures painted by Cheng Jingbo, the fabulism and sociological speculation of Hao Jingfang, the gentle meditations on art and science by Wu Shuang (a.k.a. Anna Wu), or the rigorous historical imagination of Qian Lifang, whose Will of Heaven, a science fictional retelling of the founding of the Han Dynasty, was perhaps the most popular work of long-form science fiction in the pre-Three Body era.  I also haven’t read enough to comment on other prominent writers such as Fei Dao, Jiang Bo, He Xi, and many others. And of course, I’ve said nothing here concerning the large number of chuanyue (“time travel”) works, many of which also contain science fictional elements and deserve an essay on their own . . .  But this brief survey should give a hint of the broad range in the science fiction written in China. Faced with such variety, I think it is far more useful and interesting to study the authors as individuals and to treat their works on their own terms rather than trying to impose a pre-conceived set of expectations on them because they happen to be “Chinese science fiction.”  Given the realities of China’s politics and its uneasy relationship with the West, it is natural for Western readers encountering Chinese science fiction to see it through the lens of Western dreams and hopes and fairytales about Chinese politics. “Subversion” in the pro-West sense may become an interpretive crutch.  It is tempting, for example, to view Ma Boyong’s “The City of Silence” as a simple attack on China’s censorship apparatus, or to read Chen Qiufan’s “The Year of the Rat” as just a criticism of China’s education system and labor market, or even to reduce Xia Jia’s “A Hundred Ghosts Parade Tonight” to a veiled metaphor for China’s eminent domain policies in the service of state-driven development.  I would urge the reader to resist such temptation. Imagining that the political concerns of Chinese writers are the same as what the Western reader would like them to be is at best arrogant and at worst dangerous. Chinese writers are saying something about the globe, about all of humanity, not just China, and trying to understand their works through this perspective is, I think, the far more rewarding approach.  It is true that there is a long tradition in China of voicing dissent and criticism through the use of literary metaphor; however, this is but one of the purposes with which writers write and for which readers read. Like writers everywhere today, Chinese writers are concerned with humanism, with globalization, with technological advancement, with tradition and modernity, with disparities in wealth and privilege, with development and environmental preservation, with history, rights, freedom, and justice, with family and love, with the beauty of expressing sentiment through words, with language play, with the grandeur of science, with the thrill of discovery, with the ultimate meaning of life. We do the works a disservice when we neglect these things and focus on geopolitics alone.  Despite the diversity of approaches and subjects and styles, the authors and stories I have discussed (and especially those works that have made it into English translation) represent but a narrow slice of the contemporary Chinese science fiction landscape. As Xia Jia has said, “Contemporary Chinese science fiction writers form a community full of internal differences. These differences manifest themselves in age, region of origin, professional background, social class, ideology, cultural identity, aesthetics, and other areas.”4  The stories that are translated tend to be written by authors who are graduates of China’s most elite colleges and work in highly regarded professions. They tend to be award-winning stories rather than popular fiction published on the Web. And as I’ve already hinted at earlier, works that are translated tend to be more accessible than works requiring a deeper understanding of Chinese culture and history. These are unfortunate biases and omissions, and the reader should thus be cautious about any conclusions they may draw from the stories in translation being “representative.”  China is dreaming, and its dreams contain multitudes.  Selected Bibliography of Contemporary Chinese SF Works in Translation  Individual Stories in Magazines or General Anthologies   Chen Qiufan, “The Endless Farewell,” Pathlight, Spring 2013, translated by Ken Liu.  Chen Qiufan, “The Flower of Shazui,” Interzone, October 2012, translated by Ken Liu.  Chen Qiufan, “Oil of Angels,” Upgraded, edited by Neil Clarke, translated by Ken Liu.  Chen Qiufan, “The Year of the Rat,” The Magazine of Fantasy and Science Fiction, July/August 2013, translated by Ken Liu.  Chen Qiufan, The Waste Tide. English translation by Ken Liu, forthcoming.  Hao Jingfang, “Folding Beijing,” Uncanny, 2015, translated by Ken Liu.  Liu Cixin, “Taking Care of God,” Pathlight, April 2012.  Ma Boyong, “Mark Twain Robots,” TRSF (September 2011), a special publication of MIT’s Technology Review, translated by Ken Liu.  Xia Jia, “Spring Festival: Happiness, Anger, Love, Sorrow, Joy,” Clarkesworld, September 2012, translated by Ken Liu.  Zhao Haihong, “Exuviation,” Lady Churchill’s Rosebud Wristlet, 2010 (reprinted by Lightspeed, January 2014.  Journals or Anthologies Specializing in Works in Translation     Han Song, “The Wheel of Samsara”  Yang Ping, “Wizard World”    Chen Qiufan, “The Tomb”  Yang Ping, “Wizard World”  RENDITIONS A Chinese-English Translation Magazine Nos. 77 & 78—Spring and Autumn 2012, edited by Mingwei Song. This double issue contains both works from the early twentieth century and the early twenty-first century. The more relevant contemporary works include:    Liu Cixin, “The Poetry Cloud,” translated by Chi-yin Ip and Cheuk Wong  Liu Cixin, “The Village Schoolteacher,” translated by Christopher Elford and Jiang Chenxin  Han Song, “The Passengers and the Creator,” translated by Nathaniel Isaacson  Wang Jinkang, “The Reincarnated Giant,” translated by Carlos Rojas  La La, “The Radio Waves That Never Die,” translated by Petula Parris-Huang  Zhao Haihong, “1923—a Fantasy,” translated by Nicky Harman and Pang Zhaoxia  Chi Hui, “The Rainforest,” translated by Jie Li  Fei Dao, “The Demon’s Head,” translated by David Hull  Xia Jia, “The Demon-Enslaving Flask,” translated by Linda Rui Feng  FOOTNOTES:  1 Figures obtained from Gardner Dozois’ 2013 summation in his Year’s Best Science Fiction, Thirty-First Annual Collection.  2 A selected bibliography is given at the end of this essay so that readers may find some of these works.  3 For more on the history of Chinese science fiction, see Xia Jia’s essay, “What Makes Chinese Science Fiction Chinese?” July 22, 2014, Tor.com.  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "Non-Fiction\nChina Dreams: Contemporary Chinese Science Fiction\nChina has a vibrant science fiction culture whose sheer size can sometimes surprise Western readers unfamiliar with it. For example, China’s largest science fiction magazine, Science Fiction World, has a current monthly circulation figure of around 160,000 (this is down from a peak of around 300,000, but copies are often read by multiple people as many high school students purchase them at newsstands and share with friends).\nIn contrast, the latest overall circulation figures for the big American SF print magazines are 27,248 for Analog, 23,192 for Asimov’s, and 10,678 for The Magazine of Fantasy & Science Fiction.1 Besides genre-specific magazines, some Chinese literary magazines, such as ZUI Found, are also open to SFnal work, and through these markets, the much larger “mainstream” readership is also exposed to science fiction, both translated and native.\nThe new online publication SF Comet, which hosts a monthly flash fiction contest for invited Chinese and Western science fiction writers (Nancy Kress and Mike Resnick are two recent participants), distributes contest entries to readers via WeChat (a mobile messaging application/platform) and Sina Weibo (a Twitter work-alike).\nAlthough the contest is barely a few months old, it already has thousands of subscribers because readers enjoy the challenge of matching the anonymized entries to the names of the participating authors and voting for their favorite story via WeChat. (I tried guessing the authors during the last couple of contests, and though I failed miserably, I really enjoyed this way of experiencing flash fiction.)\nWestern fandom is starting to pay attention to Chinese science fiction. Beijing’s bid to host Worldcon, though it lost to Kansas City, nonetheless made waves at LonCon 3. However, until recently, few Chinese SF works are translated into English, making it hard for non-Chinese readers to appreciate them.\nThis situation is now being remedied to some degree. In recent years, Anglophone science fiction markets such as Apex, Clarkesworld, F&SF, Interzone, Lightspeed, and others have all published works translated from Chinese. In addition, academic journals such as Renditions and China-based English literary journals like Pathlight have also been publishing some excellent genre translations, though my impression is that few genre readers in the West are aware of them or have sought them out.2\nStarting in November of 2014, Tor Books will publish English translations of Liu Cixin’s Three-Body trilogy, which is China’s best-selling hard scifi series. And Clarkesworld has recently announced a partnership with Storycom International Culture Communication Co., Ltd. to publish more Chinese SF stories in translation. In short, it is now at least possible for the interested Anglophone reader to read some of these works without knowing Chinese.\nThus, if you’re curious about Chinese science fiction, instead of listening to me, a very valid choice is to simply skip to the end of this essay and read up on the works cited in the bibliography.\nWhenever the topic of Chinese science fiction comes up, I often hear Anglophone readers ask: “How is Chinese science fiction different from science fiction written in English?”\nI usually disappoint them by replying that the question is ill defined and there isn’t a neat sound bite for an answer. Any broad literary classification tied to a culture—especially a culture as in flux and contested as China’s—encompasses all the complexities and contradictions in that culture. Attempts to provide neat answers will only result in broad generalizations that are of little value or stereotypes that reaffirm existing prejudices.\nThus, I limit myself here to providing context and describing specific authors and works. The title of this essay is a play on President Xi Jingping’s promotion of the “Chinese Dream” as a slogan for China’s development. Science fiction is the literature of dreams, and dreams always say something about the dreamer, the dream interpreter, as well as the audience. When reading Chinese science fiction through translation, the reader must constantly keep in mind the multiple layers of interpretation that are at play.\nTo start with, I don’t believe that “science fiction written in English” is a useful category for comparison (the fiction written in Singapore, the United Kingdom, and the United States, for example, are all quite different, and there are further divisions within and across such geographical boundaries).\nMoreover, imagine asking a hundred different American authors and critics to characterize “American science fiction”—you’d hear a hundred different answers. The same is true of Chinese authors and critics, and Chinese science fiction.\nChinese science fiction has also undergone tremendous change over time. Over about a hundred years, it has moved from the late Qing Dynasty tales of technological optimism to the socialist utopias of the early years of the People’s Republic, to being suppressed as “spiritual pollution” in the 1980s, to a revival in the last two decades that has blossomed into a self-contained, rich literary tradition.3\nConclusions and generalizations that might have once been true about Chinese science fiction are no longer true. And thus I limit myself to discussing only works from the last decade or so (and with a particular focus on works that have been translated so that the reader may seek out the works themselves instead of blindly trusting my summary).\nChina is also going through a massive social, cultural, and technological transformation involving more than a billion people of different ethnicities, cultures, classes, and ideological sympathies, and it is impossible for anyone, even people who are living through these upheavals, to claim to know the entire picture.\nIf one’s knowledge of China is limited to Western media reports or the experience of being a tourist or expat, claiming to “understand” China is akin to a man who has caught a glimpse of a fuzzy spot through a drinking straw claiming to know what a leopard is. The fiction produced in China reflects the complexity of the environment.\nThis is all a rather long-winded way to say that I think anyone who confidently asserts a definitive characterization of “Chinese science fiction” is either a) an outsider who doesn’t know what they’re talking about; or b) someone who does know something, but is deliberately ignoring the contested nature of the subject and presenting their opinion as fact.\nThere is, in fact, a fairly vibrant body of academic scholarship about Chinese science fiction, with insightful and interesting commentary by scholars such as Mingwei Song and Nathaniel Isaacson. Panels on Chinese science fiction are quite common at academic conferences on comparative literature and Asian studies. However, my impression is that many (most?) genre readers, writers, and critics in fandom are not familiar with this body of work. The scholarly essays generally avoid the pitfalls I warn about and are nuanced and careful in their analysis. Readers seeking an informed opinion are urged to look up these works.\nSo, I will state that I do not consider myself an expert on Chinese science fiction. Although I have read a sizable number of works of Chinese SF and translated some of them from Chinese into English, I know enough only to know that I don’t know much. I know enough to know that I need to study more, a lot more. And I know enough to know that there are no simple answers.\nA popular way for Chinese fans to describe the contemporary Chinese science fiction scene is to say that there are three prominent, active writers who belong to an older generation, the so-called “Big Three” of Liu Cixin, Wang Jinkang, and Han Song. In addition, there is a generation of younger writers who have generally achieved fame with short fiction, though many have also started novel careers.\nIt’s impossible to speak of contemporary Chinese science fiction without starting with Liu Cixin, who has been sometimes described as a “neo-classical” writer whose novels and short stories are compared to the works of Isaac Asimov or Arthur C. Clarke, but with a modern, “Chinese” sensibility. Liu has won China’s most prestigious literary genre awards multiple times, and his masterpiece, the Three-Body trilogy (consisting of The Three-Body Problem, The Dark Forest, and Death’s End), has been credited for single-handedly gaining Chinese science fiction respectability among the Chinese literary establishment. A massive work spanning the time from China’s Cultural Revolution to the end of the universe, the trilogy describes an alien invasion of Earth triggered by a Mao-era METI project, and the consequent scattering of humanity to the stars. Liu’s short fiction is similarly characterized by a grand imaginative scope, though he often roots his stories in the lives of China’s ordinary citizens who live far from the big cities and have little wealth.\nThe other two writers, Wang Jinkang and Han Song, are quite different. Wang Jinkang’s works are very much concerned with the intersection of science and ethics. His recent novel The Ant Life, for instance, features a young scientist who succeeds in creating a utopia by infecting the people of an isolated community with hormones extracted from ants to replace their selfish desires with altruistic ones directed to the good of the community as a whole. As one might imagine, this experiment backfires and unintended consequences come to dominate. Many of Wang’s stories are infused with this flavor of sociological SF.\nHan Song, on the other hand, focuses his acerbic wit on the “science fictional” excesses of modern development, particularly as manifested in China’s breakneck rush toward “progress.” His High-Speed Rail, for instance, uses China’s high-speed train network as a postmodern metaphor to explore the rapid and grotesque devolution (or perhaps unmooring) of values in contemporary China through a series of surreal, dark, violent images.\nIn contrast to the Big Three, the younger writers of the new generation generally have done their best works so far only in short form (though this is changing). They make use of a variety of approaches and styles, and it’s very difficult to generalize about them in any useful way.\nFor example, this group includes the “science fiction realism” of Chen Qiufan (a.k.a. Stanley Chan), whose “The Year of the Rat” describes the plight of unemployed Chinese college grads being drafted to fight genetically engineered rats. The story can be read as a satire on the inequities and dislocations caused by China’s rapid development as well as providing a perspective on China’s low-wage manufacturing sector that may be unfamiliar to Western readers.\nChen’s debut novel, The Waste Tide, is a cyberpunk thriller set in China’s e-waste processing hub. Its detailed worldbuilding and meticulous attention to technical rigor are further enriched by trenchant observations concerning the complex linguistic landscape of China’s economically developed regions, where multiple topolects of Sinitic languages as well as English coexist and compete. This focus on linguistic topography should come as no surprise when one learns that Chen is fluent in Mandarin, Cantonese, Teochew, English, and once won Taiwan’s prestigious Dragon Fantasy Award for having written a science fiction story in Classical Chinese (a feat akin to one of us writing a science fiction story in Anglo-Saxon and then winning a Nebula or Hugo for it).\nNext, encounter the “porridge SF” of Xia Jia, whose dreamlike, layered images defy easy genre classifications. In “A Hundred Ghosts Parade Tonight,” Xia’s rich prose sketches a fantastic world of ghosts that turn out to be a futuristic, abandoned theme park of post-human cyborgs.\nIn “Spring Festival: Happiness, Anger, Love, Sorrow, Joy,” Xia’s near-future vignettes of Chinese traditions transformed by technology are punctuated by supernatural acts of resistance and rebellion. Besides a career as one of China’s most popular science fiction authors, Xia is also an accomplished scholar (she holds a Ph.D. in comparative literature) and translator (she has translated works by Ray Bradbury, among others).\nYou’ll also find the overt, wry political metaphors of Ma Boyong, whose “City of Silence” pays homage to 1984 by upgrading the machinery of state surveillance with network technology and counters it with acts of resistance drawn from the experience of Chinese netizens.\nIncisive, funny, and erudite, Ma’s works are deeply allusive, featuring surprising and entertaining juxtapositions of traditional elements from Chinese culture and history against contemporary references. The ease with which Ma marshals his encyclopedic knowledge of Chinese history and traditions also makes it a challenge to translate his most interesting works.\nFor example, he has written an imaginative history of coffee in China that applies the conventions of China’s rich millennia-long tea culture to coffee, as well as a wuxia (martial arts fantasy) novella featuring Joan of Arc, in which the tropes and expectations of wuxia are mapped to Medieval Europe. These stories are extremely entertaining for the reader with the right cultural context and shed light on the genres and sources Ma plays with, but would be neigh-impenetrable for a reader in translation without extensive footnotes.\nThen there’s also Baoshu, a celebrated new writer whose meteoric rise onto the scene during the last few years has been propelled by a series of inventive, funny, and moving short stories. Last year, Baoshu published his debut novel, The Ruins of Time, which tells a tale of heroism and faith in a world trapped in a time loop, and which has just won the Xingyun (Nebula) Award for Chinese SF. Baoshu’s true “first” novel was a fanfiction sequel set in the world of Liu Cixin’s Three-Body series, and the playful, pastiche-laden style he first demonstrated there remains a key part of his appeal—and gives his translators plenty of headaches.\nThis is but a cursory and shallow glance at the scene of contemporary Chinese science fiction. Time and space limitations prevent me from going into depth about the surreal imagery and metaphor-driven logic of Tang Fei, the dense, rich language-pictures painted by Cheng Jingbo, the fabulism and sociological speculation of Hao Jingfang, the gentle meditations on art and science by Wu Shuang (a.k.a. Anna Wu), or the rigorous historical imagination of Qian Lifang, whose Will of Heaven, a science fictional retelling of the founding of the Han Dynasty, was perhaps the most popular work of long-form science fiction in the pre-Three Body era.\nI also haven’t read enough to comment on other prominent writers such as Fei Dao, Jiang Bo, He Xi, and many others. And of course, I’ve said nothing here concerning the large number of chuanyue (“time travel”) works, many of which also contain science fictional elements and deserve an essay on their own . . .\nBut this brief survey should give a hint of the broad range in the science fiction written in China. Faced with such variety, I think it is far more useful and interesting to study the authors as individuals and to treat their works on their own terms rather than trying to impose a pre-conceived set of expectations on them because they happen to be “Chinese science fiction.”\nGiven the realities of China’s politics and its uneasy relationship with the West, it is natural for Western readers encountering Chinese science fiction to see it through the lens of Western dreams and hopes and fairytales about Chinese politics. “Subversion” in the pro-West sense may become an interpretive crutch.\nIt is tempting, for example, to view Ma Boyong’s “The City of Silence” as a simple attack on China’s censorship apparatus, or to read Chen Qiufan’s “The Year of the Rat” as just a criticism of China’s education system and labor market, or even to reduce Xia Jia’s “A Hundred Ghosts Parade Tonight” to a veiled metaphor for China’s eminent domain policies in the service of state-driven development.\nI would urge the reader to resist such temptation. Imagining that the political concerns of Chinese writers are the same as what the Western reader would like them to be is at best arrogant and at worst dangerous. Chinese writers are saying something about the globe, about all of humanity, not just China, and trying to understand their works through this perspective is, I think, the far more rewarding approach.\nIt is true that there is a long tradition in China of voicing dissent and criticism through the use of literary metaphor; however, this is but one of the purposes with which writers write and for which readers read. Like writers everywhere today, Chinese writers are concerned with humanism, with globalization, with technological advancement, with tradition and modernity, with disparities in wealth and privilege, with development and environmental preservation, with history, rights, freedom, and justice, with family and love, with the beauty of expressing sentiment through words, with language play, with the grandeur of science, with the thrill of discovery, with the ultimate meaning of life. We do the works a disservice when we neglect these things and focus on geopolitics alone.\nDespite the diversity of approaches and subjects and styles, the authors and stories I have discussed (and especially those works that have made it into English translation) represent but a narrow slice of the contemporary Chinese science fiction landscape. As Xia Jia has said, “Contemporary Chinese science fiction writers form a community full of internal differences. These differences manifest themselves in age, region of origin, professional background, social class, ideology, cultural identity, aesthetics, and other areas.”4\nThe stories that are translated tend to be written by authors who are graduates of China’s most elite colleges and work in highly regarded professions. They tend to be award-winning stories rather than popular fiction published on the Web. And as I’ve already hinted at earlier, works that are translated tend to be more accessible than works requiring a deeper understanding of Chinese culture and history. These are unfortunate biases and omissions, and the reader should thus be cautious about any conclusions they may draw from the stories in translation being “representative.”\nChina is dreaming, and its dreams contain multitudes.\nSelected Bibliography of Contemporary Chinese SF Works in Translation\nIndividual Stories in Magazines or General Anthologies\nChen Qiufan, “The Endless Farewell,” Pathlight, Spring 2013, translated by Ken Liu.\nChen Qiufan, “The Flower of Shazui,” Interzone, October 2012, translated by Ken Liu.\nChen Qiufan, “Oil of Angels,” Upgraded, edited by Neil Clarke, translated by Ken Liu.\nChen Qiufan, “The Year of the Rat,” The Magazine of Fantasy and Science Fiction, July/August 2013, translated by Ken Liu.\nChen Qiufan, The Waste Tide. English translation by Ken Liu, forthcoming.\nHao Jingfang, “Folding Beijing,” Uncanny, 2015, translated by Ken Liu.\nLiu Cixin, “Taking Care of God,” Pathlight, April 2012.\nMa Boyong, “Mark Twain Robots,” TRSF (September 2011), a special publication of MIT’s Technology Review, translated by Ken Liu.\nXia Jia, “Spring Festival: Happiness, Anger, Love, Sorrow, Joy,” Clarkesworld, September 2012, translated by Ken Liu.\nZhao Haihong, “Exuviation,” Lady Churchill’s Rosebud Wristlet, 2010 (reprinted by Lightspeed, January 2014.\nJournals or Anthologies Specializing in Works in Translation\n- Han Song, “The Wheel of Samsara”\n- Yang Ping, “Wizard World”\n- Chen Qiufan, “The Tomb”\n- Yang Ping, “Wizard World”\nRENDITIONS A Chinese-English Translation Magazine Nos. 77 & 78—Spring and Autumn 2012, edited by Mingwei Song. This double issue contains both works from the early twentieth century and the early twenty-first century. The more relevant contemporary works include:\n- Liu Cixin, “The Poetry Cloud,” translated by Chi-yin Ip and Cheuk Wong\n- Liu Cixin, “The Village Schoolteacher,” translated by Christopher Elford and Jiang Chenxin\n- Han Song, “The Passengers and the Creator,” translated by Nathaniel Isaacson\n- Wang Jinkang, “The Reincarnated Giant,” translated by Carlos Rojas\n- La La, “The Radio Waves That Never Die,” translated by Petula Parris-Huang\n- Zhao Haihong, “1923—a Fantasy,” translated by Nicky Harman and Pang Zhaoxia\n- Chi Hui, “The Rainforest,” translated by Jie Li\n- Fei Dao, “The Demon’s Head,” translated by David Hull\n- Xia Jia, “The Demon-Enslaving Flask,” translated by Linda Rui Feng\nFOOTNOTES:\n1 Figures obtained from Gardner Dozois’ 2013 summation in his Year’s Best Science Fiction, Thirty-First Annual Collection.\n2 A selected bibliography is given at the end of this essay so that readers may find some of these works.\n3 For more on the history of Chinese science fiction, see Xia Jia’s essay, “What Makes Chinese Science Fiction Chinese?” July 22, 2014, Tor.com.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/liu_12_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: China Dreams: Contemporary Chinese Science Fiction by Ken Liu"}