{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-03-15", "categories": "", "tags": "", "fingerprint": "SLCFRz7QH6Q0zqO85MUI8TADF4g=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Friendship in the Time Of Kaiju: A Conversation with John Scalzi  John Scalzi grew up in Southern California and went to school in Claremont. He graduated from the Webb School in 1987 and attended the University of Chicago, where he became editor-in-chief of The Chicago Maroon. He graduated in 1991 with a philosophy degree. He returned to California and worked as a film critic, then as a columnist for The Fresno Bee. He moved to Washington, DC to work for AOL as an in-house editor in 1996. In 1998, he became a full-time freelance writer, landing work for corporate clients as well as reviewing and writing fiction. Scalzi is also a well-known blogger, with a popular personal site called Whatever.  Scalzi’s first genre novel was Agent to the Stars, published on his website in 1999 and later in print in 2005. Old Man’s War followed and was published on his website in 2002. Found by Patrick Nielsen Hayden, he purchased it for Tor after reading, and the novel came out in print in 2005. It landed a 2006 Hugo nomination, came very close to taking a Locus Award, and undoubtedly had something to do with his 2006 Astounding Award for Best New Writer win (then called the Campbell Award). Other novels set in the same universe include 2006 title The Ghost Brigades, The Last Colony in 2007, Zoe’s Tale in 2008 (which landed Norton and Hugo nominations), The Human Division in 2013, and The End of All Things in 2015.  Scalzi’s satirical work includes 2012 title Redshirts, which won a Hugo Award. Other novels include The Android’s Dream in 2006, Fuzzy Nation in 2011, and Lock In in 2015—which earned him a Campbell Memorial Award nomination.  2015 was the kind of year most authors dream about: John Scalzi announced the signing of a ten-year thirteen-book contract with Tor for $3.4 million, comprising ten adult and three YA novels, beginning with 2017’s The Collapsing Empire (book one of The Interdependency series).  Since landing those 2006 accolades, Scalzi has consistently appeared on awards ballots for various works. Wins include Locus Awards, Hugo Awards, and a Dragon Award for The Last Emperox (book three of The Interdependency); he’s even received international honors, such as two Seiun Awards and a Kurd Lasswitz Prize.  Among many, many other writing gigs, Scalzi was creative consultant for the Stargate Universe television series and a writer for video game Midnight Star. He is executive producer for Old Man’s War and The Collapsing Empire, both currently in development for film/TV. He wrote five short stories that were adapted into episodes for Netflix series Love, Death & Robots.  John Scalzi’s newest novel is The Kaiju Preservation Society, due from Tor on March 15, 2022.   The Kaiju Preservation Society has been well received so far. What do you think is the appeal for readers and fans?  Pretty much everybody can get from the title what this thing is meant to be. People know instantly whether they’re in or not. In that way, it’s very much like Redshirts was, and you knew from the title whether this was going to be something that interested you or not. I think the other thing is, coming off the last couple of years that we had, there has been an appetite for escapism. Something that is considered “popcorn” or however you want to describe it. It’ll be fun and there’s chewy stuff in there, but honestly, you’re not going to come out of it feeling a little bummed. There’s nothing wrong with really rich, complex worlds, and many authors are crafting them. They make for fantastic books, and they’re going to make for books that are going to be remembered ten or twenty years from now. I can’t guarantee you that The Kaiju Preservation Society is going to be remembered next year. That wasn’t the goal. The goal for this was simply, “I’m stressed, I’m this big ball of tension and confusion and tiredness. Take me away.” This is not a brooding symphony; this is a pop song. I think people are in the mood for a pop song.  Are kaiju something that you’re into, did you grow up watching Godzilla?  Some of my earliest memories of television are the Japanese kaiju movies. When I grew up in Los Angeles, I’d watch channel nine and channel eleven. They were independent stations at the time, and they would fill up their Saturday and Sunday afternoons with Japanese movies where these big monsters would stomp on things. When you’re seven or eight years old, and before the Star Wars era, all of it looked startlingly realistic. It was like, “This could be happening! What the hell’s going on in Japan, how do they live?” I think anybody who was my age growing up watching these things, it just sort of seeped into your bones.  I also watched Ultraman, and sort of naturally slid into anime and manga. So, there was always that substratum there. I don’t have kaiju tattoos or anything like that, but certainly a love of and appreciation for kaiju was built in. Later, I became a film critic, and part of doing that job was learning the history of various types of films. For example, in terms of kaiju films, understanding what they came out of and why they are part of the Japanese psyche.  First is that kid-level where you’re just like, “Big monsters stomping Tokyo!” And then later, when you realize that as kitschy and pop culture-y as they are, they really do reflect the concerns and even fears of the people who made them. And that, oddly enough, is something that’s going on in The Kaiju Preservation Society as well, because I was writing it at the tail end of the Trump years. I started it the week after the Trump years ended, and it’s in many ways my reflection of what was going on in that time and the stresses that I had and how they manifested themselves into the book. A popcorn book, a pop culture book, but at the same time, all that stuff is there for someone who wants to look at it.  How do you feel about the revitalization of kaiju culture, with big-production movies coming out?  Everybody loves a monster movie. And whether or not one likes the American kaiju movies, certainly the production values are fun. I remember the 2014 Godzilla that Gareth Edwards directed, and although Godzilla looked like a chunky bear with spikes on the back, the whole thing just looked really, really cool. I think that’s a part of it. But the other thing is that the major movie studios are looking for franchises. They know that to get people out into the movie theaters, or at least before COVID, all the movies have to be big; all the movies have to be of a certain caliber. And what is going to be easier to make big than a kaiju movie? They already start big, so you can build from there. So, it makes perfect sense to me. Of course, they’re going to do a kaiju universe and franchise, it is literally what movie studios do, that is how they make their money now. They never went away because everyone always loves big monsters, but then it makes perfect sense that they are literally the right size for commercial cinema today.  I think you’ve touched on this a little bit, but what was the initial inspiration for this book, and how did it develop?  The book happened by accident. In 2020, I was writing a completely different novel. And the way that I described it to people was “Das Boot in space”—it was dark, it was gritty, it had political overtones, it wasn’t necessarily going to have a happy ending.  2020 was a really bad year to write a dark, moody, gritty political thriller in space where it might not have a happy ending. I kept sitting down to write, and I literally just couldn’t. I would write chapters, entire chapters—I wrote tens of thousands of words—and individual sentences were great, paragraphs were fine, chapters were okay; none of it hung together as a book.  Finally, it just got to the point where I couldn’t do it anymore. It was stressing me the fuck out, and then of course January 6th happened. I finally had to say to Patrick Nielsen Hayden, “I can’t write this novel.” Patrick was like, “It’s fine, we’ve all lived through 2020, we understand.” He was funny about it because he was like, “Yes, even though it’s on the schedule, and we’ve already started artwork for the cover, fine, whatever.” But I just literally couldn’t finish it, I was stressed out.  So, he gave me permission not to do it, he said, “We will figure it out. We’ll figure it out.” And I was all of a sudden like, “Thank God I don’t have to do this book anymore. I don’t know what I’m going to do now, but I’m not going to do this book.” I went to take a shower, and while in there, my brain was like, “Oh hey, now that you’re not doing this thing that’s stressing you out anymore—that book that you couldn’t write anyway—I’ve been thinking about this completely different book while you weren’t paying attention. And here it is.”  Literally all of The Kaiju Preservation Society just downloaded into my brain. I was standing there in the shower going, “Holy shit,” because I knew instantly that I could write this book. I toweled off, and I got back on email to Patrick, and I was like, “Okay, remember how I was going to write you a book? Give me six weeks.” And that’s really what happened, it was just, my brain somehow was thinking about kaiju when I wasn’t paying attention to it. I started writing it basically the next day, finished it in five weeks, and it was done. I wasn’t thinking about kaiju in any particular sense, but at some point, my brain went, “Kaiju Preservation Society!” and then like a supersaturated solution coalescing around a bead, the whole thing came together.  I was super relieved and could actually hit my deadline. Now as it turns out, they moved it from October last year to March this year because I think they looked at 2021, and they were like, “We think October’s going to be an issue,” which they were right, because we had paper supply issues, and we still weren’t able to tour. So, they moved it six months into March, and I think that that’s going to be a much better time for this book.  I saw that this novel was referred to as a “standalone.” Do you feel like you actually might follow it up if it hits sales levels, or is it really something that you’re done with, you want to move on, you have other things you want to do?  With the exception of The Interdependency series, which was The Collapsing Empire, every series that I’ve ever done started off as a standalone. Basically, they sell a certain amount and then Patrick comes to me and says, “Hey, you know, if you want to write another one of those, we would not be averse to selling that.” A lot of it will just depend on what the sales numbers are. I’m not opposed, I don’t really have a second chapter in my brain yet. We’ve sold it for television, and the first book obviously kind of fits into about one season. Then the question becomes, what do they do for a second season? And since I’m involved with that anyway, if we are at the point where they’re like, “We’ll need to do a second season,” I’ll be like, “Well, I guess I have to write something else as well.”  I never say never, but it’s also, quite frankly—with the exception of that one series—I never come into anything thinking, “Oh, well now it’s going to be this great big universe that I will repeat over and over again.” A lot of it just comes down to, do people like it or not?  What are some of your favorite cool science-fictional ideas that you put in the book, and are there cool science-fictional ideas or bits of research that didn’t make it into the book?  If you are going to posit giant monsters, you have to at least wave in the direction of probability, because leaving aside the movies, and God knows I love a Godzilla movie, but the physics of Godzilla are all wrong. Godzilla should be this big pile of goo, it’s just too big, right? And because I know that, and because that’s a thing that I’m aware that I know, I have to actually explain it away. I had to create this whole biology of kaiju.  Knowing the square-cube law, knowing the energy requirements of something that large, knowing everything else we know. So, I worked backward in terms of research in the science-fictional aspect of it to build an alternate Earth where these things would be possible. And I don’t want to give everything away, obviously read the book, but one of the things that’s important is that this other Earth basically has the same oxygen content in its atmosphere as in dinosaur days, or pre-Cambrian days, where the oxygen level’s something like thirty percent. When you have those conditions, you have a thicker atmosphere, it’s more oxygenated, things can be larger. You also have a huge issue of things catching fire really quickly because you have more oxygen, so how does that affect the biology of the forests and everything else? You have to consider the entire ecosystem and build from there.  Every creature has its own ecosystem, humans have an ecosystem, we have mites that live in our faces that come out at night when we sleep, what the fuck? But they’re just part of our bodies. Animals out in the world, they all have things that are either parasites, or they have commensal relationships, or all these sorts of things. So, you start thinking, what does a kaiju parasite look like? How does it work? I’m not spending chapters talking about the ecosystem of kaiju. But the ecosystem of the kaiju is important for the story, so you have to at least acknowledge it.  There is a lot of worldbuilding in the book, but the whole point of the worldbuilding is not to show off the worldbuilding. The whole point of the worldbuilding is to give the story a plausible structure so that when someone is reading it, no matter where they swivel their imaginary head in the world, it’s all covered. They don’t see the gaps, they don’t see the seams, they don’t see the parts where it’s like, “I’ll just fix that later.” I filled it out sufficiently so that everything they see makes sense.  In terms of research, the thing that was really fun to do was not necessarily the kaiju stuff, although that was super fun, but the fact is this book was taking place more or less in real time. I wrote it between the beginning of February 2021 and March 20th, 2021. Literally the day that the book ends, it was the day that I finished the book. I didn’t really intend for that to happen, it just happened to work out that way, but what that meant was, for example, I have a scene where the characters get on a plane and fly somewhere. Since they’re flying on a specific day, I went to the Internet, and I looked at what the temperature was at the time the flight arrived, because it’s a real flight that really goes to that particular destination at a certain time. I knew when sunrise was, what the temperature was, what the weather outlook was, and if someone who reads it was at that destination, they would be like, “Oh my God, this is exactly what the weather was like on this particular day.”  And this is the sort of shit that literally nobody will know about, unless obviously I talk about it. It was really important for me to just have that information, because the one person who has been on that particular flight to that particular place will be like, “Holy shit, he did his research.” Yes, I did.  People have talked about how this book is the sort of satiric, sociopolitical commentary that they expect from John Scalzi. Are there things about this book that you think may surprise some of your readers?  I think there are two John Scalzis in the way that people see me, and sometimes they get mixed. There’s the John Scalzi who writes on Whatever, has been a newspaper columnist, who is on social media, all that sort of stuff, and then there’s the John Scalzi who’s the science fiction writer.  The John Scalzi who’s the science fiction writer usually doesn’t have commentary on the world today, because most of his stuff takes place a couple hundred years in the future, or fifteen hundred years in the future, and mapping the one-to-one on that is just not going to work, it’s just going to throw people out. The politics of The Interdependency are not exactly the politics of the world of the 2010s. Even if it’s obviously a commentary about climate change or about the hesitancy of people to confront pressing issues until it’s too late. But those are overarching themes as opposed to specifics that are relating to politics or whatever.  Alternatively, John Scalzi on Twitter going, “Motherfuckers, what are you doing?” There is an actual division of those two, generally speaking. But this book takes place in COVID times, it goes from March of 2020 to March of 2021. You cannot write about that specific span of time, from the point of view of an American—because Jamie is an American—and not touch on politics, not touch on the national response to COVID, not touch on the issues of who we as a nation were in that moment. In many ways, although it is an escapist novel and most of it takes place on an alternate Earth, you still can’t escape the politics of the day. And I don’t try to. There is a particular point of view. Everybody who is part of the Kaiju Preservation Society has a doctorate. They’re academics, they are a very specific type of person. What are these specific types of people like?  We know they’re going to be socially tolerant, we know that they’re going to probably have a specific political bent, even if they’re government workers, so they are going to reflect the type of people they are. They’re all sort of earthy-crunchy. It’s entirely possible that somebody will look at this and be like, “Finally, we’ve got him! We can prove he’s a commie with this!” Yeah, you’ve got me. Because these characters are these people, and you have to write these characters honestly.  If I were writing a novel that was from the point of view of the military in the same time span, the military, again, comprised of many, many people, but the military is generally conservative. It would be weird of me not to reflect that sort of ethos and that sort of mindset while I was writing those people. These people are academics and scientists, they edge in a different direction. I’m going to accurately reflect that. This is, in many ways, the most directly political novel that I’ve ever written, even though it’s not a political novel. It just exists in a time where everything is fucking political.  What was your favorite thing about writing the book, and what was the most challenging aspect of writing the book?  My favorite thing about writing it was that it was coming so easily, and it was just a joy to write. There was no challenge writing this book, and I don’t mean that in a facetious sort of way. The whole plot dropped into my brain; I’ve never had it happen just that completely. The final form of it was incredibly close to the version of it that was first in my brain. After a year of trying to get this other novel out and having such difficulty and almost basically torturing myself about this thing, and not being able to make it happen—I failed at writing a novel. You have one job, John Scalzi, and you fucked it up.  Just to have this all of a sudden be so easy, it was an incredible relief. I wasn’t having impostor syndrome or anything, I know that I can write a novel. But the weight of the last four years finally got to me, and something just snapped. To be able to bang this out in five weeks and that it did everything I wanted it to, and it was exactly what I wanted it to be, and just hit that mark perfectly, it was like, “Holy shit, this is the best thing ever, can all my novels be like this, please?”  I’m not saying this is a perfect novel, I’m not saying it is the best novel I’ve ever written, but it is exactly what I had in my brain. There’s always that disconnect in the writer’s brain, between what’s in the writer’s head and what actually ends up on the page. And usually that’s perfectly fine, because what we have in our head is not as completely formed as we all think it is. It’s just in our brain we get to buff out all the things that are thorny or problematic or that we didn’t think through, so it’s perfect in our brains. And in writing the thing actually takes shape. But to have that straight download was amazing. If I never get to have it happen again, at least I had it happen once.  Is part of what contributes to that ease of production the fact that you have put together a certain number of novels, and you probably have a baseline sense of plot and story and so on, which newer authors might not have developed yet?  Well, yeah, I mean, I’ve been a professional writer for thirty years. If I couldn’t write at this point, there would be a problem. But I would want to be able to say yes, of course, obviously all these things mean that I can put these puzzle pieces together easily. And yet in 2020, they were failing me one hundred percent. There’s that old saying, it’s attributed to Gene Wolfe by way of Neil Gaiman, which is, the thing writing a novel teaches you is how to write that novel. Which is great, but then you have to write the next novel. I do not have a problem writing novels, and I have enough built into my brain that I can, generally speaking, write them quickly, write them cleanly, write them with a minimum of needing to go back and edit, and that has saved my bacon a number of times.  This time, where I had the book to finish, but specifically in the case of The Consuming Fire, which was the second book in The Interdependency series, I literally wrote that thing in two weeks because I had gotten to the point—just so many other things were going on in my life that at one point I looked up, and I’m like, “Oh, the book’s due in two weeks. Oh . . . Oh. It’s due in two weeks.” And I had to write eight thousand words a day to get it out. That was when all the prior experience helped: I basically went into autopilot and was able to do that. I’d been thinking about the book for a long time, so the individual aspects of the book were in my head, so it was typing rather than writing, so to speak. But again, the experience was there. I’ve written, what, fifteen or sixteen novels at this point. Knowing how to write a novel has been helpful. But each individual novel is a challenge, and sometimes it doesn’t work.  Sometimes you have to accept that no matter what you know, no matter how good you are, you’re just going to have challenges. Sometimes your brain will fail you, sometimes your muscle memory will fail you, sometimes your ability to do all the things that you thought you knew how to do will fail you, because the world is weighing on you. Perhaps it’s not the story you were meant to tell at this particular time, perhaps there’s something going on in your personal life that distracts you. Any number of things, and when that happens, you don’t want to panic about it. You have to pay attention to it, but the thing that I think saved me to some extent was that I wasn’t thinking of it as a referendum on me as a writer in a larger sense. It was not, “Why can’t I write?” It was, “Why can’t I write this fucking novel?” And the sunk cost fallacy of, do I keep doing this because I’ve already put so much time into it?  When I finally let that particular novel go, that’s when this other novel came to fill that space, and immediately hit on all cylinders. Sometimes you do just have to give up. I worked on writing this book for a year, couldn’t make it work—okay, off it goes, let’s try something else. But at no point was I like, “I suck, I’m a horrible writer.”  You said, “It’s not the best book I’ve ever written,” and I know it’s just one of those things that we say, but it made me curious, what for you is the best book you’ve ever written?  There’s lots of different ways to answer this. I was extremely happy with The Collapsing Empire, the first book in The Interdependency series, because it was the first time when I wrote a book where it turned out to be the book that I had intended to write when I started off. Most of the books that I write, I know where the ending is, I know where the beginning is, what’s in the middle is a little hazy to me, and often I’m very surprised how the story goes.  I’m one of those people who sits down to write, I don’t outline, I just make it up as I go along. A lot of times, a novel will be a very different novel from the novel that I started with. And it doesn’t mean that I’ve failed to produce the novel that I’m meant to write, it basically just means that I discovered the novel that this novel was meant to be, in the writing. And that’s kind of interesting and that’s fun and cool, but the nice thing about The Collapsing Empire is I knew what I wanted it to be, I got all of those things, and it was the first time that I felt that I was really super in control of my craft, to the point that it just unrolled exactly the way I intended it to. From a pure production point of view, that is the one I’m proudest of.  I think Redshirts is an extraordinarily good book because I don’t think people see how complicated it is. And again, that’s entirely intentional. But it’s a very fractal novel. It has the discussion of bit players being protagonists, and in the book the bit players are protagonists, but they’re not really bit players. And then you have the codas where the bit players in the novel have their own stories as well. And then there’s the tonal change between the primary book and the codas, and that people say, “Wow, that’s really discordant, it’s like they’re two separate things.” I’m like, no. No, one is the story and how you think it’s going to go, and the codas are the consequences, the real-life consequences of the story for the people who have lived it. I intentionally wrote some things poorly to mirror the idea that the story was being written poorly.  For example, one small thing that some people get, but a lot of people don’t: there’s a theory called the One Dave theory, that you can only have one character named Dave. If there’s more than one character named Dave, then a novel confuses people. And that’s also with names that end with the same letter, you can’t have more than one character with an “h” or an “f” or something like that.  In Redshirts, there are two or three characters with names that end with “h,” and I’ve seen people be like, “He should know better.” And the answer is, I do know better! Those are there for a reason. To call attention to what we understand about the construction of novels and commercial fiction, and so on. It’s not anything that most people are going to pick up, but it is something that, if you’ve read lots of novels, your brain knows that that’s not right. There should not be a Hester and a Hanson. And it’s like, “Why did you do that?” Because I’m messing with you. A lot of that just goes over people’s heads and that’s perfectly fine, but I know it’s there, and so I’m super proud of all the meta that is not just in the story but is also in the construction of that story.  I really like Zoe’s Tale because I wrote a character that I had absolutely no experience with, which was a sixteen-year-old girl. I’ve never been a sixteen-year-old girl, and the first few attempts at trying to write a sixteen-year-old girl were terrible. I had to work really hard to make a character that was outside of my life experience that seemed reasonable to people who had that life experience. I mean, I had a number of friends who were women read that character to tell me whether or not that character made sense as a young woman. That is the novel that I was proudest to get a Hugo nomination for. I knew I wasn’t going to win, because that year (2009)  I was up against Neil and Neal. But it was the one where it got nominated because people recognized that that character worked, and that was really important for me.  I feel like pacing is something that you’re just really good at. What for you is the trick to getting the pacing right for a book?  Ironically, I think the answer to that is that I was a film critic for years, and so one of the things that cinema has typically been really good at is pacing. I never intended to be a novelist. I was going to work in newspapers my entire life and maybe write opinion columns until I died, and then of course the world changed, and newspapers aren’t a thing that people get to do anymore, and I started writing novels mostly just to see if I could write them as opposed to having this deep inner need to share with the world my thoughts through novels.  I am in many ways an accidental novelist. I mean, I’ll take it. It’s a good job. Hours are great, you don’t have to wear pants, so I’m very happy with the way my life has gone. But I didn’t intend to be a novelist, and because I didn’t intend to be a novelist or to be a fiction writer primarily, even though I was obviously an avid reader and all that sort of stuff, I never read to look at the craft of it. I read newspaper columns to look at the craft of it. But when I became a film critic, I had to look at how story was built cinematically, and what worked and what didn’t, and when you review between two hundred and fifty and four hundred movies a year, story gets drilled into your head.  When I started writing novels, my structure and pacing was essentially cinematic in nature because that’s the type of story that was drilled into my head.. It’s kind of funny. Tor had bought Old Man’s War, or said that they wanted to buy it, and I said, “Yes, I want you to have it. Let me get an agent so that the agent can negotiate a deal.” And I started shopping around for an agent, and the agent that I finally got was Ethan Ellenberg. I sent him Old Man’s War and Agent to the Stars, which were the two novels that I had written at that point, and he was like, “These are really good. Did you write them as screenplays first?” Because they had that format. I don’t write specifically always in the three-act structure anymore like Old Man’s War. But the aspects of cinema, which are dialogue and pacing, transitions, all those things are still very much extant in my writing.  When you think about The Kaiju Preservation Society, what for you is important or special about this book? What is the heart of the story?  It’s an ensemble piece. We have Jamie as our point of view character, but it’s very clear that the Kaiju Preservation Society as a group within the book are tight-knit people. These are people that rely on each other. Our main four characters are people whose personalities are complementary, and I think it’s important at the heart of it that when it comes down to it, the things that they need to do in order to save the world are not things that they can do alone. They actually rely on each other for all the things that they have to do. And I think that that’s actually really important.  One of the hardest things about the last couple of years, honestly, is that our friendship groups were broken. Because we had to stay at home, we had to be away from people. Away from family, but also away from friends. In many ways, people who are in the science fiction community felt this strongly, in a specific way, because we converge, we come together at conventions, and we come together at book events. Particularly writers, our lives are so solitary, we spend most of our time just typing in front of a computer, and then for a weekend we bulk load friendship. To have two years where we just literally couldn’t see people? It’s been weird getting back to it, and people have basically . . . I’ve forgotten how to people, how to have those conversations, how to have those relationships.  I don’t think it was something I was conscious of when I was writing the book, but it was something I was conscious of after the book was written, that I was writing about a friend group, that they relied on each other, and that that was super important. That’s for me the thing that comes through at the end, it’s—I don’t want to say “the celebration of friendship!” because that sounds stupid and sort of hackneyed, but the fact that friends matter in this book, that the people matter, that what they are doing as a group matters, and that they commit to doing these things as a group because they can’t do it alone. It’s a book about big monsters, but at the heart of it is this friend group.  What else do you have coming up? What are you working on that people should know about?  The third installment of Dispatcher is going to be out later this year, they haven’t announced the specific date, but it’ll be in the third or fourth quarter of the year. The third volume of Love, Death & Robots is coming out, and my three robot characters, which originally had their first appearance in the Robots vs. Fairies anthology by Navah Wolfe and Dominik Parisien, they’re coming back for that. I’ve seen the video, and it’s hilarious. Not just saying it because I wrote it, but the way that it’s been animated and the personalities that the animators have put into the thing is just, it’s ridiculous, I am so happy with it.  I don’t know when that comes out, but it’s going to be out this year as well. We have a number of things in development: Kaiju is in development for television, Old Man’s War for Netflix, we have a couple of other things that we’re not announcing yet but hopefully will happen. On top of all of that, I am writing another novel, because we have however many novels left on that contract. I can’t talk about specifically the novel, but I can say that if people like Kaiju and the spirit of it and the feel and tone of it, hopefully this next novel will be something in that sort of same thing. I had so much fun writing it, when I talked to Patrick about what was next, I was like, “Can we keep this ball rolling?” And he was like, “Yeah, we should keep this ball rolling.” So hopefully we’ll keep this ball rolling. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nFriendship in the Time Of Kaiju: A Conversation with John Scalzi\nJohn Scalzi grew up in Southern California and went to school in Claremont. He graduated from the Webb School in 1987 and attended the University of Chicago, where he became editor-in-chief of The Chicago Maroon. He graduated in 1991 with a philosophy degree. He returned to California and worked as a film critic, then as a columnist for The Fresno Bee. He moved to Washington, DC to work for AOL as an in-house editor in 1996. In 1998, he became a full-time freelance writer, landing work for corporate clients as well as reviewing and writing fiction. Scalzi is also a well-known blogger, with a popular personal site called Whatever.\nScalzi’s first genre novel was Agent to the Stars, published on his website in 1999 and later in print in 2005. Old Man’s War followed and was published on his website in 2002. Found by Patrick Nielsen Hayden, he purchased it for Tor after reading, and the novel came out in print in 2005. It landed a 2006 Hugo nomination, came very close to taking a Locus Award, and undoubtedly had something to do with his 2006 Astounding Award for Best New Writer win (then called the Campbell Award). Other novels set in the same universe include 2006 title The Ghost Brigades, The Last Colony in 2007, Zoe’s Tale in 2008 (which landed Norton and Hugo nominations), The Human Division in 2013, and The End of All Things in 2015.\nScalzi’s satirical work includes 2012 title Redshirts, which won a Hugo Award. Other novels include The Android’s Dream in 2006, Fuzzy Nation in 2011, and Lock In in 2015—which earned him a Campbell Memorial Award nomination.\n2015 was the kind of year most authors dream about: John Scalzi announced the signing of a ten-year thirteen-book contract with Tor for $3.4 million, comprising ten adult and three YA novels, beginning with 2017’s The Collapsing Empire (book one of The Interdependency series).\nSince landing those 2006 accolades, Scalzi has consistently appeared on awards ballots for various works. Wins include Locus Awards, Hugo Awards, and a Dragon Award for The Last Emperox (book three of The Interdependency); he’s even received international honors, such as two Seiun Awards and a Kurd Lasswitz Prize.\nAmong many, many other writing gigs, Scalzi was creative consultant for the Stargate Universe television series and a writer for video game Midnight Star. He is executive producer for Old Man’s War and The Collapsing Empire, both currently in development for film/TV. He wrote five short stories that were adapted into episodes for Netflix series Love, Death & Robots.\nJohn Scalzi’s newest novel is The Kaiju Preservation Society, due from Tor on March 15, 2022.\nThe Kaiju Preservation Society has been well received so far. What do you think is the appeal for readers and fans?\nPretty much everybody can get from the title what this thing is meant to be. People know instantly whether they’re in or not. In that way, it’s very much like Redshirts was, and you knew from the title whether this was going to be something that interested you or not. I think the other thing is, coming off the last couple of years that we had, there has been an appetite for escapism. Something that is considered “popcorn” or however you want to describe it. It’ll be fun and there’s chewy stuff in there, but honestly, you’re not going to come out of it feeling a little bummed. There’s nothing wrong with really rich, complex worlds, and many authors are crafting them. They make for fantastic books, and they’re going to make for books that are going to be remembered ten or twenty years from now. I can’t guarantee you that The Kaiju Preservation Society is going to be remembered next year. That wasn’t the goal. The goal for this was simply, “I’m stressed, I’m this big ball of tension and confusion and tiredness. Take me away.” This is not a brooding symphony; this is a pop song. I think people are in the mood for a pop song.\nAre kaiju something that you’re into, did you grow up watching Godzilla?\nSome of my earliest memories of television are the Japanese kaiju movies. When I grew up in Los Angeles, I’d watch channel nine and channel eleven. They were independent stations at the time, and they would fill up their Saturday and Sunday afternoons with Japanese movies where these big monsters would stomp on things. When you’re seven or eight years old, and before the Star Wars era, all of it looked startlingly realistic. It was like, “This could be happening! What the hell’s going on in Japan, how do they live?” I think anybody who was my age growing up watching these things, it just sort of seeped into your bones.\nI also watched Ultraman, and sort of naturally slid into anime and manga. So, there was always that substratum there. I don’t have kaiju tattoos or anything like that, but certainly a love of and appreciation for kaiju was built in. Later, I became a film critic, and part of doing that job was learning the history of various types of films. For example, in terms of kaiju films, understanding what they came out of and why they are part of the Japanese psyche.\nFirst is that kid-level where you’re just like, “Big monsters stomping Tokyo!” And then later, when you realize that as kitschy and pop culture-y as they are, they really do reflect the concerns and even fears of the people who made them. And that, oddly enough, is something that’s going on in The Kaiju Preservation Society as well, because I was writing it at the tail end of the Trump years. I started it the week after the Trump years ended, and it’s in many ways my reflection of what was going on in that time and the stresses that I had and how they manifested themselves into the book. A popcorn book, a pop culture book, but at the same time, all that stuff is there for someone who wants to look at it.\nHow do you feel about the revitalization of kaiju culture, with big-production movies coming out?\nEverybody loves a monster movie. And whether or not one likes the American kaiju movies, certainly the production values are fun. I remember the 2014 Godzilla that Gareth Edwards directed, and although Godzilla looked like a chunky bear with spikes on the back, the whole thing just looked really, really cool. I think that’s a part of it. But the other thing is that the major movie studios are looking for franchises. They know that to get people out into the movie theaters, or at least before COVID, all the movies have to be big; all the movies have to be of a certain caliber. And what is going to be easier to make big than a kaiju movie? They already start big, so you can build from there. So, it makes perfect sense to me. Of course, they’re going to do a kaiju universe and franchise, it is literally what movie studios do, that is how they make their money now. They never went away because everyone always loves big monsters, but then it makes perfect sense that they are literally the right size for commercial cinema today.\nI think you’ve touched on this a little bit, but what was the initial inspiration for this book, and how did it develop?\nThe book happened by accident. In 2020, I was writing a completely different novel. And the way that I described it to people was “Das Boot in space”—it was dark, it was gritty, it had political overtones, it wasn’t necessarily going to have a happy ending.\n2020 was a really bad year to write a dark, moody, gritty political thriller in space where it might not have a happy ending. I kept sitting down to write, and I literally just couldn’t. I would write chapters, entire chapters—I wrote tens of thousands of words—and individual sentences were great, paragraphs were fine, chapters were okay; none of it hung together as a book.\nFinally, it just got to the point where I couldn’t do it anymore. It was stressing me the fuck out, and then of course January 6th happened. I finally had to say to Patrick Nielsen Hayden, “I can’t write this novel.” Patrick was like, “It’s fine, we’ve all lived through 2020, we understand.” He was funny about it because he was like, “Yes, even though it’s on the schedule, and we’ve already started artwork for the cover, fine, whatever.” But I just literally couldn’t finish it, I was stressed out.\nSo, he gave me permission not to do it, he said, “We will figure it out. We’ll figure it out.” And I was all of a sudden like, “Thank God I don’t have to do this book anymore. I don’t know what I’m going to do now, but I’m not going to do this book.” I went to take a shower, and while in there, my brain was like, “Oh hey, now that you’re not doing this thing that’s stressing you out anymore—that book that you couldn’t write anyway—I’ve been thinking about this completely different book while you weren’t paying attention. And here it is.”\nLiterally all of The Kaiju Preservation Society just downloaded into my brain. I was standing there in the shower going, “Holy shit,” because I knew instantly that I could write this book. I toweled off, and I got back on email to Patrick, and I was like, “Okay, remember how I was going to write you a book? Give me six weeks.” And that’s really what happened, it was just, my brain somehow was thinking about kaiju when I wasn’t paying attention to it. I started writing it basically the next day, finished it in five weeks, and it was done. I wasn’t thinking about kaiju in any particular sense, but at some point, my brain went, “Kaiju Preservation Society!” and then like a supersaturated solution coalescing around a bead, the whole thing came together.\nI was super relieved and could actually hit my deadline. Now as it turns out, they moved it from October last year to March this year because I think they looked at 2021, and they were like, “We think October’s going to be an issue,” which they were right, because we had paper supply issues, and we still weren’t able to tour. So, they moved it six months into March, and I think that that’s going to be a much better time for this book.\nI saw that this novel was referred to as a “standalone.” Do you feel like you actually might follow it up if it hits sales levels, or is it really something that you’re done with, you want to move on, you have other things you want to do?\nWith the exception of The Interdependency series, which was The Collapsing Empire, every series that I’ve ever done started off as a standalone. Basically, they sell a certain amount and then Patrick comes to me and says, “Hey, you know, if you want to write another one of those, we would not be averse to selling that.” A lot of it will just depend on what the sales numbers are. I’m not opposed, I don’t really have a second chapter in my brain yet. We’ve sold it for television, and the first book obviously kind of fits into about one season. Then the question becomes, what do they do for a second season? And since I’m involved with that anyway, if we are at the point where they’re like, “We’ll need to do a second season,” I’ll be like, “Well, I guess I have to write something else as well.”\nI never say never, but it’s also, quite frankly—with the exception of that one series—I never come into anything thinking, “Oh, well now it’s going to be this great big universe that I will repeat over and over again.” A lot of it just comes down to, do people like it or not?\nWhat are some of your favorite cool science-fictional ideas that you put in the book, and are there cool science-fictional ideas or bits of research that didn’t make it into the book?\nIf you are going to posit giant monsters, you have to at least wave in the direction of probability, because leaving aside the movies, and God knows I love a Godzilla movie, but the physics of Godzilla are all wrong. Godzilla should be this big pile of goo, it’s just too big, right? And because I know that, and because that’s a thing that I’m aware that I know, I have to actually explain it away. I had to create this whole biology of kaiju.\nKnowing the square-cube law, knowing the energy requirements of something that large, knowing everything else we know. So, I worked backward in terms of research in the science-fictional aspect of it to build an alternate Earth where these things would be possible. And I don’t want to give everything away, obviously read the book, but one of the things that’s important is that this other Earth basically has the same oxygen content in its atmosphere as in dinosaur days, or pre-Cambrian days, where the oxygen level’s something like thirty percent. When you have those conditions, you have a thicker atmosphere, it’s more oxygenated, things can be larger. You also have a huge issue of things catching fire really quickly because you have more oxygen, so how does that affect the biology of the forests and everything else? You have to consider the entire ecosystem and build from there.\nEvery creature has its own ecosystem, humans have an ecosystem, we have mites that live in our faces that come out at night when we sleep, what the fuck? But they’re just part of our bodies. Animals out in the world, they all have things that are either parasites, or they have commensal relationships, or all these sorts of things. So, you start thinking, what does a kaiju parasite look like? How does it work? I’m not spending chapters talking about the ecosystem of kaiju. But the ecosystem of the kaiju is important for the story, so you have to at least acknowledge it.\nThere is a lot of worldbuilding in the book, but the whole point of the worldbuilding is not to show off the worldbuilding. The whole point of the worldbuilding is to give the story a plausible structure so that when someone is reading it, no matter where they swivel their imaginary head in the world, it’s all covered. They don’t see the gaps, they don’t see the seams, they don’t see the parts where it’s like, “I’ll just fix that later.” I filled it out sufficiently so that everything they see makes sense.\nIn terms of research, the thing that was really fun to do was not necessarily the kaiju stuff, although that was super fun, but the fact is this book was taking place more or less in real time. I wrote it between the beginning of February 2021 and March 20th, 2021. Literally the day that the book ends, it was the day that I finished the book. I didn’t really intend for that to happen, it just happened to work out that way, but what that meant was, for example, I have a scene where the characters get on a plane and fly somewhere. Since they’re flying on a specific day, I went to the Internet, and I looked at what the temperature was at the time the flight arrived, because it’s a real flight that really goes to that particular destination at a certain time. I knew when sunrise was, what the temperature was, what the weather outlook was, and if someone who reads it was at that destination, they would be like, “Oh my God, this is exactly what the weather was like on this particular day.”\nAnd this is the sort of shit that literally nobody will know about, unless obviously I talk about it. It was really important for me to just have that information, because the one person who has been on that particular flight to that particular place will be like, “Holy shit, he did his research.” Yes, I did.\nPeople have talked about how this book is the sort of satiric, sociopolitical commentary that they expect from John Scalzi. Are there things about this book that you think may surprise some of your readers?\nI think there are two John Scalzis in the way that people see me, and sometimes they get mixed. There’s the John Scalzi who writes on Whatever, has been a newspaper columnist, who is on social media, all that sort of stuff, and then there’s the John Scalzi who’s the science fiction writer.\nThe John Scalzi who’s the science fiction writer usually doesn’t have commentary on the world today, because most of his stuff takes place a couple hundred years in the future, or fifteen hundred years in the future, and mapping the one-to-one on that is just not going to work, it’s just going to throw people out. The politics of The Interdependency are not exactly the politics of the world of the 2010s. Even if it’s obviously a commentary about climate change or about the hesitancy of people to confront pressing issues until it’s too late. But those are overarching themes as opposed to specifics that are relating to politics or whatever.\nAlternatively, John Scalzi on Twitter going, “Motherfuckers, what are you doing?” There is an actual division of those two, generally speaking. But this book takes place in COVID times, it goes from March of 2020 to March of 2021. You cannot write about that specific span of time, from the point of view of an American—because Jamie is an American—and not touch on politics, not touch on the national response to COVID, not touch on the issues of who we as a nation were in that moment. In many ways, although it is an escapist novel and most of it takes place on an alternate Earth, you still can’t escape the politics of the day. And I don’t try to. There is a particular point of view. Everybody who is part of the Kaiju Preservation Society has a doctorate. They’re academics, they are a very specific type of person. What are these specific types of people like?\nWe know they’re going to be socially tolerant, we know that they’re going to probably have a specific political bent, even if they’re government workers, so they are going to reflect the type of people they are. They’re all sort of earthy-crunchy. It’s entirely possible that somebody will look at this and be like, “Finally, we’ve got him! We can prove he’s a commie with this!” Yeah, you’ve got me. Because these characters are these people, and you have to write these characters honestly.\nIf I were writing a novel that was from the point of view of the military in the same time span, the military, again, comprised of many, many people, but the military is generally conservative. It would be weird of me not to reflect that sort of ethos and that sort of mindset while I was writing those people. These people are academics and scientists, they edge in a different direction. I’m going to accurately reflect that. This is, in many ways, the most directly political novel that I’ve ever written, even though it’s not a political novel. It just exists in a time where everything is fucking political.\nWhat was your favorite thing about writing the book, and what was the most challenging aspect of writing the book?\nMy favorite thing about writing it was that it was coming so easily, and it was just a joy to write. There was no challenge writing this book, and I don’t mean that in a facetious sort of way. The whole plot dropped into my brain; I’ve never had it happen just that completely. The final form of it was incredibly close to the version of it that was first in my brain. After a year of trying to get this other novel out and having such difficulty and almost basically torturing myself about this thing, and not being able to make it happen—I failed at writing a novel. You have one job, John Scalzi, and you fucked it up.\nJust to have this all of a sudden be so easy, it was an incredible relief. I wasn’t having impostor syndrome or anything, I know that I can write a novel. But the weight of the last four years finally got to me, and something just snapped. To be able to bang this out in five weeks and that it did everything I wanted it to, and it was exactly what I wanted it to be, and just hit that mark perfectly, it was like, “Holy shit, this is the best thing ever, can all my novels be like this, please?”\nI’m not saying this is a perfect novel, I’m not saying it is the best novel I’ve ever written, but it is exactly what I had in my brain. There’s always that disconnect in the writer’s brain, between what’s in the writer’s head and what actually ends up on the page. And usually that’s perfectly fine, because what we have in our head is not as completely formed as we all think it is. It’s just in our brain we get to buff out all the things that are thorny or problematic or that we didn’t think through, so it’s perfect in our brains. And in writing the thing actually takes shape. But to have that straight download was amazing. If I never get to have it happen again, at least I had it happen once.\nIs part of what contributes to that ease of production the fact that you have put together a certain number of novels, and you probably have a baseline sense of plot and story and so on, which newer authors might not have developed yet?\nWell, yeah, I mean, I’ve been a professional writer for thirty years. If I couldn’t write at this point, there would be a problem. But I would want to be able to say yes, of course, obviously all these things mean that I can put these puzzle pieces together easily. And yet in 2020, they were failing me one hundred percent. There’s that old saying, it’s attributed to Gene Wolfe by way of Neil Gaiman, which is, the thing writing a novel teaches you is how to write that novel. Which is great, but then you have to write the next novel. I do not have a problem writing novels, and I have enough built into my brain that I can, generally speaking, write them quickly, write them cleanly, write them with a minimum of needing to go back and edit, and that has saved my bacon a number of times.\nThis time, where I had the book to finish, but specifically in the case of The Consuming Fire, which was the second book in The Interdependency series, I literally wrote that thing in two weeks because I had gotten to the point—just so many other things were going on in my life that at one point I looked up, and I’m like, “Oh, the book’s due in two weeks. Oh . . . Oh. It’s due in two weeks.” And I had to write eight thousand words a day to get it out. That was when all the prior experience helped: I basically went into autopilot and was able to do that. I’d been thinking about the book for a long time, so the individual aspects of the book were in my head, so it was typing rather than writing, so to speak. But again, the experience was there. I’ve written, what, fifteen or sixteen novels at this point. Knowing how to write a novel has been helpful. But each individual novel is a challenge, and sometimes it doesn’t work.\nSometimes you have to accept that no matter what you know, no matter how good you are, you’re just going to have challenges. Sometimes your brain will fail you, sometimes your muscle memory will fail you, sometimes your ability to do all the things that you thought you knew how to do will fail you, because the world is weighing on you. Perhaps it’s not the story you were meant to tell at this particular time, perhaps there’s something going on in your personal life that distracts you. Any number of things, and when that happens, you don’t want to panic about it. You have to pay attention to it, but the thing that I think saved me to some extent was that I wasn’t thinking of it as a referendum on me as a writer in a larger sense. It was not, “Why can’t I write?” It was, “Why can’t I write this fucking novel?” And the sunk cost fallacy of, do I keep doing this because I’ve already put so much time into it?\nWhen I finally let that particular novel go, that’s when this other novel came to fill that space, and immediately hit on all cylinders. Sometimes you do just have to give up. I worked on writing this book for a year, couldn’t make it work—okay, off it goes, let’s try something else. But at no point was I like, “I suck, I’m a horrible writer.”\nYou said, “It’s not the best book I’ve ever written,” and I know it’s just one of those things that we say, but it made me curious, what for you is the best book you’ve ever written?\nThere’s lots of different ways to answer this. I was extremely happy with The Collapsing Empire, the first book in The Interdependency series, because it was the first time when I wrote a book where it turned out to be the book that I had intended to write when I started off. Most of the books that I write, I know where the ending is, I know where the beginning is, what’s in the middle is a little hazy to me, and often I’m very surprised how the story goes.\nI’m one of those people who sits down to write, I don’t outline, I just make it up as I go along. A lot of times, a novel will be a very different novel from the novel that I started with. And it doesn’t mean that I’ve failed to produce the novel that I’m meant to write, it basically just means that I discovered the novel that this novel was meant to be, in the writing. And that’s kind of interesting and that’s fun and cool, but the nice thing about The Collapsing Empire is I knew what I wanted it to be, I got all of those things, and it was the first time that I felt that I was really super in control of my craft, to the point that it just unrolled exactly the way I intended it to. From a pure production point of view, that is the one I’m proudest of.\nI think Redshirts is an extraordinarily good book because I don’t think people see how complicated it is. And again, that’s entirely intentional. But it’s a very fractal novel. It has the discussion of bit players being protagonists, and in the book the bit players are protagonists, but they’re not really bit players. And then you have the codas where the bit players in the novel have their own stories as well. And then there’s the tonal change between the primary book and the codas, and that people say, “Wow, that’s really discordant, it’s like they’re two separate things.” I’m like, no. No, one is the story and how you think it’s going to go, and the codas are the consequences, the real-life consequences of the story for the people who have lived it. I intentionally wrote some things poorly to mirror the idea that the story was being written poorly.\nFor example, one small thing that some people get, but a lot of people don’t: there’s a theory called the One Dave theory, that you can only have one character named Dave. If there’s more than one character named Dave, then a novel confuses people. And that’s also with names that end with the same letter, you can’t have more than one character with an “h” or an “f” or something like that.\nIn Redshirts, there are two or three characters with names that end with “h,” and I’ve seen people be like, “He should know better.” And the answer is, I do know better! Those are there for a reason. To call attention to what we understand about the construction of novels and commercial fiction, and so on. It’s not anything that most people are going to pick up, but it is something that, if you’ve read lots of novels, your brain knows that that’s not right. There should not be a Hester and a Hanson. And it’s like, “Why did you do that?” Because I’m messing with you. A lot of that just goes over people’s heads and that’s perfectly fine, but I know it’s there, and so I’m super proud of all the meta that is not just in the story but is also in the construction of that story.\nI really like Zoe’s Tale because I wrote a character that I had absolutely no experience with, which was a sixteen-year-old girl. I’ve never been a sixteen-year-old girl, and the first few attempts at trying to write a sixteen-year-old girl were terrible. I had to work really hard to make a character that was outside of my life experience that seemed reasonable to people who had that life experience. I mean, I had a number of friends who were women read that character to tell me whether or not that character made sense as a young woman. That is the novel that I was proudest to get a Hugo nomination for. I knew I wasn’t going to win, because that year (2009)\nI was up against Neil and Neal. But it was the one where it got nominated because people recognized that that character worked, and that was really important for me.\nI feel like pacing is something that you’re just really good at. What for you is the trick to getting the pacing right for a book?\nIronically, I think the answer to that is that I was a film critic for years, and so one of the things that cinema has typically been really good at is pacing. I never intended to be a novelist. I was going to work in newspapers my entire life and maybe write opinion columns until I died, and then of course the world changed, and newspapers aren’t a thing that people get to do anymore, and I started writing novels mostly just to see if I could write them as opposed to having this deep inner need to share with the world my thoughts through novels.\nI am in many ways an accidental novelist. I mean, I’ll take it. It’s a good job. Hours are great, you don’t have to wear pants, so I’m very happy with the way my life has gone. But I didn’t intend to be a novelist, and because I didn’t intend to be a novelist or to be a fiction writer primarily, even though I was obviously an avid reader and all that sort of stuff, I never read to look at the craft of it. I read newspaper columns to look at the craft of it. But when I became a film critic, I had to look at how story was built cinematically, and what worked and what didn’t, and when you review between two hundred and fifty and four hundred movies a year, story gets drilled into your head.\nWhen I started writing novels, my structure and pacing was essentially cinematic in nature because that’s the type of story that was drilled into my head.. It’s kind of funny. Tor had bought Old Man’s War, or said that they wanted to buy it, and I said, “Yes, I want you to have it. Let me get an agent so that the agent can negotiate a deal.” And I started shopping around for an agent, and the agent that I finally got was Ethan Ellenberg. I sent him Old Man’s War and Agent to the Stars, which were the two novels that I had written at that point, and he was like, “These are really good. Did you write them as screenplays first?” Because they had that format. I don’t write specifically always in the three-act structure anymore like Old Man’s War. But the aspects of cinema, which are dialogue and pacing, transitions, all those things are still very much extant in my writing.\nWhen you think about The Kaiju Preservation Society, what for you is important or special about this book? What is the heart of the story?\nIt’s an ensemble piece. We have Jamie as our point of view character, but it’s very clear that the Kaiju Preservation Society as a group within the book are tight-knit people. These are people that rely on each other. Our main four characters are people whose personalities are complementary, and I think it’s important at the heart of it that when it comes down to it, the things that they need to do in order to save the world are not things that they can do alone. They actually rely on each other for all the things that they have to do. And I think that that’s actually really important.\nOne of the hardest things about the last couple of years, honestly, is that our friendship groups were broken. Because we had to stay at home, we had to be away from people. Away from family, but also away from friends. In many ways, people who are in the science fiction community felt this strongly, in a specific way, because we converge, we come together at conventions, and we come together at book events. Particularly writers, our lives are so solitary, we spend most of our time just typing in front of a computer, and then for a weekend we bulk load friendship. To have two years where we just literally couldn’t see people? It’s been weird getting back to it, and people have basically . . . I’ve forgotten how to people, how to have those conversations, how to have those relationships.\nI don’t think it was something I was conscious of when I was writing the book, but it was something I was conscious of after the book was written, that I was writing about a friend group, that they relied on each other, and that that was super important. That’s for me the thing that comes through at the end, it’s—I don’t want to say “the celebration of friendship!” because that sounds stupid and sort of hackneyed, but the fact that friends matter in this book, that the people matter, that what they are doing as a group matters, and that they commit to doing these things as a group because they can’t do it alone. It’s a book about big monsters, but at the heart of it is this friend group.\nWhat else do you have coming up? What are you working on that people should know about?\nThe third installment of Dispatcher is going to be out later this year, they haven’t announced the specific date, but it’ll be in the third or fourth quarter of the year. The third volume of Love, Death & Robots is coming out, and my three robot characters, which originally had their first appearance in the Robots vs. Fairies anthology by Navah Wolfe and Dominik Parisien, they’re coming back for that. I’ve seen the video, and it’s hilarious. Not just saying it because I wrote it, but the way that it’s been animated and the personalities that the animators have put into the thing is just, it’s ridiculous, I am so happy with it.\nI don’t know when that comes out, but it’s going to be out this year as well. We have a number of things in development: Kaiju is in development for television, Old Man’s War for Netflix, we have a couple of other things that we’re not announcing yet but hopefully will happen. On top of all of that, I am writing another novel, because we have however many novels left on that contract. I can’t talk about specifically the novel, but I can say that if people like Kaiju and the spirit of it and the feel and tone of it, hopefully this next novel will be something in that sort of same thing. I had so much fun writing it, when I talked to Patrick about what was next, I was like, “Can we keep this ball rolling?” And he was like, “Yeah, we should keep this ball rolling.” So hopefully we’ll keep this ball rolling.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/scalzi_interview_2022/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Friendship in the Time Of Kaiju: A Conversation with John Scalzi by Arley Sorg"}