{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "JY Yang", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6HJXNygsnNYSyBE7CZB82A7IA4g=", "id": null, "license": null, "comments": "", "raw_text": "5480 words, short story, REPRINT  Old Domes  Friday, midnight. A young woman pants in the field in front of the Old Supreme Court, doubled over, as though she has run a long way. She is covered in blood, and in her right hand glints a weapon.  Her name is Jing-Li, and she is a cullmaster of buildings. Of embodiments of brick and stone, locations expressed in forms that humans can deal with, difficult to perceive and even worse to understand. But she does not need understanding to do her job.  The job is in two halves. Two old buildings—pre-WWII colonial edicts, ancient by Singapore’s standards—are being repurposed for conservation, their insides ripped out and both buildings combined to become an art museum. The first to go: the City Hall, the senior building that was once the seat of Parliament, whose blood is now making its way down the woman’s arms in rivulets. (It is not real blood, and it will fade as soon as the shock of the deed has worn away.) That leaves her with the old Supreme Court on the right.  The old Supreme Court building: Child of the Great Depression, completed in 1939, constructed on the grave of the Grand Hotel de l’Europe, its predecessor in the sequence of colonial buildings that had stood there. Once it lorded over cricket players and rickshaw-pulling men with its massive dome and Ionian columns. It witnessed the Japanese troops marching in, and posed a dramatic backdrop to the first National Day Parade after Singapore’s Independence. These days it sits empty, dwarfed by the skyline fleshed by glass and with bones of steel.  Its time has come as well. That is why the cullmaster is here.  Jing-Li entered the old Supreme Court building by a side door, trying to ignore the wet on her hands. It was red, like real blood, and it triggered in her all the associations of fear and revulsion that mortal death entailed. She had not expected it: not the blood, not the soft thud of a body on masonry, not the shallow breaths drawing away to nothing.  None of her teachers had mentioned the hunt would feel like murdering a real person.  The City Hall had reminded Jing-Li of her grandfather, maybe that was why. Hair combed back, starched pressed shirt, glasses precisely set. Perhaps it was a figment of childhood, the archetype of the dutiful public servant instantly associated with a man who had died when she was ten and existed mostly through stories falling from her parents’ lips. If he had looked like someone else, maybe she might have felt less uncomfortable swinging the blade.  Who was she kidding?  She gripped her consecrated sword tightly, a cheap plastic thing bought at a sports store, usually sold to seniors taking recreational tai-chi. The air here tasted dusty. Jing-Li’s footsteps echoed through a warren of corridors until she entered the main entrance chamber, where the ceiling yawned open far above her head and moonlight poured in from the windows on the second floor. She took a deep breath and thought she smelled London.  London: the place where Jing-Li had gained her culling certification in her undergraduate years, taking a twisty bus route to a poorly-ventilated basement where she’d sit taking notes with a handful of other groundskeepers, young and old. She had been the only non-European there.  In her course application she had written cheerfully about the transient nature of Singapore’s geography, where buildings ten years old were considered aged. Surely a local, internationally-certified cullmaster would be invaluable.  After all, this was Singapore, where lacking anything else the land itself became the currency in which the nation was defined. A living corpus carved and recarved, hollowed by tunnels and multibasement carparks, its borders fed with the leftover rock and silicate. It was a young land, supple and stretchy, where maps a year old were outdated, their lines dancing a seismographic tango. Guardians here lived and died in droves.  Except that this was Jing-Li’s first hunt since she’d returned home a year ago, law degree in hand. It turned out that guardians here went away as easily as their physical selves did, connections weak as water. Young locations lacked staying power, and older ones were strangely compliant in fading away. This job, then, existed only because it was unique.  Jing-Li looked at her hands: the blood of the City Hall building was gone.  The old Supreme Court was waiting upstairs, she knew. She tried to muffle her footsteps on the curved staircase as much as possible, as though she could sneak up on it by surprise, like a sleeping animal. It was quiet here, even by the standards of deserted buildings, something stately about the way the air rested amongst the shapes of the masonry. She was very, very cautious.  “I’m here,” he said, the moment her foot touched the stones of the second floor. He was waiting against one of the balustrades that overlooked the first floor, arms folded much as she remembered from their first meeting. She was a child then, waiting for her father, and she had tugged on her mother’s sleeve to ask her about the “funny man in the hat.” Later she would seek out pictures of white men in Victorian garb to point out to her mother. Her first building guardian. Her mother had thought her imaginary friends cute.  The Supreme Court of today would have fit in perfectly in posher parts of the Central Business District. “You updated your look,” Jing-Li said.  His shrug seemed particularly dismissive. “In keeping with the times, you know.”  “The times have caught up to you. Do you know why I’m here?”  “You must think I’m an idiot.” He uncrossed his arms and stood straight. “I felt the other guy go too, the sorry bugger.”  “It can’t be helped,” Jing-Li said. They were nearly toe-to-toe now. Was he ever this tall and thin and white? “If it’s any consolation, you will be remembered.”  If there’s any consolation, she thought to herself, it’s that after this I’ll be done with the job. The sword felt heavy in her hands, as if it were actually made of metal. She raised it in the direction of the guardian, brought it downwards—  The guardian vanished a split second before contact, and she found herself swinging through empty air.  “Oh, kitten, it’s not that easy,” the Supreme Court said from behind her, and when she turned around he was sitting on the banister of the curved staircase with a Cheshire cat smile. Chest constricting, she lunged forward again, but like a clever insect he eluded her. When she regained her balance she found him back against his balustrade perch.  She took one step in his direction, and he froze her with a wag of his finger. “Ah-ah.” She did not move, scared of spooking him, scared that he would vanish once again.  “Look,” she said, as sincerely as she could through the heaviness in her chest, “I don’t like it either, but it has to be done. That’s the rules.”  He leaned vertical, hands slung easily in his pockets. “I don’t intend to give up this position. After all, the other chap is gone. Somebody needs to man this station. I’ve decided that it’s going to be me.”  The guardian Jing-Li remembered was a stern one, back ram-rod straight, features imposing: a presence that filled the room and commanded absolute attention. Perhaps that was when he still functioned as the nation’s highest court. “Sorry, but that can’t happen,” she said. “We’ve done the measurements and both existing guardians need to go. Another one will arise for the new art museum.” Not to mention that his proposal would be incredibly unfair to the former City Hall, who had seemed a much better candidate for representing the art museum if they had to pick one.  “Ah, but I put no stock in the calculations of your groundskeepers’ council. They use their own metrics, which are useless. There’s no correspondence with a global standard.”  The global standards had been scrapped a decade ago, exactly because they mapped poorly across the globe. These days different towns, different regions, different countries used self-calibrated standards, whatever worked best for them.  Jing-Li felt like pointing this out, but she did not. Somehow, she knew it would be like shouting at walls. Perhaps it was.  “You’re out of luck,” the City Hall said. “I intend to stay.” She looked at him, standing resolute in his place, solid as one of the columns that made up the building’s façade, and could not argue. He had beautifully blue eyes, movie-star eyes, which crinkled at the edges before he disappeared. “Don’t think of summoning me,” his disembodied voice said, by way of parting. “It won’t work.”  Jing-Li didn’t try. It took her several minutes after she exited the building before she realized she was shaking.  Monday, midday. The young woman, neat and dressed in what is generally accepted to be common office wear, trails a large group of people following a guide leading the way through the City Hall and former Supreme Court buildings. The group consists of civil servants who volunteered to help in the open house taking place in a month’s time, and are dressed accordingly. Run by the staff of the museum that has taken over administration of the two buildings, the open house will, for the first and the last time, allow the public into spaces previously reserved for the highest offices in the country. License to gawk and to touch, before the diggers and bulldozers move in to do their reconstructive surgery. Some of the group take notes as the guide points out key features and historical nuggets: this will be crucial information in a few weeks’ time when they too will become guides, this time to an adoring public eager to soak up the storied narratives contained within the buildings.  The young woman does not take notes. She merely follows, unnoticed.  The guide, with a knowing smile, leads the group away from the prescribed tour route, up to the roof where the iconic dome sits. The group loses flock coherence, running to various edges to take photographs, taking on the appearance of guppies in a tank. A large number of them gather at the front edge of the building, the only one not obscured by towering modern-day buildings. Eager hands point outwards, gesturing over the expanse of the Padang that lies, treeless and manicured, in front of former Supreme Court. It’s the first time any of them have seen it from this angle, and, artificial as it is they find it a wonder.  The young woman stays quietly in the shade of the dome, waiting for them to leave so that she can be alone with the one man on the roof no one else can see.  Across the length of the roof from her, the former Supreme Court watches her silently, expression inscrutable to bystanders.  The last straggler of the group vanished downwards with a clatter, and Jing-Li finally let herself relax. The ability to stay invisible in the confines of a building was entirely dependent on the sufferance of its guardian, and she hadn’t been sure the former Supreme Court would be so kind to its assigned executioner. She watched carefully as he strolled across the expanse of the roof, analyzing the way he took each step (with confidence), the way his hips swayed (hint of mischief).  “I’m not here to finish the job,” she said, hands held up. “See, I didn’t bring the weapon.”  The former Supreme Court laughed. “I know,” he said. “Or you would not have made it this far.” As her hands went to her hips in protest, and he said: “This building still has working fire alarms.”  “Fire alarms can’t keep me out forever.”  “If I have my way I won’t have to keep you out.”  She reached her envelope bag and pulled out a small sealed packet of brown paper, which she offered to him. “Courtesy of the groundskeepers’ association,” she said. “I ran into a senior on the way here and he thought it might be helpful in getting into your good books.” Devon, according to his own account, had conveniently been on his way to buy something nearby and had just happened to bump into her in the two hundred meters between her workplace and the former Supreme Court building. Singapore was small, but not that small—Jing-Li wasn’t stupid. The association was getting impatient.  The former Supreme Court wrinkled his nose. “Bribery will get you nowhere.”  She returned the packet to her bag. “You don’t like sweets anyway. You’d prefer a nice rat or some other small dead animal, right?”  “You know me well.” He sounded pleased.  “I’ve done my research.”  She had done more than that. Like anyone with an ounce of self-respect she had gone home and dug into difficult guardian culls, carefully populating her browser with pages from countries bearing historic architecture, where the encrusted hearts of cities pulsed in medieval nerve centers laid over and over by infrastructural palimpsest. Places where guardians clung deeply and stubbornly to their location, fed by nostalgia and notions of heritage. She had come out of that tangle discouraged and confused: every story had different tips on how to get stubborn guardians to give up their guardianship, and most of them were quite location-specific. Her one takeaway was that she was on her own, and therefore in deep shit.  Urgency itched under her skin, in her chest, like hungry parasites. Earlier this week the groundkeepers’ association had sent an email: “This is not a game. If we knew you were going to mess around, we would have hired someone to actually do the job.” She wondered if they understood that the last time in recorded history an unwilling guardian had been culled, hundreds of deaths had resulted from a building collapse.  “I don’t like it,” the former Supreme Court said suddenly, leaning over the roof ledge, eyes fixed on the green of the Padang stretched before them.  “What?” The Padang outranked the Supreme Court in age and they had no history of animosity that she could recall. A few years ago the Padang had gone underground, not long after the National Day parades had moved to the Marina Bay floating platform. It had not been seen since then. “You don’t like what?”  She followed his gaze. The Padang, hemmed in around all sides by temporary light fixtures, had a festive air about it. Banners hung by the streetlights explained why: the Formula One races dropped in on Singapore for their yearly call-by in two weeks’ time, and the roads around the Padang became part of a racetrack in their honor.  “The Marina Bay Street Circuit,” she said. “You don’t like him?”  “He’s a brat,” the former Supreme Court said with finality, as though passing a sentence on the ephemeral entity that only existed for less than a week each year. “Guardians shouldn’t be allowed to come and go. It’s unnatural.”  Jing-Li followed him in leaning over the ledge, hands on her chin. “You mean places shouldn’t be allowed to come and go. But it happens all the time.” He turned to interrupt her and she cut him off. “If you’re talking about naturalness, none of this is natural. Your existence is entirely man-made, you know. You live on our sufferance.”  “If you wanted to get into my good books, you’re doing a terrible job of it.”  Jing-Li blew out a short breath through her nose. Despite the roar of passing cars, in some other part of the city close by, Singapore seemed quiet, too quiet. “I’m just being honest.”  Arms folded, gazing out across the green of the silent Padang, the former Supreme Court said nothing. Jing-Li continued: “If you have such problems with transient guardians how are you going to cope with the construction site deity for the next two years?”  Now he did look at her. “Is that your concession that you’ve stopped trying to cull me?”  “I’m serious,” Jing-Li said. “Accidents at worksites will happen if the construction deity is disturbed. You could get people killed.” In case he didn’t understand the ramifications of that, she added, “Humans will die on your watch.”  “I’m not obliged to keep humans alive,” he said.  “You don’t believe that, and I know that because you’re not a rogue guardian. Just a really stubborn one.”  His laugh was soft, burbling, like the sound of engines. “I’m perhaps the most fortunate, to have you chosen as my executioner.”  “Chosen,” Jing-Li says under her breath, and he doesn’t hear.  “I can’t think of any of your other compatriots who’s known me since childhood. Daughter of a judge . . . ” He looked at her, almost fondly, and Jing-Li stepped back a little from him. “And you’re a lawyer now, working just a few buildings down the road.”  “Okay, sure.”  He tossed something at her and she barely caught it. When she opened her palm she was confronted with something small and copper and intricately carved. “A coin?”  “Not just any coin. That’s a Straits Settlement coin.”  She turned it over and over in her fingers. It felt odd, strangely solid. “Where did you get it?”  “There is a time capsule buried under the flagstone of the main court. Nothing much to it, just a few coins and the day’s papers. But they’ll open it in the year 3000. I suppose they won’t miss one little coin.”  “The year 3000,” Jing-Li said. It sounded like the title of a sci-fi movie, something Arthur C. Clarke might have written.  “I’d like to be there when they do that.”  “In the year 3000.”  “Yes.”  “That’s nine hundred years in the future.” She held the coin out to him. “You have a lot of faith, don’t you?”  “Keep the coin,” he said, still looking outwards. “Consider it a gift.”  And then he was gone.  Sunday, mid-morning. The air thrums with life and the city is busy, consumed in festival-madness. Roads are closed and speakers pop as sound technicians take them through their paces. A hundred thousand people bustle, working themselves up to the frenzy that will take place when the sun sets. In their pens, at the hub of it all, the race cars that will be the stars of the night’s festivities sleep fitfully. Anticipation feels like a breathable, drinkable thing.  Within the madness-in-waiting sits a young woman in a big metal swing set on top of the hill that used to be a fort. Cross-legged quietude surrounds her and the plastic sword resting by her side. Eyes shut, she leans into the movement of the swing, back and forth, back and forth.  Two weeks have passed since she met the former Supreme Court on the roof of the building, and the groundbreaking ceremony is less than a month away. She is no closer to solving her problem. Despite her appearance of immobility her fingers twitch over the coin she holds loosely in her right hand, in her lap.  She whispers to herself, whether consciously or unconsciously, it’s hard to tell. It is also hard to hear what she is saying, but it sounds like a prayer.  And then a guardian, whom she thought was dead, appears on the swing beside her.  Jing-Li sprang into alertness at the unexpected presence beside her, even if the swing continued its back-and-forth unperturbed. Her heart tapped a funny rhythm as she realized who it was. “But you’re supposed to be gone.”  “Yes, I am gone,” said the guardian who used to be the City Hall building. “I’m not connected to my old place anymore.”  “You’re supposed to disappear,” Jing-Li said, as if her first sentence hadn’t been clear. “Once a guardian has been disconnected from their location they lose the energy from the place that fed them.”  The former City Hall building laughed and shrugged, somehow avuncular when he did so. “That’s what they told you in school, right? But I guess it’s not true. I spend my days here now, here and there. Talking to my friends.” He gestured in the direction of a spreading banyan tree nearby, its hanging roots like sturdy beams.  Jing-Li could not see who he was gesturing to, and she guessed it was a tree spirit, because she had problems seeing them. “But the blood,” she said, still refusing to believe this was happening. “The falling over, the vanishing, what was all of that? Were you trying to make me feel bad? What?”  He crossed his legs and leaned back in the chair. He looked like her grandfather, but in demeanor he reminded her of her primary school Chinese language teacher. “I always thought that groundskeepers should appreciate the responsibilities they hold.”  Jing-Li let her hands drop into her lap. “You think I don’t? Like I don’t understand the consequences of my actions? You think I’m doing this just for fun?”  The former City Hall building said nothing, attention caught by something on the metal grating that formed the floor of the swing. He leaned over and picked it up: it was the coin she had been holding. “Wow, haven’t seen this in a long time.” He flipped it back and forth. “Did he give it to you?”  When she nodded, he handed it to her. “Typical of him,” he said.  “Emotional manipulation?” She flipped the coin back and forth in her fingers. “Like falling over in an explosion of blood wasn’t?” Her hand closed around the coin, hard enough to press into the skin. “Yours was the first cull I’d ever done and I was so scared I couldn’t do the next one. And I still can’t.”  “Are you scared?” He looked at her. “Or is it something else?”  Jing-Li put her feet down and the movement stopped the swing’s momentum. Crickets sang in the greenery as she thought over the question carefully. Finally, she said: “No, probably not. I won’t let fear get in the way. It’s that he doesn’t want to go, and I don’t know how to convince him to. Because . . . ” She gestured in no particular direction. “It’s a horrible thing. I can’t blame him for not wanting to go through with it.”  “Horrible?” The former City Hall huffed. “We are not humans, you know. It’s not about life or death, it’s about moving on, about becoming different. It’s natural.” He tapped her on the shoulder, in a teacherly way. “You remember your classes, when they taught you about culling? What did they say?”  “A lot of mumbo-jumbo, most of it was not relevant to Singapore, anyway. Most of it was how to give pep talks about heritage and changing perceptions and how things never really go away. What kind of heritage does Singapore have? Even our national symbols are invented.”  The former City Hall just smiled.  Silence settled, uncomfortably, and Jing-Li remembered she had been carrying around the small sacrifice packet from the groundskeepers’ association ever since the former Supreme Court refused it. She found it at the bottom of her bag, slightly squashed and with a worn corner, but still sealed. “This talk is getting us nowhere, so you might as well have some of this.”  “Oh, thank you,” he said, accepting it and breaking the packet’s little paper seal. “I won’t be getting these much anymore, I suppose.” He dug in with his fingers and pulled out one of those soft, pink-and-white candies coated in powder that Jing-Li had no name for. “This is very good,” he said, and then held the packet out, across to the swing’s other bench. “You should try one.”  Jing-Li blinked. Seated across them, where there had been no one a moment ago, was a young Malay man in formal wear. A guardian, she realized, but one she did not recognize. “I live here,” he said simply, probably in response to her facial expression.  “But you’re not Fort Canning,” Jing-Li said. The Fort Canning was a moody-looking teenager whom she often found perched on the old display cannons scattered around the park, smoking. He had been in place for slightly more than thirty years, she was told.  “I’m the old dude,” he said, reaching into the bag that the former City Hall was holding out. “I’ve been here a long time. I used to be called Bukit Larangan. The Forbidden Hill, you know?”  “You’re the original hill,” she said, in slow wonder. “From the 14th century.”  “It’s been a bit longer than that.” He tasted the sweet, gingerly. “This is good. I don’t get many of them these days.”  “You’re still around,” she said. “After all these years.”  “It’s like he said. We stay around long after we’re gone.”  “See, history remembers us, in a certain way,” said the former City Hall.  “And do you remember history?” She leaned forward, her heart pounding, consumed by a sudden eagerness that she hadn’t felt since she was a very young schoolchild. She turned to the former Bukit Larangan. “Do you remember the 14th century?”  “Hmm.” He leaned back in the swing seat. “I cannot say. I remember what it was like, but I don’t really remember it. It was so long ago.”  She couldn’t understand. “But you were there. Weren’t you?”  He leaned backwards into the chair, completely calm. “Yes. But memory is quite difficult.” He pointed to a sign, one of many that were scattered around the park, packed with information written in four languages. “See that? That’s all anybody remembers. Some days I think of the old kings who used to live here, and I realize that I cannot remember their faces, or I only remember a very vague picture of them. Then I wonder if the Tumasik I remember is the same as it was back then.”  “You’ve told me stories,” said the former City Hall. “But I’m sure there was so much more.”  “Of course there was much more,” the former Bukit Larangan said. “But it’s all gone now. Singapore’s history started in 1819, that’s what the history books say, right?” He gestured at the signs. “That’s all that’s left. That’s who I became.”  Jing-Li shook her head. “But—”  “How much of Singapore’s history before the 19th century do you know?” The former City Hall asked.  “A sleepy fishing village,” she said softly. “That’s what they teach us at school.”  “No, it was a lot more than that,” said the former Bukit Larangan said. “But I don’t remember what it was anymore.”  She looked down at the sword in her lap and felt like she was falling outwards. The Straits Settlement coin resting in her hand had taken on immense weight and heat, like it was a burning coal.  “But you were there,” she repeated emptily to herself.  Sunday night. Halogen lights of unthinkable wattage sear the air, burning a bright orthogonal circuit into the cityscape, thousands of meters long. Thousands cram into rows of seats, specially erected for the weekend, while thousands more press against wire nettings at odd ends and corners of the circuit, as race cars streak past at 400kmh, blurs of screaming metal tracked by faithless, tireless cameras. The Padang, forcibly crowned with a strobe-lit stage, suffocates under the weight of a sweaty, screaming crowd, while above the city, people in air-conditioned restaurants and bars peer down at the blips of cars blazing, ant-like, around the track.  The young woman runs in the alley behind the former Supreme Court, sealed off to prevent people from getting close to the racetrack. The Marina Bay Street Circuit has given her grace to wander the grounds, even the areas deemed off-limits, but she has more pressing matters on her mind. Her target is the former Supreme Court.  For her, for the both of them, it has to end tonight.  Jing-Li ran up the grand steps of the former Supreme Court, her footsteps sending solid echoes reverberating. She knew where the guardian was, up on the roof where they’d last met. She was sweaty, and her heart raced from shoving through the clamoring, oblivious crowd, but none of that mattered.  The moment she burst out through the stairwell the guardian turned towards her from his spot at the edge of the roof, haloed by the stadium-strength lights surrounding the Padang. “I see you’ve come.”  “Don’t think of going anywhere,” she said, pulling the plastic sword from its plastic sheath, her voice and breathing harsh. Down on the road the F1 racers screeched and made popping noises as they slowed down for the corner turn, lending the scene the surreal soundtrack of an air raid.  “I would not dream of it,” he said, his voice carrying over the melee. “In fact, I was rather hoping to stay here for the long term.”  “No,” Jing-Li shouted, over the din. “You can’t. I’ve decided. That’s not how this country works. You served a purpose, that purpose is done, it’s time to move on. Your neighbor has done it. You’re no different.”  He looked a lot smaller than she seemed to recall, like a lost doll somebody left by the roadside. “But I am different. I thought you might think of me fondly, given your childhood. There’s such strong nostalgia . . . ”  “Nostalgia? Whose nostalgia? You can’t tell me what to be nostalgic about.” The thing that had been sitting uncomfortably in her chest since the first night she had taken up her sword came to a boil. “This building is being preserved. That’s a lot more than other past locations in Singapore have had.”  He ran his fingers over the worn stone surface of the roof’s edge. “This place has such memories . . . ”  “You have to believe me, I’m doing this for you.” She took bold steps towards him, and he didn’t move away. “Your memories will be rewritten, whether you like it or not. Our Government may like what you are. They like what you represented as the Supreme Court. They like the way you look on the television screens when Grand Prix is beamed to the world.”  She waved her sword accusingly at the racetrack. “But that’s all you’ll ever be, from now on. A pretty picture. A tourist attraction. They could have built something else to house the art museum. But they wanted to use your skin, because your skin is what they think is important.” She swung the sword back towards him. “Can you live with that? Can you live with becoming somebody else?”  He seemed to straighten up. “I used to be the Supreme Court,” he said, a glint of his former hardness returning to his expression. “Important decisions were made on my watch. What I did used to influence the entire nation.”  “And no one will change that for you,” she said. She thought of Bukit Larangan, its history faintly etched, fading into a few neat lines of the country’s official narrative. “You are so lucky and you don’t even know it.”  “Will you remember me, at least?”  “I’ll come over for tea,” she said. “There’s a swing set on top of Fort Canning that seats four. We can hang out with your former neighbor. And the old Forbidden Hill. We could talk about history, or anything you like. I’ll even bring a lizard for you, if you want.”  He smiled. She could barely see his blue eyes in the mad, harshly shadowed lighting. “I’m still right. I am still fortunate to have you as my executioner.”  “You had a good run,” Jing-Li said.  “Well. I won’t deny that.”  She did not blink as she brought the plastic blade down.  Sunday night. It has been a year since the groundbreaking ceremony, and the races are on again. The former Supreme Court stands, its form cloaked in netted black scaffolding on which its façade is projected. Its interior is a mess, gutted masonry like phoenix ash, but the millions around the globe watching the race live do not need to see that.  Across the track sits a grandstand, its rows packed with the chattering masses. They have paid well to be here, even if only for a brief time. Amongst their number one might pick out the shape of a young woman, her back straight, an unreadable smile on her face. From this distance you cannot tell, but she is turning and turning a small object in her hand, which appears to be a coin of some sort.  But she is only one face in the crowd, and as the camera pulls away she becomes invisible, part of the story no one sees.  The black box of the former Supreme Court, drenched in new light, remains impassive. Around it rise skyscrapers—shades of New York, shades of Abu Dhabi—that vanish into the night, the hands of a new city reaching ahead.    Originally published in We See a Different Frontier, edited by Fabio Fernandes and Djibril al-Ayad, 2013. JY Neon Yang (they/them) is queer, non-binary, and the author of the Tensorate series of novellas from Tor.Com Publishing (The Black Tides of Heaven, The Red Threads of Fortune, The Descent of Monsters, and The Ascent to Godhood). Their work has been shortlisted for the Hugo, Nebula, World Fantasy and Lambda Literary awards. A Clarion West alum, they graduated from the University of East Anglia with an MA in Creative Writing and currently live in Singapore.", "text": "5480 words, short story, REPRINT\nOld Domes\nFriday, midnight. A young woman pants in the field in front of the Old Supreme Court, doubled over, as though she has run a long way. She is covered in blood, and in her right hand glints a weapon.\nHer name is Jing-Li, and she is a cullmaster of buildings. Of embodiments of brick and stone, locations expressed in forms that humans can deal with, difficult to perceive and even worse to understand. But she does not need understanding to do her job.\nThe job is in two halves. Two old buildings—pre-WWII colonial edicts, ancient by Singapore’s standards—are being repurposed for conservation, their insides ripped out and both buildings combined to become an art museum. The first to go: the City Hall, the senior building that was once the seat of Parliament, whose blood is now making its way down the woman’s arms in rivulets. (It is not real blood, and it will fade as soon as the shock of the deed has worn away.) That leaves her with the old Supreme Court on the right.\nThe old Supreme Court building: Child of the Great Depression, completed in 1939, constructed on the grave of the Grand Hotel de l’Europe, its predecessor in the sequence of colonial buildings that had stood there. Once it lorded over cricket players and rickshaw-pulling men with its massive dome and Ionian columns. It witnessed the Japanese troops marching in, and posed a dramatic backdrop to the first National Day Parade after Singapore’s Independence. These days it sits empty, dwarfed by the skyline fleshed by glass and with bones of steel.\nIts time has come as well. That is why the cullmaster is here.\nJing-Li entered the old Supreme Court building by a side door, trying to ignore the wet on her hands. It was red, like real blood, and it triggered in her all the associations of fear and revulsion that mortal death entailed. She had not expected it: not the blood, not the soft thud of a body on masonry, not the shallow breaths drawing away to nothing.\nNone of her teachers had mentioned the hunt would feel like murdering a real person.\nThe City Hall had reminded Jing-Li of her grandfather, maybe that was why. Hair combed back, starched pressed shirt, glasses precisely set. Perhaps it was a figment of childhood, the archetype of the dutiful public servant instantly associated with a man who had died when she was ten and existed mostly through stories falling from her parents’ lips. If he had looked like someone else, maybe she might have felt less uncomfortable swinging the blade.\nWho was she kidding?\nShe gripped her consecrated sword tightly, a cheap plastic thing bought at a sports store, usually sold to seniors taking recreational tai-chi. The air here tasted dusty. Jing-Li’s footsteps echoed through a warren of corridors until she entered the main entrance chamber, where the ceiling yawned open far above her head and moonlight poured in from the windows on the second floor. She took a deep breath and thought she smelled London.\nLondon: the place where Jing-Li had gained her culling certification in her undergraduate years, taking a twisty bus route to a poorly-ventilated basement where she’d sit taking notes with a handful of other groundskeepers, young and old. She had been the only non-European there.\nIn her course application she had written cheerfully about the transient nature of Singapore’s geography, where buildings ten years old were considered aged. Surely a local, internationally-certified cullmaster would be invaluable.\nAfter all, this was Singapore, where lacking anything else the land itself became the currency in which the nation was defined. A living corpus carved and recarved, hollowed by tunnels and multibasement carparks, its borders fed with the leftover rock and silicate. It was a young land, supple and stretchy, where maps a year old were outdated, their lines dancing a seismographic tango. Guardians here lived and died in droves.\nExcept that this was Jing-Li’s first hunt since she’d returned home a year ago, law degree in hand. It turned out that guardians here went away as easily as their physical selves did, connections weak as water. Young locations lacked staying power, and older ones were strangely compliant in fading away. This job, then, existed only because it was unique.\nJing-Li looked at her hands: the blood of the City Hall building was gone.\nThe old Supreme Court was waiting upstairs, she knew. She tried to muffle her footsteps on the curved staircase as much as possible, as though she could sneak up on it by surprise, like a sleeping animal. It was quiet here, even by the standards of deserted buildings, something stately about the way the air rested amongst the shapes of the masonry. She was very, very cautious.\n“I’m here,” he said, the moment her foot touched the stones of the second floor. He was waiting against one of the balustrades that overlooked the first floor, arms folded much as she remembered from their first meeting. She was a child then, waiting for her father, and she had tugged on her mother’s sleeve to ask her about the “funny man in the hat.” Later she would seek out pictures of white men in Victorian garb to point out to her mother. Her first building guardian. Her mother had thought her imaginary friends cute.\nThe Supreme Court of today would have fit in perfectly in posher parts of the Central Business District. “You updated your look,” Jing-Li said.\nHis shrug seemed particularly dismissive. “In keeping with the times, you know.”\n“The times have caught up to you. Do you know why I’m here?”\n“You must think I’m an idiot.” He uncrossed his arms and stood straight. “I felt the other guy go too, the sorry bugger.”\n“It can’t be helped,” Jing-Li said. They were nearly toe-to-toe now. Was he ever this tall and thin and white? “If it’s any consolation, you will be remembered.”\nIf there’s any consolation, she thought to herself, it’s that after this I’ll be done with the job. The sword felt heavy in her hands, as if it were actually made of metal. She raised it in the direction of the guardian, brought it downwards—\nThe guardian vanished a split second before contact, and she found herself swinging through empty air.\n“Oh, kitten, it’s not that easy,” the Supreme Court said from behind her, and when she turned around he was sitting on the banister of the curved staircase with a Cheshire cat smile. Chest constricting, she lunged forward again, but like a clever insect he eluded her. When she regained her balance she found him back against his balustrade perch.\nShe took one step in his direction, and he froze her with a wag of his finger. “Ah-ah.” She did not move, scared of spooking him, scared that he would vanish once again.\n“Look,” she said, as sincerely as she could through the heaviness in her chest, “I don’t like it either, but it has to be done. That’s the rules.”\nHe leaned vertical, hands slung easily in his pockets. “I don’t intend to give up this position. After all, the other chap is gone. Somebody needs to man this station. I’ve decided that it’s going to be me.”\nThe guardian Jing-Li remembered was a stern one, back ram-rod straight, features imposing: a presence that filled the room and commanded absolute attention. Perhaps that was when he still functioned as the nation’s highest court. “Sorry, but that can’t happen,” she said. “We’ve done the measurements and both existing guardians need to go. Another one will arise for the new art museum.” Not to mention that his proposal would be incredibly unfair to the former City Hall, who had seemed a much better candidate for representing the art museum if they had to pick one.\n“Ah, but I put no stock in the calculations of your groundskeepers’ council. They use their own metrics, which are useless. There’s no correspondence with a global standard.”\nThe global standards had been scrapped a decade ago, exactly because they mapped poorly across the globe. These days different towns, different regions, different countries used self-calibrated standards, whatever worked best for them.\nJing-Li felt like pointing this out, but she did not. Somehow, she knew it would be like shouting at walls. Perhaps it was.\n“You’re out of luck,” the City Hall said. “I intend to stay.” She looked at him, standing resolute in his place, solid as one of the columns that made up the building’s façade, and could not argue. He had beautifully blue eyes, movie-star eyes, which crinkled at the edges before he disappeared. “Don’t think of summoning me,” his disembodied voice said, by way of parting. “It won’t work.”\nJing-Li didn’t try. It took her several minutes after she exited the building before she realized she was shaking.\nMonday, midday. The young woman, neat and dressed in what is generally accepted to be common office wear, trails a large group of people following a guide leading the way through the City Hall and former Supreme Court buildings. The group consists of civil servants who volunteered to help in the open house taking place in a month’s time, and are dressed accordingly. Run by the staff of the museum that has taken over administration of the two buildings, the open house will, for the first and the last time, allow the public into spaces previously reserved for the highest offices in the country. License to gawk and to touch, before the diggers and bulldozers move in to do their reconstructive surgery. Some of the group take notes as the guide points out key features and historical nuggets: this will be crucial information in a few weeks’ time when they too will become guides, this time to an adoring public eager to soak up the storied narratives contained within the buildings.\nThe young woman does not take notes. She merely follows, unnoticed.\nThe guide, with a knowing smile, leads the group away from the prescribed tour route, up to the roof where the iconic dome sits. The group loses flock coherence, running to various edges to take photographs, taking on the appearance of guppies in a tank. A large number of them gather at the front edge of the building, the only one not obscured by towering modern-day buildings. Eager hands point outwards, gesturing over the expanse of the Padang that lies, treeless and manicured, in front of former Supreme Court. It’s the first time any of them have seen it from this angle, and, artificial as it is they find it a wonder.\nThe young woman stays quietly in the shade of the dome, waiting for them to leave so that she can be alone with the one man on the roof no one else can see.\nAcross the length of the roof from her, the former Supreme Court watches her silently, expression inscrutable to bystanders.\nThe last straggler of the group vanished downwards with a clatter, and Jing-Li finally let herself relax. The ability to stay invisible in the confines of a building was entirely dependent on the sufferance of its guardian, and she hadn’t been sure the former Supreme Court would be so kind to its assigned executioner. She watched carefully as he strolled across the expanse of the roof, analyzing the way he took each step (with confidence), the way his hips swayed (hint of mischief).\n“I’m not here to finish the job,” she said, hands held up. “See, I didn’t bring the weapon.”\nThe former Supreme Court laughed. “I know,” he said. “Or you would not have made it this far.” As her hands went to her hips in protest, and he said: “This building still has working fire alarms.”\n“Fire alarms can’t keep me out forever.”\n“If I have my way I won’t have to keep you out.”\nShe reached her envelope bag and pulled out a small sealed packet of brown paper, which she offered to him. “Courtesy of the groundskeepers’ association,” she said. “I ran into a senior on the way here and he thought it might be helpful in getting into your good books.” Devon, according to his own account, had conveniently been on his way to buy something nearby and had just happened to bump into her in the two hundred meters between her workplace and the former Supreme Court building. Singapore was small, but not that small—Jing-Li wasn’t stupid. The association was getting impatient.\nThe former Supreme Court wrinkled his nose. “Bribery will get you nowhere.”\nShe returned the packet to her bag. “You don’t like sweets anyway. You’d prefer a nice rat or some other small dead animal, right?”\n“You know me well.” He sounded pleased.\n“I’ve done my research.”\nShe had done more than that. Like anyone with an ounce of self-respect she had gone home and dug into difficult guardian culls, carefully populating her browser with pages from countries bearing historic architecture, where the encrusted hearts of cities pulsed in medieval nerve centers laid over and over by infrastructural palimpsest. Places where guardians clung deeply and stubbornly to their location, fed by nostalgia and notions of heritage. She had come out of that tangle discouraged and confused: every story had different tips on how to get stubborn guardians to give up their guardianship, and most of them were quite location-specific. Her one takeaway was that she was on her own, and therefore in deep shit.\nUrgency itched under her skin, in her chest, like hungry parasites. Earlier this week the groundkeepers’ association had sent an email: “This is not a game. If we knew you were going to mess around, we would have hired someone to actually do the job.” She wondered if they understood that the last time in recorded history an unwilling guardian had been culled, hundreds of deaths had resulted from a building collapse.\n“I don’t like it,” the former Supreme Court said suddenly, leaning over the roof ledge, eyes fixed on the green of the Padang stretched before them.\n“What?” The Padang outranked the Supreme Court in age and they had no history of animosity that she could recall. A few years ago the Padang had gone underground, not long after the National Day parades had moved to the Marina Bay floating platform. It had not been seen since then. “You don’t like what?”\nShe followed his gaze. The Padang, hemmed in around all sides by temporary light fixtures, had a festive air about it. Banners hung by the streetlights explained why: the Formula One races dropped in on Singapore for their yearly call-by in two weeks’ time, and the roads around the Padang became part of a racetrack in their honor.\n“The Marina Bay Street Circuit,” she said. “You don’t like him?”\n“He’s a brat,” the former Supreme Court said with finality, as though passing a sentence on the ephemeral entity that only existed for less than a week each year. “Guardians shouldn’t be allowed to come and go. It’s unnatural.”\nJing-Li followed him in leaning over the ledge, hands on her chin. “You mean places shouldn’t be allowed to come and go. But it happens all the time.” He turned to interrupt her and she cut him off. “If you’re talking about naturalness, none of this is natural. Your existence is entirely man-made, you know. You live on our sufferance.”\n“If you wanted to get into my good books, you’re doing a terrible job of it.”\nJing-Li blew out a short breath through her nose. Despite the roar of passing cars, in some other part of the city close by, Singapore seemed quiet, too quiet. “I’m just being honest.”\nArms folded, gazing out across the green of the silent Padang, the former Supreme Court said nothing. Jing-Li continued: “If you have such problems with transient guardians how are you going to cope with the construction site deity for the next two years?”\nNow he did look at her. “Is that your concession that you’ve stopped trying to cull me?”\n“I’m serious,” Jing-Li said. “Accidents at worksites will happen if the construction deity is disturbed. You could get people killed.” In case he didn’t understand the ramifications of that, she added, “Humans will die on your watch.”\n“I’m not obliged to keep humans alive,” he said.\n“You don’t believe that, and I know that because you’re not a rogue guardian. Just a really stubborn one.”\nHis laugh was soft, burbling, like the sound of engines. “I’m perhaps the most fortunate, to have you chosen as my executioner.”\n“Chosen,” Jing-Li says under her breath, and he doesn’t hear.\n“I can’t think of any of your other compatriots who’s known me since childhood. Daughter of a judge . . . ” He looked at her, almost fondly, and Jing-Li stepped back a little from him. “And you’re a lawyer now, working just a few buildings down the road.”\n“Okay, sure.”\nHe tossed something at her and she barely caught it. When she opened her palm she was confronted with something small and copper and intricately carved. “A coin?”\n“Not just any coin. That’s a Straits Settlement coin.”\nShe turned it over and over in her fingers. It felt odd, strangely solid. “Where did you get it?”\n“There is a time capsule buried under the flagstone of the main court. Nothing much to it, just a few coins and the day’s papers. But they’ll open it in the year 3000. I suppose they won’t miss one little coin.”\n“The year 3000,” Jing-Li said. It sounded like the title of a sci-fi movie, something Arthur C. Clarke might have written.\n“I’d like to be there when they do that.”\n“In the year 3000.”\n“Yes.”\n“That’s nine hundred years in the future.” She held the coin out to him. “You have a lot of faith, don’t you?”\n“Keep the coin,” he said, still looking outwards. “Consider it a gift.”\nAnd then he was gone.\nSunday, mid-morning. The air thrums with life and the city is busy, consumed in festival-madness. Roads are closed and speakers pop as sound technicians take them through their paces. A hundred thousand people bustle, working themselves up to the frenzy that will take place when the sun sets. In their pens, at the hub of it all, the race cars that will be the stars of the night’s festivities sleep fitfully. Anticipation feels like a breathable, drinkable thing.\nWithin the madness-in-waiting sits a young woman in a big metal swing set on top of the hill that used to be a fort. Cross-legged quietude surrounds her and the plastic sword resting by her side. Eyes shut, she leans into the movement of the swing, back and forth, back and forth.\nTwo weeks have passed since she met the former Supreme Court on the roof of the building, and the groundbreaking ceremony is less than a month away. She is no closer to solving her problem. Despite her appearance of immobility her fingers twitch over the coin she holds loosely in her right hand, in her lap.\nShe whispers to herself, whether consciously or unconsciously, it’s hard to tell. It is also hard to hear what she is saying, but it sounds like a prayer.\nAnd then a guardian, whom she thought was dead, appears on the swing beside her.\nJing-Li sprang into alertness at the unexpected presence beside her, even if the swing continued its back-and-forth unperturbed. Her heart tapped a funny rhythm as she realized who it was. “But you’re supposed to be gone.”\n“Yes, I am gone,” said the guardian who used to be the City Hall building. “I’m not connected to my old place anymore.”\n“You’re supposed to disappear,” Jing-Li said, as if her first sentence hadn’t been clear. “Once a guardian has been disconnected from their location they lose the energy from the place that fed them.”\nThe former City Hall building laughed and shrugged, somehow avuncular when he did so. “That’s what they told you in school, right? But I guess it’s not true. I spend my days here now, here and there. Talking to my friends.” He gestured in the direction of a spreading banyan tree nearby, its hanging roots like sturdy beams.\nJing-Li could not see who he was gesturing to, and she guessed it was a tree spirit, because she had problems seeing them. “But the blood,” she said, still refusing to believe this was happening. “The falling over, the vanishing, what was all of that? Were you trying to make me feel bad? What?”\nHe crossed his legs and leaned back in the chair. He looked like her grandfather, but in demeanor he reminded her of her primary school Chinese language teacher. “I always thought that groundskeepers should appreciate the responsibilities they hold.”\nJing-Li let her hands drop into her lap. “You think I don’t? Like I don’t understand the consequences of my actions? You think I’m doing this just for fun?”\nThe former City Hall building said nothing, attention caught by something on the metal grating that formed the floor of the swing. He leaned over and picked it up: it was the coin she had been holding. “Wow, haven’t seen this in a long time.” He flipped it back and forth. “Did he give it to you?”\nWhen she nodded, he handed it to her. “Typical of him,” he said.\n“Emotional manipulation?” She flipped the coin back and forth in her fingers. “Like falling over in an explosion of blood wasn’t?” Her hand closed around the coin, hard enough to press into the skin. “Yours was the first cull I’d ever done and I was so scared I couldn’t do the next one. And I still can’t.”\n“Are you scared?” He looked at her. “Or is it something else?”\nJing-Li put her feet down and the movement stopped the swing’s momentum. Crickets sang in the greenery as she thought over the question carefully. Finally, she said: “No, probably not. I won’t let fear get in the way. It’s that he doesn’t want to go, and I don’t know how to convince him to. Because . . . ” She gestured in no particular direction. “It’s a horrible thing. I can’t blame him for not wanting to go through with it.”\n“Horrible?” The former City Hall huffed. “We are not humans, you know. It’s not about life or death, it’s about moving on, about becoming different. It’s natural.” He tapped her on the shoulder, in a teacherly way. “You remember your classes, when they taught you about culling? What did they say?”\n“A lot of mumbo-jumbo, most of it was not relevant to Singapore, anyway. Most of it was how to give pep talks about heritage and changing perceptions and how things never really go away. What kind of heritage does Singapore have? Even our national symbols are invented.”\nThe former City Hall just smiled.\nSilence settled, uncomfortably, and Jing-Li remembered she had been carrying around the small sacrifice packet from the groundskeepers’ association ever since the former Supreme Court refused it. She found it at the bottom of her bag, slightly squashed and with a worn corner, but still sealed. “This talk is getting us nowhere, so you might as well have some of this.”\n“Oh, thank you,” he said, accepting it and breaking the packet’s little paper seal. “I won’t be getting these much anymore, I suppose.” He dug in with his fingers and pulled out one of those soft, pink-and-white candies coated in powder that Jing-Li had no name for. “This is very good,” he said, and then held the packet out, across to the swing’s other bench. “You should try one.”\nJing-Li blinked. Seated across them, where there had been no one a moment ago, was a young Malay man in formal wear. A guardian, she realized, but one she did not recognize. “I live here,” he said simply, probably in response to her facial expression.\n“But you’re not Fort Canning,” Jing-Li said. The Fort Canning was a moody-looking teenager whom she often found perched on the old display cannons scattered around the park, smoking. He had been in place for slightly more than thirty years, she was told.\n“I’m the old dude,” he said, reaching into the bag that the former City Hall was holding out. “I’ve been here a long time. I used to be called Bukit Larangan. The Forbidden Hill, you know?”\n“You’re the original hill,” she said, in slow wonder. “From the 14th century.”\n“It’s been a bit longer than that.” He tasted the sweet, gingerly. “This is good. I don’t get many of them these days.”\n“You’re still around,” she said. “After all these years.”\n“It’s like he said. We stay around long after we’re gone.”\n“See, history remembers us, in a certain way,” said the former City Hall.\n“And do you remember history?” She leaned forward, her heart pounding, consumed by a sudden eagerness that she hadn’t felt since she was a very young schoolchild. She turned to the former Bukit Larangan. “Do you remember the 14th century?”\n“Hmm.” He leaned back in the swing seat. “I cannot say. I remember what it was like, but I don’t really remember it. It was so long ago.”\nShe couldn’t understand. “But you were there. Weren’t you?”\nHe leaned backwards into the chair, completely calm. “Yes. But memory is quite difficult.” He pointed to a sign, one of many that were scattered around the park, packed with information written in four languages. “See that? That’s all anybody remembers. Some days I think of the old kings who used to live here, and I realize that I cannot remember their faces, or I only remember a very vague picture of them. Then I wonder if the Tumasik I remember is the same as it was back then.”\n“You’ve told me stories,” said the former City Hall. “But I’m sure there was so much more.”\n“Of course there was much more,” the former Bukit Larangan said. “But it’s all gone now. Singapore’s history started in 1819, that’s what the history books say, right?” He gestured at the signs. “That’s all that’s left. That’s who I became.”\nJing-Li shook her head. “But—”\n“How much of Singapore’s history before the 19th century do you know?” The former City Hall asked.\n“A sleepy fishing village,” she said softly. “That’s what they teach us at school.”\n“No, it was a lot more than that,” said the former Bukit Larangan said. “But I don’t remember what it was anymore.”\nShe looked down at the sword in her lap and felt like she was falling outwards. The Straits Settlement coin resting in her hand had taken on immense weight and heat, like it was a burning coal.\n“But you were there,” she repeated emptily to herself.\nSunday night. Halogen lights of unthinkable wattage sear the air, burning a bright orthogonal circuit into the cityscape, thousands of meters long. Thousands cram into rows of seats, specially erected for the weekend, while thousands more press against wire nettings at odd ends and corners of the circuit, as race cars streak past at 400kmh, blurs of screaming metal tracked by faithless, tireless cameras. The Padang, forcibly crowned with a strobe-lit stage, suffocates under the weight of a sweaty, screaming crowd, while above the city, people in air-conditioned restaurants and bars peer down at the blips of cars blazing, ant-like, around the track.\nThe young woman runs in the alley behind the former Supreme Court, sealed off to prevent people from getting close to the racetrack. The Marina Bay Street Circuit has given her grace to wander the grounds, even the areas deemed off-limits, but she has more pressing matters on her mind. Her target is the former Supreme Court.\nFor her, for the both of them, it has to end tonight.\nJing-Li ran up the grand steps of the former Supreme Court, her footsteps sending solid echoes reverberating. She knew where the guardian was, up on the roof where they’d last met. She was sweaty, and her heart raced from shoving through the clamoring, oblivious crowd, but none of that mattered.\nThe moment she burst out through the stairwell the guardian turned towards her from his spot at the edge of the roof, haloed by the stadium-strength lights surrounding the Padang. “I see you’ve come.”\n“Don’t think of going anywhere,” she said, pulling the plastic sword from its plastic sheath, her voice and breathing harsh. Down on the road the F1 racers screeched and made popping noises as they slowed down for the corner turn, lending the scene the surreal soundtrack of an air raid.\n“I would not dream of it,” he said, his voice carrying over the melee. “In fact, I was rather hoping to stay here for the long term.”\n“No,” Jing-Li shouted, over the din. “You can’t. I’ve decided. That’s not how this country works. You served a purpose, that purpose is done, it’s time to move on. Your neighbor has done it. You’re no different.”\nHe looked a lot smaller than she seemed to recall, like a lost doll somebody left by the roadside. “But I am different. I thought you might think of me fondly, given your childhood. There’s such strong nostalgia . . . ”\n“Nostalgia? Whose nostalgia? You can’t tell me what to be nostalgic about.” The thing that had been sitting uncomfortably in her chest since the first night she had taken up her sword came to a boil. “This building is being preserved. That’s a lot more than other past locations in Singapore have had.”\nHe ran his fingers over the worn stone surface of the roof’s edge. “This place has such memories . . . ”\n“You have to believe me, I’m doing this for you.” She took bold steps towards him, and he didn’t move away. “Your memories will be rewritten, whether you like it or not. Our Government may like what you are. They like what you represented as the Supreme Court. They like the way you look on the television screens when Grand Prix is beamed to the world.”\nShe waved her sword accusingly at the racetrack. “But that’s all you’ll ever be, from now on. A pretty picture. A tourist attraction. They could have built something else to house the art museum. But they wanted to use your skin, because your skin is what they think is important.” She swung the sword back towards him. “Can you live with that? Can you live with becoming somebody else?”\nHe seemed to straighten up. “I used to be the Supreme Court,” he said, a glint of his former hardness returning to his expression. “Important decisions were made on my watch. What I did used to influence the entire nation.”\n“And no one will change that for you,” she said. She thought of Bukit Larangan, its history faintly etched, fading into a few neat lines of the country’s official narrative. “You are so lucky and you don’t even know it.”\n“Will you remember me, at least?”\n“I’ll come over for tea,” she said. “There’s a swing set on top of Fort Canning that seats four. We can hang out with your former neighbor. And the old Forbidden Hill. We could talk about history, or anything you like. I’ll even bring a lizard for you, if you want.”\nHe smiled. She could barely see his blue eyes in the mad, harshly shadowed lighting. “I’m still right. I am still fortunate to have you as my executioner.”\n“You had a good run,” Jing-Li said.\n“Well. I won’t deny that.”\nShe did not blink as she brought the plastic blade down.\nSunday night. It has been a year since the groundbreaking ceremony, and the races are on again. The former Supreme Court stands, its form cloaked in netted black scaffolding on which its façade is projected. Its interior is a mess, gutted masonry like phoenix ash, but the millions around the globe watching the race live do not need to see that.\nAcross the track sits a grandstand, its rows packed with the chattering masses. They have paid well to be here, even if only for a brief time. Amongst their number one might pick out the shape of a young woman, her back straight, an unreadable smile on her face. From this distance you cannot tell, but she is turning and turning a small object in her hand, which appears to be a coin of some sort.\nBut she is only one face in the crowd, and as the camera pulls away she becomes invisible, part of the story no one sees.\nThe black box of the former Supreme Court, drenched in new light, remains impassive. Around it rise skyscrapers—shades of New York, shades of Abu Dhabi—that vanish into the night, the hands of a new city reaching ahead.\nOriginally published in We See a Different Frontier, edited by Fabio Fernandes and Djibril al-Ayad, 2013.\nJY Neon Yang (they/them) is queer, non-binary, and the author of the Tensorate series of novellas from Tor.Com Publishing (The Black Tides of Heaven, The Red Threads of Fortune, The Descent of Monsters, and The Ascent to Godhood). Their work has been shortlisted for the Hugo, Nebula, World Fantasy and Lambda Literary awards. A Clarion West alum, they graduated from the University of East Anglia with an MA in Creative Writing and currently live in Singapore.", "source": "https://clarkesworldmagazine.com/yang_10_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Old Domes by JY Yang"}