{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Sarah Goslee", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "IOhvZQD26RkU80S1EwbLGFTWcww=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Packing for a Very Long Trip  The basic requirements of life—air, food, water—are provided for us by the biosphere, the assemblage of plants and animals, bacteria and fungi that share our world. We’ve always been able to rely on the services that these organisms provide to us. Most of us in industrialized countries don’t even have to think about them very much.  That all changes when we try to leave our ancestral planetary home. Suddenly there is no air, no food, and little water. The most obvious solution is to haul along everything we need, to pack a really big suitcase. All of the food, water and oxygen that the crew needs is taken along, and waste is either jettisoned or stored. This open-loop system works for short trips, but for longer excursions the mass of supplies needed becomes too great to haul along. A single person requires about 8,000 kg of supplies a year, including food (219 kg), oxygen (329 kg), and water for drinking (657 kg) and washing (6972 kg)1. Lifting mass into orbit is expensive, so what about recycling some of it—filtering the air and purifying the water?  There is a tradeoff here: hauling recycling equipment instead of oxygen and water. Estimates based on the cost of lifting mass to orbit show that for missions longer than about a year recycling air is the best option. Water recycling becomes effective after about two years. For missions longer than three years, or for colonies in space or on other planets, travelers will need a self-sufficient system that provides air, water and food.  The engineers in charge of developing life support systems for space travel quickly hit on the idea of using biological systems to mimic the processes that occur within our biosphere. Living organisms produce what we need here on earth; why not also in space? Humans breathe in oxygen and exhale carbon dioxide, while plants take in carbon dioxide and release oxygen. Can this cycle be harnessed to keep humans alive in a closed system?  Russian studies in the 1950s used vats of algae to produce oxygen, to purify water, and even to feed humans. Such simple systems are easy to control and to understand, but it is impossible to precisely match the inputs and outputs. The algae have one set of requirements for gases and nutrients, while humans have a different set that doesn’t exactly correspond. This mismatch leads to many problems, including imbalances and even self-poisoning.  The purely ecological approach lies at the other end of the spectrum: put as many species as you can into a closed environment and see what happens. This holistic method works for Earth, but is not feasible for space travel and colonization. If you throw everything together it will usually reach a self-sustaining equilibrium—closed microcosms can live for decades—but there is no way to ensure that the resulting system will support humans as one of its components.  There are tradeoffs between engineering and ecology. Physicochemical systems are fast, single-purpose and expensive in terms of both energy needs and mass transport. Biological systems are multifunctional but slow, require a lot of work to maintain, need large areas for growing plants, and are very difficult to control.  The Biosphere 2 project in the early 1990s demonstrated many of these problems with closed biological systems2. Plants, animals and soils from several different biomes were established in a 12,700 m2 enclosure3. Each of the areas, including grassland, wetland, rainforest, desert, and even coral reef, had its own area and own climate control. Power came from outside, and each section had climate control systems, but Biosphere was otherwise sealed.  Eight people lived and worked inside this closed system for two years. The human component of the system was successful, though other groups of species (vertebrates, pollinating insects) did not fare so well. Cockroaches were highly successful. The oxygen levels dropped over time, and oxygen eventually had to be added from outside the system to maintain animal health. The terrestrial biosphere relies on a level of redundancy—many species doing similar things—that is not present in a small closed system no matter how many species we try to add.  Not all closed-system research is part of the space program. Many studies, including Biosphere 2, were designed to improve our understanding of basic ecology. In a replicated study, many identical microcosms are set up and monitored. Climate and atmosphere are carefully controlled. Microcosm research has led to many insights into how communities self-assemble from their component species. Much of our knowledge on the response of plants to increased carbon dioxide and changing climates comes from this kind of research.  Current research into human life support systems incorporates the lessons learned from earlier trials and from the many ecological microcosm studies. These systems are sometimes called Controlled (or Closed) Ecological Life Support Systems (CELSS). Since energy must come from an outside source, usually the sun, controlled is a more accurate term.  The most promising approaches rely on both engineering and ecology. Instead of a single biosphere-like system, life support functions are divided among manageable subsystems, each with its own biological components and engineering-based monitoring and control mechanisms. For example, wash water flows into the water processing system, where plants and algae filter it. Temperature and light are mechanically controlled to ensure optimum algal processing power. The populations of plants and algae are monitored and modified as needed, instead of allowing self-regulation. The cleaned water then moves into the agricultural system, where it irrigates food plants, and on through all the subsystems.  These bioregenerative systems can meet the major needs for human life. They will rely on plants for the most important component of atmosphere recycling: conversion of carbon dioxide to oxygen through photosynthesis. Human health and comfort will also require temperature and humidity control, and contaminant filtration to remove both toxic and smelly gases. Those functions are better provided through mechanical scrubbers.  Water recycling will similarly require biological and mechanical components. Plants can perform some water purification activities, but mechanical filtration and sterilization are also needed in a closed system. Solid waste recycling will use a combination of composting, anaerobic bacterial digestion and incineration. Rather than expecting the food plants to also perform all the environmental control functions, single-purpose algae or bacterial tanks will probably be used.  Food production is where biological systems really stand out. It’s possible to live on preserved food for long periods, but that diet is both expensive and unsatisfying. Growing food plants will vary the diet, reduce the amount of stored food needed, and provide limited atmosphere and water recycling capability. Many different aspects of plant growth have been studied, from growth and pollination in microgravity to hydroponic or aeroponic growth techniques and use of artificial lighting.  Crop breeding has produced new varieties that are better-suited to closed systems because they are shorter, produce less non-food mass, and yield crops faster. Under controlled conditions, food production requires 20-30 m2 per person. With good lighting, water and nutrients, crop plants can be more productive than in traditional agriculture: wheat production can be increased by as much as 16 times over yields in good field conditions4.  After the early Russian algae-only trials, scientists realized that psychology and nutrition are both important, and have tried to include a variety of plant species in their planning. Species are selected based on lifespan and suitability for growing in small spaces, and also for meeting human nutritional requirements. Many species combinations have been proposed, usually based around some combination of soybeans, wheat, potatoes, rice or peanuts as the major calorie source. Lettuce, tomatoes, carrots, chard or cabbage may be added for variety and nutrient content. Six to ten species can meet human requirements.  Plant growth is not tied to terrestrial seasons, so a staggered production schedule will ensure that all species are producing food at all times. The crew will still need to plan for storage and consumption patterns, and for processing time (both cooking and more complex processing like grinding wheat into flour).  Space agriculture will provide a primarily vegetarian diet. Animals are a less efficient means of food production than plants, and need more space and other resources. Aquaculture, perhaps raising a fish like tilapia, could be possible on space missions. Larger and longer-term projects may add other animals like chickens, or even goats, which can eat parts of plants not used for human food.  The Mars Society’s Mars Analogue Research Station is an Arctic base that is used for testing equipment and systems in a simulated Martian environment5. In the earlier years of the project the inhabitants tested several bioregenerative components with little success6. They found them to be too unreliable, and very time-consuming to manage. The waste treatment system had contamination problems and became very unpleasant, always a hazard with biological systems.  Still, The Mars Society recognizes that although physicochemical systems are more practical for short-term projects, bioregenerative systems will be needed for longer missions and planetary settlement. More practical trials with humans in a closed environment are needed to get CELSS to work reliably.  The European Space Agency is developing plans for Micro-Ecological Life Support System Alternative (MELiSSA)7. MELiSSA is a compartmentalized system integrating both engineering and ecological components8. Using a distinct section for each function reduces the possibility of cross-contamination and makes it possible to monitor and control each separately. MELiSSA is intended to recycle air and water, and to produce 95% of the food requirements. This ESA project is based on the principles of systems ecology, including:  \r\n   everything that is produced must be consumed;  dilution is not a solution to pollution; and  monitoring and control systems must substitute for terrestrial diversity and redundancy.  The Chinese government is developing plans to establish a permanent lunar base. Government-sponsored research into bioregenerative life support is a key feature of this program, and a comprehensive plan has been developed. Like MELiSSA, this is a compartmentalized plan using both ecological and engineering ideas. Careful modeling of inputs and outputs suggests that the entire system will be 99% closed, an impressive result if it works as planned9.  The agricultural component of the Chinese plan explicitly includes spices and condiments along with the vegetables, cereals and legumes that provide the bulk of the nutritional value. The fifteen-species crop list includes: wheat, rice, soybeans, peanuts, chile peppers, carrots, tomatoes, coriander (cilantro), cabbage, leaf lettuce, radishes, pumpkin, green onion and garlic.  The Chinese system has an unusual agricultural addition: silkworms as a protein source. Using insects as a protein source is a logical decision since they are high-yield and require little space or resources, though insects aren’t a normal (intentional) component of the US and European diet. Mulberry leaves will be grown to feed the silkworms, and they can also eat lettuce ribs and other plant products less palatable to humans. The Chinese expect to pack only five additional food products: iodized salt, sugar, preserved beef, rendered lard, and “luncheon fish” (whatever they are).  Research into Controlled Ecological Life Support Systems has led to the development of self-sustaining bioregenerative systems that can support human life for long periods. Like so many aspects of the space program, developments in CELSS research can be applied to other areas: agriculture, recycling, waste treatment, and resource management. With pending environmental concerns here on Earth—including a global fresh-water shortage, increasing atmospheric carbon dioxide, and changing climate—these discoveries could be crucial for maintaining human health and comfort at home as well as in space.  Footnotes:  1 - Schwartzkopf, Steven H. 1992. Design of a Controlled Ecological Life Support System. BioScience 42:526-535  4 - Schwartzkopf, Steven H. 1992. Design of a Controlled Ecological Life Support System. BioScience 42:526-535  5 - Wikipedia: Mars Analogue Research Station Program - http://en.wikipedia.org/wiki/Mars_Analogue_Research_Station_Program and The Mars Society: Mars Analog Research Stations - http://www.marssociety.org/portal/groups/AnalogsTF/index_html  8 - Farges, B. et al. 2008. Dynamics aspects and controllability of the MELiSSA project: A bioregenerative system to provide life support in space. Applied Biochemistry and Biotechnology 151:686-699  9 - Hu, Enzhu et al. 2010. Conceptual design of a bioregenerative life support system containing crops and silkworms. Advances in Space Research 45:929-939  Sarah Goslee is an ecologist working on agricultural issues at a government lab in Pennsylvania and a regular contributor to the Crossed Genres Science in My Fiction series. She likes to figure things out and tell people about them, and writes regularly on a diverse array of topics including fiber arts, medieval science, and Viking culture.", "text": "Non-Fiction\nPacking for a Very Long Trip\nThe basic requirements of life—air, food, water—are provided for us by the biosphere, the assemblage of plants and animals, bacteria and fungi that share our world. We’ve always been able to rely on the services that these organisms provide to us. Most of us in industrialized countries don’t even have to think about them very much.\nThat all changes when we try to leave our ancestral planetary home. Suddenly there is no air, no food, and little water. The most obvious solution is to haul along everything we need, to pack a really big suitcase. All of the food, water and oxygen that the crew needs is taken along, and waste is either jettisoned or stored. This open-loop system works for short trips, but for longer excursions the mass of supplies needed becomes too great to haul along. A single person requires about 8,000 kg of supplies a year, including food (219 kg), oxygen (329 kg), and water for drinking (657 kg) and washing (6972 kg)1. Lifting mass into orbit is expensive, so what about recycling some of it—filtering the air and purifying the water?\nThere is a tradeoff here: hauling recycling equipment instead of oxygen and water. Estimates based on the cost of lifting mass to orbit show that for missions longer than about a year recycling air is the best option. Water recycling becomes effective after about two years. For missions longer than three years, or for colonies in space or on other planets, travelers will need a self-sufficient system that provides air, water and food.\nThe engineers in charge of developing life support systems for space travel quickly hit on the idea of using biological systems to mimic the processes that occur within our biosphere. Living organisms produce what we need here on earth; why not also in space? Humans breathe in oxygen and exhale carbon dioxide, while plants take in carbon dioxide and release oxygen. Can this cycle be harnessed to keep humans alive in a closed system?\nRussian studies in the 1950s used vats of algae to produce oxygen, to purify water, and even to feed humans. Such simple systems are easy to control and to understand, but it is impossible to precisely match the inputs and outputs. The algae have one set of requirements for gases and nutrients, while humans have a different set that doesn’t exactly correspond. This mismatch leads to many problems, including imbalances and even self-poisoning.\nThe purely ecological approach lies at the other end of the spectrum: put as many species as you can into a closed environment and see what happens. This holistic method works for Earth, but is not feasible for space travel and colonization. If you throw everything together it will usually reach a self-sustaining equilibrium—closed microcosms can live for decades—but there is no way to ensure that the resulting system will support humans as one of its components.\nThere are tradeoffs between engineering and ecology. Physicochemical systems are fast, single-purpose and expensive in terms of both energy needs and mass transport. Biological systems are multifunctional but slow, require a lot of work to maintain, need large areas for growing plants, and are very difficult to control.\nThe Biosphere 2 project in the early 1990s demonstrated many of these problems with closed biological systems2. Plants, animals and soils from several different biomes were established in a 12,700 m2 enclosure3. Each of the areas, including grassland, wetland, rainforest, desert, and even coral reef, had its own area and own climate control. Power came from outside, and each section had climate control systems, but Biosphere was otherwise sealed.\nEight people lived and worked inside this closed system for two years. The human component of the system was successful, though other groups of species (vertebrates, pollinating insects) did not fare so well. Cockroaches were highly successful. The oxygen levels dropped over time, and oxygen eventually had to be added from outside the system to maintain animal health. The terrestrial biosphere relies on a level of redundancy—many species doing similar things—that is not present in a small closed system no matter how many species we try to add.\nNot all closed-system research is part of the space program. Many studies, including Biosphere 2, were designed to improve our understanding of basic ecology. In a replicated study, many identical microcosms are set up and monitored. Climate and atmosphere are carefully controlled. Microcosm research has led to many insights into how communities self-assemble from their component species. Much of our knowledge on the response of plants to increased carbon dioxide and changing climates comes from this kind of research.\nCurrent research into human life support systems incorporates the lessons learned from earlier trials and from the many ecological microcosm studies. These systems are sometimes called Controlled (or Closed) Ecological Life Support Systems (CELSS). Since energy must come from an outside source, usually the sun, controlled is a more accurate term.\nThe most promising approaches rely on both engineering and ecology. Instead of a single biosphere-like system, life support functions are divided among manageable subsystems, each with its own biological components and engineering-based monitoring and control mechanisms. For example, wash water flows into the water processing system, where plants and algae filter it. Temperature and light are mechanically controlled to ensure optimum algal processing power. The populations of plants and algae are monitored and modified as needed, instead of allowing self-regulation. The cleaned water then moves into the agricultural system, where it irrigates food plants, and on through all the subsystems.\nThese bioregenerative systems can meet the major needs for human life. They will rely on plants for the most important component of atmosphere recycling: conversion of carbon dioxide to oxygen through photosynthesis. Human health and comfort will also require temperature and humidity control, and contaminant filtration to remove both toxic and smelly gases. Those functions are better provided through mechanical scrubbers.\nWater recycling will similarly require biological and mechanical components. Plants can perform some water purification activities, but mechanical filtration and sterilization are also needed in a closed system. Solid waste recycling will use a combination of composting, anaerobic bacterial digestion and incineration. Rather than expecting the food plants to also perform all the environmental control functions, single-purpose algae or bacterial tanks will probably be used.\nFood production is where biological systems really stand out. It’s possible to live on preserved food for long periods, but that diet is both expensive and unsatisfying. Growing food plants will vary the diet, reduce the amount of stored food needed, and provide limited atmosphere and water recycling capability. Many different aspects of plant growth have been studied, from growth and pollination in microgravity to hydroponic or aeroponic growth techniques and use of artificial lighting.\nCrop breeding has produced new varieties that are better-suited to closed systems because they are shorter, produce less non-food mass, and yield crops faster. Under controlled conditions, food production requires 20-30 m2 per person. With good lighting, water and nutrients, crop plants can be more productive than in traditional agriculture: wheat production can be increased by as much as 16 times over yields in good field conditions4.\nAfter the early Russian algae-only trials, scientists realized that psychology and nutrition are both important, and have tried to include a variety of plant species in their planning. Species are selected based on lifespan and suitability for growing in small spaces, and also for meeting human nutritional requirements. Many species combinations have been proposed, usually based around some combination of soybeans, wheat, potatoes, rice or peanuts as the major calorie source. Lettuce, tomatoes, carrots, chard or cabbage may be added for variety and nutrient content. Six to ten species can meet human requirements.\nPlant growth is not tied to terrestrial seasons, so a staggered production schedule will ensure that all species are producing food at all times. The crew will still need to plan for storage and consumption patterns, and for processing time (both cooking and more complex processing like grinding wheat into flour).\nSpace agriculture will provide a primarily vegetarian diet. Animals are a less efficient means of food production than plants, and need more space and other resources. Aquaculture, perhaps raising a fish like tilapia, could be possible on space missions. Larger and longer-term projects may add other animals like chickens, or even goats, which can eat parts of plants not used for human food.\nThe Mars Society’s Mars Analogue Research Station is an Arctic base that is used for testing equipment and systems in a simulated Martian environment5. In the earlier years of the project the inhabitants tested several bioregenerative components with little success6. They found them to be too unreliable, and very time-consuming to manage. The waste treatment system had contamination problems and became very unpleasant, always a hazard with biological systems.\nStill, The Mars Society recognizes that although physicochemical systems are more practical for short-term projects, bioregenerative systems will be needed for longer missions and planetary settlement. More practical trials with humans in a closed environment are needed to get CELSS to work reliably.\nThe European Space Agency is developing plans for Micro-Ecological Life Support System Alternative (MELiSSA)7. MELiSSA is a compartmentalized system integrating both engineering and ecological components8. Using a distinct section for each function reduces the possibility of cross-contamination and makes it possible to monitor and control each separately. MELiSSA is intended to recycle air and water, and to produce 95% of the food requirements. This ESA project is based on the principles of systems ecology, including:\n- everything that is produced must be consumed;\n- dilution is not a solution to pollution; and\n- monitoring and control systems must substitute for terrestrial diversity and redundancy.\nThe Chinese government is developing plans to establish a permanent lunar base. Government-sponsored research into bioregenerative life support is a key feature of this program, and a comprehensive plan has been developed. Like MELiSSA, this is a compartmentalized plan using both ecological and engineering ideas. Careful modeling of inputs and outputs suggests that the entire system will be 99% closed, an impressive result if it works as planned9.\nThe agricultural component of the Chinese plan explicitly includes spices and condiments along with the vegetables, cereals and legumes that provide the bulk of the nutritional value. The fifteen-species crop list includes: wheat, rice, soybeans, peanuts, chile peppers, carrots, tomatoes, coriander (cilantro), cabbage, leaf lettuce, radishes, pumpkin, green onion and garlic.\nThe Chinese system has an unusual agricultural addition: silkworms as a protein source. Using insects as a protein source is a logical decision since they are high-yield and require little space or resources, though insects aren’t a normal (intentional) component of the US and European diet. Mulberry leaves will be grown to feed the silkworms, and they can also eat lettuce ribs and other plant products less palatable to humans. The Chinese expect to pack only five additional food products: iodized salt, sugar, preserved beef, rendered lard, and “luncheon fish” (whatever they are).\nResearch into Controlled Ecological Life Support Systems has led to the development of self-sustaining bioregenerative systems that can support human life for long periods. Like so many aspects of the space program, developments in CELSS research can be applied to other areas: agriculture, recycling, waste treatment, and resource management. With pending environmental concerns here on Earth—including a global fresh-water shortage, increasing atmospheric carbon dioxide, and changing climate—these discoveries could be crucial for maintaining human health and comfort at home as well as in space.\nFootnotes:\n1 - Schwartzkopf, Steven H. 1992. Design of a Controlled Ecological Life Support System. BioScience 42:526-535\n4 - Schwartzkopf, Steven H. 1992. Design of a Controlled Ecological Life Support System. BioScience 42:526-535\n5 - Wikipedia: Mars Analogue Research Station Program - http://en.wikipedia.org/wiki/Mars_Analogue_Research_Station_Program and The Mars Society: Mars Analog Research Stations - http://www.marssociety.org/portal/groups/AnalogsTF/index_html\n8 - Farges, B. et al. 2008. Dynamics aspects and controllability of the MELiSSA project: A bioregenerative system to provide life support in space. Applied Biochemistry and Biotechnology 151:686-699\n9 - Hu, Enzhu et al. 2010. Conceptual design of a bioregenerative life support system containing crops and silkworms. Advances in Space Research 45:929-939\nSarah Goslee is an ecologist working on agricultural issues at a government lab in Pennsylvania and a regular contributor to the Crossed Genres Science in My Fiction series. She likes to figure\nthings out and tell people about them, and writes regularly on a\ndiverse array of topics including fiber arts, medieval science, and\nViking culture.", "source": "https://clarkesworldmagazine.com/goslee_07_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Packing for a Very Long Trip by Sarah Goslee"}