{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "3cDXY2gXv/xh/pFR+X8RuoOhCzQ=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: A Death in the Clarkesworld Family  It is with a heavy heart that I must report the passing of Gardner Dozois, our reprints editor. His work at Clarkesworld is a mere footnote in a long list of impressive accomplishments during his career in science fiction and fantasy as an editor and writer. To this day, I’m still surprised and flattered that he said yes when he was offered the position five years ago.  I had expected to see him at the Nebula Awards Weekend last month—he was going to receive a Solstice Award from SFWA for his significant impact on the science fiction and fantasy landscape—but while there, I received an email letting me know that he was in the hospital and would need to take a month or so off while he recovered. I wished him a quick recovery and told him he’d be missed. Like many others, I was disappointed that he wouldn’t be there to receive the award in person. I hope he had the opportunity to view the video of Connie Willis’ presentation of the award, the round of applause that followed, along with Gardner’s son, Christopher, accepting on his behalf.  Christopher also left with one of Gardner’s more recent anthologies given to him by SFWA, filled with signatures from those wishing him well. If the line at the registration table to add a note or a name to the pages was any indication of how much Gardner was missed that weekend, it was certainly a lot. I also hope he got to see that too.  A week later, I was a special guest at Balticon, when I found out things had taken a turn for the worse. They were reporting that they expected him to recover, but something nagged and worried me. If I seemed distracted at the convention, that’s why. I kept checking my phone to see if there were any updates and became increasingly concerned as time passed.  Sunday, my fears were realized when Michael Swanwick posted to Facebook that we had lost him. Later that evening, I attempted to convey the news on at a panel, and broke down. Some things can hit you like a ton of bricks when you have to say them. They become real in that moment, and the shock can be tremendous.  Many more qualified people have written tributes and detailed just how important and long-lasting his contributions to the field have been. I can only nod in agreement with those far more eloquent individuals. There are a million stories about Gardner, of which I only know a very small fraction.  Over the last few days, I’ve heard so many more—and have been reminded of others—bringing much needed laughter. He always seemed larger than life and some of that intimidated me. I often found myself at a loss for words around him, but he never made me feel like I wasn’t listened to or heard. In fact, one of the things I will always remember about him had nothing to with science fiction, conventions, or publishing. Gardner was one of the people that reached out to me while I was recovering from my heart attack and coming to terms with the fact that the damage to my heart was permanent. Those are special people to me and it’s that side of Gardner that I mourn for above all else.  Gardner,  Thank you for everything: the stories, the books, the reviews (oh the things you called our stories—“stylishly written and usually faintly perverse” will always be a favorite quote), being a part of the Clarkesworld family, and above all, for a few words when I really needed to hear them. It meant a lot and will never be forgotten.  -Neil Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: A Death in the Clarkesworld Family\nIt is with a heavy heart that I must report the passing of Gardner Dozois, our reprints editor. His work at Clarkesworld is a mere footnote in a long list of impressive accomplishments during his career in science fiction and fantasy as an editor and writer. To this day, I’m still surprised and flattered that he said yes when he was offered the position five years ago.\nI had expected to see him at the Nebula Awards Weekend last month—he was going to receive a Solstice Award from SFWA for his significant impact on the science fiction and fantasy landscape—but while there, I received an email letting me know that he was in the hospital and would need to take a month or so off while he recovered. I wished him a quick recovery and told him he’d be missed. Like many others, I was disappointed that he wouldn’t be there to receive the award in person. I hope he had the opportunity to view the video of Connie Willis’ presentation of the award, the round of applause that followed, along with Gardner’s son, Christopher, accepting on his behalf.\nChristopher also left with one of Gardner’s more recent anthologies given to him by SFWA, filled with signatures from those wishing him well. If the line at the registration table to add a note or a name to the pages was any indication of how much Gardner was missed that weekend, it was certainly a lot. I also hope he got to see that too.\nA week later, I was a special guest at Balticon, when I found out things had taken a turn for the worse. They were reporting that they expected him to recover, but something nagged and worried me. If I seemed distracted at the convention, that’s why. I kept checking my phone to see if there were any updates and became increasingly concerned as time passed.\nSunday, my fears were realized when Michael Swanwick posted to Facebook that we had lost him. Later that evening, I attempted to convey the news on at a panel, and broke down. Some things can hit you like a ton of bricks when you have to say them. They become real in that moment, and the shock can be tremendous.\nMany more qualified people have written tributes and detailed just how important and long-lasting his contributions to the field have been. I can only nod in agreement with those far more eloquent individuals. There are a million stories about Gardner, of which I only know a very small fraction.\nOver the last few days, I’ve heard so many more—and have been reminded of others—bringing much needed laughter. He always seemed larger than life and some of that intimidated me. I often found myself at a loss for words around him, but he never made me feel like I wasn’t listened to or heard. In fact, one of the things I will always remember about him had nothing to with science fiction, conventions, or publishing. Gardner was one of the people that reached out to me while I was recovering from my heart attack and coming to terms with the fact that the damage to my heart was permanent. Those are special people to me and it’s that side of Gardner that I mourn for above all else.\nGardner,\nThank you for everything: the stories, the books, the reviews (oh the things you called our stories—“stylishly written and usually faintly perverse” will always be a favorite quote), being a part of the Clarkesworld family, and above all, for a few words when I really needed to hear them. It meant a lot and will never be forgotten.\n-Neil\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_06_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: A Death in the Clarkesworld Family by Neil Clarke"}