{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nin Harris", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "9rd1XCISvmEo02Hv3iwj2khrgv0=", "id": null, "license": null, "comments": "", "raw_text": "5880 words, short story  Prosthetic Daughter  Transcript #56565: Admiral Zhen-Juan’s DataStreamLog  Data theft is identity theft.  We sat through so many lectures and briefings that recycled this information. At the academy, the lecture-borgs would do their rounds from class to class every morning and before the end of the day.  It should have been enough. It wasn’t enough. Data-hacks still happened. Vanished identities, vanished memories. People who were mere husks, ready to be reprogrammed by unscrupulous dealers. I never thought I would be one of them. Perhaps I should have been paying more attention.  Protect your memory nodes. Sleep safe.  Jacking into someone’s node is theft.  We had nodes installed three generations back. According to my Ah Ma, for hundreds of years we would not have been identifiable as human to our ancestors. Prosthetics had become part of who we are. We’d evolved, or devolved from people who could do complex mathematical conundrums in our heads without augmentation and who could memorize entire lists and taxonomies, to people with augmentations implanted into our nodes.  Ah Ma said this to me once: “Our tragedy in life is that we will never know what our ancestors knew. At least, not in the same way they did. In a way, we are all like you, child. You have prosthetics correcting your spine, but we were all fitted with prosthetics in our brains since we were children.”  “You couldn’t have stopped them from doing it to us if you hated it that much?” I asked Ah Ma whenever she started bemoaning our prosthetic brains. I asked her annoying questions like this mostly because I was annoyed by her constant lamentations in my teenage years. As annoyed as I was by the reminder that I was not as physically able as the rest of my family members. I had needed corrective surgery in order to jump, to run. To do all of those things required of a cadet in a military academy.  Ah Ma would look at me and say, “And what would happen to you on this planet if you had? Would you have been able to be a cadet?”  Oh Ah Ma. If you had stopped it, I would still have been with you and Ah Pa. With my brothers and sisters. But instead, here I am on a circuit station when I am not jumping in-between time-streams as a time-and-space-hopping Admiral.  I could have reached you in time if the pod with my data-wiped body had not been on a hijacked hospital station in an interstellar war zone. But there are never any guarantees in space. There are far less guarantees in time.  My ancestors came from a distant Earth. More specifically, most of them came from Fujiuan in China, although there were intermarriages between my Fuzhou, Hainanese, and Cantonese ancestors. Various other provinces and dialects intermingled through time and intermarriages and various religious conversions: Buddhist, Methodist, and Muslim. During the great exodus from Earth, my ancestors ranged across the skies led by a Bunian Interstellar Armada. Once re-settled on a planet close in climate and temperament to Earth, my ancestors became involved in the terraforming of the planet.  As a society was established, they became farmers, and then a family of food-sellers. Because we lived on a planet that was predominantly populated by apsaras, Malays, Pattani, and Chinese Muslims, we sold: halal long-boiling soups, chicken and mutton kut teh, and handmade noodles tossed in sesame oil and soy sauce before being served with fresh pak choy from my father’s gardens, and roasted duck. These were consumed eagerly by off-duty hungry officers and common-folk alike. Our cafeteria was very popular with the military. I grew up used to the sight of members of the Bunian Fleet in their various uniforms: tunics and tights for the cadets, long button-down military coats for lance-corporals, and jumpsuits that looked lighter than air for the higher ranking commodores, lieutenants, and admirals.  One of them, Surgeon-Admiral Mei-Lee, became my sponsor in the academy. She started teaching me military history and strategy every time she visited. Surgeon-Admiral Mei-Lee told my Ah Pa, “There’s a fine military mind in your home. I hope you will not be too selfish, let us take care of her. I can correct her spine with prosthetics. And we will nurture her talents for strategy.”  Hundreds of years away from that moment when I eavesdropped, I now know my first foster-mother was not guided by altruism alone. She was genuinely curious to see if she could fix me, if she could turn me into a Fleet Admiral. That was not the first time I was adopted. First by the military, later by my second foster mother on Teja-II. I had a family stolen from me, but I have had three mothers in my lifetime. I suppose that counts for something.  Jacking into someone’s node is identity crime.  Jacking into someone’s node is death.  “I could do it so well, no one would know who you were. I could do it so well, you won’t know who you are,” Yun-Li said to me once, her eyes dancing as she stole three preserved plums from the small box of preserved fruits I kept in the shelf beneath my desk.  I swatted at her fingers with a translucent ruler but her fingers danced as fast as her eyes and the thoughts that flitted there. We were talking about the lecture-borgs who periodically entered our course-rooms to deliver the service messages of the day. The units used to be professors and higher officers of the Bunian Fleet who were completely mind-wiped thanks to data-hacks.  “I supposed you could,” I remembered saying doubtfully as I looked at the curves of her heart-shaped face, “but why would you want to do such a thing?”  She shrugged. “Why not? It would be fun. And you’re so tedious, who would miss you?”  Yun-Li had a gift for saying precious things like this. With a droll, matter-of-fact expression, she was able to make the people around her feel like she had said the funniest and wittiest thing a person could say, but the bite it left was like the aftertaste of poison lacing a bowl of mung bean sweet porridge.  “My family would miss me,” I said. My voice was as stoic as my face was long.  “They wouldn’t miss you, Horseface. Not if they couldn’t remember you,” Yun-Li said, coy as she played with her fingers, a habit of hers that I found annoying.  “That’s not possible,” I said, my incredulity no doubt lengthening my dolorous lantern-jaw. “That would require a multi-way data-hack. It’s impossible to hack into someone’s memories to that extent, not with the limited data-nodes we all possess, not even with the amount of offloading we do through our cerebral prosthetic implants. What you’re suggesting is hacking an entire family’s data-node. That would involve cutting them off from their host!”  I didn’t then know why, but my heart sank the moment I said it. Yun-Li’s eyes gleamed like a cat spotting untended mackerel.  “Cutting them off from their host, yes, that would be an interesting challenge,” Yun-Li mused. “Perhaps, it would be more effective to cut an entire clan, wouldn’t you say?”  “That’s not possible! Think of the amount of work that would take,” I said, scoffing a bit louder than I should have. I should have known Yun-Li would take it as a challenge.  “Anything is possible if you possess the right connections and the wealth to make it happen,” Yun-Li’s voice was matter-of-fact even if she almost purred as she extended the words.  I really should have been wary of that purr.  “After all, we have living proof of that over there.” She pointed at the lecture-borg who was talking in a careful register about the coordinates of the next solar system and military armaments on its outer asteroid belt.  “Yes, but most of those came from more cybernetically advanced planets,” I argued.  “So did I,” Yun-Li said pointedly, an arched eyebrow reminding me that her parents were apsara nobility who had been transferred to our world, one of those civilizations more sophisticated Bunian Empire planets referred to as “backwash planets.”  Yun-Li always made sure we understood we were far beneath her. Especially one who came from a healthy but entirely peasant stock of farmers and food-sellers who had worked their way up in the world through goodwill and backbreaking labor.  By the time I left the academy, data theft was actually becoming quite redundant.  Our civilization didn’t need so much a sense of individual identity. Complete cyborgs, lecture-borgs, vessels, or prosthetically-enhanced humans—we all were reprogrammed to a certain degree. Everyone was copying everyone else’s military formation strategies and improving upon them. Why would anyone need to steal my identity? Why would anyone want to perform a data theft so total? How could elision be a thing so total, so complete?  To my mind, it would require a rather colossal grudge. What had I ever done to Yun-Li? I’d been cordial with her, occasionally kind. I amended this earlier assessment of mine, however. With some people, any reason would do. For Yun-Li, no reason was a perfect reason. Perhaps it started when I began distancing myself from her, wearied of her constant need to maim others with her words and her aristocratic put-downs. But now that I muse upon it, I think I unknowingly challenged her that afternoon. It was a challenge she never forgot, a game she decided to play because it amused her.  I never considered myself important enough that anyone would want to steal my identity. By the time I reached my thirties and was promoted as Commodore, it was inconceivable that such a thing would happen—particularly not to me. Not when there were more important officials, more luminous members of the younger academy. Who would want to steal my identity? I wasn’t even special. I was nothing.  Yun-Li said so more than once, during and after our time as cadets. She was still a Captain and chafed with resentment at what she felt was preferential treatment accorded to an inferior.  “I still don’t understand why you got promoted to Commodore,” she would say laughingly as she swiped more of my inexhaustible resources of candied ginger and salted plums. “You’re so boring. Dreary and homespun. And so depressed all of the time. You’re not even that bright! I’m smarter than you!” she would assert.  “I don’t understand why you’re always talking to me if you think I’m all that dreary,” I would protest mildly, even as I chewed on candied ginger while programming a sequence of maneuvers onto my console which followed me wherever I went. All we had to do on the station was press a thumb and forefinger in a certain way, and the screen would open in front of us (although in reality, what we saw was transmitted through the cyber-optic interface grafted onto our eyes when we were babies).  We were stationed together on Perak-IV, a satellite on an elliptical orbit around our planet. There, we learned to create different battle simulations, and were helmeted into neural suits so we could enter those simulations. I had been top in the class for strategies and simulations before Yun-Li joined us.  Inexplicably, she rose very quickly in our ranks.  She did this by staying close to me. She didn’t seem to like me very much, but she’d attached herself to me, nonetheless. I grew as used to her as you would to anyone you were forced to have anything to do with. Beggars aren’t choosers if you’re in the Bunian Fleet. You are stationed wherever your superiors say you are stationed. You are grouped together with people you may not like. Matters not. You need to work together as a unit. So I endured Yun-Li. And she followed my lead, though she was vocal in her scorn.  What we had been taught to do on our tablets with diagrams and charts, intricate beyond belief were now envisioned into more dimensions than I could ever imagine.  I thrilled to enter that space. I allowed my consciousness the illusion of being untethered from my body as the stars spread around me. I was on a battle ship piloted sometimes only by me and what we called ghosts, simulated crews of ships. We entered into the thick of battle with myriad vessels from rival Bunian Fleets, for out here, some of the Imperial houses of the Bunian had broken away from the Empire, and fought for planetary resources, and dominance.  We won all our battles, both simulated and real.  I suppose you could say we were a good team, although it became uncanny how good Yun-Li was at reading me, at anticipating my every move. It was frightening how her pristine, near-perfect strategy simulations were like mine, even if I never showed them to her before we pitched them to the Fleet Admiral.  There was a popular song when I was a teenager that went something like this:  We are all nodes but who is the host, who is the host? The host travels the skies from valley to coast, The host holds all that we offload, The host returns us to the ancestor’s roads. We are all nodes but where is the host, where is the host? The host travels the stars from galaxy to galaxy The host churns our dreams in a roiling cosmic sea. I was never the most cheerful of sorts. You could call me a plodder, who was more than happy when the generals or lecture-borgs instructing us made us do equations and diagrams in primitive ways—using abacuses and calculators, and sheets of parchment they’d procured for us. We had to prepare for every eventuality, they said. We never knew where we would be stationed. Some planets had little to no equipped tech. Some planets had colonists with no nodes installed. Not at the nape of their neck, not injected into their cranium, not at the base of their spine.  I thought it sounded heavenly but not everybody agreed.  Perhaps if I had grown up on one of those planets, I would still have a home and a family. But if I had grown up on one of those planets that were not even honored with the term “backwash,” I would not have met Zhilang here on Teja-II. I would not have caught them stealing orchids from the nursery while I was doing my rounds as the astro-horticulturist on call.  We would not have talked long past my duty, they would not have drawn me to their quarters where they prepared spinach noodles drizzled with sesame oil. I would not have collapsed into their arms, crying at the loss of my name, my identity.  “Zhen-Juan is a beautiful name, one that befits you,” Zhilang told me as they stroked my hair and caressed the side of my face.  “That is not my name,” I said. “The name that they gave me when they rehabilitated me was Jaya-Sri.”  “Rehabilitation is the first step in recovery from data-theft, but it is not the only step. You can make the identity you want. You can make the life you want fit the name you give it. Do you not think Zhen-Juan a lovely name?”  Lulled by the quiet beauty of Zhilang’s voice, drunk on the limpid perfection of their eyes, I agreed. I took the new name as my own because it felt right. Zhilang became my family and my place in the world. It did not take too long before I moved my things into their quarters, and buried my gnawing emptiness within the soft cocoon of their arms, and the fragrant net of their long hair.  I started growing soybeans hydroponically in the spacious backyard in our quarters, artificially lit and kept humid by Teja-II’s advanced light and weather systems. I started making soybean curd for both of us to enjoy, sweetened with ginger-infused syrup. I began the process of regaining what I had lost, and enacting the parts of the fail-safes set into place when we realized what Yun-Li had done but knew it was too late to stem the inevitable tide. Tracing back your steps to your home planet from across a thousand years is not something we were taught in the academy.  What do you do with a data thief? Do you skin her, or turn her into a forgotten cylindrical drive, fit for powering vessels that transported crude fuel from planet to satellite, from planet to planet?  Teja-II is a circuit-station that traverses the horsehead nebula from end to end, collecting supplies, travelers, and human resources, a moveable fixed point in most navigation systems, which meant that ships, cruisers, minor battle-stations, and other interstellar vehicles were always able to find Teja-II wherever she was. Teja-II is also in the second Tier of circuit-stations, equipped with drives that would be able to traverse galaxies in a blink of an eye. A hundred years? No problem. Surfing galactic currents kept Teja-II on its course, but it was a loop. Which meant that a mere ten years had passed for me and people on more advanced planets. But not for the denizens of backwash planets. Some of this technology was distilled further in the little bullets of motion the Bunian Fleet use to jump through timelines to fix errors in our exodus across the universe.  Teja-II medics recognized enough that I had been the victim of a severe data-theft after they had rescued my capsule from the abandoned hospital station. Bits of my memory that had been formatted out of me were recovered. Bits of it. But not the name of my family, nor the coordinates of my home planet.  (Oddly, I have no problem at all remembering Yun-Li. It was no kindness she did by leaving all of those memories in whilst removing those that were so integral to my sense of self. Or so she thought.)  Yun-Li knew how to bend others to her will, even if they hated her. Even if they feared her. With her heart-shaped faced and a mindboggling array of colorful thigh-high boots, she tapped her own rhythm on the hearts of people’s around her. She played with people’s perceptions even as she cobbled together her military strategies out of the charts and plans she pilfered through her infiltration of my nodes.  To hide the trace of her thefts, she would often claim she had read several hundred books of military strategy, some ancient enough to have originated from a long-imploded Earth. Perhaps she could have come up with those strategies on her own. We read the same books. But no—it was sweet vengeance for her to steal. It is a perversely circular logic, but that is Yun-Li for you. She was self-destructive even in her urge to destroy others. She needed the danger of risks, of transgressions out in the open. Why else would she have left her data signature imprinted, one over one of my irises, the other on the mole above my right thigh?  Yun-Li wore her generosity of programmed curls in four flat buns at the back of her head, augmented with mother-of-pearl and zirconium chopsticks. Her cybernetically-enhanced irises were as hard and cold as her features were warm. I’ve heard her described by a rival as having eyes that had no emotion, only coldness. I would have agreed with the sentiment, had I not found her rival equally disturbing. I did not see the coldness in Yun-Li’s eyes as reflective of frigidity or the lack of emotion, however. Her ice, was as extreme as much of her was extreme, from her curves that were shown off to advantage in the exquisite cut of her various uniforms, to the elegant artifice of the flight formations she drafted in interstellar strategy class. Within the ice, a flicker of something. Was it hurt or avarice? You could never tell with Yun-Li.  Like quicksilver, she was prone to acts of charity as much as acts of negligence or of casual cruelty. But her lower lip would be an indicator of her moods far more accurately than her eyes. An obstinate hardening, a vulnerable wobble, a pout that tried too hard to be seductive. In our postings together, I had learned to decipher Yun-Li’s moods but not enough to decipher her zeal for destroying me.  Spasmodic, the remembrance of her is a tic in the middle of the night that needs to be pushed aside. Along with vengeance. Along with guilt.  I nestle against my mate, their tranquil snores soothing my painful memories. They stir in my arms and turn, nuzzling into my collarbone before slipping into deeper sleep, their level of unconsciousness signaling itself on my own nodes. We share some data-streams between our nodes, as is usual for those who have opted for life-mating.  We make our own identities. Or we lose them, as Yun-Li lost hers when she tried to siphon away mine.  With this next journey that I have to make comes a decision and a choice.  Always, I struggle with these choices. Between the life I lead here and my desire to return to a past that had been stolen from me. Between that and what the Bunian Fleet requires of me in their constant covert operations to correct the past. To correct the fabric of our civilizations  I breathe in the herbal fragrance of my spouse’s newly washed hair and close my eyes against the tears that no prosthetic consciousness could halt.  I did my research over the years of progressing from apprentice horticulturist on Teja-II to being chief horticulturist after my foster parent and mentor passed on. I was able to trace my steps back to the counter-commands my first foster mother dispatched along with my body. I was able to contact the Bunian Fleet with the missive that led to my double-life. On Teja-II as a horticulturist, and elsewhere, whenever I was needed to tactically inject myself into the mistakes committed by the Fleet in the past—mistakes such as the total obliteration of the human race in more than one galaxy. Small mistakes in the grand scheme of things, the Imperial Ones would have us believe.  (My second foster parent’s brain is now encased in a metal cylinder powering a battleship, two galaxies down, which is probably the end that’s waiting for me, after all of my adventures through time and hyperspace are done.)  At night, Zhilang and I cook our meals together. They love my mutton kut teh although I could never cook it as well as my Ah Ma. We play draughts on a marble board, and then we settle to bed, to read. They favored epic historical romances of intergalactic ship-wars in the early days of the Bunian Empire. They delighted in reading those romances to me.  If Yun-Li had not been so enamored of her own intelligence, she would have realized a fundamental truth about the person she was attempting to elide.  There are many versions of me.  Perhaps the version she thought to override has a copy somewhere with the host, the unspecified host of my node-clan. Suffice it to say, there are versions of me she would not be so happy to absorb. Like that version of me who spent most of her life partly paralyzed because of a flaw in her lower spine.  I have an extra node. A node that rests at the base of my spine.  It was put in there by Surgeon-Admiral Mei-Lee. There, at the base of my spine is the memory of my life in paralysis, and later with a stooped back and a limp, after my father paid for the best surgery he could afford. There, at the base of my spine lay a set of invisible teeth, waiting to chomp at the hands that robbed me from my family.  We did what we could to undo the data-hack, a virus that had already begun eating away most of my memories.  “It is linked to the central node of your family’s data-banks,” said Surgeon-Admiral Mei-Lee as she checked the readout on her screen, invisible to me except in the furrowing of her brow and the movements of her irises from left to right, up and down.  “How could you have been so careless!” My first foster-mother fumed.  “What . . . does that mean what I think it means?” I asked. I was propped on the padded operating chair, not feeling anything beneath my neck as machines drilled into my nodes beneath me.  “I am so sorry, but yes, it does mean that this data-hack is almost ineradicable. In about five weeks, your family’s memories of you will be wiped. If we lived on a less advanced planet, perhaps this would not have happened. But offloading memories onto a host has been part of our lifestyle for three centuries now.”  “Can we not find the host where the memories have been offloaded?” I asked, desperate. I could not feel my body, but my brain felt all the pain that was necessary. To be forgotten, to be cut away from a heritage of love. It felt unimaginable.  Mei-Lee shook her head sadly. “I wish we could. I really do. But the hosts are peripatetic and difficult to access. I’ve contacted the Surgeon-Admirals of the Bunian Fleet for you but they said even they cannot access the host. Only those in imperial command can do such a thing, but they are over a thousand light-years away from us. We do not have the means to reach them. But I will do my best. We’ll transfer you to a hospital station, and arrange for you to be brought to Imperial Command.”  “What can I do then?” I cried out.  “Keep still, don’t fidget, we’re still working on your nodes,” Mei-Lee said. “Our knowledge may not be as sophisticated as the technology Yun-Li has been using to siphon your memories, but we can do what we can. I’m sending you to the hospital ship where one of the moveable stations can collect you. But hold still!”  “I don’t know if I’m fidgeting, I can’t control my body right now, remember?”  My first foster mother sighed. “You’re right. I’ll have to fully anaesthetize you then. I am so sorry. We can continue this discussion after we’ve done with the procedure.”  “No, wait!” I said, thinking quickly.  She quirked an eyebrow, and listened as I told her my plan. Mei-Lee gave an appreciative laugh. “Well, General, you may or may not be a vegetable in about five weeks from now but you’re one of our finest strategists. I will do what I can to make your plans come true. And we’ll figure out the rest.”  Of course they promoted me to General five weeks before I was going to lose the memories that tied me to time and place. They thought it was a gift. I laughed in those days as I laughed at everything. With the ghost of my dolorous and ironic humor. With a lacing of acrid pain.  She nodded at one of the junior surgeons who administered the neuro-anaesthetic.  It amuses me to think that I have traveled back and forth over a millennium’s worth of light-years. Past me, and present me. The name that I had lost. And Yun-Li, where I have left her.  I wish our efforts had been enough—but our knowledge and our technologies had been inferior to those on Teja-II. Too inferior to the other Bunian Fleets. By the time I discovered the coordinates of my home, and found my true name, my Ah Ma and Ah Pa had all passed on. By the time I regained all of my memories, I was a thousand light-years away.  But you and I, Yun-Li. You and I have become immortal through the alchemy of superluminal flight. Through the hacks in our systems. And you, Yun-Li, you have forgotten your name, as I had forgotten mine.  Yun-Li wears my name now as she serves me mutton kut teh and chrysanthemum tea. I am seated at a marble-topped table in a multi-winged heritage Chinese Muslim restaurant. It sprawls over the site that used to contain our home, our cafeteria and the sprawling soybean and vegetable gardens. Crouched and bent, she walks with an unmistakeable limp, one that used to define who I was as a person.  Around us are an assemblage of cybernetic humans, people consuming food through holographic proxy, with a scatter of other bio-technically enhanced humans. This is part of the present that I will need to correct. A part of the mission that I am on, to restore humanity to the universe in the closest approximation of their original forms.  Upon her spine, the phantom of the injuries that had maimed me as a teen.  Yun-Li no longer looks even partially human. Her face is a prosthetic, marble-like in shape and texture. She walks with a metallic clank that tells me most of her body is now inorganic. But the teeth on her spine remain, a remnant of the person I was. Inexplicably, the four flat buns are still neatly arranged at the back of her head, a remnant of the girl-cadet who attached herself to me with such honeyed malice.  An imperial decree renders her immortal penance, long after I had left this quadrant of our galaxy. Long before I had finally gained my audience at the center of the Bunian Fleet.  Long before I was made one of the time-jumping Admirals.  Yun-Li wanted to hack into my memories and who I was. It was not so difficult to allow her to absorb a version of me she had never known. A maimed version of me, who thought she would serve in her father’s cafeteria her whole life. A version of me without the corrective prosthetics.  Now, as Yun-Li’s eyes meet mine without a trace of recognition, I wonder if I will return to her a name, and an identity. Would that be a compassion or a further cruelty? I have the implant that will fit easily in the node that she carries behind her left ear. I have another implant that will return to me the rest of my memories that she took on her own without sustaining the paralysis we planted as a trap.  I dip my chopsticks into the bowl of meat infused with herbs. The tenderness of the meaty grain, so succulent against the tongue. The meat bone tea Yun-Li cooks is so like the dish made by my Ah Ma, so many hundreds of years ago. I close my eyes to enjoy my meal. Yun-Li cooks like my mother, because she lived in my stead. She is now required to keep those traditions going, year after year, until every last bit of her that is organic will be replaced. Well, in this timeline at least.  Did my parents not recognize her eyes were not mine, that her laughter was not mine? Perhaps if we had not been culturally conditioned to offload all of our memories to the host, this would not have happened. Where is the host? Where is it?  But in a way they had that version of me who lived with them before the surgery that straightened my spine. Before I left them to join the military. Before I started doing the dirty work of the Bunian Empire’s higher military command, albeit with a slight detour thanks to the ceaseless interstellar wars in our galactic quadrant.  They got the daughter I could have been.  “Are you sure you want her to achieve her ultimate goal?” Mei-Lee asked me that one last time.  “It’s not really an ultimate goal if she loses her own memories is it?” I said thoughtfully. We had already placed a counter-virus in my nodes, and the moment when my memories and the memories of my parents were erased, would also mark the erasure of Yun-Li’s presence. That was my request. Mei-Lee wanted her turned into a ship’s generator.  I paused. And said, “I do not want my Ah Ma and Ah Pa to feel the pain of knowing what happened to me. The pain of knowing their memories of me have been replaced with memories of . . . a cuckoo in the nest. I will be far away from you. I do not know how long it will take before I return. Before I carry out the mission you have entrusted to me.”  Mei-Lee nodded, “So you consent to letting Yun-Li be a . . . prosthetic daughter?”  Despite my sadness, I could not help but laugh. “Yes, until I figure out my way back to where I should be.”  “Out of all of our graduates from the academy, you are the one who would be able to figure that out,” said my first foster mother.  “You have that much faith in me?” I asked, my eyes welling up one last time as the person I had been.  “We always had that faith in you. I always had that faith in you.” Mei-Lee said.  “I never understood why,” I said plaintively.  Mei-Lee smiled and squeezed my hand as I went under. “You will,” she said.  And that was my last memory of home before they transferred me to the hospital station. The hospital station that was hijacked and occupied by a rival Bunian Fleet, effectively cutting me off from the nodes that sustained me and which would have given me the coordinates of my home planet.  (What a circuitous route I have taken, through a lifetime on Teja-II, through another lifetime with the Bunian Fleet! All of the parts of me my sweet Zhilang does not know.)  Yun-Li meets my eyes, and asks me if I would like some more chrysanthemum tea.  I allow her to bring me a pot. I sip my tea as I deliberate, like my Ah Pa, like all of my ancestors, through all the years that separate us from our homelands.  Across the centuries, the advice of my Ah Pa rings in my ears, “Rise up in the ranks, my daughter. Be one of the Imperial Fleet’s Higher Command. But do not be like them. Wherever in life you are my daughter, remember the doctrines of our people. Always remember to be kind.”  But Ah Pa, what she did stole you from me. Stole my family from me. If I had the power, if I could, I would fight my way back through all of those years, I would hunt down the data-host. I would stop Yun-Li in her tracks. I would never lose all of you.  Ah Pa, Ah Ma. I’m coming home to you. I will do whatever it takes to fight time itself, fight technology, fight destiny until I am by your side again. That was why I agreed to carry out these time-jumping covert missions. Through all of these interstellar gateways and circuits through the universes.  Through all of the wonders of the universe I have seen, there is only one wonder that I chase, of sitting down to dinner with you, as your true daughter, on Yunglo XIV-V.  Data theft is murder and will incur severe penalties.  This has been a message from the Ministry of Cybernetic Safety and Defense. Yunglo-XIV-V. Nin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee.", "text": "5880 words, short story\nProsthetic Daughter\nTranscript #56565: Admiral Zhen-Juan’s DataStreamLog\nData theft is identity theft.\nWe sat through so many lectures and briefings that recycled this information. At the academy, the lecture-borgs would do their rounds from class to class every morning and before the end of the day.\nIt should have been enough. It wasn’t enough. Data-hacks still happened. Vanished identities, vanished memories. People who were mere husks, ready to be reprogrammed by unscrupulous dealers. I never thought I would be one of them. Perhaps I should have been paying more attention.\nProtect your memory nodes. Sleep safe.\nJacking into someone’s node is theft.\nWe had nodes installed three generations back. According to my Ah Ma, for hundreds of years we would not have been identifiable as human to our ancestors. Prosthetics had become part of who we are. We’d evolved, or devolved from people who could do complex mathematical conundrums in our heads without augmentation and who could memorize entire lists and taxonomies, to people with augmentations implanted into our nodes.\nAh Ma said this to me once: “Our tragedy in life is that we will never know what our ancestors knew. At least, not in the same way they did. In a way, we are all like you, child. You have prosthetics correcting your spine, but we were all fitted with prosthetics in our brains since we were children.”\n“You couldn’t have stopped them from doing it to us if you hated it that much?” I asked Ah Ma whenever she started bemoaning our prosthetic brains. I asked her annoying questions like this mostly because I was annoyed by her constant lamentations in my teenage years. As annoyed as I was by the reminder that I was not as physically able as the rest of my family members. I had needed corrective surgery in order to jump, to run. To do all of those things required of a cadet in a military academy.\nAh Ma would look at me and say, “And what would happen to you on this planet if you had? Would you have been able to be a cadet?”\nOh Ah Ma. If you had stopped it, I would still have been with you and Ah Pa. With my brothers and sisters. But instead, here I am on a circuit station when I am not jumping in-between time-streams as a time-and-space-hopping Admiral.\nI could have reached you in time if the pod with my data-wiped body had not been on a hijacked hospital station in an interstellar war zone. But there are never any guarantees in space. There are far less guarantees in time.\nMy ancestors came from a distant Earth. More specifically, most of them came from Fujiuan in China, although there were intermarriages between my Fuzhou, Hainanese, and Cantonese ancestors. Various other provinces and dialects intermingled through time and intermarriages and various religious conversions: Buddhist, Methodist, and Muslim. During the great exodus from Earth, my ancestors ranged across the skies led by a Bunian Interstellar Armada. Once re-settled on a planet close in climate and temperament to Earth, my ancestors became involved in the terraforming of the planet.\nAs a society was established, they became farmers, and then a family of food-sellers. Because we lived on a planet that was predominantly populated by apsaras, Malays, Pattani, and Chinese Muslims, we sold: halal long-boiling soups, chicken and mutton kut teh, and handmade noodles tossed in sesame oil and soy sauce before being served with fresh pak choy from my father’s gardens, and roasted duck. These were consumed eagerly by off-duty hungry officers and common-folk alike. Our cafeteria was very popular with the military. I grew up used to the sight of members of the Bunian Fleet in their various uniforms: tunics and tights for the cadets, long button-down military coats for lance-corporals, and jumpsuits that looked lighter than air for the higher ranking commodores, lieutenants, and admirals.\nOne of them, Surgeon-Admiral Mei-Lee, became my sponsor in the academy. She started teaching me military history and strategy every time she visited. Surgeon-Admiral Mei-Lee told my Ah Pa, “There’s a fine military mind in your home. I hope you will not be too selfish, let us take care of her. I can correct her spine with prosthetics. And we will nurture her talents for strategy.”\nHundreds of years away from that moment when I eavesdropped, I now know my first foster-mother was not guided by altruism alone. She was genuinely curious to see if she could fix me, if she could turn me into a Fleet Admiral. That was not the first time I was adopted. First by the military, later by my second foster mother on Teja-II. I had a family stolen from me, but I have had three mothers in my lifetime. I suppose that counts for something.\nJacking into someone’s node is identity crime.\nJacking into someone’s node is death.\n“I could do it so well, no one would know who you were. I could do it so well, you won’t know who you are,” Yun-Li said to me once, her eyes dancing as she stole three preserved plums from the small box of preserved fruits I kept in the shelf beneath my desk.\nI swatted at her fingers with a translucent ruler but her fingers danced as fast as her eyes and the thoughts that flitted there. We were talking about the lecture-borgs who periodically entered our course-rooms to deliver the service messages of the day. The units used to be professors and higher officers of the Bunian Fleet who were completely mind-wiped thanks to data-hacks.\n“I supposed you could,” I remembered saying doubtfully as I looked at the curves of her heart-shaped face, “but why would you want to do such a thing?”\nShe shrugged. “Why not? It would be fun. And you’re so tedious, who would miss you?”\nYun-Li had a gift for saying precious things like this. With a droll, matter-of-fact expression, she was able to make the people around her feel like she had said the funniest and wittiest thing a person could say, but the bite it left was like the aftertaste of poison lacing a bowl of mung bean sweet porridge.\n“My family would miss me,” I said. My voice was as stoic as my face was long.\n“They wouldn’t miss you, Horseface. Not if they couldn’t remember you,” Yun-Li said, coy as she played with her fingers, a habit of hers that I found annoying.\n“That’s not possible,” I said, my incredulity no doubt lengthening my dolorous lantern-jaw. “That would require a multi-way data-hack. It’s impossible to hack into someone’s memories to that extent, not with the limited data-nodes we all possess, not even with the amount of offloading we do through our cerebral prosthetic implants. What you’re suggesting is hacking an entire family’s data-node. That would involve cutting them off from their host!”\nI didn’t then know why, but my heart sank the moment I said it. Yun-Li’s eyes gleamed like a cat spotting untended mackerel.\n“Cutting them off from their host, yes, that would be an interesting challenge,” Yun-Li mused. “Perhaps, it would be more effective to cut an entire clan, wouldn’t you say?”\n“That’s not possible! Think of the amount of work that would take,” I said, scoffing a bit louder than I should have. I should have known Yun-Li would take it as a challenge.\n“Anything is possible if you possess the right connections and the wealth to make it happen,” Yun-Li’s voice was matter-of-fact even if she almost purred as she extended the words.\nI really should have been wary of that purr.\n“After all, we have living proof of that over there.” She pointed at the lecture-borg who was talking in a careful register about the coordinates of the next solar system and military armaments on its outer asteroid belt.\n“Yes, but most of those came from more cybernetically advanced planets,” I argued.\n“So did I,” Yun-Li said pointedly, an arched eyebrow reminding me that her parents were apsara nobility who had been transferred to our world, one of those civilizations more sophisticated Bunian Empire planets referred to as “backwash planets.”\nYun-Li always made sure we understood we were far beneath her. Especially one who came from a healthy but entirely peasant stock of farmers and food-sellers who had worked their way up in the world through goodwill and backbreaking labor.\nBy the time I left the academy, data theft was actually becoming quite redundant.\nOur civilization didn’t need so much a sense of individual identity. Complete cyborgs, lecture-borgs, vessels, or prosthetically-enhanced humans—we all were reprogrammed to a certain degree. Everyone was copying everyone else’s military formation strategies and improving upon them. Why would anyone need to steal my identity? Why would anyone want to perform a data theft so total? How could elision be a thing so total, so complete?\nTo my mind, it would require a rather colossal grudge. What had I ever done to Yun-Li? I’d been cordial with her, occasionally kind. I amended this earlier assessment of mine, however. With some people, any reason would do. For Yun-Li, no reason was a perfect reason. Perhaps it started when I began distancing myself from her, wearied of her constant need to maim others with her words and her aristocratic put-downs. But now that I muse upon it, I think I unknowingly challenged her that afternoon. It was a challenge she never forgot, a game she decided to play because it amused her.\nI never considered myself important enough that anyone would want to steal my identity. By the time I reached my thirties and was promoted as Commodore, it was inconceivable that such a thing would happen—particularly not to me. Not when there were more important officials, more luminous members of the younger academy. Who would want to steal my identity? I wasn’t even special. I was nothing.\nYun-Li said so more than once, during and after our time as cadets. She was still a Captain and chafed with resentment at what she felt was preferential treatment accorded to an inferior.\n“I still don’t understand why you got promoted to Commodore,” she would say laughingly as she swiped more of my inexhaustible resources of candied ginger and salted plums. “You’re so boring. Dreary and homespun. And so depressed all of the time. You’re not even that bright! I’m smarter than you!” she would assert.\n“I don’t understand why you’re always talking to me if you think I’m all that dreary,” I would protest mildly, even as I chewed on candied ginger while programming a sequence of maneuvers onto my console which followed me wherever I went. All we had to do on the station was press a thumb and forefinger in a certain way, and the screen would open in front of us (although in reality, what we saw was transmitted through the cyber-optic interface grafted onto our eyes when we were babies).\nWe were stationed together on Perak-IV, a satellite on an elliptical orbit around our planet. There, we learned to create different battle simulations, and were helmeted into neural suits so we could enter those simulations. I had been top in the class for strategies and simulations before Yun-Li joined us.\nInexplicably, she rose very quickly in our ranks.\nShe did this by staying close to me. She didn’t seem to like me very much, but she’d attached herself to me, nonetheless. I grew as used to her as you would to anyone you were forced to have anything to do with. Beggars aren’t choosers if you’re in the Bunian Fleet. You are stationed wherever your superiors say you are stationed. You are grouped together with people you may not like. Matters not. You need to work together as a unit. So I endured Yun-Li. And she followed my lead, though she was vocal in her scorn.\nWhat we had been taught to do on our tablets with diagrams and charts, intricate beyond belief were now envisioned into more dimensions than I could ever imagine.\nI thrilled to enter that space. I allowed my consciousness the illusion of being untethered from my body as the stars spread around me. I was on a battle ship piloted sometimes only by me and what we called ghosts, simulated crews of ships. We entered into the thick of battle with myriad vessels from rival Bunian Fleets, for out here, some of the Imperial houses of the Bunian had broken away from the Empire, and fought for planetary resources, and dominance.\nWe won all our battles, both simulated and real.\nI suppose you could say we were a good team, although it became uncanny how good Yun-Li was at reading me, at anticipating my every move. It was frightening how her pristine, near-perfect strategy simulations were like mine, even if I never showed them to her before we pitched them to the Fleet Admiral.\nThere was a popular song when I was a teenager that went something like this:\nWe are all nodes but who is the host, who is the host?\nThe host travels the skies from valley to coast,\nThe host holds all that we offload,\nThe host returns us to the ancestor’s roads.\nWe are all nodes but where is the host, where is the host?\nThe host travels the stars from galaxy to galaxy\nThe host churns our dreams in a roiling cosmic sea.\nI was never the most cheerful of sorts. You could call me a plodder, who was more than happy when the generals or lecture-borgs instructing us made us do equations and diagrams in primitive ways—using abacuses and calculators, and sheets of parchment they’d procured for us. We had to prepare for every eventuality, they said. We never knew where we would be stationed. Some planets had little to no equipped tech. Some planets had colonists with no nodes installed. Not at the nape of their neck, not injected into their cranium, not at the base of their spine.\nI thought it sounded heavenly but not everybody agreed.\nPerhaps if I had grown up on one of those planets, I would still have a home and a family. But if I had grown up on one of those planets that were not even honored with the term “backwash,” I would not have met Zhilang here on Teja-II. I would not have caught them stealing orchids from the nursery while I was doing my rounds as the astro-horticulturist on call.\nWe would not have talked long past my duty, they would not have drawn me to their quarters where they prepared spinach noodles drizzled with sesame oil. I would not have collapsed into their arms, crying at the loss of my name, my identity.\n“Zhen-Juan is a beautiful name, one that befits you,” Zhilang told me as they stroked my hair and caressed the side of my face.\n“That is not my name,” I said. “The name that they gave me when they rehabilitated me was Jaya-Sri.”\n“Rehabilitation is the first step in recovery from data-theft, but it is not the only step. You can make the identity you want. You can make the life you want fit the name you give it. Do you not think Zhen-Juan a lovely name?”\nLulled by the quiet beauty of Zhilang’s voice, drunk on the limpid perfection of their eyes, I agreed. I took the new name as my own because it felt right. Zhilang became my family and my place in the world. It did not take too long before I moved my things into their quarters, and buried my gnawing emptiness within the soft cocoon of their arms, and the fragrant net of their long hair.\nI started growing soybeans hydroponically in the spacious backyard in our quarters, artificially lit and kept humid by Teja-II’s advanced light and weather systems. I started making soybean curd for both of us to enjoy, sweetened with ginger-infused syrup. I began the process of regaining what I had lost, and enacting the parts of the fail-safes set into place when we realized what Yun-Li had done but knew it was too late to stem the inevitable tide. Tracing back your steps to your home planet from across a thousand years is not something we were taught in the academy.\nWhat do you do with a data thief? Do you skin her, or turn her into a forgotten cylindrical drive, fit for powering vessels that transported crude fuel from planet to satellite, from planet to planet?\nTeja-II is a circuit-station that traverses the horsehead nebula from end to end, collecting supplies, travelers, and human resources, a moveable fixed point in most navigation systems, which meant that ships, cruisers, minor battle-stations, and other interstellar vehicles were always able to find Teja-II wherever she was. Teja-II is also in the second Tier of circuit-stations, equipped with drives that would be able to traverse galaxies in a blink of an eye. A hundred years? No problem. Surfing galactic currents kept Teja-II on its course, but it was a loop. Which meant that a mere ten years had passed for me and people on more advanced planets. But not for the denizens of backwash planets. Some of this technology was distilled further in the little bullets of motion the Bunian Fleet use to jump through timelines to fix errors in our exodus across the universe.\nTeja-II medics recognized enough that I had been the victim of a severe data-theft after they had rescued my capsule from the abandoned hospital station. Bits of my memory that had been formatted out of me were recovered. Bits of it. But not the name of my family, nor the coordinates of my home planet.\n(Oddly, I have no problem at all remembering Yun-Li. It was no kindness she did by leaving all of those memories in whilst removing those that were so integral to my sense of self. Or so she thought.)\nYun-Li knew how to bend others to her will, even if they hated her. Even if they feared her. With her heart-shaped faced and a mindboggling array of colorful thigh-high boots, she tapped her own rhythm on the hearts of people’s around her. She played with people’s perceptions even as she cobbled together her military strategies out of the charts and plans she pilfered through her infiltration of my nodes.\nTo hide the trace of her thefts, she would often claim she had read several hundred books of military strategy, some ancient enough to have originated from a long-imploded Earth. Perhaps she could have come up with those strategies on her own. We read the same books. But no—it was sweet vengeance for her to steal. It is a perversely circular logic, but that is Yun-Li for you. She was self-destructive even in her urge to destroy others. She needed the danger of risks, of transgressions out in the open. Why else would she have left her data signature imprinted, one over one of my irises, the other on the mole above my right thigh?\nYun-Li wore her generosity of programmed curls in four flat buns at the back of her head, augmented with mother-of-pearl and zirconium chopsticks. Her cybernetically-enhanced irises were as hard and cold as her features were warm. I’ve heard her described by a rival as having eyes that had no emotion, only coldness. I would have agreed with the sentiment, had I not found her rival equally disturbing. I did not see the coldness in Yun-Li’s eyes as reflective of frigidity or the lack of emotion, however. Her ice, was as extreme as much of her was extreme, from her curves that were shown off to advantage in the exquisite cut of her various uniforms, to the elegant artifice of the flight formations she drafted in interstellar strategy class. Within the ice, a flicker of something. Was it hurt or avarice? You could never tell with Yun-Li.\nLike quicksilver, she was prone to acts of charity as much as acts of negligence or of casual cruelty. But her lower lip would be an indicator of her moods far more accurately than her eyes. An obstinate hardening, a vulnerable wobble, a pout that tried too hard to be seductive. In our postings together, I had learned to decipher Yun-Li’s moods but not enough to decipher her zeal for destroying me.\nSpasmodic, the remembrance of her is a tic in the middle of the night that needs to be pushed aside. Along with vengeance. Along with guilt.\nI nestle against my mate, their tranquil snores soothing my painful memories. They stir in my arms and turn, nuzzling into my collarbone before slipping into deeper sleep, their level of unconsciousness signaling itself on my own nodes. We share some data-streams between our nodes, as is usual for those who have opted for life-mating.\nWe make our own identities. Or we lose them, as Yun-Li lost hers when she tried to siphon away mine.\nWith this next journey that I have to make comes a decision and a choice.\nAlways, I struggle with these choices. Between the life I lead here and my desire to return to a past that had been stolen from me. Between that and what the Bunian Fleet requires of me in their constant covert operations to correct the past. To correct the fabric of our civilizations\nI breathe in the herbal fragrance of my spouse’s newly washed hair and close my eyes against the tears that no prosthetic consciousness could halt.\nI did my research over the years of progressing from apprentice horticulturist on Teja-II to being chief horticulturist after my foster parent and mentor passed on. I was able to trace my steps back to the counter-commands my first foster mother dispatched along with my body. I was able to contact the Bunian Fleet with the missive that led to my double-life. On Teja-II as a horticulturist, and elsewhere, whenever I was needed to tactically inject myself into the mistakes committed by the Fleet in the past—mistakes such as the total obliteration of the human race in more than one galaxy. Small mistakes in the grand scheme of things, the Imperial Ones would have us believe.\n(My second foster parent’s brain is now encased in a metal cylinder powering a battleship, two galaxies down, which is probably the end that’s waiting for me, after all of my adventures through time and hyperspace are done.)\nAt night, Zhilang and I cook our meals together. They love my mutton kut teh although I could never cook it as well as my Ah Ma. We play draughts on a marble board, and then we settle to bed, to read. They favored epic historical romances of intergalactic ship-wars in the early days of the Bunian Empire. They delighted in reading those romances to me.\nIf Yun-Li had not been so enamored of her own intelligence, she would have realized a fundamental truth about the person she was attempting to elide.\nThere are many versions of me.\nPerhaps the version she thought to override has a copy somewhere with the host, the unspecified host of my node-clan. Suffice it to say, there are versions of me she would not be so happy to absorb. Like that version of me who spent most of her life partly paralyzed because of a flaw in her lower spine.\nI have an extra node. A node that rests at the base of my spine.\nIt was put in there by Surgeon-Admiral Mei-Lee. There, at the base of my spine is the memory of my life in paralysis, and later with a stooped back and a limp, after my father paid for the best surgery he could afford. There, at the base of my spine lay a set of invisible teeth, waiting to chomp at the hands that robbed me from my family.\nWe did what we could to undo the data-hack, a virus that had already begun eating away most of my memories.\n“It is linked to the central node of your family’s data-banks,” said Surgeon-Admiral Mei-Lee as she checked the readout on her screen, invisible to me except in the furrowing of her brow and the movements of her irises from left to right, up and down.\n“How could you have been so careless!” My first foster-mother fumed.\n“What . . . does that mean what I think it means?” I asked. I was propped on the padded operating chair, not feeling anything beneath my neck as machines drilled into my nodes beneath me.\n“I am so sorry, but yes, it does mean that this data-hack is almost ineradicable. In about five weeks, your family’s memories of you will be wiped. If we lived on a less advanced planet, perhaps this would not have happened. But offloading memories onto a host has been part of our lifestyle for three centuries now.”\n“Can we not find the host where the memories have been offloaded?” I asked, desperate. I could not feel my body, but my brain felt all the pain that was necessary. To be forgotten, to be cut away from a heritage of love. It felt unimaginable.\nMei-Lee shook her head sadly. “I wish we could. I really do. But the hosts are peripatetic and difficult to access. I’ve contacted the Surgeon-Admirals of the Bunian Fleet for you but they said even they cannot access the host. Only those in imperial command can do such a thing, but they are over a thousand light-years away from us. We do not have the means to reach them. But I will do my best. We’ll transfer you to a hospital station, and arrange for you to be brought to Imperial Command.”\n“What can I do then?” I cried out.\n“Keep still, don’t fidget, we’re still working on your nodes,” Mei-Lee said. “Our knowledge may not be as sophisticated as the technology Yun-Li has been using to siphon your memories, but we can do what we can. I’m sending you to the hospital ship where one of the moveable stations can collect you. But hold still!”\n“I don’t know if I’m fidgeting, I can’t control my body right now, remember?”\nMy first foster mother sighed. “You’re right. I’ll have to fully anaesthetize you then. I am so sorry. We can continue this discussion after we’ve done with the procedure.”\n“No, wait!” I said, thinking quickly.\nShe quirked an eyebrow, and listened as I told her my plan. Mei-Lee gave an appreciative laugh. “Well, General, you may or may not be a vegetable in about five weeks from now but you’re one of our finest strategists. I will do what I can to make your plans come true. And we’ll figure out the rest.”\nOf course they promoted me to General five weeks before I was going to lose the memories that tied me to time and place. They thought it was a gift. I laughed in those days as I laughed at everything. With the ghost of my dolorous and ironic humor. With a lacing of acrid pain.\nShe nodded at one of the junior surgeons who administered the neuro-anaesthetic.\nIt amuses me to think that I have traveled back and forth over a millennium’s worth of light-years. Past me, and present me. The name that I had lost. And Yun-Li, where I have left her.\nI wish our efforts had been enough—but our knowledge and our technologies had been inferior to those on Teja-II. Too inferior to the other Bunian Fleets. By the time I discovered the coordinates of my home, and found my true name, my Ah Ma and Ah Pa had all passed on. By the time I regained all of my memories, I was a thousand light-years away.\nBut you and I, Yun-Li. You and I have become immortal through the alchemy of superluminal flight. Through the hacks in our systems. And you, Yun-Li, you have forgotten your name, as I had forgotten mine.\nYun-Li wears my name now as she serves me mutton kut teh and chrysanthemum tea. I am seated at a marble-topped table in a multi-winged heritage Chinese Muslim restaurant. It sprawls over the site that used to contain our home, our cafeteria and the sprawling soybean and vegetable gardens. Crouched and bent, she walks with an unmistakeable limp, one that used to define who I was as a person.\nAround us are an assemblage of cybernetic humans, people consuming food through holographic proxy, with a scatter of other bio-technically enhanced humans. This is part of the present that I will need to correct. A part of the mission that I am on, to restore humanity to the universe in the closest approximation of their original forms.\nUpon her spine, the phantom of the injuries that had maimed me as a teen.\nYun-Li no longer looks even partially human. Her face is a prosthetic, marble-like in shape and texture. She walks with a metallic clank that tells me most of her body is now inorganic. But the teeth on her spine remain, a remnant of the person I was. Inexplicably, the four flat buns are still neatly arranged at the back of her head, a remnant of the girl-cadet who attached herself to me with such honeyed malice.\nAn imperial decree renders her immortal penance, long after I had left this quadrant of our galaxy. Long before I had finally gained my audience at the center of the Bunian Fleet.\nLong before I was made one of the time-jumping Admirals.\nYun-Li wanted to hack into my memories and who I was. It was not so difficult to allow her to absorb a version of me she had never known. A maimed version of me, who thought she would serve in her father’s cafeteria her whole life. A version of me without the corrective prosthetics.\nNow, as Yun-Li’s eyes meet mine without a trace of recognition, I wonder if I will return to her a name, and an identity. Would that be a compassion or a further cruelty? I have the implant that will fit easily in the node that she carries behind her left ear. I have another implant that will return to me the rest of my memories that she took on her own without sustaining the paralysis we planted as a trap.\nI dip my chopsticks into the bowl of meat infused with herbs. The tenderness of the meaty grain, so succulent against the tongue. The meat bone tea Yun-Li cooks is so like the dish made by my Ah Ma, so many hundreds of years ago. I close my eyes to enjoy my meal. Yun-Li cooks like my mother, because she lived in my stead. She is now required to keep those traditions going, year after year, until every last bit of her that is organic will be replaced. Well, in this timeline at least.\nDid my parents not recognize her eyes were not mine, that her laughter was not mine? Perhaps if we had not been culturally conditioned to offload all of our memories to the host, this would not have happened. Where is the host? Where is it?\nBut in a way they had that version of me who lived with them before the surgery that straightened my spine. Before I left them to join the military. Before I started doing the dirty work of the Bunian Empire’s higher military command, albeit with a slight detour thanks to the ceaseless interstellar wars in our galactic quadrant.\nThey got the daughter I could have been.\n“Are you sure you want her to achieve her ultimate goal?” Mei-Lee asked me that one last time.\n“It’s not really an ultimate goal if she loses her own memories is it?” I said thoughtfully. We had already placed a counter-virus in my nodes, and the moment when my memories and the memories of my parents were erased, would also mark the erasure of Yun-Li’s presence. That was my request. Mei-Lee wanted her turned into a ship’s generator.\nI paused. And said, “I do not want my Ah Ma and Ah Pa to feel the pain of knowing what happened to me. The pain of knowing their memories of me have been replaced with memories of . . . a cuckoo in the nest. I will be far away from you. I do not know how long it will take before I return. Before I carry out the mission you have entrusted to me.”\nMei-Lee nodded, “So you consent to letting Yun-Li be a . . . prosthetic daughter?”\nDespite my sadness, I could not help but laugh. “Yes, until I figure out my way back to where I should be.”\n“Out of all of our graduates from the academy, you are the one who would be able to figure that out,” said my first foster mother.\n“You have that much faith in me?” I asked, my eyes welling up one last time as the person I had been.\n“We always had that faith in you. I always had that faith in you.” Mei-Lee said.\n“I never understood why,” I said plaintively.\nMei-Lee smiled and squeezed my hand as I went under. “You will,” she said.\nAnd that was my last memory of home before they transferred me to the hospital station. The hospital station that was hijacked and occupied by a rival Bunian Fleet, effectively cutting me off from the nodes that sustained me and which would have given me the coordinates of my home planet.\n(What a circuitous route I have taken, through a lifetime on Teja-II, through another lifetime with the Bunian Fleet! All of the parts of me my sweet Zhilang does not know.)\nYun-Li meets my eyes, and asks me if I would like some more chrysanthemum tea.\nI allow her to bring me a pot. I sip my tea as I deliberate, like my Ah Pa, like all of my ancestors, through all the years that separate us from our homelands.\nAcross the centuries, the advice of my Ah Pa rings in my ears, “Rise up in the ranks, my daughter. Be one of the Imperial Fleet’s Higher Command. But do not be like them. Wherever in life you are my daughter, remember the doctrines of our people. Always remember to be kind.”\nBut Ah Pa, what she did stole you from me. Stole my family from me. If I had the power, if I could, I would fight my way back through all of those years, I would hunt down the data-host. I would stop Yun-Li in her tracks. I would never lose all of you.\nAh Pa, Ah Ma. I’m coming home to you. I will do whatever it takes to fight time itself, fight technology, fight destiny until I am by your side again. That was why I agreed to carry out these time-jumping covert missions. Through all of these interstellar gateways and circuits through the universes.\nThrough all of the wonders of the universe I have seen, there is only one wonder that I chase, of sitting down to dinner with you, as your true daughter, on Yunglo XIV-V.\nData theft is murder and will incur severe penalties.\nThis has been a message from the Ministry of Cybernetic Safety and Defense. Yunglo-XIV-V.\nNin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee.", "source": "https://clarkesworldmagazine.com/harris_02_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Prosthetic Daughter by Nin Harris"}