{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Karen Lord; Tobias S Buckell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "MLC8fRcHNI+y/tW7zg31xwEfoII=", "id": null, "license": null, "comments": "", "raw_text": "9630 words, novelette, REPRINT  The Mighty Slinger  Earth began to rise over the lunar hills as the Mighty Slinger and the Rovers readied the Tycho stage for their performance. Tapping his microphone, Euclid noticed that Kumi barely glanced at the sight as he set up his djembe and pan assembly, but Jeni froze and stared up at the blue disk, her bass still limp between her hands.  “It’s not going anywhere,” Kumi muttered. His long, graying dreadlocks swayed gently in the heavy gravity of the moon and tapped the side of a pan with a muted “ting.”  “It’ll be there after the concert . . . and after our trip, and after we revive from our next long-sleep.”  “Let her look,” Vega admonished. “You should always stop for beauty. It vanishes too soon.”  “She taking too long to set up,” Kumi said. “You-all call her Zippy but she ain’t zippy at all.”  Euclid chuckled as Jeni shot a stink look at her elder and mentor. She whipped the bass out stiff like she meant business. Her fingers gripped and danced on the narrow surface in a quick, defiant riff.  Raising his mic-wand at the back, Vega captured the sound as it bounced back from the lunar dome performance area. He fed the echo through the house speakers, ending it with a punctuating note of Kumi’s locks hitting the pan with a ting and Euclid’s laughter rumbling quietly in the background. Dhaka, the last of the Rovers, came in live with a cheerful fanfare on her patented Delirium, an instrument that looked like a harmonium had had a painful collision with a large quantity of alloy piping.  An asteroid-thin man in a black suit slipped past the velvet ropes marking off the VIP section and nodded at Euclid. “Yes sir. Your pay’s been deposited, the spa is booked, and your places in the long-sleep pool are reserved.”  “Did you add the depreciation-protection insurance this time?” Euclid answered, his voice cold with bitter memory. “If your grandfather had sense I could be retired by now.”  Kumi looked sharply over. The man in the suit shifted about. “Of course I’ll add the insurance,” he mumbled.  “Thank you, Mr. Jones,” Euclid said, in a tone that was not at all thankful.  “There’s, ah, someone else who would like to talk to you,” the event coordinator said.  “Not now Jones.” Euclid turned away to face his band. “Only forty minutes to curtain time and we need to focus.”  “It’s about Earth,” Jones said.  Euclid turned back. “That rumor?”  Jones shook his head. “Not a rumor. Not even a joke. The Rt Hon. Patience Bouscholte got notification this morning. She wants to talk to you.”  The Rt Hon. Patience Bouscholte awaited him in one of the skyboxes poised high over the rim of the crater. Before it: the stands that would soon be filling up, slanting along the slope that created a natural amphitheater to the stage. Behind it: the gray hills and rocky wasteland of the Moon.  “Mr. Slinger!” she said. Her tightly wound hair and brown spidersilk head scarf bobbed in a slightly delayed reaction to the lunar gravity. “A pleasure to finally meet you. I’m a huge admirer of your sound.”  He sat down, propped his snakeskin magnet-boots up against the chairback in front of him, and gave her a cautious look. “Madame Minister. To what do I owe the pleasure?”  All of the band were members of the Rock Devils Cohort and Consociate Fusion, almost a million strong, all contract workers in the asteroid belt. They were all synced up on the same long-sleep schedule as their cohort, whether working the rock or touring as a band. And here was a Minister from the RDCCF’s Assembly asking to speak with him.  The RDCCF wasn’t a country. It was just one of many organizations for people who worked in space because there was nothing left for them on Earth. But to Euclid, meeting the Rt Hon. Patience Bouscholte felt like meeting a Member of Parliament from the old days. Euclid was slightly intimidated, but he wasn’t going to show it. He put an arm casually over the empty seat beside him.  “They said you were far quieter in person than on stage. They were right.” Bouscholte held up a single finger before he could reply, and pointed to two women in all-black bulletproof suits who were busy scanning the room with small wands. They gave a thumbs up as Bouscholte cocked her head in their direction, and retreated to stand on either side of the entrance.  She turned back to Euclid. “Tell me, Mr. Slinger, how much have you heard about the Solar Development Charter and their plans for Earth?”  So it was true? He leaned toward her. “Why would they have any plans for Earth? I’ve heard they’re stretched thin enough building the Glitter Ring.”  “They are. They’re stretched more than thin. They’re functionally bankrupt. So the SDC is taking up a new tranche of preferred shares for a secondary redevelopment scheme. They want to ‘redevelop’ Earth, and that will not be to our benefit.”  “Well then.” Euclid folded his arms and leaned back. “And you thought you’d tell an old calypso singer that because . . . ?”  “Because I need your rhymes, Mr. Slinger.”  Euclid had done that before, in the days before his last long-sleep, when fame was high and money had not yet evaporated. Dishing out juicy new gossip to help Assembly contract negotiations. Leaking information to warn the workers all across the asteroid belt. Hardworking miners on contract, struggling to survive the long nights and longer sleeps. Sing them a song about how the SDC was planning to screw them over again. He knew that gig well.  He had thought that was why he’d been brought to see her, to get a little something to add extempo to a song tonight. Get the Belt all riled up. But if this was about Earth . . . ? Earth was a garbage dump. Humanity had sucked it dry like a vampire and left its husk to spiral toward death as people moved outward to bigger and better things.  “I don’t sing about Earth anymore. The cohorts don’t pay attention to the old stuff. Why should they care? It’s not going anywhere.”  Then she told him. Explained that the SDC was going to beautify Earth. Re-terraform it. Make it into a new garden of Eden for the rich and idle of Mars and Venus.  “How?” he asked, skeptical.  “Scorched Earth. They’re going to bomb the mother planet with comets. Full demolition. The last of us shipped into the Ring to form new cohorts, new generations of indentured servitude. A clean slate to redesign their brave new world. That is what I mean when I say not to our benefit.”  He exhaled slowly. “You think a few little lyrics can change any of that?” The wealth of Venus, Mars, and Jupiter dwarfed the cohorts in their hollowed out, empty old asteroids.  “One small course adjustment at the start can change an entire orbit by the end of a journey,” she said.  “So you want me to harass the big people up in power for you, now?”  Bouscholte shook her head. “We need you to be our emissary. We, the Assembly, the last representatives of the drowned lands and the dying islands, are calling upon you. Are you with us or not?”  Euclid thought back to the days of breezes and mango trees. “And if they don’t listen to us?”  Bouscholte leaned in close and touched his arm. “The majority of our cohort are indentured to the Solar Development Charter until the Glitter Ring is complete. But, Mr. Slinger, answer me this: where do you think that leaves us after we finish the Ring, the largest project humanity has ever attempted?”  Euclid knew. After the asteroid belt had been transformed into its new incarnation, a sun-girdling, sun-powered device for humanity’s next great leap, it would no longer be home.  There were few resources left in the Belt; the big planets had got there first and mined it all. Euclid had always known the hollow shells that had been left behind. The work on the Glitter Ring. The long-sleep so that they didn’t exhaust resources as they waited for pieces of the puzzle to slowly float from place to appointed place.  Bouscholte continued. “If we can’t go back to Earth, they’ll send us further out. Our cohorts will end up scattered to the cold, distant areas of the system, out to the Oort Cloud. And we’ll live long enough to see that.”  “You think you can stop that?”  “Maybe, Mr. Slinger. There is almost nothing we can broadcast that the big planets can’t listen to. When we go into long-sleep they can hack our communications, but they can’t keep us from talking, and they’ll never stop our songs.”  “It’s a good dream,” Euclid said softly, for the first time in the conversation looking up at the view over the skybox. He’d avoided looking at it. To Jeni it was a beautiful blue dot, but for Euclid all it did was remind him of what he’d lost. “But they won’t listen.”  “You must understand, you are just one piece in a much bigger game. Our people are in place, not just in the cohorts, but everywhere, all throughout the system. They’ll listen to your music and make the right moves at the right time. The SDC can’t move to destroy and rebuild Earth until the Glitter Ring is finished, but when it’s finished they’ll find they have underestimated us—as long as we coordinate in a way that no one suspects.”  “Using songs? Nah. Impossible,” he declared bluntly.  She shook her head, remarkably confident. “All you have to do is be the messenger. We’ll handle the tactics. You forget who you’re speaking to. The Bouscholte family tradition has always been about the long game. Who was my father? What positions do my sons hold, my granddaughters? Euclid Slinger . . . Babatunde . . . listen to me. How do you think an aging calypso star gets booked to do an expensive, multi-planetary tour to the capitals of the Solar System, the seats of power? By chance?”  She called him that name as if she were his friend, his inner-circle intimate. Kumi named him that years . . . decades ago. Too wise for your years. You were here before, he’d said. The Father returns, sent back for a reason. Was this the reason?  “I accept the mission,” he said.  Day. Me say Day-Oh. Earthrise come and me want go . . .  Euclid looked up, smiled. Let the chord go. He wouldn’t be so blatant as to wink at the VIP section, but he knew that there was a fellow Rock Devil out there, listening out for certain songs and recording Vega’s carefully assembled samples to strip for data and instructions in a safe location. Vega knew, of course. Had to, in order to put together the info packets. Dhaka knew a little but had begged not to know more, afraid she might say the wrong thing to the wrong person. Jeni was still, after her first long-sleep, nineteen in body and mind, so no, she did not know, and anyway how could he tell her when he was still dragging his feet on telling Kumi?  And there was Kumi, frowning at him after the end of the concert as they sprawled in the green room, taking a quick drink before the final packing up. “Baba, you on this nostalgia kick for real.”  “You don’t like it?” Euclid teased him. “All that sweet, sweet soca you grew up studying, all those kaiso legends you try to emulate?”  “That ain’t your sound, man.”  Euclid shrugged. “We can talk about that next time we’re in the studio. Now we got a party to be at!”  After twenty-five years of long-sleep, Euclid thought Mars looked much the same, except maybe a little greener, a little wetter. Perhaps that was why the directors of the SDC-MME had chosen to host their bash in a gleaming biodome that overlooked a charming little lake. Indoor foliage matched to outer landscape in a lush canopy and artificial lights hovered in competition with the stars and satellites beyond.  “Damn show-offs,” Dhaka muttered. “Am I supposed to be impressed?”  “I am,” Jeni said shamelessly, selecting a stimulant cocktail from an offered tray. Kumi smoothly took it from her and replaced it with another, milder option. She looked outraged.  “Keep a clear head, Zippy,” Vega said quietly. “We’re not among friends.”  That startled her out of her anger. Kumi looked a little puzzled himself, but he accepted Vega’s support without challenge.  Euclid listened with half his attention. He had just noticed an opportunity. “Kumi, all of you, come with me. Let’s greet the CEO and offer our thanks for this lovely party.”  Kumi came to his side. “What’s going on?”  Euclid lowered his voice. “Come, listen and find out.”  The CEO acknowledged them as they approached, but Euclid could sense from the body language that the busy executive would give them as much time as dictated by courtesy and not a bit more. No matter that Euclid was a credentialed ambassador for the RDCCF, authorized by the Assembly. He could already tell how this meeting would go.  “Thank you for hosting us, Mx. Ashe,” Euclid said, donning a pleasant, grinning mask. “It’s always a pleasure to kick off a tour at the Mars Mining and Energy Megaplex.”  “Thank you,” the executive replied. “Your music is very popular with our hands.”  “Pardon?” Kumi enquired, looking in confusion at the executive’s fingers wrapped around an ornate cocktail glass.  “Our employees in the asteroid belt.”  Kumi looked unamused. Euclid moved on quickly. “Yes. You merged with the SDC . . . pardon me, we are still trying to catch up on twenty-five years of news . . . about ten years ago?”  A little pride leaked past the politeness. “Buyout, not merger. Only the name has survived, to maintain continuity and branding.”  Euclid saw Dhaka smirk and glance at Vega, who looked a little sour. He was still slightly bitter that his ex-husband had taken everything in the divorce except for the de la Vega surname, the name under which he had become famous and which Vega was forced to keep for the sake of convenience.  “But don’t worry,” the CEO continued. “The Glitter Ring was always conceptualized as a project that would be measured in generations. Corporations may rise and fall, but the work will go on. Everything remains on schedule and all the hands . . . all the—how do you say—cohorts are in no danger of losing their jobs.”  “So, the cohorts can return to Earth after the Ring is completed?” Euclid asked directly.  Mx. Ashe took a careful sip of bright purple liquid before replying. “I did not say that.”  “But I thought the Earth development project was set up to get the SDC a secondary round of financing, to solve their financial situation,” Dhaka demanded, her brow creasing. “You’ve bought them out, so is that still necessary?”  Mx. Ashe nodded calmly. “True, but we have a more complex vision for the Glitter Ring than the SDC envisioned, and so funding must be vastly increased. Besides, taking money for a planned redevelopment of Earth and then not doing it would, technically, be fraud. The SDC-MME will follow through. I won’t bore you with the details, but our expertise on geo-engineering is unparalleled.”  “You’ve been dropping comets on vast, uninhabited surfaces,” Dhaka said. “I understand the theory, but Earth isn’t Venus or Mars. There’s thousands of years of history and archeology. And there are still people living there. How are you going to move a billion people?”  Mx. Ashe looked coldly at Dhaka. “We’re still in the middle of building a Ring around the sun, Mx. Miriam. I’m sure my successors on the Board will have it all figured out by the next time we wake you up. We understand the concerns raised, but after all, people have invested trillions in this project. Our lawyers are in the process of responding to all requests and lawsuits, and we will stand by the final ruling of the courts.”  Euclid spoke quickly, blunt in his desperation. “Can’t you reconsider, find another project to invest in? Earth’s a mess, we all know it, but we always thought we’d have something to come back to.”  “I’m sure a man of your means could afford a plot on New Earth—” Mx. Ashe began.  “I’ve seen the pricing,” Vega cut in dryly. “Musicians don’t make as much as you think.”  “What about the cohorts?” Jeni said sadly. “No one in the cohorts will be able to afford to go back.”  Mx. Ashe stepped back from the verbal bombardment. “This is all speculation. The cohorts are still under contract to work on the Glitter Ring. Once they have finished, negotiations about their relocation can begin. Now, if you will excuse me, have a good night and enjoy the party!”  Euclid watched despondently as the CEO walked away briskly. The Rovers stood silently around him, their faces somber. Kumi was the first to speak. “Now I understand the nostalgia kick.”   The SDC, now with the MME  You and I both know  They don’t stand for you and me  There was still a tour to play. The band moved from Elysium City to Electris Station, then Achillis Fons, where they played in front of the Viking Museum.  The long-sleep on the way to Mars had been twenty-five years. Twenty-five years off, one year on. That was the shift the Rock Devils Cohort and Consociation Fusion had agreed to, the key clause in the contract Euclid had signed way-back-when in an office built into the old New York City seawall.  That gave them a whole year on Mars. Mx. Ashe may have shut them down, but Euclid wasn’t done yet. Not by a long shot.  Kumi started fretting barely a month in.  “Jeni stepping out with one of the VIPs,” he told Euclid.  “She’s nineteen. What you expecting? A celibate band member? I don’t see you ignoring anyone coming around when we breaking down.”  Kumi shook his head. “No Baba, that’s one thing. This is the same one she’s seeing. Over and over. Since we arrived here. She’s sticky sweet on him.”  “Kumi, we got bigger things to worry about.”  “Earth, I know. Man, look, I see why you’re upset.” Kumi grabbed his hand. “I miss it too. But we getting old, Baba. I just pass sixty. How much longer I could do this? Maybe we focus on the tour and invest the money so that we can afford to go back some day.”  “I can’t give it up that easy,” Euclid said to his oldest friend. “We going to have troubles?”  Back when Euclid was working the rocks, Kumi had taken him under his wing. Taught him how to sing the old songs while they moved their one-person pods into position to drill them out. Then they’d started singing at the start of shifts and soon that took off into a full career. They’d traveled all through the Belt, from big old Ceres to the tiniest cramped mining camps.  Kumi sucked his teeth. “That first time you went extempo back on Pallas, you went after that foreman who’d been skimping on airlock maintenance? You remember?”  Euclid laughed. “I was angry. The airlock blew out and I wet myself waiting for someone to come pick me up.”  “When you started singing different lyrics, making them up on the spot, I didn’t follow you at first. But you got the SDC to fire him when the video went viral. That’s why I called you Baba. So, no, you sing and I’ll find my way around your words. Always. But let me ask you—think about what Ashe said. You really believe this fight’s worth it?”  Euclid bit his lip.  “We have concerts to give in the Belt and Venus yet,” he told Kumi. “We’re not done yet.”  Five months in, the Martians began to turn. The concerts had been billed as cross-cultural events, paid for by the Pan-Human Solar Division of Cultural Affairs and the Martian University’s division of Inter-Human Musicology Studies school.  Euclid, on stage, hadn’t noticed at first. He’d been trying to find another way to match up MME with “screw me” and some lyrics in between. Then a comparison to Mars and its power, and the people left behind on Earth.  But he noticed when this crowd turned.  Euclid had grown used to the people of the big planets just sitting and listening to his music. No one was moving about. No hands in the air. Even if you begged them, they weren’t throwing their hands out. No working, no grinding, no nothing. They sat in seats and appreciated.  He didn’t remember when they turned. He would see it on video later. Maybe it was when he called out the “rape” of Earth with the “red tape” of the SDC-MME and made a visual of “red” Mars that tied to the “red” tape, but suddenly those chair-sitting intercultural appreciators stood up.  And it wasn’t to jump.  The crowd started shouting back. The sound cut out. Security and the venue operators swept in and moved them off the stage.  Back in the green room, Jeni rounded on Euclid. “What the hell was that?” she shouted.  “Extempo,” Euclid said simply.  Kumi tried to step between them. “Zippy—”  “No!” She pushed him aside. Dhaka, in the corner of the room, started disassembling the Delirium, carefully putting the pieces away in a g-force protected aerogel case, carefully staying out of the brewing fight. Vega folded his arms and stood to a side, watching. “I damn well know what extempo is. I’m young, not ignorant.”  Everyone was tired. The heavy gravity, the months of touring already behind them. “This always happens. A fight always come halfway through,” Euclid said. “Talk to me.”  “You’re doing extempo like you’re in a small free concert in the Belt, on a small rock. But this isn’t going after some corrupt contractor,” Jeni snapped. “You’re calling out a whole planet now? All Martians? You crazy?”  “One person or many, you think I shouldn’t?”  Euclid understood. Jeni had been working pods like he had at the same age. Long, grueling shifts spent in a tiny bubble of plastic where you rebreathed your own stench so often you forgot what clean air tasted like. Getting into the band had been her way “off the rock.” This was her big gamble out of tedium. His too, back in the day.  “You’re not entertaining people. You’re pissing them off,” she said.  Euclid sucked his teeth. “Calypso been vexing people since all the way back. And never mind calypso, Zippy, entertainment isn’t just escape. Artists always talking back, always insolent.”  “They paid us and flew us across the solar system to sing the song they wanted. Sing the fucking song for them the way they want. Even just the Banana Boat Song you’re messing with and going extempo. That shit’s carved in stone, Euclid. Sing the damn lyrics.”  Euclid looked at her like she’d lost her mind. “That song was never for them. Problem is it get sung too much and you abstract it and then everyone forget that song is a blasted lament. Well, let me educate you, Ms Baptiste. The Banana Boat Song is a mournful song about people getting their backs broken hard in labor and still using call and response to help the community sync up, dig deep, and find the power to work harder ’cause dem ain’t had no choice.”  He stopped. A hush fell in the green room.  Euclid continued. “It’s not a ‘smile and dance for them’ song. The big planets don’t own that song. It was never theirs. It was never carved in stone. I’ll make it ours for here, for now, and I’ll go extempo. I’m not done. Zippy, I’m just getting started.”  She nodded. “Then I’m gone.”  Just like that, she spun around and grabbed her bass.  Kumi glared at Euclid. “I promised her father I’d keep an eye on her—”  “Go,” Euclid said calmly, but he was suddenly scared that his oldest friend, the pillar of his little band, would walk out the green room door with the newest member and never come back.  Kumi came back an hour later. He looked suddenly old . . . those raw-sun wrinkles around his eyes, the stooped back. But it wasn’t just gravity pulling him down. “She’s staying on Mars.”  Euclid turned to the door. “Let me go speak to her. I’m the one she angry with.”  “No.” Kumi put a hand on his shoulder. “That wasn’t just about you. She staying with someone. She’s not just leaving the band, she leaving the cohort. Got a VIP, a future, someone she thinks she’ll build a life with.”  She was gone. Like that.  Vega still had her riffs, though. He grumbled about the extra work, but he could weave the recorded samples in and out of the live music.  Kumi got an invitation to the wedding. It took place the week before the Rovers left Mars for the big tour of the asteroid belt.  Euclid wasn’t invited.  He did a small, open concert for the Rock Devils working on Deimos. It was just him and Vega and fifty miners in one of the teardown areas of the tiny moon. Euclid sang for them just as pointedly as ever.   So it’s up to us, you and me  to put an end to this catastrophe.  Them ain’t got neither conscience nor heart.  We got to pitch in and do our part  ’cause if this Earth demolition begin  we won’t even have a part/pot to pitch/piss in.  Touring in the Belt always gave him a strange feeling of mingled nostalgia and dissonance. There were face-to-face reunions and continued correspondence with friends and relatives of their cohort, who shared the same times of waking and long-sleep, spoke the same language, and remembered the same things. But there were also administrators and officials, who kept their own schedule, and workers from cohorts on a different frequency—all strangers from a forgotten distant past or an unknown near-present. Only the most social types kept up-to-date on everything, acting as temporal diplomats, translating jokes and explaining new tech and jargon to smooth communication between groups.  Ziamara Bouscholte was social. Very social. Euclid had seen plenty of that frivolous-idle behavior from political families and nouveau-nobility like the family Jeni had married into, but given that surname and the fact that she had been assigned as their tour liaison, he recognized very quickly that she was a spy.  “Big tours in the Belt are boredom and chaos,” he warned her, thinking about the argument with Jeni. “Lots of downtime slinging from asteroid to asteroid punctuated by concert mayhem when we arrive.”  She grinned. “Don’t worry about me. I know exactly how to deal with boredom and chaos.”  She didn’t lie. She was all-business on board, briefing Vega on the latest cryptography and answering Dhaka’s questions about the technological advances that were being implemented in Glitter Ring construction. Then the butterfly emerged for the concerts and parties as she wrangled fans and dignitaries with a smiling enthusiasm that never flagged.  The Vesta concert was their first major stop. The Mighty Slinger and his Rovers peeked out from the wings of the stage and watched the local opening act finishing up their last set.  Kumi brought up something that had been nagging Euclid for a while. “Baba, you notice how small the crowds are? This is our territory, not Mars. Last big tour we had to broadcast over Vesta because everything was sold out.”  Vega agreed. “Look at this audience. Thin. I could excuse the other venues for size, but not this one.”  “I know why,” Dhaka said. “I can’t reach half my friends who agreed to meet up. All I’m getting from them are long-sleep off-shift notices.”  “I thought it was just me,” Kumi said. “Did SDC-MME leave cohorts in long-sleep? Cutting back on labor?”  Dhaka nodded. “Zia mentioned some changes in the project schedule. You know the Charter’s not going to waste money feeding us if we’re not working.”  Euclid felt a surge of anger. “We’ll be out of sync when they wake up again. That messes up the whole cohort. You sure they’re doing this to cut labor costs, or to weaken us as a collective?”  Dhaka shrugged. “I don’t like it one bit, but I don’t know if it’s out of incompetence or malice.”  “Time to go,” said Vega, his eyes on the openers as they exited stage left.  The Rovers drifted on stage and started freestyling, layering sound on sound. Euclid waited until they were all settled in and jamming hard before running out and snagging his mic. He was still angry, and the adrenaline amped up his performance as he commandeered the stage to rant about friends and lovers lost for a whole year to long-sleep.  Then he heard something impossible: Kumi stumbled on the beat. Euclid looked back at the Rovers to see Vega frozen. A variation of one of Jeni’s famous riffs was playing, but Vega shook his head not me to Dhaka’s confused sideways glance.  Zia’s voice came on the sound system, booming over the music. “Rock Devils cohort, we have a treat for you! On stage for the first time in twenty-five years, please welcome Rover bassist Jeni ‘Zippy’ Baptiste!”  Jeni swooped in from the wings with another stylish riff, bounced off one of the decorated pylons, then flew straight to Kumi and wrapped him in a tumbling hug, bass and all. Prolonged cheering from the crowd drowned out the music. Euclid didn’t know whether to be furious or overjoyed at Zia for springing the surprise on them in public. Vega smoothly covered for the absent percussion and silent bass while Dhaka went wild on the Delirium. It was a horrible place for a reunion, but they’d take it. Stage lighting made it hard to tell, but Jeni did look older and . . . stronger? More sure of herself?  Euclid floated over to her at the end of the song as the applause continued to crash over them all. “Welcome back, Zippy,” he said. “You’re still good—better, even.”  Her laugh was full and sincere. “I’ve been listening to our recordings for twenty-five years, playing along with you every day while you were in long-sleep. Of course I’m better.”  “You missed us,” he stated proudly.  “I did.” She swatted a tear out of the air between them with the back of her hand. “I missed this. Touring for our cohort. Riling up the powers that be.”  He raised his eyebrows. “Now you want to shake things up? What changed?”  She shook her head sadly. “Twenty-five years, Baba. I have a daughter, now. She’s twenty, training as an engineer on Mars. She’s going to join the cohort when she’s finished and I want more for her. I want a future for her.”  He hugged her tight while the crowd roared in approval. “Get back on that bass,” he whispered. “We got a show to finish!”  He didn’t bother to ask if the nouveau-nobility husband had approved of the rebel Rover Jeni. He suspected not.  In the green room Jeni wrapped her legs around a chair and hung a glass of beer in the air next to her.  “Used to be it would fall slowly down to the floor,” Jeni said, pointing at her drink. “They stripped most of Vesta’s mass for the Ring. It’s barely a shell here.”  Dhaka shoved a foot in a wall strap and settled in perpendicular to Jeni. She swirled the whiskey glass around in the air. Despite the glass being designed for zero gravity, her practiced flip of the wrist tossed several globules free that very slowly wobbled their way through the air toward her. “We’re passing into final stage preparations for the Ring. SDC-MME is panicking a bit because the projections for energy and the initial test results don’t match. And the computers are having trouble managing stable orbits.”  The Glitter Ring was a Dyson Ring, a necklace of solar power stations and sails built around the sun to capture a vast percentage of its energy. The power needs of the big planets had begun to outstrip the large planetary solar and mirror arrays a hundred years ago. Overflight and shadow rights for solar gathering stations had started turning into a series of low-grade orbital economic wars. The Charter had been created to handle the problem system-wide.  Build a ring of solar power catchments in orbit around the sun at a slight angle to the plane of the solar system. No current solar rights would be abridged, but it could catapult humanity into a new industrial era. A great leap forward. Unlimited, unabridged power.  But if it didn’t work . . .  Dhaka nodded at all the serious faces. “Don’t look so glum. The cohort programmers are working on flocking algorithms to try and simplify how the solar stations keep in orbit. Follow some simple rules about what’s around you and let complex emergent orbits develop.”  “I’m more worried about the differences in output,” Jeni muttered. “While you’ve been in long-sleep they’ve been developing orbital stations out past Jupiter with the assumption that there would be beamed power to follow. They’re building mega-orbitals throughout the system on the assumption that the Ring’s going to work. They’ve even started moving people off Earth into temporary housing in orbit.”  “Temporary?” Euclid asked from across the room, interrupting before Dhaka and Jeni got deep into numbers and words like exajoules, quantum efficiency, price per watt, and all the other boring crap. He’d cared intimately about that when he first joined the cohort. Now, not so much.  “We’re talking bubble habitats with thinner shells than Vesta right now. They use a layer of water for radiation shielding, but they lack resources and they’re not well balanced. These orbitals have about a couple hundred thousand people each, and they’re rated to last fifty to sixty years.” Jeni shook her head, and Euclid was forced to stop seeing the nineteen-year-old Zippy and recognize the concerned forty-four year old she’d become. “They’re risking a lot.”  “Why would anyone agree?” Vega asked. “It sounds like suicide.”  “It’s gotten worse on Earth. Far worse. Everyone is just expecting to hit the reset button after the Glitter Ring goes online. Everyone’s holding their breath.”  Dhaka spoke up. “Okay, enough cohort bullshit. Let’s talk about you. The band’s heading back to long-sleep soon—and then what, Zippy? You heading back to Mars and your daughter?”  Jeni looked around the room hesitantly. “Lara’s never been to Venus, and I promised her she could visit me . . . if you’ll have me?”  “If?” Vega laughed. “I hated playing those recordings of you. Rather hear it live.”  “I’m not as zippy up and down the chords as I used to be, you know,” Jeni warned. Everyone was turning to look at Euclid.  “It’s a more confident sound,” he said with a smile. Dhaka whipped globules of whiskey at them and laughed.  Kumi beamed, no doubt already dreaming about meeting his “granddaughter.”  “Hey, Zippy,” Euclid said. “Here’s to change. Good change.”  “Maybe,” she smiled and slapped his raised hand in agreement and approval. “Let’s dream on that.”  The first few days after long-sleep were never pleasant, but this awakening was the worst of Euclid’s experience. He slowly remembered who he was, and how to speak, and the names of the people who sat quietly with him in the lounge after their sessions with the medics. For a while they silently watched the high cities of Venus glinting in the clouds below their orbit from viewports near the long-sleep pools.  Later they began to ask questions, later they realized that something was very wrong. They’d been asleep for fifty years. Two long-sleeps, not the usual single sleep.  “Everyone gone silent back on Vesta,” Dhaka said.  “Did we get idled?” Euclid demanded. They were a band, not workers. They shouldn’t have been idled.  The medics didn’t answer their questions. They continued to deflect everything until one morning an officer turned up, dressed in black sub-uniform with empty holster belt, as if he had left his weapons and armor just outside the door. He looked barely twenty, far too young for the captain’s insignia on his shoulders.  He spoke with slow, stilted formality. “Mr. Slinger, Mr. Djansi, Mr. de la Vega, Ms Miriam, and Ms Baptiste—thank you for your patience. I’m Captain Abrams. We’re sorry for the delay, but your recovery was complicated.”  “Complicated!” Kumi looked disgusted. “Can you explain why we had two long-sleeps instead of one? Fifty years? We had a contract!”  “And we had a war.” The reply was unexpectedly sharp. “Be glad you missed it.”  “Our first interplanetary war? That’s not the change I wanted,” Euclid muttered to Vega.  “What happened?” Jeni asked, her voice barely a whisper. “My daughter, she’s on Mars, is she safe?”  The officer glanced away in a momentary flash of vulnerability and guilt. “You have two weeks for news and correspondence with your cohort and others. We can provide political summaries and psychological care for your readjustment. After that, your tour begins. Transport down to the cities has been arranged. I just . . . I have to say . . . we still need you now, more than ever.”  “The rass?” Kumi stared at the soldier, spreading his arms.  Again that touch of vulnerability as the young soldier replied with a slight stammer. “Please. We need you. You’re legends to the entire system now, not just the cohorts.”  “The hell does that mean?” Vega asked as the boy-captain left.  Jeni’s daughter had managed one long-sleep but woke on schedule while they stayed in storage. The war was over by then, but Martian infrastructure had been badly damaged and skilled workers were needed for longer than the standard year or two. Lara had died after six years of “extra time,” casualty of a radiation exposure accident on Deimos.  They gathered around Jeni when she collapsed to her knees and wept, grieving for the child they had never known.  Their correspondence was scattered across the years, their cohort truly broken as it had been forced to take cover, retreat, or fight. The war had started in Earth orbit after a temporary habitat split apart, disgorging water, air, and people into vacuum. Driven by desperation and fury, several other orbital inhabitants had launched an attack on SDC-MME-owned stations, seeking a secure environment to live, and revenge for their dead.  Conflict became widespread and complicated. The orbital habitats were either negotiating for refugees, building new orbitals, or fighting for the SDC-MME. Mars got involved when the government sent its military to protect the Martian investment in the SDC-MME. Jupiter, which was now its own functioning techno-demarchy, had struck directly at the Belt, taking over a large portion of the Glitter Ring.  Millions had died as rocks were flung between the worlds, and ships danced around each other in the vacuum. People fought hand-to-hand in civil wars inside hollowed out asteroids, gleaming metal orbitals, and in the cold silence of space.  Humanity had carried war out of Earth and into the great beyond.  Despite the grim history lesson, as the band shared notes and checked their financial records, one thing became clear. They were legends. The music of the Mighty Slinger and the Rovers had become the sound of the war generation and beyond: a common bond that the cohorts could still claim, and battle hymns for the Earth emigrants who had launched out from their decayed temporary orbitals. Anti-SDC-MME songs became treasured anthems. The Rovers’ songs sold billions, the covers of their songs sold billions. There were tribute bands and spin-off bands and a fleet of touring bands. They had spawned an entire subgenre of music.  “We’re rich at last,” Kumi said ruefully. “I thought I’d enjoy it more.”  Earth was still there, still a mess, but Vega found hope in news from his kin. For decades, Pacific Islanders had stubbornly roved over their drowned states in vast fleets, refusing resettlement to the crowded cities and tainted badlands of the continents. In the last fifty years, their floating harbors had evolved from experimental platforms to self-sustaining cities. For them, the war had been nothing but a few nights filled with shooting stars and the occasional planetfall of debris.  The Moon and Venus had fared better in the war than Mars, but the real shock was the Ring. According to Dhaka, the leap in progress was marked, even for fifty years. Large sections were now fully functional and had been used during the war for refueling, surveillance, barracks, and prisons.  “Unfortunately, that means that the purpose of the Ring has drifted once again,” she warned. “The military adapted it to their purposes, and returning it to civilian use will take some time.”  “But what about the Assembly?” Euclid asked her one day when they were in the studio, shielded from surveillance by noise and interference from Vega’s crafting. “Do they still care about the purpose of the Ring? Do you think we still have a mission?”  The war had ended without a clear victor. The SDC-MME had collapsed and the board had been tried, convicted and exiled to long-sleep until a clear treaty could be hammered out. Jupiter, Mars, Venus, and some of the richer orbitals had assumed the shares and responsibility of the original solar charter. A tenuous peace existed.  Dhaka nodded. “I was wondering that too, but look, here’s the name of the company that’s organizing our tour.”  Euclid leaned in to read her screen. Bouscholte, Bouscholte & Abrams.  Captain Abrams revealed nothing until they were all cramped into the tiny cockpit of a descent craft for Venus’ upper atmosphere.  He checked for listening devices with a tiny wand, and then, satisfied, faced them all. “The Bouscholte family would like to thank you for your service. We want you to understand that you are in an even better position to help us, and we need that help now, more than ever.”  They’d come this far. Euclid looked around at the Rovers. They all leaned in closer.  “The Director of Consolidated Ring Operations and Planetary Reconstruction will be at your concert tonight.” Abrams handed Euclid a small chip. “You will give this to him—personally. It’s a quantum encrypted key that only Director Cutler can access.”  “What’s in it?” Dhaka asked.  Abrams looked out the window. They were about to fall into the yellow and green clouds. The green was something to do with floating algae engineered for the planet, step one of the eventual greening of Venus. “Something Cutler won’t like. Or maybe a bribe. I don’t know. But it’s an encouragement for the Director to consider a proposal.”  “Can you tell us what the proposal is?”  “Yes.” Abrams looked at the band. “Either stop the redevelopment of Earth and further cement the peace by returning the orbitals inhabitants to the surface, or . . . ”  Everyone waited as Abrams paused dramatically.  “ . . . approve a cargo transit across Mercury’s inner orbit to the far side of the Glitter Ring, and give us the contracts for rebuilding the orbital habitats.”  Dhaka frowned. “I wasn’t expecting something so boring after the big ‘or’ there, Captain.”  Abrams smiled. “One small course adjustment at the start can change an entire orbit by the end of a journey,” he said to Euclid.  That sounded familiar.  “Either one of those is important?” Euclid asked. “But you won’t say why.”  “Not even in this little cabin. I’m sure I got the bugs, but in case I didn’t.” Abrams shrugged. “Here we are. Ready to change the solar system, Mr. Slinger?”  Venusian cities were more impressive when viewed from the outside. Vast, silvery spheres clustered thickly in the upper atmosphere, trailing tethers and tubes to the surface like a dense herd of giant cephalopods. Inside, the decor was sober, spare and disappointing, hinting at a slow postwar recovery.  The band played their first concert in a half-century to a frighteningly respectful and very exclusive audience of the rich and powerful. Then it was off to a reception where they awkwardly sipped imported wine and smiled as their assigned liaison, a woman called Halford, briskly introduced and dismissed awestruck fans for seconds of small talk and a quick snap.  “And this is Petyr Cutler,” Halford announced. “Director of Consolidated Ring Operations and Planetary Reconstruction.”  Bodyguards quickly made a wall, shepherding the Director in for his moment.  Cutler was a short man with loose, sandy hair and bit of orbital sunburn. “So pleased to meet you,” he said. “Call me Petyr.”  He came in for the vigorous handshake, and Euclid had already palmed the small chip. He saw Abrams on the periphery of the crowd, watching. Nodded.  Cutler’s already reddened cheeks flushed as he looked down at the chip. “Is that—”  “Yes.” Euclid locked eyes with him. The Director. One of the most powerful people in the entire solar system.  Cutler broke the gaze and looked down at his feet. “You can’t blackmail me, not even with this. I can’t change policy.”  “So you still redeveloping Earth?” Euclid asked, his tone already dull with resignation.  “I’ve been around before you were born, Mr. Slinger. I know how generational projects go. They build their own momentum. No one wants to become the executive who shut down two hundred years of progress, who couldn’t see it through to the end. Besides, wars aren’t cheap. We have to repay our citizens who invested in war bonds, the corporations that gave us tech on credit. The Earth Reconstruction project is the only thing that can give us the funds to stay afloat.”  Somehow, his words eased the growing tightness in Euclid’s chest. “I’m supposed to ask you something else, then.”  Cutler looked suspicious. He also looked around at his bodyguards, wanting to leave. “Your people have big asks, Mr. Slinger.”  “This is smaller. We need your permission to move parts across Mercury’s orbit, close to the sun, but your company has been denying that request. The Rock Devils cohort also wants to rebuild the surviving temporary Earth orbitals.”  “Post-war security measures are still in place—”  “Security measures my ass.” Jeni spoke so loudly, so intensely that the whole room went quiet to hear her.  “Jeni—” Kumi started.  “No. We’ve sacrificed our lives and our children’s lives for your damn Ring. We’ve made it our entire reason for existence and we’re tired. One last section to finish, that could finish in less than three decades if you let us take that shortcut to get the last damn parts in place and let us go work on something worthwhile. We’re tired. Finish the blasted project and let us live.”  Kumi stood beside her and put his arm around her shoulders. She leaned into him, but she did not falter. Her gaze stayed hard and steady on the embarrassed Director who was now the center of a room of shocked, sympathetic, judging looks.  “We need clearance from Venus,” Director Cutler mumbled.  Euclid started humming a quick back beat. Cutler looked startled. “Director,” Euclid sang, voice low. He reached for the next word the sentence needed to bridge. Dictator. How to string that in with . . . something to do with the project finishing later.  He’d been on the stage singing the old lyrics people wanted to hear. His songs that had once been extempo, but now were carved in stone by a new generation.  But right here, with the bodyguards all around them, Euclid wove a quick song damning him for preventing progress in the solar system and making trouble for the cohorts. That’s right, Euclid thought. That’s where the power came from, singing truth right to power’s face.  Power reddened. Cutler clenched his jaw.  “I can sing that louder,” Euclid said. “Loud enough for the whole system to hear it and sing it back to you.”  “We’ll see what we can do,” Cutler hissed at him, and signaled for the bodyguards to surround him and move him away.  Halford the liaison congratulated the band afterwards. “You did it. We’re cleared to use interior transits to the other side of the Ring and to move equipment into Earth orbit.”  “Anything else you need us to do?” Dhaka asked.  “Not now, not yet. Enjoy your tour. Broadcasting planetwide and recording for rebroadcast throughout the system—you’ll have the largest audience in history.”  “That’s nice,” Euclid said vaguely. He was still feeling some discomfort with his new status as legend.  “I can’t wait for the Earth concert,” Captain Abrams said happily. “That one will really break the records.”  “Earth?” Kumi said sharply.  Halford looked at him. “After your next long-sleep, for the official celebration of the completion of the Ring. That can’t happen without the Mighty Slinger and his Rovers. One last concert for the cohorts.”  “And maybe something more,” Abrams added.  “What do you mean, ‘more’?” Euclid demanded, weary of surprises.  Halford and Captain Abrams shared a look—delight, anticipation, and caution.  “When we’re sure, we’ll let you know,” the captain promised.  Euclid sighed and glared at the door. He nervously twirled a pair of virtual-vision goggles between his fingers.  Returning to Earth had been bittersweet. He could have asked to fly over the Caribbean Sea, but nothing would be the same—coral reef islands reclaimed by water, new land pushed up by earthquake and vomited out from volcanoes. It would pollute the memories he had of a place that had once existed.  He put the past out of his mind and concentrated on the present. The Rovers were already at the venue, working hard with the manager and crew in technical rehearsals for the biggest concert of their lives. Estádio Nacional de Brasília had become ENB de Abrams-Bouscholte, twice reconstructed in the last three decades to double the seating and update the technology, and now requiring a small army to run it.  Fortunately Captain Abrams (retired) knew a bit about armies and logistics, which was why Euclid was not at technical rehearsal with his friends but on the other side of the city, waiting impatiently outside a large simulation room while Abrams took care of what he blithely called ‘the boring prep’.  After ten minutes or so the door finally opened and Captain Abrams peeked around the edge, goggles pushed up over his eyebrows and onto his balding head. “We’re ready! Come in, Mr. Slinger. We think you’ll like what we’ve set up for you.” His voice hadn’t lost that boyish, excited bounce.  Still holding his goggles, Euclid stepped into the room and nodded a distracted greeting to the small group of technicians. His gaze was quickly caught by an alloy-plated soprano pan set up at the end of the room.  “Mr. Djansi says you were a decent pannist,” Captain Abrams said, still brightly enthusiastic.  “Was?”  Captain Abrams smiled. “Think you can handle this one?”  “I can manage,” Euclid answered, reaching for the sticks.  “Goggles first,” the captain reminded him, closing the door to the room.  Euclid put them on, picked up the sticks and raised his head to take in his audience. He froze and dropped the sticks with a clang.  “Go on, Mr. Slinger. I think you’ll enjoy this,” Abrams said. “I think we all will.”  On the night of the concert, Euclid stood on the massive stage with his entire body buzzing with terror. The audience packed into stadium tiers all around him was a faceless mass that rose up several stories, but they were his family and he knew them like he knew his own heart. The seats were filled with Rock Devils, Gladhandlers, Sunsiders and more, all of them from the cohorts, workers representing every section of the Ring and every year and stage of its development. Many of them had come down from Earth orbit and their work on the decaying habitats to see the show.  Euclid started to sing for them, but they sang for him first, calling out every lyric so powerful and sure that all he could do was fall silent and raise his hands to them in homage and embrace. He shook his head in wonder as tears gathered in his eyes.  Kumi, Vega, Dhaka and Jeni kept jamming, transported by the energy, playing the best set of their careers, giving him a nod or a sweet smile in the midst of their collective trance as he stood silently crying and listening to the people sing.  Then it was time.  Euclid walked slowly, almost reverently, to the soprano pan at the center of the stage. Picked up the sticks, just as he had in the simulation room. Looked up at his audience. This time he did not freeze. He played a simple arpeggio, and the audience responded: lighting a wedge of stadium seating, a key for each note of the chord, hammered to life when he hammered the pan. He lengthened the phrase and added a trill. The cohorts followed him flawlessly, perfected in teamwork and technology. A roar came from overhead as the hovering skyboxes cheered on the Mighty Slinger playing the entire stadium like it was his own personal keyboard.  Euclid laughed loud. “Ain’t seen nothing yet!”  He swept his arm out to the night sky, made it a good, slow arc so he was sure they were paying attention. Then the other arm. Showmanship. Raise the sticks with drama. Flourish them like a conductor. Are you ready? Are you ready!?  Play it again. This time the sky joined them. The arc of the Ring blazed section by section in sync with each note, and in step with each cadence. The Mighty Slinger and his cohorts, playing the largest instrument in the galaxy.  Euclid grinned as the skyboxes went wild. The main audience was far quieter, waiting, watching for one final command.  He raised his arms again, stretched them out in victory, dropped the sticks on the thump of the Rovers’ last chord, and closed his eyes.  His vision went red. He was already sweating with adrenaline and humid heat, but for a moment he felt a stronger burn, the kiss of a sun where no sun could be. He slowly opened his eyes and there it was, as Abrams had promised. The real last section of the Ring, smuggled into Earth’s orbit during the interior transits permitted by Venus, now set up in the mother planet’s orbit with magnifiers and intensifiers and God knows what else, all shining down like full noon on nighttime Brasilia.  The skyboxes no longer cheered. There were screams, there was silence. Euclid knew why. If they hadn’t figured it out for themselves, their earpieces and comms were alerting them now. Abrams-Bouscholte, just hours ago, had became the largest shareholder in the Ring through a generation-long program of buying out rights and bonds from governments bankrupted by war. It was a careful, slow-burning plan that only a cohort could shepherd through to the end.  The cohorts had always been in charge of the Ring’s day-to-day operations, but the concert had demonstrated beyond question that only one crew truly ran the Ring.  The Ring section in Earth orbit, with its power of shade and sun, could be a tool for geoengineering to stabilize Earth’s climate to a more clement range . . . or a solar weapon capable of running off any developers. Either way, the entire Ring was under the control of the cohorts, and so was Earth.  The stadium audience roared at last, task accomplished, joy unleashed. Dhaka, Jeni, Kumi and Vega left their instruments and gathered around Euclid in a huddle of hugs and tears, like soldiers on the last day of a long war.  Euclid held onto his friends and exhaled slowly. “Look like massa day done.”  Euclid sat peacefully, a mug of bush tea in his hands, gazing at the cold metal walls of the long-sleep hospice. Although the technology had steadily improved, delayed reawakenings still had cost and consequences. But it had been worth the risk. He had lived to see the work of generations, the achievements of one thousand years.  “Good morning, Baba.” One of Zippy’s great great grandchildren approached, his dashiki flashing a three-dimensional-pattern with brown and green images of some offworld swamp. This Baptiste, the head of his own cohort, was continuing the tradition of having at least one descendant of the Rovers in attendance at Euclid’s awakening. “Are you ready now, Baba? The shuttle is waiting for you.”  “I am ready,” Euclid said, setting down his mug, anticipation rising. Every hundred years he emerged from the long-sleep pool. Are you sure you want this? Kumi had asked. You’ll be all alone. The rest of the band wanted to stay and build on Earth. Curiosity had drawn him to another path, fate had confirmed him as legend and griot to the peoples and Assemblies of the post-Ring era. Work hard. Do well. Baba will be awake in a few more years. Make him proud.  They had done well, so well that this would be his last awakening. The Caribbean awaited him, restored and resettled. He was finally going home to live out the rest of his life.  Baptiste opened the double doors. Euclid paused, breathed deeply, and walked outside onto the large deck. The hospice was perched on the edge of a hill. Euclid went to the railing to survey thousands of miles of the Sahara.  Bright-feathered birds filled the air with cheerful song. The wind brought a cool kiss to his cheek, promising rain later in the day. Dawn filtered slowly over what had once been desert, tinting the lush green hills with an aura of dusty gold as far as the eye could see.  Come, Baba. Let’s go home.    Originally published in Bridging Infinity, edited by Jonathan Strahan.  Barbadian author, editor and research consultant Karen Lord is known for her debut novel Redemption in Indigo, which won the 2008 Frank Collymore Literary Award, the 2010 Carl Brandon Parallax Award, the 2011 William L. Crawford Award, the 2011 Mythopoeic Fantasy Award for Adult Literature and the 2012 Kitschies Golden Tentacle (Best Debut), and was longlisted for the 2011 Bocas Prize for Caribbean Literature and nominated for the 2011 World Fantasy Award for Best Novel. Her second novel The Best of All Possible Worlds won the 2009 Frank Collymore Literary Award, the 2013 RT Book Reviews Reviewers' Choice Awards for Best Science Fiction Novel, and was a finalist for the 2014 Locus Awards. Its sequel, The Galaxy Game, was published in January 2015. She is the editor of the 2016 anthology New Worlds, Old Ways: Speculative Tales from the Caribbean.  Called \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.  His Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"  He currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "text": "9630 words, novelette, REPRINT\nThe Mighty Slinger\nEarth began to rise over the lunar hills as the Mighty Slinger and the Rovers readied the Tycho stage for their performance. Tapping his microphone, Euclid noticed that Kumi barely glanced at the sight as he set up his djembe and pan assembly, but Jeni froze and stared up at the blue disk, her bass still limp between her hands.\n“It’s not going anywhere,” Kumi muttered. His long, graying dreadlocks swayed gently in the heavy gravity of the moon and tapped the side of a pan with a muted “ting.”\n“It’ll be there after the concert . . . and after our trip, and after we revive from our next long-sleep.”\n“Let her look,” Vega admonished. “You should always stop for beauty. It vanishes too soon.”\n“She taking too long to set up,” Kumi said. “You-all call her Zippy but she ain’t zippy at all.”\nEuclid chuckled as Jeni shot a stink look at her elder and mentor. She whipped the bass out stiff like she meant business. Her fingers gripped and danced on the narrow surface in a quick, defiant riff.\nRaising his mic-wand at the back, Vega captured the sound as it bounced back from the lunar dome performance area. He fed the echo through the house speakers, ending it with a punctuating note of Kumi’s locks hitting the pan with a ting and Euclid’s laughter rumbling quietly in the background. Dhaka, the last of the Rovers, came in live with a cheerful fanfare on her patented Delirium, an instrument that looked like a harmonium had had a painful collision with a large quantity of alloy piping.\nAn asteroid-thin man in a black suit slipped past the velvet ropes marking off the VIP section and nodded at Euclid. “Yes sir. Your pay’s been deposited, the spa is booked, and your places in the long-sleep pool are reserved.”\n“Did you add the depreciation-protection insurance this time?” Euclid answered, his voice cold with bitter memory. “If your grandfather had sense I could be retired by now.”\nKumi looked sharply over. The man in the suit shifted about. “Of course I’ll add the insurance,” he mumbled.\n“Thank you, Mr. Jones,” Euclid said, in a tone that was not at all thankful.\n“There’s, ah, someone else who would like to talk to you,” the event coordinator said.\n“Not now Jones.” Euclid turned away to face his band. “Only forty minutes to curtain time and we need to focus.”\n“It’s about Earth,” Jones said.\nEuclid turned back. “That rumor?”\nJones shook his head. “Not a rumor. Not even a joke. The Rt Hon. Patience Bouscholte got notification this morning. She wants to talk to you.”\nThe Rt Hon. Patience Bouscholte awaited him in one of the skyboxes poised high over the rim of the crater. Before it: the stands that would soon be filling up, slanting along the slope that created a natural amphitheater to the stage. Behind it: the gray hills and rocky wasteland of the Moon.\n“Mr. Slinger!” she said. Her tightly wound hair and brown spidersilk head scarf bobbed in a slightly delayed reaction to the lunar gravity. “A pleasure to finally meet you. I’m a huge admirer of your sound.”\nHe sat down, propped his snakeskin magnet-boots up against the chairback in front of him, and gave her a cautious look. “Madame Minister. To what do I owe the pleasure?”\nAll of the band were members of the Rock Devils Cohort and Consociate Fusion, almost a million strong, all contract workers in the asteroid belt. They were all synced up on the same long-sleep schedule as their cohort, whether working the rock or touring as a band. And here was a Minister from the RDCCF’s Assembly asking to speak with him.\nThe RDCCF wasn’t a country. It was just one of many organizations for people who worked in space because there was nothing left for them on Earth. But to Euclid, meeting the Rt Hon. Patience Bouscholte felt like meeting a Member of Parliament from the old days. Euclid was slightly intimidated, but he wasn’t going to show it. He put an arm casually over the empty seat beside him.\n“They said you were far quieter in person than on stage. They were right.” Bouscholte held up a single finger before he could reply, and pointed to two women in all-black bulletproof suits who were busy scanning the room with small wands. They gave a thumbs up as Bouscholte cocked her head in their direction, and retreated to stand on either side of the entrance.\nShe turned back to Euclid. “Tell me, Mr. Slinger, how much have you heard about the Solar Development Charter and their plans for Earth?”\nSo it was true? He leaned toward her. “Why would they have any plans for Earth? I’ve heard they’re stretched thin enough building the Glitter Ring.”\n“They are. They’re stretched more than thin. They’re functionally bankrupt. So the SDC is taking up a new tranche of preferred shares for a secondary redevelopment scheme. They want to ‘redevelop’ Earth, and that will not be to our benefit.”\n“Well then.” Euclid folded his arms and leaned back. “And you thought you’d tell an old calypso singer that because . . . ?”\n“Because I need your rhymes, Mr. Slinger.”\nEuclid had done that before, in the days before his last long-sleep, when fame was high and money had not yet evaporated. Dishing out juicy new gossip to help Assembly contract negotiations. Leaking information to warn the workers all across the asteroid belt. Hardworking miners on contract, struggling to survive the long nights and longer sleeps. Sing them a song about how the SDC was planning to screw them over again. He knew that gig well.\nHe had thought that was why he’d been brought to see her, to get a little something to add extempo to a song tonight. Get the Belt all riled up. But if this was about Earth . . . ? Earth was a garbage dump. Humanity had sucked it dry like a vampire and left its husk to spiral toward death as people moved outward to bigger and better things.\n“I don’t sing about Earth anymore. The cohorts don’t pay attention to the old stuff. Why should they care? It’s not going anywhere.”\nThen she told him. Explained that the SDC was going to beautify Earth. Re-terraform it. Make it into a new garden of Eden for the rich and idle of Mars and Venus.\n“How?” he asked, skeptical.\n“Scorched Earth. They’re going to bomb the mother planet with comets. Full demolition. The last of us shipped into the Ring to form new cohorts, new generations of indentured servitude. A clean slate to redesign their brave new world. That is what I mean when I say not to our benefit.”\nHe exhaled slowly. “You think a few little lyrics can change any of that?” The wealth of Venus, Mars, and Jupiter dwarfed the cohorts in their hollowed out, empty old asteroids.\n“One small course adjustment at the start can change an entire orbit by the end of a journey,” she said.\n“So you want me to harass the big people up in power for you, now?”\nBouscholte shook her head. “We need you to be our emissary. We, the Assembly, the last representatives of the drowned lands and the dying islands, are calling upon you. Are you with us or not?”\nEuclid thought back to the days of breezes and mango trees. “And if they don’t listen to us?”\nBouscholte leaned in close and touched his arm. “The majority of our cohort are indentured to the Solar Development Charter until the Glitter Ring is complete. But, Mr. Slinger, answer me this: where do you think that leaves us after we finish the Ring, the largest project humanity has ever attempted?”\nEuclid knew. After the asteroid belt had been transformed into its new incarnation, a sun-girdling, sun-powered device for humanity’s next great leap, it would no longer be home.\nThere were few resources left in the Belt; the big planets had got there first and mined it all. Euclid had always known the hollow shells that had been left behind. The work on the Glitter Ring. The long-sleep so that they didn’t exhaust resources as they waited for pieces of the puzzle to slowly float from place to appointed place.\nBouscholte continued. “If we can’t go back to Earth, they’ll send us further out. Our cohorts will end up scattered to the cold, distant areas of the system, out to the Oort Cloud. And we’ll live long enough to see that.”\n“You think you can stop that?”\n“Maybe, Mr. Slinger. There is almost nothing we can broadcast that the big planets can’t listen to. When we go into long-sleep they can hack our communications, but they can’t keep us from talking, and they’ll never stop our songs.”\n“It’s a good dream,” Euclid said softly, for the first time in the conversation looking up at the view over the skybox. He’d avoided looking at it. To Jeni it was a beautiful blue dot, but for Euclid all it did was remind him of what he’d lost. “But they won’t listen.”\n“You must understand, you are just one piece in a much bigger game. Our people are in place, not just in the cohorts, but everywhere, all throughout the system. They’ll listen to your music and make the right moves at the right time. The SDC can’t move to destroy and rebuild Earth until the Glitter Ring is finished, but when it’s finished they’ll find they have underestimated us—as long as we coordinate in a way that no one suspects.”\n“Using songs? Nah. Impossible,” he declared bluntly.\nShe shook her head, remarkably confident. “All you have to do is be the messenger. We’ll handle the tactics. You forget who you’re speaking to. The Bouscholte family tradition has always been about the long game. Who was my father? What positions do my sons hold, my granddaughters? Euclid Slinger . . . Babatunde . . . listen to me. How do you think an aging calypso star gets booked to do an expensive, multi-planetary tour to the capitals of the Solar System, the seats of power? By chance?”\nShe called him that name as if she were his friend, his inner-circle intimate. Kumi named him that years . . . decades ago. Too wise for your years. You were here before, he’d said. The Father returns, sent back for a reason. Was this the reason?\n“I accept the mission,” he said.\nDay. Me say Day-Oh. Earthrise come and me want go . . .\nEuclid looked up, smiled. Let the chord go. He wouldn’t be so blatant as to wink at the VIP section, but he knew that there was a fellow Rock Devil out there, listening out for certain songs and recording Vega’s carefully assembled samples to strip for data and instructions in a safe location. Vega knew, of course. Had to, in order to put together the info packets. Dhaka knew a little but had begged not to know more, afraid she might say the wrong thing to the wrong person. Jeni was still, after her first long-sleep, nineteen in body and mind, so no, she did not know, and anyway how could he tell her when he was still dragging his feet on telling Kumi?\nAnd there was Kumi, frowning at him after the end of the concert as they sprawled in the green room, taking a quick drink before the final packing up. “Baba, you on this nostalgia kick for real.”\n“You don’t like it?” Euclid teased him. “All that sweet, sweet soca you grew up studying, all those kaiso legends you try to emulate?”\n“That ain’t your sound, man.”\nEuclid shrugged. “We can talk about that next time we’re in the studio. Now we got a party to be at!”\nAfter twenty-five years of long-sleep, Euclid thought Mars looked much the same, except maybe a little greener, a little wetter. Perhaps that was why the directors of the SDC-MME had chosen to host their bash in a gleaming biodome that overlooked a charming little lake. Indoor foliage matched to outer landscape in a lush canopy and artificial lights hovered in competition with the stars and satellites beyond.\n“Damn show-offs,” Dhaka muttered. “Am I supposed to be impressed?”\n“I am,” Jeni said shamelessly, selecting a stimulant cocktail from an offered tray. Kumi smoothly took it from her and replaced it with another, milder option. She looked outraged.\n“Keep a clear head, Zippy,” Vega said quietly. “We’re not among friends.”\nThat startled her out of her anger. Kumi looked a little puzzled himself, but he accepted Vega’s support without challenge.\nEuclid listened with half his attention. He had just noticed an opportunity. “Kumi, all of you, come with me. Let’s greet the CEO and offer our thanks for this lovely party.”\nKumi came to his side. “What’s going on?”\nEuclid lowered his voice. “Come, listen and find out.”\nThe CEO acknowledged them as they approached, but Euclid could sense from the body language that the busy executive would give them as much time as dictated by courtesy and not a bit more. No matter that Euclid was a credentialed ambassador for the RDCCF, authorized by the Assembly. He could already tell how this meeting would go.\n“Thank you for hosting us, Mx. Ashe,” Euclid said, donning a pleasant, grinning mask. “It’s always a pleasure to kick off a tour at the Mars Mining and Energy Megaplex.”\n“Thank you,” the executive replied. “Your music is very popular with our hands.”\n“Pardon?” Kumi enquired, looking in confusion at the executive’s fingers wrapped around an ornate cocktail glass.\n“Our employees in the asteroid belt.”\nKumi looked unamused. Euclid moved on quickly. “Yes. You merged with the SDC . . . pardon me, we are still trying to catch up on twenty-five years of news . . . about ten years ago?”\nA little pride leaked past the politeness. “Buyout, not merger. Only the name has survived, to maintain continuity and branding.”\nEuclid saw Dhaka smirk and glance at Vega, who looked a little sour. He was still slightly bitter that his ex-husband had taken everything in the divorce except for the de la Vega surname, the name under which he had become famous and which Vega was forced to keep for the sake of convenience.\n“But don’t worry,” the CEO continued. “The Glitter Ring was always conceptualized as a project that would be measured in generations. Corporations may rise and fall, but the work will go on. Everything remains on schedule and all the hands . . . all the—how do you say—cohorts are in no danger of losing their jobs.”\n“So, the cohorts can return to Earth after the Ring is completed?” Euclid asked directly.\nMx. Ashe took a careful sip of bright purple liquid before replying. “I did not say that.”\n“But I thought the Earth development project was set up to get the SDC a secondary round of financing, to solve their financial situation,” Dhaka demanded, her brow creasing. “You’ve bought them out, so is that still necessary?”\nMx. Ashe nodded calmly. “True, but we have a more complex vision for the Glitter Ring than the SDC envisioned, and so funding must be vastly increased. Besides, taking money for a planned redevelopment of Earth and then not doing it would, technically, be fraud. The SDC-MME will follow through. I won’t bore you with the details, but our expertise on geo-engineering is unparalleled.”\n“You’ve been dropping comets on vast, uninhabited surfaces,” Dhaka said. “I understand the theory, but Earth isn’t Venus or Mars. There’s thousands of years of history and archeology. And there are still people living there. How are you going to move a billion people?”\nMx. Ashe looked coldly at Dhaka. “We’re still in the middle of building a Ring around the sun, Mx. Miriam. I’m sure my successors on the Board will have it all figured out by the next time we wake you up. We understand the concerns raised, but after all, people have invested trillions in this project. Our lawyers are in the process of responding to all requests and lawsuits, and we will stand by the final ruling of the courts.”\nEuclid spoke quickly, blunt in his desperation. “Can’t you reconsider, find another project to invest in? Earth’s a mess, we all know it, but we always thought we’d have something to come back to.”\n“I’m sure a man of your means could afford a plot on New Earth—” Mx. Ashe began.\n“I’ve seen the pricing,” Vega cut in dryly. “Musicians don’t make as much as you think.”\n“What about the cohorts?” Jeni said sadly. “No one in the cohorts will be able to afford to go back.”\nMx. Ashe stepped back from the verbal bombardment. “This is all speculation. The cohorts are still under contract to work on the Glitter Ring. Once they have finished, negotiations about their relocation can begin. Now, if you will excuse me, have a good night and enjoy the party!”\nEuclid watched despondently as the CEO walked away briskly. The Rovers stood silently around him, their faces somber. Kumi was the first to speak. “Now I understand the nostalgia kick.”\nThe SDC, now with the MME\nYou and I both know\nThey don’t stand for you and me\nThere was still a tour to play. The band moved from Elysium City to Electris Station, then Achillis Fons, where they played in front of the Viking Museum.\nThe long-sleep on the way to Mars had been twenty-five years. Twenty-five years off, one year on. That was the shift the Rock Devils Cohort and Consociation Fusion had agreed to, the key clause in the contract Euclid had signed way-back-when in an office built into the old New York City seawall.\nThat gave them a whole year on Mars. Mx. Ashe may have shut them down, but Euclid wasn’t done yet. Not by a long shot.\nKumi started fretting barely a month in.\n“Jeni stepping out with one of the VIPs,” he told Euclid.\n“She’s nineteen. What you expecting? A celibate band member? I don’t see you ignoring anyone coming around when we breaking down.”\nKumi shook his head. “No Baba, that’s one thing. This is the same one she’s seeing. Over and over. Since we arrived here. She’s sticky sweet on him.”\n“Kumi, we got bigger things to worry about.”\n“Earth, I know. Man, look, I see why you’re upset.” Kumi grabbed his hand. “I miss it too. But we getting old, Baba. I just pass sixty. How much longer I could do this? Maybe we focus on the tour and invest the money so that we can afford to go back some day.”\n“I can’t give it up that easy,” Euclid said to his oldest friend. “We going to have troubles?”\nBack when Euclid was working the rocks, Kumi had taken him under his wing. Taught him how to sing the old songs while they moved their one-person pods into position to drill them out. Then they’d started singing at the start of shifts and soon that took off into a full career. They’d traveled all through the Belt, from big old Ceres to the tiniest cramped mining camps.\nKumi sucked his teeth. “That first time you went extempo back on Pallas, you went after that foreman who’d been skimping on airlock maintenance? You remember?”\nEuclid laughed. “I was angry. The airlock blew out and I wet myself waiting for someone to come pick me up.”\n“When you started singing different lyrics, making them up on the spot, I didn’t follow you at first. But you got the SDC to fire him when the video went viral. That’s why I called you Baba. So, no, you sing and I’ll find my way around your words. Always. But let me ask you—think about what Ashe said. You really believe this fight’s worth it?”\nEuclid bit his lip.\n“We have concerts to give in the Belt and Venus yet,” he told Kumi. “We’re not done yet.”\nFive months in, the Martians began to turn. The concerts had been billed as cross-cultural events, paid for by the Pan-Human Solar Division of Cultural Affairs and the Martian University’s division of Inter-Human Musicology Studies school.\nEuclid, on stage, hadn’t noticed at first. He’d been trying to find another way to match up MME with “screw me” and some lyrics in between. Then a comparison to Mars and its power, and the people left behind on Earth.\nBut he noticed when this crowd turned.\nEuclid had grown used to the people of the big planets just sitting and listening to his music. No one was moving about. No hands in the air. Even if you begged them, they weren’t throwing their hands out. No working, no grinding, no nothing. They sat in seats and appreciated.\nHe didn’t remember when they turned. He would see it on video later. Maybe it was when he called out the “rape” of Earth with the “red tape” of the SDC-MME and made a visual of “red” Mars that tied to the “red” tape, but suddenly those chair-sitting intercultural appreciators stood up.\nAnd it wasn’t to jump.\nThe crowd started shouting back. The sound cut out. Security and the venue operators swept in and moved them off the stage.\nBack in the green room, Jeni rounded on Euclid. “What the hell was that?” she shouted.\n“Extempo,” Euclid said simply.\nKumi tried to step between them. “Zippy—”\n“No!” She pushed him aside. Dhaka, in the corner of the room, started disassembling the Delirium, carefully putting the pieces away in a g-force protected aerogel case, carefully staying out of the brewing fight. Vega folded his arms and stood to a side, watching. “I damn well know what extempo is. I’m young, not ignorant.”\nEveryone was tired. The heavy gravity, the months of touring already behind them. “This always happens. A fight always come halfway through,” Euclid said. “Talk to me.”\n“You’re doing extempo like you’re in a small free concert in the Belt, on a small rock. But this isn’t going after some corrupt contractor,” Jeni snapped. “You’re calling out a whole planet now? All Martians? You crazy?”\n“One person or many, you think I shouldn’t?”\nEuclid understood. Jeni had been working pods like he had at the same age. Long, grueling shifts spent in a tiny bubble of plastic where you rebreathed your own stench so often you forgot what clean air tasted like. Getting into the band had been her way “off the rock.” This was her big gamble out of tedium. His too, back in the day.\n“You’re not entertaining people. You’re pissing them off,” she said.\nEuclid sucked his teeth. “Calypso been vexing people since all the way back. And never mind calypso, Zippy, entertainment isn’t just escape. Artists always talking back, always insolent.”\n“They paid us and flew us across the solar system to sing the song they wanted. Sing the fucking song for them the way they want. Even just the Banana Boat Song you’re messing with and going extempo. That shit’s carved in stone, Euclid. Sing the damn lyrics.”\nEuclid looked at her like she’d lost her mind. “That song was never for them. Problem is it get sung too much and you abstract it and then everyone forget that song is a blasted lament. Well, let me educate you, Ms Baptiste. The Banana Boat Song is a mournful song about people getting their backs broken hard in labor and still using call and response to help the community sync up, dig deep, and find the power to work harder ’cause dem ain’t had no choice.”\nHe stopped. A hush fell in the green room.\nEuclid continued. “It’s not a ‘smile and dance for them’ song. The big planets don’t own that song. It was never theirs. It was never carved in stone. I’ll make it ours for here, for now, and I’ll go extempo. I’m not done. Zippy, I’m just getting started.”\nShe nodded. “Then I’m gone.”\nJust like that, she spun around and grabbed her bass.\nKumi glared at Euclid. “I promised her father I’d keep an eye on her—”\n“Go,” Euclid said calmly, but he was suddenly scared that his oldest friend, the pillar of his little band, would walk out the green room door with the newest member and never come back.\nKumi came back an hour later. He looked suddenly old . . . those raw-sun wrinkles around his eyes, the stooped back. But it wasn’t just gravity pulling him down. “She’s staying on Mars.”\nEuclid turned to the door. “Let me go speak to her. I’m the one she angry with.”\n“No.” Kumi put a hand on his shoulder. “That wasn’t just about you. She staying with someone. She’s not just leaving the band, she leaving the cohort. Got a VIP, a future, someone she thinks she’ll build a life with.”\nShe was gone. Like that.\nVega still had her riffs, though. He grumbled about the extra work, but he could weave the recorded samples in and out of the live music.\nKumi got an invitation to the wedding. It took place the week before the Rovers left Mars for the big tour of the asteroid belt.\nEuclid wasn’t invited.\nHe did a small, open concert for the Rock Devils working on Deimos. It was just him and Vega and fifty miners in one of the teardown areas of the tiny moon. Euclid sang for them just as pointedly as ever.\nSo it’s up to us, you and me\nto put an end to this catastrophe.\nThem ain’t got neither conscience nor heart.\nWe got to pitch in and do our part\n’cause if this Earth demolition begin\nwe won’t even have a part/pot to pitch/piss in.\nTouring in the Belt always gave him a strange feeling of mingled nostalgia and dissonance. There were face-to-face reunions and continued correspondence with friends and relatives of their cohort, who shared the same times of waking and long-sleep, spoke the same language, and remembered the same things. But there were also administrators and officials, who kept their own schedule, and workers from cohorts on a different frequency—all strangers from a forgotten distant past or an unknown near-present. Only the most social types kept up-to-date on everything, acting as temporal diplomats, translating jokes and explaining new tech and jargon to smooth communication between groups.\nZiamara Bouscholte was social. Very social. Euclid had seen plenty of that frivolous-idle behavior from political families and nouveau-nobility like the family Jeni had married into, but given that surname and the fact that she had been assigned as their tour liaison, he recognized very quickly that she was a spy.\n“Big tours in the Belt are boredom and chaos,” he warned her, thinking about the argument with Jeni. “Lots of downtime slinging from asteroid to asteroid punctuated by concert mayhem when we arrive.”\nShe grinned. “Don’t worry about me. I know exactly how to deal with boredom and chaos.”\nShe didn’t lie. She was all-business on board, briefing Vega on the latest cryptography and answering Dhaka’s questions about the technological advances that were being implemented in Glitter Ring construction. Then the butterfly emerged for the concerts and parties as she wrangled fans and dignitaries with a smiling enthusiasm that never flagged.\nThe Vesta concert was their first major stop. The Mighty Slinger and his Rovers peeked out from the wings of the stage and watched the local opening act finishing up their last set.\nKumi brought up something that had been nagging Euclid for a while. “Baba, you notice how small the crowds are? This is our territory, not Mars. Last big tour we had to broadcast over Vesta because everything was sold out.”\nVega agreed. “Look at this audience. Thin. I could excuse the other venues for size, but not this one.”\n“I know why,” Dhaka said. “I can’t reach half my friends who agreed to meet up. All I’m getting from them are long-sleep off-shift notices.”\n“I thought it was just me,” Kumi said. “Did SDC-MME leave cohorts in long-sleep? Cutting back on labor?”\nDhaka nodded. “Zia mentioned some changes in the project schedule. You know the Charter’s not going to waste money feeding us if we’re not working.”\nEuclid felt a surge of anger. “We’ll be out of sync when they wake up again. That messes up the whole cohort. You sure they’re doing this to cut labor costs, or to weaken us as a collective?”\nDhaka shrugged. “I don’t like it one bit, but I don’t know if it’s out of incompetence or malice.”\n“Time to go,” said Vega, his eyes on the openers as they exited stage left.\nThe Rovers drifted on stage and started freestyling, layering sound on sound. Euclid waited until they were all settled in and jamming hard before running out and snagging his mic. He was still angry, and the adrenaline amped up his performance as he commandeered the stage to rant about friends and lovers lost for a whole year to long-sleep.\nThen he heard something impossible: Kumi stumbled on the beat. Euclid looked back at the Rovers to see Vega frozen. A variation of one of Jeni’s famous riffs was playing, but Vega shook his head not me to Dhaka’s confused sideways glance.\nZia’s voice came on the sound system, booming over the music. “Rock Devils cohort, we have a treat for you! On stage for the first time in twenty-five years, please welcome Rover bassist Jeni ‘Zippy’ Baptiste!”\nJeni swooped in from the wings with another stylish riff, bounced off one of the decorated pylons, then flew straight to Kumi and wrapped him in a tumbling hug, bass and all. Prolonged cheering from the crowd drowned out the music. Euclid didn’t know whether to be furious or overjoyed at Zia for springing the surprise on them in public. Vega smoothly covered for the absent percussion and silent bass while Dhaka went wild on the Delirium. It was a horrible place for a reunion, but they’d take it. Stage lighting made it hard to tell, but Jeni did look older and . . . stronger? More sure of herself?\nEuclid floated over to her at the end of the song as the applause continued to crash over them all. “Welcome back, Zippy,” he said. “You’re still good—better, even.”\nHer laugh was full and sincere. “I’ve been listening to our recordings for twenty-five years, playing along with you every day while you were in long-sleep. Of course I’m better.”\n“You missed us,” he stated proudly.\n“I did.” She swatted a tear out of the air between them with the back of her hand. “I missed this. Touring for our cohort. Riling up the powers that be.”\nHe raised his eyebrows. “Now you want to shake things up? What changed?”\nShe shook her head sadly. “Twenty-five years, Baba. I have a daughter, now. She’s twenty, training as an engineer on Mars. She’s going to join the cohort when she’s finished and I want more for her. I want a future for her.”\nHe hugged her tight while the crowd roared in approval. “Get back on that bass,” he whispered. “We got a show to finish!”\nHe didn’t bother to ask if the nouveau-nobility husband had approved of the rebel Rover Jeni. He suspected not.\nIn the green room Jeni wrapped her legs around a chair and hung a glass of beer in the air next to her.\n“Used to be it would fall slowly down to the floor,” Jeni said, pointing at her drink. “They stripped most of Vesta’s mass for the Ring. It’s barely a shell here.”\nDhaka shoved a foot in a wall strap and settled in perpendicular to Jeni. She swirled the whiskey glass around in the air. Despite the glass being designed for zero gravity, her practiced flip of the wrist tossed several globules free that very slowly wobbled their way through the air toward her. “We’re passing into final stage preparations for the Ring. SDC-MME is panicking a bit because the projections for energy and the initial test results don’t match. And the computers are having trouble managing stable orbits.”\nThe Glitter Ring was a Dyson Ring, a necklace of solar power stations and sails built around the sun to capture a vast percentage of its energy. The power needs of the big planets had begun to outstrip the large planetary solar and mirror arrays a hundred years ago. Overflight and shadow rights for solar gathering stations had started turning into a series of low-grade orbital economic wars. The Charter had been created to handle the problem system-wide.\nBuild a ring of solar power catchments in orbit around the sun at a slight angle to the plane of the solar system. No current solar rights would be abridged, but it could catapult humanity into a new industrial era. A great leap forward. Unlimited, unabridged power.\nBut if it didn’t work . . .\nDhaka nodded at all the serious faces. “Don’t look so glum. The cohort programmers are working on flocking algorithms to try and simplify how the solar stations keep in orbit. Follow some simple rules about what’s around you and let complex emergent orbits develop.”\n“I’m more worried about the differences in output,” Jeni muttered. “While you’ve been in long-sleep they’ve been developing orbital stations out past Jupiter with the assumption that there would be beamed power to follow. They’re building mega-orbitals throughout the system on the assumption that the Ring’s going to work. They’ve even started moving people off Earth into temporary housing in orbit.”\n“Temporary?” Euclid asked from across the room, interrupting before Dhaka and Jeni got deep into numbers and words like exajoules, quantum efficiency, price per watt, and all the other boring crap. He’d cared intimately about that when he first joined the cohort. Now, not so much.\n“We’re talking bubble habitats with thinner shells than Vesta right now. They use a layer of water for radiation shielding, but they lack resources and they’re not well balanced. These orbitals have about a couple hundred thousand people each, and they’re rated to last fifty to sixty years.” Jeni shook her head, and Euclid was forced to stop seeing the nineteen-year-old Zippy and recognize the concerned forty-four year old she’d become. “They’re risking a lot.”\n“Why would anyone agree?” Vega asked. “It sounds like suicide.”\n“It’s gotten worse on Earth. Far worse. Everyone is just expecting to hit the reset button after the Glitter Ring goes online. Everyone’s holding their breath.”\nDhaka spoke up. “Okay, enough cohort bullshit. Let’s talk about you. The band’s heading back to long-sleep soon—and then what, Zippy? You heading back to Mars and your daughter?”\nJeni looked around the room hesitantly. “Lara’s never been to Venus, and I promised her she could visit me . . . if you’ll have me?”\n“If?” Vega laughed. “I hated playing those recordings of you. Rather hear it live.”\n“I’m not as zippy up and down the chords as I used to be, you know,” Jeni warned. Everyone was turning to look at Euclid.\n“It’s a more confident sound,” he said with a smile. Dhaka whipped globules of whiskey at them and laughed.\nKumi beamed, no doubt already dreaming about meeting his “granddaughter.”\n“Hey, Zippy,” Euclid said. “Here’s to change. Good change.”\n“Maybe,” she smiled and slapped his raised hand in agreement and approval. “Let’s dream on that.”\nThe first few days after long-sleep were never pleasant, but this awakening was the worst of Euclid’s experience. He slowly remembered who he was, and how to speak, and the names of the people who sat quietly with him in the lounge after their sessions with the medics. For a while they silently watched the high cities of Venus glinting in the clouds below their orbit from viewports near the long-sleep pools.\nLater they began to ask questions, later they realized that something was very wrong. They’d been asleep for fifty years. Two long-sleeps, not the usual single sleep.\n“Everyone gone silent back on Vesta,” Dhaka said.\n“Did we get idled?” Euclid demanded. They were a band, not workers. They shouldn’t have been idled.\nThe medics didn’t answer their questions. They continued to deflect everything until one morning an officer turned up, dressed in black sub-uniform with empty holster belt, as if he had left his weapons and armor just outside the door. He looked barely twenty, far too young for the captain’s insignia on his shoulders.\nHe spoke with slow, stilted formality. “Mr. Slinger, Mr. Djansi, Mr. de la Vega, Ms Miriam, and Ms Baptiste—thank you for your patience. I’m Captain Abrams. We’re sorry for the delay, but your recovery was complicated.”\n“Complicated!” Kumi looked disgusted. “Can you explain why we had two long-sleeps instead of one? Fifty years? We had a contract!”\n“And we had a war.” The reply was unexpectedly sharp. “Be glad you missed it.”\n“Our first interplanetary war? That’s not the change I wanted,” Euclid muttered to Vega.\n“What happened?” Jeni asked, her voice barely a whisper. “My daughter, she’s on Mars, is she safe?”\nThe officer glanced away in a momentary flash of vulnerability and guilt. “You have two weeks for news and correspondence with your cohort and others. We can provide political summaries and psychological care for your readjustment. After that, your tour begins. Transport down to the cities has been arranged. I just . . . I have to say . . . we still need you now, more than ever.”\n“The rass?” Kumi stared at the soldier, spreading his arms.\nAgain that touch of vulnerability as the young soldier replied with a slight stammer. “Please. We need you. You’re legends to the entire system now, not just the cohorts.”\n“The hell does that mean?” Vega asked as the boy-captain left.\nJeni’s daughter had managed one long-sleep but woke on schedule while they stayed in storage. The war was over by then, but Martian infrastructure had been badly damaged and skilled workers were needed for longer than the standard year or two. Lara had died after six years of “extra time,” casualty of a radiation exposure accident on Deimos.\nThey gathered around Jeni when she collapsed to her knees and wept, grieving for the child they had never known.\nTheir correspondence was scattered across the years, their cohort truly broken as it had been forced to take cover, retreat, or fight. The war had started in Earth orbit after a temporary habitat split apart, disgorging water, air, and people into vacuum. Driven by desperation and fury, several other orbital inhabitants had launched an attack on SDC-MME-owned stations, seeking a secure environment to live, and revenge for their dead.\nConflict became widespread and complicated. The orbital habitats were either negotiating for refugees, building new orbitals, or fighting for the SDC-MME. Mars got involved when the government sent its military to protect the Martian investment in the SDC-MME. Jupiter, which was now its own functioning techno-demarchy, had struck directly at the Belt, taking over a large portion of the Glitter Ring.\nMillions had died as rocks were flung between the worlds, and ships danced around each other in the vacuum. People fought hand-to-hand in civil wars inside hollowed out asteroids, gleaming metal orbitals, and in the cold silence of space.\nHumanity had carried war out of Earth and into the great beyond.\nDespite the grim history lesson, as the band shared notes and checked their financial records, one thing became clear. They were legends. The music of the Mighty Slinger and the Rovers had become the sound of the war generation and beyond: a common bond that the cohorts could still claim, and battle hymns for the Earth emigrants who had launched out from their decayed temporary orbitals. Anti-SDC-MME songs became treasured anthems. The Rovers’ songs sold billions, the covers of their songs sold billions. There were tribute bands and spin-off bands and a fleet of touring bands. They had spawned an entire subgenre of music.\n“We’re rich at last,” Kumi said ruefully. “I thought I’d enjoy it more.”\nEarth was still there, still a mess, but Vega found hope in news from his kin. For decades, Pacific Islanders had stubbornly roved over their drowned states in vast fleets, refusing resettlement to the crowded cities and tainted badlands of the continents. In the last fifty years, their floating harbors had evolved from experimental platforms to self-sustaining cities. For them, the war had been nothing but a few nights filled with shooting stars and the occasional planetfall of debris.\nThe Moon and Venus had fared better in the war than Mars, but the real shock was the Ring. According to Dhaka, the leap in progress was marked, even for fifty years. Large sections were now fully functional and had been used during the war for refueling, surveillance, barracks, and prisons.\n“Unfortunately, that means that the purpose of the Ring has drifted once again,” she warned. “The military adapted it to their purposes, and returning it to civilian use will take some time.”\n“But what about the Assembly?” Euclid asked her one day when they were in the studio, shielded from surveillance by noise and interference from Vega’s crafting. “Do they still care about the purpose of the Ring? Do you think we still have a mission?”\nThe war had ended without a clear victor. The SDC-MME had collapsed and the board had been tried, convicted and exiled to long-sleep until a clear treaty could be hammered out. Jupiter, Mars, Venus, and some of the richer orbitals had assumed the shares and responsibility of the original solar charter. A tenuous peace existed.\nDhaka nodded. “I was wondering that too, but look, here’s the name of the company that’s organizing our tour.”\nEuclid leaned in to read her screen. Bouscholte, Bouscholte & Abrams.\nCaptain Abrams revealed nothing until they were all cramped into the tiny cockpit of a descent craft for Venus’ upper atmosphere.\nHe checked for listening devices with a tiny wand, and then, satisfied, faced them all. “The Bouscholte family would like to thank you for your service. We want you to understand that you are in an even better position to help us, and we need that help now, more than ever.”\nThey’d come this far. Euclid looked around at the Rovers. They all leaned in closer.\n“The Director of Consolidated Ring Operations and Planetary Reconstruction will be at your concert tonight.” Abrams handed Euclid a small chip. “You will give this to him—personally. It’s a quantum encrypted key that only Director Cutler can access.”\n“What’s in it?” Dhaka asked.\nAbrams looked out the window. They were about to fall into the yellow and green clouds. The green was something to do with floating algae engineered for the planet, step one of the eventual greening of Venus. “Something Cutler won’t like. Or maybe a bribe. I don’t know. But it’s an encouragement for the Director to consider a proposal.”\n“Can you tell us what the proposal is?”\n“Yes.” Abrams looked at the band. “Either stop the redevelopment of Earth and further cement the peace by returning the orbitals inhabitants to the surface, or . . . ”\nEveryone waited as Abrams paused dramatically.\n“ . . . approve a cargo transit across Mercury’s inner orbit to the far side of the Glitter Ring, and give us the contracts for rebuilding the orbital habitats.”\nDhaka frowned. “I wasn’t expecting something so boring after the big ‘or’ there, Captain.”\nAbrams smiled. “One small course adjustment at the start can change an entire orbit by the end of a journey,” he said to Euclid.\nThat sounded familiar.\n“Either one of those is important?” Euclid asked. “But you won’t say why.”\n“Not even in this little cabin. I’m sure I got the bugs, but in case I didn’t.” Abrams shrugged. “Here we are. Ready to change the solar system, Mr. Slinger?”\nVenusian cities were more impressive when viewed from the outside. Vast, silvery spheres clustered thickly in the upper atmosphere, trailing tethers and tubes to the surface like a dense herd of giant cephalopods. Inside, the decor was sober, spare and disappointing, hinting at a slow postwar recovery.\nThe band played their first concert in a half-century to a frighteningly respectful and very exclusive audience of the rich and powerful. Then it was off to a reception where they awkwardly sipped imported wine and smiled as their assigned liaison, a woman called Halford, briskly introduced and dismissed awestruck fans for seconds of small talk and a quick snap.\n“And this is Petyr Cutler,” Halford announced. “Director of Consolidated Ring Operations and Planetary Reconstruction.”\nBodyguards quickly made a wall, shepherding the Director in for his moment.\nCutler was a short man with loose, sandy hair and bit of orbital sunburn. “So pleased to meet you,” he said. “Call me Petyr.”\nHe came in for the vigorous handshake, and Euclid had already palmed the small chip. He saw Abrams on the periphery of the crowd, watching. Nodded.\nCutler’s already reddened cheeks flushed as he looked down at the chip. “Is that—”\n“Yes.” Euclid locked eyes with him. The Director. One of the most powerful people in the entire solar system.\nCutler broke the gaze and looked down at his feet. “You can’t blackmail me, not even with this. I can’t change policy.”\n“So you still redeveloping Earth?” Euclid asked, his tone already dull with resignation.\n“I’ve been around before you were born, Mr. Slinger. I know how generational projects go. They build their own momentum. No one wants to become the executive who shut down two hundred years of progress, who couldn’t see it through to the end. Besides, wars aren’t cheap. We have to repay our citizens who invested in war bonds, the corporations that gave us tech on credit. The Earth Reconstruction project is the only thing that can give us the funds to stay afloat.”\nSomehow, his words eased the growing tightness in Euclid’s chest. “I’m supposed to ask you something else, then.”\nCutler looked suspicious. He also looked around at his bodyguards, wanting to leave. “Your people have big asks, Mr. Slinger.”\n“This is smaller. We need your permission to move parts across Mercury’s orbit, close to the sun, but your company has been denying that request. The Rock Devils cohort also wants to rebuild the surviving temporary Earth orbitals.”\n“Post-war security measures are still in place—”\n“Security measures my ass.” Jeni spoke so loudly, so intensely that the whole room went quiet to hear her.\n“Jeni—” Kumi started.\n“No. We’ve sacrificed our lives and our children’s lives for your damn Ring. We’ve made it our entire reason for existence and we’re tired. One last section to finish, that could finish in less than three decades if you let us take that shortcut to get the last damn parts in place and let us go work on something worthwhile. We’re tired. Finish the blasted project and let us live.”\nKumi stood beside her and put his arm around her shoulders. She leaned into him, but she did not falter. Her gaze stayed hard and steady on the embarrassed Director who was now the center of a room of shocked, sympathetic, judging looks.\n“We need clearance from Venus,” Director Cutler mumbled.\nEuclid started humming a quick back beat. Cutler looked startled. “Director,” Euclid sang, voice low. He reached for the next word the sentence needed to bridge. Dictator. How to string that in with . . . something to do with the project finishing later.\nHe’d been on the stage singing the old lyrics people wanted to hear. His songs that had once been extempo, but now were carved in stone by a new generation.\nBut right here, with the bodyguards all around them, Euclid wove a quick song damning him for preventing progress in the solar system and making trouble for the cohorts. That’s right, Euclid thought. That’s where the power came from, singing truth right to power’s face.\nPower reddened. Cutler clenched his jaw.\n“I can sing that louder,” Euclid said. “Loud enough for the whole system to hear it and sing it back to you.”\n“We’ll see what we can do,” Cutler hissed at him, and signaled for the bodyguards to surround him and move him away.\nHalford the liaison congratulated the band afterwards. “You did it. We’re cleared to use interior transits to the other side of the Ring and to move equipment into Earth orbit.”\n“Anything else you need us to do?” Dhaka asked.\n“Not now, not yet. Enjoy your tour. Broadcasting planetwide and recording for rebroadcast throughout the system—you’ll have the largest audience in history.”\n“That’s nice,” Euclid said vaguely. He was still feeling some discomfort with his new status as legend.\n“I can’t wait for the Earth concert,” Captain Abrams said happily. “That one will really break the records.”\n“Earth?” Kumi said sharply.\nHalford looked at him. “After your next long-sleep, for the official celebration of the completion of the Ring. That can’t happen without the Mighty Slinger and his Rovers. One last concert for the cohorts.”\n“And maybe something more,” Abrams added.\n“What do you mean, ‘more’?” Euclid demanded, weary of surprises.\nHalford and Captain Abrams shared a look—delight, anticipation, and caution.\n“When we’re sure, we’ll let you know,” the captain promised.\nEuclid sighed and glared at the door. He nervously twirled a pair of virtual-vision goggles between his fingers.\nReturning to Earth had been bittersweet. He could have asked to fly over the Caribbean Sea, but nothing would be the same—coral reef islands reclaimed by water, new land pushed up by earthquake and vomited out from volcanoes. It would pollute the memories he had of a place that had once existed.\nHe put the past out of his mind and concentrated on the present. The Rovers were already at the venue, working hard with the manager and crew in technical rehearsals for the biggest concert of their lives. Estádio Nacional de Brasília had become ENB de Abrams-Bouscholte, twice reconstructed in the last three decades to double the seating and update the technology, and now requiring a small army to run it.\nFortunately Captain Abrams (retired) knew a bit about armies and logistics, which was why Euclid was not at technical rehearsal with his friends but on the other side of the city, waiting impatiently outside a large simulation room while Abrams took care of what he blithely called ‘the boring prep’.\nAfter ten minutes or so the door finally opened and Captain Abrams peeked around the edge, goggles pushed up over his eyebrows and onto his balding head. “We’re ready! Come in, Mr. Slinger. We think you’ll like what we’ve set up for you.” His voice hadn’t lost that boyish, excited bounce.\nStill holding his goggles, Euclid stepped into the room and nodded a distracted greeting to the small group of technicians. His gaze was quickly caught by an alloy-plated soprano pan set up at the end of the room.\n“Mr. Djansi says you were a decent pannist,” Captain Abrams said, still brightly enthusiastic.\n“Was?”\nCaptain Abrams smiled. “Think you can handle this one?”\n“I can manage,” Euclid answered, reaching for the sticks.\n“Goggles first,” the captain reminded him, closing the door to the room.\nEuclid put them on, picked up the sticks and raised his head to take in his audience. He froze and dropped the sticks with a clang.\n“Go on, Mr. Slinger. I think you’ll enjoy this,” Abrams said. “I think we all will.”\nOn the night of the concert, Euclid stood on the massive stage with his entire body buzzing with terror. The audience packed into stadium tiers all around him was a faceless mass that rose up several stories, but they were his family and he knew them like he knew his own heart. The seats were filled with Rock Devils, Gladhandlers, Sunsiders and more, all of them from the cohorts, workers representing every section of the Ring and every year and stage of its development. Many of them had come down from Earth orbit and their work on the decaying habitats to see the show.\nEuclid started to sing for them, but they sang for him first, calling out every lyric so powerful and sure that all he could do was fall silent and raise his hands to them in homage and embrace. He shook his head in wonder as tears gathered in his eyes.\nKumi, Vega, Dhaka and Jeni kept jamming, transported by the energy, playing the best set of their careers, giving him a nod or a sweet smile in the midst of their collective trance as he stood silently crying and listening to the people sing.\nThen it was time.\nEuclid walked slowly, almost reverently, to the soprano pan at the center of the stage. Picked up the sticks, just as he had in the simulation room. Looked up at his audience. This time he did not freeze. He played a simple arpeggio, and the audience responded: lighting a wedge of stadium seating, a key for each note of the chord, hammered to life when he hammered the pan. He lengthened the phrase and added a trill. The cohorts followed him flawlessly, perfected in teamwork and technology. A roar came from overhead as the hovering skyboxes cheered on the Mighty Slinger playing the entire stadium like it was his own personal keyboard.\nEuclid laughed loud. “Ain’t seen nothing yet!”\nHe swept his arm out to the night sky, made it a good, slow arc so he was sure they were paying attention. Then the other arm. Showmanship. Raise the sticks with drama. Flourish them like a conductor. Are you ready? Are you ready!?\nPlay it again. This time the sky joined them. The arc of the Ring blazed section by section in sync with each note, and in step with each cadence. The Mighty Slinger and his cohorts, playing the largest instrument in the galaxy.\nEuclid grinned as the skyboxes went wild. The main audience was far quieter, waiting, watching for one final command.\nHe raised his arms again, stretched them out in victory, dropped the sticks on the thump of the Rovers’ last chord, and closed his eyes.\nHis vision went red. He was already sweating with adrenaline and humid heat, but for a moment he felt a stronger burn, the kiss of a sun where no sun could be. He slowly opened his eyes and there it was, as Abrams had promised. The real last section of the Ring, smuggled into Earth’s orbit during the interior transits permitted by Venus, now set up in the mother planet’s orbit with magnifiers and intensifiers and God knows what else, all shining down like full noon on nighttime Brasilia.\nThe skyboxes no longer cheered. There were screams, there was silence. Euclid knew why. If they hadn’t figured it out for themselves, their earpieces and comms were alerting them now. Abrams-Bouscholte, just hours ago, had became the largest shareholder in the Ring through a generation-long program of buying out rights and bonds from governments bankrupted by war. It was a careful, slow-burning plan that only a cohort could shepherd through to the end.\nThe cohorts had always been in charge of the Ring’s day-to-day operations, but the concert had demonstrated beyond question that only one crew truly ran the Ring.\nThe Ring section in Earth orbit, with its power of shade and sun, could be a tool for geoengineering to stabilize Earth’s climate to a more clement range . . . or a solar weapon capable of running off any developers. Either way, the entire Ring was under the control of the cohorts, and so was Earth.\nThe stadium audience roared at last, task accomplished, joy unleashed. Dhaka, Jeni, Kumi and Vega left their instruments and gathered around Euclid in a huddle of hugs and tears, like soldiers on the last day of a long war.\nEuclid held onto his friends and exhaled slowly. “Look like massa day done.”\nEuclid sat peacefully, a mug of bush tea in his hands, gazing at the cold metal walls of the long-sleep hospice. Although the technology had steadily improved, delayed reawakenings still had cost and consequences. But it had been worth the risk. He had lived to see the work of generations, the achievements of one thousand years.\n“Good morning, Baba.” One of Zippy’s great great grandchildren approached, his dashiki flashing a three-dimensional-pattern with brown and green images of some offworld swamp. This Baptiste, the head of his own cohort, was continuing the tradition of having at least one descendant of the Rovers in attendance at Euclid’s awakening. “Are you ready now, Baba? The shuttle is waiting for you.”\n“I am ready,” Euclid said, setting down his mug, anticipation rising. Every hundred years he emerged from the long-sleep pool. Are you sure you want this? Kumi had asked. You’ll be all alone. The rest of the band wanted to stay and build on Earth. Curiosity had drawn him to another path, fate had confirmed him as legend and griot to the peoples and Assemblies of the post-Ring era. Work hard. Do well. Baba will be awake in a few more years. Make him proud.\nThey had done well, so well that this would be his last awakening. The Caribbean awaited him, restored and resettled. He was finally going home to live out the rest of his life.\nBaptiste opened the double doors. Euclid paused, breathed deeply, and walked outside onto the large deck. The hospice was perched on the edge of a hill. Euclid went to the railing to survey thousands of miles of the Sahara.\nBright-feathered birds filled the air with cheerful song. The wind brought a cool kiss to his cheek, promising rain later in the day. Dawn filtered slowly over what had once been desert, tinting the lush green hills with an aura of dusty gold as far as the eye could see.\nCome, Baba. Let’s go home.\nOriginally published in Bridging Infinity, edited by Jonathan Strahan.\nBarbadian author, editor and research consultant Karen Lord is known for her debut novel Redemption in Indigo, which won the 2008 Frank Collymore Literary Award, the 2010 Carl Brandon Parallax Award, the 2011 William L. Crawford Award, the 2011 Mythopoeic Fantasy Award for Adult Literature and the 2012 Kitschies Golden Tentacle (Best Debut), and was longlisted for the 2011 Bocas Prize for Caribbean Literature and nominated for the 2011 World Fantasy Award for Best Novel. Her second novel The Best of All Possible Worlds won the 2009 Frank Collymore Literary Award, the 2013 RT Book Reviews Reviewers' Choice Awards for Best Science Fiction Novel, and was a finalist for the 2014 Locus Awards. Its sequel, The Galaxy Game, was published in January 2015. She is the editor of the 2016 anthology New Worlds, Old Ways: Speculative Tales from the Caribbean.\nCalled \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.\nHis Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"\nHe currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "source": "https://clarkesworldmagazine.com/lord-buckell_09_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Mighty Slinger by Karen Lord and Tobias S. Buckell"}