{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Beth Goder", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "cdusQW/BbIrrHrWdbWVTecne+BU=", "id": null, "license": null, "comments": "", "raw_text": "2970 words, short story  Candide; Life-  Seva is waiting for Jal in the eggnog eatery where they had their first date. A moving rainbow of eggnog mini-cups streams past on a conveyor belt. She grabs a birthday cake nog, removing the cup from underneath the safety dome. The aroma triggers an access request in her microenvironment, which she grants. The smell of sugar, milk, and chocolate engulfs her. Even though she had cake for breakfast (leftovers from her nineteenth birthday party), she wants more. It’s her policy that you can never have too much cake.  Seva sets her microenvironment to play the Overture to Candide on loop. The intensity of the first few measures is a roar that lifts her entire body. She conducts compulsively, her arm twitching in time to the music; she doesn’t care who sees her. When the main theme comes in, that soaring melody that runs up against the frenetic pace of the whole but is never swallowed, her heart feels like it is transcending her chest. This is music!  The third time through, she makes an emotion capture.  ::Candide; joy-  The capture isn’t professional quality, not artwork or anything of value, but she’s still happy she made it. It doesn’t have to be good. Her use to society is in creating music, not emotion captures. That’s how she claimed a spot at university. Musicians, her mother says, will always be needed, because digital mechanisms can’t reproduce music with the correct level of emotion. Her goal is to become a symphonic percussionist in a city with a population of at least seventy thousand.  She reviews ::Candide; joy-. Clearly, it needs work. The capture contains her soaring emotions, and the Overture itself could never disappoint, but the sound of the eggnog conveyor belt is perceptible, and she neglected to imagine a visual. The eye view is simply the default blue.  I should just garbage it, she thinks. Send it to delete ops who will take it off her implants and her backup storage and hunt it down from any digi-worms that have already grabbed it, and maybe even pull it out of her perma-memory file if the rumors are true. But ::Candide; joy- contains this one pure moment, so for reasons she can’t explain, she tucks it up into her nova-storage.  She swipes a spicy shrimp eggnog, and then a multicolored nog with the disconcerting title “best seeds.” Forty minutes and five nogs later, Seva wonders if Jal is ghosting her, but as she’s tossing her last cup into the dilator, Jal runs in.  “I’ve got to show you something,” he says, without preamble or apology for being late. His hair sticks up like a wave, and his implants are set to make the tips glow. A fitted shirt hangs over precisely ripped jeans. He wears a ring on every finger, and two on each thumb. Real rings, not digitally imaged.  Seva wishes she had downloaded a new bracelet mod. He already saw the floating triangles when they jumped into the neon pond by Calooki Woods on their second date, but it’s too late to change now.  He grabs her hand, which feels a little like listening to the first measures of the Overture to Candide. She pushes down her breath. “You’re late.”  He asks if it’s cool if they go back to his workshop, because he wants to show her his newest sculpture. He’s been working on it for months, and she’ll be the first one to see it in its completed form. Her bracelet triangles shimmer all the way up her arm, responding to her spike of adrenaline. She digitally slams off the emotion mod, but not quickly enough. It’s so obvious that her heart is pounding.  She triggers her auto-pay to settle her bill before they both dash out to the street.  They wind their way through downtown. Her microenvironment automatically blocks the smog. The city is like a chaotic percussion section, all crashes and footsteps and the staccato notes of voices, but she never mutes ambient sound. The city makes its own sort of music.  An art reveal is something special, even better than the night sky simulator they did for their third date, which was super romantic. She’s only known him for three months, but maybe they have the potential to create something of value, like a relationship contract or a joint artistic project.  They hop into a transport pod. His hand is still clutching hers. She puts her head against his shoulder, and he slips his arm around her, bringing her into the intensity of his warmth.  Jal’s workshop is jammed into one of the university’s buildings, partitioned to the exact millimeter. Tools line the walls in neat rows. A scraggly broom rests in the corner. An orange couch is smooshed against the wall.  The center of the room is hidden by a privi-screen, the molecules jumping around so it’s impossible to see whatever lies behind.  Jal picks up the broom, even though the floor is spotless. He sweeps imaginary dust, then sweeps again.  “Okay,” he says, with an indrawn breath, pushing the broom back into the corner.  The privi-screen dissipates.  What lies behind it is a sculpture of a feminine arm. The limestone has been carved with precision. The hand stretches out, the fingers slightly curved—a beautiful portrayal of motion, made with skill and patience.  There is something that bothers her about this disembodied arm. Why has he chosen a female body part as the medium of his artistic expression? And, what’s more, this arm is disconcertingly familiar, with its bent elbow. Seva looks down at her own arm. She bends her elbow. Is the sculpture based on her body? But how can she tell? An arm is an arm. It’s not, on its own, a particularly distinctive limb.  Jal bounces on his toes, eager for her response. The need for approval is like a physical presence in the room, even though he tries to hide behind a nonchalant expression.  “It’s amazing,” she says, pushing aside her thoughts about gender and power and the choices of artists.  “That’s not everything.” He guides her closer, one hand on her back. She reaches out to touch the arm, which is so similar to her own. An access request pings. She gasps.  He’s embedded an emotion capture within the sculpture. Gingerly, she allows the emotion capture to take over her senses. She expected something like ::Generic; happy- or ::Generic; strong emotional discovery-, but what she experiences is more. He’s created his own emotion capture, built it himself, and embedded it into the sculpture. The experience is three quick breaths, aching sorrow, the hand reaching out to you, the hand that will never reach you. There is a lingering ghostly quality, which is enhanced by the visual of the sculpture.  Although she can appreciate Jal’s effort, she can see the roughness of the piece. The transitions are shaky. The emotional resonance loses its force after the third second. It’s okay, but not a masterpiece. Jal’s no Salavonic, but who could rival ::Singular raindrop falls on back of wet bird- or ::Violinist collapses onstage-?  Seva comes back to herself, the residuals of the capture drifting away, until there is only Jal by her side, and the sculpture in front of her.  “I didn’t know you were specializing in multimedia,” she says.  He seems dissatisfied by her response. “I’m not. But the university allows for experimentation.” He looks back at the sculpture, then at her, vulnerability twisting in his face, the beginnings of a fragile anger.  Quickly, she praises the piece, commenting on the merging of the physical sculpture and digital emotion, which she really did think was well done. Some critics would argue that reliance on multimedia diminishes the power of an emotion capture as an art form, but Seva thinks there is potential in these combinations. Creativity, she knows, often comes from the merging of two disparate things.  After his desire for praise is sated, Jal has a lot to say about emotion captures. They spend the next hour debating the benefits of sensory deprivation as a technique for emotional enhancement and geeking out about the work of Salavonic. It’s the sort of conversation without pauses. They both have so much to say.  “I made something, too,” Seva says, caught up in the enthusiasm of their conversation. “Not art,” she adds quickly. “Just something I felt today.” She pulls up ::Candide; joy-, debating whether she should share access.  “You make emotion captures, too?” Somehow, the timbre of their conversation changes, the excitement leaking out. Jal’s voice is neutral, but she senses something behind it.  “Not art,” she says again. “Just for fun.” Maybe this was a bad idea. “Never mind.”  “I want to see it.”  She wants to explain that creating an emotion capture, for her, is like playing a string of sixty-fourth notes, which you can only do if you are concentrating very hard or not thinking about it at all. Instead, before she has time to lose her nerve, she sends him the access code to ::Candide; joy-.  His face, while he experiences the emotion capture, is animated with delight. This is a type of vulnerability, she realizes, this ability to see someone else having an emotional experience, even if the origin of those emotions come from without. She wonders what she looked like while viewing his sculpture, if her face twitched at the ghostly sadness of the hand reaching out.  When the emotion capture ends, Jal comes back to himself. Now the emotions flitting across his face are his own, and she can’t read them. He is silent for too long.  “It’s not art,” she says again. “It’s just how I feel. How music makes me feel.”  “You shouldn’t garbage it,” he says. “I mean, there’s some interesting stuff in there. It’s not a terrible beginner’s piece.”  The words are like a blow, but worse is the shame she feels at her reaction. He’s just saying what’s true, what she’s said to herself.  She forces herself to laugh. “The music is good, though.”  “Yeah, it’s a good recording.” Jal pauses. “Have you shown this to anyone else?”  “I just made it this afternoon. Really quickly.”  “I’m just saying this so you don’t get hurt. Maybe don’t let anyone else see it, okay?”  Suddenly, she wants him to see her doing what she’s good at, her real art. “You should come to my concert this week.” She pings him with tickets. “I have a xylophone solo.”  “It’s a difficult medium,” he says. What she hears is: we can’t all be artists.  It’s three weeks before she visits Jal’s work space again. It’s a quick stop on the way to the dance plaza, where they’re meeting some friends. In typical Jal fashion, he’s left one of his projects until the last minute, so he needs to crank out a sketch of a vase in twenty minutes.  While he’s working, Seva wanders the workshop. Her microenvironment keeps out the limestone dust. She avoids the arm sculpture, which still unsettles her, despite the beauty of those upturned fingers.  In the corner, there’s a hunk of limestone, half-sculpted. She can’t tell what it’s going to be. Maybe a flame or a rooster. Jal once told her that sculpting is about removing the stone that isn’t supposed to be there, bit by bit, until the true thing emerges. It’s the opposite of music, which is about filling the silence with the notes that are meant to exist. She muses on this dichotomy in art—subtraction and addition, removal and creation, the full and empty spaces.  She touches the flame/rooster thing, and it pings her with an access request. Jal never locks anything in his workshop. With a start, she realizes he is creating another multimedia project. She shouldn’t look in on this half-created thing, but she’s curious.  The emotion capture that engulfs her seems to be a meditation on art, the path of the artist. The male figure, a sculptor, emerges in heroic form. Seva bites back a laugh. It’s clearly meant to be Jal. His story is outlined in quick snatches of feeling—the struggle of the artist, the intensity of his craft, the complexity of his art. Is this really how he sees himself? The budding genius?  When the first notes of Overture to Candide play, all the laughter drains from Seva’s body. The soaring emotion she feels is her own, distorted, thrown back at her. He’s taken ::Candide; joy- and incorporated it into his emotion capture. Stolen it. Twisted it. Claimed it as his own. The male artist bows, full of glory, lifted up by the emotion of ::Candide; joy-.  She slams off the access point.  Jal is hunched over a stencil. His implants are projecting patterns onto the physical paper. The vase is coming along nicely.  “What is that?” says Seva. The rage in her voice causes him to jump.  “A vase?” he says, then sees she is pointing at the half-finished sculpture. With a wave of his hand, the stencils disappear. He’s taken off his rings to draw, and his hands look strangely vulnerable without them. “It’s not finished yet. I’m still tinkering.” He doesn’t even realize why she’s angry.  “When I shared my emotion capture with you, that was just for you. Not for you to cannibalize into some narrative about yourself.” She hadn’t even known he was making a copy. This betrayal congeals in the pit of her stomach.  “Everything that happens to me fuels my art.” He strikes the same heroic pose as the male figure in the emotion capture, ready to take on the role of the persecuted artist. Has he practiced this pose in the mirror?  “You took what I made. It’s not your art.” The moment crystallizes in front of her. What she says next is as much for herself as it is for him. “It’s mine.”  He snorts. “Do I have to give the stone credit, too?”  For the first time, she looks at him objectively—his stylized hair, the precisely ripped jeans, the commitment to living as if everyone should acknowledge him as a great artist. She chisels away at her image of him, until the truth emerges.  When she first showed him ::Candide; joy-, he was, she realizes now, angry. It’s not that her emotion capture was especially good. It’s that she dared to make it. She feels there is a part of Jal that wants her to crumple and shrink, like the stone he shapes.  She could take one of his precisely arranged tools and hammer the flame/rooster statue until it turns to dust. She could ask him to destroy the stolen emotion capture, but she knows that Jal will never be able to use it properly, and he’ll never be able to reproduce anything like it.  Instead, she says, “Do you think you’ll ever make anything of worth?”  This question, so invasive and piercing, causes him to flinch. It is the question all artists ask themselves in dark, quiet moments. At its core, unanswerable.  His mouth opens and shuts as he tries to gather himself enough to answer.  Seva instructs her microenvironment to block out his form, his voice. Suddenly, it is as if she is alone in the workshop. Whatever answer he gives is erased. One by one, she scrubs out his sculptures from her view.  Without another word, she leaves.  Seva spends two angry hours in the eggnog place, blocking out all outside noise from her microenvironment. She plays a game called “No More Cows,” which requires her to roll a giant ball of milk droplets, picking up random items to make the ball bigger. The loss condition is picking up a cow. When she accidently falls into a pit of cows on the fifth level, she rage-quits the game.  Instead of starting another game, she pulls up Salavonic’s ::Singular raindrop falls on back of wet bird-  A bird, huddled under fir needles, alive in heartbeats. The beat of rain. In the moment before flight, one raindrop touches the bird, working softly into her feathers. That moment before flight, this small life, so full of wonder, so close to death.  The practice room is quiet. With xylophone mallets in hand, Seva plays a recording of Overture to Candide. As she listens, she makes an emotion capture, the flow of the music interspersed with the movement of her life. When the xylophone part comes, her intense focus is matched only by the precision of her notes. She plays, swept up by the music. The moments of her life bleed into the work, creating an experience that is full of her memories and thoughts and feelings.  After, as she plays back the emotion capture, she realizes Jal is absent from her story. Excised, as if he never existed.  She doesn’t know what to name this multimedia thing she’s made, this emotion capture paired with music, so she finds a digital program to scan for a possible title. What comes back is this:  ::Is our only worth in what we make?-  This is a question she’s thought about for a long time, but it’s not something she can answer. The program must have picked up on her thoughts.  She rejects the title. Instead, she makes her own:  ::Candide; life-  She likes the simplicity of this title. The Overture to Candide itself is buzzing with life, but it’s her life too that’s interwoven into the piece, her thoughts and feelings, her perseverance, her doubts.  Exhausted, she pulls the xylophone cover over the instrument and places the mallets in her stick bag. Before she closes the emotion capture, she saves the file with her name. She hesitates, then, before she can lose her nerve, she uploads ::Candide; life-, sending what she’s made out into the world.", "text": "2970 words, short story\nCandide; Life-\nSeva is waiting for Jal in the eggnog eatery where they had their first date. A moving rainbow of eggnog mini-cups streams past on a conveyor belt. She grabs a birthday cake nog, removing the cup from underneath the safety dome. The aroma triggers an access request in her microenvironment, which she grants. The smell of sugar, milk, and chocolate engulfs her. Even though she had cake for breakfast (leftovers from her nineteenth birthday party), she wants more. It’s her policy that you can never have too much cake.\nSeva sets her microenvironment to play the Overture to Candide on loop. The intensity of the first few measures is a roar that lifts her entire body. She conducts compulsively, her arm twitching in time to the music; she doesn’t care who sees her. When the main theme comes in, that soaring melody that runs up against the frenetic pace of the whole but is never swallowed, her heart feels like it is transcending her chest. This is music!\nThe third time through, she makes an emotion capture.\n::Candide; joy-\nThe capture isn’t professional quality, not artwork or anything of value, but she’s still happy she made it. It doesn’t have to be good. Her use to society is in creating music, not emotion captures. That’s how she claimed a spot at university. Musicians, her mother says, will always be needed, because digital mechanisms can’t reproduce music with the correct level of emotion. Her goal is to become a symphonic percussionist in a city with a population of at least seventy thousand.\nShe reviews ::Candide; joy-. Clearly, it needs work. The capture contains her soaring emotions, and the Overture itself could never disappoint, but the sound of the eggnog conveyor belt is perceptible, and she neglected to imagine a visual. The eye view is simply the default blue.\nI should just garbage it, she thinks. Send it to delete ops who will take it off her implants and her backup storage and hunt it down from any digi-worms that have already grabbed it, and maybe even pull it out of her perma-memory file if the rumors are true. But ::Candide; joy- contains this one pure moment, so for reasons she can’t explain, she tucks it up into her nova-storage.\nShe swipes a spicy shrimp eggnog, and then a multicolored nog with the disconcerting title “best seeds.” Forty minutes and five nogs later, Seva wonders if Jal is ghosting her, but as she’s tossing her last cup into the dilator, Jal runs in.\n“I’ve got to show you something,” he says, without preamble or apology for being late. His hair sticks up like a wave, and his implants are set to make the tips glow. A fitted shirt hangs over precisely ripped jeans. He wears a ring on every finger, and two on each thumb. Real rings, not digitally imaged.\nSeva wishes she had downloaded a new bracelet mod. He already saw the floating triangles when they jumped into the neon pond by Calooki Woods on their second date, but it’s too late to change now.\nHe grabs her hand, which feels a little like listening to the first measures of the Overture to Candide. She pushes down her breath. “You’re late.”\nHe asks if it’s cool if they go back to his workshop, because he wants to show her his newest sculpture. He’s been working on it for months, and she’ll be the first one to see it in its completed form. Her bracelet triangles shimmer all the way up her arm, responding to her spike of adrenaline. She digitally slams off the emotion mod, but not quickly enough. It’s so obvious that her heart is pounding.\nShe triggers her auto-pay to settle her bill before they both dash out to the street.\nThey wind their way through downtown. Her microenvironment automatically blocks the smog. The city is like a chaotic percussion section, all crashes and footsteps and the staccato notes of voices, but she never mutes ambient sound. The city makes its own sort of music.\nAn art reveal is something special, even better than the night sky simulator they did for their third date, which was super romantic. She’s only known him for three months, but maybe they have the potential to create something of value, like a relationship contract or a joint artistic project.\nThey hop into a transport pod. His hand is still clutching hers. She puts her head against his shoulder, and he slips his arm around her, bringing her into the intensity of his warmth.\nJal’s workshop is jammed into one of the university’s buildings, partitioned to the exact millimeter. Tools line the walls in neat rows. A scraggly broom rests in the corner. An orange couch is smooshed against the wall.\nThe center of the room is hidden by a privi-screen, the molecules jumping around so it’s impossible to see whatever lies behind.\nJal picks up the broom, even though the floor is spotless. He sweeps imaginary dust, then sweeps again.\n“Okay,” he says, with an indrawn breath, pushing the broom back into the corner.\nThe privi-screen dissipates.\nWhat lies behind it is a sculpture of a feminine arm. The limestone has been carved with precision. The hand stretches out, the fingers slightly curved—a beautiful portrayal of motion, made with skill and patience.\nThere is something that bothers her about this disembodied arm. Why has he chosen a female body part as the medium of his artistic expression? And, what’s more, this arm is disconcertingly familiar, with its bent elbow. Seva looks down at her own arm. She bends her elbow. Is the sculpture based on her body? But how can she tell? An arm is an arm. It’s not, on its own, a particularly distinctive limb.\nJal bounces on his toes, eager for her response. The need for approval is like a physical presence in the room, even though he tries to hide behind a nonchalant expression.\n“It’s amazing,” she says, pushing aside her thoughts about gender and power and the choices of artists.\n“That’s not everything.” He guides her closer, one hand on her back. She reaches out to touch the arm, which is so similar to her own. An access request pings. She gasps.\nHe’s embedded an emotion capture within the sculpture. Gingerly, she allows the emotion capture to take over her senses. She expected something like ::Generic; happy- or ::Generic; strong emotional discovery-, but what she experiences is more. He’s created his own emotion capture, built it himself, and embedded it into the sculpture. The experience is three quick breaths, aching sorrow, the hand reaching out to you, the hand that will never reach you. There is a lingering ghostly quality, which is enhanced by the visual of the sculpture.\nAlthough she can appreciate Jal’s effort, she can see the roughness of the piece. The transitions are shaky. The emotional resonance loses its force after the third second. It’s okay, but not a masterpiece. Jal’s no Salavonic, but who could rival ::Singular raindrop falls on back of wet bird- or ::Violinist collapses onstage-?\nSeva comes back to herself, the residuals of the capture drifting away, until there is only Jal by her side, and the sculpture in front of her.\n“I didn’t know you were specializing in multimedia,” she says.\nHe seems dissatisfied by her response. “I’m not. But the university allows for experimentation.” He looks back at the sculpture, then at her, vulnerability twisting in his face, the beginnings of a fragile anger.\nQuickly, she praises the piece, commenting on the merging of the physical sculpture and digital emotion, which she really did think was well done. Some critics would argue that reliance on multimedia diminishes the power of an emotion capture as an art form, but Seva thinks there is potential in these combinations. Creativity, she knows, often comes from the merging of two disparate things.\nAfter his desire for praise is sated, Jal has a lot to say about emotion captures. They spend the next hour debating the benefits of sensory deprivation as a technique for emotional enhancement and geeking out about the work of Salavonic. It’s the sort of conversation without pauses. They both have so much to say.\n“I made something, too,” Seva says, caught up in the enthusiasm of their conversation. “Not art,” she adds quickly. “Just something I felt today.” She pulls up ::Candide; joy-, debating whether she should share access.\n“You make emotion captures, too?” Somehow, the timbre of their conversation changes, the excitement leaking out. Jal’s voice is neutral, but she senses something behind it.\n“Not art,” she says again. “Just for fun.” Maybe this was a bad idea. “Never mind.”\n“I want to see it.”\nShe wants to explain that creating an emotion capture, for her, is like playing a string of sixty-fourth notes, which you can only do if you are concentrating very hard or not thinking about it at all. Instead, before she has time to lose her nerve, she sends him the access code to ::Candide; joy-.\nHis face, while he experiences the emotion capture, is animated with delight. This is a type of vulnerability, she realizes, this ability to see someone else having an emotional experience, even if the origin of those emotions come from without. She wonders what she looked like while viewing his sculpture, if her face twitched at the ghostly sadness of the hand reaching out.\nWhen the emotion capture ends, Jal comes back to himself. Now the emotions flitting across his face are his own, and she can’t read them. He is silent for too long.\n“It’s not art,” she says again. “It’s just how I feel. How music makes me feel.”\n“You shouldn’t garbage it,” he says. “I mean, there’s some interesting stuff in there. It’s not a terrible beginner’s piece.”\nThe words are like a blow, but worse is the shame she feels at her reaction. He’s just saying what’s true, what she’s said to herself.\nShe forces herself to laugh. “The music is good, though.”\n“Yeah, it’s a good recording.” Jal pauses. “Have you shown this to anyone else?”\n“I just made it this afternoon. Really quickly.”\n“I’m just saying this so you don’t get hurt. Maybe don’t let anyone else see it, okay?”\nSuddenly, she wants him to see her doing what she’s good at, her real art. “You should come to my concert this week.” She pings him with tickets. “I have a xylophone solo.”\n“It’s a difficult medium,” he says. What she hears is: we can’t all be artists.\nIt’s three weeks before she visits Jal’s work space again. It’s a quick stop on the way to the dance plaza, where they’re meeting some friends. In typical Jal fashion, he’s left one of his projects until the last minute, so he needs to crank out a sketch of a vase in twenty minutes.\nWhile he’s working, Seva wanders the workshop. Her microenvironment keeps out the limestone dust. She avoids the arm sculpture, which still unsettles her, despite the beauty of those upturned fingers.\nIn the corner, there’s a hunk of limestone, half-sculpted. She can’t tell what it’s going to be. Maybe a flame or a rooster. Jal once told her that sculpting is about removing the stone that isn’t supposed to be there, bit by bit, until the true thing emerges. It’s the opposite of music, which is about filling the silence with the notes that are meant to exist. She muses on this dichotomy in art—subtraction and addition, removal and creation, the full and empty spaces.\nShe touches the flame/rooster thing, and it pings her with an access request. Jal never locks anything in his workshop. With a start, she realizes he is creating another multimedia project. She shouldn’t look in on this half-created thing, but she’s curious.\nThe emotion capture that engulfs her seems to be a meditation on art, the path of the artist. The male figure, a sculptor, emerges in heroic form. Seva bites back a laugh. It’s clearly meant to be Jal. His story is outlined in quick snatches of feeling—the struggle of the artist, the intensity of his craft, the complexity of his art. Is this really how he sees himself? The budding genius?\nWhen the first notes of Overture to Candide play, all the laughter drains from Seva’s body. The soaring emotion she feels is her own, distorted, thrown back at her. He’s taken ::Candide; joy- and incorporated it into his emotion capture. Stolen it. Twisted it. Claimed it as his own. The male artist bows, full of glory, lifted up by the emotion of ::Candide; joy-.\nShe slams off the access point.\nJal is hunched over a stencil. His implants are projecting patterns onto the physical paper. The vase is coming along nicely.\n“What is that?” says Seva. The rage in her voice causes him to jump.\n“A vase?” he says, then sees she is pointing at the half-finished sculpture. With a wave of his hand, the stencils disappear. He’s taken off his rings to draw, and his hands look strangely vulnerable without them. “It’s not finished yet. I’m still tinkering.” He doesn’t even realize why she’s angry.\n“When I shared my emotion capture with you, that was just for you. Not for you to cannibalize into some narrative about yourself.” She hadn’t even known he was making a copy. This betrayal congeals in the pit of her stomach.\n“Everything that happens to me fuels my art.” He strikes the same heroic pose as the male figure in the emotion capture, ready to take on the role of the persecuted artist. Has he practiced this pose in the mirror?\n“You took what I made. It’s not your art.” The moment crystallizes in front of her. What she says next is as much for herself as it is for him. “It’s mine.”\nHe snorts. “Do I have to give the stone credit, too?”\nFor the first time, she looks at him objectively—his stylized hair, the precisely ripped jeans, the commitment to living as if everyone should acknowledge him as a great artist. She chisels away at her image of him, until the truth emerges.\nWhen she first showed him ::Candide; joy-, he was, she realizes now, angry. It’s not that her emotion capture was especially good. It’s that she dared to make it. She feels there is a part of Jal that wants her to crumple and shrink, like the stone he shapes.\nShe could take one of his precisely arranged tools and hammer the flame/rooster statue until it turns to dust. She could ask him to destroy the stolen emotion capture, but she knows that Jal will never be able to use it properly, and he’ll never be able to reproduce anything like it.\nInstead, she says, “Do you think you’ll ever make anything of worth?”\nThis question, so invasive and piercing, causes him to flinch. It is the question all artists ask themselves in dark, quiet moments. At its core, unanswerable.\nHis mouth opens and shuts as he tries to gather himself enough to answer.\nSeva instructs her microenvironment to block out his form, his voice. Suddenly, it is as if she is alone in the workshop. Whatever answer he gives is erased. One by one, she scrubs out his sculptures from her view.\nWithout another word, she leaves.\nSeva spends two angry hours in the eggnog place, blocking out all outside noise from her microenvironment. She plays a game called “No More Cows,” which requires her to roll a giant ball of milk droplets, picking up random items to make the ball bigger. The loss condition is picking up a cow. When she accidently falls into a pit of cows on the fifth level, she rage-quits the game.\nInstead of starting another game, she pulls up Salavonic’s ::Singular raindrop falls on back of wet bird-\nA bird, huddled under fir needles, alive in heartbeats. The beat of rain. In the moment before flight, one raindrop touches the bird, working softly into her feathers. That moment before flight, this small life, so full of wonder, so close to death.\nThe practice room is quiet. With xylophone mallets in hand, Seva plays a recording of Overture to Candide. As she listens, she makes an emotion capture, the flow of the music interspersed with the movement of her life. When the xylophone part comes, her intense focus is matched only by the precision of her notes. She plays, swept up by the music. The moments of her life bleed into the work, creating an experience that is full of her memories and thoughts and feelings.\nAfter, as she plays back the emotion capture, she realizes Jal is absent from her story. Excised, as if he never existed.\nShe doesn’t know what to name this multimedia thing she’s made, this emotion capture paired with music, so she finds a digital program to scan for a possible title. What comes back is this:\n::Is our only worth in what we make?-\nThis is a question she’s thought about for a long time, but it’s not something she can answer. The program must have picked up on her thoughts.\nShe rejects the title. Instead, she makes her own:\n::Candide; life-\nShe likes the simplicity of this title. The Overture to Candide itself is buzzing with life, but it’s her life too that’s interwoven into the piece, her thoughts and feelings, her perseverance, her doubts.\nExhausted, she pulls the xylophone cover over the instrument and places the mallets in her stick bag. Before she closes the emotion capture, she saves the file with her name. She hesitates, then, before she can lose her nerve, she uploads ::Candide; life-, sending what she’s made out into the world.", "source": "https://clarkesworldmagazine.com/goder_08_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Candide; Life- by Beth Goder"}