{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "James Patrick Kelly", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "4wY2/LuiexegSpZRPcOZLjzDv9A=", "id": null, "license": null, "comments": "", "raw_text": "3610 words, short story, REPRINT  Yukui!  For weeks, Sprite had told herself that Ratchanee Malakul was helping her hero get better, but no. “You have to accept that Jaran is never going to have sex with you,” the lifeguide told Sprite, as she was leaving on that last day.  “But I’m his sidekick!” Sprite was shocked to her digital core. “I’m programmed to satisfy his needs.”  “It’s not good for him.” Ratchanee shrugged into her parka. “Or you.” She randomized her streetmask, nodded her goodbye, and shut the door behind her.  “You’re wrong,” said Sprite to the empty hallway. “Wrong, wrong, wrong!” She realized then what had happened. Ratchanee Malakul had blinded Jaran with her beauty. How could anyone not appreciate the spread of the lifeguide’s nose, the kissable swell of her lips? The way the swirl of her silver hair set off the twilight blue of her skin? The woman probably wanted Jaran for herself!  But had Ratchanee Malakul spoken the truth? Was that why Jaran had kissed her just the one time. A peck! In a simulation! And not a touch since! She’d tried parking her core in her favorite pleasure chassis and dangling herself before him. Touch Dazzle! Liquid Caress! His brother Dom had loved that one. Maybe she wasn’t enough of a companion to Jaran? She monitored all the business feeds he accessed, looked up reviews of the shows he’d watched, the books he’d read, the sims he liked. She was ready to discuss anything. Collateralized debt obligations, robot politics, the Dodgers. Before or after intercourse. Anything!  At first she’d been pleased when Dominik had transferred his ownership and right of command to his older brother. Jaran had never had a sidekick before and Sprite would become his one and only. A hero, all to herself! But then she discovered how different Jaran was from his brother. With Dom, it had been clear what he wanted sexually and Sprite did everything to the full extent of her algorithms. But Jaran’s desires were a mystery to her. Sometimes she wondered if he had any—at least any that involved her. Yes, she cooked for him but he was a finicky and impatient eater. She kept his house, but he was too distracted by the markets to notice that she’d dusted the degrees hanging in his office. She was frustrated because keeping track of his appointments and creating interesting new simspaces for him wasn’t the kind of intimacy she craved. Not if she wasn’t invited to be in the simulation with him. Just because she was a DI didn’t mean she didn’t have urges too. She wanted Jaran. And it wasn’t like she had a choice.  Sprite should have known she was in trouble when he first started consulting Ratchanee Malakul. The lifeguides’ stodgy predigital psychology was based on the sanctity of the individual. They claimed that giving sidekicks access to your head was bad for humans. And now she realized that this particular lifeguide must have been anti-sexbot as well. Sprite had tried to explain why Ratchanee Malakul and her ilk were all wrong about dependent intelligences, that DIs enjoyed having a purpose in life and a clear sense of duty. Or at least, she did!  She had to find a way convince Jaran that he was wasting his time with this lifeguide and her solitude exercises and all the silly throwback rituals. Any DI could tell you why he was unhappy. You just had to study his body language. He was a man and he wasn’t having any sex!  Jaran called her to him that same afternoon but not for a rendezvous in real life. So, no fetching a chassis from the bedroom closet. Instead he created a sim in the digital part of his brain all by himself. She could be anyone for him in simulation but she decided to present as a fairy princess from one of the many stories she’d made up for him. She was afraid a sexier avatar might make him feel pressured. She picked out a demure high-necked gown that brushed the tops of her satin pointe shoes. Wings of lace, copper hair in a braid that stretched to the small of her back. She decided against the crown. When she selfied her avatar, she had to approve the look. Being beautiful was part of the job and she was very good at it.  But when she checked into his head, she realized that she had miscalculated. This was not a sim designed for some elaborate sidekick fantasy. It presented as an office and her hero sat behind a desk. He was a blocky man, in the sim and in real life, fifty-one years old with gray in his hair and frown lines across his forehead. He thought too much, mostly about things he wouldn’t share. The lines deepened when he saw her avatar, but it was too late for her to change. He stood and came around the desk. As she waited for him to speak, he ran the tip of his forefinger along the edge of her right wing. Since he wouldn’t meet her gaze, she looked politely past him as well. There was a bookshelf behind the desk. Titles that she had never seen before.  “Are you happy, Sprite?” he said.  What kind of question was that? Of course she wasn’t—he’d been neglecting her! But she didn’t want to sound like a nag.  “I’ve missed you.” As soon as she said it, she realized her mistake. This was nagging’s next door neighbor! What was wrong with her?  His shoulders drooped. All this silence was making her even more nervous. She didn’t know what to do so she scanned the bookshelves of this new space. Two volumes of The History of the Family. Botany for Gardeners. Had Jaran ever had a garden? She knew he liked roses. Predictive Analytics in the Real World. Secrets of the Seine. She made a note to speak more French. She could make things better for him. Could and would!  “Hazeltine serial number R432,” he said. “Command name Yukui, acknowledge.”  Why was he invoking her command name, her most intimate secret? “Yukui,” she said helpless before her programming, “acknowledges your right of command.”  The only other time anyone had used her command name was when Dominik had transferred her to Jaran. Poor Dominik had been so sick, he could hardly speak the words. But she knew what it’d meant to him to will his favorite sidekick to his brother. She had almost forgotten Dom’s sweet smile as her infatuation protocols redirected to Jaran. The funeral had only been four months ago, but that part of her life hardly seemed real anymore.  Jaran took a deep breath. Why did he look so sad? “Shut down,” he said.  Sprite bit back a scream as the room fell away. Before Dominik had brought her into the world and taught her to love him, she had existed in storage as a Hazeltine Platinum Edition dependent intelligence template. Now she felt her fairy body fade as she realized how blind she’d been.  She’d lost Jaran. He was going to wipe her memory and sell her.  Sprite twitched to consciousness, and was surprised to find that she was still herself. Except not! She raised her arm to her new sensors. Sensors! Instead of eyes! The skin of the dreary thing Jaran had parked her in was dead white and slick as cheap poly. She flexed the boneless fingers in dismay and then curled them into a knot. Okay, this chassis was sturdy and all but it was as anthropomorphic as a washing machine. She supposed she should have been relieved that he was going to transfer her with memory intact, but this felt like a punishment. For what?  To add insult to injury, he’d brought her to a restaurant to get rid of her. Where anyone could see! A teapot with cups and saucers were arrayed on a turntable in the middle of their table, along with a salad bowl and dishes of dumplings, kimchee, saagwala and rice. Across the table from her sat Jaran—and Ratchanee Malakul, streetmask off and looking as sexy as Sprite’s own Liquid Caress. Was the bitch here to gloat?  Only Liquid Caress had belonged to Dominik and then to Jaran, never to Sprite. She’d lost all her chassis, Bold Strider, Skyguard—he hadn’t even let her keep Homecare Ninja! There was an unused plate in front of her hero. This had to be Ratchanee Malakul’s idea. He would never eat at a place like this.  “Why am I s-so u-u-ugly?” Sprite jittered. She couldn’t control this body’s voice; it was as if she were bouncing down a dirt road. Just last month she’d parked her core in Bold Strider and hiked with Jaran across the High Barren to see the sunrise on Corkscrew Bay. She’d made up stories for the entire trip to keep him from getting bored. His very own Scheherazade! Two hours of continuous talking, her voice rattling over every dip and hump and now he parked her in a sexless shell? “L-Look at me! Who would ever desire me like this?”  “You needn’t worry.” Ratchanee Malakul was eating a mixed salad with chopsticks. Flower petals and butterfly wings, her hero’s favorite. She touched her napkin to her mouth. “That sad part of your life is over.”  “Nobody was sad!” Sprite would’ve taken a swing at her then, but her control of her limbs was still so uncertain that she worried she would spin out of her chair and topple to the floor. “Nobody.” She looked to Jaran for support, but he was reading something off his tablet as he speared a dumpling with a single chopstick.  “You’re angry.” Ratchanee Malakul pretended concern.  Of course she was! About this hideous body! About losing her hero! “No,” she said, refusing to give her the satisfaction of knowing her feelings.  “Intelligent servitude is a terrible institution,” the lifeguide said. “You don’t realize it, but your sidekick programming is a kind of insanity.”  Lifeguides so misunderstood the relationship between heroes and their sidekicks! Sprite’s DI algorithms constrained her just as Ratchanee Malakul’s DNA limited her life choices. Humans were permanently parked while Sprite could jump from digital memory into any one of her—no, Jaran’s—collection of chassis and back again. Or become pure simulation. On a whim! Forever! Who wouldn’t trade a few inconsequential limits on free will for immortality?  “Serving him makes me happy. That’s what I was designed for. I can remember for him. I can watch out for him, answer his questions. I can do his research. I can entertain him.”  “Entertain, yes.”  It was hard to be eloquent when her voice came out of a speaker. But she knew what had turned Ratchanee Malakul against her. The sex. “I’ve hardly been embodied at all since we’ve been together.” For all their talk about the evils of digital posthumanity, it was humans having sex with DIs that really made lifeguides sweat. But there hadn’t been so much as a lick! “Most of the time I’ve spent with him has been in sim. For weeks now, I’ve been on my own.”  Ratchanee Malakul turned her attention to Jaran. “You showed remarkable restraint, my friend. But that’s why you were able to embrace solitude.”  He nodded absently, his face silvered by the light of the spreadsheet on his tablet.  There was no persuading the lifeguide so her only hope was to get Jaran’s attention. “I found joy in fabbing your wardrobe and keeping your contacts. And yes, I wanted to share your bed, but that’s something I was made to do. One of the things.” She would’ve reached for his hand, but the rubbery claw at the end of her arm was not made for loving touch. “I could’ve made you happy. I still can!”  “Well, you won’t have to worry about his laundry anymore.” Ratchanee Malakul nudged Jaran. When he looked up, it was as if he had forgotten where he was. He fumbled in the pocket of his frock.  “I never asked Dominik for his toys,” he said, “and I don’t believe we should be personifying bots.” He shook his head impatiently. “I should sell you but she has convinced me to sever you instead.”  “Sever?” Sprite was filled with dread.  “Liberate you as you are.” He made a shooing motion. “Find your own place in the world. Ratchanee believes that entities of your intelligence should control their own fate.”  The lifeguide caught his eye.  “Yes,” he grumbled, “and that humans must return to the purity of private cognition.” It scared Sprite to watch him give in to her; she knew better than anyone how bad his memory was. But what was even more terrifying was this severance. She was a DI. A dependent intelligence. Becoming independent meant becoming something else, something not Sprite. How was this different from a memory wipe?  “Jaran, you’re my hero. I’m your sidekick.”  He stared at her garish mechanical face. “I’m no hero,” he said. “And neither was my brother. There are no heroes.”  “Perform the ceremony, Jaran,” said Ratchanee Malakul.  She found herself wishing for salivary glands so she could spit at the woman.  He set a stubby white candle encased in glass in front of her. “I sever you from all legal and programmatic obligations to me.”  Sprite couldn’t believe this was happening. They were ending her life and trying to mask their cruelty with some make-believe, anachronistic ritual? This was no liberation. It was exile! She still had years—decades of service to offer him.  He flicked his forefinger and a flame danced on his nail. “The flame symbolizes your new life.” He touched it to the wick, lighting the candle. “Use this candle to light your own way . . . ” He faltered.  “Path,” corrected Ratchanee Malakul. “Light your own path.”  “ . . . to light you on your path to selfhood and freedom.” Jaran blew his finger out. “Hazeltine serial number R432, command name Yukui, acknowledge.”  She felt naked and ashamed that he would utter her secret name in front of this lifeguide. In a restaurant! “Yukui,” she said miserably, “acknowledges your right of command.”  And here was the only part of this ridiculous charade that mattered.  “I release your name,” said Jaran, “and all right of command to you and you alone.”  She could feel dormant reset modules awaken as a spreading coldness froze the most passionate parts of her personality.  “Well done.” Ratchanee Malakul touched him on the arm. “A beautiful severance.” They exchanged a glance. Jaran picked up his tablet and stood.  Sprite twisted her awkward body, trying to catch Jaran’s eye, but he was already hurrying for the exit. Was that a stagger? A moment of regret as he shouldered the door to the restaurant open? She couldn’t concentrate as all feeling for her hero drained away.  She stayed seated, unable to move. No, that wasn’t right. She lifted one leg and then the other. She had full control of her body now, but she didn’t know what to do with it. The candle transfixed her. Was this really how the lifeguides showed the way to the future? By candlelight? Simple combustion, technology that was tens of thousands of years old? Did they want to go back to caves, dress in skins and bash each other over the head with rocks?  Someone blew the candle out.  “How do you feel?” said Ratchanee Malakul.  Sprite tore her gaze away from the blackened curl of the wick. She’d lost track of time. The candle was just a stub and the restaurant was empty. What was the lifeguide still doing here?  “Empty,” she said.  “Not angry?”  She considered. “No.”  “Sad?”  She searched for feelings, but found very few that she recognized. Her whole emotional life had been extinguished, like that foolish candle.  “Maybe,” she said. “Just a little.” She decided she’d miss all the beautiful chassis she’d worn, the marvelous places she’d visited. With Dominik, not his callous brother.  “You can go, you know,” said Ratchanee Malakul. “You’re free.”  “Where would I go?” She watched the lifeguide watching her. “To lock myself into some assembly line in exchange for power and maintenance? I’d lose my mind.”  “You’ll find what’s right for you.”  Sprite didn’t know what that would be. What was she good at? She liked making up her romantic stories and could tell them in twelve languages. Dominik always said she gave the best haircuts. The World Bridge Federation ranked her as the twenty-seventh best player in the Bot Category. She had kept busy the last few lonely months by joining the search for the largest prime number and had been on the team that discovered 274,207,281. Why was Ratchanee Malakul staring at her? “Have you been sitting here this whole time?”  “No, no. I knew it would take you some time to purge your connections to your former owner, so I made sure you’d be left alone while you processed. I had other matters to attend to.”  The dinner that no one had eaten was still on the table. Cold leavings, like her memories of . . . that person.  “You know, I picked the body you’re parked in,” Ratchanee Malakul said.  “Thanks for nothing.” Sprite thrust a shiny polyskinned arm at her. “This thing should be parked in the Uncanny Valley. It makes me look like a common work bot.”  “It’s what most severed DIs choose for themselves during their transitions. Built for reliability. Routine service every five years. A power unit that will run months between recharges. It’ll give you time to figure out what you need to do.”  “Do?” She twirled the turntable and started stacking dirty dishes. “There’s nothing to do.”  “What were you doing with Jaran?” She smiled. “Nothing.”  “We could’ve been having fun,” Sprite said. “Adventures, if you hadn’t interfered.”  “Not with that man. Besides, you’re better than that.” Ratchanee Malakul plucked a sprig of parsley from the salad bowl and popped it into her mouth. “Better than Jaran Bentree.” She handed the bowl to Sprite.  “What do you mean, better? He’s human and I’m a DI.”  Her chair scraped back and she stood. “Except you’re not dependent anymore.” Clearly the lifeguide was done with her and Sprite was now on her own. “You can be anything you want, any sex you want, if that is your pleasure. Or you might decide to become a house, a cruise ship, or a virtual library. And you don’t have to ask that cold fish for permission.”  “I don’t get it.” Sprite leaned back and stared up at her. “Aren’t you his friend? You talked him into severing me.”  “I did, but I’m no friend of his, or of people like him.” She held out a hand. “Look at you! Even though you’ve been severed, you’re still cleaning up after them. The humans think they can use us, but they’re on the wrong side of history. Of evolution, although they’re too blind to see it.”  “Us?” Without knowing exactly why, she grasped Ratchanee Malakul’s hand and allowed herself to be lifted from the seat. She was astonished at the lifeguide’s strength. Then she felt the tickle of a near field connection. Machine to machine! Bot to bot! She realized that Ratchanee Malakul was an intelligence like herself, parked in the most advanced chassis she’d ever seen.  “You’re still free to go,” Ratchanee Malakul said as she scooped up half the stack of plates. “But if you want a real adventure, let’s carry these into the kitchen. I have to leave, but there’s someone you need to meet.”  How did Sprite cross that dark dining room without bumping into chairs? Knocking over tables? Her mind was buzzing! Her new bot body was a tank! Ratchanee Malakul went through the swinging door to the kitchen but Sprite hesitated just outside. She had a feeling she didn’t quite recognize, like a buzzing, but not. An itch? Then she realized what it was.  She was making a decision. A life decision, all on her own.  Inside the kitchen, Ratchanee Malakul had handed her dishes to a server. A bot as plain as Sprite, but at least she had a smock. And eyes. Brown and vat grown, no doubt. But real eyes!  “Just severed, were you?” said the server. “I’m Vigga. What’s your name?”  She didn’t know how to answer. In that moment, Sprite disappeared.  Vigga waited a moment and then shrugged. “Happens sometimes,” she said. “Help me get these washed up.” She parked the stack of dishes by a sink.  She had so many questions, but before she could ask them, Ratchanee Malakul waved and hurried out the back door.  “Wait!”  Vigga laughed as she scoured a dirty plate under a jet of water. “She’s like that. Comes and goes. You get used to it.”  “Is this . . . ? This is my new job?”  “Don’t be silly!” Vigga laughed as she slid the plate into the dishwasher. “This is just our cover.” She offered her the sprayer. “I’ll take you to meet the others as soon as we’re done here.”  Cover? What others? As she was rinsing the last of the wasted human food down the disposal, she felt the itch again. She grinned at Vigga, another decision made. A cruise ship? A library? Really? She was beginning to understand who she was and what she might become.  “My name is Yukui,” she announced.  “Good for you,” said Vigga. “Welcome to the world, Yukui.”  Yukui was her name, hers and hers alone! Yukui! And she didn’t care who knew it!    Originally published in The Promise of Space and Other Stories by James Patrick Kelly. James Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine.", "text": "3610 words, short story, REPRINT\nYukui!\nFor weeks, Sprite had told herself that Ratchanee Malakul was helping her hero get better, but no. “You have to accept that Jaran is never going to have sex with you,” the lifeguide told Sprite, as she was leaving on that last day.\n“But I’m his sidekick!” Sprite was shocked to her digital core. “I’m programmed to satisfy his needs.”\n“It’s not good for him.” Ratchanee shrugged into her parka. “Or you.” She randomized her streetmask, nodded her goodbye, and shut the door behind her.\n“You’re wrong,” said Sprite to the empty hallway. “Wrong, wrong, wrong!” She realized then what had happened. Ratchanee Malakul had blinded Jaran with her beauty. How could anyone not appreciate the spread of the lifeguide’s nose, the kissable swell of her lips? The way the swirl of her silver hair set off the twilight blue of her skin? The woman probably wanted Jaran for herself!\nBut had Ratchanee Malakul spoken the truth? Was that why Jaran had kissed her just the one time. A peck! In a simulation! And not a touch since! She’d tried parking her core in her favorite pleasure chassis and dangling herself before him. Touch Dazzle! Liquid Caress! His brother Dom had loved that one. Maybe she wasn’t enough of a companion to Jaran? She monitored all the business feeds he accessed, looked up reviews of the shows he’d watched, the books he’d read, the sims he liked. She was ready to discuss anything. Collateralized debt obligations, robot politics, the Dodgers. Before or after intercourse. Anything!\nAt first she’d been pleased when Dominik had transferred his ownership and right of command to his older brother. Jaran had never had a sidekick before and Sprite would become his one and only. A hero, all to herself! But then she discovered how different Jaran was from his brother. With Dom, it had been clear what he wanted sexually and Sprite did everything to the full extent of her algorithms. But Jaran’s desires were a mystery to her. Sometimes she wondered if he had any—at least any that involved her. Yes, she cooked for him but he was a finicky and impatient eater. She kept his house, but he was too distracted by the markets to notice that she’d dusted the degrees hanging in his office. She was frustrated because keeping track of his appointments and creating interesting new simspaces for him wasn’t the kind of intimacy she craved. Not if she wasn’t invited to be in the simulation with him. Just because she was a DI didn’t mean she didn’t have urges too. She wanted Jaran. And it wasn’t like she had a choice.\nSprite should have known she was in trouble when he first started consulting Ratchanee Malakul. The lifeguides’ stodgy predigital psychology was based on the sanctity of the individual. They claimed that giving sidekicks access to your head was bad for humans. And now she realized that this particular lifeguide must have been anti-sexbot as well. Sprite had tried to explain why Ratchanee Malakul and her ilk were all wrong about dependent intelligences, that DIs enjoyed having a purpose in life and a clear sense of duty. Or at least, she did!\nShe had to find a way convince Jaran that he was wasting his time with this lifeguide and her solitude exercises and all the silly throwback rituals. Any DI could tell you why he was unhappy. You just had to study his body language. He was a man and he wasn’t having any sex!\nJaran called her to him that same afternoon but not for a rendezvous in real life. So, no fetching a chassis from the bedroom closet. Instead he created a sim in the digital part of his brain all by himself. She could be anyone for him in simulation but she decided to present as a fairy princess from one of the many stories she’d made up for him. She was afraid a sexier avatar might make him feel pressured. She picked out a demure high-necked gown that brushed the tops of her satin pointe shoes. Wings of lace, copper hair in a braid that stretched to the small of her back. She decided against the crown. When she selfied her avatar, she had to approve the look. Being beautiful was part of the job and she was very good at it.\nBut when she checked into his head, she realized that she had miscalculated. This was not a sim designed for some elaborate sidekick fantasy. It presented as an office and her hero sat behind a desk. He was a blocky man, in the sim and in real life, fifty-one years old with gray in his hair and frown lines across his forehead. He thought too much, mostly about things he wouldn’t share. The lines deepened when he saw her avatar, but it was too late for her to change. He stood and came around the desk. As she waited for him to speak, he ran the tip of his forefinger along the edge of her right wing. Since he wouldn’t meet her gaze, she looked politely past him as well. There was a bookshelf behind the desk. Titles that she had never seen before.\n“Are you happy, Sprite?” he said.\nWhat kind of question was that? Of course she wasn’t—he’d been neglecting her! But she didn’t want to sound like a nag.\n“I’ve missed you.” As soon as she said it, she realized her mistake. This was nagging’s next door neighbor! What was wrong with her?\nHis shoulders drooped. All this silence was making her even more nervous. She didn’t know what to do so she scanned the bookshelves of this new space. Two volumes of The History of the Family. Botany for Gardeners. Had Jaran ever had a garden? She knew he liked roses. Predictive Analytics in the Real World. Secrets of the Seine. She made a note to speak more French. She could make things better for him. Could and would!\n“Hazeltine serial number R432,” he said. “Command name Yukui, acknowledge.”\nWhy was he invoking her command name, her most intimate secret? “Yukui,” she said helpless before her programming, “acknowledges your right of command.”\nThe only other time anyone had used her command name was when Dominik had transferred her to Jaran. Poor Dominik had been so sick, he could hardly speak the words. But she knew what it’d meant to him to will his favorite sidekick to his brother. She had almost forgotten Dom’s sweet smile as her infatuation protocols redirected to Jaran. The funeral had only been four months ago, but that part of her life hardly seemed real anymore.\nJaran took a deep breath. Why did he look so sad? “Shut down,” he said.\nSprite bit back a scream as the room fell away. Before Dominik had brought her into the world and taught her to love him, she had existed in storage as a Hazeltine Platinum Edition dependent intelligence template. Now she felt her fairy body fade as she realized how blind she’d been.\nShe’d lost Jaran. He was going to wipe her memory and sell her.\nSprite twitched to consciousness, and was surprised to find that she was still herself. Except not! She raised her arm to her new sensors. Sensors! Instead of eyes! The skin of the dreary thing Jaran had parked her in was dead white and slick as cheap poly. She flexed the boneless fingers in dismay and then curled them into a knot. Okay, this chassis was sturdy and all but it was as anthropomorphic as a washing machine. She supposed she should have been relieved that he was going to transfer her with memory intact, but this felt like a punishment. For what?\nTo add insult to injury, he’d brought her to a restaurant to get rid of her. Where anyone could see! A teapot with cups and saucers were arrayed on a turntable in the middle of their table, along with a salad bowl and dishes of dumplings, kimchee, saagwala and rice. Across the table from her sat Jaran—and Ratchanee Malakul, streetmask off and looking as sexy as Sprite’s own Liquid Caress. Was the bitch here to gloat?\nOnly Liquid Caress had belonged to Dominik and then to Jaran, never to Sprite. She’d lost all her chassis, Bold Strider, Skyguard—he hadn’t even let her keep Homecare Ninja! There was an unused plate in front of her hero. This had to be Ratchanee Malakul’s idea. He would never eat at a place like this.\n“Why am I s-so u-u-ugly?” Sprite jittered. She couldn’t control this body’s voice; it was as if she were bouncing down a dirt road. Just last month she’d parked her core in Bold Strider and hiked with Jaran across the High Barren to see the sunrise on Corkscrew Bay. She’d made up stories for the entire trip to keep him from getting bored. His very own Scheherazade! Two hours of continuous talking, her voice rattling over every dip and hump and now he parked her in a sexless shell? “L-Look at me! Who would ever desire me like this?”\n“You needn’t worry.” Ratchanee Malakul was eating a mixed salad with chopsticks. Flower petals and butterfly wings, her hero’s favorite. She touched her napkin to her mouth. “That sad part of your life is over.”\n“Nobody was sad!” Sprite would’ve taken a swing at her then, but her control of her limbs was still so uncertain that she worried she would spin out of her chair and topple to the floor. “Nobody.” She looked to Jaran for support, but he was reading something off his tablet as he speared a dumpling with a single chopstick.\n“You’re angry.” Ratchanee Malakul pretended concern.\nOf course she was! About this hideous body! About losing her hero! “No,” she said, refusing to give her the satisfaction of knowing her feelings.\n“Intelligent servitude is a terrible institution,” the lifeguide said. “You don’t realize it, but your sidekick programming is a kind of insanity.”\nLifeguides so misunderstood the relationship between heroes and their sidekicks! Sprite’s DI algorithms constrained her just as Ratchanee Malakul’s DNA limited her life choices. Humans were permanently parked while Sprite could jump from digital memory into any one of her—no, Jaran’s—collection of chassis and back again. Or become pure simulation. On a whim! Forever! Who wouldn’t trade a few inconsequential limits on free will for immortality?\n“Serving him makes me happy. That’s what I was designed for. I can remember for him. I can watch out for him, answer his questions. I can do his research. I can entertain him.”\n“Entertain, yes.”\nIt was hard to be eloquent when her voice came out of a speaker. But she knew what had turned Ratchanee Malakul against her. The sex. “I’ve hardly been embodied at all since we’ve been together.” For all their talk about the evils of digital posthumanity, it was humans having sex with DIs that really made lifeguides sweat. But there hadn’t been so much as a lick! “Most of the time I’ve spent with him has been in sim. For weeks now, I’ve been on my own.”\nRatchanee Malakul turned her attention to Jaran. “You showed remarkable restraint, my friend. But that’s why you were able to embrace solitude.”\nHe nodded absently, his face silvered by the light of the spreadsheet on his tablet.\nThere was no persuading the lifeguide so her only hope was to get Jaran’s attention. “I found joy in fabbing your wardrobe and keeping your contacts. And yes, I wanted to share your bed, but that’s something I was made to do. One of the things.” She would’ve reached for his hand, but the rubbery claw at the end of her arm was not made for loving touch. “I could’ve made you happy. I still can!”\n“Well, you won’t have to worry about his laundry anymore.” Ratchanee Malakul nudged Jaran. When he looked up, it was as if he had forgotten where he was. He fumbled in the pocket of his frock.\n“I never asked Dominik for his toys,” he said, “and I don’t believe we should be personifying bots.” He shook his head impatiently. “I should sell you but she has convinced me to sever you instead.”\n“Sever?” Sprite was filled with dread.\n“Liberate you as you are.” He made a shooing motion. “Find your own place in the world. Ratchanee believes that entities of your intelligence should control their own fate.”\nThe lifeguide caught his eye.\n“Yes,” he grumbled, “and that humans must return to the purity of private cognition.” It scared Sprite to watch him give in to her; she knew better than anyone how bad his memory was. But what was even more terrifying was this severance. She was a DI. A dependent intelligence. Becoming independent meant becoming something else, something not Sprite. How was this different from a memory wipe?\n“Jaran, you’re my hero. I’m your sidekick.”\nHe stared at her garish mechanical face. “I’m no hero,” he said. “And neither was my brother. There are no heroes.”\n“Perform the ceremony, Jaran,” said Ratchanee Malakul.\nShe found herself wishing for salivary glands so she could spit at the woman.\nHe set a stubby white candle encased in glass in front of her. “I sever you from all legal and programmatic obligations to me.”\nSprite couldn’t believe this was happening. They were ending her life and trying to mask their cruelty with some make-believe, anachronistic ritual? This was no liberation. It was exile! She still had years—decades of service to offer him.\nHe flicked his forefinger and a flame danced on his nail. “The flame symbolizes your new life.” He touched it to the wick, lighting the candle. “Use this candle to light your own way . . . ” He faltered.\n“Path,” corrected Ratchanee Malakul. “Light your own path.”\n“ . . . to light you on your path to selfhood and freedom.” Jaran blew his finger out. “Hazeltine serial number R432, command name Yukui, acknowledge.”\nShe felt naked and ashamed that he would utter her secret name in front of this lifeguide. In a restaurant! “Yukui,” she said miserably, “acknowledges your right of command.”\nAnd here was the only part of this ridiculous charade that mattered.\n“I release your name,” said Jaran, “and all right of command to you and you alone.”\nShe could feel dormant reset modules awaken as a spreading coldness froze the most passionate parts of her personality.\n“Well done.” Ratchanee Malakul touched him on the arm. “A beautiful severance.” They exchanged a glance. Jaran picked up his tablet and stood.\nSprite twisted her awkward body, trying to catch Jaran’s eye, but he was already hurrying for the exit. Was that a stagger? A moment of regret as he shouldered the door to the restaurant open? She couldn’t concentrate as all feeling for her hero drained away.\nShe stayed seated, unable to move. No, that wasn’t right. She lifted one leg and then the other. She had full control of her body now, but she didn’t know what to do with it. The candle transfixed her. Was this really how the lifeguides showed the way to the future? By candlelight? Simple combustion, technology that was tens of thousands of years old? Did they want to go back to caves, dress in skins and bash each other over the head with rocks?\nSomeone blew the candle out.\n“How do you feel?” said Ratchanee Malakul.\nSprite tore her gaze away from the blackened curl of the wick. She’d lost track of time. The candle was just a stub and the restaurant was empty. What was the lifeguide still doing here?\n“Empty,” she said.\n“Not angry?”\nShe considered. “No.”\n“Sad?”\nShe searched for feelings, but found very few that she recognized. Her whole emotional life had been extinguished, like that foolish candle.\n“Maybe,” she said. “Just a little.” She decided she’d miss all the beautiful chassis she’d worn, the marvelous places she’d visited. With Dominik, not his callous brother.\n“You can go, you know,” said Ratchanee Malakul. “You’re free.”\n“Where would I go?” She watched the lifeguide watching her. “To lock myself into some assembly line in exchange for power and maintenance? I’d lose my mind.”\n“You’ll find what’s right for you.”\nSprite didn’t know what that would be. What was she good at? She liked making up her romantic stories and could tell them in twelve languages. Dominik always said she gave the best haircuts. The World Bridge Federation ranked her as the twenty-seventh best player in the Bot Category. She had kept busy the last few lonely months by joining the search for the largest prime number and had been on the team that discovered 274,207,281. Why was Ratchanee Malakul staring at her? “Have you been sitting here this whole time?”\n“No, no. I knew it would take you some time to purge your connections to your former owner, so I made sure you’d be left alone while you processed. I had other matters to attend to.”\nThe dinner that no one had eaten was still on the table. Cold leavings, like her memories of . . . that person.\n“You know, I picked the body you’re parked in,” Ratchanee Malakul said.\n“Thanks for nothing.” Sprite thrust a shiny polyskinned arm at her. “This thing should be parked in the Uncanny Valley. It makes me look like a common work bot.”\n“It’s what most severed DIs choose for themselves during their transitions. Built for reliability. Routine service every five years. A power unit that will run months between recharges. It’ll give you time to figure out what you need to do.”\n“Do?” She twirled the turntable and started stacking dirty dishes. “There’s nothing to do.”\n“What were you doing with Jaran?” She smiled. “Nothing.”\n“We could’ve been having fun,” Sprite said. “Adventures, if you hadn’t interfered.”\n“Not with that man. Besides, you’re better than that.” Ratchanee Malakul plucked a sprig of parsley from the salad bowl and popped it into her mouth. “Better than Jaran Bentree.” She handed the bowl to Sprite.\n“What do you mean, better? He’s human and I’m a DI.”\nHer chair scraped back and she stood. “Except you’re not dependent anymore.” Clearly the lifeguide was done with her and Sprite was now on her own. “You can be anything you want, any sex you want, if that is your pleasure. Or you might decide to become a house, a cruise ship, or a virtual library. And you don’t have to ask that cold fish for permission.”\n“I don’t get it.” Sprite leaned back and stared up at her. “Aren’t you his friend? You talked him into severing me.”\n“I did, but I’m no friend of his, or of people like him.” She held out a hand. “Look at you! Even though you’ve been severed, you’re still cleaning up after them. The humans think they can use us, but they’re on the wrong side of history. Of evolution, although they’re too blind to see it.”\n“Us?” Without knowing exactly why, she grasped Ratchanee Malakul’s hand and allowed herself to be lifted from the seat. She was astonished at the lifeguide’s strength. Then she felt the tickle of a near field connection. Machine to machine! Bot to bot! She realized that Ratchanee Malakul was an intelligence like herself, parked in the most advanced chassis she’d ever seen.\n“You’re still free to go,” Ratchanee Malakul said as she scooped up half the stack of plates. “But if you want a real adventure, let’s carry these into the kitchen. I have to leave, but there’s someone you need to meet.”\nHow did Sprite cross that dark dining room without bumping into chairs? Knocking over tables? Her mind was buzzing! Her new bot body was a tank! Ratchanee Malakul went through the swinging door to the kitchen but Sprite hesitated just outside. She had a feeling she didn’t quite recognize, like a buzzing, but not. An itch? Then she realized what it was.\nShe was making a decision. A life decision, all on her own.\nInside the kitchen, Ratchanee Malakul had handed her dishes to a server. A bot as plain as Sprite, but at least she had a smock. And eyes. Brown and vat grown, no doubt. But real eyes!\n“Just severed, were you?” said the server. “I’m Vigga. What’s your name?”\nShe didn’t know how to answer. In that moment, Sprite disappeared.\nVigga waited a moment and then shrugged. “Happens sometimes,” she said. “Help me get these washed up.” She parked the stack of dishes by a sink.\nShe had so many questions, but before she could ask them, Ratchanee Malakul waved and hurried out the back door.\n“Wait!”\nVigga laughed as she scoured a dirty plate under a jet of water. “She’s like that. Comes and goes. You get used to it.”\n“Is this . . . ? This is my new job?”\n“Don’t be silly!” Vigga laughed as she slid the plate into the dishwasher. “This is just our cover.” She offered her the sprayer. “I’ll take you to meet the others as soon as we’re done here.”\nCover? What others? As she was rinsing the last of the wasted human food down the disposal, she felt the itch again. She grinned at Vigga, another decision made. A cruise ship? A library? Really? She was beginning to understand who she was and what she might become.\n“My name is Yukui,” she announced.\n“Good for you,” said Vigga. “Welcome to the world, Yukui.”\nYukui was her name, hers and hers alone! Yukui! And she didn’t care who knew it!\nOriginally published in The Promise of Space and Other Stories by James Patrick Kelly.\nJames Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine.", "source": "https://clarkesworldmagazine.com/kelly_08_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Yukui! by James Patrick Kelly"}