{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jack Skillingstead", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "UA1yvHu3WtcBtnsA3f5mI5CnN9g=", "id": null, "license": null, "comments": "", "raw_text": "3180 words, short story  The Despoilers  Sometimes Allegra had to get away from the dying man. Inevitably her steps brought her to Destiny. The lander stood in a field of high grass, the last unnatural thing on 51 PegesiD. Of course, the dying man would say Allegra herself must stop challenging the natural order. Wind moved the grass in purple waves, and Allegra could almost imagine it was an ocean and Destiny a sea-faring vessel that might carry her away, instead of a spaceship deliberately disabled.  Allegra sat on a hill overlooking the field, already out of breath after her short walk. 51 PegesiD’s lower oxygen combined with the planet’s greater density turned Allegra into a wheezing and stooped old woman—at the age of seventeen! It wasn’t fair. The dying man called the planet Gaia. He called it “unspoiled.” He called it “paradise.” And he had marooned them there forever.  A flying reptile, about the size of a kitten, beat into the air. The reptiles were harmless, but their shit stank and was everywhere. Gaia wasn’t paradise to Allegra; it was prison.  And the dying man was Allegra’s father.  The wind carried the scent of wild flowers. She was not allowed to name the flowers, or catalog them, though back home she had been studying to become an exobotanist. 51 PegesiD’s unofficial name might have been Gaia, but that’s where the naming of things stopped. “There is no ownership here,” her father said. “Either we are in perfect harmony or we are despoilers from outside the body of the planet. A disease infection. Part of the human cancer that ravages worlds, starting with our own.”  Had the scent of alien flowers unraveled her father’s mind? Molecular compounds, incompatible with sanity, carried on the wind? That Allegra wanted to investigate the possibility already invalidated the premise. She breathed the same air, and she still believed in science. Her father’s mind must have harbored delusions even before they departed Centari for the unknown, or, as he told her when she woke from stasis, an “unspoiled haven.”  Allegra almost had her breath back. She stood up slowly—and froze. The wind carried something besides the flowered scent. Tiny voices, as if invisible insects in the grass were speaking.  The voices were coming from Destiny.  She ran, gasping, down the hillside. Her knees ached with every jolting footfall. The hatch stood open, as it had for three months, ever since her father marooned them here. She pulled herself up the steps. The voices had stopped, and she wondered if she had imagined them; Allegra was desperate for other voices.  The natural world had infiltrated the body of the ship. Beetle-like insects crawled on polished surfaces. Something had made a nest under one of the acceleration couches, an untidy bundle of purple grass. And despite the open hatch, the cabin smelled so bad of flying reptile shit she wanted to gag.  In the gloom, a white light glowed on the communication console. Allegra stared at it, and the voice spoke.  Her father’s voice.  “Maintain thirty degree downslope on a relative heading of two-four-zero.”  A recording?  Allegra slumped. She leaned heavily on the console, breathing hard. The planet pulling her down, always pulling her down. Then another voice spoke. Allegra raised her chin. A man, speaking crisply, focused.  “Confirmed. Following your vector, Destiny.”  Not a recording. The lander’s rudimentary AI, a reactive voice capable of simple back-and-forth, had been reprogrammed with her father’s voice and was conversing with someone. The someone probably didn’t know what he was talking to.  Allegra touched the microphone key. “Hello, hello? Pilot, this is Destiny. Do you copy?”  Nothing.  Then: “What the hell is this?” A violent rattling, mechanical disturbance, and the voice was gone.  Allegra leaned into the mike. “Pilot, what’s happening? Talk to me. Please.”  Dead air.  Allegra hunkered and pried off the access panel under the communications display. She unzipped the hip pocket of her flight suit and produced her forbidden halogen light. Her father had declared all technology an affront to Gaia (except, apparently, when it served to misdirect this pilot), but Allegra had kept the light anyway. And she continued to wear her flight suit, despite his insistence she “clothe herself properly, in harmony.” He couldn’t just tell her what to do, couldn’t take everything away from her. She should have listened to her mother when she told Allegra that her father wasn’t entirely rational anymore. Now she would never see her mother again, unless this pilot . . .  There: an interrupted circuit preventing live communication out of the lander. She rigged a cross patch and tried the mike again.  “Destiny calling unidentified pilot, Destiny calling unidentified pilot. Are you there?”  She waited, received only dead air. Had something gone wrong with her patch? That anything was functional on the Destiny lander was a revelation to Allegra. Her father’s sabotage had appeared thorough, rendering the vehicle powerless. But he must have anticipated the possibility of outsiders and prepared this . . . well, whatever this was. A trap?  Then the voice spoke again, sounding strained. “I’m identified. I identified from orbit.”  “I wasn’t here.”  “Who are you?”  “Allegra Ray. I’m, we—I’m here with my father. We’re stranded.”  “Was it your father who talked me down?”  “Only in a second-hand way,” Allegra said. “His voice but my lander’s interactive AI.”  “Well, whatever it was, it steered me into a hell of a mess.” The pilot sounded angry—and in pain.  “What’s your situation?”  “Not wonderful. Crashed. Pretty banged up—the ship and me both. I might have to charge you for repairs, Allegra Ray.”  “I’m good for it. Who are you anyway?”  “Malik. Deep space survey, private contractor. Found your orbital frame. There’s not supposed to be anyone out this far, so it was a surprise.” Malik groaned.  “What’s wrong?”  “Told you. Banged up.”  “I’m sorry.”  “Yeah. Anyhow, I started receiving transmissions from the surface. Guy said his ship was disabled and could I help. Naturally I followed the landing instructions. I was going to be the hero, rescue the castaway and all that. Instead I flew into some nasty geothermal venting. My shuttle’s small. Struck me like a disrupter blast, flipped me. When I came to, you were talking. Oh, God. Wow. That hurts.”  “What’s your location?”  After a long rasping pause, Malik said, “I don’t know.”  “I heard the last relative heading, but I don’t know what it was relative to. Can’t you check your nav history?”  Another long pause. “Can’t get to it, or anything else. Hurt bad. Broken legs. Pinned against the bulkhead.”  Allegra closed her eyes, feeling more pulled down than ever. “You could be anywhere.”  “Yeah, but I’m not. I’m right here, where the pain is. If you’ve got a medbot handy bring it along. Look, I might pass out.”  “Hang on, Malik. I’ll figure out where you are. Hello? Malik?”  It took a while, but she managed to unlock the lander’s recorded conversation and tracking data. Destiny might never fly again (her father had dumped the fuel and severed control linkages) but it still had a functional mind. Before hearing the distant insect voices from the hilltop, she hadn’t realized that anything on the vehicle was still working. Her father’s sabotage was both technically intricate and mad.  “There was no voice,” her father said.  Inside the yurt, the light was dim. Her father had constructed the shelter with sloppy enthusiasm, even as he was becoming ill and Allegra was still refusing to accept their marooned status. Now he lay on a bed of reeds padded with big fibrous leaves that Allegra called “elephant ears.” He wore a kind of Tarzan loin cloth made of the same leaves. With the advent of his illness and frequent fevers, he had lost so much weight that his body resembled a hide-and-bone doll. His watery eyes, sunken and bright with fever, watched Allegra.  Her heart ached—with anger and pity. If only he hadn’t eaten the indigenous plants without testing them. How could a mind so brilliant also be so irrational? Allegra had subsisted on the ship’s stores for as long as she could. Then, against her father’s insistence that they abandon “the tools of the despoilers,” she’d retrieved a testing kit from the lander and used it to figure out what she could safely eat. The answer was: not much. And what she did consume, ate her as much as she ate it, turning her gut biome into a volatile experiment—even with pills from the emergency survival kit that were intended to mitigate such reactions. All her father said was, “If we trust Gaia, she will welcome us.”  Not so much.  “Dad, I heard him. On the radio. I talked to him.”  “I told you to stay away from the lander.”  Her anger surged, and she held it down. “The pilot was following a heading the AI gave him. A heading you gave him. You made him crash. I can’t believe you did that.”  His head rolled side-to-side, making the dried-out elephant ears crackle softly. “There’s only us, sweetheart. I saved you from the despoilers, if only you could see that. Gaia is—”  Her frustration boiled over. “PegesiD is killing you.”  He shook his head. “She knows we don’t trust her.”  “You—”  “We. You and I are the same flesh. She knows that.” He plucked weakly at the leg of her flight suit. “You defy her even in what you chose to wear.”  “Don’t put it on me. Please, don’t.”  He closed his eyes. “I knew they would come, the despoilers. I prepared.”  In a fading voice, he added, “Don’t leave me.”  Why not? You left us. Then came back to “rescue” me from the big bad human race. But humans weren’t a disease infecting the universe. They made it matter by observing it—that’s what Allegra’s mother, a physicist, said. That was the whole point. So what if humans also made messes? You could clean up a mess and learn not to make the same one over again. Her father had made a mess, too, but he wasn’t cleaning it up. He was making it worse. He wanted to disappear into nature, but it was nature that disappeared, without humans to observe it.  She put the back of her hand to his forehead. His damp skin radiated heat. On the orbital frame, where she had access to medical equipment, she might be able to help him. But without a functioning ship, the orbital was out of reach. Malik had a ship. Was it flyable after the crash? She had to find out. But she was torn.  Don’t leave me.  Allegra sat on the ground beside her father. He had lied to her, brought her here, took away her life. But he was still her father. Sometimes the good memories seemed farther away than Centari, than Earth, even. But she still saw them (Daddy, pick me up, pick me up now!) and so they still mattered.  She stared at the ground. The planet pulled at her, like hands reaching from a grave to drag her down. But it was only gravity—as indifferent to her presence as the ocean she nearly drowned in back on CentauriBd. She had steered her windboard into a squall. Breaking waves tumbled her into the sea, and she had struggled to keep her head above water until she could regain the board. It had been like fighting a living thing, a thing with intentional malice. In the midst of drowning, that was how it felt. Her father believed Gaia did things intentionally. At least Allegra understood her own misperception. But she hadn’t gone back in the water and never would. The fear of drowning filled her with dread, as did the fear of her father’s death. Sitting there, she couldn’t do anything—not for her father, or the pilot, or herself.  Allegra stood up, heavily. She filled two water bottles and clipped them to her flight suit. For a moment, she looked down at her father. Then she turned and ducked out of the yurt, squinting in the setting glare of 51 PegesiD. Don’t leave me, he’d said. But he had left her first, and besides, she was on a mission to save them both.  She stopped at the lander and booted the communications rig.  “Malik, are you there?”  Nothing.  “Hey,” she said, “I don’t have a medbot, but I’m coming. Malik?”  “I’m here. Calm down. I’m the one who crashed, remember?” He sounded weak.  “I remember. What’s your status?”  He laughed harshly, started to cough. “Status? My status is unhappy. If I get out of this, I’m going to clock your old man. Sorry, kid, but he tried to kill me.”  Allegra winced. “He’s not himself. And I’m not a kid.”  “Yeah? Then all’s forgiven.” He coughed again. “I hurt.”  The com went silent. Had he passed out again?  Allegra opened a locker and retrieved the first-aid kit. It wasn’t a medbot but it was better than nothing. She climbed out of the lander and stood before the sunset. According to her analysis, Malik had come down more than twenty kilometers from the lander. It would take her most of the night to reach the crash site. All around her the purple grass whispered doom—a secret sea that wanted to drown her.  Twenty kilometers might as well have been a hundred. Plodding through the night, fear and gravity weighed heavily upon her. She stopped to rest, lay flat on the ground, panting. Three small moons made a lunar ellipsis. Out of the dark around her, 51 PegesiD’s fauna huffed and grunted. She was used to the flying lizard-kittens, which made an almost-cute squeaking noise. But these unseen creatures sounded big. Would anyone ever study them, build a taxonomic classification? Or would they remain a pointless mystery that might ignore you—or eat you.  She stood up, studied the stars, oriented herself, and resumed walking. An hour before dawn, she saw a light—and wondered what was wrong with it. The light, definitely artificial, shifted, strangely refracted. She lurched toward it, trying to run but incapable, heavy legs stumping like posts. Sweat poured off her. The flight suit clung to her body, chaffing her thighs. She stumbled on disturbed earth, fell heavily, got up and found herself standing in a long track of torn-up landscape—the crash-path of Malik’s shuttle. The path ended at the edge of a deep pond. The shuttle was down there, its blue position lights refracted by the cold, clear water.  “Oh, shit,”  She couldn’t go into the water. Couldn’t. Allegra clenched her jaw. Had she come all this way for nothing? She looked up. Among the faded stars, two orbiters sped around the planet, empty and waiting for a crew that would never return, while Allegra stood here feeling sorry for herself.  Gaia had won.  Bubbles, trailing up from the shuttle, collected on the surface of the pond. In the pre-dawn light, the outline of Malik’s craft became visible. How damaged was it? If she could get inside she might be able to power it out of the water. Only fear prevented her from trying, from taking the first step. And her fear was like the planet. It only mattered because she was paying attention to it.  “Screw this.”  At the edge of the pond Allegra took deep breaths, heaving oxygen into her lungs, expanding her chest. That time on CentauriBd it hadn’t been the ocean trying to drown her. It had been Allegra making a series of bad choices that ended with her in a drowning panic. But acknowledging the irrational premise of fear and acting against it were two different things. Allegra was already tired. If she went into the water and failed to access the shuttle’s airlock, how would she fight gravity and exhaustion to reach the surface again?  Stop delaying.  One last deep breath. She held it and, clutching the first-aid kit, dove into the pond. The water was shockingly cold. She hadn’t expected that. She sank rapidly. As if on its own volition, her body twisted around and tried for the surface. She wasn’t ready! She couldn’t! Gravity acted like lead sash weights tied to her ankles. The surface trembled beyond her fingertips, and she began to sink back, Gaia dragging her down.  No! She twisted around again and began pulling and kicking for the bottom with everything she had. In moments she reached the shuttle. Vision blurry, chest aching, she couldn’t find the hatch. She hauled herself frantically around the vehicle. Air bubbled past her lips, her lungs desperate for replenishment. She started to become disoriented—and there it was.  The airlock.  It was a standard arrangement, similar to Destiny’s. She tore open the hinged cover, revealing the manual control wheel, and started cranking it. If for some reason the inner hatch was already open, she was about to flood the shuttle and kill Malik, if he wasn’t already dead.  The outer hatch began to retract. Trapped air exploded out, churning Allegra away from the shuttle. She fought her way back and cranked the wheel until the gap was wide enough to squeeze through.  The inner hatch was still air-tight.  She closed the outer hatch and slapped the PURGE button. The water level began to drop, and Allegra thrust her face above the surface, gasping and choking. The shuttle wasn’t a submarine. The chamber was designed to equalize atmospheres, not water pressure. The water level drained only as far as Allegra’s knees. The inner hatch rolled open, allowing the remaining pond water in the chamber to sluice into the main cabin. Malik yelled, “What the hell!” and Allegra dragged herself through the hatchway.  The crash impact had ripped the pilot’s seat off its track and pinned Malik against the bulkhead. A knob of bone poked through a tear in the leg of his suit. Allegra grimaced. Malik stared at her through his pain and astonishment. He forced a grim smile.  “What took you so long, kid? And where’d all the water come from?”  “I’ll tell you later. Will this thing fly?”  “Who knows?”  Allegra took in the flight controls and determined them similar enough to Destiny’s that she believed she could handle the ship. She turned to Malik, unsealed the first-aid kit, and selected a needled opioid tab. “For the pain,” she said and pushed it into his thigh. Malik’s eyes popped wide, then narrowed to dreamy slits.  Now she would find out. Allegra strapped herself into the second chair, studied the controls, and initiated engine-start. The shuttle trembled, like something coming awake in the cold. Allegra powered up the thrusters. The shuttle jerked out of the mud and rose swiftly. In a moment they were airborne. Allegra banked towards her father’s yurt, her heart aching with anger and regret. Gaia was a fantasy. Allegra would never understand her father, but if she tried, she could at least begin to understand 51 PegesiD.  The shuttle’s engines gobbled air in thunderous harmony. Below, creatures like bears with long necks stood up in the grass, craning their heads.  She caught only a glimpse.  In 2001 Jack Skillingstead submitted a story to Stephen King's \"On Writing\" contest. He won and not long afterward began selling regularly to major science fiction and fantasy markets. To date he has sold more than forty stories to various magazines, Year's Best volumes and original anthologies. In 2003 his story \"Dead Worlds\" was a finalist for the Theodore Sturgeon Award and in 2009 his novel Life on The Preservation was a finalist for the Philip K. Dick Award. Jack lives in Seattle with his wife, writer Nancy Kress.", "text": "3180 words, short story\nThe Despoilers\nSometimes Allegra had to get away from the dying man. Inevitably her steps brought her to Destiny. The lander stood in a field of high grass, the last unnatural thing on 51 PegesiD. Of course, the dying man would say Allegra herself must stop challenging the natural order. Wind moved the grass in purple waves, and Allegra could almost imagine it was an ocean and Destiny a sea-faring vessel that might carry her away, instead of a spaceship deliberately disabled.\nAllegra sat on a hill overlooking the field, already out of breath after her short walk. 51 PegesiD’s lower oxygen combined with the planet’s greater density turned Allegra into a wheezing and stooped old woman—at the age of seventeen! It wasn’t fair. The dying man called the planet Gaia. He called it “unspoiled.” He called it “paradise.” And he had marooned them there forever.\nA flying reptile, about the size of a kitten, beat into the air. The reptiles were harmless, but their shit stank and was everywhere. Gaia wasn’t paradise to Allegra; it was prison.\nAnd the dying man was Allegra’s father.\nThe wind carried the scent of wild flowers. She was not allowed to name the flowers, or catalog them, though back home she had been studying to become an exobotanist. 51 PegesiD’s unofficial name might have been Gaia, but that’s where the naming of things stopped. “There is no ownership here,” her father said. “Either we are in perfect harmony or we are despoilers from outside the body of the planet. A disease infection. Part of the human cancer that ravages worlds, starting with our own.”\nHad the scent of alien flowers unraveled her father’s mind? Molecular compounds, incompatible with sanity, carried on the wind? That Allegra wanted to investigate the possibility already invalidated the premise. She breathed the same air, and she still believed in science. Her father’s mind must have harbored delusions even before they departed Centari for the unknown, or, as he told her when she woke from stasis, an “unspoiled haven.”\nAllegra almost had her breath back. She stood up slowly—and froze. The wind carried something besides the flowered scent. Tiny voices, as if invisible insects in the grass were speaking.\nThe voices were coming from Destiny.\nShe ran, gasping, down the hillside. Her knees ached with every jolting footfall. The hatch stood open, as it had for three months, ever since her father marooned them here. She pulled herself up the steps. The voices had stopped, and she wondered if she had imagined them; Allegra was desperate for other voices.\nThe natural world had infiltrated the body of the ship. Beetle-like insects crawled on polished surfaces. Something had made a nest under one of the acceleration couches, an untidy bundle of purple grass. And despite the open hatch, the cabin smelled so bad of flying reptile shit she wanted to gag.\nIn the gloom, a white light glowed on the communication console. Allegra stared at it, and the voice spoke.\nHer father’s voice.\n“Maintain thirty degree downslope on a relative heading of two-four-zero.”\nA recording?\nAllegra slumped. She leaned heavily on the console, breathing hard. The planet pulling her down, always pulling her down. Then another voice spoke. Allegra raised her chin. A man, speaking crisply, focused.\n“Confirmed. Following your vector, Destiny.”\nNot a recording. The lander’s rudimentary AI, a reactive voice capable of simple back-and-forth, had been reprogrammed with her father’s voice and was conversing with someone. The someone probably didn’t know what he was talking to.\nAllegra touched the microphone key. “Hello, hello? Pilot, this is Destiny. Do you copy?”\nNothing.\nThen: “What the hell is this?” A violent rattling, mechanical disturbance, and the voice was gone.\nAllegra leaned into the mike. “Pilot, what’s happening? Talk to me. Please.”\nDead air.\nAllegra hunkered and pried off the access panel under the communications display. She unzipped the hip pocket of her flight suit and produced her forbidden halogen light. Her father had declared all technology an affront to Gaia (except, apparently, when it served to misdirect this pilot), but Allegra had kept the light anyway. And she continued to wear her flight suit, despite his insistence she “clothe herself properly, in harmony.” He couldn’t just tell her what to do, couldn’t take everything away from her. She should have listened to her mother when she told Allegra that her father wasn’t entirely rational anymore. Now she would never see her mother again, unless this pilot . . .\nThere: an interrupted circuit preventing live communication out of the lander. She rigged a cross patch and tried the mike again.\n“Destiny calling unidentified pilot, Destiny calling unidentified pilot. Are you there?”\nShe waited, received only dead air. Had something gone wrong with her patch? That anything was functional on the Destiny lander was a revelation to Allegra. Her father’s sabotage had appeared thorough, rendering the vehicle powerless. But he must have anticipated the possibility of outsiders and prepared this . . . well, whatever this was. A trap?\nThen the voice spoke again, sounding strained. “I’m identified. I identified from orbit.”\n“I wasn’t here.”\n“Who are you?”\n“Allegra Ray. I’m, we—I’m here with my father. We’re stranded.”\n“Was it your father who talked me down?”\n“Only in a second-hand way,” Allegra said. “His voice but my lander’s interactive AI.”\n“Well, whatever it was, it steered me into a hell of a mess.” The pilot sounded angry—and in pain.\n“What’s your situation?”\n“Not wonderful. Crashed. Pretty banged up—the ship and me both. I might have to charge you for repairs, Allegra Ray.”\n“I’m good for it. Who are you anyway?”\n“Malik. Deep space survey, private contractor. Found your orbital frame. There’s not supposed to be anyone out this far, so it was a surprise.” Malik groaned.\n“What’s wrong?”\n“Told you. Banged up.”\n“I’m sorry.”\n“Yeah. Anyhow, I started receiving transmissions from the surface. Guy said his ship was disabled and could I help. Naturally I followed the landing instructions. I was going to be the hero, rescue the castaway and all that. Instead I flew into some nasty geothermal venting. My shuttle’s small. Struck me like a disrupter blast, flipped me. When I came to, you were talking. Oh, God. Wow. That hurts.”\n“What’s your location?”\nAfter a long rasping pause, Malik said, “I don’t know.”\n“I heard the last relative heading, but I don’t know what it was relative to. Can’t you check your nav history?”\nAnother long pause. “Can’t get to it, or anything else. Hurt bad. Broken legs. Pinned against the bulkhead.”\nAllegra closed her eyes, feeling more pulled down than ever. “You could be anywhere.”\n“Yeah, but I’m not. I’m right here, where the pain is. If you’ve got a medbot handy bring it along. Look, I might pass out.”\n“Hang on, Malik. I’ll figure out where you are. Hello? Malik?”\nIt took a while, but she managed to unlock the lander’s recorded conversation and tracking data. Destiny might never fly again (her father had dumped the fuel and severed control linkages) but it still had a functional mind. Before hearing the distant insect voices from the hilltop, she hadn’t realized that anything on the vehicle was still working. Her father’s sabotage was both technically intricate and mad.\n“There was no voice,” her father said.\nInside the yurt, the light was dim. Her father had constructed the shelter with sloppy enthusiasm, even as he was becoming ill and Allegra was still refusing to accept their marooned status. Now he lay on a bed of reeds padded with big fibrous leaves that Allegra called “elephant ears.” He wore a kind of Tarzan loin cloth made of the same leaves. With the advent of his illness and frequent fevers, he had lost so much weight that his body resembled a hide-and-bone doll. His watery eyes, sunken and bright with fever, watched Allegra.\nHer heart ached—with anger and pity. If only he hadn’t eaten the indigenous plants without testing them. How could a mind so brilliant also be so irrational? Allegra had subsisted on the ship’s stores for as long as she could. Then, against her father’s insistence that they abandon “the tools of the despoilers,” she’d retrieved a testing kit from the lander and used it to figure out what she could safely eat. The answer was: not much. And what she did consume, ate her as much as she ate it, turning her gut biome into a volatile experiment—even with pills from the emergency survival kit that were intended to mitigate such reactions. All her father said was, “If we trust Gaia, she will welcome us.”\nNot so much.\n“Dad, I heard him. On the radio. I talked to him.”\n“I told you to stay away from the lander.”\nHer anger surged, and she held it down. “The pilot was following a heading the AI gave him. A heading you gave him. You made him crash. I can’t believe you did that.”\nHis head rolled side-to-side, making the dried-out elephant ears crackle softly. “There’s only us, sweetheart. I saved you from the despoilers, if only you could see that. Gaia is—”\nHer frustration boiled over. “PegesiD is killing you.”\nHe shook his head. “She knows we don’t trust her.”\n“You—”\n“We. You and I are the same flesh. She knows that.” He plucked weakly at the leg of her flight suit. “You defy her even in what you chose to wear.”\n“Don’t put it on me. Please, don’t.”\nHe closed his eyes. “I knew they would come, the despoilers. I prepared.”\nIn a fading voice, he added, “Don’t leave me.”\nWhy not? You left us. Then came back to “rescue” me from the big bad human race. But humans weren’t a disease infecting the universe. They made it matter by observing it—that’s what Allegra’s mother, a physicist, said. That was the whole point. So what if humans also made messes? You could clean up a mess and learn not to make the same one over again. Her father had made a mess, too, but he wasn’t cleaning it up. He was making it worse. He wanted to disappear into nature, but it was nature that disappeared, without humans to observe it.\nShe put the back of her hand to his forehead. His damp skin radiated heat. On the orbital frame, where she had access to medical equipment, she might be able to help him. But without a functioning ship, the orbital was out of reach. Malik had a ship. Was it flyable after the crash? She had to find out. But she was torn.\nDon’t leave me.\nAllegra sat on the ground beside her father. He had lied to her, brought her here, took away her life. But he was still her father. Sometimes the good memories seemed farther away than Centari, than Earth, even. But she still saw them (Daddy, pick me up, pick me up now!) and so they still mattered.\nShe stared at the ground. The planet pulled at her, like hands reaching from a grave to drag her down. But it was only gravity—as indifferent to her presence as the ocean she nearly drowned in back on CentauriBd. She had steered her windboard into a squall. Breaking waves tumbled her into the sea, and she had struggled to keep her head above water until she could regain the board. It had been like fighting a living thing, a thing with intentional malice. In the midst of drowning, that was how it felt. Her father believed Gaia did things intentionally. At least Allegra understood her own misperception. But she hadn’t gone back in the water and never would. The fear of drowning filled her with dread, as did the fear of her father’s death. Sitting there, she couldn’t do anything—not for her father, or the pilot, or herself.\nAllegra stood up, heavily. She filled two water bottles and clipped them to her flight suit. For a moment, she looked down at her father. Then she turned and ducked out of the yurt, squinting in the setting glare of 51 PegesiD. Don’t leave me, he’d said. But he had left her first, and besides, she was on a mission to save them both.\nShe stopped at the lander and booted the communications rig.\n“Malik, are you there?”\nNothing.\n“Hey,” she said, “I don’t have a medbot, but I’m coming. Malik?”\n“I’m here. Calm down. I’m the one who crashed, remember?” He sounded weak.\n“I remember. What’s your status?”\nHe laughed harshly, started to cough. “Status? My status is unhappy. If I get out of this, I’m going to clock your old man. Sorry, kid, but he tried to kill me.”\nAllegra winced. “He’s not himself. And I’m not a kid.”\n“Yeah? Then all’s forgiven.” He coughed again. “I hurt.”\nThe com went silent. Had he passed out again?\nAllegra opened a locker and retrieved the first-aid kit. It wasn’t a medbot but it was better than nothing. She climbed out of the lander and stood before the sunset. According to her analysis, Malik had come down more than twenty kilometers from the lander. It would take her most of the night to reach the crash site. All around her the purple grass whispered doom—a secret sea that wanted to drown her.\nTwenty kilometers might as well have been a hundred. Plodding through the night, fear and gravity weighed heavily upon her. She stopped to rest, lay flat on the ground, panting. Three small moons made a lunar ellipsis. Out of the dark around her, 51 PegesiD’s fauna huffed and grunted. She was used to the flying lizard-kittens, which made an almost-cute squeaking noise. But these unseen creatures sounded big. Would anyone ever study them, build a taxonomic classification? Or would they remain a pointless mystery that might ignore you—or eat you.\nShe stood up, studied the stars, oriented herself, and resumed walking. An hour before dawn, she saw a light—and wondered what was wrong with it. The light, definitely artificial, shifted, strangely refracted. She lurched toward it, trying to run but incapable, heavy legs stumping like posts. Sweat poured off her. The flight suit clung to her body, chaffing her thighs. She stumbled on disturbed earth, fell heavily, got up and found herself standing in a long track of torn-up landscape—the crash-path of Malik’s shuttle. The path ended at the edge of a deep pond. The shuttle was down there, its blue position lights refracted by the cold, clear water.\n“Oh, shit,”\nShe couldn’t go into the water. Couldn’t. Allegra clenched her jaw. Had she come all this way for nothing? She looked up. Among the faded stars, two orbiters sped around the planet, empty and waiting for a crew that would never return, while Allegra stood here feeling sorry for herself.\nGaia had won.\nBubbles, trailing up from the shuttle, collected on the surface of the pond. In the pre-dawn light, the outline of Malik’s craft became visible. How damaged was it? If she could get inside she might be able to power it out of the water. Only fear prevented her from trying, from taking the first step. And her fear was like the planet. It only mattered because she was paying attention to it.\n“Screw this.”\nAt the edge of the pond Allegra took deep breaths, heaving oxygen into her lungs, expanding her chest. That time on CentauriBd it hadn’t been the ocean trying to drown her. It had been Allegra making a series of bad choices that ended with her in a drowning panic. But acknowledging the irrational premise of fear and acting against it were two different things. Allegra was already tired. If she went into the water and failed to access the shuttle’s airlock, how would she fight gravity and exhaustion to reach the surface again?\nStop delaying.\nOne last deep breath. She held it and, clutching the first-aid kit, dove into the pond. The water was shockingly cold. She hadn’t expected that. She sank rapidly. As if on its own volition, her body twisted around and tried for the surface. She wasn’t ready! She couldn’t! Gravity acted like lead sash weights tied to her ankles. The surface trembled beyond her fingertips, and she began to sink back, Gaia dragging her down.\nNo! She twisted around again and began pulling and kicking for the bottom with everything she had. In moments she reached the shuttle. Vision blurry, chest aching, she couldn’t find the hatch. She hauled herself frantically around the vehicle. Air bubbled past her lips, her lungs desperate for replenishment. She started to become disoriented—and there it was.\nThe airlock.\nIt was a standard arrangement, similar to Destiny’s. She tore open the hinged cover, revealing the manual control wheel, and started cranking it. If for some reason the inner hatch was already open, she was about to flood the shuttle and kill Malik, if he wasn’t already dead.\nThe outer hatch began to retract. Trapped air exploded out, churning Allegra away from the shuttle. She fought her way back and cranked the wheel until the gap was wide enough to squeeze through.\nThe inner hatch was still air-tight.\nShe closed the outer hatch and slapped the PURGE button. The water level began to drop, and Allegra thrust her face above the surface, gasping and choking. The shuttle wasn’t a submarine. The chamber was designed to equalize atmospheres, not water pressure. The water level drained only as far as Allegra’s knees. The inner hatch rolled open, allowing the remaining pond water in the chamber to sluice into the main cabin. Malik yelled, “What the hell!” and Allegra dragged herself through the hatchway.\nThe crash impact had ripped the pilot’s seat off its track and pinned Malik against the bulkhead. A knob of bone poked through a tear in the leg of his suit. Allegra grimaced. Malik stared at her through his pain and astonishment. He forced a grim smile.\n“What took you so long, kid? And where’d all the water come from?”\n“I’ll tell you later. Will this thing fly?”\n“Who knows?”\nAllegra took in the flight controls and determined them similar enough to Destiny’s that she believed she could handle the ship. She turned to Malik, unsealed the first-aid kit, and selected a needled opioid tab. “For the pain,” she said and pushed it into his thigh. Malik’s eyes popped wide, then narrowed to dreamy slits.\nNow she would find out. Allegra strapped herself into the second chair, studied the controls, and initiated engine-start. The shuttle trembled, like something coming awake in the cold. Allegra powered up the thrusters. The shuttle jerked out of the mud and rose swiftly. In a moment they were airborne. Allegra banked towards her father’s yurt, her heart aching with anger and regret. Gaia was a fantasy. Allegra would never understand her father, but if she tried, she could at least begin to understand 51 PegesiD.\nThe shuttle’s engines gobbled air in thunderous harmony. Below, creatures like bears with long necks stood up in the grass, craning their heads.\nShe caught only a glimpse.\nIn 2001 Jack Skillingstead submitted a story to Stephen King's \"On Writing\" contest. He won and not long afterward began selling regularly to major science fiction and fantasy markets. To date he has sold more than forty stories to various magazines, Year's Best volumes and original anthologies. In 2003 his story \"Dead Worlds\" was a finalist for the Theodore Sturgeon Award and in 2009 his novel Life on The Preservation was a finalist for the Philip K. Dick Award. Jack lives in Seattle with his wife, writer Nancy Kress.", "source": "https://clarkesworldmagazine.com/skillingstead_09_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Despoilers by Jack Skillingstead"}