{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "56Q6mUL/mu8hxRFHPiqHHvDXHec=", "id": null, "license": null, "comments": "", "raw_text": "Interview  From Bleak to Upbeat in Three Parts: A Conversation with Michael Swanwick  Writing fiction ranging from light fantasy to hard SF, Michael Swanwick has been earning award nominations since his 1980 novelettes landed on Locus lists and Nebula Awards ballots: “The Feast of Saint Janis” and “Ginungagap.” “Mummer Kiss” earned him his first win, an SF Chronicle Award in the Novelette category. Since then he’s received more award recognitions than can reasonably be listed in this column, from an Asimov’s Readers’ Poll win for 2015’s “Lock Up Your Chickens and Daughters—H’ard and Andy are Come to Town!” to the 2008 Locus Award-winning short story “A Small Room in Koboldtown.” Other award-winning stories include “The Edge of the World” (1990 Theodore Sturgeon Memorial Award), “Radio Waves” (1996 World Fantasy Award), “Slow Life” (2003 Hugo Award), and “Legions in Time” (2004 Hugo Award). To date he has published over 150 short stories.  Swanwick is an accomplished novelist, publishing In the Drift (1985), Vacuum Flowers (1987), Nebula-winner Stations of the Tide (1991), Griffin’s Egg (1991), The Iron Dragon’s Daughter (1993), Jack Faust (1997), Bones of the Earth (2002), and The Dragons of Babel and The Iron Dragon’s Mother 2008 and 2019, set in the world of The Iron Dragon’s Daughter. Darger and Surplus books Dancing with Bears, Chasing the Phoenix, and collection The Postutopian Adventures of Darger and Surplus came out with Night Shade in 2011, Tor in 2015, and Subterranean Press in April of 2020, respectively.  He’s well-regarded for nonfiction, such as 2001’s Being Gardner Dozois, his book-length interview with Dozois, which won a Locus Award for nonfiction. Other works include essays “A User’s Guide to the Postmoderns” and “In the Tradition . . . ” which were collected as The Postmodern Archipelago in 1997. He penned biographical works Hope-in-the-Mist (2009) and What Can Be Saved from the Wreckage?: James Branch Cabell in the Twenty-first Century (2007).  Novel City Under the Stars, a follow-up to novella “The City of God” (originally published in Omni Online in 1995), is due from Tor.com publishing in August of 2020, cowritten with award-winning editor, author, and friend to Swanwick, Gardner Dozois, who died May 27, 2018.  Michael Swanwick was born in Schenectady, NY. He received a BA from The College of William & Mary in Williamsburg, VA. He’s been a full-time writer since 1983 and lives in Philadelphia with his wife, Marianne Porter, and their son, Sean.   In your 2009 Locus interview you said, “I worry about the future of books.” You talked about gaming and the Internet, and their impact on the reading habits of your son and his peers. Do you still worry about the future of books? Or have your thoughts on this changed since then?  I still worry. People are spending more time staring at screens than ever before and, to be honest, the intellectual and artistic content of games and television is vastly greater than it was even eleven years ago, never mind when I was a teen.  In the nineteenth century, poetry was important in ways it is now difficult to imagine. Longfellow and Tennyson were world-famous celebrities. Today . . . well, at parties, I sometimes challenge the guests to come up with the names of ten living poets. It gives you an enormous feeling of accomplishment if your group can do it.  I can readily imagine a world in which fiction writers have exactly as much chance of making a living at their craft as poets do today, one in which most of their readers are other writers scouting out the competition—and it’s not that far away.  I’m rooting for me to be wrong on this one.  Your first published story was “The Feast of Saint Janis” in 1980, and you’ve been publishing fairly consistently since, with your more recent titles, The Iron Dragon’s Mother, The Postutopian Adventures of Darger and Surplus, and the upcoming City Under the Stars due in August. Do you feel like your writing—craft, process, or both—has changed in any specific or significant ways over the past decade or two?  I have been writing constantly for forty years and everything I finish gets published. So it’s inevitable that I would learn a few things about my craft along the way.  One thing that’s changed is that my writing has gotten more concise. When I began, it took me twelve thousand words to write a substantive story. Now I can do it in four thousand. Considering that I’m paid by the word, that may not have been very clever of me.  One thing that hasn’t changed is that I can’t finish a story until I figure out what it means—what it wants to be. So one of my stories can take years to finish. On the other hand, I wrote “‘Hello,’ Said the Stick” in less than twenty-four hours because I knew from the start what it was about—and it went on to place on the Hugo ballot that year. It lost, but the story that won was also one of mine, so that was okay.  You deal in different genres, light fantasy to hard SF. Will readers find a consistent voice and style running through your work, especially over the decades?  The story is everything. My job is to make it be the best version of itself possible.  If you look at writing in strictly commercial terms, your best bet is to find one thing and write it over and over. This can have good results—look at Patrick O’Brian’s Aubrey-Maturin books. But that is not how I want to spend my life. My recent stories feature a world existing on a storm cloud, a hotel in the form of a living dragon, and a trickster who’s stolen the universe and hidden it in a cigar box. I’ve written a ghost story in which every word of it, save for the names, is true; one that begins with the protagonist dying and then proceeds backward in time to the beginning of the tale; and one that was written a word at a time on fallen autumn leaves. You can’t do any of that if you’re worried about voice, or consistency, or anything else other than what the story wants to be.  What does it take to stay relevant and sell books/stories and still remain part of the genre conversation?  You have to read the stories being written by your competition—and not just those of your peers who are still getting published, but the young writers as well. If you’re not willing to learn from a twenty-something gender-fluid newcomer with a strange haircut, well, you’re in the wrong business.  It helps to keep up with current science as well.  You were writing for years before you started selling, and then your career started, helped by Gardner Dozois. Did you ever hit a career slump or a writing slump after you started selling, where you struggled to sell work or to produce work? And if so, what did you do to deal with those situations?  I sold my first three stories one after the other—and promptly hit a writer’s block that lasted nine months, during which I wrote voluminously and had to throw away every word of it. During that period, I turned thirty, lost my job, and got married. It was terrifying. But I got around it by writing every day for as many hours of free time as I could find. Eventually, my hindbrain got the message that not giving me anything usable wasn’t going to get it out of sitting in front of a typewriter and the flow of ideas started up again.  Sometimes, when things got rough, I’d ask Gardner what to do. Inevitably, what he said would boil down to “Just keep writing.” Nobody’s ever given better writing advice than that.  Which of your stories stand out in your memory, for you, as some of your finest work, and why?  It’s always the latest one—because all its virtues are freshest in the mind. At this moment, it’s “Artificial People.” I sketched it out on the program during a Lyric Fest concert at the Academy of Vocal Arts, pairing songs on beginnings and endings. The composers had taken poems and turned them to music. Now I was turning music into fiction. Dare I hope that fifty years from now someone will translate my work into an as-yet-un-invented art form?  For novels, the same thing applies. My latest, The Iron Dragon’s Mother, completes a trilogy of stand-alone novels begun twenty-five years before with The Iron Dragon’s Daughter. To maintain a consistent vision of the world—both the invented one of Industrialized Faerie, and our own, which the novels comment on—is a glorious thing. The first volume was written as a fantasy and received by many as an anti-fantasy. The second was, in response, written to turn all the conventions of conventional fantasy on their head and was received as a fantasy. The third was written as a fantasy and received as such. So the three, taken together, serve as an analysis and critique of the genre that—and I hope this is obvious in them—I love dearly.  City Under the Stars follows up on 1995 novella “The City of God.” What are the challenges to completing something begun so long ago, and how do you deal with those challenges?  From the beginning, Gardner and I meant for “The City of God” to be the opening section of a novel. This was important because the very first pages established that we were telling an extremely grim story with no possibility of a happy outcome. But Gardner had a happy, even joyous, ending for the novel and a path that would take us to it.  We planned to write two more novellas, “The City of Angels” and “The City of Men,” then combine all three into a novel. Unfortunately, we were both extremely busy, and it wasn’t until a year or two ago that we found the time to work on it. Consistency of tone wasn’t hard—Gardner had a lush, beautiful prose style, and the novel leaned heavily on that. We got to work and were making good time. We were really tearing up the boards.  Then Gardner died.  There went our plan. There was no way I could write the third novella without Gardner’s ideas, his presence, and above all his prose lines. I could do a passable imitation of him, but that’s all it would have been, an imitation. Readers deserve better than that.  But I wanted the world to see the ending Gardner had in mind. I wanted everyone to know he went out on a high note. So I changed the direction of the second novella, threw out several subplots, and rewrote it so that Hanson, the protagonist, arrived at the ending sooner. Then I combined the two and broke them into chapters so that it was a real novel, rather than two novellas, one after the other.  It’s not the novel we would have written had Gardner lived. But it’s not all that far off from it.  When I read the description—Hanson works ten solid back-breaking hours a day, shoveling endless mountains of coal, within sight of the iridescent wall that separates what’s left of humanity from their gods—I think of Sisyphus, but as allegory to modern-day labor. Are there deliberate sociopolitical commentaries involved—and if so, have those commentaries changed since the first book? Or is this really just about cool visuals and coming up with a character’s personal struggle?  Gardner Dozois came from a blue-collar background and was painfully aware of the degree to which the odds were stacked against him. When he graduated from high school, with no encouragement from his guidance counselor, he applied to exactly one college and, when he was rejected, enlisted in the army because that was his only other option. He knew exactly what kind of life society expected him to have. So, yeah, Hanson is looking at society from the vantage of the underclass.  Gardner was not a political writer. To him, the question of power, of who’s the boss and who’s the victim, was a visceral one. In his notes for the second half of the novel, he wrote, “I think that if Hanson ever was given the ultimate power, as indeed he is given it for a few minutes at the end of the story, the thing that might keep him from being too destructive with it is this horror that he might himself turn into a boss. That’s the last thing he wants to do is to turn into a boss. Because he’s seen that from the other side.” Gardner’s experiences in life did not fill him with admiration of the rich and powerful.  And I have to say I agree with him on this front. Eat the rich!  Gary K. Wolfe, in his Locus review of The Postutopian Adventures of Darger and Surplus, describes the world as “both richer and darker than would seem necessary for the essentially comic capers . . . ”; City Under the Stars presents “a post-utopian hellhole,” and you described the first book as “a very dark story, even for Gardner Dozois.” What is the appeal of dark narratives and worlds? What do stories with these features do for readers and writers?  It’s not that I like darkness, but that a writer has an obligation to tell the truth. The truth is that this can be a hard world at times. I’ve led a charmed life. I have a functional career in a business where that isn’t easy. I’m still in love with the woman I married forty years ago, and we have a son who means the world to us. Yet I’ve also known heartbreak and loss. Terrible things have happened. This is true of most people and maybe all people. Life is not for wusses. There might as well be a sign by the womb exit reading: HEROES ONLY.  We are all descended from thousands of generations of those heroes. That’s why we can respond positively to dark narratives and worlds. We evolved to endure them and even to, sometimes, triumph over them. When we do this vicariously, through fiction, we’re exercising a muscle we might very well need someday.  What is important or special about City Under the Stars? What do you really want readers to know about this book?  Most people know Gardner Dozois solely as a brilliant editor. But he was an even more brilliant writer. His peers, people like Joe Haldeman and George R. R. Martin, were in awe of him. Alas, he found the novel a difficult form and only wrote three of them (two of which were collaborations) in his lifetime. Consequently, that was the accomplishment he esteemed highest. So finishing the one we were working on when he died, giving him one last novel, was an act of fraternal piety for me.  City Under the Stars is a memorial to Gardner and a reminder to the world of what a fine writer was lost when he died.  Also, as I said, it has a happy ending. Gardner could be a very bleak writer indeed, and City Under the Stars contains some of his bleakest writing. But the last thing he was working on was upbeat. He may not have liked bosses much, but he was optimistic about ordinary people. In the long run, he thought maybe they would prevail.  What else are you working on now, and what do you have coming up that you can tell us about?  Stories, stories, stories, and a few essays. I’m currently in the research phase for my next novel and writing lots of short fiction. My short stories should be popping up all over the place for the next year or so. The essays will appear in the usual obscure magazines and journals. I’m also rehabbing an old wooden master plumber’s cabinet and plan to write stories for the back of the door and the insides of the drawers. But that’s just for my own amusement. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nFrom Bleak to Upbeat in Three Parts: A Conversation with Michael Swanwick\nWriting fiction ranging from light fantasy to hard SF, Michael Swanwick has been earning award nominations since his 1980 novelettes landed on Locus lists and Nebula Awards ballots: “The Feast of Saint Janis” and “Ginungagap.” “Mummer Kiss” earned him his first win, an SF Chronicle Award in the Novelette category. Since then he’s received more award recognitions than can reasonably be listed in this column, from an Asimov’s Readers’ Poll win for 2015’s “Lock Up Your Chickens and Daughters—H’ard and Andy are Come to Town!” to the 2008 Locus Award-winning short story “A Small Room in Koboldtown.” Other award-winning stories include “The Edge of the World” (1990 Theodore Sturgeon Memorial Award), “Radio Waves” (1996 World Fantasy Award), “Slow Life” (2003 Hugo Award), and “Legions in Time” (2004 Hugo Award). To date he has published over 150 short stories.\nSwanwick is an accomplished novelist, publishing In the Drift (1985), Vacuum Flowers (1987), Nebula-winner Stations of the Tide (1991), Griffin’s Egg (1991), The Iron Dragon’s Daughter (1993), Jack Faust (1997), Bones of the Earth (2002), and The Dragons of Babel and The Iron Dragon’s Mother 2008 and 2019, set in the world of The Iron Dragon’s Daughter. Darger and Surplus books Dancing with Bears, Chasing the Phoenix, and collection The Postutopian Adventures of Darger and Surplus came out with Night Shade in 2011, Tor in 2015, and Subterranean Press in April of 2020, respectively.\nHe’s well-regarded for nonfiction, such as 2001’s Being Gardner Dozois, his book-length interview with Dozois, which won a Locus Award for nonfiction. Other works include essays “A User’s Guide to the Postmoderns” and “In the Tradition . . . ” which were collected as The Postmodern Archipelago in 1997. He penned biographical works Hope-in-the-Mist (2009) and What Can Be Saved from the Wreckage?: James Branch Cabell in the Twenty-first Century (2007).\nNovel City Under the Stars, a follow-up to novella “The City of God” (originally published in Omni Online in 1995), is due from Tor.com publishing in August of 2020, cowritten with award-winning editor, author, and friend to Swanwick, Gardner Dozois, who died May 27, 2018.\nMichael Swanwick was born in Schenectady, NY. He received a BA from The College of William & Mary in Williamsburg, VA. He’s been a full-time writer since 1983 and lives in Philadelphia with his wife, Marianne Porter, and their son, Sean.\nIn your 2009 Locus interview you said, “I worry about the future of books.” You talked about gaming and the Internet, and their impact on the reading habits of your son and his peers. Do you still worry about the future of books? Or have your thoughts on this changed since then?\nI still worry. People are spending more time staring at screens than ever before and, to be honest, the intellectual and artistic content of games and television is vastly greater than it was even eleven years ago, never mind when I was a teen.\nIn the nineteenth century, poetry was important in ways it is now difficult to imagine. Longfellow and Tennyson were world-famous celebrities. Today . . . well, at parties, I sometimes challenge the guests to come up with the names of ten living poets. It gives you an enormous feeling of accomplishment if your group can do it.\nI can readily imagine a world in which fiction writers have exactly as much chance of making a living at their craft as poets do today, one in which most of their readers are other writers scouting out the competition—and it’s not that far away.\nI’m rooting for me to be wrong on this one.\nYour first published story was “The Feast of Saint Janis” in 1980, and you’ve been publishing fairly consistently since, with your more recent titles, The Iron Dragon’s Mother, The Postutopian Adventures of Darger and Surplus, and the upcoming City Under the Stars due in August. Do you feel like your writing—craft, process, or both—has changed in any specific or significant ways over the past decade or two?\nI have been writing constantly for forty years and everything I finish gets published. So it’s inevitable that I would learn a few things about my craft along the way.\nOne thing that’s changed is that my writing has gotten more concise. When I began, it took me twelve thousand words to write a substantive story. Now I can do it in four thousand. Considering that I’m paid by the word, that may not have been very clever of me.\nOne thing that hasn’t changed is that I can’t finish a story until I figure out what it means—what it wants to be. So one of my stories can take years to finish. On the other hand, I wrote “‘Hello,’ Said the Stick” in less than twenty-four hours because I knew from the start what it was about—and it went on to place on the Hugo ballot that year. It lost, but the story that won was also one of mine, so that was okay.\nYou deal in different genres, light fantasy to hard SF. Will readers find a consistent voice and style running through your work, especially over the decades?\nThe story is everything. My job is to make it be the best version of itself possible.\nIf you look at writing in strictly commercial terms, your best bet is to find one thing and write it over and over. This can have good results—look at Patrick O’Brian’s Aubrey-Maturin books. But that is not how I want to spend my life. My recent stories feature a world existing on a storm cloud, a hotel in the form of a living dragon, and a trickster who’s stolen the universe and hidden it in a cigar box. I’ve written a ghost story in which every word of it, save for the names, is true; one that begins with the protagonist dying and then proceeds backward in time to the beginning of the tale; and one that was written a word at a time on fallen autumn leaves. You can’t do any of that if you’re worried about voice, or consistency, or anything else other than what the story wants to be.\nWhat does it take to stay relevant and sell books/stories and still remain part of the genre conversation?\nYou have to read the stories being written by your competition—and not just those of your peers who are still getting published, but the young writers as well. If you’re not willing to learn from a twenty-something gender-fluid newcomer with a strange haircut, well, you’re in the wrong business.\nIt helps to keep up with current science as well.\nYou were writing for years before you started selling, and then your career started, helped by Gardner Dozois. Did you ever hit a career slump or a writing slump after you started selling, where you struggled to sell work or to produce work? And if so, what did you do to deal with those situations?\nI sold my first three stories one after the other—and promptly hit a writer’s block that lasted nine months, during which I wrote voluminously and had to throw away every word of it. During that period, I turned thirty, lost my job, and got married. It was terrifying. But I got around it by writing every day for as many hours of free time as I could find. Eventually, my hindbrain got the message that not giving me anything usable wasn’t going to get it out of sitting in front of a typewriter and the flow of ideas started up again.\nSometimes, when things got rough, I’d ask Gardner what to do. Inevitably, what he said would boil down to “Just keep writing.” Nobody’s ever given better writing advice than that.\nWhich of your stories stand out in your memory, for you, as some of your finest work, and why?\nIt’s always the latest one—because all its virtues are freshest in the mind. At this moment, it’s “Artificial People.” I sketched it out on the program during a Lyric Fest concert at the Academy of Vocal Arts, pairing songs on beginnings and endings. The composers had taken poems and turned them to music. Now I was turning music into fiction. Dare I hope that fifty years from now someone will translate my work into an as-yet-un-invented art form?\nFor novels, the same thing applies. My latest, The Iron Dragon’s Mother, completes a trilogy of stand-alone novels begun twenty-five years before with The Iron Dragon’s Daughter. To maintain a consistent vision of the world—both the invented one of Industrialized Faerie, and our own, which the novels comment on—is a glorious thing. The first volume was written as a fantasy and received by many as an anti-fantasy. The second was, in response, written to turn all the conventions of conventional fantasy on their head and was received as a fantasy. The third was written as a fantasy and received as such. So the three, taken together, serve as an analysis and critique of the genre that—and I hope this is obvious in them—I love dearly.\nCity Under the Stars follows up on 1995 novella “The City of God.” What are the challenges to completing something begun so long ago, and how do you deal with those challenges?\nFrom the beginning, Gardner and I meant for “The City of God” to be the opening section of a novel. This was important because the very first pages established that we were telling an extremely grim story with no possibility of a happy outcome. But Gardner had a happy, even joyous, ending for the novel and a path that would take us to it.\nWe planned to write two more novellas, “The City of Angels” and “The City of Men,” then combine all three into a novel. Unfortunately, we were both extremely busy, and it wasn’t until a year or two ago that we found the time to work on it. Consistency of tone wasn’t hard—Gardner had a lush, beautiful prose style, and the novel leaned heavily on that. We got to work and were making good time. We were really tearing up the boards.\nThen Gardner died.\nThere went our plan. There was no way I could write the third novella without Gardner’s ideas, his presence, and above all his prose lines. I could do a passable imitation of him, but that’s all it would have been, an imitation. Readers deserve better than that.\nBut I wanted the world to see the ending Gardner had in mind. I wanted everyone to know he went out on a high note. So I changed the direction of the second novella, threw out several subplots, and rewrote it so that Hanson, the protagonist, arrived at the ending sooner. Then I combined the two and broke them into chapters so that it was a real novel, rather than two novellas, one after the other.\nIt’s not the novel we would have written had Gardner lived. But it’s not all that far off from it.\nWhen I read the description—Hanson works ten solid back-breaking hours a day, shoveling endless mountains of coal, within sight of the iridescent wall that separates what’s left of humanity from their gods—I think of Sisyphus, but as allegory to modern-day labor. Are there deliberate sociopolitical commentaries involved—and if so, have those commentaries changed since the first book? Or is this really just about cool visuals and coming up with a character’s personal struggle?\nGardner Dozois came from a blue-collar background and was painfully aware of the degree to which the odds were stacked against him. When he graduated from high school, with no encouragement from his guidance counselor, he applied to exactly one college and, when he was rejected, enlisted in the army because that was his only other option. He knew exactly what kind of life society expected him to have. So, yeah, Hanson is looking at society from the vantage of the underclass.\nGardner was not a political writer. To him, the question of power, of who’s the boss and who’s the victim, was a visceral one. In his notes for the second half of the novel, he wrote, “I think that if Hanson ever was given the ultimate power, as indeed he is given it for a few minutes at the end of the story, the thing that might keep him from being too destructive with it is this horror that he might himself turn into a boss. That’s the last thing he wants to do is to turn into a boss. Because he’s seen that from the other side.” Gardner’s experiences in life did not fill him with admiration of the rich and powerful.\nAnd I have to say I agree with him on this front. Eat the rich!\nGary K. Wolfe, in his Locus review of The Postutopian Adventures of Darger and Surplus, describes the world as “both richer and darker than would seem necessary for the essentially comic capers . . . ”; City Under the Stars presents “a post-utopian hellhole,” and you described the first book as “a very dark story, even for Gardner Dozois.” What is the appeal of dark narratives and worlds? What do stories with these features do for readers and writers?\nIt’s not that I like darkness, but that a writer has an obligation to tell the truth. The truth is that this can be a hard world at times. I’ve led a charmed life. I have a functional career in a business where that isn’t easy. I’m still in love with the woman I married forty years ago, and we have a son who means the world to us. Yet I’ve also known heartbreak and loss. Terrible things have happened. This is true of most people and maybe all people. Life is not for wusses. There might as well be a sign by the womb exit reading: HEROES ONLY.\nWe are all descended from thousands of generations of those heroes. That’s why we can respond positively to dark narratives and worlds. We evolved to endure them and even to, sometimes, triumph over them. When we do this vicariously, through fiction, we’re exercising a muscle we might very well need someday.\nWhat is important or special about City Under the Stars? What do you really want readers to know about this book?\nMost people know Gardner Dozois solely as a brilliant editor. But he was an even more brilliant writer. His peers, people like Joe Haldeman and George R. R. Martin, were in awe of him. Alas, he found the novel a difficult form and only wrote three of them (two of which were collaborations) in his lifetime. Consequently, that was the accomplishment he esteemed highest. So finishing the one we were working on when he died, giving him one last novel, was an act of fraternal piety for me.\nCity Under the Stars is a memorial to Gardner and a reminder to the world of what a fine writer was lost when he died.\nAlso, as I said, it has a happy ending. Gardner could be a very bleak writer indeed, and City Under the Stars contains some of his bleakest writing. But the last thing he was working on was upbeat. He may not have liked bosses much, but he was optimistic about ordinary people. In the long run, he thought maybe they would prevail.\nWhat else are you working on now, and what do you have coming up that you can tell us about?\nStories, stories, stories, and a few essays. I’m currently in the research phase for my next novel and writing lots of short fiction. My short stories should be popping up all over the place for the next year or so. The essays will appear in the usual obscure magazines and journals. I’m also rehabbing an old wooden master plumber’s cabinet and plan to write stories for the back of the door and the insides of the drawers. But that’s just for my own amusement.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/swanwick_interview_2020/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: From Bleak to Upbeat in Three Parts: A Conversation with Michael Swanwick by Arley Sorg"}