{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "iQCDfZa3gt8Xs1Xgnm43KdXUrRU=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Assassinating the Reader: A Conversation with Yoon Ha Lee  Yoon Ha Lee’s collection Conservation of Shadows contains sixteen stories, but seems far faster in the reading. Lee’s many worlds seem to multiply exponentially with each paragraph, and each turned page.  There are soldiers and scientists, space travel and dragons, leather-bound books, locked doors, and genocidal rampages. Each tale strains at the edges of possibility. No two of Lee’s stories are alike, except for a similar pulse powering each word, each juxtaposition, each startling turn of events.  “It is not true that the dead cannot be folded,” Lee writes in the opening paragraph of “Ghostweight.” “Square becomes kite becomes swan; history becomes rumor becomes song. Even the act of remembrance creases the truth.”  There is immense beauty in Yoon Ha Lee’s prose—beauty enough to “assassinate” the reader, as she discusses below.  “They are connoisseurs of writing in Imulai Mokarengen, the city whose name means inkblot of the gods.”  Lee has a connoisseur’s reserve in terms of her online presence, but also a connoisseur’s obsessive energy. She seems to turn each story in her hands for our delectation, angling it this way and that, offering us access in three dimensions. Though she has been publishing since the 90s, her stories have been more like intense lasers than sky-arcing spotlights.  Below, Lee and I talk about style, stories, and the occasional assassination of a reader or two.   How would you describe your style?  I try to do two things with my style. The first is to pay attention to how the words sound together. When I read (silently), I hear everything in my head, almost as though I were reading it out loud. A story for me is all about sound and emotion. I don’t get the movies-in-your-head that some readers report, though I wish I did; I can’t visualize at all. So I have to work with the dimensions I have access to.  The other thing is to juxtapose odd images. I’m afraid I can’t claim any artistry here. The truth is that I get bored easily, so I’m entertaining myself. This one can get out of hand, and I have to be careful how I use it. I dialed it up in “Effigy Nights,” which has an ornate over-the-top space fantasy setting; ditto “Conservation of Shadows,” where I wanted the focus to be on style and to evoke an almost poem-like feel because some of the inspiration was from “The Descent of Inanna.” For other stories, too much of this sort of thing only distracts the reader from the action. It’s a juggling act.  Up until early high school, the people I wanted to write like, style-wise, were Simon R. Green (still one of my favorite authors) and Piers Anthony. I haven’t read Anthony in a long time, although I remember him fondly, but both of them had clear, vigorous prose where I could follow what was going on very easily, and that’s a trait I still admire. In high school, however, I encountered a Patricia McKillip that I didn’t bounce off of (I tried the Riddle-Master books earlier and couldn’t get into them), and Roger Zelazny. It had never occurred to me before McKillip and Zelazny that writing could be beautiful for its own sake. I wanted in, so I started practicing writing in that direction.  How does a short story work on the reader? What should a short story do?  I’m going to preface this by saying that not all short stories are the same, I conveniently failed to major in English or literature and find literary theory confusing, and I’m going to talk about how I do it, not how anyone else does or should do it.  The whole point of a short story is to assassinate the reader. You don’t have the time or the space to go to war or do large maneuvers, you can’t do chapters of elaborate setup, there’s much less room for character development—a good writer can get more character development in, but that isn’t my particular strength. Anyway, everything in the short story has to drive toward a short sharp point, whatever it is you’re trying to leave the reader with at the end of the story.  I say “assassinate” and it sounds hostile, because it is. I work better when I can think in terms of opponents. The thing is that I don’t want the reader to see the short sharp point clearly from the beginning, but I want it to make sense afterward as the angle of attack. Tactical sense, I guess, in the context of the story’s setup.  Most of the time I write didactically, as if a short story were a proof. There is some object lesson, or ethical question, I want to leave the reader with. ”Ghostweight” is a good example of this; it doesn’t pretend not to be didactic. So when I build the character and their strengths and weaknesses and motivations, when I build the setting, the majority of it needs to be in support of that point. With a proof, you want to include all the necessary axioms and arguments, but leave out the extraneous. A short story is very similar. I am not sure my math professors would approve of the use I am making of my college education, but there it is.  Where does a short story begin for you—character, setting, idea, somewhere else all together?  Usually ideas or technical challenges. I see something ridiculous, or a combination of things that looks hard to do, and I want to do it. I’m attracted to challenges. I hear all the time that you shouldn’t write in second person, and I just laugh. My first sale, “The Hundredth Question,” was in second person. I’ve written in first person plural just for the hell of it (“Unstringing the Bow”). ”A Vector Alphabet of Interstellar Travel” doesn’t have characters, only civilizations, which was inspired by Italo Calvino’s Invisible Cities. To be fair, there are a lot of stupid ideas out there, I generate my fair share of them, but there is no idea so stupid that a dedicated person can’t make it work. You’ll never know if you’re that particular dedicated person unless you try.  “Iseul’s Lexicon” started because I wanted to write about “tactical linguistics” and then had to make up a magic system that made the phrase meaningful. ”Effigy Nights” started with an image of a paper girl being cut out and brought to life, with a side of using your stories to fight for your freedom in a very literal way. Sometimes the idea starts as a very vague image, and sometimes it’s something specific; with “The Battle of Candle Arc” I wanted to write space opera tactics and steal them off a famous Korean naval battle, the Battle of Myeongnyang. It all depends.  Is there a story or stories in Conservation of Shadows that you consider a turning point or landmark story in your career?  I don’t think of my stories in those terms. Some are better than others, that’s the nature of life, and each one has something that I’d fix if I had it to do over now. Thankfully, no one is making me rewrite the lot; it’s better just to take them one at a time, learn what there is to learn, and move forward.  Unless you mean the first story where I allowed myself to use the F-word, in which case that’s “The Battle of Candle Arc.” This is not quite as stupid as it sounds! I was a teenager when I got my first story acceptance, and moreover I’d gone to a Christian high school, so the idea of using, er, adult profanities took a while.  Given the level of intensity in your stories, are you able to work on more than one at a time?  I’ve usually had some novel draft going at the same time as a short story, but I hate it. I vastly prefer to be working on one piece of fiction at a time because switching over fries my brain, especially when the stories are very different.  I’ve worked on up to three separate things at once and it usually makes me cry; I used to write tie-in game fiction for Alderac Entertainment Group’s Legend of the Five Rings, and one of the reasons I eventually left was the stress of the additional story-writing.  Can you talk a little bit about where some of your characters come from? What goes into the character creation process?  The hard part about character creation is that what I see on my end is very different from what I want the reader to get on their end. To me, a character is just a marionette. Especially for a short story, I just don’t get attached to them. In general, I have some basic plot or conflict, and then I need the character to have certain traits to drive them through the story, so I build the character and, if applicable, culture/setting to facilitate that. I know I have confused beta readers in the past because I will change everything from appearance to gender if I decide it suits the story better. (This leads to odd gendered pronoun changes in some of my drafts when I fail to catch them all in revisions.)  That all sounds dreadfully abstract, so let’s take an example, Lisse from “Ghostweight.” She’s the protagonist, and this is a longer short story (at 8,000 words it might be technically something else, but who’s counting), so I have a better chance of retaining the reader if she’s at least sympathetic. I am personally happy to write horrible people, I frequently find it entertaining, but in this case I really did want the reader to care a little about Lisse. The end goal is for her to go on a genocidal rampage against the Imperium in revenge for her people’s own genocide with the aid and encouragement of a ghost, only to discover that the ghost was partly responsible for the deaths of her people. She starts out deeply outnumbered since people like to root for underdogs and hell, this is a short, I don’t have space for more characters. Some of the setup is already there in the endgame; having your own people almost wiped out is a strong motivation for someone to want to get revenge. She’s emotionally dependent on the ghost because it sort of raised her (in its ghostly way), which makes it more believable that she’s completely blindsided by the possibility that the ghost has its own agenda. By story’s end she’s responsible for an awful lot of deaths, and I could have made her completely monstrous, but she can still recognize what she’s done if someone reframes the scenario for her. It’s the fact that she remains capable of moral awareness that makes her maybe a little sympathetic even at the very end.  What are some of the challenging parts of short fiction writing for you? And what comes more easily?  I can’t write short fiction with any great frequency, although I wish I could. But it’s not all bad. Once I have the idea and a basic outline, I can turn out the words. I have bipolar disorder and one of the few useful things that has come out of it is that I now know dead certain that I can be depressed out of my mind and still turn out 250 words a day, or better, five days of the week. 250 words a day is not huge, but it is a hell of a lot better than 0; that’s just basic math. Moreover, I have learned that if I set the goal low I will usually overshoot because I start wanting to write extra.  I also struggle with this thing where you have to write stories that are comprehensible. I have this ridiculous irrational fear of writing stories that are too obvious. It’s quite rare that someone says to me, “Yoon, everything in that story was too easy to understand”! Whereas people will tell me that I have obfuscated too much. I need to get over my reluctance to explain things.  On the plus side, I am much better at finishing stories than I used to be. Back in high school and college, I’d just start writing an opening and stall out because I had no idea where I was going. These days I am smarter about how my brain works. I don’t even commit to a story unless I know how it begins, how it ends, and have a rough idea of the plot in between. For me, knowing how the story ends is especially critical. Once I have that I can usually figure out the other stuff.  Paragraph by paragraph, sentence by sentence, word by word, there’s so much beauty in your prose. How much editing do you do and what sort of editing—cutting, adding, small tweaks, major over-hauls?  Oh, all of the above! Everything’s fair game. Sometimes I write a rough and I’m sure it’s pretty clean, but if I have doubts I send for beta readers. I am grateful to all of mine. God knows I need them. My rough drafts are hilarious: enormous plot holes, characters dropping out, awkward phraseology, too much assonance, you name it. But that’s fine. I like editing, because it means I’m done with the damn rough and I can stop thinking about generating raw words and start thinking about making existing words work.  What’s next for you?  I have been revising a space opera novel, because the desire of my heart is to write big space battles. Or even little space battles, I’m not picky. I have a female captain who’s been ordered to capture an impregnable space fortress and who is being advised by a four-hundred-year-old undead tactician who’s out to get her, you know how that goes. I have no idea whether this will work out, but there’s only one way to find out. Wish me luck!  Any parting words?  I have a daughter, and one of the things I never thought about when I started writing is what I would do about this situation, which is when my daughter comes up to me and wants to read what I’m working on. She’s young enough that most of my stories are not appropriate for her. I have had to say, “This story is not for little children!” a lot of times! Of course, by the time she’s old enough, she’ll just find having a writer parent embarrassing. Anyway, it amuses me. Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nAssassinating the Reader: A Conversation with Yoon Ha Lee\nYoon Ha Lee’s collection Conservation of Shadows contains sixteen stories, but seems far faster in the reading. Lee’s many worlds seem to multiply exponentially with each paragraph, and each turned page.\nThere are soldiers and scientists, space travel and dragons, leather-bound books, locked doors, and genocidal rampages. Each tale strains at the edges of possibility. No two of Lee’s stories are alike, except for a similar pulse powering each word, each juxtaposition, each startling turn of events.\n“It is not true that the dead cannot be folded,” Lee writes in the opening paragraph of “Ghostweight.” “Square becomes kite becomes swan; history becomes rumor becomes song. Even the act of remembrance creases the truth.”\nThere is immense beauty in Yoon Ha Lee’s prose—beauty enough to “assassinate” the reader, as she discusses below.\n“They are connoisseurs of writing in Imulai Mokarengen, the city whose name means inkblot of the gods.”\nLee has a connoisseur’s reserve in terms of her online presence, but also a connoisseur’s obsessive energy. She seems to turn each story in her hands for our delectation, angling it this way and that, offering us access in three dimensions. Though she has been publishing since the 90s, her stories have been more like intense lasers than sky-arcing spotlights.\nBelow, Lee and I talk about style, stories, and the occasional assassination of a reader or two.\nHow would you describe your style?\nI try to do two things with my style. The first is to pay attention to how the words sound together. When I read (silently), I hear everything in my head, almost as though I were reading it out loud. A story for me is all about sound and emotion. I don’t get the movies-in-your-head that some readers report, though I wish I did; I can’t visualize at all. So I have to work with the dimensions I have access to.\nThe other thing is to juxtapose odd images. I’m afraid I can’t claim any artistry here. The truth is that I get bored easily, so I’m entertaining myself. This one can get out of hand, and I have to be careful how I use it. I dialed it up in “Effigy Nights,” which has an ornate over-the-top space fantasy setting; ditto “Conservation of Shadows,” where I wanted the focus to be on style and to evoke an almost poem-like feel because some of the inspiration was from “The Descent of Inanna.” For other stories, too much of this sort of thing only distracts the reader from the action. It’s a juggling act.\nUp until early high school, the people I wanted to write like, style-wise, were Simon R. Green (still one of my favorite authors) and Piers Anthony. I haven’t read Anthony in a long time, although I remember him fondly, but both of them had clear, vigorous prose where I could follow what was going on very easily, and that’s a trait I still admire. In high school, however, I encountered a Patricia McKillip that I didn’t bounce off of (I tried the Riddle-Master books earlier and couldn’t get into them), and Roger Zelazny. It had never occurred to me before McKillip and Zelazny that writing could be beautiful for its own sake. I wanted in, so I started practicing writing in that direction.\nHow does a short story work on the reader? What should a short story do?\nI’m going to preface this by saying that not all short stories are the same, I conveniently failed to major in English or literature and find literary theory confusing, and I’m going to talk about how I do it, not how anyone else does or should do it.\nThe whole point of a short story is to assassinate the reader. You don’t have the time or the space to go to war or do large maneuvers, you can’t do chapters of elaborate setup, there’s much less room for character development—a good writer can get more character development in, but that isn’t my particular strength. Anyway, everything in the short story has to drive toward a short sharp point, whatever it is you’re trying to leave the reader with at the end of the story.\nI say “assassinate” and it sounds hostile, because it is. I work better when I can think in terms of opponents. The thing is that I don’t want the reader to see the short sharp point clearly from the beginning, but I want it to make sense afterward as the angle of attack. Tactical sense, I guess, in the context of the story’s setup.\nMost of the time I write didactically, as if a short story were a proof. There is some object lesson, or ethical question, I want to leave the reader with. ”Ghostweight” is a good example of this; it doesn’t pretend not to be didactic. So when I build the character and their strengths and weaknesses and motivations, when I build the setting, the majority of it needs to be in support of that point. With a proof, you want to include all the necessary axioms and arguments, but leave out the extraneous. A short story is very similar. I am not sure my math professors would approve of the use I am making of my college education, but there it is.\nWhere does a short story begin for you—character, setting, idea, somewhere else all together?\nUsually ideas or technical challenges. I see something ridiculous, or a combination of things that looks hard to do, and I want to do it. I’m attracted to challenges. I hear all the time that you shouldn’t write in second person, and I just laugh. My first sale, “The Hundredth Question,” was in second person. I’ve written in first person plural just for the hell of it (“Unstringing the Bow”). ”A Vector Alphabet of Interstellar Travel” doesn’t have characters, only civilizations, which was inspired by Italo Calvino’s Invisible Cities. To be fair, there are a lot of stupid ideas out there, I generate my fair share of them, but there is no idea so stupid that a dedicated person can’t make it work. You’ll never know if you’re that particular dedicated person unless you try.\n“Iseul’s Lexicon” started because I wanted to write about “tactical linguistics” and then had to make up a magic system that made the phrase meaningful. ”Effigy Nights” started with an image of a paper girl being cut out and brought to life, with a side of using your stories to fight for your freedom in a very literal way. Sometimes the idea starts as a very vague image, and sometimes it’s something specific; with “The Battle of Candle Arc” I wanted to write space opera tactics and steal them off a famous Korean naval battle, the Battle of Myeongnyang. It all depends.\nIs there a story or stories in Conservation of Shadows that you consider a turning point or landmark story in your career?\nI don’t think of my stories in those terms. Some are better than others, that’s the nature of life, and each one has something that I’d fix if I had it to do over now. Thankfully, no one is making me rewrite the lot; it’s better just to take them one at a time, learn what there is to learn, and move forward.\nUnless you mean the first story where I allowed myself to use the F-word, in which case that’s “The Battle of Candle Arc.” This is not quite as stupid as it sounds! I was a teenager when I got my first story acceptance, and moreover I’d gone to a Christian high school, so the idea of using, er, adult profanities took a while.\nGiven the level of intensity in your stories, are you able to work on more than one at a time?\nI’ve usually had some novel draft going at the same time as a short story, but I hate it. I vastly prefer to be working on one piece of fiction at a time because switching over fries my brain, especially when the stories are very different.\nI’ve worked on up to three separate things at once and it usually makes me cry; I used to write tie-in game fiction for Alderac Entertainment Group’s Legend of the Five Rings, and one of the reasons I eventually left was the stress of the additional story-writing.\nCan you talk a little bit about where some of your characters come from? What goes into the character creation process?\nThe hard part about character creation is that what I see on my end is very different from what I want the reader to get on their end. To me, a character is just a marionette. Especially for a short story, I just don’t get attached to them. In general, I have some basic plot or conflict, and then I need the character to have certain traits to drive them through the story, so I build the character and, if applicable, culture/setting to facilitate that. I know I have confused beta readers in the past because I will change everything from appearance to gender if I decide it suits the story better. (This leads to odd gendered pronoun changes in some of my drafts when I fail to catch them all in revisions.)\nThat all sounds dreadfully abstract, so let’s take an example, Lisse from “Ghostweight.” She’s the protagonist, and this is a longer short story (at 8,000 words it might be technically something else, but who’s counting), so I have a better chance of retaining the reader if she’s at least sympathetic. I am personally happy to write horrible people, I frequently find it entertaining, but in this case I really did want the reader to care a little about Lisse. The end goal is for her to go on a genocidal rampage against the Imperium in revenge for her people’s own genocide with the aid and encouragement of a ghost, only to discover that the ghost was partly responsible for the deaths of her people. She starts out deeply outnumbered since people like to root for underdogs and hell, this is a short, I don’t have space for more characters. Some of the setup is already there in the endgame; having your own people almost wiped out is a strong motivation for someone to want to get revenge. She’s emotionally dependent on the ghost because it sort of raised her (in its ghostly way), which makes it more believable that she’s completely blindsided by the possibility that the ghost has its own agenda. By story’s end she’s responsible for an awful lot of deaths, and I could have made her completely monstrous, but she can still recognize what she’s done if someone reframes the scenario for her. It’s the fact that she remains capable of moral awareness that makes her maybe a little sympathetic even at the very end.\nWhat are some of the challenging parts of short fiction writing for you? And what comes more easily?\nI can’t write short fiction with any great frequency, although I wish I could. But it’s not all bad. Once I have the idea and a basic outline, I can turn out the words. I have bipolar disorder and one of the few useful things that has come out of it is that I now know dead certain that I can be depressed out of my mind and still turn out 250 words a day, or better, five days of the week. 250 words a day is not huge, but it is a hell of a lot better than 0; that’s just basic math. Moreover, I have learned that if I set the goal low I will usually overshoot because I start wanting to write extra.\nI also struggle with this thing where you have to write stories that are comprehensible. I have this ridiculous irrational fear of writing stories that are too obvious. It’s quite rare that someone says to me, “Yoon, everything in that story was too easy to understand”! Whereas people will tell me that I have obfuscated too much. I need to get over my reluctance to explain things.\nOn the plus side, I am much better at finishing stories than I used to be. Back in high school and college, I’d just start writing an opening and stall out because I had no idea where I was going. These days I am smarter about how my brain works. I don’t even commit to a story unless I know how it begins, how it ends, and have a rough idea of the plot in between. For me, knowing how the story ends is especially critical. Once I have that I can usually figure out the other stuff.\nParagraph by paragraph, sentence by sentence, word by word, there’s so much beauty in your prose. How much editing do you do and what sort of editing—cutting, adding, small tweaks, major over-hauls?\nOh, all of the above! Everything’s fair game. Sometimes I write a rough and I’m sure it’s pretty clean, but if I have doubts I send for beta readers. I am grateful to all of mine. God knows I need them. My rough drafts are hilarious: enormous plot holes, characters dropping out, awkward phraseology, too much assonance, you name it. But that’s fine. I like editing, because it means I’m done with the damn rough and I can stop thinking about generating raw words and start thinking about making existing words work.\nWhat’s next for you?\nI have been revising a space opera novel, because the desire of my heart is to write big space battles. Or even little space battles, I’m not picky. I have a female captain who’s been ordered to capture an impregnable space fortress and who is being advised by a four-hundred-year-old undead tactician who’s out to get her, you know how that goes. I have no idea whether this will work out, but there’s only one way to find out. Wish me luck!\nAny parting words?\nI have a daughter, and one of the things I never thought about when I started writing is what I would do about this situation, which is when my daughter comes up to me and wants to read what I’m working on. She’s young enough that most of my stories are not appropriate for her. I have had to say, “This story is not for little children!” a lot of times! Of course, by the time she’s old enough, she’ll just find having a writer parent embarrassing. Anyway, it amuses me.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/lee_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Assassinating the Reader: A Conversation with Yoon Ha Lee by Jeremy L. C. Jones"}