{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Sally Gwylan", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6jya8sUQXAfqRuOoD/PbpD5DIzA=", "id": null, "license": null, "comments": "", "raw_text": "9180 words, novelette  Fleeing Oslyge  When I wake this time, I smell that dawn is close. I remember the scent of it from childhood, sweet and brisk and metallic like new grasses crushed together with aniseed. Dawn smells better than the inside of this dead soldier’s sleepbag, yet I’d choose to bury my nose and aching belly and aching mind until full light if I dared.  But Pir would come and drag me out, and take angry pleasure in it. I do my best to avoid his attentions.  I wriggle out of the bag, my clothes twisted and clammy, and shiver when the air takes my warmth. The sore on my neck chafes where my sweater rubs. I pull up the neckband of my city woman’s blouse—filthy, but softer than wool—to ease it. Around us the night mist still drifts. Young Koben seems on watch in a sea of unshaped ghosts.  Better this miserable dawning than the daylight apparitions of Oslyge, nightmares with booming voices that prowled the city’s streets: vargar and snake-armed women out of old tales; immense children-of-Fion, the skittering, many-legged crawlers a thousand times natural size. All of them shadowless, yet seeming flesh-solid in the afternoon sun, though a rock someone—not I—dared to throw touched nothing until it clattered on the paving stones.  We ran from them in terror; I ran, knowing they couldn’t be real. I ran until the fear-stinking press of bodies shoved me aside into a gap between buildings, where I hid. Later the guards in their padded armor came to round up us strays. The dead and maimed lay on the worn stones, victims of the panic. I stepped around them, over them, not permitted to stop. The cries, the growing stench assured me these were not illusion.  Better the cold mist and these days of hunger and endless walking than trying to hide in broken Oslyge. Better this than letting myself be taken to the camps the Tysthänder, the Peace Hands, claim are for our safety. Our safety in this time of transition; that’s what their bulletins said. No one is sure whether the invaders—“project administrators” as they call themselves—are of human stock, as we are, or are alien.  Their guards are human enough.  My mouth tastes foul. I will never get rid of that taste.  Hands shaking, I build a tiny fire under the curved shield of reeds and marsh mud that Arvål—thin-faced, clever—rigged to distribute the heat signature over a larger area. Our bodies put off heat too, of course. The Tysthand orbiters could track us by that, Gunter says, but then they’d have to look at every large animal, the elk and snava deer and the clumsy, barrel-plump danskgris the centuries have adapted for life in the willow marshes.  The mist hides the smoke, gray in gray. I steep the resinous buds of bog-tea until the liquid is strong and green, and my hands at least get warm. Gunter, the kapten, watches me from his sleepbag like the supervisor from Odven Mill did when I first started work there, a cold, assessing stare. Gunter’s older than the others, with lines in his face that don’t show in this light. I think he fears I’ll slow them or give them away. I’m afraid of his power over me, though he’s offered me no harm.  I take a mug of tea to Koben. The shy boy grunts his thanks and wraps his knobby, fine-skinned hands around the insulated cup. He’s no older than my youngest brother, too young to be a soldier. I have another cup poured for Gunter but find he has withdrawn into his bag again.  I try to make myself as useful as I can.  When I turn back to the fire, Pir is there, squatting close to its heat. He’s a strong young man with broad cheekbones; no older than I. His eyes are flat as he studies me.  I take a careful sip from the cup I hold, and go to roll up my sleepbag. My hands are shaking again. That makes me angry but not enough to go back over to the fire.  “You shouldn’t let him intimidate you, Senne,” Arvål says, his voice rough still from sleep. His head pokes out from the straw-yellow folds of the bag next to mine. The dark, gold-set stone in his earlobe reflects firelight as he moves.  I concentrate on rolling the bag into a tight bundle. “I know,” I say. I know, but I can’t seem to help cringing from the man. With careful attention I strap the bag in its place on the pack I carry.  The sleepbag, the pack, the sharp knife at my belt, the boots and trousers I wear, and the soft field cap that keeps my long hair out of my eyes all came from a dead soldier on the outskirts of Oslyge. I’d picked up his rifle as well, but Gunter took the ammunition out and bent the barrel between two boulders. He said I didn’t know how to use it, which is true.  Firing a gun is a good way to attract Tysthand attention anyway, so none of the men have dared use theirs since I met up with them. Which means no hunting, except for Pir’s snares, and they’ve caught nothing. The year’s long fall isn’t a season for snares. We should have bows, like most country people do. Bows are easier to make than rifles, and silent. I used to be good with a bow.  The sweater I wear was always mine, the gift of a lover. It used to be blue and white.  I gulp down the rest of the bog-tea, lukewarm now and very bitter, then go rinse my face at the small lake’s edge. The cold water dripping from my hands gives back a muffled plink. The light is growing. I can see the thick, pale shoots of nickelvass at the lake’s edge, extending a long way into the mist. I hear a distant splashing, and a gray elk ghosts into view, rippling the rusty surface of the water.  If I had a bow, I would wait until it left the water, and shoot it. I turn back to camp, ready to go.  In the afternoon we find the homestead. We stop on a hilltop overlooking the small cluster of buildings: a stone house surrounded by a few rough sheds and windbreaks of poplar and feathery native skjovan. Skjovan is scrubby but long-lived. All other trees on NyHem are descended from stock our ancestors brought with them seven hundred years ago, though changed, as everything non-native must change to survive the metal-rich soil.  Pir throws himself down next to me and sends a hard glance my way, as though it’s me he wants to fling himself on.  My anger is in my mind only, cold and without strength. I find myself trembling. Light-headed, I slip back down the hill the way we came, finding a boulder to squat behind, as though I need to relieve myself. When I come back I choose a spot as far from Pir as I can get.  Gunter holds us back for a long, careful hour, watching the homestead from our hilltop. The road’s too close to suit him, and anyway, the Tysthänder will have mapped every dwelling from their orbiters. But we need food. We tried boiling grass and it made us ill. We’re not as adapted as the elk and danskgris.  Nothing moves below but wind in the trees and the building’s shadow as minutes pass; the house is no illusion. The people who lived there have fled or been picked up. The Tysthänder offer refuge for everyone and amnesty for our soldiers, an offer they allow no one to refuse. This region of marsh and rocky hills has always been sparsely settled, but now there are no people at all, except us and other fleeing soldiers.  Gunter says there’s a hidden base some two days walk further west. He says the survivors from Oslyge will be heading there; he doesn’t mean civilians like me, but soldiers. I’d go home to the village I was born in, but I’m afraid to see it, afraid it would be one more trap. Afraid to travel alone. I don’t know what I will do at this base of Gunter’s; brew tea perhaps.  Still nothing moves, and Gunter sends Arvål and Koben down to reconnoiter.  I don’t think Gunter likes Arvål much. Pir fought in Gunter’s company before Oslyge and is devoted to his kapten. Koben and Arvål are both from other companies, but who could object to quiet Koben? Arvål is also the only one strong and smart enough to challenge Gunter’s leadership, though he seems careful not to.  Probably I am not understanding how the army works.  Of the four soldiers, I feel easiest with Arvål. He’s tall and white-haired and thin-faced like my next oldest brother, with an earring similar to Isak’s. Arvål has told Pir twice to leave me alone, though that may mean nothing.  I lie on my belly in the coarse autumn grasses, rubbing the swollen place on my neck, waiting. I stink. All of us stink. Looking down the hill I think with longing of a pantry full of food, but also of the sauna the homestead below us will have.  Preparing a sauna takes a lot of time, more than we can spare. I know this. I’ll settle for the food.  Koben and Arvål disappear from sight as they circle the house, one to either side. After a few minutes Arvål waves his rifle from the shadow of the doorway: all clear. Gunter leads us sprinting down the hill, like dogs, he says. A dog pack might well approach an empty homestead. Once we’re beneath it the slabbed stone roof, baking in the sun, will hide our heat signatures, which aren’t very strong on a warm afternoon anyway.  There’s food in the pantry of the neat, thick-walled house, potatoes, black-skinned onions, and dried beans in bins, and shelves of gleaming canned produce. And dried läder peaches, a whole winter’s store of them sealed in a paper-lined clay crock. Pir finds them. I look up at his cry of excitement, and see his eyes transformed. The four of us, Gunter, Pir, Arvål, and I, jostle like children to grab handfuls of them, the tension of hiding momentarily forgotten. The mingled food scents are intoxicating. I don’t worry that Pir is close.  Koben comes in from the back, the west side we couldn’t see from our hilltop. He radiates warmth in the dim, cool pantry. His grimy field tunic is pulled out and up to make a carry-sling, the way a farm wife uses her apron. Inside it are heaped tomatoes, yellow-striped gurkor and handfuls of downy peapods. In one hand he holds a half-eaten tomato. Juice runs down his downy chin. “Look!” he calls out to us.  Gunter, massive but quick as a cat in his movements, turns and sees the boy. I watch as something very like despair flashes across his face. “Spit it out!” he orders.  Koben freezes, baffled. After a second, he spits, but there’s no red pulp. His light eyes are full of fear and questions.  “They sprayed the gardens,” Gunter says, crossing the flagstone floor. “Didn’t your kapten warn you?! They sprayed them all.” He hustles the boy over to an empty bin and dumps the produce in. Some of the tomatoes split when they land. They smell heady, like summer and fermenting wine.  Gunter pushes Koben down on his knees and crams a finger down his throat. The boy gags. Something freezes up inside my mind. I can’t watch this. I find the taste and smell of the turncoat Tysthand guard fouling my mouth once more, and my throat closes. I turn away and stumble out of the room, trying to breathe and not breathe at the same time.  The big kitchen is no refuge; I can still hear Koben gagging. A vase of wilted blue flax sits on the wickerwork table. It catches my eye but isn’t enough to hold me. Across the room I see the door to the laundry shed, half open, and, desperate to think of anything but the sound behind me, I remember what my aunt did the morning her youngest drank disinfectant paint.  On a shelf above the deep laundry sink I find this family’s supplies, bottles and cartons and a wide-mouthed jar of white pellets. I snatch this down and hurry back to the pantry, twisting off the lid as I go.  Koben’s still retching, but to little effect. Gunter bends over him, cursing. Pir still has one forgotten hand in the peach crock, but his other hand, like his face, is knotted with apprehension. Arvål leans back against a bin, pale beneath his tan. Frightened, I think. He is, oddly, watching me.  I yank on Gunter’s sleeve. “Here!” I say. “Back of the throat, as far down as you can get them.” I dump a small pile of the pellets into Gunter’s big hand. He forces poor Koben’s mouth open again.  The sal soda works well enough. Koben has nothing left in his stomach but bile when he’s done. I don’t know what they spray the gardens with. I don’t know if we acted fast enough to protect him.  Gunter drives us to fill our packs with food then. Koben just sits on the floor with his arms wrapped around his head while we load up with all we can carry—flatbröd, the one rope of dry sausage, cracked grains, and other things. We take a few of the heavy jars for tonight. Although my appetite’s gone I stuff pockets and empty corners with the tough little peaches. If they aren’t safe, it won’t matter. I’ve already eaten several.  We search for bows. The only one we find is snapped in half, but Arvål puts the bowstring in his pocket. Gunter stops me from washing my hands and face at the sink when I pass it. He says just touching this water could make me very sick. I wonder what the Tysthänder plan is: Do they intend people to go home? How will the people live if their water’s undrinkable?  Tonight we’re still among the upland hills, and there is no mist. This means no fire and no cloud roof to hold in the day’s warmth. Familiar stars provide us a faint light. We sit beneath them by a jumble of ore-studded boulders; we eat a careful, cold feast of canned venison stew and pickled beets.  Some of the stars above us are not familiar; some of them are traitors.  Arvål is cheerful, drawing Pir and even Koben into talk about their homes. Gunter says little. He eats steadily and keeps an eye on Koben. He watches Arvål too, with distrust.  Arvål asks me about my home then. I’d rather be just another shape in the darkness, though I understand his intent is to make me a real person to Pir. I can’t see Pir’s pale eyes from where I sit, so I say a few things: that I grew up in a homestead like the one this afternoon, not far from a long-settled village north of Oslyge. The people of my village make baskets and furniture from the fine black willow that has adapted well to the nearby marshes.  Arvål asks about my family. I don’t want to think about where my parents and sisters and youngest brother might be now, or about my two older brothers who are soldiers, so I hesitate.  And then it happens. Koben pitches forward, spewing dark liquid that taints the chill air with the stink of sweet iron and bile. Gunter is already beside him, supporting the boy by his upper arms before he can fall on his face. Koben stares down, despairing, at the stuff that’s gotten on his hands. His normally pale skin is a luminous white in the faint light, except where his mouth is stained. Another paroxysm takes him, this time of choking. I watch, unable to move, as more dark liquid trickles in strings from the corners of his mouth, from his nose. Koben’s gaze turns inward, an intense concentration as he struggles to draw breath.  He jerks again and then he’s gone, slumped boneless in Gunter’s grasp like an arrow-shot bird, like the dead of Oslyge.  I know what is due the dead of one’s household, but there’s little we can do for Koben. The ground is hard here, and the light poor, and we have no mattocks. After a period of stunned silence Gunter drags Koben over to the biggest boulder, to stretch him out beside its shelter. Pir hurries to help him. We gather stones to cover the body, stumbling around to find them.  “Enough,” Gunter says at last. I lay the rock I’m holding on top of the pile, and step back. The smell of the death is still strong around us.  Gunter’s voice is heavy and flat when he speaks. “What killed him is something the Tysthänder call ‘engineered bacteria.’”  I’ve never heard these two words linked together this way, but I take them to mean a sickness that’s somehow designed the way a weapon is, a perverse thought but no stranger than creating apparitions to drive people mad with fear. Perhaps we had knowledge of these things when we came to NyHem. If so, I’m not sorry we lost it.  Gunter pauses only for breath. “They sprayed all crops in the settled regions with it, all but those in Holberthe, where the people welcomed them.” Contempt edges his words, though he doesn’t revile them as I would. At least one of the guards who drove us was from Holberthe; I heard it in his voice. “The Tysthänder say they work to harness what they call our world’s full adaptive potential, that this is but a first step. So I was told.” He pauses and looks down towards his feet. “They tried to win the army’s help by telling us of the danger. Thus I knew, and my duty was to see that you all were warned.”  Gunter takes off his officer’s cap and holds it in his big hands. All of us follow suit.  “Koben, your death is on my head,” Gunter says, hoarse.  Pir shakes his head angrily. “They killed him, Kapten, as they killed all the others.” The words burst out of him. “I will see that they pay, Koben, I swear it.”  I wonder how he’ll do that, but he’s right that Koben’s death—yet another one—is on the Tysthänder, the Peace Hands who say they don’t use violence. I echo Pir: “They killed him.”  Gunter doesn’t acknowledge our words.  You should speak good of the dead at a funeral, not merely curse their killers. I find something to say, though it seems inadequate. I didn’t really know him; he was so quiet. “Koben, you reminded me of my youngest brother, whom I love. Gud keep your spirit.”  “Rest in peace, Koben,” Arvål says softly. He stands off by himself a little, as he often does. His expression, as much as I can see it, is weary and sad, and his hands’ grip is tight on his cap. The stone in his ear winks as it catches the starlight.  I wonder what peace means now.  Without saying anything more, Gunter shoulders both his pack and rifle, and Koben’s, and walks away from the makeshift grave. It’s foolhardy to travel at night if you don’t have to, but I don’t want to sleep here either.  I wish I had a stick to feel the way before me.  I don’t know how long we stumble onward, or how far we travel in that time. At first we go single file, letting Gunter pick our path, but as exhaustion takes its toll, we straggle more, and wander off to one side or the other. Or at least I straggle.  At one point this begins to seem funny to me. I see an image of myself as a pup trying to keep up with its mother, when the mother isn’t paying any attention to it. I guess it’s thinking of Gunter as a bitch with pups that strikes me as funny.  Certainly Gunter seems unaware of us.  On a particularly rough hillside I lose sight of everyone before I reach the top. I’m groggy enough by now that this is slow to sink in. Then it hits me that I might end up out here on the broad uplands alone, and I’m wide awake again. I scramble up the slope without watching as I ought, but I don’t fall.  At the crest I pause, listening and straining my eyes for a sign of the men. I can’t see anything I’m sure of—is that dark shape one of them?; is it moving?—but after a moment I hear a thump and a muttered curse close by. Relief trickles in, and I make my way toward the sound with a little more care.  Not care enough. When I’m a little ways downslope, picking my way through a thicket of brush, my left foot snags, then both feet are tangled up with something too solid to be a shrub and too yielding to be a boulder; I can’t keep myself from falling.  Pir yelps.  The smell should’ve warned me I was close to one of the others, I think as I fall, as I land hard on top of Pir. It’s a useless thought, shaken out of me when he shoves me off him. The weight of the pack pulls me over on my back. The rock ledge he likely tripped on digs into my hip as I try to squirm further away, onto my side.  “Djävul take it!” Pir snaps out of the darkness, his voice raw with exhaustion. “Can’t you watch where you’re going?” Burdened by his own pack, he rolls half on top of me as he struggles to get up once again.  Then Pir feels who I am. I know when he knows, cold in my guts, a prickling ache spreading in my limbs.  A hand, Pir’s hand, knocks off my cap and knots itself hard in my tangled hair, while his other arm flails, getting free from his pack strap. His face is a wide-eyed blur. I have no leverage, held down by the weight strapped to my back, his knee already pinning one leg, his panting harsh in my ears; I am trapped; I am trapped. I think to yell. Days on the run, where silence is part of safety, slows the impulse, and his mouth is hard on mine, his weight presses the breath out of me. The musk of skin smothers me in past terror, while my body struggles with the present, his body shoving against mine. At least with him above me now I have something to push against, a strange sort of anchor.  The smell, the taste in my mouth is not the Tysthand guard. The breath rasping in my ears sounds more desperate than triumphant. I can fight back.  I bite Pir, hard. He jerks away, crying out, and I fumble for the knife I remember I have, that I didn’t have then, in Oslyge.  Then someone drags Pir off me. Pir kicks me in the process, but there’s not much force behind it. I manage this time to roll to my side and then onto my hands and knees so I can get up. Arvål is pummeling Pir a few feet away. Pir, on the bottom this time, is trying to defend himself.  “Stop.” Gunter stands a little ways downslope, his face like stone. He’s not a tall man—no taller than I—but he has a large presence. Arvål freezes, his right arm cocked back for another blow. Then he lets go a deep breath and gets off Pir.  Pir scrambles to his feet, panting, unsteady. His mouth is bleeding, either where I bit him or from one of Arvål’s blows. He opens his mouth—to explain, perhaps; to accuse—but Gunter halts him with a cold glare. Then Gunter looks at Arvål, who lifts his chin a little, defiant.  And Gunter looks at me. His eyes are angry. I look back. I see the pain sketched around his mouth and eyes, beneath the anger. I find I’m no longer afraid of him.  “We’ll camp down below,” he says, and turns away.  I recover my cap.  After a day and a half more of hard travel, some of it wading through knee-deep water, we’re once again working our way up into the yellow hills. The sky is clear, but there’s a cold edge to the breeze that whips the tall grasses.  As we climb I feel the absence of Koben. His not-presence is always somewhere in my mind. Four people don’t travel with the same rhythm as five.  Gunter and Pir are up ahead, both silent. Gunter seems to have more energy this afternoon. He looks around, an alert eagerness in the angle of his head and the set of his shoulders. I think we’re nearing the base he spoke of.  Pir keeps his eyes on the ground. His lip is still swollen. He hasn’t talked much since the fight, and he no longer stares at me. He seems shamed, though I find that hard to credit.  Arvål walks beside me now, asking questions about the mill where I worked in Oslyge, about life in the city. This isn’t the first time he’s chosen to hang back with me. I’m grateful to him for yanking Pir off me that night. Realizing I could pull my knife and actually using it were two different things. I wouldn’t want to have killed Pir, even if I’d been able to. But Arvål’s attentions make me wary.  I tire of talking about the city. Oslyge was a beautiful place, but my memory of it is tainted by what happened. If this conflict was over, I’d choose to go home to the willow marshes, or to live in a place like that homestead.  “Why didn’t you go to the camps with the other civilians, Senne?” Arvål asks, taking me by surprise. “You would’ve been safe there. Out here you could be killed.”  Or raped. Or both. But he doesn’t say these things. I find I’m angry at him for asking; does he believe the Tysthand lies? I stop walking, although I shouldn’t. We’ll fall behind.  “Oh ja, safety!” My voice is louder than I intended. “That’s what they promised on the radio and in those pamphlets they showered on our heads. They use force only in self-defense; it’s their Code or some such thing.” Everyone had thought the broadcasts hoaxes until the air-cars came. Arvål, a few steps ahead, half turns to listen to me. “Then they sent down apparitions that drove the whole city mad with fear. How many died then, Arvål?” He meets my eyes. He’s listening, intent, but I can’t read his response.  “And when their guards, the turncoats, rounded us up, they beat the slow ones, the old people. With my own eyes I saw this! Some of them cut a woman who was near me out of the crowd, just like dogs do with sheep. They took her off into an alley. I heard her screaming.” I stop speaking, to try to catch my breath, to slow my heartbeat. I don’t like to remember that sound, but it’s like the taste in my mouth; it goes on forever. I was so frightened then of the same thing happening to me, and shamed by my fear and paralysis.  It’s hard to continue, but I do. “I didn’t see her come back.” Arvål’s looking shocked, almost hurt. For a soldier he seems naïve. “If that’s safety, Arvål, I’m no worse off out here. And here they can’t make me into whatever cursed thing they’ve planned for us all—a good, obedient flock of citizen-sheep.”  I turn away and start walking again. My socks are still damp from wading; my blisters protest. Gunter and Pir are far ahead of us.  Arvål follows. He looks down at the yellow dirt and the tall scalegrass as he walks. When he does speak, his voice is hesitant. “It doesn’t make sense, Senne, them hurting civilians. They need the people here to cooperate with them eventually, or they can’t make a profit with this world in a way that fits with their rules, the Code they talk about. I don’t understand why they’d let their men do that.”  I don’t answer. They need us frightened, I think, angry at his reliance on our enemy’s logical motives. Something about the thought catches my attention as though it’s important. Then it just seems obvious: They need us frightened so we won’t resist.  “Perhaps they’ll punish the men who did those things,” Arvål offers, tentative. “As we punish such men in the army.”  I snap at him, “They lie, Arvål, and you can’t trust anything they say. If any of them break this Code of theirs, it will always be our fault we’re dead.” I walk on very fast, ignoring my blisters.  We gain a little on Gunter and Pir.  After a while Arvål speaks again, desolation in his voice. “I’ve hoped they weren’t lying about the camps, that my uncle would be out of danger there. He isn’t young.”  I shrug, still upset. “Well, maybe if he moves fast and does everything they want, and he’s lucky, he’ll be fine.” And maybe they’ll reward him then, and win his loyalty. Maybe that’s exactly what they plan, with the rapes and beating deaths useful tactics in their program.  “I hope so.” He frowns in thought, treading with caution through a stretch of loose stones. “You got away from them,” he says, and it’s a question.  For a heartbeat I feel like throwing up; I feel the guard’s grip on the back of my head, the ache from kneeling on paving stones, and the sharper pain in my neck as one of his nails dug in. I’m dizzy with it, but I keep walking, driven. “I bribed a guard.” I hear my own voice, very harsh. I suppose it’s true, though I had no choice about the coin. I got a better deal than the woman in the alley.  Bitterness fills me, and I let it spill out. “They offer amnesty for the army. Why haven’t you surrendered if you believe them, Arvål?” I’m sorry as soon as I say the words. None of this is his fault.  His frown deepens into a scowl. “I’m a soldier. This is my duty.” He pauses and then mutters. “Doesn’t matter if we have no chance against them.”  After a while, to break the silence, I ask about his uncle.  “He’s a teacher, in Pesgjevving. He raised me. He was strict, but very good to me.” Arvål isn’t thinking about his answer. It sounds automatic, like he’s said that and nothing more many times.  I nod. I don’t know much about Pesgjevving, except that it’s a grim, gray sort of place near the border with Holberthe, the center of the mountain region as Oslyge is of the upland plains. A university is there. “I thought maybe you’d gone to more than a village school. You sound like it sometimes. Different.”  Arvål glances at me, wariness in his eyes. Their dark irises seem the same color as the stone in his earlobe. “Ja, I went to the university for a short while,” he answers, and then shuts up. Perhaps he is self-conscious. An educated foot soldier can’t have an easy time of it, not if it shows. I decide I won’t ask him more questions now. We seem to both be poking at the other’s sore spots.  Up ahead Gunter pauses just shy of the hill’s crest, to survey the land on the other side. Between one breath and another he drops flat, signaling us down. His rifle is no longer slung from his shoulder, but in his hands.  When I hit the grass the pack I carry knocks the air from my lungs, though it’s lighter than it was two days ago. This close, the grass smells of hay and alkali dust. Tiny springes, brown insects a scant centimeter long, leap away. I follow Arvål’s worn boot soles as he crawls upslope to join Gunter and Pir.  Gunter points down to our left. Some distance along the long, shallow valley below is a group of men, twenty or more, all dressed in the same dirty-straw color we wear. Other survivors from the Oslyge regiment that Gunter hoped for, or a trap.  We watch them for a while. They cast proper shadows, and travel away from us, westward, at a footsore pace.  “I’ll go check them out, Kapten,” Pir says into the silence. He’s already poised to move.  Gunter looks at Pir for a long moment, calculating the odds maybe. Then he nods acceptance.  Pir scuttles backward until he’s far enough below the hill’s crest to run bent over without being seen. When he’s some distance away from us Pir straightens and walks over the crest. His rifle’s in his hands, the muzzle down. After a minute or so he whistles like a danskgris, an unlikely sound up here in the hills, but safer than a shout, I suppose.  The signal carries well. The men in the valley scatter, and flatten themselves in the grass. Sunlight gleams on the barrels of their weapons. The grass provides scant cover from anyone up at our height, but spread apart like that, they make a more difficult target. I hear Gunter muttering in approval.  Pir waves his rifle. The tiny men below don’t respond. I see their heads turning as they survey the crests of the hills around them. We hold very still. The swelling on my neck throbs in the sun’s heat. Now I remember how I got it—the guard’s fingernails. The traitor with his shirt hem of that jacquard linen they favor in Holberthe, pulled loose from the opening in his padded armor.  I suppose the sore will heal eventually. Washing with soap and hot water would help.  Pir sets off at a steady lope towards the soldiers, holding his rifle horizontally above his head. At a distance from them no greater than the length of a wealthy farmer’s barn, Pir stops. Two of the soldiers scramble to their feet, sling their rifles back over their shoulders, and come toward him, their arms open. The others relax their guard, stand up, or sit back with their hands loose. One of the two approaching Pir grabs him in a hug.  A moment later Pir turns and waves us down.  Twenty-eight travel with a much different rhythm than four or five. The leader of this group, Överste Rimestad, sends pairs of scouts ahead to guard against surprises. They come and go at intervals, running, while the rest of us keep a steady pace.  I stay close to Gunter at first. I know nothing of these new soldiers. But here Gunter is Kapten Prett, and he walks with the överste, listening respectfully when the skinny officer talks. This morning I was part of Gunter’s group, whatever the tensions between me and Pir. Once again I’m nobody.  Pir stays close to his friends, the man who hugged him and the other one. Most of these soldiers are from Pir and Gunter’s company. Arvål travels at the rear of this group, not talking much to anyone. After a while I fall back to walk near him.  Arvål’s dark eyes hold a nervous spark. He nods at me, though his mind seems elsewhere.  The sun is very low; still we climb and descend hills. At the moment we are climbing. I ask, “Do you think we’re getting close to this base, Arvål?”  “I am sure of it,” he answers, but says nothing more.  A sunburned infantryman ahead slows his pace until he’s walking beside me. After a bit he offers his name: “Raulf.”  “Senne,” I answer. There seems no harm in him; he’s only curious.  “Ah, you’re not enlisted, as we are?” The soldier flushes, which makes his whole face red, instead of just his cheeks and nose. It’s a foolish question—women don’t join the army—and a good question as well. I travel with soldiers and wear most of the uniform. What’s he to think? I hope wearily that I’m too grimy for him to conclude I’m some kind of prostitute.  “No, I worked in a clothing mill in Oslyge,” I tell him, hoping to leave the matter there. The hill’s getting steeper. I concentrate on my footing among the stones.  “Oslyge,” he repeats, and his eyes look bleak. “That was a bad time.”  We’re catching up with the others. Scouts have returned and the group halts while the överste listens to their report.  The officer is smiling. Gunter is smiling. I hear someone say one of the entrances to the base has been spotted. I find I’m excited and fearful in equal measure.  Överste Rimestad gives the hand sign to move out. Eager, the men hurry upward. I see Gunter’s—Kapten Prett’s—broad back ahead, Koben’s rifle stuck through the ties of his pack. I see Pir and his friends disappear over the crest.  At last, panting, I reach the top. The sunburned soldier has gone on ahead. Arvål stands on the crest, resting, looking down, his shadow long behind him. Across a shallow bowl of yellow grass is an outcropping of rock, not very impressive, though a few dark openings in the rock indicate caves. Boulders litter the slope before the rock face. The sun is setting beyond the hills, and the sky is clear gold and peach and green.  Arvål glances at me. I think he’s about to say something, so I pause. He holds his silence, and I start down.  Arvål follows, the last of us. As if he’s just become aware of this, he plunges by me, down into the shadowed grass.  I don’t want to fall completely behind but I don’t need to be first to the cave, either. I trot downslope, being careful of my footing. My pack jounces on my back.  Aided by the slope, Arvål has already reached the cluster of soldiers around Överste Rimestad and Gunter. I see Rimestad put out a hand to stop Arvål, and the two of them stand talking as the others pass them by. Arvål salutes as though given an order, and the officer continues on.  Arvål goes on too, after a moment, no longer eager. He’s got some unpleasant duty, I think. That would be Gunter’s doing.  I catch up to the sunburned soldier and several others down on the flat. With the sun gone the breeze is much colder, though there’s still plenty of light. I shiver and hurry onward, eager now to be inside before full dark.  Another soldier comes up level with me, not too close. I hadn’t thought anyone was behind. I glance over at him as he picks his way through the grass. A gangly youth, a little ragged, with knobby knuckles beneath too-long sleeves. Koben.  Koben. It cannot be Koben. The grass at his feet doesn’t bend. He has no shadow.  None of us have shadows; the sun’s down.  There are too many men ahead of us. Around us.  My heart pounds in my chest like fever, like terror. I open my mouth to shout.  And they come. The Tysthänder come very fast over the hilltops, riding black sleds a half meter or so above the ground as though this were midwinter and the grass buried deep in the copper-hued snow. They are armored in gleaming black, and their weapons spit light.  I hit the ground.  Men scream. Men scatter and their rifles crack like drover’s whips, like so many ice-burdened branches snapping. Bullets whine and the rifles of the soldiers near me strike like hammer blows on my eardrums, ringing steel.  The cool ground contains the pounding of my heart so that it shakes my rib cage. My head feels very light. Sound ceases to hold any meaning other than pain. I don’t want to die staring at a tiny rust-red bug climbing the scales on a stem of grass.  I risk raising my head. The field is chaos to my eyes at first, running, burning soldiers and streaks of light and a few of the sleds. Not many. Shot down, or abandoned now the enemy’s reached us?  There are far too many men. Some look like Koben.  I see Pir and then Gunter among the runners, though Gunter’s pace is slower, his familiar dog-pack lope. A sled and its black-armored rider sweeps between us, so for a moment I can’t see him. And then a big piece of the sled’s gone, like a slice out of a Hâl cake. The sled flies on as though nothing’s wrong, and then it’s whole again. It’s not a trick of my eyes.  Men burn and the grass doesn’t catch fire.  There is no attack. There’s nothing but their damned apparitions projected from . . . where? I twist round to stare upwards: nothing but a sky the deep color of evening, dotted with tiny puffs of cloud.  Oslyge’s sky was cloudless, that terrible day.  It’s from one of their orbiters these images come, if that’s even possible. But how did the Tysthänder find this base?  And Koben. How could they have his image, dirty and too thin as I knew him? Unless he was one of them—but then he wouldn’t have eaten anything from the garden.  One of us gave them his image.  Arvål, always a little apart from the rest. The stone in his earlobe dark and translucent like his eyes.  Arvål, from the mountains on the Holberthe border. Ordered just now to a task that didn’t fit his plans.  I’m up and pounding toward the cave. I ignore the sleds. I don’t think the light weapons can harm me, though stray bullets might. I pass the sunburned soldier and one other. They don’t shoot at me. I think there’s less gunfire, but I’m not sure. All I hear is a ringing confusion.  Someone’s lying on his belly in the grass ahead. I dodge, hoping again to not get shot, but the man’s arms are wide-flung, the ground dark red beneath his chest. Officer’s cap, skinny. I stumble on the överste’s rifle, but don’t fall.  Off to one side I see an odd-looking soldier, clean-shaven, in a dirty sweater, with long, light hair stuffed up under his cap. Her cap. I slow in bewilderment. Light envelops her, and her body contorts in agony as she burns.  Something hits me from the side, brings me down flat. Gunter, but how is he back here? He’s beside me down in the grass, angry and yelling in my face but I can’t make out what he says. I see that he has bits of wool in his ears. The barrel of his rifle lies almost under my nose. It smells hot.  I clap my hands to my ears, then pull them away. “Arvål,” I gasp, the name a gabble inside my head. “Traitor,” I try to say.  He nods; he knows already. His eyes are the blue of deep ice, his face fissured stone. He holds out a hand, stiff, the palm towards me: wait. Cautious, he raises his head and looks around. Then he grabs my sleeve and yanks me into a crouching run. We finish up on the far side of a boulder. It’s too small for sure cover, but better than grass.  Again the hand signal to wait. Gunter reaches back and pulls his extra rifle, Koben’s rifle, from his pack. He puts it in my hands.  When I saw Gunter running for the cave, he carried only one rifle. Indeed, Arvål gave them all our images.  The weapon’s heavy. I don’t know how to use this thing.  Gunter launches himself back into the center of the chaos, zigzagging, diving for cover when a sled comes near. He hasn’t figured out that they’re illusion; I should have told him. Beyond him I see his quarry: Arvål sprinting for an opening in the rock face.  Arvål in a clean uniform. I open my mouth to yell.  The bullet takes Gunter somewhere in the back. I can’t tell where. All I see is the puff of dust as it hits his pack, and then him tumbling forward. Perhaps I cry out loud enough to be heard; I can’t tell.  A second Arvål appears from behind a boulder, rifle in hand, dashing toward the place where Gunter fell. This one’s clothes are streaked with mud and sweat as I remember them. I put the stock of Koben’s rifle to my shoulder, sight along the barrel. I don’t think about killing him, just that I must stop him. I squeeze the trigger. It doesn’t take much force.  The gun slams back into my shoulder, and my right ear is hammered once again. Dazed, I find Arvål still running, unharmed, only a few meters separating him from Gunter now. Is he too only an image?  I’m scrambling across the rough field before I know what I’m doing. Someone—a panicked soldier—crashes into me, knocking me sideways. I use the rifle to keep myself from falling. The air burns my lungs and Arvål’s on top of Gunter now, his bowstring around the kapten’s throat, real enough to kill him.  Two steps more. I swing the rifle butt down at the back of Arvål’s head like a mattock, but I’m not steady as one must be to drive a mattock’s blade into hardpan. The rifle butt glances off the top of his pack and bounces from my grasp; I’m overbalanced, falling forward. Arvål twists to face me, snarling. I see the knife in his right hand, the shining knifepoint I fall toward. Terrified, I throw myself to the side, drawing my own knife, my left arm out to shield me.  The heavy pack yanks me over, giving added force to my instinctive thrust. My knife drives through the fabric of his tunic, up into his chest, easy as cutting cheese.  His mouth is round, his eyes are round. His eyes say my name, ask a question I can’t answer. Warm liquid, dark red, soaks my right hand and his tunic.  His knife’s in the dirt, the blade stained.  There’s blood on my left arm as well.  People shouldn’t be so easy to cut.  Grunting, I turn Gunter over. He’s alive, bleeding from a small hole near his shoulder. I can’t tell which blood is his, which is Arvål’s, or mine. It seems to matter.  I look around. Light is draining from the sky. The Tysthand sleds have disappeared and the field is near empty of men. I see maybe five of them, standing, their rifles dangling from their hands. I hope the rest are inside, and not dead, hidden by the long scalegrass.  Arvål’s eyes are dull now, though his ear-stone still gleams. If the gem is what serves as their eye, they’ll have a good view of his killer.  Gunter’s too heavy for me to carry. As I start to drag him to the cave Pir comes to help me, and then others come as well.  We’re deep inside the maze of caves and passages and treacherous cracks, in an irregular room lit by oil lamps—safe enough for the moment now that the side entrance we came through has been blocked by an explosive charge. The lamps warm the room some as well as light it, but still it’s cold. The place smells of damp stone and oil smoke and stale fear sweat. I’ve heard that caves can be beautiful, but this one isn’t.  I shiver, and the sunburned soldier—I don’t remember his name—brings me a sleepbag. He tells me I should lie down, that I’m in shock. My ears still ring, but I can hear him. The soldier’s face is very pale beneath the sunburn, and his eyes look bruised.  Including Överste Rimestad, we lost four men. Four men and Arvål, whom I killed with my knife. All the others were shot. The injuries I see around me look like gunshot wounds and broken bones or sprains, except for mine. No one was burned.  I didn’t need to kill Arvål. I feel sick, thinking this. I could have held the muzzle of the rifle to his head to stop him; he didn’t know I’d used the bullet in it. I console myself that he wouldn’t have lived long, with four dead men to avenge.  I’ve asked about Gunter’s—Kapten Prett’s—condition, and no one seems to know.  I’ve asked what duty it was that Arvål was given, and no one is sure of that either. None of the soldiers near me, anyway. Possibly he was to stand watch at the entrance, with some of the men already there, rather than go down with the rest of us. The överste had ordered three other men to that duty.  An injured man screams as the doctor works on him. Another man near me cries softly.  The doctor gets to me after a while. He’s an older man, not a soldier. He looks ill-tempered, but his hands are quick and sure as they unwrap the torn shirt from my forearm. He pours disinfectant over the slash and I break out in a sweat. The edges of the cut are neat with the blood washed away, skin and fat and fine-textured dark muscle beneath. My head feels light.  The doctor sponges something else, icy cold, on my skin, and after a little begins to sew up the slash. I turn my head away.  When he’s done and the arm wrapped again, he says, “Hold still.” He leans forward and touches the swelling on my neck. He smells strongly like the disinfectant. “Where did you get this?” His voice is harsh.  My breath gets trapped in my chest for a moment. “Oslyge,” I whisper. “A Tysthand guard.” The guard’s hands grip me once more; the taste chokes me. I’ll learn to live with this.  “Hold still,” he says again, and wipes something over the skin there. Before I know what he’s planning, he slices into the swelling. I cry out; I’d thought the pain was over. I feel more liquid on my neck, but he wipes it away. He holds the cloth to my neck for a minute, then pulls it away and shows me: what you’d expect, blood and some yellowish stuff, but also a small round thing like a mustard seed.  He scowls. “A tag. With luck we’re under too much rock for them to be able to trace it.” He pulls an instrument out of his bag that looks like a small pair of pliers, and uses them to crush it. “Just the same we won’t stay here long.”  When he goes I lay back on my sleepbag. I’m exhausted, too tired to sleep, and tears leak from the corners of my eyes. The bargain the Tysthand guard offered me was a lie, as is everything the Tysthänder say. I could’ve led the enemy to us, as surely as Arvål did.  Was it him? Am I sure? Maybe he’d only gone to help Gunter. Maybe his earring was nothing more than a red stone. I feel again the knife sliding up into his flesh. If I had just held the gun on him, I might know the answers by now. I close my eyes, and tears soak into my hair.  I hear someone come up beside me, feet shuffling in the loose dirt of the floor. “Hey,” Pir says, touching my arm. “The kapten wanted me to tell you that he’ll be all right.”  I start to wipe my sleeve across my face, but it’s stiff with dried blood. There’s nothing to do but face Pir with tears on my face.  “Good,” I manage to say.  Pir looks as haggard as the sunburned soldier did earlier, his face pinched with exhaustion. “He lost a lot of blood, but the doctor says the bullet mostly tore up muscle.”  I suppose this is good news. “Did he say—do you know what order the överste gave Arvål?” If I knew this, I could be sure about what I did. A spy would’ve needed to go in with the rest.  Pir looks puzzled, but as he considers Arvål his expression hardens. He looks like the soldier I was so frightened of before, except his anger isn’t at me. “I don’t know about any orders,” he says. “But Knut found a reddish powder in his pack that the doctor says is what they use to make water undrinkable. And other stuff, worse than that. He would’ve driven us out for the Tysthänder to slaughter.”  Or to tame, and which is worse? I shiver, thinking of Arvål walking beside me, asking questions. Protecting me from Pir’s hostility. “I don’t understand him,” I whisper. I stare up at the ceiling.  Pir shrugs. I see this out of the corner of my eye. Understanding Arvål holds no interest for him. After a minute he says, “The kapten also wanted me to tell you he’ll teach you to shoot.” He smiles a little at this, pleased to be bringing me a reward. I can be a soldier too.  My ears and head ache, and the tears sting again. I remember the crack of the rifles. I remember the air-sleds spitting light; the woman in the dirty sweater, burning; Oslyge. The bodies in the grass. The blood.  “Who is it I would shoot, if Gunter taught me?” I ask Pir. He looks confused again, beginning to be irritated. “All they send against us are illusions and our own traitors, Pir.”  His face closes. He doesn’t want to remember whose bullets killed the men today. “Think about it,” he says, and leaves me.  I think. Most of the oil lamps are out, leaving their stink behind. The cave’s full of shadows. Unable to sleep, I think.  Rifles kill living things, not lies and illusion. We can’t touch them with rifles. What else is left?  Arvål said it, and I thought him a fool: Their profit. Cooperation. If we won’t be bullied and wooed into working for them, we deny them profit. If they don’t profit, they fail.  I think our battle is in the Tysthand camps, for the will of our people, not out here—if we haven’t already lost. Exhaustion and the throbbing of my arm and neck bind me tight in despair. How many days has it been since they rounded up the people of Oslyge, of the whole region? Will the soldiers around me be willing to fight with other weapons?  I don’t want to put myself within the grasp of the Tysthänder. I want to be a dog out in the hills and eat scavenged food and drink from lakes like the danskgris.  I don’t want to go to them, but I will. Sally Gwylan was born in Texas and raised all over the South. She now resides in New Mexico in a small, handmade, off-the-grid house a half hour west of Albuquerque, where the wind blows more often than not. A graduate of the 1985 Clarion Writer's Workshop, Ms. Gwylan works part-time at a law firm to allow time for writing, singing, gardening, and building stuff.", "text": "9180 words, novelette\nFleeing Oslyge\nWhen I wake this time, I smell that dawn is close. I remember the scent of it from childhood, sweet and brisk and metallic like new grasses crushed together with aniseed. Dawn smells better than the inside of this dead soldier’s sleepbag, yet I’d choose to bury my nose and aching belly and aching mind until full light if I dared.\nBut Pir would come and drag me out, and take angry pleasure in it. I do my best to avoid his attentions.\nI wriggle out of the bag, my clothes twisted and clammy, and shiver when the air takes my warmth. The sore on my neck chafes where my sweater rubs. I pull up the neckband of my city woman’s blouse—filthy, but softer than wool—to ease it. Around us the night mist still drifts. Young Koben seems on watch in a sea of unshaped ghosts.\nBetter this miserable dawning than the daylight apparitions of Oslyge, nightmares with booming voices that prowled the city’s streets: vargar and snake-armed women out of old tales; immense children-of-Fion, the skittering, many-legged crawlers a thousand times natural size. All of them shadowless, yet seeming flesh-solid in the afternoon sun, though a rock someone—not I—dared to throw touched nothing until it clattered on the paving stones.\nWe ran from them in terror; I ran, knowing they couldn’t be real. I ran until the fear-stinking press of bodies shoved me aside into a gap between buildings, where I hid. Later the guards in their padded armor came to round up us strays. The dead and maimed lay on the worn stones, victims of the panic. I stepped around them, over them, not permitted to stop. The cries, the growing stench assured me these were not illusion.\nBetter the cold mist and these days of hunger and endless walking than trying to hide in broken Oslyge. Better this than letting myself be taken to the camps the Tysthänder, the Peace Hands, claim are for our safety. Our safety in this time of transition; that’s what their bulletins said. No one is sure whether the invaders—“project administrators” as they call themselves—are of human stock, as we are, or are alien.\nTheir guards are human enough.\nMy mouth tastes foul. I will never get rid of that taste.\nHands shaking, I build a tiny fire under the curved shield of reeds and marsh mud that Arvål—thin-faced, clever—rigged to distribute the heat signature over a larger area. Our bodies put off heat too, of course. The Tysthand orbiters could track us by that, Gunter says, but then they’d have to look at every large animal, the elk and snava deer and the clumsy, barrel-plump danskgris the centuries have adapted for life in the willow marshes.\nThe mist hides the smoke, gray in gray. I steep the resinous buds of bog-tea until the liquid is strong and green, and my hands at least get warm. Gunter, the kapten, watches me from his sleepbag like the supervisor from Odven Mill did when I first started work there, a cold, assessing stare. Gunter’s older than the others, with lines in his face that don’t show in this light. I think he fears I’ll slow them or give them away. I’m afraid of his power over me, though he’s offered me no harm.\nI take a mug of tea to Koben. The shy boy grunts his thanks and wraps his knobby, fine-skinned hands around the insulated cup. He’s no older than my youngest brother, too young to be a soldier. I have another cup poured for Gunter but find he has withdrawn into his bag again.\nI try to make myself as useful as I can.\nWhen I turn back to the fire, Pir is there, squatting close to its heat. He’s a strong young man with broad cheekbones; no older than I. His eyes are flat as he studies me.\nI take a careful sip from the cup I hold, and go to roll up my sleepbag. My hands are shaking again. That makes me angry but not enough to go back over to the fire.\n“You shouldn’t let him intimidate you, Senne,” Arvål says, his voice rough still from sleep. His head pokes out from the straw-yellow folds of the bag next to mine. The dark, gold-set stone in his earlobe reflects firelight as he moves.\nI concentrate on rolling the bag into a tight bundle. “I know,” I say. I know, but I can’t seem to help cringing from the man. With careful attention I strap the bag in its place on the pack I carry.\nThe sleepbag, the pack, the sharp knife at my belt, the boots and trousers I wear, and the soft field cap that keeps my long hair out of my eyes all came from a dead soldier on the outskirts of Oslyge. I’d picked up his rifle as well, but Gunter took the ammunition out and bent the barrel between two boulders. He said I didn’t know how to use it, which is true.\nFiring a gun is a good way to attract Tysthand attention anyway, so none of the men have dared use theirs since I met up with them. Which means no hunting, except for Pir’s snares, and they’ve caught nothing. The year’s long fall isn’t a season for snares. We should have bows, like most country people do. Bows are easier to make than rifles, and silent. I used to be good with a bow.\nThe sweater I wear was always mine, the gift of a lover. It used to be blue and white.\nI gulp down the rest of the bog-tea, lukewarm now and very bitter, then go rinse my face at the small lake’s edge. The cold water dripping from my hands gives back a muffled plink. The light is growing. I can see the thick, pale shoots of nickelvass at the lake’s edge, extending a long way into the mist. I hear a distant splashing, and a gray elk ghosts into view, rippling the rusty surface of the water.\nIf I had a bow, I would wait until it left the water, and shoot it. I turn back to camp, ready to go.\nIn the afternoon we find the homestead. We stop on a hilltop overlooking the small cluster of buildings: a stone house surrounded by a few rough sheds and windbreaks of poplar and feathery native skjovan. Skjovan is scrubby but long-lived. All other trees on NyHem are descended from stock our ancestors brought with them seven hundred years ago, though changed, as everything non-native must change to survive the metal-rich soil.\nPir throws himself down next to me and sends a hard glance my way, as though it’s me he wants to fling himself on.\nMy anger is in my mind only, cold and without strength. I find myself trembling. Light-headed, I slip back down the hill the way we came, finding a boulder to squat behind, as though I need to relieve myself. When I come back I choose a spot as far from Pir as I can get.\nGunter holds us back for a long, careful hour, watching the homestead from our hilltop. The road’s too close to suit him, and anyway, the Tysthänder will have mapped every dwelling from their orbiters. But we need food. We tried boiling grass and it made us ill. We’re not as adapted as the elk and danskgris.\nNothing moves below but wind in the trees and the building’s shadow as minutes pass; the house is no illusion. The people who lived there have fled or been picked up. The Tysthänder offer refuge for everyone and amnesty for our soldiers, an offer they allow no one to refuse. This region of marsh and rocky hills has always been sparsely settled, but now there are no people at all, except us and other fleeing soldiers.\nGunter says there’s a hidden base some two days walk further west. He says the survivors from Oslyge will be heading there; he doesn’t mean civilians like me, but soldiers. I’d go home to the village I was born in, but I’m afraid to see it, afraid it would be one more trap. Afraid to travel alone. I don’t know what I will do at this base of Gunter’s; brew tea perhaps.\nStill nothing moves, and Gunter sends Arvål and Koben down to reconnoiter.\nI don’t think Gunter likes Arvål much. Pir fought in Gunter’s company before Oslyge and is devoted to his kapten. Koben and Arvål are both from other companies, but who could object to quiet Koben? Arvål is also the only one strong and smart enough to challenge Gunter’s leadership, though he seems careful not to.\nProbably I am not understanding how the army works.\nOf the four soldiers, I feel easiest with Arvål. He’s tall and white-haired and thin-faced like my next oldest brother, with an earring similar to Isak’s. Arvål has told Pir twice to leave me alone, though that may mean nothing.\nI lie on my belly in the coarse autumn grasses, rubbing the swollen place on my neck, waiting. I stink. All of us stink. Looking down the hill I think with longing of a pantry full of food, but also of the sauna the homestead below us will have.\nPreparing a sauna takes a lot of time, more than we can spare. I know this. I’ll settle for the food.\nKoben and Arvål disappear from sight as they circle the house, one to either side. After a few minutes Arvål waves his rifle from the shadow of the doorway: all clear. Gunter leads us sprinting down the hill, like dogs, he says. A dog pack might well approach an empty homestead. Once we’re beneath it the slabbed stone roof, baking in the sun, will hide our heat signatures, which aren’t very strong on a warm afternoon anyway.\nThere’s food in the pantry of the neat, thick-walled house, potatoes, black-skinned onions, and dried beans in bins, and shelves of gleaming canned produce. And dried läder peaches, a whole winter’s store of them sealed in a paper-lined clay crock. Pir finds them. I look up at his cry of excitement, and see his eyes transformed. The four of us, Gunter, Pir, Arvål, and I, jostle like children to grab handfuls of them, the tension of hiding momentarily forgotten. The mingled food scents are intoxicating. I don’t worry that Pir is close.\nKoben comes in from the back, the west side we couldn’t see from our hilltop. He radiates warmth in the dim, cool pantry. His grimy field tunic is pulled out and up to make a carry-sling, the way a farm wife uses her apron. Inside it are heaped tomatoes, yellow-striped gurkor and handfuls of downy peapods. In one hand he holds a half-eaten tomato. Juice runs down his downy chin. “Look!” he calls out to us.\nGunter, massive but quick as a cat in his movements, turns and sees the boy. I watch as something very like despair flashes across his face. “Spit it out!” he orders.\nKoben freezes, baffled. After a second, he spits, but there’s no red pulp. His light eyes are full of fear and questions.\n“They sprayed the gardens,” Gunter says, crossing the flagstone floor. “Didn’t your kapten warn you?! They sprayed them all.” He hustles the boy over to an empty bin and dumps the produce in. Some of the tomatoes split when they land. They smell heady, like summer and fermenting wine.\nGunter pushes Koben down on his knees and crams a finger down his throat. The boy gags. Something freezes up inside my mind. I can’t watch this. I find the taste and smell of the turncoat Tysthand guard fouling my mouth once more, and my throat closes. I turn away and stumble out of the room, trying to breathe and not breathe at the same time.\nThe big kitchen is no refuge; I can still hear Koben gagging. A vase of wilted blue flax sits on the wickerwork table. It catches my eye but isn’t enough to hold me. Across the room I see the door to the laundry shed, half open, and, desperate to think of anything but the sound behind me, I remember what my aunt did the morning her youngest drank disinfectant paint.\nOn a shelf above the deep laundry sink I find this family’s supplies, bottles and cartons and a wide-mouthed jar of white pellets. I snatch this down and hurry back to the pantry, twisting off the lid as I go.\nKoben’s still retching, but to little effect. Gunter bends over him, cursing. Pir still has one forgotten hand in the peach crock, but his other hand, like his face, is knotted with apprehension. Arvål leans back against a bin, pale beneath his tan. Frightened, I think. He is, oddly, watching me.\nI yank on Gunter’s sleeve. “Here!” I say. “Back of the throat, as far down as you can get them.” I dump a small pile of the pellets into Gunter’s big hand. He forces poor Koben’s mouth open again.\nThe sal soda works well enough. Koben has nothing left in his stomach but bile when he’s done. I don’t know what they spray the gardens with. I don’t know if we acted fast enough to protect him.\nGunter drives us to fill our packs with food then. Koben just sits on the floor with his arms wrapped around his head while we load up with all we can carry—flatbröd, the one rope of dry sausage, cracked grains, and other things. We take a few of the heavy jars for tonight. Although my appetite’s gone I stuff pockets and empty corners with the tough little peaches. If they aren’t safe, it won’t matter. I’ve already eaten several.\nWe search for bows. The only one we find is snapped in half, but Arvål puts the bowstring in his pocket. Gunter stops me from washing my hands and face at the sink when I pass it. He says just touching this water could make me very sick. I wonder what the Tysthänder plan is: Do they intend people to go home? How will the people live if their water’s undrinkable?\nTonight we’re still among the upland hills, and there is no mist. This means no fire and no cloud roof to hold in the day’s warmth. Familiar stars provide us a faint light. We sit beneath them by a jumble of ore-studded boulders; we eat a careful, cold feast of canned venison stew and pickled beets.\nSome of the stars above us are not familiar; some of them are traitors.\nArvål is cheerful, drawing Pir and even Koben into talk about their homes. Gunter says little. He eats steadily and keeps an eye on Koben. He watches Arvål too, with distrust.\nArvål asks me about my home then. I’d rather be just another shape in the darkness, though I understand his intent is to make me a real person to Pir. I can’t see Pir’s pale eyes from where I sit, so I say a few things: that I grew up in a homestead like the one this afternoon, not far from a long-settled village north of Oslyge. The people of my village make baskets and furniture from the fine black willow that has adapted well to the nearby marshes.\nArvål asks about my family. I don’t want to think about where my parents and sisters and youngest brother might be now, or about my two older brothers who are soldiers, so I hesitate.\nAnd then it happens. Koben pitches forward, spewing dark liquid that taints the chill air with the stink of sweet iron and bile. Gunter is already beside him, supporting the boy by his upper arms before he can fall on his face. Koben stares down, despairing, at the stuff that’s gotten on his hands. His normally pale skin is a luminous white in the faint light, except where his mouth is stained. Another paroxysm takes him, this time of choking. I watch, unable to move, as more dark liquid trickles in strings from the corners of his mouth, from his nose. Koben’s gaze turns inward, an intense concentration as he struggles to draw breath.\nHe jerks again and then he’s gone, slumped boneless in Gunter’s grasp like an arrow-shot bird, like the dead of Oslyge.\nI know what is due the dead of one’s household, but there’s little we can do for Koben. The ground is hard here, and the light poor, and we have no mattocks. After a period of stunned silence Gunter drags Koben over to the biggest boulder, to stretch him out beside its shelter. Pir hurries to help him. We gather stones to cover the body, stumbling around to find them.\n“Enough,” Gunter says at last. I lay the rock I’m holding on top of the pile, and step back. The smell of the death is still strong around us.\nGunter’s voice is heavy and flat when he speaks. “What killed him is something the Tysthänder call ‘engineered bacteria.’”\nI’ve never heard these two words linked together this way, but I take them to mean a sickness that’s somehow designed the way a weapon is, a perverse thought but no stranger than creating apparitions to drive people mad with fear. Perhaps we had knowledge of these things when we came to NyHem. If so, I’m not sorry we lost it.\nGunter pauses only for breath. “They sprayed all crops in the settled regions with it, all but those in Holberthe, where the people welcomed them.” Contempt edges his words, though he doesn’t revile them as I would. At least one of the guards who drove us was from Holberthe; I heard it in his voice. “The Tysthänder say they work to harness what they call our world’s full adaptive potential, that this is but a first step. So I was told.” He pauses and looks down towards his feet. “They tried to win the army’s help by telling us of the danger. Thus I knew, and my duty was to see that you all were warned.”\nGunter takes off his officer’s cap and holds it in his big hands. All of us follow suit.\n“Koben, your death is on my head,” Gunter says, hoarse.\nPir shakes his head angrily. “They killed him, Kapten, as they killed all the others.” The words burst out of him. “I will see that they pay, Koben, I swear it.”\nI wonder how he’ll do that, but he’s right that Koben’s death—yet another one—is on the Tysthänder, the Peace Hands who say they don’t use violence. I echo Pir: “They killed him.”\nGunter doesn’t acknowledge our words.\nYou should speak good of the dead at a funeral, not merely curse their killers. I find something to say, though it seems inadequate. I didn’t really know him; he was so quiet. “Koben, you reminded me of my youngest brother, whom I love. Gud keep your spirit.”\n“Rest in peace, Koben,” Arvål says softly. He stands off by himself a little, as he often does. His expression, as much as I can see it, is weary and sad, and his hands’ grip is tight on his cap. The stone in his ear winks as it catches the starlight.\nI wonder what peace means now.\nWithout saying anything more, Gunter shoulders both his pack and rifle, and Koben’s, and walks away from the makeshift grave. It’s foolhardy to travel at night if you don’t have to, but I don’t want to sleep here either.\nI wish I had a stick to feel the way before me.\nI don’t know how long we stumble onward, or how far we travel in that time. At first we go single file, letting Gunter pick our path, but as exhaustion takes its toll, we straggle more, and wander off to one side or the other. Or at least I straggle.\nAt one point this begins to seem funny to me. I see an image of myself as a pup trying to keep up with its mother, when the mother isn’t paying any attention to it. I guess it’s thinking of Gunter as a bitch with pups that strikes me as funny.\nCertainly Gunter seems unaware of us.\nOn a particularly rough hillside I lose sight of everyone before I reach the top. I’m groggy enough by now that this is slow to sink in. Then it hits me that I might end up out here on the broad uplands alone, and I’m wide awake again. I scramble up the slope without watching as I ought, but I don’t fall.\nAt the crest I pause, listening and straining my eyes for a sign of the men. I can’t see anything I’m sure of—is that dark shape one of them?; is it moving?—but after a moment I hear a thump and a muttered curse close by. Relief trickles in, and I make my way toward the sound with a little more care.\nNot care enough. When I’m a little ways downslope, picking my way through a thicket of brush, my left foot snags, then both feet are tangled up with something too solid to be a shrub and too yielding to be a boulder; I can’t keep myself from falling.\nPir yelps.\nThe smell should’ve warned me I was close to one of the others, I think as I fall, as I land hard on top of Pir. It’s a useless thought, shaken out of me when he shoves me off him. The weight of the pack pulls me over on my back. The rock ledge he likely tripped on digs into my hip as I try to squirm further away, onto my side.\n“Djävul take it!” Pir snaps out of the darkness, his voice raw with exhaustion. “Can’t you watch where you’re going?” Burdened by his own pack, he rolls half on top of me as he struggles to get up once again.\nThen Pir feels who I am. I know when he knows, cold in my guts, a prickling ache spreading in my limbs.\nA hand, Pir’s hand, knocks off my cap and knots itself hard in my tangled hair, while his other arm flails, getting free from his pack strap. His face is a wide-eyed blur. I have no leverage, held down by the weight strapped to my back, his knee already pinning one leg, his panting harsh in my ears; I am trapped; I am trapped. I think to yell. Days on the run, where silence is part of safety, slows the impulse, and his mouth is hard on mine, his weight presses the breath out of me. The musk of skin smothers me in past terror, while my body struggles with the present, his body shoving against mine. At least with him above me now I have something to push against, a strange sort of anchor.\nThe smell, the taste in my mouth is not the Tysthand guard. The breath rasping in my ears sounds more desperate than triumphant. I can fight back.\nI bite Pir, hard. He jerks away, crying out, and I fumble for the knife I remember I have, that I didn’t have then, in Oslyge.\nThen someone drags Pir off me. Pir kicks me in the process, but there’s not much force behind it. I manage this time to roll to my side and then onto my hands and knees so I can get up. Arvål is pummeling Pir a few feet away. Pir, on the bottom this time, is trying to defend himself.\n“Stop.” Gunter stands a little ways downslope, his face like stone. He’s not a tall man—no taller than I—but he has a large presence. Arvål freezes, his right arm cocked back for another blow. Then he lets go a deep breath and gets off Pir.\nPir scrambles to his feet, panting, unsteady. His mouth is bleeding, either where I bit him or from one of Arvål’s blows. He opens his mouth—to explain, perhaps; to accuse—but Gunter halts him with a cold glare. Then Gunter looks at Arvål, who lifts his chin a little, defiant.\nAnd Gunter looks at me. His eyes are angry. I look back. I see the pain sketched around his mouth and eyes, beneath the anger. I find I’m no longer afraid of him.\n“We’ll camp down below,” he says, and turns away.\nI recover my cap.\nAfter a day and a half more of hard travel, some of it wading through knee-deep water, we’re once again working our way up into the yellow hills. The sky is clear, but there’s a cold edge to the breeze that whips the tall grasses.\nAs we climb I feel the absence of Koben. His not-presence is always somewhere in my mind. Four people don’t travel with the same rhythm as five.\nGunter and Pir are up ahead, both silent. Gunter seems to have more energy this afternoon. He looks around, an alert eagerness in the angle of his head and the set of his shoulders. I think we’re nearing the base he spoke of.\nPir keeps his eyes on the ground. His lip is still swollen. He hasn’t talked much since the fight, and he no longer stares at me. He seems shamed, though I find that hard to credit.\nArvål walks beside me now, asking questions about the mill where I worked in Oslyge, about life in the city. This isn’t the first time he’s chosen to hang back with me. I’m grateful to him for yanking Pir off me that night. Realizing I could pull my knife and actually using it were two different things. I wouldn’t want to have killed Pir, even if I’d been able to. But Arvål’s attentions make me wary.\nI tire of talking about the city. Oslyge was a beautiful place, but my memory of it is tainted by what happened. If this conflict was over, I’d choose to go home to the willow marshes, or to live in a place like that homestead.\n“Why didn’t you go to the camps with the other civilians, Senne?” Arvål asks, taking me by surprise. “You would’ve been safe there. Out here you could be killed.”\nOr raped. Or both. But he doesn’t say these things. I find I’m angry at him for asking; does he believe the Tysthand lies? I stop walking, although I shouldn’t. We’ll fall behind.\n“Oh ja, safety!” My voice is louder than I intended. “That’s what they promised on the radio and in those pamphlets they showered on our heads. They use force only in self-defense; it’s their Code or some such thing.” Everyone had thought the broadcasts hoaxes until the air-cars came. Arvål, a few steps ahead, half turns to listen to me. “Then they sent down apparitions that drove the whole city mad with fear. How many died then, Arvål?” He meets my eyes. He’s listening, intent, but I can’t read his response.\n“And when their guards, the turncoats, rounded us up, they beat the slow ones, the old people. With my own eyes I saw this! Some of them cut a woman who was near me out of the crowd, just like dogs do with sheep. They took her off into an alley. I heard her screaming.” I stop speaking, to try to catch my breath, to slow my heartbeat. I don’t like to remember that sound, but it’s like the taste in my mouth; it goes on forever. I was so frightened then of the same thing happening to me, and shamed by my fear and paralysis.\nIt’s hard to continue, but I do. “I didn’t see her come back.” Arvål’s looking shocked, almost hurt. For a soldier he seems naïve. “If that’s safety, Arvål, I’m no worse off out here. And here they can’t make me into whatever cursed thing they’ve planned for us all—a good, obedient flock of citizen-sheep.”\nI turn away and start walking again. My socks are still damp from wading; my blisters protest. Gunter and Pir are far ahead of us.\nArvål follows. He looks down at the yellow dirt and the tall scalegrass as he walks. When he does speak, his voice is hesitant. “It doesn’t make sense, Senne, them hurting civilians. They need the people here to cooperate with them eventually, or they can’t make a profit with this world in a way that fits with their rules, the Code they talk about. I don’t understand why they’d let their men do that.”\nI don’t answer. They need us frightened, I think, angry at his reliance on our enemy’s logical motives. Something about the thought catches my attention as though it’s important. Then it just seems obvious: They need us frightened so we won’t resist.\n“Perhaps they’ll punish the men who did those things,” Arvål offers, tentative. “As we punish such men in the army.”\nI snap at him, “They lie, Arvål, and you can’t trust anything they say. If any of them break this Code of theirs, it will always be our fault we’re dead.” I walk on very fast, ignoring my blisters.\nWe gain a little on Gunter and Pir.\nAfter a while Arvål speaks again, desolation in his voice. “I’ve hoped they weren’t lying about the camps, that my uncle would be out of danger there. He isn’t young.”\nI shrug, still upset. “Well, maybe if he moves fast and does everything they want, and he’s lucky, he’ll be fine.” And maybe they’ll reward him then, and win his loyalty. Maybe that’s exactly what they plan, with the rapes and beating deaths useful tactics in their program.\n“I hope so.” He frowns in thought, treading with caution through a stretch of loose stones. “You got away from them,” he says, and it’s a question.\nFor a heartbeat I feel like throwing up; I feel the guard’s grip on the back of my head, the ache from kneeling on paving stones, and the sharper pain in my neck as one of his nails dug in. I’m dizzy with it, but I keep walking, driven. “I bribed a guard.” I hear my own voice, very harsh. I suppose it’s true, though I had no choice about the coin. I got a better deal than the woman in the alley.\nBitterness fills me, and I let it spill out. “They offer amnesty for the army. Why haven’t you surrendered if you believe them, Arvål?” I’m sorry as soon as I say the words. None of this is his fault.\nHis frown deepens into a scowl. “I’m a soldier. This is my duty.” He pauses and then mutters. “Doesn’t matter if we have no chance against them.”\nAfter a while, to break the silence, I ask about his uncle.\n“He’s a teacher, in Pesgjevving. He raised me. He was strict, but very good to me.” Arvål isn’t thinking about his answer. It sounds automatic, like he’s said that and nothing more many times.\nI nod. I don’t know much about Pesgjevving, except that it’s a grim, gray sort of place near the border with Holberthe, the center of the mountain region as Oslyge is of the upland plains. A university is there. “I thought maybe you’d gone to more than a village school. You sound like it sometimes. Different.”\nArvål glances at me, wariness in his eyes. Their dark irises seem the same color as the stone in his earlobe. “Ja, I went to the university for a short while,” he answers, and then shuts up. Perhaps he is self-conscious. An educated foot soldier can’t have an easy time of it, not if it shows. I decide I won’t ask him more questions now. We seem to both be poking at the other’s sore spots.\nUp ahead Gunter pauses just shy of the hill’s crest, to survey the land on the other side. Between one breath and another he drops flat, signaling us down. His rifle is no longer slung from his shoulder, but in his hands.\nWhen I hit the grass the pack I carry knocks the air from my lungs, though it’s lighter than it was two days ago. This close, the grass smells of hay and alkali dust. Tiny springes, brown insects a scant centimeter long, leap away. I follow Arvål’s worn boot soles as he crawls upslope to join Gunter and Pir.\nGunter points down to our left. Some distance along the long, shallow valley below is a group of men, twenty or more, all dressed in the same dirty-straw color we wear. Other survivors from the Oslyge regiment that Gunter hoped for, or a trap.\nWe watch them for a while. They cast proper shadows, and travel away from us, westward, at a footsore pace.\n“I’ll go check them out, Kapten,” Pir says into the silence. He’s already poised to move.\nGunter looks at Pir for a long moment, calculating the odds maybe. Then he nods acceptance.\nPir scuttles backward until he’s far enough below the hill’s crest to run bent over without being seen. When he’s some distance away from us Pir straightens and walks over the crest. His rifle’s in his hands, the muzzle down. After a minute or so he whistles like a danskgris, an unlikely sound up here in the hills, but safer than a shout, I suppose.\nThe signal carries well. The men in the valley scatter, and flatten themselves in the grass. Sunlight gleams on the barrels of their weapons. The grass provides scant cover from anyone up at our height, but spread apart like that, they make a more difficult target. I hear Gunter muttering in approval.\nPir waves his rifle. The tiny men below don’t respond. I see their heads turning as they survey the crests of the hills around them. We hold very still. The swelling on my neck throbs in the sun’s heat. Now I remember how I got it—the guard’s fingernails. The traitor with his shirt hem of that jacquard linen they favor in Holberthe, pulled loose from the opening in his padded armor.\nI suppose the sore will heal eventually. Washing with soap and hot water would help.\nPir sets off at a steady lope towards the soldiers, holding his rifle horizontally above his head. At a distance from them no greater than the length of a wealthy farmer’s barn, Pir stops. Two of the soldiers scramble to their feet, sling their rifles back over their shoulders, and come toward him, their arms open. The others relax their guard, stand up, or sit back with their hands loose. One of the two approaching Pir grabs him in a hug.\nA moment later Pir turns and waves us down.\nTwenty-eight travel with a much different rhythm than four or five. The leader of this group, Överste Rimestad, sends pairs of scouts ahead to guard against surprises. They come and go at intervals, running, while the rest of us keep a steady pace.\nI stay close to Gunter at first. I know nothing of these new soldiers. But here Gunter is Kapten Prett, and he walks with the överste, listening respectfully when the skinny officer talks. This morning I was part of Gunter’s group, whatever the tensions between me and Pir. Once again I’m nobody.\nPir stays close to his friends, the man who hugged him and the other one. Most of these soldiers are from Pir and Gunter’s company. Arvål travels at the rear of this group, not talking much to anyone. After a while I fall back to walk near him.\nArvål’s dark eyes hold a nervous spark. He nods at me, though his mind seems elsewhere.\nThe sun is very low; still we climb and descend hills. At the moment we are climbing. I ask, “Do you think we’re getting close to this base, Arvål?”\n“I am sure of it,” he answers, but says nothing more.\nA sunburned infantryman ahead slows his pace until he’s walking beside me. After a bit he offers his name: “Raulf.”\n“Senne,” I answer. There seems no harm in him; he’s only curious.\n“Ah, you’re not enlisted, as we are?” The soldier flushes, which makes his whole face red, instead of just his cheeks and nose. It’s a foolish question—women don’t join the army—and a good question as well. I travel with soldiers and wear most of the uniform. What’s he to think? I hope wearily that I’m too grimy for him to conclude I’m some kind of prostitute.\n“No, I worked in a clothing mill in Oslyge,” I tell him, hoping to leave the matter there. The hill’s getting steeper. I concentrate on my footing among the stones.\n“Oslyge,” he repeats, and his eyes look bleak. “That was a bad time.”\nWe’re catching up with the others. Scouts have returned and the group halts while the överste listens to their report.\nThe officer is smiling. Gunter is smiling. I hear someone say one of the entrances to the base has been spotted. I find I’m excited and fearful in equal measure.\nÖverste Rimestad gives the hand sign to move out. Eager, the men hurry upward. I see Gunter’s—Kapten Prett’s—broad back ahead, Koben’s rifle stuck through the ties of his pack. I see Pir and his friends disappear over the crest.\nAt last, panting, I reach the top. The sunburned soldier has gone on ahead. Arvål stands on the crest, resting, looking down, his shadow long behind him. Across a shallow bowl of yellow grass is an outcropping of rock, not very impressive, though a few dark openings in the rock indicate caves. Boulders litter the slope before the rock face. The sun is setting beyond the hills, and the sky is clear gold and peach and green.\nArvål glances at me. I think he’s about to say something, so I pause. He holds his silence, and I start down.\nArvål follows, the last of us. As if he’s just become aware of this, he plunges by me, down into the shadowed grass.\nI don’t want to fall completely behind but I don’t need to be first to the cave, either. I trot downslope, being careful of my footing. My pack jounces on my back.\nAided by the slope, Arvål has already reached the cluster of soldiers around Överste Rimestad and Gunter. I see Rimestad put out a hand to stop Arvål, and the two of them stand talking as the others pass them by. Arvål salutes as though given an order, and the officer continues on.\nArvål goes on too, after a moment, no longer eager. He’s got some unpleasant duty, I think. That would be Gunter’s doing.\nI catch up to the sunburned soldier and several others down on the flat. With the sun gone the breeze is much colder, though there’s still plenty of light. I shiver and hurry onward, eager now to be inside before full dark.\nAnother soldier comes up level with me, not too close. I hadn’t thought anyone was behind. I glance over at him as he picks his way through the grass. A gangly youth, a little ragged, with knobby knuckles beneath too-long sleeves. Koben.\nKoben. It cannot be Koben. The grass at his feet doesn’t bend. He has no shadow.\nNone of us have shadows; the sun’s down.\nThere are too many men ahead of us. Around us.\nMy heart pounds in my chest like fever, like terror. I open my mouth to shout.\nAnd they come. The Tysthänder come very fast over the hilltops, riding black sleds a half meter or so above the ground as though this were midwinter and the grass buried deep in the copper-hued snow. They are armored in gleaming black, and their weapons spit light.\nI hit the ground.\nMen scream. Men scatter and their rifles crack like drover’s whips, like so many ice-burdened branches snapping. Bullets whine and the rifles of the soldiers near me strike like hammer blows on my eardrums, ringing steel.\nThe cool ground contains the pounding of my heart so that it shakes my rib cage. My head feels very light. Sound ceases to hold any meaning other than pain. I don’t want to die staring at a tiny rust-red bug climbing the scales on a stem of grass.\nI risk raising my head. The field is chaos to my eyes at first, running, burning soldiers and streaks of light and a few of the sleds. Not many. Shot down, or abandoned now the enemy’s reached us?\nThere are far too many men. Some look like Koben.\nI see Pir and then Gunter among the runners, though Gunter’s pace is slower, his familiar dog-pack lope. A sled and its black-armored rider sweeps between us, so for a moment I can’t see him. And then a big piece of the sled’s gone, like a slice out of a Hâl cake. The sled flies on as though nothing’s wrong, and then it’s whole again. It’s not a trick of my eyes.\nMen burn and the grass doesn’t catch fire.\nThere is no attack. There’s nothing but their damned apparitions projected from . . . where? I twist round to stare upwards: nothing but a sky the deep color of evening, dotted with tiny puffs of cloud.\nOslyge’s sky was cloudless, that terrible day.\nIt’s from one of their orbiters these images come, if that’s even possible. But how did the Tysthänder find this base?\nAnd Koben. How could they have his image, dirty and too thin as I knew him? Unless he was one of them—but then he wouldn’t have eaten anything from the garden.\nOne of us gave them his image.\nArvål, always a little apart from the rest. The stone in his earlobe dark and translucent like his eyes.\nArvål, from the mountains on the Holberthe border. Ordered just now to a task that didn’t fit his plans.\nI’m up and pounding toward the cave. I ignore the sleds. I don’t think the light weapons can harm me, though stray bullets might. I pass the sunburned soldier and one other. They don’t shoot at me. I think there’s less gunfire, but I’m not sure. All I hear is a ringing confusion.\nSomeone’s lying on his belly in the grass ahead. I dodge, hoping again to not get shot, but the man’s arms are wide-flung, the ground dark red beneath his chest. Officer’s cap, skinny. I stumble on the överste’s rifle, but don’t fall.\nOff to one side I see an odd-looking soldier, clean-shaven, in a dirty sweater, with long, light hair stuffed up under his cap. Her cap. I slow in bewilderment. Light envelops her, and her body contorts in agony as she burns.\nSomething hits me from the side, brings me down flat. Gunter, but how is he back here? He’s beside me down in the grass, angry and yelling in my face but I can’t make out what he says. I see that he has bits of wool in his ears. The barrel of his rifle lies almost under my nose. It smells hot.\nI clap my hands to my ears, then pull them away. “Arvål,” I gasp, the name a gabble inside my head. “Traitor,” I try to say.\nHe nods; he knows already. His eyes are the blue of deep ice, his face fissured stone. He holds out a hand, stiff, the palm towards me: wait. Cautious, he raises his head and looks around. Then he grabs my sleeve and yanks me into a crouching run. We finish up on the far side of a boulder. It’s too small for sure cover, but better than grass.\nAgain the hand signal to wait. Gunter reaches back and pulls his extra rifle, Koben’s rifle, from his pack. He puts it in my hands.\nWhen I saw Gunter running for the cave, he carried only one rifle. Indeed, Arvål gave them all our images.\nThe weapon’s heavy. I don’t know how to use this thing.\nGunter launches himself back into the center of the chaos, zigzagging, diving for cover when a sled comes near. He hasn’t figured out that they’re illusion; I should have told him. Beyond him I see his quarry: Arvål sprinting for an opening in the rock face.\nArvål in a clean uniform. I open my mouth to yell.\nThe bullet takes Gunter somewhere in the back. I can’t tell where. All I see is the puff of dust as it hits his pack, and then him tumbling forward. Perhaps I cry out loud enough to be heard; I can’t tell.\nA second Arvål appears from behind a boulder, rifle in hand, dashing toward the place where Gunter fell. This one’s clothes are streaked with mud and sweat as I remember them. I put the stock of Koben’s rifle to my shoulder, sight along the barrel. I don’t think about killing him, just that I must stop him. I squeeze the trigger. It doesn’t take much force.\nThe gun slams back into my shoulder, and my right ear is hammered once again. Dazed, I find Arvål still running, unharmed, only a few meters separating him from Gunter now. Is he too only an image?\nI’m scrambling across the rough field before I know what I’m doing. Someone—a panicked soldier—crashes into me, knocking me sideways. I use the rifle to keep myself from falling. The air burns my lungs and Arvål’s on top of Gunter now, his bowstring around the kapten’s throat, real enough to kill him.\nTwo steps more. I swing the rifle butt down at the back of Arvål’s head like a mattock, but I’m not steady as one must be to drive a mattock’s blade into hardpan. The rifle butt glances off the top of his pack and bounces from my grasp; I’m overbalanced, falling forward. Arvål twists to face me, snarling. I see the knife in his right hand, the shining knifepoint I fall toward. Terrified, I throw myself to the side, drawing my own knife, my left arm out to shield me.\nThe heavy pack yanks me over, giving added force to my instinctive thrust. My knife drives through the fabric of his tunic, up into his chest, easy as cutting cheese.\nHis mouth is round, his eyes are round. His eyes say my name, ask a question I can’t answer. Warm liquid, dark red, soaks my right hand and his tunic.\nHis knife’s in the dirt, the blade stained.\nThere’s blood on my left arm as well.\nPeople shouldn’t be so easy to cut.\nGrunting, I turn Gunter over. He’s alive, bleeding from a small hole near his shoulder. I can’t tell which blood is his, which is Arvål’s, or mine. It seems to matter.\nI look around. Light is draining from the sky. The Tysthand sleds have disappeared and the field is near empty of men. I see maybe five of them, standing, their rifles dangling from their hands. I hope the rest are inside, and not dead, hidden by the long scalegrass.\nArvål’s eyes are dull now, though his ear-stone still gleams. If the gem is what serves as their eye, they’ll have a good view of his killer.\nGunter’s too heavy for me to carry. As I start to drag him to the cave Pir comes to help me, and then others come as well.\nWe’re deep inside the maze of caves and passages and treacherous cracks, in an irregular room lit by oil lamps—safe enough for the moment now that the side entrance we came through has been blocked by an explosive charge. The lamps warm the room some as well as light it, but still it’s cold. The place smells of damp stone and oil smoke and stale fear sweat. I’ve heard that caves can be beautiful, but this one isn’t.\nI shiver, and the sunburned soldier—I don’t remember his name—brings me a sleepbag. He tells me I should lie down, that I’m in shock. My ears still ring, but I can hear him. The soldier’s face is very pale beneath the sunburn, and his eyes look bruised.\nIncluding Överste Rimestad, we lost four men. Four men and Arvål, whom I killed with my knife. All the others were shot. The injuries I see around me look like gunshot wounds and broken bones or sprains, except for mine. No one was burned.\nI didn’t need to kill Arvål. I feel sick, thinking this. I could have held the muzzle of the rifle to his head to stop him; he didn’t know I’d used the bullet in it. I console myself that he wouldn’t have lived long, with four dead men to avenge.\nI’ve asked about Gunter’s—Kapten Prett’s—condition, and no one seems to know.\nI’ve asked what duty it was that Arvål was given, and no one is sure of that either. None of the soldiers near me, anyway. Possibly he was to stand watch at the entrance, with some of the men already there, rather than go down with the rest of us. The överste had ordered three other men to that duty.\nAn injured man screams as the doctor works on him. Another man near me cries softly.\nThe doctor gets to me after a while. He’s an older man, not a soldier. He looks ill-tempered, but his hands are quick and sure as they unwrap the torn shirt from my forearm. He pours disinfectant over the slash and I break out in a sweat. The edges of the cut are neat with the blood washed away, skin and fat and fine-textured dark muscle beneath. My head feels light.\nThe doctor sponges something else, icy cold, on my skin, and after a little begins to sew up the slash. I turn my head away.\nWhen he’s done and the arm wrapped again, he says, “Hold still.” He leans forward and touches the swelling on my neck. He smells strongly like the disinfectant. “Where did you get this?” His voice is harsh.\nMy breath gets trapped in my chest for a moment. “Oslyge,” I whisper. “A Tysthand guard.” The guard’s hands grip me once more; the taste chokes me. I’ll learn to live with this.\n“Hold still,” he says again, and wipes something over the skin there. Before I know what he’s planning, he slices into the swelling. I cry out; I’d thought the pain was over. I feel more liquid on my neck, but he wipes it away. He holds the cloth to my neck for a minute, then pulls it away and shows me: what you’d expect, blood and some yellowish stuff, but also a small round thing like a mustard seed.\nHe scowls. “A tag. With luck we’re under too much rock for them to be able to trace it.” He pulls an instrument out of his bag that looks like a small pair of pliers, and uses them to crush it. “Just the same we won’t stay here long.”\nWhen he goes I lay back on my sleepbag. I’m exhausted, too tired to sleep, and tears leak from the corners of my eyes. The bargain the Tysthand guard offered me was a lie, as is everything the Tysthänder say. I could’ve led the enemy to us, as surely as Arvål did.\nWas it him? Am I sure? Maybe he’d only gone to help Gunter. Maybe his earring was nothing more than a red stone. I feel again the knife sliding up into his flesh. If I had just held the gun on him, I might know the answers by now. I close my eyes, and tears soak into my hair.\nI hear someone come up beside me, feet shuffling in the loose dirt of the floor. “Hey,” Pir says, touching my arm. “The kapten wanted me to tell you that he’ll be all right.”\nI start to wipe my sleeve across my face, but it’s stiff with dried blood. There’s nothing to do but face Pir with tears on my face.\n“Good,” I manage to say.\nPir looks as haggard as the sunburned soldier did earlier, his face pinched with exhaustion. “He lost a lot of blood, but the doctor says the bullet mostly tore up muscle.”\nI suppose this is good news. “Did he say—do you know what order the överste gave Arvål?” If I knew this, I could be sure about what I did. A spy would’ve needed to go in with the rest.\nPir looks puzzled, but as he considers Arvål his expression hardens. He looks like the soldier I was so frightened of before, except his anger isn’t at me. “I don’t know about any orders,” he says. “But Knut found a reddish powder in his pack that the doctor says is what they use to make water undrinkable. And other stuff, worse than that. He would’ve driven us out for the Tysthänder to slaughter.”\nOr to tame, and which is worse? I shiver, thinking of Arvål walking beside me, asking questions. Protecting me from Pir’s hostility. “I don’t understand him,” I whisper. I stare up at the ceiling.\nPir shrugs. I see this out of the corner of my eye. Understanding Arvål holds no interest for him. After a minute he says, “The kapten also wanted me to tell you he’ll teach you to shoot.” He smiles a little at this, pleased to be bringing me a reward. I can be a soldier too.\nMy ears and head ache, and the tears sting again. I remember the crack of the rifles. I remember the air-sleds spitting light; the woman in the dirty sweater, burning; Oslyge. The bodies in the grass. The blood.\n“Who is it I would shoot, if Gunter taught me?” I ask Pir. He looks confused again, beginning to be irritated. “All they send against us are illusions and our own traitors, Pir.”\nHis face closes. He doesn’t want to remember whose bullets killed the men today. “Think about it,” he says, and leaves me.\nI think. Most of the oil lamps are out, leaving their stink behind. The cave’s full of shadows. Unable to sleep, I think.\nRifles kill living things, not lies and illusion. We can’t touch them with rifles. What else is left?\nArvål said it, and I thought him a fool: Their profit. Cooperation. If we won’t be bullied and wooed into working for them, we deny them profit. If they don’t profit, they fail.\nI think our battle is in the Tysthand camps, for the will of our people, not out here—if we haven’t already lost. Exhaustion and the throbbing of my arm and neck bind me tight in despair. How many days has it been since they rounded up the people of Oslyge, of the whole region? Will the soldiers around me be willing to fight with other weapons?\nI don’t want to put myself within the grasp of the Tysthänder. I want to be a dog out in the hills and eat scavenged food and drink from lakes like the danskgris.\nI don’t want to go to them, but I will.\nSally Gwylan was born in Texas and raised all over the South. She now resides in New Mexico in a small, handmade, off-the-grid house a half hour west of Albuquerque, where the wind blows more often than not. A graduate of the 1985 Clarion Writer's Workshop, Ms. Gwylan works part-time at a law firm to allow time for writing, singing, gardening, and building stuff.", "source": "https://clarkesworldmagazine.com/gwylan_05_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fleeing Oslyge by Sally Gwylan"}