{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bo Balder", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "tHMuw/8IyNcJUnki4DIsk4G7fmE=", "id": null, "license": null, "comments": "", "raw_text": "6020 words, short story  Erdenweh  Onway dreaded the condolence visit, but still she hurried to the front door. It was never wise to expose yourself to Nueva Esperanza sun for long, even with skin as dark as hers.  “Mx. Tschiao, I’m Onway Jansen, your daughter’s psychiatrist. My deepest condolences. May I come in?”  The mother’s haggard face darkened with emotion. Onway had come prepared for that. It was her responsibility as a psychiatrist to bear the anger that the bereaved would direct to her. This wasn’t the first condolence visit she’d had to pay. An epidemic of suicides raged on Nueva Esperanza and psychiatrists struggled right in the thick of it.  Onway thought she’d finally gained some headway with Esterella. Until the girl killed herself.  The mother quickly quelled her anger and gestured her inside. Onway recognized the mechanism. The daughter had always suppressed her emotions exactly like that, first welling up, then tamped down and put away to save face in public.  The mother gestured Onway into a chair and slammed down a cup of coffee. “How did this happen? You were supposed to make her better! It’s your fault.” The mother broke down weeping.  Anger often masked grief. Better to let it out.  “She was such a lovely girl. There were no worries in her life, her grades were good, she had lots of friends. She had you! She liked you, she said the therapy was helping.”  And yet during therapy sessions Esterella had expressed deep sadness and lack of meaning in her life. What had been missing? They hadn’t gotten to the bottom of it yet. And now they never would.  Onway let the mother talk and observed her surroundings. The furniture was all printed, light and modern, nothing made from native wood or grasses. Extremely neat. A wet cloth and a bottle of cleaning spray stood ready on a corner of the spotless coffee table.  She picked up her coffee for a sip. She set the cup down again. The mother lunged for the cleaning cloth and wiped down the circular stain where Onway hadn’t set her cup back down in the exact same spot. Good, grieving people often neglected basic care for home and self.  Onway’s next stop was the weekly visit to Children’s Crèche the Little Ducklings. She stepped into the hallway, empty at this time of day, and found her way to the little office on the second floor. The walls and floors were scuffed and grimy, coats and hats and children’s toys spread everywhere. Even now, when adult labor was less scarce than in Onway’s childhood, it was apparently impossible to keep up with children’s mess. A smile warmed her cheeks.  The children’s home always made her happy, in some illogical way. She’d hated living here. She’d felt like a second-class citizen, created from random sperm donors from Earth and batch-decanted here on the new colony. All so the scientists from the colony ship wouldn’t have to have twelve children each. Onway didn’t disagree with the method, since anything else would probably have heralded in a renewed suppression of women, but she had disliked intensely how it felt.  And yet every time she came here, she felt her muscles loosen and her cares lighten. Funny how people worked. In fact, she was a member of a committee that wanted to stop the batch-decanting of babies and make it mandatory to raise one test-tube child per family for every natural born one. She had never for a moment doubted that the committee was important, so she wholeheartedly donated her time and effort to draft bills for the citizens’ parliament.  But coming straight from Esterella’s ordinary, sanitized home to this comfortable, dirty environment she wondered. What benefited a child most? How did one measure that? Look at herself. Even after a childhood remembered as miserable, she’d still turned out all right.  She worked the rest of the day with her groups and individual sessions. The children were mostly healthy and happy, but there were always a few with concentration issues or suffering from bullying or a difficult puberty.  The morning’s painful start had made Onway think. Were these children really all right? Was the detection system good enough? Was it up to date, was it smart enough? Was Onway herself really doing all she could? She made a note to schedule a once-yearly check on all the children.  Still. She couldn’t shake the feeling that these children were doing better than a lot of children in nice, big, clean homes with doting parents. Or at least available parents, present parents, good-enough parents. In a group home, at most you had group leaders for fifteen children, one for the day and one for the night. As she remembered it, most of the group leaders were sadly unimportant or uninspiring. The children’s own communities, especially the secret ones, had provided most of the love and support.  She needed to research this. The feelings of a single therapist counted for nothing, she needed citywide stats. Or preferably, planetwide stats.  At home she wolfed down a quick printed meal while she set her house AI to searching. The amount of material that scrolled by as she chewed and swallowed was astounding. Planetwide? Hah! A rise in suicides had been reported on all colony planets.  They were calling it Erdenweh, Earth-sickness. The theory was that the built-in longing for the environment human beings had evolved in was so strong, even in human beings who’d never been to that planet, that it might drive them to suicide.  Onway sat back and thought. Pining for Earth. Esterella hadn’t known what she yearned for, just that she missed something so deeply and terribly that she couldn’t stand to go on living.  Onway searched further for a cure. What therapies had other psychiatrists tried? She laughed out loud. Transporting a patient back to Earth had worked. The patient in question missed her family and her work but was apparently no longer suicidal.  Obviously, this was not a therapy that could be made available to every Earth-sick colonist. But maybe there were ways to fake Earth. Surely someone somewhere on Nueva Esperanza had planted an Earth garden, or maybe a holographic one might be available in an entertainment center. In fact, the most popular immersives on colony worlds were invariably set on Earth.  She called Esterella’s mother. “I’m sorry to bother you again, but do you know what immersives Esterella played?”  The mother sniffed. “I thought you were putting a stop to that. She liked to play them all day long, it drove me crazy. Although her room was less messy when she still played. I’ll get the house AI to send you a list. Is that all?”  “Yes, for now. Thank you.”  Had she forbidden or discouraged Esterella from playing games? Onway couldn’t remember. She pulled up recordings of their sessions and searched for keywords. She’d suggested to Esterella that she be present in the moment, to be aware of where she was and what she was doing, and not always dwell on the past or fear the future. Esterella had taken that as a suggestion to stop gaming. True, normally Onway wouldn’t advise nonstop gaming but instead encouraged patients to engage with the real world.  She needed to talk to someone who’d gamed since childhood and was now a functioning adult. What else?  The comparison between crèche- and family-raised children. Nobody had researched that yet. Typical. Onway set the AI to delve into raw data to compile a rough statistic. Another note: find a mental health researcher and talk to them.  She went to bed but couldn’t catch sleep. Meditation and relaxation exercises didn’t work. Finally, she padded to her closet and dug up her last resort, an old teddy bear from the Crèche, vacuum sealed so it wouldn’t lose any of its powerful scent. She zipped the seal open and inhaled the smells rising from Teddy’s filthy fur. Sweat, snot, tears, general dirt, struck matches, maybe a hint of vomit. The scent of the Crèche’s Dormitory 3. She told House to run the dormitory sound file. She finally fell asleep clutching Teddy to her chest and listening to the whispers and giggles and snores of long-grown-up children.  She woke the next morning still fighting the deep ache of discontent. She wasn’t catching Erdenweh, was she? Some diseases, psychological or not, could be transferred through contact. If most of your peers were obese or smoked, you had more chance of becoming obese or a smoker yourself. So it was with sadness or happiness, and this was not connected to your basic personality or your upbringing.  She should probably go visit some happy people. Only she couldn’t come up with any offhand. She didn’t have many friends. Still. Maybe she should look up some of her old crèche mates. She’d called Avonwy recently, hadn’t she, to check if anyone she knew was going to the crèche reunion? Her calendar offered proof this had been three years ago. Ouch. Without realizing it she’d indulged in unhealthy behavior. Dentist’s appointments. Behind. Was this how Erdenweh snuck up on people? How they gradually, imperceptibly, started to neglect their self-care?  She vowed to do better.  The AI had compiled a rough report from the available databases, but the data generally didn’t show if people had grown up in crèches or not. She asked it to assume people over fifty hadn’t, but that didn’t yield much. Also, most of the data were proprietary to the Office of Disease Control. Odd in a society that was organized by Participatory Democracy.  She called around until she found the epidemiologist responsible. He seemed sympathetic but would only promise to think about giving her access to data if she visited in person. She made an appointment to meet him over coffee. Today she had some room in her schedule, for one thing because she hadn’t yet filled in the 90-minute slot reserved for Esterella. Onway scrapped the hours she’d planned to devote to her crèche bill. It didn’t seem as urgent as it had last week.  She dressed carefully, aware that she might be unconsciously sending out signals to leave her alone, to be ignored. The House AI said she looked neat and professional compared to current social media photos, but that her haircut might need an update. Onway let its mechanical hands snip away. Short hair was practical but did require more maintenance. The AI offered the opinion that 58% of professionals her age and income bracket used makeup. She turned off further notifications on this subject. Idiot house brain. On second thought, she turned the notifications back on. She might put on makeup tomorrow.  They met at a local cafe. The epidemiologist introduced himself as Windi Haore. “Can you tell me again why you want these stats? What will you use them for?”  Onway explained her hunch about the differences in Erdenweh occurrence between crèche grown and family-grown children.  His large brown eyes widened even further. “So you’re saying that the crèche-grown actually have less Erdenweh sickness than the family-grown?” He seemed to relax. “That’s a refreshing change. I usually get exactly the opposite query, people who want to prove the crèche-grown are more prone to addiction, disease, crime, slacking, mis-pruning their roses, you name it.” Windi was actually quite handsome. The sun shone outside on the flowering hakkas, the coffee was good, she kind of liked him.  “I grew up in a crèche myself,” she said, carefully watching his reaction.  He could be one of these reverse reactionaries, who said they believed in equality but didn’t want to hear it from the people they wrote about. “You too?”  They smiled at each other. Onway knew she could trust him now, and presumably he felt the same.  “Okay, so what you need me to do is create a query about Erdenweh sufferers where I separate the crèche-grown from the family-grown. Right?”  “I think the criteria should be wider,” Onway said. “Include depression, eating disorders, ADHD, cutting, addictions, obesity.”  Windi’s eyebrows rose.  “All of those could be misdiagnosed crosswise,” she explained. “Erdenweh doesn’t have a protocol to officially diagnose it yet.”  Windi wrote on his slate. “Are you going to write the protocol?”  Onway stuck her hands behind her head. “God, maybe. Not right now, though. That’s paperwork for afterwards, if I get my finger behind what causes it. I have no idea yet, except this crèche hunch of mine.”  “So you don’t have Erdenweh?” Windi asked.  “That’s unsound reasoning,” she said absently. “I didn’t say none of the crèche-grown ever had it or never will have it. But I would have said I absolutely didn’t have it until yesterday, when I caught myself being a tad depressed.”  “About what?” Windi said.  Onway couldn’t believe she was talking about this to a relative stranger instead of her supervisory therapist. But she was. Might as well continue.  “I don’t know. Do I have Erdenweh? There’s no way to tell. Do you?”  Windi shrugged and smiled. “I don’t think so. I’ve overcome the challenges of my background. I’ve got a great job, enough friends, plenty of interests. What’s to be sad about?”  Onway tried to gauge her response. Had she secretly wanted him to have Erdenweh? Maybe. She did need subjects to question.  “Is there a way to contact patients diagnosed with Erdenweh and talk to them? Would it be ethical for you to give me their therapists’ addresses?”  Windi pulled a face. “I think that wouldn’t be a transgression, but I will have to check with the ethics officer. Did we cover everything? I have to get back to work.”  Onway took a hasty sip of her cooling coffee substitute. “I think so. But let me know if you have any thoughts or discover anything new besides the new statistic breakdown.”  “Sure.” Windi got up to leave. “Wait, I don’t know if you’re interested, but I’ve got a gaming party tonight, lots of crèche people coming. You interested?”  Onway didn’t really enjoy parties much.  “Come on, it’ll be fun. We’re doing an episode of the Nibelungen! You can’t not love that.”  “Is that an immersive and would that be set on Earth?” Onway asked.  “Wow, you’re a cultural barbarian. But yes and yes. So you’ll come?”  “I will. Send me the location. And thanks!”  That was her second goal for today sorted. An Earth-based immersive. She’d do a mood assessment before and afterwards. Good. Before she forgot, she whipped out her self-assessor and filled in the questions. She was feeling pretty good, although slightly flustered from all the decision and personal interaction. But that was normal for her. She checked out the cafe’s surroundings. An Earthy vibe, vaguely reminiscent of a thousand coffee shops from movies and games. The flowering hakka outside made it picturesque.  She upped the sunscreen on her suit and put up a foil umbrella for the walk to the hop stop. As she walked through the hakka, reaching about to her shoulders, she thought about the foolishness of human beings. When the ships first landed, the colonists had razed the hakka all over their prospected city site, so they could plant Earthlike shrubs and crops. The sun had killed them all. Now everyone was growing hakka again, for its wonderful shade, the mist of moisture that hung around it, the sheer joy of pink leaves and green flowers. But it would be generations before the hakka were as tall again as they had been. Foolishness.  It was only midday, but already she’d accomplished a lot. Socialized, work goals. Not bad for someone teetering on the edge of a depression. She didn’t feel like resting yet. What she wanted to do most of all was talk to another professional about Erdenweh. The most obvious choice would be her supervisor.  Onway made the call. Galilea being who she was, she picked up at the first ring and answered with her always warm and chipper voice.  “Of course, my dear Onway! For you I will always make time, isn’t that what supervisors are for? “  “Galilea, I have a patient with Erdenweh. I’ve found lots of conflicting material about that. Do you know anything about it? Have you encountered it?”  A long silence ensued. Finally Galilea spoke. “I had to think about the ethics for a moment. But yes, I have several patients with Erdenweh. I, too, have searched for recommended treatments but have been stumped to find good material.”  “Is there anything you can tell me about the patients, anything that might help me?” Onway went on.  “All patients are either still in the middle of treatment with no clear path to success yet or have terminated treatment.”  “Terminated how?” Onway asked.  “Found another therapist, one, by death, two.”  “Suicides?”  “Yes.”  Onway could sympathize with Galilea’s reluctance. It was never fun to admit you’d failed.  “What treatments were used?” Onway asked.  “Systemic therapy, trance writing, LSD, cognitive therapy . . . I would recommend against the latter. This mood disorder is not reachable by cognitive therapy. The usual drugs didn’t work either. I referred one of them to a psychiatrist licensed to prescribe. We’re in the beginning stages of identifying this new disease. We probably should start systematic trials.”  Onway nodded. “We should.”  She knew enough. Galilea had her finger in every therapist pie the planet had to offer. Her peers had not reached consensus about the origins and treatment of the disease, at least not here on Nueva Esperanza. Onway would have to find a solution, or at least the start to one, herself.  Onway found the game hall Windi and his friends rented. She introduced herself to Windi’s game group and got a quick intro into the game. She’d be playing a beginner’s version integrated with the rest of the group, who were all masters in this particular Game.  Onway settled herself in the booth, donned helmet and gloves, and connected. She chose the basic outfit for the game, seeing no point in spending time on wardrobe and avatar when she’d only be trying this once.  Windi sent her a message. “The best forest I have found here, because a lot of the game is in cities or oceans or castles, is the Teutoburger Forest. But your life will still be in danger. Best go as a German, all the Romans were killed.”  Onway had no idea what he was talking about, but Windi included some good pointers and gifted her with magical shields and something called a Tarn. All right. As for the avatar, tall, flaxen-haired warrior maiden was the cheapest choice available.  She found herself in a dark green forest, all hushed and empty. The light was cooler here, the temperature lower. Onway liked it. Briefly she tried to remember if Germany was anywhere near Holland, where one of her gene donors had come from, but she couldn’t remember. Better focus on the game.  As she walked, the moss underfoot squished pleasantly, and the game even managed an odor. She didn’t know if she liked it or not. It was vegetative, yeah, but not like anything she knew. It reminded her mostly of bathroom freshener. Her mood stayed the same, slightly frustrated, not quite caught up by the game. Maybe she ought to immerse herself deeper in, to reap the potential benefits of nature. She picked a direction. She was ready to encounter a foe or a village.  She concentrated on the Earth experience. She sniffed a branch, rubbed its rough skin against her cheek.  A burning pain pierced her body. She toppled backwards. The last thing she saw was a sleek bronze-pointed spear protruding from her sternum.  Onway tore her immersion helmet off and stomped off to the cafeteria. Her breastbone hurt, even though she knew it was psychosomatic. What a terrible game for experiencing Earth nature. It wasn’t really geared up for anything but killing or being killed. Windi didn’t seem to be a very trustworthy guide in game land.  An hour later Windi came out, flushed and happy. “Hey, I couldn’t find you! Did you have fun?”  “Not really,” Onway said. She’d managed to let go of her anger during several cups of green tea. “I don’t think this was the right game for my purpose. Is there anything less violent, more suitable to enjoying nature?”  “You didn’t like it? I though the forest was very well-rendered. Of course, they use actual footage of Earth as well.”  “I got killed by a spear through the heart about five minutes in,” Onway said, trying not to let the anger well back up. “The sensory experience was minimal, mostly visual. My mood didn’t really get a lift from this, but that might have been because of annoyance.”  Windi grimaced. “Sorry. Maybe you therapists should develop your own game, some Nature Experience thing. For people to meditate to.”  Onway was pretty sure she’d tried most meditation apps already. Some of them had comparable depth of experience to the History Game, but she’d never noticed any great effect before.  Or maybe the eyes weren’t the key to nature’s soothing effect. Otherwise you could just change your wallpaper to a restful Earth vista. The nose might be a more likely prospect. Or touch.  What should her next steps be? Nueva Esperanza had a Botanical Garden, which scientists had planted from Earth seeds in a separate climate- and gravity-controlled dome. She could still fit that in today.  She arrived an hour before final admission. The first sniff of garden air told her that something was different. To her eyes, the Botanical Garden didn’t look that different from the Game, but her nose, her skin, the soles of her feet told a different story. The extra layer of realness created a greater intensity than she’d expected. She couldn’t identify the many new smells, but she loved them. As if something inside her had already known about them.  Even the gravity was easy to adjust to, far easier than she remembered from her one trip to one of the habitats in orbit. How could this be? She’d been decanted and raised right here on Nueva Esperanza, she’d never been to Earth.  Her suit pinged. “Safe environment detected. Do you want me to turn off?”  Onway looked up at the dome. It was painted so the sky looked blue instead of green and clouds scudded gently overhead. Like in a painting or a movie.  “Sure,” she said.  The feeling on her skin intensified. A waft of air caressed her like a lover’s hand. It was perfumed ever so gently, but so effectively that she couldn’t help but breathe in deeply. Such a good smell. What was it? She’d always thought rain on hakka smelled nice, but this was that same goodness multiplied a thousand times.  She imagined receptors in her nose waking up and getting to work for the first time ever. They must be overjoyed at finally getting a snootful of the right stuff. Because this was the right stuff, no doubt about it.  The Botanical Garden Knowledge Guide suggested taking a walk around the garden. Thrilled and delirious with new sensations, Onway agreed without even thinking about it. Setting one foot in front of the other, with no suit on, no gravitational dampers, was simply amazing. She wanted this at home. Her arms swung higher than usual, her breasts bounced gently, her hair ruffled in the breeze, happy to be touched.  The grass shone so green and looked so much more inviting than the living carpet she had at home, that also called itself grass. The carpet was the shadow on the cave wall, this was the real fire.  She forced herself to call up some stats. Science first, enjoyment later. The Botanical Garden sent out a quarterly review that, besides excited blogs about budding blooms, complained constantly about lack of funding and lack of volunteers. Species of bugs, worms, and other animal life: 145. Species of plants: 451. Fungi: 43. What did she need to know? It wasn’t her field, so it was hard to interpret the data. But even if you weren’t a biologist or ecologist, the list seemed pretty sparse on the non-plant side. So how were Earth plants thriving in this alien environment?  She leafed through more bubbly quarterlies, and the repetition of the item “restocking” became apparent. The yearly financial reports stated that as the biggest expenditure after personnel. Now she was ready to ask the head gardener, or whatever one called such a person in an extraterrestrial academic setting, some questions. Onway found Botanic Garden Director Choi in her office, busy but willing to talk to Onway as a fellow scientist.  Onway put some thought into the phrasing of her first question. “How well do you think Earth organisms are thriving on this planet?”  The director sat up straighter. “Excellent question,” she said. “We keep restocking the failing species, and we import soil from the relevant ecological areas. We started out with an eclectic selection of regions, to show Earth in its diversity like Earth-based botanic gardens do. But it got too expensive, and we needed to charge the ecological load more heavily. But my personal opinion? It’s not working, it’s never going to work. For all our knowledge, we still don’t have a complete picture of the cooperation between animal, plant, and fungal kingdoms. We will always miss some crucial species, either because they died out in the Great Extinction last century, or because we just don’t know about their vital role.”  “So do you have any animals except bugs and worms? I didn’t see any. Like birds?” Onway dug deep in her childhood memories. “Toads? Badgers?”  Mx. Choi laughed hollowly. “We got a donation of two rabbits and two pigeons. Talking about hardy species that everybody kind of expected to overrun the environment. We had extinction-level diseases ready for them. But they just grew weak and listless and died. Maybe we should have tried rats.”  “So no bigger animals of any kind?”  Choi shook her head. “Even if we got funds for them, I refuse to bring in any more animals. It would be cruelty.”  Onway leaned forward. “What about humans? Aren’t we a kind of animal?”  Choi crossed her arms. “Ah. That’s what you’re really here for. Well, I’m not specialized in human beings and their ecology, but I wouldn’t be surprised if we were failing and dying just like the animals.”  “Why? We’re not in symbiosis with any animals, are we? I mean we have cats and dogs. I should probably look into how those are doing, too.”  “You’re wrong about the symbiosis,” Choi says. “We humans are in partnership with an enormous population of bacteria, in our gut, on our skin, we even have mites on our eyelashes. We aren’t a singular species, no vertebrate is. We contain multitudes, and those are failing. Did you know that the first-ever batch of colonists died because we scrubbed them too clean? That was the Greendream expedition.  “Now we know better. There’s a heredity tree for the colonists. They were selected, among other things, for gut biome diversity. I know crèche babies get a bath in vaginal bacteria, and doses of breast milk cultures in their food. I think there must be someone doing regular checkups and adding to the biome heredity tracker. Because we know it’s important. But yeah, I’m afraid we’re going to go the way of the rabbits. Eventually.”  “I think I’m starting to get somewhere,” Onway said. “Thanks so much for your help!”  “My pleasure.” Choi said. “Otherwise I just sit here and watch living things die. Let me know if you get any results, will you? I’d love to hear about it.”  “I loved being here. The smell is wonderful.”  Choi snorted. “You should visit Earth, a real wild environment. That doesn’t just have nice smells, like grass and flowers and petrichor, but also lots of stinks, fungi, decaying plants, dead animals, excrement in thousand variations. Then you get a real smell, a full, layered, earthy smell. The result of millions of years of decay and excrement saturating the soil and the air.”  Maybe Choi didn’t realize how un-idyllic, and quite frankly gross, she made Earth sound.  Choi walked Onway to the exit, chatting about her work at the Botanical Garden. “By the way, did you read that study someone on Earth did about the failure to recreate Earth’s large mammals after the Great Extinction? It’s called the Jurassic Park syndrome, God knows why. Meaning, you can reconstitute a living creature from eggs and cleverly combined DNA, but without a herd of cows to mother a calf, without the culture of cows that the mother and the herd should have given it, it will never become a successful cow, it will always remain psychotic and depressed and will die young? I think there’s a footnote about crèche babies on colony worlds. It predicts wide scale murders and suicides. Hahaha! Bye.”  Onway staggered to the bus stop, reeling from Choi’s offhand remark. Dying biomes and Jurassic Park syndrome. Which of them was killing people, or did they both contribute? Did this mean that crèche kids were unsuccessful cows? Not fully human, incapable of being human? She didn’t want to believe it.  She was long back on the bus when she realized maybe Choi had offered her a chance at friendship or more, but she’d been so unsettled about the Jurassic Park remark that she hadn’t reacted. She hadn’t even asked Choi’s first name. God, she was always so slow at these things in her personal life. With her patients she’d have been on it like a fly on ointment. What was even a fly? Or ointment?  Back home, she called Windi back at once. She knew only yesterday she would have postponed it, maybe even for days. Was she healing, and if so, what had caused it? Her visit to the Garden, or the gaming? Or the act of being outside, walking, seeing people? All of those things could mitigate depression.  “Windi? It’s me, Onway. Can you access a thing called the biome heredity tracking database? You could add that to any comparisons you make between crèche and natural birth people. Call me. Bye.”  But actually, that would point to decanted children being more vulnerable to depression and diseases since they lacked the full protection of vaginal birth and mother’s milk flora. Because she worked in the crèche for years, as well as growing up there, she knew that rules and regulations were followed if possible, but funds, resources, and time weren’t always available. So how often had she really had a dose of mother’s milk flora? Grown, as Choi had said, from volunteer donations? And did those really work the same as actual mother’s milk?  She noted down the leads she should follow up on. But first she was going to read that Jurassic Park article. It was a good read, but there was no footnote about crèche babies. Maybe it was only Choi who made that jump. Maybe an ecologist didn’t view human beings as unique creatures but just another species of mammal. And the crèche babies had had human caregivers and many robots and AI to fill the gap of human cultural transfer.  There was something else. Onway replayed the last things Choi had said. No, not the Jurassic Park mention, she already tracked that down. Oh, there it was. That casual remark about real smells. That without death and decay it wasn’t real. Something about it triggered a nascent thought, but she couldn’t put her finger on it yet.  Windi called. “Not only does our institute have a subscription to that database, but also there have been several studies done on the evolution of the colonial gut biome.”  “And?”  “It’s more of a devolution. Every time there’s a cross (that’s a baby, in your language), they hoped for a mixing of strains, creating new and viable offspring, but instead the variety has gone down in the second generation. The third and fourth generations are worse. It’s not looking good. I can feel my guts churning. I know that’s my imagination, but it’s also a nasty feeling about the future of NE. Or any colony.”  No, discovering that you were part of a test population wasn’t particularly fun. “And anything about differences between crèche and naturally born children?”  “Yes. They knew they were taking a risk in decanting children, the bastards, so they tested every decanted baby. Our results are worse.”  Onway swallowed. It was one thing to have concluded that raising batches of children in crèches wasn’t a good thing after the fact. But that the colonial foremothers had suspected something like this might happen made it many times worse. So cold and calculating. As if crèche children weren’t real humans. Unsuccessful cows her ass.  “Weren’t they worried about the future of their colony? “  “They assumed, and I quote ‘Natural breeding would overtake the feebler vitality of the artificially raised children.’”  “Fuckers.”  “Yeah.”  “I’m almost feeling vindicated that the descendants of the fuckers are having trouble with lack of vitality themselves,” Onway said.  She told Windi about her talk with Choi and the woman’s somber predictions about the viability of Earth life on strange planets.  “What’s the next step?” she said. Her newfound sense of purpose had left her, and she was tired and headachy. It was great to have found the culprit for Erdenweh, but realizing the inevitability of the terrible outcome drained any sense of victory.  “Me and some of the gamers, who are crèche kids just like us, pooled our resources and we hired an AI to do a query on the data we can gather. The job’s queued.”  “Okay. Call me when you get some. I found out some things, but I’m beat.”  Onway got into bed with a snack. She was going to need Teddy again tonight.  Onway woke with a clear head and more energy than she’d had in days. Somewhere in the basement of her brain something was brewing. She knew to leave it alone and let the thoughts stew beneath a surface stream of routine actions.  She arrived at the crèche earlier than usual and almost gagged at the musty odors. She arrived before the cleaners, and a day and a night of children playing, pooping, peeing, vomiting, and eating has left an aroma which Choi might call layered and earthy. A real stench.  The thought arrived with a pop and a flash. That was it. Why hadn’t she seen that before? The crèche was dirty. Deeply filthy, with layers and layers of insufficient cleaning, built up over decades. Children never washed their hands well enough, and there were never enough carers to make sure they did. A layer of old poop and snot and saliva and every possible bodily fluid covered the crèche.  That had to be the reason these children had less Erdenweh. Their gut flora and other symbionts replenished themselves continuously in the gentle cloud of effluvia that floated around in the building, embedded in the cutlery and the pots and pans, the sheets, the hand-me-down clothes.  On Earth people lived in a soup of organic molecules present everywhere, in the air, the soil, the wind, the seas, the rivers. The colonists arrived scrubbed clean on a world empty of not only humans, but of the billions of years of human evolution, billions of years where trillions of creatures lived and shat and died.  Here on Nueva Esperanza there was nothing yet. Clean, printed houses. Automated cleaning robots. Recycle your clothing and print new ones. Everything sterile.  Except here, in the richly dirty and chaotic surroundings of the crèche. Deprivation never tasted so sweet.  A sleepy, grubby child stumbled by on its way to the toilet.  Onway bent down to hug it. “You’re the best thing I’ve seen all day!” She smacked a kiss on its grubby cheek. Grow, microbes, grow, migrate to my gut, regulate my moods, make me able to withstand the vagaries of my life.  Filth. Who knew it could be so beautiful? Bo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "text": "6020 words, short story\nErdenweh\nOnway dreaded the condolence visit, but still she hurried to the front door. It was never wise to expose yourself to Nueva Esperanza sun for long, even with skin as dark as hers.\n“Mx. Tschiao, I’m Onway Jansen, your daughter’s psychiatrist. My deepest condolences. May I come in?”\nThe mother’s haggard face darkened with emotion. Onway had come prepared for that. It was her responsibility as a psychiatrist to bear the anger that the bereaved would direct to her. This wasn’t the first condolence visit she’d had to pay. An epidemic of suicides raged on Nueva Esperanza and psychiatrists struggled right in the thick of it.\nOnway thought she’d finally gained some headway with Esterella. Until the girl killed herself.\nThe mother quickly quelled her anger and gestured her inside. Onway recognized the mechanism. The daughter had always suppressed her emotions exactly like that, first welling up, then tamped down and put away to save face in public.\nThe mother gestured Onway into a chair and slammed down a cup of coffee. “How did this happen? You were supposed to make her better! It’s your fault.” The mother broke down weeping.\nAnger often masked grief. Better to let it out.\n“She was such a lovely girl. There were no worries in her life, her grades were good, she had lots of friends. She had you! She liked you, she said the therapy was helping.”\nAnd yet during therapy sessions Esterella had expressed deep sadness and lack of meaning in her life. What had been missing? They hadn’t gotten to the bottom of it yet. And now they never would.\nOnway let the mother talk and observed her surroundings. The furniture was all printed, light and modern, nothing made from native wood or grasses. Extremely neat. A wet cloth and a bottle of cleaning spray stood ready on a corner of the spotless coffee table.\nShe picked up her coffee for a sip. She set the cup down again. The mother lunged for the cleaning cloth and wiped down the circular stain where Onway hadn’t set her cup back down in the exact same spot. Good, grieving people often neglected basic care for home and self.\nOnway’s next stop was the weekly visit to Children’s Crèche the Little Ducklings. She stepped into the hallway, empty at this time of day, and found her way to the little office on the second floor. The walls and floors were scuffed and grimy, coats and hats and children’s toys spread everywhere. Even now, when adult labor was less scarce than in Onway’s childhood, it was apparently impossible to keep up with children’s mess. A smile warmed her cheeks.\nThe children’s home always made her happy, in some illogical way. She’d hated living here. She’d felt like a second-class citizen, created from random sperm donors from Earth and batch-decanted here on the new colony. All so the scientists from the colony ship wouldn’t have to have twelve children each. Onway didn’t disagree with the method, since anything else would probably have heralded in a renewed suppression of women, but she had disliked intensely how it felt.\nAnd yet every time she came here, she felt her muscles loosen and her cares lighten. Funny how people worked. In fact, she was a member of a committee that wanted to stop the batch-decanting of babies and make it mandatory to raise one test-tube child per family for every natural born one. She had never for a moment doubted that the committee was important, so she wholeheartedly donated her time and effort to draft bills for the citizens’ parliament.\nBut coming straight from Esterella’s ordinary, sanitized home to this comfortable, dirty environment she wondered. What benefited a child most? How did one measure that? Look at herself. Even after a childhood remembered as miserable, she’d still turned out all right.\nShe worked the rest of the day with her groups and individual sessions. The children were mostly healthy and happy, but there were always a few with concentration issues or suffering from bullying or a difficult puberty.\nThe morning’s painful start had made Onway think. Were these children really all right? Was the detection system good enough? Was it up to date, was it smart enough? Was Onway herself really doing all she could? She made a note to schedule a once-yearly check on all the children.\nStill. She couldn’t shake the feeling that these children were doing better than a lot of children in nice, big, clean homes with doting parents. Or at least available parents, present parents, good-enough parents. In a group home, at most you had group leaders for fifteen children, one for the day and one for the night. As she remembered it, most of the group leaders were sadly unimportant or uninspiring. The children’s own communities, especially the secret ones, had provided most of the love and support.\nShe needed to research this. The feelings of a single therapist counted for nothing, she needed citywide stats. Or preferably, planetwide stats.\nAt home she wolfed down a quick printed meal while she set her house AI to searching. The amount of material that scrolled by as she chewed and swallowed was astounding. Planetwide? Hah! A rise in suicides had been reported on all colony planets.\nThey were calling it Erdenweh, Earth-sickness. The theory was that the built-in longing for the environment human beings had evolved in was so strong, even in human beings who’d never been to that planet, that it might drive them to suicide.\nOnway sat back and thought. Pining for Earth. Esterella hadn’t known what she yearned for, just that she missed something so deeply and terribly that she couldn’t stand to go on living.\nOnway searched further for a cure. What therapies had other psychiatrists tried? She laughed out loud. Transporting a patient back to Earth had worked. The patient in question missed her family and her work but was apparently no longer suicidal.\nObviously, this was not a therapy that could be made available to every Earth-sick colonist. But maybe there were ways to fake Earth. Surely someone somewhere on Nueva Esperanza had planted an Earth garden, or maybe a holographic one might be available in an entertainment center. In fact, the most popular immersives on colony worlds were invariably set on Earth.\nShe called Esterella’s mother. “I’m sorry to bother you again, but do you know what immersives Esterella played?”\nThe mother sniffed. “I thought you were putting a stop to that. She liked to play them all day long, it drove me crazy. Although her room was less messy when she still played. I’ll get the house AI to send you a list. Is that all?”\n“Yes, for now. Thank you.”\nHad she forbidden or discouraged Esterella from playing games? Onway couldn’t remember. She pulled up recordings of their sessions and searched for keywords. She’d suggested to Esterella that she be present in the moment, to be aware of where she was and what she was doing, and not always dwell on the past or fear the future. Esterella had taken that as a suggestion to stop gaming. True, normally Onway wouldn’t advise nonstop gaming but instead encouraged patients to engage with the real world.\nShe needed to talk to someone who’d gamed since childhood and was now a functioning adult. What else?\nThe comparison between crèche- and family-raised children. Nobody had researched that yet. Typical. Onway set the AI to delve into raw data to compile a rough statistic. Another note: find a mental health researcher and talk to them.\nShe went to bed but couldn’t catch sleep. Meditation and relaxation exercises didn’t work. Finally, she padded to her closet and dug up her last resort, an old teddy bear from the Crèche, vacuum sealed so it wouldn’t lose any of its powerful scent. She zipped the seal open and inhaled the smells rising from Teddy’s filthy fur. Sweat, snot, tears, general dirt, struck matches, maybe a hint of vomit. The scent of the Crèche’s Dormitory 3. She told House to run the dormitory sound file. She finally fell asleep clutching Teddy to her chest and listening to the whispers and giggles and snores of long-grown-up children.\nShe woke the next morning still fighting the deep ache of discontent. She wasn’t catching Erdenweh, was she? Some diseases, psychological or not, could be transferred through contact. If most of your peers were obese or smoked, you had more chance of becoming obese or a smoker yourself. So it was with sadness or happiness, and this was not connected to your basic personality or your upbringing.\nShe should probably go visit some happy people. Only she couldn’t come up with any offhand. She didn’t have many friends. Still. Maybe she should look up some of her old crèche mates. She’d called Avonwy recently, hadn’t she, to check if anyone she knew was going to the crèche reunion? Her calendar offered proof this had been three years ago. Ouch. Without realizing it she’d indulged in unhealthy behavior. Dentist’s appointments. Behind. Was this how Erdenweh snuck up on people? How they gradually, imperceptibly, started to neglect their self-care?\nShe vowed to do better.\nThe AI had compiled a rough report from the available databases, but the data generally didn’t show if people had grown up in crèches or not. She asked it to assume people over fifty hadn’t, but that didn’t yield much. Also, most of the data were proprietary to the Office of Disease Control. Odd in a society that was organized by Participatory Democracy.\nShe called around until she found the epidemiologist responsible. He seemed sympathetic but would only promise to think about giving her access to data if she visited in person. She made an appointment to meet him over coffee. Today she had some room in her schedule, for one thing because she hadn’t yet filled in the 90-minute slot reserved for Esterella. Onway scrapped the hours she’d planned to devote to her crèche bill. It didn’t seem as urgent as it had last week.\nShe dressed carefully, aware that she might be unconsciously sending out signals to leave her alone, to be ignored. The House AI said she looked neat and professional compared to current social media photos, but that her haircut might need an update. Onway let its mechanical hands snip away. Short hair was practical but did require more maintenance. The AI offered the opinion that 58% of professionals her age and income bracket used makeup. She turned off further notifications on this subject. Idiot house brain. On second thought, she turned the notifications back on. She might put on makeup tomorrow.\nThey met at a local cafe. The epidemiologist introduced himself as Windi Haore. “Can you tell me again why you want these stats? What will you use them for?”\nOnway explained her hunch about the differences in Erdenweh occurrence between crèche grown and family-grown children.\nHis large brown eyes widened even further. “So you’re saying that the crèche-grown actually have less Erdenweh sickness than the family-grown?” He seemed to relax. “That’s a refreshing change. I usually get exactly the opposite query, people who want to prove the crèche-grown are more prone to addiction, disease, crime, slacking, mis-pruning their roses, you name it.” Windi was actually quite handsome. The sun shone outside on the flowering hakkas, the coffee was good, she kind of liked him.\n“I grew up in a crèche myself,” she said, carefully watching his reaction.\nHe could be one of these reverse reactionaries, who said they believed in equality but didn’t want to hear it from the people they wrote about. “You too?”\nThey smiled at each other. Onway knew she could trust him now, and presumably he felt the same.\n“Okay, so what you need me to do is create a query about Erdenweh sufferers where I separate the crèche-grown from the family-grown. Right?”\n“I think the criteria should be wider,” Onway said. “Include depression, eating disorders, ADHD, cutting, addictions, obesity.”\nWindi’s eyebrows rose.\n“All of those could be misdiagnosed crosswise,” she explained. “Erdenweh doesn’t have a protocol to officially diagnose it yet.”\nWindi wrote on his slate. “Are you going to write the protocol?”\nOnway stuck her hands behind her head. “God, maybe. Not right now, though. That’s paperwork for afterwards, if I get my finger behind what causes it. I have no idea yet, except this crèche hunch of mine.”\n“So you don’t have Erdenweh?” Windi asked.\n“That’s unsound reasoning,” she said absently. “I didn’t say none of the crèche-grown ever had it or never will have it. But I would have said I absolutely didn’t have it until yesterday, when I caught myself being a tad depressed.”\n“About what?” Windi said.\nOnway couldn’t believe she was talking about this to a relative stranger instead of her supervisory therapist. But she was. Might as well continue.\n“I don’t know. Do I have Erdenweh? There’s no way to tell. Do you?”\nWindi shrugged and smiled. “I don’t think so. I’ve overcome the challenges of my background. I’ve got a great job, enough friends, plenty of interests. What’s to be sad about?”\nOnway tried to gauge her response. Had she secretly wanted him to have Erdenweh? Maybe. She did need subjects to question.\n“Is there a way to contact patients diagnosed with Erdenweh and talk to them? Would it be ethical for you to give me their therapists’ addresses?”\nWindi pulled a face. “I think that wouldn’t be a transgression, but I will have to check with the ethics officer. Did we cover everything? I have to get back to work.”\nOnway took a hasty sip of her cooling coffee substitute. “I think so. But let me know if you have any thoughts or discover anything new besides the new statistic breakdown.”\n“Sure.” Windi got up to leave. “Wait, I don’t know if you’re interested, but I’ve got a gaming party tonight, lots of crèche people coming. You interested?”\nOnway didn’t really enjoy parties much.\n“Come on, it’ll be fun. We’re doing an episode of the Nibelungen! You can’t not love that.”\n“Is that an immersive and would that be set on Earth?” Onway asked.\n“Wow, you’re a cultural barbarian. But yes and yes. So you’ll come?”\n“I will. Send me the location. And thanks!”\nThat was her second goal for today sorted. An Earth-based immersive. She’d do a mood assessment before and afterwards. Good. Before she forgot, she whipped out her self-assessor and filled in the questions. She was feeling pretty good, although slightly flustered from all the decision and personal interaction. But that was normal for her. She checked out the cafe’s surroundings. An Earthy vibe, vaguely reminiscent of a thousand coffee shops from movies and games. The flowering hakka outside made it picturesque.\nShe upped the sunscreen on her suit and put up a foil umbrella for the walk to the hop stop. As she walked through the hakka, reaching about to her shoulders, she thought about the foolishness of human beings. When the ships first landed, the colonists had razed the hakka all over their prospected city site, so they could plant Earthlike shrubs and crops. The sun had killed them all. Now everyone was growing hakka again, for its wonderful shade, the mist of moisture that hung around it, the sheer joy of pink leaves and green flowers. But it would be generations before the hakka were as tall again as they had been. Foolishness.\nIt was only midday, but already she’d accomplished a lot. Socialized, work goals. Not bad for someone teetering on the edge of a depression. She didn’t feel like resting yet. What she wanted to do most of all was talk to another professional about Erdenweh. The most obvious choice would be her supervisor.\nOnway made the call. Galilea being who she was, she picked up at the first ring and answered with her always warm and chipper voice.\n“Of course, my dear Onway! For you I will always make time, isn’t that what supervisors are for? “\n“Galilea, I have a patient with Erdenweh. I’ve found lots of conflicting material about that. Do you know anything about it? Have you encountered it?”\nA long silence ensued. Finally Galilea spoke. “I had to think about the ethics for a moment. But yes, I have several patients with Erdenweh. I, too, have searched for recommended treatments but have been stumped to find good material.”\n“Is there anything you can tell me about the patients, anything that might help me?” Onway went on.\n“All patients are either still in the middle of treatment with no clear path to success yet or have terminated treatment.”\n“Terminated how?” Onway asked.\n“Found another therapist, one, by death, two.”\n“Suicides?”\n“Yes.”\nOnway could sympathize with Galilea’s reluctance. It was never fun to admit you’d failed.\n“What treatments were used?” Onway asked.\n“Systemic therapy, trance writing, LSD, cognitive therapy . . . I would recommend against the latter. This mood disorder is not reachable by cognitive therapy. The usual drugs didn’t work either. I referred one of them to a psychiatrist licensed to prescribe. We’re in the beginning stages of identifying this new disease. We probably should start systematic trials.”\nOnway nodded. “We should.”\nShe knew enough. Galilea had her finger in every therapist pie the planet had to offer. Her peers had not reached consensus about the origins and treatment of the disease, at least not here on Nueva Esperanza. Onway would have to find a solution, or at least the start to one, herself.\nOnway found the game hall Windi and his friends rented. She introduced herself to Windi’s game group and got a quick intro into the game. She’d be playing a beginner’s version integrated with the rest of the group, who were all masters in this particular Game.\nOnway settled herself in the booth, donned helmet and gloves, and connected. She chose the basic outfit for the game, seeing no point in spending time on wardrobe and avatar when she’d only be trying this once.\nWindi sent her a message. “The best forest I have found here, because a lot of the game is in cities or oceans or castles, is the Teutoburger Forest. But your life will still be in danger. Best go as a German, all the Romans were killed.”\nOnway had no idea what he was talking about, but Windi included some good pointers and gifted her with magical shields and something called a Tarn. All right. As for the avatar, tall, flaxen-haired warrior maiden was the cheapest choice available.\nShe found herself in a dark green forest, all hushed and empty. The light was cooler here, the temperature lower. Onway liked it. Briefly she tried to remember if Germany was anywhere near Holland, where one of her gene donors had come from, but she couldn’t remember. Better focus on the game.\nAs she walked, the moss underfoot squished pleasantly, and the game even managed an odor. She didn’t know if she liked it or not. It was vegetative, yeah, but not like anything she knew. It reminded her mostly of bathroom freshener. Her mood stayed the same, slightly frustrated, not quite caught up by the game. Maybe she ought to immerse herself deeper in, to reap the potential benefits of nature. She picked a direction. She was ready to encounter a foe or a village.\nShe concentrated on the Earth experience. She sniffed a branch, rubbed its rough skin against her cheek.\nA burning pain pierced her body. She toppled backwards. The last thing she saw was a sleek bronze-pointed spear protruding from her sternum.\nOnway tore her immersion helmet off and stomped off to the cafeteria. Her breastbone hurt, even though she knew it was psychosomatic. What a terrible game for experiencing Earth nature. It wasn’t really geared up for anything but killing or being killed. Windi didn’t seem to be a very trustworthy guide in game land.\nAn hour later Windi came out, flushed and happy. “Hey, I couldn’t find you! Did you have fun?”\n“Not really,” Onway said. She’d managed to let go of her anger during several cups of green tea. “I don’t think this was the right game for my purpose. Is there anything less violent, more suitable to enjoying nature?”\n“You didn’t like it? I though the forest was very well-rendered. Of course, they use actual footage of Earth as well.”\n“I got killed by a spear through the heart about five minutes in,” Onway said, trying not to let the anger well back up. “The sensory experience was minimal, mostly visual. My mood didn’t really get a lift from this, but that might have been because of annoyance.”\nWindi grimaced. “Sorry. Maybe you therapists should develop your own game, some Nature Experience thing. For people to meditate to.”\nOnway was pretty sure she’d tried most meditation apps already. Some of them had comparable depth of experience to the History Game, but she’d never noticed any great effect before.\nOr maybe the eyes weren’t the key to nature’s soothing effect. Otherwise you could just change your wallpaper to a restful Earth vista. The nose might be a more likely prospect. Or touch.\nWhat should her next steps be? Nueva Esperanza had a Botanical Garden, which scientists had planted from Earth seeds in a separate climate- and gravity-controlled dome. She could still fit that in today.\nShe arrived an hour before final admission. The first sniff of garden air told her that something was different. To her eyes, the Botanical Garden didn’t look that different from the Game, but her nose, her skin, the soles of her feet told a different story. The extra layer of realness created a greater intensity than she’d expected. She couldn’t identify the many new smells, but she loved them. As if something inside her had already known about them.\nEven the gravity was easy to adjust to, far easier than she remembered from her one trip to one of the habitats in orbit. How could this be? She’d been decanted and raised right here on Nueva Esperanza, she’d never been to Earth.\nHer suit pinged. “Safe environment detected. Do you want me to turn off?”\nOnway looked up at the dome. It was painted so the sky looked blue instead of green and clouds scudded gently overhead. Like in a painting or a movie.\n“Sure,” she said.\nThe feeling on her skin intensified. A waft of air caressed her like a lover’s hand. It was perfumed ever so gently, but so effectively that she couldn’t help but breathe in deeply. Such a good smell. What was it? She’d always thought rain on hakka smelled nice, but this was that same goodness multiplied a thousand times.\nShe imagined receptors in her nose waking up and getting to work for the first time ever. They must be overjoyed at finally getting a snootful of the right stuff. Because this was the right stuff, no doubt about it.\nThe Botanical Garden Knowledge Guide suggested taking a walk around the garden. Thrilled and delirious with new sensations, Onway agreed without even thinking about it. Setting one foot in front of the other, with no suit on, no gravitational dampers, was simply amazing. She wanted this at home. Her arms swung higher than usual, her breasts bounced gently, her hair ruffled in the breeze, happy to be touched.\nThe grass shone so green and looked so much more inviting than the living carpet she had at home, that also called itself grass. The carpet was the shadow on the cave wall, this was the real fire.\nShe forced herself to call up some stats. Science first, enjoyment later. The Botanical Garden sent out a quarterly review that, besides excited blogs about budding blooms, complained constantly about lack of funding and lack of volunteers. Species of bugs, worms, and other animal life: 145. Species of plants: 451. Fungi: 43. What did she need to know? It wasn’t her field, so it was hard to interpret the data. But even if you weren’t a biologist or ecologist, the list seemed pretty sparse on the non-plant side. So how were Earth plants thriving in this alien environment?\nShe leafed through more bubbly quarterlies, and the repetition of the item “restocking” became apparent. The yearly financial reports stated that as the biggest expenditure after personnel. Now she was ready to ask the head gardener, or whatever one called such a person in an extraterrestrial academic setting, some questions. Onway found Botanic Garden Director Choi in her office, busy but willing to talk to Onway as a fellow scientist.\nOnway put some thought into the phrasing of her first question. “How well do you think Earth organisms are thriving on this planet?”\nThe director sat up straighter. “Excellent question,” she said. “We keep restocking the failing species, and we import soil from the relevant ecological areas. We started out with an eclectic selection of regions, to show Earth in its diversity like Earth-based botanic gardens do. But it got too expensive, and we needed to charge the ecological load more heavily. But my personal opinion? It’s not working, it’s never going to work. For all our knowledge, we still don’t have a complete picture of the cooperation between animal, plant, and fungal kingdoms. We will always miss some crucial species, either because they died out in the Great Extinction last century, or because we just don’t know about their vital role.”\n“So do you have any animals except bugs and worms? I didn’t see any. Like birds?” Onway dug deep in her childhood memories. “Toads? Badgers?”\nMx. Choi laughed hollowly. “We got a donation of two rabbits and two pigeons. Talking about hardy species that everybody kind of expected to overrun the environment. We had extinction-level diseases ready for them. But they just grew weak and listless and died. Maybe we should have tried rats.”\n“So no bigger animals of any kind?”\nChoi shook her head. “Even if we got funds for them, I refuse to bring in any more animals. It would be cruelty.”\nOnway leaned forward. “What about humans? Aren’t we a kind of animal?”\nChoi crossed her arms. “Ah. That’s what you’re really here for. Well, I’m not specialized in human beings and their ecology, but I wouldn’t be surprised if we were failing and dying just like the animals.”\n“Why? We’re not in symbiosis with any animals, are we? I mean we have cats and dogs. I should probably look into how those are doing, too.”\n“You’re wrong about the symbiosis,” Choi says. “We humans are in partnership with an enormous population of bacteria, in our gut, on our skin, we even have mites on our eyelashes. We aren’t a singular species, no vertebrate is. We contain multitudes, and those are failing. Did you know that the first-ever batch of colonists died because we scrubbed them too clean? That was the Greendream expedition.\n“Now we know better. There’s a heredity tree for the colonists. They were selected, among other things, for gut biome diversity. I know crèche babies get a bath in vaginal bacteria, and doses of breast milk cultures in their food. I think there must be someone doing regular checkups and adding to the biome heredity tracker. Because we know it’s important. But yeah, I’m afraid we’re going to go the way of the rabbits. Eventually.”\n“I think I’m starting to get somewhere,” Onway said. “Thanks so much for your help!”\n“My pleasure.” Choi said. “Otherwise I just sit here and watch living things die. Let me know if you get any results, will you? I’d love to hear about it.”\n“I loved being here. The smell is wonderful.”\nChoi snorted. “You should visit Earth, a real wild environment. That doesn’t just have nice smells, like grass and flowers and petrichor, but also lots of stinks, fungi, decaying plants, dead animals, excrement in thousand variations. Then you get a real smell, a full, layered, earthy smell. The result of millions of years of decay and excrement saturating the soil and the air.”\nMaybe Choi didn’t realize how un-idyllic, and quite frankly gross, she made Earth sound.\nChoi walked Onway to the exit, chatting about her work at the Botanical Garden. “By the way, did you read that study someone on Earth did about the failure to recreate Earth’s large mammals after the Great Extinction? It’s called the Jurassic Park syndrome, God knows why. Meaning, you can reconstitute a living creature from eggs and cleverly combined DNA, but without a herd of cows to mother a calf, without the culture of cows that the mother and the herd should have given it, it will never become a successful cow, it will always remain psychotic and depressed and will die young? I think there’s a footnote about crèche babies on colony worlds. It predicts wide scale murders and suicides. Hahaha! Bye.”\nOnway staggered to the bus stop, reeling from Choi’s offhand remark. Dying biomes and Jurassic Park syndrome. Which of them was killing people, or did they both contribute? Did this mean that crèche kids were unsuccessful cows? Not fully human, incapable of being human? She didn’t want to believe it.\nShe was long back on the bus when she realized maybe Choi had offered her a chance at friendship or more, but she’d been so unsettled about the Jurassic Park remark that she hadn’t reacted. She hadn’t even asked Choi’s first name. God, she was always so slow at these things in her personal life. With her patients she’d have been on it like a fly on ointment. What was even a fly? Or ointment?\nBack home, she called Windi back at once. She knew only yesterday she would have postponed it, maybe even for days. Was she healing, and if so, what had caused it? Her visit to the Garden, or the gaming? Or the act of being outside, walking, seeing people? All of those things could mitigate depression.\n“Windi? It’s me, Onway. Can you access a thing called the biome heredity tracking database? You could add that to any comparisons you make between crèche and natural birth people. Call me. Bye.”\nBut actually, that would point to decanted children being more vulnerable to depression and diseases since they lacked the full protection of vaginal birth and mother’s milk flora. Because she worked in the crèche for years, as well as growing up there, she knew that rules and regulations were followed if possible, but funds, resources, and time weren’t always available. So how often had she really had a dose of mother’s milk flora? Grown, as Choi had said, from volunteer donations? And did those really work the same as actual mother’s milk?\nShe noted down the leads she should follow up on. But first she was going to read that Jurassic Park article. It was a good read, but there was no footnote about crèche babies. Maybe it was only Choi who made that jump. Maybe an ecologist didn’t view human beings as unique creatures but just another species of mammal. And the crèche babies had had human caregivers and many robots and AI to fill the gap of human cultural transfer.\nThere was something else. Onway replayed the last things Choi had said. No, not the Jurassic Park mention, she already tracked that down. Oh, there it was. That casual remark about real smells. That without death and decay it wasn’t real. Something about it triggered a nascent thought, but she couldn’t put her finger on it yet.\nWindi called. “Not only does our institute have a subscription to that database, but also there have been several studies done on the evolution of the colonial gut biome.”\n“And?”\n“It’s more of a devolution. Every time there’s a cross (that’s a baby, in your language), they hoped for a mixing of strains, creating new and viable offspring, but instead the variety has gone down in the second generation. The third and fourth generations are worse. It’s not looking good. I can feel my guts churning. I know that’s my imagination, but it’s also a nasty feeling about the future of NE. Or any colony.”\nNo, discovering that you were part of a test population wasn’t particularly fun. “And anything about differences between crèche and naturally born children?”\n“Yes. They knew they were taking a risk in decanting children, the bastards, so they tested every decanted baby. Our results are worse.”\nOnway swallowed. It was one thing to have concluded that raising batches of children in crèches wasn’t a good thing after the fact. But that the colonial foremothers had suspected something like this might happen made it many times worse. So cold and calculating. As if crèche children weren’t real humans. Unsuccessful cows her ass.\n“Weren’t they worried about the future of their colony? “\n“They assumed, and I quote ‘Natural breeding would overtake the feebler vitality of the artificially raised children.’”\n“Fuckers.”\n“Yeah.”\n“I’m almost feeling vindicated that the descendants of the fuckers are having trouble with lack of vitality themselves,” Onway said.\nShe told Windi about her talk with Choi and the woman’s somber predictions about the viability of Earth life on strange planets.\n“What’s the next step?” she said. Her newfound sense of purpose had left her, and she was tired and headachy. It was great to have found the culprit for Erdenweh, but realizing the inevitability of the terrible outcome drained any sense of victory.\n“Me and some of the gamers, who are crèche kids just like us, pooled our resources and we hired an AI to do a query on the data we can gather. The job’s queued.”\n“Okay. Call me when you get some. I found out some things, but I’m beat.”\nOnway got into bed with a snack. She was going to need Teddy again tonight.\nOnway woke with a clear head and more energy than she’d had in days. Somewhere in the basement of her brain something was brewing. She knew to leave it alone and let the thoughts stew beneath a surface stream of routine actions.\nShe arrived at the crèche earlier than usual and almost gagged at the musty odors. She arrived before the cleaners, and a day and a night of children playing, pooping, peeing, vomiting, and eating has left an aroma which Choi might call layered and earthy. A real stench.\nThe thought arrived with a pop and a flash. That was it. Why hadn’t she seen that before? The crèche was dirty. Deeply filthy, with layers and layers of insufficient cleaning, built up over decades. Children never washed their hands well enough, and there were never enough carers to make sure they did. A layer of old poop and snot and saliva and every possible bodily fluid covered the crèche.\nThat had to be the reason these children had less Erdenweh. Their gut flora and other symbionts replenished themselves continuously in the gentle cloud of effluvia that floated around in the building, embedded in the cutlery and the pots and pans, the sheets, the hand-me-down clothes.\nOn Earth people lived in a soup of organic molecules present everywhere, in the air, the soil, the wind, the seas, the rivers. The colonists arrived scrubbed clean on a world empty of not only humans, but of the billions of years of human evolution, billions of years where trillions of creatures lived and shat and died.\nHere on Nueva Esperanza there was nothing yet. Clean, printed houses. Automated cleaning robots. Recycle your clothing and print new ones. Everything sterile.\nExcept here, in the richly dirty and chaotic surroundings of the crèche. Deprivation never tasted so sweet.\nA sleepy, grubby child stumbled by on its way to the toilet.\nOnway bent down to hug it. “You’re the best thing I’ve seen all day!” She smacked a kiss on its grubby cheek. Grow, microbes, grow, migrate to my gut, regulate my moods, make me able to withstand the vagaries of my life.\nFilth. Who knew it could be so beautiful?\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "source": "https://clarkesworldmagazine.com/balder_06_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Erdenweh by Bo Balder"}