{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "David Moles", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "WNfTwO1jPGW13bNQLEnMgDuYvOI=", "id": null, "license": null, "comments": "", "raw_text": "7370 words, short story, REPRINT  A Soldier of the City  ISIN 12:709 13″ N:10 18″ / 34821.1.9 10:24:5:19.21  Color still image, recorded by landscape maintenance camera, Gulanabishtiïdinam Park West.  At the top of the hill is a football court, the net nearly new but the bricks of the ground uneven, clumps of grass growing up from between the cracks. On the same side of the net are a man and a young girl. The hollow rattan ball is above the girl’s head, nearing the apex of its trajectory; the girl, balanced on the toes of her bare right foot, her left knee raised, is looking toward the man.  The man is looking away.  Cross-reference with temple records identifies the man as Ishmenininsina Ninnadiïnshumi, age twenty-eight, temple soldier of the 219th Surface Tactical Company, an under-officer of the third degree, and the girl as his daughter Mâratirşitim, age nine.  Magnification of the reflection from the man’s left cornea indicates his focus to be the sixty-cubit-high image of Gula, the Lady of Isin, projected over the Kârumishbiïrra Canal.  Comparison of the reflection with the record of the Corn Parade ceremonies suggests a transmission delay of approximately three grains.  1. Corn Parade  In the moment of the blast, Ish was looking down the slope, toward the canal, the live feed from the temple steps and the climax of the parade. As he watched, the goddess suddenly froze; her ageless face lost its benevolent smile, and her dark eyes widened in surprise and perhaps in fear, as they looked—Ish later would always remember—directly at him. Her lips parted as if she was about to tell Ish something.  And then the whole eastern rise went brighter than the Lady’s House at noonday. There was a sound, a rolling, bone-deep rumble like thunder, and afterwards Ish would think there was something wrong with this, that something so momentous should sound so prosaic, but at the time all he could think was how loud it was, how it went on and on, louder than thunder, than artillery, than rockets, louder and longer than anything Ish had ever heard. The ground shook. The projection faded, flickered and went out, and a hot wind whipped over the hilltop, tearing the net from its posts, knocking Mâra to the ground and sending her football flying, lost forever, out over the rooftops to the west.  From the temple district, ten leagues away, a bright point was rising, arcing up toward the dazzling eye of the Lady’s House, and some trained part of Ish’s mind saw the straight line, the curvature an artifact of the city’s rotating reference frame; but as Mâra started to cry, and Ish’s wife Tara and all his in-laws boiled up from around the grill and the picnic couches, yelling, and a pillar of brown smoke, red-lit from below, its top swelling obscenely, began to grow over the temple, the temple of the goddess Ish was sworn as a soldier of the city to protect, Ish was not thinking of geometry or the physics of the coriolis force. What Ish was thinking—what Ish knew, with a sick certainty—was that the most important moment of his life had just come and gone, and he had missed it.  34821.1.14 10:9:2:5.67  Annotated image of the city of Isin, composed by COS Independence, on Gaugamela station, Babylon, transmitted via QT to Community Outreach archives, Urizen. Timestamp adjusted for lightspeed delay of thirteen hours, fifty-one minutes.  Five days after the strike the point of impact has died from angry red-orange to sullen infrared, a hot spot that looks like it will be a long time in cooling. A streamer of debris trails behind the wounded city like blood in water, its spectrum a tale of vaporized ice and iron. Isin’s planet-sized city-sphere itself appears structurally intact, the nitrogen and oxygen that would follow a loss of primary atmosphere absent from the recorded data.  Away from the impact, the myriad microwave receivers that cover the city’s surface like scales still ripple, turning to follow the beams of power from Ninagal’s superconducting ring, energy drawn from the great black hole called Tiamat, fat with the mass of three thousand suns, around which all the cities of Babylon revolve. The space around Isin is alive with ships: local orbiters, electromagnetically accelerated corn cans in slow transfer orbits carrying grain and meat from Isin to more urbanized cities, beam-riding passenger carriers moving between Isin and Lagash, Isin and Nippur, Isin, and Babylon-Borsippa and the rest—but there is no mass exodus, no evacuation.  The Outreach planners at Urizen and Ahania, the missionaries aboard Liberation and Independence and those living in secret among the people of the cities, breathe sighs of relief, and reassure themselves that whatever they have done to the people of the cities of Babylon, they have at least not committed genocide.  Aboard COS Insurrection, outbound from Babylon, headed for the Community planet of Zoa at four-tenths the speed of light and still accelerating, the conscientious objectors who chose not to stay and move forward with the next phase of the Babylonian intervention hear this good news and say, not without cynicism: I hope that’s some comfort to them.  2. Men giving orders  Ish was leading a team along a nameless street in what had been a neighborhood called Imtagaärbeëlti and was now a nameless swamp, the entire district northwest of the temple complex knee-deep in brackish water flowing in over the fallen seawall and out of the broken aqueducts, so that Ish looked through gates into flooded gardens where children’s toys and broken furniture floated as if put there just to mar and pucker the reflection of the heavens, or through windows whose shutters had been torn loose and glass shattered by the nomad blast into now-roofless rooms that were snapshots of ordinary lives in their moments of ending.  In the five days since the Corn Parade Ish had slept no more than ten or twelve hours. Most of the rest of the 219th had died at the temple, among the massed cohorts of Isin lining the parade route in their blue dress uniforms and golden vacuum armor—they hadn’t had wives, or hadn’t let the wives they did have talk them into extending their leaves to attend picnics with their in-laws, or hadn’t been able to abuse their under-officers’ warrants to extend their leaves when others couldn’t. Most of the temple soldiery had died along with them, and for the first three days Ish had been just a volunteer with a shovel, fighting fires, filling sandwalls, clearing debris. On the fourth day the surviving priests and temple military apparatus had pulled themselves together into something resembling a command structure, and now Ish had this scratch squad, himself and three soldiers from different units, and this mission, mapping the flood zone, to what purpose Ish didn’t know or much care. They’d been issued weapons but Ish had put a stop to that, confiscating the squad’s ammunition and retaining just one clip for himself.  “Is that a body?” said one of the men suddenly. Ish couldn’t remember his name. A clerk, from an engineering company, his shoulder patch a stylized basket. Ish looked to where he was pointing. In the shadows behind a broken window was a couch, and on it a bundle of sticks that might have been a man.  “Wait here,” Ish said.  “We’re not supposed to go inside,” said one of the other men, a scout carrying a bulky map book and sketchpad, as Ish hoisted himself over the gate. “We’re just supposed to mark the house for the civilians.”  “Who says?” asked the clerk.  “Command,” said the scout.  “There’s no command,” said the fourth man suddenly. He was an artillerist, twice Ish’s age, heavy and morose. These were the first words he’d spoken all day. “The Lady’s dead. There’s no command. There’s no officers. There’s just men giving orders.”  The clerk and the scout looked at Ish, who said nothing.  He pulled himself over the gate.  The Lady’s dead. The artillerist’s words, or ones like them, had been rattling around Ish’s head for days, circling, leaping out to catch him whenever he let his guard down. Gula, the Lady of Isin, is dead. Every time Ish allowed himself to remember that it was as if he was understanding it for the first time, the shock of it like a sudden and unbroken fall, the grief and shame of it a monumental weight toppling down on him. Each time Ish forced the knowledge back the push he gave it was a little weaker, the space he created for himself to breathe and think and feel in a little smaller. He was keeping himself too busy to sleep because every time he closed his eyes he saw the Lady’s pleading face.  He climbed over the windowsill and into the house.  The body of a very old man was curled up there, dressed in nothing but a dirty white loincloth that matched the color of the man’s hair and beard and the curls on his narrow chest. In the man’s bony hands an icon of Lady Gula was clutched, a cheap relief with machine-printed colors that didn’t quite line up with the ceramic curves, the Lady’s robes more blue than purple and the heraldic dog at her feet more green than yellow; the sort of thing that might be sold in any back-alley liquor store. One corner had been broken off, so that the Lady’s right shoulder and half her face were gone, and only one eye peered out from between the man’s knuckles. When Ish moved to take the icon, the fingers clutched more tightly, and the old man’s eyelids fluttered as a rasp of breath escaped his lips.  Ish released the icon. Its one-eyed stare now seemed accusatory.  “Okay,” he said heavily. “Okay, Granddad.”  BABYLON CITY 1:1 5″ N:1 16″ / 34821.1.14 7:15  “Lord Ninurta vows justice for Lady of Isin”  “Police to protect law-abiding nomads”  “Lawlessness in Sippar”  —Headlines, temple newspaper Marduknaşir, Babylon City  BABYLON CITY 4:142 113″ S:4 12″ / 34821.1.15 1:3  “Pointless revenge mission”  “Lynchings in Babylon: immigrants targeted”  “Sippar rises up”  —Headlines, radical newspaper Iïnshushaqiï, Babylon City  GISH, NIPPUR, SIPPAR (various locations) / 34821.1.15  “THEY CAN DIE”  —Graffiti common in working-class and slave districts, after the nomad attack on Isin  3. Kinetic penetrator  When Tara came home she found Ish on a bench in the courtyard, bent over the broken icon, with a glue pot and an assortment of scroll clips and elastic bands from Tara’s desk. They’d talked, when they first moved into this house not long after Mâra was born, of turning one of the ground-floor rooms into a workshop for Ish, but he was home so rarely and for such short periods that with one thing and another it had never happened. She kept gardening supplies there now.  The projector in the courtyard was showing some temple news feed, an elaborately animated diagram of the nomads’ weapon—a ‘kinetic penetrator,’ the researcher called it, a phrase that Tara thought should describe something found in a sex shop or perhaps a lumberyard—striking the city’s outer shell, piercing iron and ice and rock before erupting in a molten plume from the steps directly beneath the Lady’s feet.  Tara turned it off.  Ish looked up. “You’re back,” he said.  “You stole my line,” said Tara. She sat on the bench next to Ish and looked down at the icon in his lap. “What’s that?”  “An old man gave it to me,” Ish said. “There.” He wrapped a final elastic band around the icon and set it down next to the glue pot. “That should hold it.”  He’d found the broken corner of the icon on the floor not far from the old man’s couch. On Ish’s orders they’d abandoned the pointless mapping expedition and taken the man to an aid station, bullied the doctors until someone took responsibility.  There, in the aid tent, the man pressed the icon into Ish’s hands, both pieces, releasing them with shaking fingers.  “Lady bless you,” he croaked.  The artillerist, at Ish’s elbow, gave a bitter chuckle, but didn’t say anything. Ish was glad of that. The man might be right, there might be no command, there might be no soldiery, Ish might not be an under-officer any more, just a man giving orders. But Ish was, would continue to be, a soldier of the Lady, a soldier of the city of Isin, and if he had no lawful orders that only put the burden on him to order himself.  He was glad the artillerist hadn’t spoken, because if the man had at that moment said again the Lady’s dead, Ish was reasonably sure he would have shot him.  He’d unzipped the flap on the left breast pocket of his jumpsuit and tucked both pieces of the icon inside. Then he’d zipped the pocket closed again, and for the first time in five days, he’d gone home.  Tara said: “Now that you’re back, I wish you’d talk to Mâra. She’s been having nightmares. About the Corn Parade. She’s afraid the nomads might blow up her school.”  “They might,” Ish said.  “You’re not helping.” Tara sat up straight. She took his chin in her hand and turned his head to face her. “When did you last sleep?”  Ish pulled away from her. “I took pills.”  Tara sighed. “When did you last take a pill?”  “Yesterday,” Ish said. “No. Day before.”  “Come to bed,” said Tara. She stood up. Ish didn’t move. He glanced down at the icon.  An ugly expression passed briefly over Tara’s face, but Ish didn’t see it.  “Come to bed,” she said again. She took Ish’s arm, and this time he allowed himself to be led up the stairs.  At some point in the night they made love. It wasn’t very good for either of them; it hadn’t been for a long while, but this night was worse. Afterwards Tara slept.  She woke to find Ish already dressed. He was putting things into his soldiery duffle.  “Where are you going?” she asked.  “Lagash.”  “What?”  Tara sat up. Ish didn’t look at her.  “Lord Ninurta’s fitting out an expedition,” Ish said.  “An expedition,” said Tara flatly.  “To find the nomads who killed the Lady.”  “And do what?” asked Tara.  Ish didn’t answer. From his dresser he picked up his identification seal, the cylinder with the Lady’s heraldic dog and Ish’s name and Temple registry number, and fastened it around his neck.  Tara turned away.  “I don’t think I ever knew you,” she said, “But I always knew I couldn’t compete with a goddess. When I married you, I said to my friends: ‘At least he won’t be running around after other women.’” She laughed without humor. “And now she’s dead—and you’re still running after her.”  She looked up. Ish was gone.  Outside it was hot and windless under a lowering sky. Nothing was moving. A fine gray dust was settling over the sector: the Lady’s ashes, Ish had heard people call it. His jump boots left prints in it as he carried his duffle to the train station.  An express took Ish to the base of the nearest spoke, and from there his soldiery ID and a series of elevators carried him to the southern polar dock. As the equatorial blue and white of the city’s habitable zone gave way to the polished black metal of the southern hemisphere, Ish looked down at the apparently untroubled clouds and seas ringing the city’s equator and it struck him how normal this all was, how like any return to duty after leave.  It would have been easy and perhaps comforting to pretend it was just that, comforting to pretend that the Corn Parade had ended like every other, with the Lady’s blessing on the crops, the return of the images to the shrines, drinking and dancing and music from the dimming of the Lady’s House at dusk to its brightening at dawn.  Ish didn’t want that sort of comfort.  34821.6.29 5:23:5:12.102  Abstract of report prepared by priest-astronomers of Ur under the direction of Shamash of Sippar, at the request of Ninurta of Lagash.  Isotopic analysis of recovered penetrator fragments indicates the nomad weapon to have been constructed within and presumably fired from the Apsu near debris belt. Astronomical records are surveyed for suspicious occlusions, both of nearby stars in the Babylon globular cluster and of more distant stars in the Old Galaxy, and cross-referenced against traffic records to eliminate registered nomad vessels. Fifteen anomalous occlusions, eleven associated with mapped point mass Sinkalamaïdi-541, are identified over a period of one hundred thirty-two years. An orbit for the Corn Parade criminals is proposed.  4. Dog soldier  There was a thump as Ish’s platform was loaded onto the track. Then Sharur’s catapult engaged and two, three, five, eight, thirteen, twenty times the force of Isin’s equatorial rotation pushed Ish into his thrust bag; and then Ish was flying free.  In his ear, the voice of the ship said:  —First company, dispersion complete.  On the control console, affixed there, sealed into a block of clear resin: Gula’s icon. Ish wondered if this was what she wanted.  And Ninurta added, for Ish’s ears alone:  —Good hunting, dog soldier.  At Lagash they’d wanted Ish to join the soldiery of Lagash; had offered him the chance to compete for a place with the Lion-Eagles, Ninurta’s elites. Ish had refused, taking the compassion of these warlike men of a warlike city for contempt. Isin was sparsely populated for a city of Babylon, with barely fifty billion spread among its parks and fields and orchards, but its soldiery was small even for that. When the hard men in Ashur and the actuaries in Babylon-Borsippa counted up the cities’ defenders, they might forget Lady Gula’s soldiers, and be forgiven for forgetting. What Ninurta’s men meant as generosity to a grieving worshipper of their lord’s consort Ish took for mockery of a parade soldier from a rustic backwater. It needed the intervention of the god himself to make a compromise; this after Ish had lost his temper, broken the recruiter’s tablet over his knee and knocked over his writing-table.  “You loved her—dog soldier.”  Ish turned to see who had spoken, and saw a god in the flesh for the first time.  The Lord of Lagash was tall, five cubits at least, taller than any man, but the shape and set of his body in its coppery-red armor made it seem that it was the god who was to scale and everything around him—the recruiting office, the Lion-Eagles who had been ready to lay hands on Ish and who were now prostrate on the carpet, the wreckage of the recruiter’s table, Ish himself—that was small. The same agelessness was in Ninurta’s dark-eyed face that had been in Lady Gula’s, but what in the Lady had seemed to Ish a childlike simplicity retained into adulthood was turned, in her consort, to a precocious maturity, a wisdom beyond the unlined face’s years.  Ish snapped to attention. “Lord,” he said. He saluted—as he would have saluted a superior officer. A murmur of outrage came from the Lion-Eagles on the floor.  The god ignored them. “You loved her,” he said again, and he reached out and lifted Ish’s seal-cylinder where it hung around his neck, turned it in his fingers to examine the dog figure, to read Ish’s name and number.  “No, Lord Ninurta,” Ish said.  The god looked from the seal to Ish’s face.  “No?” he said, and there was something dangerous in his voice. His fist closed around the seal.  Ish held the god’s gaze.  “I’ve never stopped loving her,” he said.  Ish had been prepared to hate the Lord of Lagash, consort of the Lady of Isin. When Ish thought of god and goddess together his mind slipped and twisted and turned away from the idea; when he’d read the god’s proclamation of intent to hunt down the nomads that had murdered ‘his’ lady, Ish’s mouth had curled in an involuntary sneer. If the Lord of Lagash had tried to take the seal then, Ish would have fought him, and died.  But the god’s fist opened. He glanced at the seal again and let it drop.  The god’s eyes met Ish’s eyes, and in them Ish saw a pain that was at least no less real and no less rightful than Ish’s own.  “Neither have I,” Ninurta said.  Then he turned to his soldiers.  “As you were,” he told them. And, when they had scrambled to their feet, he pointed to Ish. “Ishmenininsina Ninnadiïnshumi is a solder of the city of Isin,” he told them. “He remains a soldier of the city of Isin. He is your brother. All Lady Gula’s soldiers are your brothers. Treat them like brothers.”  To Ish he said, “We’ll hunt nomads together, dog soldier.”  “I’d like that,” Ish said. “Lord.”  Ninurta’s mouth crooked into a half-smile, and Ish saw what the Lady of Isin might have loved in the Lord of Lagash.  For the better part of a year the hunters built, they trained, they changed and were changed—modified, by the priest-engineers who served Ninagal of Akkad and the priest-doctors who had served Lady Gula, their hearts and bones strengthened to withstand accelerations that would kill any ordinary mortal, their nerves and chemistries changed to let them fight faster and harder and longer than anything living, short of a god.  The point mass where the priest-astronomers of Ur thought the hunters would find the nomad camp was far out into Apsu, the diffuse torus of ice and rock and wandering planetary masses that separated Babylon from the nearest stars. The detritus of Apsu was known, mapped long ago down to the smallest fragment by Sin and Shamash, and the nomads’ work had left a trail that the knowledgeable could read.  The object the nomads’ weapon orbited was one of the largest in the near reaches of Apsu, the superdense core of some giant star that had shed most of its mass long before the Flood, leaving only this degenerate, slowly cooling sphere, barely a league across. The gods had long since oriented it so the jets of radiation from its rapidly spinning magnetic poles pointed nowhere near the cities, moved it into an orbit where it would threaten the cities neither directly with its own gravity, nor by flinging comets and planetesimals down into Babylon.  It took the hunters two hundred days to reach it.  The great ship Sharur, the Mace of Ninurta, a god in its own right, was hauled along the surface of Lagash to the city’s equator, fueled, armed, loaded with the hunters and all their weapons and gear, and set loose.  It dropped away slowly at first, but when the ship was far enough from the city its sails opened, and in every city of Babylon it was as if a cloud moved between the land and the shining houses of the gods, as the power of Ninagal’s ring was bent to stopping Sharur in its orbit. Then the Mace of Ninurta folded its sails like the wings of a diving eagle and fell, gathering speed. The black circle that was Tiamat’s event horizon grew until it swallowed half the sky, until the soldiers packed tight around the ship’s core passed out in their thrust bags and even Sharur’s prodigiously strong bones creaked under the stress, until the hunters were so close that the space-time around them whirled around Tiamat like water. Ninagal’s ring flashed by in an instant, and only Lord Ninurta and Sharur itself were conscious to see it. Sharur shot forward, taking with it some tiny fraction of the black hole’s unimaginable angular momentum.  And then Tiamat was behind them, and they were headed outward.  BABYLON CITY 1:1 5″ N:1 16″ / 34822.7.18 7:15  “All cities’ prayers with Lord of Lagash”  “Police seek nomad agents in Babylon”  “Lord Shamash asks Lord Anshar to restore order”  —Headlines, temple newspaper Marduknaşir, Babylon City  BABYLON CITY 4:142 113″ S:4 12″ / 34822.7.16 1:3  “An eye for an eye”  “Nativist witch-hunt”  “Ashur to invade Sippar”  —Headlines, radical newspaper Iïnshushaqiï, Babylon City  5. Machines  At Lagash they had drilled a double dozen scenarios: city-sized habitats, ramship fleets, dwarf planets threaded with ice tunnels like termite tracks in old wood. When the cities fought among themselves the territory was known and the weapons were familiar. The vacuum armor Ish had worn as a Surface Tactical was not very different from what a soldier of Lagash or Ashur or Akkad would wear although the gear of those warlike cities was usually newer and there was more of it. The weapons the Surface Tacticals carried were deadly enough to ships or to other vacuum troops, and the soldiers of the interior had aircraft and artillery and even fusion bombs although no one had used fusion bombs within a city in millennia. But there had been nothing like the nomads’ weapon, nothing that could threaten the fabric of a city. No one could say with certainty what they might meet when they found the nomad encampment.  Ish had seen nomad ships in dock at Isin. There were ramships no larger than canal barges that could out-accelerate a troopship and push the speed of light, and ion-drive ships so dwarfed by their fuel supplies that they were like inhabited comets, and fragile light-sailers whose mirrors were next to useless at Babylon, and every one was unique. Ish supposed you had to be crazy to take it into your head to spend a lifetime in a pressurized can ten trillion leagues from whatever you called home. There wouldn’t be many people as crazy as that and also able enough to keep a ship in working order for all that time, even taking into account that you had to be crazy in the first place to live in the rubble around a star when you could be living in a city.  But that wasn’t right either. Because most of the people that in Babylon they called nomads had been born out there on their planets or wherever, where there were no cities and no gods, with as much choice about where they lived as a limpet on a rock. It was only the crazy ones that had a choice and only the crazy ones that made it all the way to Babylon.  The nomads Ish was hunting now, the assassins somewhere out there in the dark, he thought were almost simple by comparison. They had no gods and could build no cities and they knew it and it made them angry and so whatever they couldn’t have, they smashed. That was a feeling Ish could understand.  Gods and cities fought for primacy, they fought for influence or the settlement of debts. They didn’t fight wars of extermination. But extermination was what the nomads had raised the stakes to when they attacked the Corn Parade and extermination was what Ish was armed for now.  —There, said Sharur’s voice in his ear.—There is their weapon.  In the X-ray spectrum Sinkalamaïdi-541 was one of the brightest objects in the sky, but to human eyes, even augmented as Ish’s had been at Lagash, even here, less than half a million leagues from the target, what visible light it gave off as it cooled made it only an unusually bright star, flickering as it spun. Even under the magnification of Sharur’s sharp eyes it was barely a disc; but Ish could see that something marred it, a dark line across the sickly glowing face.  A display square opened, the dead star’s light masked by the black disc of a coronagraph, reflected light—from the dead star itself, from the living stars of the surrounding cluster, from the Old Galaxy—amplified and enhanced. Girdling Sinkalamaïdi-541 was a narrow, spinning band of dull carbon, no more than a thousand leagues across, oriented to draw energy from the dead star’s magnetic field; like a mockery of Ninagal’s ring.  —A loop accelerator, the ship said.—Crude but effective.  —They must be very sophisticated to aspire to such crudeness, said Ninurta.—We have found the sling, but where is the slinger?  When straight out of the temple orphanage he’d first enlisted, they’d trained Ish as a rifleman, and when he’d qualified for Surface Tactical School they’d trained him as a vacuum armor operator. What he was doing now, controlling this platform that had been shot down an electromagnetic rail like a corn can, was not very much like either of those jobs, although the platform’s calculus of fuel and velocity and power and heat was much the same as for the vacuum armor. But he was not a Surface Tactical anymore and there was no surface here, no city with its weak gravity and strong spin to complicate the equations, only speed and darkness and somewhere in the darkness the target.  There was no knowing what instruments the nomads had but Ish hoped to evade all of them. The platform’s outer shell was black in short wavelengths and would scatter or let pass long ones; the cold face it turned toward the nomad weapon was chilled to within a degree of the cosmic microwave background, and its drives were photonic, the exhaust a laser-tight collimated beam. Eventually some platform would occlude a star or its drive beam would touch some bit of ice or cross some nomad sensor’s mirror and they would be discovered, but not quickly and not all at once.  They would be on the nomads long before that.  —Third company, Ninurta said.—Fire on the ring. Flush them out.  The platforms had been fired from Sharur’s catapults in an angled pattern so that part of the energy of the launch went to slowing Sharur itself and part to dispersing the platforms in an irregular spreading cone that by this time was the better part of a thousand leagues across. Now the platforms’ own engines fired, still at angles oblique to the line joining Sharur’s course to the dead star.  Below Ish—subjectively—and to his left, a series of blinking icons indicated that the platforms of the third company were separating themselves still further, placing themselves more squarely in the track of the dead star’s orbit. When they were another thousand leagues distant from Sharur they cast their weapons loose and the weapons’ own engines fired, bright points Ish could see with his own eyes, pushing the weapons onward with a force beyond what even the hunters’ augmented and supported bodies could withstand.  Time passed. The flares marking the weapons of the third company went out one by one as their fuel was exhausted. When they were three hundred thousand leagues from the ring, the longest-ranged of the weapons—antiproton beams, muon accelerators, fission-pumped gamma-ray lasers—began to fire.  Before the bombardment could possibly have reached the ring—long before there had passed the thirty or forty grains required for the bombardment to reach the ring and the light of the bombardment’s success or failure to return to Sharur and the platforms—the space between the ring and the third company filled with fire. Explosions flared all across Ish’s field of view, pinpoints of brilliant white, shading to ultraviolet. Something hit the side of the platform with a terrific thump, and Ish’s hand squeezed convulsively on the weapon release as his diagnostic screens became a wash of red. There was a series of smaller thumps as the weapons came loose, and then a horrible grinding noise as at least one encountered some projecting tangle of bent metal and broken ceramic. The platform was tumbling. About half Ish’s reaction control thrusters claimed to be working; he fired them in pairs and worked the gyroscopes till the tumble was reduced to a slow roll, while the trapped weapon scraped and bumped its way across the hull and finally came free.  —Machines, machines! he heard Ninurta say.—Cowards! Where are the men?  Then the weapon, whichever it was, blew up.  34822.7.16 4:24:6:20 - 5:23:10:13  Moving image, recorded at 240 frames per second over a period of 117 minutes 15 seconds by spin-stabilized camera, installation “Cyrus,” transmitted via QT to COS Liberation, on Gaugamela station, and onward to Community Outreach archives, Urizen:  From the leading edge of the accelerator ring, it is as though the ring and the mass that powers it are rising through a tunnel of light.  For ten million kilometers along the track of the neutron star’s orbit, the darkness ahead sparkles with the light of antimatter bombs, fusion explosions, the kinetic flash of chaff thrown out by the accelerator ring impacting ships, missiles, remotely operated guns; impacting men. Through the minefield debris of the ring’s static defenses, robotic fighters dart and weave, looking to kill anything that accelerates. Outreach has millennia of experience to draw on, and back in the Community a population of hundreds of billions to produce its volunteer missionaries, its dedicated programmers, its hobbyist generals. Many of the Babylonian weapons are stopped; many of the Babylonian ships are destroyed. Others, already close to Babylon’s escape velocity and by the neutron star’s orbital motion close to escaping from it as well, are shunted aside, forced into hyperbolic orbits that banish them from the battlefield as surely as death.  But the ring’s defenders are fighting from the bottom of a deep gravity well, with limited resources, nearly all the mass they’ve assembled here incorporated into the ring itself; and the Babylonians have their own store of ancient cunning to draw on, their aggregate population a hundred times larger than the Community’s, more closely knit and more warlike. And they have Ninurta.  Ninurta, the hunter of the Annunaki, the god who slew the seven-headed serpent, who slew the bull-man in the sea and the six-headed wild ram in the mountain, who defeated the demon Ansu and retrieved the Tablet of Destinies.  Sharur, the Mace of Ninurta, plunges through the battle like a shark through minnows, shining like a sun, accelerating, adding the thrust of its mighty engines to the neutron star’s inexorable pull. Slender needles of laser prick out through the debris, and Sharur’s sun brightens still further, painful to look at, the ship’s active hull heated to tens of thousands of degrees. Something like a swarm of fireflies swirls out toward it, and the camera’s filters cut in, darkening the sky as the warheads explode around the ship, a constellation of new stars that flare, burn, and die in perfect silence: and Sharur keeps coming.  It fills the view.  Overhead, a blur, it flashes past the camera, and is gone.  The image goes white.  The transmission ends.  6. Surviving weapons  It was cold in the control capsule. The heat sink was still deployed and the motors that should have folded it in would not respond. Ish found he didn’t much care. There was a slow leak somewhere in the atmosphere cycler and Ish found he didn’t much care about that either.  The battle, such as it was, was well off to one side. Ish knew even before doing the math that he did not have enough fuel to bring himself back into it. The dead star was bending his course but not enough. He was headed into the dark.  Ish’s surviving weapons were still burning mindlessly toward the ring and had cut by half the velocity with which they were speeding away from it, but they too were nearly out of fuel and Ish saw that they would follow him into darkness.  He watched Sharur’s plunge through the battle. The dead star was between him and the impact when it happened, but he saw the effect it had: a flash across the entire spectrum from long-wave radio to hard X-ray, bright enough to illuminate the entire battlefield; bright enough, probably, to be seen from the cities.  Another god died.  There was a sparkle of secondary explosions scattered through the debris field, weapons and platforms and nomad fighters alike flashing to plasma in the light of Ninurta’s death. Then there was nothing. The ring began, slowly, to break up.  Ish wondered how many other platforms were still out here, set aside like his, falling into Apsu. Anyone who had been on the impact side was dead.  The weapons’ drive flares went out.  The mended icon was still where he had fixed it. Ish shut down the displays one by one until his helmet beam was the only light and adjusted the thrust bag around the helmet so that the beam shone full on the icon. The look in the Lady’s eyes no longer seemed accusatory, but appraising, as if she were waiting to see what Ish would do.  The beam wavered and went dark.  BABYLON CITY 2:78 233″ S:2 54″ / 34822.10.6 5:18:4  Record of police interrogation, Suspect 34822.10.6.502155, alias Ajabeli Huzalatum Taraämapsu, alias Liburnadisha Iliawilimrabi Apsuümasha, alias ‘Black’. Charges: subversion, terrorism, falsification of temple records, failure to register as a foreign agent. Interrogator is Detective (Second Degree) Nabûnaïd Babilisheïr Rabişila.  Rabişila: Your people are gone. Your weapon’s been destroyed. You might as well tell us everything.  Suspect: It accomplished its purpose.  Rabişila: Which was?  Suspect: To give you hope.  Rabişila: What do you mean, “hope”?  Suspect: Men are fighting gods now, in Gish and Sippar.  Rabişila: A few criminal lunatics. Lord Anshar will destroy them.  Suspect: Do you think they’ll be the last? Two of your gods are dead. Dead at the hands of mortals. Nothing Anshar’s soldiers do to Sippar will change that. Nothing you do to me.  Rabişila: You’re insane.  Suspect: I mean it. One day—not in my lifetime, certainly not in yours, but one day—one day you’ll all be free.  7. A soldier of the city  A ship found Ish a few months later: a ship called Upekkhâ, from a single-system nomad civilization based some seventeen light-years from Babylon and known to itself as the Congregation. The ship, the name of which meant ‘equanimity’, was an antimatter-fueled ion rocket, a quarter of a league long and twice that in diameter; it could reach two-tenths the speed of light, but only very, very slowly. It had spent fifteen years docked at Babylon-Borsippa, and, having been launched some four months before the attack on the Corn Parade, was now on its way back to the star the Congregation called Mettâ. The star’s name, in the ancient liturgical language of the monks and nuns of the Congregation, meant ‘kindness’.  Ish was very nearly dead when Upekkhâ’s monks brought him aboard. His heart had been stopped for some weeks, and it was the acceleration support system rather than Ish’s bloodstream that was supplying the last of the platform’s oxygen reserves to his brain, which itself had been pumped full of cryoprotectants and cooled to just above the boiling point of nitrogen. The rescue team had to move very quickly to extricate Ish from that system and get him onto their own life support. This task was not made any easier by the militarized physiology given to Ish at Lagash, but they managed it. He was some time in recovering.  Ish never quite understood what had brought Upekkhâ to Babylon. Most of the monks and nuns spoke good Babylonian—several of them had been born in the cities—but the concepts were too alien for Ish to make much sense of them, and Ish admitted to himself he didn’t really care to try. They had no gods, and prayed—as far as Ish could tell—to their ancestors, or their teachers’ teachers. They had been looking, they said, for someone they called Tathâgata, which the nun explaining this to Ish translated into Babylonian as ‘the one who has found the truth’. This Tathâgata had died, many years ago on a planet circling the star called Mettâ, and why the monks and nuns were looking for him at Babylon was only one of the things Ish didn’t understand.  “But we didn’t find him,” the nun said. “We found you.”  They were in Upekkhâ’s central core, where Ish, who had grown up on a farm, was trying to learn how to garden in free fall. The monks and nuns had given him to understand that he was not required to work, but he found it embarrassing to lie idle—and it was better than being alone with his thoughts.  “And what are you going to do with me?” Ish asked.  The nun—whose own name, Arrakhasampada, she translated as ‘the one who has attained watchfulness’—gave him an odd look and said:  “Nothing.”  “Aren’t you afraid I’ll—do something? Damage something? Hurt someone?” Ish asked.  “Will you?” Arrakhasampada asked.  Ish had thought about it. Encountering the men and women of Upekkhâ on the battlefield he could have shot them without hesitation. In Apsu, he had not hesitated. He had looked forward to killing the nomads responsible for the Corn Parade with an anticipation that was two parts vengefulness and one part technical satisfaction. But these nomads were not those nomads, and it was hard now to see the point.  It must have been obvious, from where the monks and nuns found Ish, and in what condition, what he was, and what he had done. But they seemed not to care. They treated Ish kindly, but Ish suspected they would have done as much for a wounded dog.  The thought was humbling, but Ish also found it oddly liberating. The crew of Upekkhâ didn’t know who Ish was or what he had been trying to do, or why. His failure was not evident to them.  The doctor, an elderly monk who Ish called Dr. Sam—his name, which Ish couldn’t pronounce, meant something like ‘the one who leads a balanced life’— prounounced Ish fit to move out of the infirmary. Arrakhasampada and Dr. Sam helped Ish decorate his cabin, picking out plants from the garden and furnishings from Upekkhâ’s sparse catalog with a delicate attention to Ish’s taste and reactions that surprised him, so that the end result, while hardly Babylonian, was less foreign, more Ish’s own, than it might have been.  Arrakhasampada asked about the mended icon in its block of resin, and Ish tried to explain.  She and Dr. Sam grew very quiet and thoughtful.  Ish didn’t see either of them for eight or ten days. Then one afternoon as he was coming back from the garden, dusty and tired, he found the two of them waiting by his cabin. Arrakhasampada was carrying a bag of oranges, and Dr. Sam had with him a large box made to look like lacquered wood.  Ish let them in, and went into the back of the cabin to wash and change clothes. When he came out they had unpacked the box, and Ish saw that it was an iconostasis or shrine, of the sort the monks and nuns used to remember their predecessors. But where the name-scroll would go there was a niche just the size of Ish’s icon.  He didn’t know who he was. He was still—would always be—a soldier of the city, but what did that mean? He had wanted revenge, still did in some abstract way. There would be others, now, Lion-Eagles out to avenge the Lord of Lagash, children who had grown up with images of the Corn Parade. Maybe Mâra would be among them, though Ish hoped not. But Ish himself had had his measure of vengeance in Apsu and knew well enough that it had never been likely that he would have more.  He looked at the icon where it was propped against the wall. Who was he? Tara: “I don’t think I ever knew you.” But she had, hadn’t she? Ish was a man in love with a dead woman. He always would be. The Lady’s death hadn’t changed that, any more than Ish’s own death would have. The fact that the dead woman was a goddess hadn’t changed it.  Ish picked up the icon and placed it in the niche. He let Dr. Sam show him where to place the orange, how to set the sticks of incense in the cup and start the little induction heater. Then he sat back on his heels and they contemplated the face of the Lady of Isin together.  “Will you tell us about her?” Arrakhasampada asked.    Originally published in Engineering Infinity, edited by Jonathan Strahan. David Moles is a past finalist for the Hugo Award, the World Fantasy Award, and the John W. Campbell Award for Best New Writer, as well as the winner of the 2008 Theodore Sturgeon Memorial Award. His work has appeared in Strange Horizons, Asimov's Science Fiction, The Magazine of Fantasy & Science Fiction, and various anthologies. He lives in California with his family.", "text": "7370 words, short story, REPRINT\nA Soldier of the City\nISIN 12:709 13″ N:10 18″ / 34821.1.9 10:24:5:19.21\nColor still image, recorded by landscape maintenance camera, Gulanabishtiïdinam Park West.\nAt the top of the hill is a football court, the net nearly new but the bricks of the ground uneven, clumps of grass growing up from between the cracks. On the same side of the net are a man and a young girl. The hollow rattan ball is above the girl’s head, nearing the apex of its trajectory; the girl, balanced on the toes of her bare right foot, her left knee raised, is looking toward the man.\nThe man is looking away.\nCross-reference with temple records identifies the man as Ishmenininsina Ninnadiïnshumi, age twenty-eight, temple soldier of the 219th Surface Tactical Company, an under-officer of the third degree, and the girl as his daughter Mâratirşitim, age nine.\nMagnification of the reflection from the man’s left cornea indicates his focus to be the sixty-cubit-high image of Gula, the Lady of Isin, projected over the Kârumishbiïrra Canal.\nComparison of the reflection with the record of the Corn Parade ceremonies suggests a transmission delay of approximately three grains.\n1. Corn Parade\nIn the moment of the blast, Ish was looking down the slope, toward the canal, the live feed from the temple steps and the climax of the parade. As he watched, the goddess suddenly froze; her ageless face lost its benevolent smile, and her dark eyes widened in surprise and perhaps in fear, as they looked—Ish later would always remember—directly at him. Her lips parted as if she was about to tell Ish something.\nAnd then the whole eastern rise went brighter than the Lady’s House at noonday. There was a sound, a rolling, bone-deep rumble like thunder, and afterwards Ish would think there was something wrong with this, that something so momentous should sound so prosaic, but at the time all he could think was how loud it was, how it went on and on, louder than thunder, than artillery, than rockets, louder and longer than anything Ish had ever heard. The ground shook. The projection faded, flickered and went out, and a hot wind whipped over the hilltop, tearing the net from its posts, knocking Mâra to the ground and sending her football flying, lost forever, out over the rooftops to the west.\nFrom the temple district, ten leagues away, a bright point was rising, arcing up toward the dazzling eye of the Lady’s House, and some trained part of Ish’s mind saw the straight line, the curvature an artifact of the city’s rotating reference frame; but as Mâra started to cry, and Ish’s wife Tara and all his in-laws boiled up from around the grill and the picnic couches, yelling, and a pillar of brown smoke, red-lit from below, its top swelling obscenely, began to grow over the temple, the temple of the goddess Ish was sworn as a soldier of the city to protect, Ish was not thinking of geometry or the physics of the coriolis force. What Ish was thinking—what Ish knew, with a sick certainty—was that the most important moment of his life had just come and gone, and he had missed it.\n34821.1.14 10:9:2:5.67\nAnnotated image of the city of Isin, composed by COS Independence, on Gaugamela station, Babylon, transmitted via QT to Community Outreach archives, Urizen. Timestamp adjusted for lightspeed delay of thirteen hours, fifty-one minutes.\nFive days after the strike the point of impact has died from angry red-orange to sullen infrared, a hot spot that looks like it will be a long time in cooling. A streamer of debris trails behind the wounded city like blood in water, its spectrum a tale of vaporized ice and iron. Isin’s planet-sized city-sphere itself appears structurally intact, the nitrogen and oxygen that would follow a loss of primary atmosphere absent from the recorded data.\nAway from the impact, the myriad microwave receivers that cover the city’s surface like scales still ripple, turning to follow the beams of power from Ninagal’s superconducting ring, energy drawn from the great black hole called Tiamat, fat with the mass of three thousand suns, around which all the cities of Babylon revolve. The space around Isin is alive with ships: local orbiters, electromagnetically accelerated corn cans in slow transfer orbits carrying grain and meat from Isin to more urbanized cities, beam-riding passenger carriers moving between Isin and Lagash, Isin and Nippur, Isin, and Babylon-Borsippa and the rest—but there is no mass exodus, no evacuation.\nThe Outreach planners at Urizen and Ahania, the missionaries aboard Liberation and Independence and those living in secret among the people of the cities, breathe sighs of relief, and reassure themselves that whatever they have done to the people of the cities of Babylon, they have at least not committed genocide.\nAboard COS Insurrection, outbound from Babylon, headed for the Community planet of Zoa at four-tenths the speed of light and still accelerating, the conscientious objectors who chose not to stay and move forward with the next phase of the Babylonian intervention hear this good news and say, not without cynicism: I hope that’s some comfort to them.\n2. Men giving orders\nIsh was leading a team along a nameless street in what had been a neighborhood called Imtagaärbeëlti and was now a nameless swamp, the entire district northwest of the temple complex knee-deep in brackish water flowing in over the fallen seawall and out of the broken aqueducts, so that Ish looked through gates into flooded gardens where children’s toys and broken furniture floated as if put there just to mar and pucker the reflection of the heavens, or through windows whose shutters had been torn loose and glass shattered by the nomad blast into now-roofless rooms that were snapshots of ordinary lives in their moments of ending.\nIn the five days since the Corn Parade Ish had slept no more than ten or twelve hours. Most of the rest of the 219th had died at the temple, among the massed cohorts of Isin lining the parade route in their blue dress uniforms and golden vacuum armor—they hadn’t had wives, or hadn’t let the wives they did have talk them into extending their leaves to attend picnics with their in-laws, or hadn’t been able to abuse their under-officers’ warrants to extend their leaves when others couldn’t. Most of the temple soldiery had died along with them, and for the first three days Ish had been just a volunteer with a shovel, fighting fires, filling sandwalls, clearing debris. On the fourth day the surviving priests and temple military apparatus had pulled themselves together into something resembling a command structure, and now Ish had this scratch squad, himself and three soldiers from different units, and this mission, mapping the flood zone, to what purpose Ish didn’t know or much care. They’d been issued weapons but Ish had put a stop to that, confiscating the squad’s ammunition and retaining just one clip for himself.\n“Is that a body?” said one of the men suddenly. Ish couldn’t remember his name. A clerk, from an engineering company, his shoulder patch a stylized basket. Ish looked to where he was pointing. In the shadows behind a broken window was a couch, and on it a bundle of sticks that might have been a man.\n“Wait here,” Ish said.\n“We’re not supposed to go inside,” said one of the other men, a scout carrying a bulky map book and sketchpad, as Ish hoisted himself over the gate. “We’re just supposed to mark the house for the civilians.”\n“Who says?” asked the clerk.\n“Command,” said the scout.\n“There’s no command,” said the fourth man suddenly. He was an artillerist, twice Ish’s age, heavy and morose. These were the first words he’d spoken all day. “The Lady’s dead. There’s no command. There’s no officers. There’s just men giving orders.”\nThe clerk and the scout looked at Ish, who said nothing.\nHe pulled himself over the gate.\nThe Lady’s dead. The artillerist’s words, or ones like them, had been rattling around Ish’s head for days, circling, leaping out to catch him whenever he let his guard down. Gula, the Lady of Isin, is dead. Every time Ish allowed himself to remember that it was as if he was understanding it for the first time, the shock of it like a sudden and unbroken fall, the grief and shame of it a monumental weight toppling down on him. Each time Ish forced the knowledge back the push he gave it was a little weaker, the space he created for himself to breathe and think and feel in a little smaller. He was keeping himself too busy to sleep because every time he closed his eyes he saw the Lady’s pleading face.\nHe climbed over the windowsill and into the house.\nThe body of a very old man was curled up there, dressed in nothing but a dirty white loincloth that matched the color of the man’s hair and beard and the curls on his narrow chest. In the man’s bony hands an icon of Lady Gula was clutched, a cheap relief with machine-printed colors that didn’t quite line up with the ceramic curves, the Lady’s robes more blue than purple and the heraldic dog at her feet more green than yellow; the sort of thing that might be sold in any back-alley liquor store. One corner had been broken off, so that the Lady’s right shoulder and half her face were gone, and only one eye peered out from between the man’s knuckles. When Ish moved to take the icon, the fingers clutched more tightly, and the old man’s eyelids fluttered as a rasp of breath escaped his lips.\nIsh released the icon. Its one-eyed stare now seemed accusatory.\n“Okay,” he said heavily. “Okay, Granddad.”\nBABYLON CITY 1:1 5″ N:1 16″ / 34821.1.14 7:15\n“Lord Ninurta vows justice for Lady of Isin”\n“Police to protect law-abiding nomads”\n“Lawlessness in Sippar”\n—Headlines, temple newspaper Marduknaşir, Babylon City\nBABYLON CITY 4:142 113″ S:4 12″ / 34821.1.15 1:3\n“Pointless revenge mission”\n“Lynchings in Babylon: immigrants targeted”\n“Sippar rises up”\n—Headlines, radical newspaper Iïnshushaqiï, Babylon City\nGISH, NIPPUR, SIPPAR (various locations) / 34821.1.15\n“THEY CAN DIE”\n—Graffiti common in working-class and slave districts, after the nomad attack on Isin\n3. Kinetic penetrator\nWhen Tara came home she found Ish on a bench in the courtyard, bent over the broken icon, with a glue pot and an assortment of scroll clips and elastic bands from Tara’s desk. They’d talked, when they first moved into this house not long after Mâra was born, of turning one of the ground-floor rooms into a workshop for Ish, but he was home so rarely and for such short periods that with one thing and another it had never happened. She kept gardening supplies there now.\nThe projector in the courtyard was showing some temple news feed, an elaborately animated diagram of the nomads’ weapon—a ‘kinetic penetrator,’ the researcher called it, a phrase that Tara thought should describe something found in a sex shop or perhaps a lumberyard—striking the city’s outer shell, piercing iron and ice and rock before erupting in a molten plume from the steps directly beneath the Lady’s feet.\nTara turned it off.\nIsh looked up. “You’re back,” he said.\n“You stole my line,” said Tara. She sat on the bench next to Ish and looked down at the icon in his lap. “What’s that?”\n“An old man gave it to me,” Ish said. “There.” He wrapped a final elastic band around the icon and set it down next to the glue pot. “That should hold it.”\nHe’d found the broken corner of the icon on the floor not far from the old man’s couch. On Ish’s orders they’d abandoned the pointless mapping expedition and taken the man to an aid station, bullied the doctors until someone took responsibility.\nThere, in the aid tent, the man pressed the icon into Ish’s hands, both pieces, releasing them with shaking fingers.\n“Lady bless you,” he croaked.\nThe artillerist, at Ish’s elbow, gave a bitter chuckle, but didn’t say anything. Ish was glad of that. The man might be right, there might be no command, there might be no soldiery, Ish might not be an under-officer any more, just a man giving orders. But Ish was, would continue to be, a soldier of the Lady, a soldier of the city of Isin, and if he had no lawful orders that only put the burden on him to order himself.\nHe was glad the artillerist hadn’t spoken, because if the man had at that moment said again the Lady’s dead, Ish was reasonably sure he would have shot him.\nHe’d unzipped the flap on the left breast pocket of his jumpsuit and tucked both pieces of the icon inside. Then he’d zipped the pocket closed again, and for the first time in five days, he’d gone home.\nTara said: “Now that you’re back, I wish you’d talk to Mâra. She’s been having nightmares. About the Corn Parade. She’s afraid the nomads might blow up her school.”\n“They might,” Ish said.\n“You’re not helping.” Tara sat up straight. She took his chin in her hand and turned his head to face her. “When did you last sleep?”\nIsh pulled away from her. “I took pills.”\nTara sighed. “When did you last take a pill?”\n“Yesterday,” Ish said. “No. Day before.”\n“Come to bed,” said Tara. She stood up. Ish didn’t move. He glanced down at the icon.\nAn ugly expression passed briefly over Tara’s face, but Ish didn’t see it.\n“Come to bed,” she said again. She took Ish’s arm, and this time he allowed himself to be led up the stairs.\nAt some point in the night they made love. It wasn’t very good for either of them; it hadn’t been for a long while, but this night was worse. Afterwards Tara slept.\nShe woke to find Ish already dressed. He was putting things into his soldiery duffle.\n“Where are you going?” she asked.\n“Lagash.”\n“What?”\nTara sat up. Ish didn’t look at her.\n“Lord Ninurta’s fitting out an expedition,” Ish said.\n“An expedition,” said Tara flatly.\n“To find the nomads who killed the Lady.”\n“And do what?” asked Tara.\nIsh didn’t answer. From his dresser he picked up his identification seal, the cylinder with the Lady’s heraldic dog and Ish’s name and Temple registry number, and fastened it around his neck.\nTara turned away.\n“I don’t think I ever knew you,” she said, “But I always knew I couldn’t compete with a goddess. When I married you, I said to my friends: ‘At least he won’t be running around after other women.’” She laughed without humor. “And now she’s dead—and you’re still running after her.”\nShe looked up. Ish was gone.\nOutside it was hot and windless under a lowering sky. Nothing was moving. A fine gray dust was settling over the sector: the Lady’s ashes, Ish had heard people call it. His jump boots left prints in it as he carried his duffle to the train station.\nAn express took Ish to the base of the nearest spoke, and from there his soldiery ID and a series of elevators carried him to the southern polar dock. As the equatorial blue and white of the city’s habitable zone gave way to the polished black metal of the southern hemisphere, Ish looked down at the apparently untroubled clouds and seas ringing the city’s equator and it struck him how normal this all was, how like any return to duty after leave.\nIt would have been easy and perhaps comforting to pretend it was just that, comforting to pretend that the Corn Parade had ended like every other, with the Lady’s blessing on the crops, the return of the images to the shrines, drinking and dancing and music from the dimming of the Lady’s House at dusk to its brightening at dawn.\nIsh didn’t want that sort of comfort.\n34821.6.29 5:23:5:12.102\nAbstract of report prepared by priest-astronomers of Ur under the direction of Shamash of Sippar, at the request of Ninurta of Lagash.\nIsotopic analysis of recovered penetrator fragments indicates the nomad weapon to have been constructed within and presumably fired from the Apsu near debris belt. Astronomical records are surveyed for suspicious occlusions, both of nearby stars in the Babylon globular cluster and of more distant stars in the Old Galaxy, and cross-referenced against traffic records to eliminate registered nomad vessels. Fifteen anomalous occlusions, eleven associated with mapped point mass Sinkalamaïdi-541, are identified over a period of one hundred thirty-two years. An orbit for the Corn Parade criminals is proposed.\n4. Dog soldier\nThere was a thump as Ish’s platform was loaded onto the track. Then Sharur’s catapult engaged and two, three, five, eight, thirteen, twenty times the force of Isin’s equatorial rotation pushed Ish into his thrust bag; and then Ish was flying free.\nIn his ear, the voice of the ship said:\n—First company, dispersion complete.\nOn the control console, affixed there, sealed into a block of clear resin: Gula’s icon. Ish wondered if this was what she wanted.\nAnd Ninurta added, for Ish’s ears alone:\n—Good hunting, dog soldier.\nAt Lagash they’d wanted Ish to join the soldiery of Lagash; had offered him the chance to compete for a place with the Lion-Eagles, Ninurta’s elites. Ish had refused, taking the compassion of these warlike men of a warlike city for contempt. Isin was sparsely populated for a city of Babylon, with barely fifty billion spread among its parks and fields and orchards, but its soldiery was small even for that. When the hard men in Ashur and the actuaries in Babylon-Borsippa counted up the cities’ defenders, they might forget Lady Gula’s soldiers, and be forgiven for forgetting. What Ninurta’s men meant as generosity to a grieving worshipper of their lord’s consort Ish took for mockery of a parade soldier from a rustic backwater. It needed the intervention of the god himself to make a compromise; this after Ish had lost his temper, broken the recruiter’s tablet over his knee and knocked over his writing-table.\n“You loved her—dog soldier.”\nIsh turned to see who had spoken, and saw a god in the flesh for the first time.\nThe Lord of Lagash was tall, five cubits at least, taller than any man, but the shape and set of his body in its coppery-red armor made it seem that it was the god who was to scale and everything around him—the recruiting office, the Lion-Eagles who had been ready to lay hands on Ish and who were now prostrate on the carpet, the wreckage of the recruiter’s table, Ish himself—that was small. The same agelessness was in Ninurta’s dark-eyed face that had been in Lady Gula’s, but what in the Lady had seemed to Ish a childlike simplicity retained into adulthood was turned, in her consort, to a precocious maturity, a wisdom beyond the unlined face’s years.\nIsh snapped to attention. “Lord,” he said. He saluted—as he would have saluted a superior officer. A murmur of outrage came from the Lion-Eagles on the floor.\nThe god ignored them. “You loved her,” he said again, and he reached out and lifted Ish’s seal-cylinder where it hung around his neck, turned it in his fingers to examine the dog figure, to read Ish’s name and number.\n“No, Lord Ninurta,” Ish said.\nThe god looked from the seal to Ish’s face.\n“No?” he said, and there was something dangerous in his voice. His fist closed around the seal.\nIsh held the god’s gaze.\n“I’ve never stopped loving her,” he said.\nIsh had been prepared to hate the Lord of Lagash, consort of the Lady of Isin. When Ish thought of god and goddess together his mind slipped and twisted and turned away from the idea; when he’d read the god’s proclamation of intent to hunt down the nomads that had murdered ‘his’ lady, Ish’s mouth had curled in an involuntary sneer. If the Lord of Lagash had tried to take the seal then, Ish would have fought him, and died.\nBut the god’s fist opened. He glanced at the seal again and let it drop.\nThe god’s eyes met Ish’s eyes, and in them Ish saw a pain that was at least no less real and no less rightful than Ish’s own.\n“Neither have I,” Ninurta said.\nThen he turned to his soldiers.\n“As you were,” he told them. And, when they had scrambled to their feet, he pointed to Ish. “Ishmenininsina Ninnadiïnshumi is a solder of the city of Isin,” he told them. “He remains a soldier of the city of Isin. He is your brother. All Lady Gula’s soldiers are your brothers. Treat them like brothers.”\nTo Ish he said, “We’ll hunt nomads together, dog soldier.”\n“I’d like that,” Ish said. “Lord.”\nNinurta’s mouth crooked into a half-smile, and Ish saw what the Lady of Isin might have loved in the Lord of Lagash.\nFor the better part of a year the hunters built, they trained, they changed and were changed—modified, by the priest-engineers who served Ninagal of Akkad and the priest-doctors who had served Lady Gula, their hearts and bones strengthened to withstand accelerations that would kill any ordinary mortal, their nerves and chemistries changed to let them fight faster and harder and longer than anything living, short of a god.\nThe point mass where the priest-astronomers of Ur thought the hunters would find the nomad camp was far out into Apsu, the diffuse torus of ice and rock and wandering planetary masses that separated Babylon from the nearest stars. The detritus of Apsu was known, mapped long ago down to the smallest fragment by Sin and Shamash, and the nomads’ work had left a trail that the knowledgeable could read.\nThe object the nomads’ weapon orbited was one of the largest in the near reaches of Apsu, the superdense core of some giant star that had shed most of its mass long before the Flood, leaving only this degenerate, slowly cooling sphere, barely a league across. The gods had long since oriented it so the jets of radiation from its rapidly spinning magnetic poles pointed nowhere near the cities, moved it into an orbit where it would threaten the cities neither directly with its own gravity, nor by flinging comets and planetesimals down into Babylon.\nIt took the hunters two hundred days to reach it.\nThe great ship Sharur, the Mace of Ninurta, a god in its own right, was hauled along the surface of Lagash to the city’s equator, fueled, armed, loaded with the hunters and all their weapons and gear, and set loose.\nIt dropped away slowly at first, but when the ship was far enough from the city its sails opened, and in every city of Babylon it was as if a cloud moved between the land and the shining houses of the gods, as the power of Ninagal’s ring was bent to stopping Sharur in its orbit. Then the Mace of Ninurta folded its sails like the wings of a diving eagle and fell, gathering speed. The black circle that was Tiamat’s event horizon grew until it swallowed half the sky, until the soldiers packed tight around the ship’s core passed out in their thrust bags and even Sharur’s prodigiously strong bones creaked under the stress, until the hunters were so close that the space-time around them whirled around Tiamat like water. Ninagal’s ring flashed by in an instant, and only Lord Ninurta and Sharur itself were conscious to see it. Sharur shot forward, taking with it some tiny fraction of the black hole’s unimaginable angular momentum.\nAnd then Tiamat was behind them, and they were headed outward.\nBABYLON CITY 1:1 5″ N:1 16″ / 34822.7.18 7:15\n“All cities’ prayers with Lord of Lagash”\n“Police seek nomad agents in Babylon”\n“Lord Shamash asks Lord Anshar to restore order”\n—Headlines, temple newspaper Marduknaşir, Babylon City\nBABYLON CITY 4:142 113″ S:4 12″ / 34822.7.16 1:3\n“An eye for an eye”\n“Nativist witch-hunt”\n“Ashur to invade Sippar”\n—Headlines, radical newspaper Iïnshushaqiï, Babylon City\n5. Machines\nAt Lagash they had drilled a double dozen scenarios: city-sized habitats, ramship fleets, dwarf planets threaded with ice tunnels like termite tracks in old wood. When the cities fought among themselves the territory was known and the weapons were familiar. The vacuum armor Ish had worn as a Surface Tactical was not very different from what a soldier of Lagash or Ashur or Akkad would wear although the gear of those warlike cities was usually newer and there was more of it. The weapons the Surface Tacticals carried were deadly enough to ships or to other vacuum troops, and the soldiers of the interior had aircraft and artillery and even fusion bombs although no one had used fusion bombs within a city in millennia. But there had been nothing like the nomads’ weapon, nothing that could threaten the fabric of a city. No one could say with certainty what they might meet when they found the nomad encampment.\nIsh had seen nomad ships in dock at Isin. There were ramships no larger than canal barges that could out-accelerate a troopship and push the speed of light, and ion-drive ships so dwarfed by their fuel supplies that they were like inhabited comets, and fragile light-sailers whose mirrors were next to useless at Babylon, and every one was unique. Ish supposed you had to be crazy to take it into your head to spend a lifetime in a pressurized can ten trillion leagues from whatever you called home. There wouldn’t be many people as crazy as that and also able enough to keep a ship in working order for all that time, even taking into account that you had to be crazy in the first place to live in the rubble around a star when you could be living in a city.\nBut that wasn’t right either. Because most of the people that in Babylon they called nomads had been born out there on their planets or wherever, where there were no cities and no gods, with as much choice about where they lived as a limpet on a rock. It was only the crazy ones that had a choice and only the crazy ones that made it all the way to Babylon.\nThe nomads Ish was hunting now, the assassins somewhere out there in the dark, he thought were almost simple by comparison. They had no gods and could build no cities and they knew it and it made them angry and so whatever they couldn’t have, they smashed. That was a feeling Ish could understand.\nGods and cities fought for primacy, they fought for influence or the settlement of debts. They didn’t fight wars of extermination. But extermination was what the nomads had raised the stakes to when they attacked the Corn Parade and extermination was what Ish was armed for now.\n—There, said Sharur’s voice in his ear.—There is their weapon.\nIn the X-ray spectrum Sinkalamaïdi-541 was one of the brightest objects in the sky, but to human eyes, even augmented as Ish’s had been at Lagash, even here, less than half a million leagues from the target, what visible light it gave off as it cooled made it only an unusually bright star, flickering as it spun. Even under the magnification of Sharur’s sharp eyes it was barely a disc; but Ish could see that something marred it, a dark line across the sickly glowing face.\nA display square opened, the dead star’s light masked by the black disc of a coronagraph, reflected light—from the dead star itself, from the living stars of the surrounding cluster, from the Old Galaxy—amplified and enhanced. Girdling Sinkalamaïdi-541 was a narrow, spinning band of dull carbon, no more than a thousand leagues across, oriented to draw energy from the dead star’s magnetic field; like a mockery of Ninagal’s ring.\n—A loop accelerator, the ship said.—Crude but effective.\n—They must be very sophisticated to aspire to such crudeness, said Ninurta.—We have found the sling, but where is the slinger?\nWhen straight out of the temple orphanage he’d first enlisted, they’d trained Ish as a rifleman, and when he’d qualified for Surface Tactical School they’d trained him as a vacuum armor operator. What he was doing now, controlling this platform that had been shot down an electromagnetic rail like a corn can, was not very much like either of those jobs, although the platform’s calculus of fuel and velocity and power and heat was much the same as for the vacuum armor. But he was not a Surface Tactical anymore and there was no surface here, no city with its weak gravity and strong spin to complicate the equations, only speed and darkness and somewhere in the darkness the target.\nThere was no knowing what instruments the nomads had but Ish hoped to evade all of them. The platform’s outer shell was black in short wavelengths and would scatter or let pass long ones; the cold face it turned toward the nomad weapon was chilled to within a degree of the cosmic microwave background, and its drives were photonic, the exhaust a laser-tight collimated beam. Eventually some platform would occlude a star or its drive beam would touch some bit of ice or cross some nomad sensor’s mirror and they would be discovered, but not quickly and not all at once.\nThey would be on the nomads long before that.\n—Third company, Ninurta said.—Fire on the ring. Flush them out.\nThe platforms had been fired from Sharur’s catapults in an angled pattern so that part of the energy of the launch went to slowing Sharur itself and part to dispersing the platforms in an irregular spreading cone that by this time was the better part of a thousand leagues across. Now the platforms’ own engines fired, still at angles oblique to the line joining Sharur’s course to the dead star.\nBelow Ish—subjectively—and to his left, a series of blinking icons indicated that the platforms of the third company were separating themselves still further, placing themselves more squarely in the track of the dead star’s orbit. When they were another thousand leagues distant from Sharur they cast their weapons loose and the weapons’ own engines fired, bright points Ish could see with his own eyes, pushing the weapons onward with a force beyond what even the hunters’ augmented and supported bodies could withstand.\nTime passed. The flares marking the weapons of the third company went out one by one as their fuel was exhausted. When they were three hundred thousand leagues from the ring, the longest-ranged of the weapons—antiproton beams, muon accelerators, fission-pumped gamma-ray lasers—began to fire.\nBefore the bombardment could possibly have reached the ring—long before there had passed the thirty or forty grains required for the bombardment to reach the ring and the light of the bombardment’s success or failure to return to Sharur and the platforms—the space between the ring and the third company filled with fire. Explosions flared all across Ish’s field of view, pinpoints of brilliant white, shading to ultraviolet. Something hit the side of the platform with a terrific thump, and Ish’s hand squeezed convulsively on the weapon release as his diagnostic screens became a wash of red. There was a series of smaller thumps as the weapons came loose, and then a horrible grinding noise as at least one encountered some projecting tangle of bent metal and broken ceramic. The platform was tumbling. About half Ish’s reaction control thrusters claimed to be working; he fired them in pairs and worked the gyroscopes till the tumble was reduced to a slow roll, while the trapped weapon scraped and bumped its way across the hull and finally came free.\n—Machines, machines! he heard Ninurta say.—Cowards! Where are the men?\nThen the weapon, whichever it was, blew up.\n34822.7.16 4:24:6:20 - 5:23:10:13\nMoving image, recorded at 240 frames per second over a period of 117 minutes 15 seconds by spin-stabilized camera, installation “Cyrus,” transmitted via QT to COS Liberation, on Gaugamela station, and onward to Community Outreach archives, Urizen:\nFrom the leading edge of the accelerator ring, it is as though the ring and the mass that powers it are rising through a tunnel of light.\nFor ten million kilometers along the track of the neutron star’s orbit, the darkness ahead sparkles with the light of antimatter bombs, fusion explosions, the kinetic flash of chaff thrown out by the accelerator ring impacting ships, missiles, remotely operated guns; impacting men. Through the minefield debris of the ring’s static defenses, robotic fighters dart and weave, looking to kill anything that accelerates. Outreach has millennia of experience to draw on, and back in the Community a population of hundreds of billions to produce its volunteer missionaries, its dedicated programmers, its hobbyist generals. Many of the Babylonian weapons are stopped; many of the Babylonian ships are destroyed. Others, already close to Babylon’s escape velocity and by the neutron star’s orbital motion close to escaping from it as well, are shunted aside, forced into hyperbolic orbits that banish them from the battlefield as surely as death.\nBut the ring’s defenders are fighting from the bottom of a deep gravity well, with limited resources, nearly all the mass they’ve assembled here incorporated into the ring itself; and the Babylonians have their own store of ancient cunning to draw on, their aggregate population a hundred times larger than the Community’s, more closely knit and more warlike. And they have Ninurta.\nNinurta, the hunter of the Annunaki, the god who slew the seven-headed serpent, who slew the bull-man in the sea and the six-headed wild ram in the mountain, who defeated the demon Ansu and retrieved the Tablet of Destinies.\nSharur, the Mace of Ninurta, plunges through the battle like a shark through minnows, shining like a sun, accelerating, adding the thrust of its mighty engines to the neutron star’s inexorable pull. Slender needles of laser prick out through the debris, and Sharur’s sun brightens still further, painful to look at, the ship’s active hull heated to tens of thousands of degrees. Something like a swarm of fireflies swirls out toward it, and the camera’s filters cut in, darkening the sky as the warheads explode around the ship, a constellation of new stars that flare, burn, and die in perfect silence: and Sharur keeps coming.\nIt fills the view.\nOverhead, a blur, it flashes past the camera, and is gone.\nThe image goes white.\nThe transmission ends.\n6. Surviving weapons\nIt was cold in the control capsule. The heat sink was still deployed and the motors that should have folded it in would not respond. Ish found he didn’t much care. There was a slow leak somewhere in the atmosphere cycler and Ish found he didn’t much care about that either.\nThe battle, such as it was, was well off to one side. Ish knew even before doing the math that he did not have enough fuel to bring himself back into it. The dead star was bending his course but not enough. He was headed into the dark.\nIsh’s surviving weapons were still burning mindlessly toward the ring and had cut by half the velocity with which they were speeding away from it, but they too were nearly out of fuel and Ish saw that they would follow him into darkness.\nHe watched Sharur’s plunge through the battle. The dead star was between him and the impact when it happened, but he saw the effect it had: a flash across the entire spectrum from long-wave radio to hard X-ray, bright enough to illuminate the entire battlefield; bright enough, probably, to be seen from the cities.\nAnother god died.\nThere was a sparkle of secondary explosions scattered through the debris field, weapons and platforms and nomad fighters alike flashing to plasma in the light of Ninurta’s death. Then there was nothing. The ring began, slowly, to break up.\nIsh wondered how many other platforms were still out here, set aside like his, falling into Apsu. Anyone who had been on the impact side was dead.\nThe weapons’ drive flares went out.\nThe mended icon was still where he had fixed it. Ish shut down the displays one by one until his helmet beam was the only light and adjusted the thrust bag around the helmet so that the beam shone full on the icon. The look in the Lady’s eyes no longer seemed accusatory, but appraising, as if she were waiting to see what Ish would do.\nThe beam wavered and went dark.\nBABYLON CITY 2:78 233″ S:2 54″ / 34822.10.6 5:18:4\nRecord of police interrogation, Suspect 34822.10.6.502155, alias Ajabeli Huzalatum Taraämapsu, alias Liburnadisha Iliawilimrabi Apsuümasha, alias ‘Black’. Charges: subversion, terrorism, falsification of temple records, failure to register as a foreign agent. Interrogator is Detective (Second Degree) Nabûnaïd Babilisheïr Rabişila.\nRabişila: Your people are gone. Your weapon’s been destroyed. You might as well tell us everything.\nSuspect: It accomplished its purpose.\nRabişila: Which was?\nSuspect: To give you hope.\nRabişila: What do you mean, “hope”?\nSuspect: Men are fighting gods now, in Gish and Sippar.\nRabişila: A few criminal lunatics. Lord Anshar will destroy them.\nSuspect: Do you think they’ll be the last? Two of your gods are dead. Dead at the hands of mortals. Nothing Anshar’s soldiers do to Sippar will change that. Nothing you do to me.\nRabişila: You’re insane.\nSuspect: I mean it. One day—not in my lifetime, certainly not in yours, but one day—one day you’ll all be free.\n7. A soldier of the city\nA ship found Ish a few months later: a ship called Upekkhâ, from a single-system nomad civilization based some seventeen light-years from Babylon and known to itself as the Congregation. The ship, the name of which meant ‘equanimity’, was an antimatter-fueled ion rocket, a quarter of a league long and twice that in diameter; it could reach two-tenths the speed of light, but only very, very slowly. It had spent fifteen years docked at Babylon-Borsippa, and, having been launched some four months before the attack on the Corn Parade, was now on its way back to the star the Congregation called Mettâ. The star’s name, in the ancient liturgical language of the monks and nuns of the Congregation, meant ‘kindness’.\nIsh was very nearly dead when Upekkhâ’s monks brought him aboard. His heart had been stopped for some weeks, and it was the acceleration support system rather than Ish’s bloodstream that was supplying the last of the platform’s oxygen reserves to his brain, which itself had been pumped full of cryoprotectants and cooled to just above the boiling point of nitrogen. The rescue team had to move very quickly to extricate Ish from that system and get him onto their own life support. This task was not made any easier by the militarized physiology given to Ish at Lagash, but they managed it. He was some time in recovering.\nIsh never quite understood what had brought Upekkhâ to Babylon. Most of the monks and nuns spoke good Babylonian—several of them had been born in the cities—but the concepts were too alien for Ish to make much sense of them, and Ish admitted to himself he didn’t really care to try. They had no gods, and prayed—as far as Ish could tell—to their ancestors, or their teachers’ teachers. They had been looking, they said, for someone they called Tathâgata, which the nun explaining this to Ish translated into Babylonian as ‘the one who has found the truth’. This Tathâgata had died, many years ago on a planet circling the star called Mettâ, and why the monks and nuns were looking for him at Babylon was only one of the things Ish didn’t understand.\n“But we didn’t find him,” the nun said. “We found you.”\nThey were in Upekkhâ’s central core, where Ish, who had grown up on a farm, was trying to learn how to garden in free fall. The monks and nuns had given him to understand that he was not required to work, but he found it embarrassing to lie idle—and it was better than being alone with his thoughts.\n“And what are you going to do with me?” Ish asked.\nThe nun—whose own name, Arrakhasampada, she translated as ‘the one who has attained watchfulness’—gave him an odd look and said:\n“Nothing.”\n“Aren’t you afraid I’ll—do something? Damage something? Hurt someone?” Ish asked.\n“Will you?” Arrakhasampada asked.\nIsh had thought about it. Encountering the men and women of Upekkhâ on the battlefield he could have shot them without hesitation. In Apsu, he had not hesitated. He had looked forward to killing the nomads responsible for the Corn Parade with an anticipation that was two parts vengefulness and one part technical satisfaction. But these nomads were not those nomads, and it was hard now to see the point.\nIt must have been obvious, from where the monks and nuns found Ish, and in what condition, what he was, and what he had done. But they seemed not to care. They treated Ish kindly, but Ish suspected they would have done as much for a wounded dog.\nThe thought was humbling, but Ish also found it oddly liberating. The crew of Upekkhâ didn’t know who Ish was or what he had been trying to do, or why. His failure was not evident to them.\nThe doctor, an elderly monk who Ish called Dr. Sam—his name, which Ish couldn’t pronounce, meant something like ‘the one who leads a balanced life’— prounounced Ish fit to move out of the infirmary. Arrakhasampada and Dr. Sam helped Ish decorate his cabin, picking out plants from the garden and furnishings from Upekkhâ’s sparse catalog with a delicate attention to Ish’s taste and reactions that surprised him, so that the end result, while hardly Babylonian, was less foreign, more Ish’s own, than it might have been.\nArrakhasampada asked about the mended icon in its block of resin, and Ish tried to explain.\nShe and Dr. Sam grew very quiet and thoughtful.\nIsh didn’t see either of them for eight or ten days. Then one afternoon as he was coming back from the garden, dusty and tired, he found the two of them waiting by his cabin. Arrakhasampada was carrying a bag of oranges, and Dr. Sam had with him a large box made to look like lacquered wood.\nIsh let them in, and went into the back of the cabin to wash and change clothes. When he came out they had unpacked the box, and Ish saw that it was an iconostasis or shrine, of the sort the monks and nuns used to remember their predecessors. But where the name-scroll would go there was a niche just the size of Ish’s icon.\nHe didn’t know who he was. He was still—would always be—a soldier of the city, but what did that mean? He had wanted revenge, still did in some abstract way. There would be others, now, Lion-Eagles out to avenge the Lord of Lagash, children who had grown up with images of the Corn Parade. Maybe Mâra would be among them, though Ish hoped not. But Ish himself had had his measure of vengeance in Apsu and knew well enough that it had never been likely that he would have more.\nHe looked at the icon where it was propped against the wall. Who was he? Tara: “I don’t think I ever knew you.” But she had, hadn’t she? Ish was a man in love with a dead woman. He always would be. The Lady’s death hadn’t changed that, any more than Ish’s own death would have. The fact that the dead woman was a goddess hadn’t changed it.\nIsh picked up the icon and placed it in the niche. He let Dr. Sam show him where to place the orange, how to set the sticks of incense in the cup and start the little induction heater. Then he sat back on his heels and they contemplated the face of the Lady of Isin together.\n“Will you tell us about her?” Arrakhasampada asked.\nOriginally published in Engineering Infinity, edited by Jonathan Strahan.\nDavid Moles is a past finalist for the Hugo Award, the World Fantasy Award, and the John W. Campbell Award for Best New Writer, as well as the winner of the 2008 Theodore Sturgeon Memorial Award. His work has appeared in Strange Horizons, Asimov's Science Fiction, The Magazine of Fantasy & Science Fiction, and various anthologies. He lives in California with his family.", "source": "https://clarkesworldmagazine.com/moles_12_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Soldier of the City by David Moles"}