{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "A T Greenblatt", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "jUhSC+rhyzN+aCV3k3Gq/sgJXZ4=", "id": null, "license": null, "comments": "", "raw_text": "5800 words, short story  One Time, a Reluctant Traveler  If you must know, I left because if I stayed in Nat’s house one night longer, I was going to unravel, like a tragic traveler in one of my family’s tales. And that was a story I didn’t want to be.  My bike was already packed. Had been for a few weeks. It was waiting for me on the trail like an old faithful steed. Soft mulch shifted under my boots as I made my way toward it, a pack on my back, a helmet under one arm, and two jars of ashes under the other. The forest was hushed. Silent except for the chittering of squirrels and bot birds. It smelled like compost and impending rain. My parents always told me rain was lucky.  Except, I’d grown skeptical of the things my parents said. Especially their stories.  I wondered if they’d think the rain was lucky if they had to ride thirty kilometers in it, when everything gets shiny and slick and dangerous even at modest speeds. I glanced up, trying to assess the clouds between the gaps in the forest canopy. A big, swollen raindrop landed smack in the center of my forehead.  Just my luck.  Screw this. I’ll leave tomorrow. I thought and turned to go back to the house. I’d always been a reluctant traveler.  Through a cracked window, I could see Nat, her hair still sleep-mussed, her cybernetic hands pressed against the window, her breath fogging up the pane, like a little kid.  It made me smile. I had fixed those hands for her.  Then she slapped a note to the window and my smile faded. It read: Go! Go! Go!  She was right, of course she was. I’d promised I would find the ocean at the top of the mountain. and it haunted me.  So, I left because if I stayed one more night, I’d see the ghost of my mom again. She’d look around Nat’s sparse house, at my nest of blankets on the floor, and she wouldn’t say anything. Didn’t need to. Her sadness and disappointment would be so clear.  I was ninety-five percent sure my ghost mom was my imagination. My subconscious telling me to go, go, go too. But that five percent made me wonder.  Reluctantly, I tucked the jars of my parents’ ashes in the panniers on the bike. They clinked against the six other jars of ashes already packed in the side bags. I slid on my helmet and took one last long look at Nat in the window.  She gave me a warm smile. Though it was full of sadness too.  So, I left because a few weeks ago, my hometown got hit by a mudslide and my parents’ house almost collapsed on me. And I realized as I fled, that if I died, I wouldn’t leave any stories behind.  As I started pedaling, it began to rain.  My parents used to tell endless stories about the impossible ocean on top of the mountain and the travelers who took the path. But if there was one thing the stories taught me, it was this. Always this.  No one who took this journey ended up happy.  One time, a coughing sickness killed her family, and the widow packed her bags for the cursed path. She knew the stories; she’d listened carefully to every whispered version for years. They said there was an ocean at the end of the trail where, if you wanted to survive in this terrible world, you needed to bring your loved ones’ ashes and drink its bitter water. The ocean was magic. It was haunted. It was impossible. It would only make her feel worse.  The widow didn’t care. At dawn, she left her gray, deadbeat town for the cursed path. In her pack there were eight jars of ashes, one for each of her two husbands, five children, and one loyal dog.  The cursed path wasn’t long, but the going was slow and treacherous. There were many dangers even among the leafless trees, thin and stark as skeletons.  You think you’ll make it, solitary woman? the trees whispered.  The widow bristled, but ignored them, knowing the stories. The trees just wanted to keep her for themselves. She kept going.  We’re sorry. We’re lonely. We need a friend. Please. Stay, stay, stay, they whispered to her back as she walked. They sounded sincere.  But she knew how to tune out demanding voices. She once was a mother to a large family.  So she passed through that whispering forest, never even considering their offer. Because what would be the point of her journey, her memories, her grief, her fight to survive if she stopped now?  This was my mom’s favorite story. She had me later in life. I was my parents’ only kid and she rarely talked about her past, no matter how much I questioned and begged. She told stories instead.  Sometimes, I thought if someone were to cut me open, it wouldn’t be entrails that spilled out, but stories. Hundreds of family tales and movies. I loved old movies. Especially ones with happy endings.  It’s thirty km to the ocean on the mountain, said the note Nat left on the bathroom mirror. She preferred to communicate via notes, which thrilled me. There’s something slow and deliberate and loving in having a conversation on snatches of paper. It was easier trying to communicate via anecdotes.  Thirty kilometers, I thought. I can do that in a day. It was a two-hundred-kilometer ride from my decimated hometown to Nat’s house using a ruined state highway that was mostly potholes and splintered tarmac. It took me four days to get there. So, I thought, How bad could thirty klicks be?  Very bad, I realized an hour into my journey. The trail’s incline rose steadily and the trees began to thin out, but the rain stayed consistent, insistent, making the path a slurry of mud. The path eroded the farther I went.  I kept going because I didn’t want to go back and disappoint my mom’s ghost. Or Nat. Nat, who let me stay at her house for weeks, even though we’d only hung out at the farm/exchange market in my town’s overgrown community park. Where I’d barter things I’d salvaged from the abandoned mall like shirts, shoes, once, a bottle of strawberry vodka I found stashed behind a register, in exchange for some of her peaches or raspberry jam. Nat, who handed me a note that said Come by my house, if you go to the ocean. Which was how I knew, she was full of stories too.  Eventually, it was easier to dismount and walk aside my bike. The path was all mud and treacherous footing and stank of rot. But at least the trees didn’t whisper. They were all cut down. I was in a forest of stumps that seemed more like a graveyard or a silhouette of something beautiful and lost.  I kept going. A fog was rising and every creak of my bicycle or crunch of my boot sounded unnaturally loud.  Maybe that’s why I heard the voices.  It took a moment to realize it wasn’t the stumps of trees talking. That’s how entrenched the widow’s story is in me. No, it wasn’t the trees. There was someone there in the thickening mist. Or rather, judging from the pitch of voices, several someones. The low, steady hum behind the voices told me these someones had drones overhead.  I held perfectly still. Waiting, calculating. They were hunting something. I knew this because everyone these days was hunting or scavenging or scrounging something in this graveyard of civilization. I hoped it was just deer, but I heard stories of worse. There’s always a worse story.  I shifted my weight slightly and my bike creaked. The voices in the mist halted. I couldn’t see them, but I could imagine, and I imagined the people they belonged to peering through the fog toward me. Waiting, calculating.  “Hello?” one said.  “Hi,” I answered in a voice just above a whisper.  A shot rang out.  I dove to the ground. My bike fell on me, jars rattling. Suddenly, all the worst stories were ringing in my ears. People are crazy territorial these days. Woods are a breeding ground for cults. Some people will eat anything they find. I didn’t know where the shot came from or how close it’d been to me. But I didn’t care. It was too close. Too close. I was alive, unharmed, but too close, and the voices and drones were getting closer. Louder.  I didn’t think. My hands were shaking, full of reeking mud. But I didn’t think. I unbuckled my helmet and hurled it as hard as I could downhill, away from the direction I was headed. It was a prayer. And a plea. It was all I had. The helmet bounced and crashed against the stumps once, twice, three times. Then it went silent.  For a moment, the voices and the drones went silent too.  Somewhere in the mist, a voice swore and boots crunched as they turned. (Too close.) The drones whined as they changed directions. The hunters began to move away.  I lay there in the mud, for a minute, maybe two, barely breathing. Listening and hoping and pleading that I’d get to tell this story one day, however it ends. The hunters’ voices were getting softer. So, as quickly and silently as I could, I got on my bike again and began to pedal. I had to keep going. I’ve never pedaled uphill so hard. My bike groaned and my heartbeat pounded in my ears. My tire rolled over something squishy, and the stink of rot overwhelmed me. But I didn’t stop to look. I didn’t stop. I could hear the voices swearing again in the distance. The fog was thick, but not thick enough. Not enough.  I had to keep going. So, I bent forward and rode.  I rode so hard, so blindly, I didn’t realize when I’d left the stumps behind.  And crashed into something worse.  One time, someone who’d lost something he loved found himself on the cursed path, despite promising himself he would never go to the ocean on top of the mountain. From stories, he knew there were many dangers on this road, but the one that worried him most was the stork. He needed to befriend it so it could guide him through the last and most dangerous part of the path. Making friends was never the lost lover’s strong point.  But the stork wasn’t what he expected. The great bird was mud-drenched and depressed, with wings so matted, it could no longer fly. Its legs were caked in dirt, thick enough to glue it to the rocky ledge it perched on.  “Splendid. Another grief-stricken person who wants my help,” said the stork. “Turn back. Believe me, you won’t find what you’re looking for.”  “How do you know that?” the lover said.  “Everyone who comes this way has lost someone. They don’t want to die the same way and want me to help them,” said the stork, miserably. “Am I wrong?”  The lost lover didn’t answer.  The stork sighed. “You can’t stay here. Go home or keep walking. Else, you’ll get stuck like me.”  The lover looked down. He was, in fact, sinking into the mud. He wrenched his feet free. “I think I can help you,” he said.  “How? My wings are too muddy to fly. Others have tried.”  “Not your wings.”  From his pack, the lost lover pulled out a small spade. He began digging methodically around where the bird was trapped, and then used his fingers to gently pry the caked earth from its legs.  “You’re very patient,” the stork observed.  “I’m a farmer,” he said. “I’m used to pulling things out of the mud.”  The stork laughed at this, and the lover smiled.  When it was finally free, the stork danced in place, shook out its great, dirty wings, and sighed. “I can’t fly, but I will show you the way.” it said.  “That’s good enough for me,” the lost lover said. In his pack, he carried a jar of ashes of the person he loved most in this world.  “It won’t bring you any happiness,” the stork said. “The water won’t save you.”  “I know,” the lost lover replied. “Let’s go anyway.”  I should have said goodbye to my bike, like heroes in adventure movies do when their animal companions are gravely wounded. When I hit that rock in the mud and went tumbling ass-over-head, that should have been a sign of what the path forward would look like. Except, I didn’t want to be that story either.  So I carried my steadfast steed over my shoulders, even as the mud swallowed my ankles with every footstep. Refusing to lose yet another thing. Now that I stopped fleeing, I grieved the loss of my helmet. I’d been so happy when I’d found it in a forgotten shipping warehouse when I was sixteen. It made me feel civilized and it made my parents feel like I had a talisman of safety in this dangerous world.  But I was alive and that was something. Around me there were prickly bushes and plenty of rocks and everywhere smelled like damp earth and sulfur, but thankfully, nothing rotten. The mud was murderous though. The trail was steep and the panniers with the jars of ashes rattled as I trudged forward. Miraculously, none of them were broken, but they clinked together threateningly with each step.  Of the many low points in this journey, this was one of the worst. Because it felt like I would drown going uphill to an ocean on top of a mountain that I didn’t want to see. I promised my parents that I would take their ashes to the summit. I promised Nat that I’d take her six jars up too. I promised I would drink the water and survive. And I wanted to survive. Even if the water was just a talisman.  I wish there was another way, I thought as I took another step and sank through the mud down to my calf. But this was the only path I knew.  Screw this, I thought.  I dragged myself over a cluster of rocks, rising out of the mud like the tip of an iceberg. Took stock of my scrapes and bruises from my fall and of the bent rim of the front tire. It was nothing that I couldn’t heal from, nothing I couldn’t fix. But still, it hurt.  The path ahead snaked upward forever.  I rubbed my muddy face with my muddy hands, struggling to swallow down the despair caught in my throat. I’d never felt so alone.  Quickly, before depression dragged me down, I pulled out my repair kit from one of the panniers and began to work on straightening the front wheel of my bike. Fixing something always made me feel better. I didn’t think so much when I was fixing.  That was how I heard it. The small, sad whine behind me. The sound of a motor fighting for life.  I put down my tools and scrambled over the rocks, trying to find where the noise was coming from, slipping once. Only by luck did I spot the aluminum leg peeking out from the bog, flexing helplessly.  The muddy water rose past my knees as I wrangled and pried the bot free from its mucky prison. It took me a few minutes, then a few minutes more to carry it back to my bike. The bot was small, but heavy, and the terrain wasn’t forgiving. Its gyroscopic head whirled laboriously in my arms.  I cleaned the grime from the solar panels on its back with an old shirt from my pack, but the sky was still cloudy and gray, so I hooked up my external power cell to give it a boost. And I waited.  “Damn it,” it said, when it finally had enough juice to power on.  I laughed and rubbed my face. I couldn’t have agreed more.  “Hi,” I said. “What’s your function?”  “I am. Was. Am. A park ranger,” it said. “This was. Is. A national park.” It went silent for a moment, the LED in its torso turning yellow for self-diagnosis. “Crap. Natural language processor. Is. Borked.”  I didn’t care if the bot was partly disabled, I was so relieved to have found someone. “Can you take me to the end of this trail?”  “Bad idea,” it said. It stretched out each of its six spidery legs one by one, testing the joints, giving a hum of frustration when one got stuck. Five of the six got stuck.  “I know,” I said.  “So. Why are. You here?”  “May I?” I pointed to one of its jammed legs and it beeped its consent. The joint was out of alignment. I fished out my screwdriver from my bag. “I promised my parents I would.”  “That’s a stupid. Reason. To follow.” it said.  “I know,” I said.  “Why then?”  Because this is the only path I know, I thought.  “Why were you on a muddy path out in the rain?” I tightened the screw and articulated the joint.  “My job.” it replied. “Is to guide. Visitors. Safely up the mountain. If asked.” In a slow, stuttering motion, it moved its head to look right at me. “They asked.”  Something about its inflection explained that the askers didn’t come back down. Something about its direct gaze begged me not to do the same.  I didn’t say anything, focusing on the next leg instead.  “You think. If you fix. Me.” it said after a few minutes. “I’ll take you. Where. You want. To go?”  “No,” I said, frowning at the third leg. It was bent, but no worse than the rim of my bike. “I’m doing this because it’s the right thing to do. And because I like fixing things.” I carefully bent the leg back to mostly straight  The ranger bot didn’t say much after that. It whirled its creaky head and searched for signals and updates, giving a frustrated beep when it didn’t find any.  “That’s it,” I said after I fixed its last leg and realigned the motor in its neck.  “Thank you,” it said, sounding genuinely grateful, LED turning green. “But I can’t. Take you. Up there.”  Disappointment slumped my shoulders. I hadn’t quite realized how badly I didn’t want to be alone on the path. But like the lost lover, I didn’t have much practice making friends, and I wasn’t going to force the ranger bot to come with me. “Okay. Any advice?” I asked.  “Yeah,” it said. “Don’t go.”  I slung my bike over my shoulders and tried to tamp down my fear. “Stay safe,” I said and began trudging forward. One muddy footstep at a time  “Wait,” it said, after a moment, after an eternity. “There’s another. Path.”  One time, a survivor took the cursed path to the impossible ocean. She never made it there. She got lost.  Halfway up the mountain, the path began twisting and splintered into trails that all looked the same. There were no road signs or clues. So, she chose a fork at random.  She chose wrong.  It was only by sheer luck that she picked a path that spat her out at the edge of the forest, not far from her home.  When she realized where she was, she breathed a sigh of relief. Because she knew the stories of travelers that didn’t return from the cursed path. There were too many to count.  The survivor was wise enough to know when she should count herself lucky and tap out.  Except, when she returned home and put the jars of her friends’ ashes on the mantle, six in all, she felt a cut of guilt. She thought about trying the path again, but surviving had taken a toll on her body and she knew, if she tried again, she wouldn’t make it to the impossible ocean.  Still, every time she looked at those jars, she felt fresh cuts.  And no matter how many times she glanced at the mantle or counted herself lucky, their sting never dulled.  The ranger bot, or PARKER 17, as it preferred to be called, took me back down the mountain.  We retraced my tracks, slowly because riding downhill in the mud was treacherous even in the best of times. The farther we went, the more my chest constricted. There was something heartbreaking about going back down a path I had fought so hard to climb.  This is not a regression, I thought as the forest of stumps came back into view. The fog from earlier was only a thin mist now and it was easier to see. And to be seen.  “It’s not safe here,” I whispered to PARKER 17. The memory of gunshots still echoed in my ears.  “No,” it agreed, panning its head back and forth, scanning. “But no other. Drones or GPS trackers. Are in. A ten kilometer. Radius.” Its head whirled to face me. “We’re safe. For now.”  “We’re exposed,” I said.  “Not for long.” The bot began to trot away and I had to hurry to catch up. For a long time, there was nothing except the sound of animals in the brush between us, both the natural ones and the man-made replicates that were supposed to alleviate some of the environmental damage.  For a long time, we traveled in silence. Something loomed in the distance. At first, I could only make out the outline, the lingering remains of the fog obscured the details. At first, it looked like another ridge of rocks.  Then, just like in a movie, everything came into focus. My breath caught in my throat.  It was a mountain range of old and forgotten things, discarded things from a time when everything was cheap. Except, there were small but very alive evergreens growing from out of the heaps. It was clearly man-made, and it was beautiful. One of the few beautiful man-made things I’d ever seen. I wish I had my mom’s gift for words to paint a better picture of it.  “Ta-da,” PARKER 17 said.  That wasn’t what made me smile. Between the mounds of trash and tiny trees there was a paved path. Perfectly smooth tarmac. It had been years since I’d seen pristine pavement.  “One problem,” the bot said. “My GPS. It’s shot. In there.”  “Can you use this?” I pulled out the trail map Nat gave me from my pack. PARKER 17 peeked over my shoulder at it. “Where. Did you. Get this?”  “From Nat, my friend,” I said. “She’s a trader who lives at the edge of the park.”  “What did you. Need to. Trade. For this?”  “Not much,” I said. “I fixed her hands and a half dozen other things in her house.” I didn’t mention how she accepted me after I fled my hometown following the mudslide. Put up with me for weeks until my reluctant self worked up enough courage to leave. Or how, in exchange, I took the six jars on her windowsill after I found a note that said: These belong by the ocean too.  I smoothed out the map again, refusing to meet the ranger bot’s eyes. “Can you work with this?”  “Yes,” it replied. But it didn’t sound confident. Its LED was yellow.  I didn’t care. I clung to hope where I found it.  I patted the space between my handlebars. “Hop up. I’ll move fast on the pavement.”  PARKER 17 hesitated. Then slowly, carefully, it approached the bike, reached up, and wrapped four of its six legs around the frame.  “I’ll ride, you navigate. Okay?” I said.  “Okay,” it whispered.  It was strange to have someone ride on my handlebars. It was something people did all the time in movies, but I’d never done myself. For a few moments, it was like I was part of one of those stories, with sunshine and a happy ending.  The trail began to climb upward again, and the anxious knot in my stomach started uncurling. I was going the right way again. Snaking and threading between the huge mounds of trash, I spotted glimmers of rusty cookware and broken furniture and new plants.  “What is this place?” I shouted into the wind.  “Art installation.”  We passed hundreds of mounds. My dad would have loved this, I thought as I peddled and weaved. He was always adding decorations to our old barn. In another life, he would have probably been a set designer.  When the trail split, PARKER 17 announced a direction, and I followed. Speeding on the smooth tarmac, it felt like flying.  But then, we hit a dead end. My stomach flipped. Flipped again.  “Damn,” the bot said. “This un-updated map. Go back. A few turns.”  I did, and dutifully followed the bot’s revised instructions. We seemed to be making progress up the mountain. Until we hit another dead end.  “Damn it,” PARKER 17 whispered.  We tried dozens of combinations, tracing and retracing our journey. But the mounds were identical, or identical enough, and the beautiful paved path never led anywhere at all.  The last route we tried was something I picked based on the incline and growth of the trees, which got stubbier and squatter the higher we climbed.  For a moment, it seemed like a good plan. I dared to hope, despite my aching quads and calves. That is, until we dead-ended at the biggest, most impassible hill of trash I’d seen yet.  “What do we do?” I asked, rubbing my hands through my sweat-soaked hair. I could feel them shaking through my scalp.  PARKER 17 wasn’t listening. “I can never,” it whispered. “Save them.”  That was when panic threatened to swallow me. There are hundreds of unfinished stories of travelers who took the cursed path and never made it home. It was a story I swore I would never become.  I dismounted and sat on an old coffee table sticking out from one of the trash heaps. I desperately wanted to fix something. I looked down and saw my shaking hands and decided to fix myself. I pulled out the sandwich from my pack that Nat gave me that morning. Made myself chew the homemade bread and eggs and greens. Made myself hydrate. Made myself breathe.  “Any ideas?” I asked.  PARKER 17 didn’t respond. It was muttering to itself miserably, kicking loose detritus around with its legs.  So, I heaved myself up and began studying the mounds. Up close it was a strange art installation. I’d always wanted to be an artist, but surviving these days takes time. I wasn’t like my parents. The way my dad could craft things, or my mom could spin stories. Sometimes I wondered what I could have become if I wasn’t living in the dregs of civilization. A movie director, maybe. Instead, I became good at scavenging.  Which is probably how I spotted the hair-width trail snaking between two mounds.  “Wait, what’s that?” I said.  PARKER 17 followed where my finger pointed. It inched up the ghost of a path to get a better look. It didn’t say anything for a long minute.  Then, the LED in its torso flashed green.  One time, the widow finally, finally arrived at the impossible ocean on the top of the mountain.  Her shoes were wrecked and every joint in her body ached.  But she made it.  She waded into the ocean and took a long drink. The water was brackish, but not as bitter as the stories made it out to be. She drank deeply.  Then, she pulled out the eight jars of ashes from her bag and emptied them in the water. Watched as the ashes mingled and floated away.  She waited. Except, nothing happened.  She began to turn away, disappointment heavy in her chest, when she saw them. Her loved ones. Shimmering between the ripples of the lake. Smiling at her and waving and laughing soundlessly. She shouted out, began splashing toward them, but her loved ones kept swimming away from the shore, from her. Until they were only memories on the horizon.  Once again, the widow was the only one in her family left. With nothing except grief for company.  For a moment, she wondered if she should let that grief drown her.  But no. She’d drank from the water and delivered the dead. She’d survived the journey up the mountain. She’d survive the trip back down.  So, she did. She returned to her deadbeat town and met a lonely farmer. Together they made a new home and a new family.  The widow survived and that was something. But she drank the water and it haunted her. She carried the weight of the ocean within her for the rest of her days.  The path between the trash mounds went up and up the mountain. It stretched on forever. Until it didn’t.  When I reached the impossible ocean, it took me a few seconds to understand what I was seeing. I didn’t realize how high I’d climbed. None of my family’s stories explained that the mountain towered over the ones around it, so that standing here at the apex, there was only sky.  But I am slow and I am reluctant and that wasn’t what I saw first. On the top of the mountain was a lake, so smooth and clear it looked like it was part of the sky. Or rather, the sky was a part of it.  From where I stood it looked like the water stretched out forever. Like an ocean.  “Daaaamn,” PARKER 17 said. “Still beautiful.”  “You come here often?” I asked, my voice choked with awe.  “It’s. Been a while,” it admitted.  We made our way to the water’s edge, carefully, like we were afraid to make too much noise. The summit was littered with empty packs and collapsed tents and lumps under moldy blankets that looked suspiciously like bodies. But for once, my scavenger instincts didn’t prick with interest. Because crowded against the shoreline were hundreds of jars, glimmering like candles in the evening light. I crept close and saw many of the jars carried names on them. So many names.  The jars were still full of ashes.  This was where I started wondering if my family’s stories were not completely honest. And because I’m painfully slow, this was where I finally, finally realized who the characters in my family’s stories were.  Suddenly, I understood that if I studied all the jars on the shoreline, I’d find one with my dad’s looping, neat handwriting and eight with my mother’s slanted, messy one.  “I’m an idiot,” I said.  “No,” PARKER 17 replied. “Just stubborn.”  From the panniers, I pulled out Nat’s jars, first, saying the names written on the caps as I did. Fredrick. Ravi. Esty. Johanna. Kai. Stu. I had no idea who they were in life, but I wished them peace.  And then my parents.  “The widow. The lost lover,” I whispered as I nestled their ashes among the jars full of other stories.  I’d grown suspicious of my parents’ stories, but I still stood there by the lake, among the dead, and hoped to see their ghosts swimming in the water.  I waited. And waited.  I saw nothing.  That was when the weight of being the only one left alive threatened to swallow me. Suddenly, I understood why there were days my mom couldn’t get out of bed. Why there were days my dad was up and going through the motions, but not really there. Not really functioning.  And I. I finally understood why I was on this path. It was the fear of watching the world die around you and suddenly, desperately wanting a drink from an impossible ocean that would tell you that you weren’t alone, that you would survive. No matter the cost.  I slid off my boots and inched through the jars and jars and jars, and into the impossible ocean that was really just a lake with a clever optical illusion. The water was cold enough to make me gasp, but not cold enough to stop me. I heard PARKER 17’s legs splashing as it followed me.  I stopped when water was at my hips. My hands were shaking as I cupped them together and filled them. I always wanted a happy ending, but that’s not how my family’s stories go.  I brought my hands to my lips.  PARKER 17’s leg tapped against mine.  “I’m sorry. For your loss.” it said. “But. This. Won’t. Make you. Feel better. I’ve. Led so many. Here.”  “I know,” I whispered. I didn’t want to feel better though. I understood now why some travelers never left the top of the mountain.  “Tell me,” PARKER 17 said, after a moment. “About. Your parents.”  “They were killed. Armed robbery,” I said. “I wasn’t there.”  “It wasn’t. Your fault.”  “I know.”  And I did know, but I didn’t really believe it. Just like I knew I probably wouldn’t have seen my parents’ ghosts swimming in the lake. But I hoped. I really hoped. I wanted to see them this one last time so I could apologize.  “They told stories,” I said. “I think most of them were made up. But there was a lot of truth too.”  “Ones with. Happy endings. I hope?”  “Never.” I stared at the water cupped in my hands. It showed me nothing except my own distorted reflection. Me, full of stories. “But I think that was the point.”  It was then I realized why my parents told me so many stories about the impossible ocean.  I opened my fingers and let the water in my hands drain out.  “Really?” PARKER 17 asked, surprised.  I turned and smiled at it. “I think I found the story I want to become.”  I turned and headed toward the shore. A moment later, I heard the bot splashing behind me.  If you must know. If you must have one more story to add to your collection about the impossible ocean, about the cursed path, then here’s mine.  One time, a reluctant traveler took the cursed path to the impossible ocean because they didn’t know there was another road. They had grown up on a steady diet of family stories that always had tragic endings. And now those stories were inside their head, their gut, their bones.  So, they climbed the cursed path, made it to the top of the mountain, held the water in their hands. It was only there that the reluctant traveler realized what they’d been missing.  Their family’s stories were part of them, but that didn’t mean it was a story they had to become. A.T. Greenblatt is a mechanical engineer by day and a writer by night. She lives in Philadelphia where she's known to frequently subject her friends to various cooking and home brewing experiments. She is a graduate of Viable Paradise XVI and Clarion West 2017. Her work has won a Nebula Award, has been in multiple Year's Best anthologies, and has appeared in Uncanny, Beneath Ceaseless Skies, and Clarkesworld, as well as other fine publications. You can find her on Twitter at @AtGreenblatt", "text": "5800 words, short story\nOne Time, a Reluctant Traveler\nIf you must know, I left because if I stayed in Nat’s house one night longer, I was going to unravel, like a tragic traveler in one of my family’s tales. And that was a story I didn’t want to be.\nMy bike was already packed. Had been for a few weeks. It was waiting for me on the trail like an old faithful steed. Soft mulch shifted under my boots as I made my way toward it, a pack on my back, a helmet under one arm, and two jars of ashes under the other. The forest was hushed. Silent except for the chittering of squirrels and bot birds. It smelled like compost and impending rain. My parents always told me rain was lucky.\nExcept, I’d grown skeptical of the things my parents said. Especially their stories.\nI wondered if they’d think the rain was lucky if they had to ride thirty kilometers in it, when everything gets shiny and slick and dangerous even at modest speeds. I glanced up, trying to assess the clouds between the gaps in the forest canopy. A big, swollen raindrop landed smack in the center of my forehead.\nJust my luck.\nScrew this. I’ll leave tomorrow. I thought and turned to go back to the house. I’d always been a reluctant traveler.\nThrough a cracked window, I could see Nat, her hair still sleep-mussed, her cybernetic hands pressed against the window, her breath fogging up the pane, like a little kid.\nIt made me smile. I had fixed those hands for her.\nThen she slapped a note to the window and my smile faded. It read: Go! Go! Go!\nShe was right, of course she was. I’d promised I would find the ocean at the top of the mountain. and it haunted me.\nSo, I left because if I stayed one more night, I’d see the ghost of my mom again. She’d look around Nat’s sparse house, at my nest of blankets on the floor, and she wouldn’t say anything. Didn’t need to. Her sadness and disappointment would be so clear.\nI was ninety-five percent sure my ghost mom was my imagination. My subconscious telling me to go, go, go too. But that five percent made me wonder.\nReluctantly, I tucked the jars of my parents’ ashes in the panniers on the bike. They clinked against the six other jars of ashes already packed in the side bags. I slid on my helmet and took one last long look at Nat in the window.\nShe gave me a warm smile. Though it was full of sadness too.\nSo, I left because a few weeks ago, my hometown got hit by a mudslide and my parents’ house almost collapsed on me. And I realized as I fled, that if I died, I wouldn’t leave any stories behind.\nAs I started pedaling, it began to rain.\nMy parents used to tell endless stories about the impossible ocean on top of the mountain and the travelers who took the path. But if there was one thing the stories taught me, it was this. Always this.\nNo one who took this journey ended up happy.\nOne time, a coughing sickness killed her family, and the widow packed her bags for the cursed path. She knew the stories; she’d listened carefully to every whispered version for years. They said there was an ocean at the end of the trail where, if you wanted to survive in this terrible world, you needed to bring your loved ones’ ashes and drink its bitter water. The ocean was magic. It was haunted. It was impossible. It would only make her feel worse.\nThe widow didn’t care. At dawn, she left her gray, deadbeat town for the cursed path. In her pack there were eight jars of ashes, one for each of her two husbands, five children, and one loyal dog.\nThe cursed path wasn’t long, but the going was slow and treacherous. There were many dangers even among the leafless trees, thin and stark as skeletons.\nYou think you’ll make it, solitary woman? the trees whispered.\nThe widow bristled, but ignored them, knowing the stories. The trees just wanted to keep her for themselves. She kept going.\nWe’re sorry. We’re lonely. We need a friend. Please. Stay, stay, stay, they whispered to her back as she walked. They sounded sincere.\nBut she knew how to tune out demanding voices. She once was a mother to a large family.\nSo she passed through that whispering forest, never even considering their offer. Because what would be the point of her journey, her memories, her grief, her fight to survive if she stopped now?\nThis was my mom’s favorite story. She had me later in life. I was my parents’ only kid and she rarely talked about her past, no matter how much I questioned and begged. She told stories instead.\nSometimes, I thought if someone were to cut me open, it wouldn’t be entrails that spilled out, but stories. Hundreds of family tales and movies. I loved old movies. Especially ones with happy endings.\nIt’s thirty km to the ocean on the mountain, said the note Nat left on the bathroom mirror. She preferred to communicate via notes, which thrilled me. There’s something slow and deliberate and loving in having a conversation on snatches of paper. It was easier trying to communicate via anecdotes.\nThirty kilometers, I thought. I can do that in a day. It was a two-hundred-kilometer ride from my decimated hometown to Nat’s house using a ruined state highway that was mostly potholes and splintered tarmac. It took me four days to get there. So, I thought, How bad could thirty klicks be?\nVery bad, I realized an hour into my journey. The trail’s incline rose steadily and the trees began to thin out, but the rain stayed consistent, insistent, making the path a slurry of mud. The path eroded the farther I went.\nI kept going because I didn’t want to go back and disappoint my mom’s ghost. Or Nat. Nat, who let me stay at her house for weeks, even though we’d only hung out at the farm/exchange market in my town’s overgrown community park. Where I’d barter things I’d salvaged from the abandoned mall like shirts, shoes, once, a bottle of strawberry vodka I found stashed behind a register, in exchange for some of her peaches or raspberry jam. Nat, who handed me a note that said Come by my house, if you go to the ocean. Which was how I knew, she was full of stories too.\nEventually, it was easier to dismount and walk aside my bike. The path was all mud and treacherous footing and stank of rot. But at least the trees didn’t whisper. They were all cut down. I was in a forest of stumps that seemed more like a graveyard or a silhouette of something beautiful and lost.\nI kept going. A fog was rising and every creak of my bicycle or crunch of my boot sounded unnaturally loud.\nMaybe that’s why I heard the voices.\nIt took a moment to realize it wasn’t the stumps of trees talking. That’s how entrenched the widow’s story is in me. No, it wasn’t the trees. There was someone there in the thickening mist. Or rather, judging from the pitch of voices, several someones. The low, steady hum behind the voices told me these someones had drones overhead.\nI held perfectly still. Waiting, calculating. They were hunting something. I knew this because everyone these days was hunting or scavenging or scrounging something in this graveyard of civilization. I hoped it was just deer, but I heard stories of worse. There’s always a worse story.\nI shifted my weight slightly and my bike creaked. The voices in the mist halted. I couldn’t see them, but I could imagine, and I imagined the people they belonged to peering through the fog toward me. Waiting, calculating.\n“Hello?” one said.\n“Hi,” I answered in a voice just above a whisper.\nA shot rang out.\nI dove to the ground. My bike fell on me, jars rattling. Suddenly, all the worst stories were ringing in my ears. People are crazy territorial these days. Woods are a breeding ground for cults. Some people will eat anything they find. I didn’t know where the shot came from or how close it’d been to me. But I didn’t care. It was too close. Too close. I was alive, unharmed, but too close, and the voices and drones were getting closer. Louder.\nI didn’t think. My hands were shaking, full of reeking mud. But I didn’t think. I unbuckled my helmet and hurled it as hard as I could downhill, away from the direction I was headed. It was a prayer. And a plea. It was all I had. The helmet bounced and crashed against the stumps once, twice, three times. Then it went silent.\nFor a moment, the voices and the drones went silent too.\nSomewhere in the mist, a voice swore and boots crunched as they turned. (Too close.) The drones whined as they changed directions. The hunters began to move away.\nI lay there in the mud, for a minute, maybe two, barely breathing. Listening and hoping and pleading that I’d get to tell this story one day, however it ends. The hunters’ voices were getting softer. So, as quickly and silently as I could, I got on my bike again and began to pedal. I had to keep going. I’ve never pedaled uphill so hard. My bike groaned and my heartbeat pounded in my ears. My tire rolled over something squishy, and the stink of rot overwhelmed me. But I didn’t stop to look. I didn’t stop. I could hear the voices swearing again in the distance. The fog was thick, but not thick enough. Not enough.\nI had to keep going. So, I bent forward and rode.\nI rode so hard, so blindly, I didn’t realize when I’d left the stumps behind.\nAnd crashed into something worse.\nOne time, someone who’d lost something he loved found himself on the cursed path, despite promising himself he would never go to the ocean on top of the mountain. From stories, he knew there were many dangers on this road, but the one that worried him most was the stork. He needed to befriend it so it could guide him through the last and most dangerous part of the path. Making friends was never the lost lover’s strong point.\nBut the stork wasn’t what he expected. The great bird was mud-drenched and depressed, with wings so matted, it could no longer fly. Its legs were caked in dirt, thick enough to glue it to the rocky ledge it perched on.\n“Splendid. Another grief-stricken person who wants my help,” said the stork. “Turn back. Believe me, you won’t find what you’re looking for.”\n“How do you know that?” the lover said.\n“Everyone who comes this way has lost someone. They don’t want to die the same way and want me to help them,” said the stork, miserably. “Am I wrong?”\nThe lost lover didn’t answer.\nThe stork sighed. “You can’t stay here. Go home or keep walking. Else, you’ll get stuck like me.”\nThe lover looked down. He was, in fact, sinking into the mud. He wrenched his feet free. “I think I can help you,” he said.\n“How? My wings are too muddy to fly. Others have tried.”\n“Not your wings.”\nFrom his pack, the lost lover pulled out a small spade. He began digging methodically around where the bird was trapped, and then used his fingers to gently pry the caked earth from its legs.\n“You’re very patient,” the stork observed.\n“I’m a farmer,” he said. “I’m used to pulling things out of the mud.”\nThe stork laughed at this, and the lover smiled.\nWhen it was finally free, the stork danced in place, shook out its great, dirty wings, and sighed. “I can’t fly, but I will show you the way.” it said.\n“That’s good enough for me,” the lost lover said. In his pack, he carried a jar of ashes of the person he loved most in this world.\n“It won’t bring you any happiness,” the stork said. “The water won’t save you.”\n“I know,” the lost lover replied. “Let’s go anyway.”\nI should have said goodbye to my bike, like heroes in adventure movies do when their animal companions are gravely wounded. When I hit that rock in the mud and went tumbling ass-over-head, that should have been a sign of what the path forward would look like. Except, I didn’t want to be that story either.\nSo I carried my steadfast steed over my shoulders, even as the mud swallowed my ankles with every footstep. Refusing to lose yet another thing. Now that I stopped fleeing, I grieved the loss of my helmet. I’d been so happy when I’d found it in a forgotten shipping warehouse when I was sixteen. It made me feel civilized and it made my parents feel like I had a talisman of safety in this dangerous world.\nBut I was alive and that was something. Around me there were prickly bushes and plenty of rocks and everywhere smelled like damp earth and sulfur, but thankfully, nothing rotten. The mud was murderous though. The trail was steep and the panniers with the jars of ashes rattled as I trudged forward. Miraculously, none of them were broken, but they clinked together threateningly with each step.\nOf the many low points in this journey, this was one of the worst. Because it felt like I would drown going uphill to an ocean on top of a mountain that I didn’t want to see. I promised my parents that I would take their ashes to the summit. I promised Nat that I’d take her six jars up too. I promised I would drink the water and survive. And I wanted to survive. Even if the water was just a talisman.\nI wish there was another way, I thought as I took another step and sank through the mud down to my calf. But this was the only path I knew.\nScrew this, I thought.\nI dragged myself over a cluster of rocks, rising out of the mud like the tip of an iceberg. Took stock of my scrapes and bruises from my fall and of the bent rim of the front tire. It was nothing that I couldn’t heal from, nothing I couldn’t fix. But still, it hurt.\nThe path ahead snaked upward forever.\nI rubbed my muddy face with my muddy hands, struggling to swallow down the despair caught in my throat. I’d never felt so alone.\nQuickly, before depression dragged me down, I pulled out my repair kit from one of the panniers and began to work on straightening the front wheel of my bike. Fixing something always made me feel better. I didn’t think so much when I was fixing.\nThat was how I heard it. The small, sad whine behind me. The sound of a motor fighting for life.\nI put down my tools and scrambled over the rocks, trying to find where the noise was coming from, slipping once. Only by luck did I spot the aluminum leg peeking out from the bog, flexing helplessly.\nThe muddy water rose past my knees as I wrangled and pried the bot free from its mucky prison. It took me a few minutes, then a few minutes more to carry it back to my bike. The bot was small, but heavy, and the terrain wasn’t forgiving. Its gyroscopic head whirled laboriously in my arms.\nI cleaned the grime from the solar panels on its back with an old shirt from my pack, but the sky was still cloudy and gray, so I hooked up my external power cell to give it a boost. And I waited.\n“Damn it,” it said, when it finally had enough juice to power on.\nI laughed and rubbed my face. I couldn’t have agreed more.\n“Hi,” I said. “What’s your function?”\n“I am. Was. Am. A park ranger,” it said. “This was. Is. A national park.” It went silent for a moment, the LED in its torso turning yellow for self-diagnosis. “Crap. Natural language processor. Is. Borked.”\nI didn’t care if the bot was partly disabled, I was so relieved to have found someone. “Can you take me to the end of this trail?”\n“Bad idea,” it said. It stretched out each of its six spidery legs one by one, testing the joints, giving a hum of frustration when one got stuck. Five of the six got stuck.\n“I know,” I said.\n“So. Why are. You here?”\n“May I?” I pointed to one of its jammed legs and it beeped its consent. The joint was out of alignment. I fished out my screwdriver from my bag. “I promised my parents I would.”\n“That’s a stupid. Reason. To follow.” it said.\n“I know,” I said.\n“Why then?”\nBecause this is the only path I know, I thought.\n“Why were you on a muddy path out in the rain?” I tightened the screw and articulated the joint.\n“My job.” it replied. “Is to guide. Visitors. Safely up the mountain. If asked.” In a slow, stuttering motion, it moved its head to look right at me. “They asked.”\nSomething about its inflection explained that the askers didn’t come back down. Something about its direct gaze begged me not to do the same.\nI didn’t say anything, focusing on the next leg instead.\n“You think. If you fix. Me.” it said after a few minutes. “I’ll take you. Where. You want. To go?”\n“No,” I said, frowning at the third leg. It was bent, but no worse than the rim of my bike. “I’m doing this because it’s the right thing to do. And because I like fixing things.” I carefully bent the leg back to mostly straight\nThe ranger bot didn’t say much after that. It whirled its creaky head and searched for signals and updates, giving a frustrated beep when it didn’t find any.\n“That’s it,” I said after I fixed its last leg and realigned the motor in its neck.\n“Thank you,” it said, sounding genuinely grateful, LED turning green. “But I can’t. Take you. Up there.”\nDisappointment slumped my shoulders. I hadn’t quite realized how badly I didn’t want to be alone on the path. But like the lost lover, I didn’t have much practice making friends, and I wasn’t going to force the ranger bot to come with me. “Okay. Any advice?” I asked.\n“Yeah,” it said. “Don’t go.”\nI slung my bike over my shoulders and tried to tamp down my fear. “Stay safe,” I said and began trudging forward. One muddy footstep at a time\n“Wait,” it said, after a moment, after an eternity. “There’s another. Path.”\nOne time, a survivor took the cursed path to the impossible ocean. She never made it there. She got lost.\nHalfway up the mountain, the path began twisting and splintered into trails that all looked the same. There were no road signs or clues. So, she chose a fork at random.\nShe chose wrong.\nIt was only by sheer luck that she picked a path that spat her out at the edge of the forest, not far from her home.\nWhen she realized where she was, she breathed a sigh of relief. Because she knew the stories of travelers that didn’t return from the cursed path. There were too many to count.\nThe survivor was wise enough to know when she should count herself lucky and tap out.\nExcept, when she returned home and put the jars of her friends’ ashes on the mantle, six in all, she felt a cut of guilt. She thought about trying the path again, but surviving had taken a toll on her body and she knew, if she tried again, she wouldn’t make it to the impossible ocean.\nStill, every time she looked at those jars, she felt fresh cuts.\nAnd no matter how many times she glanced at the mantle or counted herself lucky, their sting never dulled.\nThe ranger bot, or PARKER 17, as it preferred to be called, took me back down the mountain.\nWe retraced my tracks, slowly because riding downhill in the mud was treacherous even in the best of times. The farther we went, the more my chest constricted. There was something heartbreaking about going back down a path I had fought so hard to climb.\nThis is not a regression, I thought as the forest of stumps came back into view. The fog from earlier was only a thin mist now and it was easier to see. And to be seen.\n“It’s not safe here,” I whispered to PARKER 17. The memory of gunshots still echoed in my ears.\n“No,” it agreed, panning its head back and forth, scanning. “But no other. Drones or GPS trackers. Are in. A ten kilometer. Radius.” Its head whirled to face me. “We’re safe. For now.”\n“We’re exposed,” I said.\n“Not for long.” The bot began to trot away and I had to hurry to catch up. For a long time, there was nothing except the sound of animals in the brush between us, both the natural ones and the man-made replicates that were supposed to alleviate some of the environmental damage.\nFor a long time, we traveled in silence. Something loomed in the distance. At first, I could only make out the outline, the lingering remains of the fog obscured the details. At first, it looked like another ridge of rocks.\nThen, just like in a movie, everything came into focus. My breath caught in my throat.\nIt was a mountain range of old and forgotten things, discarded things from a time when everything was cheap. Except, there were small but very alive evergreens growing from out of the heaps. It was clearly man-made, and it was beautiful. One of the few beautiful man-made things I’d ever seen. I wish I had my mom’s gift for words to paint a better picture of it.\n“Ta-da,” PARKER 17 said.\nThat wasn’t what made me smile. Between the mounds of trash and tiny trees there was a paved path. Perfectly smooth tarmac. It had been years since I’d seen pristine pavement.\n“One problem,” the bot said. “My GPS. It’s shot. In there.”\n“Can you use this?” I pulled out the trail map Nat gave me from my pack. PARKER 17 peeked over my shoulder at it. “Where. Did you. Get this?”\n“From Nat, my friend,” I said. “She’s a trader who lives at the edge of the park.”\n“What did you. Need to. Trade. For this?”\n“Not much,” I said. “I fixed her hands and a half dozen other things in her house.” I didn’t mention how she accepted me after I fled my hometown following the mudslide. Put up with me for weeks until my reluctant self worked up enough courage to leave. Or how, in exchange, I took the six jars on her windowsill after I found a note that said: These belong by the ocean too.\nI smoothed out the map again, refusing to meet the ranger bot’s eyes. “Can you work with this?”\n“Yes,” it replied. But it didn’t sound confident. Its LED was yellow.\nI didn’t care. I clung to hope where I found it.\nI patted the space between my handlebars. “Hop up. I’ll move fast on the pavement.”\nPARKER 17 hesitated. Then slowly, carefully, it approached the bike, reached up, and wrapped four of its six legs around the frame.\n“I’ll ride, you navigate. Okay?” I said.\n“Okay,” it whispered.\nIt was strange to have someone ride on my handlebars. It was something people did all the time in movies, but I’d never done myself. For a few moments, it was like I was part of one of those stories, with sunshine and a happy ending.\nThe trail began to climb upward again, and the anxious knot in my stomach started uncurling. I was going the right way again. Snaking and threading between the huge mounds of trash, I spotted glimmers of rusty cookware and broken furniture and new plants.\n“What is this place?” I shouted into the wind.\n“Art installation.”\nWe passed hundreds of mounds. My dad would have loved this, I thought as I peddled and weaved. He was always adding decorations to our old barn. In another life, he would have probably been a set designer.\nWhen the trail split, PARKER 17 announced a direction, and I followed. Speeding on the smooth tarmac, it felt like flying.\nBut then, we hit a dead end. My stomach flipped. Flipped again.\n“Damn,” the bot said. “This un-updated map. Go back. A few turns.”\nI did, and dutifully followed the bot’s revised instructions. We seemed to be making progress up the mountain. Until we hit another dead end.\n“Damn it,” PARKER 17 whispered.\nWe tried dozens of combinations, tracing and retracing our journey. But the mounds were identical, or identical enough, and the beautiful paved path never led anywhere at all.\nThe last route we tried was something I picked based on the incline and growth of the trees, which got stubbier and squatter the higher we climbed.\nFor a moment, it seemed like a good plan. I dared to hope, despite my aching quads and calves. That is, until we dead-ended at the biggest, most impassible hill of trash I’d seen yet.\n“What do we do?” I asked, rubbing my hands through my sweat-soaked hair. I could feel them shaking through my scalp.\nPARKER 17 wasn’t listening. “I can never,” it whispered. “Save them.”\nThat was when panic threatened to swallow me. There are hundreds of unfinished stories of travelers who took the cursed path and never made it home. It was a story I swore I would never become.\nI dismounted and sat on an old coffee table sticking out from one of the trash heaps. I desperately wanted to fix something. I looked down and saw my shaking hands and decided to fix myself. I pulled out the sandwich from my pack that Nat gave me that morning. Made myself chew the homemade bread and eggs and greens. Made myself hydrate. Made myself breathe.\n“Any ideas?” I asked.\nPARKER 17 didn’t respond. It was muttering to itself miserably, kicking loose detritus around with its legs.\nSo, I heaved myself up and began studying the mounds. Up close it was a strange art installation. I’d always wanted to be an artist, but surviving these days takes time. I wasn’t like my parents. The way my dad could craft things, or my mom could spin stories. Sometimes I wondered what I could have become if I wasn’t living in the dregs of civilization. A movie director, maybe. Instead, I became good at scavenging.\nWhich is probably how I spotted the hair-width trail snaking between two mounds.\n“Wait, what’s that?” I said.\nPARKER 17 followed where my finger pointed. It inched up the ghost of a path to get a better look. It didn’t say anything for a long minute.\nThen, the LED in its torso flashed green.\nOne time, the widow finally, finally arrived at the impossible ocean on the top of the mountain.\nHer shoes were wrecked and every joint in her body ached.\nBut she made it.\nShe waded into the ocean and took a long drink. The water was brackish, but not as bitter as the stories made it out to be. She drank deeply.\nThen, she pulled out the eight jars of ashes from her bag and emptied them in the water. Watched as the ashes mingled and floated away.\nShe waited. Except, nothing happened.\nShe began to turn away, disappointment heavy in her chest, when she saw them. Her loved ones. Shimmering between the ripples of the lake. Smiling at her and waving and laughing soundlessly. She shouted out, began splashing toward them, but her loved ones kept swimming away from the shore, from her. Until they were only memories on the horizon.\nOnce again, the widow was the only one in her family left. With nothing except grief for company.\nFor a moment, she wondered if she should let that grief drown her.\nBut no. She’d drank from the water and delivered the dead. She’d survived the journey up the mountain. She’d survive the trip back down.\nSo, she did. She returned to her deadbeat town and met a lonely farmer. Together they made a new home and a new family.\nThe widow survived and that was something. But she drank the water and it haunted her. She carried the weight of the ocean within her for the rest of her days.\nThe path between the trash mounds went up and up the mountain. It stretched on forever. Until it didn’t.\nWhen I reached the impossible ocean, it took me a few seconds to understand what I was seeing. I didn’t realize how high I’d climbed. None of my family’s stories explained that the mountain towered over the ones around it, so that standing here at the apex, there was only sky.\nBut I am slow and I am reluctant and that wasn’t what I saw first. On the top of the mountain was a lake, so smooth and clear it looked like it was part of the sky. Or rather, the sky was a part of it.\nFrom where I stood it looked like the water stretched out forever. Like an ocean.\n“Daaaamn,” PARKER 17 said. “Still beautiful.”\n“You come here often?” I asked, my voice choked with awe.\n“It’s. Been a while,” it admitted.\nWe made our way to the water’s edge, carefully, like we were afraid to make too much noise. The summit was littered with empty packs and collapsed tents and lumps under moldy blankets that looked suspiciously like bodies. But for once, my scavenger instincts didn’t prick with interest. Because crowded against the shoreline were hundreds of jars, glimmering like candles in the evening light. I crept close and saw many of the jars carried names on them. So many names.\nThe jars were still full of ashes.\nThis was where I started wondering if my family’s stories were not completely honest. And because I’m painfully slow, this was where I finally, finally realized who the characters in my family’s stories were.\nSuddenly, I understood that if I studied all the jars on the shoreline, I’d find one with my dad’s looping, neat handwriting and eight with my mother’s slanted, messy one.\n“I’m an idiot,” I said.\n“No,” PARKER 17 replied. “Just stubborn.”\nFrom the panniers, I pulled out Nat’s jars, first, saying the names written on the caps as I did. Fredrick. Ravi. Esty. Johanna. Kai. Stu. I had no idea who they were in life, but I wished them peace.\nAnd then my parents.\n“The widow. The lost lover,” I whispered as I nestled their ashes among the jars full of other stories.\nI’d grown suspicious of my parents’ stories, but I still stood there by the lake, among the dead, and hoped to see their ghosts swimming in the water.\nI waited. And waited.\nI saw nothing.\nThat was when the weight of being the only one left alive threatened to swallow me. Suddenly, I understood why there were days my mom couldn’t get out of bed. Why there were days my dad was up and going through the motions, but not really there. Not really functioning.\nAnd I. I finally understood why I was on this path. It was the fear of watching the world die around you and suddenly, desperately wanting a drink from an impossible ocean that would tell you that you weren’t alone, that you would survive. No matter the cost.\nI slid off my boots and inched through the jars and jars and jars, and into the impossible ocean that was really just a lake with a clever optical illusion. The water was cold enough to make me gasp, but not cold enough to stop me. I heard PARKER 17’s legs splashing as it followed me.\nI stopped when water was at my hips. My hands were shaking as I cupped them together and filled them. I always wanted a happy ending, but that’s not how my family’s stories go.\nI brought my hands to my lips.\nPARKER 17’s leg tapped against mine.\n“I’m sorry. For your loss.” it said. “But. This. Won’t. Make you. Feel better. I’ve. Led so many. Here.”\n“I know,” I whispered. I didn’t want to feel better though. I understood now why some travelers never left the top of the mountain.\n“Tell me,” PARKER 17 said, after a moment. “About. Your parents.”\n“They were killed. Armed robbery,” I said. “I wasn’t there.”\n“It wasn’t. Your fault.”\n“I know.”\nAnd I did know, but I didn’t really believe it. Just like I knew I probably wouldn’t have seen my parents’ ghosts swimming in the lake. But I hoped. I really hoped. I wanted to see them this one last time so I could apologize.\n“They told stories,” I said. “I think most of them were made up. But there was a lot of truth too.”\n“Ones with. Happy endings. I hope?”\n“Never.” I stared at the water cupped in my hands. It showed me nothing except my own distorted reflection. Me, full of stories. “But I think that was the point.”\nIt was then I realized why my parents told me so many stories about the impossible ocean.\nI opened my fingers and let the water in my hands drain out.\n“Really?” PARKER 17 asked, surprised.\nI turned and smiled at it. “I think I found the story I want to become.”\nI turned and headed toward the shore. A moment later, I heard the bot splashing behind me.\nIf you must know. If you must have one more story to add to your collection about the impossible ocean, about the cursed path, then here’s mine.\nOne time, a reluctant traveler took the cursed path to the impossible ocean because they didn’t know there was another road. They had grown up on a steady diet of family stories that always had tragic endings. And now those stories were inside their head, their gut, their bones.\nSo, they climbed the cursed path, made it to the top of the mountain, held the water in their hands. It was only there that the reluctant traveler realized what they’d been missing.\nTheir family’s stories were part of them, but that didn’t mean it was a story they had to become.\nA.T. Greenblatt is a mechanical engineer by day and a writer by night. She lives in Philadelphia where she's known to frequently subject her friends to various cooking and home brewing experiments. She is a graduate of Viable Paradise XVI and Clarion West 2017. Her work has won a Nebula Award, has been in multiple Year's Best anthologies, and has appeared in Uncanny, Beneath Ceaseless Skies, and Clarkesworld, as well as other fine publications. You can find her on Twitter at @AtGreenblatt", "source": "https://clarkesworldmagazine.com/greenblatt_07_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: One Time, a Reluctant Traveler by A. T. Greenblatt"}