{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "By7IohR+Yb/UNSqOji0O8xisrSc=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Classics, Companionship, and a Creature: A Conversation with John Kessel  Classics are classics for a reason. Whether they’re the first of their kind or they redefine a genre, they’ve earned their place in the common consciousness as paragons of literature. They’ve been dissected, analyzed, and pored over for years by curious minds itching to find something undiscovered within their texts. But it’s rare to find an author daring enough to wrestle and remix a pair of classics.  John Kessel did just this with his novelette “Pride and Prometheus” which won a Nebula Award and the Shirley Jackson Award. Now, he’s expanded that novelette into a complete novel, further illuminating what happens when Jane Austen’s Bennet family encounter Mary Shelly’s Doctor Frankenstein. Pride and Prometheus not only amalgamates two works of classic literature, but by doing so with respect to the source material, casts fresh eyes on the original works. When Doctor Frankenstein leaves Switzerland bound for Scotland to create a wife for the Creature, he happens upon Mary Bennet. From there, their lives become intertwined with each other and that of Frankenstein’s creation.  John Kessel is the author and editor of numerous books and stories. He has won the Nebula, Shirley Jackson, Theodore Sturgeon, and James Tiptree Jr. Awards. His newest novel Pride and Prometheus is available from Saga Press on February 13th.   What made you choose Pride and Prejudice to mash together with Frankenstein? Did you find thematic parallels?  It started when I was thinking about how these two books came out within a couple of years of one another, yet could not seem more different. Austen and Shelley are on the surface very different writers. Austen’s work is the precursor to the novel of manners, stories of domestic realism with satirical elements, writers like Henry James and Virginia Woolf. Frankenstein is a gothic about science; Brian Aldiss called it the first science fiction novel. It has huge influence in science fiction, horror, and fantasy.  Then I noticed that, in Frankenstein, Victor and his friend Henry pass through the town of Matlock in England on their way to Scotland, where Victor intends to create a bride for his monster, who is blackmailing him by threatening to kill anyone Victor loves if he does not create a companion for him. And in Pride and Prejudice, Darcy’s estate, Pemberley, is near Matlock. So, I thought it might be possible, with a little finagling, for Victor to meet some of the characters from Pride and Prejudice.  Thematically, I thought about how Austen’s novels are all about how difficult it is to find the proper mate, and in Frankenstein the Creature has his own troubles finding his romantic match. Once I fixed on the character of Mary Bennet, the awkward, sententious middle Bennet sister as my heroine, the story grew in unexpected directions. By putting an Austen character into a gothic novel, I can comment on both the novel of manners and the gothic (and by implication, science fiction). As a science fiction writer who has studied canonical literature his entire life, this struck right at the heart of many contradictory feelings I’ve had about the relationship of genre fiction to literary fiction.  Besides Jane Austen and Mary Shelley, who was one writer that also influenced this story? Pride and Prometheus first saw the light of day as a novelette. What were some of the challenges of expanding that into this book?  I think that Karen Joy Fowler was in the back of my mind as I wrote this, for the way in The Jane Austen Book Club she played games with Austen’s situations and characters, but fundamentally respected Austen and tried to do her justice. I was not interested in writing a parody. I suppose another book that was in my mind as I expanded the novelette into a novel was Pride and Prejudice and Zombies—which came out after I had already written my novelette 2007. That was sort of an anti-influence; I do not think that book engages seriously with what Austen is about or with her characters. I did not want Pride and Prometheus to simply be a stunt. I wanted it to treat both Austen and Shelley with respect.  Karen suggested back in 2008 that I expand the story into a novel, but at that time I did not think I had a novel’s worth of story in me. But years later I came to think about it more, and I realized that my novelette version was really the middle of a much longer story. So, the novel begins earlier than the novelette, and goes past the end of that story. It also gives not just Mary Bennet’s viewpoint, but the viewpoints of Victor Frankenstein and his Creature. That produced some lovely plot developments, dramatic ironies, places where the characters deceive each other, and give different visions of the same action. I find that stuff fascinating.  Once I got into it I was carried along by the situations, and also by the fact that I did not want my story to depart from the plot of Frankenstein, but to fit within the spaces of Shelley’s narrative where things happen that she did not tell us about. It’s sort of a secret history of Frankenstein, a “story behind the story.”  Frankenstein is known as one of the classic horror novels, but while reading Pride and Prometheus, I was touched by some of the horrific elements in the Bennet sister’s lives. Do you think regency novels of the period also have their own kind of societal/psychological horror about them?  I love the humor in Jane Austen’s novels, but yes, there is a deadly serious deconstruction of British manners and morals going on in her best work. The way in which so much of a person’s fate is tied to marrying the right person—this was the most important choice of a woman’s life, if she even got any choice in the matter. And the problems that arise when people of different temperaments somehow decide they need to be together. And the sex that is not on the surface but that boils just below. There’s a horror of limited choices and restricted freedom in a society that sometimes seems like a brutal machine. I don’t know if Kafka ever read Jane Austen, but I could see him enjoying her work.  Pride and Prometheus is written from multiple perspectives. Which character was the most challenging to write and which character came most naturally?  I loved writing all of the characters, getting deeply into who they are, trying to make them consistent with Austen’s and Shelley’s characters, but also having to develop them in ways that neither of those authors would. I’d say that Victor was the hardest for me to write because I do not sympathize with him as much as I do with Mary and the Creature. So, I had to work to give him his due, to understand his motives for doing things that I would rather he not have done. I’m not crazy about his life choices.  Mary was hard. Because she is the main character, I needed to make her plausibly the same character as the Mary in Pride and Prejudice, but evolved to something more three dimensional, mature, and sympathetic than Austen presents in her Mary. There’s not a lot about Mary in Pride and Prejudice, but what we see is not attractive. Austen’s Mary is clueless and insufferable. And pitiable. And the butt of jokes. She’s so wrapped up in her music and moralizing that she cannot see other people clearly, yet she prides herself on the wisdom that she’s copied down from books of sermons. And she’s a music geek who doesn’t realize she is not a good performer. I could relate to Mary, since the teenaged John Kessel was similarly clueless—not that I can claim any great wisdom now! She could easily have been a science fiction fan if science fiction were around. Instead, in the thirteen years between the end of Pride and Prejudice and the start of my novel, I have her develop an interest in fossils and natural philosophy. But she’s still just as bookish a woman as she was a girl. I suppose some readers who know Austen may take issue with my presentation of Mary, but I tried to make her as believable as I could. I really admire my Mary, though I think she is still pretty clueless in fundamental ways. But that very cluelessness I wanted to turn into something of a virtue.  The Creature was very interesting to write. He’s the ultimate outsider, feared and rejected by any who see him. His very strangeness was something I tried hard to understand. In my version, he is not stitched together from old corpses. He’s not ugly: if he were a statue you might even call him handsome. The problem is he’s not a statue, he’s alive. He looks human, but not convincingly enough—it’s the uncanny valley problem. His every motion is deeply disturbing to anybody who sees him; he’s fundamentally monstrous even when—maybe especially when—he is doing very ordinary things. There’s something horrifyingly wrong about him.  I had fun trying to figure out how he managed to follow Victor from Geneva, Switzerland all the way to England and Scotland without any resources or assistance while also looking like a monster.  And his deep loneliness, his alienation from human beings, is tragic and fascinating. It was interesting to try to see the world through his eyes. He doesn’t understand a lot of things. He’s only three years old.  If you were a character from either Pride and Prejudice or Frankenstein, who would you be?  Realistically, if I were in either book, I would probably be Victor’s father, trying to figure out my troubled son and get him to have the decent, happy life that he ought to have. But as I said above, I can identify with all three main characters. Mary is probably the most like me, though I have—haven’t we all?—felt like the Creature sometimes.  As an editor, what do you find are some of the challenges unique to putting together an anthology or collection? Having collaborated extensively with James Patrick Kelly, can you shed some light on the way you two work together when crafting an anthology?  There are a lot of moving parts to creating a good themed anthology. You have certain practical limitations: how large is your budget for buying stories? How long can the book be? What to do if a story you want is not available, or if the rights holder wants more than you can pay? What about gender balance or diversity of the contributors?  Working with Jim is great. On the simplest level, with two editors there can be a division of labor. But I really like the give-and-take of working with him. He is very smart and well-read and has lots of ideas and enthusiasms, likes and dislikes. So do I. We do not always agree. Usually we have a theme for the book and a rough sense of what sorts of things ought to be in it. But with, for example, Feeling Very Strange: The Slipstream Anthology, we had to come to some understanding of what we thought might be included under the title “slipstream.” Each anthology we did is a sort of exploration, a question more than an answer. We have been told by some reviewers that we do not know what we are talking about. Quite likely.  Wrestling out the contents list and writing an introduction can be a very educational process. I’m not sure if we will be editing any other books soon, but I did enjoy working with him on that series of books for Jacob Wiseman and Tachyon.  You’ve also worked as a science fiction and fantasy critic. What role do you think a critic plays in the landscape of publishing?  I haven’t written much criticism for years, though I have lots of opinions. I’m more of a critic than a reviewer. Reviewers can have some effect on what gets published and what gets read, and that’s a big responsibility. Critics like me are more like football fans talking about the game once it is over and trying to figure out what happened and why it happened the way it did. For me, it’s a way to explaining why I like (or dislike) something. I prefer to talk about things I like and bring them to other people’s attention—a particular kind of story or story values.  What other projects do you have in the works?  I’m between long projects right now. I have been working off and on with a story, a kind of historical fantasy, about the assassination of William McKinley at the Pan American Exposition in Buffalo in 1901 by a Polish anarchist named Leon Czolgosz. I grew up in Buffalo, and my father was a Polish immigrant who came over as a child in 1913. They had a ride there at the exposition, “A Trip to the Moon” that was the first “Dark Ride” amusement ever done, the ancestor to all the rides at Universal City and Disney World. I have Leon visit the moon on the day that he is to shoot the president. But I still have a lot to work out, so it’s a long way from being done.  Since you’ve created the Sycamore Hill Writer’s Workshop and have also taught numerous writing and literature courses as a professor, what is the one piece of advice you like to give your students?  Well, I don’t know if this is appropriate for a family magazine, but the best piece of writing advice I have ever heard came to me from Gwenda Bond by way of Kelly Link: “Quit dicking around.” You’d think that would be a lot easier to do than it is. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nClassics, Companionship, and a Creature: A Conversation with John Kessel\nClassics are classics for a reason. Whether they’re the first of their kind or they redefine a genre, they’ve earned their place in the common consciousness as paragons of literature. They’ve been dissected, analyzed, and pored over for years by curious minds itching to find something undiscovered within their texts. But it’s rare to find an author daring enough to wrestle and remix a pair of classics.\nJohn Kessel did just this with his novelette “Pride and Prometheus” which won a Nebula Award and the Shirley Jackson Award. Now, he’s expanded that novelette into a complete novel, further illuminating what happens when Jane Austen’s Bennet family encounter Mary Shelly’s Doctor Frankenstein. Pride and Prometheus not only amalgamates two works of classic literature, but by doing so with respect to the source material, casts fresh eyes on the original works. When Doctor Frankenstein leaves Switzerland bound for Scotland to create a wife for the Creature, he happens upon Mary Bennet. From there, their lives become intertwined with each other and that of Frankenstein’s creation.\nJohn Kessel is the author and editor of numerous books and stories. He has won the Nebula, Shirley Jackson, Theodore Sturgeon, and James Tiptree Jr. Awards. His newest novel Pride and Prometheus is available from Saga Press on February 13th.\nWhat made you choose Pride and Prejudice to mash together with Frankenstein? Did you find thematic parallels?\nIt started when I was thinking about how these two books came out within a couple of years of one another, yet could not seem more different. Austen and Shelley are on the surface very different writers. Austen’s work is the precursor to the novel of manners, stories of domestic realism with satirical elements, writers like Henry James and Virginia Woolf. Frankenstein is a gothic about science; Brian Aldiss called it the first science fiction novel. It has huge influence in science fiction, horror, and fantasy.\nThen I noticed that, in Frankenstein, Victor and his friend Henry pass through the town of Matlock in England on their way to Scotland, where Victor intends to create a bride for his monster, who is blackmailing him by threatening to kill anyone Victor loves if he does not create a companion for him. And in Pride and Prejudice, Darcy’s estate, Pemberley, is near Matlock. So, I thought it might be possible, with a little finagling, for Victor to meet some of the characters from Pride and Prejudice.\nThematically, I thought about how Austen’s novels are all about how difficult it is to find the proper mate, and in Frankenstein the Creature has his own troubles finding his romantic match. Once I fixed on the character of Mary Bennet, the awkward, sententious middle Bennet sister as my heroine, the story grew in unexpected directions. By putting an Austen character into a gothic novel, I can comment on both the novel of manners and the gothic (and by implication, science fiction). As a science fiction writer who has studied canonical literature his entire life, this struck right at the heart of many contradictory feelings I’ve had about the relationship of genre fiction to literary fiction.\nBesides Jane Austen and Mary Shelley, who was one writer that also influenced this story? Pride and Prometheus first saw the light of day as a novelette. What were some of the challenges of expanding that into this book?\nI think that Karen Joy Fowler was in the back of my mind as I wrote this, for the way in The Jane Austen Book Club she played games with Austen’s situations and characters, but fundamentally respected Austen and tried to do her justice. I was not interested in writing a parody. I suppose another book that was in my mind as I expanded the novelette into a novel was Pride and Prejudice and Zombies—which came out after I had already written my novelette 2007. That was sort of an anti-influence; I do not think that book engages seriously with what Austen is about or with her characters. I did not want Pride and Prometheus to simply be a stunt. I wanted it to treat both Austen and Shelley with respect.\nKaren suggested back in 2008 that I expand the story into a novel, but at that time I did not think I had a novel’s worth of story in me. But years later I came to think about it more, and I realized that my novelette version was really the middle of a much longer story. So, the novel begins earlier than the novelette, and goes past the end of that story. It also gives not just Mary Bennet’s viewpoint, but the viewpoints of Victor Frankenstein and his Creature. That produced some lovely plot developments, dramatic ironies, places where the characters deceive each other, and give different visions of the same action. I find that stuff fascinating.\nOnce I got into it I was carried along by the situations, and also by the fact that I did not want my story to depart from the plot of Frankenstein, but to fit within the spaces of Shelley’s narrative where things happen that she did not tell us about. It’s sort of a secret history of Frankenstein, a “story behind the story.”\nFrankenstein is known as one of the classic horror novels, but while reading Pride and Prometheus, I was touched by some of the horrific elements in the Bennet sister’s lives. Do you think regency novels of the period also have their own kind of societal/psychological horror about them?\nI love the humor in Jane Austen’s novels, but yes, there is a deadly serious deconstruction of British manners and morals going on in her best work. The way in which so much of a person’s fate is tied to marrying the right person—this was the most important choice of a woman’s life, if she even got any choice in the matter. And the problems that arise when people of different temperaments somehow decide they need to be together. And the sex that is not on the surface but that boils just below. There’s a horror of limited choices and restricted freedom in a society that sometimes seems like a brutal machine. I don’t know if Kafka ever read Jane Austen, but I could see him enjoying her work.\nPride and Prometheus is written from multiple perspectives. Which character was the most challenging to write and which character came most naturally?\nI loved writing all of the characters, getting deeply into who they are, trying to make them consistent with Austen’s and Shelley’s characters, but also having to develop them in ways that neither of those authors would. I’d say that Victor was the hardest for me to write because I do not sympathize with him as much as I do with Mary and the Creature. So, I had to work to give him his due, to understand his motives for doing things that I would rather he not have done. I’m not crazy about his life choices.\nMary was hard. Because she is the main character, I needed to make her plausibly the same character as the Mary in Pride and Prejudice, but evolved to something more three dimensional, mature, and sympathetic than Austen presents in her Mary. There’s not a lot about Mary in Pride and Prejudice, but what we see is not attractive. Austen’s Mary is clueless and insufferable. And pitiable. And the butt of jokes. She’s so wrapped up in her music and moralizing that she cannot see other people clearly, yet she prides herself on the wisdom that she’s copied down from books of sermons. And she’s a music geek who doesn’t realize she is not a good performer. I could relate to Mary, since the teenaged John Kessel was similarly clueless—not that I can claim any great wisdom now! She could easily have been a science fiction fan if science fiction were around. Instead, in the thirteen years between the end of Pride and Prejudice and the start of my novel, I have her develop an interest in fossils and natural philosophy. But she’s still just as bookish a woman as she was a girl. I suppose some readers who know Austen may take issue with my presentation of Mary, but I tried to make her as believable as I could. I really admire my Mary, though I think she is still pretty clueless in fundamental ways. But that very cluelessness I wanted to turn into something of a virtue.\nThe Creature was very interesting to write. He’s the ultimate outsider, feared and rejected by any who see him. His very strangeness was something I tried hard to understand. In my version, he is not stitched together from old corpses. He’s not ugly: if he were a statue you might even call him handsome. The problem is he’s not a statue, he’s alive. He looks human, but not convincingly enough—it’s the uncanny valley problem. His every motion is deeply disturbing to anybody who sees him; he’s fundamentally monstrous even when—maybe especially when—he is doing very ordinary things. There’s something horrifyingly wrong about him.\nI had fun trying to figure out how he managed to follow Victor from Geneva, Switzerland all the way to England and Scotland without any resources or assistance while also looking like a monster.\nAnd his deep loneliness, his alienation from human beings, is tragic and fascinating. It was interesting to try to see the world through his eyes. He doesn’t understand a lot of things. He’s only three years old.\nIf you were a character from either Pride and Prejudice or Frankenstein, who would you be?\nRealistically, if I were in either book, I would probably be Victor’s father, trying to figure out my troubled son and get him to have the decent, happy life that he ought to have. But as I said above, I can identify with all three main characters. Mary is probably the most like me, though I have—haven’t we all?—felt like the Creature sometimes.\nAs an editor, what do you find are some of the challenges unique to putting together an anthology or collection? Having collaborated extensively with James Patrick Kelly, can you shed some light on the way you two work together when crafting an anthology?\nThere are a lot of moving parts to creating a good themed anthology. You have certain practical limitations: how large is your budget for buying stories? How long can the book be? What to do if a story you want is not available, or if the rights holder wants more than you can pay? What about gender balance or diversity of the contributors?\nWorking with Jim is great. On the simplest level, with two editors there can be a division of labor. But I really like the give-and-take of working with him. He is very smart and well-read and has lots of ideas and enthusiasms, likes and dislikes. So do I. We do not always agree. Usually we have a theme for the book and a rough sense of what sorts of things ought to be in it. But with, for example, Feeling Very Strange: The Slipstream Anthology, we had to come to some understanding of what we thought might be included under the title “slipstream.” Each anthology we did is a sort of exploration, a question more than an answer. We have been told by some reviewers that we do not know what we are talking about. Quite likely.\nWrestling out the contents list and writing an introduction can be a very educational process. I’m not sure if we will be editing any other books soon, but I did enjoy working with him on that series of books for Jacob Wiseman and Tachyon.\nYou’ve also worked as a science fiction and fantasy critic. What role do you think a critic plays in the landscape of publishing?\nI haven’t written much criticism for years, though I have lots of opinions. I’m more of a critic than a reviewer. Reviewers can have some effect on what gets published and what gets read, and that’s a big responsibility. Critics like me are more like football fans talking about the game once it is over and trying to figure out what happened and why it happened the way it did. For me, it’s a way to explaining why I like (or dislike) something. I prefer to talk about things I like and bring them to other people’s attention—a particular kind of story or story values.\nWhat other projects do you have in the works?\nI’m between long projects right now. I have been working off and on with a story, a kind of historical fantasy, about the assassination of William McKinley at the Pan American Exposition in Buffalo in 1901 by a Polish anarchist named Leon Czolgosz. I grew up in Buffalo, and my father was a Polish immigrant who came over as a child in 1913. They had a ride there at the exposition, “A Trip to the Moon” that was the first “Dark Ride” amusement ever done, the ancestor to all the rides at Universal City and Disney World. I have Leon visit the moon on the day that he is to shoot the president. But I still have a lot to work out, so it’s a long way from being done.\nSince you’ve created the Sycamore Hill Writer’s Workshop and have also taught numerous writing and literature courses as a professor, what is the one piece of advice you like to give your students?\nWell, I don’t know if this is appropriate for a family magazine, but the best piece of writing advice I have ever heard came to me from Gwenda Bond by way of Kelly Link: “Quit dicking around.” You’d think that would be a lot easier to do than it is.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/kessel_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Classics, Companionship, and a Creature: A Conversation with John Kessel by Chris Urie"}