{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "S+otnjD+stSGm9WNpM5EZj/Xp5g=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Everyday Dystopia: A Conversation with Samit Basu  Samit Basu was born and raised in Kolkata in West Bengal, India. He earned a degree in economics at Presidency College and completed a course in broadcasting and documentary filmmaking at the University of Westminster in London.  Basu’s debut novel, The Simoqin Prophecies, “India’s first ever SFF (science fiction/fantasy) genre novel in English,” was published by Penguin India in 2004. Marketed as “Monty Python meets the Ramayana,” among other things, it was an immediate national bestseller in India, and ultimately garnered praise at venues such as The Telegraph and Locus. Book two in the GameWorld trilogy, The Manticore’s Secret, came out in 2005 and book three, The Unwaba Revelations, followed in 2007.  In 2007, Basu also wrote notable graphic stories with Virgin Comics (now Liquid Comics), including the Devi series beginning with #3: Namaha, and The Tall Tales of Vishnu Sharma: Panchatantra. 2010 brought Basu’s collaboration with Mike Carey, a comic book called Untouchable, published by Dynamite and Liquid; and in 2011 he began comic book series Unholi with Graphic India. In 2013 he published Local Monsters with Westland. Along the way, he occasionally dabbled in short fiction such as “Alienation” in 2005 anthology The HarperCollins Book of New Indian Fiction, “Rocket Kumar” in 2008 Scholastic India anthology Superhero, “Electric Sonalika” in 2012 anthology The Apex Book of World SF 2, and a handful more.  Not to be slowed down by these projects, Basu also published a YA historical novel called Terror on the Titanic with Scholastic India in 2009. Then in 2012, Titan published superhero novel Turbulence. Sequel Resistance came in 2014, along with the first in his series of children’s books, The Adventures of Stoob: Testing Times (with Rupa imprint Red Turtle). Samit Basu wrote and codirected the film House Arrest, released on Netflix in 2019.  A year later, novel Chosen Spirits was published by Simon and Schuster India. It received a slew of rave reviews in India as well as the US, including coverage at respected science fiction venues such as Strange Horizons and Locus. Chosen Spirits landed on the Locus Recommended Reading list and was a finalist for the JCB Prize for literature. The City Inside is the highly anticipated US release of Chosen Spirits, due from Tordotcom publishing on June 7, 2022.  “I live across three cities, including a Mumbai flat on an island famous for smuggling, featuring tall buildings where local celebrities hide their second families to avoid the media. In Delhi, I have had my house invaded by monkeys five times over the years: my deal with them now is I will put them in books and screenplays, and they will leave me alone.”   What were the first SFF books or stories that were important to you, and do you feel like they have influenced your writing in any important ways?  I grew up with no understanding of genre, because that’s not how Indian bookstores worked, so I just read everything, not knowing that stories had borders. I remember being absolutely mesmerized by The Hobbit/LOTR as a preteen, and I think I read Asimov in middle school. Hitchhiker’s Guide was also an early love, and then when I was a bit older the biggest influence was Discworld, which I devoured, and which was definitely one of the underlying pillars of my first novel, The Simoqin Prophecies. The others were various fantastical early influences: an obsession with world myth, fables from everywhere, children’s stories, and fantasy films in Bengali. And genre films and shows that were global blockbusters, plus eighties and nineties animation, and comics wherever I could get them, starting with Asterix and Tintin.  My understanding of genre as a wing of publishing only began after my first novel was published: until then I’d only thought of fantasy and SF as useful descriptors of story, not as closed gates with their own conformities. I’m influenced by everything I read and see, and I’m not sure what my biggest influences are now: whatever they are, they’re current work.  How did you get into writing seriously, and what was your journey to “breaking in”?  It was fairly dramatic. I think I’d always wanted to be a writer, or do something in a creative field, but that really wasn’t something someone from my generation and demographic did in India. It’s still not something that’s a career, at least for people who have to think about earning money, unless they’re sufficiently socially privileged, very lucky, and very stubborn, and I’ve been all three. So, I did all the things I was supposed to do as a student, and at twenty-one, I found myself joining India’s top MBA school with absolutely no urge to be there. I’d promised myself I would drop whatever I was doing in life and write a novel the moment I had an idea I was sure could be a book.  This happened a few weeks into the first term, and to my absolute surprise, when I told my closest family and friends about it, that I really wanted to give the book a shot, they all said I should! Emboldened by these reckless people and their mix of confidence in me and possibly exhaustion at my moaning, I went back home, wrote a novel, and I think around a couple of years later it was published by Penguin in India. I cannot begin to tell you how ignorant I was about publishing, a life in the arts, anything. It wasn’t just that I was young, it was really a different era, pre-social media, pre-Gmail, even, and there was just no information publicly available.  The book did really well though: lots of lovely reviews, bestseller lists for many months. No major Indian (English) publisher had published/marketed SFF before, and Penguin didn’t try to smuggle me in under the magic realism/mythological respectability blankets. I was twenty-three at the time, and it was a time when India had globalist/progressive goals, so I got a lot of attention. That was eighteen years ago, and I’ve been writing for a living ever since across books, comics, film/TV, and nonfiction in a wide range of genres.  Breaking into the UK and the US happened in 2012/13 with Turbulence, a superhero novel, from Titan. Big four break-in happened, well, now. The decade in the middle has mostly been spent in Bollywood meetings and development hells.  The City Inside may get the attention of many new readers, but you’ve actually been writing and publishing for roughly twenty years. Has your writing changed in specific ways since The Simoqin Prophecies came out in 2003?  My writing’s changed continuously, mostly because I’ve been traveling across genres and media a lot, partly to be able to keep writing for a living and partly because I really like a wide range of genres and media (though if I had to pick one of each, it would be speculative fiction novels), and hopefully I’m also growing as a writer with age and exposure and experience.  Non-writing creative work like direction or film/comics editing changes your writing as well. It’s difficult to articulate the specifics or figure out what comes from where, especially over two decades. I think you learn a lot from code-switching in both life and work. Each genre, each medium teaches you different things, each has its challenges and its conformities. So, figuring out how to retain your own identity and develop your own voice is consistently interesting and always challenging. Also, choosing projects is just as important as executing them as well you can: I’ve hopefully gotten better at both.  The City Inside has a number of fun innovations, such as the screenshirt. What are a few of your favorites?  When I decided to set The City Inside approximately a decade in the future, I set myself a constraint: I would use tech that had already been invented in some form at least as a prototype, make only slight extensions to it that would be very feasible to imagine a decade in the future, and focus really on how it would be used, because the same tech is used very differently in India than it is in the West, not just in different regions but also different communities and privilege levels. Essentially keeping the focus on the social and political use and impact of the tech more than the tech itself.  So my favorite innovations are the Flow, the viewer-personalized future-influencer livestream-social media-reality TV-gaming-news hybrid that the protagonists produce and manage at work; Tavata, the smart-tattoo upgrade for culture-customizable consent-matching/dating/spouse-arranging/sex-policing; the various methods used by shadowy resistance groups for protest and action from spray-paint drones to virtual dens; and of course Narad the digital assistant, named after the messenger/gossipmonger/spy of Hindu myth.  There are some sharp, somewhat cynical observations on sociopolitical activism in the narrative. I’m reminded of the way that many activists from famous eras in the US later became businesspeople, or otherwise affluent participants in the systems they had stood against. Are you taking a position through your fiction, or is this more about just imagining and fictionalizing future possibilities?  Somewhere in between, because the inspiration for these moments of cynicism comes from the behavior of present-day influencers I know, and many present-day politicians who have conveniently shown people much hope and then switched camps as the country slides further into a pit. Looking into the future, I could only imagine that the next generation of people like them would be under even more pressure and trusting any public figure to have fixed values and positions would be even more dangerous—all of this to make the journey of the protagonists toward figuring out their own forms of resolve and resistance more difficult.  One of the things that struck me about Joey’s character was her role as family mediator, and to some extent, family caretaker in general. What were your inspirations for this character, and what were your favorite things about writing her?  All the people in The City Inside are inspired by or shameless chimaeras of people I know or have met in real life, between close friends and family and memorable single meetings. Joey is a few of my favorite people in the real world, and there’s a lot of my feelings in there as well. But her top five immediate sources are all women I know, who are in a particular range of professions—editors, team leaders, producers—and all have to handle a tremendous amount of responsibility and stress. They had certain similarities: all immensely capable, underappreciated, overcommitted, non-narcissistic, often under-rewarded, empathetic, reluctantly authority-exerting, under-radar system-changing, often gaslit, often permanently found cleaning up after emotionally underdeveloped charismatic sociopaths. And all very angry about the state of the world and guilty about not doing enough to improve it even if they were doing a lot. So, Joey was great fun to write: I knew her very well.  What was the initial inspiration for this book, and how did it develop?  I wanted to write a near-future story set in the city I live in, which is Delhi, the political, media, and cultural capital of India. A lot of this desire came out of anger at the present and anxiety about the future. I also spend a lot of time on the Internet, and it began to become really obvious that people all over the world were facing the same crises and were frustrated about the same lack of response, even if everyone was looking at their local chaos-pit.  My initial plan was to map out the first half of this century for South Asia, using current and speculative nonfiction, the news both real and propaganda, and people and places I broadly knew. The central characters would be from the generation in their teens now, people born into a world changing too fast for most present-day adults to understand. The book itself I’d visualized as part tech-dystopia, part cyberpunk, three sections each a decade apart. I wanted to track my protagonists as they escaped or defeated the multiple-choice apocalypses currently threatening our world, with an extra layer of India-specific chaos.  I ended up, a few years of research later, doing something quite different. And I think it was because I actually lived in the middle of the world I was trying to make a near-future fictional extension of, and it’s not a dystopia, or cyberpunk, if you live inside a world: it’s just everyday life.  The City Inside was originally published in India as Chosen Spirits. Did you make any notable changes for its US incarnation?  I made some additions to the world of the novel, mostly to factor in the events of 2020 and as much of 2021 as I could in the decade-ago backstory. I know it’s not the job of science fiction to accurately predict the future, but a lot of the worldbuilding was based on the news, long-form and speculative nonfiction in various media, and even in its earliest drafts I was making adjustments constantly because bad things I’d thought were five years away were happening on a weekly basis. The first two pandemic waves were simply too impactful to leave out of any reality-adjacent worldbuild, I thought. Apart from that, a few structural adjustments suggested by my Tordotcom editors, Sanaa Ali-Virani and Ruoxi Chen, who were an absolute delight to work with.  What were some of your biggest challenges in writing this book, and how did you deal with those challenges?  I ended up making a novel out of just the planned first section of the three I described earlier because the more I immersed myself in research and early drafts the clearer it became that there was no tech-led world-saving possible here, and no revolution that could guarantee sustainable social progress and the defeat of evils millennia old. That the answer lay not in action set pieces or the defeat of a specific set of villains, but in multigenerational, multi-community, excruciatingly slow progress, and it would be vaguely exploitative to suggest otherwise in a book very closely overlaid on the real world. So, I started focusing more on the protagonists coping with and learning from their surroundings, finding the courage to stop looking away from their very dangerous world, and making their journeys toward becoming the people they needed to be to save whatever their own worlds were.  What for you is the heart of the story for The City Inside? What is important for people to know about this book?  The City Inside is about two people coming to terms with a very harsh world and finding their own ways into action. In a world that wants to measure, manipulate, and dominate them, they must find out who they really are in the middle of endless lies and distraction, what they really want in a shape-shifting, cloudy, reality-set, and how to make the world around them better to the extent of their abilities.  What should people know? It’s a near-future anti-dystopian science fiction novel set in Delhi about a decade from now. Heat waves, water shortage, incredible inequality, surveillance capitalism, culture clashes, dysfunctional families/friendships/work spaces/urban societies.  Our protagonist Joey is a Reality Controller, who manages a Flowstar, an influencer/celebrity who is also her college ex. She oversees and optimizes his multimedia multi-reality livestreams with great success and manages her own life as best as she can, keeping in mind her own safety, and her family’s. But one day she impulsively offers a job to a childhood friend, Rudra, a recluse estranged from his powerful and very shady family. They offend people they shouldn’t in the process, and their lives spin out of control.  You have some short fiction out. Are you more comfortable writing longer works?  I’m much more comfortable with longer work, mostly because when I have an idea I really like, I enjoy living in it for as long as I can. Most of the short story ideas I have go into a folder, and then get absorbed into novels.  What else are you working on, what do you have coming up that you’d like people to know about?  Another novel, hopefully next year, and I’m waiting for Tordotcom to announce it! It has several themes in common with The City Inside, and has all the action set pieces, plot twists, romance, and shenanigans that I had to hold myself back from in an attempt to foreground the interiority of TCI. Also, some film things I’m working on, but those aren’t real until they’re on screen. I know what the next few books I want to write are and definitely want to direct more in the TV/film space as well. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nEveryday Dystopia: A Conversation with Samit Basu\nSamit Basu was born and raised in Kolkata in West Bengal, India. He earned a degree in economics at Presidency College and completed a course in broadcasting and documentary filmmaking at the University of Westminster in London.\nBasu’s debut novel, The Simoqin Prophecies, “India’s first ever SFF (science fiction/fantasy) genre novel in English,” was published by Penguin India in 2004. Marketed as “Monty Python meets the Ramayana,” among other things, it was an immediate national bestseller in India, and ultimately garnered praise at venues such as The Telegraph and Locus. Book two in the GameWorld trilogy, The Manticore’s Secret, came out in 2005 and book three, The Unwaba Revelations, followed in 2007.\nIn 2007, Basu also wrote notable graphic stories with Virgin Comics (now Liquid Comics), including the Devi series beginning with #3: Namaha, and The Tall Tales of Vishnu Sharma: Panchatantra. 2010 brought Basu’s collaboration with Mike Carey, a comic book called Untouchable, published by Dynamite and Liquid; and in 2011 he began comic book series Unholi with Graphic India. In 2013 he published Local Monsters with Westland. Along the way, he occasionally dabbled in short fiction such as “Alienation” in 2005 anthology The HarperCollins Book of New Indian Fiction, “Rocket Kumar” in 2008 Scholastic India anthology Superhero, “Electric Sonalika” in 2012 anthology The Apex Book of World SF 2, and a handful more.\nNot to be slowed down by these projects, Basu also published a YA historical novel called Terror on the Titanic with Scholastic India in 2009. Then in 2012, Titan published superhero novel Turbulence. Sequel Resistance came in 2014, along with the first in his series of children’s books, The Adventures of Stoob: Testing Times (with Rupa imprint Red Turtle). Samit Basu wrote and codirected the film House Arrest, released on Netflix in 2019.\nA year later, novel Chosen Spirits was published by Simon and Schuster India. It received a slew of rave reviews in India as well as the US, including coverage at respected science fiction venues such as Strange Horizons and Locus. Chosen Spirits landed on the Locus Recommended Reading list and was a finalist for the JCB Prize for literature. The City Inside is the highly anticipated US release of Chosen Spirits, due from Tordotcom publishing on June 7, 2022.\n“I live across three cities, including a Mumbai flat on an island famous for smuggling, featuring tall buildings where local celebrities hide their second families to avoid the media. In Delhi, I have had my house invaded by monkeys five times over the years: my deal with them now is I will put them in books and screenplays, and they will leave me alone.”\nWhat were the first SFF books or stories that were important to you, and do you feel like they have influenced your writing in any important ways?\nI grew up with no understanding of genre, because that’s not how Indian bookstores worked, so I just read everything, not knowing that stories had borders. I remember being absolutely mesmerized by The Hobbit/LOTR as a preteen, and I think I read Asimov in middle school. Hitchhiker’s Guide was also an early love, and then when I was a bit older the biggest influence was Discworld, which I devoured, and which was definitely one of the underlying pillars of my first novel, The Simoqin Prophecies. The others were various fantastical early influences: an obsession with world myth, fables from everywhere, children’s stories, and fantasy films in Bengali. And genre films and shows that were global blockbusters, plus eighties and nineties animation, and comics wherever I could get them, starting with Asterix and Tintin.\nMy understanding of genre as a wing of publishing only began after my first novel was published: until then I’d only thought of fantasy and SF as useful descriptors of story, not as closed gates with their own conformities. I’m influenced by everything I read and see, and I’m not sure what my biggest influences are now: whatever they are, they’re current work.\nHow did you get into writing seriously, and what was your journey to “breaking in”?\nIt was fairly dramatic. I think I’d always wanted to be a writer, or do something in a creative field, but that really wasn’t something someone from my generation and demographic did in India. It’s still not something that’s a career, at least for people who have to think about earning money, unless they’re sufficiently socially privileged, very lucky, and very stubborn, and I’ve been all three. So, I did all the things I was supposed to do as a student, and at twenty-one, I found myself joining India’s top MBA school with absolutely no urge to be there. I’d promised myself I would drop whatever I was doing in life and write a novel the moment I had an idea I was sure could be a book.\nThis happened a few weeks into the first term, and to my absolute surprise, when I told my closest family and friends about it, that I really wanted to give the book a shot, they all said I should! Emboldened by these reckless people and their mix of confidence in me and possibly exhaustion at my moaning, I went back home, wrote a novel, and I think around a couple of years later it was published by Penguin in India. I cannot begin to tell you how ignorant I was about publishing, a life in the arts, anything. It wasn’t just that I was young, it was really a different era, pre-social media, pre-Gmail, even, and there was just no information publicly available.\nThe book did really well though: lots of lovely reviews, bestseller lists for many months. No major Indian (English) publisher had published/marketed SFF before, and Penguin didn’t try to smuggle me in under the magic realism/mythological respectability blankets. I was twenty-three at the time, and it was a time when India had globalist/progressive goals, so I got a lot of attention. That was eighteen years ago, and I’ve been writing for a living ever since across books, comics, film/TV, and nonfiction in a wide range of genres.\nBreaking into the UK and the US happened in 2012/13 with Turbulence, a superhero novel, from Titan. Big four break-in happened, well, now. The decade in the middle has mostly been spent in Bollywood meetings and development hells.\nThe City Inside may get the attention of many new readers, but you’ve actually been writing and publishing for roughly twenty years. Has your writing changed in specific ways since The Simoqin Prophecies came out in 2003?\nMy writing’s changed continuously, mostly because I’ve been traveling across genres and media a lot, partly to be able to keep writing for a living and partly because I really like a wide range of genres and media (though if I had to pick one of each, it would be speculative fiction novels), and hopefully I’m also growing as a writer with age and exposure and experience.\nNon-writing creative work like direction or film/comics editing changes your writing as well. It’s difficult to articulate the specifics or figure out what comes from where, especially over two decades. I think you learn a lot from code-switching in both life and work. Each genre, each medium teaches you different things, each has its challenges and its conformities. So, figuring out how to retain your own identity and develop your own voice is consistently interesting and always challenging. Also, choosing projects is just as important as executing them as well you can: I’ve hopefully gotten better at both.\nThe City Inside has a number of fun innovations, such as the screenshirt. What are a few of your favorites?\nWhen I decided to set The City Inside approximately a decade in the future, I set myself a constraint: I would use tech that had already been invented in some form at least as a prototype, make only slight extensions to it that would be very feasible to imagine a decade in the future, and focus really on how it would be used, because the same tech is used very differently in India than it is in the West, not just in different regions but also different communities and privilege levels. Essentially keeping the focus on the social and political use and impact of the tech more than the tech itself.\nSo my favorite innovations are the Flow, the viewer-personalized future-influencer livestream-social media-reality TV-gaming-news hybrid that the protagonists produce and manage at work; Tavata, the smart-tattoo upgrade for culture-customizable consent-matching/dating/spouse-arranging/sex-policing; the various methods used by shadowy resistance groups for protest and action from spray-paint drones to virtual dens; and of course Narad the digital assistant, named after the messenger/gossipmonger/spy of Hindu myth.\nThere are some sharp, somewhat cynical observations on sociopolitical activism in the narrative. I’m reminded of the way that many activists from famous eras in the US later became businesspeople, or otherwise affluent participants in the systems they had stood against. Are you taking a position through your fiction, or is this more about just imagining and fictionalizing future possibilities?\nSomewhere in between, because the inspiration for these moments of cynicism comes from the behavior of present-day influencers I know, and many present-day politicians who have conveniently shown people much hope and then switched camps as the country slides further into a pit. Looking into the future, I could only imagine that the next generation of people like them would be under even more pressure and trusting any public figure to have fixed values and positions would be even more dangerous—all of this to make the journey of the protagonists toward figuring out their own forms of resolve and resistance more difficult.\nOne of the things that struck me about Joey’s character was her role as family mediator, and to some extent, family caretaker in general. What were your inspirations for this character, and what were your favorite things about writing her?\nAll the people in The City Inside are inspired by or shameless chimaeras of people I know or have met in real life, between close friends and family and memorable single meetings. Joey is a few of my favorite people in the real world, and there’s a lot of my feelings in there as well. But her top five immediate sources are all women I know, who are in a particular range of professions—editors, team leaders, producers—and all have to handle a tremendous amount of responsibility and stress. They had certain similarities: all immensely capable, underappreciated, overcommitted, non-narcissistic, often under-rewarded, empathetic, reluctantly authority-exerting, under-radar system-changing, often gaslit, often permanently found cleaning up after emotionally underdeveloped charismatic sociopaths. And all very angry about the state of the world and guilty about not doing enough to improve it even if they were doing a lot. So, Joey was great fun to write: I knew her very well.\nWhat was the initial inspiration for this book, and how did it develop?\nI wanted to write a near-future story set in the city I live in, which is Delhi, the political, media, and cultural capital of India. A lot of this desire came out of anger at the present and anxiety about the future. I also spend a lot of time on the Internet, and it began to become really obvious that people all over the world were facing the same crises and were frustrated about the same lack of response, even if everyone was looking at their local chaos-pit.\nMy initial plan was to map out the first half of this century for South Asia, using current and speculative nonfiction, the news both real and propaganda, and people and places I broadly knew. The central characters would be from the generation in their teens now, people born into a world changing too fast for most present-day adults to understand. The book itself I’d visualized as part tech-dystopia, part cyberpunk, three sections each a decade apart. I wanted to track my protagonists as they escaped or defeated the multiple-choice apocalypses currently threatening our world, with an extra layer of India-specific chaos.\nI ended up, a few years of research later, doing something quite different. And I think it was because I actually lived in the middle of the world I was trying to make a near-future fictional extension of, and it’s not a dystopia, or cyberpunk, if you live inside a world: it’s just everyday life.\nThe City Inside was originally published in India as Chosen Spirits. Did you make any notable changes for its US incarnation?\nI made some additions to the world of the novel, mostly to factor in the events of 2020 and as much of 2021 as I could in the decade-ago backstory. I know it’s not the job of science fiction to accurately predict the future, but a lot of the worldbuilding was based on the news, long-form and speculative nonfiction in various media, and even in its earliest drafts I was making adjustments constantly because bad things I’d thought were five years away were happening on a weekly basis. The first two pandemic waves were simply too impactful to leave out of any reality-adjacent worldbuild, I thought. Apart from that, a few structural adjustments suggested by my Tordotcom editors, Sanaa Ali-Virani and Ruoxi Chen, who were an absolute delight to work with.\nWhat were some of your biggest challenges in writing this book, and how did you deal with those challenges?\nI ended up making a novel out of just the planned first section of the three I described earlier because the more I immersed myself in research and early drafts the clearer it became that there was no tech-led world-saving possible here, and no revolution that could guarantee sustainable social progress and the defeat of evils millennia old. That the answer lay not in action set pieces or the defeat of a specific set of villains, but in multigenerational, multi-community, excruciatingly slow progress, and it would be vaguely exploitative to suggest otherwise in a book very closely overlaid on the real world. So, I started focusing more on the protagonists coping with and learning from their surroundings, finding the courage to stop looking away from their very dangerous world, and making their journeys toward becoming the people they needed to be to save whatever their own worlds were.\nWhat for you is the heart of the story for The City Inside? What is important for people to know about this book?\nThe City Inside is about two people coming to terms with a very harsh world and finding their own ways into action. In a world that wants to measure, manipulate, and dominate them, they must find out who they really are in the middle of endless lies and distraction, what they really want in a shape-shifting, cloudy, reality-set, and how to make the world around them better to the extent of their abilities.\nWhat should people know? It’s a near-future anti-dystopian science fiction novel set in Delhi about a decade from now. Heat waves, water shortage, incredible inequality, surveillance capitalism, culture clashes, dysfunctional families/friendships/work spaces/urban societies.\nOur protagonist Joey is a Reality Controller, who manages a Flowstar, an influencer/celebrity who is also her college ex. She oversees and optimizes his multimedia multi-reality livestreams with great success and manages her own life as best as she can, keeping in mind her own safety, and her family’s. But one day she impulsively offers a job to a childhood friend, Rudra, a recluse estranged from his powerful and very shady family. They offend people they shouldn’t in the process, and their lives spin out of control.\nYou have some short fiction out. Are you more comfortable writing longer works?\nI’m much more comfortable with longer work, mostly because when I have an idea I really like, I enjoy living in it for as long as I can. Most of the short story ideas I have go into a folder, and then get absorbed into novels.\nWhat else are you working on, what do you have coming up that you’d like people to know about?\nAnother novel, hopefully next year, and I’m waiting for Tordotcom to announce it! It has several themes in common with The City Inside, and has all the action set pieces, plot twists, romance, and shenanigans that I had to hold myself back from in an attempt to foreground the interiority of TCI. Also, some film things I’m working on, but those aren’t real until they’re on screen. I know what the next few books I want to write are and definitely want to direct more in the TV/film space as well.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/basu_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Everyday Dystopia: A Conversation with Samit Basu by Arley Sorg"}