{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jason Heller", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "rxeQf0nTeJRX4BFlmxPj3SW2DZY=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  A Dance with Futuristic Dragons: The Science-Fantasy Glamour of Marc Bolan and T. Rex  “Get it on. Bang a gong. Get it on.”  These simple lyrics are Marc Bolan’s calling card—at least in the United States, where the 1971 song “Get It On (Bang a Gong)” became the lone hit by Marc Bolan’s band T. Rex. A staple of classic-rock radio, “Get It On” is not the type of song that threatened to storm the rarified heights of the poetic canon. A slinky affair full of sly rhythm and stomping riffs, “Get It On” wormed its way into the ears of America—Bolan had already established himself as a superstar in his native England—like some unholy progeny of heavy metal and bubblegum pop. Glam rock, the genre he helped create, was launched into a loftier orbit by David Bowie, his friend, rival, and closest contemporary. But unlike Bowie’s angst-ridden tales about his alien alter ego Ziggy Stardust and the lost astronaut Major Tom, Bolan was happy to write bouncy nonsense.  Dig a little deeper into “Get It On,” however, and there’s something far more fantastic at play. Amid his blunt entreaties for sex, Bolan sprinkles a curious assortment of heady non-sequiturs. “You got the teeth of the Hydra upon you,” goes one line; “With your cloak full of eagles,” goes another. These aren’t the brute come-ons of your typical ’70s cock-rock song. They’re phrases that could have appeared in a book of high fantasy—a term coined in 1971 by Lloyd Alexander, author of the fantasy epic The Chronicles of Prydain—or even a spirited session of Chainmail, the groundbreaking fantasy role-playing game that was co-created by future Dungeons & Dragons icon Gary Gygax and released in 1971, just as “Get It On” was ascending the pop charts.  As it turns out, Bowie wasn’t the only major glam-rock star in the early ’70s who flaunted an appreciation for—and an appropriation of—speculative fiction. It may not be immediately obvious from “Get It On,” but Bolan is one of the 20th century’s foremost unifiers of popular music and fantasy (and to a lesser degree, science fiction—or more precisely, the hybrid subgenre of science-fantasy, which better suited Bolan’s romantic view of the cosmos). His appreciation wasn’t a passing fancy or part of some fad. Taken as a whole, Bolan’s body of work—if not his entire life, cut short as it was in 1977 at the age of 29—was an extended, elaborate narrative spun of myth and magic.  Fantasy was in Marc Bolan’s bones.  In the London borough of Hackney in 1955, eight-year-old Mark Feld lay in bed with the measles. Ill though he was, he wasn’t alone. The boy was surrounded by dinosaurs, the inhabitants of books on prehistoric creatures that his parents, of limited means but always indulgent of their two sons, had given him. Those dinosaurs “were like dragons that could have breathed fire and smoke,” he later reminisced, long after changing his name to Marc Bolan, “and somehow, because they existed, they justified unicorns and centaurs and the whole Narnia scene.”  C. S. Lewis’ The Chronicles of Narnia—published between 1950 and 1956, just as the young Mark Feld was learning to read and developed a lifelong love of books—proved to be just one of the many works of speculative fiction that fascinated the boy. Another was the seminal SF short story “A Sound of Thunder” by Ray Bradbury. In particular, the mighty Tyrannosaurus Rex being hunted by time travelers in Bradbury’s story lodged in Feld’s impressionable mind. To him, dinosaurs again equated to dragons, not to mention the notion that Earth’s primordial past was a vast fantasia of strange, preternatural beings.  That notion was driven home by another series of books that captivated Feld: The Lord of the Rings. J. R. R. Tolkien’s famed fantasy trilogy, plus its predecessor, The Hobbit, became the boy’s bible. It didn’t hurt that Feld was unnaturally small for his age, with cherubic cheeks, curly hair, and a twinkle in his eye, which surely caused him to empathize with Frodo, Bilbo, and the other hobbits of the Shire. (Even as an adult, Feld would never top five-foot-seven.) And of course, The Hobbit held a dragon—the fearsome, saurian behemoth that would continue to enthrall Feld after he grew up, changed his name, and remembered “A Sound of Thunder” when dubbing his band Tyrannosaurus Rex (later to be shortened to T. Rex).  Tyrannosaurus Rex formed in 1967, but Bolan—like Bowie—underwent some changes to get there. His first solo single under the name Marc Bolan was released in 1965; it flopped, but its title, “The Wizard,” more than hinted at Bolan’s unabashed adoration of fantasy literature. “Walking in the woods one day,” he sings, “I met a man who said that he was magic.” After observing the salient details of the mage’s appearance, including the “pointed hat upon his head” and the fact that “shadows followed him all around,” Bolan concludes the song with the eerie couplet, “Silver sunlight in his eyes / The wizard turned and melted in the sky.” Although not named, the song’s titular wizard is a dead ringer for Tolkien’s Gandalf.  The failure of “The Wizard,” as well as a brief stint in the rock band John’s Children, left Bolan directionless—that is, until he reinvented himself as the elfin shaman of the psychedelic folk duo Tyrannosaurus Rex. With percussionist Stephen Ross Porter—renamed Steve Peregrin Took in honor of the hobbit Peregrin Took from The Lord of the Rings—the twosome took the hippie aesthetic to a mystical extreme. The pair wore extravagant robes, sat cross-legged on stages as if initiating some sorcerous rite, and began crafting music that evoked the myths, legends, and creatures of some imaginary past. Albums titles such as 1968’s My People Were Fair and Had Sky in Their Hair but Now They’re Content to Wear Stars on Their Brows; 1968’s Prophets, Seers, and Sages, the Angels of the Ages; and 1969’s Unicorn drove home Bolan’s obsession with fantasy—one every ounce as powerful as Bowie’s obsession with science fiction, which was soon to become prominent with his 1969 smash “Space Oddity.” According to Peter Doggett’s book on Bowie, The Man Who Sold the World, Bolan claimed to have written part of “Space Oddity,” a claim that’s never been corroborated—although Bolan did play guitar on “Prettiest Star,” Bowie’s next single after “Space Oddity.”  In fact, Bolan and Bowie would end up working with the same producer, Tony Visconti—only Bolan came with a condition. He insisted that Visconti read Tolkien before working with him. As Visconti recounts in the 2007 BBC documentary Marc Bolan: The Final Word, Bolan told him, “I want you to read The Lord of the Rings. Read this if you want to know what I’m about.” But Bolan was more than simply obsessed; he was immersed. Visconti adds, “He actually lived [in Tolkien’s realm of Middle-earth]. In his mind, that all existed. He saw himself as maybe, possibly, a reincarnation of some bard or some wizard that lived in the time when elves walked the earth.” Coincidentally, or perhaps not, Bolan regularly performed in an English nightclub in the late ’60s called Middle Earth.  Bolan considered himself “a science fiction writer who sings,” presumably using the term “science fiction” as a catch-all for science fiction and fantasy, as was common at the time. He worked on an ultimately unrealized science-fiction rock opera, writing songs for it such as “Brain Police,” “Metropolis” (possibly a reference to Fritz Lang’s 1927 SF film of the same name, also a favorite of Bowie’s), and “Dynamo.” He even once told radio interviewer that he had numerous fantasy novels of his own in the works.  One such planned book, The Children of Rarn, never came to be, but Bolan had at least thought it through extensively. “It’s about prehistoric Earth,” he once explained, “before the dinosaurs were heavy creatures. There were two races of people then, the Peacelings and the Dworns, and a third group of beings called Lithons, all locked in complex, antagonistic relationships”—akin to some amalgam of H. G. Wells’ The Time Machine, with its Eloi and Morlocks, and Hammer Films’ popular prehistoric movies of the time, such as 1966’s One Million Years B.C. Years later, he claimed to have written a book of science fiction stories titled Wilderness of My Mind—and although the book has yet to surface, Bolan boastfully claimed that none other than Ray Bradbury, Bolan’s formative influence, had shown an interest in it.  That said, Bolan did publish a book. In 1969, his collection of fantasy poetry Warlock of Love—a title that might as well have described the robed, spellbinding, sensuous Bolan himself—was released, and it became a cult hit. “Dedicated to the woods of knowledge,” it began, and a typical snippet of the text reads like so:   The questical day had held all the promise of an artist,  but with the grey horseless cloud of the autumn afternoon all hope of starfields revealed was lost, as a pebble of love in the black scorched deserts of civilisation. As a last hermetic gesture, with the masts of the  day spent, the gaunt man, pure of skin but soiled of soul, prepared his parchment scroll and crouched like a beggar began the last task of his day—an etching of a child, blue skinned and shapen like a fowl of the skies, with eyes so true and hallowed that the artition wept as he drew, and already the quest was begun. Where Bowie peered forward with fear and wonder into humankind’s technological tomorrow, Bolan looked backward—even though his mention of “the black scorched deserts of civilization” in Warlock of Love alluded to a science-fantasy hybrid, one where an apocalypse, possibly atomic in origin, had cleared the world of science and left room for magic.  The arcadian, folklore-like aura that surrounded Bolan’s fantasy-themed music with Tyrannosaurus Rex didn’t reach the audience he’d hoped. In an attempt to appeal to a more universal listenership, the band’s 1970 album T. Rex tinkered with shorter, punchier, electrified songs. Bolan fired Took, hired a more conventional rock band, and shortened the group’s name to T. Rex. (Following Took’s ouster, the drummer formed a short-lived psychedelic group called Shagrat, named after an orc from The Lord of the Rings.)  T. Rex went on to release anthems like “Get It On (Bang a Gong),” thus fulfilling Bolan’s ambitions of stardom. But even then, his swaggering riffs and daydream lyrics retained traces of Tyrannosaurus Rex’s fantastical vibe. In 1970, Bolan’s appearance as a guest guitarist on Bowie’s Venusian-populated song “Memory of a Free Festival” was not only one of the points where the two glam titans collided on tape, but where glam rock became a primary vessel for science fiction and fantasy in song—although in a campier, pulpier, more mysteriously playful way than the sober-faced adaptations of those genres happening at the same time in progressive rock. (Venus would pop up again in “Venus Loon,” a 1974 song from the T. Rex album Zinc Alloy and the Hidden Riders of Tomorrow, itself a cheeky nod to Bowie’s more famous fictional band, Ziggy Stardust and the Spiders from Mars.) At one point in the summer of 1974, Bowie and Bolan spent days in a hotel room binge-watching a print of A Clockwork Orange that they’d procured, a testament to just how much the science fiction of Stanley Kubrick and Anthony Burgess affected their work. In his book Electric Eden, Rob Young observes, “Bolan and Bowie were […] Pied Pipers […], transporting their young listeners from immersion in a speculative, mythological past and repositioning pop music in a future of plastic, glitter, and tin.”  Science fiction continued to seep into Bolan’s fantasy. Smuggling in references to mythical creatures, space travel, and cosmic awe, T. Rex songs like 1971’s “Planet Queen” and the following year’s “Ballroom of Mars” lured listeners into a kaleidoscopic, science-fantasy universe of Bolan’s construction—all while evoking SF legends like Edgar Rice Burroughs, whose John Carter of Mars series similarly combined fantasy and science fiction into a staggeringly wondrous whole. No T. Rex album exemplifies this better than 1976’s Futuristic Dragon; the cover depicts Bolan—or a character closely resembling him—riding a smoke-bellowing dragon, like some Celtic warrior of yore going forth to vanquish the cold forces of anachronistic technocracy. (It was painted by the famed artist George Underwood, who was also responsible for the covers of Bowie’s Hunky Dory and Ziggy Stardust as well as numerous science fiction and fantasy novels.)  Futuristic Dragon is by no means a concept album, let alone one entirely adhering to science-fantasy. Songs such as “Jupiter Liar” and “Theme for a Dragon,” however, conjure familiar SFF themes—although not as potently as the album’s opening track, “Futuristic Dragon (Introduction).” A piece of spoken-word poetry recited over Hendrix-meets-disco weirdness, it sums up Bolan’s fantasist fever-dream in a handful of compact, vivid lines:   Deep beneath an ancient shadow  Stunned with age and too much wisdom Reclined in glass, with eyes too steep Relentless dimensions of quadrophonic sleep Dwelt the wild grinning cyclopean pagan Screaming destruction in sheer dazzling raiment A thunderbolt master, a ’lectronic savior A cold galactic raver, the Futuristic Dragon Bolan’s untimely death in a car crash a year after Futuristic Dragon’s release left the sprawling saga that he wove throughout his songs tragically unfinished. Still, Bolan was able to lodge one last plea in favor of the literary genres he so passionately embodied. In his column in the British music magazine Record Mirror on September 10, 1977—six days before his death—he penned a glowing review of Star Wars, which he’d just seen. In it he wrote, “Now perhaps people will pay more attention to the science fiction field where so many great poets, writers, and musicians are lurking unsung.”  Like George Lucas, Marc Bolan preached science fiction and fantasy to the masses. In an era before speculative fiction had become respected and embraced by the mainstream, he smuggled speculative fiction into more popular and palatable forms, easy to digest but still holding true to what makes SFF tick: imagination, spectacle, and a quest for understanding unrestrained by the mundane and banal. In an interview, Bolan was once asked what drove him to become a star—what kept him up there in the limelight besides the obvious worldly rewards of fame and fortune. His response: “On that stage, I’m at liberty. I’m in a realm of fantasy.”  Jason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "text": "Non-Fiction\nA Dance with Futuristic Dragons: The Science-Fantasy Glamour of Marc Bolan and T. Rex\n“Get it on. Bang a gong. Get it on.”\nThese simple lyrics are Marc Bolan’s calling card—at least in the United States, where the 1971 song “Get It On (Bang a Gong)” became the lone hit by Marc Bolan’s band T. Rex. A staple of classic-rock radio, “Get It On” is not the type of song that threatened to storm the rarified heights of the poetic canon. A slinky affair full of sly rhythm and stomping riffs, “Get It On” wormed its way into the ears of America—Bolan had already established himself as a superstar in his native England—like some unholy progeny of heavy metal and bubblegum pop. Glam rock, the genre he helped create, was launched into a loftier orbit by David Bowie, his friend, rival, and closest contemporary. But unlike Bowie’s angst-ridden tales about his alien alter ego Ziggy Stardust and the lost astronaut Major Tom, Bolan was happy to write bouncy nonsense.\nDig a little deeper into “Get It On,” however, and there’s something far more fantastic at play. Amid his blunt entreaties for sex, Bolan sprinkles a curious assortment of heady non-sequiturs. “You got the teeth of the Hydra upon you,” goes one line; “With your cloak full of eagles,” goes another. These aren’t the brute come-ons of your typical ’70s cock-rock song. They’re phrases that could have appeared in a book of high fantasy—a term coined in 1971 by Lloyd Alexander, author of the fantasy epic The Chronicles of Prydain—or even a spirited session of Chainmail, the groundbreaking fantasy role-playing game that was co-created by future Dungeons & Dragons icon Gary Gygax and released in 1971, just as “Get It On” was ascending the pop charts.\nAs it turns out, Bowie wasn’t the only major glam-rock star in the early ’70s who flaunted an appreciation for—and an appropriation of—speculative fiction. It may not be immediately obvious from “Get It On,” but Bolan is one of the 20th century’s foremost unifiers of popular music and fantasy (and to a lesser degree, science fiction—or more precisely, the hybrid subgenre of science-fantasy, which better suited Bolan’s romantic view of the cosmos). His appreciation wasn’t a passing fancy or part of some fad. Taken as a whole, Bolan’s body of work—if not his entire life, cut short as it was in 1977 at the age of 29—was an extended, elaborate narrative spun of myth and magic.\nFantasy was in Marc Bolan’s bones.\nIn the London borough of Hackney in 1955, eight-year-old Mark Feld lay in bed with the measles. Ill though he was, he wasn’t alone. The boy was surrounded by dinosaurs, the inhabitants of books on prehistoric creatures that his parents, of limited means but always indulgent of their two sons, had given him. Those dinosaurs “were like dragons that could have breathed fire and smoke,” he later reminisced, long after changing his name to Marc Bolan, “and somehow, because they existed, they justified unicorns and centaurs and the whole Narnia scene.”\nC. S. Lewis’ The Chronicles of Narnia—published between 1950 and 1956, just as the young Mark Feld was learning to read and developed a lifelong love of books—proved to be just one of the many works of speculative fiction that fascinated the boy. Another was the seminal SF short story “A Sound of Thunder” by Ray Bradbury. In particular, the mighty Tyrannosaurus Rex being hunted by time travelers in Bradbury’s story lodged in Feld’s impressionable mind. To him, dinosaurs again equated to dragons, not to mention the notion that Earth’s primordial past was a vast fantasia of strange, preternatural beings.\nThat notion was driven home by another series of books that captivated Feld: The Lord of the Rings. J. R. R. Tolkien’s famed fantasy trilogy, plus its predecessor, The Hobbit, became the boy’s bible. It didn’t hurt that Feld was unnaturally small for his age, with cherubic cheeks, curly hair, and a twinkle in his eye, which surely caused him to empathize with Frodo, Bilbo, and the other hobbits of the Shire. (Even as an adult, Feld would never top five-foot-seven.) And of course, The Hobbit held a dragon—the fearsome, saurian behemoth that would continue to enthrall Feld after he grew up, changed his name, and remembered “A Sound of Thunder” when dubbing his band Tyrannosaurus Rex (later to be shortened to T. Rex).\nTyrannosaurus Rex formed in 1967, but Bolan—like Bowie—underwent some changes to get there. His first solo single under the name Marc Bolan was released in 1965; it flopped, but its title, “The Wizard,” more than hinted at Bolan’s unabashed adoration of fantasy literature. “Walking in the woods one day,” he sings, “I met a man who said that he was magic.” After observing the salient details of the mage’s appearance, including the “pointed hat upon his head” and the fact that “shadows followed him all around,” Bolan concludes the song with the eerie couplet, “Silver sunlight in his eyes / The wizard turned and melted in the sky.” Although not named, the song’s titular wizard is a dead ringer for Tolkien’s Gandalf.\nThe failure of “The Wizard,” as well as a brief stint in the rock band John’s Children, left Bolan directionless—that is, until he reinvented himself as the elfin shaman of the psychedelic folk duo Tyrannosaurus Rex. With percussionist Stephen Ross Porter—renamed Steve Peregrin Took in honor of the hobbit Peregrin Took from The Lord of the Rings—the twosome took the hippie aesthetic to a mystical extreme. The pair wore extravagant robes, sat cross-legged on stages as if initiating some sorcerous rite, and began crafting music that evoked the myths, legends, and creatures of some imaginary past. Albums titles such as 1968’s My People Were Fair and Had Sky in Their Hair but Now They’re Content to Wear Stars on Their Brows; 1968’s Prophets, Seers, and Sages, the Angels of the Ages; and 1969’s Unicorn drove home Bolan’s obsession with fantasy—one every ounce as powerful as Bowie’s obsession with science fiction, which was soon to become prominent with his 1969 smash “Space Oddity.” According to Peter Doggett’s book on Bowie, The Man Who Sold the World, Bolan claimed to have written part of “Space Oddity,” a claim that’s never been corroborated—although Bolan did play guitar on “Prettiest Star,” Bowie’s next single after “Space Oddity.”\nIn fact, Bolan and Bowie would end up working with the same producer, Tony Visconti—only Bolan came with a condition. He insisted that Visconti read Tolkien before working with him. As Visconti recounts in the 2007 BBC documentary Marc Bolan: The Final Word, Bolan told him, “I want you to read The Lord of the Rings. Read this if you want to know what I’m about.” But Bolan was more than simply obsessed; he was immersed. Visconti adds, “He actually lived [in Tolkien’s realm of Middle-earth]. In his mind, that all existed. He saw himself as maybe, possibly, a reincarnation of some bard or some wizard that lived in the time when elves walked the earth.” Coincidentally, or perhaps not, Bolan regularly performed in an English nightclub in the late ’60s called Middle Earth.\nBolan considered himself “a science fiction writer who sings,” presumably using the term “science fiction” as a catch-all for science fiction and fantasy, as was common at the time. He worked on an ultimately unrealized science-fiction rock opera, writing songs for it such as “Brain Police,” “Metropolis” (possibly a reference to Fritz Lang’s 1927 SF film of the same name, also a favorite of Bowie’s), and “Dynamo.” He even once told radio interviewer that he had numerous fantasy novels of his own in the works.\nOne such planned book, The Children of Rarn, never came to be, but Bolan had at least thought it through extensively. “It’s about prehistoric Earth,” he once explained, “before the dinosaurs were heavy creatures. There were two races of people then, the Peacelings and the Dworns, and a third group of beings called Lithons, all locked in complex, antagonistic relationships”—akin to some amalgam of H. G. Wells’ The Time Machine, with its Eloi and Morlocks, and Hammer Films’ popular prehistoric movies of the time, such as 1966’s One Million Years B.C. Years later, he claimed to have written a book of science fiction stories titled Wilderness of My Mind—and although the book has yet to surface, Bolan boastfully claimed that none other than Ray Bradbury, Bolan’s formative influence, had shown an interest in it.\nThat said, Bolan did publish a book. In 1969, his collection of fantasy poetry Warlock of Love—a title that might as well have described the robed, spellbinding, sensuous Bolan himself—was released, and it became a cult hit. “Dedicated to the woods of knowledge,” it began, and a typical snippet of the text reads like so:\nThe questical day had held all the promise of an artist,\nbut with the grey horseless cloud of the autumn\nafternoon all hope of starfields revealed was lost, as\na pebble of love in the black scorched deserts of\ncivilisation.\nAs a last hermetic gesture, with the masts of the\nday spent, the gaunt man, pure of skin but soiled\nof soul, prepared his parchment scroll and crouched\nlike a beggar began the last task of his day—an\netching of a child, blue skinned and shapen like a\nfowl of the skies, with eyes so true and hallowed\nthat the artition wept as he drew, and already the\nquest was begun.\nWhere Bowie peered forward with fear and wonder into humankind’s technological tomorrow, Bolan looked backward—even though his mention of “the black scorched deserts of civilization” in Warlock of Love alluded to a science-fantasy hybrid, one where an apocalypse, possibly atomic in origin, had cleared the world of science and left room for magic.\nThe arcadian, folklore-like aura that surrounded Bolan’s fantasy-themed music with Tyrannosaurus Rex didn’t reach the audience he’d hoped. In an attempt to appeal to a more universal listenership, the band’s 1970 album T. Rex tinkered with shorter, punchier, electrified songs. Bolan fired Took, hired a more conventional rock band, and shortened the group’s name to T. Rex. (Following Took’s ouster, the drummer formed a short-lived psychedelic group called Shagrat, named after an orc from The Lord of the Rings.)\nT. Rex went on to release anthems like “Get It On (Bang a Gong),” thus fulfilling Bolan’s ambitions of stardom. But even then, his swaggering riffs and daydream lyrics retained traces of Tyrannosaurus Rex’s fantastical vibe. In 1970, Bolan’s appearance as a guest guitarist on Bowie’s Venusian-populated song “Memory of a Free Festival” was not only one of the points where the two glam titans collided on tape, but where glam rock became a primary vessel for science fiction and fantasy in song—although in a campier, pulpier, more mysteriously playful way than the sober-faced adaptations of those genres happening at the same time in progressive rock. (Venus would pop up again in “Venus Loon,” a 1974 song from the T. Rex album Zinc Alloy and the Hidden Riders of Tomorrow, itself a cheeky nod to Bowie’s more famous fictional band, Ziggy Stardust and the Spiders from Mars.) At one point in the summer of 1974, Bowie and Bolan spent days in a hotel room binge-watching a print of A Clockwork Orange that they’d procured, a testament to just how much the science fiction of Stanley Kubrick and Anthony Burgess affected their work. In his book Electric Eden, Rob Young observes, “Bolan and Bowie were […] Pied Pipers […], transporting their young listeners from immersion in a speculative, mythological past and repositioning pop music in a future of plastic, glitter, and tin.”\nScience fiction continued to seep into Bolan’s fantasy. Smuggling in references to mythical creatures, space travel, and cosmic awe, T. Rex songs like 1971’s “Planet Queen” and the following year’s “Ballroom of Mars” lured listeners into a kaleidoscopic, science-fantasy universe of Bolan’s construction—all while evoking SF legends like Edgar Rice Burroughs, whose John Carter of Mars series similarly combined fantasy and science fiction into a staggeringly wondrous whole. No T. Rex album exemplifies this better than 1976’s Futuristic Dragon; the cover depicts Bolan—or a character closely resembling him—riding a smoke-bellowing dragon, like some Celtic warrior of yore going forth to vanquish the cold forces of anachronistic technocracy. (It was painted by the famed artist George Underwood, who was also responsible for the covers of Bowie’s Hunky Dory and Ziggy Stardust as well as numerous science fiction and fantasy novels.)\nFuturistic Dragon is by no means a concept album, let alone one entirely adhering to science-fantasy. Songs such as “Jupiter Liar” and “Theme for a Dragon,” however, conjure familiar SFF themes—although not as potently as the album’s opening track, “Futuristic Dragon (Introduction).” A piece of spoken-word poetry recited over Hendrix-meets-disco weirdness, it sums up Bolan’s fantasist fever-dream in a handful of compact, vivid lines:\nDeep beneath an ancient shadow\nStunned with age and too much wisdom\nReclined in glass, with eyes too steep\nRelentless dimensions of quadrophonic sleep\nDwelt the wild grinning cyclopean pagan\nScreaming destruction in sheer dazzling raiment\nA thunderbolt master, a ’lectronic savior\nA cold galactic raver, the Futuristic Dragon\nBolan’s untimely death in a car crash a year after Futuristic Dragon’s release left the sprawling saga that he wove throughout his songs tragically unfinished. Still, Bolan was able to lodge one last plea in favor of the literary genres he so passionately embodied. In his column in the British music magazine Record Mirror on September 10, 1977—six days before his death—he penned a glowing review of Star Wars, which he’d just seen. In it he wrote, “Now perhaps people will pay more attention to the science fiction field where so many great poets, writers, and musicians are lurking unsung.”\nLike George Lucas, Marc Bolan preached science fiction and fantasy to the masses. In an era before speculative fiction had become respected and embraced by the mainstream, he smuggled speculative fiction into more popular and palatable forms, easy to digest but still holding true to what makes SFF tick: imagination, spectacle, and a quest for understanding unrestrained by the mundane and banal. In an interview, Bolan was once asked what drove him to become a star—what kept him up there in the limelight besides the obvious worldly rewards of fame and fortune. His response: “On that stage, I’m at liberty. I’m in a realm of fantasy.”\nJason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "source": "https://clarkesworldmagazine.com/heller_12_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Dance with Futuristic Dragons: The Science-Fantasy Glamour of Marc Bolan and T. Rex by Jason Heller"}