{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Hao Jingfang; Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "sqJa+wUnLAbyCFQz0z9ABdLyH+E=", "id": null, "license": null, "comments": "", "raw_text": "2780 words, short story  The Loneliest Ward  At the nurses station, Qina and Auntie Han were the only two left on duty. Everyone else had already gone home, relief flooding their faces as they exited the ward.  Qina wasn’t her usual carefree self—but who could blame her? She was in the middle of a cold war with her boyfriend, after all. She was determined to not initiate any contact and to not pick up even if he called, though secretly she was watching his every move on the web and updating her own status with great deliberation. She was sure he couldn’t resist peeking.  She turned on the displays built into the shell of every piece of equipment: the counter, the sides of the filing cabinets, the casing of the medication cabinet . . . until photos and videos flowed over every surface, vivid web pages competed for space, and exaggerated smiles and star-gazing looks of melancholy appeared and disappeared, one after another, all parts of the silent, colorful wallpaper. Her personal web secretary was scouring the social networks, hunting for traces of Paul.  Auntie Han was away from the nurses station, checking up on the patients. Qina thought it a useless gesture. What was the point? The conditions of the patients never changed: they weren’t dead yet but hardly living. The more she saw of them, the more she found them tiresome. But Auntie Han never skipped the rounds. She was the sort who made sure she scraped out the last grain of rice in her bowl and who always knew where her hat and gloves could be found. Qina and she were from completely different worlds.  If sorrow were a kind of protein, who wants to be my digestive enzyme?  Qina chuckled at the status update she had drafted. Already, she was feeling better. Chewing on her pen, she pondered the next line.  Auntie Han came back. “Quick! Come with me. There’s a problem with patient 21.”  Unwilling to go, Qina continued to mull over her draft on the notepad. “What’s wrong?”  “Come! I’m worried he’s going into shock.”  “Whatever.” Qina tossed the pen down. “It’s always the same thing. Give it a rest.”  “I think we have to increase the dosage,” explained Auntie Han. “I need you to confirm my plan.”  The two left the nurses station and walked into the corridors of the ward. Qina set her web secretary on vibrate and put the phone back in her pocket. Carefully, she buttoned her white hospital coat, which she knew showed off her curves well.  The corridors were empty. Surgical carts and IV stands rested against the walls, while bags of medical waste were piled in the corners for collection. Two rows of bright white lights along the ceiling illuminated the drawings and photographs of human brains on the walls, evoking a horror-film atmosphere.  Qina tossed a piece of candy into her mouth. “I don’t get it. There’s nothing wrong with these people, but their families insist on bringing them here. It’s not as if they’re going to die if they stay put at home.”  Auntie Han kept her tone kind. “You can’t blame them for worrying. After all, they’re family. We have to be understanding.”  “Of course. You’re so full of compassion that you must be a living Buddha, and I’m just the mean yaksha.” Qina stuck her hands in the pockets of her hospital coat and fairly skipped down the stairs.  Auntie Han ignored her sarcasm. “We have all this sophisticated equipment here. And I’m sure the families feel better when professionally trained nurses are caring for their loved ones.”  “Oh please.” Qina laughed. “You think our shitty neurotransducers are sophisticated? Anyone can now afford a few electrodes and stick them on their heads. If they administered the treatments at home, maybe they’d get better results.”  “But we have the program that procedurally generates non-duplicative stimuli. The results are better.”  “What difference does it make if the ‘stimuli’ repeat? Do you really think they remember everything they get fed day after day? If you used a recording of a hundred ducks quacking I imagine the result would be the same.”  The two stopped in front of the recovery room. Auntie Han sighed.  “Sometimes they have no choice, you know. If multiple members of the family came down with it, everyone would be lying in bed, unable to take care of one another. They deserve compassion.”  Qina said nothing, though her expression remained defiant.  Auntie Han adjusted her glasses on the bridge of her nose and solemnly lectured her like a school headmaster. “The situation is quite serious, as I mentioned at the meeting last week. So many have contracted the condition that a significant portion of the population is now hospitalized. The more this spreads, the fewer chances there are for regular social interactions and care, and more people will be incapacitated. The end result of this vicious cycle is everyone in the hospital.  “The problem won’t go away if we ignore it. We’re dealing with a new form of social anxiety here that will continue to worsen unless there is adequate research. My monograph, the most extensive and serious attempt at scholarly analysis of the issue to date, is about to be published. I drew on some research from anxiety sociology. If you’re interested, I can show you the galleys next week after I get them—”  Qina looked behind Auntie Han, her expression one of shock. “Oh! Why is patient 20 sitting up?”  Auntie Han whipped around. “What!?”  “Oops, you missed it,” said Qina. “He’s lying down again.”  Auntie Han said nothing more. The two nurses entered the room. Casually, Qina turned on the displays on the cabinet doors and in the picture frames on the wall, filling them with her usual set of websites. Anxiously, she refreshed her feed and found two new replies, both reaction gifs from her girlfriends, but nothing from Paul. Rather annoyed, she slapped the fleshy bottom of her web secretary, sending it back into the sea of data to continue its hunt. Auntie Han, apparently displeased with the flickering lights that flooded the room, gestured for Qina to shut off the displays, but Qina pretended to not see her.  The two nurses first went to patient 21. Still unconscious, her body convulsed from time to time. One hand was held in front of her chest, two fingers curled tightly. Qina and Auntie Han helped her into a sitting position, wiped her mouth and face, massaged her arms, fed her some water, and gave her medication. Patient 21 was a plump woman in her forties, with sparse hair and smooth skin. Even sitting up, her eyes were closed. Qina remembered that she had been in a coma for a long time.  “What’s the point of even staying alive like this?” said Qina with a sigh.  “Living is living,” said Auntie Han. “She’s not that different from anyone else.”  “If I were like that, I’d kill myself,” said Qina. “To be dependent on others to stay alive . . . ugh, I’d rather be dead!”  “Everyone depends on everyone else to live,” said Auntie Han. “I wrote about this very concept in my book . . . ”  Just as they were about to connect the neurotransducer to patient 21, patient 20 suddenly wheezed as though he was suffocating. No matter how hard his lungs labored, he just couldn’t seem to get enough air. Patient 20 was a short man of rather homely appearance. But even in his coma, his family had tried to follow his grooming habits by keeping his hair brushed neatly to one side. His hands clutched at his paper gown like the lapels of a suit jacket. He continued to pant and heave, his brows furrowed, his expression one of pain and struggle. It took the two nurses a great deal of work to get him to lie down again and to attach the electrodes of the neurotransducer to his head. Once the machine was turned on and the stimuli waveforms flowed into his brain, he finally calmed down.  Patient 20’s symptoms were very typical. After first contracting the condition, many initially thought they were coming down with a respiratory disease, though no firm diagnosis could be made. Oxygen made no difference, and neither did the posture of the patient sitting or lying down. A few patients had died before someone finally thought of the neurotransducer and discovered the true nature of the disease: the respiratory symptoms were caused by a disorder in the brain.  The web secretary alerted Qina: Paul’s trail had been discovered on some woman’s page.  Qina raced to the display on the cabinet door and stared at Paul’s comment. It was literally nothing more than “Like.”  The woman wasn’t anyone they knew; rather, she was a celebrity, a spokesperson for a tech company, and rather popular on social media for her attempts at educating the public about new scientific discoveries and novel technologies. Paul often viewed her videos.  In reality, what the woman talked about in those videos made no difference. In Qina’s eyes, her most important asset was her beauty. The purpose of these videos in which she posed with cutting-edge products wasn’t to promote the products, but to show off her looks. Qina viewed the woman as a contemptible birdbrain addicted to the praise and attention of others, craving the spotlight. Yet, it was unbelievable how many people fed her vanity every day, giving her exactly what she wanted.  Trembling, Qina updated her own feed. The vain are despicable.  She focused on that “Like” from Paul again. Here they were, in the middle of the greatest fight ever for the very survival of their relationship, and instead of sending her pleas for forgiveness, Paul had had the temerity to go to some pretty woman’s page to post “Like.”  Qina fumed. Just look at the actual post from the woman that Paul was responding to! “New product announced: an invisibility cloak for the web so that you can hide from those bloodhound web secretaries.” How dare he! This is a slap in the face!  Unable to stop herself, she updated her status again. I’m so depressed I want to die. I’m going to feed on memories and drink acid.  She took it out on the web secretary, pounding and slapping its furry body. But the web secretary didn’t resist; it simply ran around the page, and every time it was cornered, it gazed up at her with round, watery eyes. She couldn’t bear to hit it anymore, and in rage she tossed the page away and returned to Auntie Han. The senior nurse had already wiped the faces of patients 22 and 23.  “It’s almost eleven,” said Auntie Han as she glanced at her watch. “I’ve got to check on the incubators in the lab. Why don’t you finish up here?”  She strode out of the room with her back ramrod straight. It was exactly eleven o’clock.  Left alone, Qina’s feeling of abandonment worsened. She wanted to cry, but a few dry sobs brought no tears. She stomped her foot, and her sense of grievance swelled, along with an empty silence in her heart. But the sense of being wronged couldn’t fill that hole. She turned off all the displays and the room dimmed. All the cabinets and walls returned to their habitual grayness, the metal surfaces cold and flat, like the unmoved distant presence of God, gazing at her from afar.  She roughly attached the electrodes helter-skelter to patients’ heads and flipped on the switches of the neurotransducers. She didn’t care if her terrible mood was going to affect the generated patterns at all. She had lost her boyfriend, so who cared what happened to a few comatose patients? Number 22 had once been a pretty movie star, but she aged so poorly that as soon as she was in her thirties no one cared about her anymore. Number 23 was an author of little note who devoted himself to waging war on others with his poisoned pen. He claimed that bestselling authors were frauds and that he alone was a great writer. His evidence? Kafka and Cao Xueqin had been unable to publish while alive, and he wasn’t getting published either. Q.E.D.  All the patients had their own personalized algorithms to generate just the patterns their brains craved. Qina glanced over the words scrolling up the screens on each of the neurotransducers to be sure that the correct stimuli were being fed into each brain.  “Wonderful! You’ve got to live your own life! You’re so beautiful! I made the healthy soup according to your recipe, and it was great! You’re such a beauty, zaftig and so sexy, a million times better than those ugly matchstick girls!” This was the stimuli fed to number 21. Patient 21 curled up in her bed, a look of sweet joy filling her face. Her heavy body rubbed against the sheets, wrinkling it. With some effort, Qina straightened the sheets again and wiped her mouth.  “My whole family are your biggest fans!!! We love hearing you speak, especially me! I think you’re the funniest man alive. I was going to kill myself, but you, you’ve given me strength and courage!” This was the stimuli for number 20. Patient 20 twitched and he thrust his hips up into the air excitedly, in time to the rhythm of the praise.  “Do you still remember me? I’ve been supporting you for more than a decade! You’re such a wonderful actress, far more skilled than those new starlets. What a degraded age we live in, but I’ll always remember you! You’re a classic! I love you!” This was for number 22. Patient 22 had always been relatively quiet. She continued to lie there with her eyes closed, the corners of her mouth curving up slightly. She raised her arms and stretched them out, like a statue of the Holy Mother.  “Keep it up! You’re the conscience of humanity, the bravest warrior! Illegitimi non carborundum! To waste time with them will only lower your intelligence. They’re nothing. They attack you only because you speak the truth. History will remember you!” This was for number 23. Instead of simply passively receiving his stimuli, he was constantly muttering something, echoing the tone and rhythm of the words fed into his mind. Qina couldn’t hear what he was saying exactly, but she knew that he was trying to repeat some argument in various languages and using different words. He seemed to be constantly on the attack, and the neurotransducer’s signals only urged him on more.  By the time she was finished with everyone, it was after midnight. Exhausted, she sat down on an empty bed, heart as tired as her body. She felt like the last living person in the world. The room, full of featureless, smooth metal, reflected her monotonous mood. She took out her phone and refreshed her feed. There were no new replies; perhaps everyone had gone to bed. Still no new traces of Paul. Helplessly, she sat in the middle of the ward, and the gray walls and floor seemed to be the whole universe.  Why shouldn’t I try it once? she thought. Just once.  She lay down on the bed and attached a few electrodes to her forehead. Closing her eyes, she pressed the maroon button on the machine.  The neurotransducer hummed, scanning her thoughts. Then, she heard the hypnotic words streaming into her mind, like a dear friend trying to make her feel better, or perhaps like a trusted counselor trying to guide her with wisdom. Her heart relaxed as though it had been massaged, and as her breathing smoothed out, the gray hospital ward disappeared from her vision.  She saw a dew-dappled lawn in morning sunlight.  “You are a person of depth, and the shallow can’t understand you!” The voice echoed in her mind, so confident-sounding that what it said could not be doubted. “You are far more beautiful than those shallow girls, but you despise their narcissism. The vain are despicable, and those who live by appearances will eventually find themselves hated. You are so much deeper than they are, and those who love you will eventually understand this truth.”  Qina’s heart quieted, and the world seemed so full and alive. Paul was a nobody, less than a nobody. She wasn’t sure if she was asleep or awake, but she loved the vibrant green spread all around her in the sun.  Suspended on the border between sleep and wakefulness, she thought, it’s not so bad to live like this forever, is it?    Originally published in Chinese in Science Fiction World, April 2013.    Translated and published in partnership with Storycom.  Born in 1984 in Tianjin, Hao Jingfang graduated in 2006 from the Tsinghua University, majoring in physics. In addition she also studied Astrophysics at Tsinghua Centre, ultimately earning a PhD from the School of Economics and Management. As a student, she won first prize in the fourth New Concept writing competition and the first Novoland essay contest. The English translation of her short story \"Folding Beijing\" earned Hao her first Hugo Award for Best Novelette at the 74th World Science Fiction Convention in 2016. Her published work includes two full-length novels, Wandering Earth and Born in 1984, short stories collections The Depth of Loneliness and To Go the Distance, and the essay collection Europe within Time.  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "2780 words, short story\nThe Loneliest Ward\nAt the nurses station, Qina and Auntie Han were the only two left on duty. Everyone else had already gone home, relief flooding their faces as they exited the ward.\nQina wasn’t her usual carefree self—but who could blame her? She was in the middle of a cold war with her boyfriend, after all. She was determined to not initiate any contact and to not pick up even if he called, though secretly she was watching his every move on the web and updating her own status with great deliberation. She was sure he couldn’t resist peeking.\nShe turned on the displays built into the shell of every piece of equipment: the counter, the sides of the filing cabinets, the casing of the medication cabinet . . . until photos and videos flowed over every surface, vivid web pages competed for space, and exaggerated smiles and star-gazing looks of melancholy appeared and disappeared, one after another, all parts of the silent, colorful wallpaper. Her personal web secretary was scouring the social networks, hunting for traces of Paul.\nAuntie Han was away from the nurses station, checking up on the patients. Qina thought it a useless gesture. What was the point? The conditions of the patients never changed: they weren’t dead yet but hardly living. The more she saw of them, the more she found them tiresome. But Auntie Han never skipped the rounds. She was the sort who made sure she scraped out the last grain of rice in her bowl and who always knew where her hat and gloves could be found. Qina and she were from completely different worlds.\nIf sorrow were a kind of protein, who wants to be my digestive enzyme?\nQina chuckled at the status update she had drafted. Already, she was feeling better. Chewing on her pen, she pondered the next line.\nAuntie Han came back. “Quick! Come with me. There’s a problem with patient 21.”\nUnwilling to go, Qina continued to mull over her draft on the notepad. “What’s wrong?”\n“Come! I’m worried he’s going into shock.”\n“Whatever.” Qina tossed the pen down. “It’s always the same thing. Give it a rest.”\n“I think we have to increase the dosage,” explained Auntie Han. “I need you to confirm my plan.”\nThe two left the nurses station and walked into the corridors of the ward. Qina set her web secretary on vibrate and put the phone back in her pocket. Carefully, she buttoned her white hospital coat, which she knew showed off her curves well.\nThe corridors were empty. Surgical carts and IV stands rested against the walls, while bags of medical waste were piled in the corners for collection. Two rows of bright white lights along the ceiling illuminated the drawings and photographs of human brains on the walls, evoking a horror-film atmosphere.\nQina tossed a piece of candy into her mouth. “I don’t get it. There’s nothing wrong with these people, but their families insist on bringing them here. It’s not as if they’re going to die if they stay put at home.”\nAuntie Han kept her tone kind. “You can’t blame them for worrying. After all, they’re family. We have to be understanding.”\n“Of course. You’re so full of compassion that you must be a living Buddha, and I’m just the mean yaksha.” Qina stuck her hands in the pockets of her hospital coat and fairly skipped down the stairs.\nAuntie Han ignored her sarcasm. “We have all this sophisticated equipment here. And I’m sure the families feel better when professionally trained nurses are caring for their loved ones.”\n“Oh please.” Qina laughed. “You think our shitty neurotransducers are sophisticated? Anyone can now afford a few electrodes and stick them on their heads. If they administered the treatments at home, maybe they’d get better results.”\n“But we have the program that procedurally generates non-duplicative stimuli. The results are better.”\n“What difference does it make if the ‘stimuli’ repeat? Do you really think they remember everything they get fed day after day? If you used a recording of a hundred ducks quacking I imagine the result would be the same.”\nThe two stopped in front of the recovery room. Auntie Han sighed.\n“Sometimes they have no choice, you know. If multiple members of the family came down with it, everyone would be lying in bed, unable to take care of one another. They deserve compassion.”\nQina said nothing, though her expression remained defiant.\nAuntie Han adjusted her glasses on the bridge of her nose and solemnly lectured her like a school headmaster. “The situation is quite serious, as I mentioned at the meeting last week. So many have contracted the condition that a significant portion of the population is now hospitalized. The more this spreads, the fewer chances there are for regular social interactions and care, and more people will be incapacitated. The end result of this vicious cycle is everyone in the hospital.\n“The problem won’t go away if we ignore it. We’re dealing with a new form of social anxiety here that will continue to worsen unless there is adequate research. My monograph, the most extensive and serious attempt at scholarly analysis of the issue to date, is about to be published. I drew on some research from anxiety sociology. If you’re interested, I can show you the galleys next week after I get them—”\nQina looked behind Auntie Han, her expression one of shock. “Oh! Why is patient 20 sitting up?”\nAuntie Han whipped around. “What!?”\n“Oops, you missed it,” said Qina. “He’s lying down again.”\nAuntie Han said nothing more. The two nurses entered the room. Casually, Qina turned on the displays on the cabinet doors and in the picture frames on the wall, filling them with her usual set of websites. Anxiously, she refreshed her feed and found two new replies, both reaction gifs from her girlfriends, but nothing from Paul. Rather annoyed, she slapped the fleshy bottom of her web secretary, sending it back into the sea of data to continue its hunt. Auntie Han, apparently displeased with the flickering lights that flooded the room, gestured for Qina to shut off the displays, but Qina pretended to not see her.\nThe two nurses first went to patient 21. Still unconscious, her body convulsed from time to time. One hand was held in front of her chest, two fingers curled tightly. Qina and Auntie Han helped her into a sitting position, wiped her mouth and face, massaged her arms, fed her some water, and gave her medication. Patient 21 was a plump woman in her forties, with sparse hair and smooth skin. Even sitting up, her eyes were closed. Qina remembered that she had been in a coma for a long time.\n“What’s the point of even staying alive like this?” said Qina with a sigh.\n“Living is living,” said Auntie Han. “She’s not that different from anyone else.”\n“If I were like that, I’d kill myself,” said Qina. “To be dependent on others to stay alive . . . ugh, I’d rather be dead!”\n“Everyone depends on everyone else to live,” said Auntie Han. “I wrote about this very concept in my book . . . ”\nJust as they were about to connect the neurotransducer to patient 21, patient 20 suddenly wheezed as though he was suffocating. No matter how hard his lungs labored, he just couldn’t seem to get enough air. Patient 20 was a short man of rather homely appearance. But even in his coma, his family had tried to follow his grooming habits by keeping his hair brushed neatly to one side. His hands clutched at his paper gown like the lapels of a suit jacket. He continued to pant and heave, his brows furrowed, his expression one of pain and struggle. It took the two nurses a great deal of work to get him to lie down again and to attach the electrodes of the neurotransducer to his head. Once the machine was turned on and the stimuli waveforms flowed into his brain, he finally calmed down.\nPatient 20’s symptoms were very typical. After first contracting the condition, many initially thought they were coming down with a respiratory disease, though no firm diagnosis could be made. Oxygen made no difference, and neither did the posture of the patient sitting or lying down. A few patients had died before someone finally thought of the neurotransducer and discovered the true nature of the disease: the respiratory symptoms were caused by a disorder in the brain.\nThe web secretary alerted Qina: Paul’s trail had been discovered on some woman’s page.\nQina raced to the display on the cabinet door and stared at Paul’s comment. It was literally nothing more than “Like.”\nThe woman wasn’t anyone they knew; rather, she was a celebrity, a spokesperson for a tech company, and rather popular on social media for her attempts at educating the public about new scientific discoveries and novel technologies. Paul often viewed her videos.\nIn reality, what the woman talked about in those videos made no difference. In Qina’s eyes, her most important asset was her beauty. The purpose of these videos in which she posed with cutting-edge products wasn’t to promote the products, but to show off her looks. Qina viewed the woman as a contemptible birdbrain addicted to the praise and attention of others, craving the spotlight. Yet, it was unbelievable how many people fed her vanity every day, giving her exactly what she wanted.\nTrembling, Qina updated her own feed. The vain are despicable.\nShe focused on that “Like” from Paul again. Here they were, in the middle of the greatest fight ever for the very survival of their relationship, and instead of sending her pleas for forgiveness, Paul had had the temerity to go to some pretty woman’s page to post “Like.”\nQina fumed. Just look at the actual post from the woman that Paul was responding to! “New product announced: an invisibility cloak for the web so that you can hide from those bloodhound web secretaries.” How dare he! This is a slap in the face!\nUnable to stop herself, she updated her status again. I’m so depressed I want to die. I’m going to feed on memories and drink acid.\nShe took it out on the web secretary, pounding and slapping its furry body. But the web secretary didn’t resist; it simply ran around the page, and every time it was cornered, it gazed up at her with round, watery eyes. She couldn’t bear to hit it anymore, and in rage she tossed the page away and returned to Auntie Han. The senior nurse had already wiped the faces of patients 22 and 23.\n“It’s almost eleven,” said Auntie Han as she glanced at her watch. “I’ve got to check on the incubators in the lab. Why don’t you finish up here?”\nShe strode out of the room with her back ramrod straight. It was exactly eleven o’clock.\nLeft alone, Qina’s feeling of abandonment worsened. She wanted to cry, but a few dry sobs brought no tears. She stomped her foot, and her sense of grievance swelled, along with an empty silence in her heart. But the sense of being wronged couldn’t fill that hole. She turned off all the displays and the room dimmed. All the cabinets and walls returned to their habitual grayness, the metal surfaces cold and flat, like the unmoved distant presence of God, gazing at her from afar.\nShe roughly attached the electrodes helter-skelter to patients’ heads and flipped on the switches of the neurotransducers. She didn’t care if her terrible mood was going to affect the generated patterns at all. She had lost her boyfriend, so who cared what happened to a few comatose patients? Number 22 had once been a pretty movie star, but she aged so poorly that as soon as she was in her thirties no one cared about her anymore. Number 23 was an author of little note who devoted himself to waging war on others with his poisoned pen. He claimed that bestselling authors were frauds and that he alone was a great writer. His evidence? Kafka and Cao Xueqin had been unable to publish while alive, and he wasn’t getting published either. Q.E.D.\nAll the patients had their own personalized algorithms to generate just the patterns their brains craved. Qina glanced over the words scrolling up the screens on each of the neurotransducers to be sure that the correct stimuli were being fed into each brain.\n“Wonderful! You’ve got to live your own life! You’re so beautiful! I made the healthy soup according to your recipe, and it was great! You’re such a beauty, zaftig and so sexy, a million times better than those ugly matchstick girls!” This was the stimuli fed to number 21. Patient 21 curled up in her bed, a look of sweet joy filling her face. Her heavy body rubbed against the sheets, wrinkling it. With some effort, Qina straightened the sheets again and wiped her mouth.\n“My whole family are your biggest fans!!! We love hearing you speak, especially me! I think you’re the funniest man alive. I was going to kill myself, but you, you’ve given me strength and courage!” This was the stimuli for number 20. Patient 20 twitched and he thrust his hips up into the air excitedly, in time to the rhythm of the praise.\n“Do you still remember me? I’ve been supporting you for more than a decade! You’re such a wonderful actress, far more skilled than those new starlets. What a degraded age we live in, but I’ll always remember you! You’re a classic! I love you!” This was for number 22. Patient 22 had always been relatively quiet. She continued to lie there with her eyes closed, the corners of her mouth curving up slightly. She raised her arms and stretched them out, like a statue of the Holy Mother.\n“Keep it up! You’re the conscience of humanity, the bravest warrior! Illegitimi non carborundum! To waste time with them will only lower your intelligence. They’re nothing. They attack you only because you speak the truth. History will remember you!” This was for number 23. Instead of simply passively receiving his stimuli, he was constantly muttering something, echoing the tone and rhythm of the words fed into his mind. Qina couldn’t hear what he was saying exactly, but she knew that he was trying to repeat some argument in various languages and using different words. He seemed to be constantly on the attack, and the neurotransducer’s signals only urged him on more.\nBy the time she was finished with everyone, it was after midnight. Exhausted, she sat down on an empty bed, heart as tired as her body. She felt like the last living person in the world. The room, full of featureless, smooth metal, reflected her monotonous mood. She took out her phone and refreshed her feed. There were no new replies; perhaps everyone had gone to bed. Still no new traces of Paul. Helplessly, she sat in the middle of the ward, and the gray walls and floor seemed to be the whole universe.\nWhy shouldn’t I try it once? she thought. Just once.\nShe lay down on the bed and attached a few electrodes to her forehead. Closing her eyes, she pressed the maroon button on the machine.\nThe neurotransducer hummed, scanning her thoughts. Then, she heard the hypnotic words streaming into her mind, like a dear friend trying to make her feel better, or perhaps like a trusted counselor trying to guide her with wisdom. Her heart relaxed as though it had been massaged, and as her breathing smoothed out, the gray hospital ward disappeared from her vision.\nShe saw a dew-dappled lawn in morning sunlight.\n“You are a person of depth, and the shallow can’t understand you!” The voice echoed in her mind, so confident-sounding that what it said could not be doubted. “You are far more beautiful than those shallow girls, but you despise their narcissism. The vain are despicable, and those who live by appearances will eventually find themselves hated. You are so much deeper than they are, and those who love you will eventually understand this truth.”\nQina’s heart quieted, and the world seemed so full and alive. Paul was a nobody, less than a nobody. She wasn’t sure if she was asleep or awake, but she loved the vibrant green spread all around her in the sun.\nSuspended on the border between sleep and wakefulness, she thought, it’s not so bad to live like this forever, is it?\nOriginally published in Chinese in Science Fiction World, April 2013.\nTranslated and published in partnership with Storycom.\nBorn in 1984 in Tianjin, Hao Jingfang graduated in 2006 from the Tsinghua University, majoring in physics. In addition she also studied Astrophysics at Tsinghua Centre, ultimately earning a PhD from the School of Economics and Management. As a student, she won first prize in the fourth New Concept writing competition and the first Novoland essay contest. The English translation of her short story \"Folding Beijing\" earned Hao her first Hugo Award for Best Novelette at the 74th World Science Fiction Convention in 2016. Her published work includes two full-length novels, Wandering Earth and Born in 1984, short stories collections The Depth of Loneliness and To Go the Distance, and the essay collection Europe within Time.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/hao_08_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Loneliest Ward by Hao Jingfang, translated by Ken Liu"}