{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mark Cole", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "4ryPt2+Z7zEmHaSgA83ry5uhR/4=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Why Science Fiction Detective Stories Aren't Impossible  Perhaps it wouldn’t have been as bad without all the buildup.  Episode after episode, Doctor Who regaled us with stories about Madame Vastra, a reptilian Silurian living in Victorian England, and her prodigious detective skills: The police always went to her with their difficult cases. She was the basis for all those stories about Sherlock Holmes.  And after several seasons of being told about her talents, the moment finally came when the police called her in and we got to see her incredible Holmesian deductive skills at work.  She pulled a gadget out of her bag and it told her everything she needed to know except the villain’s phone number.  That faint rumbling sound you could hear in the background was Isaac Asimov rolling in his grave.  This all started with someone telling Asimov that he couldn’t do something.  A lot of things start that way. Nothing spurs creativity so much as telling someone that a thing is impossible.  But at the time, it certainly looked that way. You could find science fictional versions of classic types of stories like adventure, romance, and even sports, but you couldn’t find any science fiction mystery stories. And, what’s more, it was generally agreed that they wouldn’t work.  As he put it in his introduction to Asimov’s Mysteries (1968), “Back in the late forties, this was finally explained to me. I was told that ‘by its very nature’ science fiction would not play fair with the reader . . . the detective could say ‘But as you know, Watson, ever since 2175, when all Spaniards learned to speak French, Spanish has been a dead language. How came Juan Lopez, then, to speak those significant words in Spanish?’”  “Or he could have his detective whip out an odd device and say ‘As you know, Watson, my pocket-frannistan is perfectly capable of finding the missing jewel in a trice.’”  However, none of this was exactly new. Practically from the first, unguessable clues and deus ex machina solutions had appeared in mystery stories (including a few by the best writers out there). Nor was there a shortage of supposedly scientific detectives, like R. Austin Freeman’s Dr. Thorndyke, or the endless, pulpy adventures of Craig Kennedy. The real question was whether an author was willing to play fair with his audience. If he provided whatever information about his future world that the reader needed to solve the puzzle and made sure that he detailed any necessary scientific information unknown to the general reader then Asimov could see no reason it was impossible.  So, in 1953, he set out to prove everyone wrong.  The result was The Caves of Steel (1953), a novel set in an overcrowded underground city in Earth’s future. A scientist from one of the outer colonies has been murdered and Lije Bailey has been assigned to the case with a new partner, R. Daneel Olivaw, from the victim’s home planet. Only Daneel is an android, in a society that hates robots.  Lije goes about his work like any fictional detective, gathering clues and questioning witnesses. We have a familiar odd couple partnership, mildly skewed by the fact that one of them is a robot. As strange as the society in which the crime takes place may be, the suspects have familiar motivations and passions. And, while the killer’s motive is one that has much to do with the fictional time and circumstances, it is still familiar enough to be believable.  The critics loved it. It won praise both as an excellent science fiction novel and a well-written mystery. It sold well, too, and remains one of Asimov’s most highly regarded novels. In 1957, he released a sequel, The Naked Sun, just to prove his first attempt wasn’t a fluke. This time, Lije travels to the colonies, to solve a mystery on a supposedly “perfect” world, where the human population lives isolated from each other, tended by a far larger number of robot servants.  Asimov wanted to write another novel at the time, which would have taken Lije to Daneel’s home world, where man and robots lived in balance. But he wrote other things instead, and didn’t return to Lije and Daneel for twenty-six years.  However, Caves of Steel wasn’t the first novel to mix science fiction with detection. In January of 1952, Alfred Bester began serializing The Demolished Man in Galaxy Magazine: book publication followed a year later, as Asimov was writing The Caves of Steel. It went on to win the first Hugo award for best novel.  How do you get away with murder in a society where they can read your mind?  Science has learned how to recognize innate psychic talents, which can be developed with proper training. Business, industry, and government all hire telepaths—“Espers”—for sensitive and confidential jobs. However, Espers must obey the rules of their Guild, which forbids reading the thoughts of those around them indiscriminately, although those working for the police have far more latitude.  Ben Reich tries to find a way to eliminate his largest rival, knowing that he will be demolished if caught. The detective investigating the crime suspects him immediately, but can’t prove it.  The inverted detective story, where the audience knows from the start who is guilty, and the suspense lays in whether or not the detective will catch him—and how—wasn’t invented by Columbo. It had been around for forty years at the time Bester’s novel came out. However, Bester made it far more complex, as Reich not only has to screen his thoughts from the “peepers,” but also act spontaneously without premeditation.  Yet there is an even earlier science fiction detective novel: Hal Clement’s Needle (1950) is told from the perspective of an alien symbiote cop, who crash-lands on Earth while chasing a similar creature. We watch while he finds a new host and learns how to communicate with him. Then the two must figure out how to identify which one of the many people living on their island is unwittingly carrying the dangerous fugitive.  Ironically, it has almost the same origin as The Caves of Steel (and considering that Asimov doesn’t say who told him he couldn’t write a science fiction mystery, perhaps the same): in a 1953 letter, the legendary editor of Astounding Magazine, John W. Campbell told Hal, “Once upon a time I told you ‘Science Fiction detective stories don’t work—you can’t write a good one.’ So you proved that I was wrong in that, and wrote Needle.”  But perhaps that wasn’t the first science fiction detective story either. In 1948, Jack Vance began a series about Magnus Ridolph, the first of his many “effectuator” characters. Part private detective, part troubleshooter, part con man, many of the stories about Ridolph fall under the general heading of detective stories, starting with the second, “The Unspeakable McInch” (1948). Another half dozen stories about Ridolph followed.  Whoever you chose to blame, there was no longer any doubt: the two genres could combine—and with interesting results.  While Bester never returned to the science fiction detective story, Asimov also created an “armchair detective,” Wendell Urth, for a series of short stories. He continued writing mystery stories, both future and present, throughout his career. He would eventually write the long-promised third Lije Bailey novel, The Robots of Dawn (1983) as the first of many sequels to his better-known books. However, it seemed to lack something, perhaps because Daneel—who had been portrayed as nearly human in the original novels—was now more of a machine, thanks in part to a new telepathic robot character (the sixty-three-year-old Asimov also spent an inordinate amount of space describing the bathrooms!).  The sequel, Robots and Empire (1985), connected it to the Foundation series, but wasn’t a mystery.  Hal Clement didn’t write many other science fiction mysteries, but his 1978 sequel, Through the Eye of a Needle, does eventually turn into a detective story.  Jack Vance continued to combine detective, crime, and mystery elements with many of his stories, not only in the adventures of effectuators like Ridolph and Miro Hetzel, but in many of his other stories and series. One notes, for example, IPCC agent Glawen Clattuc in the Cadwall series, and that Kirth Gersen frequently has to act as a detective in his epic quest for revenge in the Demon Princes novels.  Vance set himself some truly difficult and unique challenges in many of these stories: perhaps the most memorable was “The Moon Moth”, where a detective must find an escaped murderer in a society whose natives never show their faces, covering them with ceremonial masks chosen to reflect both their mood and status. His final novel, Lurulu (2004) includes a mystery among its many plot threads. It seems a fitting end for a long and distinguished career.  However, other authors soon picked up the challenge. One of the first was Randall Garrett. While he isn’t as well remembered as his friends Asimov and Robert Silverberg, Garrett was one of the leading genre short story writers of the era. His breakthrough 1954 story, “The Hunting Lodge” was a spy thriller with mystery elements. He would fuse detection with many of his stories, including several that he wrote with Silverberg as “Robert Randall.”  He combined detection with the Asimovian robot story in his 1962 novel, Unwise Child, which hinges on one of the most unusual science fiction notions ever conceived: a book of theology. Garrett followed it with a series by “Mark Phillips” (with Laurence M. Janifer) about “The Queens Own FBI.” These featured the screwball adventures of hard-drinking FBI agent Kenneth J. Malone (based on Craig Rice’s John J. Malone) who had to deal with telepaths, teleporting criminals, and a boss who thinks she’s Queen Elizabeth. The books are brisk and funny, but at the same time well-written mysteries which catch Rice’s unique voice.  It was another challenge—this time by Isaac Asimov himself—that led to the creation of Garrett’s most famous detective: when Asimov declared that it was impossible to write a mystery set in a fantasy world dominated by magic, Garrett wrote Too Many Magicians. It features Lord Darcy, a dashing, John Dickson Carr hero from an alternate Earth where they discovered the rules of magic instead of science.  Sadly, though, his final, unfinished novel (completed by his wife) resorts to previously undisclosed psychic powers to explain its locked room mystery.  In 1957, Lloyd Biggle Jr. entered the field with one of his first published stories, “Chronus of the D.F.C.” New York City’s newly established “Department of Future Crime” has a machine which lets them see future events. But can they use it to stop a murder before it happens? (the story bears a strong resemblance to Philip K. Dick’s Minority Report, enough to suggest Dick may have read it).  He then launched a series starring a character who may have been the first recurring Detective hero in science fiction novels: Jan Darzek. Jan was New York City-based Private Detective, whose latest case in All the Colors of Darkness (1963) involves passengers who have vanished from an experimental teleporter and visitors from other worlds. His second case, Watchers of the Dark (1966) takes him from Earth to solve a mystery for the Galactic Government.  His cases, however, in the three books that followed gradually move further from a straightforward mystery story, and Jan does Tom Clancy’s Jack Ryan one better and becomes the President of the Galaxy.  While the first version of his story, “ARM,” was one of the earliest stories Larry Niven wrote, it took him a decade of writing SF stories involving crime and detection before he could finish it. Gil Hamilton, an agent of the elite global police force, ARM, is a hard-boiled cop from an overcrowded future with a telekinetic “third arm.” He first appeared in print in 1968, but despite the fact that he is one of Niven’s favorite characters, he has only starred in four short stories and a novel, The Patchwork Girl. As he put it in the introduction to his collection Flatlander: “If I like him so freezing much, why not write more stories? Because following two sets of rules is hard work, that’s why.”  It wasn’t just the SF magazines that published these stories: many appeared in mystery magazines. A few editors, like Frederic Dannay and Hans Stefan Santesson, seemed particularly open to them.  To date, however, only one science fiction novel, Ron Goulart’s After Things Fell Apart, has been nominated for the prestigious Mystery Writers of America annual award, the Edgar. It is set in a chaotic future where the United States has come completely apart at the seams and Jim Haley, a PI, has to navigate the absurd obstacles of the many enclaves ruling the San Francisco Bay Area while trying to solve a series of murders. The incredibly prolific Goulart, one of the great absurdists, has gleefully combined science fiction, mystery and comedy in most of his books (It is interesting to note that he also ghosted William Shatner’s Private Eye series, Tek War).  Gradually more and more authors attempted the combination: among others John Brunner (Enigma from Tantalus), Philip K. Dick, Poul Anderson, Glen Cook, William Gibson and Gene Wolfe. There was even a hard-boiled detective paperback original series (Mack Swain) by Mike McQuay (He also wrote a mystery about a man murdered in a city of three-laws robots for Asimov’s Robot City series).  Fantasy efforts included Avram Davidson’s The Enquiries of Doctor Eszterhazy, and Cook’s hard-boiled Garrett, PI series.  The idea has become common enough one hardly notices it anymore. Not even when a major mystery writer, Nora Roberts, launched a mystery series in the near future under her J. D. Robb pseudonym, and marketed them as mainstream detective stories.  But then something changed in the world of the mystery.  Or perhaps it was two things.  On the one hand, there was a general shift in the market. Fewer and fewer mysteries relied heavily on detection. Carefully constructed puzzles, logical deduction, and devious clues gave way to thrillers, mysterious informants, and heroes who stumbled on the answer by the end of the book.  On the other, there is the rise of CSI and its host of imitators, with their emphasis on forensic technology. While this might seem at first glance a return to the older, deduction-heavy approach, mixed with a bit of science, in practice it turned out rather differently. The forensic scientists on CSI could somehow enhance pictures beyond the point where they were reduced to individual pixels. Only a few of the largest research institutes in the world had the equipment they just happened to have in their tiny labs. They could produce incredibly detailed results from the most absurdly minimal samples. In one episode of NCIS, Abby, the resident lab genius, proves a man was murdered on the basis of some tiny specks of foreign material visible on the nano level. Let’s see that hold up in court!  It was the greatest excuse for lazy mystery writing ever.  And exactly like what the naysayers had said about science fiction in the forties.  Far worse, this image of incredible technical prowess had some very negative effects on the real world, where juries ignored perfectly good scientific evidence because it wasn’t as incredible as what they’d seen on last week’s CSI—and where convictions have been overturned because juries have been dazzled by highly dubious forensic evidence.  One almost suspects that for the average viewer, there is no difference between real science and that pocket-frannistan.  The irony here is that a character who was the real inspiration for Sherlock Holmes should be a lazy writer’s dream. After all, Conan Doyle provided us with nine books worth of Holmesian deductions, which could easily be repurposed, rewritten—or even stolen wholesale—for Vastra’s adventures (which we would naturally expect to resemble Doyle’s “fictionalized” versions).  But, even for those willing to work hard at it, the challenge remains a difficult one.  John H. Campbell would often take a position he didn’t hold just to force his writers to think. One suspects that he deliberately set out to inspire Hal Clement (and perhaps Asimov and others in his stable of writers as well) to explore something that would be extremely difficult to pull off—but quite interesting if they succeeded.  The result was a rich addition to science fiction literature, full of new and unexplored possibilities. However poor the results might be in the hands of the lazy. Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "text": "Non-Fiction\nWhy Science Fiction Detective Stories Aren't Impossible\nPerhaps it wouldn’t have been as bad without all the buildup.\nEpisode after episode, Doctor Who regaled us with stories about Madame Vastra, a reptilian Silurian living in Victorian England, and her prodigious detective skills: The police always went to her with their difficult cases. She was the basis for all those stories about Sherlock Holmes.\nAnd after several seasons of being told about her talents, the moment finally came when the police called her in and we got to see her incredible Holmesian deductive skills at work.\nShe pulled a gadget out of her bag and it told her everything she needed to know except the villain’s phone number.\nThat faint rumbling sound you could hear in the background was Isaac Asimov rolling in his grave.\nThis all started with someone telling Asimov that he couldn’t do something.\nA lot of things start that way. Nothing spurs creativity so much as telling someone that a thing is impossible.\nBut at the time, it certainly looked that way. You could find science fictional versions of classic types of stories like adventure, romance, and even sports, but you couldn’t find any science fiction mystery stories. And, what’s more, it was generally agreed that they wouldn’t work.\nAs he put it in his introduction to Asimov’s Mysteries (1968), “Back in the late forties, this was finally explained to me. I was told that ‘by its very nature’ science fiction would not play fair with the reader . . . the detective could say ‘But as you know, Watson, ever since 2175, when all Spaniards learned to speak French, Spanish has been a dead language. How came Juan Lopez, then, to speak those significant words in Spanish?’”\n“Or he could have his detective whip out an odd device and say ‘As you know, Watson, my pocket-frannistan is perfectly capable of finding the missing jewel in a trice.’”\nHowever, none of this was exactly new. Practically from the first, unguessable clues and deus ex machina solutions had appeared in mystery stories (including a few by the best writers out there). Nor was there a shortage of supposedly scientific detectives, like R. Austin Freeman’s Dr. Thorndyke, or the endless, pulpy adventures of Craig Kennedy. The real question was whether an author was willing to play fair with his audience. If he provided whatever information about his future world that the reader needed to solve the puzzle and made sure that he detailed any necessary scientific information unknown to the general reader then Asimov could see no reason it was impossible.\nSo, in 1953, he set out to prove everyone wrong.\nThe result was The Caves of Steel (1953), a novel set in an overcrowded underground city in Earth’s future. A scientist from one of the outer colonies has been murdered and Lije Bailey has been assigned to the case with a new partner, R. Daneel Olivaw, from the victim’s home planet. Only Daneel is an android, in a society that hates robots.\nLije goes about his work like any fictional detective, gathering clues and questioning witnesses. We have a familiar odd couple partnership, mildly skewed by the fact that one of them is a robot. As strange as the society in which the crime takes place may be, the suspects have familiar motivations and passions. And, while the killer’s motive is one that has much to do with the fictional time and circumstances, it is still familiar enough to be believable.\nThe critics loved it. It won praise both as an excellent science fiction novel and a well-written mystery. It sold well, too, and remains one of Asimov’s most highly regarded novels. In 1957, he released a sequel, The Naked Sun, just to prove his first attempt wasn’t a fluke. This time, Lije travels to the colonies, to solve a mystery on a supposedly “perfect” world, where the human population lives isolated from each other, tended by a far larger number of robot servants.\nAsimov wanted to write another novel at the time, which would have taken Lije to Daneel’s home world, where man and robots lived in balance. But he wrote other things instead, and didn’t return to Lije and Daneel for twenty-six years.\nHowever, Caves of Steel wasn’t the first novel to mix science fiction with detection. In January of 1952, Alfred Bester began serializing The Demolished Man in Galaxy Magazine: book publication followed a year later, as Asimov was writing The Caves of Steel. It went on to win the first Hugo award for best novel.\nHow do you get away with murder in a society where they can read your mind?\nScience has learned how to recognize innate psychic talents, which can be developed with proper training. Business, industry, and government all hire telepaths—“Espers”—for sensitive and confidential jobs. However, Espers must obey the rules of their Guild, which forbids reading the thoughts of those around them indiscriminately, although those working for the police have far more latitude.\nBen Reich tries to find a way to eliminate his largest rival, knowing that he will be demolished if caught. The detective investigating the crime suspects him immediately, but can’t prove it.\nThe inverted detective story, where the audience knows from the start who is guilty, and the suspense lays in whether or not the detective will catch him—and how—wasn’t invented by Columbo. It had been around for forty years at the time Bester’s novel came out. However, Bester made it far more complex, as Reich not only has to screen his thoughts from the “peepers,” but also act spontaneously without premeditation.\nYet there is an even earlier science fiction detective novel: Hal Clement’s Needle (1950) is told from the perspective of an alien symbiote cop, who crash-lands on Earth while chasing a similar creature. We watch while he finds a new host and learns how to communicate with him. Then the two must figure out how to identify which one of the many people living on their island is unwittingly carrying the dangerous fugitive.\nIronically, it has almost the same origin as The Caves of Steel (and considering that Asimov doesn’t say who told him he couldn’t write a science fiction mystery, perhaps the same): in a 1953 letter, the legendary editor of Astounding Magazine, John W. Campbell told Hal, “Once upon a time I told you ‘Science Fiction detective stories don’t work—you can’t write a good one.’ So you proved that I was wrong in that, and wrote Needle.”\nBut perhaps that wasn’t the first science fiction detective story either. In 1948, Jack Vance began a series about Magnus Ridolph, the first of his many “effectuator” characters. Part private detective, part troubleshooter, part con man, many of the stories about Ridolph fall under the general heading of detective stories, starting with the second, “The Unspeakable McInch” (1948). Another half dozen stories about Ridolph followed.\nWhoever you chose to blame, there was no longer any doubt: the two genres could combine—and with interesting results.\nWhile Bester never returned to the science fiction detective story, Asimov also created an “armchair detective,” Wendell Urth, for a series of short stories. He continued writing mystery stories, both future and present, throughout his career. He would eventually write the long-promised third Lije Bailey novel, The Robots of Dawn (1983) as the first of many sequels to his better-known books. However, it seemed to lack something, perhaps because Daneel—who had been portrayed as nearly human in the original novels—was now more of a machine, thanks in part to a new telepathic robot character (the sixty-three-year-old Asimov also spent an inordinate amount of space describing the bathrooms!).\nThe sequel, Robots and Empire (1985), connected it to the Foundation series, but wasn’t a mystery.\nHal Clement didn’t write many other science fiction mysteries, but his 1978 sequel, Through the Eye of a Needle, does eventually turn into a detective story.\nJack Vance continued to combine detective, crime, and mystery elements with many of his stories, not only in the adventures of effectuators like Ridolph and Miro Hetzel, but in many of his other stories and series. One notes, for example, IPCC agent Glawen Clattuc in the Cadwall series, and that Kirth Gersen frequently has to act as a detective in his epic quest for revenge in the Demon Princes novels.\nVance set himself some truly difficult and unique challenges in many of these stories: perhaps the most memorable was “The Moon Moth”, where a detective must find an escaped murderer in a society whose natives never show their faces, covering them with ceremonial masks chosen to reflect both their mood and status. His final novel, Lurulu (2004) includes a mystery among its many plot threads. It seems a fitting end for a long and distinguished career.\nHowever, other authors soon picked up the challenge. One of the first was Randall Garrett. While he isn’t as well remembered as his friends Asimov and Robert Silverberg, Garrett was one of the leading genre short story writers of the era. His breakthrough 1954 story, “The Hunting Lodge” was a spy thriller with mystery elements. He would fuse detection with many of his stories, including several that he wrote with Silverberg as “Robert Randall.”\nHe combined detection with the Asimovian robot story in his 1962 novel, Unwise Child, which hinges on one of the most unusual science fiction notions ever conceived: a book of theology. Garrett followed it with a series by “Mark Phillips” (with Laurence M. Janifer) about “The Queens Own FBI.” These featured the screwball adventures of hard-drinking FBI agent Kenneth J. Malone (based on Craig Rice’s John J. Malone) who had to deal with telepaths, teleporting criminals, and a boss who thinks she’s Queen Elizabeth. The books are brisk and funny, but at the same time well-written mysteries which catch Rice’s unique voice.\nIt was another challenge—this time by Isaac Asimov himself—that led to the creation of Garrett’s most famous detective: when Asimov declared that it was impossible to write a mystery set in a fantasy world dominated by magic, Garrett wrote Too Many Magicians. It features Lord Darcy, a dashing, John Dickson Carr hero from an alternate Earth where they discovered the rules of magic instead of science.\nSadly, though, his final, unfinished novel (completed by his wife) resorts to previously undisclosed psychic powers to explain its locked room mystery.\nIn 1957, Lloyd Biggle Jr. entered the field with one of his first published stories, “Chronus of the D.F.C.” New York City’s newly established “Department of Future Crime” has a machine which lets them see future events. But can they use it to stop a murder before it happens? (the story bears a strong resemblance to Philip K. Dick’s Minority Report, enough to suggest Dick may have read it).\nHe then launched a series starring a character who may have been the first recurring Detective hero in science fiction novels: Jan Darzek. Jan was New York City-based Private Detective, whose latest case in All the Colors of Darkness (1963) involves passengers who have vanished from an experimental teleporter and visitors from other worlds. His second case, Watchers of the Dark (1966) takes him from Earth to solve a mystery for the Galactic Government.\nHis cases, however, in the three books that followed gradually move further from a straightforward mystery story, and Jan does Tom Clancy’s Jack Ryan one better and becomes the President of the Galaxy.\nWhile the first version of his story, “ARM,” was one of the earliest stories Larry Niven wrote, it took him a decade of writing SF stories involving crime and detection before he could finish it. Gil Hamilton, an agent of the elite global police force, ARM, is a hard-boiled cop from an overcrowded future with a telekinetic “third arm.” He first appeared in print in 1968, but despite the fact that he is one of Niven’s favorite characters, he has only starred in four short stories and a novel, The Patchwork Girl. As he put it in the introduction to his collection Flatlander: “If I like him so freezing much, why not write more stories? Because following two sets of rules is hard work, that’s why.”\nIt wasn’t just the SF magazines that published these stories: many appeared in mystery magazines. A few editors, like Frederic Dannay and Hans Stefan Santesson, seemed particularly open to them.\nTo date, however, only one science fiction novel, Ron Goulart’s After Things Fell Apart, has been nominated for the prestigious Mystery Writers of America annual award, the Edgar. It is set in a chaotic future where the United States has come completely apart at the seams and Jim Haley, a PI, has to navigate the absurd obstacles of the many enclaves ruling the San Francisco Bay Area while trying to solve a series of murders. The incredibly prolific Goulart, one of the great absurdists, has gleefully combined science fiction, mystery and comedy in most of his books (It is interesting to note that he also ghosted William Shatner’s Private Eye series, Tek War).\nGradually more and more authors attempted the combination: among others John Brunner (Enigma from Tantalus), Philip K. Dick, Poul Anderson, Glen Cook, William Gibson and Gene Wolfe. There was even a hard-boiled detective paperback original series (Mack Swain) by Mike McQuay (He also wrote a mystery about a man murdered in a city of three-laws robots for Asimov’s Robot City series).\nFantasy efforts included Avram Davidson’s The Enquiries of Doctor Eszterhazy, and Cook’s hard-boiled Garrett, PI series.\nThe idea has become common enough one hardly notices it anymore. Not even when a major mystery writer, Nora Roberts, launched a mystery series in the near future under her J. D. Robb pseudonym, and marketed them as mainstream detective stories.\nBut then something changed in the world of the mystery.\nOr perhaps it was two things.\nOn the one hand, there was a general shift in the market. Fewer and fewer mysteries relied heavily on detection. Carefully constructed puzzles, logical deduction, and devious clues gave way to thrillers, mysterious informants, and heroes who stumbled on the answer by the end of the book.\nOn the other, there is the rise of CSI and its host of imitators, with their emphasis on forensic technology. While this might seem at first glance a return to the older, deduction-heavy approach, mixed with a bit of science, in practice it turned out rather differently. The forensic scientists on CSI could somehow enhance pictures beyond the point where they were reduced to individual pixels. Only a few of the largest research institutes in the world had the equipment they just happened to have in their tiny labs. They could produce incredibly detailed results from the most absurdly minimal samples. In one episode of NCIS, Abby, the resident lab genius, proves a man was murdered on the basis of some tiny specks of foreign material visible on the nano level. Let’s see that hold up in court!\nIt was the greatest excuse for lazy mystery writing ever.\nAnd exactly like what the naysayers had said about science fiction in the forties.\nFar worse, this image of incredible technical prowess had some very negative effects on the real world, where juries ignored perfectly good scientific evidence because it wasn’t as incredible as what they’d seen on last week’s CSI—and where convictions have been overturned because juries have been dazzled by highly dubious forensic evidence.\nOne almost suspects that for the average viewer, there is no difference between real science and that pocket-frannistan.\nThe irony here is that a character who was the real inspiration for Sherlock Holmes should be a lazy writer’s dream. After all, Conan Doyle provided us with nine books worth of Holmesian deductions, which could easily be repurposed, rewritten—or even stolen wholesale—for Vastra’s adventures (which we would naturally expect to resemble Doyle’s “fictionalized” versions).\nBut, even for those willing to work hard at it, the challenge remains a difficult one.\nJohn H. Campbell would often take a position he didn’t hold just to force his writers to think. One suspects that he deliberately set out to inspire Hal Clement (and perhaps Asimov and others in his stable of writers as well) to explore something that would be extremely difficult to pull off—but quite interesting if they succeeded.\nThe result was a rich addition to science fiction literature, full of new and unexplored possibilities. However poor the results might be in the hands of the lazy.\nMark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "source": "https://clarkesworldmagazine.com/cole_01_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Why Science Fiction Detective Stories Aren't Impossible by Mark Cole"}