{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Fran Wilde", "hostname": "clarkesworldmagazine.com", "date": "2015-01-01", "categories": "", "tags": "", "fingerprint": "7e7TPEPyLVEoqWGd1j70NVCZ9s4=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: The Ship’s Voice: A Risk Analysis and Modest Proposal  I’ve been thinking about voice a lot, about who speaks, who is heard, and how. Automated voices in particular are interesting, found in everything from our handheld robots to our future means of travel off planet. Who—and what—we listen to, and don’t, and why, and how? This impacts us greatly going forward.  Also I’ve been thinking a lot about GlaDOS, but I’ll get to that in a second.  Ten years ago, a study appeared in the medical journal NeuroImage that got some major traction and is still generating headlines. The article’s title was “Male and female voices activate distinct regions in the male brain” (Sokhi D.S., Hunter M.D., Wilkinson I.D., Woodruff P.W. NeuroImage 27 9/2005) and stated, as it said on the tin, “ . . . in the male brain, the perception of male and female voices activates distinct brain regions.”  In 2015, NeuroImage published another article by several of the same authors, “Discrimination of Voice Gender in the Auditory Cortex” (Philip S.J. Weston P.S., Hunter M.D., Dilraj S., Wilkinson I.D., Woodruff P.W.) that elaborated:   “ . . . discrete sites in non-primary auditory cortex are differentially activated by male and female voices, with female voices consistently evoking greater activation in the upper bank of the superior temporal sulcus and posterior superior temporal plane.” (NeuroImage 15 1/2015)  The media, then and now, frothed forth with headlines like, “Why Men Can’t Hear Women” (Netscape, subtitle: “He Really Isn’t Listening To You!”), “Why Are Men Incapable Of Listening To Women” (The Telegraph), and “It’s All Your Fault Again” (okay I made that last one up).  In some cases, they got the bit right about hearing women’s voices in the same part of the brain that processes music, and in some cases, they just threw up their collective typographical hands and said “just one of those things, I guess, were you saying something?”  Those media interpretations of this research as “Men don’t listen to women because science!” has been troubling me for some time. Not only is it a terrible transposition of a Tiptree title (The Women Men Don’t Hear?), but it is also a deliberate misreading of science, and dangerous to our survival as a species.  Hear me out:  The headlines you are being sold are disproven the minute you get in your car or turn on your phone. The moment your GPS says “turn left,” and you do it, you are listening, a good percentage of the time, to a female voice. In fact, I suspect each of those headlines was written by someone with at least one digital assistant with a female voice attached. Because we all have them.  From Siri and GPS devices to games and the ships on our favorite SFF shows, we listen exceedingly well to female voices: they guide us, occasionally tease us, and often inform us. And, despite the headlines, this is in part because: science!  As the studies mentioned above illustrate, certain voices equal higher processing in the higher cortex. Also instrumental: certain voices hit a musically soothing baseline. Parents of toddlers know this one well: if you want a child to listen and remember, sing the thing.  Many of the automated voices in networks and transport have been female as well.  The deployment of the female voice for communication has been going on since the first large-scale human-created media networks when, in 1878, Emma Nutt became the first female telephone operator. Alexander Graham Bell hired her and soon found that, unlike the teenage boys who had been manning the switches, “Emma Nutt, was patient and soothing and spoke in a cultured voice. She was such a success that women rapidly replaced boys. By the end of the 1880s, nearly all telephone operators were women.” (New England Historical Society)  The female voice has since percolated up through our entertainment, our emergency warnings, and more. You can find dozens of articles online discussing Artificial Intelligences, which are often portrayed as and given female voices (in the Atlantic & Live Science to name a few). Often, these travel with words like “soothing” and “pleasant” and occasionally, “melodic”—just like music.  That processing power women’s voices seem to access in the auditory cortex is good news for robots giving directions or responding to requests, even as it is seemingly bad—according to those headlines—for actual women who have new things to say. (When I was telling The Chemist about this essay, he observed a lot of people unwilling to trust road directions from the woman riding in the passenger seat are quite happy to take directions from Siri.)  However. Hang on for a moment. Doesn’t this worry you? It worries me. It almost reminds me of that line from the ’90s movie Species:   Xavier Fitch: We decided to make it female so it would be more docile and controllable.  Preston Lennox: More docile and controllable, eh? You guys don't get out much.  So this is where GlaDOS comes in—because the game Portal definitely gets the risk and the joke of having a soothingly voiced AI whose goal is to launch you from an aerial faith plate while promising cake. “The Love And Rocket” episode of Futurama gets it too. Speaking of that, the ships of our Science Fiction—why do they (with one glaring exception) have female voices? Depends on who you ask.  Helva, the brainship from The Ship Who Sang, is one of a number of memorable ship voices from the Anne McCaffrey saga. She is notable for her opera, but she can sing all the parts when she needs to. More notable is that the ships in the story are both male and female.  Other ship voices—HAL 9000 in particular, is a modulated voice engineered to be creepy. “I can’t do that, Dave,” is part of our audio lexicon for a reason. But HAL is a rarity. The default for ship voices has been female for a long time.  Again, there’s history, this time with aircraft—including Northrop’s Convair B-58 Hustler. Warning signals on military aircraft have been given many female names and sobriquets—including “Bitching Betty,” “Sexy Sally,” and “Nagging Nora.” Here’s why:   “Research during the era of all-male combat aircraft assignments revealed that a woman’s voice was more likely to gain the attention of young men in distracting situations.” (en.wikipedia.org/wiki/Convair_B-58_Hustler)  In science fiction, this bit of history percolates through everything, possibly influencing the future. Federation ship voices are female in Star Trek. On SyFy’s Killjoys, Lucy is the ship with attitude. In Futurama’s “Love and Rocket” episode, the Planet Express gets a female voice module . . . and shenanigans ensue. (I’ll just point out right here that it’s Leela who has to jump in and fix everything, again, and leave the rest to your imagination.)  So . . . I put it to you to consider this question: If the media is conditioning everyone to be okay with listening to female robot voices, while encouraging people to ignore actual female voices, are we edging closer to a major problem?  Are we in fact growing used to following automated female voices when receiving directions? We do what they say by reflex . . . Google Maps says turn left, we turn left. Even into a wall. GlaDOS says we’re doing well, we feel pretty good about ourselves.  It’s a big risk to take, especially with AI getting smarter. So, a modest proposal, from an SFF writer. Let’s figure out why we listen, and don’t, to each other, and, maybe, before we climb aboard ships with voices of any kind, how to listen to each other better too. Fran Wilde's novels and short stories have been finalists for three Nebula awards, two Hugo Awards, and a World Fantasy Award. They include her Andre Norton- and Compton Crook-winning debut novel, Updraft (Tor, 2015); its sequels, Cloudbound and Horizon; the middle-grade novel Riverland (forthcoming from Abrams in April 2019); and the novelette \"The Jewel and Her Lapidary.\" Her short stories appear in Asimov's, Tor.com, Beneath Ceaseless Skies, Shimmer, Nature, and the 2017 Year's Best Dark Fantasy and Horror. She writes for publications including The Washington Post, Tor.com, Clarkesworld, iO9.com, and GeekMom.com. You can find her on Twitter, Facebook, and her website.", "text": "Non-Fiction\nAnother Word: The Ship’s Voice: A Risk Analysis and Modest Proposal\nI’ve been thinking about voice a lot, about who speaks, who is heard, and how. Automated voices in particular are interesting, found in everything from our handheld robots to our future means of travel off planet. Who—and what—we listen to, and don’t, and why, and how? This impacts us greatly going forward.\nAlso I’ve been thinking a lot about GlaDOS, but I’ll get to that in a second.\nTen years ago, a study appeared in the medical journal NeuroImage that got some major traction and is still generating headlines. The article’s title was “Male and female voices activate distinct regions in the male brain” (Sokhi D.S., Hunter M.D., Wilkinson I.D., Woodruff P.W. NeuroImage 27 9/2005) and stated, as it said on the tin, “ . . . in the male brain, the perception of male and female voices activates distinct brain regions.”\nIn 2015, NeuroImage published another article by several of the same authors, “Discrimination of Voice Gender in the Auditory Cortex” (Philip S.J. Weston P.S., Hunter M.D., Dilraj S., Wilkinson I.D., Woodruff P.W.) that elaborated:\n“ . . . discrete sites in non-primary auditory cortex are differentially activated by male and female voices, with female voices consistently evoking greater activation in the upper bank of the superior temporal sulcus and posterior superior temporal plane.” (NeuroImage 15 1/2015)\nThe media, then and now, frothed forth with headlines like, “Why Men Can’t Hear Women” (Netscape, subtitle: “He Really Isn’t Listening To You!”), “Why Are Men Incapable Of Listening To Women” (The Telegraph), and “It’s All Your Fault Again” (okay I made that last one up).\nIn some cases, they got the bit right about hearing women’s voices in the same part of the brain that processes music, and in some cases, they just threw up their collective typographical hands and said “just one of those things, I guess, were you saying something?”\nThose media interpretations of this research as “Men don’t listen to women because science!” has been troubling me for some time. Not only is it a terrible transposition of a Tiptree title (The Women Men Don’t Hear?), but it is also a deliberate misreading of science, and dangerous to our survival as a species.\nHear me out:\nThe headlines you are being sold are disproven the minute you get in your car or turn on your phone. The moment your GPS says “turn left,” and you do it, you are listening, a good percentage of the time, to a female voice. In fact, I suspect each of those headlines was written by someone with at least one digital assistant with a female voice attached. Because we all have them.\nFrom Siri and GPS devices to games and the ships on our favorite SFF shows, we listen exceedingly well to female voices: they guide us, occasionally tease us, and often inform us. And, despite the headlines, this is in part because: science!\nAs the studies mentioned above illustrate, certain voices equal higher processing in the higher cortex. Also instrumental: certain voices hit a musically soothing baseline. Parents of toddlers know this one well: if you want a child to listen and remember, sing the thing.\nMany of the automated voices in networks and transport have been female as well.\nThe deployment of the female voice for communication has been going on since the first large-scale human-created media networks when, in 1878, Emma Nutt became the first female telephone operator. Alexander Graham Bell hired her and soon found that, unlike the teenage boys who had been manning the switches, “Emma Nutt, was patient and soothing and spoke in a cultured voice. She was such a success that women rapidly replaced boys. By the end of the 1880s, nearly all telephone operators were women.” (New England Historical Society)\nThe female voice has since percolated up through our entertainment, our emergency warnings, and more. You can find dozens of articles online discussing Artificial Intelligences, which are often portrayed as and given female voices (in the Atlantic & Live Science to name a few). Often, these travel with words like “soothing” and “pleasant” and occasionally, “melodic”—just like music.\nThat processing power women’s voices seem to access in the auditory cortex is good news for robots giving directions or responding to requests, even as it is seemingly bad—according to those headlines—for actual women who have new things to say. (When I was telling The Chemist about this essay, he observed a lot of people unwilling to trust road directions from the woman riding in the passenger seat are quite happy to take directions from Siri.)\nHowever. Hang on for a moment. Doesn’t this worry you? It worries me. It almost reminds me of that line from the ’90s movie Species:\nXavier Fitch: We decided to make it female so it would be more docile and controllable.\nPreston Lennox: More docile and controllable, eh? You guys don't get out much.\nSo this is where GlaDOS comes in—because the game Portal definitely gets the risk and the joke of having a soothingly voiced AI whose goal is to launch you from an aerial faith plate while promising cake. “The Love And Rocket” episode of Futurama gets it too. Speaking of that, the ships of our Science Fiction—why do they (with one glaring exception) have female voices? Depends on who you ask.\nHelva, the brainship from The Ship Who Sang, is one of a number of memorable ship voices from the Anne McCaffrey saga. She is notable for her opera, but she can sing all the parts when she needs to. More notable is that the ships in the story are both male and female.\nOther ship voices—HAL 9000 in particular, is a modulated voice engineered to be creepy. “I can’t do that, Dave,” is part of our audio lexicon for a reason. But HAL is a rarity. The default for ship voices has been female for a long time.\nAgain, there’s history, this time with aircraft—including Northrop’s Convair B-58 Hustler. Warning signals on military aircraft have been given many female names and sobriquets—including “Bitching Betty,” “Sexy Sally,” and “Nagging Nora.” Here’s why:\n“Research during the era of all-male combat aircraft assignments revealed that a woman’s voice was more likely to gain the attention of young men in distracting situations.” (en.wikipedia.org/wiki/Convair_B-58_Hustler)\nIn science fiction, this bit of history percolates through everything, possibly influencing the future. Federation ship voices are female in Star Trek. On SyFy’s Killjoys, Lucy is the ship with attitude. In Futurama’s “Love and Rocket” episode, the Planet Express gets a female voice module . . . and shenanigans ensue. (I’ll just point out right here that it’s Leela who has to jump in and fix everything, again, and leave the rest to your imagination.)\nSo . . . I put it to you to consider this question: If the media is conditioning everyone to be okay with listening to female robot voices, while encouraging people to ignore actual female voices, are we edging closer to a major problem?\nAre we in fact growing used to following automated female voices when receiving directions? We do what they say by reflex . . . Google Maps says turn left, we turn left. Even into a wall. GlaDOS says we’re doing well, we feel pretty good about ourselves.\nIt’s a big risk to take, especially with AI getting smarter. So, a modest proposal, from an SFF writer. Let’s figure out why we listen, and don’t, to each other, and, maybe, before we climb aboard ships with voices of any kind, how to listen to each other better too.\nFran Wilde's novels and short stories have been finalists for three Nebula awards, two Hugo Awards, and a World Fantasy Award. They include her Andre Norton- and Compton Crook-winning debut novel, Updraft (Tor, 2015); its sequels, Cloudbound and Horizon; the middle-grade novel Riverland (forthcoming from Abrams in April 2019); and the novelette \"The Jewel and Her Lapidary.\" Her short stories appear in Asimov's, Tor.com, Beneath Ceaseless Skies, Shimmer, Nature, and the 2017 Year's Best Dark Fantasy and Horror. She writes for publications including The Washington Post, Tor.com, Clarkesworld, iO9.com, and GeekMom.com. You can find her on Twitter, Facebook, and her website.", "source": "https://clarkesworldmagazine.com/another_word_10_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Ship's Voice: A Risk Analysis and Modest Proposal by Fran Wilde"}