{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kij Johnson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "OJNgca64h2twhHMQSsfzfpjheEM=", "id": null, "license": null, "comments": "", "raw_text": "1190 words, short story, REPRINT  Spar (The Bacon Remix)  [Editor’s note: In 2009, we published Kij Johnson's Nebula Award-winning story, “Spar.” In 2013, she contributed this alternate version of the story to John Ordover’s BACONTHOLOGY, a bacon-themed charity anthology aimed at raising money for children with autism. We present this story for your April amusement and hope that you will consider supporting John’s cause. —Neil] In the tiny lifeboat, she and the alien eat bacon endlessly, relentlessly.  They each have their own preference. Hers is the usual, crispy but not too crispy, the creamy fat just firm enough to bite through, the salt making grainy little bumps that she licks off her fingers.  The alien is not humanoid. It is not bipedal. It has cilia. It has no bones, or perhaps it does and she cannot feel them. Its muscles, or what might be muscles, are rings and not strands. It seems to like its bacon softer than she does, almost raw even, though sometimes it eats pieces that were left to fry a little too long.  It eats the bacon a thousand ways. She eats it, too.  The lifeboat is not for humans. The air is too warm, the light too dim. It is too small. There are no screens, no books, no bed or comfy chair or dishwasher or Facebook. The ship’s hum is steady. Nothing changes.  There is nothing to do. They cannot help but eat bacon. There is always bacon being eaten, bacon inside, outside. She is always greasy. She cannot tell whether this is the slime from its skin or the bacon, but suspects it’s probably about fifty/fifty.  She’s having the worst acne of her life right now. When she can, she pulls her mind away. Eating bacon with the alien is less horrible.  She does not remember the first time. It is safer to think the bacon was properly cooked.  The wreck was random: a mid-space collision between their ship and the alien’s, simultaneously a statistical impossibility and a fact. She and Gary just had time to start the emergency beacon and claw into their suits before their ship was cut in half. Their lifeboat spun out of reach. A piece of debris slashed through the leg of Gary’s suit. Blood and fat and muscle that looked quite a lot like bacon swelled from his suit into vacuum. It was pretty bad.  The alien’s vessel also broke into pieces, its lifeboat kicking free and the waldos reaching out, pulling her through the airlock. In.  Why did it save her? The mariner’s code? She does not think it knows she is alive. If it did it would be a little nicer about sharing. It would try to establish communications.  She eats bacon from a Tupperware container in the otherwise featureless lifeboat. She uses the stovetop whenever they are running low. They run low a lot. It has no sense of the bacon resources available to them.  There is a time when she eats bacon so fast that her nose bleeds.  She tries to teach it words. “Pork,” she says. “Trotters. Ham hocks.” Her vocabulary options are limited here.  “Listen to me,” she says. “Listen. To. Me.” Can it hear over its chewing?  The bacon never gets better or worse, always adequate Safeway-type bacon smacking slightly of nitrites. It tastes fine. She does not learn anything that will make it better: would not if she could. And why? Even merely adequate bacon is pretty outstanding. She suddenly remembers, the greasy salty smell of it and its perfect mottled brown, its squeaky texture against her teeth.  She finds herself hungry at the thought of bacon between her teeth, because it is the only thing that combines salt, fat, meat and grease in such perfect proportions. But perhaps she’s still full. Her appetite for bacon makes it a little hard to be sure sometimes.  For a while, she measures time by number of strips she fries. She estimates she can fry five strips in the nine-inch pan, seven in the larger one. She stops after a time since she keeps losing count because the alien keeps snatching them from the pan.  Sometimes she watches it eat bacon, the strange coiling of its weirdo body like watching earthworms in a baggie, and this kind of appalls her, but at least it is not eating eggplant.  She cannot communicate, but she tries to make sense of its actions.  She likes her bacon crispier, because she at least knows it’s less likely to kill her.  Doesn’t it know that bacon needs to be heated to at least 165 degrees? The threat of trichinosis is much less than in former days, but it’s still better to be safe than sorry. Or maybe it’s not worried about getting food poisoning, it’s an alien, who knows.  What is she to it? If she weren’t around would it just eat it raw? Ugh.  It is covered with slime, or maybe that’s bacon fat, too. There’s one time when they’re almost out of bacon, so she gives it a quick lick, just to check. It does taste like bacon, but there’s another flavor, too. She can’t figure out whether that’s maybe the taste of chicken or something. But more bacon turns up, so she doesn’t have to explore further, thank God.  She dreams of pancakes, but doesn’t remember what they taste like.  Her appetite for bacon is endless, relentless.  Gary, her current husband, the one who just died, was pretty solid on the whole bacon thing, but she had an ex-husband a while back who was not at all partial to bacon, and they used to have quite the arguments about this, him explaining how unhealthy it was, not to mention that most of it was raised inhumanely and in any case pigs were pretty damn smart and deserve better.  “If pigs don’t want to get turned into bacon, they shouldn’t be so delicious,” she said.  “Maybe they would feel the same way about you, if they got the chance,” he said tartly. She threw half a pound of apple-smoked thick-cut slices in his face and moved out that day, though it took another six months to get all the details hammered out. In the interim, she found that it is quite possible to subsist on bacon and vitamin pills, knowledge that has served her well in this contingency. At least the alien isn’t always trying to tell her what to eat.  “I think I love you,” she says to it. “But if you eat the last piece without setting more out to thaw one more time, I swear to God that I will fucking kill you dead.”  The lifeboat decelerates. Metal clashes on metal. Gaskets seal.  The airlock opens overhead. There is light. Her eyes water helplessly and everything becomes glare and indistinct dark shapes. The air is dry and cold and smells of artichokes or something foul like that. She recoils.  “Hey,” one of the shapes says. “Anyone in there?”  The alien does not react to the light, the hard air. They still have a pile of bacon. Nothing changes.  No. She pulls the hatch shut. Making bacon. Kij Johnson is the author of several novels, including The Fox Woman and Fudoki, and a short story collection, At the Mouth of the River of Bees. She is a three-time winner of the Nebula Award, and has also won the Hugo, World Fantasy, Sturgeon, and Crawford Awards. In the past she has worked in publishing, edited cryptic crosswords, waitressed in a strip bar, identified Napa cabernets by winery and year while blindfolded, and climbed an occasional V-5. These days, she teaches at the University of Kansas, where she is associate director for the Center for the Study of Science Fiction.", "text": "1190 words, short story, REPRINT\nSpar (The Bacon Remix)\n[Editor’s note: In 2009, we published Kij Johnson's Nebula Award-winning story, “Spar.” In 2013, she contributed this alternate version of the story to John Ordover’s BACONTHOLOGY, a bacon-themed charity anthology aimed at raising money for children with autism. We present this story for your April amusement and hope that you will consider supporting John’s cause. —Neil]\nIn the tiny lifeboat, she and the alien eat bacon endlessly, relentlessly.\nThey each have their own preference. Hers is the usual, crispy but not too crispy, the creamy fat just firm enough to bite through, the salt making grainy little bumps that she licks off her fingers.\nThe alien is not humanoid. It is not bipedal. It has cilia. It has no bones, or perhaps it does and she cannot feel them. Its muscles, or what might be muscles, are rings and not strands. It seems to like its bacon softer than she does, almost raw even, though sometimes it eats pieces that were left to fry a little too long.\nIt eats the bacon a thousand ways. She eats it, too.\nThe lifeboat is not for humans. The air is too warm, the light too dim. It is too small. There are no screens, no books, no bed or comfy chair or dishwasher or Facebook. The ship’s hum is steady. Nothing changes.\nThere is nothing to do. They cannot help but eat bacon. There is always bacon being eaten, bacon inside, outside. She is always greasy. She cannot tell whether this is the slime from its skin or the bacon, but suspects it’s probably about fifty/fifty.\nShe’s having the worst acne of her life right now. When she can, she pulls her mind away. Eating bacon with the alien is less horrible.\nShe does not remember the first time. It is safer to think the bacon was properly cooked.\nThe wreck was random: a mid-space collision between their ship and the alien’s, simultaneously a statistical impossibility and a fact. She and Gary just had time to start the emergency beacon and claw into their suits before their ship was cut in half. Their lifeboat spun out of reach. A piece of debris slashed through the leg of Gary’s suit. Blood and fat and muscle that looked quite a lot like bacon swelled from his suit into vacuum. It was pretty bad.\nThe alien’s vessel also broke into pieces, its lifeboat kicking free and the waldos reaching out, pulling her through the airlock. In.\nWhy did it save her? The mariner’s code? She does not think it knows she is alive. If it did it would be a little nicer about sharing. It would try to establish communications.\nShe eats bacon from a Tupperware container in the otherwise featureless lifeboat. She uses the stovetop whenever they are running low. They run low a lot. It has no sense of the bacon resources available to them.\nThere is a time when she eats bacon so fast that her nose bleeds.\nShe tries to teach it words. “Pork,” she says. “Trotters. Ham hocks.” Her vocabulary options are limited here.\n“Listen to me,” she says. “Listen. To. Me.” Can it hear over its chewing?\nThe bacon never gets better or worse, always adequate Safeway-type bacon smacking slightly of nitrites. It tastes fine. She does not learn anything that will make it better: would not if she could. And why? Even merely adequate bacon is pretty outstanding. She suddenly remembers, the greasy salty smell of it and its perfect mottled brown, its squeaky texture against her teeth.\nShe finds herself hungry at the thought of bacon between her teeth, because it is the only thing that combines salt, fat, meat and grease in such perfect proportions. But perhaps she’s still full. Her appetite for bacon makes it a little hard to be sure sometimes.\nFor a while, she measures time by number of strips she fries. She estimates she can fry five strips in the nine-inch pan, seven in the larger one. She stops after a time since she keeps losing count because the alien keeps snatching them from the pan.\nSometimes she watches it eat bacon, the strange coiling of its weirdo body like watching earthworms in a baggie, and this kind of appalls her, but at least it is not eating eggplant.\nShe cannot communicate, but she tries to make sense of its actions.\nShe likes her bacon crispier, because she at least knows it’s less likely to kill her.\nDoesn’t it know that bacon needs to be heated to at least 165 degrees? The threat of trichinosis is much less than in former days, but it’s still better to be safe than sorry. Or maybe it’s not worried about getting food poisoning, it’s an alien, who knows.\nWhat is she to it? If she weren’t around would it just eat it raw? Ugh.\nIt is covered with slime, or maybe that’s bacon fat, too. There’s one time when they’re almost out of bacon, so she gives it a quick lick, just to check. It does taste like bacon, but there’s another flavor, too. She can’t figure out whether that’s maybe the taste of chicken or something. But more bacon turns up, so she doesn’t have to explore further, thank God.\nShe dreams of pancakes, but doesn’t remember what they taste like.\nHer appetite for bacon is endless, relentless.\nGary, her current husband, the one who just died, was pretty solid on the whole bacon thing, but she had an ex-husband a while back who was not at all partial to bacon, and they used to have quite the arguments about this, him explaining how unhealthy it was, not to mention that most of it was raised inhumanely and in any case pigs were pretty damn smart and deserve better.\n“If pigs don’t want to get turned into bacon, they shouldn’t be so delicious,” she said.\n“Maybe they would feel the same way about you, if they got the chance,” he said tartly. She threw half a pound of apple-smoked thick-cut slices in his face and moved out that day, though it took another six months to get all the details hammered out. In the interim, she found that it is quite possible to subsist on bacon and vitamin pills, knowledge that has served her well in this contingency. At least the alien isn’t always trying to tell her what to eat.\n“I think I love you,” she says to it. “But if you eat the last piece without setting more out to thaw one more time, I swear to God that I will fucking kill you dead.”\nThe lifeboat decelerates. Metal clashes on metal. Gaskets seal.\nThe airlock opens overhead. There is light. Her eyes water helplessly and everything becomes glare and indistinct dark shapes. The air is dry and cold and smells of artichokes or something foul like that. She recoils.\n“Hey,” one of the shapes says. “Anyone in there?”\nThe alien does not react to the light, the hard air. They still have a pile of bacon. Nothing changes.\nNo. She pulls the hatch shut. Making bacon.\nKij Johnson is the author of several novels, including The Fox Woman and Fudoki, and a short story collection, At the Mouth of the River of Bees. She is a three-time winner of the Nebula Award, and has also won the Hugo, World Fantasy, Sturgeon, and Crawford Awards. In the past she has worked in publishing, edited cryptic crosswords, waitressed in a strip bar, identified Napa cabernets by winery and year while blindfolded, and climbed an occasional V-5. These days, she teaches at the University of Kansas, where she is associate director for the Center for the Study of Science Fiction.", "source": "https://clarkesworldmagazine.com/johnson_04_13_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Spar (The Bacon Remix) by Kij Johnson"}