{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tang Fei; John Chu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "e2cmd/SgRD4rSzbI2hNUfJITBLk=", "id": null, "license": null, "comments": "", "raw_text": "4970 words, short story  Pepe  “Let’s go to the amusement park.” As Pepe speaks, a ray of red light scratches her face. Her face looks wounded then healed, welcoming some other color of light.  “But we’re already here.” I look silly holding the cigarette, but I’m holding it anyway.  We stand in the shadow of a Ferris wheel. Pepe’s white silk skirt billows in the wind. Her long, slender legs never seem to touch the ground. I have to keep hold of her. This makes me look stupid, so it makes me angry.  Even more annoying, when she hits me with her lollipop, I can’t hit back.  “Hey, idiot, let’s go to the amusement park.”  “But we’re already here.”  Her eyes grow wide. She grabs my cigarette, takes a deep drag, then realizes I’ve only been pretending.  “Pepe.” I want her to look at me, but her scarlet lips pout then she blows a smoke ring at the sky. The way she looks at the sky always make me nervous. Our creator put a tightly wound spring into our bodies. But, in the end, even he forgot where each spring’s key went to. By the time he died, rust covered our springs like lichen on his tombstone. Because we’ll never have tombstones, our creator gave us springs.  He was fair. I tell myself that a lot. I know that was me telling a lie, but who cares. I only lie when I’m telling stories and, whenever I speak, I can only tell stories.  We were created to tell stories. On a good day, a person can tell so many, many stories. They ought to have some principles in them—storytelling principles. But we don’t know any. We’re driven by tightly wound springs. Once they start turning, stories spin out of our bodies. We scatter them like seeds wherever we run to. When we tell stories, our lips wriggle as fast as flight. The people listening to us get dizzy. It’s better when they close their eyes as they listen. When they close their eyes, they can understand better the stories we tell. However, they can never fully understand.  This is how our creator first designed us. People called him a drunk. One day, after he poured his thirteenth shot of tequila (he’d downed only twelve shots at most before), suddenly, he smacked his head then rushed home. Black and white blocks of ideas collided in a great dark and bright river inside his body. Pain shook his hands, twisted his back, and made him howl. That night, our creator downed his thirteenth shot of tequila, he went home, then he created us.  He said we were salt. The salt of his palm. The salt of the earth.  When he finished speaking, he drove us all away.  The scene was so chaotic. So small a house. So many people. Everyone craned their necks. So crowded. Bodies squeezed against bodies. All of them alike.  The hot air was insufferable. My skin hurt. My nose hurt. The pain in my throat rushed down into my heart. We exhaled the burning air then inhaled again. Everyone hurt but no one left. We were waiting for our creator to speak again but he didn’t. He rose, brandishing his fist to drive us all out of the house. Everyone ran, pushing and squeezing their way to the door, the extremely narrow door. Random shadows and screams rose from inside the room. Rocking and swaying, we collided onto the street.  The outside was so cool. The wind poured into my head through my ears. It blew away the screams but our shadows continued to scramble up the walls. My head opened like a gate and let the wind scream into an empty darkness just like the room I’d just left was now.  Without a thought, I ran and ran and ran.  Before I realized what had happened, it had happened. Pepe’s hand was in mine. Her hair and skirt fluttered backward in the wind like outstretched wings. We ran hand in hand into the darkness.  This is exactly how it happened.  I was wearing khaki shorts. Pepe was wearing her white skirt. We ran hand in hand into the darkness.  We are story-telling machine kids. We’ll never grow up. Forever wearing khaki shorts. Forever wearing a white skirt. Forever, except for telling stories, unable to speak.  The crowd waiting to ride the pirate ship parts in two. The people in front scatter to make room for us. Adults, children, even infants all look at us with friendly expressions. I’ve told them Pepe is my kid sister, that she has a serious illness and that she doesn’t have many days left to live. Pepe is thrilled because she doesn’t need to wait in line to ride the pirate ship. She runs, dragging me to the front. I hear some people sigh. Pepe definitely doesn’t look normal. This make them believe my story even more. In the story I told these kind-hearted people, she’ll die soon. So no matter what she does, it will be forgiven. So long as she doesn’t say anything.  “Before this world could yet have been considered a world, thirteen witches passed through here. As a result, they chose here to settle down. As a result, they became this world’s first witches. They predate this world.”  I cover Pepe’s mouth and drag her away from the woman taking tickets. Pepe’s white skirt rustles as it grazes the woman’s red skirt. The ticket woman is still thinking about what Pepe said. When people speak, it must be for some practical reason. She can’t understand what Pepe’s words mean.  “Your tickets?” Her gaze lingers on me.  I hand over the tickets. At the same time, I compliment her eyes. “Once, I met a girl. Her eyes were extremely beautiful. Just like you.”  She smiles a little. She can understand my words. Or so she thinks.  Pepe and I sit at the prow of the pirate ship. Soon, the entire ship has filled up. People next to Pepe and me looked at our legs, which shake up and down as though we had leg cramps. They treat us like misbehaving children. If they knew who we were, they’d call the police to arrest us, or wait until the pirate ship swung into mid-air then toss us out.  However, that era has long passed. That’s what their grandparents had done. Back then, they weren’t that old yet and they were stronger than us. Their bloodshot eyes, flaring nostrils, angry slogans and the loss of life. The fanaticism that fermented during day, the fanaticism that fermented during the deep purple night. I remember all those things.  Those people were all drunk. In throngs, they searched every corner. They wanted to expose us, separate us from the other children wearing full, white skirts and khaki shorts. It always goes like this: They chase us, they block us, they surround us, they ask us questions. All the kids who can’t answer are grabbed by the ankle, lifted into the air, then shaken like empty pockets back and forth against walls, against utility poles, against the ground, against railings. Our bodies are so light. That’s how our creator designed us. Even if they smash us to pieces, we won’t leak tears.  We also don’t have blood.  People walked over the tumbling bits of us that now covered the ground. They never wanted to know that originally we had hearts too. They just wanted us to die. We shouldn’t have been discovered. This world doesn’t need any stories because stories are wrong. They are dangerous and despicable. Desires meet and shine a light on the secrets of the heart. After the first time someone discovered his secret in a story, after that secret spread, people gradually fell out of love with listening to our nonsense. In it, they heard their own past, what they didn’t want other people to know. They shut our mouths. It’s always like that. This was just one battle.  They wanted to kill us then throw us away. So, they first let themselves think we were harmful beings to be feared. If they didn’t prevent it, one day in the future, we’d become so powerful and destructive, nothing could compare to us. After they convinced themselves, they started to tell others. At last, the most eloquent of them was selected to be their leader. When they assembled, he stood on a great, big platform and roared into the microphone. The dark, dense and turbulent crowd below, like the sea echoing the wind, roared in response.  At last, they waged war. They won.  Many years later, the people who waged and fought the war were placed into Intensive Care Units, slow catheters inserted into their bodies. They were old now, settled down, near to death. The deathly pale hospital light shrouded their dull, ashen skin like a layer of dirty snow on the road. They’d finally calmed down. And I still have Pepe, sitting next to the children of their children riding the pirate ship together.  The pirate ship starts to move. Pepe squirms, tugging at my sleeve. She’s afraid of being rocked back and forth. The big machine starts to buzz. The first downswing is just a gentle sway. Pepe looks like she wanted to cry. She won’t stop beating her temples with her fists. I grab her wrists, but the disaster is about to start. Her tongue is moving, continuing the story she just started:  “The witches loved to sing. They sang of the earth and there was the earth. They sang of the sky and there was the sky. They kept singing and this world changed into what it is now. At last, one day, the witches didn’t think this was fun any more. They had nothing left to sing about.  “ ‘I don’t think we’re needed any more,’ the best tempered witch said.  “ ‘Then let’s change the game we play,’ the smartest witch said.  “ ‘Are you suggesting subtraction?’ guessed the the witch who understood people the best, cocking her head.  “ ‘Right. Play a punishment game,’ the most brutal witch yelled, waving her arms.  “The rest of the witches agreed, one after another. Just like that, the witches agreed to play the subtraction game.”  I hug Pepe. No one listens to her story. Light and lively music starts to play. The pirate ship flies into the air. Everyone screams. Now the ship stops at the peak of its swing to the right for a couple seconds or maybe an hour. We’re at the bottom of the ship looking at the people at the top bowing their heads and staring at us. Their mouths stretch into large, black holes, exposing their throats. Only Pepe doesn’t scream. Her soft red lips change shape. She continues to tell her story. No one listens.  I practically clamp her under my arms. Stay still, Pepe.  Pepe lets me. Her head droops. Just like before, she doesn’t move, not even one bit, her arms wrapped around my waist. I let go a little. Suddenly, the pirate ship falls. It swoops down from its peak on the right and inertia pushes it up to the left. I scream, pushing myself away from Pepe. She throws herself on me, choking me. Her fingernails have grown long again. I always remember to cut her fingernails. Every time, I cut down to down to nothing and, by the time we fight, I’m still scratched by them just the same. Her fingernails grow so fast. Pepe is just that kind of kid. Her hair and fingernails grow and grow like mad. Like the weeds in a wasteland, they never stop. Pepe is just that kind of kid. When she goes crazy, she doesn’t care who she hurts or what she destroys.  I cave under her attack. She definitely hates me to death, brandishing her arms, wanting to rip me to pieces. My hairband breaks. Black hair scatters, fluttering like snakes in the air. Far away, the sky and earth quiver and sway. The music and shouting mix in the wind. The pirate ship stops. We’re at the very top, nearly parallel to the ground, our whole body weight straining against the seatbelts. You’re okay as long as you hold onto the armrest. However, I have to hold onto Pepe’s wrists. Loosen my grip even a little and she’ll start beating me again. Next time, she might use her teeth. Pepe, stay still, stay still. I face her and gaze into her eyes. That way, she’ll stay still. However, she hides her eyes behind her hair.  “The witches want to play the subtraction game,” she says.  Pepe opens her mouth. A moist, warm breath rushes out. She cries. I stared at her, wordlessly. I want to save my strength.  The pirate ship drops to the ground. The moment of weightlessness is like leaving our bodies. I begin to laugh.  Our arms untangle. She immediately curls into a ball.  Pepe must hate me to death. I’ve never told her stories. When she told stories, I never listened. Finally, I didn’t even let her tell stories. She knew why. However, she still has never paid any attention to me.  So, she became the way she is now. The stories that sprawled like weeds in her head filled her. Her eyes grew blacker by the day. Later, her fingernails grew black too. Finally, even her lips grew black. I had to take her to the doctor. (Our heads are the same as human’s. Even doctors can’t tell the difference.) The X-ray was completely black. I knew why. It was because of all the untold stories but I couldn’t tell the doctors that. I couldn’t even tell Pepe. The doctors met for a few days and still didn’t know what to do. At last, I suggested plastic surgery, at least to change her lips back. Pepe constantly biting me had given her a chocolate smile.  The surgery was a huge success. They gave her strawberry red lips. Everyone was thrilled. Pepe thought she’d been completely cured. That day, she was truly happy, but she still bit my earlobes. Finally, I realized that, by then, Pepe was already wrong in the head. Her eyes seemed just like black pools, almost without whites. Not long after, Pepe became truly crazy.  Her eyes seem just like black pools, shining with a fuliginous light.  As long as I listen to her stories, everything’s fine. This way, she won’t get frenzied. I can also tell her my stories. This way, we’ll both be a little more comfortable. However, I don’t want to. I’m fed up. I hate Pepe.  Even though I can pretend what I do is for her own good, and she’s definitely getting better by the day, even though I can pretend I don’t know I’m hurting her, I know she’s not happy. She’s crazy now. What I’m doing I do on purpose. I hate her and her stories.  Come on, Pepe. Use your fingernails to rip open my chest. I want to tear off your scalp.  Things are always like this. We wrestle, claw, and hate each other to death. But neither one of us ever leaves the other.  Maybe I’m also going crazy. Maybe I’m already crazy.  I never let Pepe know about going crazy. On the other hand, I still wanted to work hard to pretend we were normal kids. No, we weren’t kids who told stories. No, we didn’t tell stories at all. People believed us. They knew our creator didn’t give us programs for telling intentional lies. Our creator created us only to tell stories. Except for stories, we couldn’t say anything. This was how people recognized us.  They asked us questions.  They killed those who couldn’t speak.  They killed those who told stories.  Those kids were exactly like us. They were shaken back and forth like empty flour sacks, just like us right now.  When the massacre started, Pepe and I saw them die with our own eyes. We didn’t grieve. We didn’t get angry. After all, death is death. Death is also nothing. Death is slight, just like an empty flour sack.  I didn’t want to die, not one bit. When they ripped me away from the rest of the kids, I held onto Pepe’s hand and never let go. A lot of people tried to pry our hands apart, but they were wasting their strength. A fool carrying a knife threatened to cut off our hands if we didn’t let go. Pepe and I set our throats free. We began crying. Immediately, all the other kids began crying too. The adults panicked. At last, the adult who started this let us answer their questions together. “Either they both are or they both aren’t. Answering together might save some time.” So they asked their questions.  I opened my mouth. I made sounds. I spoke. I didn’t tell stories. As a result, we survived.  They gave us yellow, five-pointed stars. We stuck them on our chests as we walked into another group of kids. They wore khaki pants or full, white skirts. They all had yellow, five-pointed stars fastened on their chests. The kids who didn’t have yellow, five-pointed stars were on the other side. Among them, so many looked at me, astounded. Their pale faces shone with the blackness of night. They looked at me with amazement, to the point that they forgot that they were about to die.  This was not part of our creator’s original plan. We were created following the same steps for the same purpose. Finally, for the same reason, we ought to be killed in the same way. I shouldn’t leave them because we’re the same kind of kids. They knew that but had no way to say it.  Perhaps they could have told stories, told treasonous and false stories. If the adults were smart, perhaps they could have figured out that I was actually telling a story, one that didn’t believe that it was story. However, the kids didn’t have time. They’d be dead soon. After they died, they’d be like empty flour sacks. They’d be nothing.  Nothing I did could seem out of the ordinary. When they asked me questions, I was certainly telling them stories. I treated everything that happened as a story to tell. You see, survival was just that simple. None of this is the truth. All of this is a story. As long as you think this, you can recount events in the way humans speak because you’re telling a story. This isn’t anything unusual. Those who are like us are unusual. I, myself, am also a little unusual.  Only Pepe doesn’t seem unusual. Maybe she knew long ago that I’d act like this. Because she was also not unusual, we could survive. Even though the rest of the kids who told stories were all unusual, they wanted to survive. From among those kids, I saved only Pepe. This was inevitable after we’d rushed out of that black room together. I thought, for kids who told stories, Pepe and I had brains that were atypical.  We were atypical from the start. This notion stops my hand. A few hits later, Pepe also calms down. Her black eyes gaze at me, her long hair draped over shoulders. The world is no longer in upheaval. The pirate ship has stopped.  People disembark from the pirate ship. A girl with blond hair tied with a pink butterfly bow walks ahead of us. Her skirt is also pink, highly creased and topped with lace. Very pretty, but not as pretty as the graceful arc of her calves. I can’t see her face.  “The tortoise and the hare raced. The tortoise was always behind. He wanted to see the hare’s face. That way, he could find out the color of her eyes.”  That is Pepe telling her shortest story.  I laugh. Pepe doesn’t know that the tortoise also longed for the hare’s lips. She’s still too young, so she doesn’t understand desire. But I have desire. I want to know. Kids who tell stories are kids who have no needs. We eat. We sleep. We tell stories, but not from need. But on that day, when I came to treat this world as a story, I suddenly developed desire. At that moment, I understood this world even better. I understood even better the stories we told and spread.  “Let’s ride the carousel, okay?” I said to Pepe.  She lowers her head, staring at her rounded leather shoes. Pink Butterfly Bow has just entered a gold pumpkin carriage.  “Come.” I drag Pepe, rushing to the ticket taker before the carriage starts to move. Very few people are riding the carousel. I pick a red horse for Pepe, then climb onto the wooden horse closest to the gold pumpkin carriage. The carousel starts to move. Odd music begins to play. We ride up and down among the colored lights. Butterfly Bow is really happy. She smiles, waving her hands at her side. I see her eyes, a charming emerald green. In stories, men call girls whose eyes are this shade of green sirens. The men bring those girls home, fondle them, then let them cry. I start to get excited. The horse under my body chases the carriage ahead of it with all its power.  Butterfly Bow looks as though her heart has opened with joy. She probably feels like she must be a real princess. I hope that she’ll also wave at me and smile and she does. Her smile brushes past us and I feel so lucky. She’s really beautiful. I’ll remember her the way she is right now, forever.  I love her. I always fall rashly in love with these sorts of girls. When they’re young, I meet them by chance then I fall in love with them. It’s a harmless love. Nothing ever comes of it.  I can put my love for them into the drawer of my heart. Pepe isn’t there. She’s not like those girls.  Because she is my drawer. Pepe knows I’ve never put her into the drawer of my heart. But she doesn’t know she is my drawer. This point is very important, and also very unimportant. In any case, we hate each other to death.  I hate Pepe, hate her telling her never-ending stories. Even without having her spring wound, those stories—so annoying they should just die—gush nonstop out of her body. Yet, pushing words out of me is gradually getting harder and harder. I’ve no strength left. I haven’t been speaking as much lately. I’ll speak even less until my mouth shuts up, forever.  Once, I searched all over without finding a trace of the key. I’ve already become a very person-like thing. I just need the key and I’ll be a person. No key and I will be dead. I’m almost dead now. Pepe is still telling stories nonstop.  The carousel keeps spinning round and round. We surround a large post, revolving around it. I’m behind Butterfly Bow, Butterfly Bow is behind Pepe and Pepe is behind me. No, Pepe, you’re in front of me. The carousel keeps spinning round and round. We surround a large post, revolving around it. I can’t see Pepe. However, Pepe, you must be there. Pepe, my Pepe.  I can just make out someone speaking. It’s Pepe. She’s telling stories again. The sound of her voice is odd, as though it’s being stretched and stretched by something. Drunks croon like this but, Pepe, why are you? This is not good.  It’s awkward and dangerous. I must have forgotten something important. As I was telling you the story, I must have left out something really important. I should have realized sooner. Every good storyteller ought to have mastered this sort of narration technique. I should have realized sooner. Because when we escaped from the house, I was the one who held Pepe’s hand tight. Out of so many people, I held her hand tight and have never ever let go.  I don’t realize this is a problem until we reach the Ferris wheel. Now, it’s too late. You can’t blame me for this. Pepe keeps telling stories. That story about witches wanting to play the subtraction game she’s told over a thousand times, but she’s never finished it even once. She is already mad. She glares at the sky, waiting, waiting, waiting, for the story to continue. Because she doesn’t continue the story herself, she grabs and scratches me like mad. A sharp, fearful sound erupts from her body. What is it, what is it, what is it? Blue-green fish swim across the black pools on her face. That sound still rings, piercing my ears.  Pepe’s an idiot. All she knows is to tell these stories she doesn’t understand over and over again. She doesn’t understand anything, but she wants to speak anyway. That’s simply how our creator designed us. The spring keeps unwinding. Stories are told. But after so many years have passed, no one remembers where, whatever weird place, those keys have been kept. At first, no one worried about this problem. Maybe because we can’t even find our own springs? Besides, that was a problem for years in the future. Many years have now passed, we’ve gone mad and the other kids have died. No one cares about those keys. No one worries about something that won’t matter yet for years. There’s just no story, that’s all.  It’ll be okay. It’ll be okay.  Bright light fills the amusement park. The smell of popcorn lingers in the air. The flavor of sweat, engine oil and sausages stick to the lights bulbs. Lamps light the Ferris wheel, making it seem like a giant pinwheel spinning slowly in the transparent wind. The places where Pepe grabbed me begin to itch. One by one, I scratch each itch. From all the rubbing, my body smells rotten. If not for wounds, kids who tell stories would never rot.  Underneath my khaki pants, my legs are filled with scars of wounds unable to heal.  Pepe is looking at me. She sits across from me, so peaceful. When she can’t go on with a story, she turns her face out the window. The sky is purple. The window faintly reflects us sitting together side by side. The Ferris wheel slowly rises. The people below us shrink. Pepe stands from her seat. She tugs a little at her full, white skirt.  “Let’s go to the amusement park,” she says as she leans out of the window, facing distant lights.  I stared closely at her. “This isn’t a story, Pepe? You can just speak now.”  Pepe’s head turns around. Laughter rushes at me. She hasn’t laughed like this in a long time.  I hold on to the railing as I fasten the catch. The wind’s blocked out. We’ve ridden in the Ferris wheel compartment to its highest point and soon it’ll slowly descend. On the ground, one by one, a crowd gathers facing something small and white. It’s so small that it’s more like a white speck.  Pepe, why are they talking about you? From up here, I can’t see clearly what you look like now. The Ferris wheel has already reached its highest point. The carriage will stop here for a moment, hanging by itself in mid-air. Then it’ll descend, descend to the earth. I’ll visit your body then leave. In my heart, I play over and over everything that will happen. It’s so chaotic below. They won’t pay any attention to me. I’ll show some sorrow and confusion. This way, they’ll believe you and I have nothing to do with each other then they’ll release me. Maybe they already know you’re a kid who tells stories. They’ll still guess you either jumped or were pushed from the top of the Ferris wheel. So I still have to play innocent for a while.  As far as I’m concerned, this isn’t hard. You know that I can lie. I think of what happens to me as a story. In a loud voice, I’ll recite the story version of me like an actor’s lines. As a result, they’ll think I’m a normal kid. What I’ll say are all things a normal kid says. They can’t see my spring unwind. It unwinds and unwinds, pushing hard against this scary world, turning what happened into a story. In my mind, I tell myself none of this is real. This is a story. A story, so a lie is no longer a lie. I’ve merely changed the way that I tell stories. Yes, Pepe, you knew. That’s why you laughed.  You kept laughing because you knew—the story of this amusement park was your final story.  I think maybe I’m wrong, perhaps I haven’t changed the way I tell stories, rather, I’m just living in a story. No, you’ll never understand these two aren’t the same. We’ll never understand.  But this doesn’t matter. You lie on the ground, peaceful, broken, accepting the crowd’s chatter. I’ll pass by your body then innocently leave.  That there’s no key isn’t my fault. Soon, I’ll become utterly silent yet alive forever. Killing you also isn’t my fault. I’ll live forever, and be utterly silent.  “Excuse me, you dropped something.” As I’m leaving the crowd, a woman calls to me. She sneaks me something. It’s ice cold and I almost shake it off my hand. I gaze at it. It’s a smashed up heart-shaped key. Your name is carved on it, Pepe. I know that this must be your heart. I know that this must be my key. I know.  But, Pepe, you know, I can no longer find my spring.  I lost it long ago.  We all lost our springs long ago.  Tang Fei is a member of Science Fiction and Fantasy Writers of America. Her works have appeared in Shanghai Literature, Flower City, and Fiction World. She has written fantasy, science fiction, fairy tales, and wuxia, but prefers to write in a way that straddles or stretches genre boundaries. Many of her stories have been published internationally and her work has been included in The Year’s Best Science Fiction in the United States. She has published a collection of stories, The Person Who Sees Cetus, and a novel, The Unknown Feast. Her story “Panda Breeder” was selected as Smokelong Quarterly’s Best Flash Fiction of 2019. The same year, “Wu Ding’s Journey to the West” won Speculative Fiction in Translation’s Most Popular Short Story silver medal. “Spore” was awarded the 2020 Chinese Readers’ Choice Awards (Gravity Awards) for best short story.  She is also involved in different art forms such as literary criticism, poetry, installation, and photography.  John Chu is a microprocessor architect by day, a writer, translator, and podcast narrator by night. His fiction has appeared or is forthcoming at Boston Review, Uncanny, Asimov's Science Fiction, and Tor.com among other venues. His translations have been published or is forthcoming at Clarkesworld, The Big Book of SF, and other venues. He has narrated for podcasts such as EscapePod, PodCastle, and Lightspeed. His story \"The Water That Falls on You from Nowhere\" won the 2014 Hugo Award for Best Short Story.", "text": "4970 words, short story\nPepe\n“Let’s go to the amusement park.” As Pepe speaks, a ray of red light scratches her face. Her face looks wounded then healed, welcoming some other color of light.\n“But we’re already here.” I look silly holding the cigarette, but I’m holding it anyway.\nWe stand in the shadow of a Ferris wheel. Pepe’s white silk skirt billows in the wind. Her long, slender legs never seem to touch the ground. I have to keep hold of her. This makes me look stupid, so it makes me angry.\nEven more annoying, when she hits me with her lollipop, I can’t hit back.\n“Hey, idiot, let’s go to the amusement park.”\n“But we’re already here.”\nHer eyes grow wide. She grabs my cigarette, takes a deep drag, then realizes I’ve only been pretending.\n“Pepe.” I want her to look at me, but her scarlet lips pout then she blows a smoke ring at the sky. The way she looks at the sky always make me nervous. Our creator put a tightly wound spring into our bodies. But, in the end, even he forgot where each spring’s key went to. By the time he died, rust covered our springs like lichen on his tombstone. Because we’ll never have tombstones, our creator gave us springs.\nHe was fair. I tell myself that a lot. I know that was me telling a lie, but who cares. I only lie when I’m telling stories and, whenever I speak, I can only tell stories.\nWe were created to tell stories. On a good day, a person can tell so many, many stories. They ought to have some principles in them—storytelling principles. But we don’t know any. We’re driven by tightly wound springs. Once they start turning, stories spin out of our bodies. We scatter them like seeds wherever we run to. When we tell stories, our lips wriggle as fast as flight. The people listening to us get dizzy. It’s better when they close their eyes as they listen. When they close their eyes, they can understand better the stories we tell. However, they can never fully understand.\nThis is how our creator first designed us. People called him a drunk. One day, after he poured his thirteenth shot of tequila (he’d downed only twelve shots at most before), suddenly, he smacked his head then rushed home. Black and white blocks of ideas collided in a great dark and bright river inside his body. Pain shook his hands, twisted his back, and made him howl. That night, our creator downed his thirteenth shot of tequila, he went home, then he created us.\nHe said we were salt. The salt of his palm. The salt of the earth.\nWhen he finished speaking, he drove us all away.\nThe scene was so chaotic. So small a house. So many people. Everyone craned their necks. So crowded. Bodies squeezed against bodies. All of them alike.\nThe hot air was insufferable. My skin hurt. My nose hurt. The pain in my throat rushed down into my heart. We exhaled the burning air then inhaled again. Everyone hurt but no one left. We were waiting for our creator to speak again but he didn’t. He rose, brandishing his fist to drive us all out of the house. Everyone ran, pushing and squeezing their way to the door, the extremely narrow door. Random shadows and screams rose from inside the room. Rocking and swaying, we collided onto the street.\nThe outside was so cool. The wind poured into my head through my ears. It blew away the screams but our shadows continued to scramble up the walls. My head opened like a gate and let the wind scream into an empty darkness just like the room I’d just left was now.\nWithout a thought, I ran and ran and ran.\nBefore I realized what had happened, it had happened. Pepe’s hand was in mine. Her hair and skirt fluttered backward in the wind like outstretched wings. We ran hand in hand into the darkness.\nThis is exactly how it happened.\nI was wearing khaki shorts. Pepe was wearing her white skirt. We ran hand in hand into the darkness.\nWe are story-telling machine kids. We’ll never grow up. Forever wearing khaki shorts. Forever wearing a white skirt. Forever, except for telling stories, unable to speak.\nThe crowd waiting to ride the pirate ship parts in two. The people in front scatter to make room for us. Adults, children, even infants all look at us with friendly expressions. I’ve told them Pepe is my kid sister, that she has a serious illness and that she doesn’t have many days left to live. Pepe is thrilled because she doesn’t need to wait in line to ride the pirate ship. She runs, dragging me to the front. I hear some people sigh. Pepe definitely doesn’t look normal. This make them believe my story even more. In the story I told these kind-hearted people, she’ll die soon. So no matter what she does, it will be forgiven. So long as she doesn’t say anything.\n“Before this world could yet have been considered a world, thirteen witches passed through here. As a result, they chose here to settle down. As a result, they became this world’s first witches. They predate this world.”\nI cover Pepe’s mouth and drag her away from the woman taking tickets. Pepe’s white skirt rustles as it grazes the woman’s red skirt. The ticket woman is still thinking about what Pepe said. When people speak, it must be for some practical reason. She can’t understand what Pepe’s words mean.\n“Your tickets?” Her gaze lingers on me.\nI hand over the tickets. At the same time, I compliment her eyes. “Once, I met a girl. Her eyes were extremely beautiful. Just like you.”\nShe smiles a little. She can understand my words. Or so she thinks.\nPepe and I sit at the prow of the pirate ship. Soon, the entire ship has filled up. People next to Pepe and me looked at our legs, which shake up and down as though we had leg cramps. They treat us like misbehaving children. If they knew who we were, they’d call the police to arrest us, or wait until the pirate ship swung into mid-air then toss us out.\nHowever, that era has long passed. That’s what their grandparents had done. Back then, they weren’t that old yet and they were stronger than us. Their bloodshot eyes, flaring nostrils, angry slogans and the loss of life. The fanaticism that fermented during day, the fanaticism that fermented during the deep purple night. I remember all those things.\nThose people were all drunk. In throngs, they searched every corner. They wanted to expose us, separate us from the other children wearing full, white skirts and khaki shorts. It always goes like this: They chase us, they block us, they surround us, they ask us questions. All the kids who can’t answer are grabbed by the ankle, lifted into the air, then shaken like empty pockets back and forth against walls, against utility poles, against the ground, against railings. Our bodies are so light. That’s how our creator designed us. Even if they smash us to pieces, we won’t leak tears.\nWe also don’t have blood.\nPeople walked over the tumbling bits of us that now covered the ground. They never wanted to know that originally we had hearts too. They just wanted us to die. We shouldn’t have been discovered. This world doesn’t need any stories because stories are wrong. They are dangerous and despicable. Desires meet and shine a light on the secrets of the heart. After the first time someone discovered his secret in a story, after that secret spread, people gradually fell out of love with listening to our nonsense. In it, they heard their own past, what they didn’t want other people to know. They shut our mouths. It’s always like that. This was just one battle.\nThey wanted to kill us then throw us away. So, they first let themselves think we were harmful beings to be feared. If they didn’t prevent it, one day in the future, we’d become so powerful and destructive, nothing could compare to us. After they convinced themselves, they started to tell others. At last, the most eloquent of them was selected to be their leader. When they assembled, he stood on a great, big platform and roared into the microphone. The dark, dense and turbulent crowd below, like the sea echoing the wind, roared in response.\nAt last, they waged war. They won.\nMany years later, the people who waged and fought the war were placed into Intensive Care Units, slow catheters inserted into their bodies. They were old now, settled down, near to death. The deathly pale hospital light shrouded their dull, ashen skin like a layer of dirty snow on the road. They’d finally calmed down. And I still have Pepe, sitting next to the children of their children riding the pirate ship together.\nThe pirate ship starts to move. Pepe squirms, tugging at my sleeve. She’s afraid of being rocked back and forth. The big machine starts to buzz. The first downswing is just a gentle sway. Pepe looks like she wanted to cry. She won’t stop beating her temples with her fists. I grab her wrists, but the disaster is about to start. Her tongue is moving, continuing the story she just started:\n“The witches loved to sing. They sang of the earth and there was the earth. They sang of the sky and there was the sky. They kept singing and this world changed into what it is now. At last, one day, the witches didn’t think this was fun any more. They had nothing left to sing about.\n“ ‘I don’t think we’re needed any more,’ the best tempered witch said.\n“ ‘Then let’s change the game we play,’ the smartest witch said.\n“ ‘Are you suggesting subtraction?’ guessed the the witch who understood people the best, cocking her head.\n“ ‘Right. Play a punishment game,’ the most brutal witch yelled, waving her arms.\n“The rest of the witches agreed, one after another. Just like that, the witches agreed to play the subtraction game.”\nI hug Pepe. No one listens to her story. Light and lively music starts to play. The pirate ship flies into the air. Everyone screams. Now the ship stops at the peak of its swing to the right for a couple seconds or maybe an hour. We’re at the bottom of the ship looking at the people at the top bowing their heads and staring at us. Their mouths stretch into large, black holes, exposing their throats. Only Pepe doesn’t scream. Her soft red lips change shape. She continues to tell her story. No one listens.\nI practically clamp her under my arms. Stay still, Pepe.\nPepe lets me. Her head droops. Just like before, she doesn’t move, not even one bit, her arms wrapped around my waist. I let go a little. Suddenly, the pirate ship falls. It swoops down from its peak on the right and inertia pushes it up to the left. I scream, pushing myself away from Pepe. She throws herself on me, choking me. Her fingernails have grown long again. I always remember to cut her fingernails. Every time, I cut down to down to nothing and, by the time we fight, I’m still scratched by them just the same. Her fingernails grow so fast. Pepe is just that kind of kid. Her hair and fingernails grow and grow like mad. Like the weeds in a wasteland, they never stop. Pepe is just that kind of kid. When she goes crazy, she doesn’t care who she hurts or what she destroys.\nI cave under her attack. She definitely hates me to death, brandishing her arms, wanting to rip me to pieces. My hairband breaks. Black hair scatters, fluttering like snakes in the air. Far away, the sky and earth quiver and sway. The music and shouting mix in the wind. The pirate ship stops. We’re at the very top, nearly parallel to the ground, our whole body weight straining against the seatbelts. You’re okay as long as you hold onto the armrest. However, I have to hold onto Pepe’s wrists. Loosen my grip even a little and she’ll start beating me again. Next time, she might use her teeth. Pepe, stay still, stay still. I face her and gaze into her eyes. That way, she’ll stay still. However, she hides her eyes behind her hair.\n“The witches want to play the subtraction game,” she says.\nPepe opens her mouth. A moist, warm breath rushes out. She cries. I stared at her, wordlessly. I want to save my strength.\nThe pirate ship drops to the ground. The moment of weightlessness is like leaving our bodies. I begin to laugh.\nOur arms untangle. She immediately curls into a ball.\nPepe must hate me to death. I’ve never told her stories. When she told stories, I never listened. Finally, I didn’t even let her tell stories. She knew why. However, she still has never paid any attention to me.\nSo, she became the way she is now. The stories that sprawled like weeds in her head filled her. Her eyes grew blacker by the day. Later, her fingernails grew black too. Finally, even her lips grew black. I had to take her to the doctor. (Our heads are the same as human’s. Even doctors can’t tell the difference.) The X-ray was completely black. I knew why. It was because of all the untold stories but I couldn’t tell the doctors that. I couldn’t even tell Pepe. The doctors met for a few days and still didn’t know what to do. At last, I suggested plastic surgery, at least to change her lips back. Pepe constantly biting me had given her a chocolate smile.\nThe surgery was a huge success. They gave her strawberry red lips. Everyone was thrilled. Pepe thought she’d been completely cured. That day, she was truly happy, but she still bit my earlobes. Finally, I realized that, by then, Pepe was already wrong in the head. Her eyes seemed just like black pools, almost without whites. Not long after, Pepe became truly crazy.\nHer eyes seem just like black pools, shining with a fuliginous light.\nAs long as I listen to her stories, everything’s fine. This way, she won’t get frenzied. I can also tell her my stories. This way, we’ll both be a little more comfortable. However, I don’t want to. I’m fed up. I hate Pepe.\nEven though I can pretend what I do is for her own good, and she’s definitely getting better by the day, even though I can pretend I don’t know I’m hurting her, I know she’s not happy. She’s crazy now. What I’m doing I do on purpose. I hate her and her stories.\nCome on, Pepe. Use your fingernails to rip open my chest. I want to tear off your scalp.\nThings are always like this. We wrestle, claw, and hate each other to death. But neither one of us ever leaves the other.\nMaybe I’m also going crazy. Maybe I’m already crazy.\nI never let Pepe know about going crazy. On the other hand, I still wanted to work hard to pretend we were normal kids. No, we weren’t kids who told stories. No, we didn’t tell stories at all. People believed us. They knew our creator didn’t give us programs for telling intentional lies. Our creator created us only to tell stories. Except for stories, we couldn’t say anything. This was how people recognized us.\nThey asked us questions.\nThey killed those who couldn’t speak.\nThey killed those who told stories.\nThose kids were exactly like us. They were shaken back and forth like empty flour sacks, just like us right now.\nWhen the massacre started, Pepe and I saw them die with our own eyes. We didn’t grieve. We didn’t get angry. After all, death is death. Death is also nothing. Death is slight, just like an empty flour sack.\nI didn’t want to die, not one bit. When they ripped me away from the rest of the kids, I held onto Pepe’s hand and never let go. A lot of people tried to pry our hands apart, but they were wasting their strength. A fool carrying a knife threatened to cut off our hands if we didn’t let go. Pepe and I set our throats free. We began crying. Immediately, all the other kids began crying too. The adults panicked. At last, the adult who started this let us answer their questions together. “Either they both are or they both aren’t. Answering together might save some time.” So they asked their questions.\nI opened my mouth. I made sounds. I spoke. I didn’t tell stories. As a result, we survived.\nThey gave us yellow, five-pointed stars. We stuck them on our chests as we walked into another group of kids. They wore khaki pants or full, white skirts. They all had yellow, five-pointed stars fastened on their chests. The kids who didn’t have yellow, five-pointed stars were on the other side. Among them, so many looked at me, astounded. Their pale faces shone with the blackness of night. They looked at me with amazement, to the point that they forgot that they were about to die.\nThis was not part of our creator’s original plan. We were created following the same steps for the same purpose. Finally, for the same reason, we ought to be killed in the same way. I shouldn’t leave them because we’re the same kind of kids. They knew that but had no way to say it.\nPerhaps they could have told stories, told treasonous and false stories. If the adults were smart, perhaps they could have figured out that I was actually telling a story, one that didn’t believe that it was story. However, the kids didn’t have time. They’d be dead soon. After they died, they’d be like empty flour sacks. They’d be nothing.\nNothing I did could seem out of the ordinary. When they asked me questions, I was certainly telling them stories. I treated everything that happened as a story to tell. You see, survival was just that simple. None of this is the truth. All of this is a story. As long as you think this, you can recount events in the way humans speak because you’re telling a story. This isn’t anything unusual. Those who are like us are unusual. I, myself, am also a little unusual.\nOnly Pepe doesn’t seem unusual. Maybe she knew long ago that I’d act like this. Because she was also not unusual, we could survive. Even though the rest of the kids who told stories were all unusual, they wanted to survive. From among those kids, I saved only Pepe. This was inevitable after we’d rushed out of that black room together. I thought, for kids who told stories, Pepe and I had brains that were atypical.\nWe were atypical from the start. This notion stops my hand. A few hits later, Pepe also calms down. Her black eyes gaze at me, her long hair draped over shoulders. The world is no longer in upheaval. The pirate ship has stopped.\nPeople disembark from the pirate ship. A girl with blond hair tied with a pink butterfly bow walks ahead of us. Her skirt is also pink, highly creased and topped with lace. Very pretty, but not as pretty as the graceful arc of her calves. I can’t see her face.\n“The tortoise and the hare raced. The tortoise was always behind. He wanted to see the hare’s face. That way, he could find out the color of her eyes.”\nThat is Pepe telling her shortest story.\nI laugh. Pepe doesn’t know that the tortoise also longed for the hare’s lips. She’s still too young, so she doesn’t understand desire. But I have desire. I want to know. Kids who tell stories are kids who have no needs. We eat. We sleep. We tell stories, but not from need. But on that day, when I came to treat this world as a story, I suddenly developed desire. At that moment, I understood this world even better. I understood even better the stories we told and spread.\n“Let’s ride the carousel, okay?” I said to Pepe.\nShe lowers her head, staring at her rounded leather shoes. Pink Butterfly Bow has just entered a gold pumpkin carriage.\n“Come.” I drag Pepe, rushing to the ticket taker before the carriage starts to move. Very few people are riding the carousel. I pick a red horse for Pepe, then climb onto the wooden horse closest to the gold pumpkin carriage. The carousel starts to move. Odd music begins to play. We ride up and down among the colored lights. Butterfly Bow is really happy. She smiles, waving her hands at her side. I see her eyes, a charming emerald green. In stories, men call girls whose eyes are this shade of green sirens. The men bring those girls home, fondle them, then let them cry. I start to get excited. The horse under my body chases the carriage ahead of it with all its power.\nButterfly Bow looks as though her heart has opened with joy. She probably feels like she must be a real princess. I hope that she’ll also wave at me and smile and she does. Her smile brushes past us and I feel so lucky. She’s really beautiful. I’ll remember her the way she is right now, forever.\nI love her. I always fall rashly in love with these sorts of girls. When they’re young, I meet them by chance then I fall in love with them. It’s a harmless love. Nothing ever comes of it.\nI can put my love for them into the drawer of my heart. Pepe isn’t there. She’s not like those girls.\nBecause she is my drawer. Pepe knows I’ve never put her into the drawer of my heart. But she doesn’t know she is my drawer. This point is very important, and also very unimportant. In any case, we hate each other to death.\nI hate Pepe, hate her telling her never-ending stories. Even without having her spring wound, those stories—so annoying they should just die—gush nonstop out of her body. Yet, pushing words out of me is gradually getting harder and harder. I’ve no strength left. I haven’t been speaking as much lately. I’ll speak even less until my mouth shuts up, forever.\nOnce, I searched all over without finding a trace of the key. I’ve already become a very person-like thing. I just need the key and I’ll be a person. No key and I will be dead. I’m almost dead now. Pepe is still telling stories nonstop.\nThe carousel keeps spinning round and round. We surround a large post, revolving around it. I’m behind Butterfly Bow, Butterfly Bow is behind Pepe and Pepe is behind me. No, Pepe, you’re in front of me. The carousel keeps spinning round and round. We surround a large post, revolving around it. I can’t see Pepe. However, Pepe, you must be there. Pepe, my Pepe.\nI can just make out someone speaking. It’s Pepe. She’s telling stories again. The sound of her voice is odd, as though it’s being stretched and stretched by something. Drunks croon like this but, Pepe, why are you? This is not good.\nIt’s awkward and dangerous. I must have forgotten something important. As I was telling you the story, I must have left out something really important. I should have realized sooner. Every good storyteller ought to have mastered this sort of narration technique. I should have realized sooner. Because when we escaped from the house, I was the one who held Pepe’s hand tight. Out of so many people, I held her hand tight and have never ever let go.\nI don’t realize this is a problem until we reach the Ferris wheel. Now, it’s too late. You can’t blame me for this. Pepe keeps telling stories. That story about witches wanting to play the subtraction game she’s told over a thousand times, but she’s never finished it even once. She is already mad. She glares at the sky, waiting, waiting, waiting, for the story to continue. Because she doesn’t continue the story herself, she grabs and scratches me like mad. A sharp, fearful sound erupts from her body. What is it, what is it, what is it? Blue-green fish swim across the black pools on her face. That sound still rings, piercing my ears.\nPepe’s an idiot. All she knows is to tell these stories she doesn’t understand over and over again. She doesn’t understand anything, but she wants to speak anyway. That’s simply how our creator designed us. The spring keeps unwinding. Stories are told. But after so many years have passed, no one remembers where, whatever weird place, those keys have been kept. At first, no one worried about this problem. Maybe because we can’t even find our own springs? Besides, that was a problem for years in the future. Many years have now passed, we’ve gone mad and the other kids have died. No one cares about those keys. No one worries about something that won’t matter yet for years. There’s just no story, that’s all.\nIt’ll be okay. It’ll be okay.\nBright light fills the amusement park. The smell of popcorn lingers in the air. The flavor of sweat, engine oil and sausages stick to the lights bulbs. Lamps light the Ferris wheel, making it seem like a giant pinwheel spinning slowly in the transparent wind. The places where Pepe grabbed me begin to itch. One by one, I scratch each itch. From all the rubbing, my body smells rotten. If not for wounds, kids who tell stories would never rot.\nUnderneath my khaki pants, my legs are filled with scars of wounds unable to heal.\nPepe is looking at me. She sits across from me, so peaceful. When she can’t go on with a story, she turns her face out the window. The sky is purple. The window faintly reflects us sitting together side by side. The Ferris wheel slowly rises. The people below us shrink. Pepe stands from her seat. She tugs a little at her full, white skirt.\n“Let’s go to the amusement park,” she says as she leans out of the window, facing distant lights.\nI stared closely at her. “This isn’t a story, Pepe? You can just speak now.”\nPepe’s head turns around. Laughter rushes at me. She hasn’t laughed like this in a long time.\nI hold on to the railing as I fasten the catch. The wind’s blocked out. We’ve ridden in the Ferris wheel compartment to its highest point and soon it’ll slowly descend. On the ground, one by one, a crowd gathers facing something small and white. It’s so small that it’s more like a white speck.\nPepe, why are they talking about you? From up here, I can’t see clearly what you look like now. The Ferris wheel has already reached its highest point. The carriage will stop here for a moment, hanging by itself in mid-air. Then it’ll descend, descend to the earth. I’ll visit your body then leave. In my heart, I play over and over everything that will happen. It’s so chaotic below. They won’t pay any attention to me. I’ll show some sorrow and confusion. This way, they’ll believe you and I have nothing to do with each other then they’ll release me. Maybe they already know you’re a kid who tells stories. They’ll still guess you either jumped or were pushed from the top of the Ferris wheel. So I still have to play innocent for a while.\nAs far as I’m concerned, this isn’t hard. You know that I can lie. I think of what happens to me as a story. In a loud voice, I’ll recite the story version of me like an actor’s lines. As a result, they’ll think I’m a normal kid. What I’ll say are all things a normal kid says. They can’t see my spring unwind. It unwinds and unwinds, pushing hard against this scary world, turning what happened into a story. In my mind, I tell myself none of this is real. This is a story. A story, so a lie is no longer a lie. I’ve merely changed the way that I tell stories. Yes, Pepe, you knew. That’s why you laughed.\nYou kept laughing because you knew—the story of this amusement park was your final story.\nI think maybe I’m wrong, perhaps I haven’t changed the way I tell stories, rather, I’m just living in a story. No, you’ll never understand these two aren’t the same. We’ll never understand.\nBut this doesn’t matter. You lie on the ground, peaceful, broken, accepting the crowd’s chatter. I’ll pass by your body then innocently leave.\nThat there’s no key isn’t my fault. Soon, I’ll become utterly silent yet alive forever. Killing you also isn’t my fault. I’ll live forever, and be utterly silent.\n“Excuse me, you dropped something.” As I’m leaving the crowd, a woman calls to me. She sneaks me something. It’s ice cold and I almost shake it off my hand. I gaze at it. It’s a smashed up heart-shaped key. Your name is carved on it, Pepe. I know that this must be your heart. I know that this must be my key. I know.\nBut, Pepe, you know, I can no longer find my spring.\nI lost it long ago.\nWe all lost our springs long ago.\nTang Fei is a member of Science Fiction and Fantasy Writers of America. Her works have appeared in Shanghai Literature, Flower City, and Fiction World. She has written fantasy, science fiction, fairy tales, and wuxia, but prefers to write in a way that straddles or stretches genre boundaries. Many of her stories have been published internationally and her work has been included in The Year’s Best Science Fiction in the United States. She has published a collection of stories, The Person Who Sees Cetus, and a novel, The Unknown Feast. Her story “Panda Breeder” was selected as Smokelong Quarterly’s Best Flash Fiction of 2019. The same year, “Wu Ding’s Journey to the West” won Speculative Fiction in Translation’s Most Popular Short Story silver medal. “Spore” was awarded the 2020 Chinese Readers’ Choice Awards (Gravity Awards) for best short story.\nShe is also involved in different art forms such as literary criticism, poetry, installation, and photography.\nJohn Chu is a microprocessor architect by day, a writer, translator, and podcast narrator by night. His fiction has appeared or is forthcoming at Boston Review, Uncanny, Asimov's Science Fiction, and Tor.com among other venues. His translations have been published or is forthcoming at Clarkesworld, The Big Book of SF, and other venues. He has narrated for podcasts such as EscapePod, PodCastle, and Lightspeed. His story \"The Water That Falls on You from Nowhere\" won the 2014 Hugo Award for Best Short Story.", "source": "https://clarkesworldmagazine.com/fei_06_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pepe by Tang Fei, translated by John Chu"}