{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nancy Kress", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6DzZHTqJYQ0x9OS2bWHuqz0EYg8=", "id": null, "license": null, "comments": "", "raw_text": "9900 words, novelette, REPRINT  Pathways  The Chinese clinic warn’t like I expected. It warn’t even Chinese.  I got there afore it opened. I was hoping to get inside afore anybody else came, any neighbors who knew us or busybodies from Blaine. But Carrie Campbell was already parked in her truck, the baby on her lap. We nodded to each other but didn’t speak. The Campbells are better off than us—Dave works in the mine up to Allington—but old Gacy Campbell been feuding with Dr. Harman for decades and Carrie was probably glad to have someplace else to take the baby. He didn’t look good, snuffling and whimpering.  When the doors opened, I went in first, afore Carrie was even out of the truck. It was going to take her a while. She was pregnant again.  “Yes?” said the woman behind the desk. Just a cheap metal desk, which steadied me some. The room was nothing special, just a few chairs, some pictures on the wall, a clothes basket of toys in the corner. What really surprised me was that the woman warn’t Chinese. Blue eyes, brown hair, middle-aged. She looked a bit like Granmama, but she had all her teeth. “Can I help you?”  “I want to see a doctor.”  “Certainly.” She smiled. Yeah, all her teeth. “What seems to be the problem, miss?”  “No problem.” From someplace in the back another woman came out, this one dressed like a nurse. She warn’t Chinese either.  “I don’t understand,” the woman behind the desk said. From her accent she warn’t from around here—like I didn’t already know that. “Are you sick?”  “No, ma’am.”  “Then how can I—”  Carrie waddled into the door, the baby balanced on her belly. Now my visit would be table-talk everywhere. All at once I just wanted to get it over with.  “I’m not sick,” I said, too loud. “I just want to see a doctor.” I took a deep breath. “My name is Ludmilla Connors.”  The nurse stopped walking toward Carrie. The woman behind the counter half stood up, then sat down again. She tried to pretend like she hadn’t done it, like she warn’t pleased. If Bobby were that bad a liar, he’d a been in jail even more than he was.  “Certainly,” the woman said. I didn’t see her do nothing, but a man came out from the back, and he was Chinese. So was the woman who followed him.  “I’m Ludmilla Connors,” I told him, and I clenched my ass together real hard to keep my legs steady. “And I want to volunteer for the experiment. But only if it pays what I heard. Only if.”  The woman behind the desk took me back to a room with a table and some chairs and a whole lot of filing cabinets, and she left me there with the Chinese people. I looked at their smooth faces with those slanted, mostly closed eyes, and I wished I hadn’t come. I guess these two were the reason everybody hereabouts called it the “Chinese clinic,” even if everybody else there looked like regular Americans.  “Hello, Ms. Connors,” the man said and he spoke English real good, even if it was hard to understand some words. “We are glad you are here. I am Dr. Dan Chung and this is my chief technician Jenny.”  “Uh huh.” He didn’t look like no “Dan,” and if she was “Jenny,” I was a fish.  “Your mother is Courtney Connors and your father was Robert Connors?”  “How’d you know that?”  “We have family trees for everyone on the mountain. It’s part of our work, you know. You said you want to aid us in this research?”  “I said I want to get paid.”  “Of course. You will be. You are nineteen.”  “Yeah.” It warn’t a question, and I didn’t like that they knew so much about me. “How much money?”  He told me. It warn’t as much as the rumors said, but it was enough. Unless they actually killed me, it was enough. And I didn’t think they’d do that. The government wouldn’t let them do that—not even this stinking government.  “Okay,” I said. “Start the experiment.”  Jenny smiled. I knew that kind of smile, like she was so much better than me. My fists clenched. Dr. Chung said, “Jenny, you may leave. Send in Mrs. Cully, please.”  I liked the surprised look on Jenny’s face, and then the angry look she tried to hide. Bitch.  Mrs. Cully didn’t act like Jenny. She brought in a tray with coffee and cookies: just regular store-bought Pepperidge Farm, not Chinese. Under the tray was a bunch of papers. Mrs. Cully sat down at the table with us.  “These are legal papers, Ms. Connors,” Dr. Chung said. “Before we begin, you must sign them. If you wish, you can take them home to read, or to a lawyer. Or you can sign them here, now. They give us permission to conduct the research, including the surgery. They say that you understand this procedure is experimental. They give the university, myself, and Dr. Liu all rights to information gained from your participation. They say that we do not guarantee any cure, or even any alleviation, of any medical disorder you may have. Do you want to ask questions?”  I did, but not just yet. Half of me was grateful that he didn’t ask if I can read, the way tourists and social workers sometimes do. I can, but I didn’t understand all the words on this page: indemnify, liability, patent rights. The other half of me resented that he was rushing me so.  I said something I warn’t intending: “If Ratface Rollins warn’t president, this clinic wouldn’t be here at all!”  “I agree,” Dr. Chung said. “But you Americans elected a Libertarian.”  “Us Americans? Aren’t you one?”  “No. I am a Chinese national, working in the United States on a visa arranged by my university.”  I didn’t know what to say to that, so I grabbed the pen and signed everything. “Let’s get it over with, then.”  Both Dr. Chung and Mrs. Cully looked startled. She said, “But . . . Ludmilla, didn’t you understand that this will take several visits, spread out over months?”  “Yeah, I know. And that you’re going to pay me over several months, too, but the first bit today.”  “Yes. After your interview.”  She had one of those little recording cubes that I only seen on TV. They can play back an interview like a movie, or they can send the words to a computer to get put on screen. Maybe today would be just talking. That would be fine with me. I took a cookie.  “Initial interview with experimental subject Ludmilla Connors,” Dr. Chung said, and gave the date and time. “Ms. Connors, you are here of your own free will?”  “Yeah.”  “And you are a member of the Connors family, daughter of Courtney Ames Connors and the late Robert Connors?”  “Did you know my dad at the hospital? Were you one of his doctors?”  “No. But I am familiar with his symptoms and his early death. I am sorry.”  I warn’t sorry. Dad was a son-of-a-bitch even afore he got sick. Maybe knowing it was coming, that it was in his genes, made him that way, but a little girl don’t care about that. I only cared that he hit me and screamed at me—hit and screamed at everybody until the night he took after Dinah so bad that Bobby shot him. Now Bobby, just four months from finishing doing his time at Luther Luckett, was getting sick, too. I knew I had to tell this foreigner all that, but it was hard. My family don’t ask for help. “We don’t got much,” Granmama always said, “but we got our pride.”  That, and the Connors curse. Fatal Familial Insomnia.  It turned out that Dr. Chung already knew a lot of my story. He knew about Dad, and Bobby, and Mama, and Aunt Carol Ames. He even knew which of the kids got the gene—it’s a 50-50 chance—and which didn’t. The safe ones: Cody, Patty, Arianna, Timothy. The losers: Shawn, Bonnie Jean, and Lewis. And me.  So I talked and talked, and the little light on the recording cube glowed green to show it was on, and Mrs. Cully nodded and looked sympathetic so damn much that I started wishing for Jenny back. Dr. Chung at least sat quiet, with no expression on that strange ugly face.  “Are you showing any symptoms at all, Ms. Connors?”  “I have some trouble sleeping at night.”  “Describe it for me, in as much detail as you can.”  I did. I knew I was young to start the troubles; Mama was forty-six and Bobby twenty-nine.  “And the others with the FFI gene? Your mother and Robert, Jr. and”—he looked at a paper—“Shawn Edmond and—”  “Look,” I said, and it came out harsher than I meant, “I know I got to tell you everything. But I’m not going to talk none about any of my kin, not what they are or aren’t doing. Especially not to a Chinaman.”  Silence.  Then Dr. Chung said quietly, “I think, Ms. Connors, that you must not know how offensive that term is. Like ‘spic’ or ‘nigger.’”  I didn’t know. I felt my face grow warm.  He said, “I think it’s like ‘hillbilly’ is to mountain people.”  My face got even warmer. “I . . . I’m sorry.”  “It’s okay.”  But it warn’t. I’m not the kind to insult people, even Chinese people. I covered my embarrassment with bluster. “Can I ask some questions for a change?”  “Of course.”  “Is this Chi—did this clinic come to Blaine and start treating people for what ails them, just to get my family’s trust so you all can do these experiments on our brains?”  That was the scuttlebutt in town and I expected him to deny it, but instead he said, “Yes.”  Mrs. Cully frowned.  I said, “Why? Because there are only forty-one families in the whole world with our sickness? Then why build a whole clinic just to get at us? We’re just a handful of folk.”  He said gently, “You know a lot about fatal familial insomnia.”  “I’m not stupid!”  “I would never think that for even a moment.” He shifted in his chair and turned off the recorder. “Listen, Ms. Connors. It’s true that sufferers from FFI are a very small group. But the condition causes changes in the brain that involve neural pathways which everybody has. Memory is involved, and sleep regulation, and a portion of the brain called the thalamus that processes incoming sensory signals. Our research here is the best single chance to gain information beyond price about those pathways. And since we also hope to arrest FFI, we were able to get funding as a medical clinical trial. Your contribution to this science will be invaluable.”  “That’s not why I’m doing it.”  “Whatever your reasons, the data will be just as valuable.”  “And you know you got to do it to me fast. Afore the Libertarians lose power.”  Mrs. Cully looked surprised. Why was she still sitting with us? Then I realized: Dr. Chung warn’t supposed to be alone with a young woman. Well, fine by me. But at least he didn’t seem surprised that I sometimes watch the news.  “That’s true,” he said. “If Rafe Bannerman wins this presidential election, and it certainly looks as if he will, then all the deregulations of the present administration may be reversed.”  “So you got to cut into my skull afore then. And afore I get too sick.” I said it nasty, goading him. I don’t know why.  But he didn’t push back. “Yes, we must install the optogenetic cable as soon as possible. You are a very bright young woman, Ms. Connors.”  “Don’t try to butter me up none,” I said.  But after he took blood samples and all the rest of it, after we set up a whole series of appointments, after I answered ten million more questions, the Chinaman’s—no, Chinese man’s—words stayed in my head all the long trudge back up the mountain. Not as bright, those words, as the autumn leaves turning the woods to glory, but it was more praise than I’d gotten since I left school. That was something, anyway.  When I got back to the trailer, about noon, nobody wouldn’t speak to me. Carrie must of dropped by. Bobby’s wife, Dinah, sewed on her quilt for the women’s co-op: the Rail Fence pattern in blue and yellow, real pretty. Mama sat smoking and drinking Mountain Dew. Granmama was asleep in her chair by the stove, which barely heated the trailer. It was cold for October and Bobby didn’t dig no highway coal again. The kids were outside playing, Shawn warn’t around, and inside it was silent as the grave.  I hung my coat on a door hook. “That quilt’s coming nice, Dinah.”  Nothing.  “You need some help, Mama?”  Nothing.  “The hell with you all!” I said.  Mama finally spoke. At least today she was making sense. “You better not let Bobby hear where you been.”  “I’m doing it for you all!” I said, but they all went back to pretending I didn’t exist. I grabbed my coat, and stomped back outside.  Not that I had anyplace to go. And it didn’t matter if I was inside or out; Mama’s words were the last ones anyone spoke to me for two mortal days. They hardly even looked at me, except for scared peeps from the littlest kids and a glare from Bonnie Jean, like nobody except a ten-year-old can glare. It was like I was dead.  But half the reason I was doing this was the hope—not strong, but there—that maybe I wouldn’t end up dead, after first raving and thrashing and trying to hurt people and seeing things that warn’t there. Like Dad, like Aunt Carol Ames, like Cousin Jess. And the other half of the reason was to put some decent food on the table for the kids that wouldn’t look at me or speak to me from fear that Bobby would switch them hard. I had hopes of Shawn, who hadn’t been home in a couple of days, out deer hunting with his buddies. Shawn and I always been close, and he was sweeter than Bobby even afore Bobby started showing our sickness. I hoped Shawn would be on my side. I needed somebody.  But that night in bed, with Patty on my other side as far away as she could get without actually becoming part of the wall, Bonnie Jean spooned into me. She smelled of apples and little kid. I hugged onto her like I warn’t never going to let go, and I stayed that way all through the long cold night.  “We have good news,” Dr. Chung said. “Your optogenetic vectors came out beautifully.”  “Yeah? What does that mean?” I didn’t really care, but my nerves were all standing on end and if I kept him talking, maybe it would distract me some. Or not.  We sat in his lab at the Chinese clinic, a squinchy little room all cluttered with computers and papers. No smoking bottles or bubbling tubes like in the movies, though. Maybe those were in another room. There was another Chinese doctor, too, Dr. Liu. Also Jenny, worse luck, but if she was the “chief technician” I guess she had to be around. I kept my back to her. She wore a pretty red shirt that I couldn’t never afford to buy for Patty or Bonnie Jean.  “What does that mean?” I said, realized I’d said it afore, and twisted my hands together.  “It means we have constructed the bio-organism to go into your brain, from a light-sensitive opsin, a promoter, and a harmless virus. The opsin will be expressed in only those cells that activate the promoter. When light of a specific wavelength hits those cells, they will activate or silence, and we can control that by—Ms. Connors, you can still change your mind.”  “What?” Jenny said, and Dr. Chung shot her a look that could wither skunkweed. I wouldn’t of thought he could look like that.  “My mind is changed,” I said. His talking warn’t distracting me, it was just making it all worse. “I don’t want to do it.”  “All right.”  “She signed the contracts!” Jenny said.  I whirled around on my chair to face her. “You shut up! Nobody warn’t talking to you!”  Jenny got up and stalked out. Dr. Liu made like he would say something, then didn’t. Over her shoulder Jenny said, “I’ll call Dr. Morton. Although too bad she didn’t decide that before the operating room was reserved at Johnson Memorial.”  “I’m sorry,” I said, and fled.  I got home, bone-weary from the walk plus my worst night yet, just as Jimmy Barton’s truck pulled up at the trailer. Jimmy got out, looking grim, then two more boys, carrying Shawn.  I rushed up. “What happened? Did you shoot him?” Everybody knew that Jimmy was the most reckless hunter on the mountain.  “Naw. We never even got no hunting. He went crazy, is what. So we brought him back.”  “Crazy how?”  “You know how, Ludie,” Jimmy said, looking at me steady. “Like your family does.”  “But he’s only seventeen!”  Jimmy didn’t say nothing to that, and the other two started for the trailer with Shawn. He had a purpled jaw where somebody slugged him, and he was out cold on whatever downers they made him take. My gut twisted so hard I almost bent over. Shawn. Seventeen.  Dinah and Patty came rushing out, streaming kids behind them. Dinah was shrieking enough to wake the dead. I looked at Shawn and thought about how it must of been in the hunting camp, him going off the rails and “expressing” that gene all over the place: shouting from the panic, grabbing his rifle and waving it around, heart pounding like mad, hitting out at anyone who talked sense. Like Bobby had been a few months ago, afore he got even worse. Nobody in my family ever lasted more than seven months after the first panic attack.  Shawn.  I didn’t even wait to see if Mama was coming out of the trailer, if this was one of the days she could. I went back down the mountain, running as much as I could, gasping and panting, until I got to the Chinese clinic and the only hope I had for Shawn, for me, for all of us.  Dr. Morton turned out to be a woman. While they got the operating room ready at Johnson Memorial in Jackson, I sat with Dr. Chung in a room that was supposed to look cheerful and didn’t. Yellow walls, a view of the parking lot. A nurse had shaved off a square patch on my hair. I stared out at a red Chevy, trying not to think. Dr. Chung said gently, “It isn’t a complicated procedure, Ms. Connors. Really.”  “Drilling a hole into my skull isn’t complicated?”  “No. Humans have known how to do that part for thousands of years.”  News to me. I said, “I forgot a hat.”  “A hat?”  “To cover this bare spot in my hair.”  “The first person from your family to visit, I will tell them.”  “Nobody’s going to visit.”  “I see. Then I will get you a hat.”  “Thanks.” And then, surprising myself, “They don’t want me to do none of this.”  “No,” he said quietly, and without asking what I meant, “I imagine they do not.”  “They think you conduct experiments on us like we’re lab animals. Like with the Nazis. Or Frankenstein.”  “And what do you think?”  “I think they are . . . unknowing.” It felt like a huge betrayal. Still, I kept on. “Especially my Granmama.”  “Grandmothers are often fierce. Mine is.” He made some notes on a tablet, typing and swiping without looking at it.  I hadn’t thought of him—of any of them—as having a grandmother. I demanded, like that would make this grandmother more solid, “What’s her name?”  “Chunhua. What is the name of your grandmother?”  “Ludmilla. Like me.” I thought a minute. “‘Fierce’ is the right word.”  “Then we have this in common, yes?”  But I warn’t yet ready to give him that much. “I bet my granmama is more fierce than any of your kin.”  He smiled, a crinkling of his strange bald face, eyes almost disappearing in folds of smooth skin. “I would—what is it you say, in poker?—‘see that bet’ if I could.”  “Why can’t you?”  He didn’t answer, and his smile disappeared. I said, “What did your granmama do that was so fierce?”  “She made me study. Hours every day, hours every night. All spring, all summer, all winter. When I refused, she beat me. What does yours do?”  All at once I didn’t want to answer. Was beating better or worse? Granmama never touched me, nor any of us. Dr. Chung waited. Finally I said, “She freezes me. Looks at me like . . . like she wants to make a icy wind in my mind. And then that wind blows, and I can’t get away from it nohow, and then she turns her back on me.”  “That is worse.”  “Really? You think so?”  “I think so.”  A long breath went out of me, clearing out my chest. I said, “Bobby warn’t always like he is now. He taught me to fish.”  “Do you like fishing?”  “No.” But I liked Bobby teaching me, just the two of us laughing down by the creek, eating the picnic lunch Mama put up for us.  A nurse, masked and gowned like on TV, came in and said, “We’re ready.”  The last thing I remember was lying on the table, breathing in the knock-out gas, and thinking, Now at least I’m going to get a long deep sleep. Only at the very last minute I panicked some and my hand, strapped to the table, flapped around a bit. Another hand held it, strong and steady. Dr. Chung. I went under.  When I woke, it was in a different hospital room but Dr. Chung was still there, sitting in a chair and working a tablet. He put it down.  “Welcome back, Ms. Connors. How do you feel?”  I put my hand to my head. A thick bandage covered part of it. Nothing hurt, but my mouth was dry, my throat was scratchy, and I had a floaty feeling. “What do you got me on? Oxycontin?”  “No. Steroids to control swelling and a mild pain med. There are only a few nerve receptors in the skull. Tomorrow we will take you back to Blaine. Here.”  He handed me a red knit hat.  All at once I started to cry. I never cry, but this was so weird—waking up with something foreign in my skull, and feeling rested instead of skitterish and tired, and then this hat from this strange-looking man . . . I sobbed like I was Cody, three years old with a skinned knee. I couldn’t stop sobbing. It was awful.  Dr. Chung didn’t high-tail it out of there. He didn’t try to there-there me, or take my hand, or even look embarrassed and angry mixed together, like every other man I ever knowed when women cry. He just sat and waited, and when I finally got myself to stop, he said, “I wish you would call me ‘Dan.’”  “No.” Crying had left me embarrassed, if not him. “It isn’t your name. Is it?”  “No. It just seems more comfortable for Westerners.”  “What is your damned name?”  “It is Hai. It means ‘the ocean.’”  “You’re nothing like any ocean.”  “I know.” He grinned.  “Do all Chinese names mean something?”  “Yes. I was astonished when I found out American names do not.”  “When was that?”  “When I came here for graduate school.”  I was talking too much. I never rattled on like this, especially not to Chinese men who had me cut open. It was the damn drugs they gave me, that thing for swelling or the “mild pain med.” I’d always stayed strictly away from even aspirin, ’cause of watching Mama and Bobby. Afore I could say anything, Dr. Chung said, “Your meds might induce a little ‘high,’ Ludmilla. It will pass soon. Meanwhile, you are safe here.”  “Like hell I am!”  “You are. And I apologize for calling you ‘Ludmilla.’ I have not received permission.”  “Oh, go the fuck ahead. Only it’s ‘Ludie.’” I felt my skull again. I wanted to rip off the bandage. I wanted to run out of the hospital. I wanted to stay in this bed forever, talking, not having to deal with my family. I didn’t know what I wanted.  Maybe Dr. Chung did, because he went on talking, a steadying stream of nothing: graduate school in California and riding busses in China and his wife’s and daughters’ names. They were named after flowers, at least in English: Lotus and Jasmine and Plum Blossom. I liked that. I listened, and grew sleepy, and drifted into dreams of girls with faces like flowers.  I was two days in Johnson Memorial and two more in a bed at the clinic, and every single one of them I worried about Shawn. Nobody came to see me. I thought Patty might, or maybe even Dinah if Bobby’d a let her, but they didn’t. Well, Patty was only twelve, still pretty young to come alone. So I watched TV and I talked with Dr. Chung, who didn’t seem to have a whole lot to do.  “Don’t you got to see patients?”  “I’m not an M.D., Ludie. Dr. Liu mostly sees the patients.”  “How come Blaine got so many Chinese doctors? Aren’t Americans working on optogenetics?”  “Of course they are. Liu Bo and I became friends at the university and so applied for this grant together.”  “And you brought Jenny.”  “She is Bo’s fiancé.”  “Oh. She warn’t—there he is, the bastard!”  President Rollins was on TV, giving a campaign speech. Red and blue balloons sailed up behind him. My hands curled into fists. Dr. Chung watched me, and I realized—stupid me!—that of course he was working. He was observing me, the lab rat.  He said, “Why do you hate the president so?”  “He stopped the government checks and the food stamps. It’s ’cause of him and his Libbies that most of Blaine is back to eating squirrels.”  Dr. Chung looked at the TV like it was the most fascinating thing in the world, but I knew his attention was really on me. “But under the Libertarians, aren’t your taxes lower?”  I snorted. “Five percent of nothing isn’t less to pay than fifteen percent of nothing.”  “I thought the number of jobs in the coal mines had increased.”  “If you can get one. My kin can’t.”  “Why not?”  I didn’t tell him why not. Bobby and Uncle Ted and maybe even now Shawn—they can’t none of them pass a drug screen. So I snapped, “You defending Ratface Rollins?”  “Certainly not. He has drastically and tragically cut funding for basic research.”  “But here you all are.” I waved my arm to take in the room and the machines hooked up to me and the desk in the lobby where Mrs. Cully was doing something on a computer. I was still floating.  “Barely,” Dr. Chung said. “This study is funded as part of a grant now four years old and up for renewal. If—” He stopped and looked—for just a minute, and the first time ever—a little confused. He didn’t know why he was telling me so much. I didn’t know, either. My excuse was the pain drugs.  I said, “If Ratface wins, you lose the money for this clinic?”  “Yes.”  “Why? I mean, why this one specially?”  He chewed on his bottom lip, something else I didn’t see him do afore. I thought he warn’t going to say any more, but then he did. “The study so far has produced no publishable results. The population affected is small. We obtained the current grant just before President Rollins came into office and all but abolished both the FDA and research money. If the Libertarians are re-elected, it’s unlikely our grant will be renewed.”  “Isn’t there someplace else to get the money?”  “Not that we have found so far.”  Mrs. Cully called to him then and he left. I sat thinking about what he said. It was like a curtain lifted on one corner, and behind that curtain was a place just as dog-eat-dog as Blaine. Bobby scrambled to dig coal from the side of the highway, and these doctors scrambled to dig money out of the government. Dinah worked hard to make it okay that Bobby hit her (“It ain’t him, it’s the fucking sickness!”), and Dr. Chung worked hard to convince the government it was a good idea to put a bunch of algae and a light switch in my skull. Then I thought about how much I liked him telling me all that, and about the bandages coming off and the real experiment starting tomorrow, and about lunch coming soon. And then I didn’t think about nothing because Bobby burst into the clinic with his .22.  “Where is she? Where’s my fucking sister?”  “Bobby!”  He didn’t hear me, or he couldn’t. I scrambled out of bed but I was still hooked up to a bunch of machines. I yanked the wires. Soothing voices in the lobby but I couldn’t make out no words.  The .22 fired, sounding like a mine explosion.  “Bobby!”  Oh sweet Jesus, no—  But he hadn’t hit nobody. Mrs. Cully crouched on the floor behind her counter. The bullet hole in the wall warn’t anywhere near her or Dr. Chung, who stood facing Bobby and talking some soothers that there was no way Bobby was going to hear. He was wild-eyed like Dad had been near the end, and I knew he hadn’t slept in days and he was seeing things that warn’t there. “Bobby—”  “You whore!” He fired again and this time the bullet whizzed past Dr. Chung’s ear and hit the backside of Mrs. Cully’s computer. Bobby swung the rifle toward me. I stood stock still, but Dr. Chung started forward to grab the barrel. That would get Bobby’s attention and he would—God no no . . .  But afore I could yell again, the clinic door burst open and Shawn grabbed Bobby from behind. Bobby shouted something, I couldn’t tell what, and they fought. Shawn didn’t have his whole manhood growth yet, but he didn’t have Bobby’s way-gone sickness yet, neither. Shawn got the rifle away from Bobby and Bobby on the ground. Shawn kicked him in the head and Bobby started to sob.  I picked up the rifle and held it behind me. Dr. Chung bent over Bobby. By this time the lobby was jammed with people, two nurses and Dr. Liu and Jenny and Pete Lawler, who must a been in a examining room. All this happened so fast that Shawn was just preparing to kick Bobby again when I grabbed his arm. “Don’t!”  Shawn scowled at the bandage on my head. “He’s going to get us all put behind bars. Just the same, he ain’t wrong. You’re coming home with me.”  The breath went out of me. I warn’t ready for this. “No, Shawn. I’m not.”  “You come home with me or you don’t never come home again. Granmama says.”  “I’m not going. They’re going to help me here, and they can help you, too! You don’t need to get like Bobby, like Dad was—”  He shook off my arm. And just like that, I lost him. The Connors men don’t hardly never change their minds once they make them up. And soon Shawn wouldn’t even have a mind. Seven months from the first sleeplessness to death.  Shawn yanked Bobby to his feet. Bobby was quiet now, bleeding from his head where Shawn kicked him. Dr. Liu started to say, “We must—” but Dr. Chung put a hand on his arm and he shut up. Shawn held out his other hand to me, his face like stone, and I handed him Bobby’s gun. Then they were gone, the truck Shawn borrowed or stole roaring away up the mountain.  Dr. Chung knew better than to say anything to me. I looked at the busted computer and wondered how much it cost, and if they would take it out of my pay. Then I went back into my room, closed the door, and got into bed. I would a given anything, right up to my own life, if I could a slept then. But I knew I wouldn’t. Not now, not tonight, not—it felt like at that minute—ever again. And by spring, Shawn would be like Bobby. And so would I.  “You need a pass-out,” I said to Dr. Chung.  He paused in his poking at my head. “A what?”  “When Bonnie Jean got a fish at a pet store once, they gave her a pass-out paper, TAKING CARE OF YOUR GOLDFISH. To tell her how to do for the fish—not that she done it. You need a pass-out, TAKING CARE OF YOUR BRAIN ALGAE.”  Dr. Chung laughed. When he did that, his eyes almost disappeared, but by now I liked that. Nobody else never thought I was funny, even if my funning now was just a cover for nerves. Dr. Liu, at the computer, didn’t laugh, and neither did Jenny. I still didn’t like her eyes.  I sat on a chair, just a regular chair, with my head bandage off and the shaved patch on my head feeling too bare. All my fingers could feel with a tiny bit of something hard poking above my skull: the end of the fiber-optic implant. Truth was, I didn’t need a pass-out paper. I knew what was going to happen because Dr. Chung explained it, as many times as I wanted, till I really understood. The punchpad in his hand controlled what my “optrode” did. He could send blue or yellow laser light down it, which would make my new algae release tiny particles that turned on and off some cells in my brain. I’d seen the videos of mice, with long cables coming from their skulls, made to run in circles, or stop staggering around drunk-like, or even remember mazes quicker.  Last night I asked Dr. Chung, “You can control me now, can’t you?”  “I have no wish to control you.”  “But you could.”  “No one will control you.”  I’d laughed then, too, but it tasted like lemons in my mouth.  “Ready?” Dr. Liu said.  “Ready.” I braced myself, but nothing happened. I didn’t feel nothing at all. But at the screen Jenny went, “Aaaaaaaahhh.”  “What?” I said.  “It works,” Dr. Chung said quietly. “We are getting a good picture of optrode response.”  On the screen was a bunch of wavy lines, with a lot of clicking noises.  That went on for a long bit: me sitting in the chair feeling nothing, Dr. Chung turning lights on and off in my head that I didn’t see, lines and numbers on the computer, and lots of long discussions with words I didn’t understand. Maybe some of them were Chinese. And then, just when I was getting antsy and bored both at the same time, something happened. Another press of the punchpad and all at once I saw the room. Not like I saw it afore—I mean I really saw it. Every little thing was clear and bright and separate and itself: the hard edge of the computer screen, the way the overhead light made a shadow in the corner, a tiny brown stain on the hem of Jenny’s white coat—everything. The room was like Reverend Baxter said the world looked right when God created it: fresh and new and shining. I could feel my mouth drop open and my eyes get wide.  “What?” Dr. Chung said. “What is it, Ludie?”  I told him. He did something with the switch in his hand and all the fresh clearness went away. “Oh! Bring it back!”  “Hyperawareness,” Dr. Liu said. “The opsins could be over-expressing?”  “Not that quickly,” Dr. Chung said. “But—”  “Bring it back!” I almost shouted it.  He did. But after a minute it was almost too much. Too bright, too clear, too strange. And then it got clearer and brighter, so that it almost blinded me and I couldn’t see and everything was wrong and—  It all stopped. Dr. Chung had pressed some switch. And then I wanted it back.  “Not yet, Ludie,” he said. He sounded worried. “You were injected with multiple opsins, you know, each responding to a different wavelength of light. We’re going to try a different one. Would you stand up, please? Good . . . now walk toward me.”  I did, and he did something with his switch, and all at once I couldn’t move. I was frozen. The computer started clicking loud as a plague of locusts.  Jenny said, “Pronounced inhibitory motor response.”  I said, “Stop!”  Then I could move again and I was pounding on Dr. Chung with my fists. “You said you warn’t going to control me! You said!”  He grabbed my wrists and held them; he was stronger than he looked. “I didn’t know that would happen, Ludie. This is all new, you know. Nobody wants to control you.”  “You just did, you bastard!”  “I did not know the inhibitory neurons would fire that strongly. Truly, I did not.”  Jenny said something in Chinese.  “No,” Dr. Chung said sharply to her.  “I’m done here,” I said.  “Yes, that’s enough for a first session,” Dr. Liu said. Which warn’t what I meant. I meant I was going home.  But I didn’t. Instead I went to my room in the clinic, got into bed, and slept a little. Not long, not real hard, but enough to calm me down. Then I got up and found Dr. Chung in his office.  If he was glad to see me, he didn’t let on. Instead he handed me an envelope. “This came for you in the mail.”  Inside was a single page torn from the Sears catalogue, a page with kids’ coats on the top and enough white space at the bottom for Dinah to print THANK U. So she got the money I been sending her from my pay. Where did she tell Bobby the warm clothes come from, the coats and stuff for Lewis, Arianna, Timmy, Cody, Bonnie Jean? No, that was stupid—Bobby was too far gone to notice even if the kids ran around buck naked.  I turned on Dr. Chung. “Did you give me this right now so’s I’d stay?”  “Ludie, how could I know what was in your envelope? I still don’t know.”  “You know sure enough what’s in my head!”  “I know there are abnormal FFI prions, which we hope to arrest. I know, too, that there is valuable information about how the brain works.”  “You told me afore that you can’t get them prions out of my head!”  “We cannot, no. What we hope is to disrupt the formation of any more. For your sake, as much as ours.”  “I don’t believe that crap!”  Only I wanted to believe it.  “Okay,” I said, “here’s the deal. I stay and you do your experiments, but the minute I tell you to stop something, you do it.” It was lame bluster, and he knew it.  “Yes. I already did so, you know. You told me to stop the inhibition of motor activity, and I did.”  “And another thing. I want a pass-out, after all.”  He blinked. “You want—”  “I want you to write out in words I can understand just what you’re doing to me. So’s I can study on it afore we do it again.”  Dr. Chung smiled. “I will be glad to do that, Ludie.”  I flounced out of there, knowing I hadn’t told him the whole truth. I wanted to keep sending money to Dinah, yes. I wanted him to not freeze me no more, yes. I wanted a pass-out paper, yes. But I also wanted that shining clearness back, that thing Jenny had called hyper-awareness. I wanted it enough to go on risking my brain.  If that’s really what I was doing.   Ludie—you have Fatal Familial Insomnia. Inside a part of your brain called the thalamus, some proteins called prions are folding up wrong. The wrongly folded proteins are making other proteins also fold wrong. These are sticking together in clumps and interfering with what cells are supposed to do. The main thing thalamus cells are supposed to do is process communications among different parts of the brain. The thalamus is like a switchboard, except that it also changes the communications in ways we are trying to learn about. Things which the thalamus communicates with the rest of the brain about include: moving the body, thinking, seeing, making decisions, memory formation and retrieval, and sleeping. When you get a lot of sticky, misfolded proteins in the thalamus, you can’t go into deep sleep, or move properly, or think clearly. You get hallucinations and insomnia and sometimes seizures.  We are trying to do three things: (1) Stop your brain making more misfolded prions, even if we can’t get rid of the ones that are already there. We are trying to do this by interfering with the making of a protein that the prions use to fold wrong. Unhappily, the only way we will know if this happens is if your symptoms do not get worse. (2) Your brain works partly by sending electrical signals between cells. We are trying to map how these go, called “neural pathways.” (3) We want to find out more about what the special algae (opsins) we put in your brain can do. They release different chemicals when we put different laser lights down the cable. We want to know the results of each different thing we do, to aid science.  Well, Dr. Chung wrote good, even though I didn’t know what a “switchboard” might be.  I thought of Mama, her brain full of these misfolded proteins, gummed up like a drain full of grease and hair. And Bobby’s brain, even worse. Mine, too, soon?  It was dark outside by the time I finished reading that damn paper over and over and over. Everybody’d gone home from the clinic except the night nurse, a skinny rabbitty-looking girl named Susannah. I knowed that she was mountain-born the minute I laid eyes on her, and that somehow she’d got out, and I’d tried not to have nothing to do with her. But now I marched out to where she was reading a magazine in the lobby and said, “Call Dr. Chung. Now.”  “What’s wrong?”  “Never you mind. Just call him.”  “It’s ten o’clock at—”  “I know what time it is. Call him.”  She did, and he came. I said, “We’re going to work now. Now, not in the morning. Them proteins are folding in me right this second, aren’t they? You call Jenny and Dr. Liu if you really need them. We’re going to work all night. Afore I change my mind.”  He looked at me hard. Funny how when you know a person long enough, even a strange and ugly person, they don’t look so bad no more.  “Okay,” he said. “Let’s work.”  We worked all night. We worked all week. We worked another week, then another. And I didn’t get no worse. No better, but no worse. What I got was scared.  Nobody ought to be able to do those things to somebody else’s brain, using nothing except little bits of light.  Dr. Chung froze me again while I was walking around.  Dr. Liu said, “Filtering signals is an important thalamic function, and any change in filtering may give rise to physiological effects.”  Dr. Chung made the “hyperawareness” come back, even stronger.  Jenny said, “Interfering with action potentials on cell membranes changes the way cells process information.”  Dr. Chung made me remember things from when I was really little—Mama singing to me. Shawn and me wrestling. Granmama telling me troll stories while I sat on her knee. Bobby teaching me to fish. The memories were so sharp, they felt like they was slicing into my brain. Good memories but too razored, making my mind bleed.  Dr. Liu said, “Are the opsins in the anterior nuclei over-expressing? That could cause problems.”  Dr. Chung did something that made me stutter so’s I couldn’t get a word out whole no matter how much I tried.  Jenny said, “Neural timing—even the shift of a few milliseconds can reverse the effect of the signal on the rest of the nervous system. Not good.”  I didn’t think any of it was good. But I warn’t going to say anything in front of that Jenny; I waited until I got Dr. Chung alone.  “I got to ask you something.”  “Of course, Ludie.” He had just finished checking on my heart and blood pressure and all that. “Are you pleased by the way the study is going? You say your FFI symptoms aren’t any worse, and with the usual rapid progression of the disease in your family, that may mean genuine progress.”  “I’m happy about that, yeah, if it goes on like now. But I got a different question. I been reading in that book you gave me, how the brain is and isn’t like a computer.” The book was hard going, but interesting.  “Yes?” He looked really caught on what I was saying. For the first time, I wondered what his wife was like. Was she pretty?  “A computer works on teeny switches that have two settings, on and off, and that’s how it knows things.”  “A binary code, yes.”  “Well, those laser switches on the bundle of optic cables you put in my head—they’re off and on, too. Could you make my head into a computer? And put information into it, like into a computer—information that warn’t there afore?”  Dr. Chung stood. He breathed deep. I saw the second he decided not to lie to me. “Not now, not with what we know at present, which isn’t nearly enough. But potentially, far down the road and with the right connections to the cortex, it’s not inconceivable.”  Which was a fancy way of saying yes.  “Good night,” I said abruptly and went into my room.  “Ludie—”  But I didn’t have nothing more to say to him. In bed, though, I used the tablet he loaned me—that’s what I been reading the book on—to get the Internet and find Dr. Chung. I got a lot of hits. One place I found a picture of him with his wife. She was pretty, all right, and refined-looking. Smart. He had his arm around her.  Sleep was even harder that night than usual. Then, the next day, it all happened.  We were in the testing room, and my hyperawareness was back. Everything was clear as mountain spring water, as sharp as a skinning knife. I kept rising up on my tip-toes, just from sheer energy. It didn’t feel bad. Dr. Chung watched me real hard, with a little frown.  “Do you want a break, Ludie?”  “No. Bring it on.”  “Hippocampal connection test 48,” Jenny said, and Dr. Chung’s hand moved on his punchpad. The computer started clicking louder and louder. The door burst open and Bobby charged in, waving a knife and screaming.  “Whore! Whore!” He plunged the knife into Jenny and blood spurted out of her in huge, foaming gushes. I shouted and tried to throw myself in front of Dr. Chung, but Bobby got him next. Dr. Liu had vanished. Bobby turned on me and he warn’t Bobby no more but a troll from Granmama’s stories, a troll with Bobby’s face, and Bonnie Jean hung mangled and bloody from his teeth. I hit out at the troll and his red eyes bored into me and his knife raised and—  I lay on the floor, Dr. Chung holding me down, Jenny doubled over in pain, and the computer screen laying beside me.  “Ludie—”  “What did you do?” I screamed. “What did you do to me? What did I do?” I broke free of him, or he let me up. “What?”  “You had a delusional episode,” Dr. Chung said, steady but pale, watching me like I was the Bobby-troll. And I was. I had hit Jenny and knocked over the computer, only it was—  “Don’t you touch me!”  “All right,” Dr. Chung said quietly, “I won’t.” Dr. Liu was picking up the computer, which was still clicking like a crazy thing. Mrs. Cully and a nurse stood in the doorway. Jenny gasped and wheezed. “You had a delusional episode, Ludie. Perhaps because of the FFI, perhaps—”  “It was you, and you know it was you! You done it to me! You said you wouldn’t control my brain and now you—” I pulled at the optrode sticking up from my skull, but of course it didn’t budge. “You can’t do that to me! You can’t!”  “We don’t know what the—”  “You don’t know nothing! And I’m done with the lot of you!” It all came together in me then, all the strangeness of what they was doing and the fear for my family and them throwing me out and the lovely hyperawareness gone when the switch went off and Dr. Chung’s pretty wife—all of it.  I didn’t listen to nothing else they said. I walked straight out of that clinic, my legs shaking, without even grabbing my coat. And there was Shawn pulling up in Jimmy Barton’s truck, getting out and looking at me with winter in his face. “Bobby’s dead,” he said. “He killed himself.”  I said, “I know.”  The funeral was a week later—it took that long for the coroner to get done fussing with Bobby’s body. It was election day, and Ratface Rollins lost, along with the whole Libertarian party.  The November wind blew cold and raw. Mama was too bad off to go to the graveyard. But Shawn brought her at the service where she sat muttering, even through the church choir singing her favorite, “In the Sweet Bye and Bye.” I don’t know if she even knew what was going on; for sure she didn’t recognize me. It warn’t be long afore she’d be as bad as Bobby, or in a coma like Aunt Carol Ames. Granmama recognized me, of course, but she didn’t say nothing when I came into the trailer, or when I stayed there, sleeping in my old bed with Patty and Bonnie Jean, or when I cleaned up the place a bit and cooked a stew with groceries from my clinic money. Granmama didn’t thank me, but I didn’t expect that. She was grieving Bobby. And she was Granmama.  Dinah kept to her room, her kids pretty much in there with her day and night.  I kept a hat on, over my part-shaved head. Not the red knit hat Dr. Chung gave me, which I wadded up and threw in the creek. In the trailer I wore Bobby’s old baseball cap, and at the funeral I wore a black straw hat that Mama had when I was little.  “‘The Lord is my Shepherd; I shall not want. He maketh me to lie down in green pastures . . . ’” Reverend Baxter did funerals old-fashioned. Bobby’s casket was lowered into the hole in the churchyard. The last of the maple leaves blew down and skittered across the grass.  Dinah came forward, hanging onto Shawn, and tossed her flower into the grave. Then Granmama, then me, then Patty. The littlest kids, Lewis and Arianna and Timothy and Cody, were in relatives’ arms. The last to throw her flower was Bonnie Jean, and that’s when I saw it.  Bonnie Jean wore an old coat of Patty’s, too big for her, so’s the hem brushed the ground. When she stood by the grave that hem was shaking like aspen leaves. Her face had froze, and the pupils of her eyes were so wide it looked like she was on something. She warn’t. And it warn’t just the fear and grief of a ten-year-old at a funeral, neither.  “Ashes to ashes, dust to dust . . . ”  Neighbors brought cakes and covered dishes to the trailer. Nobody didn’t stay long ’cause they knew we didn’t want them to. Dinah went back into her room with her two kids, Mama was muttering beside the stove, Shawn sat smoking and drinking Bud. I told Patty to watch Timmy and Cody and I took Bonnie Jean into our bedroom.  “How long since you slept through the whole night?”  She was scared enough to give me lip. “I sleep. You been right there next to me!”  “How long, Bonnie Jean?”  “I don’t got to tell you nothing! You’re a whore, sleeping with them Chinese and letting them do bad things to you—Bobby said!”  “How long?”  She looked like she was going to cry, but instead she snatched Bobby’s baseball hat off my head. It seemed to me that my optrode burned like a forest fire, though of course it didn’t. Bonnie Jean stared at it and spat, “Chink Frankenstein!”  Probably she didn’t even know what the words meant, just heard them at school. Or at home.  Then she started to cry, and I picked her up in my arms and sat with her on the edge of the bed, and she let me. All at once I saw that the bed was covered with the Fence Rail quilt Dinah had been making for the women’s co-op. She’d put it on my bed instead.  I held Bonnie Jean while she cried. She told me it had been two weeks since she couldn’t sleep right and at the graveyard was her second panic attack—what she called “the scared shakes.” She was ten years old, and she carried the gene Granmama and God-knows-who-else had passed on without being affected themselves. Insomnia and panic attacks and phobias. Then hallucinations and more panic attacks and shrinking away to hardly no weight at all. Then dementia or coma or Bobby’s way out. Ten years old. While I was nineteen and I hadn’t even felt her restless beside me in the long cold night.  I knowed, then, what I had to do.  The Chinese clinic was almost empty.  A sign outside said CLOSED. Through the window I could see the lobby stripped of its chairs and pictures and clothesbasket of toys. But a light shone in a back room, bright in the drizzly gray rain. I rattled the lock on the door and shouted “Hey!” and pretty soon Mrs. Cully opened it.  She wore jeans and a sweatshirt instead of her usual dress, and her hair was wrapped in a big scarf. In one hand was a roll of packing tape. She didn’t look surprised to see me. She looked something, but I couldn’t read it.  “Ludie. Come in.”  “You all leaving Blaine?”  “Our grant won’t be renewed. Dr. Chung found out the day after the election from a man he knows in Washington.”  “But Rollins lost!”  “Yes, but the new president made campaign promises to reinstate the FDA with tight regulations on studies with human subjects. Under Rollins there was too much abuse. So Doctors Chung and Liu are using their remaining money for data analysis, back at the university—especially since we have no research subjects here. I’m packing files and equipment.”  The rooms behind her, all their doors open, were full of boxes, some sealed, some still open. A feeling washed over me that matched the weather outside. The clinic never had no chance no matter who won the election.  Mrs. Cully said, “But Dr. Chung left something for you, in case you came back.” She plucked a brown envelope off the counter, and then she went back to her packing while I opened it. Tact—Mrs. Cully always had tact.  Inside the envelope was a cell phone, a pack of money with a rubber band around it, and a letter.   Ludie—  This is the rest of what the clinic owes you. Along with it, accept my deepest gratitude for your help with this study. Even though not finished, it—and you—have made a genuine contribution to science. You are an exceptional young woman, with exceptional intelligence and courage.  This cell phone holds the phone number for Dr. Morton, who implanted your optrode, and who will remove it. Call her to schedule the operation. There will of course be no charge. The phone also holds my number. Please call me. If you don’t, I will call this number every day at 11:00 a.m. until I reach you. I want only to know that you are all right.  Your friend,  Hai Chung  The phone said it was 9:30 a.m. Mrs. Cully said, “Is that your suitcase?”  “Yeah. It is. I need Dr. Chung’s address, ma’am.”  She looked at me hard. “Call him first.”  “Okay.” But I wouldn’t. By the time the phone rang, I would be on the 10:17 Greyhound to Lexington.  She gave me his university address but wouldn’t give out his home. It didn’t really matter. I knew he would give it to me, plus whatever else I needed. And not just for the study, neither.  Dr. Chung told me, one time, about a scientist called Daniel Zagury. He was studying on AIDS, and he shot himself up with a vaccine he was trying to make, to test it. Dr. Chung didn’t do no experiments on himself; he used me instead, just like I was using him for the money. Only that warn’t the whole story, no more than Bobby’s terrible behavior when he got really sick was the whole story of Bobby. The Chinese clinic warn’t Chinese, and I’m not no Frankenstein. I’m not all that “courageous,” neither, though I sure liked Dr. Chung saying it. What I am is connected to my kin, no matter how much I used to wish I warn’t. Right now, connected don’t mean staying in Blaine to help Dinah with her grief and Shawn with his sickness and the kids with their schooling. It don’t mean waiting for Mama’s funeral, or living with Granmama’s sour anger at what her genes did to her family. Right now, being connected means getting on a Greyhound to Lexington.  It means going on with Dr. Chung’s study.  It means convincing him, and everybody else, to put a optrode in Bonnie Jean’s head, and Shawn’s, and maybe even Lewis’s, so laser light can “disrupt their neural pathways” and they don’t get no more misfolded prions than they already got.  It means paying for this with whatever work I get.  And maybe it even means going to Washington D.C. and talking to my congressman—whoever he is—about why this study is a good thing. I read on Dr. Chung’s tablet that other scientists sometimes do that. Maybe I could take Bonnie Jean with me. She’s real pretty, and I can teach her to look pathetic. Maybe.  I never had no thoughts like this afore, and maybe that’s the opsins, too. But maybe not. I don’t know. I only know that this is my path and I’m going to walk it.  I hike to the highway, suitcase in one hand and cell phone in the other, and I flag down the bus.    Originally published in Twelve Tomorrows, edited by Stephen Cass. Nancy Kress is the author of thirty-five books, including twenty-seven novels, four collections of short stories, and three books on writing. Her work has won six Nebulas, two Hugos, a Sturgeon, and the John W. Campbell Memorial Award. Her most recent works are a stand-alone novella about genetic engineering, Sea Change (Tachyon, 2020) and an SF novel of power and money, The Eleventh Gate (Baen, 2020). Nancy’s fiction has been translated into nearly two dozen languages including Klingon, none of which she can read. She has taught writing SF at various venues including Clarion and the annual two-week intensive workshop Taos Toolbox with Walter Jon Williams. She lives in Seattle with her husband, writer Jack Skillingstead, and Pippin, a Chihuahua puppy who chews everything.", "text": "9900 words, novelette, REPRINT\nPathways\nThe Chinese clinic warn’t like I expected. It warn’t even Chinese.\nI got there afore it opened. I was hoping to get inside afore anybody else came, any neighbors who knew us or busybodies from Blaine. But Carrie Campbell was already parked in her truck, the baby on her lap. We nodded to each other but didn’t speak. The Campbells are better off than us—Dave works in the mine up to Allington—but old Gacy Campbell been feuding with Dr. Harman for decades and Carrie was probably glad to have someplace else to take the baby. He didn’t look good, snuffling and whimpering.\nWhen the doors opened, I went in first, afore Carrie was even out of the truck. It was going to take her a while. She was pregnant again.\n“Yes?” said the woman behind the desk. Just a cheap metal desk, which steadied me some. The room was nothing special, just a few chairs, some pictures on the wall, a clothes basket of toys in the corner. What really surprised me was that the woman warn’t Chinese. Blue eyes, brown hair, middle-aged. She looked a bit like Granmama, but she had all her teeth. “Can I help you?”\n“I want to see a doctor.”\n“Certainly.” She smiled. Yeah, all her teeth. “What seems to be the problem, miss?”\n“No problem.” From someplace in the back another woman came out, this one dressed like a nurse. She warn’t Chinese either.\n“I don’t understand,” the woman behind the desk said. From her accent she warn’t from around here—like I didn’t already know that. “Are you sick?”\n“No, ma’am.”\n“Then how can I—”\nCarrie waddled into the door, the baby balanced on her belly. Now my visit would be table-talk everywhere. All at once I just wanted to get it over with.\n“I’m not sick,” I said, too loud. “I just want to see a doctor.” I took a deep breath. “My name is Ludmilla Connors.”\nThe nurse stopped walking toward Carrie. The woman behind the counter half stood up, then sat down again. She tried to pretend like she hadn’t done it, like she warn’t pleased. If Bobby were that bad a liar, he’d a been in jail even more than he was.\n“Certainly,” the woman said. I didn’t see her do nothing, but a man came out from the back, and he was Chinese. So was the woman who followed him.\n“I’m Ludmilla Connors,” I told him, and I clenched my ass together real hard to keep my legs steady. “And I want to volunteer for the experiment. But only if it pays what I heard. Only if.”\nThe woman behind the desk took me back to a room with a table and some chairs and a whole lot of filing cabinets, and she left me there with the Chinese people. I looked at their smooth faces with those slanted, mostly closed eyes, and I wished I hadn’t come. I guess these two were the reason everybody hereabouts called it the “Chinese clinic,” even if everybody else there looked like regular Americans.\n“Hello, Ms. Connors,” the man said and he spoke English real good, even if it was hard to understand some words. “We are glad you are here. I am Dr. Dan Chung and this is my chief technician Jenny.”\n“Uh huh.” He didn’t look like no “Dan,” and if she was “Jenny,” I was a fish.\n“Your mother is Courtney Connors and your father was Robert Connors?”\n“How’d you know that?”\n“We have family trees for everyone on the mountain. It’s part of our work, you know. You said you want to aid us in this research?”\n“I said I want to get paid.”\n“Of course. You will be. You are nineteen.”\n“Yeah.” It warn’t a question, and I didn’t like that they knew so much about me. “How much money?”\nHe told me. It warn’t as much as the rumors said, but it was enough. Unless they actually killed me, it was enough. And I didn’t think they’d do that. The government wouldn’t let them do that—not even this stinking government.\n“Okay,” I said. “Start the experiment.”\nJenny smiled. I knew that kind of smile, like she was so much better than me. My fists clenched. Dr. Chung said, “Jenny, you may leave. Send in Mrs. Cully, please.”\nI liked the surprised look on Jenny’s face, and then the angry look she tried to hide. Bitch.\nMrs. Cully didn’t act like Jenny. She brought in a tray with coffee and cookies: just regular store-bought Pepperidge Farm, not Chinese. Under the tray was a bunch of papers. Mrs. Cully sat down at the table with us.\n“These are legal papers, Ms. Connors,” Dr. Chung said. “Before we begin, you must sign them. If you wish, you can take them home to read, or to a lawyer. Or you can sign them here, now. They give us permission to conduct the research, including the surgery. They say that you understand this procedure is experimental. They give the university, myself, and Dr. Liu all rights to information gained from your participation. They say that we do not guarantee any cure, or even any alleviation, of any medical disorder you may have. Do you want to ask questions?”\nI did, but not just yet. Half of me was grateful that he didn’t ask if I can read, the way tourists and social workers sometimes do. I can, but I didn’t understand all the words on this page: indemnify, liability, patent rights. The other half of me resented that he was rushing me so.\nI said something I warn’t intending: “If Ratface Rollins warn’t president, this clinic wouldn’t be here at all!”\n“I agree,” Dr. Chung said. “But you Americans elected a Libertarian.”\n“Us Americans? Aren’t you one?”\n“No. I am a Chinese national, working in the United States on a visa arranged by my university.”\nI didn’t know what to say to that, so I grabbed the pen and signed everything. “Let’s get it over with, then.”\nBoth Dr. Chung and Mrs. Cully looked startled. She said, “But . . . Ludmilla, didn’t you understand that this will take several visits, spread out over months?”\n“Yeah, I know. And that you’re going to pay me over several months, too, but the first bit today.”\n“Yes. After your interview.”\nShe had one of those little recording cubes that I only seen on TV. They can play back an interview like a movie, or they can send the words to a computer to get put on screen. Maybe today would be just talking. That would be fine with me. I took a cookie.\n“Initial interview with experimental subject Ludmilla Connors,” Dr. Chung said, and gave the date and time. “Ms. Connors, you are here of your own free will?”\n“Yeah.”\n“And you are a member of the Connors family, daughter of Courtney Ames Connors and the late Robert Connors?”\n“Did you know my dad at the hospital? Were you one of his doctors?”\n“No. But I am familiar with his symptoms and his early death. I am sorry.”\nI warn’t sorry. Dad was a son-of-a-bitch even afore he got sick. Maybe knowing it was coming, that it was in his genes, made him that way, but a little girl don’t care about that. I only cared that he hit me and screamed at me—hit and screamed at everybody until the night he took after Dinah so bad that Bobby shot him. Now Bobby, just four months from finishing doing his time at Luther Luckett, was getting sick, too. I knew I had to tell this foreigner all that, but it was hard. My family don’t ask for help. “We don’t got much,” Granmama always said, “but we got our pride.”\nThat, and the Connors curse. Fatal Familial Insomnia.\nIt turned out that Dr. Chung already knew a lot of my story. He knew about Dad, and Bobby, and Mama, and Aunt Carol Ames. He even knew which of the kids got the gene—it’s a 50-50 chance—and which didn’t. The safe ones: Cody, Patty, Arianna, Timothy. The losers: Shawn, Bonnie Jean, and Lewis. And me.\nSo I talked and talked, and the little light on the recording cube glowed green to show it was on, and Mrs. Cully nodded and looked sympathetic so damn much that I started wishing for Jenny back. Dr. Chung at least sat quiet, with no expression on that strange ugly face.\n“Are you showing any symptoms at all, Ms. Connors?”\n“I have some trouble sleeping at night.”\n“Describe it for me, in as much detail as you can.”\nI did. I knew I was young to start the troubles; Mama was forty-six and Bobby twenty-nine.\n“And the others with the FFI gene? Your mother and Robert, Jr. and”—he looked at a paper—“Shawn Edmond and—”\n“Look,” I said, and it came out harsher than I meant, “I know I got to tell you everything. But I’m not going to talk none about any of my kin, not what they are or aren’t doing. Especially not to a Chinaman.”\nSilence.\nThen Dr. Chung said quietly, “I think, Ms. Connors, that you must not know how offensive that term is. Like ‘spic’ or ‘nigger.’”\nI didn’t know. I felt my face grow warm.\nHe said, “I think it’s like ‘hillbilly’ is to mountain people.”\nMy face got even warmer. “I . . . I’m sorry.”\n“It’s okay.”\nBut it warn’t. I’m not the kind to insult people, even Chinese people. I covered my embarrassment with bluster. “Can I ask some questions for a change?”\n“Of course.”\n“Is this Chi—did this clinic come to Blaine and start treating people for what ails them, just to get my family’s trust so you all can do these experiments on our brains?”\nThat was the scuttlebutt in town and I expected him to deny it, but instead he said, “Yes.”\nMrs. Cully frowned.\nI said, “Why? Because there are only forty-one families in the whole world with our sickness? Then why build a whole clinic just to get at us? We’re just a handful of folk.”\nHe said gently, “You know a lot about fatal familial insomnia.”\n“I’m not stupid!”\n“I would never think that for even a moment.” He shifted in his chair and turned off the recorder. “Listen, Ms. Connors. It’s true that sufferers from FFI are a very small group. But the condition causes changes in the brain that involve neural pathways which everybody has. Memory is involved, and sleep regulation, and a portion of the brain called the thalamus that processes incoming sensory signals. Our research here is the best single chance to gain information beyond price about those pathways. And since we also hope to arrest FFI, we were able to get funding as a medical clinical trial. Your contribution to this science will be invaluable.”\n“That’s not why I’m doing it.”\n“Whatever your reasons, the data will be just as valuable.”\n“And you know you got to do it to me fast. Afore the Libertarians lose power.”\nMrs. Cully looked surprised. Why was she still sitting with us? Then I realized: Dr. Chung warn’t supposed to be alone with a young woman. Well, fine by me. But at least he didn’t seem surprised that I sometimes watch the news.\n“That’s true,” he said. “If Rafe Bannerman wins this presidential election, and it certainly looks as if he will, then all the deregulations of the present administration may be reversed.”\n“So you got to cut into my skull afore then. And afore I get too sick.” I said it nasty, goading him. I don’t know why.\nBut he didn’t push back. “Yes, we must install the optogenetic cable as soon as possible. You are a very bright young woman, Ms. Connors.”\n“Don’t try to butter me up none,” I said.\nBut after he took blood samples and all the rest of it, after we set up a whole series of appointments, after I answered ten million more questions, the Chinaman’s—no, Chinese man’s—words stayed in my head all the long trudge back up the mountain. Not as bright, those words, as the autumn leaves turning the woods to glory, but it was more praise than I’d gotten since I left school. That was something, anyway.\nWhen I got back to the trailer, about noon, nobody wouldn’t speak to me. Carrie must of dropped by. Bobby’s wife, Dinah, sewed on her quilt for the women’s co-op: the Rail Fence pattern in blue and yellow, real pretty. Mama sat smoking and drinking Mountain Dew. Granmama was asleep in her chair by the stove, which barely heated the trailer. It was cold for October and Bobby didn’t dig no highway coal again. The kids were outside playing, Shawn warn’t around, and inside it was silent as the grave.\nI hung my coat on a door hook. “That quilt’s coming nice, Dinah.”\nNothing.\n“You need some help, Mama?”\nNothing.\n“The hell with you all!” I said.\nMama finally spoke. At least today she was making sense. “You better not let Bobby hear where you been.”\n“I’m doing it for you all!” I said, but they all went back to pretending I didn’t exist. I grabbed my coat, and stomped back outside.\nNot that I had anyplace to go. And it didn’t matter if I was inside or out; Mama’s words were the last ones anyone spoke to me for two mortal days. They hardly even looked at me, except for scared peeps from the littlest kids and a glare from Bonnie Jean, like nobody except a ten-year-old can glare. It was like I was dead.\nBut half the reason I was doing this was the hope—not strong, but there—that maybe I wouldn’t end up dead, after first raving and thrashing and trying to hurt people and seeing things that warn’t there. Like Dad, like Aunt Carol Ames, like Cousin Jess. And the other half of the reason was to put some decent food on the table for the kids that wouldn’t look at me or speak to me from fear that Bobby would switch them hard. I had hopes of Shawn, who hadn’t been home in a couple of days, out deer hunting with his buddies. Shawn and I always been close, and he was sweeter than Bobby even afore Bobby started showing our sickness. I hoped Shawn would be on my side. I needed somebody.\nBut that night in bed, with Patty on my other side as far away as she could get without actually becoming part of the wall, Bonnie Jean spooned into me. She smelled of apples and little kid. I hugged onto her like I warn’t never going to let go, and I stayed that way all through the long cold night.\n“We have good news,” Dr. Chung said. “Your optogenetic vectors came out beautifully.”\n“Yeah? What does that mean?” I didn’t really care, but my nerves were all standing on end and if I kept him talking, maybe it would distract me some. Or not.\nWe sat in his lab at the Chinese clinic, a squinchy little room all cluttered with computers and papers. No smoking bottles or bubbling tubes like in the movies, though. Maybe those were in another room. There was another Chinese doctor, too, Dr. Liu. Also Jenny, worse luck, but if she was the “chief technician” I guess she had to be around. I kept my back to her. She wore a pretty red shirt that I couldn’t never afford to buy for Patty or Bonnie Jean.\n“What does that mean?” I said, realized I’d said it afore, and twisted my hands together.\n“It means we have constructed the bio-organism to go into your brain, from a light-sensitive opsin, a promoter, and a harmless virus. The opsin will be expressed in only those cells that activate the promoter. When light of a specific wavelength hits those cells, they will activate or silence, and we can control that by—Ms. Connors, you can still change your mind.”\n“What?” Jenny said, and Dr. Chung shot her a look that could wither skunkweed. I wouldn’t of thought he could look like that.\n“My mind is changed,” I said. His talking warn’t distracting me, it was just making it all worse. “I don’t want to do it.”\n“All right.”\n“She signed the contracts!” Jenny said.\nI whirled around on my chair to face her. “You shut up! Nobody warn’t talking to you!”\nJenny got up and stalked out. Dr. Liu made like he would say something, then didn’t. Over her shoulder Jenny said, “I’ll call Dr. Morton. Although too bad she didn’t decide that before the operating room was reserved at Johnson Memorial.”\n“I’m sorry,” I said, and fled.\nI got home, bone-weary from the walk plus my worst night yet, just as Jimmy Barton’s truck pulled up at the trailer. Jimmy got out, looking grim, then two more boys, carrying Shawn.\nI rushed up. “What happened? Did you shoot him?” Everybody knew that Jimmy was the most reckless hunter on the mountain.\n“Naw. We never even got no hunting. He went crazy, is what. So we brought him back.”\n“Crazy how?”\n“You know how, Ludie,” Jimmy said, looking at me steady. “Like your family does.”\n“But he’s only seventeen!”\nJimmy didn’t say nothing to that, and the other two started for the trailer with Shawn. He had a purpled jaw where somebody slugged him, and he was out cold on whatever downers they made him take. My gut twisted so hard I almost bent over. Shawn. Seventeen.\nDinah and Patty came rushing out, streaming kids behind them. Dinah was shrieking enough to wake the dead. I looked at Shawn and thought about how it must of been in the hunting camp, him going off the rails and “expressing” that gene all over the place: shouting from the panic, grabbing his rifle and waving it around, heart pounding like mad, hitting out at anyone who talked sense. Like Bobby had been a few months ago, afore he got even worse. Nobody in my family ever lasted more than seven months after the first panic attack.\nShawn.\nI didn’t even wait to see if Mama was coming out of the trailer, if this was one of the days she could. I went back down the mountain, running as much as I could, gasping and panting, until I got to the Chinese clinic and the only hope I had for Shawn, for me, for all of us.\nDr. Morton turned out to be a woman. While they got the operating room ready at Johnson Memorial in Jackson, I sat with Dr. Chung in a room that was supposed to look cheerful and didn’t. Yellow walls, a view of the parking lot. A nurse had shaved off a square patch on my hair. I stared out at a red Chevy, trying not to think. Dr. Chung said gently, “It isn’t a complicated procedure, Ms. Connors. Really.”\n“Drilling a hole into my skull isn’t complicated?”\n“No. Humans have known how to do that part for thousands of years.”\nNews to me. I said, “I forgot a hat.”\n“A hat?”\n“To cover this bare spot in my hair.”\n“The first person from your family to visit, I will tell them.”\n“Nobody’s going to visit.”\n“I see. Then I will get you a hat.”\n“Thanks.” And then, surprising myself, “They don’t want me to do none of this.”\n“No,” he said quietly, and without asking what I meant, “I imagine they do not.”\n“They think you conduct experiments on us like we’re lab animals. Like with the Nazis. Or Frankenstein.”\n“And what do you think?”\n“I think they are . . . unknowing.” It felt like a huge betrayal. Still, I kept on. “Especially my Granmama.”\n“Grandmothers are often fierce. Mine is.” He made some notes on a tablet, typing and swiping without looking at it.\nI hadn’t thought of him—of any of them—as having a grandmother. I demanded, like that would make this grandmother more solid, “What’s her name?”\n“Chunhua. What is the name of your grandmother?”\n“Ludmilla. Like me.” I thought a minute. “‘Fierce’ is the right word.”\n“Then we have this in common, yes?”\nBut I warn’t yet ready to give him that much. “I bet my granmama is more fierce than any of your kin.”\nHe smiled, a crinkling of his strange bald face, eyes almost disappearing in folds of smooth skin. “I would—what is it you say, in poker?—‘see that bet’ if I could.”\n“Why can’t you?”\nHe didn’t answer, and his smile disappeared. I said, “What did your granmama do that was so fierce?”\n“She made me study. Hours every day, hours every night. All spring, all summer, all winter. When I refused, she beat me. What does yours do?”\nAll at once I didn’t want to answer. Was beating better or worse? Granmama never touched me, nor any of us. Dr. Chung waited. Finally I said, “She freezes me. Looks at me like . . . like she wants to make a icy wind in my mind. And then that wind blows, and I can’t get away from it nohow, and then she turns her back on me.”\n“That is worse.”\n“Really? You think so?”\n“I think so.”\nA long breath went out of me, clearing out my chest. I said, “Bobby warn’t always like he is now. He taught me to fish.”\n“Do you like fishing?”\n“No.” But I liked Bobby teaching me, just the two of us laughing down by the creek, eating the picnic lunch Mama put up for us.\nA nurse, masked and gowned like on TV, came in and said, “We’re ready.”\nThe last thing I remember was lying on the table, breathing in the knock-out gas, and thinking, Now at least I’m going to get a long deep sleep. Only at the very last minute I panicked some and my hand, strapped to the table, flapped around a bit. Another hand held it, strong and steady. Dr. Chung. I went under.\nWhen I woke, it was in a different hospital room but Dr. Chung was still there, sitting in a chair and working a tablet. He put it down.\n“Welcome back, Ms. Connors. How do you feel?”\nI put my hand to my head. A thick bandage covered part of it. Nothing hurt, but my mouth was dry, my throat was scratchy, and I had a floaty feeling. “What do you got me on? Oxycontin?”\n“No. Steroids to control swelling and a mild pain med. There are only a few nerve receptors in the skull. Tomorrow we will take you back to Blaine. Here.”\nHe handed me a red knit hat.\nAll at once I started to cry. I never cry, but this was so weird—waking up with something foreign in my skull, and feeling rested instead of skitterish and tired, and then this hat from this strange-looking man . . . I sobbed like I was Cody, three years old with a skinned knee. I couldn’t stop sobbing. It was awful.\nDr. Chung didn’t high-tail it out of there. He didn’t try to there-there me, or take my hand, or even look embarrassed and angry mixed together, like every other man I ever knowed when women cry. He just sat and waited, and when I finally got myself to stop, he said, “I wish you would call me ‘Dan.’”\n“No.” Crying had left me embarrassed, if not him. “It isn’t your name. Is it?”\n“No. It just seems more comfortable for Westerners.”\n“What is your damned name?”\n“It is Hai. It means ‘the ocean.’”\n“You’re nothing like any ocean.”\n“I know.” He grinned.\n“Do all Chinese names mean something?”\n“Yes. I was astonished when I found out American names do not.”\n“When was that?”\n“When I came here for graduate school.”\nI was talking too much. I never rattled on like this, especially not to Chinese men who had me cut open. It was the damn drugs they gave me, that thing for swelling or the “mild pain med.” I’d always stayed strictly away from even aspirin, ’cause of watching Mama and Bobby. Afore I could say anything, Dr. Chung said, “Your meds might induce a little ‘high,’ Ludmilla. It will pass soon. Meanwhile, you are safe here.”\n“Like hell I am!”\n“You are. And I apologize for calling you ‘Ludmilla.’ I have not received permission.”\n“Oh, go the fuck ahead. Only it’s ‘Ludie.’” I felt my skull again. I wanted to rip off the bandage. I wanted to run out of the hospital. I wanted to stay in this bed forever, talking, not having to deal with my family. I didn’t know what I wanted.\nMaybe Dr. Chung did, because he went on talking, a steadying stream of nothing: graduate school in California and riding busses in China and his wife’s and daughters’ names. They were named after flowers, at least in English: Lotus and Jasmine and Plum Blossom. I liked that. I listened, and grew sleepy, and drifted into dreams of girls with faces like flowers.\nI was two days in Johnson Memorial and two more in a bed at the clinic, and every single one of them I worried about Shawn. Nobody came to see me. I thought Patty might, or maybe even Dinah if Bobby’d a let her, but they didn’t. Well, Patty was only twelve, still pretty young to come alone. So I watched TV and I talked with Dr. Chung, who didn’t seem to have a whole lot to do.\n“Don’t you got to see patients?”\n“I’m not an M.D., Ludie. Dr. Liu mostly sees the patients.”\n“How come Blaine got so many Chinese doctors? Aren’t Americans working on optogenetics?”\n“Of course they are. Liu Bo and I became friends at the university and so applied for this grant together.”\n“And you brought Jenny.”\n“She is Bo’s fiancé.”\n“Oh. She warn’t—there he is, the bastard!”\nPresident Rollins was on TV, giving a campaign speech. Red and blue balloons sailed up behind him. My hands curled into fists. Dr. Chung watched me, and I realized—stupid me!—that of course he was working. He was observing me, the lab rat.\nHe said, “Why do you hate the president so?”\n“He stopped the government checks and the food stamps. It’s ’cause of him and his Libbies that most of Blaine is back to eating squirrels.”\nDr. Chung looked at the TV like it was the most fascinating thing in the world, but I knew his attention was really on me. “But under the Libertarians, aren’t your taxes lower?”\nI snorted. “Five percent of nothing isn’t less to pay than fifteen percent of nothing.”\n“I thought the number of jobs in the coal mines had increased.”\n“If you can get one. My kin can’t.”\n“Why not?”\nI didn’t tell him why not. Bobby and Uncle Ted and maybe even now Shawn—they can’t none of them pass a drug screen. So I snapped, “You defending Ratface Rollins?”\n“Certainly not. He has drastically and tragically cut funding for basic research.”\n“But here you all are.” I waved my arm to take in the room and the machines hooked up to me and the desk in the lobby where Mrs. Cully was doing something on a computer. I was still floating.\n“Barely,” Dr. Chung said. “This study is funded as part of a grant now four years old and up for renewal. If—” He stopped and looked—for just a minute, and the first time ever—a little confused. He didn’t know why he was telling me so much. I didn’t know, either. My excuse was the pain drugs.\nI said, “If Ratface wins, you lose the money for this clinic?”\n“Yes.”\n“Why? I mean, why this one specially?”\nHe chewed on his bottom lip, something else I didn’t see him do afore. I thought he warn’t going to say any more, but then he did. “The study so far has produced no publishable results. The population affected is small. We obtained the current grant just before President Rollins came into office and all but abolished both the FDA and research money. If the Libertarians are re-elected, it’s unlikely our grant will be renewed.”\n“Isn’t there someplace else to get the money?”\n“Not that we have found so far.”\nMrs. Cully called to him then and he left. I sat thinking about what he said. It was like a curtain lifted on one corner, and behind that curtain was a place just as dog-eat-dog as Blaine. Bobby scrambled to dig coal from the side of the highway, and these doctors scrambled to dig money out of the government. Dinah worked hard to make it okay that Bobby hit her (“It ain’t him, it’s the fucking sickness!”), and Dr. Chung worked hard to convince the government it was a good idea to put a bunch of algae and a light switch in my skull. Then I thought about how much I liked him telling me all that, and about the bandages coming off and the real experiment starting tomorrow, and about lunch coming soon. And then I didn’t think about nothing because Bobby burst into the clinic with his .22.\n“Where is she? Where’s my fucking sister?”\n“Bobby!”\nHe didn’t hear me, or he couldn’t. I scrambled out of bed but I was still hooked up to a bunch of machines. I yanked the wires. Soothing voices in the lobby but I couldn’t make out no words.\nThe .22 fired, sounding like a mine explosion.\n“Bobby!”\nOh sweet Jesus, no—\nBut he hadn’t hit nobody. Mrs. Cully crouched on the floor behind her counter. The bullet hole in the wall warn’t anywhere near her or Dr. Chung, who stood facing Bobby and talking some soothers that there was no way Bobby was going to hear. He was wild-eyed like Dad had been near the end, and I knew he hadn’t slept in days and he was seeing things that warn’t there. “Bobby—”\n“You whore!” He fired again and this time the bullet whizzed past Dr. Chung’s ear and hit the backside of Mrs. Cully’s computer. Bobby swung the rifle toward me. I stood stock still, but Dr. Chung started forward to grab the barrel. That would get Bobby’s attention and he would—God no no . . .\nBut afore I could yell again, the clinic door burst open and Shawn grabbed Bobby from behind. Bobby shouted something, I couldn’t tell what, and they fought. Shawn didn’t have his whole manhood growth yet, but he didn’t have Bobby’s way-gone sickness yet, neither. Shawn got the rifle away from Bobby and Bobby on the ground. Shawn kicked him in the head and Bobby started to sob.\nI picked up the rifle and held it behind me. Dr. Chung bent over Bobby. By this time the lobby was jammed with people, two nurses and Dr. Liu and Jenny and Pete Lawler, who must a been in a examining room. All this happened so fast that Shawn was just preparing to kick Bobby again when I grabbed his arm. “Don’t!”\nShawn scowled at the bandage on my head. “He’s going to get us all put behind bars. Just the same, he ain’t wrong. You’re coming home with me.”\nThe breath went out of me. I warn’t ready for this. “No, Shawn. I’m not.”\n“You come home with me or you don’t never come home again. Granmama says.”\n“I’m not going. They’re going to help me here, and they can help you, too! You don’t need to get like Bobby, like Dad was—”\nHe shook off my arm. And just like that, I lost him. The Connors men don’t hardly never change their minds once they make them up. And soon Shawn wouldn’t even have a mind. Seven months from the first sleeplessness to death.\nShawn yanked Bobby to his feet. Bobby was quiet now, bleeding from his head where Shawn kicked him. Dr. Liu started to say, “We must—” but Dr. Chung put a hand on his arm and he shut up. Shawn held out his other hand to me, his face like stone, and I handed him Bobby’s gun. Then they were gone, the truck Shawn borrowed or stole roaring away up the mountain.\nDr. Chung knew better than to say anything to me. I looked at the busted computer and wondered how much it cost, and if they would take it out of my pay. Then I went back into my room, closed the door, and got into bed. I would a given anything, right up to my own life, if I could a slept then. But I knew I wouldn’t. Not now, not tonight, not—it felt like at that minute—ever again. And by spring, Shawn would be like Bobby. And so would I.\n“You need a pass-out,” I said to Dr. Chung.\nHe paused in his poking at my head. “A what?”\n“When Bonnie Jean got a fish at a pet store once, they gave her a pass-out paper, TAKING CARE OF YOUR GOLDFISH. To tell her how to do for the fish—not that she done it. You need a pass-out, TAKING CARE OF YOUR BRAIN ALGAE.”\nDr. Chung laughed. When he did that, his eyes almost disappeared, but by now I liked that. Nobody else never thought I was funny, even if my funning now was just a cover for nerves. Dr. Liu, at the computer, didn’t laugh, and neither did Jenny. I still didn’t like her eyes.\nI sat on a chair, just a regular chair, with my head bandage off and the shaved patch on my head feeling too bare. All my fingers could feel with a tiny bit of something hard poking above my skull: the end of the fiber-optic implant. Truth was, I didn’t need a pass-out paper. I knew what was going to happen because Dr. Chung explained it, as many times as I wanted, till I really understood. The punchpad in his hand controlled what my “optrode” did. He could send blue or yellow laser light down it, which would make my new algae release tiny particles that turned on and off some cells in my brain. I’d seen the videos of mice, with long cables coming from their skulls, made to run in circles, or stop staggering around drunk-like, or even remember mazes quicker.\nLast night I asked Dr. Chung, “You can control me now, can’t you?”\n“I have no wish to control you.”\n“But you could.”\n“No one will control you.”\nI’d laughed then, too, but it tasted like lemons in my mouth.\n“Ready?” Dr. Liu said.\n“Ready.” I braced myself, but nothing happened. I didn’t feel nothing at all. But at the screen Jenny went, “Aaaaaaaahhh.”\n“What?” I said.\n“It works,” Dr. Chung said quietly. “We are getting a good picture of optrode response.”\nOn the screen was a bunch of wavy lines, with a lot of clicking noises.\nThat went on for a long bit: me sitting in the chair feeling nothing, Dr. Chung turning lights on and off in my head that I didn’t see, lines and numbers on the computer, and lots of long discussions with words I didn’t understand. Maybe some of them were Chinese. And then, just when I was getting antsy and bored both at the same time, something happened. Another press of the punchpad and all at once I saw the room. Not like I saw it afore—I mean I really saw it. Every little thing was clear and bright and separate and itself: the hard edge of the computer screen, the way the overhead light made a shadow in the corner, a tiny brown stain on the hem of Jenny’s white coat—everything. The room was like Reverend Baxter said the world looked right when God created it: fresh and new and shining. I could feel my mouth drop open and my eyes get wide.\n“What?” Dr. Chung said. “What is it, Ludie?”\nI told him. He did something with the switch in his hand and all the fresh clearness went away. “Oh! Bring it back!”\n“Hyperawareness,” Dr. Liu said. “The opsins could be over-expressing?”\n“Not that quickly,” Dr. Chung said. “But—”\n“Bring it back!” I almost shouted it.\nHe did. But after a minute it was almost too much. Too bright, too clear, too strange. And then it got clearer and brighter, so that it almost blinded me and I couldn’t see and everything was wrong and—\nIt all stopped. Dr. Chung had pressed some switch. And then I wanted it back.\n“Not yet, Ludie,” he said. He sounded worried. “You were injected with multiple opsins, you know, each responding to a different wavelength of light. We’re going to try a different one. Would you stand up, please? Good . . . now walk toward me.”\nI did, and he did something with his switch, and all at once I couldn’t move. I was frozen. The computer started clicking loud as a plague of locusts.\nJenny said, “Pronounced inhibitory motor response.”\nI said, “Stop!”\nThen I could move again and I was pounding on Dr. Chung with my fists. “You said you warn’t going to control me! You said!”\nHe grabbed my wrists and held them; he was stronger than he looked. “I didn’t know that would happen, Ludie. This is all new, you know. Nobody wants to control you.”\n“You just did, you bastard!”\n“I did not know the inhibitory neurons would fire that strongly. Truly, I did not.”\nJenny said something in Chinese.\n“No,” Dr. Chung said sharply to her.\n“I’m done here,” I said.\n“Yes, that’s enough for a first session,” Dr. Liu said. Which warn’t what I meant. I meant I was going home.\nBut I didn’t. Instead I went to my room in the clinic, got into bed, and slept a little. Not long, not real hard, but enough to calm me down. Then I got up and found Dr. Chung in his office.\nIf he was glad to see me, he didn’t let on. Instead he handed me an envelope. “This came for you in the mail.”\nInside was a single page torn from the Sears catalogue, a page with kids’ coats on the top and enough white space at the bottom for Dinah to print THANK U. So she got the money I been sending her from my pay. Where did she tell Bobby the warm clothes come from, the coats and stuff for Lewis, Arianna, Timmy, Cody, Bonnie Jean? No, that was stupid—Bobby was too far gone to notice even if the kids ran around buck naked.\nI turned on Dr. Chung. “Did you give me this right now so’s I’d stay?”\n“Ludie, how could I know what was in your envelope? I still don’t know.”\n“You know sure enough what’s in my head!”\n“I know there are abnormal FFI prions, which we hope to arrest. I know, too, that there is valuable information about how the brain works.”\n“You told me afore that you can’t get them prions out of my head!”\n“We cannot, no. What we hope is to disrupt the formation of any more. For your sake, as much as ours.”\n“I don’t believe that crap!”\nOnly I wanted to believe it.\n“Okay,” I said, “here’s the deal. I stay and you do your experiments, but the minute I tell you to stop something, you do it.” It was lame bluster, and he knew it.\n“Yes. I already did so, you know. You told me to stop the inhibition of motor activity, and I did.”\n“And another thing. I want a pass-out, after all.”\nHe blinked. “You want—”\n“I want you to write out in words I can understand just what you’re doing to me. So’s I can study on it afore we do it again.”\nDr. Chung smiled. “I will be glad to do that, Ludie.”\nI flounced out of there, knowing I hadn’t told him the whole truth. I wanted to keep sending money to Dinah, yes. I wanted him to not freeze me no more, yes. I wanted a pass-out paper, yes. But I also wanted that shining clearness back, that thing Jenny had called hyper-awareness. I wanted it enough to go on risking my brain.\nIf that’s really what I was doing.\nLudie—you have Fatal Familial Insomnia. Inside a part of your brain called the thalamus, some proteins called prions are folding up wrong. The wrongly folded proteins are making other proteins also fold wrong. These are sticking together in clumps and interfering with what cells are supposed to do. The main thing thalamus cells are supposed to do is process communications among different parts of the brain. The thalamus is like a switchboard, except that it also changes the communications in ways we are trying to learn about. Things which the thalamus communicates with the rest of the brain about include: moving the body, thinking, seeing, making decisions, memory formation and retrieval, and sleeping. When you get a lot of sticky, misfolded proteins in the thalamus, you can’t go into deep sleep, or move properly, or think clearly. You get hallucinations and insomnia and sometimes seizures.\nWe are trying to do three things: (1) Stop your brain making more misfolded prions, even if we can’t get rid of the ones that are already there. We are trying to do this by interfering with the making of a protein that the prions use to fold wrong. Unhappily, the only way we will know if this happens is if your symptoms do not get worse. (2) Your brain works partly by sending electrical signals between cells. We are trying to map how these go, called “neural pathways.” (3) We want to find out more about what the special algae (opsins) we put in your brain can do. They release different chemicals when we put different laser lights down the cable. We want to know the results of each different thing we do, to aid science.\nWell, Dr. Chung wrote good, even though I didn’t know what a “switchboard” might be.\nI thought of Mama, her brain full of these misfolded proteins, gummed up like a drain full of grease and hair. And Bobby’s brain, even worse. Mine, too, soon?\nIt was dark outside by the time I finished reading that damn paper over and over and over. Everybody’d gone home from the clinic except the night nurse, a skinny rabbitty-looking girl named Susannah. I knowed that she was mountain-born the minute I laid eyes on her, and that somehow she’d got out, and I’d tried not to have nothing to do with her. But now I marched out to where she was reading a magazine in the lobby and said, “Call Dr. Chung. Now.”\n“What’s wrong?”\n“Never you mind. Just call him.”\n“It’s ten o’clock at—”\n“I know what time it is. Call him.”\nShe did, and he came. I said, “We’re going to work now. Now, not in the morning. Them proteins are folding in me right this second, aren’t they? You call Jenny and Dr. Liu if you really need them. We’re going to work all night. Afore I change my mind.”\nHe looked at me hard. Funny how when you know a person long enough, even a strange and ugly person, they don’t look so bad no more.\n“Okay,” he said. “Let’s work.”\nWe worked all night. We worked all week. We worked another week, then another. And I didn’t get no worse. No better, but no worse. What I got was scared.\nNobody ought to be able to do those things to somebody else’s brain, using nothing except little bits of light.\nDr. Chung froze me again while I was walking around.\nDr. Liu said, “Filtering signals is an important thalamic function, and any change in filtering may give rise to physiological effects.”\nDr. Chung made the “hyperawareness” come back, even stronger.\nJenny said, “Interfering with action potentials on cell membranes changes the way cells process information.”\nDr. Chung made me remember things from when I was really little—Mama singing to me. Shawn and me wrestling. Granmama telling me troll stories while I sat on her knee. Bobby teaching me to fish. The memories were so sharp, they felt like they was slicing into my brain. Good memories but too razored, making my mind bleed.\nDr. Liu said, “Are the opsins in the anterior nuclei over-expressing? That could cause problems.”\nDr. Chung did something that made me stutter so’s I couldn’t get a word out whole no matter how much I tried.\nJenny said, “Neural timing—even the shift of a few milliseconds can reverse the effect of the signal on the rest of the nervous system. Not good.”\nI didn’t think any of it was good. But I warn’t going to say anything in front of that Jenny; I waited until I got Dr. Chung alone.\n“I got to ask you something.”\n“Of course, Ludie.” He had just finished checking on my heart and blood pressure and all that. “Are you pleased by the way the study is going? You say your FFI symptoms aren’t any worse, and with the usual rapid progression of the disease in your family, that may mean genuine progress.”\n“I’m happy about that, yeah, if it goes on like now. But I got a different question. I been reading in that book you gave me, how the brain is and isn’t like a computer.” The book was hard going, but interesting.\n“Yes?” He looked really caught on what I was saying. For the first time, I wondered what his wife was like. Was she pretty?\n“A computer works on teeny switches that have two settings, on and off, and that’s how it knows things.”\n“A binary code, yes.”\n“Well, those laser switches on the bundle of optic cables you put in my head—they’re off and on, too. Could you make my head into a computer? And put information into it, like into a computer—information that warn’t there afore?”\nDr. Chung stood. He breathed deep. I saw the second he decided not to lie to me. “Not now, not with what we know at present, which isn’t nearly enough. But potentially, far down the road and with the right connections to the cortex, it’s not inconceivable.”\nWhich was a fancy way of saying yes.\n“Good night,” I said abruptly and went into my room.\n“Ludie—”\nBut I didn’t have nothing more to say to him. In bed, though, I used the tablet he loaned me—that’s what I been reading the book on—to get the Internet and find Dr. Chung. I got a lot of hits. One place I found a picture of him with his wife. She was pretty, all right, and refined-looking. Smart. He had his arm around her.\nSleep was even harder that night than usual. Then, the next day, it all happened.\nWe were in the testing room, and my hyperawareness was back. Everything was clear as mountain spring water, as sharp as a skinning knife. I kept rising up on my tip-toes, just from sheer energy. It didn’t feel bad. Dr. Chung watched me real hard, with a little frown.\n“Do you want a break, Ludie?”\n“No. Bring it on.”\n“Hippocampal connection test 48,” Jenny said, and Dr. Chung’s hand moved on his punchpad. The computer started clicking louder and louder. The door burst open and Bobby charged in, waving a knife and screaming.\n“Whore! Whore!” He plunged the knife into Jenny and blood spurted out of her in huge, foaming gushes. I shouted and tried to throw myself in front of Dr. Chung, but Bobby got him next. Dr. Liu had vanished. Bobby turned on me and he warn’t Bobby no more but a troll from Granmama’s stories, a troll with Bobby’s face, and Bonnie Jean hung mangled and bloody from his teeth. I hit out at the troll and his red eyes bored into me and his knife raised and—\nI lay on the floor, Dr. Chung holding me down, Jenny doubled over in pain, and the computer screen laying beside me.\n“Ludie—”\n“What did you do?” I screamed. “What did you do to me? What did I do?” I broke free of him, or he let me up. “What?”\n“You had a delusional episode,” Dr. Chung said, steady but pale, watching me like I was the Bobby-troll. And I was. I had hit Jenny and knocked over the computer, only it was—\n“Don’t you touch me!”\n“All right,” Dr. Chung said quietly, “I won’t.” Dr. Liu was picking up the computer, which was still clicking like a crazy thing. Mrs. Cully and a nurse stood in the doorway. Jenny gasped and wheezed. “You had a delusional episode, Ludie. Perhaps because of the FFI, perhaps—”\n“It was you, and you know it was you! You done it to me! You said you wouldn’t control my brain and now you—” I pulled at the optrode sticking up from my skull, but of course it didn’t budge. “You can’t do that to me! You can’t!”\n“We don’t know what the—”\n“You don’t know nothing! And I’m done with the lot of you!” It all came together in me then, all the strangeness of what they was doing and the fear for my family and them throwing me out and the lovely hyperawareness gone when the switch went off and Dr. Chung’s pretty wife—all of it.\nI didn’t listen to nothing else they said. I walked straight out of that clinic, my legs shaking, without even grabbing my coat. And there was Shawn pulling up in Jimmy Barton’s truck, getting out and looking at me with winter in his face. “Bobby’s dead,” he said. “He killed himself.”\nI said, “I know.”\nThe funeral was a week later—it took that long for the coroner to get done fussing with Bobby’s body. It was election day, and Ratface Rollins lost, along with the whole Libertarian party.\nThe November wind blew cold and raw. Mama was too bad off to go to the graveyard. But Shawn brought her at the service where she sat muttering, even through the church choir singing her favorite, “In the Sweet Bye and Bye.” I don’t know if she even knew what was going on; for sure she didn’t recognize me. It warn’t be long afore she’d be as bad as Bobby, or in a coma like Aunt Carol Ames. Granmama recognized me, of course, but she didn’t say nothing when I came into the trailer, or when I stayed there, sleeping in my old bed with Patty and Bonnie Jean, or when I cleaned up the place a bit and cooked a stew with groceries from my clinic money. Granmama didn’t thank me, but I didn’t expect that. She was grieving Bobby. And she was Granmama.\nDinah kept to her room, her kids pretty much in there with her day and night.\nI kept a hat on, over my part-shaved head. Not the red knit hat Dr. Chung gave me, which I wadded up and threw in the creek. In the trailer I wore Bobby’s old baseball cap, and at the funeral I wore a black straw hat that Mama had when I was little.\n“‘The Lord is my Shepherd; I shall not want. He maketh me to lie down in green pastures . . . ’” Reverend Baxter did funerals old-fashioned. Bobby’s casket was lowered into the hole in the churchyard. The last of the maple leaves blew down and skittered across the grass.\nDinah came forward, hanging onto Shawn, and tossed her flower into the grave. Then Granmama, then me, then Patty. The littlest kids, Lewis and Arianna and Timothy and Cody, were in relatives’ arms. The last to throw her flower was Bonnie Jean, and that’s when I saw it.\nBonnie Jean wore an old coat of Patty’s, too big for her, so’s the hem brushed the ground. When she stood by the grave that hem was shaking like aspen leaves. Her face had froze, and the pupils of her eyes were so wide it looked like she was on something. She warn’t. And it warn’t just the fear and grief of a ten-year-old at a funeral, neither.\n“Ashes to ashes, dust to dust . . . ”\nNeighbors brought cakes and covered dishes to the trailer. Nobody didn’t stay long ’cause they knew we didn’t want them to. Dinah went back into her room with her two kids, Mama was muttering beside the stove, Shawn sat smoking and drinking Bud. I told Patty to watch Timmy and Cody and I took Bonnie Jean into our bedroom.\n“How long since you slept through the whole night?”\nShe was scared enough to give me lip. “I sleep. You been right there next to me!”\n“How long, Bonnie Jean?”\n“I don’t got to tell you nothing! You’re a whore, sleeping with them Chinese and letting them do bad things to you—Bobby said!”\n“How long?”\nShe looked like she was going to cry, but instead she snatched Bobby’s baseball hat off my head. It seemed to me that my optrode burned like a forest fire, though of course it didn’t. Bonnie Jean stared at it and spat, “Chink Frankenstein!”\nProbably she didn’t even know what the words meant, just heard them at school. Or at home.\nThen she started to cry, and I picked her up in my arms and sat with her on the edge of the bed, and she let me. All at once I saw that the bed was covered with the Fence Rail quilt Dinah had been making for the women’s co-op. She’d put it on my bed instead.\nI held Bonnie Jean while she cried. She told me it had been two weeks since she couldn’t sleep right and at the graveyard was her second panic attack—what she called “the scared shakes.” She was ten years old, and she carried the gene Granmama and God-knows-who-else had passed on without being affected themselves. Insomnia and panic attacks and phobias. Then hallucinations and more panic attacks and shrinking away to hardly no weight at all. Then dementia or coma or Bobby’s way out. Ten years old. While I was nineteen and I hadn’t even felt her restless beside me in the long cold night.\nI knowed, then, what I had to do.\nThe Chinese clinic was almost empty.\nA sign outside said CLOSED. Through the window I could see the lobby stripped of its chairs and pictures and clothesbasket of toys. But a light shone in a back room, bright in the drizzly gray rain. I rattled the lock on the door and shouted “Hey!” and pretty soon Mrs. Cully opened it.\nShe wore jeans and a sweatshirt instead of her usual dress, and her hair was wrapped in a big scarf. In one hand was a roll of packing tape. She didn’t look surprised to see me. She looked something, but I couldn’t read it.\n“Ludie. Come in.”\n“You all leaving Blaine?”\n“Our grant won’t be renewed. Dr. Chung found out the day after the election from a man he knows in Washington.”\n“But Rollins lost!”\n“Yes, but the new president made campaign promises to reinstate the FDA with tight regulations on studies with human subjects. Under Rollins there was too much abuse. So Doctors Chung and Liu are using their remaining money for data analysis, back at the university—especially since we have no research subjects here. I’m packing files and equipment.”\nThe rooms behind her, all their doors open, were full of boxes, some sealed, some still open. A feeling washed over me that matched the weather outside. The clinic never had no chance no matter who won the election.\nMrs. Cully said, “But Dr. Chung left something for you, in case you came back.” She plucked a brown envelope off the counter, and then she went back to her packing while I opened it. Tact—Mrs. Cully always had tact.\nInside the envelope was a cell phone, a pack of money with a rubber band around it, and a letter.\nLudie—\nThis is the rest of what the clinic owes you. Along with it, accept my deepest gratitude for your help with this study. Even though not finished, it—and you—have made a genuine contribution to science. You are an exceptional young woman, with exceptional intelligence and courage.\nThis cell phone holds the phone number for Dr. Morton, who implanted your optrode, and who will remove it. Call her to schedule the operation. There will of course be no charge. The phone also holds my number. Please call me. If you don’t, I will call this number every day at 11:00 a.m. until I reach you. I want only to know that you are all right.\nYour friend,\nHai Chung\nThe phone said it was 9:30 a.m. Mrs. Cully said, “Is that your suitcase?”\n“Yeah. It is. I need Dr. Chung’s address, ma’am.”\nShe looked at me hard. “Call him first.”\n“Okay.” But I wouldn’t. By the time the phone rang, I would be on the 10:17 Greyhound to Lexington.\nShe gave me his university address but wouldn’t give out his home. It didn’t really matter. I knew he would give it to me, plus whatever else I needed. And not just for the study, neither.\nDr. Chung told me, one time, about a scientist called Daniel Zagury. He was studying on AIDS, and he shot himself up with a vaccine he was trying to make, to test it. Dr. Chung didn’t do no experiments on himself; he used me instead, just like I was using him for the money. Only that warn’t the whole story, no more than Bobby’s terrible behavior when he got really sick was the whole story of Bobby. The Chinese clinic warn’t Chinese, and I’m not no Frankenstein. I’m not all that “courageous,” neither, though I sure liked Dr. Chung saying it. What I am is connected to my kin, no matter how much I used to wish I warn’t. Right now, connected don’t mean staying in Blaine to help Dinah with her grief and Shawn with his sickness and the kids with their schooling. It don’t mean waiting for Mama’s funeral, or living with Granmama’s sour anger at what her genes did to her family. Right now, being connected means getting on a Greyhound to Lexington.\nIt means going on with Dr. Chung’s study.\nIt means convincing him, and everybody else, to put a optrode in Bonnie Jean’s head, and Shawn’s, and maybe even Lewis’s, so laser light can “disrupt their neural pathways” and they don’t get no more misfolded prions than they already got.\nIt means paying for this with whatever work I get.\nAnd maybe it even means going to Washington D.C. and talking to my congressman—whoever he is—about why this study is a good thing. I read on Dr. Chung’s tablet that other scientists sometimes do that. Maybe I could take Bonnie Jean with me. She’s real pretty, and I can teach her to look pathetic. Maybe.\nI never had no thoughts like this afore, and maybe that’s the opsins, too. But maybe not. I don’t know. I only know that this is my path and I’m going to walk it.\nI hike to the highway, suitcase in one hand and cell phone in the other, and I flag down the bus.\nOriginally published in Twelve Tomorrows, edited by Stephen Cass.\nNancy Kress is the author of thirty-five books, including twenty-seven novels, four collections of short stories, and three books on writing. Her work has won six Nebulas, two Hugos, a Sturgeon, and the John W. Campbell Memorial Award. Her most recent works are a stand-alone novella about genetic engineering, Sea Change (Tachyon, 2020) and an SF novel of power and money, The Eleventh Gate (Baen, 2020). Nancy’s fiction has been translated into nearly two dozen languages including Klingon, none of which she can read. She has taught writing SF at various venues including Clarion and the annual two-week intensive workshop Taos Toolbox with Walter Jon Williams. She lives in Seattle with her husband, writer Jack Skillingstead, and Pippin, a Chihuahua puppy who chews everything.", "source": "https://clarkesworldmagazine.com/kress_06_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Pathways by Nancy Kress"}