{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "xv3qxqvCc4nZvLvX1BYbC242ZYk=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: It's Real?  I left my day job at the beginning of February, but it’s only now beginning to feel real. Previously, whenever I had vacation time, I’d shift to full-time editor, so when I finally did quit, it just felt like one of those vacations: lots of work, little downtime. The same here, initially: I had a small mountain of tasks on my to-do list and I’ve been head-down plowing through them. It’s hard to notice your world has changed when you are that focused.  It took nearly two months for me to clearly notice that this is my new life. I’ve been doing some freelance consulting for my former employer—a few hours here and there—so I haven’t fully disconnected from them. It’s all been remote assistance, so when I stopped by to help them with a more difficult problem, I noticed that stress that I had felt while working there, was gone. While there, I talked with friends about the ongoing situation and I sympathized, but it didn’t generate any anxiety. I walked to my car knowing that I was free.  A few days later, I left for a week of back-to-back events completely related to my new life. The first was an academic symposium at Penn State, where I was the only industry professional presenting alongside academics. I didn’t quite know what to expect. Despite working for over twenty-five years in academia, I never felt science fiction was welcome or respected. Being invited to participate was both flattering and frightening. In the end, I had a very positive experience, felt like I belonged, and learned a lot. Armed with that knowledge, I would have done things a little differently, but I have no regrets.  From there, I drove home and then flew to ICFA, the International Conference for the Fantastic in the Arts, which I’ve previously attended. While heavily academic in nature, ICFA has a significant number of authors and editors in attendance. I didn’t have any presentations to make at this one, it was purely work social: four days in the Florida sun chatting with fellow attendees by the pool. In this context, vacation takes on yet another role closer to what the word is meant to be, but not quite.  Coming back from all the travel was a return to my new routine. Taking care of a sick child, reading story submissions, sending out contracts, paying the insurance bill, vacuuming the house . . . This is my career now. It’s no longer just what I do on the side. It’s not a vacation, so maybe I need to add one of those to my to-do list. I like the sound of that. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: It's Real?\nI left my day job at the beginning of February, but it’s only now beginning to feel real. Previously, whenever I had vacation time, I’d shift to full-time editor, so when I finally did quit, it just felt like one of those vacations: lots of work, little downtime. The same here, initially: I had a small mountain of tasks on my to-do list and I’ve been head-down plowing through them. It’s hard to notice your world has changed when you are that focused.\nIt took nearly two months for me to clearly notice that this is my new life. I’ve been doing some freelance consulting for my former employer—a few hours here and there—so I haven’t fully disconnected from them. It’s all been remote assistance, so when I stopped by to help them with a more difficult problem, I noticed that stress that I had felt while working there, was gone. While there, I talked with friends about the ongoing situation and I sympathized, but it didn’t generate any anxiety. I walked to my car knowing that I was free.\nA few days later, I left for a week of back-to-back events completely related to my new life. The first was an academic symposium at Penn State, where I was the only industry professional presenting alongside academics. I didn’t quite know what to expect. Despite working for over twenty-five years in academia, I never felt science fiction was welcome or respected. Being invited to participate was both flattering and frightening. In the end, I had a very positive experience, felt like I belonged, and learned a lot. Armed with that knowledge, I would have done things a little differently, but I have no regrets.\nFrom there, I drove home and then flew to ICFA, the International Conference for the Fantastic in the Arts, which I’ve previously attended. While heavily academic in nature, ICFA has a significant number of authors and editors in attendance. I didn’t have any presentations to make at this one, it was purely work social: four days in the Florida sun chatting with fellow attendees by the pool. In this context, vacation takes on yet another role closer to what the word is meant to be, but not quite.\nComing back from all the travel was a return to my new routine. Taking care of a sick child, reading story submissions, sending out contracts, paying the insurance bill, vacuuming the house . . . This is my career now. It’s no longer just what I do on the side. It’s not a vacation, so maybe I need to add one of those to my to-do list. I like the sound of that.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_04_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: It's Real? by Neil Clarke"}