{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "YrG3xGymV+OqlIzs3sAR0Z0PoYs=", "id": null, "license": null, "comments": "", "raw_text": "Interview  War Destroys Everyone It Touches: A Conversation with Minister Faust  Minister Faust subverts conventions. And he speaks his mind. In other words, he likes to take risks.  \"When you stop taking risks, you stop making discoveries and doing truly remarkable things. You'll make mistakes via risk, and plenty of them, but the road to success is covered with the gravel of with mistakes. The road to blandness is perfectly smooth.\"  There is nothing bland about Faust's new novel, The Alchemists of Kush. His previous novels such as Shrinking the Heroes and The Coyote Kings of the Space-Age Bachelor Pad are written in a vibrant, fast, and lyrical style. Kush shows Faust at his best. Ishmael Reed, author of Mumbo Jumbo, has referred to Kush as \"possibly the first hip hop epic.\"  Steeped in African mythology and the brutal realities of war across time, The Alchemists of Kush tells the story of two \"lost boys\" living thousands of years apart.  The novel is neither comedy nor tragedy—it is various parts pain and joy. Just like life.  \"Comedy, essentially, is any story with a happy ending for the protagonist,\" said Faust. \"Tragedy is any story, according to convention, in which a figure falls from grace due to a personality defect and learns, prior to his absolute destruction, that he was the agent of his own demise. Certainly life, meaning the breadth and depth of collective human experience, has plenty of examples of each. But life on earth, as a self-replicating chemical-energetic form, is apparently unique in the universe—a startling, robust emanation of the cosmic possible. There's nothing tragic about that.\"  Below, the Canadian novelist and I talk about how he writes, why he writes, and what is at the heart of Kush.   What do you enjoy about writing fiction?  Fiction gives me many exciting opportunities, including the chance to play with words, ordering them in ways to provoke emotional and intellectual reactions. I also love using fiction in the way that Jonathan Swift (creator of the original, original Star Trek) and Rod Serling, among many others, did: to allegorize the modern unmentionable and the past remarkable, inside a thrilling context with much greater appeal and clarity than, for instance, history texts and journalism.  You mention comic books frequently when you teach and talk about writing.  Comics require brevity of narration and dialogue, and brevity's always worth employing. Superhero comic books provide for us moderns what mythic stories of gods and heroes did for the ancients: thrilling stories of cosmic power deployed against infernal menaces. Superheroes provide enormous appeal because they're often so starkly archetypal in their revelations of individual psychosocial development, in addition to just being freaking awesome.  Is there anything you know now that you wish you'd known ten or twenty years ago in terms of writing and publishing?  I wish I'd better understood the many illusions into which I'd been socialized (or indoctrinated), such as the sad notion that I should be writing my fiction for the professors I'd hoped would one day be teaching my work. I want to write intelligent people, but not to pander to the gatekeepers of academe. I also wish I'd spent much more time learning the business of marketing and promotion. But I'm making up for lost time now, and thanks to the internet, the job is much easier than it was in 1991, and in ways no one then dreamed possible, as with, for instance, video production and distribution.  Where does a novel usually start for you—image, plot, character, historical event, somewhere else altogether?  I keep notes on whatever is currently exciting me; sometimes some of those elements (such as personalities, dramatic images, current or historical events) hint at a story. When I start to feel as if a story wants to exist, I start brainstorming around what things I've recently been condemning, and what things I've recently been praising, that might work well with this story. My writing students know this as my \"rants and raves\" exercise. It's a convenient way to figure out what's inciting enough passion to give me the momentum to complete the imagining, and hopefully the drafting, of novel. I take extensive notes on characters, settings, relationships, images, events, and more, over the course of months or even years, and eventually order them into a three-act structure which is my outline. Then I write it, proofread it, send it to beta readers, revise it, and prepare it for market.  Where did your new novel, The Alchemists of Kush begin for you?  The Alchemists of Kush is about two Sudanese \"lost boys,\" each of whom lost fathers to civil war, lost mothers to exile, and lost innocence to the means required to survive, before finding mystic mentors who promised them the means to transform themselves and their worlds. One is named Raphael Garang, and he lives in present-day Edmonton where he is known to the streets as the Supreme Raptor. The other is Hru-sa-Usir, who lived 7,000 years ago along the Nile, and was later known to the Greeks as Horus, son of Osiris.  The novel began from two impulses: first, I'd long wanted to reinterpret for modern audiences the classic story of Usir, Aset, Hru and Set (or to use the more widely-known Greek versions of their names, Osiris, Isis, Horus and Set), especially to situate it in its proper context as a Sudanese story that was a foundation for ancient Egyptian culture, a story that was of enormous mythic significance for continental and diasporic Africans, and second, to create an allegory for the founding of a modern mystical community known as the Nation of Gods and Earths. I began putting the building blocks of the story together as long ago as 1995, but the story as it exists didn't crystallize until 2006 or so.  The novel is similar to my other novels in that it focuses on character and takes readers to locations and cultures that will be new to most of them, one of those cultures being E-Town itself. The novel is quite a departure from my previous work in that it focuses on teens (although it's definitely not a YA novel), and I usually write about people my own age. Drawing on my own experiences helped, but I based my characterizations largely on my observations of teenagers I met during my ten years as a junior high and high school English teacher, and a youth mentor for a leadership training group whose curriculum I helped design.  You really seem to enjoy writing characters who are mystics (or are they madmen?).  I don't know for sure what that means! I will say that in The Alchemists of Kush, my two mystics aren't, in my opinion, the clichés I've seen elsewhere. Proceeding from a technical description of mysticism as the pursuit of experience that imparts a profound sensory-emotional conviction of the oneness of all life, I drew two characters who use a complex array of natural, psychological and social patterns to help their young charges see that life is not a miasma of meaningless, dangerous chaos, but a field of materials that one can assemble, if one understands the principles, into a shining temple. I wanted to portray these men as flawed, as sometimes foolish, but ultimately as devoted caretakers.  You've mentioned that you have a deep fascination Egyptian architecture. Has that influenced the shape of The Alchemists of Kush at all?  An interesting question. I do love Egyptian architecture, but that wasn't a significant influence on this story. It's Egyptian, or more appropriately Kemetic, mythology that has been the primary influence.  What challenges did having two characters living 7,000 years apart present you with?  I believe that the \"forsooth, milady\" approach to writing the voices of archaic characters places tremendous distance between them and readers. The fact is, \"courtly language\" is a fiction, a result of how poets sanitized and glorified the language of kings and knights who, let us remember, were simply the most successful organized murderers, thieves, rapists, and racketeers of their respective regions. The biggest difference between kings and the characters in Goodfellas is that kings had poets and priests to tell beautiful lies about their righteousness. Courtly language in historical fiction and high fantasy pushes that monarchist propaganda, and renders people who had complex social, sexual, psychological, and personal experiences into arty props. So I had to decide how I was going to render my ancient world in a way that would be honest to the mood of the events and emotional reality of my characters that would also not throw readers out of connection by being too contemporary. It was definitely a challenge, and I'm happy with the result.  I also needed to have the stories of the two Sudanese lost boys track in a way that was dramatically satisfying for readers, without being so rigid that readers couldn't be surprised. Playing that kind of constant game of distraction is risky and very exciting.  How'd you go about \"playing\" that game?  The book contains three stories—\"The Book of Then,\" \"The Book of Now,\" and \"The Book of the Golden Falcon,\" which is either the original source for revisionist \"The Book of Then,\" or a sanitized version of it, depending on your ideological and aesthetic inclinations... or perhaps something else entirely. I wrote a chapter a day of \"The Book of the Golden Falcon\" for ten days. Then I wrote a chapter per day (or so) of \"The Book of Then.\" Then I wrote \"The Book of Now,\" but its chapters are much longer, and two-fifths of the way through I had to complete a contract writing job (an educational manual). I got sidetracked and lost the mindset, and it took me months to get it back. I began on April 1, 2009 and completed the book around 6 am on January 1, 2010. Writing the book in this way helped me provide the general tracking without forcing too many things to track too closely.  Did the final draft of The Alchemists of Kush surprise you?  Fascinating question. I do extensive planning to create my books, and I think I did a far more efficient job of planning this one than I did with any of my previous novels, by which I mean I left fewer holes. The draft still did surprise me by how much music it contained, how fun it was to write metrical prose for extended sections, and by its inclusion of a small but critically significant character named Wacera.  Yes! Wacera! Where did Wacera come from?  I don't want to give away too much, except to say that I once told my father about a woman I'd fallen in love with, and he gave her a Gikuyu name (my father is Kenyan... 3/4 Gikuyu and 1/4 Masai). I was writing a passage in which my protagonist is reflecting upon a girl he likes, and suddenly his mind flashes to his past. That's about all I can say without ruining the moment and the ending.  Oh, and I was also surprised by how much I was able to convey, in a way I found artistically satisfying, the degree to which war destroys everyone it touches.  Can you parse \"artistically satisfying\" out a little bit?  Well, all I mean is that I like the poetical language I used to convey the narrator's rush of memory, and the emotions the sequence stirs in me. As far as hopeful, yes, indeed, the novel is hopeful. Egyptian religion is fundamentally hopeful, the first coherent, literate theology (indeed, the first written religious and moral scripture, period, that profoundly influenced the Bible, which was written literally thousands of years later) that promised resurrection and urged moral development towards spiritual perfection.  And what is left after everyone is destroyed? Your novel still seems hopeful...  What I meant about war destroying everyone it touches is that we need to get past our romantic notions that war is honorable and that soldiers are superior to the rest of us. There's nothing elevating about carrying and using guns for the government.  One of the biggest hypocrisies I know is that the people who spend the most time complaining about \"big government\" and \"collectivism\" are usually the biggest advocates of Big War, which depends on taking money from people and their society that produces little spin-off technology that improves lives, almost no public services, terrible working conditions for soldiers, terrible family lives for many soldiers' families, and, of course, the mass-murder of civilians across the world. War turns otherwise decent human beings into killers, torturers, thieves, and rapists. If you don't believe me, check out the work of Cynthia Enloe and Howard Zinn.  I'm not suggesting all soldiers are monsters... not at all. I have military folk in my family; I almost joined the military; several past and current friends are military people. There is some value in having some type of military. But most of the folks who slather their bumpers with \"Support Our Troops\" stickers don't mean that troops need psychological counseling to cope with the constant terror in which they lived, or the reality of the people they killed, people who were simply defending our living in their own countries. They don't mean support for the soldiers who will go on to commit suicide; they don't mean support for the families of soldiers who'll be terrorized by physical and emotional violence from fathers they no longer recognize.  Again, I don't mean all soldiers collapse these ways, but so many do that it's disgusting that we collectively pretend this destruction isn't happening. And I place particular blame on the news editors and producers, and the bumper sticker crowd, because what they fundamentally mean by \"Support Our Troops\" is \"Always Question the Government Except When It Comes to Slaughtering People in Their Own Countries.\"  And I'd like to point out that everything I've written above applies to every country in the world with a military, which is almost every last one of them.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nWar Destroys Everyone It Touches: A Conversation with Minister Faust\nMinister Faust subverts conventions. And he speaks his mind. In other words, he likes to take risks.\n\"When you stop taking risks, you stop making discoveries and doing truly remarkable things. You'll make mistakes via risk, and plenty of them, but the road to success is covered with the gravel of with mistakes. The road to blandness is perfectly smooth.\"\nThere is nothing bland about Faust's new novel, The Alchemists of Kush. His previous novels such as Shrinking the Heroes and The Coyote Kings of the Space-Age Bachelor Pad are written in a vibrant, fast, and lyrical style. Kush shows Faust at his best. Ishmael Reed, author of Mumbo Jumbo, has referred to Kush as \"possibly the first hip hop epic.\"\nSteeped in African mythology and the brutal realities of war across time, The Alchemists of Kush tells the story of two \"lost boys\" living thousands of years apart.\nThe novel is neither comedy nor tragedy—it is various parts pain and joy. Just like life.\n\"Comedy, essentially, is any story with a happy ending for the protagonist,\" said Faust. \"Tragedy is any story, according to convention, in which a figure falls from grace due to a personality defect and learns, prior to his absolute destruction, that he was the agent of his own demise. Certainly life, meaning the breadth and depth of collective human experience, has plenty of examples of each. But life on earth, as a self-replicating chemical-energetic form, is apparently unique in the universe—a startling, robust emanation of the cosmic possible. There's nothing tragic about that.\"\nBelow, the Canadian novelist and I talk about how he writes, why he writes, and what is at the heart of Kush.\nWhat do you enjoy about writing fiction?\nFiction gives me many exciting opportunities, including the chance to play with words, ordering them in ways to provoke emotional and intellectual reactions. I also love using fiction in the way that Jonathan Swift (creator of the original, original Star Trek) and Rod Serling, among many others, did: to allegorize the modern unmentionable and the past remarkable, inside a thrilling context with much greater appeal and clarity than, for instance, history texts and journalism.\nYou mention comic books frequently when you teach and talk about writing.\nComics require brevity of narration and dialogue, and brevity's always worth employing. Superhero comic books provide for us moderns what mythic stories of gods and heroes did for the ancients: thrilling stories of cosmic power deployed against infernal menaces. Superheroes provide enormous appeal because they're often so starkly archetypal in their revelations of individual psychosocial development, in addition to just being freaking awesome.\nIs there anything you know now that you wish you'd known ten or twenty years ago in terms of writing and publishing?\nI wish I'd better understood the many illusions into which I'd been socialized (or indoctrinated), such as the sad notion that I should be writing my fiction for the professors I'd hoped would one day be teaching my work. I want to write intelligent people, but not to pander to the gatekeepers of academe. I also wish I'd spent much more time learning the business of marketing and promotion. But I'm making up for lost time now, and thanks to the internet, the job is much easier than it was in 1991, and in ways no one then dreamed possible, as with, for instance, video production and distribution.\nWhere does a novel usually start for you—image, plot, character, historical event, somewhere else altogether?\nI keep notes on whatever is currently exciting me; sometimes some of those elements (such as personalities, dramatic images, current or historical events) hint at a story. When I start to feel as if a story wants to exist, I start brainstorming around what things I've recently been condemning, and what things I've recently been praising, that might work well with this story. My writing students know this as my \"rants and raves\" exercise. It's a convenient way to figure out what's inciting enough passion to give me the momentum to complete the imagining, and hopefully the drafting, of novel. I take extensive notes on characters, settings, relationships, images, events, and more, over the course of months or even years, and eventually order them into a three-act structure which is my outline. Then I write it, proofread it, send it to beta readers, revise it, and prepare it for market.\nWhere did your new novel, The Alchemists of Kush begin for you?\nThe Alchemists of Kush is about two Sudanese \"lost boys,\" each of whom lost fathers to civil war, lost mothers to exile, and lost innocence to the means required to survive, before finding mystic mentors who promised them the means to transform themselves and their worlds. One is named Raphael Garang, and he lives in present-day Edmonton where he is known to the streets as the Supreme Raptor. The other is Hru-sa-Usir, who lived 7,000 years ago along the Nile, and was later known to the Greeks as Horus, son of Osiris.\nThe novel began from two impulses: first, I'd long wanted to reinterpret for modern audiences the classic story of Usir, Aset, Hru and Set (or to use the more widely-known Greek versions of their names, Osiris, Isis, Horus and Set), especially to situate it in its proper context as a Sudanese story that was a foundation for ancient Egyptian culture, a story that was of enormous mythic significance for continental and diasporic Africans, and second, to create an allegory for the founding of a modern mystical community known as the Nation of Gods and Earths. I began putting the building blocks of the story together as long ago as 1995, but the story as it exists didn't crystallize until 2006 or so.\nThe novel is similar to my other novels in that it focuses on character and takes readers to locations and cultures that will be new to most of them, one of those cultures being E-Town itself. The novel is quite a departure from my previous work in that it focuses on teens (although it's definitely not a YA novel), and I usually write about people my own age. Drawing on my own experiences helped, but I based my characterizations largely on my observations of teenagers I met during my ten years as a junior high and high school English teacher, and a youth mentor for a leadership training group whose curriculum I helped design.\nYou really seem to enjoy writing characters who are mystics (or are they madmen?).\nI don't know for sure what that means! I will say that in The Alchemists of Kush, my two mystics aren't, in my opinion, the clichés I've seen elsewhere. Proceeding from a technical description of mysticism as the pursuit of experience that imparts a profound sensory-emotional conviction of the oneness of all life, I drew two characters who use a complex array of natural, psychological and social patterns to help their young charges see that life is not a miasma of meaningless, dangerous chaos, but a field of materials that one can assemble, if one understands the principles, into a shining temple. I wanted to portray these men as flawed, as sometimes foolish, but ultimately as devoted caretakers.\nYou've mentioned that you have a deep fascination Egyptian architecture. Has that influenced the shape of The Alchemists of Kush at all?\nAn interesting question. I do love Egyptian architecture, but that wasn't a significant influence on this story. It's Egyptian, or more appropriately Kemetic, mythology that has been the primary influence.\nWhat challenges did having two characters living 7,000 years apart present you with?\nI believe that the \"forsooth, milady\" approach to writing the voices of archaic characters places tremendous distance between them and readers. The fact is, \"courtly language\" is a fiction, a result of how poets sanitized and glorified the language of kings and knights who, let us remember, were simply the most successful organized murderers, thieves, rapists, and racketeers of their respective regions. The biggest difference between kings and the characters in Goodfellas is that kings had poets and priests to tell beautiful lies about their righteousness. Courtly language in historical fiction and high fantasy pushes that monarchist propaganda, and renders people who had complex social, sexual, psychological, and personal experiences into arty props. So I had to decide how I was going to render my ancient world in a way that would be honest to the mood of the events and emotional reality of my characters that would also not throw readers out of connection by being too contemporary. It was definitely a challenge, and I'm happy with the result.\nI also needed to have the stories of the two Sudanese lost boys track in a way that was dramatically satisfying for readers, without being so rigid that readers couldn't be surprised. Playing that kind of constant game of distraction is risky and very exciting.\nHow'd you go about \"playing\" that game?\nThe book contains three stories—\"The Book of Then,\" \"The Book of Now,\" and \"The Book of the Golden Falcon,\" which is either the original source for revisionist \"The Book of Then,\" or a sanitized version of it, depending on your ideological and aesthetic inclinations... or perhaps something else entirely. I wrote a chapter a day of \"The Book of the Golden Falcon\" for ten days. Then I wrote a chapter per day (or so) of \"The Book of Then.\" Then I wrote \"The Book of Now,\" but its chapters are much longer, and two-fifths of the way through I had to complete a contract writing job (an educational manual). I got sidetracked and lost the mindset, and it took me months to get it back. I began on April 1, 2009 and completed the book around 6 am on January 1, 2010. Writing the book in this way helped me provide the general tracking without forcing too many things to track too closely.\nDid the final draft of The Alchemists of Kush surprise you?\nFascinating question. I do extensive planning to create my books, and I think I did a far more efficient job of planning this one than I did with any of my previous novels, by which I mean I left fewer holes. The draft still did surprise me by how much music it contained, how fun it was to write metrical prose for extended sections, and by its inclusion of a small but critically significant character named Wacera.\nYes! Wacera! Where did Wacera come from?\nI don't want to give away too much, except to say that I once told my father about a woman I'd fallen in love with, and he gave her a Gikuyu name (my father is Kenyan... 3/4 Gikuyu and 1/4 Masai). I was writing a passage in which my protagonist is reflecting upon a girl he likes, and suddenly his mind flashes to his past. That's about all I can say without ruining the moment and the ending.\nOh, and I was also surprised by how much I was able to convey, in a way I found artistically satisfying, the degree to which war destroys everyone it touches.\nCan you parse \"artistically satisfying\" out a little bit?\nWell, all I mean is that I like the poetical language I used to convey the narrator's rush of memory, and the emotions the sequence stirs in me. As far as hopeful, yes, indeed, the novel is hopeful. Egyptian religion is fundamentally hopeful, the first coherent, literate theology (indeed, the first written religious and moral scripture, period, that profoundly influenced the Bible, which was written literally thousands of years later) that promised resurrection and urged moral development towards spiritual perfection.\nAnd what is left after everyone is destroyed? Your novel still seems hopeful...\nWhat I meant about war destroying everyone it touches is that we need to get past our romantic notions that war is honorable and that soldiers are superior to the rest of us. There's nothing elevating about carrying and using guns for the government.\nOne of the biggest hypocrisies I know is that the people who spend the most time complaining about \"big government\" and \"collectivism\" are usually the biggest advocates of Big War, which depends on taking money from people and their society that produces little spin-off technology that improves lives, almost no public services, terrible working conditions for soldiers, terrible family lives for many soldiers' families, and, of course, the mass-murder of civilians across the world. War turns otherwise decent human beings into killers, torturers, thieves, and rapists. If you don't believe me, check out the work of Cynthia Enloe and Howard Zinn.\nI'm not suggesting all soldiers are monsters... not at all. I have military folk in my family; I almost joined the military; several past and current friends are military people. There is some value in having some type of military. But most of the folks who slather their bumpers with \"Support Our Troops\" stickers don't mean that troops need psychological counseling to cope with the constant terror in which they lived, or the reality of the people they killed, people who were simply defending our living in their own countries. They don't mean support for the soldiers who will go on to commit suicide; they don't mean support for the families of soldiers who'll be terrorized by physical and emotional violence from fathers they no longer recognize.\nAgain, I don't mean all soldiers collapse these ways, but so many do that it's disgusting that we collectively pretend this destruction isn't happening. And I place particular blame on the news editors and producers, and the bumper sticker crowd, because what they fundamentally mean by \"Support Our Troops\" is \"Always Question the Government Except When It Comes to Slaughtering People in Their Own Countries.\"\nAnd I'd like to point out that everything I've written above applies to every country in the world with a military, which is almost every last one of them.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/faust_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: War Destroys Everyone It Touches: A Conversation with Minister Faust by Jeremy L. C. Jones"}