{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Lee Beavington", "hostname": "clarkesworldmagazine.com", "date": "2008-05-29", "categories": "", "tags": "", "fingerprint": "5kkjpV39XiIPPCoTT67Uz6UPERs=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Druids Reconstructed  Stonehenge rises like a crown above the horizon, ancient four-tonne bluestones fixed in a sacramental circle. The cryptic monument’s sudden appearance through the windshield is seductive. Alone with these noble rocks, one’s mind turns to ritual and rite, and druids. From Merlin and Terry Brooks to World of Warcraft and the neo-druids celebrating solstice at Stonehenge, the druid mythology ignites our imagination. Thirty thousand people in the USA identify themselves as druids, yet they bear little resemblance to the barbarian philosophers, as the Greeks called them, who purportedly set living men on fire. Caesar plainly describes ritual murder and human sacrifice as druidic practice. And what link, if any, do they have with Stonehenge?  History  Imagine a white-robed figure brandishing mistletoe while a great bull is prepped for sacrifice. This learned priesthood revered the elements, lived in sacred groves of oak and hazel, and presided over religious ceremonies. A dominant force in the Celtic world, druids once held rank and prestige across Western Europe. Diverse claims by historians suggest they were scientists, magicians, judges and kingmakers.  Caesar gave a Roman slant on druidism: guardians of ancient customs and animism, practitioners of divining, and reincarnation. The vast druidic lore took upwards of twenty years to study in completion, according to Caesar.  The fog of time shrouds the druids in mystery. The earliest record of the name druidae dates back to second century BCE, in a work by Greek historian Sotion of Alexandria. The word druid holds dual meaning: oak, true, and solid derives from the Greek druidēs, while the Old Celtic term druídecht means magic. Nature and wisdom.  Druids have become mythologized by both 17th century scholars and 20th century romanticists. Finding authentic druid lore—not interpretations or artifacts of uncertain origin—is like studying all religions in search of the one true faith. Most surviving texts offer subjective analysis.  History erased the druid’s chapter, as not a single piece of their oral tradition has survived. Celtic fragments found in excavations and various texts offer brief glimpses of habit and ritual, but few sources support other independent accounts. The word druid (in Celtic, Greek or Latin form) is not found in any pre-Christian inscription. Therefore, any connection of druids to monuments or sculptures requires some level of conjecture. Grave archaeology, ceremonial sites, and Romano-Celtic art depicting ritual practices—such as The Wicker Image in Britannia Antiqua Illustrata—only allow for radiocarbon dating and tentative inferences. The official suppression by Roman authority two thousand years ago helped convert druidic history to an idealized mythology.   Ceremonial Practice  Pliny the Elder offers the only complete depiction of druidic ceremonial practice. During a time of fasting, brookweed and flowering Selago were gathered in meticulous fashion. Six days after the full moon, two massive bulls, muscles rippling beneath their white skin, were prepared for sacrifice. The rite started with a white-robed druid who is said to use a golden sickle (more likely gilded bronze) to cut a hearty mistletoe stem from an oak, and the sacrifice commenced.  In Norse mythology, mistletoe could kill a god, as Balder, the son of Odin, was slain by an arrow of mistletoe. Pliny suggests druids used this parasitic plant to cure animal infertility. Mistletoe fruit ripens around winter solstice, a time of birth and renewal, and symbolizes immortality. Modern ecology places mistletoe as a keystone species, as studies show a positive relationship between its presence and animal diversity. Perhaps the druids understood mistletoe’s ecological benefits.  The Gundestrup cauldron, from 1st century BCE, offers further insight into druidic customs. This gilded silver vessel was found in the Raevemosen Bog in Jutland, Denmark, and is covered in mythic narrative art, likely of Celtic origin. An army stands in full war gear surrounding a sacred tree. Deer, snake, horse, dog, and elephant are inscribed—the latter suggests Asian origin, but Celtic coins also bore images of elephants. Bull and human sacrifice are both depicted; many texts indicate druids led sacrificial ceremonies. However, the Gundestrup cauldron’s history is steeped in supposition.  Sacrificial rituals were employed to appease the gods and help combat enemies, disease or drought. “Then finally they kill the victims, praying to God to render his gift propitious to those on whom he has bestowed it.” (Pliny, Natural History XVI, 95.) Some druids, according to Caesar, vowed to immolate themselves. He goes on to describe “wicker-work images of vast size, the limbs of which they fill with living men and set on fire.”   It is judged that the punishment of those who participated in theft or brigandage or other crimes are more pleasing to the immortal gods; but when the supplies of this kind fail, they even go so low as to inflict punishment on the innocent. (Caesar, Gallic Wars VI, 13.)  Strabo, a Greek historian, wrote, “they would strike a man who had been consecrated for sacrifice in the back with a sword, and make prophecies based on his death-spasms.” (Strabo, Geography IV, 4, 5.) Yet Strabo, like Caesar, simply reiterated the Posidonian texts, often without acknowledging this source. Posidonius, a Greek philosopher, is one of the few historians who likely encountered druids during his travels through Gaul (the territories of Western Europe where Celtic Gauls lived). Others, such as the 1st century Roman historian Tacitus, wrote that British druids “deemed it indeed a duty to cover their altars with the blood of captives and to consult their deities through human entrails.” (Tacitus, Annals XIV, 30-31.) Of the limited early texts, enough mention animal and human sacrifice to suggest druids engaged in such rituals.  Truth versus Fiction  A portrait of a white-clad druid atop the large branch of an oak, with sickle in hand, has influenced druidic perception to this day. The illustration’s origin is unknown, yet clearly inspired by Pliny the Elder’s account. A bull is portrayed with its horns bound, while pottery plates, jugs, and a basket suggest preparation for a feast. Both Welsh Druids and neo-druids (present-day druids that venerate nature) include elements of Pliny’s account—and this illustration—in their mandates. Thus one image of ambiguous origin has thrust potential misconceptions hundreds of years forward to the present.  Julius Caesar presents the most detailed report on the druid’s role in society. Book VI of Commentarii de Bello Gallico explains their exemption from taxes and military service, status equitable to nobles, and their role as guardians of tradition and purveyors of judgement. “ . . . they hold various lectures and discussions on astronomy, on the extent and geographical distribution of the globe, [and] on the different branches of natural philosophy.” Druids follow the Pythagorean philosophy, where “the soul does not die and that after death it passes from one body into another.”  After the start of the Common Era in the Gregorian calendar, a closer examination of the texts reveals a marked shift in opinion. Druids began to be perceived with loathing and contempt. Romans perpetuated their uncouth savagery, and referred to their wicked religion as barbarous and inhuman. Pliny even hints at ritual cannibalism. This shift coincides with a change in Gaulish society from a monarchy to a magistrate, and a decline in druid stature. The hostile manner in which Caesar, Strabo and others chronicled the druids was likely in response to an active rebellion against Rome. To counter this resistance, Roman historians portrayed paganism in sinister terms.  The druids did exist, but their traditions and beliefs cannot be confirmed. Unsubstantiated claims put William Blake as an Archdruid, as he frequently referred to them in his Prophetic Books, which included illustrations of Stonehenge and Avebury. Other literati, such as Thomas Grey and William Wordsmith, identified themselves with the ancient priesthood. But these were part of a much later revival, starting with John Aubrey’s writings in the late 1600s, and the genesis in 1781 of the Ancient Order of Druids.  Diviciacus, a Gaul chieftain, is perhaps history’s only recorded druid. Caesar described him as a soldier and statesman, while Cicero, one of Rome’s pre-eminent philosophers and orators, labelled him not only a druid but a scholar of natural phenomena with the ability to foretell the future through divination and inference. He did this through the study of bird flight, an idea Tacitus rejected as superstition. Cicero claims to have discussed philosophy with Diviciacus. (Cicero, De Divinatione I, 90.)  Decline of Druidism  How did the druids, once the elite of Gaulish society, fall into obscurity? The Romans welcomed Celtic gods into their Pantheon, but forbade pagan worship. Caesar perpetuated the druidic ritual of human sacrifice in order to gain public support for his war in Gaul. In Britain, Suetonius Paulinus led the attack on Anglesey, purportedly the last druid stronghold, as recorded by Tacitus:   . . . a circle of Druids, lifting their hands to heaven and showering imprecations, struck the troops with such an awe at the extraordinary spectacle that, as though their limbs were paralysed, they exposed their bodies to wounds without an attempt at movement. Then, reassured by their general, and inciting each other never to flinch before . . . fanatics, they charged behind the standards, cut down all who met them, and enveloped the enemy in his own flames. (Tacitus, Annals XIV, 30-31.)  Rome prevailed. In early British literature, the word druid became obsolete. However, the druids of Scotland and Ireland were left unscathed by Roman aggression.  The Stonehenge Connection  Walter Pope wrote The Salisbury Ballad in 1676:   I will not forget these Stones that are set  In a round, on Salsbury Plains Tho’ who brought ‘em there, ‘tis hard to declare, The Romans, or Merlin, or Danes Pope does not mention pagan priests. Inigo Jones, a noted 17th century English architect, discards the druidic connection to Stonehenge on the basis that classical sources contain no reference to druid or Briton possessing architectural aptitude. But then, as a whole, druid references are scarce in any tradition. Jones considered Stonehenge Roman, as detailed in his posthumously published The most notable Antiquity of Great Britain, vulgarly called Stone-heng (sic). Some credit Danes as the architects of Stonehenge, based on superficial similarities with Danish megalithic monuments.  Neo-druids celebrate solstice within Stonehenge’s two concentric circles. The huge bluestones are believed to have come from the Preseli Hills of west Wales, over two hundred and fifty kilometers away, transported either by the Irish Sea Glacier or via a human transport mechanism not yet fathomed by modern scholars. Bluestone is a generic term; in reality, Stonehenge is comprised of at least twenty different types of rock. The word trilithon (Greek for “possessing three stones”) refers to the arrangement of two tall, vertical slabs with a third placed horizontally on top.  Stonehenge’s multi-phase construction lasted one hundred and fifty years, with four-tonne stones being erected about 2500 BCE. In the first phase, a circular ditch and bank measuring one hundred and ten meters across was built. Flint tools and deer and oxen bones have been excavated from this trench, fire and beast suggesting a druid connection. Yet the druid-Stonehenge correlation is based on speculation; several other theories present equally plausible hypotheses.  Recent discoveries by the Stonehenge Riverside Project help explain Stonehenge’s purpose. Ancient human remains, put at 3,000 BCE by radiocarbon dating, suggest these giant sandstone blocks were erected about five hundred years after the site was first used as a burial ground. Cremations were dug from what are called the Aubrey Holes, meaning pre-Stonehenge served as a cemetery. Around two hundred and forty people were buried beneath Stonehenge over the course of five hundred years, selected for this sacred site perhaps because of special status, or membership to an elite dynasty of rulers.  Modern Stonehenge is owned by English Heritage, which was granted an exclusion zone in 1985. Cloak and staff-bearing neo-druids clash with police over usage rights in incidents such as the Battle of the Beanfield, where police in riot gear chased away travellers hoping to celebrate summer solstice near Stonehenge. Each year, the number of pagan pilgrims increases. If no claim of ownership can be substantiated, how did druids become firmly cemented with Stonehenge?  The medieval period sparked little interest in druids. In the latter half of the 17th century, John Aubrey drew on the works of Caesar and—along with his own systematic archaeological fieldwork in Wiltshire—assigned druidic origin to Stonehenge, the first to make this connection. He argued Stonehenge and Avebury were pre-Roman temples, and therefore druidic, the dominant priesthood at the time, an idea now embedded in English folklore.  Evolving Mythology  Historians over the last few centuries have transformed druids into virtuous sages, their barbarianism and sacrificial rituals conveniently eschewed. The pendulum of druidism could not have shifted further out on both sides. First, exaggeration by historians to help justify the war in Gaul, followed thousands of years later by a denial of savage cruelty on the part of the druids.  The initial awe of seeing these bluestones rise from a time before Buddha or Christ sours upon closer examination of the henge. Some stones are missing, others fallen, reconstructed in the early 1900s to stand once more. But what truly spoil the mystery are the bustling tourists flashing their cameras, the self-guiding headphones strapped to their ears, and the perfunctory gift shop.  Today, accurate accounts of the druids have all but vanished. Encounter diluted to report, and report faded into rumour. The Historia Brittonum—a medieval publication whose author remains suitably anonymous—elucidates the Stonehenge riddle best: “at what time this was done, or by what people, or for what memorial or significance, is unknown.” Despite the scarcity of facts, and the lack of a single written word attributed to their sacred order, the druid myth endures.  For a moment, let us put aside the pre-recorded audio, the tacky Stonehenge trinkets, and the pieced together fragments of philosophers. Go back to that first day the stones were erected, and every trilithon stood impossibly high. Under the midnight sky, step quietly around these megaliths into moon shadow. Touch the glacier-sent bluestone with a hand that helped construct this marvel of human creativity, long before machine, at a time when the abacus served as our latest technology. Let your tongue taste the shifting winds across the plains during the intersection of the seasons. Pause inside the meticulous circle of concentric stone, your feet planted on the center of this celestial map, a place that invites the spirits of mistletoe and bull. Come to understand how human and plant, earth and stone, and the gods of the sky are all interwoven. Perhaps, then, you are one step closer to understanding the extraordinary enigma that is the druid.  Select Bibliography  \r\n Caesar, Julius. Commentarii de Bello Gallico.  Cicero. De Divinatione.  Green, Miranda J. The World of the Druids, Thames and Hudson, 1997.  Milius, Susan. “Mistletoe, of All Things, Helps Juniper Trees.” Science News 161.1, January 2002.  Owen, James. “Stonehenge Was Cemetery First and Foremost, Study Says,” National Geographic News, May 29, 2008.  Piggott, Stuart. The Druids, Thames and Hudson, 1975.  Pliny the Elder. Natural History.  Sammes, Aylett. Britannia Antiqua Illustrata, 1676.  Squire, Charles. Celtic Myth and Legend, Newcastle Publishing, 1975.  Stonehenge Riverside Project (www.sheffield.ac.uk/archaeology/research/2.4329/index).  Tacitus. Annals.  Lee Beavington is an award-winning author of fiction, nonfiction and poetry. His novella, \"Evolution's End,\" appears in Writers of the Future XXII, and his book Common Plants of Greater Vancouver is a required textbook for both science and arts students. In addition to teaching ecology, cell biology and genetics in the biology lab at Kwantlen University, he also served as primary photography for three of Lone Pine's nature books, including Wild Berries of British Columbia. His Master's thesis explores the intersection of creative process, nature experience, storytelling and transformational change.", "text": "Non-Fiction\nDruids Reconstructed\nStonehenge rises like a crown above the horizon, ancient four-tonne bluestones fixed in a sacramental circle. The cryptic monument’s sudden appearance through the windshield is seductive. Alone with these noble rocks, one’s mind turns to ritual and rite, and druids. From Merlin and Terry Brooks to World of Warcraft and the neo-druids celebrating solstice at Stonehenge, the druid mythology ignites our imagination. Thirty thousand people in the USA identify themselves as druids, yet they bear little resemblance to the barbarian philosophers, as the Greeks called them, who purportedly set living men on fire. Caesar plainly describes ritual murder and human sacrifice as druidic practice. And what link, if any, do they have with Stonehenge?\nHistory\nImagine a white-robed figure brandishing mistletoe while a great bull is prepped for sacrifice. This learned priesthood revered the elements, lived in sacred groves of oak and hazel, and presided over religious ceremonies. A dominant force in the Celtic world, druids once held rank and prestige across Western Europe. Diverse claims by historians suggest they were scientists, magicians, judges and kingmakers.\nCaesar gave a Roman slant on druidism: guardians of ancient customs and animism, practitioners of divining, and reincarnation. The vast druidic lore took upwards of twenty years to study in completion, according to Caesar.\nThe fog of time shrouds the druids in mystery. The earliest record of the name druidae dates back to second century BCE, in a work by Greek historian Sotion of Alexandria. The word druid holds dual meaning: oak, true, and solid derives from the Greek druidēs, while the Old Celtic term druídecht means magic. Nature and wisdom.\nDruids have become mythologized by both 17th century scholars and 20th century romanticists. Finding authentic druid lore—not interpretations or artifacts of uncertain origin—is like studying all religions in search of the one true faith. Most surviving texts offer subjective analysis.\nHistory erased the druid’s chapter, as not a single piece of their oral tradition has survived. Celtic fragments found in excavations and various texts offer brief glimpses of habit and ritual, but few sources support other independent accounts. The word druid (in Celtic, Greek or Latin form) is not found in any pre-Christian inscription. Therefore, any connection of druids to monuments or sculptures requires some level of conjecture. Grave archaeology, ceremonial sites, and Romano-Celtic art depicting ritual practices—such as The Wicker Image in Britannia Antiqua Illustrata—only allow for radiocarbon dating and tentative inferences. The official suppression by Roman authority two thousand years ago helped convert druidic history to an idealized mythology.\nCeremonial Practice\nPliny the Elder offers the only complete depiction of druidic ceremonial practice. During a time of fasting, brookweed and flowering Selago were gathered in meticulous fashion. Six days after the full moon, two massive bulls, muscles rippling beneath their white skin, were prepared for sacrifice. The rite started with a white-robed druid who is said to use a golden sickle (more likely gilded bronze) to cut a hearty mistletoe stem from an oak, and the sacrifice commenced.\nIn Norse mythology, mistletoe could kill a god, as Balder, the son of Odin, was slain by an arrow of mistletoe. Pliny suggests druids used this parasitic plant to cure animal infertility. Mistletoe fruit ripens around winter solstice, a time of birth and renewal, and symbolizes immortality. Modern ecology places mistletoe as a keystone species, as studies show a positive relationship between its presence and animal diversity. Perhaps the druids understood mistletoe’s ecological benefits.\nThe Gundestrup cauldron, from 1st century BCE, offers further insight into druidic customs. This gilded silver vessel was found in the Raevemosen Bog in Jutland, Denmark, and is covered in mythic narrative art, likely of Celtic origin. An army stands in full war gear surrounding a sacred tree. Deer, snake, horse, dog, and elephant are inscribed—the latter suggests Asian origin, but Celtic coins also bore images of elephants. Bull and human sacrifice are both depicted; many texts indicate druids led sacrificial ceremonies. However, the Gundestrup cauldron’s history is steeped in supposition.\nSacrificial rituals were employed to appease the gods and help combat enemies, disease or drought. “Then finally they kill the victims, praying to God to render his gift propitious to those on whom he has bestowed it.” (Pliny, Natural History XVI, 95.) Some druids, according to Caesar, vowed to immolate themselves. He goes on to describe “wicker-work images of vast size, the limbs of which they fill with living men and set on fire.”\nIt is judged that the punishment of those who participated in theft or brigandage or other crimes are more pleasing to the immortal gods; but when the supplies of this kind fail, they even go so low as to inflict punishment on the innocent. (Caesar, Gallic Wars VI, 13.)\nStrabo, a Greek historian, wrote, “they would strike a man who had been consecrated for sacrifice in the back with a sword, and make prophecies based on his death-spasms.” (Strabo, Geography IV, 4, 5.) Yet Strabo, like Caesar, simply reiterated the Posidonian texts, often without acknowledging this source. Posidonius, a Greek philosopher, is one of the few historians who likely encountered druids during his travels through Gaul (the territories of Western Europe where Celtic Gauls lived). Others, such as the 1st century Roman historian Tacitus, wrote that British druids “deemed it indeed a duty to cover their altars with the blood of captives and to consult their deities through human entrails.” (Tacitus, Annals XIV, 30-31.) Of the limited early texts, enough mention animal and human sacrifice to suggest druids engaged in such rituals.\nTruth versus Fiction\nA portrait of a white-clad druid atop the large branch of an oak, with sickle in hand, has influenced druidic perception to this day. The illustration’s origin is unknown, yet clearly inspired by Pliny the Elder’s account. A bull is portrayed with its horns bound, while pottery plates, jugs, and a basket suggest preparation for a feast. Both Welsh Druids and neo-druids (present-day druids that venerate nature) include elements of Pliny’s account—and this illustration—in their mandates. Thus one image of ambiguous origin has thrust potential misconceptions hundreds of years forward to the present.\nJulius Caesar presents the most detailed report on the druid’s role in society. Book VI of Commentarii de Bello Gallico explains their exemption from taxes and military service, status equitable to nobles, and their role as guardians of tradition and purveyors of judgement. “ . . . they hold various lectures and discussions on astronomy, on the extent and geographical distribution of the globe, [and] on the different branches of natural philosophy.” Druids follow the Pythagorean philosophy, where “the soul does not die and that after death it passes from one body into another.”\nAfter the start of the Common Era in the Gregorian calendar, a closer examination of the texts reveals a marked shift in opinion. Druids began to be perceived with loathing and contempt. Romans perpetuated their uncouth savagery, and referred to their wicked religion as barbarous and inhuman. Pliny even hints at ritual cannibalism. This shift coincides with a change in Gaulish society from a monarchy to a magistrate, and a decline in druid stature. The hostile manner in which Caesar, Strabo and others chronicled the druids was likely in response to an active rebellion against Rome. To counter this resistance, Roman historians portrayed paganism in sinister terms.\nThe druids did exist, but their traditions and beliefs cannot be confirmed. Unsubstantiated claims put William Blake as an Archdruid, as he frequently referred to them in his Prophetic Books, which included illustrations of Stonehenge and Avebury. Other literati, such as Thomas Grey and William Wordsmith, identified themselves with the ancient priesthood. But these were part of a much later revival, starting with John Aubrey’s writings in the late 1600s, and the genesis in 1781 of the Ancient Order of Druids.\nDiviciacus, a Gaul chieftain, is perhaps history’s only recorded druid. Caesar described him as a soldier and statesman, while Cicero, one of Rome’s pre-eminent philosophers and orators, labelled him not only a druid but a scholar of natural phenomena with the ability to foretell the future through divination and inference. He did this through the study of bird flight, an idea Tacitus rejected as superstition. Cicero claims to have discussed philosophy with Diviciacus. (Cicero, De Divinatione I, 90.)\nDecline of Druidism\nHow did the druids, once the elite of Gaulish society, fall into obscurity? The Romans welcomed Celtic gods into their Pantheon, but forbade pagan worship. Caesar perpetuated the druidic ritual of human sacrifice in order to gain public support for his war in Gaul. In Britain, Suetonius Paulinus led the attack on Anglesey, purportedly the last druid stronghold, as recorded by Tacitus:\n. . . a circle of Druids, lifting their hands to heaven and showering imprecations, struck the troops with such an awe at the extraordinary spectacle that, as though their limbs were paralysed, they exposed their bodies to wounds without an attempt at movement. Then, reassured by their general, and inciting each other never to flinch before . . . fanatics, they charged behind the standards, cut down all who met them, and enveloped the enemy in his own flames. (Tacitus, Annals XIV, 30-31.)\nRome prevailed. In early British literature, the word druid became obsolete. However, the druids of Scotland and Ireland were left unscathed by Roman aggression.\nThe Stonehenge Connection\nWalter Pope wrote The Salisbury Ballad in 1676:\nI will not forget these Stones that are set\nIn a round, on Salsbury Plains\nTho’ who brought ‘em there, ‘tis hard to declare,\nThe Romans, or Merlin, or Danes\nPope does not mention pagan priests. Inigo Jones, a noted 17th century English architect, discards the druidic connection to Stonehenge on the basis that classical sources contain no reference to druid or Briton possessing architectural aptitude. But then, as a whole, druid references are scarce in any tradition. Jones considered Stonehenge Roman, as detailed in his posthumously published The most notable Antiquity of Great Britain, vulgarly called Stone-heng (sic). Some credit Danes as the architects of Stonehenge, based on superficial similarities with Danish megalithic monuments.\nNeo-druids celebrate solstice within Stonehenge’s two concentric circles. The huge bluestones are believed to have come from the Preseli Hills of west Wales, over two hundred and fifty kilometers away, transported either by the Irish Sea Glacier or via a human transport mechanism not yet fathomed by modern scholars. Bluestone is a generic term; in reality, Stonehenge is comprised of at least twenty different types of rock. The word trilithon (Greek for “possessing three stones”) refers to the arrangement of two tall, vertical slabs with a third placed horizontally on top.\nStonehenge’s multi-phase construction lasted one hundred and fifty years, with four-tonne stones being erected about 2500 BCE. In the first phase, a circular ditch and bank measuring one hundred and ten meters across was built. Flint tools and deer and oxen bones have been excavated from this trench, fire and beast suggesting a druid connection. Yet the druid-Stonehenge correlation is based on speculation; several other theories present equally plausible hypotheses.\nRecent discoveries by the Stonehenge Riverside Project help explain Stonehenge’s purpose. Ancient human remains, put at 3,000 BCE by radiocarbon dating, suggest these giant sandstone blocks were erected about five hundred years after the site was first used as a burial ground. Cremations were dug from what are called the Aubrey Holes, meaning pre-Stonehenge served as a cemetery. Around two hundred and forty people were buried beneath Stonehenge over the course of five hundred years, selected for this sacred site perhaps because of special status, or membership to an elite dynasty of rulers.\nModern Stonehenge is owned by English Heritage, which was granted an exclusion zone in 1985. Cloak and staff-bearing neo-druids clash with police over usage rights in incidents such as the Battle of the Beanfield, where police in riot gear chased away travellers hoping to celebrate summer solstice near Stonehenge. Each year, the number of pagan pilgrims increases. If no claim of ownership can be substantiated, how did druids become firmly cemented with Stonehenge?\nThe medieval period sparked little interest in druids. In the latter half of the 17th century, John Aubrey drew on the works of Caesar and—along with his own systematic archaeological fieldwork in Wiltshire—assigned druidic origin to Stonehenge, the first to make this connection. He argued Stonehenge and Avebury were pre-Roman temples, and therefore druidic, the dominant priesthood at the time, an idea now embedded in English folklore.\nEvolving Mythology\nHistorians over the last few centuries have transformed druids into virtuous sages, their barbarianism and sacrificial rituals conveniently eschewed. The pendulum of druidism could not have shifted further out on both sides. First, exaggeration by historians to help justify the war in Gaul, followed thousands of years later by a denial of savage cruelty on the part of the druids.\nThe initial awe of seeing these bluestones rise from a time before Buddha or Christ sours upon closer examination of the henge. Some stones are missing, others fallen, reconstructed in the early 1900s to stand once more. But what truly spoil the mystery are the bustling tourists flashing their cameras, the self-guiding headphones strapped to their ears, and the perfunctory gift shop.\nToday, accurate accounts of the druids have all but vanished. Encounter diluted to report, and report faded into rumour. The Historia Brittonum—a medieval publication whose author remains suitably anonymous—elucidates the Stonehenge riddle best: “at what time this was done, or by what people, or for what memorial or significance, is unknown.” Despite the scarcity of facts, and the lack of a single written word attributed to their sacred order, the druid myth endures.\nFor a moment, let us put aside the pre-recorded audio, the tacky Stonehenge trinkets, and the pieced together fragments of philosophers. Go back to that first day the stones were erected, and every trilithon stood impossibly high. Under the midnight sky, step quietly around these megaliths into moon shadow. Touch the glacier-sent bluestone with a hand that helped construct this marvel of human creativity, long before machine, at a time when the abacus served as our latest technology. Let your tongue taste the shifting winds across the plains during the intersection of the seasons. Pause inside the meticulous circle of concentric stone, your feet planted on the center of this celestial map, a place that invites the spirits of mistletoe and bull. Come to understand how human and plant, earth and stone, and the gods of the sky are all interwoven. Perhaps, then, you are one step closer to understanding the extraordinary enigma that is the druid.\nSelect Bibliography\n- Caesar, Julius. Commentarii de Bello Gallico.\n- Cicero. De Divinatione.\n- Green, Miranda J. The World of the Druids, Thames and Hudson, 1997.\n- Milius, Susan. “Mistletoe, of All Things, Helps Juniper Trees.” Science News 161.1, January 2002.\n- Owen, James. “Stonehenge Was Cemetery First and Foremost, Study Says,” National Geographic News, May 29, 2008.\n- Piggott, Stuart. The Druids, Thames and Hudson, 1975.\n- Pliny the Elder. Natural History.\n- Sammes, Aylett. Britannia Antiqua Illustrata, 1676.\n- Squire, Charles. Celtic Myth and Legend, Newcastle Publishing, 1975.\n- Stonehenge Riverside Project (www.sheffield.ac.uk/archaeology/research/2.4329/index).\n- Tacitus. Annals.\nLee Beavington is an award-winning author of fiction, nonfiction and poetry. His novella, \"Evolution's End,\" appears in Writers of the Future XXII, and his book Common Plants of Greater Vancouver is a required textbook for both science and arts students. In addition to teaching ecology, cell biology and genetics in the biology lab at Kwantlen University, he also served as primary photography for three of Lone Pine's nature books, including Wild Berries of British Columbia. His Master's thesis explores the intersection of creative process, nature experience, storytelling and transformational change.", "source": "https://clarkesworldmagazine.com/beavington_12_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Druids Reconstructed by Lee Beavington"}