{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "CMY1eWWEujmU5wM5/f0jV08g+Jw=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Home for the Month  August was an unusual month in that I didn’t have any conventions, workshops, or meetings to attend. It was somewhat bittersweet in that I had very much wanted to attend the Worldcon in Finland, but couldn’t afford the trip. Everything I’ve heard from friends that did go made it sound like an amazing experience and I have to credit the con organizers for posting so much content on YouTube, even if the live stream failed during the Hugo Awards ceremony. I know they took some flack for that, but these things sometimes happen. Fortunately, there were several text chats, Twitter posts, and even a live stream on a Chinese website from someone in the audience.  In the end, I lived vicariously through the posts and videos of those on the scene, something that would have been very science fictional when I was a kid. Sean, Kate, Terra, and I even hopped into a Skype call to have our own little gathering as the Hugo Award ceremony unfurled. It was my fifth time as a nominee for Best Editor Short Form and Ann VanderMeer was on-site to accept if I won. It was also the first time I wrote an acceptance speech, not because I expected to win, but because I had someone else there in my place.  Losing a Hugo Award isn’t all that bad. Sure, it’s a bit disappointing, but to earn a spot alongside some of the editors I most admire in the field, that’s something incredible. I’d like to thank everyone that voted for me in the Hugo Awards this year. It meant a lot to me to have your support. Ultimately, Ellen Datlow took the top honors and it’s hard for me to be shocked by that. Omni was the first magazine I subscribed to—it’s coming back too!—and the shuttering of SciFiction was one of the reasons Clarkesworld was launched in the first place. Our year’s bests are published by the same publisher, so our anthologies are a sort of family.  Speaking of anthologies by the way, a bilingual science fiction anthology I co-edited was just published in China. Touchable Unreality included all the stories we published as part of the first year of our partnership with Storycom. We’re now discussing a US edition, but whether or not it will be bilingual is still up in the air. I hope to have news about this to report in a future editorial which will be more directly focused on the future of our efforts in translation.  Aside from that, much of the month has been spent working on other anthologies, with final sign-off on More Human Than Human, which was just given a starred review by Kirkus and will be published in November; reading for The Best Science Fiction of the Year Volume 3; and the heavy lifting on The Final Frontier, an anthology that won’t be published until mid-2018. There’s also a good chance that at least one of the two volumes of Clarkesworld Year Nine will be launched at Capclave in October. I’m still hoping to have both there at the same time.  Thanks to all the people that encouraged me to continue the letters to the editor format I used in last month’s editorial. It will return, depending on the frequency and volume of the emails, tweets, or in-person questions I receive. Those of you who support Clarkesworld via Patreon can also drop questions in a special Letters to the Editor channel I’ve created in our Discord chat room.  That’s about all for this month. Before I go, one last thank you to everyone who has been subscribing to Clarkesworld and/or Forever Magazine or supporting us on Patreon. None of this would happen without you! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Home for the Month\nAugust was an unusual month in that I didn’t have any conventions, workshops, or meetings to attend. It was somewhat bittersweet in that I had very much wanted to attend the Worldcon in Finland, but couldn’t afford the trip. Everything I’ve heard from friends that did go made it sound like an amazing experience and I have to credit the con organizers for posting so much content on YouTube, even if the live stream failed during the Hugo Awards ceremony. I know they took some flack for that, but these things sometimes happen. Fortunately, there were several text chats, Twitter posts, and even a live stream on a Chinese website from someone in the audience.\nIn the end, I lived vicariously through the posts and videos of those on the scene, something that would have been very science fictional when I was a kid. Sean, Kate, Terra, and I even hopped into a Skype call to have our own little gathering as the Hugo Award ceremony unfurled. It was my fifth time as a nominee for Best Editor Short Form and Ann VanderMeer was on-site to accept if I won. It was also the first time I wrote an acceptance speech, not because I expected to win, but because I had someone else there in my place.\nLosing a Hugo Award isn’t all that bad. Sure, it’s a bit disappointing, but to earn a spot alongside some of the editors I most admire in the field, that’s something incredible. I’d like to thank everyone that voted for me in the Hugo Awards this year. It meant a lot to me to have your support. Ultimately, Ellen Datlow took the top honors and it’s hard for me to be shocked by that. Omni was the first magazine I subscribed to—it’s coming back too!—and the shuttering of SciFiction was one of the reasons Clarkesworld was launched in the first place. Our year’s bests are published by the same publisher, so our anthologies are a sort of family.\nSpeaking of anthologies by the way, a bilingual science fiction anthology I co-edited was just published in China. Touchable Unreality included all the stories we published as part of the first year of our partnership with Storycom. We’re now discussing a US edition, but whether or not it will be bilingual is still up in the air. I hope to have news about this to report in a future editorial which will be more directly focused on the future of our efforts in translation.\nAside from that, much of the month has been spent working on other anthologies, with final sign-off on More Human Than Human, which was just given a starred review by Kirkus and will be published in November; reading for The Best Science Fiction of the Year Volume 3; and the heavy lifting on The Final Frontier, an anthology that won’t be published until mid-2018. There’s also a good chance that at least one of the two volumes of Clarkesworld Year Nine will be launched at Capclave in October. I’m still hoping to have both there at the same time.\nThanks to all the people that encouraged me to continue the letters to the editor format I used in last month’s editorial. It will return, depending on the frequency and volume of the emails, tweets, or in-person questions I receive. Those of you who support Clarkesworld via Patreon can also drop questions in a special Letters to the Editor channel I’ve created in our Discord chat room.\nThat’s about all for this month. Before I go, one last thank you to everyone who has been subscribing to Clarkesworld and/or Forever Magazine or supporting us on Patreon. None of this would happen without you!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_09_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Home for the Month by Neil Clarke"}