{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "oss7gsyWo2reP9Vh5ynCp1ptX8A=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  This is My Life on Ebooks  I’d like to thank everyone that has purchased a subscription to Clarkesworld on their Kindle or Kindle app. With your help, it looks like there’s a good chance that we’ll be able to hit our goal of 500 subscribers by our fifth anniversary issue in October, and if we do, you’ll see an increase in the number of stories we publish. We’re not there yet, so please keep spreading the word, posting reviews and sharing your ideas about what we could be doing better.  Speaking of your ideas, several people have mentioned that you’d love to get a subscription on your Nook or iPad. Unfortunately, our hands are tied at the moment. We’d love to accommodate you, but Barnes & Noble isn’t responding to our queries and Amazon doesn’t support subscriptions on the Kindle App for iPad at the moment. Rest assured that the moment the opportunity arises, we will jump on it. In the meantime, Weightless Books also provides a subscription option for our ebook editions (epub/mobi) and you can buy single issues direct from a number of outlets, including our website.  Before the magazine, I ran a bookstore, Clarkesworld Books, which some of you have seen me selling the remnants of at conventions. I entered that career through a love of books and a somewhat compulsive book collecting habit. A few of my friends find it ironic that I publish an online magazine, design ebooks and own a Kindle. Honestly, I don’t see it. I love the stories and the format doesn’t always matter to me. My collecting has taken a few turns, but there are still genuine paper books arriving in my house. Too many, according to my wife.  Anyhow, here are some of the things I’ve had to listen to:  You don’t own your books and they are all locked up with DRM and proprietary formats. They’ll never last.  Ah, so you’ve been listening to one of those crazy ebook apocalypse conspiracy theorists again. Lets see if I have this right . . . ebooks will destroy the print book industry, paper will vanish and then the Paper Liberation Front, using an EMP, is going to eliminate all our literature, comics and documents, just like it happened with the Atlanteans. OK. [steps back a little] None of the books I buy, design or sell have DRM on them. The ebooks I buy for my Kindle are in Kindle/Mobi format, which, with free software, can be converted to epub in minutes. Epub is a free and open format that can be read by a variety of applications and devices. In a way, it’s very much like a web page. As for DRM, weren’t you the person I told not to use iTunes before they became all “DRM is bad” and made you repurchase your music to get the DRM-free edition? Yes, I know there were ways around that, but you started it . . .  You can’t read ebooks in the bathtub.  Wait. Do you know anyone that actually reads books in the bathtub? Furthermore, why would you think I do? I’m so anal about the condition of my books that you can’t even see a line on the spines of my paperbacks after I’ve read them. Seriously, if I was going to read any book near water, it would be sealed up tight in a plastic bag, and honestly, in that case, I’d rather my Kindle because turning the pages would be easier.  You can’t get your ebooks signed.  Please observe the back of my Kindle:   Ah, but when you’re done with your Kindle, you’ll lose your signatures!  No, it will go on the shelf with the signed paper books I have. Even after the device is dead, I will still have them.  But it will die.  I suppose so, but the data will live on in other devices. That is, unless your EMP scenario toasts everything, in which case I’ll be more worried about providing food and clean water for my family.  You can’t lend me your books.  Actually, I’m more likely to lend you an ebook. I don’t trust you with my paper books. They are sacred and must be preserved from the gorilla-like way you handle them. At least with ebooks, you can do no harm. I can share files and there are some lending features I can use. What’s stopping me from lending you ebooks is that you don’t own an ereader.  AHAH! You admit that they are limiting!  Huh? Ah, I almost forgot. I’m not allowed to win one of these arguments. Each format has its advantages and disadvantages. Neither is inherently evil or substandard. Personally, I enjoy being able to carry a small personal library around with me. It doesn’t diminish the love I feel for a nice first edition hardcover of a Philip K. Dick novel. I like the potential that these devices and the medium offer. Have you tried lifting a 5th grader’s book bag? Things are only going to get more interesting as time goes on. You might want to reconsider listening to the zealots and give it a try. It is possible to live in both worlds.  I’m certain that more than one of you has had to tolerate similar attempts to enjoy your digital reading experience. Why not share them with us? It might be amusing. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nThis is My Life on Ebooks\nI’d like to thank everyone that has purchased a subscription to Clarkesworld on their Kindle or Kindle app. With your help, it looks like there’s a good chance that we’ll be able to hit our goal of 500 subscribers by our fifth anniversary issue in October, and if we do, you’ll see an increase in the number of stories we publish. We’re not there yet, so please keep spreading the word, posting reviews and sharing your ideas about what we could be doing better.\nSpeaking of your ideas, several people have mentioned that you’d love to get a subscription on your Nook or iPad. Unfortunately, our hands are tied at the moment. We’d love to accommodate you, but Barnes & Noble isn’t responding to our queries and Amazon doesn’t support subscriptions on the Kindle App for iPad at the moment. Rest assured that the moment the opportunity arises, we will jump on it. In the meantime, Weightless Books also provides a subscription option for our ebook editions (epub/mobi) and you can buy single issues direct from a number of outlets, including our website.\nBefore the magazine, I ran a bookstore, Clarkesworld Books, which some of you have seen me selling the remnants of at conventions. I entered that career through a love of books and a somewhat compulsive book collecting habit. A few of my friends find it ironic that I publish an online magazine, design ebooks and own a Kindle. Honestly, I don’t see it. I love the stories and the format doesn’t always matter to me. My collecting has taken a few turns, but there are still genuine paper books arriving in my house. Too many, according to my wife.\nAnyhow, here are some of the things I’ve had to listen to:\nYou don’t own your books and they are all locked up with DRM and proprietary formats. They’ll never last.\nAh, so you’ve been listening to one of those crazy ebook apocalypse conspiracy theorists again. Lets see if I have this right . . . ebooks will destroy the print book industry, paper will vanish and then the Paper Liberation Front, using an EMP, is going to eliminate all our literature, comics and documents, just like it happened with the Atlanteans. OK. [steps back a little]\nNone of the books I buy, design or sell have DRM on them. The ebooks I buy for my Kindle are in Kindle/Mobi format, which, with free software, can be converted to epub in minutes. Epub is a free and open format that can be read by a variety of applications and devices. In a way, it’s very much like a web page. As for DRM, weren’t you the person I told not to use iTunes before they became all “DRM is bad” and made you repurchase your music to get the DRM-free edition? Yes, I know there were ways around that, but you started it . . .\nYou can’t read ebooks in the bathtub.\nWait. Do you know anyone that actually reads books in the bathtub? Furthermore, why would you think I do? I’m so anal about the condition of my books that you can’t even see a line on the spines of my paperbacks after I’ve read them. Seriously, if I was going to read any book near water, it would be sealed up tight in a plastic bag, and honestly, in that case, I’d rather my Kindle because turning the pages would be easier.\nYou can’t get your ebooks signed.\nPlease observe the back of my Kindle:\nAh, but when you’re done with your Kindle, you’ll lose your signatures!\nNo, it will go on the shelf with the signed paper books I have. Even after the device is dead, I will still have them.\nBut it will die.\nI suppose so, but the data will live on in other devices. That is, unless your EMP scenario toasts everything, in which case I’ll be more worried about providing food and clean water for my family.\nYou can’t lend me your books.\nActually, I’m more likely to lend you an ebook. I don’t trust you with my paper books. They are sacred and must be preserved from the gorilla-like way you handle them. At least with ebooks, you can do no harm. I can share files and there are some lending features I can use. What’s stopping me from lending you ebooks is that you don’t own an ereader.\nAHAH! You admit that they are limiting!\nHuh? Ah, I almost forgot. I’m not allowed to win one of these arguments. Each format has its advantages and disadvantages. Neither is inherently evil or substandard. Personally, I enjoy being able to carry a small personal library around with me. It doesn’t diminish the love I feel for a nice first edition hardcover of a Philip K. Dick novel. I like the potential that these devices and the medium offer. Have you tried lifting a 5th grader’s book bag? Things are only going to get more interesting as time goes on. You might want to reconsider listening to the zealots and give it a try. It is possible to live in both worlds.\nI’m certain that more than one of you has had to tolerate similar attempts to enjoy your digital reading experience. Why not share them with us? It might be amusing.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_07_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: This is My Life on Ebooks by Neil Clarke"}