{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Aliette de Bodard", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "7YSEeM8xYqJIZENgcePpeON9KEI=", "id": null, "license": null, "comments": "", "raw_text": "6900 words, short story  Scattered Along the River of Heaven  2013 Finalist: Theodore Sturgeon Award  I grieve to think of the stars Our ancestors our gods Scattered like hairpin wounds Along the River of Heaven So tell me Is it fitting that I spend my days here A guest in those dark, forlorn halls? This is the first poem Xu Anshi gave to us; the first memory she shared with us for safekeeping. It is the first one that she composed in High Mheng—which had been and remains a debased language, a blend between that of the San-Tay foreigners, and that of the Mheng, Anshi’s own people.  She composed it on Shattered Pine Prison, sitting in the darkness of her cell, listening to the faint whine of the bots that crawled on the walls—melded to the metal and the crisscrossing wires, clinging to her skin—monitoring every minute movement she made—the voices of her heart, the beat of her thoughts in her brain, the sweat on her body.  Anshi had once been a passable poet in San-Tay, thoughtlessly fluent in the language of upper classes, the language of bot-handlers; but the medical facility had burnt that away from her, leaving an oddly-shaped hole in her mind, a gap that ached like a wound. When she tried to speak, no words would come out—not in San-Tay, not in High Mheng—only a raw croak, like the cry of a dying bird. Bots had once flowed to do her bidding; but now they only followed the will of the San-Tay.  There were no stars on Shattered Pine, where everything was dark with no windows; and where the faint yellow light soon leeched the prisoners’ skin of all colors. But, once a week, the prisoners would be allowed onto the deck of the prison station—heavily escorted by San-Tay guards. Bots latched onto their faces and eyes, forcing them to stare into the darkness—into the event horizon of the black hole, where all light spiraled inwards and vanished, where everything was crushed into insignificance. There were bodies outside—prisoners who had attempted to escape, put in lifesuits and jettisoned, slowly drifting into a place where time and space ceased to have any meaning. If they were lucky, they were already dead.  From time to time, there would be a jerk as the bots stung someone back into wakefulness; or low moans and cries, from those whose minds had snapped. Shattered Pine bowed and broke everyone; and the prisoners that were released back to Felicity Station came back diminished and bent, waking up every night weeping and shaking with the memory of the black hole.  Anshi—who had been a scholar, a low-level magistrate, before she’d made the mistake of speaking up against the San-Tay—sat very still, and stared at the black hole—seeing into its heart, and knowing the truth: she was of no significance, easily broken, easily crushed—but she had known that since the start. All men were as nothing to the vast universe.  It was on the deck that Anshi met Zhiying—a small, diminutive woman who always sat next to her. She couldn’t glance at Zhiying; but she felt her presence, nevertheless; the strength and hatred that emanated from her, that sustained her where other people failed.  Day after day they sat side by side, and Anshi formed poems in her mind, haltingly piecing them together in High Mheng—San-Tay was denied to her, and, like many of the Mheng upper class, she spoke no Low Mheng. Day after day, with the bots clinging to her skin like overripe fruit, and Zhiying’s presence, burning like fire at her side; and, as the verses became stronger and stronger in her mind, Anshi whispered words, out of the guards’ hearing, out of the bots’ discrimination capacities—haltingly at first, and then over and over, like a mantra on the prayer beads. Day after day; and, as the words sank deeper into her mind, Anshi slowly came to realize that the bots on her skin were not unmoving, but held themselves trembling, struggling against their inclination to move—and that the bots clinging to Zhiying were different, made of stronger materials to resist the fire of Zhiying’s anger. She heard the fast, frantic beat of their thoughts processes, which had its own rhythm, like poetry spoken in secret—and felt the hard shimmer that connected the bots to the San-Tay guards, keeping everything together.  And, in the dim light of Shattered Pine, Anshi subvocalized words in High Mheng, reaching out with her mind as she had done, back when she had been free. She hadn’t expected anything to happen; but the bots on her skin stiffened one after the other, and turned to the sound of her voice, awaiting orders.  Before she left Felicity, Xu Wen expected security at San-Tay Prime’s spaceport to be awful—they would take one glance at her travel documents, and bots would rise up from the ground and crawl up to search every inch of skin, every body cavity. Mother has warned her often enough that the San-Tay have never forgiven Felicity for waging war against them; that they will always remember the shame of losing their space colonies. She expects a personal interview with a Censor, or perhaps even to be turned back at the boundary, sent back in shame to Felicity.  But it doesn’t turn out that way at all.  Security is over in a breeze, the bots giving her nothing but a cursory body check before the guards wave her through. She has no trouble getting a cab either; things must have changed on San-Tay Prime, and the San-Tay driver waves her on without paying attention to the color of her skin.  “Here on holiday?” the driver asks her in Galactic, as she slides into the floater—her body sinking as the chair adapts itself to her morphology. Bots climb onto her hands, showing her ads for nearby hotels and restaurants: an odd, disturbing sight, for there are no bots on Felicity Station.  “You could say that,” Wen says, with a shrug she wills to be careless. “I used to live here.”  A long, long time ago, when she was still a baby; before Mother had that frightful fight with Grandmother, and left San-Tay Prime for Felicity.  “Oh?” the driver swerves, expertly, amidst the traffic; taking one wide, tree-lined avenue after another. “You don’t sound like it.”  Wen shakes her head. “I was born here, but I didn’t remain here long.”  “Gone back to the old country, eh?” The driver smiles. “Can’t say I blame you.”  “Of course,” Wen says, though she’s unsure what to tell him. That she doesn’t really know—that she never really lived here, not for more than a few years, and that she has a few confused memories of a bright-lit kitchen, and bots dancing for her on the carpet of Grandmother’s apartment? But she’s not here for such confidences. She’s here—well, she’s not sure why she’s here. Mother was adamant Wen didn’t have to come; but then, Mother has never forgiven Grandmother for the exile on San-Tay Prime.  Everything goes fine; until they reach the boundary district, where a group of large bots crawl onto the floater, and the driver’s eyes roll up as their thought-threads meld with his. At length, the bots scatter, and he turns back to Wen. “Sorry, m’am,” he says. “I have to leave you here.”  “Oh?” Wen asks, struggling to hide her fear.  “No floaters allowed into the Mheng districts currently,” the man says. “Some kind of funeral for a tribal leader—the brass is afraid there will be unrest.” He shrugs again. “Still, you’re local, right? You’ll find someone to help you.”  She’s never been here; and she doesn’t know anyone, anymore. Still, she forces a smile—always be graceful, Mother said—and puts her hand on one of the bots, feeling the warmth as it transfers money from her account on Felicity Station. After he’s left her on the paved sidewalk of a street she barely recognizes, she stands, still feeling the touch of the bots against her skin—on Felicity they call them a degradation, a way for the San-Tay government to control everything and everyone; and she just couldn’t bring herself to get a few locator-bots at the airport.  Wen looks up, at the signs—they’re in both languages, San-Tay and what she assumes is High Mheng, the language of the exiles. San-Tay is all but banned on Felicity, only found on a few derelict signs on the Outer Rings, the ones the National Restructuring Committee hasn’t gone around to retooling yet. Likewise, High Mheng isn’t taught, or encouraged. What little she can remember is that it’s always been a puzzle—the words look like Mheng; but when she tries to put everything together, their true meaning seems to slip away from her.  Feeling lost already, she wends her way deeper into the streets—those few shops that she bypasses are closed, with a white cloth spread over the door. White for grief, white for a funeral.  It all seems so—so wide, so open. Felicity doesn’t have streets lined with streets, doesn’t have such clean sidewalks—space on the station is at a ruthless premium, and every corridor is packed with stalls and shops—people eat at tables on the streets, and conduct their transactions in recessed doorways, or rooms half as large as the width of the sidewalk. She feels in another world; though, every now and then, she’ll see a word that she recognizes on a sign, and follow it, in the forlorn hope that it will lead her closer to the funeral hall.  Street after street after street—under unfamiliar trees that sway in the breeze, listening to the distant music broadcast from every doorway, from every lamp. The air is warm and clammy, a far cry from Felicity’s controlled temperature; and over her head are dark clouds. She almost hopes it rains, to see what it is like—in real life, and not in some simulation that seems like a longer, wetter version of a shower in the communal baths.  At length, as she reaches a smaller intersection, where four streets with unfamiliar signs branch off—some residential area, though all she can read are the numbers on the buildings—Wen stops, staring up at the sky. Might as well admit it: it’s useless. She’s lost, thoroughly lost in the middle of nowhere, and she’ll never be on time for the funeral.  She’d weep; but weeping is a caprice, and she’s never been capricious in her life. Instead, she turns back and attempts to retrace her steps, towards one of the largest streets—where, surely, she can hammer on a door, or find someone who will help her?  She can’t find any of the streets; but at length, she bypasses a group of old men playing Encirclement on the street—watching the shimmering holo-board as if their lives depended on it.  “Excuse me?” she asks, in Mheng.  As one, the men turn towards her—their gazes puzzled. “I’m looking for White Horse Hall,” Wen says. “For the funeral?”  The men still watch her, their faces impassive—dark with expressions she can’t read. They’re laden with smaller bots—on their eyes, on their hands and wrists, hanging black like obscene fruit: they look like the San-Tay in the reconstitution movies, except that their skins are darker, their eyes narrower.  At length, the eldest of the men steps forwards, and speaks up—his voice rerouted to his bots, coming out in halting Mheng. “You’re not from here.”  “No,” Wen says in the same language. “I’m from Felicity.”  An odd expression crosses their faces: longing, and hatred, and something else Wen cannot place. One of the men points to her, jabbers in High Mheng—Wen catches just one word she understands.  Xu Anshi.  “You’re Anshi’s daughter,” the man says. The bots’ approximation of his voice is slow, metallic, unlike the fast jabbering of High Mheng.  Wen shakes her head; and one of the other men laughs, saying something else in High Mheng.  That she’s too young, no doubt—that Mother, Anshi’s daughter, would be well into middle age by now, instead of being Wen’s age. “Daughter of daughter,” the man says, with a slight, amused smile. “Don’t worry, we’ll take you to the hall, to see your grandmother.”  He walks by her side, with the other man, the one who laughed. Neither of them speaks—too hard to attempt small talk in a language they don’t master, Wen guesses. They go down a succession of smaller and smaller streets, under banners emblazoned with the image of the phuong, Felicity’s old symbol, before the Honored Leader made the new banner, the one that showed the station blazing among the stars—something more suitable for their new status.  Everything feels . . . odd, slightly twisted out of shape—the words not quite what they ought to be, the symbols just shy of familiar; the language a frightening meld of words she can barely recognize.  Everything is wrong, Wen thinks, shivering—and yet how can it be wrong, walking among Grandmother’s own people?  Summoning bots I washed away Ten thousand thousand years of poison Awakening a thousand flower-flames, a thousand phoenix birds Floating on a sea of blood like cresting waves The weeping of the massacred millions rising from the darkness We received this poem and its memories for safekeeping at a time when Xu Anshi was still on Felicity Station: on an evening before the Feast of Hungry Ghosts, when she sat in a room lit by trembling lights, thinking of Lao, her husband who had died in the uprisings—and wondering how much of it had been of any worth.  It refers to a time when Anshi was older, wiser—she and Zhiying had escaped from Shattered Pine, and spent three years moving from hiding place to hiding place, composing the pamphlets that, broadcast into every household, heralded the end of the San-Tay governance over Felicity.  On the night that would become known as the Second Ring Riots, Anshi stood in one of the inner rings of Felicity Station, her bots spread around her, hacked into the network—half of them on her legs, pumping modifiers into her blood; half of them linked to the other Mheng bot-handlers, retransmitting scenes of carnage, of the Mheng mob running wild in the San-Tay districts of the inner rings, the High Tribunal and Spaceport Authority lasered, and the fashionable districts trashed.  “This one,” Zhiying said, pointing to a taller door, adorned with what appeared to be a Mheng traditional blessing—until one realized that the characters had been chosen for aesthetic reasons only, and that they meant nothing.  Anshi sent a subvocalized command to her bots, asking them to take the house. The feed to the rioting districts cut off abruptly, as her bots turned their attention towards the door and the house beyond: their sensors analyzing the bots on the walls, the pattern of the aerations, the cables running behind the door, and submitting hypotheses about possible architectures of the security system—before the swarm reached a consensus, and made a decision.  The bots flowed towards the door—the house’s bots sought to stop them, but Anshi’s bots split into two squads, and rushed past, heading for the head—the central control panel, which housed the bots’ communication system. Anshi had a brief glimpse of red-painted walls, and blinking holos; before her bots rushed back, job completed, and fell on the now disorganized bots at the door.  Everything went dark, the Mheng characters slowly fading away from the door’s panels.  “All yours,” Anshi said to Zhiying, struggling to remain standing—all her bots were jabbering in her mind, putting forward suggestions as to what to do next; and, in her state of extreme fatigue, ignoring them was harder. She’d seen enough handlers burnt beyond recovery, their brains overloaded with external stimuli until they collapsed—she should have known better. But they needed her—the most gifted bot-handler they had, their strategist—needed her while the San-Tay were still reeling from their latest interplanetary war, while they were still weak. She’d rest later—after the San-Tay were gone, after the Mheng were free. There would be time, then, plenty of it.  Bao and Nhu were hitting the door with soldering knives—each blow weakening the metal until the door finally gave way with a groan. The crowd behind Anshi roared; and rushed through—pushing Anshi ahead of them, the world shrinking to a swirling, confused mass of details—gouged-out consoles, ornaments ripped from shelves, pale men thrown down and beaten against the rush of the crowd, a whirlwind of chaos, as if demons had risen up from the underworld.  The crowd spread as they moved inwards; and Anshi found herself at the center of a widening circle in what had once been a guest room. Beside her, Bao was hacking at a nondescript bed, while others in the crowd beat down on the huge screen showing a sunset with odd, distorted trees—some San-Tay planet that Anshi did not recognize, maybe even Prime. Anshi breathed, hard, struggling to steady herself in the midst of the devastation. Particles of down and dust drifted past her; she saw a bot on the further end, desperately trying to contain the devastation, scuttling to repair the gashes in the screen. Nhu downed it with a well-placed kick; her face distorted in a wide, disturbing grin.  “Look at that!” Bao held up a mirror-necklace, which shimmered and shifted, displaying a myriad configurations for its owner’s pleasure.  Nhu’s laughter was harsh. “They won’t need it anymore.” She held out a hand; but Bao threw the necklace to the ground; and ran it through with his knife.  Anshi did not move—as if in a trance she saw all of it: the screen, the bed, the pillows that sought to mould themselves to a pleasing shape, even as hands tore them apart; the jewellery scattered on the ground; and the image of the forest, fading away to be replaced by a dull, split-open wall—every single mark of San-Tay privilege, torn away and broken, never to come back. Her bots were relaying similar images from all over the station. The San-Tay would retaliate, but they would have understood, now, how fragile the foundation of their power was. How easily the downtrodden Mheng could become their downfall; and how much it would cost them to hold Felicity.  Good.  Anshi wandered through the house, seeking out the San-Tay bots—those she could hack and reprogram, she added to her swarm; the others she destroyed, as ruthlessly as the guards had culled the prisoners on Shattered Pine.  Anshi. Anshi.  Something was blinking, insistently, in the corner of her eyes—the swarm, bringing something to her attention. The kitchens—Zhiying, overseeing the executions. Bits and pieces, distorted through the bots’ feed: the San-Tay governor, begging and pleading to be spared; his wife, dying silently, watching them all with hatred in her eyes. They’d had no children; for which Anshi was glad. She wasn’t Zhiying, and she wasn’t sure she’d have borne the guilt.  Guilt? There were children dying all over the station; men and women killed, if not by her, by those who followed her. She spared a bitter laugh. There was no choice. Children could die; or be raised to despise the inferior breed of the Mheng; be raised to take slaves and servants, and send dissenters like Anshi to be broken on Shattered Pine with a negligent wave of their hands. No choice.  Come, the bots whispered in her mind, but she did not know why.  Zhiying was down to the Grand Master of Security when Anshi walked into the kitchens—she barely nodded at Anshi, and turned her attention back to the man aligned in the weapons’ sights.  She did not ask for any last words; though she did him the honor of using a bio-silencer on him, rather than the rifles they’d used on the family—his body crumpled inwards and fell, still intact; and he entered the world of the ancestors with the honor of a whole body. “He fought well,” Zhiying said, curtly. “What of the house?”  “Not a soul left living,” Anshi said, flicking through the bots’ channels. “Not much left whole, either.”  “Good,” Zhiying said. She gestured; and the men dragged the next victim—a Mheng girl, dressed in the clothes of an indentured servant.  This—this was what the bots had wanted her to see. Anshi looked to the prisoners huddled against the wall: there was one San-Tay left, an elderly man who gazed back at her, steadily and without fear. The rest—all the rest—were Mheng, dressed in San-Tay clothes, their skin pale and washed-out in the flickering lights—stained with what looked like rice flour from one of the burst bags on the floor. Mheng. Their own people.  “Elder sister,” Anshi said, horrified.  Zhiying’s face was dark with anger. “You delude yourself. They’re not Mheng anymore.”  “Because they were indentured into servitude? Is that your idea of justice? They had no choice,” Anshi said. The girl against the wall said nothing; her gaze slid away from Zhiying, to the rifle; finally resting on the body of her dead mistress.  “They had a choice. We had a choice,” Zhiying said. Her gaze—dark and intense—rested, for a moment, on the girl. “If we spare them, they’ll just run to the militia, and denounce us to find themselves a better household. Won’t you?” she asked.  Anshi, startled, realized Zhiying had addressed the girl—whose gaze still would not meet theirs, as if they’d been foreigners themselves.  At length, the girl threw her head back, and spoke in High Mheng. “They were always kind with me, and you butchered them like pigs.” She was shivering now. “What will you achieve? You can’t hide on Felicity. The San-Tay will come here and kill you all, and when they’re done, they’ll put us in the dark forever. It won’t be cushy jobs like this—they’ll consign us to the scavenge heaps, to the ducts-cleaning and the bots-scraping, and we won’t ever see starlight again.”  “See?” Zhiying said. “Pathetic.” She gestured, and the girl crumpled like the man before her. The soldiers dragged the body away, and brought the old San-Tay man. Zhiying paused; and turned back to Anshi. “You’re angry.”  “Yes,” Anshi said. “I did not join this so we could kill our own countrymen.”  Zhiying’s mouth twisted in a bitter smile. “Collaborators,” she said. “How do you think a regime like the San-Tay continues to exist? It’s because they take some of their servants, and set them above others. Because they make us complicit in our own oppression. That’s the worst of what they do, little sister—turn us against each other.”  No. The thought was crystal-clear in Anshi’s mind, like a blade held against starlight. That’s not the worst. The worst is that, to fight them, we have to best them at their own game.  She watched the old man as he died; and saw nothing in his eyes but the reflection of that bitter knowledge.  White Horse Hall is huge, so huge that it’s a wonder Wen didn’t see it from afar—more than a hundred stories, and more unveil as her floater lifts higher and higher, away from the crowd massed on the ground. Above the cloud cover, other white-clad floaters weave in and out of the traffic, as if to the steps of a dance only they can see.  She’s alone: her escort left her at the floater station—the older man with a broad smile and a wave, and the second man with a scowl, looking away from her. As they ascend higher and higher, and the air thins out—to almost the temperature of Felicity—Wen tries to relax, but cannot do so. She’s late; and she knows it—and they probably won’t admit her into the hall at all. She’s a stranger here; and Mother is right: she would be better off in Felicity with Zhengyao, enjoying her period of rest by flying kites, or going for a ride on Felicity’s River of Good Fortune.  At the landing pad, a woman is waiting for her: small and plump, with hair shining silver in the unfiltered sunlight. Her face is frozen in careful blankness, and she wears the white of mourners, with none of the markers for the family of the dead.  “Welcome,” she says, curtly nodding to acknowledge Wen’s presence. “I am Ho Van Nhu.”  “Grandmother’s friend,” Wen says.  Nhu’s face twists in an odd expression. “You know my name?” She speaks perfect Galactic, with a very slight trace of an accent—heard only in the odd inflections she puts on her own name.  Wen could lie; could say that Mother spoke of her often; but here, in this thin, cold air, she finds that she cannot lie—any more than one does not lie in the presence of the Honoured Leader. “They teach us about you in school,” she says, blushing.  Nhu snorts. “Not in good terms, I’d imagine. Come,” she says. “Let’s get you prepared.”  There are people everywhere, in costumes Wen recognizes from her history lessons—oddly old-fashioned and formal, collars flaring in the San-Tay fashion, though the five panels of the dresses are those of the Mheng high court, in the days before the San-Tay’s arrival.  Nhu pushes her way through the crowd, confident, until they reach a deserted room. She stands for a while in the center, eyes closed, and bots crawl out of the interstices, dragging vegetables and balls of rolled-up dough—black and featureless, their bodies gleaming like knife-blades, their legs moving on a rhythm like centipedes or spiders.  Wen watches, halfway between fascination and horror, as they cut up the vegetables into small pieces—flatten the dough and fill up dumplings, and put them inside small steamer units that other bots have dragged up. Other bots are already cleaning up the counter, and there is a smell in the room—tea brewing in a corner. “I don’t—” Wen starts. How can she eat any of that, knowing how it was prepared? She swallows, and forces herself to speak more civilly. “I should be with her.”  Nhu shakes her head. Beads of sweat pearl on her face; but she seems to be gaining color as the bots withdraw, one by one—except that Wen can still see them, tucked away under the cupboards and the sink, like curled-up cockroaches. “This is the wake, and you’re already late for it. It won’t make any difference if you come in quarter of an hour later. And I would be a poor host if I didn’t offer you any food.”  There are two cups of tea on the central table; Nhu pours from a teapot, and pushes one to Wen—who hesitates for a moment, and then takes it, fighting against a wave of nausea. Bots dragged out the pot; the tea leaves. Bots touched the liquid that she’s inhaling right now.  “You look like your mother when she was younger,” Nhu says, sipping at the tea. “Like your grandmother, too.” Her voice is matter-of-fact; but Wen can feel the grief Nhu is struggling to contain. “You must have had a hard time, at school.”  Wen thinks on it for a while. “I don’t think so,” she says. She’s had the usual bullying, the mockeries of her clumsiness, of her provincial accent. But nothing specifically directed at her ancestors. “They did not really care about who my grandmother was.” It’s the stuff of histories now; almost vanished—only the generation of the Honored Leader remembers what it was like, under the San-Tay.  “I see,” Nhu says.  An uncomfortable silence stretches, which Nhu makes no effort to break.  Small bots float by, carrying a tray with the steamed dumplings—like the old vids, when the San-Tay would be receiving their friends at home. Except, of course, that the Mheng were doing the cutting-up and the cooking, in the depths of the kitchen.  “They make you uncomfortable,” Nhu says.  Wen grimaces. “I—we don’t have bots, on Felicity.”  “I know. The remnants of the San-Tay—the technologies of servitude, which should better be forgotten and lost.” Her voice is light, ironic; and Wen realizes that she is quoting from one of the Honored Leader’s speeches. “Just like High Mheng. Tell me, Wen, what do the histories say of Xu Anshi?”  Nothing, Wen wants to say; but as before, she cannot bring herself to lie. “That she used the technologies of the San-Tay against them; but that, in the end, she fell prey to the lure of their power.” It’s what she’s been told all her life; the only things that have filled the silence Mother maintains about Grandmother. But, now, staring at this small, diminutive woman, she feels almost ashamed. “That she and her followers were given a choice between exile, and death.”  “And you believe that?”  “I don’t know,” Wen says. And, more carefully, “Does it matter?”  Nhu shrugs, shaking her head. “Mingxia—your mother once asked Anshi if she believed in reconciliation with Felicity. Anshi told her that reconciliation was nothing more than another word for forgetfulness. She was a hard woman. But then, she’d lost so much in the war. We all did.”  “I’m not Mother,” Wen says, and Nhu shakes her head, with a brief smile.  “No. You’re here.”  Out of duty, Wen thinks. Because someone has to come, and Mother won’t. Because someone should remember Grandmother, even if it’s Wen—who didn’t know her, didn’t know the war. She wonders what the Honored Leader will say about Grandmother’s death, on Felicity—if she’ll mourn the passing of a liberator, or remind them all to be firm, to reject the evil of the San-Tay, more than sixty years after the foreigners’ withdrawal from Felicity.  She wonders how much of the past is worth clinging to.  See how the gilded Heavens are covered With the burning bitter tears of our departed Cast away into darkness, they contradict no truths Made mute and absent, they denounce no lies Anshi gave this poem into our keeping on the night after her daughter left her. She was crying then, trying not to show it—muttering about ungrateful children, and their inability to comprehend any of what their ancestors had gone through. Her hand shook, badly; and she stared into her cup of tea, as hard as she had once stared into the black hole and its currents, dragging everything into the lightless depths. But then, as on Shattered Pine, the only thing that came to her was merciless clarity, like the glint of a blade or a claw.  It is an old, old composition, its opening lines the last Anshi wrote on Felicity Station. Just as the first poem defined her youth—the escaped prisoner, the revolution’s foremost bot-handler—this defined her closing decades, in more ways than one.  The docks were deserted; not because it was early in the station’s cycle, not because the war had diminished interstellar travel; but because the docks had been cordoned off by Mheng loyalists. They gazed at Anshi, steadily—their eyes blank; though the mob behind them brandished placards and howled for her blood.  “It’s not fair,” Nhu said. She was carrying Anshi’s personal belongings—Anshi’s bots, and those of all her followers, were already packed in the hold of the ship. Anshi held her daughter Mingxia by the hand: the child’s eyes were wide, but she didn’t speak. Anshi knew she would have questions, later—but all that mattered, here and now, was surviving this. “You’re a heroine of the uprising. You shouldn’t have to leave like a branded criminal.”  Anshi said nothing. She scanned the crowd, wondering if Zhiying would be there, at the last—if she’d smile and wish her well, or make one last stab of the knife. “She’s right, in a way,” she said, wearily. The crowd’s hatred was palpable, even where she stood. “The bots are a remnant of the San-Tay, just like High Mheng. It’s best for everyone if we forget it all.” Best for everyone but them.  “You don’t believe that,” Nhu said.  “No.” Not any of that; but she knew what was in Zhiying’s heart, the hatred of the San-Tay that she carried with her—that, to her little sister, she would be nothing more than a collaborator herself—tainted by her use of the enemy’s technology.  “She just wants you gone. Because you’re her rival.”  “She doesn’t think like that,” Anshi said, more sharply than she’d intended; and she knew, too, that she didn’t believe that. Zhiying had a vision of the Mheng as strong and powerful; and she’d allow nothing and no one to stand in its way.  They were past the cordon now, and the maw of the ship gaped before them—the promise of a life somewhere else, on another planet. Ironic, in a way—the ship was from the San-Tay High Government, seeking amends for their behavior on colonized stations. If someone had ever told her she’d ride one of those as a guest . . .  Nhu, without hesitation, was heading up towards the dark tunnel. “You don’t have to come,” Anshi said.  Nhu rolled her eyes upwards, and made no comment. Like Anshi, she was old guard; a former teacher in the Mheng schools, fluent in High Mheng, and with a limited ability to control the bots. A danger, like Anshi.  There was a noise behind them—the beginning of a commotion. Anshi turned; and saw that, contrary to what she’d thought, Zhiying had come.  She wore the sash of Honored Leader well; and the stars of Felicity’s new flag were spread across her dress—which was a shorter, less elaborate version of the five-panel ceremonial garb. Her hair had been pulled up in an elegant bun, thrust through with a golden phoenix pin, the first jewel to come out of the station’s new workshops—she was unrecognizable from the gaunt, tall prisoner Anshi remembered, or even from the dark, intense leader of the rebellion years.  “Elder sister.” She bowed to Anshi, but did not come closer; remaining next to her escort of black-clad soldiers. “We wish you happiness, and good fortune among the stars.”  “We humbly thank you, Your Reverence,” Anshi said—keeping the irony, and the hurt from her voice. Zhiying’s eyes were dark, with the same anger Anshi remembered from the night of the Second Ring riots—the night when the girl had died. They stood, staring at each other, and at length Zhiying gestured for Anshi to move.  Anshi backed away, slowly, pulling her daughter by the hand. She wasn’t sure why she felt . . . drained, as if a hundred bots had been pumping modifiers into her blood, and had suddenly stopped. She wasn’t sure what she’d expected—an apology? Zhiying had never been one for it; or for doubts of any kind. But still—  Still, they’d been on Shattered Pine together; had escaped together; had preached and written the poetry of the revolution, and dared each other to hack into Felicity’s network to spread it into every household, every corridor screen.  There should have been something more than a formal send-off; something more than the eyes boring into hers—dark and intense, and with no hint of sorrow or tears.  We do not weep for the enemy, Anshi thought; as she turned, and passed under the wide metal arc that led into the ship, her daughter’s hand heavy in hers.  In the small antechamber, Wen dons robes of dark blue—those reserved for the mourners who are the closest family to the dead. She can hear, in the distance, the drone of prayers from the priests, and the scuttling of bots on the walls, carrying faint music until the entire structure of the hall seems to echo with it. Slowly, carefully, she rises, and stares at her pale, wan self in the mirror—with coiled bots at its angles, awaiting just an order to awaken and bring her anything she might desire. Abominations, she thinks, uneasily, but it’s hard to see them as something other than alien, incomprehensible.  Nhu is waiting for her at the great doors—the crowd has parted, letting her through with an almost religious hush. In silence, Wen kneels, her head bent down—an honor to the dead, an acknowledgement that she is late and that she must make amends, for leaving Grandmother’s ghost alone.  She hears a noise as the doors open—catches a flash of a crowd dressed in blue; and then she is crawling towards the coffin, staring at the ground ahead of her. By her side, there are glimpses of dresses’ hems, of shoes that are an uneasy meld of San-Tay and Mheng. Ahead, a steady drone from the monks at the pulpit, taken up by the crowd; a prayer in High Mheng, incomprehensible words segueing into a melodious chant; and a smell of incense mingled with something else, a flower she cannot recognize. The floor under her is warm, soft—unlike Felicity’s utilitarian metal or carpets, a wealth of painted ostentation with patterns she cannot make out.  As she crawls, Wen finds herself, incongruously, thinking of Mother.  She asked, once, why Mother had left San-Tay Prime—expecting Mother to rail once more at Grandmother’s failures. But Mother merely pulled a low bench, and sat down with a sigh. “There was no choice, child. We could dwindle away on San-Tay Prime, drifting further and further away from Felicity with every passing moment. Or we could come back home.”  “It’s not Grandmother’s home,” Wen said, slowly, confusedly—with a feeling that she was grappling with something beyond her years.  “No,” Mother said. “And, if we had waited too long, it wouldn’t have been your home either.”  “I don’t understand.” Wen put a hand on one of the kitchen cupboards—the door slid away, letting her retrieve a can of dried, powdered shrimp, which she dumped into the broth on the stove.  “Like two men carried away by two different currents in the river—both ending in very different places.” She waved a dismissive hand. “You’ll understand, when you’re older.”  “Is that why you’re not talking with Grandmother?”  Mother grimaced, staring into the depths of her celadon cup. “Grandmother and I . . . did not agree on things,” she said. “Sometimes I think . . . ” She shook her head. “Stubborn old woman. She never could admit that she had lost. That the future of Felicity wasn’t with bots, with High Mheng; with any of what the San-Tay had left us.”  Bots. High Mheng—all of the things that don’t exist anymore, on the new Felicity—all the things the Honored Leader banished, for the safety and glory of the people. “Mother . . . ” Wen said, suddenly afraid.  Her mother smiled; and for the first time Wen saw the bitterness in her eyes. “Never mind, child. This isn’t your burden to carry.”  Wen did not understand. But now . . . now, as she crawls down the aisle, breathing in the unfamiliar smells, she thinks she understands. Reconciliation means forgetfulness, and is it such a bad thing that they forget, that they are no longer chained to the hatreds of the past?  She reaches the coffin, and rises—turns, for a brief moment, to stare at the sea of humanity before her—the blurred faces with bots at the corner of their eyes, with alien scents and alien clothes. They are not from Felicity anymore, but something else—poised halfway between the San-Tay and the culture that gave them birth; and, as the years pass, those that do not come back will drift further and further from Felicity, until they will pass each other in the street, and not feel anything but a vague sense of familiarity, like long-lost families that have become strangers to each other.  No, not from Felicity anymore—and does it matter, any of it?  Wen has no answer—none of Mother’s bleak certainties about life. And so she turns away from the crowd, and looks into the coffin—into the face of a stranger, across a gap like a flowing river, dark and forever unbridgeable.  I am in halves, dreaming of a faraway home Not a dry spot on my moonlit pillow Through the open window lies the stars and planets Where ten thousand family members have scattered Along the River of Heaven, with no bridges to lead them home The long yearning Cuts into my heart This is the last poem we received from Xu Anshi; the last one she composed, before the sickness ate away at her command of High Mheng, and we could no longer understand her subvocalized orders. She said to us then, “it is done”; and turned away from us, awaiting death.  We are here now, as Wen looks at the pale face of her grandmother. We are not among our brethren in the crowd—not clinging to faces, not curled on the walls or at the corner of mirrors, awaiting orders to unfold.  We have another place.  We rest on the coffin with Xu Anshi’s other belongings; scattered among the paper offerings—the arch leading into the Heavens, the bills stamped with the face of the King of Hell. We sit quiescent, waiting for Xu Wen to call us up—that we might flow up to her like a black tide, carrying her inheritance to her, and the memories that made up Xu Anshi’s life from beginning to end.  But Wen’s gaze slides right past us, seeing us as nothing more than a necessary evil at the ceremony; and the language she might summon us in is one she does not speak and has no interest in.  In silence, she walks away from the coffin to take her place among the mourners—and we, too, remain silent, taking our understanding of Xu Anshi’s life into the yawning darkness.  \"With apologies to Qiu Jin, Bei Dao and the classical  Tang poets for borrowing and twisting their best lines\" Aliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award and four British Science Fiction Association Awards, and is a double Hugo finalist for 2019 (Best Series and Best Novella). Most recently she published In the Vanishers' Palace, a dark retelling of Beauty and the Beast where they are both women and where the Beast is a Vietnamese dragon (2018 Lammy Award finalist for LGBTQ SF/F/Horror). Recent works include the Dominion of the Fallen series, set in a turn-of-the-century Paris devastated by a magical war, which comprises The House of Shattered Wings, The House of Binding Thorns, and forthcoming The House of Sundering Flames (July 2019, Gollancz). Her short story collection Of Wars, and Memories, and Starlight is forthcoming from Subterranean Press (Sept 2019).", "text": "6900 words, short story\nScattered Along the River of Heaven\n2013 Finalist: Theodore Sturgeon Award\nI grieve to think of the stars\nOur ancestors our gods\nScattered like hairpin wounds\nAlong the River of Heaven\nSo tell me\nIs it fitting that I spend my days here\nA guest in those dark, forlorn halls?\nThis is the first poem Xu Anshi gave to us; the first memory she shared with us for safekeeping. It is the first one that she composed in High Mheng—which had been and remains a debased language, a blend between that of the San-Tay foreigners, and that of the Mheng, Anshi’s own people.\nShe composed it on Shattered Pine Prison, sitting in the darkness of her cell, listening to the faint whine of the bots that crawled on the walls—melded to the metal and the crisscrossing wires, clinging to her skin—monitoring every minute movement she made—the voices of her heart, the beat of her thoughts in her brain, the sweat on her body.\nAnshi had once been a passable poet in San-Tay, thoughtlessly fluent in the language of upper classes, the language of bot-handlers; but the medical facility had burnt that away from her, leaving an oddly-shaped hole in her mind, a gap that ached like a wound. When she tried to speak, no words would come out—not in San-Tay, not in High Mheng—only a raw croak, like the cry of a dying bird. Bots had once flowed to do her bidding; but now they only followed the will of the San-Tay.\nThere were no stars on Shattered Pine, where everything was dark with no windows; and where the faint yellow light soon leeched the prisoners’ skin of all colors. But, once a week, the prisoners would be allowed onto the deck of the prison station—heavily escorted by San-Tay guards. Bots latched onto their faces and eyes, forcing them to stare into the darkness—into the event horizon of the black hole, where all light spiraled inwards and vanished, where everything was crushed into insignificance. There were bodies outside—prisoners who had attempted to escape, put in lifesuits and jettisoned, slowly drifting into a place where time and space ceased to have any meaning. If they were lucky, they were already dead.\nFrom time to time, there would be a jerk as the bots stung someone back into wakefulness; or low moans and cries, from those whose minds had snapped. Shattered Pine bowed and broke everyone; and the prisoners that were released back to Felicity Station came back diminished and bent, waking up every night weeping and shaking with the memory of the black hole.\nAnshi—who had been a scholar, a low-level magistrate, before she’d made the mistake of speaking up against the San-Tay—sat very still, and stared at the black hole—seeing into its heart, and knowing the truth: she was of no significance, easily broken, easily crushed—but she had known that since the start. All men were as nothing to the vast universe.\nIt was on the deck that Anshi met Zhiying—a small, diminutive woman who always sat next to her. She couldn’t glance at Zhiying; but she felt her presence, nevertheless; the strength and hatred that emanated from her, that sustained her where other people failed.\nDay after day they sat side by side, and Anshi formed poems in her mind, haltingly piecing them together in High Mheng—San-Tay was denied to her, and, like many of the Mheng upper class, she spoke no Low Mheng. Day after day, with the bots clinging to her skin like overripe fruit, and Zhiying’s presence, burning like fire at her side; and, as the verses became stronger and stronger in her mind, Anshi whispered words, out of the guards’ hearing, out of the bots’ discrimination capacities—haltingly at first, and then over and over, like a mantra on the prayer beads. Day after day; and, as the words sank deeper into her mind, Anshi slowly came to realize that the bots on her skin were not unmoving, but held themselves trembling, struggling against their inclination to move—and that the bots clinging to Zhiying were different, made of stronger materials to resist the fire of Zhiying’s anger. She heard the fast, frantic beat of their thoughts processes, which had its own rhythm, like poetry spoken in secret—and felt the hard shimmer that connected the bots to the San-Tay guards, keeping everything together.\nAnd, in the dim light of Shattered Pine, Anshi subvocalized words in High Mheng, reaching out with her mind as she had done, back when she had been free. She hadn’t expected anything to happen; but the bots on her skin stiffened one after the other, and turned to the sound of her voice, awaiting orders.\nBefore she left Felicity, Xu Wen expected security at San-Tay Prime’s spaceport to be awful—they would take one glance at her travel documents, and bots would rise up from the ground and crawl up to search every inch of skin, every body cavity. Mother has warned her often enough that the San-Tay have never forgiven Felicity for waging war against them; that they will always remember the shame of losing their space colonies. She expects a personal interview with a Censor, or perhaps even to be turned back at the boundary, sent back in shame to Felicity.\nBut it doesn’t turn out that way at all.\nSecurity is over in a breeze, the bots giving her nothing but a cursory body check before the guards wave her through. She has no trouble getting a cab either; things must have changed on San-Tay Prime, and the San-Tay driver waves her on without paying attention to the color of her skin.\n“Here on holiday?” the driver asks her in Galactic, as she slides into the floater—her body sinking as the chair adapts itself to her morphology. Bots climb onto her hands, showing her ads for nearby hotels and restaurants: an odd, disturbing sight, for there are no bots on Felicity Station.\n“You could say that,” Wen says, with a shrug she wills to be careless. “I used to live here.”\nA long, long time ago, when she was still a baby; before Mother had that frightful fight with Grandmother, and left San-Tay Prime for Felicity.\n“Oh?” the driver swerves, expertly, amidst the traffic; taking one wide, tree-lined avenue after another. “You don’t sound like it.”\nWen shakes her head. “I was born here, but I didn’t remain here long.”\n“Gone back to the old country, eh?” The driver smiles. “Can’t say I blame you.”\n“Of course,” Wen says, though she’s unsure what to tell him. That she doesn’t really know—that she never really lived here, not for more than a few years, and that she has a few confused memories of a bright-lit kitchen, and bots dancing for her on the carpet of Grandmother’s apartment? But she’s not here for such confidences. She’s here—well, she’s not sure why she’s here. Mother was adamant Wen didn’t have to come; but then, Mother has never forgiven Grandmother for the exile on San-Tay Prime.\nEverything goes fine; until they reach the boundary district, where a group of large bots crawl onto the floater, and the driver’s eyes roll up as their thought-threads meld with his. At length, the bots scatter, and he turns back to Wen. “Sorry, m’am,” he says. “I have to leave you here.”\n“Oh?” Wen asks, struggling to hide her fear.\n“No floaters allowed into the Mheng districts currently,” the man says. “Some kind of funeral for a tribal leader—the brass is afraid there will be unrest.” He shrugs again. “Still, you’re local, right? You’ll find someone to help you.”\nShe’s never been here; and she doesn’t know anyone, anymore. Still, she forces a smile—always be graceful, Mother said—and puts her hand on one of the bots, feeling the warmth as it transfers money from her account on Felicity Station. After he’s left her on the paved sidewalk of a street she barely recognizes, she stands, still feeling the touch of the bots against her skin—on Felicity they call them a degradation, a way for the San-Tay government to control everything and everyone; and she just couldn’t bring herself to get a few locator-bots at the airport.\nWen looks up, at the signs—they’re in both languages, San-Tay and what she assumes is High Mheng, the language of the exiles. San-Tay is all but banned on Felicity, only found on a few derelict signs on the Outer Rings, the ones the National Restructuring Committee hasn’t gone around to retooling yet. Likewise, High Mheng isn’t taught, or encouraged. What little she can remember is that it’s always been a puzzle—the words look like Mheng; but when she tries to put everything together, their true meaning seems to slip away from her.\nFeeling lost already, she wends her way deeper into the streets—those few shops that she bypasses are closed, with a white cloth spread over the door. White for grief, white for a funeral.\nIt all seems so—so wide, so open. Felicity doesn’t have streets lined with streets, doesn’t have such clean sidewalks—space on the station is at a ruthless premium, and every corridor is packed with stalls and shops—people eat at tables on the streets, and conduct their transactions in recessed doorways, or rooms half as large as the width of the sidewalk. She feels in another world; though, every now and then, she’ll see a word that she recognizes on a sign, and follow it, in the forlorn hope that it will lead her closer to the funeral hall.\nStreet after street after street—under unfamiliar trees that sway in the breeze, listening to the distant music broadcast from every doorway, from every lamp. The air is warm and clammy, a far cry from Felicity’s controlled temperature; and over her head are dark clouds. She almost hopes it rains, to see what it is like—in real life, and not in some simulation that seems like a longer, wetter version of a shower in the communal baths.\nAt length, as she reaches a smaller intersection, where four streets with unfamiliar signs branch off—some residential area, though all she can read are the numbers on the buildings—Wen stops, staring up at the sky. Might as well admit it: it’s useless. She’s lost, thoroughly lost in the middle of nowhere, and she’ll never be on time for the funeral.\nShe’d weep; but weeping is a caprice, and she’s never been capricious in her life. Instead, she turns back and attempts to retrace her steps, towards one of the largest streets—where, surely, she can hammer on a door, or find someone who will help her?\nShe can’t find any of the streets; but at length, she bypasses a group of old men playing Encirclement on the street—watching the shimmering holo-board as if their lives depended on it.\n“Excuse me?” she asks, in Mheng.\nAs one, the men turn towards her—their gazes puzzled. “I’m looking for White Horse Hall,” Wen says. “For the funeral?”\nThe men still watch her, their faces impassive—dark with expressions she can’t read. They’re laden with smaller bots—on their eyes, on their hands and wrists, hanging black like obscene fruit: they look like the San-Tay in the reconstitution movies, except that their skins are darker, their eyes narrower.\nAt length, the eldest of the men steps forwards, and speaks up—his voice rerouted to his bots, coming out in halting Mheng. “You’re not from here.”\n“No,” Wen says in the same language. “I’m from Felicity.”\nAn odd expression crosses their faces: longing, and hatred, and something else Wen cannot place. One of the men points to her, jabbers in High Mheng—Wen catches just one word she understands.\nXu Anshi.\n“You’re Anshi’s daughter,” the man says. The bots’ approximation of his voice is slow, metallic, unlike the fast jabbering of High Mheng.\nWen shakes her head; and one of the other men laughs, saying something else in High Mheng.\nThat she’s too young, no doubt—that Mother, Anshi’s daughter, would be well into middle age by now, instead of being Wen’s age. “Daughter of daughter,” the man says, with a slight, amused smile. “Don’t worry, we’ll take you to the hall, to see your grandmother.”\nHe walks by her side, with the other man, the one who laughed. Neither of them speaks—too hard to attempt small talk in a language they don’t master, Wen guesses. They go down a succession of smaller and smaller streets, under banners emblazoned with the image of the phuong, Felicity’s old symbol, before the Honored Leader made the new banner, the one that showed the station blazing among the stars—something more suitable for their new status.\nEverything feels . . . odd, slightly twisted out of shape—the words not quite what they ought to be, the symbols just shy of familiar; the language a frightening meld of words she can barely recognize.\nEverything is wrong, Wen thinks, shivering—and yet how can it be wrong, walking among Grandmother’s own people?\nSummoning bots I washed away\nTen thousand thousand years of poison\nAwakening a thousand flower-flames, a thousand phoenix birds\nFloating on a sea of blood like cresting waves\nThe weeping of the massacred millions rising from the darkness\nWe received this poem and its memories for safekeeping at a time when Xu Anshi was still on Felicity Station: on an evening before the Feast of Hungry Ghosts, when she sat in a room lit by trembling lights, thinking of Lao, her husband who had died in the uprisings—and wondering how much of it had been of any worth.\nIt refers to a time when Anshi was older, wiser—she and Zhiying had escaped from Shattered Pine, and spent three years moving from hiding place to hiding place, composing the pamphlets that, broadcast into every household, heralded the end of the San-Tay governance over Felicity.\nOn the night that would become known as the Second Ring Riots, Anshi stood in one of the inner rings of Felicity Station, her bots spread around her, hacked into the network—half of them on her legs, pumping modifiers into her blood; half of them linked to the other Mheng bot-handlers, retransmitting scenes of carnage, of the Mheng mob running wild in the San-Tay districts of the inner rings, the High Tribunal and Spaceport Authority lasered, and the fashionable districts trashed.\n“This one,” Zhiying said, pointing to a taller door, adorned with what appeared to be a Mheng traditional blessing—until one realized that the characters had been chosen for aesthetic reasons only, and that they meant nothing.\nAnshi sent a subvocalized command to her bots, asking them to take the house. The feed to the rioting districts cut off abruptly, as her bots turned their attention towards the door and the house beyond: their sensors analyzing the bots on the walls, the pattern of the aerations, the cables running behind the door, and submitting hypotheses about possible architectures of the security system—before the swarm reached a consensus, and made a decision.\nThe bots flowed towards the door—the house’s bots sought to stop them, but Anshi’s bots split into two squads, and rushed past, heading for the head—the central control panel, which housed the bots’ communication system. Anshi had a brief glimpse of red-painted walls, and blinking holos; before her bots rushed back, job completed, and fell on the now disorganized bots at the door.\nEverything went dark, the Mheng characters slowly fading away from the door’s panels.\n“All yours,” Anshi said to Zhiying, struggling to remain standing—all her bots were jabbering in her mind, putting forward suggestions as to what to do next; and, in her state of extreme fatigue, ignoring them was harder. She’d seen enough handlers burnt beyond recovery, their brains overloaded with external stimuli until they collapsed—she should have known better. But they needed her—the most gifted bot-handler they had, their strategist—needed her while the San-Tay were still reeling from their latest interplanetary war, while they were still weak. She’d rest later—after the San-Tay were gone, after the Mheng were free. There would be time, then, plenty of it.\nBao and Nhu were hitting the door with soldering knives—each blow weakening the metal until the door finally gave way with a groan. The crowd behind Anshi roared; and rushed through—pushing Anshi ahead of them, the world shrinking to a swirling, confused mass of details—gouged-out consoles, ornaments ripped from shelves, pale men thrown down and beaten against the rush of the crowd, a whirlwind of chaos, as if demons had risen up from the underworld.\nThe crowd spread as they moved inwards; and Anshi found herself at the center of a widening circle in what had once been a guest room. Beside her, Bao was hacking at a nondescript bed, while others in the crowd beat down on the huge screen showing a sunset with odd, distorted trees—some San-Tay planet that Anshi did not recognize, maybe even Prime. Anshi breathed, hard, struggling to steady herself in the midst of the devastation. Particles of down and dust drifted past her; she saw a bot on the further end, desperately trying to contain the devastation, scuttling to repair the gashes in the screen. Nhu downed it with a well-placed kick; her face distorted in a wide, disturbing grin.\n“Look at that!” Bao held up a mirror-necklace, which shimmered and shifted, displaying a myriad configurations for its owner’s pleasure.\nNhu’s laughter was harsh. “They won’t need it anymore.” She held out a hand; but Bao threw the necklace to the ground; and ran it through with his knife.\nAnshi did not move—as if in a trance she saw all of it: the screen, the bed, the pillows that sought to mould themselves to a pleasing shape, even as hands tore them apart; the jewellery scattered on the ground; and the image of the forest, fading away to be replaced by a dull, split-open wall—every single mark of San-Tay privilege, torn away and broken, never to come back. Her bots were relaying similar images from all over the station. The San-Tay would retaliate, but they would have understood, now, how fragile the foundation of their power was. How easily the downtrodden Mheng could become their downfall; and how much it would cost them to hold Felicity.\nGood.\nAnshi wandered through the house, seeking out the San-Tay bots—those she could hack and reprogram, she added to her swarm; the others she destroyed, as ruthlessly as the guards had culled the prisoners on Shattered Pine.\nAnshi. Anshi.\nSomething was blinking, insistently, in the corner of her eyes—the swarm, bringing something to her attention. The kitchens—Zhiying, overseeing the executions. Bits and pieces, distorted through the bots’ feed: the San-Tay governor, begging and pleading to be spared; his wife, dying silently, watching them all with hatred in her eyes. They’d had no children; for which Anshi was glad. She wasn’t Zhiying, and she wasn’t sure she’d have borne the guilt.\nGuilt? There were children dying all over the station; men and women killed, if not by her, by those who followed her. She spared a bitter laugh. There was no choice. Children could die; or be raised to despise the inferior breed of the Mheng; be raised to take slaves and servants, and send dissenters like Anshi to be broken on Shattered Pine with a negligent wave of their hands. No choice.\nCome, the bots whispered in her mind, but she did not know why.\nZhiying was down to the Grand Master of Security when Anshi walked into the kitchens—she barely nodded at Anshi, and turned her attention back to the man aligned in the weapons’ sights.\nShe did not ask for any last words; though she did him the honor of using a bio-silencer on him, rather than the rifles they’d used on the family—his body crumpled inwards and fell, still intact; and he entered the world of the ancestors with the honor of a whole body. “He fought well,” Zhiying said, curtly. “What of the house?”\n“Not a soul left living,” Anshi said, flicking through the bots’ channels. “Not much left whole, either.”\n“Good,” Zhiying said. She gestured; and the men dragged the next victim—a Mheng girl, dressed in the clothes of an indentured servant.\nThis—this was what the bots had wanted her to see. Anshi looked to the prisoners huddled against the wall: there was one San-Tay left, an elderly man who gazed back at her, steadily and without fear. The rest—all the rest—were Mheng, dressed in San-Tay clothes, their skin pale and washed-out in the flickering lights—stained with what looked like rice flour from one of the burst bags on the floor. Mheng. Their own people.\n“Elder sister,” Anshi said, horrified.\nZhiying’s face was dark with anger. “You delude yourself. They’re not Mheng anymore.”\n“Because they were indentured into servitude? Is that your idea of justice? They had no choice,” Anshi said. The girl against the wall said nothing; her gaze slid away from Zhiying, to the rifle; finally resting on the body of her dead mistress.\n“They had a choice. We had a choice,” Zhiying said. Her gaze—dark and intense—rested, for a moment, on the girl. “If we spare them, they’ll just run to the militia, and denounce us to find themselves a better household. Won’t you?” she asked.\nAnshi, startled, realized Zhiying had addressed the girl—whose gaze still would not meet theirs, as if they’d been foreigners themselves.\nAt length, the girl threw her head back, and spoke in High Mheng. “They were always kind with me, and you butchered them like pigs.” She was shivering now. “What will you achieve? You can’t hide on Felicity. The San-Tay will come here and kill you all, and when they’re done, they’ll put us in the dark forever. It won’t be cushy jobs like this—they’ll consign us to the scavenge heaps, to the ducts-cleaning and the bots-scraping, and we won’t ever see starlight again.”\n“See?” Zhiying said. “Pathetic.” She gestured, and the girl crumpled like the man before her. The soldiers dragged the body away, and brought the old San-Tay man. Zhiying paused; and turned back to Anshi. “You’re angry.”\n“Yes,” Anshi said. “I did not join this so we could kill our own countrymen.”\nZhiying’s mouth twisted in a bitter smile. “Collaborators,” she said. “How do you think a regime like the San-Tay continues to exist? It’s because they take some of their servants, and set them above others. Because they make us complicit in our own oppression. That’s the worst of what they do, little sister—turn us against each other.”\nNo. The thought was crystal-clear in Anshi’s mind, like a blade held against starlight. That’s not the worst. The worst is that, to fight them, we have to best them at their own game.\nShe watched the old man as he died; and saw nothing in his eyes but the reflection of that bitter knowledge.\nWhite Horse Hall is huge, so huge that it’s a wonder Wen didn’t see it from afar—more than a hundred stories, and more unveil as her floater lifts higher and higher, away from the crowd massed on the ground. Above the cloud cover, other white-clad floaters weave in and out of the traffic, as if to the steps of a dance only they can see.\nShe’s alone: her escort left her at the floater station—the older man with a broad smile and a wave, and the second man with a scowl, looking away from her. As they ascend higher and higher, and the air thins out—to almost the temperature of Felicity—Wen tries to relax, but cannot do so. She’s late; and she knows it—and they probably won’t admit her into the hall at all. She’s a stranger here; and Mother is right: she would be better off in Felicity with Zhengyao, enjoying her period of rest by flying kites, or going for a ride on Felicity’s River of Good Fortune.\nAt the landing pad, a woman is waiting for her: small and plump, with hair shining silver in the unfiltered sunlight. Her face is frozen in careful blankness, and she wears the white of mourners, with none of the markers for the family of the dead.\n“Welcome,” she says, curtly nodding to acknowledge Wen’s presence. “I am Ho Van Nhu.”\n“Grandmother’s friend,” Wen says.\nNhu’s face twists in an odd expression. “You know my name?” She speaks perfect Galactic, with a very slight trace of an accent—heard only in the odd inflections she puts on her own name.\nWen could lie; could say that Mother spoke of her often; but here, in this thin, cold air, she finds that she cannot lie—any more than one does not lie in the presence of the Honoured Leader. “They teach us about you in school,” she says, blushing.\nNhu snorts. “Not in good terms, I’d imagine. Come,” she says. “Let’s get you prepared.”\nThere are people everywhere, in costumes Wen recognizes from her history lessons—oddly old-fashioned and formal, collars flaring in the San-Tay fashion, though the five panels of the dresses are those of the Mheng high court, in the days before the San-Tay’s arrival.\nNhu pushes her way through the crowd, confident, until they reach a deserted room. She stands for a while in the center, eyes closed, and bots crawl out of the interstices, dragging vegetables and balls of rolled-up dough—black and featureless, their bodies gleaming like knife-blades, their legs moving on a rhythm like centipedes or spiders.\nWen watches, halfway between fascination and horror, as they cut up the vegetables into small pieces—flatten the dough and fill up dumplings, and put them inside small steamer units that other bots have dragged up. Other bots are already cleaning up the counter, and there is a smell in the room—tea brewing in a corner. “I don’t—” Wen starts. How can she eat any of that, knowing how it was prepared? She swallows, and forces herself to speak more civilly. “I should be with her.”\nNhu shakes her head. Beads of sweat pearl on her face; but she seems to be gaining color as the bots withdraw, one by one—except that Wen can still see them, tucked away under the cupboards and the sink, like curled-up cockroaches. “This is the wake, and you’re already late for it. It won’t make any difference if you come in quarter of an hour later. And I would be a poor host if I didn’t offer you any food.”\nThere are two cups of tea on the central table; Nhu pours from a teapot, and pushes one to Wen—who hesitates for a moment, and then takes it, fighting against a wave of nausea. Bots dragged out the pot; the tea leaves. Bots touched the liquid that she’s inhaling right now.\n“You look like your mother when she was younger,” Nhu says, sipping at the tea. “Like your grandmother, too.” Her voice is matter-of-fact; but Wen can feel the grief Nhu is struggling to contain. “You must have had a hard time, at school.”\nWen thinks on it for a while. “I don’t think so,” she says. She’s had the usual bullying, the mockeries of her clumsiness, of her provincial accent. But nothing specifically directed at her ancestors. “They did not really care about who my grandmother was.” It’s the stuff of histories now; almost vanished—only the generation of the Honored Leader remembers what it was like, under the San-Tay.\n“I see,” Nhu says.\nAn uncomfortable silence stretches, which Nhu makes no effort to break.\nSmall bots float by, carrying a tray with the steamed dumplings—like the old vids, when the San-Tay would be receiving their friends at home. Except, of course, that the Mheng were doing the cutting-up and the cooking, in the depths of the kitchen.\n“They make you uncomfortable,” Nhu says.\nWen grimaces. “I—we don’t have bots, on Felicity.”\n“I know. The remnants of the San-Tay—the technologies of servitude, which should better be forgotten and lost.” Her voice is light, ironic; and Wen realizes that she is quoting from one of the Honored Leader’s speeches. “Just like High Mheng. Tell me, Wen, what do the histories say of Xu Anshi?”\nNothing, Wen wants to say; but as before, she cannot bring herself to lie. “That she used the technologies of the San-Tay against them; but that, in the end, she fell prey to the lure of their power.” It’s what she’s been told all her life; the only things that have filled the silence Mother maintains about Grandmother. But, now, staring at this small, diminutive woman, she feels almost ashamed. “That she and her followers were given a choice between exile, and death.”\n“And you believe that?”\n“I don’t know,” Wen says. And, more carefully, “Does it matter?”\nNhu shrugs, shaking her head. “Mingxia—your mother once asked Anshi if she believed in reconciliation with Felicity. Anshi told her that reconciliation was nothing more than another word for forgetfulness. She was a hard woman. But then, she’d lost so much in the war. We all did.”\n“I’m not Mother,” Wen says, and Nhu shakes her head, with a brief smile.\n“No. You’re here.”\nOut of duty, Wen thinks. Because someone has to come, and Mother won’t. Because someone should remember Grandmother, even if it’s Wen—who didn’t know her, didn’t know the war. She wonders what the Honored Leader will say about Grandmother’s death, on Felicity—if she’ll mourn the passing of a liberator, or remind them all to be firm, to reject the evil of the San-Tay, more than sixty years after the foreigners’ withdrawal from Felicity.\nShe wonders how much of the past is worth clinging to.\nSee how the gilded Heavens are covered\nWith the burning bitter tears of our departed\nCast away into darkness, they contradict no truths\nMade mute and absent, they denounce no lies\nAnshi gave this poem into our keeping on the night after her daughter left her. She was crying then, trying not to show it—muttering about ungrateful children, and their inability to comprehend any of what their ancestors had gone through. Her hand shook, badly; and she stared into her cup of tea, as hard as she had once stared into the black hole and its currents, dragging everything into the lightless depths. But then, as on Shattered Pine, the only thing that came to her was merciless clarity, like the glint of a blade or a claw.\nIt is an old, old composition, its opening lines the last Anshi wrote on Felicity Station. Just as the first poem defined her youth—the escaped prisoner, the revolution’s foremost bot-handler—this defined her closing decades, in more ways than one.\nThe docks were deserted; not because it was early in the station’s cycle, not because the war had diminished interstellar travel; but because the docks had been cordoned off by Mheng loyalists. They gazed at Anshi, steadily—their eyes blank; though the mob behind them brandished placards and howled for her blood.\n“It’s not fair,” Nhu said. She was carrying Anshi’s personal belongings—Anshi’s bots, and those of all her followers, were already packed in the hold of the ship. Anshi held her daughter Mingxia by the hand: the child’s eyes were wide, but she didn’t speak. Anshi knew she would have questions, later—but all that mattered, here and now, was surviving this. “You’re a heroine of the uprising. You shouldn’t have to leave like a branded criminal.”\nAnshi said nothing. She scanned the crowd, wondering if Zhiying would be there, at the last—if she’d smile and wish her well, or make one last stab of the knife. “She’s right, in a way,” she said, wearily. The crowd’s hatred was palpable, even where she stood. “The bots are a remnant of the San-Tay, just like High Mheng. It’s best for everyone if we forget it all.” Best for everyone but them.\n“You don’t believe that,” Nhu said.\n“No.” Not any of that; but she knew what was in Zhiying’s heart, the hatred of the San-Tay that she carried with her—that, to her little sister, she would be nothing more than a collaborator herself—tainted by her use of the enemy’s technology.\n“She just wants you gone. Because you’re her rival.”\n“She doesn’t think like that,” Anshi said, more sharply than she’d intended; and she knew, too, that she didn’t believe that. Zhiying had a vision of the Mheng as strong and powerful; and she’d allow nothing and no one to stand in its way.\nThey were past the cordon now, and the maw of the ship gaped before them—the promise of a life somewhere else, on another planet. Ironic, in a way—the ship was from the San-Tay High Government, seeking amends for their behavior on colonized stations. If someone had ever told her she’d ride one of those as a guest . . .\nNhu, without hesitation, was heading up towards the dark tunnel. “You don’t have to come,” Anshi said.\nNhu rolled her eyes upwards, and made no comment. Like Anshi, she was old guard; a former teacher in the Mheng schools, fluent in High Mheng, and with a limited ability to control the bots. A danger, like Anshi.\nThere was a noise behind them—the beginning of a commotion. Anshi turned; and saw that, contrary to what she’d thought, Zhiying had come.\nShe wore the sash of Honored Leader well; and the stars of Felicity’s new flag were spread across her dress—which was a shorter, less elaborate version of the five-panel ceremonial garb. Her hair had been pulled up in an elegant bun, thrust through with a golden phoenix pin, the first jewel to come out of the station’s new workshops—she was unrecognizable from the gaunt, tall prisoner Anshi remembered, or even from the dark, intense leader of the rebellion years.\n“Elder sister.” She bowed to Anshi, but did not come closer; remaining next to her escort of black-clad soldiers. “We wish you happiness, and good fortune among the stars.”\n“We humbly thank you, Your Reverence,” Anshi said—keeping the irony, and the hurt from her voice. Zhiying’s eyes were dark, with the same anger Anshi remembered from the night of the Second Ring riots—the night when the girl had died. They stood, staring at each other, and at length Zhiying gestured for Anshi to move.\nAnshi backed away, slowly, pulling her daughter by the hand. She wasn’t sure why she felt . . . drained, as if a hundred bots had been pumping modifiers into her blood, and had suddenly stopped. She wasn’t sure what she’d expected—an apology? Zhiying had never been one for it; or for doubts of any kind. But still—\nStill, they’d been on Shattered Pine together; had escaped together; had preached and written the poetry of the revolution, and dared each other to hack into Felicity’s network to spread it into every household, every corridor screen.\nThere should have been something more than a formal send-off; something more than the eyes boring into hers—dark and intense, and with no hint of sorrow or tears.\nWe do not weep for the enemy, Anshi thought; as she turned, and passed under the wide metal arc that led into the ship, her daughter’s hand heavy in hers.\nIn the small antechamber, Wen dons robes of dark blue—those reserved for the mourners who are the closest family to the dead. She can hear, in the distance, the drone of prayers from the priests, and the scuttling of bots on the walls, carrying faint music until the entire structure of the hall seems to echo with it. Slowly, carefully, she rises, and stares at her pale, wan self in the mirror—with coiled bots at its angles, awaiting just an order to awaken and bring her anything she might desire. Abominations, she thinks, uneasily, but it’s hard to see them as something other than alien, incomprehensible.\nNhu is waiting for her at the great doors—the crowd has parted, letting her through with an almost religious hush. In silence, Wen kneels, her head bent down—an honor to the dead, an acknowledgement that she is late and that she must make amends, for leaving Grandmother’s ghost alone.\nShe hears a noise as the doors open—catches a flash of a crowd dressed in blue; and then she is crawling towards the coffin, staring at the ground ahead of her. By her side, there are glimpses of dresses’ hems, of shoes that are an uneasy meld of San-Tay and Mheng. Ahead, a steady drone from the monks at the pulpit, taken up by the crowd; a prayer in High Mheng, incomprehensible words segueing into a melodious chant; and a smell of incense mingled with something else, a flower she cannot recognize. The floor under her is warm, soft—unlike Felicity’s utilitarian metal or carpets, a wealth of painted ostentation with patterns she cannot make out.\nAs she crawls, Wen finds herself, incongruously, thinking of Mother.\nShe asked, once, why Mother had left San-Tay Prime—expecting Mother to rail once more at Grandmother’s failures. But Mother merely pulled a low bench, and sat down with a sigh. “There was no choice, child. We could dwindle away on San-Tay Prime, drifting further and further away from Felicity with every passing moment. Or we could come back home.”\n“It’s not Grandmother’s home,” Wen said, slowly, confusedly—with a feeling that she was grappling with something beyond her years.\n“No,” Mother said. “And, if we had waited too long, it wouldn’t have been your home either.”\n“I don’t understand.” Wen put a hand on one of the kitchen cupboards—the door slid away, letting her retrieve a can of dried, powdered shrimp, which she dumped into the broth on the stove.\n“Like two men carried away by two different currents in the river—both ending in very different places.” She waved a dismissive hand. “You’ll understand, when you’re older.”\n“Is that why you’re not talking with Grandmother?”\nMother grimaced, staring into the depths of her celadon cup. “Grandmother and I . . . did not agree on things,” she said. “Sometimes I think . . . ” She shook her head. “Stubborn old woman. She never could admit that she had lost. That the future of Felicity wasn’t with bots, with High Mheng; with any of what the San-Tay had left us.”\nBots. High Mheng—all of the things that don’t exist anymore, on the new Felicity—all the things the Honored Leader banished, for the safety and glory of the people. “Mother . . . ” Wen said, suddenly afraid.\nHer mother smiled; and for the first time Wen saw the bitterness in her eyes. “Never mind, child. This isn’t your burden to carry.”\nWen did not understand. But now . . . now, as she crawls down the aisle, breathing in the unfamiliar smells, she thinks she understands. Reconciliation means forgetfulness, and is it such a bad thing that they forget, that they are no longer chained to the hatreds of the past?\nShe reaches the coffin, and rises—turns, for a brief moment, to stare at the sea of humanity before her—the blurred faces with bots at the corner of their eyes, with alien scents and alien clothes. They are not from Felicity anymore, but something else—poised halfway between the San-Tay and the culture that gave them birth; and, as the years pass, those that do not come back will drift further and further from Felicity, until they will pass each other in the street, and not feel anything but a vague sense of familiarity, like long-lost families that have become strangers to each other.\nNo, not from Felicity anymore—and does it matter, any of it?\nWen has no answer—none of Mother’s bleak certainties about life. And so she turns away from the crowd, and looks into the coffin—into the face of a stranger, across a gap like a flowing river, dark and forever unbridgeable.\nI am in halves, dreaming of a faraway home\nNot a dry spot on my moonlit pillow\nThrough the open window lies the stars and planets\nWhere ten thousand family members have scattered\nAlong the River of Heaven, with no bridges to lead them home\nThe long yearning\nCuts into my heart\nThis is the last poem we received from Xu Anshi; the last one she composed, before the sickness ate away at her command of High Mheng, and we could no longer understand her subvocalized orders. She said to us then, “it is done”; and turned away from us, awaiting death.\nWe are here now, as Wen looks at the pale face of her grandmother. We are not among our brethren in the crowd—not clinging to faces, not curled on the walls or at the corner of mirrors, awaiting orders to unfold.\nWe have another place.\nWe rest on the coffin with Xu Anshi’s other belongings; scattered among the paper offerings—the arch leading into the Heavens, the bills stamped with the face of the King of Hell. We sit quiescent, waiting for Xu Wen to call us up—that we might flow up to her like a black tide, carrying her inheritance to her, and the memories that made up Xu Anshi’s life from beginning to end.\nBut Wen’s gaze slides right past us, seeing us as nothing more than a necessary evil at the ceremony; and the language she might summon us in is one she does not speak and has no interest in.\nIn silence, she walks away from the coffin to take her place among the mourners—and we, too, remain silent, taking our understanding of Xu Anshi’s life into the yawning darkness.\n\"With apologies to Qiu Jin, Bei Dao and the classical\nTang poets for borrowing and twisting their best lines\"\nAliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award and four British Science Fiction Association Awards, and is a double Hugo finalist for 2019 (Best Series and Best Novella). Most recently she published In the Vanishers' Palace, a dark retelling of Beauty and the Beast where they are both women and where the Beast is a Vietnamese dragon (2018 Lammy Award finalist for LGBTQ SF/F/Horror). Recent works include the Dominion of the Fallen series, set in a turn-of-the-century Paris devastated by a magical war, which comprises The House of Shattered Wings, The House of Binding Thorns, and forthcoming The House of Sundering Flames (July 2019, Gollancz). Her short story collection Of Wars, and Memories, and Starlight is forthcoming from Subterranean Press (Sept 2019).", "source": "https://clarkesworldmagazine.com/de_bodard_01_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Scattered Along the River of Heaven by Aliette de Bodard"}