{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ekaterina Sedia", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "NHFToDcq8Ki0wtnW15Q5r8J8hT4=", "id": null, "license": null, "comments": "", "raw_text": "3640 words, short story  Herding Vegetable Sheep  I herd the clouds as I do every day. Their ghostly protuberances wrap around the wings of the plane, obscuring the blue AOL logo with their wispy fingers, and then retreat under the stream of air from the props, swirling and compacting into tight white formations that remind me of those queer plants—what were they called? Vegetable sheep. I’ve seen them on my vacation in New Zealand, years ago, when there was a New Zealand. These plants are related to daisies, the tour guide said. It was hard to believe that.  I watch the columns of numbers that scroll across my retinal implant, with an occasional commercial interruption from my employer, only nowadays they call them ‘congressional communiqués’. I suppose they are. I wish I could save them to reread them later, but preserving such trivia is not worth getting arrested for.  The clouds swirl, tighter and snugger, their color deepening into grey, and my plane circles them this way and that, herding them together, making them coalesce like vegetable sheep in the New Zealand mountains. The plane growls like a sheep dog, and the clouds gain mass and finally weep. I circle them again, strangely uneasy about their watery release. Rain is good, I remind myself. Rain is power, rain is electricity, rain is new juice in the batteries.  The radio implant buzzes and I wince.  “Anita,” it says, and for a moment I believe it is speaking to me—the radio, I mean, not just the person on the other end. The illusion fades. “You better come down—you’re running low.”  “Okay,” I say. “I was just about to.” I touch the pads and spiral downwards, like a falling leaf, with grace and dignity.  It is raining hard when I land, the black wings of the generator’s membranes thrumming, vibrating up and down, giving birth to electricity that feeds the city around it. It is like a giant diaphragm, its undulations under the insistent drumming of the raindrops betraying its thoughts to the world. The Greeks used to think that the diaphragm’s movement generated thoughts, and I am almost ready to believe that. The membrane thrums, its dark thoughts enveloping the city with fog. I glance at the time indicator of my heads-up display and rush away from the airfield, through the iron gates of the energy factory. I am running late.  The rain is pouring now, and my yellow slicker caves under the coalescing and dividing rivulets of rainwater, presses against my shirt, cooling my skin, crushing my chest with its weight. It is hard to breathe underwater. I cross the streets, knocking over the mushroom caps that have colonized every sidewalk and almost skid on the patch of green algae, camouflaged treacherously between the white stripes of the pedestrian crossing, but right myself. I have an appointment to keep. I enter the cafe, and wedge my body into a narrow booth, and look out of the window until a tall mermaid-like shape swims from out of the rain. My granddaughter.  “Hi, Anita,” says the girl as she slides sideways into the booth, keeping her head down, as if afraid that someone would recognize her. She is afraid that someone would recognize her, I think. This is why she never calls me grandma.  “Hi, baby. Does your mother know you’re here?”  She scoffs. “I’m not a baby, Anita.”  I know that. I just want to find out if my daughter ever asks about me.  She softens, and smiles at the waiter who brings us a pitcher of cold water. “We’ll need another minute,” she tells him, her eyes green and vacant, like those of a cat. New contacts, I guess. Then she turns those hollow eyes at me. “I wanted to talk to you, Anita,” she says in a caring voice. As if she’s the grown up.  I nod. “Go ahead, Ilona.” I know what she’s going to say.  She leans in, her narrow palm pressed against the plastic of the table between us. “How old are you, Anita?”  “Sixty-eight.”  “It shows.”  We stare at each other, not blinking, and under her gaze I feel every blemish and wrinkle pucker up, turn purple, leer.  “I don’t mean to be cruel,” she says, “but you don’t have to look this way.”  “I know.” If I change, will you be less embarrassed of being seen with me? “I’ll think about it.”  “There’s nothing to think about,” she says with a beam of confidence only pretty teenage girls can muster, and starts flipping through her menu.  I do the same, all the while wondering why am I not ashamed of my face? Instead, I cringe at the thought of my optimized heart and metal joints, of my eyes that can see so well because of lasers, of my new healthy lungs. I can only bear these artifices within me because my old skin is covering them up. I could not imagine separating from it. But the love, the love . . . my eyes skim over the lines in front of me, as I imagine what it would be like to have my daughter back, my granddaughter not ashamed.  My granddaughter looks up and frowns. She pulls out a handkerchief tucked in her wristband, spits in it, and rubs my cheek, as intrusive and unselfconscious as a parent with her child. I submit. She looks at the handkerchief, incredulous. “What’s that?”  It’s a green smudge. “Algae,” I say. “They grow everywhere.”  “On your face?” She doesn’t bother to hide her disgust.  “It’s even wetter up in the clouds,” I say. “They look like vegetable sheep from up there. You should—”  She interrupts. “Vegetable sheep?”  “Big white and grey cushions—millions of tiny plants wedged together, all the same height. They grow high up in the mountains, where it’s cold. If one grows taller than the others, it dies of frostbite.” I’m not making sense, and I change the subject. “Anyway. How’re things at school?”  “Boring.” She gives a little laugh. “I can’t wait until I’m out of there.”  “Why do you think it’ll be better once you’re out?”  She jerks her shoulder and gives me a smoldering look. “Oh, don’t start. Just ’cause you’re depressed, doesn’t mean everyone else has to be too.”  “Sorry,” I whisper. I am.  “We’re ready to order,” she tells the waiter who’s been hovering nearby. After he departs, she gives me a cheerful smile. “You’ll feel better once you get your face fixed up.”  Beauty is fleeting, I want to say, but think better of it. “It’s good to see you, sweetie. Everything will be okay.”  At night, I lie awake listening to the rain’s whisper outside, thinking of love. I believe it is my failure that my daughter would not talk to me, and my granddaughter treats me as a child. I wish I knew how to fix it, how to fit into the snug world of the people I care about. Instead, I leave them behind, on the ground, as my plane sputters and spits jets of dust into too-warm, moist air. I don’t just herd clouds, I make them on occasion. The dust is called ‘condensation nuclei’, but they’re just dust. Tiny grains lodging under my fingernails and making me cough, the grains that already cost me a pair of lungs. I don’t really mind, as long as they make clouds appear out of thin, oversaturated air. I wish I could show my granddaughter that, and perhaps she would love them as much as I do, and by extension love me. I almost weep with joy when the morning comes, grey, weeping along with me.  At the factory, I flash my badge at the security guard, who nods back—a sad little ritual we exchange for the past forty years. I don’t give him a second look—my gaze travels past the undulating membranes toward the airfield.  “Wait,” he calls. “I have something for you.”  I open the manila envelope he gives me, with a panicked strumming of the heart against its cage. This is it, I think. They are finally going to let me go.  “Some girl dropped it off this morning,” the guard says.  I shield the piece of paper with the envelope, and the raindrops splash and slide down the smooth yellow surface. It’s just some photographs. I look closer, and my frantic heart seizes up: it is a picture of the vegetable sheep—just like I remember them, white, snug, content. There’s a close up of one, and on the next frame there’s a bird’s eye view of them, scattering in groups and solitarily across the green mountains. I swallow hard.  “A pretty girl,” the guard says. “Didn’t tell her name or anything, just that you’d know.”  “That’s my granddaughter,” I say, and turn away, stuffing the pictures back into the envelope, to hide them from moisture.  I wonder where she got them as I walk to my plane. There are none on the govnet, just like there is nothing there that would remind us that there is a world outside of our shrinking rainy continent. There are no kangaroos, Coliseum, Aegean Sea, or Sahara. Things she will never know about; yet, she found me the vegetable sheep. I am grateful, and surprised, and a bit sad that I have underestimated her.  The plane rises, and there are almost no clouds. I find a pocket of wet, warm air—I don’t need the sensors to tell me that, I can see the way it shimmers—and turn on my dust cannons on full blast. At first, there are only streams of grey refuse, but then, without warning, a thick fog condenses into white tufts, and soon there are enough of them to nudge gently with the jets of air, until they are compact and round. I pull the pictures out of the envelope and spread them across the seat next to me. I cannot wait to see her, to tell her how much those clouds trapped among the green mountains mean to me.  I never get a chance. I call her as soon as I land, from the soaked airfield. She does not answer her phone, even though I know she never detaches it from her ear. I am starting to worry, but then my ear-piece buzzes.  “Baby,” I say, “are you all right?”  There’s sobbing, and it’s not Ilona. “Anita?” Finally, in a halting, hoarse voice. It is my daughter.  “Petra,” I whisper. “Are you all right?”  “I’m fine. But Ilona’s missing.”  I count breaths. The joy of hearing my daughter’s voice is dissolved in her tears, and I don’t know what to say.  “Will you help me find her?”  “Of course.”  “Can you come over?”  Of course I can. She lives too far to walk, and I grab the first velorickshaw who idles by the gates of the factory, waiting for the pilots and the engineers to leave for the day. I settle into the rickety, leaking cab, and think, trying to ignore the water splashing in my face with every turn of the rickshaw’s feet on the pedals.  I think of what I can do—the friends to talk to, the old favors to call on. I’m not like Petra, who—I can feel it, I know—is sitting in her kitchen, crying, tearing her heart out imagining every pain, every violation that Ilona could’ve suffered. She’s always been too quick to grieve.  She left the door unlocked, and I find her in the kitchen, her shoulders heaving.  “Petra.”  She flings herself into my arms, with a fierceness of one who missed comfort.  I stroke her hair, dyed deep auburn. “Calm down. It’s not that bad. When did she disappear?”  “She didn’t come home from school.”  “Maybe she’s with some friends.” Even I know it’s a lie; another teenager might run off, but not dutiful Ilona, who took it on her thin shoulders to be the link between me and her mother, the only one who was young enough to not be burdened by old hurts.  Petra doesn’t even bother to argue. “I called the police, and they said they’ll look into it. They don’t return my calls.”  This is bad. “I’ll call Jeremy,” I tell her. “Blow your nose and make me some tea.”  She nods, and fusses with the kettle. If she were younger, she would’ve blamed me for everything.  I call Jeremy. He’s a cop and a good friend, and Petra hates him. But not today.  “I need a favor,” I tell him. “My granddaughter’s missing.”  He doesn’t seem surprised. “Can’t help you,” he says, and lowers his voice. “This is Federal jurisdiction.”  “BLIPs?” I see Petra flinch, and lower my voice. “What did the kid do?”  “Downloading and distribution of copyrighted materials.”  I think of the pictures in my plane. Vegetable sheep, so harmless. Who would’ve thought that the Bureau of Licensing and Intellectual Property would be interested in a sixteen-year-old kid? Unless she already has a record.  “We made the arrest, but the BLIPs took her off our hands quickly.”  I hang up, and look at Petra. She looks back, guilt shining through her tears like stars. I warned you, didn’t I?  I get a hold of Maria. She is a high school friend, and thus our relationship combines a gradual distancing with an exaggerated sense of obligation. But even she cannot help me.  “I’m so sorry,” she whispers into the phone. “I can’t do anything. The computer on which download has occurred has been tapped for a while. We were just waiting for something serious enough to occur.”  “Why?”  “Don’t know,” she hisses. “Sorry, got to go.”  Petra is fiddling with her hair. “It’s my fault.”  No point in arguing—we both know she is right, but I’m not going to gloat. It was hard enough for me to lose her to the misguided rebellion that offered no action and no escape. She was only fourteen when the entertainment conglomerates first ran for presidency, and eighteen when they won. She still remembers when the information was not screened or regulated by the government, when there was no such thing as a govnet. Ilona doesn’t.  Petra was not the one to ignore it, but she was not a fighter. Her anger manifested in small acts of disobedience, which gave little consolation and even less meaning. One can talk shit about the government all one wants, but in the end is trapped worse than those who are oblivious.  “But what was I supposed to do?” Her voice gains a cracked quality. “My own mother was working for them.”  So your daughter pays for the sins of your mother. Only you are untouched. “What exactly did you do?”  Petra tells me that she had her computer hacked, connected to the other net, not the govnet. She used it to read the news; she never knew that Ilona had any interest in using it, but didn’t make much of an effort to hide it, or to explain to her daughter the intricacies of the Declaration of Copyright. Of course the kid is going to see a picture and print it, never realizing that that constitutes intent to distribute, jail time mandatory. She had no way of knowing that everything is copyrighted in perpetuity, regardless of where it appears. Free net or not, it’s BLIP jurisdiction.  I drink the lukewarm tea as Petra cries and talks, cries and talks. Her sobs and babbling create a soothing rhythm, and it is easier to think to it. I think of the Federal penitentiaries in the area, and I think of how many of them I have flown above. No reason not to do it again.  “Tomorrow,” I tell Petra, “I’m going to do some reconnaissance flying.”  She stops sobbing. “Isn’t it dangerous?” Her eyes glitter, anxious. “I don’t want to lose you too.”  You threw me away years ago. What other loss are you afraid of? “It’s a government plane, baby, remember?”  “They let you fly anywhere you want?”  “As long as there are clouds.”  She stares at me, and I tell her of warm dry winters when clouds are hard to find, and there’s not enough moisture in the air to make them. I tell her of the quilt of the fallow fields and the green silk of the ocean, its foamy crests like tiny clouds. Of the tedious azure of the sky and the thrill of the hunt as I spot a white wisp of a nascent cloud, still unsure whether to come into being, its transparency both a promise and a threat. I chase them across the sky, over land and over sea, and whatever lies beneath is not my concern.  I let the clouds lead me. It is neither faith nor superstition, but a voice of experience—as long as I follow the white fluffy shapes, they will lead me where I need to be. It may be a roundabout way, blown by winds and air currents, convection and condensation, but we will get there in the end.  I follow them, but for the first time I let them be. My plane swoops down, closer and closer to the bejeweled patchwork of the ground, until I can discern tall grey cement and low greenery, and almost lose my way in the vapor rising from the oversaturated ground. I rise again to safety, but descend again, circling, looking. I disconnect the communication system and turn the scopes to the ground, and search it.  I watch the yards of the penitentiaries, and I look for women. At the Austin Federal Penitentiary, I find a group of young girls, in identical orange jumpsuits, as they circle aimlessly through a grey cement yard, and I look for the familiar face. It is hard to see in the grey rain, even with the scope, until one of them tilts her head upwards and smiles.  A day passes like that, and another one. It’s raining fine without me, leaving me free to look like a hawk. On the third day, I am denied entrance to the airfield.  I think of making a dash—the guard would never catch up with me. Instead, I ask why, even though I know the answer. The security guard looks at me with pity in his eyes, and it belies the banality of his words—subversive element in the family, security risk, retirement age. They don’t even bother to pick one excuse; they lump them all together, without an appearance of respect.  “I’m sorry,” he says in the end. “She was a real pretty girl.”  I lean closer to the plastic of his booth, and he doesn’t flinch away. “Listen, Thomas,” I say. “I left some personal belongings in the cockpit. Think I can run in real quick and get them?” And add, to ease possible suspicion, “Or you can get them for me.”  He sighs and shifts in his narrow stool, his bulk sloshing from one side to the other. He peers at the grey rain, coming down in glassy sheets. “You go right ahead,” he says. “Just don’t dawdle.”  I have no intention to. I cross the airfield in a quick walk, my boots sliding on the wet grass. Other pilots pay me no mind—they never do; I am too old to be looked at with any comfort. They don’t seem alarmed when I grab the prop and pull it, desperation tripling the weight of my frail body. The engine starts, its metal heart beating in a faster rhythm than mine, and the plane glides down the field. I catch up to it in a run and vault into the cabin, just as I hear someone call out, “Hey!”  The air is wet in my face, until I slam the door shut, and we’re off, spiraling, ascending on the warm currents, the clouds moving down to greet us, like sheep greeting their shepherd. I look at the clock—8 am. I have an hour to get there. I need forty-five minutes.  The girls are in the yard again. It is raining hard, and they wear yellow slickers, the hoods obscuring their faces. There are two female guards, watching from the cover of the tall wire fence; there are probably others.  One of the yellow hoods tilts back, and I see a pale face and dark hair, a small mouth opened in hope and wonder. She is the only one left standing as my plane drops into the yard, like a bird of prey. I land by the fence, and hope that the yard is long enough to stop.  There are gunshots, and the white panicked faces of the guards through the windshield. I turn the dust cannons on full blast, and they are lost in the grey cloud of searing particles. A small fist pounds on the door, and I swing it open. Ilona clambers into the seat next to me and the plane turns around. There’s not enough space for a proper takeoff and I gun it, taking off the top of the fence.  Ilona gasps next to me, and then regains her usual composure. “Did you like my pictures?”  “Yes. Thank you very much.”  “I thought you would.”  I point at the approaching tight cluster of white clouds, and my granddaughter laughs. “Just like in the pictures.”  I aim the plane into the center of it, and cut the engine. We fall, weightless, surrounded by the celestial vegetable sheep. One of them takes us into its soft arms and smiles, cradling the plane.  The engines rev back to life, and Ilona lets out a long sigh. “I could fall like this forever.”  I nod. She is strong and she will learn to fly. Ekaterina Sedia resides in the Pinelands of New Jersey. Her critically-acclaimed and award-nominated novels, The Secret History of Moscow, The Alchemy of Stone, The House of Discarded Dreams, and Heart of Iron, were published by Prime Books. Her short stories have sold to Analog, Baen's Universe, Subterranean, and Clarkesworld, as well as numerous anthologies, including Haunted Legends and Magic in the Mirrorstone. She is also the editor of the anthologies Paper Cities (World Fantasy Award winner), Running with the Pack, and Bewere the Night, as well as forthcoming Bloody Fabulous and Wilful Impropriety. Her short-story collection, Moscow But Dreaming, will be released by Prime Books in December 2012.", "text": "3640 words, short story\nHerding Vegetable Sheep\nI herd the clouds as I do every day. Their ghostly protuberances wrap around the wings of the plane, obscuring the blue AOL logo with their wispy fingers, and then retreat under the stream of air from the props, swirling and compacting into tight white formations that remind me of those queer plants—what were they called? Vegetable sheep. I’ve seen them on my vacation in New Zealand, years ago, when there was a New Zealand. These plants are related to daisies, the tour guide said. It was hard to believe that.\nI watch the columns of numbers that scroll across my retinal implant, with an occasional commercial interruption from my employer, only nowadays they call them ‘congressional communiqués’. I suppose they are. I wish I could save them to reread them later, but preserving such trivia is not worth getting arrested for.\nThe clouds swirl, tighter and snugger, their color deepening into grey, and my plane circles them this way and that, herding them together, making them coalesce like vegetable sheep in the New Zealand mountains. The plane growls like a sheep dog, and the clouds gain mass and finally weep. I circle them again, strangely uneasy about their watery release. Rain is good, I remind myself. Rain is power, rain is electricity, rain is new juice in the batteries.\nThe radio implant buzzes and I wince.\n“Anita,” it says, and for a moment I believe it is speaking to me—the radio, I mean, not just the person on the other end. The illusion fades. “You better come down—you’re running low.”\n“Okay,” I say. “I was just about to.” I touch the pads and spiral downwards, like a falling leaf, with grace and dignity.\nIt is raining hard when I land, the black wings of the generator’s membranes thrumming, vibrating up and down, giving birth to electricity that feeds the city around it. It is like a giant diaphragm, its undulations under the insistent drumming of the raindrops betraying its thoughts to the world. The Greeks used to think that the diaphragm’s movement generated thoughts, and I am almost ready to believe that. The membrane thrums, its dark thoughts enveloping the city with fog. I glance at the time indicator of my heads-up display and rush away from the airfield, through the iron gates of the energy factory. I am running late.\nThe rain is pouring now, and my yellow slicker caves under the coalescing and dividing rivulets of rainwater, presses against my shirt, cooling my skin, crushing my chest with its weight. It is hard to breathe underwater. I cross the streets, knocking over the mushroom caps that have colonized every sidewalk and almost skid on the patch of green algae, camouflaged treacherously between the white stripes of the pedestrian crossing, but right myself. I have an appointment to keep. I enter the cafe, and wedge my body into a narrow booth, and look out of the window until a tall mermaid-like shape swims from out of the rain. My granddaughter.\n“Hi, Anita,” says the girl as she slides sideways into the booth, keeping her head down, as if afraid that someone would recognize her. She is afraid that someone would recognize her, I think. This is why she never calls me grandma.\n“Hi, baby. Does your mother know you’re here?”\nShe scoffs. “I’m not a baby, Anita.”\nI know that. I just want to find out if my daughter ever asks about me.\nShe softens, and smiles at the waiter who brings us a pitcher of cold water. “We’ll need another minute,” she tells him, her eyes green and vacant, like those of a cat. New contacts, I guess. Then she turns those hollow eyes at me. “I wanted to talk to you, Anita,” she says in a caring voice. As if she’s the grown up.\nI nod. “Go ahead, Ilona.” I know what she’s going to say.\nShe leans in, her narrow palm pressed against the plastic of the table between us. “How old are you, Anita?”\n“Sixty-eight.”\n“It shows.”\nWe stare at each other, not blinking, and under her gaze I feel every blemish and wrinkle pucker up, turn purple, leer.\n“I don’t mean to be cruel,” she says, “but you don’t have to look this way.”\n“I know.” If I change, will you be less embarrassed of being seen with me? “I’ll think about it.”\n“There’s nothing to think about,” she says with a beam of confidence only pretty teenage girls can muster, and starts flipping through her menu.\nI do the same, all the while wondering why am I not ashamed of my face? Instead, I cringe at the thought of my optimized heart and metal joints, of my eyes that can see so well because of lasers, of my new healthy lungs. I can only bear these artifices within me because my old skin is covering them up. I could not imagine separating from it. But the love, the love . . . my eyes skim over the lines in front of me, as I imagine what it would be like to have my daughter back, my granddaughter not ashamed.\nMy granddaughter looks up and frowns. She pulls out a handkerchief tucked in her wristband, spits in it, and rubs my cheek, as intrusive and unselfconscious as a parent with her child. I submit. She looks at the handkerchief, incredulous. “What’s that?”\nIt’s a green smudge. “Algae,” I say. “They grow everywhere.”\n“On your face?” She doesn’t bother to hide her disgust.\n“It’s even wetter up in the clouds,” I say. “They look like vegetable sheep from up there. You should—”\nShe interrupts. “Vegetable sheep?”\n“Big white and grey cushions—millions of tiny plants wedged together, all the same height. They grow high up in the mountains, where it’s cold. If one grows taller than the others, it dies of frostbite.” I’m not making sense, and I change the subject. “Anyway. How’re things at school?”\n“Boring.” She gives a little laugh. “I can’t wait until I’m out of there.”\n“Why do you think it’ll be better once you’re out?”\nShe jerks her shoulder and gives me a smoldering look. “Oh, don’t start. Just ’cause you’re depressed, doesn’t mean everyone else has to be too.”\n“Sorry,” I whisper. I am.\n“We’re ready to order,” she tells the waiter who’s been hovering nearby. After he departs, she gives me a cheerful smile. “You’ll feel better once you get your face fixed up.”\nBeauty is fleeting, I want to say, but think better of it. “It’s good to see you, sweetie. Everything will be okay.”\nAt night, I lie awake listening to the rain’s whisper outside, thinking of love. I believe it is my failure that my daughter would not talk to me, and my granddaughter treats me as a child. I wish I knew how to fix it, how to fit into the snug world of the people I care about. Instead, I leave them behind, on the ground, as my plane sputters and spits jets of dust into too-warm, moist air. I don’t just herd clouds, I make them on occasion. The dust is called ‘condensation nuclei’, but they’re just dust. Tiny grains lodging under my fingernails and making me cough, the grains that already cost me a pair of lungs. I don’t really mind, as long as they make clouds appear out of thin, oversaturated air. I wish I could show my granddaughter that, and perhaps she would love them as much as I do, and by extension love me. I almost weep with joy when the morning comes, grey, weeping along with me.\nAt the factory, I flash my badge at the security guard, who nods back—a sad little ritual we exchange for the past forty years. I don’t give him a second look—my gaze travels past the undulating membranes toward the airfield.\n“Wait,” he calls. “I have something for you.”\nI open the manila envelope he gives me, with a panicked strumming of the heart against its cage. This is it, I think. They are finally going to let me go.\n“Some girl dropped it off this morning,” the guard says.\nI shield the piece of paper with the envelope, and the raindrops splash and slide down the smooth yellow surface. It’s just some photographs. I look closer, and my frantic heart seizes up: it is a picture of the vegetable sheep—just like I remember them, white, snug, content. There’s a close up of one, and on the next frame there’s a bird’s eye view of them, scattering in groups and solitarily across the green mountains. I swallow hard.\n“A pretty girl,” the guard says. “Didn’t tell her name or anything, just that you’d know.”\n“That’s my granddaughter,” I say, and turn away, stuffing the pictures back into the envelope, to hide them from moisture.\nI wonder where she got them as I walk to my plane. There are none on the govnet, just like there is nothing there that would remind us that there is a world outside of our shrinking rainy continent. There are no kangaroos, Coliseum, Aegean Sea, or Sahara. Things she will never know about; yet, she found me the vegetable sheep. I am grateful, and surprised, and a bit sad that I have underestimated her.\nThe plane rises, and there are almost no clouds. I find a pocket of wet, warm air—I don’t need the sensors to tell me that, I can see the way it shimmers—and turn on my dust cannons on full blast. At first, there are only streams of grey refuse, but then, without warning, a thick fog condenses into white tufts, and soon there are enough of them to nudge gently with the jets of air, until they are compact and round. I pull the pictures out of the envelope and spread them across the seat next to me. I cannot wait to see her, to tell her how much those clouds trapped among the green mountains mean to me.\nI never get a chance. I call her as soon as I land, from the soaked airfield. She does not answer her phone, even though I know she never detaches it from her ear. I am starting to worry, but then my ear-piece buzzes.\n“Baby,” I say, “are you all right?”\nThere’s sobbing, and it’s not Ilona. “Anita?” Finally, in a halting, hoarse voice. It is my daughter.\n“Petra,” I whisper. “Are you all right?”\n“I’m fine. But Ilona’s missing.”\nI count breaths. The joy of hearing my daughter’s voice is dissolved in her tears, and I don’t know what to say.\n“Will you help me find her?”\n“Of course.”\n“Can you come over?”\nOf course I can. She lives too far to walk, and I grab the first velorickshaw who idles by the gates of the factory, waiting for the pilots and the engineers to leave for the day. I settle into the rickety, leaking cab, and think, trying to ignore the water splashing in my face with every turn of the rickshaw’s feet on the pedals.\nI think of what I can do—the friends to talk to, the old favors to call on. I’m not like Petra, who—I can feel it, I know—is sitting in her kitchen, crying, tearing her heart out imagining every pain, every violation that Ilona could’ve suffered. She’s always been too quick to grieve.\nShe left the door unlocked, and I find her in the kitchen, her shoulders heaving.\n“Petra.”\nShe flings herself into my arms, with a fierceness of one who missed comfort.\nI stroke her hair, dyed deep auburn. “Calm down. It’s not that bad. When did she disappear?”\n“She didn’t come home from school.”\n“Maybe she’s with some friends.” Even I know it’s a lie; another teenager might run off, but not dutiful Ilona, who took it on her thin shoulders to be the link between me and her mother, the only one who was young enough to not be burdened by old hurts.\nPetra doesn’t even bother to argue. “I called the police, and they said they’ll look into it. They don’t return my calls.”\nThis is bad. “I’ll call Jeremy,” I tell her. “Blow your nose and make me some tea.”\nShe nods, and fusses with the kettle. If she were younger, she would’ve blamed me for everything.\nI call Jeremy. He’s a cop and a good friend, and Petra hates him. But not today.\n“I need a favor,” I tell him. “My granddaughter’s missing.”\nHe doesn’t seem surprised. “Can’t help you,” he says, and lowers his voice. “This is Federal jurisdiction.”\n“BLIPs?” I see Petra flinch, and lower my voice. “What did the kid do?”\n“Downloading and distribution of copyrighted materials.”\nI think of the pictures in my plane. Vegetable sheep, so harmless. Who would’ve thought that the Bureau of Licensing and Intellectual Property would be interested in a sixteen-year-old kid? Unless she already has a record.\n“We made the arrest, but the BLIPs took her off our hands quickly.”\nI hang up, and look at Petra. She looks back, guilt shining through her tears like stars. I warned you, didn’t I?\nI get a hold of Maria. She is a high school friend, and thus our relationship combines a gradual distancing with an exaggerated sense of obligation. But even she cannot help me.\n“I’m so sorry,” she whispers into the phone. “I can’t do anything. The computer on which download has occurred has been tapped for a while. We were just waiting for something serious enough to occur.”\n“Why?”\n“Don’t know,” she hisses. “Sorry, got to go.”\nPetra is fiddling with her hair. “It’s my fault.”\nNo point in arguing—we both know she is right, but I’m not going to gloat. It was hard enough for me to lose her to the misguided rebellion that offered no action and no escape. She was only fourteen when the entertainment conglomerates first ran for presidency, and eighteen when they won. She still remembers when the information was not screened or regulated by the government, when there was no such thing as a govnet. Ilona doesn’t.\nPetra was not the one to ignore it, but she was not a fighter. Her anger manifested in small acts of disobedience, which gave little consolation and even less meaning. One can talk shit about the government all one wants, but in the end is trapped worse than those who are oblivious.\n“But what was I supposed to do?” Her voice gains a cracked quality. “My own mother was working for them.”\nSo your daughter pays for the sins of your mother. Only you are untouched. “What exactly did you do?”\nPetra tells me that she had her computer hacked, connected to the other net, not the govnet. She used it to read the news; she never knew that Ilona had any interest in using it, but didn’t make much of an effort to hide it, or to explain to her daughter the intricacies of the Declaration of Copyright. Of course the kid is going to see a picture and print it, never realizing that that constitutes intent to distribute, jail time mandatory. She had no way of knowing that everything is copyrighted in perpetuity, regardless of where it appears. Free net or not, it’s BLIP jurisdiction.\nI drink the lukewarm tea as Petra cries and talks, cries and talks. Her sobs and babbling create a soothing rhythm, and it is easier to think to it. I think of the Federal penitentiaries in the area, and I think of how many of them I have flown above. No reason not to do it again.\n“Tomorrow,” I tell Petra, “I’m going to do some reconnaissance flying.”\nShe stops sobbing. “Isn’t it dangerous?” Her eyes glitter, anxious. “I don’t want to lose you too.”\nYou threw me away years ago. What other loss are you afraid of? “It’s a government plane, baby, remember?”\n“They let you fly anywhere you want?”\n“As long as there are clouds.”\nShe stares at me, and I tell her of warm dry winters when clouds are hard to find, and there’s not enough moisture in the air to make them. I tell her of the quilt of the fallow fields and the green silk of the ocean, its foamy crests like tiny clouds. Of the tedious azure of the sky and the thrill of the hunt as I spot a white wisp of a nascent cloud, still unsure whether to come into being, its transparency both a promise and a threat. I chase them across the sky, over land and over sea, and whatever lies beneath is not my concern.\nI let the clouds lead me. It is neither faith nor superstition, but a voice of experience—as long as I follow the white fluffy shapes, they will lead me where I need to be. It may be a roundabout way, blown by winds and air currents, convection and condensation, but we will get there in the end.\nI follow them, but for the first time I let them be. My plane swoops down, closer and closer to the bejeweled patchwork of the ground, until I can discern tall grey cement and low greenery, and almost lose my way in the vapor rising from the oversaturated ground. I rise again to safety, but descend again, circling, looking. I disconnect the communication system and turn the scopes to the ground, and search it.\nI watch the yards of the penitentiaries, and I look for women. At the Austin Federal Penitentiary, I find a group of young girls, in identical orange jumpsuits, as they circle aimlessly through a grey cement yard, and I look for the familiar face. It is hard to see in the grey rain, even with the scope, until one of them tilts her head upwards and smiles.\nA day passes like that, and another one. It’s raining fine without me, leaving me free to look like a hawk. On the third day, I am denied entrance to the airfield.\nI think of making a dash—the guard would never catch up with me. Instead, I ask why, even though I know the answer. The security guard looks at me with pity in his eyes, and it belies the banality of his words—subversive element in the family, security risk, retirement age. They don’t even bother to pick one excuse; they lump them all together, without an appearance of respect.\n“I’m sorry,” he says in the end. “She was a real pretty girl.”\nI lean closer to the plastic of his booth, and he doesn’t flinch away. “Listen, Thomas,” I say. “I left some personal belongings in the cockpit. Think I can run in real quick and get them?” And add, to ease possible suspicion, “Or you can get them for me.”\nHe sighs and shifts in his narrow stool, his bulk sloshing from one side to the other. He peers at the grey rain, coming down in glassy sheets. “You go right ahead,” he says. “Just don’t dawdle.”\nI have no intention to. I cross the airfield in a quick walk, my boots sliding on the wet grass. Other pilots pay me no mind—they never do; I am too old to be looked at with any comfort. They don’t seem alarmed when I grab the prop and pull it, desperation tripling the weight of my frail body. The engine starts, its metal heart beating in a faster rhythm than mine, and the plane glides down the field. I catch up to it in a run and vault into the cabin, just as I hear someone call out, “Hey!”\nThe air is wet in my face, until I slam the door shut, and we’re off, spiraling, ascending on the warm currents, the clouds moving down to greet us, like sheep greeting their shepherd. I look at the clock—8 am. I have an hour to get there. I need forty-five minutes.\nThe girls are in the yard again. It is raining hard, and they wear yellow slickers, the hoods obscuring their faces. There are two female guards, watching from the cover of the tall wire fence; there are probably others.\nOne of the yellow hoods tilts back, and I see a pale face and dark hair, a small mouth opened in hope and wonder. She is the only one left standing as my plane drops into the yard, like a bird of prey. I land by the fence, and hope that the yard is long enough to stop.\nThere are gunshots, and the white panicked faces of the guards through the windshield. I turn the dust cannons on full blast, and they are lost in the grey cloud of searing particles. A small fist pounds on the door, and I swing it open. Ilona clambers into the seat next to me and the plane turns around. There’s not enough space for a proper takeoff and I gun it, taking off the top of the fence.\nIlona gasps next to me, and then regains her usual composure. “Did you like my pictures?”\n“Yes. Thank you very much.”\n“I thought you would.”\nI point at the approaching tight cluster of white clouds, and my granddaughter laughs. “Just like in the pictures.”\nI aim the plane into the center of it, and cut the engine. We fall, weightless, surrounded by the celestial vegetable sheep. One of them takes us into its soft arms and smiles, cradling the plane.\nThe engines rev back to life, and Ilona lets out a long sigh. “I could fall like this forever.”\nI nod. She is strong and she will learn to fly.\nEkaterina Sedia resides in the Pinelands of New Jersey. Her critically-acclaimed and\naward-nominated novels, The Secret History of Moscow, The Alchemy of Stone, The House of Discarded Dreams, and Heart of Iron, were published by Prime Books. Her short stories have sold to Analog, Baen's Universe, Subterranean, and Clarkesworld, as well as numerous anthologies, including Haunted Legends and Magic in the Mirrorstone. She is also the editor of the anthologies Paper Cities (World Fantasy Award winner), Running with the Pack, and Bewere the Night, as well as forthcoming Bloody Fabulous\nand Wilful Impropriety. Her short-story collection, Moscow But Dreaming, will be released by Prime Books in December 2012.", "source": "https://clarkesworldmagazine.com/sedia_03_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Herding Vegetable Sheep by Ekaterina Sedia"}