{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "A Que; Emily Jin; Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Q47aAKcQ8j7OCAlpH3mlkeA3iVc=", "id": null, "license": null, "comments": "", "raw_text": "22990 words, novella  Farewell, Doraemon  I escaped the city and returned home on a winter’s day. A vast gloomy sky, whitish-gray as the belly of a dead fish, stretched out in front of me. Sparrows flapped their wings as they hopped on and off the dead branches trembling in the ferocious wind, unable to perch.  I shivered and tucked my neck into my collar, pulling my suitcase after me as I trudged along the road to the village of my distant memories.  Father came to pick me up and took the suitcase from my hand. We remained silent for the duration of the walk home. My aunt had taken me away from the village after I graduated from elementary school. The only other time I came back to visit, I was in a hurry as well. For all these years, silence had been the most effective form of communication between my father and me. Yet, from the way he stood up taller when he greeted other villagers on the way, I could tell he was happy. Everyone’s eyes glistened with awe as they looked me up and down. “Is it really Zhouzhou? It’s been years since he last came back. Look how he’s grown! I heard he’s in an office in Beijing now, doing little work for big money. Now that’s what I call success!”  Father immediately objected, “It’s not like he just sits around all day! They work him hard over there.”  It was obvious how much my quiet father had been praising me to the other villagers. I wondered if he would still feel as proud if he knew that I only came back because I fell apart after I caught my girlfriend cheating, lost my job since I was sitting around all day listlessly, broke my lease, and deleted everyone’s number from my phone.  Looking at these weatherworn faces, I was struck simultaneously by a sense of familiarity and estrangement. I grew up amongst those people’s laughter and curses, complaints and whispers. I remembered all of their faces, but I could not recall their names, as if a glass wall battered by time was stuck in between my past and my present. All I could do was smile and nod.  We arrived at home. A two-story house stood in place of the bungalow from my memories, but this house wasn’t exactly new, either. The plaster was cracked and peeled from years of frigid wind. A concrete platform spread out before the house, its blue-gray color a reflection of the gloomy sky. My parents laid out the sun-dried millet and cotton here. In summers, they moved the dinner table out here and dined in the setting sun, and Father would sip his habitual cup of huangjiu.  In the kitchen, right across from the concrete platform, Mother had cooked dinner. A sooty apron wrapped around her body, she rubbed her hands together as she gazed at me. I found myself choking back tears. I had been away from her for way too long.  “You’re back,” she exclaimed. “Come, let’s eat first.”  Father did not speak during the meal, quietly sipping his wine in between mouthfuls of food. Mother kept the conversation flowing by filling me in on all the little things that had happened over the last few years: my uncle’s son became a street thug after he retired from the army, then was sent to prison after stealing a necklace; our neighbors, although older than most parents, were blessed with a baby girl, but she turned out to be mentally retarded—at the age of five, she still spent her days sitting by the door, grinning and drooling at every passerby; Lao Tang married off his daughter at last, but the groom, dissatisfied with the amount of “tea money” offered by the father of the bride, flipped the table during their wedding . . .  “Lao Tang?” I laid down my chopsticks and looked up at Mother. “Is that the family that lives by the entrance to the village?”  “Yes, that’s the one—I thought you’d forgotten. Do you still remember how you and Lao Tang’s daughter used to play together?”  I chewed my food and said nothing.  “She’s been married for three years or so, although her man is nothing but trouble. He gets wasted every single day—and after he’s drunk, he doesn’t just yell at her, but also smashes things. They’ve already replaced their TV several times. A few days ago he kicked his motorcycle and broke it . . . thousands of yuan gone right there.” Mother sighed as she poked the stove fire.  All of a sudden, my mother’s voice seemed to fade away, and I couldn’t focus on her venting anymore. I gobbled down the rest of the food and stood up to go wash the dishes, but Mother shooed me away.  Night arrived early in winter. By six, the village was already shrouded in darkness. After a day spent transferring between planes, trains, buses, and even tractors to get back here from Beijing, the exhaustion made me crawl into bed early.  I found myself dangling right above a river, a whirlpool under my feet. The entire distorted world was crashing right down into the river, quickly swallowed by the swirling water. Inch by inch, I was sinking too, and no matter how much I fought and struggled, I couldn’t free myself. All I could do was watch the whirlpool consume my legs and crush them; then came my waist, my stomach, my chest, and my head at last . . .  I woke up with a start. I stared blankly into the darkness, my chest heaving heavily. This nightmare had haunted me at midnight for years. It was an indelible scar left by my home village.  I reached for my phone and saw that it was only twelve o’clock. The rising night wind beat against the window as I tossed and turned in my bed. Unable to fall back to sleep, I decided to get up.  I turned on the lights. A beam from the filament lamp ripped through the darkness, illuminating a dusty wooden chest in the corner of the room. I remembered Mother telling me that she had kept all of my childhood things in that chest, and curiosity urged me to peek inside.  To my disappointment, there were no toys, no notebooks, no letters. The chest contained only a few textbooks from elementary school and a weird-looking gadget. It had a round metal top, seamlessly attached to a crystal cube. I couldn’t remember how it had ended up in my hands—probably some trash that I picked up as a child—so I tossed it aside. Nothing else in the chest appeared interesting. However, just when I was about to close the lid, I noticed a few VCDs hidden beneath those old textbooks. The discs had the same label, written in fading, neat characters: Doraemon.  The night was still young. The laptop I carried back with me had a built-in CD drive, so I powered it up and inserted one of those VCDs after wiping off the dust.  “It’s all the same every day, but sometimes dreams may come our way, as long as there is Doraemon, happiness will always stay . . . ”  I nearly jumped at the familiar tune that reverberated through the cramped, silent room. I fumbled to lower the volume. The images on screen were blurry and flecked with noise, and flashing blue stripes interrupted the scenes once in a while as a result of the scratched CD surface.  The robot cat opened its mouth, and another robot cat was sitting on its tongue; that one opened its mouth as well, and there was another inside . . .  I watched Nobi and his robot cat dance around in those long-forgotten scenes as I leaned against my headboard with the laptop on my blanket. After a while, the lovely Shizuka joined them as well. With limited storage capacity, a single VCD could only hold five episodes—about thirty minutes total. After the episodes ran out, the spinning CD drive came to a halt. The screen flashed bright blue. I felt my muddled head clearing up slowly in the cool night air.  Doraemon. Doraemon. Doraemon.  Those four syllables made up the magic key to my locked memories.  My childhood was utterly uninteresting until Doraemon came along.  In many people’s memories—especially memories about living in the countryside—childhood was filled with fun. They never had to worry about anything. They wandered through the fiery sunlight of summertime, caught crayfish at the lake, played marbles by the door, and swam in the river . . . the memories often brought a wistful smile. But in reality, back then, not a single child actually enjoyed that kind of life. To them, childhood was as sluggish and boring as a snail that crawled along under a scorching sun, and every summer never seemed to end. Everyone wished to grow up as fast as possible and escape from that sticky mess of a childhood, just like how adults longed to escape from the emptiness and meaninglessness of their routines.  Particularly me.  As a kid, I never fit in. Be it tree climbing or swimming, melon stealing or fishing—none of these activities interested me. When other boys chased after each other with long bamboo sticks and played games of war, I always strolled alone, passing by the golden canola flowers, brushing past snow-white cotton blossoms, and weaving my way through rippling fields of wheat.  Sometimes I would run into my parents working in the fields as I roamed about. Alarmed by this pointless—even somewhat creepy—habit of mine, they ordered me to go back home and play with the neighbors’ children. I agreed, but nonetheless continued with my meanders. Perhaps I wandered even farther, out of their view.  My wanderings came to a stop when Yang Fangwei’s family bought a VCD player. Yang Fangwei’s father, who everyone in the village called Cripple Yang, owned a brewery. He was notorious for making a fortune from diluting the liquor with water. After he got wealthier, he bought the VCD player for his son. Back then, only a few families in the village could afford to own a TV. And even if someone owned one, it was the old-fashioned kind that had two knobs on the right upper corner. Since the signal here was so weak, the TVs could only receive a few local channels. But the Yang family had a huge color TV that went with the VCD player. With the help of some occasional movie discs rented from the nearby town, that VCD player was easily the most popular gadget in our entire village.  Every evening, villagers of every age gathered in the Yang family’s yard and demanded a movie. At first, Cripple Yang ignored everyone, but the raucous would-be audience seemed to have an inexhaustible supply of persistence, sometimes hanging around until midnight. Due to their noise, Cripple Yang couldn’t even sleep with his wife, so he finally gave in and set the TV and the VCD player up outside to play movies, swearing loudly as he went.  The crowd filled the yard. Everyone brought their own stool and focused all of their attention on the TV screen. Despite the heat and the swarming mosquitos, people stayed until the very end of the movie.  The Yang household was particularly packed on Sundays, because everyone knew that Cripple Yang delivered his liquor to town every Sunday, and he would always return with a new batch of VCDs. Once, his father brought Yang Fangwei with him to town. After browsing through the new arrivals in the VCD store, he chose ten VCDs with a round-shaped robot cat printed on the cover.  That Sunday, instead of the familiar Shaolin Kung Fu monks, the TV showed scenes from a vibrant cartoon. People started to complain: “Lao Yang, what kind of show is this? Cartoons are boring. Play something else!”  “Who put you in charge? Each disc cost me thirty fen to rent. Did you pay for that?” said Cripple Yang.  The villagers booed. “Don’t be so petty, boss! You make more than thirty fen with the water you mix into a half-kilogram of your booze. Play another movie!”  “Nah, Weiwei rented this one. It’s his favorite.”  So everyone had to watch the cartoon. But the childishly exaggerated scenes couldn’t hold their interest. After a while, the adults began to file out.  But the children stayed, fascinated by the show.  I sat among the children, deeply engrossed in the world of this magical robot cat. It had come to Nobi all the way from the future to stay by his side. Its pocket seemed to never run out of miraculous treasures. It could take Nobi through heaven and earth, through time and space. Most importantly, it was there to cheer Nobi on when he befriended the beautiful Shizuka. Lost in the cartoon, I didn’t even notice the mosquito bites on my leg.  After we went through two more VCDs, Yang Fangwei stood up: “Still here? You’ve seen ten episodes already! Go home, and come back tomorrow.”  “Same time?” I asked.  “You can show up earlier tomorrow. It will be harder for you lot to get home if it’s too late, anyways.” He turned his head and acknowledged someone on my left. “Lulu, you live farther out, don’t you? Be careful on the way back.”  Until then, I hadn’t even noticed the girl sitting next to me. With the TV switched off, I couldn’t make out her face, but I could see her hair, tied back into a ponytail, swaying in the darkness.  We stood up to go home, and soon everyone parted ways. In the summer, the fields were never too dark, because starlight and fireflies illuminated the path. The road I took passed by a vast paddy field. I was very familiar with that road, thanks to all my laborious explorations of the village. However, as I strolled along, I realized that someone was following me—that girl. A firefly flitted past her shoulder in the enveloping darkness, casting a glow against her right cheek for a brief second, revealing her pale face and glistening black eyes. But when I was about to take a closer look, the firefly took off.  She halted as well.  I suddenly understood her reason for following me. The paddy field was right in the center of a graveyard, where all the village’s dead were buried. The desolate night wind whistled among the tombs. On the other side of the burial ground was a flowing river; the waves clip-clopped as if someone was treading on the water’s surface.  The girl was scared to walk alone. That was why she had kept close to me, carefully maintaining a distance of five or six meters.  So I slowed down. That was the summer after fifth grade. We were short, and our steps were small; it would take ten minutes for us to cross this paddy field. I remembered the opening song from the cartoon and I hummed softly: “It’s all the same every day, but sometimes dreams may come our way . . . ”  The stars brightened and a gentle wind rose up, flowing around us. My steps felt light and I was fearless, even when we passed by the grotesque house standing at the border between the graveyard and the paddy field.  Out of the paddy field we went, and straight into the village. Half a mile away, dozens of windows glowed warmly.  “Thank you.”  I thought I heard her speak, but I wasn’t sure. Those two words were as soft as the ripples left by a feather landing on placid water. The wind grew heavier. I turned and saw the girl turning onto a small street, her head kept low. A house stood a little ways down that street. I remembered that whenever Father passed by, he would call out a greeting to Lao Tang—the village’s notorious alcoholic and gambler.  She entered the house.  I never saw her face that night.  I leaped off my bed and rummaged through the chest. There were only books and VCD discs; that photo was missing.  I rushed downstairs and woke Mother. She sat up, sleepy-eyed, and looked at me with confusion.  “Mom, where’s my photo?”  “Photo . . . what photo?”  “That class photo from my elementary school graduation. I put it away with the textbooks. Where did you leave it?”  Mother squinted against the bright lamp. After a while, she said: “I can’t remember. That was more than ten years ago. Why do you need it?”  Belatedly, I realized that I had impulsively woken my mother in the middle of the night. I shook my head and walked back to my room. Outside the window, the night was as thick and impenetrable as iron, and the wind sliced through that iron with a terrifying squeal. Just when I was about to close the lid of the chest, a sudden idea struck me. I took out the worn literature textbook and tried bending it; sure enough, I felt something hard tucked between the soft pages. I flipped the book open, and a photo lay right there between two pages.  Hidden in the book for all these years, the photo had not faded. The paper, however, felt brittle and rough against my fingers.  I scanned the image. Three teachers sat together in the first row, with a sullen old woman in the middle. Her eyes were even grimmer than her expression. They seemed to be staring straight at me, piercing through the dozen-odd years between us.  My eyes brushed past her face and found myself in the corner. Beside me was a girl. I finally saw her face—the delicate features resembled the strokes of an ink-wash painting. Her hair was pulled back into a ponytail and her lips were curled up at the corners. I couldn’t tell if it was a smile, or if the photo was simply distorted. Behind her was a poplar forest; her hair danced among the falling leaves, drifting in the wind.  Tang Lu . . . I whispered her name before a tide of memory overwhelmed me.  That torrid summer, my meaningless wanderings came to an end. Every day, after breakfast, I went over to Yang Fangwei’s house and hung out there with the other kids. He was a good sport—whenever we ran out of VCDs to watch, he would ask his father to bring more back from the town.  The Yang family was quite well off. They were the first in the village to install a tile floor. In the sizzling heat of summer, sitting on the cool floor was delightful.  Whoever came to the Yang house to buy liquor marveled at the scene: a bunch of otherwise rowdy children sitting quietly in Yang Fangwei’s yard, gathered around a TV.  One day, a skinny man came to the yard. When he saw us, he raised his voice at someone sitting in the corner. “Lulu, go get me a half-kilogram of liquor.”  Tang Lu stood up and took the empty bottle from him. She walked toward the Yang family’s liquor cellar with her head lowered.  I needed to go to the bathroom, so I followed her. I saw Tang Lu walk to Cripple Yang and heard her speak in a pleading voice, “Uncle Yang, I would like to get a half-kilogram of liquor for my dad.”  Cripple Yang glared at her, a cigarette sticking out between his teeth. “Did Lao Tang give you money?”  Tang Lu shook her head.  “Heh, the man’s tab is so overdue that he’s too embarrassed to see my face, so he sends his little girl here for more. Go tell your dad, I’m not running a charity here, and he needs to pay up.”  Tang Lu didn’t budge. She lowered her head and choked out, “My dad is going to beat me if I don’t return with his liquor.”  “What a monster! Karma is going to catch up with him one day.” Cripple Yang stomped on the cigarette butt. “Tell your dad, this is the last time!”  Afraid of missing out on the cartoon, I rushed back to the room after going to the bathroom. All the children were focused on the TV. Lao Tang sat to the side, baring his blackened teeth as he spouted off. “What’s the fun in this cartoon? I heard Cripple Yang’s got some foreign stuff, but he watches it all by himself, in secret. Eh, Yang Fangwei, do you know where your dad hides those discs? Pull them out and play them instead. I’ll show you kiddies what real women look like. They are much better than this cartoon!”  Yang Fangwei frowned and ignored him. Everyone else looked disgusted as well, but Lao Tang blabbered on, careless of the frigid reception he was getting.  Thankfully Tang Lu came in soon, and handed Lao Tang the bottle. Lao Tang grinned, took the bottle, and went away. Tang Lu went back to her corner, but everyone around her scooted away immediately, leaving an awkward gap.  She hung her head in shame, and didn’t look up for a very long time. I caught a glimpse of a teardrop gliding down her cheek, and it soon disappeared into her cotton dress. It wasn’t until ten minutes later, when Nobi let out a dramatic scream because of Gian and Suneo’s teasing, that she finally looked up. Her face was still lined with tear trails, but she started to giggle at Nobi’s ordeal.  Her expression held a beauty mixed with melancholy. After that, whenever I saw flowers in the rain, I couldn’t help but be reminded of Tang Lu’s face, caught between tears and laughter.  “How many episodes are there of Doraemon?” Wang Xiaolei, who had a runny nose, piped up. “This cartoon is so great—what are we going to do if we finish it?”  Yang Fangwei made an assuring gesture. “Don’t worry. I saw a huge pile of these discs when I went to the rental shop. The owner told me there are hundreds, maybe thousands, of episodes, and the creators keep on drawing more. This cartoon will never end!”  Yang Fangwei was in my class, but he was taller than the rest of us. When he talked, he had a charisma that was rare among the village people. Everyone nodded as he spoke. After all, since he was responsible for the cartoon showing, he was basically our leader.  This cartoon will never end.  To me, his words were an enchanting spell. In this world, the most vibrant flowers eventually wilted and the most stunning beauty faded away. Nothing lasted forever. No matter how much we loved people and things, time eventually took them all away.  But Doraemon was different. Yang Fangwei said that Doraemon would never end, just like how the robot cat would always stay by Nobi’s side. I almost burst into tears.  “Does that mean we can watch on until we’re as old as our grandparents?” I blurted out.  Another voice joined me. “I want to always keep on watching.”  The speaker and I looked at each other. It was Tang Lu, the girl who had followed me home yesterday. Her pale cheeks flushed pink. Her features were so delicate that I was afraid to hold my gaze. I lowered my eyes.  “Why are you turning so red?” Yang Fangwei looked at me, confused. He turned to the girl and said, “Don’t worry, Lulu. You’ll always be able to watch Doraemon at my place.”  But Yang Fangwei didn’t keep his promise. Soon after, Cripple Yang bought him a video game console. This was the most top-notch gadget ever—after connecting it to the TV and inserting a game cartridge, you could control Bill Rizer with a joystick and go on adventures in a 2D world. All the boys were enthralled by this new toy. Yang Fangwei always took one of the controllers, and the other boys took turns with the other one. Even the ones who didn’t get a chance to touch the controller enjoyed watching the others play.  All the kids were thrilled except for Tang Lu and me. Yang Fangwei had returned the rented Doraemon VCDs and exchanged them for bundles of game cartridges. For a few minutes, we stood behind the children who were excitedly peering at the screen, then left together in silence.  I walked home with Tang Lu following me like usual. But this time, when we passed by her house, she lingered and stayed behind me.  “Why aren’t you going home?” I asked.  She pointed at her house and whispered: “My dad . . . ”  I realized what she meant. I sighed.  We stood together. Wind rose and brushed against her bangs. It was a gloomy afternoon, and neither of us had anywhere to go.  Mired in those memories, I fell into a deep slumber. It was bright out by the time I opened my eyes again. With no central heating, wintertime in my home village was always cold and damp. I curled up under the blanket, unwilling to get up. But after my mother came to the room to call on me a few times, I had no choice but to grudgingly inch out of bed.  It was almost Spring Festival, and our family was about to do our regular Chinese New Year shopping. Usually, my father would catch a ride on someone’s motor tricycle—one of those with a large cargo bed in the back—to go shopping in town. But his legs, weakened and stiff with old age, slipped, and he almost fell off the back of the tricycle. I stopped him and offered to go in his stead.  Wordlessly, my father went into the house and brought out a coat.  “It’s windy. You must cover up your head and hands when you’re on the tricycle,” he said.  The coat was old and ragged. Even holding it made me turn my nose, and I was reluctant to wrap it over my hands at first. Yet, once the tricycle took off, the blistering wind immediately turned into daggers that slashed across every inch of exposed skin. I pulled up the hood of my down jacket at once, turned around to keep my back toward the wind, and finally folded my hands in the sleeves of that old coat.  The tricycle bounced along the rocky road, puttering past the scraggly poplar trees with their dangling leafless branches. The village in wintertime was veiled in gray—gray sky, gray fields, gray roads, and houses—as if the desolate season had washed out every vibrant shade.  The village was so far from the town that getting all the holiday goods for New Year’s was a chore for the villagers. Usually, a tricycle would take multiple families on each trip and ask each family to pay ten yuan. The tricycle detoured around the village for a while, stopping at different houses until it was packed with five passengers, all squatting on the tricycle’s cargo bed.  One of the young men had a familiar face. As I wondered who he was, he spoke to me first. “You’re Hu Zhou, right?”  His face quickly merged with the memory of the face of that charismatic boy. I smiled. “Long time no see, Yang Fangwei.”  “It has been a while! I haven’t seen you since we graduated from elementary school.”  It was true that we had lost touch after I moved to Shanxi with my aunt. But his comment wasn’t exactly the truth, either. I had been back once before. The village was so small that we couldn’t possibly have avoided each other on that visit. But our relationship was a little awkward, such that though we had spotted each other from afar, we didn’t wave or say hi. Now, we were both stuck on the back of a tricycle, huddled up in our coats. Not talking would be awkward, but even with the ice broken, neither of us knew how to continue the conversation.  The freezing wind howled in our ears. After a few minutes of silence, I asked, “Where do you work now?”  “I used to teach in Chongqing, but as you know”—he grinned at me, though there was some bitterness behind his pale, frozen-lipped smile—“teaching doesn’t pay much. So, I probably won’t be going back after New Year.”  “Where would you go then?”  “Perhaps Shenzhen. I’ll look for a job there.”  “Shenzhen is such a stressful place, though.”  He gave me a look. “How is that different from anywhere else?”  I nodded. “Yeah. Can’t get away from the rat race.”  “I can’t hold a candle to you, though.” He smiled again. “I heard that you live in Beijing. Don’t you draw cartoons or something?”  I actually make comic books—I wanted to explain, but then realized the futility of it. Instead, I only gave a nod.  “My wife’s giving birth soon. With another mouth to feed, I need to make more money. My dad’s brewery is in so much debt . . . ” His shoulders sagged forward. “Your dad said that you make ten thousand yuan a month. That’s like my salary for five months. You see, you’re living while I’m just enduring. You’re educated—that’s the difference, you know?”  “Everyone endures. I’m not doing so well, either.”  He obviously didn’t believe me. He smiled again and said nothing further.  For the rest of the trip, we remained silent. The tricycle whizzed through the cold wind and more withered trees zoomed past us. Gradually, the lone houses that we occasionally passed by turned into busy streets, crowds of pedestrians, and endless shops overflowing with goods.  “We’re here. Go do your shopping while I go get some medicine.” Uncle Zhao, who had pedaled us here, yelled with a cigarette in his mouth, “Let’s meet back here at twelve.”  Our legs were numb from all the squatting, and we had to shake them out after getting off the tricycle. Yang Fangwei stomped his feet while he smoked. He finished a cigarette in a few puffs, crushed the butt with his heel and started to leave. I called his name.  “Do you know . . . how Tang Lu is doing?”  He halted and turned around to look at me.  A sudden pang of embarrassment urged me to explain myself, “I heard from my mom that she isn’t doing so well.”  Yang Fangwei’s hand reflexively reached for another cigarette. He finished half of it in one long drag.  “No, she isn’t doing well.” His expression was hidden behind a thin veil of smoke. “She’s doing terribly.”  Without Doraemon, I resumed my old habits of wandering aimlessly. However, there was one small difference—Tang Lu followed me around through the rest of that summer.  We weaved through the fields, past the budding cotton flowers, and between the crisscrossing village roads. When adults saw us together, they teased us. “Zhouzhou, did you get a sidekick?” Whenever this happened, I strode past them haughtily, my head held high; Tang Lu, on the other hand, always blushed and lowered her head, then sheepishly ran to catch up with me.  During those long walks, I told Tang Lu all the secrets that I had discovered about the village: Yang Fangwei’s father was crippled because someone had beaten him up for watering down the liquor; Zhao Laogui, who lived in the back of the village, would surreptitiously lead other people’s cows away and hide them in the fields during the night, then take them back the next morning to receive ten yuan from each duped (but grateful) owner.  Tang Lu was enchanted by my stories. In her eyes, the familiar village had suddenly taken on a new aspect.  “You know so many secrets,” she said.  The sparkle in her eyes made me slap my chest and exclaim, “These secrets are nothing. There’s a bigger mystery that I haven’t told you yet!”  I took her to the river, the lifeline of our village. I was told it was a secondary tributary of the Yangtze River, and we relied on it heavily for irrigation. It flowed through the paddy fields and curled around the graveyard. There were many terrifying legends about the section of the river next to the tombs. Wang Sansha, who lived next door to me, swore that he once heard a strange buzzing noise coming from underground when he passed by the river at night.  “I couldn’t tell if it was just the river, or if a corpse was turning in its coffin . . . ” He sniffled, his voice eerie as he told the story.  There were many more ghost stories about that part of the river: a water buffalo’s head suddenly disappeared while it was grazing by the riverbank, and the blood sprayed over ten meters on the ground; before the founding of the People’s Republic, someone fell into the river and returned more than a decade later, looking exactly the same as the day he vanished . . . Adults used these ghost stories to stop us from straying too far, but I never believed in them. Tang Lu never did, either, although the stories still frightened her a little bit.  We trotted gingerly along the river, passing one grave after another on our left. Tang Lu followed close behind, shivering and whispering apologies to all of the tombstones.  We reached a secluded spot along the riverbank, hidden behind two neglected graves. A crooked tree by the river leaned over the surface, almost parallel with the water. I steadied myself by holding onto the trunk, then pointed at the river and asked: “Do you see anything strange about the water?”  After observing the water for a while, Tang Lu shook her head, still shivering.  “Keep your eyes on this.” I picked up a twig from the ground and tossed it to the middle of the river. The twig drifted along the current, but just as it was about to reach me, it sank abruptly without making a sound, as if something beneath the surface had pulled it in.  “Hmm?” Tang Lu was stunned. She picked up another twig and tried to repeat the experiment, but the result was the same every time—no matter how smoothly the twig floated along the river, it always sank as soon as it entered a certain part of the surface.  “Not only twigs, but also foam boards, a backpack, balls . . . I’ve tried all of them already. See, I told you this was the biggest mystery of the village!”  “How did you discover this?”  “A while ago I made a small boat out of wood and let it float down the river, while I followed along on shore. I wanted to see if it would eventually reach the ocean, but as soon as we got here, it sank all at once.”  “Have you told anyone else?” Tang Lu lifted her chin as she spoke, the twilight painting her visage a striking shade of orange.  I shook my head. “I told my dad and tried to take him here, but he slapped me instead. Now I’ve only told you. This is a secret between you and me—don’t tell anyone else!”  “I won’t!” Tang Lu raised her hand solemnly to give an oath. Then she asked, “But do you know why things sink when they reach there?”  I shook my head.  Tang Lu dropped her gaze to the river, and looked into my eyes again. “I think this might be Doraemon’s pocket that can hold everything in the world. Maybe there is a robot cat hiding in the river!”  She looked so adorable that a mischievousness rose in my heart. I lowered my voice. “Maybe there are dead people hiding in the river instead. Remember what Wang Sansha said? They’ll drag whoever is on the surface down with them!”  Like a terrified bunny, Tang Lu grasped my sleeve, and I could tell that she was on the verge of tears. I felt guilty about my prank. We walked back home along the river, through the graveyard, and back to the paddy field, with Tang Lu still clinging to my arm. The setting sun hung low over the horizon, casting a golden gleam all over the village. The river shimmered.  Just as we were about to exit the paddy field, I heard an unexpected squeak. The door to the lone house between the tombs and the paddy field opened, and a gloomy looking old woman stepped out onto the doorstep, staring right at us. Her face was covered in wrinkles and age spots. Although she looked about fifty years old, her eyes were icicles frozen for thousands of years. A momentary glance at her eyes was enough to chill my whole body.  I fled in the direction of home, dragging Tang Lu with me, but I could still feel the chill running down my spine.  I have seen her eyes in a million nightmares since that day.  It was half past eleven by the time I finished my New Year shopping. The wind was uncannily fierce. I dropped the packages at my feet, curled up, and stared into the dead gray sky.  Uncle Zhao plodded out of the pharmacy and tossed a few boxes of medicine into the tricycle’s cargo bed, swearing loudly. I skimmed casually through them, and saw that they were all DMARDs and enteric tablets. “Uncle Zhao, are these for the elders in your family?” I asked.  “Blargh! Not for my family! It’s Chen, that old bastard. She begs me to buy her medicine all the time.” Uncle Zhao lit a cigarette and took a deep drag, then blew out fumes of white smoke from his mouth and nostrils.  “Chen?” My pulse quickened.  Uncle Zhao took another puff. “It’s Chen, the teacher. She taught you back in elementary school, didn’t she?”  I said nothing. The pair of eyes from my nightmare reappeared before me, giving me a chill.  Everyone was back by noon. The tricycle’s motor sputtered as it wound its way back. As we reached the entrance to the village, Uncle Zhao took a detour around the paddy field. A carpet of withered yellow grass spread across the field, the dry blades shivering in the blistering wind. Graves littered the land, mound after mound, extending to the horizon like a stretch of hills. A few of them remained neatly preserved, embellished by tombstones, but most of them were neglected. Among the clumps of rampant weeds, those graves looked utterly abandoned.  Between the cemetery and the paddy field, that house still stood alone. It looked even more worn down than in my memories. The red brick walls were so stained that they were now a muddy yellow. Parts of the roof were covered in hay where the tiles had gone missing. I couldn’t even imagine how one could survive a harsh winter in a house like this.  Uncle Zhao pulled over to the side of the road. Without getting off the tricycle, he yelled “Medicine’s here!” at the house, dropped the boxes from the pharmacy at the front door, and drove on.  “That’s it?” I asked, confused by the abrupt departure.  Uncle Zhao didn’t even look back. He stomped hard on the rusty clutch. “That house is unlucky. What else do you want me to do? Go in? You know nothing. She lives all by herself, right next to this graveyard, and no one knows what she’s up to. A while ago, a cigarette factory owner from the county wanted to buy this piece of land and make it into a family burial ground. He offered her over a hundred thousand—think about how many people would kill for that price!—but Chen wouldn’t hear it. When the buyer came to visit her, she refused to even let him in the door!—Hey, what are you doing?”  I had hopped off the cargo bed. I shouted at Uncle Zhao to deliver my purchases home, then I turned around and walked back toward the dilapidated house. The hay sheltering the roof flapped noisily in the wind, but there was no sound of any activity from within. It seemed like the inside of the house was even more devoid of signs of habitation than its exterior.  I picked up the boxes of medicine and called out. No one responded, so I pushed on the worm-rotten wooden doors. The loud squeak set my teeth on edge. I went in. To my surprise, even though the room was dark and sparsely furnished, all the simple furniture was kept spotless and neat. In the very back of the room, an old woman lay on a bed. With the blanket pulled all the way up to her chin, I could just make out her gray hair.  She stirred from a light sleep, then cast her gaze on me. She spoke before I could open my mouth, her face an amorphous blur in the murky light.  “Hu Zhou, is it really you?” she said. “My eyesight has worsened—come closer. You’ve grown so much.”  I started to tremble. The medicine boxes fell from my hands and landed with a thud.  I once resented this woman so much that I had imagined a thousand times how to seek revenge. I had come inside to deliver the medicines to her in order to witness for myself how terrible her life had become. Yet, when she lay in front of me, old, weary, and vulnerable—when I saw how time had relentlessly destroyed her—all I felt was a sense of absurdity and helplessness.  She struggled to sit up and smiled at me.  “You still remember me?” I picked up the boxes of medicine and placed them on her bedside table. She glanced over at them, but quickly turned her gaze back to my face.  “How could I forget you? Out of all my students, you and Tang Lu have impressed me the most. Besides, you are the only one to ever discover my secret.”  “Secret?” I was taken by surprise at first, but then I realized what she was referring to. I tapped the wooden floor with my feet. “You mean what’s down there?”  She didn’t respond. She fell back into the sheets again, wheezing heavily, as if those few simple words had drained all the energy from her body. The room was too dim for me to see her expressions clearly. Wind gushed in from the cracks in the window, nipping at her wispy, tangled hair.  My elementary school was built right next to the entrance to our village. It used to be a bustling place: students came from several nearby villages; every grade level consisted of over a hundred people, distributed into three or four classes. However, the year I entered sixth grade, it suddenly became popular for everyone to seek their fortune in Guangdong Province. Adults who labored in the workshops could earn up to a hundred and twenty yuan a day, and even children who discreetly sewed garments behind closed doors could make at least thirty. This was much more effective as a way to make a living than trying to harvest rice from the fields. Some factory owners from Guangzhou even sent buses to our village just to bring people over to work, and every day entire families boarded the buses, lured by dreams of riches. Bus by bus, our village gradually emptied out.  Back then, one teacher from the elementary school would always stand on guard by the village’s entrance, attempting to stop the adults who tried to bring their children along on the gold digging journey.  “If you want to go, you can go, but please leave your children here!” she said. “The children need to study. Education is the only way out for them! How will they make their way in the world without schooling?”  Annoyed, the adults would push her out of their way. But she would stubbornly hold on to their sleeves. “Don’t take the children away. They are the future. They have to stay in school.”  “How will your books teach them to make money?” The adults would throw this question in her face. She had no answer for it.  The adults pried their sleeves from her fingers and boarded the bus, pulling their children behind. The children kept their heads down, unable to look their teacher in the eye.  After the interminable summer break, in roughly two months’ time, the number of students in the sixth grade dropped from more than one hundred to thirty-odd. A lot of the teachers were gone, too. So, what used to be three different classes were merged into one, and three remaining teachers were put in charge.  Our politics teacher was Mr. Ding, an old man who always rushed into the classroom after his farm duties, read aloud the assigned passages in the textbook in front of us, and then hurried back to plow his fields; our literature teacher was a young man who frequently became so captivated by his card games that he forgot to come to class, and sometimes, he would even drop the textbook and run out during class when friends swung by to invite him to join the teahouse parties.  All the other subjects were taught by a woman surnamed Chen. Around fifty years of age, she lived alone. Allegedly, she was the one who had patrolled the village entrance and tried to stop those bus boarders.  A chill seized my heart the moment I saw Ms. Chen—I could never forget those cold, piercing eyes of hers from that time during summer break, when we had stumbled by her house next to the graveyard.  Luckily, my fear didn’t persist for too long, because I saw Tang Lu. She and I had been in separate classes before, when there were many more students, but we were now together in the same merged class.  That was when I found out that this girl, despite the timid and lonesome look that she exuded all the time, had always been a top-ranked student. The only student who had better grades was a boy who had disappeared to Guangdong, probably threading and sewing in some dark room. Since she was the head of the class, Ms. Chen sat her in the very first row, which was half a classroom away from where I was seated.  Right after the first class of the day ended, I dashed up to the front of the classroom. Yet, my footsteps reflexively slowed down as I was about to approach her. A kind of shyness—particular to children of that age—crept up in me. No one was watching me at all, but somehow I felt I was at the center of a web of judgment and scrutiny.  Absorbed in her notebook, she didn’t look up. I plodded past her in silence and exited. When I returned to the classroom, she glanced up at me, but quickly went back to studying again.  We hadn’t spoken in two months, and all the time that we had spent together like each other’s shadow way back in summer had faded into a blur in my mind. Maybe she had forgotten already.  All the other boys started to notice Tang Lu as well. Once, Snotty Liu got assigned to sit next to her. He spent the entire day looking at Tang Lu with an idiotic grin on his face, so ecstatic that even his snotty nose ceased to dribble. Much to Ms. Chen’s chagrin, she couldn’t make him stop even after pulling on his ear several times, so she had to switch him to a different seat. When Fatty Zhang, the notorious class bully, saw Tang Lu playing hopscotch with some other girls, instead of sneering and taunting them, as was his wont, he asked to join the girls’ game and begged Tang Lu to teach him. He even nodded along rhythmically as Tang Lu lectured him on the fine points of hopscotch technique in her soft voice, as if he were some kind of model student.  Ms. Chen shooed him away when she saw this. “Why haven’t I seen you devote yourself like this to schoolwork?” she demanded.  Ms. Chen was so protective of Tang Lu that no one was able to approach her. I suspected that in her eyes, everyone else was ignorant and lazy, a mere continuation of our uncouth ancestors, doomed to waste our lives away in this muddy, grimy little village—except for Tang Lu.  She arranged our seats strictly according to our grades, sticking all the students with bad grades in the very back of the classroom so we wouldn’t be a bad influence. Cripple Yang once visited Ms. Chen’s house carrying a few kilograms of pork rump in an attempt to convince her to move Yang Fangwei to the front row as well, but Ms. Chen drove him out of her house without hesitation. The next day in class, she picked on Yang Fangwei to solve problems. After Yang Fangwei hemmed and hawed for a while, unable to produce an answer, she hissed at him, “Get your ass off the toilet if you aren’t going to shit. Go tell your dad that!” We howled with laughter; Yang Fangwei turned beet red.  For a while, Ms. Chen had high hopes for me as well. She summoned me to her office and tried to convince me to put in more academic effort. However, she was amazed to find out I was only interested in literature and paid no attention to math or the sciences.  “Why are you interested in literature, the most useless subject of all? Only science—only quantum and space physics—can change the world. How would reciting poems do you any good?”  She went on in that vein, and her speech was peppered with lots of words that I had never heard before. All I could do was keep my eyes lowered to the ground. Eventually, she realized that she wasn’t getting anywhere with me, so she sighed and dismissed me with a wave.  Before leaving, something on Ms. Chen’s desk caught my eye—carved out of pagoda wood, it was a small, rather childish-looking boat. I stared at it, somewhat stunned. It took me a moment to realize that it was very similar to my wooden toy boat, which had been swallowed by the river over summer break. Even the shape of the arched awning and the scratch marks on the wood seemed identical. Yet, as I took a closer look at it, I noticed differences. Judging from the darker color and the rotten bits, this wooden boat had been around for at least seven or eight years, but my wooden boat had only been lost for a few months.  “Still here?” Ms. Chen murmured as she drew checkmarks and crosses on the homework she was grading.  I pointed at the wooden boat. “Ms. Chen, this boat . . . ”  Ms. Chen looked up and her eyes narrowed. “What about it?”  “How long has it been here?”  “More than a decade, I think.”  “Oh.” I turned around, ready to leave, but Ms. Chen stopped me. “What do you know about this boat?”  The bell for the next class rang, so I shook my head. “Nothing.”  After that, my grades got worse and worse, and I began to spend all my time with Yang Fangwei and the other boys—passing notes during class and stealing from the orange orchard behind our school. Ms. Chen usually ignored us—until our shenanigans got out of control, at which point she resorted to her usual repertoire of punishments: standing in the corner, caning, and so on. All of us hated her guts.  I never got a chance to speak to Tang Lu, either. The classroom wasn’t exactly spacious, but it was enough to be an unbridgeable gulf between us. Surrounded by my new buddies, I continued with all the mischief. As a result, my seat moved farther and farther toward the back, until I hit the back wall.  Just before the end of the fall semester, Ms. Chen wrote down five math problems on the blackboard and asked us to come up and write out the answer. Whoever failed to produce the correct answer received smacks in the palm. None of the first five students called up could solve their assigned problem. Lips trembling with anger, Ms. Chen whacked their palms so hard that she even snapped her bamboo ruler in half. Fatty Zhang started to sniffle after three or four hits. Panic-stricken from witnessing this scene, all of us prayed hard that our names wouldn’t be called.  Ms. Chen pointed her finger directly at the back row. “Hu Zhou, Yang Fangwei, Peng Hao, Snotty Liu, and Zhang Ma—the five of you, get up here now. I swear, I’ll whack your palms until they break in half if you can’t solve these!”  She hesitated for a second, and added, “You know what—Zhang Ma, go back and sit down. Tang Lu will replace him. I’m going to show you all that someone in this room can actually solve these problems!”  We rose from our seats, glum and scowling, dragging our feet. Zhang Ma, who had been granted a last-minute reprieve, looked exaggeratedly relieved. He made faces at us as we made our way over to the blackboard.  There were five word problems. Tang Lu was assigned to problem four, and I to problem five. To the left of Tang Lu stood Snotty Liu with his perpetual lines of snot over his lip.  Even now, I could still clearly recall problem five: Xiao Ming reads a storybook. He finishes 1/9 of the book on the first day, and 24 pages on the second day. The ratio between the pages he read over the two days and the pages left is 1:4. How many pages are there in total in the book? As I stood in front of the blackboard, no matter how much I racked my brain, those words remained a huge tangled mess.  Ms. Chen loomed right behind me, bamboo ruler in hand. A drop of cold sweat slid down my spine. My hand, clutching the chalk until my knuckles were white, hovered before the blackboard, but I could think of nothing to write. My legs started to tremble.  No one else could solve their problem either, except for Tang Lu, who was inscribing her solution on the blackboard, line after neat line. I was struck by the sight of her. Deeply absorbed by the intellectual challenge, her face was lit up from the side by the bright sun through the window, a combination of soft lines and curves like the young willow branches that sprouted in early spring.  Years later, when I was learning to draw, I noticed a certain pattern in my illustrations. It was my habit to draw a face in profile, outlined with a few simple strokes, and then filled in with strong, contrasting shadows and highlights. For a long time I wondered where I had acquired this quirk. The answer turned out to be this seed buried in my memory. Whenever I picked up a pencil, the memory would begin to sprout and unfurl, until it had blossomed into Tang Lu’s face on my sketchpad.  “What are you looking at?” Ms. Chen’s scolding interrupted my drifting thoughts. I felt a whack on my head from the bamboo ruler. “Work on your problem. If you can’t solve it, come and receive your punishment.”  I shook my head in defeat. However, just when I was about to drop the chalk and accept my fate, I heard a soft whisper: “Make x the total number of book pages.”  I halted; so did Snotty Liu. We both turned in Tang Lu’s direction. Still conscientiously writing down her answer, Tang Lu murmured under her breath, her lips barely parting, “Don’t look at me. The teacher will notice.”  Both of us snapped our heads forward at once. Snotty Liu glared at his assigned problem and muttered, “I’m supposed to solve for flour and sugar. There’s nothing about a book—”  “Not you. I was talking to Hu Zhou.”  Snotty Liu slumped. Snot gushed from his nostrils, dribbling down his chin.  I quickly wrote down “Let x = total pages” on the blackboard and whispered: “And then?”  Ms. Chen hissed, “Quiet!”  After a long pause, Tang Lu whispered back, “1/9 times x plus 24 is equal to x divided by open paren 1 plus 4 close paren. Solve for x.”  I copied down the equation and swiftly worked out the answer. During this whole time, Snotty Liu kept on goggling at Tang Lu with pleading eyes, holding back tears as well as snot. Tang Lu ignored him, put down her chalk, and turned around to face our teacher. “Ms. Chen, I’m done.”  Ms. Chen nodded. “That’s correct. You see, these problems aren’t difficult at all. Aren’t you four ashamed of yourselves? Now come up for your—wait, Hu Zhou, step aside.”  I scooted to the side so that Ms. Chen could see the blackboard. She gave my solution a quick once-over, pushed her glasses up her nose, looked again, and turned her gaze back to me. “Well, well, well—look what we have here! The sun has risen from the west. Hu Zhou, you may sit down.”  She pointed at the other three people, all scratching their heads in helpless confusion. “You three! Come here now.”  Dazed with relief, I started to walk back to my seat in the back corner. Tang Lu had sat down in her seat already, her back upright. I glanced at her, and noticed that a strand of hair was plastered against her cheek. She looked beautiful, with an expression both earnest and serene, as though she were intensely focusing on the textbook.  I was sure that I saw her wink her right eye.  With the New Year shopping done, the celebrations leading up to Spring Festival began in earnest. The teahouse bustled with young people who had returned home after working thousands of miles away during the year so that the whole family could be together for Spring Festival. Everyone passed the time by playing Mahjong. Out of boredom, I went to join them. In the cramped brick room that was the teahouse, a heady brew of swears, malodorous bodies, and cigarette smoke soon made me dizzy. Time slipped through my fingers like Mahjong tiles and cash.  The day before Spring Festival, I arrived at the teahouse late, and there was only one empty table left. Three other young men soon came in and sat down at my table. I knew two of them, but the third face was unfamiliar.  The stranger who took the seat right across from me was short and scrawny. As soon as he sat down, he passed a pack of cigarettes around the table. I frowned and refused the offer.  “Not good enough for you, eh?” He lit his cigarette, and puffed smoke. “I don’t think we’ve met. Are you someone’s distant relative?”  “Da Lu, you should be embarrassed, offering these Honghe cigarettes that probably only cost you five yuan per pack!” someone interjected. “This man here is a big deal—he works in Beijing, making cartoons. Tens of thousands in his pocket every month!”  “Cartoons? Ha, my wife used to love cartoons.” Da Lu reached for the Mahjong tiles, a cigarette dangling from his lips. “Come, let’s play.”  Irritated, I kept on making bad plays. Within half an hour, Da Lu had won the pot several times in a row. His grinning face annoyed me even more—not just because of the money I lost or the yellowed teeth he bared at me, but because of the mockery I sensed behind his smirk.  Da Lu burned through cigarette after cigarette. I felt like I was about to suffocate from the malodorous, musky air. After losing another game, I pushed the money away and said, “Let’s call it a day.”  Da Lu spat on the ground and wiped the spittle from his lips with his sleeves. As he collected his winnings, he said, “It’s not even noon yet. Don’t be such a bad sport! You’ve only lost a few hundred; that’s nothing for a big shot like you from the capital! Let’s play a few more games.”  I ignored him and got up, heading for the door. Just then, a woman came into the teahouse and walked directly up to Da Lu. In a pleading voice, she said, “It’s New Year tomorrow. Please come home and help me tidy up the house. I really can’t manage it alone.”  Da Lu glared at the woman.  “Can’t you see I’m busy? Go get your dad instead!”  “My dad . . . you know he can’t . . . ” The woman’s voice lowered.  “Right, your dad is useless with his one leg.” Da Lu snickered and shook his head. “Whatever—leave me alone. It’s just washing some sheets and dusting the walls. You can finish the work in a day if you don’t dilly-dally. Fortune is smiling on me today. Can’t you see I’m winning bread for our family?”  Although the woman’s pleas were futile, she stubbornly refused to leave.  “Stop standing here, it’s going to bring me bad luck! I was winning just now. See how he’s not playing anymore as soon as you showed up?” Da Lu gave the woman a threatening look, then turned his eyes to me. “Hey, are you gonna play or not? I’ll go find someone else if you’re out.”  My eyes had been glued to the woman’s face the entire time. Da Lu’s call snapped me back into the reality. I averted my eyes quickly as I mumbled, “Yeah . . . yeah, let’s play some more.”  After that, I was even more absentminded. My sight was so blurry that I almost couldn’t tell the Mahjong tiles apart. I lost so many games that reaching for more money became a nearly mechanical movement. Da Lu, on the other hand, was ecstatic from winning. He must have thought me a fool.  And this fool could not stop himself from staring at the woman next to Da Lu.  Her draping hair appeared grayish through the smoke. A wrinkly red down coat hung loosely about her. As she shifted about, those wrinkles stiffened like hundreds of pursed lips. The clumsy misspelled logo told me it was a knockoff.  Again and again, I told myself she couldn’t be Tang Lu, yet everything—from her profile to the hair that gently brushed against her cheeks—screamed to me that she was.  I had imagined my reunion with Tang Lu a thousands times over, but I never expected we’d meet this way, in a stinky noisy goddamn teahouse.  My throat felt dry; it wasn’t from the smoke.  Finally, Tang Lu realized that there was no moving Da Lu. She turned around to leave. As she exited the teahouse, I stood up and said to the table, “I need to use the toilet.”  I caught up with her a half block away.  “Tang Lu.” I hadn’t said her name aloud for so long it sounded strange.  She turned back. Her eyes brimming with confusion.  “It’s me.”  She hesitated, and then shook her head. “I don’t know you.”  I pressed. “Do you remember that notebook with Doraemon in it?”  “Doraemon?”  I shook my head, unable to hide my disappointment. “Forget it.”  I could feel Tang Lu studying me carefully. When she saw that I was done talking, she turned around to leave, her shoulders hunched against the cold wind.  I felt like a lifeless robot as I plodded back into the teahouse and reached for more Mahjong tiles. Once again I was plunged back into a vortex of rowdy curses, clinking tiles, and slamming fists. The noise around me oscillated: sometimes further away, leaving me in a lonely void; sometimes close by, pounding my eardrums until they threatened to tear. Smoke fumed from everyone’s noses and mouths, and thickened until I was on the verge of suffocation. I sprang up, rushed out of this revolting hellhole, bent over by the side of the road and dry heaved.  After the incident with the math problems, my friendship with Tang Lu resumed. It was as if the ice between us over the past few months had melted in an instant. Every day, after school, she would leave first while I tarried, waiting for the others to go on their own way. She’d linger at a particular crossroad until I caught up, and then we’d walk back home together.  By then, my home had turned into a war zone. My father’s affair with the neighbor’s wife had been discovered; the husband stormed over to our house, and my mother was humiliated. My parents fought, and then lived as two strangers who happened to share the same house, never speaking to each other. My aunt made a trip home to mediate, but it did no good. All she could do was pat my head and sigh.  Every evening, I came back to a dead house. It got so bad that no one even cooked dinner anymore. We made do with leftovers found in the pantry.  As for Tang Lu, her father’s alcoholism got worse. He was often seen drunk in broad daylight; sometimes he would beat Tang Lu for no reason at all.  As a result, both of us dreaded going home. Carrying our backpacks, we trudged as slow as possible along the road, keeping each other company. After all these years, the details of the memories of those conversations had faded. I’d like to think it also had something to do with how cold it was: when we spoke, our words froze and crystallized in the chilly air, fluttering down like snowflakes.  Our walks lasted for a very long time, long enough for twilight to fade into nightfall. The veil of darkness would fall upon the village, and the lanterns glowing along the banks would transform the river into a bright ribbon zigzagging through earth. Then, we would drop her off at her home, and I would continue down the path to my home.  All that I could recall of our conversations was that we discussed Doraemon. She still remembered those dozens of episodes of Doraemon that we watched together during the summer, and she said with a sigh to me, “It would be so great if we could keep on watching.” Her cheeks trembled in the cold wind.  Hot blood rushed through my veins. I patted my chest and promised, “Don’t worry, I’ll draw more for you!”  Therefore, before winter break, I emptied my savings and used the only four yuan I had in the world to purchase crayons and a notebook. The notebook was not the half-yuan sort that was supposed to protect students’ vision with yellow pages, but the thick kind with elegant ink-wash painting embellishments along the edges that cost three yuan. A luxury like that wasn’t available in our village’s little general store, so I had to ride my bike in the freezing wind all the way to the stationary store up in town. I didn’t have enough money for the crayons and the notebook, but I begged and pleaded and refused to leave until the shop owner finally gave in.  All winter break, I stayed cooped up in my room, earnestly working on my project. I imagined that an ancient dinosaur had kidnapped Shizuka. With the help of Doraemon, Nobi traveled through time to the age of the dinosaurs. After a series of heart-stopping adventures, he finally saved Shizuka.  That winter was especially dry and cold. Although the skin on my hands was chapped and cracking, I kept on drawing. Those colorful scenes poured out onto the pages as if the crayons had come to life and guided my hands instead of the other way around. That was the first time ever in my life when I truly felt the joy of creating. I had to dab at my eye when I illustrated Nobi standing before Shizuka to shield her from the bloody jaws of three ferocious dinosaurs, and I could not hold back a grin when I depicted Shizuka planting a quick kiss on Nobi’s cheek after both of them were safe again.  After I finished everything, I wrote the following on the first page of the notebook with due solemnity:  For every lonely childhood, there is a Doraemon.  To Tang Lu—My Shizuka  When classes resumed after the break, I brought the thick notebook with me to school, hoping to find an opportunity to hand it to Tang Lu. However, the moment I pulled it out of my backpack, Fatty Zhang ripped it from my hand and yelled, “What do we have here? Don’t tell me that you actually finished your winter break homework!” He got ready to flip open the pages.  Since Fatty Zhang was such a bully, usually I kept my distance. But not this time. I leaped at him, grabbed the notebook with one hand, and pushed at his chest with the other, my eyes red with fury. Fatty Zhang, who was much bigger, easily shoved me away, crashing me into a desk. But I got up immediately, let out a roar, and threw myself at him again.  Fatty Zhang was startled. He was not expecting that I would fight back so fiercely. However, in front of all our classmates, there was no way he could hand back the notebook without a fight.  We wrestled each other, but I was no match for him. Soon, Fatty Zhang was sitting on my chest as he panted. He bent down and picked up the notebook. “Now I’ve got to see what’s—Ah! Let go!”  I bit into his hand and clamped down my teeth until I tasted blood. The sharp pain made Fatty Zhang tear up, and he had no choice but to let go of the notebook and drop it next to my head. As soon as I loosened my jaw, however, he grabbed the notebook back and threw a hard punch in my face.  The blow stunned me. After Fatty Zhang struggled to his feet, I remained on the ground, unable to get up. Notebook in hand, he taunted me, “Who do you think you are, bastard? Watch me rip your shitty notebook into pieces—”  He saw several other students flinching and whipped about.  Ms. Chen was standing at the door to the classroom.  After hearing about what had happened, Ms. Chen helped me up from the floor and asked if I was hurt. I felt dizzy, but I shook my head. She slapped Fatty Zhang’s palms ten times, so hard that Fatty Zhang’s eyes watered. She picked up the notebook and flipped through it. As soon as she saw the words I wrote on the first page, she smirked. “You are much too young to have such thoughts on your mind. Why, you’re as shameless as your dad! I’m not going to punish you, but I am confiscating this notebook. I have to stop you from being a bad influence on your classmate.”  Since I had always harbored an instinctual fear of Ms. Chen, I could only watch helplessly as she left the classroom with my treasure. Disheartened, I walked back to my seat, hanging my head. When I passed by Tang Lu, she gave me a questioning look, but I only shook my head and brushed past.  I spent the entire day unsettled and full of regret, unwilling to let all the effort I made during winter break go to waste. After school, Tang Lu began down the road home slowly, as usual. I gritted my teeth and muttered to her, “Wait for me; I’ll be back!”  I turned around and dashed back to the school. First I went to Ms. Chen’s office. I searched on her desk, but didn’t see the notebook. After thinking for a second, I scurried in the direction of the paddy field.  After a snowless winter, we got our first snowstorm that day. By dusk, the air was full of fluttering snowflakes. I sprinted across the paddy field so fast that the whirling cold wind and snow gushed into my collar and down my neck. However, neither the cold nor the eeriness of the graveyard could stop me from getting to Ms. Chen’s house.  I knew I had a lucky break when I saw the huge bronze lock hanging in front of Ms. Chen’s door—she had come home and left again. I circled her house, and found that both the door and the windows were secured. The chimney was the only way in. I climbed onto the roof, and scooted down-chimney until my feet hit the ground. It was dark inside, but I didn’t dare turn on the lights. I kept my eyes wide open and felt my way through the house.  My heart thumped as though someone were beating a drum in my chest. My fear, however, did not stem from the graves around the house. In fact, I’d rather be surrounded by thousands of shrieking walking corpses than be caught red-handed by Ms. Chen. I couldn’t even imagine her wrath if she found out that I had snuck into her house.  I searched the house thoroughly, but found no sign of my notebook. I didn’t want to give up yet, so I examined the furniture piece by piece. Just as I made my way to the bed, I felt something odd underfoot—one of the wooden planks next to the bed was loose. I gave it a tug, and it popped up.  Beneath the wooden plank wasn’t a muddy earth floor, but a deep tunnel. A set of stairs spiraled into the darkness.  I inched down the stairs, feeling for each step with the tip of my toes. I thought it would be even darker underground, but surprisingly, as I reached the bottom of the stairs, I saw light at the end of the tunnel.  The tunnel was only three or four meters long. I crept through and discovered a door on the other side; the light I saw was spilling from the door seam. I pressed my ear against the door. After confirming that it was completely silent inside, I took a deep breath and pushed the door open. At once, the tunnel was flooded with amber light.  I was utterly stupefied by what lay before my eyes.  For a thousand times after, when I recalled that moment, I would still doubt whether my memory was playing a trick on me—the sight that greeted me was enough to overturn my entire perception of the impoverished village. Sometimes I wondered if I had dreamed the scene, and the fantasy had then invaded my memory, corrupting it.  I saw machines. Rows and rows of machines that I could not name.  The basement was about twenty square meters in size. Both the walls and the floor were cast out of a smooth, gray-brownish metal. The ceiling was dotted with lights that illuminated every corner of the room, leaving no trace of shadows. Blocky machines with red, yellow, and green blinking lights filled the space, and electric cords snaked over every inch of the floor.  In the center of the room was a large platform supported by three columns. On the platform was a cubical glass case, about the width of my palms held together. At first glance, the glass case was empty, but I thought I saw faint electric sparks fizzle now and then in the air trapped within the case.  I probably would have stood there for hours, dumbfounded by these enormous, intricate machines. Fortunately, I soon spotted my notebook, placed right at the edge of the platform. I grabbed it and stuffed it under my jacket.  I was about to leave when a heap of objects in one corner of the basement caught my eye. I saw a few branches, a shabby backpack, and deflated balls with faded colors. The collection probably would have appeared random to anyone else, but to me they weren’t random at all: all of them belonged to me. During the summer, I had watched all of them sink into the river through the ominous whirlpool that I had discovered.  I rummaged through the items and noticed that every one had a label. The labels had turned yellow with age, but the handwriting was still legible.  “Date: July 13th, 1982. Net Weight: 243g. Origin: Unknown.” This was on the label attached to the ball. The branches, however, were dated back to 1985 and 1992. Every label had a different date, and the dates covered a wide range.  I examined the labels one by one, but they confused me even more. But since I had found what I came here for, I dropped the mystery. I left the basement, exited the house from the chimney, then dashed across the paddy field, my clothes covered in soot. As I ran away, I saw a lonely figure crossing between the graveyard and the paddy field, stopping at that mysterious house.  It was Ms. Chen. Thank heavens that I had gotten out of there in time.  I sprinted along the roads. The snow had gotten heavier; tiny white specks fell from the dark blue sky and fluttered around me. My heart started to race: It was late, what if Tang Lu had already left and gone home?  She was still there. She had been waiting at the crossroad this whole time, her petite figure indistinct, as if she would melt into the snow flurries at any moment.  “Here, this is for you.” I ran over and carefully pulled the notebook out from under my jacket. Although I was covered in chimney ashes, I made sure that not even a speck of dust landed on the notebook.  “Did you get into a fight with Fatty Zhang today because of this?” Tang Lu took the notebook. Her cheeks were bright and flushed from the cold, but glowed with the warmth of her smile.  “Yeah, it’s a new episode of Doraemon I drew for you. Took me the whole winter break! No one is allowed to see it except you.”  She flipped to the first page and her eyes fell on the two sentences that I wrote for her. She lifted her eyes to the starry sky; after a long silence, she said, “Hey, do you think Doraemon really exists?”  “Yes,” I nodded, my face serious. “Of course Doraemon exists!”  “Why have I never met one before?”  I contemplated the question, and then blurted out, “Because I am your Doraemon!”  Tang Lu giggled at my embarrassed expression. “Are you my Nobi, or my Doraemon?”  “I am . . . I am both of them! Don’t worry, you are our Shizuka, and we’ll always be here to protect you from anything trying to hurt you in the world.”  “You’re amazing!” All of a sudden, she stood on tiptoes and planted a soft kiss on my right cheek, pulling away immediately.  I stiffened as if a lighting bolt had struck me.  I tried to relive that moment, but her lips were too soft and cold, the sensation melting away as quickly as snow. When I touched my cheek, I felt a tinge of wetness on my fingertips, but I couldn’t tell whether it was the kiss from her lips or the kiss from a snowflake.  Tang Lu closed the notebook, held it against her chest, and turned around to leave. Shaking off my shock, I caught up to her. Our usual walk home seemed especially long that night. We remained silent for the rest of the journey, quietly treading through the flurries of snow.  We walked until the snow had turned our hair white—as though we had grown old together.  The weather was especially dry and cold on New Year’s Eve. The difficult year was finally coming to an end. After the family reunion lunch, Mother washed and dried all the old laundry in the household, and then took me to the graveyard to pray to our ancestors.  As we reached the crossroad, we saw a small crowd gathered before a house. It sounded like the family living there was having a fight, because some in the crowd were trying to intervene while others spouted their opinions. I glanced at the house and realized it was where Tang Lu lived.  Indeed, as soon as my mother and I pushed our way through the crowd, we saw Tang Lu sitting on the ground, her hair loose and unkempt. She still wore the same red down coat, but parts of it had been torn. A slipper hung loose from one foot; her other foot was bare and dirty, turning blue from the cold.  She was crying, and her cheeks were red and swollen. She mumbled something with a glazed look on her face. I couldn’t make out her words clearly with all the noise surrounding us, but I caught enough to understand that she was saying that she couldn’t take it anymore.  Mother said: “Heavens! What a shame. Didn’t they make peace just now? And here they are fighting again. On New Year’s Eve, too!”  Someone answered, “Well, this time it’s worse. Da Lu gambled away eighty thousand yuan yesterday. Tsk, I heard that his eyes turned bloodshot from losing so much.”  Mother sighed. “Lulu wanted to build a new house with that money.”  My eyes were fixed on the woman sitting on the ground. She wailed and murmured, and all I could see was her naked foot. The sight seemed bleak in the piercing wind.  The air suddenly stank of alcohol. Da Lu rushed out from the house and slapped Tang Lu across the face, hard. The crisp sound, like a dry branch snapping in half, made my skin crawl. Blood gushed from Tang Lu’s nose. The short, scrawny man had turned into a frenzied leopard: he huffed and puffed, his face beet red. He screamed at her, “To hell with you! All I did was lose some money, but look at you wailing out here with everyone watching—have you no shame? Your dad is a goddamn cripple, and you are a fucking jinx!”  I realized that Lao Tang, Tang Lu’s father, was standing at the door as well. With one leg left, he could only lean on his walking stick, shuddering in fear and humiliation. He seemed to want to stop Da Lu somehow, but he just stayed where he was, lips trembling and eyes darting around.  No one in the crowd intervened either. I saw Yang Fangwei standing among the others and smoking, his face expressionless. I wanted to take a step forward, but my mother grabbed me by the arm. She shook her head.  After a few more punches, Da Lu tried to get Tang Lu back into the house, but a few tugs weren’t enough to lift her up. So he grabbed her by the back collar of her coat and dragged her along the ground instead.  Tang Lu’s hair and face dragged in the dirt as they crossed the road. I saw a drop of blood fall, but it was soon lost behind a cloud of dust.  On the way to the graveyard, Mother told me, “It wasn’t that no one wanted to help. We’ve tried before, but it always turned out worse for her. Da Lu is a real monster—he has spent time in prison. Sure, if we had intervened just now, we could have stopped him, but we can’t stick around at his house forever. He would have beaten Tang Lu within an inch of her life when he got the chance.”  “Why did Tang Lu marry him?” My voice was muffled.  Mother frowned as if digging through her memories. “You left the village after elementary school. There are a lot of things that you don’t know.”  I gradually got Tang Lu’s story out of Mother. The summer after we graduated elementary school, Lao Tang broke his leg. The Tang family emptied all their savings to pay the cost of hospitalizing him. As a result, one semester into middle school, Tang Lu had to quit school to support the family. She started off as the apprentice of a tailor; a year after, she went to work in a clothing factory in a town nearby. There, she spent ten hours a day in a closed-off underground workshop, hunched over the sewing machine as she struggled to piece together cloths of terrible quality in the dim light. After work, she returned to her dormitory, cramped quarters packed with other workers, all girls her age, and tried to get some rest. However, soon that factory was reported for hiring underage workers, and Tang Lu was sent home. The local police station boasted their victory of busting the factory and the story made headlines in the newspaper; yet, for Tang Lu’s crumbling family, it only added to their growing misery.  After a week at home, Tang Lu could no longer stand her father’s cold, disappointed gaze from his sickbed. She begged Auntie Shen, who was about to leave the village for the fabled riches of Guangdong, to take her along. Auntie Shen didn’t want more trouble at first, but Tang Lu knelt in front of her house for a whole night, giving up only as the sun rose.  The morning of Auntie Shen’s departure came. She got on the bus, packed and ready to go. Yet, as the bus pulled out of the village, and the roadside poplar trees swept by the windows, Auntie Shen jumped up from her seat, swore loudly, and demanded that the driver stop the bus. She walked back to Lao Tang’s house, grabbed Tang Lu, and stormed out. She cursed at Lao Tang, “It’s fine if you’re going to hell, but spare your child!”  Tang Lu followed Auntie Shen to Guangdong, and they found work together. At first, they worked as seamstresses, but the entire industry declined as automation spread. Hundreds of thousands of garment factory workers in Guangdong lost their jobs as a consequence. During that New Year season, Auntie Shen obtained a fake ID for Tang Lu that added two more years to her age, so that she could work legally. After New Year, Tang Lu moved to Shanghai, then to Shenzhen, and finally landed in Beijing. By the time she settled in Beijing, I had graduated from university and been hired by the comic book company.  We were both alone in a strange land. During that year, we might have even crossed paths—in the subway, the streets, or convenience stores. Among the streets and buildings of Beijing, crowded with thousands of expressionless faces, we wouldn’t have recognized each other even if we brushed shoulders.  While I was securing my place in Beijing, Tang Lu was growing tired of this meaningless wandering. Exhausted, she returned home at last. For a village girl, the age of twenty-three was past the prime for marriage, but no one in the village wanted to approach her—whoever married Tang Lu had to take in the crippled, alcoholic Lao Tang as well. Allegedly, Yang Fangwei had talked to his family about marrying her, since the Yang Brewery was doing well. However, the Yang Brewery went bankrupt, and the idea died on the vines. Fate had slammed the door shut on perhaps the last opportunity for Tang Lu to find some happiness.  In the end, a matchmaker came to Tang Lu’s home with Da Lu, who was from the neighboring village. Tang Lu did not like him at first, but after dinner, Da Lu walked over to her as she was flipping through channels on the TV, unable to focus on anything. She stopped at the children’s channel.  “Do you like watching cartoons?” asked Da Lu.  Tang Lu nodded.  “Well, me too.” Said Da Lu.  “Which one?”  Da Lu scratched his head and thought long and hard. Finally, he responded: “Dora . . . Doraemon.”  Tang Lu turned to regard the scrawny young man. He didn’t seem as crude and pugnacious as other people believed.  But Da Lu’s real nature was only revealed after the wedding. Tang Lu moved in with Da Lu’s family and lived with a few of his other female relatives. Not even a month into the marriage, Da Lu got drunk, and came back home to beat her. All of her in-laws only stood and watched. Da Lu also had the habit of smashing things during his drunken rage. The furniture, the TV, the motorcycle . . . with a cacophony of screams and sounds of things breaking, this already indigent family became even more impoverished.  Tang Lu tried to help with the finances by trading in town: A/V equipment, noodles, cheap clothing . . . she tried her hand at selling anything that was popular, but her businesses never lasted long. Every few days, Da Lu hounded her for money so he could gamble or drink. Even so, she had managed to save up a little, dreaming that one day she could build a new house for herself and Da Lu and finally leave those cold, bitter in-laws behind.  But now, thanks to Da Lu’s gambling, the eighty thousand yuan that she had saved over the past five years were all gone.  Mother’s narrative was garrulous and rambling. My mind drifted as I listened to her in the sobbing wind. Darkness descended. Fresh candles illuminated many tombs in the graveyard, and those tiny flames flickered in the wind like scattered stars. The last day of the year was about to slip away in frigidity and desolation.  When we passed by Ms. Chen’s home, I asked about her background. Mother shook her head and said, “I only know that she wasn’t originally from the village. People said that she used to be part of the military base here, but then the army left, leaving only her behind. She became an elementary school teacher because she was educated. Then, the school closed because there weren’t enough pupils, but she still lived here.”  Under a gloomy sky dark as the sooty bottom of a pot, the shabby house looked as if it were covered in rust. I glanced at it and didn’t ask more questions.  I stayed up late with my father that night, and killed time by watching the uninspired Spring Festival Gala on TV as we took turns yawning. When it was almost midnight, I took out the firecrackers and prepared to light them during the midnight countdown.  A clamor ripped through the silent night. Someone was shouting. I leaped up and dashed toward the river.  “Come quickly! That Tang girl is going to jump into the river!”  I and the other villagers got to the river, where we saw a figure standing by the bridgehead. Cautiously, we gathered around her, the beams from our flashlights ripping through the darkness to reveal the face of Tang Lu. She was sobbing, tear trails crossing the scars on her face.  “Calm down!” we shouted at her. “Don’t do it!”  Abruptly, Tang Lu turned to me. She smiled. “Didn’t you say that everyone has a Doraemon as their guardian?”  The smile quickly dissolved in tears. “Why have I never—never—met mine?”  I was shaken.  Everyone looked at me. I opened my mouth, ready to say something, but all I could produce were some incoherent syllables.  A splash. Her figure disappeared from the bridgehead.  People rushed toward the bridge. But I couldn’t move, and the crowd passed me by like a surging tide. All I could think of was how she had remembered everything after all.  I huddled in my coat, lost and cold.  The string of loud pops from firecrackers almost made me jump. I turned around and saw that the night had been shredded by the bright explosions, like some Impressionist painting.  The new year had arrived, too late for some.  Due to the lack of students, the school closed down the summer after my sixth grade. We became the last graduating class. When we took our graduation class photo, everyone knew that Ms. Chen’s eyes were puffy and red, even though she wore her unchanging glum expression. After the photo, she stayed in her chair and wouldn’t get up.  To me, however, graduation meant that six years of imprisonment had finally come to an end. My only worry was how to keep myself entertained for the three months of summer break, when the interminable days were punctuated only by the chirping of cicadas.  My family purchased a VCD player as well, so that my father could watch opera. That reignited my passion for Doraemon. However, after asking around for a while, all I managed to borrow from others were a few scattered discs. Even the labels on the discs were faded, so Tang Lu wrote “Doraemon” neatly on every one of them. Clearly, these discs were not enough to sustain us for the whole summer.  “Do you still want to watch Doraemon?” I asked Tang Lu.  She nodded eagerly.  If I could find an entire set of Doraemon on VCD somewhere, then I could spend every day of this summer break with Tang Lu at my side, engrossed in the fantastical adventures of Nobi and Shizuka.  The full set of Doraemon, Ooyama version, consisted of a thousand plus episodes. Even if I could rent the VCDs, it would cost me a hundred and twenty yuan in total. This figure was beyond my imagination. I gathered all of my old textbooks and exercise books and stuffed them into a sack, carried the sack into town, and sold them to the old man at the recycling station. I was given a little over ten yuan in return. To see my six years of schooling reduced to these wrinkled bills made me sad on my parents’ behalf.  “Books aren’t worth much.” The old man emptied the books from the sack and kicked them into the corner of the room. “Metal, on the other hand, is valuable. Look for yourself on the wall.”  Sure enough, there was a price chart on the wall. I studied it. Three soda cans were worth 0.1 yuan; books were 0.15 yuan per half-kilogram; scrap iron was 1.2 yuan per half-kilogram . . . I sighed, and headed off.  And then, my father got into a fight with Tang Lu’s father. Allegedly, my father heard Lao Tang whispering about his affair to someone when they were working in the fields. Enraged, my father leaped at him and the two of them soon became entangled in a blur of punches and kicks.  Due to this incident, neither Tang Lu nor I wanted to be at home. Our aimless, melancholic meandering continued on. When we strolled along the river at sunset, two reflections appeared on the river surface as well.  “Who are they?” I asked Tang Lu, “They’ve been following us.”  “Shhh.” Tang Lu held a finger against her lips. “These are water people, and they are cautiously observing us, strangers to them. Don’t talk so loud—you’ll frighten them.”  So the four of us carried on. The sinking sun lengthened our reflections, and they faded as the light dimmed. Just when the reflections were about to disappear, Tang Lu and I stopped at the special part of the river that always swallowed everything.  “I’ve always been curious about this,” said Tang Lu. “If the river sucks everything in, then can we take things out from the river as well?”  “How would we know if we don’t give it a try?” I took off my shirt and prepared to dive, but Tang Lu stopped me.  “What if you disappear as well, like everything else? No one would play with me then . . . ”  “Don’t worry. I won’t ever leave you!” I slapped my chest.  What Tang Lu suggested, however, was a valid concern. My eyes landed on the crooked tree next to the riverbank, with its branches drooping so low that they almost touched the water. I had an idea.  I climbed onto the tree, wrapped my arms and legs around the branch closest to the water, and carefully inched my body forward. That branch was only about as thick as my arm. As soon as I shifted my weight onto the branch, it sank even lower, finally bringing me closer to the river surface. I took a deep breath, about to reach my hand into the water.  “Watch out!” Tang Lu watched me nervously from the riverbank.  I dipped my hand toward the river. I imagined a giant snake baring its teeth or a fiery hell beneath this mysterious region of water. Yet, as my fingertips finally touched the water, nothing happened at all—the water was cool, not even hot from the scorching sun.  I tried to wave my arm in the river. The water felt much more viscous here than elsewhere, and I felt a lot of resistance against my arm. I extended my hand slowly, and my fingertips finally brushed against something hard and metallic. I grasped it and pulled it up until I saw it through the clear surface.  It was a square-shaped iron lid with a pattern of holes. It seemed familiar, but I couldn’t remember where I had seen it before.  I pulled the iron lid out of the water. It weighed six or seven kilograms and now felt much heavier in my hand than it had in water. The branch I clung to shook as if it would snap in half at any moment.  I got another idea. Slowly, I backed up the bough, holding onto the iron lid with one hand. After I steadied myself against the thick trunk, I shouted to Tang Lu, “Step back!”  Tang Lu did as I asked. I dropped the iron lid to the ground and said, “Look after this! I’ll go fish for more.”  “What is it for?”  “You can make so much money from selling scrap iron! The old guy at the station told me that he paid 1.2 yuan every half-kilogram. We could sell this lid for at least ten yuan. It’s even better than selling a sack of books.”  Tang Lu hesitated. “We don’t know if this lid belongs to someone. We can’t steal.”  “Does this river have an owner?” I shot back.  “Probably . . . not?”  “See? Whatever I find in the river should belong to us then. It’s just like fishing. Stop worrying!”  It was already dark, and I could see the lit windows of faraway houses. I could even hear my mother calling out for me in the distance. I had to hurry. Using the same method as before, I fished out a couple more iron pieces. All of them looked different: lids and boxes, cylinders and brackets, adding up to about forty kilograms of scrap metal. At this pace, I needed to find just one more object to have enough money to rent the entire Doraemon series on VCD.  The last object was bigger than I expected.  I had to feel around it for a while before finding something resembling a handle. I grasped it, and tried to lift the whole thing up. The tree branch groaned under the weight. An iron box with round corners emerged. Small holes peppered its sides, through which I could see many layers of thin metal “cards” embedded inside. The box was about the size of a television, but significantly denser. On one of the sides of the box was a round protuberance. Small openings that looked like sockets of some kind were found on the other sides.  I grabbed the handle with both hands and yanked the box up. As soon as it left the water, I heard a distinct pop in the air. Suddenly, the shimmering windows in the distance winked out, and darkness swallowed the whole village.  Tang Lu looked into the distance. “A power outage?”  “It’s been years since we last had a power outage . . . ” The sight confused me as well. However, we didn’t have much time to spare—it was already too late for us to be out. If we lingered any longer, our parents would surely come looking. I gritted my teeth and kept on pulling at the box.  I heard a sharp screech and felt myself drop. The branch chose that very moment to snap in half. Still holding on to the box, I plunged into the river.  A terrifying thought flashed through my mind: the water here had devoured countless things—deflated balls, twigs, and foam boards—that were supposed to float. I would go down as well and never see Tang Lu again. I struggled to catch a last glance at Tang Lu, but I splashed into the river before I could turn my head.  The lukewarm water swallowed me whole.  I thrashed my limbs in despair. However, to my surprise, my feet quickly felt the bottom of the river. I stood up rather sheepishly. So close to the bank, the water only went up to the height of my chest.  The broken branch floated on the calm water, showing no sign of sinking either.  Tang Lu was just about to let out a scream when she saw me standing up in the water. She pointed at me and stuttered, “What happened!? Didn’t you . . . didn’t you . . . ”  “How on earth did all those things sink in if the water here is so shallow?” A breeze chilled me as I waddled toward the shore with the iron box dragging behind.  With her eyes fixed on the strange iron box, Tang Lu nodded in agreement. “Good question. And where could all those things you just pulled out have been hiding?”  I warmed up a little after putting my clothes back on. I had an idea. “I know why!”  “Why? Tell me!”  “There’s an Anywhere Door under the river that connects to another space and time. That has to be it!”  Tang Lu giggled. “That’s impossible.”  “Of course it’s possible! Remember how Doraemon’s pocket is an Anywhere Door, and you can find everything you need in it?” The more I explained my theory, the more plausible it sounded. I nodded solemnly. “It’s in Doraemon, so it has to be real. I think there’s a robot cat living in the river. It knew that we wanted to rent the VCDs, which is why it gave us the scrap iron to help. It all makes sense!”  “Then why doesn’t it just give us the VCDs directly?”  “Um . . . ”  Tang Lu helped me out with a smile. “I believe what you said! It has to be Doraemon coming to our rescue. Didn’t you tell me before that there is a Doraemon for every childhood? Our childhood is coming to an end soon, and this Doraemon is here to offer us its final gift.”  “Yeah!” The mystery no longer bothered me.  We collected a total of over fifty kilograms of scrap iron, and there was no way for me to take all the pieces away tonight. I dragged all those metal components under the tree and covered them with branches, so that I could carry them off into the town tomorrow.  The next day was again gloomy. Heavy clouds veiled the sunlight, but the rain that everyone expected refused to fall. When I woke up in the morning, I felt a bit of a headache—I had probably caught a cold after falling into the river. But the joyful anticipation for Doraemon infused my body. I told Tang Lu that I was going to sell the scrap iron and get the VCDs, and that she should wait for me at home until I came back in the afternoon.  “Sure!” I could tell that Tang Lu was excited too.  I rode the bike to the riverbank first and retrieved the scrap iron. I crammed all the strange items into a sack, and placed the sack on the bike’s back seat. When I reached for the iron box, I noticed the round protuberance at its side again, and I tugged at it. Without too much effort, I broke it off of the box. Beneath the round bulge, there was a semitransparent crystal cube about five centimeters wide on each side. The crystal cube had been plugged into the box, revealing only a metallic, round cap. The shape of the crystal looked interesting, so I stuffed it into my pocket, thinking that I would give it to Tang Lu as a present later.  The bike was an old fashioned model with 28-inch wheels. The frame was longer than I was tall. My feet couldn’t even reach the pedals if I sat on the saddle properly, so I had to straddle the seat tube and hang on awkwardly. The ill-fitting bike did have one virtue: it was sturdy enough to easily carry a cargo load of over fifty kilograms. I strained and managed to pedal it along.  It took two hours to get to the town from the village by bike. In the muggy, hot summer weather, I was soon drenched in sweat. But the thought of the VCDs urged me on. Although my legs felt as though they were weighed down by lead, I pedaled faster and faster. In the sticky air, even the poplar trees next to the road drooped their heads in a spiritless silence.  After making a turn at the end of the cement road, I had to cross a bridge to arrive at the town.  I never made it.  The problem wasn’t the bicycle’s endurance or my stamina, but the sack. After two hours of clinking and grinding, the iron pieces had finally worn through the coarse fabric. With a loud clang, the sack tore. All the iron items tumbled out at once and clinked against the bridge.  “Hey, you little bastard, where did you steal all this from?”  A familiar voice approached as I scrambled to pick up the iron pieces. I turned around and saw a red-faced Lao Tang wobbling in my direction. He kicked the iron box.  “I didn’t steal them!” I grabbed on to the box and shot back at him, “I fished them out of the river!”  “Who are you trying to fool? There’s no way you got them out of the river; there isn’t even any rust on them.” Lao Tang puffed, breath stinking of alcohol. “What a family you have there! Your dad’s a cheater, and you’re a thief! I’m taking you to the police office.”  I recalled that Lao Tang had lost the fistfight with my father and had been bitter about it since. He was too skinny to win against my father in a real fight, but now, by catching me red-handed in thievery, he could get his revenge.  Anxious and frustrated, I yelled at him: “I swear that everything came from the river! If you don’t believe me, then go ask Tang Lu! She was there with me!”  Lao Tang sneered: “Lulu? I’ve told Lulu a thousand times to stop hanging out with you, but that little brat wouldn’t listen. Now, now—stop with all the nonsense and come with me!”  I fought him hard, but Lao Tang was much stronger. He grabbed me by the collar and started to drag me off the bridge.  “Damn you, Lao Tang!” I fastened my arms around the railing. “My dad will kill you!”  This infuriated Lao Tang even more. Blood rushed into his cheeks and he gave me a hard kick. “But he’s not here now, is he? Well, even if he’s right here in front of me, I’ll still make you pay for your crime!” He tugged at my arm again, but I wouldn’t budge a centimeter. Daring not to injure me, he let go and turned around, cursing loudly. “Fine! If you don’t come with me, I’ll turn in the things that you stole as evidence.”  He refilled the sack with the iron gadgets, tied the sack securely to the rack beneath the saddle, picked up the bike, and finally sped off the bridge. He made a turn and disappeared into the streets of the town.  I staggered behind and gave chase, but he was long gone. Despondent, I stood at the bridge and sobbed. Everyone passing by gave me strange looks. Exhausted at last, my head heavy and befuddled, I turned around to trudge home.  Thunder rumbled in the murky sky. I was not even halfway through the journey when the rain started, evolving quickly from a few drizzling drops to a ferocious downpour.  Drenched and still sobbing, I returned to the village after walking the whole afternoon. When I passed by Tang Lu’s house, I saw that the doors were closed. I knocked and no one answered.  Tang Lu had promised to wait right here, for me to bring Doraemon back. I knew that I failed my mission. But she should’ve been here.  The heavy rain crashed down to earth like cascading waterfalls and the water mingled into a river on the ground. I felt so drowsy that I had to sit down right next to Tang Lu’s door and rest my head against the wall.  Tang Lu never showed.  Holding a funeral right after New Year was considered unlucky; Lao Tang’s alcoholism and bad temper didn’t help either. Barely anyone showed up at the funeral.  It was drizzling on the day of Tang Lu’s burial. In the rain, even the funeral music played by the suona sounded exceedingly forlorn. I walked among the slow funeral procession, no more than a dozen people, my face numb from the rain.  Lao Tang sat in front of Tang Lu’s grave, with a white sack bound to his neck and dangling in front of his chest. He looked stunned, his single leg stretched out straight. It was an awful sight. We walked up to him one by one, tossing money wrapped in white cloth, a token of our bereavement, into that sack before leaving.  A quivering old woman stood before me in line. It was only after she turned around to leave that I recognized her.  “Ms. Chen?”  She stared at me, a look of deep pathos on her wrinkled face, a combination of weariness of the world and sorrow. Her shriveled lips trembled as she spoke, “So you’re here as well, here for Tang Lu’s funeral . . . Tang Lu was my best student, but she’s had the worst life of you all. Now she’s gone, even before me. It’s all because of you. You.”  That took me by surprise. Maybe Ms. Chen was confused in her old age. I shook my head. “I never saw her again after we graduated.”  Ms. Chen didn’t answer. In the cold winter rain, with her back hunched over, she slowly waddled back to her shabby house.  Although she was gone, her final words to me cast an ominous shadow. I pulled on my hood, snuggled up in my down coat, and went home.  Mother was warming herself by the stove fire. “Did you give Lao Tang the bereavement money?”  I nodded. “How did Lao Tang break his leg in the first place?” I asked.  Mother squinted as she tried to recall. Her hands, which were stoking the stove, slowed down. The fire dimmed to deep red color, and a pale gray smoke began to rise.  “It’s been years, but I do remember what happened,” she said, “The day Lao Tang got into a car accident was the same day you fell ill. Remember that time when you got incredibly sick after you were caught in the rain?”  Of course I remembered. That day, after I lost the scrap metal, I went over to Tang Lu’s house in the rain and waited at her door until I fell asleep. When passersby tried to wake me, they discovered that I had lost consciousness. They got my parents to take me to the hospital.  Looking back, there had been warning signs. The day before, I’d caught a cold from falling into the river, and I had a headache in the morning. Oblivious to those early signs, I strained myself on the long bike trip and then walked back in the rain. A high fever hit me right after.  It was the most ill that I had ever been. Due to the delay in treatment, I developed a cerebral edema that resulted in respiratory failure. I spent almost two months in the hospital barely conscious before I started to get better. Upon hearing about my illness, my aunt who lived up North hurried home, scolded my parents for their neglect, and then decided to take me away to live with her as soon as I left the hospital. When the day came for me to wave the village goodbye, I passed by Tang Lu’s house, but the doors were shut, as usual.  “I heard that Lao Tang went to sell the scrap iron riding our family bike, but he was drunk at the time, and he ran into a car,” said Mother.  I nodded. So Lao Tang didn’t turn the iron over to the police as he threatened, but instead wanted to sell them for his own profit. Of course Lao Tang would do that.  Ms. Chen had been right: Lao Tang and I crossed paths, as I was on my way to sell that scrap iron. By seizing the iron and the bike for himself, he got into the car accident that took his leg. The Tang family lost their source of income, and the course of Tang Lu’s life took a sharp turn for the worse. She had broken her promise to wait for me because of Lao Tang’s accident—she was probably rushing to the hospital.  The guilt was not mine to bear since none of this had occurred from my intent, but the undeniable truth was that my actions had directly led to the turn in Tang Lu’s fate and pushed her down the abyss of despair and desolation.  I turned around at once and walked toward the door.  “Where are you going?” Mother called. “It’s cold outside, put on your coat.”  Raindrops pricked at every inch of my bare skin like needles. I pulled my coat on as I ran all the way to Ms. Chen’s house. When I pushed the door open, there was no one on the bed. Taken by surprise at first, I quickly realized where she had gone and went to remove the loose wooden plank right next to the bed.  Again, I entered that deep, dark tunnel. As expected, I spotted Ms. Chen in that room full of strange machines. Her unkempt hair was a clump of weeds under the glaring lights.  “It’s you.” She didn’t turn around to look at me. Her fingers continued to flutter over those complex panels full of buttons. “I knew you would come back here. Tang Lu was my best student and you were her best friend. We are all responsible for her death. We all played a role in her fate.”  “But . . . ” My voice was hoarse. I stepped back involuntarily, feeling the corner of the table press into my lower back, “I didn’t do it on purpose . . . ”  As Ms. Chen continued to operate the machines, a buzzing sound started in the room, growing louder and louder every second. Then, as Ms. Chen pushed one last button, the machines gave a final sigh, and the room returned to silence. She exhaled softly and turned to face me. “Do you understand the nature of time?”  “What?” I was bewildered.  “Time is a river in which we are all struggling to stay afloat. And fate . . . the fate of each individual is as insignificant as a small eddy on the surface of the water. As the eddies of all our fates merge and disperse, everyone becomes the hand that determines the fate of someone else. Intentional or unintentional, every small action changes the course of all the eddies on the river of time. But Hu Zhou, this is exactly what makes time both charming and cruel.”  Her words echoed in the room. I gaped at this old woman I thought I knew. Did Ms. Chen—that elementary school teacher who had always been so glum and cranky in my memories—finally begin to reflect on time and fate near the end of her life?  “But time can’t be altered,” I protested. “Even if I had caused her tragedy, there is no way . . . ”  Ms. Chen gazed at me, her eyes as murky and heavy as pools of aged wine. After a while, she shook her head. “No. Time is changeable. Many sections along this river contain closed loops.”  That comment confused me even more. Ms. Chen raised a bony finger and pointed at our surroundings. “Do you know what this room is for?”  I couldn’t even begin to venture a guess. Ms. Chen revealed the answer: “It’s a laboratory.”  I looked around. With all the wires and machines, it did look like some kind of experiment was going on, but I couldn’t imagine what would be worth studying in this poor little village.  “The lab was founded by the military,” said Ms. Chen, as she petted the machines. “I can’t say much more than that. Even though they’ve given up on this project and haven’t contacted me in more than thirty years, there are still many things that must be kept secret. But I can tell you that we built this laboratory to study closed time loops.”  “What?” I thought I had misheard. “Closed time loops?”  “When the lab was created, researchers were moved here from all over the country; none of us knew what was going on. But . . . but during that special period in the history of our country, all we could do was to follow orders.  “This site was chosen because it has the highest Fan Index number in the whole country. Oh, right, you don’t know what the Fan Index is—it’s named after Lao Fan, who gave his life for science. The upper half of his body is buried out there in the graveyard.”  A chill ran down my spine. “Why only the upper half?”  “Because we couldn’t find the lower half. It took more than ten years for us to succeed in creating an artificial closed time loop. Lao Fan offered himself as the subject of the first human experiment. However, when he got halfway through the river, the unstable closed time loop collapsed. The lower half of his body disappeared into another time and space. The whole river turned red from his blood.”  “The river? You mean the section of the river next to that crooked tree?”  Ms. Chen nodded. “The closed time loop intersects with space in two stable locations: this laboratory and a circular section of the river with a diameter of 1.42 meters. However, time coordinates at the intersection points are completely random. When things floating along the river reach that point of intersection, they are immediately transported to this laboratory.”  “So you labeled all of them?” I pointed at the corner of the room, remembering what I saw when I snuck in here many years ago. The deflated balls and the foam boards were still piled there.  “Yes. I know you’ve been in here before, to retrieve your notebook. But since you never mentioned it to anyone else, I said nothing to you either.” Ms. Chen seemed to have exhausted her stamina from all the talking. Slowly, she lowed herself into a chair and continued. “Despite all the resources and energy poured into them, our experiments made little progress. The experiment was terminated. All the researchers wanted to go home after being caged in this laboratory for so long. But I alone wanted to stay and begged the people in authority to preserve the laboratory.”  “Why didn’t you want to go home?”  “Because I didn’t have one.” Ms. Chen’s lips curled up into a sad smile. “Do you know who Lao Fan was? He was my husband. My home is wherever he’s buried.”  I could only give a small sympathetic nod.  “For the sake of Lao Fan, they kept the machines here, but crossed my name off the official register. In China, back then, there were too many incomplete experiments like this one for people to pay attention to a widow who disappeared into a secluded village.” She smiled bitterly. “I’ve stayed on to complete the experiment in Lao Fan’s honor.”  “When you told me that time could be changed, does that mean you finally succeeded in your experiment?”  She broke into a fit of coughing. She pressed a handkerchief at her mouth, but the handkerchief was soon splattered with blood. I rushed to support her so she wouldn’t fall down. Then, I had her climb onto my back, and I carried her out of the basement laboratory. She was as light as a single leaf.  I tucked her into bed, poured some hot water, and fed her the medicine. She panted for a while before finally catching her breath. “I was so close to success . . . I went over the data and worked through the theory a thousand times, making sure everything was perfect. I was sure that one more try would vindicate Lao Fan and myself. But just as I was about to launch the experimental run, I discovered that a few key pieces of equipment had gone missing from the lab.”  “When was that?”  “Perhaps two or three years after the elementary school had closed down.”  I sighed in acknowledgement. I understood what had happened—Ms. Chen said that the time coordinates at the intersection points on the closed loop were random. When I pulled out those iron gadgets from the river, I must have reached into the laboratory three years later along the timeline. So, it wasn’t until long after I had left the village that Ms. Chen discovered my theft of her instruments.  “I tried to rebuild those missing pieces of equipment, but the Super Crystal Stabilizer could not be duplicated. Its design was too intricate and the raw material too rare. On my own, it was impossible to make another one. Even though I never could prove it experimentally, I assure you that time could be changed.” Her eyelids drooped, a teardrop falling from the corner of her eye and sliding across her wrinkles. “I’m only one step away from realizing Lao Fan’s dreams, but it’s a step I’ll never take . . . ”  All of the burial mounds in the graveyard shivered in the cold shower. I staggered past these old, abandoned graves and stopped at a fresh one. The funeral procession had already dispersed. An empty silence that not even the rain could penetrate was all that was left behind. The white papercraft used at the funeral, soaked from the rain, were scattered on the ground and melded with the earth.  I saw a yellowed picture on the tombstone, a picture of a young girl. She wore her hair in a ponytail and smiled into the camera. I heard that Lao Tang had searched everywhere at home for a picture of Tang Lu, but all he could find was the elementary school graduation photo for her class. He was going to affix the whole photo on the tombstone, but the families of the other students in the photo had stopped him since it would be bad luck. So, he had to crop Tang Lu from the photo and used that as her funeral portrait. With his shaky hands, Lao Tang had not cut cleanly—slivers of my face still remained beside Tang Lu.  I looked at the young Tang Lu and she looked back at me as well. I reached forward, and my fingertips touched her face.  The last time I saw Tang Lu wasn’t the summer after elementary school, but the winter break of my high school junior year.  By then, I had lived in the city for many years. As a seventeen year old, I listened to pop music, played basketball, longed for a pair of Nikes, and had a crush on that girl with long hair from the classroom next door. I hated the way that my home village appeared in my memories: poor and provincial.  However, after all the years away from family, my aunt decided to visit home during Spring Festival. I was again under the same roof with my parents, but I felt like an outsider. Everyone and everything in the village seemed to me filthy and outdated. During the visit, my parents mentioned to my aunt that they wanted me back home since taking care of me was such a burden on her. My aunt turned them down, saying that I needed better education. I sat with them while this conversation happened, and heaved a sigh of relief after my aunt had spoken.  Finally, it was the sixth day after New Year, and my aunt and I were going back to her home. We took Uncle Chen’s tractor into the town, where we were supposed to take the bus to the city and then get on the train back to Shanxi. However, as we arrived in town, we found the bus had already left. It took half an hour to find a car that was going to the city. The driver wanted a hundred for us to hitch a ride; my aunt bargained him down to fifty.  Just as we were about to get in the car, we heard a timid, shaky voice behind us. “Are you going into the city?”  I turned around and saw a girl, about fifteen or sixteen. She looked tiny compared to the huge sacks on her back and in her hands. It was as if those sacks mattered even more to her than herself.  “Yeah.” I said.  “May I catch a ride as well? I want to go to the city too . . . but I missed the bus.”  She looked familiar, so I nodded. “It should be fine.”  The driver poked his head out from the window and muttered grouchily. “If you’re adding another person, then you have to pay more. Sixty yuan or no deal!”  My aunt gave him a death glare, then she looked at the girl. “We’ll pay forty and you can pay twenty. Is that all right?”  The girl hesitated. The driver impatiently tooted the horn a few times. She nodded. Just as I helped her stuff her luggage into the trunk, I blurted out, “Tang Lu?”  “Long time no see.” She smiled at me, but she didn’t seem too surprised. “Hu Zhou, you’re taller now.”  “Where are you going?” I tried to cover up the awkwardness of not recognizing her earlier.  “Shanghai. You?”  “I’m going back to Shanxi with my aunt. School is starting soon. Are you going to school as well in Shanghai?”  I regretted the words as soon as they were out of my mouth—with all that luggage and the way she was dressed, she obviously wasn’t going to school.  Tang Lu smiled again. “I’m going to work.”  My aunt in the front seat turned around to give Tang Lu an appraising look, and then turned back again.  “What kind of work?” I asked.  “I don’t know yet. I’ll see when I get there.” She paused, and then added, “There must be something out there for me to do.”  We fell silent. I watched a white bird sweep over the river as the car sped across the bridge. The train station was on the other side, where my aunt and I would board the train to Shanxi.  Tang Lu spoke up all of a sudden, “Do you still watch Doraemon?”  “No, not for a while now. Why?”  “Oh, it’s nothing,” she said. Her voice sounded a bit muffled, as though she were congested.  The car got off the bridge and inched slowly among the traffic. Surrounded by a chorus of tooting horns, I could see the worn-out train station up ahead, with hundreds of people milling at its door.  “I’ve been watching all this time, but everyone says the show already has an ending.” She looked past me to somewhere far, far away. “I heard that Nobi turned out to be mentally ill. All the stories happened only in his own imagination; they were hallucinations. There never was a Doraemon . . . ”  I thought myself too sophisticated for cartoons by then, and all my memories of Doraemon had blurred. I forced myself to continue the conversation. “Who told you about this ending?”  “I saw it on the Internet. If so many people think it’s true, then it probably is.” Tang Lu lowered her head. “But you told me, for every lonely childhood, there is a . . . ”  She didn’t get to finish her sentence because the car came to a stop in front of the train station. “We’re here,” said the driver.  Tang Lu opened the door and got out. I unloaded the luggage from the trunk, and my aunt handed sixty yuan to the driver. Tang Lu pulled out a plain cloth wallet, counted out twenty yuan in loose change and handed the money over to my aunt.  “No, no.” My aunt looked at me, and then waved her hand at Tang Lu. “Keep it.”  Tang Lu insisted. Unwilling to embarrass Tang Lu any further, my aunt grabbed my hand and headed toward the ticket office. I glanced over my shoulder and saw Tang Lu standing there with that huge backpack over her shoulders, still holding the money. Her eyes were red, as if she wanted to say something.  We merged into the surging crowd in the station, rushing, swirling, eddying every which way. When I looked back again, Tang Lu was gone. I craned my neck and stood on my toes, but I couldn’t find her in the sea of strangers.  A cold raindrop slid down my neck, making me shiver. I ran home. I rummaged through the wooden chest that held my childhood and found the metal gadget with a cubical crystal attached to its cap. Looking at it now, I thought it resembled an ancient-looking USB drive.  I tucked it into my pocket and dashed out again. Mother stopped me. “It’s so late; where are you going?”  I looked at my mother. I looked at my father, who stood at her side and rarely spoke. My heart ached, for they had no language to express how they felt about their son.  I stepped up and gave both of them a hug. Mother looked confused, and Father, unused to such intimacy, just looked awkward.  “I’ll be back soon.” I said.  “When?” asked Mother.  “Not tonight.”  No flashlight was needed. I easily found my way back to Ms. Chen’s house by following the road that I had walked so many times as a child.  I took out the crystal. “Is this it?”  Ms. Chen had gone to bed already, but at the sight of the crystal, she struggled to sit up straight, her voice trembling as she spoke, “Yes, yes, the Super Crystal Stabilizer . . . Where did you find it?”  Instead of answering, I asked another question, “With this, can you send me back to the past?”  Ms. Chen tilted her head up abruptly. “Are you sure you want to return to the past?”  I nodded.  “You have a good life. Are you sure you want to give it up?”  “Good? The reason I came home in the first place was because Beijing has scarred me.”  “Are you hoping to travel back in time to relive nostalgia because the present isn’t as wonderful as you memories? Remember, the past is meant to be remembered, not repeated. In your imagination the past may be better than your present, but once you really enter the past, you may feel very differently. You need to be very sure of this decision.”  “No need to worry. I’m not doing this to escape from the present or to repeat the past.” I took a step forward and gazed into Ms. Chen’s eyes. “I’m going to change something.”  “To change what?”  “According to your theory, I was the cause of Tang Lu’s misfortune. I must then be the one to correct this mistake. I need to be a real Doraemon.”  “You will never be able to come back after you go; do you understand?”  I shook my head. “It’s fine. I’ll grow up again, won’t I?”  I helped Ms. Chen to the underground tunnel and went into the laboratory with her. She replaced the Stabilizer and started to operate those complex buttons, deftly punching in commands. Electric sparks flashed in the glass box on the middle table, growing in intensity every second until they merged into a ring of light.  “I’ve studied the time coordinates of the intersection points of the closed loop for more than a decade. Theoretically, I can control the time at the intersection points with precision,” said Ms. Chen. “Which day would you like to return to?”  I entered the date.  The ring of light expanded and projected outside of the glass box, floating in midair. Ms. Chen nodded, her eyes sparkling. “It seems like my calculations are correct.” She pressed some more buttons, and the ring of light turned perpendicular to the ground, like an oval door.  “I’m going to ask you one last time: are you sure?”  I didn’t need to answer that question anymore. I took a deep breath and stepped up to the ring of light. It glistened. The glow projected onto my face grew brighter, and the buzzing of currents echoed in the room. Tears suddenly filled my eyes. I walked into the ring of light.  Light. Stickiness. Coldness.  After regaining consciousness, those were the only three sensations I remembered.  I opened my eyes. I was still in the laboratory, except Ms. Chen had disappeared. Did we fail? Confused, I climbed up the underground tunnel and pushed open the door to Ms. Chen’s house. The murky heat of summer enveloped me at once.  It was that gloomy summer morning!  I didn’t have time to be surprised. I rushed to the road and saw a boy on an old bicycle, riding toward the town with a sack over his cargo rack.  “Wait! Don’t go yet.” I stopped him.  The boy halted. A look of bewilderment flashed across his face as he held the bicycle. “Who are you?”  “Never mind that. Your sack isn’t sturdy; the things inside will fall out if you keep pedaling. Here, let me redo it for you.” I took off my down coat and wrapped it around the sack, then tied the sleeves to the bicycle’s frame. “Okay, this will do. Also, when you go into town, don’t take the bridge, but go through that little side street instead. Do you understand?”  The boy had been looking at me in confusion. He nodded, hesitantly.  “Go.” I waved my hand at him. “And come back soon. Tang Lu is still waiting for you.”  “How did you know—”  “Right—after you sell the scrap metal, borrow a rain jacket from that old guy. There will be a storm on your way back. You mustn’t get wet.”  The boy got back on his bicycle. Before leaving, he looked me up and down. “You look a lot like my dad. Are you a relative or something?”  I smiled. “Just remember what I told you. Now go!”  The boy’s figure soon disappeared among the shadows of the trees. I lingered around for a while, and then headed to Tang Lu’s house. However, instead of going in, I stood right across the road from the house, sat down, and waited.  The afternoon crawled by slowly, but I had all the patience in the world. I waited and waited. People passing by looked me up and down with judgmental eyes, but I did not budge. Then, when the drizzles began, I went over to Tang Lu’s house so that the eaves could shelter me from the rain.  A girl peered out. When she saw me, a look of disappointment flashed across her delicate face. Yet, she smiled at me. “Would you like some water?”  “No, I’m just waiting for the rain to stop—but thank you,” I said.  “Oh.” Tang Lu’s face disappeared. A moment later, she came out of the house with two stools and handed me one. She sat down right next to me, her gaze fixed on the curtain of rain that seemed to extend all the way to the horizon.  “Are you waiting for someone?” I asked.  Tang Lu nodded. “I’m waiting for Doraemon.”  “You mean the cartoon?”  “No. It’s a person.” She didn’t turn to look at me, but I caught a glimpse of the side of her face—a sight too familiar.  We sat shoulder to shoulder beneath the roof.  The silhouette of a boy on a bicycle appeared in the rain. Covered head to toe by a rain jacket, he pedaled hard. The girl leaped to her feet at once, tipping her stool over, but she didn’t seem to notice at all.  The boy sped over. He leaned the bicycle against the wall and yelled, “Lulu, I have it!” He was surprised to see me, but he said nothing. He took off his rain jacket, pulled out a thick stack of VCDs and handed them over to Tang Lu.  “Great!” Tang Lu reached for them with a look of joy.  I stood up and stepped into the rain. Behind me, I heard the girl telling the boy, “Thank you, Doraemon!”  And then they started to sing, their hands held together tightly.  It’s all the same every day,  But sometimes dreams may come our way,  As long as there is Doraemon,  Happiness will always stay . . .  Their lively song pierced through the rain and echoed in the village. I didn’t turn around, so I would never know whether the song was for me, or simply for themselves. But that wasn’t important anymore. From this moment onward, fate had changed its course, and the swirls on the river of time would now begin to reform. These two children will set out on a brand new journey. Just like Nobita Nobi and Minamoto Shizuka, they would grow, day by day.  Doraemon had completed its mission.    Originally published in Chinese in Science Fiction World, August 2016.    Translated and published in partnership with Storycom.  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.  Emily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature.", "text": "22990 words, novella\nFarewell, Doraemon\nI escaped the city and returned home on a winter’s day. A vast gloomy sky, whitish-gray as the belly of a dead fish, stretched out in front of me. Sparrows flapped their wings as they hopped on and off the dead branches trembling in the ferocious wind, unable to perch.\nI shivered and tucked my neck into my collar, pulling my suitcase after me as I trudged along the road to the village of my distant memories.\nFather came to pick me up and took the suitcase from my hand. We remained silent for the duration of the walk home. My aunt had taken me away from the village after I graduated from elementary school. The only other time I came back to visit, I was in a hurry as well. For all these years, silence had been the most effective form of communication between my father and me. Yet, from the way he stood up taller when he greeted other villagers on the way, I could tell he was happy. Everyone’s eyes glistened with awe as they looked me up and down. “Is it really Zhouzhou? It’s been years since he last came back. Look how he’s grown! I heard he’s in an office in Beijing now, doing little work for big money. Now that’s what I call success!”\nFather immediately objected, “It’s not like he just sits around all day! They work him hard over there.”\nIt was obvious how much my quiet father had been praising me to the other villagers. I wondered if he would still feel as proud if he knew that I only came back because I fell apart after I caught my girlfriend cheating, lost my job since I was sitting around all day listlessly, broke my lease, and deleted everyone’s number from my phone.\nLooking at these weatherworn faces, I was struck simultaneously by a sense of familiarity and estrangement. I grew up amongst those people’s laughter and curses, complaints and whispers. I remembered all of their faces, but I could not recall their names, as if a glass wall battered by time was stuck in between my past and my present. All I could do was smile and nod.\nWe arrived at home. A two-story house stood in place of the bungalow from my memories, but this house wasn’t exactly new, either. The plaster was cracked and peeled from years of frigid wind. A concrete platform spread out before the house, its blue-gray color a reflection of the gloomy sky. My parents laid out the sun-dried millet and cotton here. In summers, they moved the dinner table out here and dined in the setting sun, and Father would sip his habitual cup of huangjiu.\nIn the kitchen, right across from the concrete platform, Mother had cooked dinner. A sooty apron wrapped around her body, she rubbed her hands together as she gazed at me. I found myself choking back tears. I had been away from her for way too long.\n“You’re back,” she exclaimed. “Come, let’s eat first.”\nFather did not speak during the meal, quietly sipping his wine in between mouthfuls of food. Mother kept the conversation flowing by filling me in on all the little things that had happened over the last few years: my uncle’s son became a street thug after he retired from the army, then was sent to prison after stealing a necklace; our neighbors, although older than most parents, were blessed with a baby girl, but she turned out to be mentally retarded—at the age of five, she still spent her days sitting by the door, grinning and drooling at every passerby; Lao Tang married off his daughter at last, but the groom, dissatisfied with the amount of “tea money” offered by the father of the bride, flipped the table during their wedding . . .\n“Lao Tang?” I laid down my chopsticks and looked up at Mother. “Is that the family that lives by the entrance to the village?”\n“Yes, that’s the one—I thought you’d forgotten. Do you still remember how you and Lao Tang’s daughter used to play together?”\nI chewed my food and said nothing.\n“She’s been married for three years or so, although her man is nothing but trouble. He gets wasted every single day—and after he’s drunk, he doesn’t just yell at her, but also smashes things. They’ve already replaced their TV several times. A few days ago he kicked his motorcycle and broke it . . . thousands of yuan gone right there.” Mother sighed as she poked the stove fire.\nAll of a sudden, my mother’s voice seemed to fade away, and I couldn’t focus on her venting anymore. I gobbled down the rest of the food and stood up to go wash the dishes, but Mother shooed me away.\nNight arrived early in winter. By six, the village was already shrouded in darkness. After a day spent transferring between planes, trains, buses, and even tractors to get back here from Beijing, the exhaustion made me crawl into bed early.\nI found myself dangling right above a river, a whirlpool under my feet. The entire distorted world was crashing right down into the river, quickly swallowed by the swirling water. Inch by inch, I was sinking too, and no matter how much I fought and struggled, I couldn’t free myself. All I could do was watch the whirlpool consume my legs and crush them; then came my waist, my stomach, my chest, and my head at last . . .\nI woke up with a start. I stared blankly into the darkness, my chest heaving heavily. This nightmare had haunted me at midnight for years. It was an indelible scar left by my home village.\nI reached for my phone and saw that it was only twelve o’clock. The rising night wind beat against the window as I tossed and turned in my bed. Unable to fall back to sleep, I decided to get up.\nI turned on the lights. A beam from the filament lamp ripped through the darkness, illuminating a dusty wooden chest in the corner of the room. I remembered Mother telling me that she had kept all of my childhood things in that chest, and curiosity urged me to peek inside.\nTo my disappointment, there were no toys, no notebooks, no letters. The chest contained only a few textbooks from elementary school and a weird-looking gadget. It had a round metal top, seamlessly attached to a crystal cube. I couldn’t remember how it had ended up in my hands—probably some trash that I picked up as a child—so I tossed it aside. Nothing else in the chest appeared interesting. However, just when I was about to close the lid, I noticed a few VCDs hidden beneath those old textbooks. The discs had the same label, written in fading, neat characters: Doraemon.\nThe night was still young. The laptop I carried back with me had a built-in CD drive, so I powered it up and inserted one of those VCDs after wiping off the dust.\n“It’s all the same every day, but sometimes dreams may come our way, as long as there is Doraemon, happiness will always stay . . . ”\nI nearly jumped at the familiar tune that reverberated through the cramped, silent room. I fumbled to lower the volume. The images on screen were blurry and flecked with noise, and flashing blue stripes interrupted the scenes once in a while as a result of the scratched CD surface.\nThe robot cat opened its mouth, and another robot cat was sitting on its tongue; that one opened its mouth as well, and there was another inside . . .\nI watched Nobi and his robot cat dance around in those long-forgotten scenes as I leaned against my headboard with the laptop on my blanket. After a while, the lovely Shizuka joined them as well. With limited storage capacity, a single VCD could only hold five episodes—about thirty minutes total. After the episodes ran out, the spinning CD drive came to a halt. The screen flashed bright blue. I felt my muddled head clearing up slowly in the cool night air.\nDoraemon. Doraemon. Doraemon.\nThose four syllables made up the magic key to my locked memories.\nMy childhood was utterly uninteresting until Doraemon came along.\nIn many people’s memories—especially memories about living in the countryside—childhood was filled with fun. They never had to worry about anything. They wandered through the fiery sunlight of summertime, caught crayfish at the lake, played marbles by the door, and swam in the river . . . the memories often brought a wistful smile. But in reality, back then, not a single child actually enjoyed that kind of life. To them, childhood was as sluggish and boring as a snail that crawled along under a scorching sun, and every summer never seemed to end. Everyone wished to grow up as fast as possible and escape from that sticky mess of a childhood, just like how adults longed to escape from the emptiness and meaninglessness of their routines.\nParticularly me.\nAs a kid, I never fit in. Be it tree climbing or swimming, melon stealing or fishing—none of these activities interested me. When other boys chased after each other with long bamboo sticks and played games of war, I always strolled alone, passing by the golden canola flowers, brushing past snow-white cotton blossoms, and weaving my way through rippling fields of wheat.\nSometimes I would run into my parents working in the fields as I roamed about. Alarmed by this pointless—even somewhat creepy—habit of mine, they ordered me to go back home and play with the neighbors’ children. I agreed, but nonetheless continued with my meanders. Perhaps I wandered even farther, out of their view.\nMy wanderings came to a stop when Yang Fangwei’s family bought a VCD player. Yang Fangwei’s father, who everyone in the village called Cripple Yang, owned a brewery. He was notorious for making a fortune from diluting the liquor with water. After he got wealthier, he bought the VCD player for his son. Back then, only a few families in the village could afford to own a TV. And even if someone owned one, it was the old-fashioned kind that had two knobs on the right upper corner. Since the signal here was so weak, the TVs could only receive a few local channels. But the Yang family had a huge color TV that went with the VCD player. With the help of some occasional movie discs rented from the nearby town, that VCD player was easily the most popular gadget in our entire village.\nEvery evening, villagers of every age gathered in the Yang family’s yard and demanded a movie. At first, Cripple Yang ignored everyone, but the raucous would-be audience seemed to have an inexhaustible supply of persistence, sometimes hanging around until midnight. Due to their noise, Cripple Yang couldn’t even sleep with his wife, so he finally gave in and set the TV and the VCD player up outside to play movies, swearing loudly as he went.\nThe crowd filled the yard. Everyone brought their own stool and focused all of their attention on the TV screen. Despite the heat and the swarming mosquitos, people stayed until the very end of the movie.\nThe Yang household was particularly packed on Sundays, because everyone knew that Cripple Yang delivered his liquor to town every Sunday, and he would always return with a new batch of VCDs. Once, his father brought Yang Fangwei with him to town. After browsing through the new arrivals in the VCD store, he chose ten VCDs with a round-shaped robot cat printed on the cover.\nThat Sunday, instead of the familiar Shaolin Kung Fu monks, the TV showed scenes from a vibrant cartoon. People started to complain: “Lao Yang, what kind of show is this? Cartoons are boring. Play something else!”\n“Who put you in charge? Each disc cost me thirty fen to rent. Did you pay for that?” said Cripple Yang.\nThe villagers booed. “Don’t be so petty, boss! You make more than thirty fen with the water you mix into a half-kilogram of your booze. Play another movie!”\n“Nah, Weiwei rented this one. It’s his favorite.”\nSo everyone had to watch the cartoon. But the childishly exaggerated scenes couldn’t hold their interest. After a while, the adults began to file out.\nBut the children stayed, fascinated by the show.\nI sat among the children, deeply engrossed in the world of this magical robot cat. It had come to Nobi all the way from the future to stay by his side. Its pocket seemed to never run out of miraculous treasures. It could take Nobi through heaven and earth, through time and space. Most importantly, it was there to cheer Nobi on when he befriended the beautiful Shizuka. Lost in the cartoon, I didn’t even notice the mosquito bites on my leg.\nAfter we went through two more VCDs, Yang Fangwei stood up: “Still here? You’ve seen ten episodes already! Go home, and come back tomorrow.”\n“Same time?” I asked.\n“You can show up earlier tomorrow. It will be harder for you lot to get home if it’s too late, anyways.” He turned his head and acknowledged someone on my left. “Lulu, you live farther out, don’t you? Be careful on the way back.”\nUntil then, I hadn’t even noticed the girl sitting next to me. With the TV switched off, I couldn’t make out her face, but I could see her hair, tied back into a ponytail, swaying in the darkness.\nWe stood up to go home, and soon everyone parted ways. In the summer, the fields were never too dark, because starlight and fireflies illuminated the path. The road I took passed by a vast paddy field. I was very familiar with that road, thanks to all my laborious explorations of the village. However, as I strolled along, I realized that someone was following me—that girl. A firefly flitted past her shoulder in the enveloping darkness, casting a glow against her right cheek for a brief second, revealing her pale face and glistening black eyes. But when I was about to take a closer look, the firefly took off.\nShe halted as well.\nI suddenly understood her reason for following me. The paddy field was right in the center of a graveyard, where all the village’s dead were buried. The desolate night wind whistled among the tombs. On the other side of the burial ground was a flowing river; the waves clip-clopped as if someone was treading on the water’s surface.\nThe girl was scared to walk alone. That was why she had kept close to me, carefully maintaining a distance of five or six meters.\nSo I slowed down. That was the summer after fifth grade. We were short, and our steps were small; it would take ten minutes for us to cross this paddy field. I remembered the opening song from the cartoon and I hummed softly: “It’s all the same every day, but sometimes dreams may come our way . . . ”\nThe stars brightened and a gentle wind rose up, flowing around us. My steps felt light and I was fearless, even when we passed by the grotesque house standing at the border between the graveyard and the paddy field.\nOut of the paddy field we went, and straight into the village. Half a mile away, dozens of windows glowed warmly.\n“Thank you.”\nI thought I heard her speak, but I wasn’t sure. Those two words were as soft as the ripples left by a feather landing on placid water. The wind grew heavier. I turned and saw the girl turning onto a small street, her head kept low. A house stood a little ways down that street. I remembered that whenever Father passed by, he would call out a greeting to Lao Tang—the village’s notorious alcoholic and gambler.\nShe entered the house.\nI never saw her face that night.\nI leaped off my bed and rummaged through the chest. There were only books and VCD discs; that photo was missing.\nI rushed downstairs and woke Mother. She sat up, sleepy-eyed, and looked at me with confusion.\n“Mom, where’s my photo?”\n“Photo . . . what photo?”\n“That class photo from my elementary school graduation. I put it away with the textbooks. Where did you leave it?”\nMother squinted against the bright lamp. After a while, she said: “I can’t remember. That was more than ten years ago. Why do you need it?”\nBelatedly, I realized that I had impulsively woken my mother in the middle of the night. I shook my head and walked back to my room. Outside the window, the night was as thick and impenetrable as iron, and the wind sliced through that iron with a terrifying squeal. Just when I was about to close the lid of the chest, a sudden idea struck me. I took out the worn literature textbook and tried bending it; sure enough, I felt something hard tucked between the soft pages. I flipped the book open, and a photo lay right there between two pages.\nHidden in the book for all these years, the photo had not faded. The paper, however, felt brittle and rough against my fingers.\nI scanned the image. Three teachers sat together in the first row, with a sullen old woman in the middle. Her eyes were even grimmer than her expression. They seemed to be staring straight at me, piercing through the dozen-odd years between us.\nMy eyes brushed past her face and found myself in the corner. Beside me was a girl. I finally saw her face—the delicate features resembled the strokes of an ink-wash painting. Her hair was pulled back into a ponytail and her lips were curled up at the corners. I couldn’t tell if it was a smile, or if the photo was simply distorted. Behind her was a poplar forest; her hair danced among the falling leaves, drifting in the wind.\nTang Lu . . . I whispered her name before a tide of memory overwhelmed me.\nThat torrid summer, my meaningless wanderings came to an end. Every day, after breakfast, I went over to Yang Fangwei’s house and hung out there with the other kids. He was a good sport—whenever we ran out of VCDs to watch, he would ask his father to bring more back from the town.\nThe Yang family was quite well off. They were the first in the village to install a tile floor. In the sizzling heat of summer, sitting on the cool floor was delightful.\nWhoever came to the Yang house to buy liquor marveled at the scene: a bunch of otherwise rowdy children sitting quietly in Yang Fangwei’s yard, gathered around a TV.\nOne day, a skinny man came to the yard. When he saw us, he raised his voice at someone sitting in the corner. “Lulu, go get me a half-kilogram of liquor.”\nTang Lu stood up and took the empty bottle from him. She walked toward the Yang family’s liquor cellar with her head lowered.\nI needed to go to the bathroom, so I followed her. I saw Tang Lu walk to Cripple Yang and heard her speak in a pleading voice, “Uncle Yang, I would like to get a half-kilogram of liquor for my dad.”\nCripple Yang glared at her, a cigarette sticking out between his teeth. “Did Lao Tang give you money?”\nTang Lu shook her head.\n“Heh, the man’s tab is so overdue that he’s too embarrassed to see my face, so he sends his little girl here for more. Go tell your dad, I’m not running a charity here, and he needs to pay up.”\nTang Lu didn’t budge. She lowered her head and choked out, “My dad is going to beat me if I don’t return with his liquor.”\n“What a monster! Karma is going to catch up with him one day.” Cripple Yang stomped on the cigarette butt. “Tell your dad, this is the last time!”\nAfraid of missing out on the cartoon, I rushed back to the room after going to the bathroom. All the children were focused on the TV. Lao Tang sat to the side, baring his blackened teeth as he spouted off. “What’s the fun in this cartoon? I heard Cripple Yang’s got some foreign stuff, but he watches it all by himself, in secret. Eh, Yang Fangwei, do you know where your dad hides those discs? Pull them out and play them instead. I’ll show you kiddies what real women look like. They are much better than this cartoon!”\nYang Fangwei frowned and ignored him. Everyone else looked disgusted as well, but Lao Tang blabbered on, careless of the frigid reception he was getting.\nThankfully Tang Lu came in soon, and handed Lao Tang the bottle. Lao Tang grinned, took the bottle, and went away. Tang Lu went back to her corner, but everyone around her scooted away immediately, leaving an awkward gap.\nShe hung her head in shame, and didn’t look up for a very long time. I caught a glimpse of a teardrop gliding down her cheek, and it soon disappeared into her cotton dress. It wasn’t until ten minutes later, when Nobi let out a dramatic scream because of Gian and Suneo’s teasing, that she finally looked up. Her face was still lined with tear trails, but she started to giggle at Nobi’s ordeal.\nHer expression held a beauty mixed with melancholy. After that, whenever I saw flowers in the rain, I couldn’t help but be reminded of Tang Lu’s face, caught between tears and laughter.\n“How many episodes are there of Doraemon?” Wang Xiaolei, who had a runny nose, piped up. “This cartoon is so great—what are we going to do if we finish it?”\nYang Fangwei made an assuring gesture. “Don’t worry. I saw a huge pile of these discs when I went to the rental shop. The owner told me there are hundreds, maybe thousands, of episodes, and the creators keep on drawing more. This cartoon will never end!”\nYang Fangwei was in my class, but he was taller than the rest of us. When he talked, he had a charisma that was rare among the village people. Everyone nodded as he spoke. After all, since he was responsible for the cartoon showing, he was basically our leader.\nThis cartoon will never end.\nTo me, his words were an enchanting spell. In this world, the most vibrant flowers eventually wilted and the most stunning beauty faded away. Nothing lasted forever. No matter how much we loved people and things, time eventually took them all away.\nBut Doraemon was different. Yang Fangwei said that Doraemon would never end, just like how the robot cat would always stay by Nobi’s side. I almost burst into tears.\n“Does that mean we can watch on until we’re as old as our grandparents?” I blurted out.\nAnother voice joined me. “I want to always keep on watching.”\nThe speaker and I looked at each other. It was Tang Lu, the girl who had followed me home yesterday. Her pale cheeks flushed pink. Her features were so delicate that I was afraid to hold my gaze. I lowered my eyes.\n“Why are you turning so red?” Yang Fangwei looked at me, confused. He turned to the girl and said, “Don’t worry, Lulu. You’ll always be able to watch Doraemon at my place.”\nBut Yang Fangwei didn’t keep his promise. Soon after, Cripple Yang bought him a video game console. This was the most top-notch gadget ever—after connecting it to the TV and inserting a game cartridge, you could control Bill Rizer with a joystick and go on adventures in a 2D world. All the boys were enthralled by this new toy. Yang Fangwei always took one of the controllers, and the other boys took turns with the other one. Even the ones who didn’t get a chance to touch the controller enjoyed watching the others play.\nAll the kids were thrilled except for Tang Lu and me. Yang Fangwei had returned the rented Doraemon VCDs and exchanged them for bundles of game cartridges. For a few minutes, we stood behind the children who were excitedly peering at the screen, then left together in silence.\nI walked home with Tang Lu following me like usual. But this time, when we passed by her house, she lingered and stayed behind me.\n“Why aren’t you going home?” I asked.\nShe pointed at her house and whispered: “My dad . . . ”\nI realized what she meant. I sighed.\nWe stood together. Wind rose and brushed against her bangs. It was a gloomy afternoon, and neither of us had anywhere to go.\nMired in those memories, I fell into a deep slumber. It was bright out by the time I opened my eyes again. With no central heating, wintertime in my home village was always cold and damp. I curled up under the blanket, unwilling to get up. But after my mother came to the room to call on me a few times, I had no choice but to grudgingly inch out of bed.\nIt was almost Spring Festival, and our family was about to do our regular Chinese New Year shopping. Usually, my father would catch a ride on someone’s motor tricycle—one of those with a large cargo bed in the back—to go shopping in town. But his legs, weakened and stiff with old age, slipped, and he almost fell off the back of the tricycle. I stopped him and offered to go in his stead.\nWordlessly, my father went into the house and brought out a coat.\n“It’s windy. You must cover up your head and hands when you’re on the tricycle,” he said.\nThe coat was old and ragged. Even holding it made me turn my nose, and I was reluctant to wrap it over my hands at first. Yet, once the tricycle took off, the blistering wind immediately turned into daggers that slashed across every inch of exposed skin. I pulled up the hood of my down jacket at once, turned around to keep my back toward the wind, and finally folded my hands in the sleeves of that old coat.\nThe tricycle bounced along the rocky road, puttering past the scraggly poplar trees with their dangling leafless branches. The village in wintertime was veiled in gray—gray sky, gray fields, gray roads, and houses—as if the desolate season had washed out every vibrant shade.\nThe village was so far from the town that getting all the holiday goods for New Year’s was a chore for the villagers. Usually, a tricycle would take multiple families on each trip and ask each family to pay ten yuan. The tricycle detoured around the village for a while, stopping at different houses until it was packed with five passengers, all squatting on the tricycle’s cargo bed.\nOne of the young men had a familiar face. As I wondered who he was, he spoke to me first. “You’re Hu Zhou, right?”\nHis face quickly merged with the memory of the face of that charismatic boy. I smiled. “Long time no see, Yang Fangwei.”\n“It has been a while! I haven’t seen you since we graduated from elementary school.”\nIt was true that we had lost touch after I moved to Shanxi with my aunt. But his comment wasn’t exactly the truth, either. I had been back once before. The village was so small that we couldn’t possibly have avoided each other on that visit. But our relationship was a little awkward, such that though we had spotted each other from afar, we didn’t wave or say hi. Now, we were both stuck on the back of a tricycle, huddled up in our coats. Not talking would be awkward, but even with the ice broken, neither of us knew how to continue the conversation.\nThe freezing wind howled in our ears. After a few minutes of silence, I asked, “Where do you work now?”\n“I used to teach in Chongqing, but as you know”—he grinned at me, though there was some bitterness behind his pale, frozen-lipped smile—“teaching doesn’t pay much. So, I probably won’t be going back after New Year.”\n“Where would you go then?”\n“Perhaps Shenzhen. I’ll look for a job there.”\n“Shenzhen is such a stressful place, though.”\nHe gave me a look. “How is that different from anywhere else?”\nI nodded. “Yeah. Can’t get away from the rat race.”\n“I can’t hold a candle to you, though.” He smiled again. “I heard that you live in Beijing. Don’t you draw cartoons or something?”\nI actually make comic books—I wanted to explain, but then realized the futility of it. Instead, I only gave a nod.\n“My wife’s giving birth soon. With another mouth to feed, I need to make more money. My dad’s brewery is in so much debt . . . ” His shoulders sagged forward. “Your dad said that you make ten thousand yuan a month. That’s like my salary for five months. You see, you’re living while I’m just enduring. You’re educated—that’s the difference, you know?”\n“Everyone endures. I’m not doing so well, either.”\nHe obviously didn’t believe me. He smiled again and said nothing further.\nFor the rest of the trip, we remained silent. The tricycle whizzed through the cold wind and more withered trees zoomed past us. Gradually, the lone houses that we occasionally passed by turned into busy streets, crowds of pedestrians, and endless shops overflowing with goods.\n“We’re here. Go do your shopping while I go get some medicine.” Uncle Zhao, who had pedaled us here, yelled with a cigarette in his mouth, “Let’s meet back here at twelve.”\nOur legs were numb from all the squatting, and we had to shake them out after getting off the tricycle. Yang Fangwei stomped his feet while he smoked. He finished a cigarette in a few puffs, crushed the butt with his heel and started to leave. I called his name.\n“Do you know . . . how Tang Lu is doing?”\nHe halted and turned around to look at me.\nA sudden pang of embarrassment urged me to explain myself, “I heard from my mom that she isn’t doing so well.”\nYang Fangwei’s hand reflexively reached for another cigarette. He finished half of it in one long drag.\n“No, she isn’t doing well.” His expression was hidden behind a thin veil of smoke. “She’s doing terribly.”\nWithout Doraemon, I resumed my old habits of wandering aimlessly. However, there was one small difference—Tang Lu followed me around through the rest of that summer.\nWe weaved through the fields, past the budding cotton flowers, and between the crisscrossing village roads. When adults saw us together, they teased us. “Zhouzhou, did you get a sidekick?” Whenever this happened, I strode past them haughtily, my head held high; Tang Lu, on the other hand, always blushed and lowered her head, then sheepishly ran to catch up with me.\nDuring those long walks, I told Tang Lu all the secrets that I had discovered about the village: Yang Fangwei’s father was crippled because someone had beaten him up for watering down the liquor; Zhao Laogui, who lived in the back of the village, would surreptitiously lead other people’s cows away and hide them in the fields during the night, then take them back the next morning to receive ten yuan from each duped (but grateful) owner.\nTang Lu was enchanted by my stories. In her eyes, the familiar village had suddenly taken on a new aspect.\n“You know so many secrets,” she said.\nThe sparkle in her eyes made me slap my chest and exclaim, “These secrets are nothing. There’s a bigger mystery that I haven’t told you yet!”\nI took her to the river, the lifeline of our village. I was told it was a secondary tributary of the Yangtze River, and we relied on it heavily for irrigation. It flowed through the paddy fields and curled around the graveyard. There were many terrifying legends about the section of the river next to the tombs. Wang Sansha, who lived next door to me, swore that he once heard a strange buzzing noise coming from underground when he passed by the river at night.\n“I couldn’t tell if it was just the river, or if a corpse was turning in its coffin . . . ” He sniffled, his voice eerie as he told the story.\nThere were many more ghost stories about that part of the river: a water buffalo’s head suddenly disappeared while it was grazing by the riverbank, and the blood sprayed over ten meters on the ground; before the founding of the People’s Republic, someone fell into the river and returned more than a decade later, looking exactly the same as the day he vanished . . . Adults used these ghost stories to stop us from straying too far, but I never believed in them. Tang Lu never did, either, although the stories still frightened her a little bit.\nWe trotted gingerly along the river, passing one grave after another on our left. Tang Lu followed close behind, shivering and whispering apologies to all of the tombstones.\nWe reached a secluded spot along the riverbank, hidden behind two neglected graves. A crooked tree by the river leaned over the surface, almost parallel with the water. I steadied myself by holding onto the trunk, then pointed at the river and asked: “Do you see anything strange about the water?”\nAfter observing the water for a while, Tang Lu shook her head, still shivering.\n“Keep your eyes on this.” I picked up a twig from the ground and tossed it to the middle of the river. The twig drifted along the current, but just as it was about to reach me, it sank abruptly without making a sound, as if something beneath the surface had pulled it in.\n“Hmm?” Tang Lu was stunned. She picked up another twig and tried to repeat the experiment, but the result was the same every time—no matter how smoothly the twig floated along the river, it always sank as soon as it entered a certain part of the surface.\n“Not only twigs, but also foam boards, a backpack, balls . . . I’ve tried all of them already. See, I told you this was the biggest mystery of the village!”\n“How did you discover this?”\n“A while ago I made a small boat out of wood and let it float down the river, while I followed along on shore. I wanted to see if it would eventually reach the ocean, but as soon as we got here, it sank all at once.”\n“Have you told anyone else?” Tang Lu lifted her chin as she spoke, the twilight painting her visage a striking shade of orange.\nI shook my head. “I told my dad and tried to take him here, but he slapped me instead. Now I’ve only told you. This is a secret between you and me—don’t tell anyone else!”\n“I won’t!” Tang Lu raised her hand solemnly to give an oath. Then she asked, “But do you know why things sink when they reach there?”\nI shook my head.\nTang Lu dropped her gaze to the river, and looked into my eyes again. “I think this might be Doraemon’s pocket that can hold everything in the world. Maybe there is a robot cat hiding in the river!”\nShe looked so adorable that a mischievousness rose in my heart. I lowered my voice. “Maybe there are dead people hiding in the river instead. Remember what Wang Sansha said? They’ll drag whoever is on the surface down with them!”\nLike a terrified bunny, Tang Lu grasped my sleeve, and I could tell that she was on the verge of tears. I felt guilty about my prank. We walked back home along the river, through the graveyard, and back to the paddy field, with Tang Lu still clinging to my arm. The setting sun hung low over the horizon, casting a golden gleam all over the village. The river shimmered.\nJust as we were about to exit the paddy field, I heard an unexpected squeak. The door to the lone house between the tombs and the paddy field opened, and a gloomy looking old woman stepped out onto the doorstep, staring right at us. Her face was covered in wrinkles and age spots. Although she looked about fifty years old, her eyes were icicles frozen for thousands of years. A momentary glance at her eyes was enough to chill my whole body.\nI fled in the direction of home, dragging Tang Lu with me, but I could still feel the chill running down my spine.\nI have seen her eyes in a million nightmares since that day.\nIt was half past eleven by the time I finished my New Year shopping. The wind was uncannily fierce. I dropped the packages at my feet, curled up, and stared into the dead gray sky.\nUncle Zhao plodded out of the pharmacy and tossed a few boxes of medicine into the tricycle’s cargo bed, swearing loudly. I skimmed casually through them, and saw that they were all DMARDs and enteric tablets. “Uncle Zhao, are these for the elders in your family?” I asked.\n“Blargh! Not for my family! It’s Chen, that old bastard. She begs me to buy her medicine all the time.” Uncle Zhao lit a cigarette and took a deep drag, then blew out fumes of white smoke from his mouth and nostrils.\n“Chen?” My pulse quickened.\nUncle Zhao took another puff. “It’s Chen, the teacher. She taught you back in elementary school, didn’t she?”\nI said nothing. The pair of eyes from my nightmare reappeared before me, giving me a chill.\nEveryone was back by noon. The tricycle’s motor sputtered as it wound its way back. As we reached the entrance to the village, Uncle Zhao took a detour around the paddy field. A carpet of withered yellow grass spread across the field, the dry blades shivering in the blistering wind. Graves littered the land, mound after mound, extending to the horizon like a stretch of hills. A few of them remained neatly preserved, embellished by tombstones, but most of them were neglected. Among the clumps of rampant weeds, those graves looked utterly abandoned.\nBetween the cemetery and the paddy field, that house still stood alone. It looked even more worn down than in my memories. The red brick walls were so stained that they were now a muddy yellow. Parts of the roof were covered in hay where the tiles had gone missing. I couldn’t even imagine how one could survive a harsh winter in a house like this.\nUncle Zhao pulled over to the side of the road. Without getting off the tricycle, he yelled “Medicine’s here!” at the house, dropped the boxes from the pharmacy at the front door, and drove on.\n“That’s it?” I asked, confused by the abrupt departure.\nUncle Zhao didn’t even look back. He stomped hard on the rusty clutch. “That house is unlucky. What else do you want me to do? Go in? You know nothing. She lives all by herself, right next to this graveyard, and no one knows what she’s up to. A while ago, a cigarette factory owner from the county wanted to buy this piece of land and make it into a family burial ground. He offered her over a hundred thousand—think about how many people would kill for that price!—but Chen wouldn’t hear it. When the buyer came to visit her, she refused to even let him in the door!—Hey, what are you doing?”\nI had hopped off the cargo bed. I shouted at Uncle Zhao to deliver my purchases home, then I turned around and walked back toward the dilapidated house. The hay sheltering the roof flapped noisily in the wind, but there was no sound of any activity from within. It seemed like the inside of the house was even more devoid of signs of habitation than its exterior.\nI picked up the boxes of medicine and called out. No one responded, so I pushed on the worm-rotten wooden doors. The loud squeak set my teeth on edge. I went in. To my surprise, even though the room was dark and sparsely furnished, all the simple furniture was kept spotless and neat. In the very back of the room, an old woman lay on a bed. With the blanket pulled all the way up to her chin, I could just make out her gray hair.\nShe stirred from a light sleep, then cast her gaze on me. She spoke before I could open my mouth, her face an amorphous blur in the murky light.\n“Hu Zhou, is it really you?” she said. “My eyesight has worsened—come closer. You’ve grown so much.”\nI started to tremble. The medicine boxes fell from my hands and landed with a thud.\nI once resented this woman so much that I had imagined a thousand times how to seek revenge. I had come inside to deliver the medicines to her in order to witness for myself how terrible her life had become. Yet, when she lay in front of me, old, weary, and vulnerable—when I saw how time had relentlessly destroyed her—all I felt was a sense of absurdity and helplessness.\nShe struggled to sit up and smiled at me.\n“You still remember me?” I picked up the boxes of medicine and placed them on her bedside table. She glanced over at them, but quickly turned her gaze back to my face.\n“How could I forget you? Out of all my students, you and Tang Lu have impressed me the most. Besides, you are the only one to ever discover my secret.”\n“Secret?” I was taken by surprise at first, but then I realized what she was referring to. I tapped the wooden floor with my feet. “You mean what’s down there?”\nShe didn’t respond. She fell back into the sheets again, wheezing heavily, as if those few simple words had drained all the energy from her body. The room was too dim for me to see her expressions clearly. Wind gushed in from the cracks in the window, nipping at her wispy, tangled hair.\nMy elementary school was built right next to the entrance to our village. It used to be a bustling place: students came from several nearby villages; every grade level consisted of over a hundred people, distributed into three or four classes. However, the year I entered sixth grade, it suddenly became popular for everyone to seek their fortune in Guangdong Province. Adults who labored in the workshops could earn up to a hundred and twenty yuan a day, and even children who discreetly sewed garments behind closed doors could make at least thirty. This was much more effective as a way to make a living than trying to harvest rice from the fields. Some factory owners from Guangzhou even sent buses to our village just to bring people over to work, and every day entire families boarded the buses, lured by dreams of riches. Bus by bus, our village gradually emptied out.\nBack then, one teacher from the elementary school would always stand on guard by the village’s entrance, attempting to stop the adults who tried to bring their children along on the gold digging journey.\n“If you want to go, you can go, but please leave your children here!” she said. “The children need to study. Education is the only way out for them! How will they make their way in the world without schooling?”\nAnnoyed, the adults would push her out of their way. But she would stubbornly hold on to their sleeves. “Don’t take the children away. They are the future. They have to stay in school.”\n“How will your books teach them to make money?” The adults would throw this question in her face. She had no answer for it.\nThe adults pried their sleeves from her fingers and boarded the bus, pulling their children behind. The children kept their heads down, unable to look their teacher in the eye.\nAfter the interminable summer break, in roughly two months’ time, the number of students in the sixth grade dropped from more than one hundred to thirty-odd. A lot of the teachers were gone, too. So, what used to be three different classes were merged into one, and three remaining teachers were put in charge.\nOur politics teacher was Mr. Ding, an old man who always rushed into the classroom after his farm duties, read aloud the assigned passages in the textbook in front of us, and then hurried back to plow his fields; our literature teacher was a young man who frequently became so captivated by his card games that he forgot to come to class, and sometimes, he would even drop the textbook and run out during class when friends swung by to invite him to join the teahouse parties.\nAll the other subjects were taught by a woman surnamed Chen. Around fifty years of age, she lived alone. Allegedly, she was the one who had patrolled the village entrance and tried to stop those bus boarders.\nA chill seized my heart the moment I saw Ms. Chen—I could never forget those cold, piercing eyes of hers from that time during summer break, when we had stumbled by her house next to the graveyard.\nLuckily, my fear didn’t persist for too long, because I saw Tang Lu. She and I had been in separate classes before, when there were many more students, but we were now together in the same merged class.\nThat was when I found out that this girl, despite the timid and lonesome look that she exuded all the time, had always been a top-ranked student. The only student who had better grades was a boy who had disappeared to Guangdong, probably threading and sewing in some dark room. Since she was the head of the class, Ms. Chen sat her in the very first row, which was half a classroom away from where I was seated.\nRight after the first class of the day ended, I dashed up to the front of the classroom. Yet, my footsteps reflexively slowed down as I was about to approach her. A kind of shyness—particular to children of that age—crept up in me. No one was watching me at all, but somehow I felt I was at the center of a web of judgment and scrutiny.\nAbsorbed in her notebook, she didn’t look up. I plodded past her in silence and exited. When I returned to the classroom, she glanced up at me, but quickly went back to studying again.\nWe hadn’t spoken in two months, and all the time that we had spent together like each other’s shadow way back in summer had faded into a blur in my mind. Maybe she had forgotten already.\nAll the other boys started to notice Tang Lu as well. Once, Snotty Liu got assigned to sit next to her. He spent the entire day looking at Tang Lu with an idiotic grin on his face, so ecstatic that even his snotty nose ceased to dribble. Much to Ms. Chen’s chagrin, she couldn’t make him stop even after pulling on his ear several times, so she had to switch him to a different seat. When Fatty Zhang, the notorious class bully, saw Tang Lu playing hopscotch with some other girls, instead of sneering and taunting them, as was his wont, he asked to join the girls’ game and begged Tang Lu to teach him. He even nodded along rhythmically as Tang Lu lectured him on the fine points of hopscotch technique in her soft voice, as if he were some kind of model student.\nMs. Chen shooed him away when she saw this. “Why haven’t I seen you devote yourself like this to schoolwork?” she demanded.\nMs. Chen was so protective of Tang Lu that no one was able to approach her. I suspected that in her eyes, everyone else was ignorant and lazy, a mere continuation of our uncouth ancestors, doomed to waste our lives away in this muddy, grimy little village—except for Tang Lu.\nShe arranged our seats strictly according to our grades, sticking all the students with bad grades in the very back of the classroom so we wouldn’t be a bad influence. Cripple Yang once visited Ms. Chen’s house carrying a few kilograms of pork rump in an attempt to convince her to move Yang Fangwei to the front row as well, but Ms. Chen drove him out of her house without hesitation. The next day in class, she picked on Yang Fangwei to solve problems. After Yang Fangwei hemmed and hawed for a while, unable to produce an answer, she hissed at him, “Get your ass off the toilet if you aren’t going to shit. Go tell your dad that!” We howled with laughter; Yang Fangwei turned beet red.\nFor a while, Ms. Chen had high hopes for me as well. She summoned me to her office and tried to convince me to put in more academic effort. However, she was amazed to find out I was only interested in literature and paid no attention to math or the sciences.\n“Why are you interested in literature, the most useless subject of all? Only science—only quantum and space physics—can change the world. How would reciting poems do you any good?”\nShe went on in that vein, and her speech was peppered with lots of words that I had never heard before. All I could do was keep my eyes lowered to the ground. Eventually, she realized that she wasn’t getting anywhere with me, so she sighed and dismissed me with a wave.\nBefore leaving, something on Ms. Chen’s desk caught my eye—carved out of pagoda wood, it was a small, rather childish-looking boat. I stared at it, somewhat stunned. It took me a moment to realize that it was very similar to my wooden toy boat, which had been swallowed by the river over summer break. Even the shape of the arched awning and the scratch marks on the wood seemed identical. Yet, as I took a closer look at it, I noticed differences. Judging from the darker color and the rotten bits, this wooden boat had been around for at least seven or eight years, but my wooden boat had only been lost for a few months.\n“Still here?” Ms. Chen murmured as she drew checkmarks and crosses on the homework she was grading.\nI pointed at the wooden boat. “Ms. Chen, this boat . . . ”\nMs. Chen looked up and her eyes narrowed. “What about it?”\n“How long has it been here?”\n“More than a decade, I think.”\n“Oh.” I turned around, ready to leave, but Ms. Chen stopped me. “What do you know about this boat?”\nThe bell for the next class rang, so I shook my head. “Nothing.”\nAfter that, my grades got worse and worse, and I began to spend all my time with Yang Fangwei and the other boys—passing notes during class and stealing from the orange orchard behind our school. Ms. Chen usually ignored us—until our shenanigans got out of control, at which point she resorted to her usual repertoire of punishments: standing in the corner, caning, and so on. All of us hated her guts.\nI never got a chance to speak to Tang Lu, either. The classroom wasn’t exactly spacious, but it was enough to be an unbridgeable gulf between us. Surrounded by my new buddies, I continued with all the mischief. As a result, my seat moved farther and farther toward the back, until I hit the back wall.\nJust before the end of the fall semester, Ms. Chen wrote down five math problems on the blackboard and asked us to come up and write out the answer. Whoever failed to produce the correct answer received smacks in the palm. None of the first five students called up could solve their assigned problem. Lips trembling with anger, Ms. Chen whacked their palms so hard that she even snapped her bamboo ruler in half. Fatty Zhang started to sniffle after three or four hits. Panic-stricken from witnessing this scene, all of us prayed hard that our names wouldn’t be called.\nMs. Chen pointed her finger directly at the back row. “Hu Zhou, Yang Fangwei, Peng Hao, Snotty Liu, and Zhang Ma—the five of you, get up here now. I swear, I’ll whack your palms until they break in half if you can’t solve these!”\nShe hesitated for a second, and added, “You know what—Zhang Ma, go back and sit down. Tang Lu will replace him. I’m going to show you all that someone in this room can actually solve these problems!”\nWe rose from our seats, glum and scowling, dragging our feet. Zhang Ma, who had been granted a last-minute reprieve, looked exaggeratedly relieved. He made faces at us as we made our way over to the blackboard.\nThere were five word problems. Tang Lu was assigned to problem four, and I to problem five. To the left of Tang Lu stood Snotty Liu with his perpetual lines of snot over his lip.\nEven now, I could still clearly recall problem five: Xiao Ming reads a storybook. He finishes 1/9 of the book on the first day, and 24 pages on the second day. The ratio between the pages he read over the two days and the pages left is 1:4. How many pages are there in total in the book? As I stood in front of the blackboard, no matter how much I racked my brain, those words remained a huge tangled mess.\nMs. Chen loomed right behind me, bamboo ruler in hand. A drop of cold sweat slid down my spine. My hand, clutching the chalk until my knuckles were white, hovered before the blackboard, but I could think of nothing to write. My legs started to tremble.\nNo one else could solve their problem either, except for Tang Lu, who was inscribing her solution on the blackboard, line after neat line. I was struck by the sight of her. Deeply absorbed by the intellectual challenge, her face was lit up from the side by the bright sun through the window, a combination of soft lines and curves like the young willow branches that sprouted in early spring.\nYears later, when I was learning to draw, I noticed a certain pattern in my illustrations. It was my habit to draw a face in profile, outlined with a few simple strokes, and then filled in with strong, contrasting shadows and highlights. For a long time I wondered where I had acquired this quirk. The answer turned out to be this seed buried in my memory. Whenever I picked up a pencil, the memory would begin to sprout and unfurl, until it had blossomed into Tang Lu’s face on my sketchpad.\n“What are you looking at?” Ms. Chen’s scolding interrupted my drifting thoughts. I felt a whack on my head from the bamboo ruler. “Work on your problem. If you can’t solve it, come and receive your punishment.”\nI shook my head in defeat. However, just when I was about to drop the chalk and accept my fate, I heard a soft whisper: “Make x the total number of book pages.”\nI halted; so did Snotty Liu. We both turned in Tang Lu’s direction. Still conscientiously writing down her answer, Tang Lu murmured under her breath, her lips barely parting, “Don’t look at me. The teacher will notice.”\nBoth of us snapped our heads forward at once. Snotty Liu glared at his assigned problem and muttered, “I’m supposed to solve for flour and sugar. There’s nothing about a book—”\n“Not you. I was talking to Hu Zhou.”\nSnotty Liu slumped. Snot gushed from his nostrils, dribbling down his chin.\nI quickly wrote down “Let x = total pages” on the blackboard and whispered: “And then?”\nMs. Chen hissed, “Quiet!”\nAfter a long pause, Tang Lu whispered back, “1/9 times x plus 24 is equal to x divided by open paren 1 plus 4 close paren. Solve for x.”\nI copied down the equation and swiftly worked out the answer. During this whole time, Snotty Liu kept on goggling at Tang Lu with pleading eyes, holding back tears as well as snot. Tang Lu ignored him, put down her chalk, and turned around to face our teacher. “Ms. Chen, I’m done.”\nMs. Chen nodded. “That’s correct. You see, these problems aren’t difficult at all. Aren’t you four ashamed of yourselves? Now come up for your—wait, Hu Zhou, step aside.”\nI scooted to the side so that Ms. Chen could see the blackboard. She gave my solution a quick once-over, pushed her glasses up her nose, looked again, and turned her gaze back to me. “Well, well, well—look what we have here! The sun has risen from the west. Hu Zhou, you may sit down.”\nShe pointed at the other three people, all scratching their heads in helpless confusion. “You three! Come here now.”\nDazed with relief, I started to walk back to my seat in the back corner. Tang Lu had sat down in her seat already, her back upright. I glanced at her, and noticed that a strand of hair was plastered against her cheek. She looked beautiful, with an expression both earnest and serene, as though she were intensely focusing on the textbook.\nI was sure that I saw her wink her right eye.\nWith the New Year shopping done, the celebrations leading up to Spring Festival began in earnest. The teahouse bustled with young people who had returned home after working thousands of miles away during the year so that the whole family could be together for Spring Festival. Everyone passed the time by playing Mahjong. Out of boredom, I went to join them. In the cramped brick room that was the teahouse, a heady brew of swears, malodorous bodies, and cigarette smoke soon made me dizzy. Time slipped through my fingers like Mahjong tiles and cash.\nThe day before Spring Festival, I arrived at the teahouse late, and there was only one empty table left. Three other young men soon came in and sat down at my table. I knew two of them, but the third face was unfamiliar.\nThe stranger who took the seat right across from me was short and scrawny. As soon as he sat down, he passed a pack of cigarettes around the table. I frowned and refused the offer.\n“Not good enough for you, eh?” He lit his cigarette, and puffed smoke. “I don’t think we’ve met. Are you someone’s distant relative?”\n“Da Lu, you should be embarrassed, offering these Honghe cigarettes that probably only cost you five yuan per pack!” someone interjected. “This man here is a big deal—he works in Beijing, making cartoons. Tens of thousands in his pocket every month!”\n“Cartoons? Ha, my wife used to love cartoons.” Da Lu reached for the Mahjong tiles, a cigarette dangling from his lips. “Come, let’s play.”\nIrritated, I kept on making bad plays. Within half an hour, Da Lu had won the pot several times in a row. His grinning face annoyed me even more—not just because of the money I lost or the yellowed teeth he bared at me, but because of the mockery I sensed behind his smirk.\nDa Lu burned through cigarette after cigarette. I felt like I was about to suffocate from the malodorous, musky air. After losing another game, I pushed the money away and said, “Let’s call it a day.”\nDa Lu spat on the ground and wiped the spittle from his lips with his sleeves. As he collected his winnings, he said, “It’s not even noon yet. Don’t be such a bad sport! You’ve only lost a few hundred; that’s nothing for a big shot like you from the capital! Let’s play a few more games.”\nI ignored him and got up, heading for the door. Just then, a woman came into the teahouse and walked directly up to Da Lu. In a pleading voice, she said, “It’s New Year tomorrow. Please come home and help me tidy up the house. I really can’t manage it alone.”\nDa Lu glared at the woman.\n“Can’t you see I’m busy? Go get your dad instead!”\n“My dad . . . you know he can’t . . . ” The woman’s voice lowered.\n“Right, your dad is useless with his one leg.” Da Lu snickered and shook his head. “Whatever—leave me alone. It’s just washing some sheets and dusting the walls. You can finish the work in a day if you don’t dilly-dally. Fortune is smiling on me today. Can’t you see I’m winning bread for our family?”\nAlthough the woman’s pleas were futile, she stubbornly refused to leave.\n“Stop standing here, it’s going to bring me bad luck! I was winning just now. See how he’s not playing anymore as soon as you showed up?” Da Lu gave the woman a threatening look, then turned his eyes to me. “Hey, are you gonna play or not? I’ll go find someone else if you’re out.”\nMy eyes had been glued to the woman’s face the entire time. Da Lu’s call snapped me back into the reality. I averted my eyes quickly as I mumbled, “Yeah . . . yeah, let’s play some more.”\nAfter that, I was even more absentminded. My sight was so blurry that I almost couldn’t tell the Mahjong tiles apart. I lost so many games that reaching for more money became a nearly mechanical movement. Da Lu, on the other hand, was ecstatic from winning. He must have thought me a fool.\nAnd this fool could not stop himself from staring at the woman next to Da Lu.\nHer draping hair appeared grayish through the smoke. A wrinkly red down coat hung loosely about her. As she shifted about, those wrinkles stiffened like hundreds of pursed lips. The clumsy misspelled logo told me it was a knockoff.\nAgain and again, I told myself she couldn’t be Tang Lu, yet everything—from her profile to the hair that gently brushed against her cheeks—screamed to me that she was.\nI had imagined my reunion with Tang Lu a thousands times over, but I never expected we’d meet this way, in a stinky noisy goddamn teahouse.\nMy throat felt dry; it wasn’t from the smoke.\nFinally, Tang Lu realized that there was no moving Da Lu. She turned around to leave. As she exited the teahouse, I stood up and said to the table, “I need to use the toilet.”\nI caught up with her a half block away.\n“Tang Lu.” I hadn’t said her name aloud for so long it sounded strange.\nShe turned back. Her eyes brimming with confusion.\n“It’s me.”\nShe hesitated, and then shook her head. “I don’t know you.”\nI pressed. “Do you remember that notebook with Doraemon in it?”\n“Doraemon?”\nI shook my head, unable to hide my disappointment. “Forget it.”\nI could feel Tang Lu studying me carefully. When she saw that I was done talking, she turned around to leave, her shoulders hunched against the cold wind.\nI felt like a lifeless robot as I plodded back into the teahouse and reached for more Mahjong tiles. Once again I was plunged back into a vortex of rowdy curses, clinking tiles, and slamming fists. The noise around me oscillated: sometimes further away, leaving me in a lonely void; sometimes close by, pounding my eardrums until they threatened to tear. Smoke fumed from everyone’s noses and mouths, and thickened until I was on the verge of suffocation. I sprang up, rushed out of this revolting hellhole, bent over by the side of the road and dry heaved.\nAfter the incident with the math problems, my friendship with Tang Lu resumed. It was as if the ice between us over the past few months had melted in an instant. Every day, after school, she would leave first while I tarried, waiting for the others to go on their own way. She’d linger at a particular crossroad until I caught up, and then we’d walk back home together.\nBy then, my home had turned into a war zone. My father’s affair with the neighbor’s wife had been discovered; the husband stormed over to our house, and my mother was humiliated. My parents fought, and then lived as two strangers who happened to share the same house, never speaking to each other. My aunt made a trip home to mediate, but it did no good. All she could do was pat my head and sigh.\nEvery evening, I came back to a dead house. It got so bad that no one even cooked dinner anymore. We made do with leftovers found in the pantry.\nAs for Tang Lu, her father’s alcoholism got worse. He was often seen drunk in broad daylight; sometimes he would beat Tang Lu for no reason at all.\nAs a result, both of us dreaded going home. Carrying our backpacks, we trudged as slow as possible along the road, keeping each other company. After all these years, the details of the memories of those conversations had faded. I’d like to think it also had something to do with how cold it was: when we spoke, our words froze and crystallized in the chilly air, fluttering down like snowflakes.\nOur walks lasted for a very long time, long enough for twilight to fade into nightfall. The veil of darkness would fall upon the village, and the lanterns glowing along the banks would transform the river into a bright ribbon zigzagging through earth. Then, we would drop her off at her home, and I would continue down the path to my home.\nAll that I could recall of our conversations was that we discussed Doraemon. She still remembered those dozens of episodes of Doraemon that we watched together during the summer, and she said with a sigh to me, “It would be so great if we could keep on watching.” Her cheeks trembled in the cold wind.\nHot blood rushed through my veins. I patted my chest and promised, “Don’t worry, I’ll draw more for you!”\nTherefore, before winter break, I emptied my savings and used the only four yuan I had in the world to purchase crayons and a notebook. The notebook was not the half-yuan sort that was supposed to protect students’ vision with yellow pages, but the thick kind with elegant ink-wash painting embellishments along the edges that cost three yuan. A luxury like that wasn’t available in our village’s little general store, so I had to ride my bike in the freezing wind all the way to the stationary store up in town. I didn’t have enough money for the crayons and the notebook, but I begged and pleaded and refused to leave until the shop owner finally gave in.\nAll winter break, I stayed cooped up in my room, earnestly working on my project. I imagined that an ancient dinosaur had kidnapped Shizuka. With the help of Doraemon, Nobi traveled through time to the age of the dinosaurs. After a series of heart-stopping adventures, he finally saved Shizuka.\nThat winter was especially dry and cold. Although the skin on my hands was chapped and cracking, I kept on drawing. Those colorful scenes poured out onto the pages as if the crayons had come to life and guided my hands instead of the other way around. That was the first time ever in my life when I truly felt the joy of creating. I had to dab at my eye when I illustrated Nobi standing before Shizuka to shield her from the bloody jaws of three ferocious dinosaurs, and I could not hold back a grin when I depicted Shizuka planting a quick kiss on Nobi’s cheek after both of them were safe again.\nAfter I finished everything, I wrote the following on the first page of the notebook with due solemnity:\nFor every lonely childhood, there is a Doraemon.\nTo Tang Lu—My Shizuka\nWhen classes resumed after the break, I brought the thick notebook with me to school, hoping to find an opportunity to hand it to Tang Lu. However, the moment I pulled it out of my backpack, Fatty Zhang ripped it from my hand and yelled, “What do we have here? Don’t tell me that you actually finished your winter break homework!” He got ready to flip open the pages.\nSince Fatty Zhang was such a bully, usually I kept my distance. But not this time. I leaped at him, grabbed the notebook with one hand, and pushed at his chest with the other, my eyes red with fury. Fatty Zhang, who was much bigger, easily shoved me away, crashing me into a desk. But I got up immediately, let out a roar, and threw myself at him again.\nFatty Zhang was startled. He was not expecting that I would fight back so fiercely. However, in front of all our classmates, there was no way he could hand back the notebook without a fight.\nWe wrestled each other, but I was no match for him. Soon, Fatty Zhang was sitting on my chest as he panted. He bent down and picked up the notebook. “Now I’ve got to see what’s—Ah! Let go!”\nI bit into his hand and clamped down my teeth until I tasted blood. The sharp pain made Fatty Zhang tear up, and he had no choice but to let go of the notebook and drop it next to my head. As soon as I loosened my jaw, however, he grabbed the notebook back and threw a hard punch in my face.\nThe blow stunned me. After Fatty Zhang struggled to his feet, I remained on the ground, unable to get up. Notebook in hand, he taunted me, “Who do you think you are, bastard? Watch me rip your shitty notebook into pieces—”\nHe saw several other students flinching and whipped about.\nMs. Chen was standing at the door to the classroom.\nAfter hearing about what had happened, Ms. Chen helped me up from the floor and asked if I was hurt. I felt dizzy, but I shook my head. She slapped Fatty Zhang’s palms ten times, so hard that Fatty Zhang’s eyes watered. She picked up the notebook and flipped through it. As soon as she saw the words I wrote on the first page, she smirked. “You are much too young to have such thoughts on your mind. Why, you’re as shameless as your dad! I’m not going to punish you, but I am confiscating this notebook. I have to stop you from being a bad influence on your classmate.”\nSince I had always harbored an instinctual fear of Ms. Chen, I could only watch helplessly as she left the classroom with my treasure. Disheartened, I walked back to my seat, hanging my head. When I passed by Tang Lu, she gave me a questioning look, but I only shook my head and brushed past.\nI spent the entire day unsettled and full of regret, unwilling to let all the effort I made during winter break go to waste. After school, Tang Lu began down the road home slowly, as usual. I gritted my teeth and muttered to her, “Wait for me; I’ll be back!”\nI turned around and dashed back to the school. First I went to Ms. Chen’s office. I searched on her desk, but didn’t see the notebook. After thinking for a second, I scurried in the direction of the paddy field.\nAfter a snowless winter, we got our first snowstorm that day. By dusk, the air was full of fluttering snowflakes. I sprinted across the paddy field so fast that the whirling cold wind and snow gushed into my collar and down my neck. However, neither the cold nor the eeriness of the graveyard could stop me from getting to Ms. Chen’s house.\nI knew I had a lucky break when I saw the huge bronze lock hanging in front of Ms. Chen’s door—she had come home and left again. I circled her house, and found that both the door and the windows were secured. The chimney was the only way in. I climbed onto the roof, and scooted down-chimney until my feet hit the ground. It was dark inside, but I didn’t dare turn on the lights. I kept my eyes wide open and felt my way through the house.\nMy heart thumped as though someone were beating a drum in my chest. My fear, however, did not stem from the graves around the house. In fact, I’d rather be surrounded by thousands of shrieking walking corpses than be caught red-handed by Ms. Chen. I couldn’t even imagine her wrath if she found out that I had snuck into her house.\nI searched the house thoroughly, but found no sign of my notebook. I didn’t want to give up yet, so I examined the furniture piece by piece. Just as I made my way to the bed, I felt something odd underfoot—one of the wooden planks next to the bed was loose. I gave it a tug, and it popped up.\nBeneath the wooden plank wasn’t a muddy earth floor, but a deep tunnel. A set of stairs spiraled into the darkness.\nI inched down the stairs, feeling for each step with the tip of my toes. I thought it would be even darker underground, but surprisingly, as I reached the bottom of the stairs, I saw light at the end of the tunnel.\nThe tunnel was only three or four meters long. I crept through and discovered a door on the other side; the light I saw was spilling from the door seam. I pressed my ear against the door. After confirming that it was completely silent inside, I took a deep breath and pushed the door open. At once, the tunnel was flooded with amber light.\nI was utterly stupefied by what lay before my eyes.\nFor a thousand times after, when I recalled that moment, I would still doubt whether my memory was playing a trick on me—the sight that greeted me was enough to overturn my entire perception of the impoverished village. Sometimes I wondered if I had dreamed the scene, and the fantasy had then invaded my memory, corrupting it.\nI saw machines. Rows and rows of machines that I could not name.\nThe basement was about twenty square meters in size. Both the walls and the floor were cast out of a smooth, gray-brownish metal. The ceiling was dotted with lights that illuminated every corner of the room, leaving no trace of shadows. Blocky machines with red, yellow, and green blinking lights filled the space, and electric cords snaked over every inch of the floor.\nIn the center of the room was a large platform supported by three columns. On the platform was a cubical glass case, about the width of my palms held together. At first glance, the glass case was empty, but I thought I saw faint electric sparks fizzle now and then in the air trapped within the case.\nI probably would have stood there for hours, dumbfounded by these enormous, intricate machines. Fortunately, I soon spotted my notebook, placed right at the edge of the platform. I grabbed it and stuffed it under my jacket.\nI was about to leave when a heap of objects in one corner of the basement caught my eye. I saw a few branches, a shabby backpack, and deflated balls with faded colors. The collection probably would have appeared random to anyone else, but to me they weren’t random at all: all of them belonged to me. During the summer, I had watched all of them sink into the river through the ominous whirlpool that I had discovered.\nI rummaged through the items and noticed that every one had a label. The labels had turned yellow with age, but the handwriting was still legible.\n“Date: July 13th, 1982. Net Weight: 243g. Origin: Unknown.” This was on the label attached to the ball. The branches, however, were dated back to 1985 and 1992. Every label had a different date, and the dates covered a wide range.\nI examined the labels one by one, but they confused me even more. But since I had found what I came here for, I dropped the mystery. I left the basement, exited the house from the chimney, then dashed across the paddy field, my clothes covered in soot. As I ran away, I saw a lonely figure crossing between the graveyard and the paddy field, stopping at that mysterious house.\nIt was Ms. Chen. Thank heavens that I had gotten out of there in time.\nI sprinted along the roads. The snow had gotten heavier; tiny white specks fell from the dark blue sky and fluttered around me. My heart started to race: It was late, what if Tang Lu had already left and gone home?\nShe was still there. She had been waiting at the crossroad this whole time, her petite figure indistinct, as if she would melt into the snow flurries at any moment.\n“Here, this is for you.” I ran over and carefully pulled the notebook out from under my jacket. Although I was covered in chimney ashes, I made sure that not even a speck of dust landed on the notebook.\n“Did you get into a fight with Fatty Zhang today because of this?” Tang Lu took the notebook. Her cheeks were bright and flushed from the cold, but glowed with the warmth of her smile.\n“Yeah, it’s a new episode of Doraemon I drew for you. Took me the whole winter break! No one is allowed to see it except you.”\nShe flipped to the first page and her eyes fell on the two sentences that I wrote for her. She lifted her eyes to the starry sky; after a long silence, she said, “Hey, do you think Doraemon really exists?”\n“Yes,” I nodded, my face serious. “Of course Doraemon exists!”\n“Why have I never met one before?”\nI contemplated the question, and then blurted out, “Because I am your Doraemon!”\nTang Lu giggled at my embarrassed expression. “Are you my Nobi, or my Doraemon?”\n“I am . . . I am both of them! Don’t worry, you are our Shizuka, and we’ll always be here to protect you from anything trying to hurt you in the world.”\n“You’re amazing!” All of a sudden, she stood on tiptoes and planted a soft kiss on my right cheek, pulling away immediately.\nI stiffened as if a lighting bolt had struck me.\nI tried to relive that moment, but her lips were too soft and cold, the sensation melting away as quickly as snow. When I touched my cheek, I felt a tinge of wetness on my fingertips, but I couldn’t tell whether it was the kiss from her lips or the kiss from a snowflake.\nTang Lu closed the notebook, held it against her chest, and turned around to leave. Shaking off my shock, I caught up to her. Our usual walk home seemed especially long that night. We remained silent for the rest of the journey, quietly treading through the flurries of snow.\nWe walked until the snow had turned our hair white—as though we had grown old together.\nThe weather was especially dry and cold on New Year’s Eve. The difficult year was finally coming to an end. After the family reunion lunch, Mother washed and dried all the old laundry in the household, and then took me to the graveyard to pray to our ancestors.\nAs we reached the crossroad, we saw a small crowd gathered before a house. It sounded like the family living there was having a fight, because some in the crowd were trying to intervene while others spouted their opinions. I glanced at the house and realized it was where Tang Lu lived.\nIndeed, as soon as my mother and I pushed our way through the crowd, we saw Tang Lu sitting on the ground, her hair loose and unkempt. She still wore the same red down coat, but parts of it had been torn. A slipper hung loose from one foot; her other foot was bare and dirty, turning blue from the cold.\nShe was crying, and her cheeks were red and swollen. She mumbled something with a glazed look on her face. I couldn’t make out her words clearly with all the noise surrounding us, but I caught enough to understand that she was saying that she couldn’t take it anymore.\nMother said: “Heavens! What a shame. Didn’t they make peace just now? And here they are fighting again. On New Year’s Eve, too!”\nSomeone answered, “Well, this time it’s worse. Da Lu gambled away eighty thousand yuan yesterday. Tsk, I heard that his eyes turned bloodshot from losing so much.”\nMother sighed. “Lulu wanted to build a new house with that money.”\nMy eyes were fixed on the woman sitting on the ground. She wailed and murmured, and all I could see was her naked foot. The sight seemed bleak in the piercing wind.\nThe air suddenly stank of alcohol. Da Lu rushed out from the house and slapped Tang Lu across the face, hard. The crisp sound, like a dry branch snapping in half, made my skin crawl. Blood gushed from Tang Lu’s nose. The short, scrawny man had turned into a frenzied leopard: he huffed and puffed, his face beet red. He screamed at her, “To hell with you! All I did was lose some money, but look at you wailing out here with everyone watching—have you no shame? Your dad is a goddamn cripple, and you are a fucking jinx!”\nI realized that Lao Tang, Tang Lu’s father, was standing at the door as well. With one leg left, he could only lean on his walking stick, shuddering in fear and humiliation. He seemed to want to stop Da Lu somehow, but he just stayed where he was, lips trembling and eyes darting around.\nNo one in the crowd intervened either. I saw Yang Fangwei standing among the others and smoking, his face expressionless. I wanted to take a step forward, but my mother grabbed me by the arm. She shook her head.\nAfter a few more punches, Da Lu tried to get Tang Lu back into the house, but a few tugs weren’t enough to lift her up. So he grabbed her by the back collar of her coat and dragged her along the ground instead.\nTang Lu’s hair and face dragged in the dirt as they crossed the road. I saw a drop of blood fall, but it was soon lost behind a cloud of dust.\nOn the way to the graveyard, Mother told me, “It wasn’t that no one wanted to help. We’ve tried before, but it always turned out worse for her. Da Lu is a real monster—he has spent time in prison. Sure, if we had intervened just now, we could have stopped him, but we can’t stick around at his house forever. He would have beaten Tang Lu within an inch of her life when he got the chance.”\n“Why did Tang Lu marry him?” My voice was muffled.\nMother frowned as if digging through her memories. “You left the village after elementary school. There are a lot of things that you don’t know.”\nI gradually got Tang Lu’s story out of Mother. The summer after we graduated elementary school, Lao Tang broke his leg. The Tang family emptied all their savings to pay the cost of hospitalizing him. As a result, one semester into middle school, Tang Lu had to quit school to support the family. She started off as the apprentice of a tailor; a year after, she went to work in a clothing factory in a town nearby. There, she spent ten hours a day in a closed-off underground workshop, hunched over the sewing machine as she struggled to piece together cloths of terrible quality in the dim light. After work, she returned to her dormitory, cramped quarters packed with other workers, all girls her age, and tried to get some rest. However, soon that factory was reported for hiring underage workers, and Tang Lu was sent home. The local police station boasted their victory of busting the factory and the story made headlines in the newspaper; yet, for Tang Lu’s crumbling family, it only added to their growing misery.\nAfter a week at home, Tang Lu could no longer stand her father’s cold, disappointed gaze from his sickbed. She begged Auntie Shen, who was about to leave the village for the fabled riches of Guangdong, to take her along. Auntie Shen didn’t want more trouble at first, but Tang Lu knelt in front of her house for a whole night, giving up only as the sun rose.\nThe morning of Auntie Shen’s departure came. She got on the bus, packed and ready to go. Yet, as the bus pulled out of the village, and the roadside poplar trees swept by the windows, Auntie Shen jumped up from her seat, swore loudly, and demanded that the driver stop the bus. She walked back to Lao Tang’s house, grabbed Tang Lu, and stormed out. She cursed at Lao Tang, “It’s fine if you’re going to hell, but spare your child!”\nTang Lu followed Auntie Shen to Guangdong, and they found work together. At first, they worked as seamstresses, but the entire industry declined as automation spread. Hundreds of thousands of garment factory workers in Guangdong lost their jobs as a consequence. During that New Year season, Auntie Shen obtained a fake ID for Tang Lu that added two more years to her age, so that she could work legally. After New Year, Tang Lu moved to Shanghai, then to Shenzhen, and finally landed in Beijing. By the time she settled in Beijing, I had graduated from university and been hired by the comic book company.\nWe were both alone in a strange land. During that year, we might have even crossed paths—in the subway, the streets, or convenience stores. Among the streets and buildings of Beijing, crowded with thousands of expressionless faces, we wouldn’t have recognized each other even if we brushed shoulders.\nWhile I was securing my place in Beijing, Tang Lu was growing tired of this meaningless wandering. Exhausted, she returned home at last. For a village girl, the age of twenty-three was past the prime for marriage, but no one in the village wanted to approach her—whoever married Tang Lu had to take in the crippled, alcoholic Lao Tang as well. Allegedly, Yang Fangwei had talked to his family about marrying her, since the Yang Brewery was doing well. However, the Yang Brewery went bankrupt, and the idea died on the vines. Fate had slammed the door shut on perhaps the last opportunity for Tang Lu to find some happiness.\nIn the end, a matchmaker came to Tang Lu’s home with Da Lu, who was from the neighboring village. Tang Lu did not like him at first, but after dinner, Da Lu walked over to her as she was flipping through channels on the TV, unable to focus on anything. She stopped at the children’s channel.\n“Do you like watching cartoons?” asked Da Lu.\nTang Lu nodded.\n“Well, me too.” Said Da Lu.\n“Which one?”\nDa Lu scratched his head and thought long and hard. Finally, he responded: “Dora . . . Doraemon.”\nTang Lu turned to regard the scrawny young man. He didn’t seem as crude and pugnacious as other people believed.\nBut Da Lu’s real nature was only revealed after the wedding. Tang Lu moved in with Da Lu’s family and lived with a few of his other female relatives. Not even a month into the marriage, Da Lu got drunk, and came back home to beat her. All of her in-laws only stood and watched. Da Lu also had the habit of smashing things during his drunken rage. The furniture, the TV, the motorcycle . . . with a cacophony of screams and sounds of things breaking, this already indigent family became even more impoverished.\nTang Lu tried to help with the finances by trading in town: A/V equipment, noodles, cheap clothing . . . she tried her hand at selling anything that was popular, but her businesses never lasted long. Every few days, Da Lu hounded her for money so he could gamble or drink. Even so, she had managed to save up a little, dreaming that one day she could build a new house for herself and Da Lu and finally leave those cold, bitter in-laws behind.\nBut now, thanks to Da Lu’s gambling, the eighty thousand yuan that she had saved over the past five years were all gone.\nMother’s narrative was garrulous and rambling. My mind drifted as I listened to her in the sobbing wind. Darkness descended. Fresh candles illuminated many tombs in the graveyard, and those tiny flames flickered in the wind like scattered stars. The last day of the year was about to slip away in frigidity and desolation.\nWhen we passed by Ms. Chen’s home, I asked about her background. Mother shook her head and said, “I only know that she wasn’t originally from the village. People said that she used to be part of the military base here, but then the army left, leaving only her behind. She became an elementary school teacher because she was educated. Then, the school closed because there weren’t enough pupils, but she still lived here.”\nUnder a gloomy sky dark as the sooty bottom of a pot, the shabby house looked as if it were covered in rust. I glanced at it and didn’t ask more questions.\nI stayed up late with my father that night, and killed time by watching the uninspired Spring Festival Gala on TV as we took turns yawning. When it was almost midnight, I took out the firecrackers and prepared to light them during the midnight countdown.\nA clamor ripped through the silent night. Someone was shouting. I leaped up and dashed toward the river.\n“Come quickly! That Tang girl is going to jump into the river!”\nI and the other villagers got to the river, where we saw a figure standing by the bridgehead. Cautiously, we gathered around her, the beams from our flashlights ripping through the darkness to reveal the face of Tang Lu. She was sobbing, tear trails crossing the scars on her face.\n“Calm down!” we shouted at her. “Don’t do it!”\nAbruptly, Tang Lu turned to me. She smiled. “Didn’t you say that everyone has a Doraemon as their guardian?”\nThe smile quickly dissolved in tears. “Why have I never—never—met mine?”\nI was shaken.\nEveryone looked at me. I opened my mouth, ready to say something, but all I could produce were some incoherent syllables.\nA splash. Her figure disappeared from the bridgehead.\nPeople rushed toward the bridge. But I couldn’t move, and the crowd passed me by like a surging tide. All I could think of was how she had remembered everything after all.\nI huddled in my coat, lost and cold.\nThe string of loud pops from firecrackers almost made me jump. I turned around and saw that the night had been shredded by the bright explosions, like some Impressionist painting.\nThe new year had arrived, too late for some.\nDue to the lack of students, the school closed down the summer after my sixth grade. We became the last graduating class. When we took our graduation class photo, everyone knew that Ms. Chen’s eyes were puffy and red, even though she wore her unchanging glum expression. After the photo, she stayed in her chair and wouldn’t get up.\nTo me, however, graduation meant that six years of imprisonment had finally come to an end. My only worry was how to keep myself entertained for the three months of summer break, when the interminable days were punctuated only by the chirping of cicadas.\nMy family purchased a VCD player as well, so that my father could watch opera. That reignited my passion for Doraemon. However, after asking around for a while, all I managed to borrow from others were a few scattered discs. Even the labels on the discs were faded, so Tang Lu wrote “Doraemon” neatly on every one of them. Clearly, these discs were not enough to sustain us for the whole summer.\n“Do you still want to watch Doraemon?” I asked Tang Lu.\nShe nodded eagerly.\nIf I could find an entire set of Doraemon on VCD somewhere, then I could spend every day of this summer break with Tang Lu at my side, engrossed in the fantastical adventures of Nobi and Shizuka.\nThe full set of Doraemon, Ooyama version, consisted of a thousand plus episodes. Even if I could rent the VCDs, it would cost me a hundred and twenty yuan in total. This figure was beyond my imagination. I gathered all of my old textbooks and exercise books and stuffed them into a sack, carried the sack into town, and sold them to the old man at the recycling station. I was given a little over ten yuan in return. To see my six years of schooling reduced to these wrinkled bills made me sad on my parents’ behalf.\n“Books aren’t worth much.” The old man emptied the books from the sack and kicked them into the corner of the room. “Metal, on the other hand, is valuable. Look for yourself on the wall.”\nSure enough, there was a price chart on the wall. I studied it. Three soda cans were worth 0.1 yuan; books were 0.15 yuan per half-kilogram; scrap iron was 1.2 yuan per half-kilogram . . . I sighed, and headed off.\nAnd then, my father got into a fight with Tang Lu’s father. Allegedly, my father heard Lao Tang whispering about his affair to someone when they were working in the fields. Enraged, my father leaped at him and the two of them soon became entangled in a blur of punches and kicks.\nDue to this incident, neither Tang Lu nor I wanted to be at home. Our aimless, melancholic meandering continued on. When we strolled along the river at sunset, two reflections appeared on the river surface as well.\n“Who are they?” I asked Tang Lu, “They’ve been following us.”\n“Shhh.” Tang Lu held a finger against her lips. “These are water people, and they are cautiously observing us, strangers to them. Don’t talk so loud—you’ll frighten them.”\nSo the four of us carried on. The sinking sun lengthened our reflections, and they faded as the light dimmed. Just when the reflections were about to disappear, Tang Lu and I stopped at the special part of the river that always swallowed everything.\n“I’ve always been curious about this,” said Tang Lu. “If the river sucks everything in, then can we take things out from the river as well?”\n“How would we know if we don’t give it a try?” I took off my shirt and prepared to dive, but Tang Lu stopped me.\n“What if you disappear as well, like everything else? No one would play with me then . . . ”\n“Don’t worry. I won’t ever leave you!” I slapped my chest.\nWhat Tang Lu suggested, however, was a valid concern. My eyes landed on the crooked tree next to the riverbank, with its branches drooping so low that they almost touched the water. I had an idea.\nI climbed onto the tree, wrapped my arms and legs around the branch closest to the water, and carefully inched my body forward. That branch was only about as thick as my arm. As soon as I shifted my weight onto the branch, it sank even lower, finally bringing me closer to the river surface. I took a deep breath, about to reach my hand into the water.\n“Watch out!” Tang Lu watched me nervously from the riverbank.\nI dipped my hand toward the river. I imagined a giant snake baring its teeth or a fiery hell beneath this mysterious region of water. Yet, as my fingertips finally touched the water, nothing happened at all—the water was cool, not even hot from the scorching sun.\nI tried to wave my arm in the river. The water felt much more viscous here than elsewhere, and I felt a lot of resistance against my arm. I extended my hand slowly, and my fingertips finally brushed against something hard and metallic. I grasped it and pulled it up until I saw it through the clear surface.\nIt was a square-shaped iron lid with a pattern of holes. It seemed familiar, but I couldn’t remember where I had seen it before.\nI pulled the iron lid out of the water. It weighed six or seven kilograms and now felt much heavier in my hand than it had in water. The branch I clung to shook as if it would snap in half at any moment.\nI got another idea. Slowly, I backed up the bough, holding onto the iron lid with one hand. After I steadied myself against the thick trunk, I shouted to Tang Lu, “Step back!”\nTang Lu did as I asked. I dropped the iron lid to the ground and said, “Look after this! I’ll go fish for more.”\n“What is it for?”\n“You can make so much money from selling scrap iron! The old guy at the station told me that he paid 1.2 yuan every half-kilogram. We could sell this lid for at least ten yuan. It’s even better than selling a sack of books.”\nTang Lu hesitated. “We don’t know if this lid belongs to someone. We can’t steal.”\n“Does this river have an owner?” I shot back.\n“Probably . . . not?”\n“See? Whatever I find in the river should belong to us then. It’s just like fishing. Stop worrying!”\nIt was already dark, and I could see the lit windows of faraway houses. I could even hear my mother calling out for me in the distance. I had to hurry. Using the same method as before, I fished out a couple more iron pieces. All of them looked different: lids and boxes, cylinders and brackets, adding up to about forty kilograms of scrap metal. At this pace, I needed to find just one more object to have enough money to rent the entire Doraemon series on VCD.\nThe last object was bigger than I expected.\nI had to feel around it for a while before finding something resembling a handle. I grasped it, and tried to lift the whole thing up. The tree branch groaned under the weight. An iron box with round corners emerged. Small holes peppered its sides, through which I could see many layers of thin metal “cards” embedded inside. The box was about the size of a television, but significantly denser. On one of the sides of the box was a round protuberance. Small openings that looked like sockets of some kind were found on the other sides.\nI grabbed the handle with both hands and yanked the box up. As soon as it left the water, I heard a distinct pop in the air. Suddenly, the shimmering windows in the distance winked out, and darkness swallowed the whole village.\nTang Lu looked into the distance. “A power outage?”\n“It’s been years since we last had a power outage . . . ” The sight confused me as well. However, we didn’t have much time to spare—it was already too late for us to be out. If we lingered any longer, our parents would surely come looking. I gritted my teeth and kept on pulling at the box.\nI heard a sharp screech and felt myself drop. The branch chose that very moment to snap in half. Still holding on to the box, I plunged into the river.\nA terrifying thought flashed through my mind: the water here had devoured countless things—deflated balls, twigs, and foam boards—that were supposed to float. I would go down as well and never see Tang Lu again. I struggled to catch a last glance at Tang Lu, but I splashed into the river before I could turn my head.\nThe lukewarm water swallowed me whole.\nI thrashed my limbs in despair. However, to my surprise, my feet quickly felt the bottom of the river. I stood up rather sheepishly. So close to the bank, the water only went up to the height of my chest.\nThe broken branch floated on the calm water, showing no sign of sinking either.\nTang Lu was just about to let out a scream when she saw me standing up in the water. She pointed at me and stuttered, “What happened!? Didn’t you . . . didn’t you . . . ”\n“How on earth did all those things sink in if the water here is so shallow?” A breeze chilled me as I waddled toward the shore with the iron box dragging behind.\nWith her eyes fixed on the strange iron box, Tang Lu nodded in agreement. “Good question. And where could all those things you just pulled out have been hiding?”\nI warmed up a little after putting my clothes back on. I had an idea. “I know why!”\n“Why? Tell me!”\n“There’s an Anywhere Door under the river that connects to another space and time. That has to be it!”\nTang Lu giggled. “That’s impossible.”\n“Of course it’s possible! Remember how Doraemon’s pocket is an Anywhere Door, and you can find everything you need in it?” The more I explained my theory, the more plausible it sounded. I nodded solemnly. “It’s in Doraemon, so it has to be real. I think there’s a robot cat living in the river. It knew that we wanted to rent the VCDs, which is why it gave us the scrap iron to help. It all makes sense!”\n“Then why doesn’t it just give us the VCDs directly?”\n“Um . . . ”\nTang Lu helped me out with a smile. “I believe what you said! It has to be Doraemon coming to our rescue. Didn’t you tell me before that there is a Doraemon for every childhood? Our childhood is coming to an end soon, and this Doraemon is here to offer us its final gift.”\n“Yeah!” The mystery no longer bothered me.\nWe collected a total of over fifty kilograms of scrap iron, and there was no way for me to take all the pieces away tonight. I dragged all those metal components under the tree and covered them with branches, so that I could carry them off into the town tomorrow.\nThe next day was again gloomy. Heavy clouds veiled the sunlight, but the rain that everyone expected refused to fall. When I woke up in the morning, I felt a bit of a headache—I had probably caught a cold after falling into the river. But the joyful anticipation for Doraemon infused my body. I told Tang Lu that I was going to sell the scrap iron and get the VCDs, and that she should wait for me at home until I came back in the afternoon.\n“Sure!” I could tell that Tang Lu was excited too.\nI rode the bike to the riverbank first and retrieved the scrap iron. I crammed all the strange items into a sack, and placed the sack on the bike’s back seat. When I reached for the iron box, I noticed the round protuberance at its side again, and I tugged at it. Without too much effort, I broke it off of the box. Beneath the round bulge, there was a semitransparent crystal cube about five centimeters wide on each side. The crystal cube had been plugged into the box, revealing only a metallic, round cap. The shape of the crystal looked interesting, so I stuffed it into my pocket, thinking that I would give it to Tang Lu as a present later.\nThe bike was an old fashioned model with 28-inch wheels. The frame was longer than I was tall. My feet couldn’t even reach the pedals if I sat on the saddle properly, so I had to straddle the seat tube and hang on awkwardly. The ill-fitting bike did have one virtue: it was sturdy enough to easily carry a cargo load of over fifty kilograms. I strained and managed to pedal it along.\nIt took two hours to get to the town from the village by bike. In the muggy, hot summer weather, I was soon drenched in sweat. But the thought of the VCDs urged me on. Although my legs felt as though they were weighed down by lead, I pedaled faster and faster. In the sticky air, even the poplar trees next to the road drooped their heads in a spiritless silence.\nAfter making a turn at the end of the cement road, I had to cross a bridge to arrive at the town.\nI never made it.\nThe problem wasn’t the bicycle’s endurance or my stamina, but the sack. After two hours of clinking and grinding, the iron pieces had finally worn through the coarse fabric. With a loud clang, the sack tore. All the iron items tumbled out at once and clinked against the bridge.\n“Hey, you little bastard, where did you steal all this from?”\nA familiar voice approached as I scrambled to pick up the iron pieces. I turned around and saw a red-faced Lao Tang wobbling in my direction. He kicked the iron box.\n“I didn’t steal them!” I grabbed on to the box and shot back at him, “I fished them out of the river!”\n“Who are you trying to fool? There’s no way you got them out of the river; there isn’t even any rust on them.” Lao Tang puffed, breath stinking of alcohol. “What a family you have there! Your dad’s a cheater, and you’re a thief! I’m taking you to the police office.”\nI recalled that Lao Tang had lost the fistfight with my father and had been bitter about it since. He was too skinny to win against my father in a real fight, but now, by catching me red-handed in thievery, he could get his revenge.\nAnxious and frustrated, I yelled at him: “I swear that everything came from the river! If you don’t believe me, then go ask Tang Lu! She was there with me!”\nLao Tang sneered: “Lulu? I’ve told Lulu a thousand times to stop hanging out with you, but that little brat wouldn’t listen. Now, now—stop with all the nonsense and come with me!”\nI fought him hard, but Lao Tang was much stronger. He grabbed me by the collar and started to drag me off the bridge.\n“Damn you, Lao Tang!” I fastened my arms around the railing. “My dad will kill you!”\nThis infuriated Lao Tang even more. Blood rushed into his cheeks and he gave me a hard kick. “But he’s not here now, is he? Well, even if he’s right here in front of me, I’ll still make you pay for your crime!” He tugged at my arm again, but I wouldn’t budge a centimeter. Daring not to injure me, he let go and turned around, cursing loudly. “Fine! If you don’t come with me, I’ll turn in the things that you stole as evidence.”\nHe refilled the sack with the iron gadgets, tied the sack securely to the rack beneath the saddle, picked up the bike, and finally sped off the bridge. He made a turn and disappeared into the streets of the town.\nI staggered behind and gave chase, but he was long gone. Despondent, I stood at the bridge and sobbed. Everyone passing by gave me strange looks. Exhausted at last, my head heavy and befuddled, I turned around to trudge home.\nThunder rumbled in the murky sky. I was not even halfway through the journey when the rain started, evolving quickly from a few drizzling drops to a ferocious downpour.\nDrenched and still sobbing, I returned to the village after walking the whole afternoon. When I passed by Tang Lu’s house, I saw that the doors were closed. I knocked and no one answered.\nTang Lu had promised to wait right here, for me to bring Doraemon back. I knew that I failed my mission. But she should’ve been here.\nThe heavy rain crashed down to earth like cascading waterfalls and the water mingled into a river on the ground. I felt so drowsy that I had to sit down right next to Tang Lu’s door and rest my head against the wall.\nTang Lu never showed.\nHolding a funeral right after New Year was considered unlucky; Lao Tang’s alcoholism and bad temper didn’t help either. Barely anyone showed up at the funeral.\nIt was drizzling on the day of Tang Lu’s burial. In the rain, even the funeral music played by the suona sounded exceedingly forlorn. I walked among the slow funeral procession, no more than a dozen people, my face numb from the rain.\nLao Tang sat in front of Tang Lu’s grave, with a white sack bound to his neck and dangling in front of his chest. He looked stunned, his single leg stretched out straight. It was an awful sight. We walked up to him one by one, tossing money wrapped in white cloth, a token of our bereavement, into that sack before leaving.\nA quivering old woman stood before me in line. It was only after she turned around to leave that I recognized her.\n“Ms. Chen?”\nShe stared at me, a look of deep pathos on her wrinkled face, a combination of weariness of the world and sorrow. Her shriveled lips trembled as she spoke, “So you’re here as well, here for Tang Lu’s funeral . . . Tang Lu was my best student, but she’s had the worst life of you all. Now she’s gone, even before me. It’s all because of you. You.”\nThat took me by surprise. Maybe Ms. Chen was confused in her old age. I shook my head. “I never saw her again after we graduated.”\nMs. Chen didn’t answer. In the cold winter rain, with her back hunched over, she slowly waddled back to her shabby house.\nAlthough she was gone, her final words to me cast an ominous shadow. I pulled on my hood, snuggled up in my down coat, and went home.\nMother was warming herself by the stove fire. “Did you give Lao Tang the bereavement money?”\nI nodded. “How did Lao Tang break his leg in the first place?” I asked.\nMother squinted as she tried to recall. Her hands, which were stoking the stove, slowed down. The fire dimmed to deep red color, and a pale gray smoke began to rise.\n“It’s been years, but I do remember what happened,” she said, “The day Lao Tang got into a car accident was the same day you fell ill. Remember that time when you got incredibly sick after you were caught in the rain?”\nOf course I remembered. That day, after I lost the scrap metal, I went over to Tang Lu’s house in the rain and waited at her door until I fell asleep. When passersby tried to wake me, they discovered that I had lost consciousness. They got my parents to take me to the hospital.\nLooking back, there had been warning signs. The day before, I’d caught a cold from falling into the river, and I had a headache in the morning. Oblivious to those early signs, I strained myself on the long bike trip and then walked back in the rain. A high fever hit me right after.\nIt was the most ill that I had ever been. Due to the delay in treatment, I developed a cerebral edema that resulted in respiratory failure. I spent almost two months in the hospital barely conscious before I started to get better. Upon hearing about my illness, my aunt who lived up North hurried home, scolded my parents for their neglect, and then decided to take me away to live with her as soon as I left the hospital. When the day came for me to wave the village goodbye, I passed by Tang Lu’s house, but the doors were shut, as usual.\n“I heard that Lao Tang went to sell the scrap iron riding our family bike, but he was drunk at the time, and he ran into a car,” said Mother.\nI nodded. So Lao Tang didn’t turn the iron over to the police as he threatened, but instead wanted to sell them for his own profit. Of course Lao Tang would do that.\nMs. Chen had been right: Lao Tang and I crossed paths, as I was on my way to sell that scrap iron. By seizing the iron and the bike for himself, he got into the car accident that took his leg. The Tang family lost their source of income, and the course of Tang Lu’s life took a sharp turn for the worse. She had broken her promise to wait for me because of Lao Tang’s accident—she was probably rushing to the hospital.\nThe guilt was not mine to bear since none of this had occurred from my intent, but the undeniable truth was that my actions had directly led to the turn in Tang Lu’s fate and pushed her down the abyss of despair and desolation.\nI turned around at once and walked toward the door.\n“Where are you going?” Mother called. “It’s cold outside, put on your coat.”\nRaindrops pricked at every inch of my bare skin like needles. I pulled my coat on as I ran all the way to Ms. Chen’s house. When I pushed the door open, there was no one on the bed. Taken by surprise at first, I quickly realized where she had gone and went to remove the loose wooden plank right next to the bed.\nAgain, I entered that deep, dark tunnel. As expected, I spotted Ms. Chen in that room full of strange machines. Her unkempt hair was a clump of weeds under the glaring lights.\n“It’s you.” She didn’t turn around to look at me. Her fingers continued to flutter over those complex panels full of buttons. “I knew you would come back here. Tang Lu was my best student and you were her best friend. We are all responsible for her death. We all played a role in her fate.”\n“But . . . ” My voice was hoarse. I stepped back involuntarily, feeling the corner of the table press into my lower back, “I didn’t do it on purpose . . . ”\nAs Ms. Chen continued to operate the machines, a buzzing sound started in the room, growing louder and louder every second. Then, as Ms. Chen pushed one last button, the machines gave a final sigh, and the room returned to silence. She exhaled softly and turned to face me. “Do you understand the nature of time?”\n“What?” I was bewildered.\n“Time is a river in which we are all struggling to stay afloat. And fate . . . the fate of each individual is as insignificant as a small eddy on the surface of the water. As the eddies of all our fates merge and disperse, everyone becomes the hand that determines the fate of someone else. Intentional or unintentional, every small action changes the course of all the eddies on the river of time. But Hu Zhou, this is exactly what makes time both charming and cruel.”\nHer words echoed in the room. I gaped at this old woman I thought I knew. Did Ms. Chen—that elementary school teacher who had always been so glum and cranky in my memories—finally begin to reflect on time and fate near the end of her life?\n“But time can’t be altered,” I protested. “Even if I had caused her tragedy, there is no way . . . ”\nMs. Chen gazed at me, her eyes as murky and heavy as pools of aged wine. After a while, she shook her head. “No. Time is changeable. Many sections along this river contain closed loops.”\nThat comment confused me even more. Ms. Chen raised a bony finger and pointed at our surroundings. “Do you know what this room is for?”\nI couldn’t even begin to venture a guess. Ms. Chen revealed the answer: “It’s a laboratory.”\nI looked around. With all the wires and machines, it did look like some kind of experiment was going on, but I couldn’t imagine what would be worth studying in this poor little village.\n“The lab was founded by the military,” said Ms. Chen, as she petted the machines. “I can’t say much more than that. Even though they’ve given up on this project and haven’t contacted me in more than thirty years, there are still many things that must be kept secret. But I can tell you that we built this laboratory to study closed time loops.”\n“What?” I thought I had misheard. “Closed time loops?”\n“When the lab was created, researchers were moved here from all over the country; none of us knew what was going on. But . . . but during that special period in the history of our country, all we could do was to follow orders.\n“This site was chosen because it has the highest Fan Index number in the whole country. Oh, right, you don’t know what the Fan Index is—it’s named after Lao Fan, who gave his life for science. The upper half of his body is buried out there in the graveyard.”\nA chill ran down my spine. “Why only the upper half?”\n“Because we couldn’t find the lower half. It took more than ten years for us to succeed in creating an artificial closed time loop. Lao Fan offered himself as the subject of the first human experiment. However, when he got halfway through the river, the unstable closed time loop collapsed. The lower half of his body disappeared into another time and space. The whole river turned red from his blood.”\n“The river? You mean the section of the river next to that crooked tree?”\nMs. Chen nodded. “The closed time loop intersects with space in two stable locations: this laboratory and a circular section of the river with a diameter of 1.42 meters. However, time coordinates at the intersection points are completely random. When things floating along the river reach that point of intersection, they are immediately transported to this laboratory.”\n“So you labeled all of them?” I pointed at the corner of the room, remembering what I saw when I snuck in here many years ago. The deflated balls and the foam boards were still piled there.\n“Yes. I know you’ve been in here before, to retrieve your notebook. But since you never mentioned it to anyone else, I said nothing to you either.” Ms. Chen seemed to have exhausted her stamina from all the talking. Slowly, she lowed herself into a chair and continued. “Despite all the resources and energy poured into them, our experiments made little progress. The experiment was terminated. All the researchers wanted to go home after being caged in this laboratory for so long. But I alone wanted to stay and begged the people in authority to preserve the laboratory.”\n“Why didn’t you want to go home?”\n“Because I didn’t have one.” Ms. Chen’s lips curled up into a sad smile. “Do you know who Lao Fan was? He was my husband. My home is wherever he’s buried.”\nI could only give a small sympathetic nod.\n“For the sake of Lao Fan, they kept the machines here, but crossed my name off the official register. In China, back then, there were too many incomplete experiments like this one for people to pay attention to a widow who disappeared into a secluded village.” She smiled bitterly. “I’ve stayed on to complete the experiment in Lao Fan’s honor.”\n“When you told me that time could be changed, does that mean you finally succeeded in your experiment?”\nShe broke into a fit of coughing. She pressed a handkerchief at her mouth, but the handkerchief was soon splattered with blood. I rushed to support her so she wouldn’t fall down. Then, I had her climb onto my back, and I carried her out of the basement laboratory. She was as light as a single leaf.\nI tucked her into bed, poured some hot water, and fed her the medicine. She panted for a while before finally catching her breath. “I was so close to success . . . I went over the data and worked through the theory a thousand times, making sure everything was perfect. I was sure that one more try would vindicate Lao Fan and myself. But just as I was about to launch the experimental run, I discovered that a few key pieces of equipment had gone missing from the lab.”\n“When was that?”\n“Perhaps two or three years after the elementary school had closed down.”\nI sighed in acknowledgement. I understood what had happened—Ms. Chen said that the time coordinates at the intersection points on the closed loop were random. When I pulled out those iron gadgets from the river, I must have reached into the laboratory three years later along the timeline. So, it wasn’t until long after I had left the village that Ms. Chen discovered my theft of her instruments.\n“I tried to rebuild those missing pieces of equipment, but the Super Crystal Stabilizer could not be duplicated. Its design was too intricate and the raw material too rare. On my own, it was impossible to make another one. Even though I never could prove it experimentally, I assure you that time could be changed.” Her eyelids drooped, a teardrop falling from the corner of her eye and sliding across her wrinkles. “I’m only one step away from realizing Lao Fan’s dreams, but it’s a step I’ll never take . . . ”\nAll of the burial mounds in the graveyard shivered in the cold shower. I staggered past these old, abandoned graves and stopped at a fresh one. The funeral procession had already dispersed. An empty silence that not even the rain could penetrate was all that was left behind. The white papercraft used at the funeral, soaked from the rain, were scattered on the ground and melded with the earth.\nI saw a yellowed picture on the tombstone, a picture of a young girl. She wore her hair in a ponytail and smiled into the camera. I heard that Lao Tang had searched everywhere at home for a picture of Tang Lu, but all he could find was the elementary school graduation photo for her class. He was going to affix the whole photo on the tombstone, but the families of the other students in the photo had stopped him since it would be bad luck. So, he had to crop Tang Lu from the photo and used that as her funeral portrait. With his shaky hands, Lao Tang had not cut cleanly—slivers of my face still remained beside Tang Lu.\nI looked at the young Tang Lu and she looked back at me as well. I reached forward, and my fingertips touched her face.\nThe last time I saw Tang Lu wasn’t the summer after elementary school, but the winter break of my high school junior year.\nBy then, I had lived in the city for many years. As a seventeen year old, I listened to pop music, played basketball, longed for a pair of Nikes, and had a crush on that girl with long hair from the classroom next door. I hated the way that my home village appeared in my memories: poor and provincial.\nHowever, after all the years away from family, my aunt decided to visit home during Spring Festival. I was again under the same roof with my parents, but I felt like an outsider. Everyone and everything in the village seemed to me filthy and outdated. During the visit, my parents mentioned to my aunt that they wanted me back home since taking care of me was such a burden on her. My aunt turned them down, saying that I needed better education. I sat with them while this conversation happened, and heaved a sigh of relief after my aunt had spoken.\nFinally, it was the sixth day after New Year, and my aunt and I were going back to her home. We took Uncle Chen’s tractor into the town, where we were supposed to take the bus to the city and then get on the train back to Shanxi. However, as we arrived in town, we found the bus had already left. It took half an hour to find a car that was going to the city. The driver wanted a hundred for us to hitch a ride; my aunt bargained him down to fifty.\nJust as we were about to get in the car, we heard a timid, shaky voice behind us. “Are you going into the city?”\nI turned around and saw a girl, about fifteen or sixteen. She looked tiny compared to the huge sacks on her back and in her hands. It was as if those sacks mattered even more to her than herself.\n“Yeah.” I said.\n“May I catch a ride as well? I want to go to the city too . . . but I missed the bus.”\nShe looked familiar, so I nodded. “It should be fine.”\nThe driver poked his head out from the window and muttered grouchily. “If you’re adding another person, then you have to pay more. Sixty yuan or no deal!”\nMy aunt gave him a death glare, then she looked at the girl. “We’ll pay forty and you can pay twenty. Is that all right?”\nThe girl hesitated. The driver impatiently tooted the horn a few times. She nodded. Just as I helped her stuff her luggage into the trunk, I blurted out, “Tang Lu?”\n“Long time no see.” She smiled at me, but she didn’t seem too surprised. “Hu Zhou, you’re taller now.”\n“Where are you going?” I tried to cover up the awkwardness of not recognizing her earlier.\n“Shanghai. You?”\n“I’m going back to Shanxi with my aunt. School is starting soon. Are you going to school as well in Shanghai?”\nI regretted the words as soon as they were out of my mouth—with all that luggage and the way she was dressed, she obviously wasn’t going to school.\nTang Lu smiled again. “I’m going to work.”\nMy aunt in the front seat turned around to give Tang Lu an appraising look, and then turned back again.\n“What kind of work?” I asked.\n“I don’t know yet. I’ll see when I get there.” She paused, and then added, “There must be something out there for me to do.”\nWe fell silent. I watched a white bird sweep over the river as the car sped across the bridge. The train station was on the other side, where my aunt and I would board the train to Shanxi.\nTang Lu spoke up all of a sudden, “Do you still watch Doraemon?”\n“No, not for a while now. Why?”\n“Oh, it’s nothing,” she said. Her voice sounded a bit muffled, as though she were congested.\nThe car got off the bridge and inched slowly among the traffic. Surrounded by a chorus of tooting horns, I could see the worn-out train station up ahead, with hundreds of people milling at its door.\n“I’ve been watching all this time, but everyone says the show already has an ending.” She looked past me to somewhere far, far away. “I heard that Nobi turned out to be mentally ill. All the stories happened only in his own imagination; they were hallucinations. There never was a Doraemon . . . ”\nI thought myself too sophisticated for cartoons by then, and all my memories of Doraemon had blurred. I forced myself to continue the conversation. “Who told you about this ending?”\n“I saw it on the Internet. If so many people think it’s true, then it probably is.” Tang Lu lowered her head. “But you told me, for every lonely childhood, there is a . . . ”\nShe didn’t get to finish her sentence because the car came to a stop in front of the train station. “We’re here,” said the driver.\nTang Lu opened the door and got out. I unloaded the luggage from the trunk, and my aunt handed sixty yuan to the driver. Tang Lu pulled out a plain cloth wallet, counted out twenty yuan in loose change and handed the money over to my aunt.\n“No, no.” My aunt looked at me, and then waved her hand at Tang Lu. “Keep it.”\nTang Lu insisted. Unwilling to embarrass Tang Lu any further, my aunt grabbed my hand and headed toward the ticket office. I glanced over my shoulder and saw Tang Lu standing there with that huge backpack over her shoulders, still holding the money. Her eyes were red, as if she wanted to say something.\nWe merged into the surging crowd in the station, rushing, swirling, eddying every which way. When I looked back again, Tang Lu was gone. I craned my neck and stood on my toes, but I couldn’t find her in the sea of strangers.\nA cold raindrop slid down my neck, making me shiver. I ran home. I rummaged through the wooden chest that held my childhood and found the metal gadget with a cubical crystal attached to its cap. Looking at it now, I thought it resembled an ancient-looking USB drive.\nI tucked it into my pocket and dashed out again. Mother stopped me. “It’s so late; where are you going?”\nI looked at my mother. I looked at my father, who stood at her side and rarely spoke. My heart ached, for they had no language to express how they felt about their son.\nI stepped up and gave both of them a hug. Mother looked confused, and Father, unused to such intimacy, just looked awkward.\n“I’ll be back soon.” I said.\n“When?” asked Mother.\n“Not tonight.”\nNo flashlight was needed. I easily found my way back to Ms. Chen’s house by following the road that I had walked so many times as a child.\nI took out the crystal. “Is this it?”\nMs. Chen had gone to bed already, but at the sight of the crystal, she struggled to sit up straight, her voice trembling as she spoke, “Yes, yes, the Super Crystal Stabilizer . . . Where did you find it?”\nInstead of answering, I asked another question, “With this, can you send me back to the past?”\nMs. Chen tilted her head up abruptly. “Are you sure you want to return to the past?”\nI nodded.\n“You have a good life. Are you sure you want to give it up?”\n“Good? The reason I came home in the first place was because Beijing has scarred me.”\n“Are you hoping to travel back in time to relive nostalgia because the present isn’t as wonderful as you memories? Remember, the past is meant to be remembered, not repeated. In your imagination the past may be better than your present, but once you really enter the past, you may feel very differently. You need to be very sure of this decision.”\n“No need to worry. I’m not doing this to escape from the present or to repeat the past.” I took a step forward and gazed into Ms. Chen’s eyes. “I’m going to change something.”\n“To change what?”\n“According to your theory, I was the cause of Tang Lu’s misfortune. I must then be the one to correct this mistake. I need to be a real Doraemon.”\n“You will never be able to come back after you go; do you understand?”\nI shook my head. “It’s fine. I’ll grow up again, won’t I?”\nI helped Ms. Chen to the underground tunnel and went into the laboratory with her. She replaced the Stabilizer and started to operate those complex buttons, deftly punching in commands. Electric sparks flashed in the glass box on the middle table, growing in intensity every second until they merged into a ring of light.\n“I’ve studied the time coordinates of the intersection points of the closed loop for more than a decade. Theoretically, I can control the time at the intersection points with precision,” said Ms. Chen. “Which day would you like to return to?”\nI entered the date.\nThe ring of light expanded and projected outside of the glass box, floating in midair. Ms. Chen nodded, her eyes sparkling. “It seems like my calculations are correct.” She pressed some more buttons, and the ring of light turned perpendicular to the ground, like an oval door.\n“I’m going to ask you one last time: are you sure?”\nI didn’t need to answer that question anymore. I took a deep breath and stepped up to the ring of light. It glistened. The glow projected onto my face grew brighter, and the buzzing of currents echoed in the room. Tears suddenly filled my eyes. I walked into the ring of light.\nLight. Stickiness. Coldness.\nAfter regaining consciousness, those were the only three sensations I remembered.\nI opened my eyes. I was still in the laboratory, except Ms. Chen had disappeared. Did we fail? Confused, I climbed up the underground tunnel and pushed open the door to Ms. Chen’s house. The murky heat of summer enveloped me at once.\nIt was that gloomy summer morning!\nI didn’t have time to be surprised. I rushed to the road and saw a boy on an old bicycle, riding toward the town with a sack over his cargo rack.\n“Wait! Don’t go yet.” I stopped him.\nThe boy halted. A look of bewilderment flashed across his face as he held the bicycle. “Who are you?”\n“Never mind that. Your sack isn’t sturdy; the things inside will fall out if you keep pedaling. Here, let me redo it for you.” I took off my down coat and wrapped it around the sack, then tied the sleeves to the bicycle’s frame. “Okay, this will do. Also, when you go into town, don’t take the bridge, but go through that little side street instead. Do you understand?”\nThe boy had been looking at me in confusion. He nodded, hesitantly.\n“Go.” I waved my hand at him. “And come back soon. Tang Lu is still waiting for you.”\n“How did you know—”\n“Right—after you sell the scrap metal, borrow a rain jacket from that old guy. There will be a storm on your way back. You mustn’t get wet.”\nThe boy got back on his bicycle. Before leaving, he looked me up and down. “You look a lot like my dad. Are you a relative or something?”\nI smiled. “Just remember what I told you. Now go!”\nThe boy’s figure soon disappeared among the shadows of the trees. I lingered around for a while, and then headed to Tang Lu’s house. However, instead of going in, I stood right across the road from the house, sat down, and waited.\nThe afternoon crawled by slowly, but I had all the patience in the world. I waited and waited. People passing by looked me up and down with judgmental eyes, but I did not budge. Then, when the drizzles began, I went over to Tang Lu’s house so that the eaves could shelter me from the rain.\nA girl peered out. When she saw me, a look of disappointment flashed across her delicate face. Yet, she smiled at me. “Would you like some water?”\n“No, I’m just waiting for the rain to stop—but thank you,” I said.\n“Oh.” Tang Lu’s face disappeared. A moment later, she came out of the house with two stools and handed me one. She sat down right next to me, her gaze fixed on the curtain of rain that seemed to extend all the way to the horizon.\n“Are you waiting for someone?” I asked.\nTang Lu nodded. “I’m waiting for Doraemon.”\n“You mean the cartoon?”\n“No. It’s a person.” She didn’t turn to look at me, but I caught a glimpse of the side of her face—a sight too familiar.\nWe sat shoulder to shoulder beneath the roof.\nThe silhouette of a boy on a bicycle appeared in the rain. Covered head to toe by a rain jacket, he pedaled hard. The girl leaped to her feet at once, tipping her stool over, but she didn’t seem to notice at all.\nThe boy sped over. He leaned the bicycle against the wall and yelled, “Lulu, I have it!” He was surprised to see me, but he said nothing. He took off his rain jacket, pulled out a thick stack of VCDs and handed them over to Tang Lu.\n“Great!” Tang Lu reached for them with a look of joy.\nI stood up and stepped into the rain. Behind me, I heard the girl telling the boy, “Thank you, Doraemon!”\nAnd then they started to sing, their hands held together tightly.\nIt’s all the same every day,\nBut sometimes dreams may come our way,\nAs long as there is Doraemon,\nHappiness will always stay . . .\nTheir lively song pierced through the rain and echoed in the village. I didn’t turn around, so I would never know whether the song was for me, or simply for themselves. But that wasn’t important anymore. From this moment onward, fate had changed its course, and the swirls on the river of time would now begin to reform. These two children will set out on a brand new journey. Just like Nobita Nobi and Minamoto Shizuka, they would grow, day by day.\nDoraemon had completed its mission.\nOriginally published in Chinese in Science Fiction World, August 2016.\nTranslated and published in partnership with Storycom.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.\nEmily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature.", "source": "https://clarkesworldmagazine.com/a_05_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Farewell, Doraemon by A Que, translated by Emily Jin and Ken Liu"}