{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Catherynne M Valente", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "9Mn+AhnUtRqq5BUc8sar9HI9nlM=", "id": null, "license": null, "comments": "", "raw_text": "8430 words, novelette, REPRINT  The Future is Blue  1. NIHILIST  My name is Tetley Abednego and I am the most hated girl in Garbagetown. I am nineteen years old. I live alone in Candle Hole, where I was born, and have no friends except for a deformed gannet bird I’ve named Grape Crush and a motherless elephant seal cub I’ve named Big Bargains, and also the hibiscus flower that has recently decided to grow out of my roof, but I haven’t named it anything yet. I love encyclopedias, a cassette I found when I was eight that says Madeline Brix’s Superboss Mixtape ’97 on it in very nice handwriting, plays by Mr. Shakespeare or Mr. Webster or Mr. Beckett, lipstick, Garbagetown, and my twin brother Maruchan. Maruchan is the only thing that loves me back, but he’s my twin, so it doesn’t really count. We couldn’t stop loving each other any more than the sea could stop being so greedy and give us back China or drive time radio or polar bears.  But he doesn’t visit anymore.  When we were little, Maruchan and I always asked each other the same question before bed. Every night, we crawled into the Us-Fort together—an impregnable stronghold of a bed which we had nailed up ourselves out of the carcasses of several hacked apart bassinets, prams, and cradles. It took up the whole of our bedroom. No one could see us in there, once we closed the porthole (a manhole cover I swiped from Scrapmetal Abbey stamped with stars, a crescent moon, and the magic words New Orleans Water Meter), and we felt certain no one could hear us either. We lay together under our canopy of moldy green lace and shredded buggy-hoods and mobiles with only one shattered fairy fish remaining. Sometimes I asked first and sometimes he did, but we never gave the same answer twice.  “Maruchan, what do you want to be when you grow up?”  He would give it a serious think. Once, I remember, he whispered:  “When I grow up I want to be the Thames!”  “Whatever for?” I giggled.  “Because the Thames got so big and so bossy and so strong that it ate London all up in one go! Nobody tells a Thames what to do or who to eat. A Thames tells you. Imagine having a whole city to eat, and not having to share any! Also there were millions of eels in the Thames and I only get to eat eels at Easter which isn’t fair when I want to eat them all the time.”  And he pretended to bite me and eat me all up. “Very well, you shall be the Thames and I shall be the Mississippi and together we shall eat up the whole world.”  Then we’d go to sleep and dream the same dream. We always dreamed the same dreams, which was like living twice.  After that, whenever we were hungry, which was always all the time and forever, we’d say we’re bound for London-town! until we drove our parents so mad that they forbade the word London in the house, but you can’t forbid a word, so there.  Every morning I wake up to find words painted on my door like toadstools popping up in the night.  Today it says NIHILIST in big black letters. That’s not so bad! It’s almost sweet! Big Bargains flumps toward me on her fat seal-belly while I light the wicks on my beeswax door and we watch them burn together until the word melts away.  “I don’t think I’m a nihilist, Big Bargains. Do you?”  She rolled over onto my matchbox stash so that I would rub her stomach. Rubbing a seal’s stomach is the opposite of nihilism.  Yesterday, an old man hobbled up over a ridge of rusted bicycles and punched me so hard he broke my nose. By law, I had to let him. I had to say: Thank you, Grandfather, for my instruction. I had to stand there and wait in case he wanted to do something else to me. Anything but kill me, those were his rights. But he didn’t want more, he just wanted to cry and ask me why I did it and the law doesn’t say I have to answer that, so I just stared at him until he went away. Once a gang of schoolgirls shaved off all my hair and wrote CUNT in blue marker on the back of my skull. Thank you, sisters, for my instruction. The schoolboys do worse. After graduation they come round and eat my food and hold me down and try to make me cry, which I never do. It’s their rite of passage. Thank you, brothers, for my instruction.  But other than that, I’m really a very happy person! I’m awfully lucky when you think about it. Garbagetown is the most wonderful place anybody has ever lived in the history of the world, even if you count the Pyramids and New York City and Camelot. I have Grape Crush and Big Bargains and my hibiscus flower and I can fish like I’ve got bait for a heart so I hardly ever go hungry and once I found a ruby ring and a New Mexico license plate inside a bluefin tuna. Everyone says they only hate me because I annihilated hope and butchered our future, but I know better, and anyway, it’s a lie. Some people are just born to be despised. The Loathing of Tetley began small and grew bigger and bigger, like the Thames, until it swallowed me whole.  Maruchan and I were born fifty years after the Great Sorting, which is another lucky thing that’s happened to me. After all, I could have been born a Fuckwit and gotten drowned with all the rest of them, or I could have grown up on a Misery Boat, sailing around hopelessly looking for land, or one of the first to realize people could live on a patch of garbage in the Pacific Ocean the size of the place that used to be called Texas, or I could have been a Sorter and spent my whole life moving rubbish from one end of the patch to the other so that a pile of crap could turn into a country and babies could be born in places like Candle Hole or Scrapmetal Abbey or Pill Hill or Toyside or Teagate.  Candle Hole is the most beautiful place in Garbagetown, which is the most beautiful place in the world. All the stubs of candles the Fuckwits threw out piled up into hills and mountains and caverns and dells, votive candles and taper candles and tea lights and birthday candles and big fat colorful pillar candles, stacked and somewhat melted into a great crumbling gorgeous warren of wicks and wax. All the houses are little cozy honeycombs melted into the hillside, with smooth round windows and low golden ceilings. At night, from far away, Candle Hole looks like a firefly palace. When the wind blows, it smells like cinnamon, and freesia, and cranberries, and lavender, and Fresh Linen Scent, and New Car Smell.  2. THE TERRIBLE POWER OF FUCKWIT CAKE  Our parents’ names are Life and Time. Time lay down on her Fresh Linen Scent wax bed and I came out of her first, then Maruchan. But even though I got here first, I came out blue as the ocean, not breathing, with the umbilical cord wrapped round my neck and Maruchan wailing, still squeezing onto my noose with his tiny fist, like he was trying to get me free. Doctor Pimms unstrangled and unblued me and put me in a Hawaiian Fantasies-scented wax hollow in our living room. I lay there alone, too startled by living to cry, until the sun came up and Life and Time remembered I had survived. Maruchan was so healthy and sweet-natured and strong and, even though Garbagetown is the most beautiful place in the world, many children don’t live past a year or two. We don’t even get names until we turn ten. (Before that, we answer happily to Girl or Boy or Child or Darling.) Better to focus on the one that will grow up rather than get attached to the sickly poor beast who hasn’t got a chance.  I was born already a ghost. But I was a very noisy ghost. I screamed and wept at all hours while Life and Time waited for me to die. I only nursed when my brother was full, I only played with toys he forgot, I only spoke after he had spoken. Maruchan said his first word at the supper table: please. What a lovely, polite word for a lovely, polite child! After they finished cooing over him, I very calmly turned to my mother and said: Mama, may I have a scoop of mackerel roe? It is my favorite. I thought they would be so proud! After all, I made twelve more words than my brother. This was my moment, the wonderful moment when they would realize that they did love me and I wasn’t going to die and I was special and good. But everyone got very quiet. They were not happy that the ghost could talk. I had been able to for ages, but everything in my world said to wait for my brother before I could do anything at all. No, you may not have mackerel roe, because you are a deceitful wicked little show-off child.  When we turned ten, we went to fetch our names. This is just the most terribly exciting thing for a Garbagetown kid. At ten, you are a real person. At ten, people want to know you. At ten, you will probably live for a good while yet. This is how you catch a name: wake up to the fabulous new world of being ten and greet your birthday Frankencake (a hodgepodge of well-preserved Fuckwit snack cakes filled with various crèmes and jellies). Choose a slice, with much fanfare. Inside, your adoring and/or neglectful mother will have hidden various small objects—an aluminum pull tab, a medicine bottle cap, a broken earring, a coffee bean, a wee striped capacitor, a tiny plastic rocking horse, maybe a postage stamp. Remove item from your mouth without cutting yourself or eating it. Now, walk in the direction of your prize. Toward Aluminumopolis or Pill Hill or Spanglestoke or Teagate or Electric City or Toyside or Lost Post Gulch. Walk and walk and walk. Never once brush yourself off or wash in the ocean, even after camping on a pile of magazines or wishbones or pregnancy tests or wrapping paper with glitter reindeer on it. Walk until nobody knows you. When, finally, a stranger hollers at you to get out of the way or go back where you came from or stop stealing the good rubbish, they will, without even realizing, call you by your true name, and you can begin to pick and stumble your way home.  My brother grabbed a chocolate snack cake with a curlicue of white icing on it. I chose a pink and red tigery striped hunk of cake filled with gooshy crème de something. The sugar hit our brains like twin tsunamis. He spat out a little gold earring with the post broken off. I felt a smooth, hard gelcap lozenge in my mouth. Pill Hill it was then, and the great mountain of Fuckwit anxiety medication. But when I carefully pulled the thing out, it was a little beige capacitor with red stripes instead. Electric City! I’d never been half so far. Richies lived in Electric City. Richies and brightboys and dazzlegirls and kerosene kings. My brother was off in the opposite direction, toward Spanglestoke and the desert of engagement rings.  Maybe none of it would have happened if I’d gone to Spanglestoke for my name instead. If I’d never seen the gasoline gardens of Engine Row. If I’d gone home straightaway after finding my name. If I’d never met Goodnight Moon in the brambles of Hazmat Heath with all the garbage stars rotting gorgeously overhead. Such is the terrible power of Fuckwit Cake.  I walked cheerfully out of Candle Hole with my St. Oscar backpack strapped on tight and didn’t look back once. Why should I? St. Oscar had my back. I’m not really that religious nowadays. But everyone’s religious when they’re ten. St. Oscar was a fuzzy green Fuckwit man who lived in a garbage can just like me, and frowned a lot just like me. He understood me and loved me and knew how to bring civilization out of trash and I loved him back even though he was a Fuckwit. Nobody chooses how they get born. Not even Oscar.  So I scrambled up over the wax ridges of my home and into the world with Oscar on my back. The Matchbox Forest rose up around me: towers of EZ Strike matchbooks and boxes from impossible, magical places like the Coronado Hotel, Becky’s Diner, the Fox and Hound Pub. Garbagetowners picked through heaps and cairns of blackened, used matchsticks looking for the precious ones that still had their red and blue heads intact. But I knew all those pickers. They couldn’t give me a name. I waved at the hotheads. I climbed up Flintwheel Hill, my feet slipping and sliding on the mountain of spent butane lighters, until I could see out over all of Garbagetown just as the broiling cough-drop red sun was setting over Far Boozeaway, hitting the crystal bluffs of stockpiled whiskey and gin bottles and exploding into a billion billion rubies tumbling down into the hungry sea.  I sang a song from school to the sun and the matchsticks. It’s an ask-and-answer song, so I had to sing both parts myself, which feels very odd when you have always had a twin to do the asking or the answering, but I didn’t mind.   Who liked it hot and hated snow?  The Fuckwits did! The Fuckwits did! Who ate up every thing that grows? The Fuckwits did! The Fuckwits did! Who drowned the world in oceans blue? The Fuckwits did! The Fuckwits did! Who took the land from me and you? The Fuckwits did, we know it’s true! Are you Fuckwits, children dear? We’re GARBAGETOWNERS, free and clear! But who made the garbage, rich and rank? The Fuckwits did, and we give thanks. The Lawn stretched out below me, full of the grass clippings and autumn leaves and fallen branches and banana peels and weeds and gnawed bones and eggshells of the fertile Fuckwit world, slowly turning into the gold of Garbagetown: soil. Real earth. Terra bloody firma. We can already grow rice in the dells. And here and there, big, blowsy flowers bang up out of the rot: hibiscus, African tulips, bitter gourds, a couple of purple lotuses floating in the damp mucky bits. I slept next to a blue-and-white orchid that looked like my brother’s face.  “Orchid, what do you want to be when you grow up?” I whispered to it. In real life, it didn’t say anything back. It just fluttered a little in the moonlight and the sea wind. But when I got around to dreaming, I dreamed about the orchid, and it said: a farm.  3. MURDERCUNT  In Garbagetown, you think real hard about what you’re gonna eat next, where the fresh water’s at, and where you’re gonna sleep. Once all that’s settled you can whack your mind on nicer stuff, like gannets and elephant seals and what to write next on the Bitch of Candle Hole’s door. (This morning I melted MURDERCUNT off the back wall of my house. Big Bargains flopped down next to me and watched the blocky red painted letters swirl and fade into the Buttercream Birthday Cake wax. Maybe I’ll name my hibiscus flower Murdercunt. It has a nice big sound.)  When I remember hunting my name, I mostly remember the places I slept. It’s a real dog to find good spots. Someplace sheltered from the wind, without too much seawater seep, where no-one’ll yell at you for wastreling on their patch or try to stick it in you in the middle of the night just because you’re all alone and it looks like you probably don’t have a knife.  I always have a knife.  So I slept with St. Oscar the Grouch for my pillow, in the shadow of a mountain of black chess pieces in Gamegrange, under a thicket of tabloids and Wall Street Journals and remaindered novels with their covers torn off in Bookbury, snuggled into a spaghetti-pile of unspooled cassette ribbon on the outskirts of the Sound Downs, on the lee side of a little soggy Earl Grey hillock in Teagate. In the morning I sucked on a few of the tea bags and the dew on them tasted like the loveliest cuppa any Fuckwit ever poured his stupid self. I said my prayers on beds of old microwaves and moldy photographs of girls with perfect hair kissing at the camera. St. Oscar, keep your mighty lid closed over me. Look grouchily but kindly upon me and protect me as I travel through the infinite trash can of your world. Show me the beautiful usefulness of your Blessed Rubbish. Let me not be Taken Out before I find my destiny.  But my destiny didn’t seem to want to find me. As far as I walked, I still saw people I knew. Mr. Zhu raking his mushroom garden, nestled in a windbreak of broken milk bottles. Miss Amancharia gave me one of the coconut crabs out of her nets, which was very nice of her, but hardly a name. Even as far away as Teagate, I saw Tropicana Sita welding a refrigerator door to a hull-metal shack. She flipped up her mask and waved at me. Dammit! She was Allsorts Sita’s cousin, and Allsorts drank with my mother every Thursday at the Black Wick.  By the time I walked out of Teagate I’d been gone eight days. I was getting pretty ripe. Bits and pieces of Garbagetown were stuck all over my clothes, but no tidying up. Them’s the rules. I could see the blue crackle of Electric City sparkling up out of the richie-rich Coffee Bean ’Burbs. Teetering towers of batteries rose up like desert hoodoo spires—AA, AAA, 12 Volt, DD, car, solar, lithium, anything you like. Parrots and pelicans screamed down the battery canyons, their talons kicking off sprays of AAAs that tumbled down the heights like rockslides. Sleepy banks of generators rumbled pleasantly along a river of wires and extension cords and HDMI cables. Fields of delicate lightbulbs wind-chimed in the breeze. Anything that had a working engine lived here. Anything that still had juice. If Garbagetown had a heart, it was Electric City. Electric City pumped power. Power and privilege.  In Electric City, the lights of the Fuckwit world were still on.  4. GOODNIGHT GARBAGETOWN  “Oi, Tetley! Fuck off back home to your darkhole! We’re full up on little cunts here!”  And that’s how I got my name. Barely past the battery spires of Electric City, a fat gas-huffing fucksack voltage jockey called me a little cunt. But he also called me Tetley. He brayed it down from a pyramid of telephones and his friends all laughed and drank home brew out of a glass jug and went back to not working. I looked down—among the many scraps of rubbish clinging to my shirt and pants and backpack and hair was a bright blue tea bag wrapper with TETLEY CLASSIC BLEND BLACK TEA written on it in cheerful white letters, clinging to my chest.  I tried to feel the power of my new name. The me-ness of it. I tried to imagine my mother and father when they were young, waking up with some torn out page of Life or Time magazine stuck to their rears, not even noticing until someone barked out their whole lives for a laugh. But I couldn’t feel anything while the volt-humpers kept on staring at me like I was nothing but a used-up potato battery. I didn’t even know then that the worst swear word in Electric City was dark. I didn’t know they were waiting to see how mad I’d get ’cause they called my home a darkhole. I didn’t care. They were wrong and stupid. Except for the hole part. Candle Hole never met a dark it couldn’t burn down.  Maybe I should have gone home right then. I had my name! Time to hoof it back over the river and through the woods, girl. But I’d never seen Electric City and it was morning and if I stayed gone awhile longer maybe they’d miss me. Maybe they’d worry. And maybe now they’d love me, now that I was a person with a name. Maybe I could even filch a couple of batteries or a cup of gasoline and turn up at my parents’ door in turbo-powered triumph. I’d tell my brother all my adventures and he’d look at me like I was magic on a stick and everything would be good forever and ever amen.  So I wandered. I gawped. It was like being in school and learning the Fuckwit song only I was walking around inside the Fuckwit song and it was all still happening right now everywhere. Electric City burbled and bubbled and clanged and belched and smoked just like the bad old world before it all turned blue. Everyone had such fine things! I saw a girl wearing a ball gown out of a fairy book, green and glitter and miles of ruffles and she wasn’t even going anywhere. She was just tending her gasoline garden out the back of her little cottage, which wasn’t made out of candles or picture-books or cat food cans, but real cottage parts! Mostly doors and shutters and really rather a lot of windows, but they fit together like they never even needed the other parts of a house in the first place. And the girl in her green-glitter dress carried a big red watering can around her garden, sprinkling fuel stabilizer into her tidy rows of petrol barrels and gas cans with their graceful spouts pointed toward the sun. Why not wear that dress all the time? Just a wineglass full of what she was growing in her garden would buy almost anything else in Garbagetown. She smiled shyly at me. I hated her. And I wanted to be her.  By afternoon I was bound for London-town, so hungry I could’ve slurped up every eel the Thames ever had. There’s no food lying around in Electric City. In Candle Hole I could’ve grabbed candy or a rice ball or jerky off any old midden heap. But here everybody owned their piece and kept it real neat, mercilessly neat, and they didn’t share. I sat down on a rusty Toyota transmission and fished around in my backpack for crumbs. My engine sat on one side of a huge cyclone fence. I’d never seen one all put together before. Sure, you find torn-off shreds of wire fences, but this one was all grown up, with proper locks and chain wire all over it. It meant to Keep You Out. Inside, like hungry dogs, endless barrels and freezers and cylinders and vats went on and on, with angry writing on them that said HAZMAT or BIOHAZARD or RADIOACTIVE or WARNING or DANGER or CLASSIFIED.  “Got anything good in there?” said a boy’s voice. I looked round and saw a kid my own age, with wavy black hair and big brown eyes and three little moles on his forehead. He was wearing the nicest clothes I ever saw on a boy—a blue suit that almost, almost fit him. With a tie.  “Naw,” I answered. “Just a dry sweater, an empty can of Cheez Whiz, and Madeline Brix’s Superboss Mixtape ’97. It’s my good luck charm.” I showed him my beloved mixtape. Madeline Brix made all the dots on her i’s into hearts. It was a totally Fuckwit thing to do and I loved her for it even though she was dead and didn’t care if I loved her or not.  “Cool,” the boy said, and I could tell he meant it. He didn’t even call me a little cunt or anything. He pushed his thick hair out of his face. “Listen, you really shouldn’t be here. No one’s gonna say anything because you’re not Electrified, but it’s so completely dangerous. They put all that stuff in one place so it couldn’t get out and hurt anyone.”  “Electrified?”  “One of us. Local.” He had the decency to look embarrassed. “Anyway, I saw you and I thought that if some crazy darkgirl is gonna have a picnic on Hazmat Heath, I could at least help her not die while she’s doing it.”  The boy held out his hand. He was holding a gas mask. He showed me how to fasten it under my hair. The sun started to set rosily behind a tangled briar of motherboards. Everything turned pink and gold and slow and sleepy. I climbed down from my engine tuffet and lay under the fence next to the boy in the suit. He’d brought a mask for himself too. We looked at each other through the eyeholes.  “My name’s Goodnight Moon,” he said.  “Mine’s . . . ” And I did feel my new name swirling up inside me then, like good tea, like cream and sugar cubes, like the most essential me. “Tetley.”  “I’m sorry I called you a darkgirl, Tetley.”  “Why?”  “It’s not a nice thing to call someone.”  “I like it. It sounds pretty.”  “It isn’t. I promise. Do you forgive me?”  I tugged on the hose of my gas mask. The air coming through tasted like nickels. “Sure. I’m aces at forgiving. Been practicing all my life. Besides . . . ” My turn to go red in the face. “At the Black Wick they’d probably call you a brightboy and that’s not as pretty as it sounds, either.”  Goodnight Moon’s brown eyes stared out at me from behind thick glass. It was the closest I’d ever been to a boy who wasn’t my twin. Goodnight Moon didn’t feel like a twin. He felt like the opposite of a twin. We never shared a womb, but on the other end of it all, we might still share a grave. His tie was burgundy with green swirls in it. He hadn’t tied it very well, so I could see the skin of his throat, which was very clean and probably very soft.  “Hey,” he said, “do you want to hear your tape?”  “What do you mean hear it? It’s not for hearing, it’s for luck.”  Goodnight Moon laughed. His laugh burst all over me like butterfly bombs. He reached into his suit jacket and pulled out a thick black rectangle. I handed him Madeline Brix’s Superboss Mixtape ’97 and he hit a button on the side of the rectangle. It popped open; Goodnight Moon slotted in my tape and handed me one end of a long wire.  “Put it in your ear,” he said, and I did.  A man’s voice filled up my head from my jawbone up to the plates of my skull. The most beautiful and saddest voice that ever was. A voice like Candle Hole all lit up at twilight. A voice like the whole old world calling up from the bottom of the sea. The man on Madeline Brix’s tape was saying he was happy, and he hoped I was happy, too.  Goodnight Moon reached out to hold my hand just as the sky went black and starry. I was crying. He was, too. Our tears dripped out of our gas masks onto the rusty road of Electric City.  When the tape ended, I dug in my backpack for a match and a stump of candle: dark red, Holiday Memories scent. I lit it at the same moment that Goodnight Moon pulled a little flashlight out of his pocket and turned it on. We held our glowings between us. We were the same.  5. BRIGHTBITCH  Allsorts Sita came to visit me today. Clicked my knocker early in the morning, early enough that I could be sure she’d never slept in the first place. I opened for her, as I am required to do. She looked up at me with eyes like bullet holes, leaning on my waxy hinges, against the T in BRIGHTBITCH, thoughtfully scrawled in what appeared to be human shit across the front of my hut. BRIGHTBITCH smelled, but Allsorts Sita smelled worse. Her breath punched me in the nose before she did. I got a lungful of what Diet Sprite down at the Black Wick optimistically called “cognac”: the thick pinkish booze you could get by extracting the fragrance oil and preservatives out of candles and mixing it with wood alcohol the kids over in Furnitureford boiled out of dining sets and china cabinets. Smells like flowers vomited all over a New Car and then killed a badger in the back seat. Allsorts Sita looked like she’d drunk so much cognac you could light one strand of her hair and she’d burn for eight days.  “You fucking whore,” she slurred.  “Thank you, Auntie, for my instruction,” I answered quietly.  I have a place I go to in my mind when I have visitors who aren’t seals or gannet birds or hibiscus flowers. A little house made all of doors and windows, where I wear a green-glitter dress every day and water my gas can garden and read by electric light.  “I hate you. I hate you. How could you do it? We raised you and fed you and this is how you repay it all. You ungrateful bitch.”  “Thank you, Auntie, for my instruction.”  In my head I ran my fingers along a cyclone fence and all the barrels on the other side read LIFE and LOVE and FORGIVENESS and UNDERSTANDING.  “You’ve killed us all,” Allsorts Sita moaned. She puked up magenta cognac on my stoop. When she was done puking she hit me over and over with closed fists. It didn’t hurt too much. Allsorts is a small woman. But it hurt when she clawed my face and my breasts with her fingernails. Blood came up like wax spilling and when she finished she passed out cold, halfway in my house, halfway out.  “Thank you, Auntie, for my instruction,” I said to her sleeping body. My blood dripped onto her, but in my head I was lying on my roof made of two big church doors in a gas mask listening to a man sing to me that he’s never done bad things and he hopes I’m happy, he hopes I’m happy, he hopes I’m happy.  Big Bargains moaned mournfully and the lovely roof melted away like words on a door. My elephant seal friend flopped and fretted. When they’ve gone for my face she can’t quite recognize me and it troubles her seal-soul something awful. Grape Crush, my gannet bird, never worries about silly things like facial wounds. He just brings me fish and pretty rocks. When I found him, he had a plastic six-pack round his neck with one can still stuck in the thing, dragging along behind him like a ball and chain. Big Bargains was choking on an ad insert. She’d probably smelled some ancient fish and chips grease lurking in the headlines. They only love me because I saved them. That doesn’t always work. I saved everyone else, too, and all I got back was blood and shit and loneliness.  6. REVLON SUPER LUSTROUS 919: RED RUIN  I went home with my new name fastened on tight. Darkgirls can’t stay in Electric City. Can’t live there unless you’re born there and I was only ten anyway. Goodnight Moon kissed me before I left. He still had his gas mask on so mainly our breathing hoses wound around each other like gentle elephants but I still call it a kiss. He smelled like scorched ozone and metal and paraffin and hope.  A few months later, Electric City put up a fence around the whole place. Hung up an old rusty shop sign that said EXCUSE OUR MESS WHILE WE RENOVATE. No one could go in or out except to trade and that had to get itself done on the dark side of the fence.  My mother and father didn’t start loving me when I got back even though I brought six AA batteries out of the back of Goodnight Moon’s tape player. My brother had got a ramen flavor packet stuck in his hair somewhere outside the Grocery Isle and was every inch of him Maruchan. A few years later I heard Life and Time telling some cousin how their marvelous and industrious and thoughtful boy had gone out in search of a name and brought back six silver batteries, enough to power anything they could dream of. What a child! What a son! So fuck them, I guess.  But Maruchan did bring something back. It just wasn’t for our parents. When we crawled into the Us-Fort that first night back, we lay uncomfortably against each other. We were the same, but we weren’t. We’d had separate adventures for the first time, and Maruchan could never understand why I wanted to sleep with a gas mask on now.  “Tetley, what do you want to be when you grow up?” Maruchan whispered in the dark of our pram-maze.  “Electrified,” I whispered back. “What do you want to be?”  “Safe,” he said. Things had happened to Maruchan, too, and I couldn’t share them anymore than he could hear Madeline Brix’s songs.  My twin pulled something out of his pocket and pushed it into my hand till my fingers closed round it reflexively. It was hard and plastic and warm.  “I love you, Tetley. Happy Birthday.”  I opened my fist. Maruchan had stolen lipstick for me. Revlon Super Lustrous 919: Red Ruin, worn almost all the way down to the nub by some dead woman’s lips.  After that, a lot of years went by but they weren’t anything special.  7. IF GOD TURNED UP FOR SUPPER  I was seventeen years old when Brighton Pier came to Garbagetown. I was tall and my hair was the color of an oil spill; I sang pretty good and did figures in my head and I could make a candle out of damn near anything. People wanted to marry me here and there but I didn’t want to marry them back so they thought I was stuck up. Who wouldn’t want to get hitched to handsome Candyland Ocampo and ditch Candle Hole for a clean, fresh life in Soapthorpe where bubbles popped all day long like diamonds in your hair? Well, I didn’t, because he had never kissed me with a gas mask on and he smelled like Pine Fresh cleaning solutions and not like scorched ozone at all.  Life and Time turned into little kids right in front of us. They giggled and whispered and Mum washed her hair in the sea about nine times and then soaked it in oil until it shone. Papa tucked a candle stump that had melted just right and looked like a perfect rose into her big no fancy hairdo and then, like it was a completely normal thing to do, put on a cloak sewn out of about a hundred different neckties. They looked like a prince and a princess.  “Brighton Pier came last when I was a girl, before I even had my name,” Time told us, still giggling and blushing like she wasn’t anyone’s mother. “It’s the most wonderful thing that can ever happen in the world.”  “If God turned up for supper and brought all the dry land back for dessert, it wouldn’t be half as good as one day on Brighton Pier,” Life crowed. He picked me up in his arms and twirled me around in the air. He’d never done that before, not once, and he had his heart strapped on so tight he didn’t even stop and realize what he’d done and go vacant-eyed and find something else to look at for a long while. He just squeezed me and kissed me like I came from somewhere and I didn’t know what the hell a Brighton Pier was but I loved it already.  “What is it? What is it?” Maruchan and I squealed, because you can catch happiness like a plague.  “It’s better the first time if you don’t know,” Mum assured us. “It’s meant to dock in Electric City on Friday.”  “So it’s a ship, then?” Maruchan said. But Papa just twinkled his eyes at us and put his finger over his lips to keep the secret in.  The Pier meant to dock in Electric City. My heart fell into my stomach, got all digested up, and sizzled out into the rest of me all at once. Of course, of course it would, Electric City had the best docks, the sturdiest, the prettiest. But it seemed to me like life was happening to me on purpose, and Electric City couldn’t keep a darkgirl out anymore. They had to share like the rest of us.  “What do you want to be when you grow up, Maruchan?” I said to my twin in the dark the night before we set off to see what was better than God. Maruchan’s eyes gleamed with the Christmas thrill of it all.  “Brighton Pier,” he whispered.  “Me, too,” I sighed, and we both dreamed we were beautiful Fuckwits running through a forest of real pines, laughing and stopping to eat apples and running again and only right before we woke up did we notice that something was chasing us, something huge and electric and bound for London-town.  8. CITIZENS OF MUTATION NATION  I looked for Goodnight Moon everywhere from the moment we crossed into Electric City. The fence had gone and Garbagetown poured in and nothing was different than it had been when I got my name off the battery spires, even though the sign had said for so long that Electric City was renovating. I played a terrible game with every person that shoved past, every face in a window, every shadow juddering down an alley and the game was: are you him? But I lost all the hands. The only time I stopped playing was when I first saw Brighton Pier.  I couldn’t get my eyes around it. It was a terrible, gorgeous whale of light and colors and music and otherness. All along a boardwalk jugglers danced and singers sang and horns horned and accordions squeezed and under it all some demonic engine screamed and wheezed. Great glass domes and towers and flags and tents glowed in the sunset but Brighton Pier made the sunset look plain-faced and unloveable. A huge wheel full of pink and emerald electric lights turned slowly in the warm wind but went nowhere. People leapt and turned somersaults and stood on each other’s shoulders and they all wore such soft, vivid costumes, like they’d all been cut out of a picture-book too fine for anyone like me to read. The tumblers lashed the pier to the Electric City docks and cut the engines and after that it was nothing but music so thick and good you could eat it out of the air.  Life and Time hugged Maruchan and cheered with the rest of Garbagetown. Tears ran down their faces. Everyone’s faces.  “When the ice melted and the rivers revolted and the Fuckwit world went under the seas,” Papa whispered through his weeping, “a great mob hacked Brighton Pier off of Brighton and strapped engines to it and set sail across the blue. They’ve been going ever since. They go around the world and around again, to the places where there’s still people, and trade their beauty for food and fuel. There’s a place on Brighton Pier where if you look just right, it’s like nothing ever drowned.”  A beautiful man wearing a hat of every color and several bells stepped up on a pedestal and held a long pale cone to his mouth. The mayor of Electric City embraced him with two meaty arms and asked his terrible, stupid, unforgivable question: “Have you seen dry land?”  And the beautiful man answered him: “With my own eyes.”  A roar went up like angels dying. I covered my ears. The mayor covered his mouth with his hands, speechless, weeping. The beautiful man patted him awkwardly on the back. Then he turned to us.  “Hello, Garbagetown!” he cried out and his voice sounded like everyone’s most secret heart.  We screamed so loud every bird in Garbagetown fled to the heavens and we clapped like mad and some people fell onto the ground and buried their faces in old batteries.  “My name is Emperor William Shakespeare the Eleventh and I am the Master of Brighton Pier! We will be performing Twelfth Night on the great stage tonight at seven o’clock, followed by The Duchess of Malfi at ten (which has werewolves) and a midnight acrobatic display! Come one, come all! Let Madame Limelight tell your FORTUNE! TEST your strength with the Hammer of the Witches! SEE the wonders of the Fuckwit World in our Memory Palace! Get letters and news from the LAST HUMAN OUTPOSTS around the globe! GASP at the citizens of Mutation Nation in the Freak Tent! Sample a FULL MINUTE of real television, still high definition after all these years! Concerts begin in the Crystal Courtyard in fifteen minutes! Our Peep Shows feature only the FINEST actresses reading aloud from GENUINE Fuckwit historical records! Garbagetown, we are here to DAZZLE you!”  A groan went up from the crowds like each Garbagetowner was just then bedding their own great lost love and they heaved toward the lights, the colors, the horns and the voices, the silk and the electricity and the life floating down there, knotted to the edge of our little pile of trash.  Someone grabbed my hand and held me back while my parents, my twin, my world streamed away from me down to the Pier. No one looked back.  “Are you her?” said Goodnight Moon. He looked longer and leaner but not really older. He had on his tie.  “Yes,” I said, and nothing was different than it had been when I got my name except now neither of us had masks and our kisses weren’t like gentle elephants but like a boy and a girl and I forgot all about my strength and my fortune and the wonderful wheel of light turning around and around and going nowhere.  9. TERRORWHORE  Actors are liars. Writers, too. The whole lot of them, even the horn players and the fortune-tellers and the freaks and the strongmen. Even the ladies with rings in their noses and high heels on their feet playing violins all along the pier and the lie they are all singing and dancing and saying is: we can get the old world back again.  My door said TERRORWHORE this morning. I looked after my potato plants and my hibiscus and thought about whether or not I would ever get to have sex again. Seemed unlikely. Big Bargains concurred.  Goodnight Moon and I lost our virginities in the Peep Show tent while a lady in green fishnet stockings and a lavender garter read to us from the dinner menu of the Dorchester Hotel circa 2005.  “Whole Berkshire roasted chicken stuffed with black truffles, walnuts, duck confit, and dauphinoise potatoes,” the lady purred. Goodnight Moon devoured my throat with kisses, bites, need. “Drizzled with a balsamic reduction and rosemary honey.”  “What’s honey?” I gasped. We could see her but she couldn’t see us, which was for the best. The glass in the window only went one way.  “Beats me, kid,” she shrugged, re-crossing her legs the other way. “Something you drizzle.” She went on. “Sticky toffee pudding with lashings of cream and salted caramel, passion fruit soufflé topped with orbs of pistachio ice cream . . . ”  Goodnight Moon smelled just as I remembered. Scorched ozone and metal and paraffin and hope and when he was inside me it was like hearing my name for the first time. I couldn’t escape the me-ness of it, the us-ness of it, the sound and the shape of ourselves turning into our future.  “I can’t believe you’re here,” he whispered into my breast. “I can’t believe this is us.”  The lady’s voice drifted over my head. “Lamb cutlets on a bed of spiced butternut squash, wilted greens, and delicate hand-harvested mushrooms served with goat cheese in clouds of pastry . . . ”  Goodnight Moon kissed my hair, my ears, my eyelids. “And now that the land’s come back Electric City’s gonna save us all. We can go home together, you and me, and build a house and we’ll have a candle in every window so you always feel at home . . . ”  The Dorchester dinner menu stopped abruptly. The lady dropped to her fishnetted knees and peered at us through the glass, her brilliant glossy red hair tumbling down, her spangled eyes searching for us beyond the glass.  “Whoa, sweetie, slow down,” she said. “You’re liable to scare a girl off that way.”  All I could see in the world was Goodnight Moon’s brown eyes and the sweat drying on his brown chest. Brown like the earth and all its promises. “I don’t care,” he said. “You scared, Tetley?” I shook my head. “Nothing can scare us now. Emperor Shakespeare said he’s seen land, real dry land, and we have a plan and we’re gonna get everything back again and be fat happy Fuckwits like we were always supposed to be.”  The Peep Show girl’s glittering eyes filled up with tears. She put her hand on the glass. “Oh . . . oh, baby . . . that’s just something we say. We always say it. To everyone. It’s our best show. Gives people hope, you know? But there’s nothing out there, sugar. Nothing but ocean and more ocean and a handful of drifty lifeboat cities like yours circling the world like horses on a broken-down carousel. Nothing but blue.”  10. WE ARE SO LUCKY  It would be nice for me if you could just say you understand. I want to hear that just once. Goodnight Moon didn’t. He didn’t believe her and he didn’t believe me and he sold me out in the end in spite of gas masks and kissing and Madeline Brix and the man crooning in our ears that he was happy because all he could hear was Emperor William Shakespeare the Eleventh singing out his big lie. RESURRECTION! REDEMPTION! REVIVIFICATION! LAND HO!  “No, because, see,” my sweetheart wept on the boardwalk while the wheel spun dizzily behind his head like an electric candy crown, “we have a plan. We’ve worked so hard. It has to happen. The mayor said as soon as we had news of dry land, the minute we knew, we’d turn it on and we’d get there first and the continents would be ours, Garbagetowners, we’d inherit the Earth. He’s gonna tell everyone when the Pier leaves. At the farewell party.”  “Turn what on?”  Resurrection. Redemption. Renovation. All those years behind the fence Electric City had been so busy. Disassembling all those engines they hoarded so they could make a bigger one, the biggest one. Pooling fuel in great vast stills. Practicing ignition sequences. Carving up a countryside they’d never even seen between the brightboys and brightgirls and we could have some, too, if we were good.  “You want to turn Garbagetown into a Misery Boat,” I told him. “So we can just steam on ahead into nothing and go mad and use up all the gas and batteries that could keep us happy in mixtapes for another century here in one hot minute.”  “The Emperor said . . . ”  “He said his name was Duke Orsino of Illyria, too. And then Roderigo when they did the werewolf play. Do you believe that? If they’d found land, don’t you think they’d have stayed there?”  But he couldn’t hear me. Neither could Maruchan when I tried to tell him the truth in the Peep Show. All they could see was green. Green leafy trees and green grass and green ivy in some park that was lying at the bottom of the sea. We dreamed different dreams now, my brother and I, and all my dreams were burning.  Say you understand. I had to. I’m not a nihilist or a murdercunt or a terrorwhore. They were gonna use up every last drop of Garbagetown’s power to go nowhere and do nothing and instead of measuring out teaspoons of good, honest gas, so that it lasts and we last all together, no single thing on the patch would ever turn on again, and we’d go dark, really dark, forever. Dark like the bottom of a hole. They had no right. They don’t understand. This is it. This is the future. Garbagetown and the sea. We can’t go back, not ever, not even for a minute. We are so lucky. Life is so good. We’re going on and being alive and being shitty sometimes and lovely sometimes just the same as we always have, and only a Fuckwit couldn’t see that.  I waited until Brighton Pier cast off, headed to the next rickety harbor of floating foolboats, filled with players and horns and glittering wheels and Dorchester menus and fresh mountains of letters we wouldn’t read the answers to for another twenty years. I waited until everyone was sleeping so nobody would get hurt except the awful engine growling and panting to deliver us into the dark salt nothing of an empty hellpromise.  It isn’t hard to build a bomb in Electric City. It’s all just laying around behind that fence where a boy held my hand for the first time. All you need is a match.  11. WHAT YOU CAME FOR  It’s such a beautiful day out. My hibiscus is just gigantic, red as the hair on a Peep Show dancer. If you want to wait, Big Bargains will be round later for her afternoon nap. Grape Crush usually brings a herring by in the evening. But I understand if you’ve got other places to be.  It’s okay. You can hit me now. If you want to. It’s what you came for. I barely feel it anymore.  Thank you for my instruction.    Originally published in Drowned Worlds, edited by Jonathan Strahan.  Catherynne M. Valente is the New York Times bestselling author of over two dozen works of fiction and poetry, including Palimpsest, the Orphan's Tales series, Deathless, Radiance, and the crowdfunded phenomenon The Girl Who Circumnavigated Fairyland in a Ship of Own Making (and the four books that followed it). She is the winner of the Andre Norton, Tiptree, Sturgeon, Prix Imaginales, Eugie Foster Memorial, Mythopoeic, Rhysling, Lambda, Locus, Romantic Times' Critics Choice and Hugo awards. She has been a finalist for the Nebula and World Fantasy Awards. She lives on an island off the coast of Maine with a small but growing menagerie of beasts, some of which are human.", "text": "8430 words, novelette, REPRINT\nThe Future is Blue\n1. NIHILIST\nMy name is Tetley Abednego and I am the most hated girl in Garbagetown. I am nineteen years old. I live alone in Candle Hole, where I was born, and have no friends except for a deformed gannet bird I’ve named Grape Crush and a motherless elephant seal cub I’ve named Big Bargains, and also the hibiscus flower that has recently decided to grow out of my roof, but I haven’t named it anything yet. I love encyclopedias, a cassette I found when I was eight that says Madeline Brix’s Superboss Mixtape ’97 on it in very nice handwriting, plays by Mr. Shakespeare or Mr. Webster or Mr. Beckett, lipstick, Garbagetown, and my twin brother Maruchan. Maruchan is the only thing that loves me back, but he’s my twin, so it doesn’t really count. We couldn’t stop loving each other any more than the sea could stop being so greedy and give us back China or drive time radio or polar bears.\nBut he doesn’t visit anymore.\nWhen we were little, Maruchan and I always asked each other the same question before bed. Every night, we crawled into the Us-Fort together—an impregnable stronghold of a bed which we had nailed up ourselves out of the carcasses of several hacked apart bassinets, prams, and cradles. It took up the whole of our bedroom. No one could see us in there, once we closed the porthole (a manhole cover I swiped from Scrapmetal Abbey stamped with stars, a crescent moon, and the magic words New Orleans Water Meter), and we felt certain no one could hear us either. We lay together under our canopy of moldy green lace and shredded buggy-hoods and mobiles with only one shattered fairy fish remaining. Sometimes I asked first and sometimes he did, but we never gave the same answer twice.\n“Maruchan, what do you want to be when you grow up?”\nHe would give it a serious think. Once, I remember, he whispered:\n“When I grow up I want to be the Thames!”\n“Whatever for?” I giggled.\n“Because the Thames got so big and so bossy and so strong that it ate London all up in one go! Nobody tells a Thames what to do or who to eat. A Thames tells you. Imagine having a whole city to eat, and not having to share any! Also there were millions of eels in the Thames and I only get to eat eels at Easter which isn’t fair when I want to eat them all the time.”\nAnd he pretended to bite me and eat me all up. “Very well, you shall be the Thames and I shall be the Mississippi and together we shall eat up the whole world.”\nThen we’d go to sleep and dream the same dream. We always dreamed the same dreams, which was like living twice.\nAfter that, whenever we were hungry, which was always all the time and forever, we’d say we’re bound for London-town! until we drove our parents so mad that they forbade the word London in the house, but you can’t forbid a word, so there.\nEvery morning I wake up to find words painted on my door like toadstools popping up in the night.\nToday it says NIHILIST in big black letters. That’s not so bad! It’s almost sweet! Big Bargains flumps toward me on her fat seal-belly while I light the wicks on my beeswax door and we watch them burn together until the word melts away.\n“I don’t think I’m a nihilist, Big Bargains. Do you?”\nShe rolled over onto my matchbox stash so that I would rub her stomach. Rubbing a seal’s stomach is the opposite of nihilism.\nYesterday, an old man hobbled up over a ridge of rusted bicycles and punched me so hard he broke my nose. By law, I had to let him. I had to say: Thank you, Grandfather, for my instruction. I had to stand there and wait in case he wanted to do something else to me. Anything but kill me, those were his rights. But he didn’t want more, he just wanted to cry and ask me why I did it and the law doesn’t say I have to answer that, so I just stared at him until he went away. Once a gang of schoolgirls shaved off all my hair and wrote CUNT in blue marker on the back of my skull. Thank you, sisters, for my instruction. The schoolboys do worse. After graduation they come round and eat my food and hold me down and try to make me cry, which I never do. It’s their rite of passage. Thank you, brothers, for my instruction.\nBut other than that, I’m really a very happy person! I’m awfully lucky when you think about it. Garbagetown is the most wonderful place anybody has ever lived in the history of the world, even if you count the Pyramids and New York City and Camelot. I have Grape Crush and Big Bargains and my hibiscus flower and I can fish like I’ve got bait for a heart so I hardly ever go hungry and once I found a ruby ring and a New Mexico license plate inside a bluefin tuna. Everyone says they only hate me because I annihilated hope and butchered our future, but I know better, and anyway, it’s a lie. Some people are just born to be despised. The Loathing of Tetley began small and grew bigger and bigger, like the Thames, until it swallowed me whole.\nMaruchan and I were born fifty years after the Great Sorting, which is another lucky thing that’s happened to me. After all, I could have been born a Fuckwit and gotten drowned with all the rest of them, or I could have grown up on a Misery Boat, sailing around hopelessly looking for land, or one of the first to realize people could live on a patch of garbage in the Pacific Ocean the size of the place that used to be called Texas, or I could have been a Sorter and spent my whole life moving rubbish from one end of the patch to the other so that a pile of crap could turn into a country and babies could be born in places like Candle Hole or Scrapmetal Abbey or Pill Hill or Toyside or Teagate.\nCandle Hole is the most beautiful place in Garbagetown, which is the most beautiful place in the world. All the stubs of candles the Fuckwits threw out piled up into hills and mountains and caverns and dells, votive candles and taper candles and tea lights and birthday candles and big fat colorful pillar candles, stacked and somewhat melted into a great crumbling gorgeous warren of wicks and wax. All the houses are little cozy honeycombs melted into the hillside, with smooth round windows and low golden ceilings. At night, from far away, Candle Hole looks like a firefly palace. When the wind blows, it smells like cinnamon, and freesia, and cranberries, and lavender, and Fresh Linen Scent, and New Car Smell.\n2. THE TERRIBLE POWER OF FUCKWIT CAKE\nOur parents’ names are Life and Time. Time lay down on her Fresh Linen Scent wax bed and I came out of her first, then Maruchan. But even though I got here first, I came out blue as the ocean, not breathing, with the umbilical cord wrapped round my neck and Maruchan wailing, still squeezing onto my noose with his tiny fist, like he was trying to get me free. Doctor Pimms unstrangled and unblued me and put me in a Hawaiian Fantasies-scented wax hollow in our living room. I lay there alone, too startled by living to cry, until the sun came up and Life and Time remembered I had survived. Maruchan was so healthy and sweet-natured and strong and, even though Garbagetown is the most beautiful place in the world, many children don’t live past a year or two. We don’t even get names until we turn ten. (Before that, we answer happily to Girl or Boy or Child or Darling.) Better to focus on the one that will grow up rather than get attached to the sickly poor beast who hasn’t got a chance.\nI was born already a ghost. But I was a very noisy ghost. I screamed and wept at all hours while Life and Time waited for me to die. I only nursed when my brother was full, I only played with toys he forgot, I only spoke after he had spoken. Maruchan said his first word at the supper table: please. What a lovely, polite word for a lovely, polite child! After they finished cooing over him, I very calmly turned to my mother and said: Mama, may I have a scoop of mackerel roe? It is my favorite. I thought they would be so proud! After all, I made twelve more words than my brother. This was my moment, the wonderful moment when they would realize that they did love me and I wasn’t going to die and I was special and good. But everyone got very quiet. They were not happy that the ghost could talk. I had been able to for ages, but everything in my world said to wait for my brother before I could do anything at all. No, you may not have mackerel roe, because you are a deceitful wicked little show-off child.\nWhen we turned ten, we went to fetch our names. This is just the most terribly exciting thing for a Garbagetown kid. At ten, you are a real person. At ten, people want to know you. At ten, you will probably live for a good while yet. This is how you catch a name: wake up to the fabulous new world of being ten and greet your birthday Frankencake (a hodgepodge of well-preserved Fuckwit snack cakes filled with various crèmes and jellies). Choose a slice, with much fanfare. Inside, your adoring and/or neglectful mother will have hidden various small objects—an aluminum pull tab, a medicine bottle cap, a broken earring, a coffee bean, a wee striped capacitor, a tiny plastic rocking horse, maybe a postage stamp. Remove item from your mouth without cutting yourself or eating it. Now, walk in the direction of your prize. Toward Aluminumopolis or Pill Hill or Spanglestoke or Teagate or Electric City or Toyside or Lost Post Gulch. Walk and walk and walk. Never once brush yourself off or wash in the ocean, even after camping on a pile of magazines or wishbones or pregnancy tests or wrapping paper with glitter reindeer on it. Walk until nobody knows you. When, finally, a stranger hollers at you to get out of the way or go back where you came from or stop stealing the good rubbish, they will, without even realizing, call you by your true name, and you can begin to pick and stumble your way home.\nMy brother grabbed a chocolate snack cake with a curlicue of white icing on it. I chose a pink and red tigery striped hunk of cake filled with gooshy crème de something. The sugar hit our brains like twin tsunamis. He spat out a little gold earring with the post broken off. I felt a smooth, hard gelcap lozenge in my mouth. Pill Hill it was then, and the great mountain of Fuckwit anxiety medication. But when I carefully pulled the thing out, it was a little beige capacitor with red stripes instead. Electric City! I’d never been half so far. Richies lived in Electric City. Richies and brightboys and dazzlegirls and kerosene kings. My brother was off in the opposite direction, toward Spanglestoke and the desert of engagement rings.\nMaybe none of it would have happened if I’d gone to Spanglestoke for my name instead. If I’d never seen the gasoline gardens of Engine Row. If I’d gone home straightaway after finding my name. If I’d never met Goodnight Moon in the brambles of Hazmat Heath with all the garbage stars rotting gorgeously overhead. Such is the terrible power of Fuckwit Cake.\nI walked cheerfully out of Candle Hole with my St. Oscar backpack strapped on tight and didn’t look back once. Why should I? St. Oscar had my back. I’m not really that religious nowadays. But everyone’s religious when they’re ten. St. Oscar was a fuzzy green Fuckwit man who lived in a garbage can just like me, and frowned a lot just like me. He understood me and loved me and knew how to bring civilization out of trash and I loved him back even though he was a Fuckwit. Nobody chooses how they get born. Not even Oscar.\nSo I scrambled up over the wax ridges of my home and into the world with Oscar on my back. The Matchbox Forest rose up around me: towers of EZ Strike matchbooks and boxes from impossible, magical places like the Coronado Hotel, Becky’s Diner, the Fox and Hound Pub. Garbagetowners picked through heaps and cairns of blackened, used matchsticks looking for the precious ones that still had their red and blue heads intact. But I knew all those pickers. They couldn’t give me a name. I waved at the hotheads. I climbed up Flintwheel Hill, my feet slipping and sliding on the mountain of spent butane lighters, until I could see out over all of Garbagetown just as the broiling cough-drop red sun was setting over Far Boozeaway, hitting the crystal bluffs of stockpiled whiskey and gin bottles and exploding into a billion billion rubies tumbling down into the hungry sea.\nI sang a song from school to the sun and the matchsticks. It’s an ask-and-answer song, so I had to sing both parts myself, which feels very odd when you have always had a twin to do the asking or the answering, but I didn’t mind.\nWho liked it hot and hated snow?\nThe Fuckwits did! The Fuckwits did!\nWho ate up every thing that grows?\nThe Fuckwits did! The Fuckwits did!\nWho drowned the world in oceans blue?\nThe Fuckwits did! The Fuckwits did!\nWho took the land from me and you?\nThe Fuckwits did, we know it’s true!\nAre you Fuckwits, children dear?\nWe’re GARBAGETOWNERS, free and clear!\nBut who made the garbage, rich and rank?\nThe Fuckwits did, and we give thanks.\nThe Lawn stretched out below me, full of the grass clippings and autumn leaves and fallen branches and banana peels and weeds and gnawed bones and eggshells of the fertile Fuckwit world, slowly turning into the gold of Garbagetown: soil. Real earth. Terra bloody firma. We can already grow rice in the dells. And here and there, big, blowsy flowers bang up out of the rot: hibiscus, African tulips, bitter gourds, a couple of purple lotuses floating in the damp mucky bits. I slept next to a blue-and-white orchid that looked like my brother’s face.\n“Orchid, what do you want to be when you grow up?” I whispered to it. In real life, it didn’t say anything back. It just fluttered a little in the moonlight and the sea wind. But when I got around to dreaming, I dreamed about the orchid, and it said: a farm.\n3. MURDERCUNT\nIn Garbagetown, you think real hard about what you’re gonna eat next, where the fresh water’s at, and where you’re gonna sleep. Once all that’s settled you can whack your mind on nicer stuff, like gannets and elephant seals and what to write next on the Bitch of Candle Hole’s door. (This morning I melted MURDERCUNT off the back wall of my house. Big Bargains flopped down next to me and watched the blocky red painted letters swirl and fade into the Buttercream Birthday Cake wax. Maybe I’ll name my hibiscus flower Murdercunt. It has a nice big sound.)\nWhen I remember hunting my name, I mostly remember the places I slept. It’s a real dog to find good spots. Someplace sheltered from the wind, without too much seawater seep, where no-one’ll yell at you for wastreling on their patch or try to stick it in you in the middle of the night just because you’re all alone and it looks like you probably don’t have a knife.\nI always have a knife.\nSo I slept with St. Oscar the Grouch for my pillow, in the shadow of a mountain of black chess pieces in Gamegrange, under a thicket of tabloids and Wall Street Journals and remaindered novels with their covers torn off in Bookbury, snuggled into a spaghetti-pile of unspooled cassette ribbon on the outskirts of the Sound Downs, on the lee side of a little soggy Earl Grey hillock in Teagate. In the morning I sucked on a few of the tea bags and the dew on them tasted like the loveliest cuppa any Fuckwit ever poured his stupid self. I said my prayers on beds of old microwaves and moldy photographs of girls with perfect hair kissing at the camera. St. Oscar, keep your mighty lid closed over me. Look grouchily but kindly upon me and protect me as I travel through the infinite trash can of your world. Show me the beautiful usefulness of your Blessed Rubbish. Let me not be Taken Out before I find my destiny.\nBut my destiny didn’t seem to want to find me. As far as I walked, I still saw people I knew. Mr. Zhu raking his mushroom garden, nestled in a windbreak of broken milk bottles. Miss Amancharia gave me one of the coconut crabs out of her nets, which was very nice of her, but hardly a name. Even as far away as Teagate, I saw Tropicana Sita welding a refrigerator door to a hull-metal shack. She flipped up her mask and waved at me. Dammit! She was Allsorts Sita’s cousin, and Allsorts drank with my mother every Thursday at the Black Wick.\nBy the time I walked out of Teagate I’d been gone eight days. I was getting pretty ripe. Bits and pieces of Garbagetown were stuck all over my clothes, but no tidying up. Them’s the rules. I could see the blue crackle of Electric City sparkling up out of the richie-rich Coffee Bean ’Burbs. Teetering towers of batteries rose up like desert hoodoo spires—AA, AAA, 12 Volt, DD, car, solar, lithium, anything you like. Parrots and pelicans screamed down the battery canyons, their talons kicking off sprays of AAAs that tumbled down the heights like rockslides. Sleepy banks of generators rumbled pleasantly along a river of wires and extension cords and HDMI cables. Fields of delicate lightbulbs wind-chimed in the breeze. Anything that had a working engine lived here. Anything that still had juice. If Garbagetown had a heart, it was Electric City. Electric City pumped power. Power and privilege.\nIn Electric City, the lights of the Fuckwit world were still on.\n4. GOODNIGHT GARBAGETOWN\n“Oi, Tetley! Fuck off back home to your darkhole! We’re full up on little cunts here!”\nAnd that’s how I got my name. Barely past the battery spires of Electric City, a fat gas-huffing fucksack voltage jockey called me a little cunt. But he also called me Tetley. He brayed it down from a pyramid of telephones and his friends all laughed and drank home brew out of a glass jug and went back to not working. I looked down—among the many scraps of rubbish clinging to my shirt and pants and backpack and hair was a bright blue tea bag wrapper with TETLEY CLASSIC BLEND BLACK TEA written on it in cheerful white letters, clinging to my chest.\nI tried to feel the power of my new name. The me-ness of it. I tried to imagine my mother and father when they were young, waking up with some torn out page of Life or Time magazine stuck to their rears, not even noticing until someone barked out their whole lives for a laugh. But I couldn’t feel anything while the volt-humpers kept on staring at me like I was nothing but a used-up potato battery. I didn’t even know then that the worst swear word in Electric City was dark. I didn’t know they were waiting to see how mad I’d get ’cause they called my home a darkhole. I didn’t care. They were wrong and stupid. Except for the hole part. Candle Hole never met a dark it couldn’t burn down.\nMaybe I should have gone home right then. I had my name! Time to hoof it back over the river and through the woods, girl. But I’d never seen Electric City and it was morning and if I stayed gone awhile longer maybe they’d miss me. Maybe they’d worry. And maybe now they’d love me, now that I was a person with a name. Maybe I could even filch a couple of batteries or a cup of gasoline and turn up at my parents’ door in turbo-powered triumph. I’d tell my brother all my adventures and he’d look at me like I was magic on a stick and everything would be good forever and ever amen.\nSo I wandered. I gawped. It was like being in school and learning the Fuckwit song only I was walking around inside the Fuckwit song and it was all still happening right now everywhere. Electric City burbled and bubbled and clanged and belched and smoked just like the bad old world before it all turned blue. Everyone had such fine things! I saw a girl wearing a ball gown out of a fairy book, green and glitter and miles of ruffles and she wasn’t even going anywhere. She was just tending her gasoline garden out the back of her little cottage, which wasn’t made out of candles or picture-books or cat food cans, but real cottage parts! Mostly doors and shutters and really rather a lot of windows, but they fit together like they never even needed the other parts of a house in the first place. And the girl in her green-glitter dress carried a big red watering can around her garden, sprinkling fuel stabilizer into her tidy rows of petrol barrels and gas cans with their graceful spouts pointed toward the sun. Why not wear that dress all the time? Just a wineglass full of what she was growing in her garden would buy almost anything else in Garbagetown. She smiled shyly at me. I hated her. And I wanted to be her.\nBy afternoon I was bound for London-town, so hungry I could’ve slurped up every eel the Thames ever had. There’s no food lying around in Electric City. In Candle Hole I could’ve grabbed candy or a rice ball or jerky off any old midden heap. But here everybody owned their piece and kept it real neat, mercilessly neat, and they didn’t share. I sat down on a rusty Toyota transmission and fished around in my backpack for crumbs. My engine sat on one side of a huge cyclone fence. I’d never seen one all put together before. Sure, you find torn-off shreds of wire fences, but this one was all grown up, with proper locks and chain wire all over it. It meant to Keep You Out. Inside, like hungry dogs, endless barrels and freezers and cylinders and vats went on and on, with angry writing on them that said HAZMAT or BIOHAZARD or RADIOACTIVE or WARNING or DANGER or CLASSIFIED.\n“Got anything good in there?” said a boy’s voice. I looked round and saw a kid my own age, with wavy black hair and big brown eyes and three little moles on his forehead. He was wearing the nicest clothes I ever saw on a boy—a blue suit that almost, almost fit him. With a tie.\n“Naw,” I answered. “Just a dry sweater, an empty can of Cheez Whiz, and Madeline Brix’s Superboss Mixtape ’97. It’s my good luck charm.” I showed him my beloved mixtape. Madeline Brix made all the dots on her i’s into hearts. It was a totally Fuckwit thing to do and I loved her for it even though she was dead and didn’t care if I loved her or not.\n“Cool,” the boy said, and I could tell he meant it. He didn’t even call me a little cunt or anything. He pushed his thick hair out of his face. “Listen, you really shouldn’t be here. No one’s gonna say anything because you’re not Electrified, but it’s so completely dangerous. They put all that stuff in one place so it couldn’t get out and hurt anyone.”\n“Electrified?”\n“One of us. Local.” He had the decency to look embarrassed. “Anyway, I saw you and I thought that if some crazy darkgirl is gonna have a picnic on Hazmat Heath, I could at least help her not die while she’s doing it.”\nThe boy held out his hand. He was holding a gas mask. He showed me how to fasten it under my hair. The sun started to set rosily behind a tangled briar of motherboards. Everything turned pink and gold and slow and sleepy. I climbed down from my engine tuffet and lay under the fence next to the boy in the suit. He’d brought a mask for himself too. We looked at each other through the eyeholes.\n“My name’s Goodnight Moon,” he said.\n“Mine’s . . . ” And I did feel my new name swirling up inside me then, like good tea, like cream and sugar cubes, like the most essential me. “Tetley.”\n“I’m sorry I called you a darkgirl, Tetley.”\n“Why?”\n“It’s not a nice thing to call someone.”\n“I like it. It sounds pretty.”\n“It isn’t. I promise. Do you forgive me?”\nI tugged on the hose of my gas mask. The air coming through tasted like nickels. “Sure. I’m aces at forgiving. Been practicing all my life. Besides . . . ” My turn to go red in the face. “At the Black Wick they’d probably call you a brightboy and that’s not as pretty as it sounds, either.”\nGoodnight Moon’s brown eyes stared out at me from behind thick glass. It was the closest I’d ever been to a boy who wasn’t my twin. Goodnight Moon didn’t feel like a twin. He felt like the opposite of a twin. We never shared a womb, but on the other end of it all, we might still share a grave. His tie was burgundy with green swirls in it. He hadn’t tied it very well, so I could see the skin of his throat, which was very clean and probably very soft.\n“Hey,” he said, “do you want to hear your tape?”\n“What do you mean hear it? It’s not for hearing, it’s for luck.”\nGoodnight Moon laughed. His laugh burst all over me like butterfly bombs. He reached into his suit jacket and pulled out a thick black rectangle. I handed him Madeline Brix’s Superboss Mixtape ’97 and he hit a button on the side of the rectangle. It popped open; Goodnight Moon slotted in my tape and handed me one end of a long wire.\n“Put it in your ear,” he said, and I did.\nA man’s voice filled up my head from my jawbone up to the plates of my skull. The most beautiful and saddest voice that ever was. A voice like Candle Hole all lit up at twilight. A voice like the whole old world calling up from the bottom of the sea. The man on Madeline Brix’s tape was saying he was happy, and he hoped I was happy, too.\nGoodnight Moon reached out to hold my hand just as the sky went black and starry. I was crying. He was, too. Our tears dripped out of our gas masks onto the rusty road of Electric City.\nWhen the tape ended, I dug in my backpack for a match and a stump of candle: dark red, Holiday Memories scent. I lit it at the same moment that Goodnight Moon pulled a little flashlight out of his pocket and turned it on. We held our glowings between us. We were the same.\n5. BRIGHTBITCH\nAllsorts Sita came to visit me today. Clicked my knocker early in the morning, early enough that I could be sure she’d never slept in the first place. I opened for her, as I am required to do. She looked up at me with eyes like bullet holes, leaning on my waxy hinges, against the T in BRIGHTBITCH, thoughtfully scrawled in what appeared to be human shit across the front of my hut. BRIGHTBITCH smelled, but Allsorts Sita smelled worse. Her breath punched me in the nose before she did. I got a lungful of what Diet Sprite down at the Black Wick optimistically called “cognac”: the thick pinkish booze you could get by extracting the fragrance oil and preservatives out of candles and mixing it with wood alcohol the kids over in Furnitureford boiled out of dining sets and china cabinets. Smells like flowers vomited all over a New Car and then killed a badger in the back seat. Allsorts Sita looked like she’d drunk so much cognac you could light one strand of her hair and she’d burn for eight days.\n“You fucking whore,” she slurred.\n“Thank you, Auntie, for my instruction,” I answered quietly.\nI have a place I go to in my mind when I have visitors who aren’t seals or gannet birds or hibiscus flowers. A little house made all of doors and windows, where I wear a green-glitter dress every day and water my gas can garden and read by electric light.\n“I hate you. I hate you. How could you do it? We raised you and fed you and this is how you repay it all. You ungrateful bitch.”\n“Thank you, Auntie, for my instruction.”\nIn my head I ran my fingers along a cyclone fence and all the barrels on the other side read LIFE and LOVE and FORGIVENESS and UNDERSTANDING.\n“You’ve killed us all,” Allsorts Sita moaned. She puked up magenta cognac on my stoop. When she was done puking she hit me over and over with closed fists. It didn’t hurt too much. Allsorts is a small woman. But it hurt when she clawed my face and my breasts with her fingernails. Blood came up like wax spilling and when she finished she passed out cold, halfway in my house, halfway out.\n“Thank you, Auntie, for my instruction,” I said to her sleeping body. My blood dripped onto her, but in my head I was lying on my roof made of two big church doors in a gas mask listening to a man sing to me that he’s never done bad things and he hopes I’m happy, he hopes I’m happy, he hopes I’m happy.\nBig Bargains moaned mournfully and the lovely roof melted away like words on a door. My elephant seal friend flopped and fretted. When they’ve gone for my face she can’t quite recognize me and it troubles her seal-soul something awful. Grape Crush, my gannet bird, never worries about silly things like facial wounds. He just brings me fish and pretty rocks. When I found him, he had a plastic six-pack round his neck with one can still stuck in the thing, dragging along behind him like a ball and chain. Big Bargains was choking on an ad insert. She’d probably smelled some ancient fish and chips grease lurking in the headlines. They only love me because I saved them. That doesn’t always work. I saved everyone else, too, and all I got back was blood and shit and loneliness.\n6. REVLON SUPER LUSTROUS 919: RED RUIN\nI went home with my new name fastened on tight. Darkgirls can’t stay in Electric City. Can’t live there unless you’re born there and I was only ten anyway. Goodnight Moon kissed me before I left. He still had his gas mask on so mainly our breathing hoses wound around each other like gentle elephants but I still call it a kiss. He smelled like scorched ozone and metal and paraffin and hope.\nA few months later, Electric City put up a fence around the whole place. Hung up an old rusty shop sign that said EXCUSE OUR MESS WHILE WE RENOVATE. No one could go in or out except to trade and that had to get itself done on the dark side of the fence.\nMy mother and father didn’t start loving me when I got back even though I brought six AA batteries out of the back of Goodnight Moon’s tape player. My brother had got a ramen flavor packet stuck in his hair somewhere outside the Grocery Isle and was every inch of him Maruchan. A few years later I heard Life and Time telling some cousin how their marvelous and industrious and thoughtful boy had gone out in search of a name and brought back six silver batteries, enough to power anything they could dream of. What a child! What a son! So fuck them, I guess.\nBut Maruchan did bring something back. It just wasn’t for our parents. When we crawled into the Us-Fort that first night back, we lay uncomfortably against each other. We were the same, but we weren’t. We’d had separate adventures for the first time, and Maruchan could never understand why I wanted to sleep with a gas mask on now.\n“Tetley, what do you want to be when you grow up?” Maruchan whispered in the dark of our pram-maze.\n“Electrified,” I whispered back. “What do you want to be?”\n“Safe,” he said. Things had happened to Maruchan, too, and I couldn’t share them anymore than he could hear Madeline Brix’s songs.\nMy twin pulled something out of his pocket and pushed it into my hand till my fingers closed round it reflexively. It was hard and plastic and warm.\n“I love you, Tetley. Happy Birthday.”\nI opened my fist. Maruchan had stolen lipstick for me. Revlon Super Lustrous 919: Red Ruin, worn almost all the way down to the nub by some dead woman’s lips.\nAfter that, a lot of years went by but they weren’t anything special.\n7. IF GOD TURNED UP FOR SUPPER\nI was seventeen years old when Brighton Pier came to Garbagetown. I was tall and my hair was the color of an oil spill; I sang pretty good and did figures in my head and I could make a candle out of damn near anything. People wanted to marry me here and there but I didn’t want to marry them back so they thought I was stuck up. Who wouldn’t want to get hitched to handsome Candyland Ocampo and ditch Candle Hole for a clean, fresh life in Soapthorpe where bubbles popped all day long like diamonds in your hair? Well, I didn’t, because he had never kissed me with a gas mask on and he smelled like Pine Fresh cleaning solutions and not like scorched ozone at all.\nLife and Time turned into little kids right in front of us. They giggled and whispered and Mum washed her hair in the sea about nine times and then soaked it in oil until it shone. Papa tucked a candle stump that had melted just right and looked like a perfect rose into her big no fancy hairdo and then, like it was a completely normal thing to do, put on a cloak sewn out of about a hundred different neckties. They looked like a prince and a princess.\n“Brighton Pier came last when I was a girl, before I even had my name,” Time told us, still giggling and blushing like she wasn’t anyone’s mother. “It’s the most wonderful thing that can ever happen in the world.”\n“If God turned up for supper and brought all the dry land back for dessert, it wouldn’t be half as good as one day on Brighton Pier,” Life crowed. He picked me up in his arms and twirled me around in the air. He’d never done that before, not once, and he had his heart strapped on so tight he didn’t even stop and realize what he’d done and go vacant-eyed and find something else to look at for a long while. He just squeezed me and kissed me like I came from somewhere and I didn’t know what the hell a Brighton Pier was but I loved it already.\n“What is it? What is it?” Maruchan and I squealed, because you can catch happiness like a plague.\n“It’s better the first time if you don’t know,” Mum assured us. “It’s meant to dock in Electric City on Friday.”\n“So it’s a ship, then?” Maruchan said. But Papa just twinkled his eyes at us and put his finger over his lips to keep the secret in.\nThe Pier meant to dock in Electric City. My heart fell into my stomach, got all digested up, and sizzled out into the rest of me all at once. Of course, of course it would, Electric City had the best docks, the sturdiest, the prettiest. But it seemed to me like life was happening to me on purpose, and Electric City couldn’t keep a darkgirl out anymore. They had to share like the rest of us.\n“What do you want to be when you grow up, Maruchan?” I said to my twin in the dark the night before we set off to see what was better than God. Maruchan’s eyes gleamed with the Christmas thrill of it all.\n“Brighton Pier,” he whispered.\n“Me, too,” I sighed, and we both dreamed we were beautiful Fuckwits running through a forest of real pines, laughing and stopping to eat apples and running again and only right before we woke up did we notice that something was chasing us, something huge and electric and bound for London-town.\n8. CITIZENS OF MUTATION NATION\nI looked for Goodnight Moon everywhere from the moment we crossed into Electric City. The fence had gone and Garbagetown poured in and nothing was different than it had been when I got my name off the battery spires, even though the sign had said for so long that Electric City was renovating. I played a terrible game with every person that shoved past, every face in a window, every shadow juddering down an alley and the game was: are you him? But I lost all the hands. The only time I stopped playing was when I first saw Brighton Pier.\nI couldn’t get my eyes around it. It was a terrible, gorgeous whale of light and colors and music and otherness. All along a boardwalk jugglers danced and singers sang and horns horned and accordions squeezed and under it all some demonic engine screamed and wheezed. Great glass domes and towers and flags and tents glowed in the sunset but Brighton Pier made the sunset look plain-faced and unloveable. A huge wheel full of pink and emerald electric lights turned slowly in the warm wind but went nowhere. People leapt and turned somersaults and stood on each other’s shoulders and they all wore such soft, vivid costumes, like they’d all been cut out of a picture-book too fine for anyone like me to read. The tumblers lashed the pier to the Electric City docks and cut the engines and after that it was nothing but music so thick and good you could eat it out of the air.\nLife and Time hugged Maruchan and cheered with the rest of Garbagetown. Tears ran down their faces. Everyone’s faces.\n“When the ice melted and the rivers revolted and the Fuckwit world went under the seas,” Papa whispered through his weeping, “a great mob hacked Brighton Pier off of Brighton and strapped engines to it and set sail across the blue. They’ve been going ever since. They go around the world and around again, to the places where there’s still people, and trade their beauty for food and fuel. There’s a place on Brighton Pier where if you look just right, it’s like nothing ever drowned.”\nA beautiful man wearing a hat of every color and several bells stepped up on a pedestal and held a long pale cone to his mouth. The mayor of Electric City embraced him with two meaty arms and asked his terrible, stupid, unforgivable question: “Have you seen dry land?”\nAnd the beautiful man answered him: “With my own eyes.”\nA roar went up like angels dying. I covered my ears. The mayor covered his mouth with his hands, speechless, weeping. The beautiful man patted him awkwardly on the back. Then he turned to us.\n“Hello, Garbagetown!” he cried out and his voice sounded like everyone’s most secret heart.\nWe screamed so loud every bird in Garbagetown fled to the heavens and we clapped like mad and some people fell onto the ground and buried their faces in old batteries.\n“My name is Emperor William Shakespeare the Eleventh and I am the Master of Brighton Pier! We will be performing Twelfth Night on the great stage tonight at seven o’clock, followed by The Duchess of Malfi at ten (which has werewolves) and a midnight acrobatic display! Come one, come all! Let Madame Limelight tell your FORTUNE! TEST your strength with the Hammer of the Witches! SEE the wonders of the Fuckwit World in our Memory Palace! Get letters and news from the LAST HUMAN OUTPOSTS around the globe! GASP at the citizens of Mutation Nation in the Freak Tent! Sample a FULL MINUTE of real television, still high definition after all these years! Concerts begin in the Crystal Courtyard in fifteen minutes! Our Peep Shows feature only the FINEST actresses reading aloud from GENUINE Fuckwit historical records! Garbagetown, we are here to DAZZLE you!”\nA groan went up from the crowds like each Garbagetowner was just then bedding their own great lost love and they heaved toward the lights, the colors, the horns and the voices, the silk and the electricity and the life floating down there, knotted to the edge of our little pile of trash.\nSomeone grabbed my hand and held me back while my parents, my twin, my world streamed away from me down to the Pier. No one looked back.\n“Are you her?” said Goodnight Moon. He looked longer and leaner but not really older. He had on his tie.\n“Yes,” I said, and nothing was different than it had been when I got my name except now neither of us had masks and our kisses weren’t like gentle elephants but like a boy and a girl and I forgot all about my strength and my fortune and the wonderful wheel of light turning around and around and going nowhere.\n9. TERRORWHORE\nActors are liars. Writers, too. The whole lot of them, even the horn players and the fortune-tellers and the freaks and the strongmen. Even the ladies with rings in their noses and high heels on their feet playing violins all along the pier and the lie they are all singing and dancing and saying is: we can get the old world back again.\nMy door said TERRORWHORE this morning. I looked after my potato plants and my hibiscus and thought about whether or not I would ever get to have sex again. Seemed unlikely. Big Bargains concurred.\nGoodnight Moon and I lost our virginities in the Peep Show tent while a lady in green fishnet stockings and a lavender garter read to us from the dinner menu of the Dorchester Hotel circa 2005.\n“Whole Berkshire roasted chicken stuffed with black truffles, walnuts, duck confit, and dauphinoise potatoes,” the lady purred. Goodnight Moon devoured my throat with kisses, bites, need. “Drizzled with a balsamic reduction and rosemary honey.”\n“What’s honey?” I gasped. We could see her but she couldn’t see us, which was for the best. The glass in the window only went one way.\n“Beats me, kid,” she shrugged, re-crossing her legs the other way. “Something you drizzle.” She went on. “Sticky toffee pudding with lashings of cream and salted caramel, passion fruit soufflé topped with orbs of pistachio ice cream . . . ”\nGoodnight Moon smelled just as I remembered. Scorched ozone and metal and paraffin and hope and when he was inside me it was like hearing my name for the first time. I couldn’t escape the me-ness of it, the us-ness of it, the sound and the shape of ourselves turning into our future.\n“I can’t believe you’re here,” he whispered into my breast. “I can’t believe this is us.”\nThe lady’s voice drifted over my head. “Lamb cutlets on a bed of spiced butternut squash, wilted greens, and delicate hand-harvested mushrooms served with goat cheese in clouds of pastry . . . ”\nGoodnight Moon kissed my hair, my ears, my eyelids. “And now that the land’s come back Electric City’s gonna save us all. We can go home together, you and me, and build a house and we’ll have a candle in every window so you always feel at home . . . ”\nThe Dorchester dinner menu stopped abruptly. The lady dropped to her fishnetted knees and peered at us through the glass, her brilliant glossy red hair tumbling down, her spangled eyes searching for us beyond the glass.\n“Whoa, sweetie, slow down,” she said. “You’re liable to scare a girl off that way.”\nAll I could see in the world was Goodnight Moon’s brown eyes and the sweat drying on his brown chest. Brown like the earth and all its promises. “I don’t care,” he said. “You scared, Tetley?” I shook my head. “Nothing can scare us now. Emperor Shakespeare said he’s seen land, real dry land, and we have a plan and we’re gonna get everything back again and be fat happy Fuckwits like we were always supposed to be.”\nThe Peep Show girl’s glittering eyes filled up with tears. She put her hand on the glass. “Oh . . . oh, baby . . . that’s just something we say. We always say it. To everyone. It’s our best show. Gives people hope, you know? But there’s nothing out there, sugar. Nothing but ocean and more ocean and a handful of drifty lifeboat cities like yours circling the world like horses on a broken-down carousel. Nothing but blue.”\n10. WE ARE SO LUCKY\nIt would be nice for me if you could just say you understand. I want to hear that just once. Goodnight Moon didn’t. He didn’t believe her and he didn’t believe me and he sold me out in the end in spite of gas masks and kissing and Madeline Brix and the man crooning in our ears that he was happy because all he could hear was Emperor William Shakespeare the Eleventh singing out his big lie. RESURRECTION! REDEMPTION! REVIVIFICATION! LAND HO!\n“No, because, see,” my sweetheart wept on the boardwalk while the wheel spun dizzily behind his head like an electric candy crown, “we have a plan. We’ve worked so hard. It has to happen. The mayor said as soon as we had news of dry land, the minute we knew, we’d turn it on and we’d get there first and the continents would be ours, Garbagetowners, we’d inherit the Earth. He’s gonna tell everyone when the Pier leaves. At the farewell party.”\n“Turn what on?”\nResurrection. Redemption. Renovation. All those years behind the fence Electric City had been so busy. Disassembling all those engines they hoarded so they could make a bigger one, the biggest one. Pooling fuel in great vast stills. Practicing ignition sequences. Carving up a countryside they’d never even seen between the brightboys and brightgirls and we could have some, too, if we were good.\n“You want to turn Garbagetown into a Misery Boat,” I told him. “So we can just steam on ahead into nothing and go mad and use up all the gas and batteries that could keep us happy in mixtapes for another century here in one hot minute.”\n“The Emperor said . . . ”\n“He said his name was Duke Orsino of Illyria, too. And then Roderigo when they did the werewolf play. Do you believe that? If they’d found land, don’t you think they’d have stayed there?”\nBut he couldn’t hear me. Neither could Maruchan when I tried to tell him the truth in the Peep Show. All they could see was green. Green leafy trees and green grass and green ivy in some park that was lying at the bottom of the sea. We dreamed different dreams now, my brother and I, and all my dreams were burning.\nSay you understand. I had to. I’m not a nihilist or a murdercunt or a terrorwhore. They were gonna use up every last drop of Garbagetown’s power to go nowhere and do nothing and instead of measuring out teaspoons of good, honest gas, so that it lasts and we last all together, no single thing on the patch would ever turn on again, and we’d go dark, really dark, forever. Dark like the bottom of a hole. They had no right. They don’t understand. This is it. This is the future. Garbagetown and the sea. We can’t go back, not ever, not even for a minute. We are so lucky. Life is so good. We’re going on and being alive and being shitty sometimes and lovely sometimes just the same as we always have, and only a Fuckwit couldn’t see that.\nI waited until Brighton Pier cast off, headed to the next rickety harbor of floating foolboats, filled with players and horns and glittering wheels and Dorchester menus and fresh mountains of letters we wouldn’t read the answers to for another twenty years. I waited until everyone was sleeping so nobody would get hurt except the awful engine growling and panting to deliver us into the dark salt nothing of an empty hellpromise.\nIt isn’t hard to build a bomb in Electric City. It’s all just laying around behind that fence where a boy held my hand for the first time. All you need is a match.\n11. WHAT YOU CAME FOR\nIt’s such a beautiful day out. My hibiscus is just gigantic, red as the hair on a Peep Show dancer. If you want to wait, Big Bargains will be round later for her afternoon nap. Grape Crush usually brings a herring by in the evening. But I understand if you’ve got other places to be.\nIt’s okay. You can hit me now. If you want to. It’s what you came for. I barely feel it anymore.\nThank you for my instruction.\nOriginally published in Drowned Worlds, edited by Jonathan Strahan.\nCatherynne M. Valente is the New York Times bestselling author of over two dozen works of fiction and poetry, including Palimpsest, the Orphan's Tales series, Deathless, Radiance, and the crowdfunded phenomenon The Girl Who Circumnavigated Fairyland in a Ship of Own Making (and the four books that followed it). She is the winner of the Andre Norton, Tiptree, Sturgeon, Prix Imaginales, Eugie Foster Memorial, Mythopoeic, Rhysling, Lambda, Locus, Romantic Times' Critics Choice and Hugo awards. She has been a finalist for the Nebula and World Fantasy Awards. She lives on an island off the coast of Maine with a small but growing menagerie of beasts, some of which are human.", "source": "https://clarkesworldmagazine.com/valente_03_19_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Future is Blue by Catherynne M. Valente"}