{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chi Hui; John Chu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "9HNiTEWVUWJAXrbNLl4C9sWXXIk=", "id": null, "license": null, "comments": "", "raw_text": "7130 words, short story  No Way Back  Master Hacker  11:30 a.m.  knock, knock, knock.  “Hey, Xuejiao, someone’s knocking at the door.” Aksha puts its paw on my face.  “I know.” I roll over to my other side, pull the blanket over my head, and continue to dream happy dreams.  knock, knock, knock.  Aksha burrows out from under the blanket, stretches gracefully, and nudges away a few pellets of last night’s cat food. Distastefully, it lies prone next to my pillow: “There. Is. Some. One. At. The. Door. Xia. Xue. Jiao.”  “I fucking know!” I get up, throwing off the blanket.  Carelessly, I kick over the half box of instant noodles I put next to the bed three days ago. They scatter all over the place. The room was never large, but now it looks especially small and narrow.  knock, knock, knock.  I put on some clothes I grab at random and trample through paper and dirty laundry to get to the door. Through the peephole, I see a middle-aged man standing in front of the door. His face is numb, holding no particular expression. He’s braced as though he will knock down the door if I don’t open it.  “Who do you want?” I shout grumpily through the door.  “I’m looking for . . . ” The man breaks off suddenly. He takes a piece of paper from his suit pocket and holds it to the peephole. On the paper is written two words: Master Hacker.  “There’s a place that sells knives downstairs and to the left,” I yell back.  The door still closed, I grab two bags of milk and a box of cat food. Aksha runs toward me, its tail high in the air. It stares at me, regards the milk with disdain and the cat food with interest. For a cat, this expression passes for a serious one.  “Looking for a Master Hacker?”  “We move out this afternoon,” I whisper back.  It snorts twice discontentedly and snatches the box of cat food out of my hand with its mouth. Cats don’t like to leave their territory. Our vagabond life means we invariably have to leave before Aksha has had its way with the female cats in the neighborhood.  “Which rat bastard gave away where we live?” it grumbles as it eats up milk-soaked cat food. I suck at a bag of milk and begin to throw clothes into a suitcase.  knock, knock, knock.  I glance through the peephole. The man is really stubborn. He clearly has no plans of ever leaving.  With a crash, I throw open the door. My hands on my waist, I stand in front of the man. “Are you fucking sick in the head?”  The man stares dumbfounded. Perhaps chalk-dusted teachers who wear Western-style suits and trousers aren’t used to being treated like this. Or maybe he expected a cruel, steely-eyed man, his cynical mind jacked into the net rather than a young woman staring back with bloodshot eyes.  “I’m looking for . . . a Master Hacker,” he says with a small voice.  The door across the hall opens a crack. The retired woman stares from behind with interest, her gaze shifting up and down.  “Something to hack with, my ass. If you want a kitchen knife you can use to kill yourself, they sell them in the market downstairs. I don’t sell them here. Would you like a rope to hang yourself with? What mental hospital shut down and set you free to go to someone’s home to buy a kitchen knife? What is wrong with you? For fuck’s sake, scram! You annoy me.”  I slam the door shut. Inside the room, stuff crashes to the floor. Out of the corner of my eye, I see, through the window, the man leave. He seems much older suddenly.  “Did you track down his cell phone?” I gesture at Aksha.  “13330573885.” Aksha lashes its tail. “Cheng Liang, male, forty-eight years old, chemistry professor at G University. I’ve already recorded his home address and IP address.”  I stuff clean clothes into the suitcase, the dirty clothes into a big plastic bag, and toss them both on the bed. The computer case opens in one swift flick. I take out a hard drive and hide it in a pocket. A terse note is left for the landlord explaining that I’ve moved out. By the time Aksha grudgingly leaps into the cat carrier, the taxi I called for is already waiting downstairs.  One suitcase, one cat carrier, one cat, and one hard drive, this is the sum total of what I’m taking from the “nest” I lived in for four months. Everything else I’m leaving for the landlord, who rarely ever shows up. He might be able to figure me out from this stuff, but he’ll have no way to track me down. Because I’m about to leave for a new place, I’m about to start another phase of my life.  It’s always like this. My life is split by a series of moves. Sometimes, I can even hear the sound of my life slowly rotting in these wrecked memories. My life is an abject mess, unbearably vile. A woman ought to have the serene happiness I absolutely do not have. Obviously, I don’t have a husband.  Men aren’t capable of being a companion to a woman like me. So I have a chatty cat, who grudgingly regards itself as a partner in my career as a “Master Hacker.”  But it generally finds female cats way more attractive.  Abyss  Without a whole lot of effort, I find a safe cubbyhole in another city one hundred and eighty kilometers away. The ID I use is my fourth set: a half-hearted effort, it pins all its hopes on being a young woman with a postgraduate diploma. The age and appearance are dead-on.  After settling in, my first order of business is to unpack my fully tricked out computer and get on the net. The landlord doesn’t live here, but his son, before he leaves, earnestly helps me load in and install the computer. His gaze never leaves my low-cut dress.  The landlord proudly boasts that his son is a good student. He’s in ninth grade and can absolutely test into a good school.  My cat glances at the whiskers on the boy’s face. They grow up so fast these days.  At 2:00 a.m. the next day, I link into an abyss.  The network has many layers. Some people are content to merely skim the surface, enjoying the virtual images and information electrical brain stimulation brings them. A long time ago, people enjoyed opening doors that were closed to them. As a result, they became known as hackers. Then the brain-network interface was invented. Some people discovered certain places didn’t have doors, but no one had ever set foot there. Stale data, long-disappeared records piled up in forgotten corners to the point that they were considered long-deleted secrets.  We call this sort of place an abyss.  Lots of people are happy to work for the government as “spelunkers,” depending on their piddling skills, to excavate data from ancient abysses and convert them into cash. If their luck is good, they can make a fortune. But not everyone is content to be a spelunker. Some people like more extreme methods of making money or more direct means of grabbing money from the government. We call ourselves “Master Hackers.”  When I’m online, Aksha keeps me company. Anyone who says cats can’t go online is an idiot. Twenty years ago, people said humanity couldn’t go to Mars. Ten years ago, people solemnly swore that there was no way to connect a human mind to the network. Five years ago, people said that cats and dogs couldn’t speak.  As the facts show, they are all idiots.  Although being at the representational layer is like being a stranded fish placed back into water, once I sink into an abyss, Aksha astutely stops. It doesn’t like these huge, distant data spaces. Hanging out just outside, it guards me against government surveillance programs.  Lots of people do not know how to find the abysses of “Master Hackers.” They stare at unused servers, idle computers, not realizing there’s a kind of abyss that they keep brushing past.  The servers Master Hackers use are always busy, especially the massively multiplayer online game databases. We use every trick in the book to set up our own development spaces.  I enter the game data from World of Stars. Within a dense of fog of calculations, I find the cleverly camouflaged door. A password as obvious as if it were carved into my memory matches a long string of characters like flowing water. The door within the illusion opens easily.  I never put any essential programs on my hard drive. The programs a smart Master Hacker uses are all hidden in the recesses of the network. They serve as the strongest and nimblest extensions of one’s mind, radiating like a spiderweb in all directions.  For the same reason: If someone seizes the data within a Master Hacker’s database, that person also has the Master Hacker in the palm of their hand. To tell the truth, when that man held up the piece of paper with “Master Hacker” written on it, I practically pissed my pants.  The database bears the marks of a break in. Some are meticulously and ingeniously concealed but leave some inadvertent loose ends. Others are blatant, but are neatly cut off from its source. No way to trace them. A blast of cold flits across my back. I shudder in spite of myself.  An abyss is a place filled with danger. No one gets this. Whoever you meet, or the person who spies on you, is a government spelunker or a Master Hacker or is a ghost hidden inside a vast database. Spelunkers and Master Hackers pass around a saying you need to understand: Some abysses absolutely must not be tested. Hiding there are vast existences beyond our comprehension. All the jackholes who go there are drawn into a vortex of data, forever gone. They leave behind stiff bodies, lying comatose in hospital ICUs.  “Have you found the bastard?” Aksha’s consciousness wanders over.  “I’d really rather not.” I bring Aksha into the middle of the streaming data. Segment by segment, I unspool it out. “Look, these marks are from after we left. They’re from government spelunkers entering my database. But the jackhole who left this blatant mark, did you notice? Maybe he’s a newbie, but tidy. If he can do this, then the only . . . ”  The cat sighs.  Aksha brandishes a claw and breaks its connection to the network. I send a disconnect command, too. It’s as if my stiff body is being pulled away from a warm pool. Reluctantly, I leave the network and return to harsh, cold reality. Although I feel nauseous, there are some things that are best not discussed in the network.  “Your point is that there are ‘Sea Spiders’ stalking us?” Aksha fidgets, grinding its claws against the hardwood floor. “Why would they do that? They have to know. We don’t have anything to do with them anymore.”  “I’ll have to take the job to find out.” I fish out the number from the chip in my head. “13330573885, Cheng Liang. Tomorrow, I’ll have a chat with the university professor.”  Father and Daughter  Breaking into Cheng Liang’s personal computer is really easy. At 5:00 p.m., he still hasn’t left work yet, but I’ve already worked out the man’s basic situation: He has a steady job. His wife died two years ago. His daughter, Cheng Wen, is sick and recuperating at G City General Hospital. Before his daughter got sick, he barely had any interests outside of work, but after she was hospitalized, he began to search the network for everything from rumors and stories to web pages and data about “Master Hackers.” They practically fill up his hard drive.  Aksha takes several pieces of data and digs into the G City General Hospital’s database. We fall into our rhythm working with each other and quickly find Cheng Wen.  She is in a single-unit ICU with symptoms of schizophrenia.  She isn’t manic like the other patients in the psych ward. As observed from the monitoring equipment, Cheng Wen is incredibly calm. She lies curled up on the bed. Her large, clear eyes stare at the computer at the head of the bed. According to the psych ward records, Cheng Liang installed the computer for his daughter. Without a computer, she simply stopped eating in protest.  The door opens. Cheng Liang walks in with a box lunch. A nurse stands next to him.  “Wennie?” Cheng Liang cautiously studies his daughter’s response. Gently, he sets her lunch on the overbed table.  She turns her head, meeting Cheng Liang’s gaze for a moment. It’s not a mad glance. On the contrary, it was too calm, too still for a woman of nineteen. Her mouth opens and closes twice, as though she were saying “papa,” but without any sound.  “Wennie, time to eat.” Cheng Liang sits beside the bed, opens the box, careful to leave some distance between him and his daughter.  “Thank you.” Courteously, she accepts the proffered lunch and takes a few elegant bites. She uses a knife and fork rather than chopsticks.  An odd feeling fills the ward. Father and daughter fall silent with each other. She’s obviously his flesh and blood, but seems like a stranger, maintaining a polite distance. A fine thread of pain shone mirrorlike on their faces.  When his daughter finishes her lunch, Cheng Liang repacks the box and utensils. He stands. “I’m leaving now, Wennie.”  “Oh. Goodbye,” she answers.  Throughout the entire visit, she never called him her father.  I sigh, leave the hospital’s monitoring system, clean up the traces of my break in, then leave the network. It’s not until now that a headache pierces through my neural shield, making me dizzy and unsteady. I stagger into the kitchen, swallow a pill, and chase it down with a glass of water. Then I sit in front of my computer again.  “Don’t you want to rest a bit?” Aksha asks.  “No point.” I stare at the screen. “I don’t need a ‘full connection’ for what’s left. A ‘machine connection’ is good enough. I can guess what’s going on. But what’s important now is to make the university professor believe us.”  “Someone who studies too much is easy to deceive.” Aksha yawns and curls into a warm ball around my leg.  About an hour later, the cell phone tracker signals: Cheng Liang has come home.  Remotely, I turn on his computer and print a line of text on his display: “Are you looking for me?”  I guess he must be scared half to death because his microphone picks up a cracking sound, as if something has been smashed to pieces.  I add: “I am a Master Hacker. You were looking for me, right? Speak. I can hear you.”  He makes a sound not unlike a strangled goose. I enable speech synthesis on his computer and start typing quickly. On his end, his speaker emits a nauseating, inhuman sound. That should be enough to make someone either hate or fear a Master Hacker.  “I know you’re looking for me,” I say. “What do you want me to do? How much are you paying? Who else knows you’re looking for a Master Hacker?”  He pants for a moment. Once he recovers: “I want . . . I want you to find someone.”  I laugh. “Find who?”  “I . . . I want you to find my daughter.” The university professor seems as helpless as a child. “I want you to find my daughter. My ‘uploaded’ daughter.”  “Your daughter hasn’t been uploaded. Right now, she is at the best hospital receiving the best possible treatment from their neurologists.” I laugh grimly.  Through his webcam, I see him back away, as if I could bite him through the network. “How . . . how did you know?”  “Because I’m a ‘Master Hacker,’” I answer.  “She isn’t my daughter!” Cheng Liang shouts. “I know she isn’t!” His hands spasm as they grip the hem of his jacket. “I know she isn’t. My daughter was uploaded. Who knows what is in her body now! I want you to find Wennie and bring her back. Money is no concern. I want her back!”  I glance over at Aksha. It yawns and nods its head.  I sigh. “Just to get this out of the way: I won’t necessarily be able find your ‘uploaded’ daughter, so I won’t ask you to pay up-front. I’ll wait until I have a lead. Naturally, I’ll be in touch. Don’t keep looking for another ‘Master Hacker.’ Otherwise, I can’t guarantee I’ll be able to pull this off. Got it?”  He nods over and over again. His cast is so desperate, it’s like he’s giving medicine to a dead horse. For a crime as serious as “uploading,” he really doesn’t have any options besides looking for a “Master Hacker.”  “In that case,” I say slowly. “Tell me everything about what happened to your daughter.”  On that side of the computer, Cheng Liang chatters endlessly with his head in his hands. On this side of the computer, I light a cigarette and listen quietly.  According to the learned university professor, his daughter was always an “obedient and well-behaved child.” But, eventually, he didn’t know why, she became a fan of virtual-reality games, wallowing with no way to free herself. He tried hitting her, scolding her, begging her, but none of that worked. Finally, one day, she uploaded herself, leaving her father only a brief message:  I’m exhausted.  Living up to your expectations is exhausting. Not living up to your expectations is also exhausting.  Dad, Mom, I’m sorry. Goodbye.  As a matter of fact, Cheng Wen’s story and the story of everyone else who uploads themselves are all basically same. She was an only child, no siblings, and no real friends. Every day, she obediently went to school, came home afterward, ate, then slept. Home and school were the cruxes supporting a finely wrought cage. For the child inside, it seemed like the entire world.  Until one day, she became infatuated with the network.  I understand the feeling. When you go on the net, information rushes at you like a flood. It tells you that this is the entire world. But when you leave the net, you feel the flood waters recede. You are still in the cage. You haven’t moved even a tiny step. You want that world, to enter that world, to embrace this brand new heaven and earth. You, however, discover that reality, your body, the love of your family, all weigh you down like shackles in a prison.  At a secret upload website, a sentence is written in red boldface on the home page: “When exiling humanity from paradise, God said: I will give them love.” This is the best yoke. As long as they are bound by love, they will never have a way back to paradise.  This has spread among netizens. I don’t know how many people try to shout from their cages. They want a new world. Actually, they are confused. A lot of people feel that the price of a new world is to lose everything in the old world. Who would make such a grave choice?  But I understand those who uploaded themselves. The reason why you abandon yourself is really simple.  Oh, yes. I understand.  For example, Cheng Wen, what she wanted was nothing more than a comparatively relaxing life. A life where there’s no pressure to do well on high-stakes school entrance exams.  Another example, say there’s a girl named Lin Yu. She uploaded herself because she firmly believed, in real life, she had not even one single redeeming feature. On the net, she kicked serious ass. What she did made the relatives who once thought of her as garbage respect her.  But they were both wrong. The net is not the real world. They wouldn’t open their eyes in the middle of a current of electricity. They just found a piece of solid earth, clear water, and blue sky. An abyss in the net is like an ocean. It swallows everybody who throws themselves in, cleansing them.  What very few people realize: The deepest recesses of an abyss are incredibly difficult places for anyone, whether it’s a program, spelunker, or Master Hacker, to reach. Huge and dismal existences hide there. It is a place where illegal data, uploaded consciousnesses, destroyed programs, and abandoned AI all mix together, lie dormant, and propagate. Some of the consciousnesses use uploaded human thoughts as a kernel. Some have only pieces of programs and evolve. They are immense, jumbled, all-embracing, and yet amount to nothing.  They call themselves “Sea Spiders.”  Governments, of course, know Sea Spiders exist. They have rooted Sea Spiders out from their hiding places many times. Sea Spiders, however, are way smarter than any program, more nimble than any spelunker. They lurk like undercurrent in the net. Even the craftiest Master Hacker has a hard time detecting their existence. Because they are on the net, the likelihood of a self-reproducing consciousness is comparable to that of an infinite number of monkeys eventually typing out Hamlet. As a result, governments have adopted drastic measures. They’ve banned completely the uploading of consciousnesses, classifying it as the most serious of crimes, giving it the harshest punishment.  Of those who upload themselves, eighty percent of their consciousnesses are ripped to shreds by government web crawlers, ten percent are disintegrated into data packets, becoming rich fodder for Sea Spiders. The remaining ten percent become Sea Spiders themselves, roaming among the data, hiding from both governments and others of their own kind. They rip apart other consciousnesses to slake their thirst for data. They sniff out, even luring those who want to upload themselves, always alert to take over hollow bodies.  But only one percent of Sea Spiders luck into the bodies fools abandon to upload themselves. Those Sea Spiders return to the real world.  They are reincarnated in someone else’s body.  I suppose, perhaps at the time, the woman called Cheng Wen heard a whisper in the deep recesses of the net that enticed her, called her to go. She didn’t know, though, that this first step wouldn’t lead to rebirth, but to eternal damnation.  Cheng Liang’s hand trembles as he lights a cigarette. He tells me that one morning he opened the door to his daughter’s room to see her in front of her computer, unwakeable and wearing a slight smile. He rushed her to the hospital. The doctor had to tell him: don’t hold out any hope for her.  Later, as a spur-of-the-moment test, he attached her stupefied body to the network and she suddenly woke up. But the person who woke was no longer the Cheng Wen from before.  Cheng Liang enumerates exhaustively the ways she is different from before. I just let it wash over me. Because parents always have a keen intuition about their children, I believe him.  Since everyone who intends to upload hides at least one Sea Spider afterward, they hide there silently, luring and agitating. Once the uploaded consciousness leaves the mind, they race to be first to seize the already soulless body and occupy it.  As for the consciousness that leaves the body, her fate is up to one percent opportunity and ninety-nine percent luck. All she has to do is become a “Sea Spider,” then follow in my footsteps to become a “Master Hacker,” like I did. Easy peasy.  Cheng Liang said that he received a text: Dad, find a Master Hacker. Help me.  At the end of the text was my address. It was this text that made up his mind to admit his “daughter” to the hospital. Then he held his nose and went to the neighborhood where I’d rented an apartment.  Nowhere to Return to  By the time Professor Cheng finishes his endless narrative, it’s already 4:00 a.m. My headache feels like it’ll burst my head open. All sorts of random thoughts rush around and expand so that my ears buzz.  I take two pills. They help not one bit. Pissed off, I take three more. I shut down my computer. My hands pressed against my head, I sway into the kitchen and dump some tepid water onto instant noodles. I eat the half-cooked noodles, then return to my room. My bed’s not made. The blanket’s still unfolded. I plow in, not bothering to take off my clothes, and flop into dreamland.  It’s not until 2:00 p.m. that I have the strength to crawl out of bed. I rub my face, grab some cash, then shop at the supermarket downstairs. Carrying bags and bags of snacks and cat food, I catch sight of a pay phone. A long while passes before I walk to it and dial a familiar number.  “Hello. May I ask who are you looking for?”  “Mom, it’s me, Xuejiao.”  Everything suddenly grows silent. Ages pass in silence. My hand trembles as I hold the handset. Not knowing where the courage is coming from, I wait and wait some more.  “Xuejiao, where are you? You changed your number again?” Mom says, finally finding the words.  “My job’s been transferred to Jiaxing.” I lie. I lie like this every time. Actually, I suspect she’s long since figured out what I’m doing.  “Jiaxing is a good neighborhood, Xuejiao. Work hard. Look after yourself . . . ” Mom’s voice falls. “When . . . come on home, just to visit.”  “Hm. Maybe for New Year’s,” I say.  Every time I promise to come home for New Year’s, every time I nestle myself in my apartment, cradling Aksha. Dry-eyed, I listen to the cold New Year’s bells toll. What goes through my mind is that I’m incapable of keeping my promise to my mom.  When I return, Aksha sees how listless I am and jumps onto the table. “Did you call your mom again?”  “Ugh.”  Aksha licks its paws. “Aren’t you just looking to make yourself depressed?”  “I am happy!” I sulk at it in return.  “If you want to cry, cry, Xuejiao.” Aksha’s tone implies a worldly experience undercut by the cat food stuck on its whiskers.  Shrugging, I pick up a cash-filled envelope, count out two-thirds of the money, then split that in two.  “Are you going to post the money?”  “Oh, like always. Half goes to Mom, half to Auntie Zhou.” I hide the cash in a pocket.  Aksha licks my finger with its rough tongue. “Don’t forget to take your medication before you go.”  “I know.”  After I return from the post office, Aksha and I gorge ourselves. We demolish everything I brought back from the supermarket. Then I sleep until the following morning.  On the theory that I’ll need a lot of energy and physical strength to look for a “Sea Spider,” I take a full dose of antirejection medication. It makes me feel like I’m sleepwalking. I shake off my blanket and change clothes. Having skipped combing my hair, washing my face, and brushing my teeth, I eat two eggs, drink a bag of milk, turn on my computer, and go online.  Cheng Liang said that his daughter lost herself in the game Rivers and Lakes Unlimited. Moreover, he insisted that I go into the game to look for his daughter’s consciousness. Instead, I do something much simpler. I find and follow the trail of uploaded packets on the computer.  The trail breaks at the first node. That’s not exactly a surprise. On the side, Aksha has already downloaded her game data and began to look for similarly skilled IDs in Rivers and Lakes Unlimited.  “There isn’t any,” it says. Scrubbed clean. They left behind fewer tracks than even the craftiest rat.  Government databases also haven’t captured any records of any data packets similar to consciousnesses. “Or maybe those records been deleted,” I reply.  “Where else could there be clues?” Aksha asks.  “Abysses,” I answer. The deepest abysses.  It’s never been easy to find any Sea Spider, let alone a specific Sea Spider. Now there are two possibilities: his daughter became a Sea Spider herself or, even worse, Sea Spiders broke her up into splintered pieces of data and integrated them into many different consciousnesses. I adjust my gear and begin to search.  Know this: “jacking in” and “uploading” feel nothing like each other. To use a particularly fitting metaphor, jacking your mind into the net is drifting along a river in a boat. Uploading your mind, however? Flinging yourself directly into the water. You have to master how to see, how to breathe, how to live in the water. Everything you know is turned completely on its head. Before you are swallowed, you have to make yourself a fish.  After I think about it a bit, I decide to start from the game. If she liked this game so much, in her ignorance, she might have clutched at this desperate straw when she first entered the world of the net. Heading straight toward the game, I search between the node the trail broke at and the game’s server node, not letting even the whisper of a clue pass me by.  Clue one: September 2nd. That’s the day she uploaded. Rivers and Lakes Unlimited District Three Server Six, a card machine appeared, was forcibly ejected, then disconnected.  Clue two: Server Six is typically overloaded.  Clue three: A tracking program was once run from here. Objective unknown. The server was located in Wuxi. That was the city I lived in until Cheng Liang scared me into moving.  “It’s here,” Aksha says.  I dive in deep. The server has a series of storage areas. They are ingeniously scattered across different locations and linked together. As a whole, however, they are difficult for someone to find.  In the mind-machine interface, I open the door.  A range of golden mountains burn my eyes. Red and yellow leaves in a forest, mixed with the green of the pine. Late autumn frost smears the earth with a thin layer of white. The fields have already been harvested. Tall piles of corn lie at the edges. Golden kernels glint against the transparent, deep blue sky.  “Do you miss it? Xia Xuejiao, do you miss your home?” a thin, reluctant voice asks.  A young woman walks toward her from a low, flat-roofed house. It’s Cheng Wen. With a tiny nose and round face, she is as adorable as a doll when she laughs. Her eyes, however, are black. They are as distant as the night sky and unfathomably haunted.  “Or perhaps I should call you Ji Cina?” She begins to laugh. “It’s been a long time, old friend.”  “ . . . Jill?” I sputter and spit out the code name.  The scenery around me suddenly begins to roil. It changes into countless flows of color, like a rainbow corridor. Aksha and I are at one end. Cheng Wen is at the other.  “I’ve been waiting for you.” She laughs and twirls. Her skirt flutters, becoming a beautiful flower. “After I ‘downloaded’ my consciousness into this body, that stupid girl regretted abandoning her body. Actually, she shouldn’t have tracked you down. And she shouldn’t have sent your address to her father. If she had just continued to hide in that server, the computer I compromised in the mental hospital would have never found her.”  My heart aches.  “You stole her body. Now, you’ve eaten her consciousness?” I ask.  “Don’t get all noble on me.” Her delicate face is ice cold. “Are the things you’ve done any better?”  “How much of you is still Cheng Wen?”  “A lot. Almost forty percent.” She gestures. “With so much data, why would I share it with anyone else? I tore her apart, ate her, and merged her data with mine. It still needs time to digest.”  I look her over. There is a familiar hunger and thirst in her serene eyes. Although every Sea Spider propagates across the consciousness of those who uploaded themselves, every Sea Spider also yearns to return to reality.  “You want a body that much?” I ask softly.  “You have a body, yourself, but you stop others from getting one?” She curls her lips. “So many Sea Spiders. They’re all looking for bodies to the point of abducting them. When I saw this one, I took it. What’s wrong with that?”  “The day you download yourself, it’s not exactly a comfortable one.” I laugh bitterly.  “And yet. I want . . . I want arms that can hug. I want eyes that can cry. I want a body. I want . . . ” She stays silent for a long time. “I want to go home.”  When one Sea Spider swallows another Sea Spider, their personalities merge. In that moment, I can’t tell them apart. The one who wants to go home, is it the one who has been flowing in the abyss for a long time, who long ago abandoned a corporeal existence? Or is it the girl who foolishly rushed into the net with no way to return?  “It’s not so easy,” I say. “Even if you’ve stuffed the immense ‘Sea Spider’ consciousness into a brain, you’ll have to take black-market drugs to prevent consciousness rejection for the rest of your life. Also, how are you going to leave the mental hospital?”  “That’s none of your business,” she says.  “Suit yourself,” I answer. “I have one final question I want to ask.”  “Go ahead.” Jill—Cheng Wen shrugs. “Quickly. The nurses are making their rounds.”  “You said you want to go home. But to whose home? Jill Lenk’s home in America, in Kansas? Or Cheng Wen’s home in Shanghai?”  She’s silent, dumbfounded for a long time. She raises her head then, disappointed, gazes at me with her black, serene eyes.  “I . . . I don’t know.”  Satisfied, I laugh. Step-by-step, I leave this abyss. When it’s time for me to break the connection, Jill—Cheng Wen’s sigh flutters in the distance.  “Ji Cina, which home can you return to?”  A sharp pain pierces my chest. The javelin I hurt her with turned around and penetrated into my own feelings. Fragments of the city of fluttering, thin light rain in the midst of mansions and skyscrapers and the peaceful village within the range of snow-crested mountains twist together. They remain choked in my throat.  “Mama . . . ” I mutter to myself.  I have no idea who I’m calling for. Lin Yu’s mother or mine.  Mother  I was in college when I uploaded myself. A first-class fool at the time, I followed a man I had a crush on into the net. Only then did I realize I was no more than a tasty morsel of flesh. I have no idea what the man’s sorry fate was. In the rush of data, I couldn’t find any fragment of him or any tracks leading to him.  I ran in the abyss, dodging government programs. At the same time, I was hiding from or killing my kind, swallowing their data to replenish myself. “Ji Cina” was a name I adopted out of convenience. It means nothing to me. Just three syllables you squeeze out with your tongue pressed against your teeth, terse and fierce.  Sea Spiders almost always break off contact completely with their new bodies’ friends and relatives. However, I’ve heard of those who could return to their former life. I don’t know where the person who took my body went. Her trail ends in Australia. I’ve been very careful, never entering that relatively unfamiliar section of the net.  In the local net, for the longest time, Jill and I tangled with each other. We fought, trying to swallow each other. Ultimately, though, we set our boundaries, defining our spheres of influence. No one was more fierce and ruthless than I was. Crazed, I plundered all the data for a chance to return to the real world. In the fight among Sea Spiders for bodies, though, opportunities were fleeting.  Until the day I met Aksha.  Aksha was actually small and weak. Compared to our group of “Sea Spiders,” it lacked mobility and flexibility. However, it wasn’t encumbered by so much excess data. “Sea Spiders” generally retain data about the body, ready, just in case, for that day when they returned to the real world. Since it’s an AI, Aksha doesn’t have any of that. It being in an abyss is like a stranded fish returned to the water. As if it were a rat aside our big elephant feet.  It told me that it wanted a body. It, however, wasn’t compatible with human bodies.  “I think I have a solution,” I said. “Let’s make a deal.”  When a new consciousness emerged confused among us, with Aksha’s help, I detoured around the chaotic fight. I penetrated directly into the empty brain.  The rejection response was more violent than I’d imagined. For a week after getting the body, I lay in a hospital bed, mournfully wailing through my mental and physical trial. It wasn’t until Aksha brought me a fragment of consciousness it snatched from the net that my condition improved.  Two days after I left the hospital, I found an excuse to leave the family of the woman called Lin Yu. From the black market, I stole a huge supply of antirejection drugs, an upload-download unit, as well as a yellow cat whose intelligence was augmented by a microchip.  Since then, I’ve brought Aksha along. We began our roving days.  In these last few years, in my pocket is invariably hidden a letter. It was written by a mother to her daughter who was already never going to return.  My dearest Yu:  It’s been so long since I’ve heard any news of you.  Mom knows you’re doing your best out there, building your career. But since you can’t come home for New Year’s, you’re never home at all.  I miss you. Your father also speaks of you.  You’re an adult now. You should find a man to marry.  This year, why don’t you come back to Pudong for a short visit. Don’t make us worry. You don’t need to send us so much money. Your father’s and my pensions are enough.  Mom, Zhou Yun 2075/1/26 I raise my head. In the mirror is a healthy woman, wrinkled pajamas wrapped around her, unkempt hair, bluish-black eyes. A small mole dots the corner of my mouth.  Every time I look at myself in the mirror I feel strange. It’s as if Lin Yu’s family in Shanghai, Lin Yu’s mother, her taciturn father, not to mention the Shanghainese that I understand not one word of, they constantly warn me: I’m actually a thief who stole someone else’s body.  The day I left Lin Yu’s family, her mother opened an umbrella and saw me off to the end of the lane. She already realized by then that someone else’s soul occupied Lin Yu’s body, but she still smiled. She still tried to convince the incomplete likeness of her daughter to stay.  She sent this letter four years ago to my first address. I moved immediately after. Drifting about, I’ve never had any news of her. I never write my address on any money order I post. Frequently, though, I see the silhouette of her going from house to house knocking on doors, and I have no choice but to sneak out the back door in a rush.  The Lin Yu who uploaded herself, the fragment I received of her is actually not very large. In my bones, I am still the “Sea Spider” Xin Xuejiao. My mother is still the woman waiting in a small town in the Northeast Forest District. As for Lin Yu, I received her body, but not a way to love her family.  Return Home, Return Home  New Year’s Eve, I carry Aksha with me to the train station. There’s a missing person notice stuck to the station entrance. It rustles in the breeze.  Missing Person Notice: Cheng Wen, female, 19 years old. Wearing a cream-colored sweater, white overcoat, black jeans. Long hair. Wears glasses. Disappeared on 2079/1/6. I hope a good-hearted person will provide a clue. I hope my daughter will return home. Father Cheng Liang weeping 2079/1/10. Speechless, I study the grainy picture printed on the notice. Cheng Wen’s smile gives one a feeling of distance. Yet another Sea Spider who didn’t realize until after returning to this world that there is nowhere to leave for, but also nowhere to return to.  I laugh bitterly. Holding Aksha, I board the train back to my hometown in the Northeast.  The hometown I left six years ago looks just like it used to. Tiny towns seem to freeze in time. Only the people who live in them slowly grow old. Clinging to a thread of hope, I plucked up my courage to return here.  Auntie Zhou and Cheng Liang, they could realize someone else’s consciousness lived in the body of their child. On the other hand, can my mother pierce through the Yin Yu exterior and see what I used to look like? Even if she hugs me, will she still call me Xuejiao?  I put on my overcoat and pick up Aksha. The warmth of its body gives me a bit of courage.  “Just give it a go,” it says.  “Hm.”  I leave the hotel. The harsh northeast wind carves my face. On the road, at the edge of town, my mother is waiting for her daughter to return for New Year’s.  I muster my courage and walk toward my mom. It’s been so many years since I’ve seen her. She is old now. Her thick down jacket seems empty wrapped around her gaunt body. She is curled up against the cold wind, a pair of cloudy eyes stubbornly facing front, waiting for me to return home.  I’m back, Mom.  I walk over. And I keep walking. Her gaze slides past my body. My steps grazed her. What she sees is an unfamiliar woman carrying a cat. Who I brush past is my mother.  The wind and snow flutter, turning heaven and earth pure white. My mother and I are two tiny black dots on the white ground. The more I walk, the farther away I go. The more I walk, the farther away I go.  I don’t know how many bodies carry other peoples’ souls. I don’t know how many mothers wait in vain for their children to come home.  You have eyes that can shed tears, but not necessarily eyes that can cry.  You have arms that can hug, but not necessarily arms that can hug the people you love.    Originally published in Chinese in Science Fiction World, May 2006.  Translated and published in partnership with Storycom.  John Chu is a microprocessor architect by day, a writer, translator, and podcast narrator by night. His fiction has appeared or is forthcoming at Boston Review, Uncanny, Asimov's Science Fiction, and Tor.com among other venues. His translations have been published or is forthcoming at Clarkesworld, The Big Book of SF, and other venues. He has narrated for podcasts such as EscapePod, PodCastle, and Lightspeed. His story \"The Water That Falls on You from Nowhere\" won the 2014 Hugo Award for Best Short Story.", "text": "7130 words, short story\nNo Way Back\nMaster Hacker\n11:30 a.m.\nknock, knock, knock.\n“Hey, Xuejiao, someone’s knocking at the door.” Aksha puts its paw on my face.\n“I know.” I roll over to my other side, pull the blanket over my head, and continue to dream happy dreams.\nknock, knock, knock.\nAksha burrows out from under the blanket, stretches gracefully, and nudges away a few pellets of last night’s cat food. Distastefully, it lies prone next to my pillow: “There. Is. Some. One. At. The. Door. Xia. Xue. Jiao.”\n“I fucking know!” I get up, throwing off the blanket.\nCarelessly, I kick over the half box of instant noodles I put next to the bed three days ago. They scatter all over the place. The room was never large, but now it looks especially small and narrow.\nknock, knock, knock.\nI put on some clothes I grab at random and trample through paper and dirty laundry to get to the door. Through the peephole, I see a middle-aged man standing in front of the door. His face is numb, holding no particular expression. He’s braced as though he will knock down the door if I don’t open it.\n“Who do you want?” I shout grumpily through the door.\n“I’m looking for . . . ” The man breaks off suddenly. He takes a piece of paper from his suit pocket and holds it to the peephole. On the paper is written two words: Master Hacker.\n“There’s a place that sells knives downstairs and to the left,” I yell back.\nThe door still closed, I grab two bags of milk and a box of cat food. Aksha runs toward me, its tail high in the air. It stares at me, regards the milk with disdain and the cat food with interest. For a cat, this expression passes for a serious one.\n“Looking for a Master Hacker?”\n“We move out this afternoon,” I whisper back.\nIt snorts twice discontentedly and snatches the box of cat food out of my hand with its mouth. Cats don’t like to leave their territory. Our vagabond life means we invariably have to leave before Aksha has had its way with the female cats in the neighborhood.\n“Which rat bastard gave away where we live?” it grumbles as it eats up milk-soaked cat food. I suck at a bag of milk and begin to throw clothes into a suitcase.\nknock, knock, knock.\nI glance through the peephole. The man is really stubborn. He clearly has no plans of ever leaving.\nWith a crash, I throw open the door. My hands on my waist, I stand in front of the man. “Are you fucking sick in the head?”\nThe man stares dumbfounded. Perhaps chalk-dusted teachers who wear Western-style suits and trousers aren’t used to being treated like this. Or maybe he expected a cruel, steely-eyed man, his cynical mind jacked into the net rather than a young woman staring back with bloodshot eyes.\n“I’m looking for . . . a Master Hacker,” he says with a small voice.\nThe door across the hall opens a crack. The retired woman stares from behind with interest, her gaze shifting up and down.\n“Something to hack with, my ass. If you want a kitchen knife you can use to kill yourself, they sell them in the market downstairs. I don’t sell them here. Would you like a rope to hang yourself with? What mental hospital shut down and set you free to go to someone’s home to buy a kitchen knife? What is wrong with you? For fuck’s sake, scram! You annoy me.”\nI slam the door shut. Inside the room, stuff crashes to the floor. Out of the corner of my eye, I see, through the window, the man leave. He seems much older suddenly.\n“Did you track down his cell phone?” I gesture at Aksha.\n“13330573885.” Aksha lashes its tail. “Cheng Liang, male, forty-eight years old, chemistry professor at G University. I’ve already recorded his home address and IP address.”\nI stuff clean clothes into the suitcase, the dirty clothes into a big plastic bag, and toss them both on the bed. The computer case opens in one swift flick. I take out a hard drive and hide it in a pocket. A terse note is left for the landlord explaining that I’ve moved out. By the time Aksha grudgingly leaps into the cat carrier, the taxi I called for is already waiting downstairs.\nOne suitcase, one cat carrier, one cat, and one hard drive, this is the sum total of what I’m taking from the “nest” I lived in for four months. Everything else I’m leaving for the landlord, who rarely ever shows up. He might be able to figure me out from this stuff, but he’ll have no way to track me down. Because I’m about to leave for a new place, I’m about to start another phase of my life.\nIt’s always like this. My life is split by a series of moves. Sometimes, I can even hear the sound of my life slowly rotting in these wrecked memories. My life is an abject mess, unbearably vile. A woman ought to have the serene happiness I absolutely do not have. Obviously, I don’t have a husband.\nMen aren’t capable of being a companion to a woman like me. So I have a chatty cat, who grudgingly regards itself as a partner in my career as a “Master Hacker.”\nBut it generally finds female cats way more attractive.\nAbyss\nWithout a whole lot of effort, I find a safe cubbyhole in another city one hundred and eighty kilometers away. The ID I use is my fourth set: a half-hearted effort, it pins all its hopes on being a young woman with a postgraduate diploma. The age and appearance are dead-on.\nAfter settling in, my first order of business is to unpack my fully tricked out computer and get on the net. The landlord doesn’t live here, but his son, before he leaves, earnestly helps me load in and install the computer. His gaze never leaves my low-cut dress.\nThe landlord proudly boasts that his son is a good student. He’s in ninth grade and can absolutely test into a good school.\nMy cat glances at the whiskers on the boy’s face. They grow up so fast these days.\nAt 2:00 a.m. the next day, I link into an abyss.\nThe network has many layers. Some people are content to merely skim the surface, enjoying the virtual images and information electrical brain stimulation brings them. A long time ago, people enjoyed opening doors that were closed to them. As a result, they became known as hackers. Then the brain-network interface was invented. Some people discovered certain places didn’t have doors, but no one had ever set foot there. Stale data, long-disappeared records piled up in forgotten corners to the point that they were considered long-deleted secrets.\nWe call this sort of place an abyss.\nLots of people are happy to work for the government as “spelunkers,” depending on their piddling skills, to excavate data from ancient abysses and convert them into cash. If their luck is good, they can make a fortune. But not everyone is content to be a spelunker. Some people like more extreme methods of making money or more direct means of grabbing money from the government. We call ourselves “Master Hackers.”\nWhen I’m online, Aksha keeps me company. Anyone who says cats can’t go online is an idiot. Twenty years ago, people said humanity couldn’t go to Mars. Ten years ago, people solemnly swore that there was no way to connect a human mind to the network. Five years ago, people said that cats and dogs couldn’t speak.\nAs the facts show, they are all idiots.\nAlthough being at the representational layer is like being a stranded fish placed back into water, once I sink into an abyss, Aksha astutely stops. It doesn’t like these huge, distant data spaces. Hanging out just outside, it guards me against government surveillance programs.\nLots of people do not know how to find the abysses of “Master Hackers.” They stare at unused servers, idle computers, not realizing there’s a kind of abyss that they keep brushing past.\nThe servers Master Hackers use are always busy, especially the massively multiplayer online game databases. We use every trick in the book to set up our own development spaces.\nI enter the game data from World of Stars. Within a dense of fog of calculations, I find the cleverly camouflaged door. A password as obvious as if it were carved into my memory matches a long string of characters like flowing water. The door within the illusion opens easily.\nI never put any essential programs on my hard drive. The programs a smart Master Hacker uses are all hidden in the recesses of the network. They serve as the strongest and nimblest extensions of one’s mind, radiating like a spiderweb in all directions.\nFor the same reason: If someone seizes the data within a Master Hacker’s database, that person also has the Master Hacker in the palm of their hand. To tell the truth, when that man held up the piece of paper with “Master Hacker” written on it, I practically pissed my pants.\nThe database bears the marks of a break in. Some are meticulously and ingeniously concealed but leave some inadvertent loose ends. Others are blatant, but are neatly cut off from its source. No way to trace them. A blast of cold flits across my back. I shudder in spite of myself.\nAn abyss is a place filled with danger. No one gets this. Whoever you meet, or the person who spies on you, is a government spelunker or a Master Hacker or is a ghost hidden inside a vast database. Spelunkers and Master Hackers pass around a saying you need to understand: Some abysses absolutely must not be tested. Hiding there are vast existences beyond our comprehension. All the jackholes who go there are drawn into a vortex of data, forever gone. They leave behind stiff bodies, lying comatose in hospital ICUs.\n“Have you found the bastard?” Aksha’s consciousness wanders over.\n“I’d really rather not.” I bring Aksha into the middle of the streaming data. Segment by segment, I unspool it out. “Look, these marks are from after we left. They’re from government spelunkers entering my database. But the jackhole who left this blatant mark, did you notice? Maybe he’s a newbie, but tidy. If he can do this, then the only . . . ”\nThe cat sighs.\nAksha brandishes a claw and breaks its connection to the network. I send a disconnect command, too. It’s as if my stiff body is being pulled away from a warm pool. Reluctantly, I leave the network and return to harsh, cold reality. Although I feel nauseous, there are some things that are best not discussed in the network.\n“Your point is that there are ‘Sea Spiders’ stalking us?” Aksha fidgets, grinding its claws against the hardwood floor. “Why would they do that? They have to know. We don’t have anything to do with them anymore.”\n“I’ll have to take the job to find out.” I fish out the number from the chip in my head. “13330573885, Cheng Liang. Tomorrow, I’ll have a chat with the university professor.”\nFather and Daughter\nBreaking into Cheng Liang’s personal computer is really easy. At 5:00 p.m., he still hasn’t left work yet, but I’ve already worked out the man’s basic situation: He has a steady job. His wife died two years ago. His daughter, Cheng Wen, is sick and recuperating at G City General Hospital. Before his daughter got sick, he barely had any interests outside of work, but after she was hospitalized, he began to search the network for everything from rumors and stories to web pages and data about “Master Hackers.” They practically fill up his hard drive.\nAksha takes several pieces of data and digs into the G City General Hospital’s database. We fall into our rhythm working with each other and quickly find Cheng Wen.\nShe is in a single-unit ICU with symptoms of schizophrenia.\nShe isn’t manic like the other patients in the psych ward. As observed from the monitoring equipment, Cheng Wen is incredibly calm. She lies curled up on the bed. Her large, clear eyes stare at the computer at the head of the bed. According to the psych ward records, Cheng Liang installed the computer for his daughter. Without a computer, she simply stopped eating in protest.\nThe door opens. Cheng Liang walks in with a box lunch. A nurse stands next to him.\n“Wennie?” Cheng Liang cautiously studies his daughter’s response. Gently, he sets her lunch on the overbed table.\nShe turns her head, meeting Cheng Liang’s gaze for a moment. It’s not a mad glance. On the contrary, it was too calm, too still for a woman of nineteen. Her mouth opens and closes twice, as though she were saying “papa,” but without any sound.\n“Wennie, time to eat.” Cheng Liang sits beside the bed, opens the box, careful to leave some distance between him and his daughter.\n“Thank you.” Courteously, she accepts the proffered lunch and takes a few elegant bites. She uses a knife and fork rather than chopsticks.\nAn odd feeling fills the ward. Father and daughter fall silent with each other. She’s obviously his flesh and blood, but seems like a stranger, maintaining a polite distance. A fine thread of pain shone mirrorlike on their faces.\nWhen his daughter finishes her lunch, Cheng Liang repacks the box and utensils. He stands. “I’m leaving now, Wennie.”\n“Oh. Goodbye,” she answers.\nThroughout the entire visit, she never called him her father.\nI sigh, leave the hospital’s monitoring system, clean up the traces of my break in, then leave the network. It’s not until now that a headache pierces through my neural shield, making me dizzy and unsteady. I stagger into the kitchen, swallow a pill, and chase it down with a glass of water. Then I sit in front of my computer again.\n“Don’t you want to rest a bit?” Aksha asks.\n“No point.” I stare at the screen. “I don’t need a ‘full connection’ for what’s left. A ‘machine connection’ is good enough. I can guess what’s going on. But what’s important now is to make the university professor believe us.”\n“Someone who studies too much is easy to deceive.” Aksha yawns and curls into a warm ball around my leg.\nAbout an hour later, the cell phone tracker signals: Cheng Liang has come home.\nRemotely, I turn on his computer and print a line of text on his display: “Are you looking for me?”\nI guess he must be scared half to death because his microphone picks up a cracking sound, as if something has been smashed to pieces.\nI add: “I am a Master Hacker. You were looking for me, right? Speak. I can hear you.”\nHe makes a sound not unlike a strangled goose. I enable speech synthesis on his computer and start typing quickly. On his end, his speaker emits a nauseating, inhuman sound. That should be enough to make someone either hate or fear a Master Hacker.\n“I know you’re looking for me,” I say. “What do you want me to do? How much are you paying? Who else knows you’re looking for a Master Hacker?”\nHe pants for a moment. Once he recovers: “I want . . . I want you to find someone.”\nI laugh. “Find who?”\n“I . . . I want you to find my daughter.” The university professor seems as helpless as a child. “I want you to find my daughter. My ‘uploaded’ daughter.”\n“Your daughter hasn’t been uploaded. Right now, she is at the best hospital receiving the best possible treatment from their neurologists.” I laugh grimly.\nThrough his webcam, I see him back away, as if I could bite him through the network. “How . . . how did you know?”\n“Because I’m a ‘Master Hacker,’” I answer.\n“She isn’t my daughter!” Cheng Liang shouts. “I know she isn’t!” His hands spasm as they grip the hem of his jacket. “I know she isn’t. My daughter was uploaded. Who knows what is in her body now! I want you to find Wennie and bring her back. Money is no concern. I want her back!”\nI glance over at Aksha. It yawns and nods its head.\nI sigh. “Just to get this out of the way: I won’t necessarily be able find your ‘uploaded’ daughter, so I won’t ask you to pay up-front. I’ll wait until I have a lead. Naturally, I’ll be in touch. Don’t keep looking for another ‘Master Hacker.’ Otherwise, I can’t guarantee I’ll be able to pull this off. Got it?”\nHe nods over and over again. His cast is so desperate, it’s like he’s giving medicine to a dead horse. For a crime as serious as “uploading,” he really doesn’t have any options besides looking for a “Master Hacker.”\n“In that case,” I say slowly. “Tell me everything about what happened to your daughter.”\nOn that side of the computer, Cheng Liang chatters endlessly with his head in his hands. On this side of the computer, I light a cigarette and listen quietly.\nAccording to the learned university professor, his daughter was always an “obedient and well-behaved child.” But, eventually, he didn’t know why, she became a fan of virtual-reality games, wallowing with no way to free herself. He tried hitting her, scolding her, begging her, but none of that worked. Finally, one day, she uploaded herself, leaving her father only a brief message:\nI’m exhausted.\nLiving up to your expectations is exhausting. Not living up to your expectations is also exhausting.\nDad, Mom, I’m sorry. Goodbye.\nAs a matter of fact, Cheng Wen’s story and the story of everyone else who uploads themselves are all basically same. She was an only child, no siblings, and no real friends. Every day, she obediently went to school, came home afterward, ate, then slept. Home and school were the cruxes supporting a finely wrought cage. For the child inside, it seemed like the entire world.\nUntil one day, she became infatuated with the network.\nI understand the feeling. When you go on the net, information rushes at you like a flood. It tells you that this is the entire world. But when you leave the net, you feel the flood waters recede. You are still in the cage. You haven’t moved even a tiny step. You want that world, to enter that world, to embrace this brand new heaven and earth. You, however, discover that reality, your body, the love of your family, all weigh you down like shackles in a prison.\nAt a secret upload website, a sentence is written in red boldface on the home page: “When exiling humanity from paradise, God said: I will give them love.” This is the best yoke. As long as they are bound by love, they will never have a way back to paradise.\nThis has spread among netizens. I don’t know how many people try to shout from their cages. They want a new world. Actually, they are confused. A lot of people feel that the price of a new world is to lose everything in the old world. Who would make such a grave choice?\nBut I understand those who uploaded themselves. The reason why you abandon yourself is really simple.\nOh, yes. I understand.\nFor example, Cheng Wen, what she wanted was nothing more than a comparatively relaxing life. A life where there’s no pressure to do well on high-stakes school entrance exams.\nAnother example, say there’s a girl named Lin Yu. She uploaded herself because she firmly believed, in real life, she had not even one single redeeming feature. On the net, she kicked serious ass. What she did made the relatives who once thought of her as garbage respect her.\nBut they were both wrong. The net is not the real world. They wouldn’t open their eyes in the middle of a current of electricity. They just found a piece of solid earth, clear water, and blue sky. An abyss in the net is like an ocean. It swallows everybody who throws themselves in, cleansing them.\nWhat very few people realize: The deepest recesses of an abyss are incredibly difficult places for anyone, whether it’s a program, spelunker, or Master Hacker, to reach. Huge and dismal existences hide there. It is a place where illegal data, uploaded consciousnesses, destroyed programs, and abandoned AI all mix together, lie dormant, and propagate. Some of the consciousnesses use uploaded human thoughts as a kernel. Some have only pieces of programs and evolve. They are immense, jumbled, all-embracing, and yet amount to nothing.\nThey call themselves “Sea Spiders.”\nGovernments, of course, know Sea Spiders exist. They have rooted Sea Spiders out from their hiding places many times. Sea Spiders, however, are way smarter than any program, more nimble than any spelunker. They lurk like undercurrent in the net. Even the craftiest Master Hacker has a hard time detecting their existence. Because they are on the net, the likelihood of a self-reproducing consciousness is comparable to that of an infinite number of monkeys eventually typing out Hamlet. As a result, governments have adopted drastic measures. They’ve banned completely the uploading of consciousnesses, classifying it as the most serious of crimes, giving it the harshest punishment.\nOf those who upload themselves, eighty percent of their consciousnesses are ripped to shreds by government web crawlers, ten percent are disintegrated into data packets, becoming rich fodder for Sea Spiders. The remaining ten percent become Sea Spiders themselves, roaming among the data, hiding from both governments and others of their own kind. They rip apart other consciousnesses to slake their thirst for data. They sniff out, even luring those who want to upload themselves, always alert to take over hollow bodies.\nBut only one percent of Sea Spiders luck into the bodies fools abandon to upload themselves. Those Sea Spiders return to the real world.\nThey are reincarnated in someone else’s body.\nI suppose, perhaps at the time, the woman called Cheng Wen heard a whisper in the deep recesses of the net that enticed her, called her to go. She didn’t know, though, that this first step wouldn’t lead to rebirth, but to eternal damnation.\nCheng Liang’s hand trembles as he lights a cigarette. He tells me that one morning he opened the door to his daughter’s room to see her in front of her computer, unwakeable and wearing a slight smile. He rushed her to the hospital. The doctor had to tell him: don’t hold out any hope for her.\nLater, as a spur-of-the-moment test, he attached her stupefied body to the network and she suddenly woke up. But the person who woke was no longer the Cheng Wen from before.\nCheng Liang enumerates exhaustively the ways she is different from before. I just let it wash over me. Because parents always have a keen intuition about their children, I believe him.\nSince everyone who intends to upload hides at least one Sea Spider afterward, they hide there silently, luring and agitating. Once the uploaded consciousness leaves the mind, they race to be first to seize the already soulless body and occupy it.\nAs for the consciousness that leaves the body, her fate is up to one percent opportunity and ninety-nine percent luck. All she has to do is become a “Sea Spider,” then follow in my footsteps to become a “Master Hacker,” like I did. Easy peasy.\nCheng Liang said that he received a text: Dad, find a Master Hacker. Help me.\nAt the end of the text was my address. It was this text that made up his mind to admit his “daughter” to the hospital. Then he held his nose and went to the neighborhood where I’d rented an apartment.\nNowhere to Return to\nBy the time Professor Cheng finishes his endless narrative, it’s already 4:00 a.m. My headache feels like it’ll burst my head open. All sorts of random thoughts rush around and expand so that my ears buzz.\nI take two pills. They help not one bit. Pissed off, I take three more. I shut down my computer. My hands pressed against my head, I sway into the kitchen and dump some tepid water onto instant noodles. I eat the half-cooked noodles, then return to my room. My bed’s not made. The blanket’s still unfolded. I plow in, not bothering to take off my clothes, and flop into dreamland.\nIt’s not until 2:00 p.m. that I have the strength to crawl out of bed. I rub my face, grab some cash, then shop at the supermarket downstairs. Carrying bags and bags of snacks and cat food, I catch sight of a pay phone. A long while passes before I walk to it and dial a familiar number.\n“Hello. May I ask who are you looking for?”\n“Mom, it’s me, Xuejiao.”\nEverything suddenly grows silent. Ages pass in silence. My hand trembles as I hold the handset. Not knowing where the courage is coming from, I wait and wait some more.\n“Xuejiao, where are you? You changed your number again?” Mom says, finally finding the words.\n“My job’s been transferred to Jiaxing.” I lie. I lie like this every time. Actually, I suspect she’s long since figured out what I’m doing.\n“Jiaxing is a good neighborhood, Xuejiao. Work hard. Look after yourself . . . ” Mom’s voice falls. “When . . . come on home, just to visit.”\n“Hm. Maybe for New Year’s,” I say.\nEvery time I promise to come home for New Year’s, every time I nestle myself in my apartment, cradling Aksha. Dry-eyed, I listen to the cold New Year’s bells toll. What goes through my mind is that I’m incapable of keeping my promise to my mom.\nWhen I return, Aksha sees how listless I am and jumps onto the table. “Did you call your mom again?”\n“Ugh.”\nAksha licks its paws. “Aren’t you just looking to make yourself depressed?”\n“I am happy!” I sulk at it in return.\n“If you want to cry, cry, Xuejiao.” Aksha’s tone implies a worldly experience undercut by the cat food stuck on its whiskers.\nShrugging, I pick up a cash-filled envelope, count out two-thirds of the money, then split that in two.\n“Are you going to post the money?”\n“Oh, like always. Half goes to Mom, half to Auntie Zhou.” I hide the cash in a pocket.\nAksha licks my finger with its rough tongue. “Don’t forget to take your medication before you go.”\n“I know.”\nAfter I return from the post office, Aksha and I gorge ourselves. We demolish everything I brought back from the supermarket. Then I sleep until the following morning.\nOn the theory that I’ll need a lot of energy and physical strength to look for a “Sea Spider,” I take a full dose of antirejection medication. It makes me feel like I’m sleepwalking. I shake off my blanket and change clothes. Having skipped combing my hair, washing my face, and brushing my teeth, I eat two eggs, drink a bag of milk, turn on my computer, and go online.\nCheng Liang said that his daughter lost herself in the game Rivers and Lakes Unlimited. Moreover, he insisted that I go into the game to look for his daughter’s consciousness. Instead, I do something much simpler. I find and follow the trail of uploaded packets on the computer.\nThe trail breaks at the first node. That’s not exactly a surprise. On the side, Aksha has already downloaded her game data and began to look for similarly skilled IDs in Rivers and Lakes Unlimited.\n“There isn’t any,” it says. Scrubbed clean. They left behind fewer tracks than even the craftiest rat.\nGovernment databases also haven’t captured any records of any data packets similar to consciousnesses. “Or maybe those records been deleted,” I reply.\n“Where else could there be clues?” Aksha asks.\n“Abysses,” I answer. The deepest abysses.\nIt’s never been easy to find any Sea Spider, let alone a specific Sea Spider. Now there are two possibilities: his daughter became a Sea Spider herself or, even worse, Sea Spiders broke her up into splintered pieces of data and integrated them into many different consciousnesses. I adjust my gear and begin to search.\nKnow this: “jacking in” and “uploading” feel nothing like each other. To use a particularly fitting metaphor, jacking your mind into the net is drifting along a river in a boat. Uploading your mind, however? Flinging yourself directly into the water. You have to master how to see, how to breathe, how to live in the water. Everything you know is turned completely on its head. Before you are swallowed, you have to make yourself a fish.\nAfter I think about it a bit, I decide to start from the game. If she liked this game so much, in her ignorance, she might have clutched at this desperate straw when she first entered the world of the net. Heading straight toward the game, I search between the node the trail broke at and the game’s server node, not letting even the whisper of a clue pass me by.\nClue one: September 2nd. That’s the day she uploaded. Rivers and Lakes Unlimited District Three Server Six, a card machine appeared, was forcibly ejected, then disconnected.\nClue two: Server Six is typically overloaded.\nClue three: A tracking program was once run from here. Objective unknown. The server was located in Wuxi. That was the city I lived in until Cheng Liang scared me into moving.\n“It’s here,” Aksha says.\nI dive in deep. The server has a series of storage areas. They are ingeniously scattered across different locations and linked together. As a whole, however, they are difficult for someone to find.\nIn the mind-machine interface, I open the door.\nA range of golden mountains burn my eyes. Red and yellow leaves in a forest, mixed with the green of the pine. Late autumn frost smears the earth with a thin layer of white. The fields have already been harvested. Tall piles of corn lie at the edges. Golden kernels glint against the transparent, deep blue sky.\n“Do you miss it? Xia Xuejiao, do you miss your home?” a thin, reluctant voice asks.\nA young woman walks toward her from a low, flat-roofed house. It’s Cheng Wen. With a tiny nose and round face, she is as adorable as a doll when she laughs. Her eyes, however, are black. They are as distant as the night sky and unfathomably haunted.\n“Or perhaps I should call you Ji Cina?” She begins to laugh. “It’s been a long time, old friend.”\n“ . . . Jill?” I sputter and spit out the code name.\nThe scenery around me suddenly begins to roil. It changes into countless flows of color, like a rainbow corridor. Aksha and I are at one end. Cheng Wen is at the other.\n“I’ve been waiting for you.” She laughs and twirls. Her skirt flutters, becoming a beautiful flower. “After I ‘downloaded’ my consciousness into this body, that stupid girl regretted abandoning her body. Actually, she shouldn’t have tracked you down. And she shouldn’t have sent your address to her father. If she had just continued to hide in that server, the computer I compromised in the mental hospital would have never found her.”\nMy heart aches.\n“You stole her body. Now, you’ve eaten her consciousness?” I ask.\n“Don’t get all noble on me.” Her delicate face is ice cold. “Are the things you’ve done any better?”\n“How much of you is still Cheng Wen?”\n“A lot. Almost forty percent.” She gestures. “With so much data, why would I share it with anyone else? I tore her apart, ate her, and merged her data with mine. It still needs time to digest.”\nI look her over. There is a familiar hunger and thirst in her serene eyes. Although every Sea Spider propagates across the consciousness of those who uploaded themselves, every Sea Spider also yearns to return to reality.\n“You want a body that much?” I ask softly.\n“You have a body, yourself, but you stop others from getting one?” She curls her lips. “So many Sea Spiders. They’re all looking for bodies to the point of abducting them. When I saw this one, I took it. What’s wrong with that?”\n“The day you download yourself, it’s not exactly a comfortable one.” I laugh bitterly.\n“And yet. I want . . . I want arms that can hug. I want eyes that can cry. I want a body. I want . . . ” She stays silent for a long time. “I want to go home.”\nWhen one Sea Spider swallows another Sea Spider, their personalities merge. In that moment, I can’t tell them apart. The one who wants to go home, is it the one who has been flowing in the abyss for a long time, who long ago abandoned a corporeal existence? Or is it the girl who foolishly rushed into the net with no way to return?\n“It’s not so easy,” I say. “Even if you’ve stuffed the immense ‘Sea Spider’ consciousness into a brain, you’ll have to take black-market drugs to prevent consciousness rejection for the rest of your life. Also, how are you going to leave the mental hospital?”\n“That’s none of your business,” she says.\n“Suit yourself,” I answer. “I have one final question I want to ask.”\n“Go ahead.” Jill—Cheng Wen shrugs. “Quickly. The nurses are making their rounds.”\n“You said you want to go home. But to whose home? Jill Lenk’s home in America, in Kansas? Or Cheng Wen’s home in Shanghai?”\nShe’s silent, dumbfounded for a long time. She raises her head then, disappointed, gazes at me with her black, serene eyes.\n“I . . . I don’t know.”\nSatisfied, I laugh. Step-by-step, I leave this abyss. When it’s time for me to break the connection, Jill—Cheng Wen’s sigh flutters in the distance.\n“Ji Cina, which home can you return to?”\nA sharp pain pierces my chest. The javelin I hurt her with turned around and penetrated into my own feelings. Fragments of the city of fluttering, thin light rain in the midst of mansions and skyscrapers and the peaceful village within the range of snow-crested mountains twist together. They remain choked in my throat.\n“Mama . . . ” I mutter to myself.\nI have no idea who I’m calling for. Lin Yu’s mother or mine.\nMother\nI was in college when I uploaded myself. A first-class fool at the time, I followed a man I had a crush on into the net. Only then did I realize I was no more than a tasty morsel of flesh. I have no idea what the man’s sorry fate was. In the rush of data, I couldn’t find any fragment of him or any tracks leading to him.\nI ran in the abyss, dodging government programs. At the same time, I was hiding from or killing my kind, swallowing their data to replenish myself. “Ji Cina” was a name I adopted out of convenience. It means nothing to me. Just three syllables you squeeze out with your tongue pressed against your teeth, terse and fierce.\nSea Spiders almost always break off contact completely with their new bodies’ friends and relatives. However, I’ve heard of those who could return to their former life. I don’t know where the person who took my body went. Her trail ends in Australia. I’ve been very careful, never entering that relatively unfamiliar section of the net.\nIn the local net, for the longest time, Jill and I tangled with each other. We fought, trying to swallow each other. Ultimately, though, we set our boundaries, defining our spheres of influence. No one was more fierce and ruthless than I was. Crazed, I plundered all the data for a chance to return to the real world. In the fight among Sea Spiders for bodies, though, opportunities were fleeting.\nUntil the day I met Aksha.\nAksha was actually small and weak. Compared to our group of “Sea Spiders,” it lacked mobility and flexibility. However, it wasn’t encumbered by so much excess data. “Sea Spiders” generally retain data about the body, ready, just in case, for that day when they returned to the real world. Since it’s an AI, Aksha doesn’t have any of that. It being in an abyss is like a stranded fish returned to the water. As if it were a rat aside our big elephant feet.\nIt told me that it wanted a body. It, however, wasn’t compatible with human bodies.\n“I think I have a solution,” I said. “Let’s make a deal.”\nWhen a new consciousness emerged confused among us, with Aksha’s help, I detoured around the chaotic fight. I penetrated directly into the empty brain.\nThe rejection response was more violent than I’d imagined. For a week after getting the body, I lay in a hospital bed, mournfully wailing through my mental and physical trial. It wasn’t until Aksha brought me a fragment of consciousness it snatched from the net that my condition improved.\nTwo days after I left the hospital, I found an excuse to leave the family of the woman called Lin Yu. From the black market, I stole a huge supply of antirejection drugs, an upload-download unit, as well as a yellow cat whose intelligence was augmented by a microchip.\nSince then, I’ve brought Aksha along. We began our roving days.\nIn these last few years, in my pocket is invariably hidden a letter. It was written by a mother to her daughter who was already never going to return.\nMy dearest Yu:\nIt’s been so long since I’ve heard any news of you.\nMom knows you’re doing your best out there, building your career. But since you can’t come home for New Year’s, you’re never home at all.\nI miss you. Your father also speaks of you.\nYou’re an adult now. You should find a man to marry.\nThis year, why don’t you come back to Pudong for a short visit. Don’t make us worry. You don’t need to send us so much money. Your father’s and my pensions are enough.\nMom, Zhou Yun\n2075/1/26\nI raise my head. In the mirror is a healthy woman, wrinkled pajamas wrapped around her, unkempt hair, bluish-black eyes. A small mole dots the corner of my mouth.\nEvery time I look at myself in the mirror I feel strange. It’s as if Lin Yu’s family in Shanghai, Lin Yu’s mother, her taciturn father, not to mention the Shanghainese that I understand not one word of, they constantly warn me: I’m actually a thief who stole someone else’s body.\nThe day I left Lin Yu’s family, her mother opened an umbrella and saw me off to the end of the lane. She already realized by then that someone else’s soul occupied Lin Yu’s body, but she still smiled. She still tried to convince the incomplete likeness of her daughter to stay.\nShe sent this letter four years ago to my first address. I moved immediately after. Drifting about, I’ve never had any news of her. I never write my address on any money order I post. Frequently, though, I see the silhouette of her going from house to house knocking on doors, and I have no choice but to sneak out the back door in a rush.\nThe Lin Yu who uploaded herself, the fragment I received of her is actually not very large. In my bones, I am still the “Sea Spider” Xin Xuejiao. My mother is still the woman waiting in a small town in the Northeast Forest District. As for Lin Yu, I received her body, but not a way to love her family.\nReturn Home, Return Home\nNew Year’s Eve, I carry Aksha with me to the train station. There’s a missing person notice stuck to the station entrance. It rustles in the breeze.\nMissing Person Notice:\nCheng Wen, female, 19 years old.\nWearing a cream-colored sweater, white overcoat, black jeans. Long hair. Wears glasses.\nDisappeared on 2079/1/6.\nI hope a good-hearted person will provide a clue.\nI hope my daughter will return home.\nFather Cheng Liang weeping 2079/1/10.\nSpeechless, I study the grainy picture printed on the notice. Cheng Wen’s smile gives one a feeling of distance. Yet another Sea Spider who didn’t realize until after returning to this world that there is nowhere to leave for, but also nowhere to return to.\nI laugh bitterly. Holding Aksha, I board the train back to my hometown in the Northeast.\nThe hometown I left six years ago looks just like it used to. Tiny towns seem to freeze in time. Only the people who live in them slowly grow old. Clinging to a thread of hope, I plucked up my courage to return here.\nAuntie Zhou and Cheng Liang, they could realize someone else’s consciousness lived in the body of their child. On the other hand, can my mother pierce through the Yin Yu exterior and see what I used to look like? Even if she hugs me, will she still call me Xuejiao?\nI put on my overcoat and pick up Aksha. The warmth of its body gives me a bit of courage.\n“Just give it a go,” it says.\n“Hm.”\nI leave the hotel. The harsh northeast wind carves my face. On the road, at the edge of town, my mother is waiting for her daughter to return for New Year’s.\nI muster my courage and walk toward my mom. It’s been so many years since I’ve seen her. She is old now. Her thick down jacket seems empty wrapped around her gaunt body. She is curled up against the cold wind, a pair of cloudy eyes stubbornly facing front, waiting for me to return home.\nI’m back, Mom.\nI walk over. And I keep walking. Her gaze slides past my body. My steps grazed her. What she sees is an unfamiliar woman carrying a cat. Who I brush past is my mother.\nThe wind and snow flutter, turning heaven and earth pure white. My mother and I are two tiny black dots on the white ground. The more I walk, the farther away I go. The more I walk, the farther away I go.\nI don’t know how many bodies carry other peoples’ souls. I don’t know how many mothers wait in vain for their children to come home.\nYou have eyes that can shed tears, but not necessarily eyes that can cry.\nYou have arms that can hug, but not necessarily arms that can hug the people you love.\nOriginally published in Chinese in Science Fiction World, May 2006.\nTranslated and published in partnership with Storycom.\nJohn Chu is a microprocessor architect by day, a writer, translator, and podcast narrator by night. His fiction has appeared or is forthcoming at Boston Review, Uncanny, Asimov's Science Fiction, and Tor.com among other venues. His translations have been published or is forthcoming at Clarkesworld, The Big Book of SF, and other venues. He has narrated for podcasts such as EscapePod, PodCastle, and Lightspeed. His story \"The Water That Falls on You from Nowhere\" won the 2014 Hugo Award for Best Short Story.", "source": "https://clarkesworldmagazine.com/chi_12_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: No Way Back by Chi Hui, translated by John Chu"}