{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tomas Petrasek", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "476UAB9K9ZxPc1VSTYMgdqfRK5Q=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Eternal Wanderers Between Fire and Ice  Before we had glimpsed the worlds of other suns, we thought they would look like those in our own solar system, where all major planets revolve in orderly, almost circular orbits, like a giant clockwork. But it was a mistake. After the very first discoveries of extrasolar planets, it became clear that the reality out there was much wilder than our imagination, surpassing both theoretical predictions of astronomers and most of the visions offered by science-fiction authors. In many, and perhaps most planetary systems, hardly any signs of order or general rules could be traced. Gas giants circled in tight, scorching orbits almost hugging their suns, or swept through the habitable zone, extinguishing any hope of Earth-like worlds in their systems. Many of the new worlds, including super-jovian giants, traced highly elliptical orbits, which would be more suited for a comet than a well-behaved planet!  Although we have subsequently learned that not all planetary systems are so exotic, those worlds on wildly eccentric orbits still attract the attention of both scientists and dreamers.  The original question of their origins seems to be settled now—there are actually many pathways leading to elliptical orbits. Perhaps the most important one is chaotic orbital evolution in forming planetary systems. Although planets do form on circular orbits, they may migrate closer to their star during the process. Sometimes, two massive planets get just too close to each other, and their mutual gravitational interaction during a close encounter radically changes their orbits. More likely than not, one of the planets ends up on a wildly elliptical orbit, which may intersect orbits of other neighboring bodies. Chaos ensues, with worlds colliding, falling into their suns, or being ejected into the void. The surviving planets may end up on almost any kind of orbit, including the most eccentric.  Another recipe for extreme eccentricities is the disturbing influence of a massive companion. Sufficiently massive planets or even companion stars in binary systems may excite eccentricity of their smaller neighbors through long-term gravitational perturbations even across a considerable distance. In this case, the orbit of the unfortunate planet may even regularly oscillate between a circular and extremely elliptical shape.  Eccentricity of an ellipse is measured by a dimensionless number, with zero for a perfect circle, and values close to one for the most elongate ellipses (eccentricity of one would signify a parabola, i.e. a celestial body no longer in regular orbit). As the star lies in a focus of the elliptical planetary orbits, there is a single point where the planet is closest to its star (periastron) and the opposite point of the maximum distance (apastron).  How extreme can things get in the observed planetary systems? Take for example the planet HD80606b, a gas giant with extreme eccentricity of 0.93. It can get as far as 0.87 AU from its star at apastron (almost as far as the Earth is from the Sun) but dives to 0.03 AU at periastron (less than one tenth of Mercury’s distance). During such close, but very quick encounters with the star, the planet gets enormous amounts of heat in a very short time—the atmospheric temperature, which can be actually measured, rises from 500 °C to 1200 °C in just six hours! No wonder this creates an explosive storm, with superheated gases spreading in hypersonic velocities from the dayside to the night side.  From the habitability point of view, the occurrence of an eccentric giant planet in a system is generally a bad sign. In many cases, it directly precludes existence of any “pale blue dot” in the habitable zone. Small rocky planets also make the most likely victims during the wild and dangerous period of orbital maneuvers. They may not form at all, they may be destroyed—or end on eccentric orbits themselves, which spells doom over their habitability . . . or does it?  At first glance, the idea is absurd. If the eccentricity of an Earth-like planet got excited to the values not uncommon among exoplanets, it would sweep all the way from the vicinity of Mercury to the distant reaches of the asteroid belt. An endless cycle of boiling, condensing, and freezing seems inevitable, precluding habitability, perhaps with the exception of the most extremophilic life forms, such as bacteria and tardigrades.  But the common sense would be misleading, as was shown by the pioneering work of Darren Williams and David Pollard from Penn State University, published in 2002, and several follow-up studies.  The Earth with its atmosphere and oceans is actually very efficient in buffering temperature extremes, provided they don’t last too long. An eccentric Earth’s twin would be quickly speeding away from periastron before its oceans would be heated to uncomfortable temperatures, and very long before they would have any chance to boil. In the other extreme, at apastron, the waters would release the stored heat and warm the climate, until the planet falls back towards the sun. Maximum and minimum temperatures would occur with a considerable delay after the extremes of insolation, because of the thermal inertia of the planet.  As Kepler’s laws dictate that planets move faster during periastron and slower at apastron, and therefore spend most of their time at the more distant reaches of their orbits, we would expect eccentric planets to be colder than their counterparts on circular orbits with the same orbital period. The opposite is true, actually—such planets accumulate heat very efficiently during their quick and hot periastron passage, which outweighs the effect of long, dark and cold “winter.”  Williams and Pollard modeled climates of Earth’s twins with eccentricity up to 0.7, and provided a “weather forecast” for such a world. Periastron, located inside the orbit of Mercury, would occur on March 7th, with temperatures climbing quickly toward maximum on April 2nd. Interior areas of tropical continents would be close to the boiling point of water at this point, precluding survival of any unprotected lifeform, and warming oceans would sprout torrential storms. However, outside the tropics conditions would stay generally survivable, even mild in coastal areas. The extreme heat would cease quickly, and in about a month, life could return even to the equatorial landmasses. At apastron occurring in September, the climate would be mild in most places, and still cooling. The lowest temperatures would occur on 13th January, but except for polar areas, most of the planet would be still above freezing. By that time, the world would be speeding quickly inward, with just two months remaining to the rapid heating at periastron! Although this kind of annual cycle seems unusual for an earthling, many places would be comfortable even for human beings, and an Earth-like biosphere would probably thrive there without difficulty. Of course, this is just one specific example; other eccentric planets may exhibit very different climates depending on their orbits and physical characteristics. Amazingly, some simulations allow for habitable conditions even on planets with eccentricity of 0.9, almost as eccentric as planets can get. It seems likely that some other influence, such as tidal forces or stellar winds during periastron flybys, ruins planetary habitability before the temperature swings do.  Even when eccentricity itself might not limit habitability, long-term changes of orbital shape could. In cases when eccentricity oscillates wildly during eons, the average temperature would change, too, with increases of eccentricity leading to warming and circularization bringing cooling. Ice ages on Earth are—at least partially—caused by small changes in eccentricity. However, those shifts are insignificant compared to what some exoplanets must experience. What kind of biosphere could cope with such conditions?  Unlike gas giant planets, Earth-mass worlds are difficult to discover. Finding an Earth’s twin is a task for the next generation of astronomical instruments, and actually confirming its habitable nature would be even more challenging. Therefore, we still lack hard data about habitable exoplanets, eccentric or otherwise, although we have many reasons to believe they actually exist. Maybe some of the known giant planets host terrestrial-sized moons, which could be as interesting as any planet.  Take a textbook example of an eccentric exoplanet, and one of the first discovered, 16 Cygni Bb. Gas giant heavier than Jupiter, it orbits a Sun-like star on a highly eccentric orbit. There are two other stars in the system, too—a second Sun-like star and a red dwarf. Those companions have probably driven the planetary eccentricity to the present extreme value, and may cause it to fluctuate periodically in a wide range, although with a period of millions or even billions of years. The planetary orbit closely matches the hypothetical eccentric Earth of Williams and Pollard in both shape and average temperature. If 16 Cygni Bb has a satellite large enough to hold atmosphere, it could conceivably have liquid oceans and even host complex life on the surface. The locals would enjoy a fantastic view—three suns in the sky, with the main one periodically growing and shrinking on the sky, bringing short but fierce “summers” and long, mild winters.  We don’t know how common eccentric habitable planets and moons are, but we have all the reasons to believe their existence is far from impossible. Even the wilder planetary systems should not be excluded from our searches for life and Earth-like planets—at least until we learn much more about them. Because we live in a universe much more diverse than we’ve ever dreamed, and we have yet to find out whether or not there are biospheres as plentiful, as exotic, and as strange as the variety of worlds they could possibly inhabit.", "text": "Non-Fiction\nEternal Wanderers Between Fire and Ice\nBefore we had glimpsed the worlds of other suns, we thought they would look like those in our own solar system, where all major planets revolve in orderly, almost circular orbits, like a giant clockwork. But it was a mistake. After the very first discoveries of extrasolar planets, it became clear that the reality out there was much wilder than our imagination, surpassing both theoretical predictions of astronomers and most of the visions offered by science-fiction authors. In many, and perhaps most planetary systems, hardly any signs of order or general rules could be traced. Gas giants circled in tight, scorching orbits almost hugging their suns, or swept through the habitable zone, extinguishing any hope of Earth-like worlds in their systems. Many of the new worlds, including super-jovian giants, traced highly elliptical orbits, which would be more suited for a comet than a well-behaved planet!\nAlthough we have subsequently learned that not all planetary systems are so exotic, those worlds on wildly eccentric orbits still attract the attention of both scientists and dreamers.\nThe original question of their origins seems to be settled now—there are actually many pathways leading to elliptical orbits. Perhaps the most important one is chaotic orbital evolution in forming planetary systems. Although planets do form on circular orbits, they may migrate closer to their star during the process. Sometimes, two massive planets get just too close to each other, and their mutual gravitational interaction during a close encounter radically changes their orbits. More likely than not, one of the planets ends up on a wildly elliptical orbit, which may intersect orbits of other neighboring bodies. Chaos ensues, with worlds colliding, falling into their suns, or being ejected into the void. The surviving planets may end up on almost any kind of orbit, including the most eccentric.\nAnother recipe for extreme eccentricities is the disturbing influence of a massive companion. Sufficiently massive planets or even companion stars in binary systems may excite eccentricity of their smaller neighbors through long-term gravitational perturbations even across a considerable distance. In this case, the orbit of the unfortunate planet may even regularly oscillate between a circular and extremely elliptical shape.\nEccentricity of an ellipse is measured by a dimensionless number, with zero for a perfect circle, and values close to one for the most elongate ellipses (eccentricity of one would signify a parabola, i.e. a celestial body no longer in regular orbit). As the star lies in a focus of the elliptical planetary orbits, there is a single point where the planet is closest to its star (periastron) and the opposite point of the maximum distance (apastron).\nHow extreme can things get in the observed planetary systems? Take for example the planet HD80606b, a gas giant with extreme eccentricity of 0.93. It can get as far as 0.87 AU from its star at apastron (almost as far as the Earth is from the Sun) but dives to 0.03 AU at periastron (less than one tenth of Mercury’s distance). During such close, but very quick encounters with the star, the planet gets enormous amounts of heat in a very short time—the atmospheric temperature, which can be actually measured, rises from 500 °C to 1200 °C in just six hours! No wonder this creates an explosive storm, with superheated gases spreading in hypersonic velocities from the dayside to the night side.\nFrom the habitability point of view, the occurrence of an eccentric giant planet in a system is generally a bad sign. In many cases, it directly precludes existence of any “pale blue dot” in the habitable zone. Small rocky planets also make the most likely victims during the wild and dangerous period of orbital maneuvers. They may not form at all, they may be destroyed—or end on eccentric orbits themselves, which spells doom over their habitability . . . or does it?\nAt first glance, the idea is absurd. If the eccentricity of an Earth-like planet got excited to the values not uncommon among exoplanets, it would sweep all the way from the vicinity of Mercury to the distant reaches of the asteroid belt. An endless cycle of boiling, condensing, and freezing seems inevitable, precluding habitability, perhaps with the exception of the most extremophilic life forms, such as bacteria and tardigrades.\nBut the common sense would be misleading, as was shown by the pioneering work of Darren Williams and David Pollard from Penn State University, published in 2002, and several follow-up studies.\nThe Earth with its atmosphere and oceans is actually very efficient in buffering temperature extremes, provided they don’t last too long. An eccentric Earth’s twin would be quickly speeding away from periastron before its oceans would be heated to uncomfortable temperatures, and very long before they would have any chance to boil. In the other extreme, at apastron, the waters would release the stored heat and warm the climate, until the planet falls back towards the sun. Maximum and minimum temperatures would occur with a considerable delay after the extremes of insolation, because of the thermal inertia of the planet.\nAs Kepler’s laws dictate that planets move faster during periastron and slower at apastron, and therefore spend most of their time at the more distant reaches of their orbits, we would expect eccentric planets to be colder than their counterparts on circular orbits with the same orbital period. The opposite is true, actually—such planets accumulate heat very efficiently during their quick and hot periastron passage, which outweighs the effect of long, dark and cold “winter.”\nWilliams and Pollard modeled climates of Earth’s twins with eccentricity up to 0.7, and provided a “weather forecast” for such a world. Periastron, located inside the orbit of Mercury, would occur on March 7th, with temperatures climbing quickly toward maximum on April 2nd. Interior areas of tropical continents would be close to the boiling point of water at this point, precluding survival of any unprotected lifeform, and warming oceans would sprout torrential storms. However, outside the tropics conditions would stay generally survivable, even mild in coastal areas. The extreme heat would cease quickly, and in about a month, life could return even to the equatorial landmasses. At apastron occurring in September, the climate would be mild in most places, and still cooling. The lowest temperatures would occur on 13th January, but except for polar areas, most of the planet would be still above freezing. By that time, the world would be speeding quickly inward, with just two months remaining to the rapid heating at periastron! Although this kind of annual cycle seems unusual for an earthling, many places would be comfortable even for human beings, and an Earth-like biosphere would probably thrive there without difficulty. Of course, this is just one specific example; other eccentric planets may exhibit very different climates depending on their orbits and physical characteristics. Amazingly, some simulations allow for habitable conditions even on planets with eccentricity of 0.9, almost as eccentric as planets can get. It seems likely that some other influence, such as tidal forces or stellar winds during periastron flybys, ruins planetary habitability before the temperature swings do.\nEven when eccentricity itself might not limit habitability, long-term changes of orbital shape could. In cases when eccentricity oscillates wildly during eons, the average temperature would change, too, with increases of eccentricity leading to warming and circularization bringing cooling. Ice ages on Earth are—at least partially—caused by small changes in eccentricity. However, those shifts are insignificant compared to what some exoplanets must experience. What kind of biosphere could cope with such conditions?\nUnlike gas giant planets, Earth-mass worlds are difficult to discover. Finding an Earth’s twin is a task for the next generation of astronomical instruments, and actually confirming its habitable nature would be even more challenging. Therefore, we still lack hard data about habitable exoplanets, eccentric or otherwise, although we have many reasons to believe they actually exist. Maybe some of the known giant planets host terrestrial-sized moons, which could be as interesting as any planet.\nTake a textbook example of an eccentric exoplanet, and one of the first discovered, 16 Cygni Bb. Gas giant heavier than Jupiter, it orbits a Sun-like star on a highly eccentric orbit. There are two other stars in the system, too—a second Sun-like star and a red dwarf. Those companions have probably driven the planetary eccentricity to the present extreme value, and may cause it to fluctuate periodically in a wide range, although with a period of millions or even billions of years. The planetary orbit closely matches the hypothetical eccentric Earth of Williams and Pollard in both shape and average temperature. If 16 Cygni Bb has a satellite large enough to hold atmosphere, it could conceivably have liquid oceans and even host complex life on the surface. The locals would enjoy a fantastic view—three suns in the sky, with the main one periodically growing and shrinking on the sky, bringing short but fierce “summers” and long, mild winters.\nWe don’t know how common eccentric habitable planets and moons are, but we have all the reasons to believe their existence is far from impossible. Even the wilder planetary systems should not be excluded from our searches for life and Earth-like planets—at least until we learn much more about them. Because we live in a universe much more diverse than we’ve ever dreamed, and we have yet to find out whether or not there are biospheres as plentiful, as exotic, and as strange as the variety of worlds they could possibly inhabit.", "source": "https://clarkesworldmagazine.com/petrasek_07_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Eternal Wanderers Between Fire and Ice by Tomas Petrasek"}