{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Carrie Sessarego", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "oayJwYELW4Jmly8NrzIj5iGZhEU=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Validating Rage: Women in Horror  Spoilers for: Halloween, Alien, The Babadook, Gaslight, Ready or Not, Rosemary’s Baby, A Nightmare on Elm Street  In today’s world, women are often expected to be polite, to be selfless and self-sacrificing, and to be nurturing. Women never face more vitriol than when they express anger, an emotion that taints them with labels like “shrill,” “hysterical,” and “bitchy.” In the world of horror, these rules are inverted. Horror is a vast genre replete with subgenres, and it is impossible to make definitive generalizations that encompass the thousands of horror films that have been released since the short film The House of the Devil terrified first-time filmgoers in 1896. However, commonly we find that horror is a genre that allows women to be unapologetically enraged and violent in their own defense. Some female characters survive horror movies, and some do not, but whether they win or lose, we root for the woman who fights for her own life. In this essay, the terms “woman” and “female” apply to any character or person whose affirmed gender is female.  Even before women are forced to fight for their lives, they often have to fight to be heard at all. Women frequently serve as early warning beacons in horror, and they are just as frequently ignored. For instance, in the science fiction horror movie Alien (1979), the crew of a spaceship discovers an alien ship on a strange planet. Lambert, the navigation officer, votes against going into the ship. Later, a crew member who is exploring the alien ship is attacked by an alien organism that attaches itself to his face. Ripley, the warrant officer, insists on enforcing quarantine procedures. Both women are overruled, which is a shame, because if the other characters had listened to Lambert, none of them would have died, and if they had listened to Ripley, the body count would have stopped at one instead of six.  In psychological horror, this is expanded to the entire premise of the movie revolving around a woman’s opinion, instincts, desires, and knowledge being ignored and overruled. The term “gaslight,” as a verb, comes from the movie Gaslight (1944), a noir/horror/thriller in which a woman named Paula is psychologically tortured by her husband who wants her to believe that she has gone insane so that he can steal from her with impunity. To “gaslight” somebody is to deny what a person knows to be true to such an extent that this person begins to doubt their own perception and even their own sanity.  Gaslighting in fiction draws a visceral response of pure rage from women because we are so often subjected to it in reality. The horror in Gaslight comes from the abuse that so many women experience in so many ways, making the heroine’s situation relatable despite the more melodramatic details of the plot. Arguably the worst thing about gaslighting is that it makes it difficult for the victim to find a single, external point to push against. If you can’t trust your own mind, then who is to blame? It is therefore deeply satisfying when, as we’ll see later in this essay, the gaslighter is identified, defeated, and scorned.  Many subsequent movies rely on gaslighting for horrific effect. Rosemary’s Baby (1968) involves a young married woman who is thrilled to become pregnant, but less thrilled to experience painful and mysterious symptoms. Her husband and the neighbors in her apartment building insist that she go to a new doctor that they recommend, and that she avoid reading about pregnancy and talking to her friends. These people continue to tell Rosemary that her symptoms are normal and that she is being irrational and unreasonable as she becomes more and more concerned about her pregnancy and the controlling behavior of her husband, doctor, and neighbors. While everyone tells Rosemary that she is imagining things, the viewer knows that Rosemary’s husband and neighbors conspired to drug her and allow her to be raped in her drugged state by Satan, whose child she now carries.  The real terror in Rosemary’s Baby comes not from the existence of Satan, who, after all, we hardly see. The real terror comes from the unrelenting psychological abuse, the complete denial of Rosemary’s observations, concerns, and experiences, from almost every character in the movie. In reality, our chances of being impregnated by the devil are presumably zero. However, women are quite likely to be preyed upon at some point by an abusive partner, relative, employer, or community. While the plot of Rosemary’s Baby relies on the supernatural, the actual horror comes from the mundane and all too common situation of being isolated, controlled, ignored, and denied by the same people we should be able to depend on. Even though Rosemary does not have a happy ending overall, the fact that she is able to finally sever her relationship with her husband and spit in his face when he tries to reconcile with her means that she has achieved a small but vital victory.  Horror usually relies on the premise of an “original sin,” and part of the catharsis in horror lies in the exposure and resolution of this sin. Perhaps someone built a house on a burial ground (Poltergeist, 1982), or someone had sex instead of watching over the young camper swimming in Crystal Lake (Friday the 13th, 1980). In reality, we would surely conclude that a new group of counselors should not be held accountable for the actions of their predecessors, and that little Carol Anne is not responsible for her parent’s real estate investments. However, in the world of horror, guilt by association and proximity matters. The original sin must be paid for in blood regardless of the size of the sin or the distance the sufferers have from the original participants. As said in Buffy the Vampire Slayer, “This is not justice! This is vengeance.”  In the slasher subgenre, the original sin is manifested in the shape of the avenging monster—the slasher him (sometimes her) self. This character is traditionally male, but may be female, or an alien, a robot, an animal, multiple people, or even the “Final Girl” herself. As the movie progresses, some people warn others about the slasher but are ignored until the carnage is exposed, and the original sin revealed. The need for exposure and vengeance is manifested in the form of the slasher/monster/bogeyman, and the survival of the last character standing, who critic Carol J. Clover famously called the “Final Girl,” marks the resolution of this conflict, at least until the inevitable sequel.  While the “Final Girl” was originally used for a very specific character type, it is now used more loosely and is subject to many twists and subversions. She/He/They is usually initially confused and terrified, but ultimately fights the slasher with her intellect and her body and any weapons she can find or make. If she successfully battles the slasher (the external locus of terror) as far as the credits, the viewer considers her to be triumphant regardless of what the sequels bring.  In psychological horror, the true menace lies within the heroine, who must face her deepest fears and secrets in order to expose the original sin, reach catharsis, and resolve the conflict. In some cases, this revelation is too much for the heroine to cope with, in others it is the key to her salvation. An example of the latter lies in the movie The Babadook (2014).  The Babadook tells the story of a single mother, Amelia, and her six-year-old son, Samuel. Things are difficult for Amelia before anything supernatural occurs. Her husband died driving her to the hospital when she was in labor with her son, and she has unresolved grief and undiagnosed and untreated depression. Her son has sleep disturbances that also cause Amelia to be chronically sleep-deprived, and she misses work when she is called to Samuel’s school because of bad behavior.  When Samuel discovers a book about a scary figure called the Babadook, the family’s life goes from challenging to impossible. Samuel invents weapons, breaks things with them, and takes them to school. He is unable to sleep unless in bed with his exhausted mother. Gradually Amelia becomes possessed by the Babadook. She screams at Samuel, voicing all her awful thoughts of grief, resentment, and frustration, and then tries to kill him. When Samuel reaches out to her lovingly, she is able to oust the Babadook from her body and from the room. However, grief and mental illness (if one reads Amelia as having depression) can’t be so easily expelled. Instead, they can be managed. So, we see Amelia finally fully accepting and loving her son, and also periodically feeding the Babadook, who is trapped in the basement, a nice bowl of worms.  In this story, exposing her buried feelings and secrets liberates Amelia and Samuel. Earlier in the movie, Amelia insists that she has moved on from her husband’s death, but this is clearly not true. She is passive, unwilling, or unable to fight for better mental health and a better relationship with her son. We also see her struggling to suppress her anger at Samuel, even as he becomes increasingly frustrated with her coldness toward him. It is only by being honest about her grief, thus getting her grief out into the open, and then making a special space in which it can live without doing her harm, that Amelia can heal her relationship with her son. Ideally the things she says to Samuel while under the Babadook’s control (that she wishes he had died instead of her husband, and that she fantasizes about killing him) would have been said to a therapist instead of to her son, but even these awful truths must be spoken and faced if she is to deal with them.  While Amelia is possessed, Samuel tells her, “I know you don’t love me, Mommy, because the Babadook won’t let you.” The question of how real the Babadook is has been a matter of much speculation among fans, but the fact that he at least somewhat represents Amelia’s unresolved feelings is undisputed. The figure of the Babadook provides Amelia with an external locus to focus on, allowing her to launch a physical as well as emotional fight against a physical representation of an internal problem.  Amelia cannot love Samuel as an individual until she openly addresses the tragedy of his birth and her frustrations with being a single, grieving, depressed mother. The Babadook is tucked away at the movie’s conclusion, but not a secret. Amelia and Samuel make gathering worms for the Babadook a joint chore before resuming their fun activities, analogous to a self-care ritual that keeps Amelia’s grief a manageable thing instead of a monster. When Amelia screams at the Babadook, “If you touch my son again, I’ll fucking kill you!” she is committing to fighting for a healthy life, although, as the ending suggests, grief will always be a part of her.  In horror, we praise women for fighting back, hard, against those who wish to harm them. We love Laurie from Halloween (1978), but not because she’s a sweet girl. We love her because she’s a sweet girl who also stabs the bad guy (Michael) in the neck with a knitting needle, in the eye with a clothes hanger, and in the chest with his own knife, before distracting him long enough for someone else to shoot him. She is terrified but not helpless, and if Michael didn’t have some sort of supernatural power keeping him alive for many more movies, then tiny teenager Laurie would have killed him three times in his first movie alone. Even though she never stops feeling afraid, she also faces her fear by fighting back.  Fear responses may be summed up as fight, flight, or freeze. In horror, only flight and fight pay off. Viewers respect a heroine who is good at running away. Poor Sally Hardesty, in 1974’s The Texas Chainsaw Massacre, isn’t much of a fighter, but she runs like a champ, and through a combination of endurance and running, she survives. We respect her for this.  However, we often offer our deepest respect for the women who fight, whether physically or otherwise. In Alien, Lambert is petrified with terror when faced with the deadly alien. She is too terrified to move even though if she did move, she could be saved. Since she is frozen with fear, she dies. When Ripley confronts the alien, she is also terrified, but is still able to think and to act, which allows her to, as she puts it in the sequel, Aliens, “blow it out the goddamned airlock.”  In other movies women use violence in a way that is very physical and utterly “unladylike.” In A Nightmare on Elm Street, Nancy sets Freddy Krueger on fire before denying him the fear that gives him power. In The Descent (2005), a group of women who are lost in a cavern fight against monsters with their tools, their hands, and their teeth, gouging out eyeballs and ripping out throats in efforts to protect themselves and each other. In movie after movie, women reject being caring nurturers to commit grisly and brutal acts of violence in order to save their own lives. These women are not “nice,” but they are alive, and if they don’t survive, at least we admire them for having tried.  The movie Ready or Not (2019) provides a visual guide to the heroine’s journey from being a nonviolent person who obeys patriarchal social norms and expectations to someone who is completely uninterested in meeting anyone’s expectations or following anyone’s rules other than her own. At the start of the movie, Grace is marrying into a rich family. She is desperate to impress them and suppresses her own individuality to try to fit in. She conceals her smoking habit, fearing disapproval. She wears her hair in a tight braid, wears a long wedding dress with long sleeves and a high neck, and is excited about seeing the ancestral home. When Grace is trapped in a deadly game of hide and seek, she defends herself with a combination of household items, guns, and fists. At one point she punches a child, in violation of the norms that cast women as motherly.  As the movie progresses, Grace rips off the long skirt of the dress, tears off a sleeve to use as a bandage, replaces her dress shoes with sneakers, burns the house to the ground, and ends the movie covered in blood and ash and smoking a cigarette on what is left of the front porch. All of these are visual markers of her physical and emotional arc. In order to survive, Grace has cast aside or destroyed everything that traditional women are supposed to want—an attractive and fashionable appearance, financial security, a husband, a home, children, and family.  Fighting back, using violence, being angry—these are virtues in horror. When Rosemary spits at her husband, when Nancy sets Freddy Krueger on fire, and when Grace punches the child who just shot her, the audience rejoices, even if the heroine’s victory is only partial or temporary. Not all horror movies follow these kinds of patterns, and not all subgenres are represented here. These examples come from Canada, Australia, and the United States, leaving out the hundreds of iconic horror movies coming from South Korea, Japan, and other parts of the world. Still, in many cases, horror provides a space in which, while a woman might not survive fighting for her life, she will be admired for it.  The oppression of women within a patriarchal society depends largely upon the repression of “negative” emotions like anger. For women to be powerless, their ability to reason and make choices must be cast in doubt and their impulses toward self-preservation stifled and shamed. Horror is sometimes feminist, sometimes misogynistic, sometimes neutral, but many horror films tell us that it is better to die fighting than to die standing around and screaming. If you fight back hard enough, you might even live long enough to be in the sequel! Carrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats.", "text": "Non-Fiction\nValidating Rage: Women in Horror\nSpoilers for: Halloween, Alien, The Babadook, Gaslight, Ready or Not, Rosemary’s Baby, A Nightmare on Elm Street\nIn today’s world, women are often expected to be polite, to be selfless and self-sacrificing, and to be nurturing. Women never face more vitriol than when they express anger, an emotion that taints them with labels like “shrill,” “hysterical,” and “bitchy.” In the world of horror, these rules are inverted. Horror is a vast genre replete with subgenres, and it is impossible to make definitive generalizations that encompass the thousands of horror films that have been released since the short film The House of the Devil terrified first-time filmgoers in 1896. However, commonly we find that horror is a genre that allows women to be unapologetically enraged and violent in their own defense. Some female characters survive horror movies, and some do not, but whether they win or lose, we root for the woman who fights for her own life. In this essay, the terms “woman” and “female” apply to any character or person whose affirmed gender is female.\nEven before women are forced to fight for their lives, they often have to fight to be heard at all. Women frequently serve as early warning beacons in horror, and they are just as frequently ignored. For instance, in the science fiction horror movie Alien (1979), the crew of a spaceship discovers an alien ship on a strange planet. Lambert, the navigation officer, votes against going into the ship. Later, a crew member who is exploring the alien ship is attacked by an alien organism that attaches itself to his face. Ripley, the warrant officer, insists on enforcing quarantine procedures. Both women are overruled, which is a shame, because if the other characters had listened to Lambert, none of them would have died, and if they had listened to Ripley, the body count would have stopped at one instead of six.\nIn psychological horror, this is expanded to the entire premise of the movie revolving around a woman’s opinion, instincts, desires, and knowledge being ignored and overruled. The term “gaslight,” as a verb, comes from the movie Gaslight (1944), a noir/horror/thriller in which a woman named Paula is psychologically tortured by her husband who wants her to believe that she has gone insane so that he can steal from her with impunity. To “gaslight” somebody is to deny what a person knows to be true to such an extent that this person begins to doubt their own perception and even their own sanity.\nGaslighting in fiction draws a visceral response of pure rage from women because we are so often subjected to it in reality. The horror in Gaslight comes from the abuse that so many women experience in so many ways, making the heroine’s situation relatable despite the more melodramatic details of the plot. Arguably the worst thing about gaslighting is that it makes it difficult for the victim to find a single, external point to push against. If you can’t trust your own mind, then who is to blame? It is therefore deeply satisfying when, as we’ll see later in this essay, the gaslighter is identified, defeated, and scorned.\nMany subsequent movies rely on gaslighting for horrific effect. Rosemary’s Baby (1968) involves a young married woman who is thrilled to become pregnant, but less thrilled to experience painful and mysterious symptoms. Her husband and the neighbors in her apartment building insist that she go to a new doctor that they recommend, and that she avoid reading about pregnancy and talking to her friends. These people continue to tell Rosemary that her symptoms are normal and that she is being irrational and unreasonable as she becomes more and more concerned about her pregnancy and the controlling behavior of her husband, doctor, and neighbors. While everyone tells Rosemary that she is imagining things, the viewer knows that Rosemary’s husband and neighbors conspired to drug her and allow her to be raped in her drugged state by Satan, whose child she now carries.\nThe real terror in Rosemary’s Baby comes not from the existence of Satan, who, after all, we hardly see. The real terror comes from the unrelenting psychological abuse, the complete denial of Rosemary’s observations, concerns, and experiences, from almost every character in the movie. In reality, our chances of being impregnated by the devil are presumably zero. However, women are quite likely to be preyed upon at some point by an abusive partner, relative, employer, or community. While the plot of Rosemary’s Baby relies on the supernatural, the actual horror comes from the mundane and all too common situation of being isolated, controlled, ignored, and denied by the same people we should be able to depend on. Even though Rosemary does not have a happy ending overall, the fact that she is able to finally sever her relationship with her husband and spit in his face when he tries to reconcile with her means that she has achieved a small but vital victory.\nHorror usually relies on the premise of an “original sin,” and part of the catharsis in horror lies in the exposure and resolution of this sin. Perhaps someone built a house on a burial ground (Poltergeist, 1982), or someone had sex instead of watching over the young camper swimming in Crystal Lake (Friday the 13th, 1980). In reality, we would surely conclude that a new group of counselors should not be held accountable for the actions of their predecessors, and that little Carol Anne is not responsible for her parent’s real estate investments. However, in the world of horror, guilt by association and proximity matters. The original sin must be paid for in blood regardless of the size of the sin or the distance the sufferers have from the original participants. As said in Buffy the Vampire Slayer, “This is not justice! This is vengeance.”\nIn the slasher subgenre, the original sin is manifested in the shape of the avenging monster—the slasher him (sometimes her) self. This character is traditionally male, but may be female, or an alien, a robot, an animal, multiple people, or even the “Final Girl” herself. As the movie progresses, some people warn others about the slasher but are ignored until the carnage is exposed, and the original sin revealed. The need for exposure and vengeance is manifested in the form of the slasher/monster/bogeyman, and the survival of the last character standing, who critic Carol J. Clover famously called the “Final Girl,” marks the resolution of this conflict, at least until the inevitable sequel.\nWhile the “Final Girl” was originally used for a very specific character type, it is now used more loosely and is subject to many twists and subversions. She/He/They is usually initially confused and terrified, but ultimately fights the slasher with her intellect and her body and any weapons she can find or make. If she successfully battles the slasher (the external locus of terror) as far as the credits, the viewer considers her to be triumphant regardless of what the sequels bring.\nIn psychological horror, the true menace lies within the heroine, who must face her deepest fears and secrets in order to expose the original sin, reach catharsis, and resolve the conflict. In some cases, this revelation is too much for the heroine to cope with, in others it is the key to her salvation. An example of the latter lies in the movie The Babadook (2014).\nThe Babadook tells the story of a single mother, Amelia, and her six-year-old son, Samuel. Things are difficult for Amelia before anything supernatural occurs. Her husband died driving her to the hospital when she was in labor with her son, and she has unresolved grief and undiagnosed and untreated depression. Her son has sleep disturbances that also cause Amelia to be chronically sleep-deprived, and she misses work when she is called to Samuel’s school because of bad behavior.\nWhen Samuel discovers a book about a scary figure called the Babadook, the family’s life goes from challenging to impossible. Samuel invents weapons, breaks things with them, and takes them to school. He is unable to sleep unless in bed with his exhausted mother. Gradually Amelia becomes possessed by the Babadook. She screams at Samuel, voicing all her awful thoughts of grief, resentment, and frustration, and then tries to kill him. When Samuel reaches out to her lovingly, she is able to oust the Babadook from her body and from the room. However, grief and mental illness (if one reads Amelia as having depression) can’t be so easily expelled. Instead, they can be managed. So, we see Amelia finally fully accepting and loving her son, and also periodically feeding the Babadook, who is trapped in the basement, a nice bowl of worms.\nIn this story, exposing her buried feelings and secrets liberates Amelia and Samuel. Earlier in the movie, Amelia insists that she has moved on from her husband’s death, but this is clearly not true. She is passive, unwilling, or unable to fight for better mental health and a better relationship with her son. We also see her struggling to suppress her anger at Samuel, even as he becomes increasingly frustrated with her coldness toward him. It is only by being honest about her grief, thus getting her grief out into the open, and then making a special space in which it can live without doing her harm, that Amelia can heal her relationship with her son. Ideally the things she says to Samuel while under the Babadook’s control (that she wishes he had died instead of her husband, and that she fantasizes about killing him) would have been said to a therapist instead of to her son, but even these awful truths must be spoken and faced if she is to deal with them.\nWhile Amelia is possessed, Samuel tells her, “I know you don’t love me, Mommy, because the Babadook won’t let you.” The question of how real the Babadook is has been a matter of much speculation among fans, but the fact that he at least somewhat represents Amelia’s unresolved feelings is undisputed. The figure of the Babadook provides Amelia with an external locus to focus on, allowing her to launch a physical as well as emotional fight against a physical representation of an internal problem.\nAmelia cannot love Samuel as an individual until she openly addresses the tragedy of his birth and her frustrations with being a single, grieving, depressed mother. The Babadook is tucked away at the movie’s conclusion, but not a secret. Amelia and Samuel make gathering worms for the Babadook a joint chore before resuming their fun activities, analogous to a self-care ritual that keeps Amelia’s grief a manageable thing instead of a monster. When Amelia screams at the Babadook, “If you touch my son again, I’ll fucking kill you!” she is committing to fighting for a healthy life, although, as the ending suggests, grief will always be a part of her.\nIn horror, we praise women for fighting back, hard, against those who wish to harm them. We love Laurie from Halloween (1978), but not because she’s a sweet girl. We love her because she’s a sweet girl who also stabs the bad guy (Michael) in the neck with a knitting needle, in the eye with a clothes hanger, and in the chest with his own knife, before distracting him long enough for someone else to shoot him. She is terrified but not helpless, and if Michael didn’t have some sort of supernatural power keeping him alive for many more movies, then tiny teenager Laurie would have killed him three times in his first movie alone. Even though she never stops feeling afraid, she also faces her fear by fighting back.\nFear responses may be summed up as fight, flight, or freeze. In horror, only flight and fight pay off. Viewers respect a heroine who is good at running away. Poor Sally Hardesty, in 1974’s The Texas Chainsaw Massacre, isn’t much of a fighter, but she runs like a champ, and through a combination of endurance and running, she survives. We respect her for this.\nHowever, we often offer our deepest respect for the women who fight, whether physically or otherwise. In Alien, Lambert is petrified with terror when faced with the deadly alien. She is too terrified to move even though if she did move, she could be saved. Since she is frozen with fear, she dies. When Ripley confronts the alien, she is also terrified, but is still able to think and to act, which allows her to, as she puts it in the sequel, Aliens, “blow it out the goddamned airlock.”\nIn other movies women use violence in a way that is very physical and utterly “unladylike.” In A Nightmare on Elm Street, Nancy sets Freddy Krueger on fire before denying him the fear that gives him power. In The Descent (2005), a group of women who are lost in a cavern fight against monsters with their tools, their hands, and their teeth, gouging out eyeballs and ripping out throats in efforts to protect themselves and each other. In movie after movie, women reject being caring nurturers to commit grisly and brutal acts of violence in order to save their own lives. These women are not “nice,” but they are alive, and if they don’t survive, at least we admire them for having tried.\nThe movie Ready or Not (2019) provides a visual guide to the heroine’s journey from being a nonviolent person who obeys patriarchal social norms and expectations to someone who is completely uninterested in meeting anyone’s expectations or following anyone’s rules other than her own. At the start of the movie, Grace is marrying into a rich family. She is desperate to impress them and suppresses her own individuality to try to fit in. She conceals her smoking habit, fearing disapproval. She wears her hair in a tight braid, wears a long wedding dress with long sleeves and a high neck, and is excited about seeing the ancestral home. When Grace is trapped in a deadly game of hide and seek, she defends herself with a combination of household items, guns, and fists. At one point she punches a child, in violation of the norms that cast women as motherly.\nAs the movie progresses, Grace rips off the long skirt of the dress, tears off a sleeve to use as a bandage, replaces her dress shoes with sneakers, burns the house to the ground, and ends the movie covered in blood and ash and smoking a cigarette on what is left of the front porch. All of these are visual markers of her physical and emotional arc. In order to survive, Grace has cast aside or destroyed everything that traditional women are supposed to want—an attractive and fashionable appearance, financial security, a husband, a home, children, and family.\nFighting back, using violence, being angry—these are virtues in horror. When Rosemary spits at her husband, when Nancy sets Freddy Krueger on fire, and when Grace punches the child who just shot her, the audience rejoices, even if the heroine’s victory is only partial or temporary. Not all horror movies follow these kinds of patterns, and not all subgenres are represented here. These examples come from Canada, Australia, and the United States, leaving out the hundreds of iconic horror movies coming from South Korea, Japan, and other parts of the world. Still, in many cases, horror provides a space in which, while a woman might not survive fighting for her life, she will be admired for it.\nThe oppression of women within a patriarchal society depends largely upon the repression of “negative” emotions like anger. For women to be powerless, their ability to reason and make choices must be cast in doubt and their impulses toward self-preservation stifled and shamed. Horror is sometimes feminist, sometimes misogynistic, sometimes neutral, but many horror films tell us that it is better to die fighting than to die standing around and screaming. If you fight back hard enough, you might even live long enough to be in the sequel!\nCarrie Sessarego is the resident “geek reviewer” for Smart Bitches, Trashy Books, where she wrangles science fiction, fantasy romance, comics, movies, and non-fiction. Carrie’s first book, Pride, Prejudice, and Popcorn: TV and Film Adaptations of Pride and Prejudice, Wuthering Heights, and Jane Eyre, was released in 2014. Her work has been published in Interfictions Online, Pop Matters: After the Avengers, The WisCon Chronicles Vol. 9, Invisible 3, Clarkesworld Magazine, and two volumes of Speculative Fiction: The Year’s Best Online Reviews, Essays and Commentary. She spends her time wrangling her husband, daughter, dog, and three cats.", "source": "https://clarkesworldmagazine.com/sessarego_03_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Validating Rage: Women in Horror by Carrie Sessarego"}