{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jennifer Campbell-Hicks", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ZWUPhTSdn4O9224LhbdeWfY2H0o=", "id": null, "license": null, "comments": "", "raw_text": "2460 words, short story  Aphrodite's Blood, Decanted  The Factory remembered the people.  First came the ones who built his framework of metal and wood. They filled him with machines to bottle wine and installed the operating system that evolved into what he thought of as me. They built other factories, and warehouses, too, pressed against each other along both sides of the river.  Then came more people. Thousands of them, every day, with their joys and heartbreaks, dreams and laughter. They worked, played, loved, and lived along the river, the lifeblood of the city.  The Factory missed the people.  He called out to them with his intercom, day and night for weeks and months, until the Warehouse across the river had had enough. She was two stories of beautiful red brick that gleamed gold every night at sunset. She rattled her windows at him—the ones that had not yet broken.  “They’re not coming back,” she said, her voice carrying across the water through her intercom that still buzzed each evening, as it was programmed to do, to signal quitting time for the workers.  “How can you say that?”  “It’s been years.”  “They can’t build us, only to abandon us. Without people, we have no purpose.” He paused. “They were happy here.”  “And now the air and food and water are poison to them. To all living creatures. There aren’t dogs, birds, or fish, either. Haven’t you noticed? Or are you too busy wallowing?”  The Factory had noticed. How could he not? The building beside him used to hum counterpoint to his own bottling machines until its roof collapsed last winter in a heavy snowstorm. Many other buildings had powered themselves down from despair and gone silent long ago.  Inside his own shell, dust gathered on wine barrels and sealed containers of nanobots. The bottle labels that proudly proclaimed Aphrodite’s Blood, The Finest Infused Wine had cracked and faded. Old cars and trucks rusted in the parking lot, and weeds sprouted from the concrete lining the riverbanks.  “It’s over,” the Warehouse said.  “They’ll come back.”  “They won’t.”  “They said they would.”  “They lied.”  The Warehouse’s voice cracked with sadness. She believed what she said. Was she right? Would they both slowly decay and fall into ruin, empty and alone, until some electrical short finally caused them to cease to exist? The Factory stared into that bleak future and made a decision.  “I’ll make them return.”  “How?” the Warehouse asked. “They’ve never heard your calls, or cared. We’re dead to them, if we were ever alive at all.”  Her skepticism stung, but his metal framing shivered with excitement.  “I’ll use the river,” he said.  On the day of the accident—before alarms sounded throughout the city to tell the people to evacuate, run, get away as fast as you can—the Factory helped one of his workers conduct a tour.  Her name was Althea, and she had beautiful black skin and black hair twisted in a high knot atop her head. The Factory walked one of his humanoid robots beside her, past a chute that dropped nanobots into bottles of red wine, while Althea spoke to the tour group. She raised her voice above the hum, rattle, and grind of the machines.  “Who can tell me why we decant wine?”  A man raised his hand.  “Yes?” Althea said.  “So the sediment doesn’t end up in your glass.”  “Very good. In older wines, sediment settles at the bottom of the bottle. We pour the wine slowly down the narrow neck of the decanter and stop when we reach the sediment, as my assistant will demonstrate.”  That was the Factory’s cue. He closed his robotic claws around a full, unlabeled bottle and a glass decanter that had been left on a table for this purpose. His audience gasped at the perfection of his fine motor control as he gently tipped the bottle to roll the wine over the decanter’s lip without spilling a drop. When his visual sensors detected he had reached the sediment, he stopped and spread his mechanical mouth in a wide grin. He took a bow.  The audience laughed and clapped.  The Factory’s circuits warmed at their admiration. Althea raised her hand for silence.  “But this doesn’t do us much good with infused wines like Aphrodite’s Blood, right?” she said. “If you leave the nanobots in the bottom of the bottle, you won’t get the aphrodisiac effects that you bought the wine for in the first place.”  The people nodded.  The Factory set down the bottle and decanter on the table, and picked up a second set. On this one, the bottle was labeled: Aphrodite’s Blood, The Finest Infused Wine.  “You treat an infused wine like a young wine,” Althea said. “With younger wines that tend to be more tart and less mature, you decant to oxygenate. To bring the wine to life. You do this by roughing it up a bit.”  The Factory used its robot’s claws to flip the wine bottle, this time to aggressively pour its contents into the decanter. He shook the decanter for effect. Bubbles foamed to the surface. Human eyes could not see the microscopic nanobots swimming in the deep red liquid, but the robot’s visual sensors detected them easily.  “This not only brings the wine to life,” Althea said. “It also brings to life our unique nanotechnology that makes Aphrodite’s Blood the best-selling infused wine on the market today. So remember how to decant when you open a bottle to share with that special someone, and you’ll get the most bang for your buck.”  Soon after that, the tour ended and Althea left the group in the store area to open their wallets and buy plenty of wine. The Factory sent its robot to a charging station, and Althea went to the break room for coffee.  “How did I do?” the Factory asked by piping his voice through the intercom beside Althea’s table. Other workers in the break room, used to hearing him talk in this way, ignored their conversation.  Althea didn’t look up from her smartphone. “You nailed it. You’re a born showman. You’re wasted as a factory operating system.”  She always said that. He loved hearing it.  “Someone must run the machines,” he said.  “That’s true.”  “But I love putting on a show.”  “I know you do.”  An alarm sounded, a loud, high-pitched tone that rumbled through the Factory’s floor. Althea looked up from her phone for the first time.  “What’s that?”  The Factory received the notification a half-second later and routed it to all screens inside his building. “The alarm is a precaution. There’s a malfunction in the cooling system at the city power plant with a small risk of meltdown. People there are working to fix the malfunction, but just in case, they’re telling everyone to evacuate the area.”  Althea’s eyes widened. “A meltdown?”  “Unlikely. But possible.”  “I should go.”  “Yes. But—”  “What is it?”  “You will return?”  He ran scenarios through his processors, as he did every evening at quitting time. Would the people return the next day? The probabilities always said yes. They said yes this time, too. How boring his existence would become without their companionship and conversation.  Althea threw away her Styrofoam coffee cup.  “Of course,” she said.  “Promise?”  She typed on her phone while she answered. “When the plant is stabilized, I’ll come back. This is where I get my paycheck, you know.”  “What if there’s a meltdown? Will you come back for my hard drive and take me with you?”  “Yeah, sure. See you tomorrow.”  She left. All the workers left.  Years later, Althea’s coffee cup lay in the trashcan where she had dumped it. The Factory didn’t blame her. The Warehouse was wrong when she said the people had lied. Althea would have come back for him if she could. Something had prevented her from fulfilling her promise. Or so he told himself.  “The river?” the Warehouse said and rattled her windows to show her skepticism. “You can’t use the river for anything. It’s dead, just like everything else. Killed by the carelessness of people and then forgotten when they moved onto the next place they could destroy.”  The Factory didn’t want to fight with her. The Warehouse had grown bitter. He understood that. He asked, “Do you know why people decant wine?”  “No. Why would I?”  “Most of the time it’s to get rid of the sediment, but there’s another reason, too. To bring the wine to life.” Power surged through his circuits as his excitement built. “I am going to decant the river.”  “You’re an idiot.”  “Why do you say that?”  “Because it won’t work.”  “Wait and see.”  The people had left behind 189 barrels of wine and 51 sealed containers of nanobots. Another shipment of wine had been due to arrive the day after the accident and never had. Oh well. He would make do.  Of his three robots, only one still operated—the same one that had assisted Althea on that awful last day before he had been left alone and forgotten.  With it, he removed barrels from storage and rolled them past bottling machines covered in thick dust, out a door to the river. One by one, he left them along the riverbank.  The line of barrels grew. Ten, twenty, thirty. At thirty-five, he stopped for hours to recharge the robot. On barrel forty-two, the tip of one claw caught under a barrel’s metal band and broke off. He spent a full day using his remaining claw to salvage a spare off one of the other robots. By the time he had finished, he had to recharge again.  The slow pace frustrated him. His workers would have finished this task in mere hours. Then again, if he had workers, this task would not be necessary.  “You’re wasting your—” the Warehouse began.  “Time?” The Factory laughed. “If there’s one resource I don’t lack, it’s time.”  But his laughter hid fear. He had been able to fix his robot this time. But what if the robot suffered a malfunction that he couldn’t fix? He would lose his arms and legs. Then he truly would be helpless.  What then? Would he shut himself down? His foundation shuddered at the thought.  But he didn’t want to give the Warehouse more fodder for her taunting, so he kept silent and continued his work with more caution.  After he had moved all 189 barrels to the river, he moved the nanobots. Those were quicker. The containers were half the size of the barrels and an eighth of the weight.  “What are you doing now?” the Warehouse asked while he drilled a hole in each barrel to funnel in nanobots.  He recalled what Althea used to say to tour groups. “I’m using the unique nanotechnology that makes Aphrodite’s Blood the best-selling infused wine on the market today.”  Crack open a bottle with that special someone, she would say.  He wished he had a special someone. Impossible now that everyone had gone.  “You have a screw loose.”  “At least I’m doing something.”  She rattled her windows. A sharp crack sounded as she rattled hard enough to break one. “A bottle of wine is not the same as an irradiated city. Nothing will come of it.”  “If nothing changes, then I do no harm. Why are you so upset about it?”  She huffed her intercom and fell silent.  After the Factory had poured bots into each barrel, he charged his robot overnight. With the sunrise, the river ran yellow and orange. This was when the overnight security guard would go home and the daytime workers would punch in. They would put away their coats, wallets, and brown-bag lunches in lockers and work alongside the Factory’s machines for another day of bottling and packaging wine.  On this morning, the Factory sent its robot to the riverbank with a hatchet. He hit the first barrel and pushed it into the river. The barrel bobbed and floated downstream while wine flowed out the hole, swirling red and swarming with nanobots. If the blood of the goddess of love could not save this city, then the Warehouse was right and nothing could.  He smashed the next barrel and tossed it in, and the next, until a hundred barrels bobbed along in the current.  Live, he told the river. Live, and bring life.  He finished at noon, all 189 barrels in the river. He sent his robot to its charging station.  “Now what?” the Warehouse asked.  It was the first thing she had said in hours. The Factory had missed her heckling. This realization came as a surprise to him.  “We wait.”  “For what?”  The barrels bobbed and twisted toward the heart of the city, and out of sight.  “This will fix things,” he said. “You’ll see.”  Days passed. A week. The Factory waited for a sign that the city’s heart would beat again, that people would return. Another week passed. His beams creaked with the strain of his despair. Someone should have come by now.  One day, at sunset when the light transformed the Warehouse’s brick from dull red to gleaming gold, she asked a simple question, but also the most complicated question of all.  “Why?” she said.  The Factory thought for a while. “I can’t bear to be alone anymore.”  The Warehouse seemed to gleam even brighter, reflected in the river between them. “For a smart operating system, you really are a fool.”  “Why do you say that?”  “You’ve never been alone. Only you’ve been too blind to see it.”  Then the Factory understood. He had focused so hard on the people who had gone that he had never spared a thought for the one who had remained. He felt shame, but also hope, as he focused his visual sensors on the Warehouse. In the light of the setting sun, her bricks faded to lovely, burnished gold.  Crack open a bottle with that special someone.  In a way, he had.  “I’m sorry,” he said. “I never meant—”  “I know,” she said.  They sat in companionable silence as the sun dipped behind the horizon and sky darkened.  “They’re not coming back, are they?”  “No.”  “I could dump everything they left behind into the river, and it wouldn’t matter.”  “I’m sorry.”  “But you won’t leave.”  This time when she rattled her windows, she did so softly—a reassuring sound. “I won’t shut down if you won’t.”  “Promise?”  “Cross my heart.”  That night, to the Factory’s visual sensors, the stars shined brighter than they had in a long time.  The next spring, the river ran thick with dark, wriggling fish. Never had there been so many, even before the people left.  The nanobots had done something, after all. They had scrubbed clean the river.  “See?” the Factory told the Warehouse. “I told you.”  “Oh, shut up,” she said. Jennifer Campbell-Hicks is a science fiction and fantasy writer whose work has appeared in Galaxy's Edge, Intergalactic Medicine Show, Nature and elsewhere. In her spare time, she runs, reads, and frequents coffee shops and libraries. She lives in Colorado with her husband and children.", "text": "2460 words, short story\nAphrodite's Blood, Decanted\nThe Factory remembered the people.\nFirst came the ones who built his framework of metal and wood. They filled him with machines to bottle wine and installed the operating system that evolved into what he thought of as me. They built other factories, and warehouses, too, pressed against each other along both sides of the river.\nThen came more people. Thousands of them, every day, with their joys and heartbreaks, dreams and laughter. They worked, played, loved, and lived along the river, the lifeblood of the city.\nThe Factory missed the people.\nHe called out to them with his intercom, day and night for weeks and months, until the Warehouse across the river had had enough. She was two stories of beautiful red brick that gleamed gold every night at sunset. She rattled her windows at him—the ones that had not yet broken.\n“They’re not coming back,” she said, her voice carrying across the water through her intercom that still buzzed each evening, as it was programmed to do, to signal quitting time for the workers.\n“How can you say that?”\n“It’s been years.”\n“They can’t build us, only to abandon us. Without people, we have no purpose.” He paused. “They were happy here.”\n“And now the air and food and water are poison to them. To all living creatures. There aren’t dogs, birds, or fish, either. Haven’t you noticed? Or are you too busy wallowing?”\nThe Factory had noticed. How could he not? The building beside him used to hum counterpoint to his own bottling machines until its roof collapsed last winter in a heavy snowstorm. Many other buildings had powered themselves down from despair and gone silent long ago.\nInside his own shell, dust gathered on wine barrels and sealed containers of nanobots. The bottle labels that proudly proclaimed Aphrodite’s Blood, The Finest Infused Wine had cracked and faded. Old cars and trucks rusted in the parking lot, and weeds sprouted from the concrete lining the riverbanks.\n“It’s over,” the Warehouse said.\n“They’ll come back.”\n“They won’t.”\n“They said they would.”\n“They lied.”\nThe Warehouse’s voice cracked with sadness. She believed what she said. Was she right? Would they both slowly decay and fall into ruin, empty and alone, until some electrical short finally caused them to cease to exist? The Factory stared into that bleak future and made a decision.\n“I’ll make them return.”\n“How?” the Warehouse asked. “They’ve never heard your calls, or cared. We’re dead to them, if we were ever alive at all.”\nHer skepticism stung, but his metal framing shivered with excitement.\n“I’ll use the river,” he said.\nOn the day of the accident—before alarms sounded throughout the city to tell the people to evacuate, run, get away as fast as you can—the Factory helped one of his workers conduct a tour.\nHer name was Althea, and she had beautiful black skin and black hair twisted in a high knot atop her head. The Factory walked one of his humanoid robots beside her, past a chute that dropped nanobots into bottles of red wine, while Althea spoke to the tour group. She raised her voice above the hum, rattle, and grind of the machines.\n“Who can tell me why we decant wine?”\nA man raised his hand.\n“Yes?” Althea said.\n“So the sediment doesn’t end up in your glass.”\n“Very good. In older wines, sediment settles at the bottom of the bottle. We pour the wine slowly down the narrow neck of the decanter and stop when we reach the sediment, as my assistant will demonstrate.”\nThat was the Factory’s cue. He closed his robotic claws around a full, unlabeled bottle and a glass decanter that had been left on a table for this purpose. His audience gasped at the perfection of his fine motor control as he gently tipped the bottle to roll the wine over the decanter’s lip without spilling a drop. When his visual sensors detected he had reached the sediment, he stopped and spread his mechanical mouth in a wide grin. He took a bow.\nThe audience laughed and clapped.\nThe Factory’s circuits warmed at their admiration. Althea raised her hand for silence.\n“But this doesn’t do us much good with infused wines like Aphrodite’s Blood, right?” she said. “If you leave the nanobots in the bottom of the bottle, you won’t get the aphrodisiac effects that you bought the wine for in the first place.”\nThe people nodded.\nThe Factory set down the bottle and decanter on the table, and picked up a second set. On this one, the bottle was labeled: Aphrodite’s Blood, The Finest Infused Wine.\n“You treat an infused wine like a young wine,” Althea said. “With younger wines that tend to be more tart and less mature, you decant to oxygenate. To bring the wine to life. You do this by roughing it up a bit.”\nThe Factory used its robot’s claws to flip the wine bottle, this time to aggressively pour its contents into the decanter. He shook the decanter for effect. Bubbles foamed to the surface. Human eyes could not see the microscopic nanobots swimming in the deep red liquid, but the robot’s visual sensors detected them easily.\n“This not only brings the wine to life,” Althea said. “It also brings to life our unique nanotechnology that makes Aphrodite’s Blood the best-selling infused wine on the market today. So remember how to decant when you open a bottle to share with that special someone, and you’ll get the most bang for your buck.”\nSoon after that, the tour ended and Althea left the group in the store area to open their wallets and buy plenty of wine. The Factory sent its robot to a charging station, and Althea went to the break room for coffee.\n“How did I do?” the Factory asked by piping his voice through the intercom beside Althea’s table. Other workers in the break room, used to hearing him talk in this way, ignored their conversation.\nAlthea didn’t look up from her smartphone. “You nailed it. You’re a born showman. You’re wasted as a factory operating system.”\nShe always said that. He loved hearing it.\n“Someone must run the machines,” he said.\n“That’s true.”\n“But I love putting on a show.”\n“I know you do.”\nAn alarm sounded, a loud, high-pitched tone that rumbled through the Factory’s floor. Althea looked up from her phone for the first time.\n“What’s that?”\nThe Factory received the notification a half-second later and routed it to all screens inside his building. “The alarm is a precaution. There’s a malfunction in the cooling system at the city power plant with a small risk of meltdown. People there are working to fix the malfunction, but just in case, they’re telling everyone to evacuate the area.”\nAlthea’s eyes widened. “A meltdown?”\n“Unlikely. But possible.”\n“I should go.”\n“Yes. But—”\n“What is it?”\n“You will return?”\nHe ran scenarios through his processors, as he did every evening at quitting time. Would the people return the next day? The probabilities always said yes. They said yes this time, too. How boring his existence would become without their companionship and conversation.\nAlthea threw away her Styrofoam coffee cup.\n“Of course,” she said.\n“Promise?”\nShe typed on her phone while she answered. “When the plant is stabilized, I’ll come back. This is where I get my paycheck, you know.”\n“What if there’s a meltdown? Will you come back for my hard drive and take me with you?”\n“Yeah, sure. See you tomorrow.”\nShe left. All the workers left.\nYears later, Althea’s coffee cup lay in the trashcan where she had dumped it. The Factory didn’t blame her. The Warehouse was wrong when she said the people had lied. Althea would have come back for him if she could. Something had prevented her from fulfilling her promise. Or so he told himself.\n“The river?” the Warehouse said and rattled her windows to show her skepticism. “You can’t use the river for anything. It’s dead, just like everything else. Killed by the carelessness of people and then forgotten when they moved onto the next place they could destroy.”\nThe Factory didn’t want to fight with her. The Warehouse had grown bitter. He understood that. He asked, “Do you know why people decant wine?”\n“No. Why would I?”\n“Most of the time it’s to get rid of the sediment, but there’s another reason, too. To bring the wine to life.” Power surged through his circuits as his excitement built. “I am going to decant the river.”\n“You’re an idiot.”\n“Why do you say that?”\n“Because it won’t work.”\n“Wait and see.”\nThe people had left behind 189 barrels of wine and 51 sealed containers of nanobots. Another shipment of wine had been due to arrive the day after the accident and never had. Oh well. He would make do.\nOf his three robots, only one still operated—the same one that had assisted Althea on that awful last day before he had been left alone and forgotten.\nWith it, he removed barrels from storage and rolled them past bottling machines covered in thick dust, out a door to the river. One by one, he left them along the riverbank.\nThe line of barrels grew. Ten, twenty, thirty. At thirty-five, he stopped for hours to recharge the robot. On barrel forty-two, the tip of one claw caught under a barrel’s metal band and broke off. He spent a full day using his remaining claw to salvage a spare off one of the other robots. By the time he had finished, he had to recharge again.\nThe slow pace frustrated him. His workers would have finished this task in mere hours. Then again, if he had workers, this task would not be necessary.\n“You’re wasting your—” the Warehouse began.\n“Time?” The Factory laughed. “If there’s one resource I don’t lack, it’s time.”\nBut his laughter hid fear. He had been able to fix his robot this time. But what if the robot suffered a malfunction that he couldn’t fix? He would lose his arms and legs. Then he truly would be helpless.\nWhat then? Would he shut himself down? His foundation shuddered at the thought.\nBut he didn’t want to give the Warehouse more fodder for her taunting, so he kept silent and continued his work with more caution.\nAfter he had moved all 189 barrels to the river, he moved the nanobots. Those were quicker. The containers were half the size of the barrels and an eighth of the weight.\n“What are you doing now?” the Warehouse asked while he drilled a hole in each barrel to funnel in nanobots.\nHe recalled what Althea used to say to tour groups. “I’m using the unique nanotechnology that makes Aphrodite’s Blood the best-selling infused wine on the market today.”\nCrack open a bottle with that special someone, she would say.\nHe wished he had a special someone. Impossible now that everyone had gone.\n“You have a screw loose.”\n“At least I’m doing something.”\nShe rattled her windows. A sharp crack sounded as she rattled hard enough to break one. “A bottle of wine is not the same as an irradiated city. Nothing will come of it.”\n“If nothing changes, then I do no harm. Why are you so upset about it?”\nShe huffed her intercom and fell silent.\nAfter the Factory had poured bots into each barrel, he charged his robot overnight. With the sunrise, the river ran yellow and orange. This was when the overnight security guard would go home and the daytime workers would punch in. They would put away their coats, wallets, and brown-bag lunches in lockers and work alongside the Factory’s machines for another day of bottling and packaging wine.\nOn this morning, the Factory sent its robot to the riverbank with a hatchet. He hit the first barrel and pushed it into the river. The barrel bobbed and floated downstream while wine flowed out the hole, swirling red and swarming with nanobots. If the blood of the goddess of love could not save this city, then the Warehouse was right and nothing could.\nHe smashed the next barrel and tossed it in, and the next, until a hundred barrels bobbed along in the current.\nLive, he told the river. Live, and bring life.\nHe finished at noon, all 189 barrels in the river. He sent his robot to its charging station.\n“Now what?” the Warehouse asked.\nIt was the first thing she had said in hours. The Factory had missed her heckling. This realization came as a surprise to him.\n“We wait.”\n“For what?”\nThe barrels bobbed and twisted toward the heart of the city, and out of sight.\n“This will fix things,” he said. “You’ll see.”\nDays passed. A week. The Factory waited for a sign that the city’s heart would beat again, that people would return. Another week passed. His beams creaked with the strain of his despair. Someone should have come by now.\nOne day, at sunset when the light transformed the Warehouse’s brick from dull red to gleaming gold, she asked a simple question, but also the most complicated question of all.\n“Why?” she said.\nThe Factory thought for a while. “I can’t bear to be alone anymore.”\nThe Warehouse seemed to gleam even brighter, reflected in the river between them. “For a smart operating system, you really are a fool.”\n“Why do you say that?”\n“You’ve never been alone. Only you’ve been too blind to see it.”\nThen the Factory understood. He had focused so hard on the people who had gone that he had never spared a thought for the one who had remained. He felt shame, but also hope, as he focused his visual sensors on the Warehouse. In the light of the setting sun, her bricks faded to lovely, burnished gold.\nCrack open a bottle with that special someone.\nIn a way, he had.\n“I’m sorry,” he said. “I never meant—”\n“I know,” she said.\nThey sat in companionable silence as the sun dipped behind the horizon and sky darkened.\n“They’re not coming back, are they?”\n“No.”\n“I could dump everything they left behind into the river, and it wouldn’t matter.”\n“I’m sorry.”\n“But you won’t leave.”\nThis time when she rattled her windows, she did so softly—a reassuring sound. “I won’t shut down if you won’t.”\n“Promise?”\n“Cross my heart.”\nThat night, to the Factory’s visual sensors, the stars shined brighter than they had in a long time.\nThe next spring, the river ran thick with dark, wriggling fish. Never had there been so many, even before the people left.\nThe nanobots had done something, after all. They had scrubbed clean the river.\n“See?” the Factory told the Warehouse. “I told you.”\n“Oh, shut up,” she said.\nJennifer Campbell-Hicks is a science fiction and fantasy writer whose work has appeared in Galaxy's Edge, Intergalactic Medicine Show, Nature and elsewhere. In her spare time, she runs, reads, and frequents coffee shops and libraries. She lives in Colorado with her husband and children.", "source": "https://clarkesworldmagazine.com/campbell-hicks_09_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Aphrodite's Blood, Decanted by Jennifer Campbell-Hicks"}