{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Anna Martino", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "p40l8zdVotJPEwmo3z/SxcyukjM=", "id": null, "license": null, "comments": "", "raw_text": "2480 words, short story  This Stitch, This Time  What do you mean, Why didn’t I warn them before?  Are you serious? I did!  Answer me this if you are so smart. If you had seen it, what would you have done?  It all began with a scrap of fabric I used to test the machine’s tension. Over and over and over, white cotton thread over navy blue twill, the same line of bumps and stitches. I didn’t know it was Morse code until Jean pointed it out. It went like this, let me write it down for you:  -.-. .- .-. .- / -- .. .- --..-- / - .... .. ... / -- .. ... ... .. --- -. / .. ... / .-. ..- .. -. . -.. .-.-.- / .-. ..- -. / .-- .... .. .-.. . / -.-- --- ..- / -.-. .- -.  I just thought someone had tampered with my sewing machine. It wouldn’t be the first time—those engineers laughed at my hobby all the time, and they loved to commit elaborate pranks against my private possessions. I could take those, instead of the constant harassment I had to hear: There she goes, the little seamstress. Can you fix the crotch of my trousers? Let me just take them out . . .  I’m not happy they ended up like that, but there are days I wonder if that wasn’t poetic justice. It was their fault, too. They knew and did nothing.  But that’s another kettle of fish altogether. Back to the story: I knew Jean was having a bad time at the barracks, too. He was the youngest of the engineering set, the one sent for the most menial jobs and excluded from the fun parts—if you found the idea of sending civilians to Mars “fun.” He and I were the same under the eyes of the big guns: expendable parts, though it’s hard to find good spaceship engineers and, in my case, good space suit seamstresses. No wonder we stuck together, despite the age difference and language barrier.  He decoded the bumps my ancient sewing machine had produced. “Cara Mia, this mission is doomed. Run while you can. Who is this Mia?”  “It isn’t a name. It’s an endearment. Like ma puce or my dear.”  And I haven’t heard that one in give or take twelve years.  My grandmother was a lingerie seamstress. She knew all about elastic fabrics and about paying attention to minute details. That was why the Space Agency had picked her up when they needed help with the first space suits. Neil Armstrong walked on the Moon because a specialist in bras hand-stitched the hem of his bright white jumpsuit. And I became a space suit designer because a specialist in bras made Neil Armstrong’s suit. It’s a family tradition.  Here’s the thing, though: my grandmother never used “Cara Mia” as an endearment, more like a warning: Cara Mia, your dad won’t like that stud in your nose. Cara Mia, if you want to get out of this place, you’d better study harder or marry rich. Cara Mia, that boy is going to be the end of you.  In short, “Cara Mia” meant trouble, and I didn’t want trouble at work. That mission was my golden ticket, the dream of every specialist in the field. I gave up a lot to be here, and an old machine I brought with me for the sake of the home comforts wouldn’t ruin this.  So I oiled the moving parts; I changed the needles, the sewing feet, the sewing plate, the bobbin and the shuttle, and nothing worked. I changed the goddamned motor, but it didn’t matter what I did, no matter what I put together or put apart, the machine still stitched Cara Mia, the mission is doomed.  “Don’t bloody ‘Cara Mia’ me, grandma!” I screamed into the air-conditioned void, only to regret it. What if someone heard me? (What I actually thought: what if this apparition claiming to be my grandmother exploded my sewing machine out of spite?) “Now, why is the mission doomed? It’s dangerous, yes, but . . . You made those first space suits, didn’t you? Those men could have died on their way to the Moon. Did that stop you? Answer me, what’s the problem?”  I hit the pedal and let the shuttle fly away. Dot after dash and dash after dot it went until it ran out of fabric. When you make something bespoke, you cannot cut corners. They are cutting corners. Run while you can.  Now, see through my point of view. Why would the top brass believe me? I don’t understand about spaceship building, I’m just a woman putting scraps together to make fancy jumpsuits. They’d say I’m insane and hire someone else for the work. And I thought about Jean, of course. He didn’t deserve to die like that. No one did. Two hundred people on that blasted unit alone, and all the others I didn’t know. If they are cutting corners, were they all doomed? Could I save them?  I should have run another line of stitching. I should have asked for more. But I turned off the machine and ran away from the room.  If you were there, you’d have done the same.  Wouldn’t you?  I kept away from my machine and concentrated on the work on the space suits and uniforms. I worked in the electronic machines from the compound, those soulless pieces of crap. All smart textiles and precise measurements. Not an inch to be wasted—the work I was being handsomely paid to do without a question. The measurements came over the email and I made my magic without meeting the strangers who would colonize the Red Planet for us.  And all the while I heard the same scream at the back of my head: Cara Mia, run while you can.  Could you pretend all was normal? Was I making funeral shrouds for civilians dreaming of Mars? My old machine wouldn’t answer that, only told me to run away every time I asked it. Typical for my grandmother: screw the others, save your own skin. She survived two world wars being this self-absorbed, but this time around I couldn’t afford the same callousness. Could you afford it, even if the price was never to get to Mars?  When Jean showed up at my room again, with the haggard face of those who carry the weight of the world on their shoulders, I knew things were turning for the worse.  Part of me wanted to lie, if only to save him. Tell him the machine broke down. I chose the truth instead, and this damned us all.  I never asked Jean what the French used to talk to their dead. That old-fashioned sewing machine, all seaweed green plastic and kitschy flower décor, wasn’t what I would have imagined as an instrument to talk to the dead, either. I should have told him that. “Was this your grandmother’s?”  “No, it’s my mother’s. Grandma would never own such a civilian machine.” I had to add, “There’s a difference between your professional screwdrivers and the ones I could buy at the hardware store, isn’t it? Same with me.”  “Oh, well. You live and learn.” Jean tried to laugh, but he was in knots as he turned to the machine, trembling as he spoke with deep respect. “Madame, I am sorry to disturb you, but they say the departed can see more than anyone. You have seen something I didn’t. Please advise me. Am I wrong to be worried? Do you have any counsel?” He turned to me with a serious expression. “Do I have to press the pedal or you do?”  “Dunno—it’s the first time I’m doing this. Here, sit down, let me show how it’s done . . . You should hold the fabric like this . . . Put down the foot . . . Good. Now press the pedal gently. Like you would with a car.”  If it were a car, Jean would have crashed it on the nearest wall: he pressed the pedal too fast and the machine almost jumped out of the table. Still, the message came across, and as he read it, his face went aflame. “Oh, Vera. I wish . . . Well. That’s enough information for me,” he said.  “Please tell me what happened.”  “How do I explain it? It’s like the . . . Like the lining of a coat, I think? On a good coat, the lining holds the stuffing together, yes? They are not putting the lining everywhere. I think they could get away with it. They wouldn’t risk . . . I mean . . . There’s always a risk, but . . . ” He looked at the machine again, his heart in his mouth. “Do you think we can save them? If I talk to the bosses, if I explain the situation, can we save them?”  This time, I operated the sewing machine. The phrase came by, Jean read it and ran away.  Later, I decoded the phrase by myself. They have mocked your concerns, and yet you worry about them? Let them burn, for this hell is of their own making.  The following morning, I found a top of the range electronic sewing machine at my office, substituting my old heirloom. They also informed me that Ensign Jean took a leave of absence for medical reasons. The CCTV cameras appeared on the following morning, for security reasons.  You see where this is going, right?  The new machine didn’t jump and didn’t spurt—it was as if they had gifted me a sewing robot. I tried to call my grandmother back, but either she refused to show up in such a complex machinery or . . .  Or else she abandoned me. It wouldn’t be the first time.  But I couldn’t abandon them. I couldn’t abandon Jean. So I turned to the CCTV cameras and said, loud and clear, “I want my machine back.”  And didn’t sew a single stitch of their space suits until they heard me.  They docked my payment. They called in a doctor to assess my sanity. They called in another garment specialist, who only stayed a week before the electronic machines spurted Morse coded stitches over the smart fabrics. By then, the entire compound knew what was going on—how could they not know? First Jean, then me, then the new specialist, and now the Morse code took over every piece of machinery in the place, from the humble coffee maker to the biggest computers in the room—all of them going run while you can and I demand to talk to Vera.  Two weeks later, I saw myself alone in front of the military officers.  Over the immense mahogany table that separated us, there was my old sewing machine and a bolt of black cotton fabric. Around it, all the engineers and the commanders staring at me tried their best to look nonplussed by the situation—but it was clear they were running out of time and out of patience.  You should have seen it: thirteen men, afraid of a green and white sewing machine. This comforts me now.  “You understand this meeting is confidential,” said the eldest of the commanders. A rhetorical question, if there was ever one. “Make this work.”  Ten engineers in the room, and nobody knew how to operate a sewing machine?  No, dear. They hired someone else to do it, then another person, and then another. When the results remained the same, they had to see me doing it.  I threaded the machine and ripped a piece of fabric. Grandma, I cannot leave them to die, I thought as the bobbin shook inside the shuttle and the dots and dashes showed up, white on black. Say something they will believe in.  One commander picked up the piece of fabric as soon as I finished. “It matches the other message,” he said to his companions, showing them the scrap. “The numbers are the same.”  “I cannot stop the launch because of a sewing machine spouting nonsense. First the ‘I demand to talk to Vera’ and now these silly coded numbers?”  “Silly coded numbers that match the parts that need attention. Jean had the correct information about your shortcuts.”  “They are not shortcuts, damn it! We checked everything. This is just a ridiculous, broken machine. She probably rigged it up for a lark. Didn’t you, girl? You did rig this up. You wanted to scare the engineers because they were mean to you, and you drove the poor ensign insane. Do you know that? You drove him mad.”  “Are you cutting corners?” I had to ask. I wanted to defend myself, my grandmother, maybe Jean. The machine wasn’t the problem; it had been the work that drove him mad. Dear Jean, who wanted to do the right thing: I owed him this much. If I caused his death or his madness, I owed him some rest.  “We are making the best we can with the money we have.”  “That’s not what I asked. Are you cutting corners?”  “You are dismissed,” the commander said.  “Are you cutting corners?”  “Take her away! Now!”  “Are you cutting corners? You’ll kill them all! Don’t you understand you will kill them?”  That’s what landed me here. They couldn’t explain it, so they blamed it on the witch. Best to pretend I was mad, and that I rigged the compound’s machines to spit out Morse coded voodoo.  The message Jean had read? Here, see it yourself: I kept it when they locked me up. There’s your truth, my dear, all written in white thread over the blue twill: all the places with weak points in the spaceship, the codes for the parts where they used second-class material. The same places that caused the explosion when they launched the rocket into the atmosphere.  So much for economy, huh? In the end, they were all expendable, like me. Who’d thought?  The prison ward allowed me to use their sewing machines the other day. They wanted to see if the trick would happen again, now that the spaceship exploded like I said it would. You know what I got? Here it is:  .. / ..-. --- .-. --. .. ...- . / -.-- --- ..-  Did you translate it?  It reads I forgive you.  Is it my grandmother? Jean? One astronaut wearing my space suit?  They can forgive me all they like: they are all dead, and this is a sentence I cannot unpick. What was the use of knowing the future, if the future was this cloister room and those white, burning clouds in the sky? What’s the use of knowing things if you cannot alter them?  Now, tell me what would you do. I’d like to hear it. Anna Martino is a Brazilian SFF writer and editor, publishing in English and Portuguese since 2013. Her work in English was featured in magazines such as Strange Horizons, Hexagon, Luna Station Quarterly, and Translunar Travellers Lounge, and was also performed at BBC World Radio. She lives in São Paulo with her husband and son.", "text": "2480 words, short story\nThis Stitch, This Time\nWhat do you mean, Why didn’t I warn them before?\nAre you serious? I did!\nAnswer me this if you are so smart. If you had seen it, what would you have done?\nIt all began with a scrap of fabric I used to test the machine’s tension. Over and over and over, white cotton thread over navy blue twill, the same line of bumps and stitches. I didn’t know it was Morse code until Jean pointed it out. It went like this, let me write it down for you:\n-.-. .- .-. .- / -- .. .- --..-- / - .... .. ... / -- .. ... ... .. --- -. / .. ... / .-. ..- .. -. . -.. .-.-.- / .-. ..- -. / .-- .... .. .-.. . / -.-- --- ..- / -.-. .- -.\nI just thought someone had tampered with my sewing machine. It wouldn’t be the first time—those engineers laughed at my hobby all the time, and they loved to commit elaborate pranks against my private possessions. I could take those, instead of the constant harassment I had to hear: There she goes, the little seamstress. Can you fix the crotch of my trousers? Let me just take them out . . .\nI’m not happy they ended up like that, but there are days I wonder if that wasn’t poetic justice. It was their fault, too. They knew and did nothing.\nBut that’s another kettle of fish altogether. Back to the story: I knew Jean was having a bad time at the barracks, too. He was the youngest of the engineering set, the one sent for the most menial jobs and excluded from the fun parts—if you found the idea of sending civilians to Mars “fun.” He and I were the same under the eyes of the big guns: expendable parts, though it’s hard to find good spaceship engineers and, in my case, good space suit seamstresses. No wonder we stuck together, despite the age difference and language barrier.\nHe decoded the bumps my ancient sewing machine had produced. “Cara Mia, this mission is doomed. Run while you can. Who is this Mia?”\n“It isn’t a name. It’s an endearment. Like ma puce or my dear.”\nAnd I haven’t heard that one in give or take twelve years.\nMy grandmother was a lingerie seamstress. She knew all about elastic fabrics and about paying attention to minute details. That was why the Space Agency had picked her up when they needed help with the first space suits. Neil Armstrong walked on the Moon because a specialist in bras hand-stitched the hem of his bright white jumpsuit. And I became a space suit designer because a specialist in bras made Neil Armstrong’s suit. It’s a family tradition.\nHere’s the thing, though: my grandmother never used “Cara Mia” as an endearment, more like a warning: Cara Mia, your dad won’t like that stud in your nose. Cara Mia, if you want to get out of this place, you’d better study harder or marry rich. Cara Mia, that boy is going to be the end of you.\nIn short, “Cara Mia” meant trouble, and I didn’t want trouble at work. That mission was my golden ticket, the dream of every specialist in the field. I gave up a lot to be here, and an old machine I brought with me for the sake of the home comforts wouldn’t ruin this.\nSo I oiled the moving parts; I changed the needles, the sewing feet, the sewing plate, the bobbin and the shuttle, and nothing worked. I changed the goddamned motor, but it didn’t matter what I did, no matter what I put together or put apart, the machine still stitched Cara Mia, the mission is doomed.\n“Don’t bloody ‘Cara Mia’ me, grandma!” I screamed into the air-conditioned void, only to regret it. What if someone heard me? (What I actually thought: what if this apparition claiming to be my grandmother exploded my sewing machine out of spite?) “Now, why is the mission doomed? It’s dangerous, yes, but . . . You made those first space suits, didn’t you? Those men could have died on their way to the Moon. Did that stop you? Answer me, what’s the problem?”\nI hit the pedal and let the shuttle fly away. Dot after dash and dash after dot it went until it ran out of fabric. When you make something bespoke, you cannot cut corners. They are cutting corners. Run while you can.\nNow, see through my point of view. Why would the top brass believe me? I don’t understand about spaceship building, I’m just a woman putting scraps together to make fancy jumpsuits. They’d say I’m insane and hire someone else for the work. And I thought about Jean, of course. He didn’t deserve to die like that. No one did. Two hundred people on that blasted unit alone, and all the others I didn’t know. If they are cutting corners, were they all doomed? Could I save them?\nI should have run another line of stitching. I should have asked for more. But I turned off the machine and ran away from the room.\nIf you were there, you’d have done the same.\nWouldn’t you?\nI kept away from my machine and concentrated on the work on the space suits and uniforms. I worked in the electronic machines from the compound, those soulless pieces of crap. All smart textiles and precise measurements. Not an inch to be wasted—the work I was being handsomely paid to do without a question. The measurements came over the email and I made my magic without meeting the strangers who would colonize the Red Planet for us.\nAnd all the while I heard the same scream at the back of my head: Cara Mia, run while you can.\nCould you pretend all was normal? Was I making funeral shrouds for civilians dreaming of Mars? My old machine wouldn’t answer that, only told me to run away every time I asked it. Typical for my grandmother: screw the others, save your own skin. She survived two world wars being this self-absorbed, but this time around I couldn’t afford the same callousness. Could you afford it, even if the price was never to get to Mars?\nWhen Jean showed up at my room again, with the haggard face of those who carry the weight of the world on their shoulders, I knew things were turning for the worse.\nPart of me wanted to lie, if only to save him. Tell him the machine broke down. I chose the truth instead, and this damned us all.\nI never asked Jean what the French used to talk to their dead. That old-fashioned sewing machine, all seaweed green plastic and kitschy flower décor, wasn’t what I would have imagined as an instrument to talk to the dead, either. I should have told him that. “Was this your grandmother’s?”\n“No, it’s my mother’s. Grandma would never own such a civilian machine.” I had to add, “There’s a difference between your professional screwdrivers and the ones I could buy at the hardware store, isn’t it? Same with me.”\n“Oh, well. You live and learn.” Jean tried to laugh, but he was in knots as he turned to the machine, trembling as he spoke with deep respect. “Madame, I am sorry to disturb you, but they say the departed can see more than anyone. You have seen something I didn’t. Please advise me. Am I wrong to be worried? Do you have any counsel?” He turned to me with a serious expression. “Do I have to press the pedal or you do?”\n“Dunno—it’s the first time I’m doing this. Here, sit down, let me show how it’s done . . . You should hold the fabric like this . . . Put down the foot . . . Good. Now press the pedal gently. Like you would with a car.”\nIf it were a car, Jean would have crashed it on the nearest wall: he pressed the pedal too fast and the machine almost jumped out of the table. Still, the message came across, and as he read it, his face went aflame. “Oh, Vera. I wish . . . Well. That’s enough information for me,” he said.\n“Please tell me what happened.”\n“How do I explain it? It’s like the . . . Like the lining of a coat, I think? On a good coat, the lining holds the stuffing together, yes? They are not putting the lining everywhere. I think they could get away with it. They wouldn’t risk . . . I mean . . . There’s always a risk, but . . . ” He looked at the machine again, his heart in his mouth. “Do you think we can save them? If I talk to the bosses, if I explain the situation, can we save them?”\nThis time, I operated the sewing machine. The phrase came by, Jean read it and ran away.\nLater, I decoded the phrase by myself. They have mocked your concerns, and yet you worry about them? Let them burn, for this hell is of their own making.\nThe following morning, I found a top of the range electronic sewing machine at my office, substituting my old heirloom. They also informed me that Ensign Jean took a leave of absence for medical reasons. The CCTV cameras appeared on the following morning, for security reasons.\nYou see where this is going, right?\nThe new machine didn’t jump and didn’t spurt—it was as if they had gifted me a sewing robot. I tried to call my grandmother back, but either she refused to show up in such a complex machinery or . . .\nOr else she abandoned me. It wouldn’t be the first time.\nBut I couldn’t abandon them. I couldn’t abandon Jean. So I turned to the CCTV cameras and said, loud and clear, “I want my machine back.”\nAnd didn’t sew a single stitch of their space suits until they heard me.\nThey docked my payment. They called in a doctor to assess my sanity. They called in another garment specialist, who only stayed a week before the electronic machines spurted Morse coded stitches over the smart fabrics. By then, the entire compound knew what was going on—how could they not know? First Jean, then me, then the new specialist, and now the Morse code took over every piece of machinery in the place, from the humble coffee maker to the biggest computers in the room—all of them going run while you can and I demand to talk to Vera.\nTwo weeks later, I saw myself alone in front of the military officers.\nOver the immense mahogany table that separated us, there was my old sewing machine and a bolt of black cotton fabric. Around it, all the engineers and the commanders staring at me tried their best to look nonplussed by the situation—but it was clear they were running out of time and out of patience.\nYou should have seen it: thirteen men, afraid of a green and white sewing machine. This comforts me now.\n“You understand this meeting is confidential,” said the eldest of the commanders. A rhetorical question, if there was ever one. “Make this work.”\nTen engineers in the room, and nobody knew how to operate a sewing machine?\nNo, dear. They hired someone else to do it, then another person, and then another. When the results remained the same, they had to see me doing it.\nI threaded the machine and ripped a piece of fabric. Grandma, I cannot leave them to die, I thought as the bobbin shook inside the shuttle and the dots and dashes showed up, white on black. Say something they will believe in.\nOne commander picked up the piece of fabric as soon as I finished. “It matches the other message,” he said to his companions, showing them the scrap. “The numbers are the same.”\n“I cannot stop the launch because of a sewing machine spouting nonsense. First the ‘I demand to talk to Vera’ and now these silly coded numbers?”\n“Silly coded numbers that match the parts that need attention. Jean had the correct information about your shortcuts.”\n“They are not shortcuts, damn it! We checked everything. This is just a ridiculous, broken machine. She probably rigged it up for a lark. Didn’t you, girl? You did rig this up. You wanted to scare the engineers because they were mean to you, and you drove the poor ensign insane. Do you know that? You drove him mad.”\n“Are you cutting corners?” I had to ask. I wanted to defend myself, my grandmother, maybe Jean. The machine wasn’t the problem; it had been the work that drove him mad. Dear Jean, who wanted to do the right thing: I owed him this much. If I caused his death or his madness, I owed him some rest.\n“We are making the best we can with the money we have.”\n“That’s not what I asked. Are you cutting corners?”\n“You are dismissed,” the commander said.\n“Are you cutting corners?”\n“Take her away! Now!”\n“Are you cutting corners? You’ll kill them all! Don’t you understand you will kill them?”\nThat’s what landed me here. They couldn’t explain it, so they blamed it on the witch. Best to pretend I was mad, and that I rigged the compound’s machines to spit out Morse coded voodoo.\nThe message Jean had read? Here, see it yourself: I kept it when they locked me up. There’s your truth, my dear, all written in white thread over the blue twill: all the places with weak points in the spaceship, the codes for the parts where they used second-class material. The same places that caused the explosion when they launched the rocket into the atmosphere.\nSo much for economy, huh? In the end, they were all expendable, like me. Who’d thought?\nThe prison ward allowed me to use their sewing machines the other day. They wanted to see if the trick would happen again, now that the spaceship exploded like I said it would. You know what I got? Here it is:\n.. / ..-. --- .-. --. .. ...- . / -.-- --- ..-\nDid you translate it?\nIt reads I forgive you.\nIs it my grandmother? Jean? One astronaut wearing my space suit?\nThey can forgive me all they like: they are all dead, and this is a sentence I cannot unpick. What was the use of knowing the future, if the future was this cloister room and those white, burning clouds in the sky? What’s the use of knowing things if you cannot alter them?\nNow, tell me what would you do. I’d like to hear it.\nAnna Martino is a Brazilian SFF writer and editor, publishing in English and Portuguese since 2013. Her work in English was featured in magazines such as Strange Horizons, Hexagon, Luna Station Quarterly, and Translunar Travellers Lounge, and was also performed at BBC World Radio. She lives in São Paulo with her husband and son.", "source": "https://clarkesworldmagazine.com/martino_11_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: This Stitch, This Time by Anna Martino"}