{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Brendan DuBois", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "zSE/SkvNrzFfeYqwbKUWd3rTzfs=", "id": null, "license": null, "comments": "", "raw_text": "6280 words, short story, REPRINT  Falling Star  On a late July day in Boston Falls, New Hampshire, Rick Monroe, the oldest resident of the town, sat on a park bench in the Town Common, waiting for the grocery and mail wagon to appear from Greenwich. The damn thing was supposed to arrive at two p.m., but the Congregational Church clock had just chimed three times and the road from Greenwich had remained empty. Four horses and a wagon were hitched up to a post in front of the Boston Falls General Store, some bare-chested kids were playing in the dirt road, and flies were buzzing around his face.  He stretched out his legs, saw the dirt stains at the bottom of the old overalls. Mrs. Chandler, his once-a-week house cleaner, was again doing a lousy job with the laundry, and he knew he should say something to her, but he was reluctant to do it. Having a cleaning woman was a luxury and a bad cleaning woman was better than no cleaning woman at all. Even if she was a snoop and sometimes raided his icebox and frowned whenever she reminded him of the weekly church services.  Some of the kids shouted and started running up the dirt road. He sat up, shaded his eyes with a shaking hand. There, coming down slowly, two tired horses pulling the wagon that had high wooden sides and a canvas top. He waited as the wagon pulled into the store, waited still until it was unloaded. There was really no rush, no rush at all. Let the kids have their excitement, crawling in and around the wagon. When the wagon finally pulled out, heading to the next town over, Jericho, he slowly got up, winced as his hips screamed at him. He went across the cool grass and then the dirt road, and up to the wooden porch. The children moved away from him, except for young Tom Cooper, who stood there, eyes wide open. Glen Roundell, the owner of the General Store and one of the town’s three selectmen, came up to him with a paper sack and a small packet of envelopes, tied together with a piece of twine.  “Here you go, Mister Monroe,” he said, his voice formal, wearing a starched white shirt, black tie and white store apron that reached the floor. “Best we can do this week. No beef, but there is some bacon there. Should keep if you get home quick enough.”  “Thanks, Glen,” he said. “On account, all right?”  Glen nodded. “That’s fine.”  He turned to step off the porch, when a man stepped out of the shadows. Henry Cooper, Tom’s father, wearing a checked flannel shirt and blue jeans, his thick black beard down to mid-chest. “Would you care for a ride back to your place, Mister Monroe?”  He shifted the bag in his hands, smiled. “Why, that would be grand.” And he was glad that Henry had not come into town with his wife, Marcia, for even though she was quite active in the church, she had some very un-Christian thoughts towards her neighbors, especially an old man like Rick Monroe, who kept to himself and wasn’t a churchgoer.  Rick followed Henry and his boy outside, and he clambered up on the rear, against a couple of wooden boxes and a barrel. Henry said, “You can sit up front, if you’d like,” and Rick said, “No, that’s your boy’s place. He can stay up there with you.”  Henry unhitched his two-horse team, and in a few minutes, they were heading out on the Town Road, also known as New Hampshire Route 12. The rear of the wagon jostled and was bumpy, but he was glad he didn’t have to walk it. It sometimes took him nearly an hour to walk from home to the center of town, and he remembered again—like he had done so many times—how once in his life it only took him ninety minutes to travel thousands of miles.  He looked again at the town common, at the stone monuments clustered there, commemorating the war dead from Boston Falls, those who had fallen in the Civil War, Spanish-American War, World Wars I and II, Korea, Vietnam, and even the first and second Gulf Wars. Then, the town common was out of view, as the horse and wagon made its way out of a small New Hampshire village, hanging on in the sixth decade of the twenty-first century.  When the wagon reached his home, Henry and his boy came down to help him, and Henry said, “Can I bring some water out for the horses? It’s a dreadfully hot day,” and Rick said, “Of course, go right ahead.” Henry nodded and said, “Tom, you help Mister Monroe in with his groceries. You do that.”  “Yes, sir,” the boy said, taking the bag from his hands, and he was embarrassed at how he enjoyed being helped. The inside of the house was cool—but not cool enough, came a younger voice from inside, a voice that said, remember when you could set a switch and have it cold enough to freeze your toes?—and he walked into the dark kitchen, past the coal-burning stove. From the grocery sack he took out a few canned goods—their labels in black and white, glued sloppily on—and the wax paper with the bacon inside. He went to the icebox, popped it open quickly and shut it. Tom was there, looking on, gazing around the room, and he knew what the boy was looking at: the framed photos of the time when Rick was younger and stronger, just like the whole damn country.  “Tom?”  “Yessir?”  “Care for a treat?”  Tom scratched at his dirty face with an equally dirty hand. “Momma said I shouldn’t take anything from strangers. Not ever.”  Rick said, “Well, boy, how can you say I’m a stranger? I live right down the road from you, don’t I?”  “Unh-hunh.”  “Then we’re not strangers. You sit right there and don’t move.”  Tom clambered up on a wooden kitchen chair and Rick went over to the counter, opened up the silverware drawer, took out a spoon. Back to the icebox he went, this time opening up the freezer compartment, and he quickly pulled out a small white coffee cup with a broken handle. He placed the cold coffee cup down on the kitchen table and gave the boy the spoon.  “Here, dig in,” he said.  Tom looked curious but took the spoon and scraped against the ice-like confection in the bottom of the cup. He took a taste and his face lit up, like a lightbulb behind a dirty piece of parchment. The next time the spoon came up it was nearly full, and Tom quickly ate everything in the cup, and then licked the spoon and tried to lick the inside of the cup.  “My, that was good!” he said. “What was it, Mister Monroe?”  “Just some lemonade and sugar, frozen up. Not bad, hunh?  “It was great! Um, do you have any more? Sir?”  Rick laughed, thinking of how he had made it this morning, for a dessert after dinner. Not for a boy not even ten, but so what? “No, ‘fraid not. But come back tomorrow. I might have some then, if I can think about it.”  At the kitchen sink he poured water into the cup, and the voice returned. Why not, it said. Tell the boy what he’s missing. Tell him how it was like, back when a kid his age would laugh rather than eat frozen, sugary lemonade. That with the change in his pocket, he could walk outside and meet up with an ice cream cart that sold luxuries unknown today in the finest restaurants. Tell him that, why don’t you?  He coughed and turned, saw Tom was looking up again at the photos. “Mister Monroe . . . ”  “Yes?”  “Mister Monroe, did you really go to the stars? Did you?”  Rick smiled, glad to see the curiosity in the boy’s face, and not fear. “Well, I guess I got as close as anyone could, back then. You see—”  The boy’s father yelled from outside. “Tom! Time to go! Come on out!”  Rick said, “Guess you have to listen to your dad, son. Tell you what, next time you come back, I’ll tell you everything you want to know. Deal?”  The boy nodded and ran out of the kitchen. His hips were still aching and he thought about lying down, before going through the mail, but he made his way outside, where Tom was up on the wagon. Henry came up and offered his hand, and Rick shook it, glad that Henry wasn’t one to try the strength test with someone as old as he. Henry said, “Have a word with you, Mister Monroe?”  “Sure,” he said. “But only if you call me Rick.”  From behind the thick beard, he thought he could detect a smile. “All right . . . Rick.”  They both sat down on old wicker rocking chairs and Henry said, “I’ll get right to it, Rick.”  “Okay.”  “There’s a town meeting tonight. I think you should go.”  “Why?”  “Because . . . well, there’s some stirrings. That’s all. About a special committee being set up. A morals committee, to ensure that only the right people live here in Boston Falls.”  “And who decides who are the right people?” he asked, finding it hard to believe this conversation was actually taking place.  Henry seemed embarrassed. “The committee and the selectmen, I guess . . . you see, there’s word down south, about some of the towns there, they still got trouble with refugees and transients rolling in from Connecticut and New York. Some of those towns, the natives, they’re being overwhelmed, outvoted, and they’re not the same anymore. And since you, um—”  “I was born here, Henry. You know that. Just because I lived someplace else for a long time, that’s held against me?”  “Well, I’m just sayin’ it’s not going to help . . . with what you did back then, and the fact you don’t go to church, and other things, well . . . it might be worthwhile if you go there. That’s all. To defend yourself.”  Even with the hot weather, Rick was feeling a cold touch upon his hands. Now we’re really taking a step back, he thought. Like the Nuremberg laws, in Nazi Germany. Ensuring that only the ethnically and racially pure get to vote, to shop, to live . . .  “And if this committee decides you don’t belong? What then? Arrested? Exiled? Burnt at the stake?”  Now his neighbor looked embarrassed as he stepped up from the wicker chair. “You should just be there, Mister uh, I mean, Rick. It’s at eight o’clock. At the town hall.”  “That’s a long walk in, when it’s getting dark. Any chance I could get a ride?”  Even with his neighbor’s back turned to him, Rick could sense the humiliation. “Well, I, well, I don’t think so, Rick. I’m sorry. You see, I think Marcia wants to visit her sister after the meeting, and I don’t know what time we might get back, and, well, I’m sorry.”  Henry climbed up into the wagon, retrieved the reins from his son, and Rick called out. “Henry?”  “Yes?”  “Any chance your wife is on this committee?”  The expression on his neighbor’s face was all he needed to know, as the wagon turned around on his brown lawn and headed back up to the road.  Back inside, he grabbed his mail and went upstairs, to the spare bedroom that he had converted into an office, during the first year he had made it back to Boston Falls. He went to unlock the door and found that it was already open. Damn his memory, which he knew was starting to show its age, just like his hips. He was certain he had locked it the last time. He sat down at the desk and untied the twine, knowing he would save it. What was that old Yankee saying? Use it up, wear it out, or do without? Heavy thrift, one of the many lessons being re-learned these years.  One envelope he set aside to bring into Glen Roundell, the General Store owner. It was his Social Security check, only three months late, and Glen—who was also the town’s banker—would take it and apply it against Rick’s account. Not much being made for sale nowadays, whatever tiny amount his Social Security check was this month was usually enough to keep his account in good shape.  There was an advertising flyer for the Grafton County Fair, set to start next week. Another flyer announcing a week-long camp revival at the old Boy Scout camp on Conway Lake, during the same time. Competition, no doubt. And a thin envelope, postmarked Houston, Texas, which he was happy to see. It had only taken a month for the envelope to get here, which he thought was a good sign. Maybe some things were improving in the country.  Maybe.  He slit open the envelope with an old knife, saw the familiar handwriting inside.   Dear Rick,  Hope this sees you doing well in the wilds of New Hampshire.  Down here what passes for recovery continues. Last month, two whole city blocks had their power restored. It only comes on for a couple of hours a day, and no a/c is allowed, but it’s still progress, eh?  Enclosed are the latest elements for Our Boy. I’m sorry to say the orbit degradation is continuing. Latest guess is that Our Boy may be good for another five years, maybe six.  Considering what was spent in blood and treasure to put him up there, it breaks my heart.  If you get bored and lonely up there, do consider coming down here. I understand that with Amtrak coming back, it should only take four weeks to get here. The heat is awful but at least, you’ll be in good company with those of us who still remember.  Your pal,  Brian  With the handwritten sheet was another sheet of paper, with a listing of dates and times, and he shook his head in dismay. Most of the sightings were for early mornings, and he hated getting up in the morning. But tonight—how fortunate!—there was going to be a sighting at just after eight o’clock.  Eight o’clock. Why did that sound familiar?  Now he remembered. The town meeting tonight, where supposedly his fate and those of any other possible sinners was to be decided. He carefully folded up the letter, put it back in the envelope. He decided one more viewing was more important, more important than whatever chatter session was going to happen later. And besides, knowing what he did about the town and its politics, the decision had already been made.  He looked around his small office, with the handmade bookshelves and books, and more framed photos on the cracked plaster wall. One of the photos was of he and his friend, Brian Poole, wearing blue zippered jumpsuits, standing in front of something large and complex, built ages ago in the swamps of Florida.  “Thanks, guy,” he murmured, and he got up and went downstairs, to think of what might be for dinner.  Later that night he was in the big backyard, a pasture that he let his other neighbor, George Thompson, mow for hay a couple of times each summer, for which George gave him some venison and smoked ham over the long winters in exchange. He brought along a folding lawn chair, its bright plastic cracked and faded away, and he sat there, stretching out his legs. It was a quiet night, like every night since he had come here, years ago. He smiled in the darkness. What strange twists of fate and fortune had brought him back here, to his old family farm. He had grown up here, until his dad had moved the family south, to a suburb of Boston, and from there, high school and Air Force ROTC, and then many, many years traveling, thousands upon thousands of miles, hardly ever thinking about the old family farm, now owned by a second or third family. And he would have never come back here, until the troubles started, when—  A noise made him turn his head. Something crackling out there, in the underbrush.  “Who’s out there?” he called out, wondering if some of the more hot-blooded young’uns in town had decided not to wait until the meeting was over. “Come out and show yourself.”  A shape came out from the woodline, ambled over, small and then there was a young boy’s voice, “Mister Monroe, it’s me, Tom Cooper.”  “Tom? Oh, yes, Tom. Come on over here.”  The young boy came up, sniffling some, and Rick said, “Tom, you gave me a bit of a surprise. What can I do for you?”  Tom stood next to him, and said slowly, “I was just wondering . . . well, that cold stuff you gave me earlier, that tasted really good. I didn’t know if you had any more left . . . ”  He laughed. “Sorry, guy. Maybe tomorrow. How come you’re not with your mom and dad at the meeting?”  Tom said, “My sister Ruth is suppose to be watching us, but I snuck out of my room and came here. I was bored.”  “Well, boredom can be good, if it means something will happen. Tell you what, Tom, wait a couple of minutes, I’ll show you something special.”  “What’s that?”  “You just wait and I’ll show you.”  Rick folded his hands together in his lap, looked over at the southeast. Years and years ago, that part of the night sky would be a light yellow glow, the lights from the cities in that part of the state. Now, like every other part of the night sky, there was just blackness and the stars, the night sky now back where it had once been, almost two centuries ago.  There. Right there. A dot of light, moving up and away from the horizon.  “Take a look, Tom. See that moving light?”  “Unh-hunh.”  “Good. Just keep your eye on it. Look at it go.”  The solid point of light rose up higher and seemed brighter, and he found his hands were tingling and his chest was getting tighter. Oh God, how beautiful, how beautiful it had been up there, looking down on the great globe, watching the world unfold beneath you, slow and majestic and lovely, knowing that as expensive and ill-designed and over-budget and late in being built, it was there, the first permanent outpost for humanity, the first step in reaching out to the planets and stars that were humanity’s destiny . . .  The crickets seemed louder. An owl out in the woods hoo-hoo’ed, and beside him, Tom said, “What is it, Mister Monroe?”  The light seemed to fade some, and then it disappeared behind some tall pines, and Rick found that his eyes had gotten moist. He wiped at them and said, “What do you think it was?”  “I dunno. I sometimes see lights move at night, and momma tells me that it’s the Devil’s work, and I shouldn’t look at ‘em. Is that true?”  He rubbed at his chin, thought for a moment about just letting the boy be, let him grow up with his illusions and whatever misbegotten faith his mother had put in his head, let him think about farming and hunting and fishing, to concentrate on what was real, what was necessary, which was getting enough food to eat and a warm place and—  No! the voice inside him shouted. No, that’s not fair, to condemn this boy and the others to a life of peasantry, just because of some wrong things that had been done, years before the child was even born. He shook his head and said, “Well, I can see why some people would think it’s the Devil’s work, but the truth is, Tom, that was a building up there. A building made by men and women and put up in the sky, more than a hundred miles up.”  Tom sounded skeptical. “Then how come it doesn’t fall down?”  Great, the voice said. Shall we give him a lecture about Newton? What do you suggest?  He thought for a moment and said, “It’s complex, and I don’t want to bore you, Tom. But trust me, it’s up there. In fact, it’s still up there and will be for a while. Even though nobody’s living in it right now.”  Tom looked up and said, “Where is it now?”  “Oh, I imagine it’s over Canada by now. You see, it goes around the whole globe in what’s called an orbit. Only takes about ninety minutes or so.”  Tom seemed to think about that and said shyly, “My dad. He once said you were something. A spaceman. That you went to the stars. Is that true?”  “True enough. We never made it to the stars, though we sure thought about it a lot.”  “He said you flew up in the air. Like a bird. And the places you went, high enough, you had to carry your own air with you. Is that true, too?”  “Yes, it is.”  “Jeez. You know, my momma, well . . . ”  “Your momma, she doesn’t quite like me, does she?”  “Unh-hunh. She says you’re not good. You’re unholy. And some other stuff.”  Rick thought about telling the boy the truth about his mother, decided it could wait until the child got older. God willing, the boy would learn soon enough about his mother. Aloud Rick said, “I’m going back to my house. Would you like to get something?”  “Another cold treat?” came the hopeful voice.  “No, not tonight. Maybe tomorrow. Tonight, well, tonight I want to give you something that’ll last longer than any treat.”  A few minutes later they were up in his office, Tom talking all the while about the fishing he had done so far this summer, the sleep-outs in the back pasture, and about his cousin Lloyd, who lived in the next town over, Hancock, and who died of something called polio. Rick shivered at the matter of fact way Tom had mentioned his cousin’s death. A generation ago, a death like that would have never happened. Hell, a generation ago, if somebody of Tom’s age had died, the poor kid would have been shoved into counseling sessions and group therapies, trying to get closure about the damn thing. And now? Just part of growing up.  In his office Tom ooh’ed and aaah’ed over the photos on his wall, and Rick explained the best he could of what they were about. “Well, that’s the dot of light we just saw. It’s actually called a space station. Over there, that’s what you used to fly up to the space station. It’s called a space shuttle. Or a rocket, if you prefer. This . . . this is a picture of me, up in the space station.”  “Really?” Tom asked. “You were really there?”  He found he had to sit down, so he did, his damn hips aching something fierce. “Yes, I was really up there. One of the last people up there, to tell you the truth, Tom. Just before, well . . . just before everything changed.”  Tom stood before a beautiful photo of a full moon, the craters and mountains and flat seas looking as sharp as if they were made yesterday. He said, “Momma said that it was God who punished the world back then, because men were evil, because they ignored God. Is that true, Mister Monroe? What really happened back then?”  His fists suddenly clenched, as if powered by memory. Where to begin, young man, he thought. Where to begin. Let’s talk about a time when computers were in everything, from your car to your toaster to your department store cash register. Everything linked up and interconnected. And when the systems are getting more and more complex, the childish ones, the vandals, the destructive hackers, they have to prove that they have the knowledge and skills and wherewithal to take down a system. Oh, the defenses grew stronger and stronger, as did the viruses, and the evil ones redoubled their efforts, like the true Vandals coming into Rome, burning and destroying something that somebody else created. The defenses grew more in-depth, the attacks more determined, until one bright soul—if such a creature could be determined to have a soul—came up with ultimate computer virus. No, not one that wormed its way into software through backdoors or anything fancy like that. Nossir. This virus was one that attacked the hardware, the platforms, that spread—God knows how—theories ranged from human touch to actual impulses over fiber optics—and destroyed the chips. That’s all. Just ate the chips and left burnt-out crumbs behind, so that in days, almost every thing in the world that used a computer was silent, dark and dead.  Oh, he was a smart one—for the worst of the hackers were always male—whoever he was, and Rick often wished that the designer of the ultimate virus (called the Final Virus, for a very good reason) had been on an aircraft or an operating room table when it had struck. For when the computers sputtered out and died, the chaos that was unleashed upon the world . . . Cars, buses, trains, trucks. Dead, not moving. Hundreds of thousands of people, stranded far from home. Aircraft falling out of the skies. Ships at sea, slowly drifting, unable to maneuver. Stock markets, banks, corporations, everything and any thing that stored the wealth of a nation in electronic impulses, silent. All the interconnections that fed and clothed and fueled and protected and sheltered most of the world’s billions had snapped apart, like brittle rubber bands. Within days the cities had become uninhabitable, as millions streamed into the countryside. Governments wavered and collapsed. Communications were sparse, for networks and radio stations and the cable stations were off the air as well. Rumors and fear spread like a plague itself, and the Four Horsemen of the Apocalypse—called out from retirement at last—swept through almost the entire world.  There were a few places that remained untouched: Antarctica and a few remote islands. But for the rest of the world . . . sometimes the only light on the nightside of the planet were the funeral pyres, where the bodies were being burnt.  He grew nauseous, remembering what had happened to him and how it took him months to walk back here, to his childhood home, and he repressed the memory of eating something a farmer had offered him—it hadn’t exactly looked like dog, but God, he had been so hungry—and he looked over to young Tom. How could he even begin to tell such a story to such an innocent lad?  He wouldn’t. He composed himself and said, “No, God didn’t punish us back then. We did. It was a wonderful world, Tom, a wonderful place. It wasn’t perfect and many people did ignore God, did ignore many good things . . . but we did things. We fed people and cured them and some of us, well, some of us planned to go to the stars.”  He went up to the wall, took down the picture of the International Space Station, the Big Boy himself, and pointed it out to Tom. “Men and women built that on the ground, Tom, and brought it up into space. They did it for good, to learn things, to start a way for us to go back to the moon and to Mars. To explore. There was no evil there. None.”  Tom looked at the picture and said, “And that’s the dot of light we saw? Far up in the sky?”  “Yes.”  “And what’s going to happen to it?”  He looked at the framed photo, noticed his hands shaking some. He put the photo back up on the wall. “One of these days, it’s going to get lower and lower. It just happens. Things up in orbit can’t stay up there forever. Unless somebody can go up there and do something . . . it’ll come crashing down.”  He sat down in the chair, winced again at the shooting pains in his hips. There was a time when he could have had new hips, new knees, or—if need be—new kidneys, but it was going to take a long time for those days to ever come back. From his infrequent letters from Brian, he knew that work was still continuing in some isolated and protected labs, to find an answer to the Final Virus. But with people starving and cities still unlit, most of the whole damn country had fallen back to the late 1800s, when power was provided by muscles, horses, or steam. Computers would just have to wait.  Tom said, “I hope it doesn’t happen, Mister Monroe. It sounds really cool.”  Rick said, “Well, maybe when you grow up, if you’re really smart, you can go up there and fix it. And think about me when you’re doing it. Does that sound like fun?”  The boy nodded and Rick remembered why he had brought the poor kid up here. He got out of his chair, went over to his bookshelf, started moving around the thick volumes and such, until he found a slim book, a book he had bought once for a future child, for one day he had promised Kathy Meserve that once he left the astronaut corps, he would marry her . . . . Poor Kathy, in London on a business trip, whom he had never seen or heard from, ever again, after the Final Virus had broken out.  He came over to Tom and gave him the book. It was old but the cover was still bright, and it said, MY FIRST BOOK ON SPACE TRAVEL. Rick said, “You can read, can’t you?”  “Unh-hunh, I sure can.”  “Okay.” He rubbed at the boy’s head, not wanting to think of Kathy Meserve or the children he never had. “You take this home and read it. You can learn a lot about the stars and planets and what it was like, to explore space and build the first space station. Maybe you can get back up there, Tom.” Or your children’s children, he thought, but why bring that depressing thought up. “Maybe you can be what I was, a long time ago.”  Tom’s voice was solemn. “A star man?”  Rick shook his head. “No, nothing fancy like that. An astronaut. That’s all. Look, it’s getting late. Why don’t you head home.”  And the young boy ran from his office, holding the old book in his hands, as if scared Rick was going to change his mind and take it away from him.  It was the sound of the horses that woke him, neighing and moving about in his yard, early in the morning. He got out of bed, cursed his stiff joints, and slowly got dressed. At the foot of the bed was a knapsack, for he knew a suitcase would not work. He picked up the knapsack—which he had put together last night—and walked downstairs, walked slowly, as he noticed the woodwork and craftsmanship that a long forgotten great-great-great grandfather had put into building this house, which he was now leaving.  He went out on the front porch, shaded his eyes from the hot morning sun. There were six or seven horses in his front yard, three horse-drawn wagons, and a knot of people in front. Some children were clustered out under the maple tree by the road, their parents no doubt telling them to stay away. He recognized all of the faces in the crowd, but was pleased to see that Glen Roundell, the store owner and one of the three selectmen, was not there, as well as Henry Cooper, but Henry’s wife Marcia was there, thin-lipped and perpetually angry, and she strode forward, holding something at her side. She wore a long cotton skirt and long-sleeve shirt—and that insistent voice inside his head wondered why again, with technology having tumbled two hundred years, why did fashion have to follow suit?—and she announced loudly, “Rick Monroe, you know why we’re here, don’t you.”  “Mrs. Cooper, I’m sure I have some idea, but why don’t you inform me, in case I’m mistaken. I know that of your many fine attributes, correcting the mistakes of others is your finest.”  She looked around the crowd, as if seeking their support, and she pressed on, even though there was a smile or two at his comment. “At a special town meeting last night, it was decided by a majority of the town to suspend your residency here, in Boston Falls, due to your past crimes and present immorality.”  “Crimes?” In the crowd he noticed a man in a faded and patched uniform, and he said, “Chief Godin. You know me. What crimes have I committed?”  Chief Sam Godin looked embarrassed. A kid of about twenty-two or thereabouts, he was the Chief because he had strong hands and was a good shot. The uniform shirt he wore was twice as old as he was, but he wore it proudly, since it represented his office.  Today, though, he looked like he would rather be wearing anything else. He seemed to blush and said, “Gee, Mister Monroe . . . no crimes here, since you’ve moved back. But there’s been talk of what you did, back then, before . . . before the change. You were a scientist or something. Worked with computers. Maybe had something to do with the change, that’s the kind of crimes that we were thinking about.”  Rick sighed. “Very good. That’s the crime I’ve been accused of, of being educated. That I can accept. But immoral? Where’s your proof?”  “Right here,” Marcia Cooper said triumphantly. “See? This old magazine, with depraved photos and lustful women . . . kept in your house, to show any youngster that came by. Do you deny having this in your possession?”  And despite it all, he felt like laughing, for Mrs. Cooper was holding up—and holding up tight so nothing inside would be shown, of course—an ancient copy of Playboy magazine. The damn thing had been in his office, and sometimes he would just glance though the slick pages and sigh at a world—and a type of woman—long gone. Then something came to him and he saw another woman in the crowd, arms folded tight, staring in distaste towards him. It all clicked.  “No, I don’t deny it,” Rick said, “and I also don’t deny that Mrs. Chandler, for once in her life, did a good job cleaning my house. Find anything else in there, Mrs. Chandler, you’d like to pass on to your neighboors?”  She just glared, said nothing. He looked up at the sun. It was going to be another hot day.  The Chief stepped forward and said, “We don’t want any trouble, Mister Monroe. But it’s now the law. You have to leave.”  He picked up his knapsack, shrugged his arms through the frayed straps, almost gasped at the heavy weight back there. “I know.”  The Chief said, “If you want, I can get you a ride to one of the next towns over, save you—”  “No,” he said, not surprised at how harsh he responded. “No, I’m not taking any of your damn charity. By God years ago I walked into this town alone, and I’ll walk out of this town alone as well.”  Which is what he started to do, coming down the creaky steps, across the unwatered lawn. The crowd in front of him slowly gave way, like they were afraid he was infected or some damn thing. He looked at their dirty faces, the ignorant looks, the harsh stares, and he couldn’t help himself. He stopped and said, “You know, I pity you. If it hadn’t been for some unknown clown, years ago, you wouldn’t be here. You’d be on a powerboat in a lake. You’d be in an air-conditioned mall, shopping. You’d be talking to each other over frozen drinks on where to fly to vacation this winter. That’s what you’d be doing.”  Marcia Cooper said, “It was God’s will. That’s all.”  Rick shook his head. “No, it was some idiot’s will, and because of that, you’ve grown up to be peasants. God save you and your children.”  They stayed silent but he noticed that some of the younger men were looking fidgety, and were sparing glances to the Chief, like they were wondering if the Chief would intervene if they decided to stone him or some damn thing. Time to get going, and he tried not to think of the long miles that were waiting for him. Just one step after another, that’s all. Maybe, if his knees and hips held together, he could get to the train station in Concord. Maybe. Take Brian up on his offer. He made it out to the dirt road, decided to head left, up to Greenwich, for he didn’t want to walk through town. Why tempt fate?  He turned and looked one last time at his house, and then looked over to the old maple tree, where some of the children, bored by what had been going on, were now scurrying around the tree trunk.  But not all of the children.  One of them was by himself, at the road’s edge. He looked nervous, and he raised his shirt, and even at this distance, he could make out young Tom Cooper, standing there, his gift of a book hidden away in the waistband of his jeans. Tom lowered his shirt and then waved, and Rick, surprised, smiled and waved back.  And then he turned his back on his home and his town, and started walking away.    Originally published in Space Stations, edited by Martin Greenberg and John Helfers, 2010.  Brendan DuBois has twice received the Shamus Award from the Private Eye Writers of America, been nominated three times for the Edgar Allan Poe Award given by the Mystery Writers of America, and has had stories reprinted in The Best American Mystery Stories of the Century and The Best American Noir of the Century. He's the author of sixteen novels and over one hundred and thirty short stories. His SF novels include Resurrection Day and Six Days. His most recent novel is Deadly Cove, part of the \"Lewis Cole\" mystery series, which also includes Dead Sand, Black Tide, Shattered Shell, Killer Waves, and Buried Dreams. He is also a \"Jeopardy!\" gameshow champion. He lives in Exeter, NH with his family.", "text": "6280 words, short story, REPRINT\nFalling Star\nOn a late July day in Boston Falls, New Hampshire, Rick Monroe, the oldest resident of the town, sat on a park bench in the Town Common, waiting for the grocery and mail wagon to appear from Greenwich. The damn thing was supposed to arrive at two p.m., but the Congregational Church clock had just chimed three times and the road from Greenwich had remained empty. Four horses and a wagon were hitched up to a post in front of the Boston Falls General Store, some bare-chested kids were playing in the dirt road, and flies were buzzing around his face.\nHe stretched out his legs, saw the dirt stains at the bottom of the old overalls. Mrs. Chandler, his once-a-week house cleaner, was again doing a lousy job with the laundry, and he knew he should say something to her, but he was reluctant to do it. Having a cleaning woman was a luxury and a bad cleaning woman was better than no cleaning woman at all. Even if she was a snoop and sometimes raided his icebox and frowned whenever she reminded him of the weekly church services.\nSome of the kids shouted and started running up the dirt road. He sat up, shaded his eyes with a shaking hand. There, coming down slowly, two tired horses pulling the wagon that had high wooden sides and a canvas top. He waited as the wagon pulled into the store, waited still until it was unloaded. There was really no rush, no rush at all. Let the kids have their excitement, crawling in and around the wagon. When the wagon finally pulled out, heading to the next town over, Jericho, he slowly got up, winced as his hips screamed at him. He went across the cool grass and then the dirt road, and up to the wooden porch. The children moved away from him, except for young Tom Cooper, who stood there, eyes wide open. Glen Roundell, the owner of the General Store and one of the town’s three selectmen, came up to him with a paper sack and a small packet of envelopes, tied together with a piece of twine.\n“Here you go, Mister Monroe,” he said, his voice formal, wearing a starched white shirt, black tie and white store apron that reached the floor. “Best we can do this week. No beef, but there is some bacon there. Should keep if you get home quick enough.”\n“Thanks, Glen,” he said. “On account, all right?”\nGlen nodded. “That’s fine.”\nHe turned to step off the porch, when a man stepped out of the shadows. Henry Cooper, Tom’s father, wearing a checked flannel shirt and blue jeans, his thick black beard down to mid-chest. “Would you care for a ride back to your place, Mister Monroe?”\nHe shifted the bag in his hands, smiled. “Why, that would be grand.” And he was glad that Henry had not come into town with his wife, Marcia, for even though she was quite active in the church, she had some very un-Christian thoughts towards her neighbors, especially an old man like Rick Monroe, who kept to himself and wasn’t a churchgoer.\nRick followed Henry and his boy outside, and he clambered up on the rear, against a couple of wooden boxes and a barrel. Henry said, “You can sit up front, if you’d like,” and Rick said, “No, that’s your boy’s place. He can stay up there with you.”\nHenry unhitched his two-horse team, and in a few minutes, they were heading out on the Town Road, also known as New Hampshire Route 12. The rear of the wagon jostled and was bumpy, but he was glad he didn’t have to walk it. It sometimes took him nearly an hour to walk from home to the center of town, and he remembered again—like he had done so many times—how once in his life it only took him ninety minutes to travel thousands of miles.\nHe looked again at the town common, at the stone monuments clustered there, commemorating the war dead from Boston Falls, those who had fallen in the Civil War, Spanish-American War, World Wars I and II, Korea, Vietnam, and even the first and second Gulf Wars. Then, the town common was out of view, as the horse and wagon made its way out of a small New Hampshire village, hanging on in the sixth decade of the twenty-first century.\nWhen the wagon reached his home, Henry and his boy came down to help him, and Henry said, “Can I bring some water out for the horses? It’s a dreadfully hot day,” and Rick said, “Of course, go right ahead.” Henry nodded and said, “Tom, you help Mister Monroe in with his groceries. You do that.”\n“Yes, sir,” the boy said, taking the bag from his hands, and he was embarrassed at how he enjoyed being helped. The inside of the house was cool—but not cool enough, came a younger voice from inside, a voice that said, remember when you could set a switch and have it cold enough to freeze your toes?—and he walked into the dark kitchen, past the coal-burning stove. From the grocery sack he took out a few canned goods—their labels in black and white, glued sloppily on—and the wax paper with the bacon inside. He went to the icebox, popped it open quickly and shut it. Tom was there, looking on, gazing around the room, and he knew what the boy was looking at: the framed photos of the time when Rick was younger and stronger, just like the whole damn country.\n“Tom?”\n“Yessir?”\n“Care for a treat?”\nTom scratched at his dirty face with an equally dirty hand. “Momma said I shouldn’t take anything from strangers. Not ever.”\nRick said, “Well, boy, how can you say I’m a stranger? I live right down the road from you, don’t I?”\n“Unh-hunh.”\n“Then we’re not strangers. You sit right there and don’t move.”\nTom clambered up on a wooden kitchen chair and Rick went over to the counter, opened up the silverware drawer, took out a spoon. Back to the icebox he went, this time opening up the freezer compartment, and he quickly pulled out a small white coffee cup with a broken handle. He placed the cold coffee cup down on the kitchen table and gave the boy the spoon.\n“Here, dig in,” he said.\nTom looked curious but took the spoon and scraped against the ice-like confection in the bottom of the cup. He took a taste and his face lit up, like a lightbulb behind a dirty piece of parchment. The next time the spoon came up it was nearly full, and Tom quickly ate everything in the cup, and then licked the spoon and tried to lick the inside of the cup.\n“My, that was good!” he said. “What was it, Mister Monroe?”\n“Just some lemonade and sugar, frozen up. Not bad, hunh?\n“It was great! Um, do you have any more? Sir?”\nRick laughed, thinking of how he had made it this morning, for a dessert after dinner. Not for a boy not even ten, but so what? “No, ‘fraid not. But come back tomorrow. I might have some then, if I can think about it.”\nAt the kitchen sink he poured water into the cup, and the voice returned. Why not, it said. Tell the boy what he’s missing. Tell him how it was like, back when a kid his age would laugh rather than eat frozen, sugary lemonade. That with the change in his pocket, he could walk outside and meet up with an ice cream cart that sold luxuries unknown today in the finest restaurants. Tell him that, why don’t you?\nHe coughed and turned, saw Tom was looking up again at the photos. “Mister Monroe . . . ”\n“Yes?”\n“Mister Monroe, did you really go to the stars? Did you?”\nRick smiled, glad to see the curiosity in the boy’s face, and not fear. “Well, I guess I got as close as anyone could, back then. You see—”\nThe boy’s father yelled from outside. “Tom! Time to go! Come on out!”\nRick said, “Guess you have to listen to your dad, son. Tell you what, next time you come back, I’ll tell you everything you want to know. Deal?”\nThe boy nodded and ran out of the kitchen. His hips were still aching and he thought about lying down, before going through the mail, but he made his way outside, where Tom was up on the wagon. Henry came up and offered his hand, and Rick shook it, glad that Henry wasn’t one to try the strength test with someone as old as he. Henry said, “Have a word with you, Mister Monroe?”\n“Sure,” he said. “But only if you call me Rick.”\nFrom behind the thick beard, he thought he could detect a smile. “All right . . . Rick.”\nThey both sat down on old wicker rocking chairs and Henry said, “I’ll get right to it, Rick.”\n“Okay.”\n“There’s a town meeting tonight. I think you should go.”\n“Why?”\n“Because . . . well, there’s some stirrings. That’s all. About a special committee being set up. A morals committee, to ensure that only the right people live here in Boston Falls.”\n“And who decides who are the right people?” he asked, finding it hard to believe this conversation was actually taking place.\nHenry seemed embarrassed. “The committee and the selectmen, I guess . . . you see, there’s word down south, about some of the towns there, they still got trouble with refugees and transients rolling in from Connecticut and New York. Some of those towns, the natives, they’re being overwhelmed, outvoted, and they’re not the same anymore. And since you, um—”\n“I was born here, Henry. You know that. Just because I lived someplace else for a long time, that’s held against me?”\n“Well, I’m just sayin’ it’s not going to help . . . with what you did back then, and the fact you don’t go to church, and other things, well . . . it might be worthwhile if you go there. That’s all. To defend yourself.”\nEven with the hot weather, Rick was feeling a cold touch upon his hands. Now we’re really taking a step back, he thought. Like the Nuremberg laws, in Nazi Germany. Ensuring that only the ethnically and racially pure get to vote, to shop, to live . . .\n“And if this committee decides you don’t belong? What then? Arrested? Exiled? Burnt at the stake?”\nNow his neighbor looked embarrassed as he stepped up from the wicker chair. “You should just be there, Mister uh, I mean, Rick. It’s at eight o’clock. At the town hall.”\n“That’s a long walk in, when it’s getting dark. Any chance I could get a ride?”\nEven with his neighbor’s back turned to him, Rick could sense the humiliation. “Well, I, well, I don’t think so, Rick. I’m sorry. You see, I think Marcia wants to visit her sister after the meeting, and I don’t know what time we might get back, and, well, I’m sorry.”\nHenry climbed up into the wagon, retrieved the reins from his son, and Rick called out. “Henry?”\n“Yes?”\n“Any chance your wife is on this committee?”\nThe expression on his neighbor’s face was all he needed to know, as the wagon turned around on his brown lawn and headed back up to the road.\nBack inside, he grabbed his mail and went upstairs, to the spare bedroom that he had converted into an office, during the first year he had made it back to Boston Falls. He went to unlock the door and found that it was already open. Damn his memory, which he knew was starting to show its age, just like his hips. He was certain he had locked it the last time. He sat down at the desk and untied the twine, knowing he would save it. What was that old Yankee saying? Use it up, wear it out, or do without? Heavy thrift, one of the many lessons being re-learned these years.\nOne envelope he set aside to bring into Glen Roundell, the General Store owner. It was his Social Security check, only three months late, and Glen—who was also the town’s banker—would take it and apply it against Rick’s account. Not much being made for sale nowadays, whatever tiny amount his Social Security check was this month was usually enough to keep his account in good shape.\nThere was an advertising flyer for the Grafton County Fair, set to start next week. Another flyer announcing a week-long camp revival at the old Boy Scout camp on Conway Lake, during the same time. Competition, no doubt. And a thin envelope, postmarked Houston, Texas, which he was happy to see. It had only taken a month for the envelope to get here, which he thought was a good sign. Maybe some things were improving in the country.\nMaybe.\nHe slit open the envelope with an old knife, saw the familiar handwriting inside.\nDear Rick,\nHope this sees you doing well in the wilds of New Hampshire.\nDown here what passes for recovery continues. Last month, two whole city blocks had their power restored. It only comes on for a couple of hours a day, and no a/c is allowed, but it’s still progress, eh?\nEnclosed are the latest elements for Our Boy. I’m sorry to say the orbit degradation is continuing. Latest guess is that Our Boy may be good for another five years, maybe six.\nConsidering what was spent in blood and treasure to put him up there, it breaks my heart.\nIf you get bored and lonely up there, do consider coming down here. I understand that with Amtrak coming back, it should only take four weeks to get here. The heat is awful but at least, you’ll be in good company with those of us who still remember.\nYour pal,\nBrian\nWith the handwritten sheet was another sheet of paper, with a listing of dates and times, and he shook his head in dismay. Most of the sightings were for early mornings, and he hated getting up in the morning. But tonight—how fortunate!—there was going to be a sighting at just after eight o’clock.\nEight o’clock. Why did that sound familiar?\nNow he remembered. The town meeting tonight, where supposedly his fate and those of any other possible sinners was to be decided. He carefully folded up the letter, put it back in the envelope. He decided one more viewing was more important, more important than whatever chatter session was going to happen later. And besides, knowing what he did about the town and its politics, the decision had already been made.\nHe looked around his small office, with the handmade bookshelves and books, and more framed photos on the cracked plaster wall. One of the photos was of he and his friend, Brian Poole, wearing blue zippered jumpsuits, standing in front of something large and complex, built ages ago in the swamps of Florida.\n“Thanks, guy,” he murmured, and he got up and went downstairs, to think of what might be for dinner.\nLater that night he was in the big backyard, a pasture that he let his other neighbor, George Thompson, mow for hay a couple of times each summer, for which George gave him some venison and smoked ham over the long winters in exchange. He brought along a folding lawn chair, its bright plastic cracked and faded away, and he sat there, stretching out his legs. It was a quiet night, like every night since he had come here, years ago. He smiled in the darkness. What strange twists of fate and fortune had brought him back here, to his old family farm. He had grown up here, until his dad had moved the family south, to a suburb of Boston, and from there, high school and Air Force ROTC, and then many, many years traveling, thousands upon thousands of miles, hardly ever thinking about the old family farm, now owned by a second or third family. And he would have never come back here, until the troubles started, when—\nA noise made him turn his head. Something crackling out there, in the underbrush.\n“Who’s out there?” he called out, wondering if some of the more hot-blooded young’uns in town had decided not to wait until the meeting was over. “Come out and show yourself.”\nA shape came out from the woodline, ambled over, small and then there was a young boy’s voice, “Mister Monroe, it’s me, Tom Cooper.”\n“Tom? Oh, yes, Tom. Come on over here.”\nThe young boy came up, sniffling some, and Rick said, “Tom, you gave me a bit of a surprise. What can I do for you?”\nTom stood next to him, and said slowly, “I was just wondering . . . well, that cold stuff you gave me earlier, that tasted really good. I didn’t know if you had any more left . . . ”\nHe laughed. “Sorry, guy. Maybe tomorrow. How come you’re not with your mom and dad at the meeting?”\nTom said, “My sister Ruth is suppose to be watching us, but I snuck out of my room and came here. I was bored.”\n“Well, boredom can be good, if it means something will happen. Tell you what, Tom, wait a couple of minutes, I’ll show you something special.”\n“What’s that?”\n“You just wait and I’ll show you.”\nRick folded his hands together in his lap, looked over at the southeast. Years and years ago, that part of the night sky would be a light yellow glow, the lights from the cities in that part of the state. Now, like every other part of the night sky, there was just blackness and the stars, the night sky now back where it had once been, almost two centuries ago.\nThere. Right there. A dot of light, moving up and away from the horizon.\n“Take a look, Tom. See that moving light?”\n“Unh-hunh.”\n“Good. Just keep your eye on it. Look at it go.”\nThe solid point of light rose up higher and seemed brighter, and he found his hands were tingling and his chest was getting tighter. Oh God, how beautiful, how beautiful it had been up there, looking down on the great globe, watching the world unfold beneath you, slow and majestic and lovely, knowing that as expensive and ill-designed and over-budget and late in being built, it was there, the first permanent outpost for humanity, the first step in reaching out to the planets and stars that were humanity’s destiny . . .\nThe crickets seemed louder. An owl out in the woods hoo-hoo’ed, and beside him, Tom said, “What is it, Mister Monroe?”\nThe light seemed to fade some, and then it disappeared behind some tall pines, and Rick found that his eyes had gotten moist. He wiped at them and said, “What do you think it was?”\n“I dunno. I sometimes see lights move at night, and momma tells me that it’s the Devil’s work, and I shouldn’t look at ‘em. Is that true?”\nHe rubbed at his chin, thought for a moment about just letting the boy be, let him grow up with his illusions and whatever misbegotten faith his mother had put in his head, let him think about farming and hunting and fishing, to concentrate on what was real, what was necessary, which was getting enough food to eat and a warm place and—\nNo! the voice inside him shouted. No, that’s not fair, to condemn this boy and the others to a life of peasantry, just because of some wrong things that had been done, years before the child was even born. He shook his head and said, “Well, I can see why some people would think it’s the Devil’s work, but the truth is, Tom, that was a building up there. A building made by men and women and put up in the sky, more than a hundred miles up.”\nTom sounded skeptical. “Then how come it doesn’t fall down?”\nGreat, the voice said. Shall we give him a lecture about Newton? What do you suggest?\nHe thought for a moment and said, “It’s complex, and I don’t want to bore you, Tom. But trust me, it’s up there. In fact, it’s still up there and will be for a while. Even though nobody’s living in it right now.”\nTom looked up and said, “Where is it now?”\n“Oh, I imagine it’s over Canada by now. You see, it goes around the whole globe in what’s called an orbit. Only takes about ninety minutes or so.”\nTom seemed to think about that and said shyly, “My dad. He once said you were something. A spaceman. That you went to the stars. Is that true?”\n“True enough. We never made it to the stars, though we sure thought about it a lot.”\n“He said you flew up in the air. Like a bird. And the places you went, high enough, you had to carry your own air with you. Is that true, too?”\n“Yes, it is.”\n“Jeez. You know, my momma, well . . . ”\n“Your momma, she doesn’t quite like me, does she?”\n“Unh-hunh. She says you’re not good. You’re unholy. And some other stuff.”\nRick thought about telling the boy the truth about his mother, decided it could wait until the child got older. God willing, the boy would learn soon enough about his mother. Aloud Rick said, “I’m going back to my house. Would you like to get something?”\n“Another cold treat?” came the hopeful voice.\n“No, not tonight. Maybe tomorrow. Tonight, well, tonight I want to give you something that’ll last longer than any treat.”\nA few minutes later they were up in his office, Tom talking all the while about the fishing he had done so far this summer, the sleep-outs in the back pasture, and about his cousin Lloyd, who lived in the next town over, Hancock, and who died of something called polio. Rick shivered at the matter of fact way Tom had mentioned his cousin’s death. A generation ago, a death like that would have never happened. Hell, a generation ago, if somebody of Tom’s age had died, the poor kid would have been shoved into counseling sessions and group therapies, trying to get closure about the damn thing. And now? Just part of growing up.\nIn his office Tom ooh’ed and aaah’ed over the photos on his wall, and Rick explained the best he could of what they were about. “Well, that’s the dot of light we just saw. It’s actually called a space station. Over there, that’s what you used to fly up to the space station. It’s called a space shuttle. Or a rocket, if you prefer. This . . . this is a picture of me, up in the space station.”\n“Really?” Tom asked. “You were really there?”\nHe found he had to sit down, so he did, his damn hips aching something fierce. “Yes, I was really up there. One of the last people up there, to tell you the truth, Tom. Just before, well . . . just before everything changed.”\nTom stood before a beautiful photo of a full moon, the craters and mountains and flat seas looking as sharp as if they were made yesterday. He said, “Momma said that it was God who punished the world back then, because men were evil, because they ignored God. Is that true, Mister Monroe? What really happened back then?”\nHis fists suddenly clenched, as if powered by memory. Where to begin, young man, he thought. Where to begin. Let’s talk about a time when computers were in everything, from your car to your toaster to your department store cash register. Everything linked up and interconnected. And when the systems are getting more and more complex, the childish ones, the vandals, the destructive hackers, they have to prove that they have the knowledge and skills and wherewithal to take down a system. Oh, the defenses grew stronger and stronger, as did the viruses, and the evil ones redoubled their efforts, like the true Vandals coming into Rome, burning and destroying something that somebody else created. The defenses grew more in-depth, the attacks more determined, until one bright soul—if such a creature could be determined to have a soul—came up with ultimate computer virus. No, not one that wormed its way into software through backdoors or anything fancy like that. Nossir. This virus was one that attacked the hardware, the platforms, that spread—God knows how—theories ranged from human touch to actual impulses over fiber optics—and destroyed the chips. That’s all. Just ate the chips and left burnt-out crumbs behind, so that in days, almost every thing in the world that used a computer was silent, dark and dead.\nOh, he was a smart one—for the worst of the hackers were always male—whoever he was, and Rick often wished that the designer of the ultimate virus (called the Final Virus, for a very good reason) had been on an aircraft or an operating room table when it had struck. For when the computers sputtered out and died, the chaos that was unleashed upon the world . . . Cars, buses, trains, trucks. Dead, not moving. Hundreds of thousands of people, stranded far from home. Aircraft falling out of the skies. Ships at sea, slowly drifting, unable to maneuver. Stock markets, banks, corporations, everything and any thing that stored the wealth of a nation in electronic impulses, silent. All the interconnections that fed and clothed and fueled and protected and sheltered most of the world’s billions had snapped apart, like brittle rubber bands. Within days the cities had become uninhabitable, as millions streamed into the countryside. Governments wavered and collapsed. Communications were sparse, for networks and radio stations and the cable stations were off the air as well. Rumors and fear spread like a plague itself, and the Four Horsemen of the Apocalypse—called out from retirement at last—swept through almost the entire world.\nThere were a few places that remained untouched: Antarctica and a few remote islands. But for the rest of the world . . . sometimes the only light on the nightside of the planet were the funeral pyres, where the bodies were being burnt.\nHe grew nauseous, remembering what had happened to him and how it took him months to walk back here, to his childhood home, and he repressed the memory of eating something a farmer had offered him—it hadn’t exactly looked like dog, but God, he had been so hungry—and he looked over to young Tom. How could he even begin to tell such a story to such an innocent lad?\nHe wouldn’t. He composed himself and said, “No, God didn’t punish us back then. We did. It was a wonderful world, Tom, a wonderful place. It wasn’t perfect and many people did ignore God, did ignore many good things . . . but we did things. We fed people and cured them and some of us, well, some of us planned to go to the stars.”\nHe went up to the wall, took down the picture of the International Space Station, the Big Boy himself, and pointed it out to Tom. “Men and women built that on the ground, Tom, and brought it up into space. They did it for good, to learn things, to start a way for us to go back to the moon and to Mars. To explore. There was no evil there. None.”\nTom looked at the picture and said, “And that’s the dot of light we saw? Far up in the sky?”\n“Yes.”\n“And what’s going to happen to it?”\nHe looked at the framed photo, noticed his hands shaking some. He put the photo back up on the wall. “One of these days, it’s going to get lower and lower. It just happens. Things up in orbit can’t stay up there forever. Unless somebody can go up there and do something . . . it’ll come crashing down.”\nHe sat down in the chair, winced again at the shooting pains in his hips. There was a time when he could have had new hips, new knees, or—if need be—new kidneys, but it was going to take a long time for those days to ever come back. From his infrequent letters from Brian, he knew that work was still continuing in some isolated and protected labs, to find an answer to the Final Virus. But with people starving and cities still unlit, most of the whole damn country had fallen back to the late 1800s, when power was provided by muscles, horses, or steam. Computers would just have to wait.\nTom said, “I hope it doesn’t happen, Mister Monroe. It sounds really cool.”\nRick said, “Well, maybe when you grow up, if you’re really smart, you can go up there and fix it. And think about me when you’re doing it. Does that sound like fun?”\nThe boy nodded and Rick remembered why he had brought the poor kid up here. He got out of his chair, went over to his bookshelf, started moving around the thick volumes and such, until he found a slim book, a book he had bought once for a future child, for one day he had promised Kathy Meserve that once he left the astronaut corps, he would marry her . . . . Poor Kathy, in London on a business trip, whom he had never seen or heard from, ever again, after the Final Virus had broken out.\nHe came over to Tom and gave him the book. It was old but the cover was still bright, and it said, MY FIRST BOOK ON SPACE TRAVEL. Rick said, “You can read, can’t you?”\n“Unh-hunh, I sure can.”\n“Okay.” He rubbed at the boy’s head, not wanting to think of Kathy Meserve or the children he never had. “You take this home and read it. You can learn a lot about the stars and planets and what it was like, to explore space and build the first space station. Maybe you can get back up there, Tom.” Or your children’s children, he thought, but why bring that depressing thought up. “Maybe you can be what I was, a long time ago.”\nTom’s voice was solemn. “A star man?”\nRick shook his head. “No, nothing fancy like that. An astronaut. That’s all. Look, it’s getting late. Why don’t you head home.”\nAnd the young boy ran from his office, holding the old book in his hands, as if scared Rick was going to change his mind and take it away from him.\nIt was the sound of the horses that woke him, neighing and moving about in his yard, early in the morning. He got out of bed, cursed his stiff joints, and slowly got dressed. At the foot of the bed was a knapsack, for he knew a suitcase would not work. He picked up the knapsack—which he had put together last night—and walked downstairs, walked slowly, as he noticed the woodwork and craftsmanship that a long forgotten great-great-great grandfather had put into building this house, which he was now leaving.\nHe went out on the front porch, shaded his eyes from the hot morning sun. There were six or seven horses in his front yard, three horse-drawn wagons, and a knot of people in front. Some children were clustered out under the maple tree by the road, their parents no doubt telling them to stay away. He recognized all of the faces in the crowd, but was pleased to see that Glen Roundell, the store owner and one of the three selectmen, was not there, as well as Henry Cooper, but Henry’s wife Marcia was there, thin-lipped and perpetually angry, and she strode forward, holding something at her side. She wore a long cotton skirt and long-sleeve shirt—and that insistent voice inside his head wondered why again, with technology having tumbled two hundred years, why did fashion have to follow suit?—and she announced loudly, “Rick Monroe, you know why we’re here, don’t you.”\n“Mrs. Cooper, I’m sure I have some idea, but why don’t you inform me, in case I’m mistaken. I know that of your many fine attributes, correcting the mistakes of others is your finest.”\nShe looked around the crowd, as if seeking their support, and she pressed on, even though there was a smile or two at his comment. “At a special town meeting last night, it was decided by a majority of the town to suspend your residency here, in Boston Falls, due to your past crimes and present immorality.”\n“Crimes?” In the crowd he noticed a man in a faded and patched uniform, and he said, “Chief Godin. You know me. What crimes have I committed?”\nChief Sam Godin looked embarrassed. A kid of about twenty-two or thereabouts, he was the Chief because he had strong hands and was a good shot. The uniform shirt he wore was twice as old as he was, but he wore it proudly, since it represented his office.\nToday, though, he looked like he would rather be wearing anything else. He seemed to blush and said, “Gee, Mister Monroe . . . no crimes here, since you’ve moved back. But there’s been talk of what you did, back then, before . . . before the change. You were a scientist or something. Worked with computers. Maybe had something to do with the change, that’s the kind of crimes that we were thinking about.”\nRick sighed. “Very good. That’s the crime I’ve been accused of, of being educated. That I can accept. But immoral? Where’s your proof?”\n“Right here,” Marcia Cooper said triumphantly. “See? This old magazine, with depraved photos and lustful women . . . kept in your house, to show any youngster that came by. Do you deny having this in your possession?”\nAnd despite it all, he felt like laughing, for Mrs. Cooper was holding up—and holding up tight so nothing inside would be shown, of course—an ancient copy of Playboy magazine. The damn thing had been in his office, and sometimes he would just glance though the slick pages and sigh at a world—and a type of woman—long gone. Then something came to him and he saw another woman in the crowd, arms folded tight, staring in distaste towards him. It all clicked.\n“No, I don’t deny it,” Rick said, “and I also don’t deny that Mrs. Chandler, for once in her life, did a good job cleaning my house. Find anything else in there, Mrs. Chandler, you’d like to pass on to your neighboors?”\nShe just glared, said nothing. He looked up at the sun. It was going to be another hot day.\nThe Chief stepped forward and said, “We don’t want any trouble, Mister Monroe. But it’s now the law. You have to leave.”\nHe picked up his knapsack, shrugged his arms through the frayed straps, almost gasped at the heavy weight back there. “I know.”\nThe Chief said, “If you want, I can get you a ride to one of the next towns over, save you—”\n“No,” he said, not surprised at how harsh he responded. “No, I’m not taking any of your damn charity. By God years ago I walked into this town alone, and I’ll walk out of this town alone as well.”\nWhich is what he started to do, coming down the creaky steps, across the unwatered lawn. The crowd in front of him slowly gave way, like they were afraid he was infected or some damn thing. He looked at their dirty faces, the ignorant looks, the harsh stares, and he couldn’t help himself. He stopped and said, “You know, I pity you. If it hadn’t been for some unknown clown, years ago, you wouldn’t be here. You’d be on a powerboat in a lake. You’d be in an air-conditioned mall, shopping. You’d be talking to each other over frozen drinks on where to fly to vacation this winter. That’s what you’d be doing.”\nMarcia Cooper said, “It was God’s will. That’s all.”\nRick shook his head. “No, it was some idiot’s will, and because of that, you’ve grown up to be peasants. God save you and your children.”\nThey stayed silent but he noticed that some of the younger men were looking fidgety, and were sparing glances to the Chief, like they were wondering if the Chief would intervene if they decided to stone him or some damn thing. Time to get going, and he tried not to think of the long miles that were waiting for him. Just one step after another, that’s all. Maybe, if his knees and hips held together, he could get to the train station in Concord. Maybe. Take Brian up on his offer. He made it out to the dirt road, decided to head left, up to Greenwich, for he didn’t want to walk through town. Why tempt fate?\nHe turned and looked one last time at his house, and then looked over to the old maple tree, where some of the children, bored by what had been going on, were now scurrying around the tree trunk.\nBut not all of the children.\nOne of them was by himself, at the road’s edge. He looked nervous, and he raised his shirt, and even at this distance, he could make out young Tom Cooper, standing there, his gift of a book hidden away in the waistband of his jeans. Tom lowered his shirt and then waved, and Rick, surprised, smiled and waved back.\nAnd then he turned his back on his home and his town, and started walking away.\nOriginally published in Space Stations, edited by Martin Greenberg and John Helfers, 2010.\nBrendan DuBois has twice received the Shamus Award from the Private Eye Writers of America, been nominated three times for the Edgar Allan Poe Award given by the Mystery Writers of America, and has had stories reprinted in The Best American Mystery Stories of the Century and The Best American Noir of the Century. He's the author of sixteen novels and over one hundred and thirty short stories. His SF novels include Resurrection Day and Six Days. His most recent novel is Deadly Cove, part of the \"Lewis Cole\" mystery series, which also includes Dead Sand, Black Tide, Shattered Shell, Killer Waves, and Buried Dreams. He is also a \"Jeopardy!\" gameshow champion. He lives in Exeter, NH with his family.", "source": "https://clarkesworldmagazine.com/dubois_09_14_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Falling Star by Brendan DuBois"}