{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "LBxx63SFF39f9jUS2sDg5U2zt6w=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Something Greater: An Epic Discussion of Epic Fantasy, Part 1  Introduction  \"Fantasy,\" said Elizabeth Bear, the author of The Sea Thy Mistress and the forthcoming The Tempering of Men (with Sarah Monette), \"is the purest form of the imagination, and it gives us courage and persistence.\"  It gives us courage and persistence.  \"Epic Fantasy is built into us, part of our most fundamental human fabric, and in a way it has a sacredness that all stems from our paradoxical awareness of our own mortality,\" said Erin Hoffman, author of Sword of Fire and Sea. \"We know what it is to imagine immortality, and yet we die. That is Epic Fantasy.  Awareness of our own mortality.  There are many types of fantasy—as many types, it seems, as there are stories. Marketing categories, reader expectations, literary styles and tastes—these days fantasy is sub-divided into many sub-genres, such as Urban, Paranormal, Dark, Heroic, Young Adult, Sword and Sorcery, Epic, and more.  These designations have value—among other things, they help readers know what they are getting and they help writers meet (or subvert) readers' expectations. These designations also speak to the long and rich tradition of fantastic literature.  \"Epic Fantasy is The Iliad to Sword and Sorcery's Odyssey,\" said Lou Anders, the editorial director of Pyr Books and co-editor with Jonathan Strahan of Swords & Dark Magic.  Another useful exercise might be to consider the differences between Robert E. Howard's Conan stories or Fritz Leiber's Fafhrd and Gray Mouser stories (Sword and Sorcery) and J. R. R. Tolkien's Lord of the Rings (Epic Fantasy).  The Iliad or The Odyssey, Howard, Leiber, or Tolkien... there's still a lot of room for discussion.  \"I don't believe genre definitions should be prescriptive, erecting fences and portioning off territories, so much as descriptive, attempts to pinpoint the center of the map but leaving lots of fun gray regions at the borders,\" said Anders.  The goal of this (epic) discussion, in keeping with Anders' caveat, is to describe Epic Fantasy from the point of view of some of the authors who write it. (Or who don't write it. Interestingly, a number of the writers who participated don't think of themselves as writers of Epic Fantasy.)  \"Epic Fantasy is a wonderfully broad field in 2011—far more so than when I took on Robert Jordan's Eye of the World for Orbit in the UK, over 20 years ago,\" said John Jarrold, a literary agent and editor. \"Even then, elves and dwarves were not mandatory, post-Tolkien, but in the last decade—with China Mieville's Bas-Lag, Naomi Novik's Napoleonic dragons, Scott Lynch's Italianate novels, Robert V S Redick's shipboard epics, Joe Abercrombie's darkly witty characters and many others—an author has been able to explore in different areas than was the case in the late 80s/early 90s. This is as exciting a time in the genre as I have ever seen.\"  \"Epic Fantasy\" is gloriously broad, vague, and... resonant. It may be hard to define Epic Fantasy succinctly (though if anyone could it'd be Elizabeth Bear), but we know what Epic Fantasy is and isn't. We know it when we read it, when we hear it. We feel it in our bones. The goal of this round-table discussion, therefore, is to describe Epic Fantasy and to try to illustrate the broadness—the grand sweep, the bigness, and scope—of it.  In truth, this was supposed to be a relatively small discussion with four or five authors, but it kept growing. It got out of control very quickly. Each set of responses I received led me in the direction of another author, and another, and another. A total of 26 authors—13 women and 13 men—as well as an editor and a literary agent (who is a former editor) participated.  The 28 participants are at varying places in their careers—some have been publishing for decades (Terry Brooks, Kate Elliott, Steven Erikson), others await the publication of their first novel (Gaie Sebold), and the majority are somewhere in between. There are New York Times best-selling authors and rising stars from the smaller presses. One is a video game designer by day (Erin Hoffman) and another works in the music industry (Peter Orullian). The following authors participate as well: Lou Anders, James Barclay, Elizabeth Bear, Trudi Canavan, Rowena Cory Daniells, David Anthony Durham, Ian C. Esslemont, Lynn Flewelling, Ed Greenwood, John Jarrold, N. K. Jemisin, K. V. Johansen, J. V. Jones, Paul Kearney, Juliet McKenna, Robin McKinley, Robert V. S. Redick, Patrick Rothfuss, Brandon Sanderson, Michael A. Stackpole, Victoria Strauss, and Gav Thorpe. Refer to the Dramatis Personae for more information about each author and for links to their web-pages. My guess (and hope) is that you'll find many new authors to read.  Lastly, not everyone accepted my invitation to participate in this discussion. Most did, but some had scheduling conflicts or felt strongly that they did not write Epic Fantasy and should not, therefore, participate. Not every participant answered every question. Some answered more expansively than others. I did not cut anyone's responses significantly, but I did arrange them for flow and impact.  And now... let us begin the discussion—begin to speak of stage and scope, grandness and epicness, moral choices and sense of wonder, moments of magnificence and affirmations of good in the world. Yes, the participants cover the expected topics, and they go in unexpected directions as well.  \"Beyond the world-shaking events in imaginary universes, archetypal battles between good and evil (or, more and more these days, between not-really-so-good-at-all and evil),\" said Victoria Strauss, the author of The Burning Land and The Awakened City. \"I think that Epic Fantasy is, at its heart, about meaning and significance.\"  About meaning and significance.  \"In Epic Fantasy,\" added Strauss, \"the principal characters' lives and actions acquire immense meaning and importance within the pattern of a series of hugely significant events. Their lives matter. This is the very opposite of most people's real lives, and one of the major reasons, I think, why Epic Fantasy has such enduring appeal.\"  Let us begin:  What is at the heart (or core) of Epic Fantasy?  J. V. Jones: It's about a character discovering a world along with the reader. Epic Fantasy is all about the sense of wonder that comes from exploring. We get to enter crumbled-down castles and sea caves, ride across deserts baked as hard as glass, and build campfires against unknowable forces. Epic Fantasy is a world not bound by earthly limitations, and characters trying to keep themselves and their loved ones safe within it.  Terry Brooks: An element of magic without which the story fails to work. That's the short answer. Really, there are so many different kinds of fantasies that the elements necessary to make them complete vary widely. Shannara is Epic Fantasy in the Tolkien tradition, requiring a quest, a little band of heroes, a penultimate confrontation between good and evil and the aforesaid element of magic which makes the whole thing work. But, you know what? While I know I am labeled a fantasy writer, that's not how I think of myself. I think of myself as an adventure story writer.  N. K. Jemisin: The epic. The ancient stories that have so enthralled people since they were first told—the Sundiata Cycle, Gilgamesh, The Iliad and The Odyssey, The Ramayana... Every culture has these tales in some form, and the need to hear them is embedded in our species, I think. So naturally, even though we now write them down and have folded and spindled the epic forms into a new structure, we still crave the old thrill.  Trudi Canavan: Bigness. Whether it be size of the world, the length of the tale or the number of books—or combinations of these. But not ideas. A book can have big ideas, but not be \"epic\" fantasy.  Unfortunately, the label \"epic\" seems to be applied to a lot of fantasy that doesn't really qualify, and that's a bit unfair to both true Epic Fantasy and fantasy that is not epic, just as it grates when anyone describes all fantasy as \"quest\" fantasy. Fantasy is a very broad and varied genre, and lumping it all under one type is never satisfactory.  Elizabeth Bear: Well, that's kind of a can of worms, isn't it? There are a lot of different answers, and a lot of different arguments. Fantasy's detractors often try to argue that it's in some way a morally inferior kind of literature: it's \"not real,\" \"escapist,\" \"consolatory,\" \"backwards looking,\" \"monarchist,\" \"made up.\" It divides the world into good and evil, black and white, without shades of gray. But I would argue that at its finest, fantasy is the exact opposite of those things. Fantasy can serve as a kind of hyper-reality, a social allegory. It is uniquely capable of compressing the scope of human experience into a narrative—and I think that's what can make it epic, or give it that epic feel. It can illuminate good and bad, motive and desire.  Michael A Stackpole: Short question that requires a long answer. A quest is usually one critical component; but I think having events which will reshape the world is also critical. Imagine the world before and after Prometheus gave man fire. The changes need to be that earth-shattering or epoch-breaking. Lord of the Rings certainly does that; and I think other good Epic Fantasy does it as well. If that is not what is happening, then the challenges and threats don't seem as real or have as much gravity. Dynamic pressures and efforts are what make for great stories.  Peter Orullian: I often feel as though a novel's \"epicness\" is defined by the reader's experience, and certainly by the definition any given reader may use to categorize a given book. One could argue that the intimate examination of a single character battling personal demons—whether evil with a capital \"E\" or, say, addiction—could prove an epic tale. But in terms of answering your question, that way lies madness, since then it's all then subjective.  For me, some things must exist for a fantasy novel to feel epic. And at least some of them would apply to epic storytelling in any genre. I think first of the stakes in the novel, which ties closely to the scale of the story. If my stakes are missing my morning cartoons because I've got to weed the garden, it ain't epic. Failure of my character to answer the story question has to have consequences that impact others besides the character himself. Could be, too, that my character fails. But there has to be risk on a broad scale. Yes, it's compelling to read about the risk of a single life, but for me that's a different genre of fantasy.  I'd also say that there has to be a strong family element. The example that leaps to mind is George R. R. Martin's A Song of Ice and Fire. But it can be equally said of something like The Godfather. Often, what you find is that the interplay of characters who share some familial relationship proves a microcosm of what is being acted out on the \"big stage\" in the book, even as those same characters are the ones who trod that \"big stage.\" Done correctly, the ravages of war that hold the fate of kingdoms in their grasp are made most poignant in the lives of your characters, who are likely seeing those they love, suffer or die. And sometimes, your character, himself, is the sacrificial lamb.  And related to the notion of stakes/scale, there needs to be an adversary. It needn't be the devil. But it's got to be more than a robber. I'm glad to have the motivations of this antagonist explained; I'm even glad to be made to sympathize (after a fashion) with the \"bad guy.\" But at some point in epic storytelling there needs to be real conflict (which then plays against this idea of high stakes), and if there's no clear hero, however flawed, then I'm not invested in the outcome. Maudlin as it may sound, I want triumph of some resonant kind. I want to be thrilled. If I don't care who wins, what's the point?  Then, once you have ingredients like stakes, scope, family, adversary, I think you've got to have at least some actual fantasy elements: some mix of magic, second-world setting, invented races, swordplay, etc. I don't believe there's a set formula there, but in the absence of any of these, all the other things that make a tale epic are true of \"epicness\" in other literary forms.  Gav Thorpe: To be truly epic a story has to be world-changing. It has to deal with the fates of entire nations and races. It can deal with one individual or a whole host of characters, but by the end of the tale the world as it started out needs to have significantly changed, whether for better or worse. Even if the characters do not directly affect these wholesale changes, the events they are drawn into must be part of a large movement that sees a paradigm shift in the fictional world created. This could be the fall of the Dark Lord (such as The Lord of the Rings), a war for domination (Game of Thrones or my own The Crown of the Blood), or the rise of a new power (Chronicles of Narnia). Always the stage should be the whole (known) world and the scope should include all of the peoples of that world.  Gaie Sebold: I think for me it is big themes dealt with in a big way; it's cinemascope. As a reader, I love the sweep of it, the chance to feel thoroughly immersed in a world that's completely different from the everyday, but where the characters are believable people with real human responses. A good Epic Fantasy is like going on holiday to another world, a really good one is the sort where you don't want to come home.  K. V. Johansen: At its heart, what makes fantasy epic is its scope. The setting is usually more vast, the adventure is more far-ranging and more perilous, and what the hero is trying to achieve is greater than what, in that same world, an \"ordinary\" person might aspire to or be forced to cope with. I think it could be argued that Epic Fantasy's roots are in the oldest stories: Gilgamesh, The Iliad, The Odyssey, The Aeneid, right through Beowulf, the Nibelungenlied, the Arthurian cycle (the \"historical\" fictions building on Geoffrey of Monmouth, not the Romance tradition of Chretien de Troyes and the like, which is all about interactions between individuals and lacks a concrete setting), the Faerie Queene, Orlando Furioso. The Lord of the Rings is the modern archetype of Epic Fantasy.  The heroes in those precursors to Epic Fantasy, and in Lord of the Rings, are trying to do something that sets them apart; whether this is due to personal ambition, a desire for glory, a refusal to break some bond of loyalty or code of honor, or to fate or chance putting them in a position where the doom of a people or a world rests on them, doesn't make a difference to that. The fact that they are driven, by themselves or by circumstances, to become something greater than either their fellows or their earlier selves is one of the things that sets Epic Fantasy apart from, say, a fairy tale. No matter what is inspiring or forcing them into heroism, the adventures of the hero of Epic Fantasy are always something beyond what is expected of them, too. Whatever they're involved in stands out within their world as beyond the ordinary, cast into brighter light and deeper shadows: more tragic, more glorious.  Epic Fantasy always has a strong sense of place, in both the geographical and historical senses. The setting is almost always a world where things are happening off-stage, off the edges of the map and at earlier points in history, which are nevertheless going to affect the current story and be forces pushing on the hero, shaping him or her. Fairy-tales and romances (I'm still talking about medieval Romance here, not Harlequins) take place in a timeless world, in which there are mountains that are all mountains and any mountains, forests that are just \"the forest\". Even when the forest has a name, that's all it has. There's a king, who is the King, or perhaps he's Arthur or Charlemagne, but he's just a golden figure, part of the setting, and there's no attempt made or desired to root the story in any particular place and time, real or imagined. Epic Fantasy, which is today usually secondary world fantasy, has definite and specific reality, not only the story's \"here and now\", but a past that explains how things got to \"now\" and a landscape for \"here\" that leads off into \"there\" and an \"away beyond the hills\" that becomes complex and detailed as the hero's adventures and the storyteller's eye move into it.  James Barclay: Right at the absolute centre are the characters, just like in any genre. Who cares how wonderful your world is if your characters are cut from cereal boxes? I know authors and readers love the grand settings, vast creations and often very clever magic systems of Epic Fantasy but these are not what make it tick.  Lynn Flewelling: I think the core of Epic Fantasy is creating a story in which characters the reader cares about overcome great odds for some higher (at least in their minds) purpose. In some cases it's saving the known world, but it doesn't have to be. A number of my books have a more narrow focus: saving a friend or a country, righting a wrong for the greater good. There are all sorts of plots, but I think that is the theme that runs through them all. Who wants to read about a plowboy leaving home to become a chartered accountant? You need challenge and action, tension and drama.  Ed Greenwood: At the core of all good fiction, Epic Fantasy and otherwise, are the moral choices made by characters—characters the writer makes the reader care about. For good or bad, smart or foolish, these choices (Uriens in the movie Excalibur: \"I saw what I saw. The boy drew the sword.\") define the characters. They stand up for what they believe is right, or sacrifice themselves knowingly, or do \"what needs to be done,\" and inspire readers. Scenes of heroic choices lift the hearts of readers, make them feel that there is good in the world, let them revel in moments of magnificence (\"The boy stood up to the dragon! I saw it! I was there!\"), and feel better for having done so.  No one wants to read a story of unrelieved gloom, wherein sordid characters the reader loathes or despises do nasty things to each other, there is no order nor moments of kindness or good triumphing in any way, and good doesn't win in the end. The happy, just ending is a cliché because it works, because readers want it and wait for it and feel somehow cheated if they don't get it (and very cheated if there's no glimmer of good or \"rightness\" at story-end, at all).  Epic Fantasy is the genre of literature where we can see villainy most nakedly exposed, and where we expect to see heroes do their stuff. They may be reluctant heroes, they may be flawed (and these days, the prevailing cynical tastes of readers expect some measure of those flaws and that moral wrestling or self-doubt, taking such elements as validating \"realism\"), but we want to see them do the right thing. The daring, dangerous right thing. The, by George (not by the Dragon!), successful right thing.  Right in front of our eyes, we want to see the world saved, and made safer and happier for us all.  Elizabeth Bear: Our earliest human narratives are fantasies: stories of men and women fighting monsters with powers natural and supernatural, and refusing to back down. Innana descends into Hell and is stripped of everything but her courage and determination. Gilgamesh and Enlil are loyal to one another through all the world's woes. Loki is friend and foe of the Aesir all at once.  T.S. Eliot said, \"We fight rather to keep something alive than in the expectation that anything will triumph,\" and G.K. Chesterton (an enormously questionable fellow, but a pithy one) said, \"Fairy tales don't teach children that monsters exist. Children already know that monsters exist. Fairy tales teach children that monsters can be killed.\"  Somewhere in the tension between those two statements, I think, lies the core of Epic Fantasy. We need it. It gives us heart in the face of a world full of dark lords and unpalatable choices. Enron or Sauron, we are all fighting something bigger than we are.  Ian C. Esslemont: I take this question to really be asking what is Epic Fantasy anyway? Why is some fantasy epic but others not? Is it a redundancy? Perhaps all fantasy is \"epic\". After all, some of what defines an epic in the traditional sense can be summed up as: the central heroic figure (or antihero), dangerous journeys, numerous misadventures, a strong element of the supernatural, long passages of dialogue, digressions, subplots.  So why \"epic\" fantasy? For my money, works that can be considered Epic Fantasy are those that attempt to go beyond merely telling the story of the messy fall of one particular king, or the journeys of this or that hero or heroine, to try to tackle larger questions. Beowulf asked the listeners to think about the nature of rulership, and their own traditions of blood feud and its consequences; The Odyssey allowed its listeners exposure to alternative societies and other ways of living; other epics attempted to sum up the essence of their particular cultures or national identities.  This is the opportunity the epic provides. It allows the writer to ask the big questions: who are we? Where have we been? Where are we going?  One of the things I see Steve [Erikson] asking in his epic novels is the role of mythology in society. Is it dead? What purpose does or did it serve in any society? Do we still need it? Perhaps it is important and to turn our backs upon it is to harm part of what makes us human.  Steven Erikson: An easy answer to this would be to look at what constitutes Epic Fantasy in last decade or so, acknowledging the protean nature of any genre, suggesting that what was is no longer; and that what is has been built upon what came before. But before too long, I suspect, we'd get into a discussion of who represents Epic Fantasy, which works, which trends, which subjects of interest and so on, and I admit that pretty soon I'd be nodding off. Besides, nothing new has been invented in the genre, ever.  So I'll give you a different reason to nod off and offer up this (but I do so without taking any credit, only the blame, in that I'm going to repeat something Steve Donaldson said at an ICFA panel last month, and then riff on it): Epic Fantasy is at the core of all literature. Now, Steve cited The Iliad, Gilgamesh and a few other early works to back up his observation. Hard to disagree (I was arguing at the time that Epic Fantasy is at the core of Fantasy and that it needs to be addressed by scholars of the genre) and in one way Steve was riffing off of what I was saying. But I prefer his take over mine.  Groan if you will, but I actually take pleasure in going back to those ancient texts and looking at them again, this time in the context of what purpose they may have served, and whether these narrative structures can be extracted from the cultures that produced them, and thereafter applied, roughly, to the subgenre of Epic Fantasy as found in present-day SF&F sections of bookstores.  If we take the supernatural (in these old texts) as representative of capricious Nature, including the forces of chance, mischance, unknown (and unknowable) causes to known (observable) effects; and see in the dialogue between humans and those external forces/entities a kind of universal struggle against the vagaries of Nature, then we arrive at a basic and fundamental theme. Personification, anthropomorphism, all the mechanisms seeking to understand, explain, predict, now exist as an active backdrop against which personal, human dramas are played out. Remove the gods and their magical power and the dialogue ceases being a dialogue, and instead becomes a monologue, an increasingly desperate harangue in the face of an indifferent, unknowing and uncaring audience (Nature). We call that Realism, and as such proclaim it to be a pinnacle of truth and unclouded vision, a rational height achieved by virtue of ... well, growing up. But from this lofty height, all slopes lead down and prove slippery. As far as I can see, realist fiction invites the slide into nihilism more readily than does Fantasy. After all, in this world here, prayers go unanswered, and if any omniscient entity looks down on us, it is so alien as to understand nothing of our needs and merely observes in helpless bafflement — one might even argue that life itself is the prayer and the only answer it ever earns is death. I'll know more about that after I die, and I'll get back to you on that.  Digressing. The distinction of \"epic\" seems to me to speak to that vastness of backdrop, wherein a dialogue is asserted, where metaphors are made real, and the struggle of living is conveyed in terms of high drama and a resonance that spans the human condition. As with The Iliad and Gilgamesh. Other, non-Epic forms of Fantasy are more modest variations on the theme, skirting the ledge but not quite taking the leap. Maybe in the end, the definition of Epic comes down to the author's own scope of vision. Of course, it can be argued that one can go inward easily as far as one can reach outward, and 'epic-ness' can exist in a wholly human drama, and we tend to call this ... um, literary and then apply to it some kind of exclusivity.  Steve's right, I think. Epic Fantasy is at the core of all literature. I first thought of it as the \"spine\" but maybe a tree is a better analogy. Writers of Epic Fantasy have crawled off the dangling leaf, onto the twig and then the branch, straight back to the trunk. Somewhere behind, very distant now, the leaves rustle in eternal agitation, each one crying out \"I am the centre of the universe! Look at me!\" Now, before everyone goes wild on value judgments, let me go back to what might be the most controversial thing I threw into this meager essay: nothing new has been invented in the genre, ever. In terms of literary evolution, we're the ones who never left, lost in the thick bark, antennae waving fruitlessly.  Conversely to all of that, maybe Homer and the poet who penned Gilgamesh just liked inventing things — another universal human trait — and so do we.  Erin Hoffman: I think of Epic Fantasy as the archetype's archetype. Most people are familiar with Campbell's Hero with a Thousand Faces, but I prefer a variation on this that combines Darwinian biological theory with Kierkegaardian psychological existentialism (how many dollar's worth of words was that?) put together by Ernest Becker in the early 70s. Basically, as a result of our biology and fundamental human psychology we have certain inherent expectations about cause and effect in the world—a kind of physics of our souls. This is why a story's ending can feel right or wrong, and why some stories seem to resonate with us so strongly that they stick with us our entire lives.  Paul Kearney: The heart (or core) of Epic Fantasy? That must vary, I think, according to the writer's own bent. For me, it's a chance to tackle all sorts of issues on a grand scale, the macro of nation versus nation as opposed to the micro of minutiae in interpersonal relationships. Not that interpersonal relations are not essential to Epic Fantasy, but there can be a lot more riding on them, and hence they get an extra charge. Also, it seems to me that decision-making and basic emotions can be invested with so much more resonance when there is a lot more riding on them—the fate of armies, kingdoms, whole peoples.  Juliet McKenna: As with any story, the core of fiction is an exploration of the human condition. Which is to say, life, love, loss, the pursuit of wealth, health and happiness — or vengeance if that's the way one or more of the above play out.  Epic Fantasy draws on history, myth and folklore for its narrative threads and themes, offering the reader sufficient familiarity for engagement in a secondary world while leaving enough uncertainty to keep them alert and questioning. Since we must continually examine our assumptions about this strange place, its inhabitants, its customs and practices, we find ourselves examining our assumptions about our own world.  And that cultural and artistic heritage offers the fantasy writer swords, sorcery, dragons, monsters, heroes, villains, and countless other dramatic story-telling resources, facilitating such exploration of the human condition in the context of adventures bristling with magical possibilities. What's not to love?  Patrick Rothfuss: It depends on who you ask, really. In my opinion, Epic Fantasy is one of the most vaguely-defined genres out there.  It's sort of like \"pornography\" or \"art.\" Most everyone uses those terms very loosely, and they don't really have a definition for them. They operate under a policy of \"I know what it is when I see it.\"  With Epic Fantasy, the real question is what part of the story is supposed to be epic? The action? The length of time depicted? The length of the actual books?  I've heard some people say that the difference is the detail involved in the description of the world. But that seems like a pretty weak defining characteristic to me. If that were the case, most science fiction would be epic. But people don't think of it that way.  I don't claim to know, myself. But I think the rule of thumb most people use is the length of the books. If a book is more than 500 pages long, most people call it Epic Fantasy.  Robin McKinley: Epic Fantasy—I haven't the least idea what's at the heart of Epic Fantasy as opposed to unEpic Fantasy, or urban fantasy, or hard-core heavy-metal science fiction or cozy murder mysteries about cats and knitting or the Commander Toad series. I would say that the heart of any good read is the liveness of it—its own beating heart. When I think specifically of Epic Fantasy I'm afraid I still think of Lord of the Rings [LOTR] ... and then there's a long pause before any other, more modern authors occur to me.  When I was growing up LOTR was all there was—LOTR was in the process of creating a new genre. (I liked E. R. R. Eddison and was mesmerized by Gormenghast, but LOTR was the grail attained.) What's the heart of LOTR? Story. And Tolkien writes very well about \"Story\", too. I recommend Tree and Leaf to anyone who doesn't know it: just as true now as it was 50 years ago.  I might suggest that because Epic Fantasy is so, well, epic, that hanging on to that sense of the liveness at the heart of your story is perhaps even more crucial when it's sprawling across a huge terrain. Not to mention more difficult to maintain. (See below.) But this does highlight one aspect of what I think of when I think of \"epic\" fantasy—that however many books there are of the story, it's still only one story. It's not just any series with a repeating character or characters, or the history of a country or an artifact or a school of magic—unless there's some comprehensive, overarching background structure that leads to some kind of really final climax. It also needs some of what the clichéd use of \"epic\" usually means in any context: grandeur, sweep, scope. It may be about rabbits or accountants, but it needs to feel Miltonian. All of which the poor sweating author has to keep track of through all 1,000,000,000,000 words. (I assume that anyone interested in a discussion of the parameters of Epic Fantasy will know that Tolkien wanted LOTR published as one book, and kicked like the dickens against his publisher saying three separate volumes or we won't do it.)  Even if I am finally able to write all the seven or so Third Damar Novels that hang around in my mental shadows snickering to themselves and not quite letting me see or guess enough to get them down on paper, I doubt Damar will belatedly prove to be an epic. When I wrote the first two Damar novels all those years ago and before I realized I was about to hit the wall, I called it a Series of Indefinite Length—not an epic. Nor do I think it has the gravitas for an epic; but I'm not going to try to define what suitable gravitas is.  But I'm still someone who grew up re-reading Tolkien till LOTR sank ineradicably into my bones. There may be other definitions of Epic Fantasy now, or a widening of the boundaries.  Brandon Sanderson: What's at the heart of Epic Fantasy? That's a tough one. We have a hard enough time deciding what strictly is science fiction and what strictly is fantasy, let alone talking about the subgenres. But this is something I've thought about a lot. When I released my first book, Elantris, which was a standalone, everyone called it an Epic Fantasy. In my head, I hadn't thought of it as an Epic Fantasy. For me, \"epic\" means covering a large span of time or a large geographic area, over multiple books, dealing with the rise and fall of nations. No single one of those things is absolutely essential, but these are the feelings that Epic Fantasy invokes for me. At the same time, you can have an epic in one volume—I would certainly consider Tigana by Guy Gavriel Kay to be epic. Most of his work is, and a lot of his books are single volumes.  What's at the core of Epic Fantasy? I would say that it's a sense of grandness, whether it's grandness in scope of the number of books—but of course I wouldn't call something like Dirk Pitt epic despite the fact that there are many books about him. There's a grandness in theme, a grandness in the types of characters that we're dealing with.  It's one of those things that I'm not sure you can really define. It's more a \"you know it when you see it\" sort of thing.  Rowena Cory Daniells: I don't believe the media really reflects our world. I believe the majority of people are much better than the media makes them out to be. We only see the worst, the corrupt politicians and large corporations, the senseless deaths because of terrorists; meanwhile, the majority of people hold down jobs, feed their families, play with their pets, give to charity and look for greater meaning in their lives.  I'm not saying that Epic Fantasy gives \"greater\" meaning to people's lives, but it does deal with a cleaner world where people hold to \"old fashioned\" values like honor and loyalty, and it does offer hope for a better ending. In Epic Fantasy you expect the good guys to suffer, but win out in the end.  Robert V. S. Redick: Fortunately for us all, the heart of Epic Fantasy is a roomy one, and we'll never know all that it contains. I can only tell you what I find there: an amazed and fearful humility at the largeness of creation, at the scale of existence with which our own hearts and minds are (rather mysteriously) equipped to grapple, and at the deep capacity of our passage through life to change us, to bring us to a place irretrievably different from where we began. Usually this involves a physical passage, too—a journey—but there are epics like García Márquez's One Hundred Years of Solitude that create the same awe strictly by carrying us through time.  Kate Elliott: I can tell you what I enjoy most about Epic Fantasy. I like the sense that you're getting a wide lens view of a world, one that is punctuated by close-ups and medium shots. The word I would probably use to describe what I'm looking for in an epic is \"sweep,\" defined in my American Heritage Dictionary as (variously) \"to move or unbalance emotionally; to cause to depart, remove or destroy; to traverse with speed or intensity; to extend gracefully or majestically.\"  What that means is that for me the heart of Epic Fantasy is the emotional response it engenders in the reader. That emotional response is going to be something different for each reader rather than a static characteristic required for all. For me it's a teenage girl standing on a wind-swept promontory overlooking a vast landscape and distant ocean; she's got a bow and arrows slung over her back and a falcata at her hip, a faithful dog and horse at her side, sturdy boots and a cloak, and a long journey ahead of her. By which I don't mean that any story—not even mine—has to have that scene in it to be Epic Fantasy. I mean that when I read Epic Fantasy, I want to feel a sense of discovery and adventure and anticipation and vista.  Why do you write Epic Fantasy?  N. K. Jemisin: It's not a conscious choice. That's just the form in which the stories come into my head.  Michael A Stackpole: I write it because I enjoy it. I really like having a huge canvas that can be explored. I also really like world building (it's the gamer in me). Once the world is set, I do what I can to break it and get things moving into an interesting tale. The story's evolution fascinates me; and dealing with the consequences of such things is the challenge that keeps me going.  Erin Hoffman: Oh, I write everything I write because I can't help it. It's not a lot more complicated than that. I love worlds and I love story. I would create both if I were locked in a box at the bottom of the ocean. Epic Fantasy lets me tap into the symbolic and try to imagine new mythologies. It helps me dig into the meaning in my own life and try to express it in a way that connects with other people.  Ian C. Esslemont: Why do I write it? Right, good question. I'm currently sketching out some other projects. I considered them a break from what I am doing in Malaz. But now that I take another look at them I see that each and every one of them could be considered \"epic\" in their own way! It seems I can't get away from it no matter how far I think I've gone. So, my answer is that I write it because I have no choice: everything I try just comes out that way (so far).  As to why I write it... I'm not sure. I do remember that I was an indifferent student in school, until Dostoyevsky's Crime and Punishment was assigned in English. It completely transformed my expectations of the written word by its scope, its demands, its depth. There's one possible excuse for my problem: I was traumatized by a Russian novel as a child.  J. V. Jones: I write Epic Fantasy because I grew up reading it. Tolkien, Ursula K. Le Guin, T.H. White: they took me to places that felt so real that even when their stories ended, their worlds continued to exist. I want to create that same kind of robust fully-realized setting where readers can imagine themselves rattling around in it, entering fortresses, taking the roads, and freezing their butts off in the mountains.  Robert V. S. Redick: [I write Epic fantasy] because I dream it, and have been doing so pretty continuously since a friend brought me a copy of The Silver Chair from Europe after third grade. Innumerable books since then, along with a great deal of Dungeons & Dragons in my teenage years, gave it a unique place in my heart. I also believe in the power of epic stories. They fire the imagination so powerfully that they can leap over lesser barriers, forging connections between disparate minds and peoples. The Greek myths have done this for centuries; so has Shakespeare and Cervantes and Tolkien. I've seen the proof first-hand, everywhere I've traveled.  James Barclay: I'm not sure that I write Epic Fantasy. Not all the time, anyway. Certainly the Ascendants books are Epic Fantasy and they are vast indeed. But I'm not certain The Raven books count — they're Heroic Action Fantasy though the whole septology (if there ever could be such a word) is epic, I guess.  Oh, hang on, I do write Epic Fantasy, sorry.  I love writing it because I get to throw my characters into settings and situations completely removed from the 21st century. Places I have designed and where I get to make the rules—though none are outlandish because when all is said and done, your characters have to swim where you put them, not get swamped by wonder so to speak.  I love the escapist nature of Epic Fantasy. It is a fitting place for heroes and I enjoy writing about heroes and the conflict and complexity within them. And this was the genre I was drawn to when I was growing up. The effects of decades of reading it are lifelong and marvelous.  Terry Brooks: Wait a minute. You mean I have a choice? What I write is how I am built. I spent a lot of early years experimenting with every form of fiction you can imagine—even romance (terrible effort, by the way). What I discovered was that I was drawn to big, sprawling historical epics with lots of words and endless places to go. But I hate research. So that helped me decide to write about things that couldn't be second guessed. I like it that I invent everything and control everything in my stories. I like the challenge of creating the puzzle and then finding out how the pieces fit.  Now and then, I still get asked why I don't write legal thrillers. You were a lawyer, they say. Isn't that a long way from being a fantasy writer. Oh, no, I reply. It's only a short putt.  K. V. Johansen: This air stuff — why do you breathe it? For me, Epic Fantasy is the natural mode in which to tell a story. When I was quite small, one of my favorite games was adventuring, which mostly involved carefully packing snacks (they had to be things that would keep on the trail, like dried fruit) and then riding around and around the house on an imaginary horse. I don't recall that I ever actually got anywhere, defeated any villains, or battled any dragons, although there were always definitely dragons over the horizon, but still, it was the idea of travelling into new places, wandering unknown lands. And of course, the fact that horses and swords (and provisions) were vital to this. Perhaps underlying that is something that appeals to all of us at times, that element of going away and transforming yourself, and coming back something different, greater and grander and respected. That's very satisfying to the imagination, and partaking of that along with the hero is one of the pleasures of Epic Fantasy.  Or maybe the real reason I write Epic Fantasy is that at the age of eight I read The Lord of the Rings multiple times, and it sank into my marrow and told me, This is what Story means; this is what Language is; this is how words work magic.  Well, either way, for me, this is the shape that stories naturally take. I've written other things, kids' science fiction set in a small town, picture books, literary criticism, but when I get back to a nice big secondary world with lots of history evolving underneath as I write and the map starting to unroll off in all directions, it's as if I've put on a really comfortable old pair of boots, a sort of, \"Yeah, I'm home,\" feeling.  I also like writing about characters on the edges of things, on the edge of their society, not fitting there — on the edge of humanity, never quite what everybody else is, all my shapeshifters and demons and ... whatever Moth is. Epic Fantasy gives such characters room to move, to cut loose and find out what they can really be. Because they're on the edges, or are forced to the edges, they have the outsider's freedom to see clearly, and they can come back in like a storm and shake things up. Or they find that they have to, because they're not complete and utter outsiders either; they're not as remote from humanity as some of them (not mentioning any names) would like to think they are. They can't just walk away. (Well, if they did, they'd be different people than they are, and there wouldn't be a story.)  Gaie Sebold: I love the chance to explore, to create new worlds and new types of culture (this is all sounding a bit Star Trek, isn't it?), to stretch out. You don't necessarily need huge landscapes and a hundred characters in order to deal with big themes, but it's an enjoyable and immersive way of doing it. You can weave in several themes or ideas, or go into a really big one in detail, or both. And most importantly, it's fun. There's room to put in the oddities and the funky stuff— to play. If I can't dance, it's not my revolution, the saying goes; and if I can't play, why write?  Rowena Cory Daniells: Someone asked me the other day why I write fantasy. I said it was because I like to torture my characters. I was only half kidding. By creating a world I can extrapolate from real world events and test my characters, see what they're made of.  In King Rolen's Kin the three main characters face moral dilemmas that make them question what they believe to be right. In my new trilogy, The Outcast Chronicles, there is a race of people who are persecuted because of their gifts. Their leader is forced to make decisions for the good of the many. Just because fantasy is set on an invented world or subverts the rules of our world, doesn't mean it can also be used to the human condition. In fact, it gives the writer more freedom because they remove loaded nouns, (like Black of Jew), removing the associations and allowing the reader to identify with a character who might undergo challenges that they don't face in their everyday life.  The fantasy genre can work on several levels. It can deliver a rollicking read. It can deliver that sense of awe and wonder, and it can also be quite subversive as in the work of the wonderful Terry Pratchett.  Patrick Rothfuss: Honestly? I'm not sure I do [write Epic Fantasy]. As I mentioned above, if you think Epic Fantasy means \"big\" fantasy, then yeah. Sure, I write it. My books are long.  But if Epic Fantasy means a story that centers around clashing armies, apocalypses, and other titanic, world-changing events, then that's not really me.  Trudi Canavan: I never considered my first series, the Black Magician Trilogy, to be epic. The setting is too small. Now perhaps it qualifies because I have written/am writing four more books in that world. Together they have become quite an epic, but I didn't set out to write \"epic\".  The Age of the Five, my second trilogy, was intended to be epic. The setting was larger, with conflicts between continents rather than countries, and there were gods, immortals and thousands of years of history. The books, themselves, were bigger, too. Writing something \"big\" was fun, but no more fun than writing something on a smaller scale. It just suited the kind of story I was telling.  Steven Erikson: I did my share of leaf-fluttering. Then autumn arrived and I dried up and fell off. Hit the ground, joined the humus (smelling like shit), and bits of me went back to feeding the tree. Oh, fuck all that. I went back to the ancient texts because they spoke to me in ways nothing modern ever did. And I had a bone to pick with insensate Nature.  Also, because it's fun. I grew up reading E. R. Burroughs and R. E. Howard: adventure in exotic places. Later on it was Donaldson who showed me Fantasy's serious, adult side, and what was possible within the genre. It is not contradictory to say that it's fun being serious.  Ed Greenwood: I write Epic Fantasy because I love to read it, can never get enough of it, and feel good when I finish a satisfying scene or a book full of it. I want more of it. All of which really means I want to be happy and more carefree, to believe that there are heroes who will stand forth when things grow dark. I want to celebrate such people, tell tales of heroism (and warning of folly and that we need to stand on guard against ever-lurking evil) that soothe and gladden and inspire. I want to know that there is magic, that there are dragons—and that there are shining knights or bumbling wizards or scared but determined just plain folks who will endure or resist or pry into secrets or stand and fight, against evil. It gives me respite from the mundane frustrations of unfair life.  Paul Kearney: The big stage for me becomes another tool to ratchet up the intensity of pressure on characters. It brings into play such concepts as personal honor, political expediency versus personal decency, and is a good way to explore the self-sacrifice—or lack of it—which can define an individual caught in interesting times.  Plus, to be frank, I enjoy writing about military campaigns, political machinations, and clashes of culture and belief. All that can be done on the small stage as it were, but as I've said above, it's easier to turn the screw on characters when there is so much riding on their decisions.  Juliet McKenna: I'm a historian by inclination and education as well as a lifelong reader of fantasy fiction and myth. This is what sparks my imagination above all else and offers me an unparalleled depth and breadth of instinctive resources for story-telling purposes. While I read and enjoy SF, for example, I have nowhere near that same understanding of science and technology and so could not write it with anything approaching the same insight and passion.  David Anthony Durham: Why do I write Epic fantasy? Three reasons.  One: Because I owe my love of reading - and the writing career that grew out of it— to fantasy. I wasn't a reader until Tolkien and Le Guin and Alexander got their claws into me. After them, I was. I think this is true of many other readers and writers. A lot of us forget it when we become grown-ups and get focused on grown-up things. I didn't want to do that. So part of writing fantasy, for me, is an act of tribute to a genre that gave me so much when I desperately needed it.  Two: Stories of the fantastic are more fundamental to being human than any other kind of stories. As soon as we had the language to, we were telling tales of heroes slaying monsters and of gods doing battle. I don't think of fantasy as beginning with Tolkien— although he's clearly the single most important figure in terms of the contemporary fantastic novel. For me, The Epic of Gilgamesh is fantasy. The Iliad and The Odyssey are fantasy. Beowulf is fantasy. These works may have meant different things to the people that first heard them, but they all have a narrative flare to them that's truly epic. They're filled with bombast, courage or delusion to either aspire to or to learn from. Considering that, what more venerated genre could one write in?  Three: I love the unlimited creative possibilities of fantasy. I'd written three historical novels before starting the Acacia series. The third, Pride of Carthage, was about Hannibal's war with Rome. It was a massive conflict with amazing events and twists of fortune and inspired leadership. It was epic. Leaving that novel, I wanted another epic. The world building I'd done for the ancient world got me craving writing in an imagined world where I had more freedom to mash things together that were never mashed together in actual human history. How could I write a novel that mixed opium addiction with the Atlantic slave trade in a pre-industrial world that includes Nordic, African, European and Asian inspired cultures in the same empire, and introduce a foreign invasion that endangers them all, despite their differences? If I was writing straight history that wouldn't be possible. A lot of historical writers would probably never want to do something like that. I did, though. Fantasy was the obvious choice of genre that would allow me to recast all those things in one big package. With some magic, ancient curses, fantastical creatures at play as well. Gets my blood pumping.  Peter Orullian: I write Epic Fantasy for a love of many of those elements I mentioned earlier: scale, the exploration of family, etc, and setting all those things against the invention of a rich secondary world peopled with characters whose goals stand in opposition to each other.  Plus, ya know, magic, battle, like that.  Also, while it may be true that other genres allow for philosophical exploration, there's a sense in which fantasy lends itself better to this than its counterparts. I think this is because you're able to set aside definitions we use in our \"real\" world, and examine an idea without the baggage the real-world ascribes to that idea. Not that theme or social commentary is my aim, but the form allows for this to happen more organically, I think, than other genres do.  Brandon Sanderson: The simplest answer is that it's what I loved to read when I was younger, and what I still love to read. I think all of us as readers are deeply influenced by the first things we came to love. For me, those early books that I came to love were Melanie Rawn's Sunrunner books, and Tad Williams' Memory, Sorrow, and Thorn, and Robert Jordan's Wheel of Time. In those books I loved the depth of characterization you could go into.  I read lots of other things—I like to read widely—and it seems that in a shorter volume you can't dig into a culture, a world, and characters the same way you can in Epic Fantasy. I love to have a deep breadth of worldbuilding, and I love to have plots that span several books where when you get to the last one you say, \"Wow, that's what this was all about all along.\" I love to write that; I love to read it. So it's just what I love. It really comes down to that.  Victoria Strauss: Writing about meaning and significance is as much of an escape and a thrill for the author as reading it is for the reader, so that's one reason.  Another: I'm not an obsessive world builder, but I love the freedom of inventing and working with an imaginary setting, as well as the challenge of keeping my characters behaving like real people (as opposed to Campbellian archetypes) within it.  Also important to me is the way that an imaginary setting makes it possible to explore real-world themes and issues (such as, in my last two books, religious fundamentalism and oppression) without the baggage of real-world history.  Bottom line: I just like making up wonderful things!  Robin McKinley: I don't write Epic Fantasy.  When I was first contacted about contributing to this discussion, I laughed. But then I thought sure, why not? All good stories are Story, and the rest is details.  Having said that I don't write Epic Fantasy... I'm writing the nearest I've come to epic right now, and it's ruining my life and what remains of my mind. My last novel, Pegasus, was running long in its early drafts, and I was running late toward my deadline, as I usually am, and I finally thought, that's what's going on, oh, hey, saved—it's two books. And whacked it in half. I wasn't entirely happy about doing this, and since this meant Pegasus ends on a cliffhanger, my readers aren't happy about it either, not being used to this kind of treatment from me, but it did solve the immediate problem.  Now ... now I'm embroiled in, well, something pretty large and sprawly and possibly epic, and I'm even less happy. I think about people like George R. R. Martin or Patrick Rothfuss and I can't begin to imagine how they do it: how they keep track over that many words, that many pages, that many computer files, that many people, that many sub-plots and ramifications. How they—how the rest of you in this discussion—keep control. Of course all story-telling is a kind of deliberate losing control of what you're writing so your story can tell itself as well as possible through your fingers on the keyboard, the pen, or the bottle of root beer because you're using voice-recognition software. But this is a very specific, knife-edge kind of loss of control, and requires focused, dedicated concentration and awareness to achieve. And I'm having a gruesome, insomnia-causing time trying to keep that focus and concentration just on a second book of the same story.  My worst nightmare? Peg II could run to III. It's not going to. I couldn't stand it. One of the stories I've often told about my beginnings as a professional writer is that I wrote Beauty, my first published novel, as a break from working on a story about Damar. (Not one of the ones that's been published. One of the ones from Aerin's vision near the end of The Hero and the Crown.) And I needed that break because I'd just found out that Damar was not one story but lots of them, and I panicked. I haven't got the brain, the organizational skills, or the stamina.  The one novel I've had turned down was one of those Third Damar Novels—I discovered that it was more than one novel long, panicked again, and when I whacked it in half, I botched the job. At least I did the job cleanly with Pegasus.  (There's perhaps an argument that my poor patient husband's and my Tales of Elemental Spirits series is my own personal if inadvertent epic. I'm not good at short stories; better than half my published novels started life as short stories. It took several years before the first Elementals volume, Water, came out. It then took seven years for the second volume, Fire, to appear, because my short stories kept turning into novels: Dragonhaven, Sunshine and Chalice all began life as Fire short stories. I'm now squeezing a lot of moaning mileage out of the fact that this tendency is getting worse— Pegasus started life as an AIR story ... and it's now two novels. Peter has all but one of his Elementals short—short—stories written ... and has had, for some time. Years. Years and years.)  Gav Thorpe: I'm drawn to the themes of politics and power. As a dedicated reader of history I am intrigued by the interplay of forces that shape societies and cultures. While at first history (real or fictional) can seem a faceless, all-encompassing process, it is far more often dictated by the actions of a powerful or dedicated few. While very few of my characters are 'heroic' in the traditional sense, they are all remarkable individuals, possessed of strength and purpose enough to have a profound effect on the worlds they live in, whether driven by ambition, vengeance, or expectation. Epic Fantasy allows one to paint a world with a broad brush, encompassing different and often conflicting ideologies and cultures. It is the interplay of these different powers, and the realpolitik that results from that interplay, that shape worlds and drive the narrative.  Elizabeth Bear: Beowulf and the dragon destroy each other: fantasy tells us he was right to have fought. I need stories that tell me it is right to keep fighting, when despair and capitulation are so easy.  Lynn Flewelling: Epic Fantasy, and speculative fiction in general, give the writer a huge canvas to work on, especially in multi book series. You create the world and all that's in it. You create the people and govern their motivations, and throw all sorts of interesting obstacles in their way. You can also tackle social issues from different angles than you can in the real world. Much of my fantasy is about how I think things could be, rather than how they are. I like to challenge readers, make them think. I don't soapbox; that's a turn off, for me at least. I just like to weave in a thread of it into the greater action.  I also really enjoy weaving in things I uncover in my research, and what I observe in the real world. Much of what I include is based on real things, such as the food I describe at feasts, or the economic geography of a country. I studied archery and got so interested in it that I took it up myself. As for war, or the darker side of human nature, all I have to do is watch the news. Some readers found the fourth Nightrunner book, Shadows Return, hard to read because of the brutal depiction of slavery; every aspect of what I wrote was based on real world research. It wasn't pretty, and it wasn't supposed to be. Slavery is a brutal, dehumanizing business. That was the point.  Epic Fantasy generally includes magic, too, with which I have a love/hate relationship. Too much of it replaces the more exciting element of character endeavor. I don't find \"let the wizard do it\" stories very interesting. That's probably why my main characters don't have any ability in that direction, but have to rely on their wits. I do have wizards, and magic in my books, but there is an internal logic to it, and limits to what it can do. And there are different kinds of magic associated with different cultures, too, so everybody isn't doing the same things.  Most of all, I enjoy creating characters. I strive to make them as real and believable as a fictional character can be, and by real I mean if you take away the magic and swords and plunk them down in a contemporary novel, they would still function well. They must have hopes, flaws, emotions that the reader can identify with on some level or at least recognize. I write from multiple points of view, and try to get inside the skins of my villains just as much as my heroes. Duke Mardus, the nemesis of the first two Nightrunner books, was a brilliant sociopath. Jeffery Dahmer was in the news while I was creating Mardus, and he absolutely fascinated me. How could someone look so normal—in fact he looked a great deal like a good friend of mine—and be so utterly alien inside? So lacking in basic human empathy? And what that lack of empathy allowed Dahmer to do? It's stunning to think about. He reminded me of the sharks at the Boston Aquarium; the aquarium features a huge glass column of a tank at the center of the building and you can around it on a spiraling platform from bottom to top. I found myself often eye to eye with a shark. Have you ever looked a shark in the eye? It's inky black, cold, devoid of the sort of emotion you find in a dog or cat's. Soulless is the closest I can come to describing that black gaze. So, working with Jeffery Dahmer and sharks, I came up with a charming, intelligent, handsome monster. Mardus was a blast to write. Not sure what that says about me, but it was.  That being said, you have to avoid both the anachronism trap, and what I call the \"stick up the butt Shakespeare syndrome.\" It's a fine line. You want them to sound like fantasy characters. If they're in a medieval-type setting, they aren't going to say things like \"Cool!\" or \"That's totally awesome!\" That kind of dialog is jarring and pulls me off the page. On the other hand, you don't want to have them saying \"Odds bodkins\" and \"Wouldst thou embark upon this quest with me?\" At least I don't. I do my best to make them a product of their environment, but also have them speak to each other in a natural on the ear manner. It's how they would sound to each other.  What is the relationship between characters and settings in Epic Fantasy?  Elizabeth Bear: The characters are a product of their setting, aren't they? They grow out of it. We are all products of the world, the society, the culture, the landscape we inhabit.  James Barclay: In any genre, every character is (or should be) affected by the settings in which they operate. After all, we are all products of our environments to a greater or lesser extent. We cannot help but be affected by what we experience and so it should be for Epic Fantasy characters. This takes the answer to the first question a little further because your characters have got to be credible, identifiable and fascinating within the settings you describe for them. Just to take one aspect, it simply isn't credible to have a coward working in a group of mercenaries. This is not a career choice he or she would make and to try and make it so just to be different is to invite ridicule.  Kate Elliott: People exist in a cultural context. Characters live within their landscape both in the ecological and the societal sense. The society/societies the characters come from will inform how they see the world, approach the conflicts they struggle with, and interact with others.  As a writer, I do not see character and setting as separate; I see them as intertwined in exactly the way my own character and person is intertwined with the world I live in. I write from that place, so even though it's also true that my approach, and thus the plot and character decisions I make, are necessarily informed by my own experience of the world, I must always attempt to see their world from their immersion in it.  Terry Brooks: Well, you've probably heard it said multiple times that settings are frequently characters in a writer's work and every bit as important as the two-legged kind. Or in my case, four-legged. I often start a book with nothing more than a setting. Judine and I travel a lot, and when we find someplace wonderful in our wanderings, we document it with notes and pictures. I always know right away when a setting is going to form the basis for a book. But settings have other uses, too. Frequently, they can be employed to reflect the emotional makeup of a character or a character's responses. They can determine to a large extent the way a reader views a character. I guess I just think the two are inextricable.  Ed Greenwood: In a truly Epic Fantasy (as opposed to just a long quest tale), the setting is a vital part of the story, almost a character (or several characters) in itself. Most epics involve events that change the setting forever, in some meaningful (sometimes very large) way. In short, the moral choices characters make have a lasting, far-reaching impact on the setting. In badly-written Epic Fantasy, a majority of characters can become pawns, whatever free will they possess being overridden by \"the too long arm of happenstance\" or timing. Epic Fantasy works best when characters choose their own fates (or if you prefer, \"dooms\"). Characters may or may not be aware of their relationship to the setting, but the reader is made aware of the tight bond between characters and setting. Even when a protagonist is a \"fish out of water,\" his or her underlying link to the setting or being suited for the setting is usually revealed in the end. I have often explained to other writers working in my most popular setting: \"The Realms isn't geography; it's people. The characters are the setting.\"  Rowena Cory Daniells: The world and the society should shape the character and their driving needs. The story should only be able to happen to that character, at that time, in that particular world because of the person they are. We are all products of our times, whether we realize it or not. I love creating worlds and I love character driven stories. In King Rolen's Kin it is Byren's instinctive reaction to protect his friend that lands him in trouble but he couldn't act otherwise because that is who he is.  Robert V. S. Redick: Epic, for me, is about the wonder of our passage through life. In an epic story, the characters we read about are the ones making that passage. For it to be meaningful it must become real, and for it to become real they must be real: consistent in themselves, true to what we know instinctively about the workings of the human heart (unless they are so alien that we do not even seek humanity in them), and believably sprung from the soil, history and values of a fully imagined place. This is true even of the transplanted character, the stranger in a strange land. If s/he comes from elsewhere, that elsewhere too must be solid and tangible, or we will never believe in that character's relationship to the setting of the book itself.  Michael A Stackpole: Characters must either be rooted in the world or, on rare occasions, be utterly alien to it and forced to adapt. Having them deal with magic as if they've grown up with it, for example, is critical for making a world believable. The characters must be a product of the same forces and history that shaped the world as the world itself. Otherwise, they have no skin in the game, and their actions won't be in character with someone from that world. They'll have no stake in saving or destroying it, so they really don't belong in the story.  Patrick Rothfuss: Characters and settings? Their relationship? I hear they're just friends. Characters wanted to get more serious, but Settings was all, \"I don't want to risk ruining what we already have.\" Characters was pissed, of course, because they'd made out that one time when they were drunk at Steve's house. But apparently that was just a one-time thing.  Seriously? I have no idea how to answer that question. It's sort of like asking me, \"What's the relationship between Christianity and feudalism in the Middle Ages?\" It's a question so big you could write a book about it.  The simple answer? Their relationship is big, important, and complicated.  Ian C. Esslemont: The settings tend to be just as epic as the characters, i.e.: large.  The epic requires a lot of territory in order to unfold. This relationship need no longer be one-to-one. Inner emotional landscapes need not have their exterior analogues in the setting. However, particular settings can help pose questions to the reader such as, are there other ways to relate to the world? What really is the relationship of people to nature? Can one people's wasteland be bountiful to another? Travel, or 'the journey' can help examine this.  Lynn Flewelling: What's the point of having a well-realized world if you don't have interesting people running around in it, and vice versa? As you might guess, for me, the best fantasy is character driven; I have to care deeply about the people to chew through the big bug crusher books so many of us write. I want to see them grow. I want to see their faults and weaknesses, as well as their strengths and how that all affects their actions and the outcome of events. That sort of cause and effect steers my writing.  You have to have a believable world, and they have to be a believable entity within that world.  J. V. Jones: People are shaped by their cultures. What character traits are valued? Which ones are denounced? In the clanholds culture of A Sword of Shadows reckless bloody-mindedness is celebrated while cleverness is viewed with suspicion. That means that a character can choose to conceal his intelligence or move away from home to a place that embraces knowledge and learning. Every decision you make about your fantasy setting has consequences for your characters. Creating a world and casting the characters that populate it go hand-in-hand.  Gaie Sebold: I think at its best, it's the same as between characters and settings in the real world. People are shaped by the landscapes they experience. Someone who grows up in a highly technological, fast-paced city will have different responses and attitudes to someone who grows up in a tiny rural village, but the essential human realities remain the same. If the things you worry about every day are whether your son is going to get shot in a gang fight or whether your sheep are going to survive the winter, you're still worrying, you're still concerned with survival. How people react to moral choices, to the tough decisions, is going to be colored by their experiences, but the core of the person is revealed by which decisions they make. The landscapes of Epic Fantasy can, I think give a new dimension to these human struggles. Partly by taking away the mundanities, so the interesting stuff, the tough choices, aren't muddled and muddied by the boring taking-out-the-bins of daily life; but also by providing a new perspective. Put people in a new setting, and you see them and their choices in a different way. Like good stage design, good world-building affects the way you see the characters and the decisions they make.  Juliet McKenna: Characters and settings? Each must influence the other to create a three-dimensional, believable world. A person's character is shaped by their status, their culture and environment, as much as by their individual temperament, even if or when they are rejecting one or more aspects of their surroundings. In turn, such rejection and challenge continually shapes and reshapes societies and cultures. Humanity has also, always, shaped the physical world to suit each society's needs and aspirations, for good and ill.  These processes are continuous, sometimes swift and dramatic, at other times slow and subtle. Either way, Epic Fantasy should reflect this ongoing fluidity to draw the reader into a convincing secondary world—or must provide a convincing explanation for whatever has halted such fluctuation, since that can, of course, be the whole point of a story.  Erin Hoffman: I subscribe to Steve Rasnic Tem's Gestalt \"dream characterization\" theory on this. He says, in short, that \"every object in a dream is a piece of the dreamer\". Everything we see in dreams is a part of us. The particular chair that you imagine, the monster behind the door, the color of the sky — all of these have meaning because they are generated by our symbolic unconscious mind in a fusion of emotional and sensory memory. In fiction, this connects to the way we describe things—in Sword of Fire and Sea, Vidarian, the protagonist, sees most things in the sensations of sea and ship life, because that's his—and how our fantastic settings reflect the state of the world and therefore the state of the protagonist. If the world is broken, the protagonist is broken; the progression that the world goes through reflects the progression and change of the characters in it. They shape each other. And in fantasy we are lucky to be gloriously unlimited in how far we take that notion.  K. V. Johansen: For me, a story and its world usually arise out of an idea for a character in a setting and situation. They end up evolving together. As the character develops and story begins to crystallize around him (or her), the world grows as well. Blackdog began with the idea of a foreigner in town being possessed by ... something ... that attacked him in an alleyway. I can still sort of see that alleyway, though it certainly doesn't exist in the Blackdog world any more. The deserts grew out of the mountains, the mountains grew to enclose the lake, the lake grew out of the goddess ... the goddess had to exist to give Holla-Sayan, the possessed hero, meaning. He's not \"victim number one\" of a monster; he's the hero, and now that he's possessed by the Blackdog, I need to find out why, which involves discovering where he can go from there, literally and emotionally. Next thing I know, I'm trying to figure out how many miles a day a Bactrian camel can travel and what Kahzakhstan smells like.  Characters are very dependent on their settings in Epic Fantasy, because it's the setting—the landscape, the cultural and political background, and the cosmology—that gives structure to the emotional and psychological world inside their heads. People are shaped by how they live, by their culture and history. If the setting is just something assembled from cardboard stage-sets, it's hard to see how the characters can be convincingly alive. They'll risk being just cardboard props too. If readers are going to have literary belief (Tolkien's term) in the story, they need all aspects of it to work together to sustain that. Setting and characters need to have equally rich \"realism of presentation\" (and that's Lewis's phrase).  Paul Kearney: The settings to a major extent define the characters themselves. The culture in which you dump your characters will effectively create for them a value system they can either follow or rebel against. We're all a product of the world we live in, a cliché but true. Also, if you make one character behave in a way that's alien to his own cultural values, you must back up his actions - what's he fighting against? ('Whaddya got?') Without a background to create the character against, he's just a tabula rasa, and his actions will lack the poignancy or resonance they would otherwise have.  Peter Orullian: In more traditional Epic Fantasy—meaning, more medieval, and certainly pre-industrial—the number of vocations you might assign a character is narrower, as is typically the variety of landscape that character will walk through. Often you'll find a closer connection to, and perhaps reliance on, the \"land.\"  In some of these tales, the governance is of a feudal nature, making the character/setting tie that much stronger.  But on a more abstract level, there's a sort of \"feel\" or poignancy, I think, that is fairly unique to the genre. Whether set in a royal court, or a rustic tavern, or against a vista of open terrain, I'm drawn to the interaction of characters with or against the setting in Epic Fantasy because things of import seem to resonate from them.  That all sounds rather maudlin and high-falutin. I get it. But it doesn't change the fact either. Not always, but often the personal choices and sacrifices of the character are reflections of what is being played out on the larger stage of the politics and imperiled world. When a writer of Epic Fantasy does this without drubbing you over the head with it, the story has resonances a reader can feel and appreciate, even if they can't articulate why. It's sort of that thing where you say, \"I know it when I see it.\"  Brandon Sanderson: In science fiction and fantasy in general the setting becomes more of a character. It's one of the ways a lot of us think of it. Certainly we're not the only genres that do this; historical novels often will dig very deeply into the setting and make a character out of it. But the way we do setting is what distinguishes our genres.  In Epic Fantasy, there is more time to delve into the setting, and the setting does become like a character. I love the great epics—if we look at Dune for instance, which is one of those borderline books where you can ask, is this science fiction? Yes, it is. Is it an epic? Yes, it is. It shares many of the same plot structures and feels of an Epic Fantasy. If we look at Dune, what's the relationship between character and setting? Well, the setting influences everything. It's deeply part of each of the characters in different ways, and it's deeply part of the plot.  In Epic Fantasy I really do feel that the setting should be deeply interwoven into the characters—that you can't really have the same characters without that setting.  Victoria Strauss: I think it's the same as in any book where the setting is an important part of the action, and varies from writer to writer and book to book—although, since the settings are imaginary, authors have to work harder to ensure that characters interact plausibly with their cultures and surroundings. It's a very similar challenge to that faced by historical writers, who don't make up a setting out of whole cloth, but still must work with what's essentially an invented world, since there's no way to experience a historical context directly.  Characters in Epic Fantasy tend to be acted upon by their environments more intensely than characters in other forms of fiction. The unique qualities, challenges, and dangers of the imaginary world, and characters' struggles and encounters with these, often play a large part in driving the plot. On the other hand, you could say the same about Pearl Buck's The Good Earth, so this certainly isn't unique to Epic Fantasy. I think it does tend to be a more common theme, though.  Trudi Canavan: It depends on the setting. Where the character spent their past will obviously shape their personality, and how they react to new environments. What interests me most when creating fantasy worlds is how the fantasy element might have influenced the development of human civilizations. In the Black Magician Trilogy magic comes from within a person and, except in exceptional circumstances, that person has to be taught how to access it. That meant the teachers are very powerful and choose who learns magic. Magicians became the highest class within society.  In the Age of the Five I used a different setting, in which magic imbues the world. Human use of magic is limited by their ability to draw it in, so while some can only light a candle others are so powerful they can alter their body, stay young and extend their lives. Another fun aspect of this setting was that plants and animals could use magic, too. But naturally they use it for the same purposes that drive life in this world: to acquire food, a mate and avoid being eaten.  Steven Erikson: My first answer is somewhere up above: story as dialogue; setting as implacable nature, the myriad forces against which we must all struggle blah blah.  My second answer is more specific to the modern form of Epic Fantasy, and accordingly reveals some, uh, frustration. Characters need to go somewhere. That said, it does seem that in modern Epic Fantasy characters need to cross or climb a lot of mountains. I never got that. I've been in mountains. They're boring. Impoverished ecosystems, a hard place to scratch a living, able to sustain meager populations at best. Yet, somehow, they're always full of monsters and evil hordes spilling out of caves like termites from a nest. Once over the mountains, it's temperate rain forests, once again filled with malevolent creatures. But dammit, been in temperate rain forests, too, and they're also impoverished (even with salmon in the rivers and streams). Boreal forests are little better and far less imposing or brooding. Guess it's that whole northern Europe thing, JRR's legacy. Central plains can create and sustain huge populations, but cyclically. Riparine and coastal environments are pretty good for civilization. So are peculiarly situated island groups like the UK, taking the best of all environments and creating a quaint amalgam of temperate stolidity rife with shires, spooky but comfortably contained forests, patches of denuded, inimical moorland, ragged coastlines and smugglers' beaches, all topped off with about ten billion people jammed in cars every bank holiday (all, it seems, heading to Falmouth, Cornwall). Oddly enough, this last template (a place much like the UK) seems to fit well many fantasy novels ... how about that? One should never discount coincidence.  Could go all psychological here and talk about forests as the underworld of our psyches, the shadowy unknown; mountains as the unattainable and unconquerable; rivers, meres, lakes and oceans as invitations to the subconscious; cities as the intricacies of the human mind, etc. But in the end none of that makes much difference. A character interacts with the setting either honestly or dishonestly: they are either part of their environment, or they're false (modern) intrusions, replete with all the wrong sensibilities. Anyway, if the setting's a giant white whale, better have an Ahab or two, and let loose the rage.  It's what you do then that counts.  Gav Thorpe: For the most part, the characters will be the ones doing the shaping. It is their desires, destinies and whims that can affect the world they live in. They are the agents of the change, not content to live in the world as they find it, and with the strength and determination to alter that world. For the most part, but not always. A story can still be epic if told from a lowlier point of view, as long as the events in which the characters are embroiled are suitably broad and game-changing. It is interesting to examine how momentous events affect the little people as much as it is entertaining to follow the exploits of those who hold the reins of power. It is also possible to show that the course of history can be determined not only by kings and dark lords, but by faithful servants and loyal minions.  The majority of my characters are the former type; individuals of political and physical prowess who can rule nations and lead armies. With these characters it is important to ensure that the physical conflicts in which they engage are driven by more personal goals and conflicts. The characters' motivations may be selfless, more often selfish, but always there is some emotional and psychological force behind their lofty aims. There must be a reason why these characters and no others are the ones to take control of events and direct them.    \"Something Better: An Epic Discussion of Epic Fantasy, Part 2\" will appear in the August issue of Clarkesworld Magazine. Topics will include series, humor, and violence, among others.    Dramatis Personae  Lou Anders is the editorial director of Pyr Books and the editor or co-editor of such anthologies as, Swords & Dark Magic and Masked. www.louanders.com  James Barclay is the author of the recent (in the US) Demonstorm and the forthcoming (in the UK) Rise of the TaiGethan. www.jamesbarclay.com  Elizabeth Bear is the author of such novels as The Sea Thy Mistress and the forthcoming The Tempering of Men (with Sarah Monette). www.elizabethbear.com  Terry Brooks is the author of Bearers of the Black Staff and the forthcoming The Measure of the Magic. www.terrybrooks.net  Trudi Canavan is the author of The Rogue and the forthcoming The Traitor Queen. www.trudicanavan.com  David Anthony Durham is the author of The Other Lands and the forthcoming The Sacred Band. www.davidanthonydurham.com  Ian C. Esslemont is the author of Stonewielder and the forthcoming Throne and Orb. www.malazanempire.com/site/authors/2-esslemont  Lynn Flewelling is the author of The White Road and the forthcoming Casket of Souls. www.sff.net/people/lynn.flewelling  Ed Greenwood is the author of Elminster Must Die! and Bury Elminster Deep. en.wikipedia.org/wiki/Ed_Greenwood  John Jarrold is the founder of the John Jarrold Literary Agency. He has edited for such publishing houses as Random House, HarperCollins, Pan Macmillan, Simon & Schuster, Orion/Gollancz, and Time Warner. www.johnjarrold.co.uk  N. K. Jemisin is the author of The Broken Kingdoms and the forthcoming The Kingdom of Gods. nkjemisin.com  Peter Orullian is the author of The Unremembered and the forthcoming Vault of Heaven Book 2. www.orullian.com  Robert V. S. Redick is the author of The Ruling Sea and The River of Shadows. www.robertvsredick.com  Patrick Rothfuss is the author of The Name of the Wind and The Wise Man's Fear. www.patrickrothfuss.com  Brandon Sanderson is the author of The Way of Kings and the forthcoming The Alloy of Law. www.brandonsanderson.com  Gaie Sebold's first novel Babylon Steel is forthcoming from Solaris in January of 2012. gaiesebold.weebly.com  Michael A. Stackpole is the author of At the Queen's Command and the forthcoming novelization Conan the Barbarian. www.stormwolf.com  Gav Thorpe is the author of The Crown of the Conqueror and the forthcoming The Crown of the Usurper. mechanicalhamster.wordpress.com  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nSomething Greater: An Epic Discussion of Epic Fantasy, Part 1\nIntroduction\n\"Fantasy,\" said Elizabeth Bear, the author of The Sea Thy Mistress and the forthcoming The Tempering of Men (with Sarah Monette), \"is the purest form of the imagination, and it gives us courage and persistence.\"\nIt gives us courage and persistence.\n\"Epic Fantasy is built into us, part of our most fundamental human fabric, and in a way it has a sacredness that all stems from our paradoxical awareness of our own mortality,\" said Erin Hoffman, author of Sword of Fire and Sea. \"We know what it is to imagine immortality, and yet we die. That is Epic Fantasy.\nAwareness of our own mortality.\nThere are many types of fantasy—as many types, it seems, as there are stories. Marketing categories, reader expectations, literary styles and tastes—these days fantasy is sub-divided into many sub-genres, such as Urban, Paranormal, Dark, Heroic, Young Adult, Sword and Sorcery, Epic, and more.\nThese designations have value—among other things, they help readers know what they are getting and they help writers meet (or subvert) readers' expectations. These designations also speak to the long and rich tradition of fantastic literature.\n\"Epic Fantasy is The Iliad to Sword and Sorcery's Odyssey,\" said Lou Anders, the editorial director of Pyr Books and co-editor with Jonathan Strahan of Swords & Dark Magic.\nAnother useful exercise might be to consider the differences between Robert E. Howard's Conan stories or Fritz Leiber's Fafhrd and Gray Mouser stories (Sword and Sorcery) and J. R. R. Tolkien's Lord of the Rings (Epic Fantasy).\nThe Iliad or The Odyssey, Howard, Leiber, or Tolkien... there's still a lot of room for discussion.\n\"I don't believe genre definitions should be prescriptive, erecting fences and portioning off territories, so much as descriptive, attempts to pinpoint the center of the map but leaving lots of fun gray regions at the borders,\" said Anders.\nThe goal of this (epic) discussion, in keeping with Anders' caveat, is to describe Epic Fantasy from the point of view of some of the authors who write it. (Or who don't write it. Interestingly, a number of the writers who participated don't think of themselves as writers of Epic Fantasy.)\n\"Epic Fantasy is a wonderfully broad field in 2011—far more so than when I took on Robert Jordan's Eye of the World for Orbit in the UK, over 20 years ago,\" said John Jarrold, a literary agent and editor. \"Even then, elves and dwarves were not mandatory, post-Tolkien, but in the last decade—with China Mieville's Bas-Lag, Naomi Novik's Napoleonic dragons, Scott Lynch's Italianate novels, Robert V S Redick's shipboard epics, Joe Abercrombie's darkly witty characters and many others—an author has been able to explore in different areas than was the case in the late 80s/early 90s. This is as exciting a time in the genre as I have ever seen.\"\n\"Epic Fantasy\" is gloriously broad, vague, and... resonant. It may be hard to define Epic Fantasy succinctly (though if anyone could it'd be Elizabeth Bear), but we know what Epic Fantasy is and isn't. We know it when we read it, when we hear it. We feel it in our bones. The goal of this round-table discussion, therefore, is to describe Epic Fantasy and to try to illustrate the broadness—the grand sweep, the bigness, and scope—of it.\nIn truth, this was supposed to be a relatively small discussion with four or five authors, but it kept growing. It got out of control very quickly. Each set of responses I received led me in the direction of another author, and another, and another. A total of 26 authors—13 women and 13 men—as well as an editor and a literary agent (who is a former editor) participated.\nThe 28 participants are at varying places in their careers—some have been publishing for decades (Terry Brooks, Kate Elliott, Steven Erikson), others await the publication of their first novel (Gaie Sebold), and the majority are somewhere in between. There are New York Times best-selling authors and rising stars from the smaller presses. One is a video game designer by day (Erin Hoffman) and another works in the music industry (Peter Orullian). The following authors participate as well: Lou Anders, James Barclay, Elizabeth Bear, Trudi Canavan, Rowena Cory Daniells, David Anthony Durham, Ian C. Esslemont, Lynn Flewelling, Ed Greenwood, John Jarrold, N. K. Jemisin, K. V. Johansen, J. V. Jones, Paul Kearney, Juliet McKenna, Robin McKinley, Robert V. S. Redick, Patrick Rothfuss, Brandon Sanderson, Michael A. Stackpole, Victoria Strauss, and Gav Thorpe. Refer to the Dramatis Personae for more information about each author and for links to their web-pages. My guess (and hope) is that you'll find many new authors to read.\nLastly, not everyone accepted my invitation to participate in this discussion. Most did, but some had scheduling conflicts or felt strongly that they did not write Epic Fantasy and should not, therefore, participate. Not every participant answered every question. Some answered more expansively than others. I did not cut anyone's responses significantly, but I did arrange them for flow and impact.\nAnd now... let us begin the discussion—begin to speak of stage and scope, grandness and epicness, moral choices and sense of wonder, moments of magnificence and affirmations of good in the world. Yes, the participants cover the expected topics, and they go in unexpected directions as well.\n\"Beyond the world-shaking events in imaginary universes, archetypal battles between good and evil (or, more and more these days, between not-really-so-good-at-all and evil),\" said Victoria Strauss, the author of The Burning Land and The Awakened City. \"I think that Epic Fantasy is, at its heart, about meaning and significance.\"\nAbout meaning and significance.\n\"In Epic Fantasy,\" added Strauss, \"the principal characters' lives and actions acquire immense meaning and importance within the pattern of a series of hugely significant events. Their lives matter. This is the very opposite of most people's real lives, and one of the major reasons, I think, why Epic Fantasy has such enduring appeal.\"\nLet us begin:\nWhat is at the heart (or core) of Epic Fantasy?\nJ. V. Jones: It's about a character discovering a world along with the reader. Epic Fantasy is all about the sense of wonder that comes from exploring. We get to enter crumbled-down castles and sea caves, ride across deserts baked as hard as glass, and build campfires against unknowable forces. Epic Fantasy is a world not bound by earthly limitations, and characters trying to keep themselves and their loved ones safe within it.\nTerry Brooks: An element of magic without which the story fails to work. That's the short answer. Really, there are so many different kinds of fantasies that the elements necessary to make them complete vary widely. Shannara is Epic Fantasy in the Tolkien tradition, requiring a quest, a little band of heroes, a penultimate confrontation between good and evil and the aforesaid element of magic which makes the whole thing work. But, you know what? While I know I am labeled a fantasy writer, that's not how I think of myself. I think of myself as an adventure story writer.\nN. K. Jemisin: The epic. The ancient stories that have so enthralled people since they were first told—the Sundiata Cycle, Gilgamesh, The Iliad and The Odyssey, The Ramayana... Every culture has these tales in some form, and the need to hear them is embedded in our species, I think. So naturally, even though we now write them down and have folded and spindled the epic forms into a new structure, we still crave the old thrill.\nTrudi Canavan: Bigness. Whether it be size of the world, the length of the tale or the number of books—or combinations of these. But not ideas. A book can have big ideas, but not be \"epic\" fantasy.\nUnfortunately, the label \"epic\" seems to be applied to a lot of fantasy that doesn't really qualify, and that's a bit unfair to both true Epic Fantasy and fantasy that is not epic, just as it grates when anyone describes all fantasy as \"quest\" fantasy. Fantasy is a very broad and varied genre, and lumping it all under one type is never satisfactory.\nElizabeth Bear: Well, that's kind of a can of worms, isn't it? There are a lot of different answers, and a lot of different arguments. Fantasy's detractors often try to argue that it's in some way a morally inferior kind of literature: it's \"not real,\" \"escapist,\" \"consolatory,\" \"backwards looking,\" \"monarchist,\" \"made up.\" It divides the world into good and evil, black and white, without shades of gray. But I would argue that at its finest, fantasy is the exact opposite of those things. Fantasy can serve as a kind of hyper-reality, a social allegory. It is uniquely capable of compressing the scope of human experience into a narrative—and I think that's what can make it epic, or give it that epic feel. It can illuminate good and bad, motive and desire.\nMichael A Stackpole: Short question that requires a long answer. A quest is usually one critical component; but I think having events which will reshape the world is also critical. Imagine the world before and after Prometheus gave man fire. The changes need to be that earth-shattering or epoch-breaking. Lord of the Rings certainly does that; and I think other good Epic Fantasy does it as well. If that is not what is happening, then the challenges and threats don't seem as real or have as much gravity. Dynamic pressures and efforts are what make for great stories.\nPeter Orullian: I often feel as though a novel's \"epicness\" is defined by the reader's experience, and certainly by the definition any given reader may use to categorize a given book. One could argue that the intimate examination of a single character battling personal demons—whether evil with a capital \"E\" or, say, addiction—could prove an epic tale. But in terms of answering your question, that way lies madness, since then it's all then subjective.\nFor me, some things must exist for a fantasy novel to feel epic. And at least some of them would apply to epic storytelling in any genre. I think first of the stakes in the novel, which ties closely to the scale of the story. If my stakes are missing my morning cartoons because I've got to weed the garden, it ain't epic. Failure of my character to answer the story question has to have consequences that impact others besides the character himself. Could be, too, that my character fails. But there has to be risk on a broad scale. Yes, it's compelling to read about the risk of a single life, but for me that's a different genre of fantasy.\nI'd also say that there has to be a strong family element. The example that leaps to mind is George R. R. Martin's A Song of Ice and Fire. But it can be equally said of something like The Godfather. Often, what you find is that the interplay of characters who share some familial relationship proves a microcosm of what is being acted out on the \"big stage\" in the book, even as those same characters are the ones who trod that \"big stage.\" Done correctly, the ravages of war that hold the fate of kingdoms in their grasp are made most poignant in the lives of your characters, who are likely seeing those they love, suffer or die. And sometimes, your character, himself, is the sacrificial lamb.\nAnd related to the notion of stakes/scale, there needs to be an adversary. It needn't be the devil. But it's got to be more than a robber. I'm glad to have the motivations of this antagonist explained; I'm even glad to be made to sympathize (after a fashion) with the \"bad guy.\" But at some point in epic storytelling there needs to be real conflict (which then plays against this idea of high stakes), and if there's no clear hero, however flawed, then I'm not invested in the outcome. Maudlin as it may sound, I want triumph of some resonant kind. I want to be thrilled. If I don't care who wins, what's the point?\nThen, once you have ingredients like stakes, scope, family, adversary, I think you've got to have at least some actual fantasy elements: some mix of magic, second-world setting, invented races, swordplay, etc. I don't believe there's a set formula there, but in the absence of any of these, all the other things that make a tale epic are true of \"epicness\" in other literary forms.\nGav Thorpe: To be truly epic a story has to be world-changing. It has to deal with the fates of entire nations and races. It can deal with one individual or a whole host of characters, but by the end of the tale the world as it started out needs to have significantly changed, whether for better or worse. Even if the characters do not directly affect these wholesale changes, the events they are drawn into must be part of a large movement that sees a paradigm shift in the fictional world created. This could be the fall of the Dark Lord (such as The Lord of the Rings), a war for domination (Game of Thrones or my own The Crown of the Blood), or the rise of a new power (Chronicles of Narnia). Always the stage should be the whole (known) world and the scope should include all of the peoples of that world.\nGaie Sebold: I think for me it is big themes dealt with in a big way; it's cinemascope. As a reader, I love the sweep of it, the chance to feel thoroughly immersed in a world that's completely different from the everyday, but where the characters are believable people with real human responses. A good Epic Fantasy is like going on holiday to another world, a really good one is the sort where you don't want to come home.\nK. V. Johansen: At its heart, what makes fantasy epic is its scope. The setting is usually more vast, the adventure is more far-ranging and more perilous, and what the hero is trying to achieve is greater than what, in that same world, an \"ordinary\" person might aspire to or be forced to cope with. I think it could be argued that Epic Fantasy's roots are in the oldest stories: Gilgamesh, The Iliad, The Odyssey, The Aeneid, right through Beowulf, the Nibelungenlied, the Arthurian cycle (the \"historical\" fictions building on Geoffrey of Monmouth, not the Romance tradition of Chretien de Troyes and the like, which is all about interactions between individuals and lacks a concrete setting), the Faerie Queene, Orlando Furioso. The Lord of the Rings is the modern archetype of Epic Fantasy.\nThe heroes in those precursors to Epic Fantasy, and in Lord of the Rings, are trying to do something that sets them apart; whether this is due to personal ambition, a desire for glory, a refusal to break some bond of loyalty or code of honor, or to fate or chance putting them in a position where the doom of a people or a world rests on them, doesn't make a difference to that. The fact that they are driven, by themselves or by circumstances, to become something greater than either their fellows or their earlier selves is one of the things that sets Epic Fantasy apart from, say, a fairy tale. No matter what is inspiring or forcing them into heroism, the adventures of the hero of Epic Fantasy are always something beyond what is expected of them, too. Whatever they're involved in stands out within their world as beyond the ordinary, cast into brighter light and deeper shadows: more tragic, more glorious.\nEpic Fantasy always has a strong sense of place, in both the geographical and historical senses. The setting is almost always a world where things are happening off-stage, off the edges of the map and at earlier points in history, which are nevertheless going to affect the current story and be forces pushing on the hero, shaping him or her. Fairy-tales and romances (I'm still talking about medieval Romance here, not Harlequins) take place in a timeless world, in which there are mountains that are all mountains and any mountains, forests that are just \"the forest\". Even when the forest has a name, that's all it has. There's a king, who is the King, or perhaps he's Arthur or Charlemagne, but he's just a golden figure, part of the setting, and there's no attempt made or desired to root the story in any particular place and time, real or imagined. Epic Fantasy, which is today usually secondary world fantasy, has definite and specific reality, not only the story's \"here and now\", but a past that explains how things got to \"now\" and a landscape for \"here\" that leads off into \"there\" and an \"away beyond the hills\" that becomes complex and detailed as the hero's adventures and the storyteller's eye move into it.\nJames Barclay: Right at the absolute centre are the characters, just like in any genre. Who cares how wonderful your world is if your characters are cut from cereal boxes? I know authors and readers love the grand settings, vast creations and often very clever magic systems of Epic Fantasy but these are not what make it tick.\nLynn Flewelling: I think the core of Epic Fantasy is creating a story in which characters the reader cares about overcome great odds for some higher (at least in their minds) purpose. In some cases it's saving the known world, but it doesn't have to be. A number of my books have a more narrow focus: saving a friend or a country, righting a wrong for the greater good. There are all sorts of plots, but I think that is the theme that runs through them all. Who wants to read about a plowboy leaving home to become a chartered accountant? You need challenge and action, tension and drama.\nEd Greenwood: At the core of all good fiction, Epic Fantasy and otherwise, are the moral choices made by characters—characters the writer makes the reader care about. For good or bad, smart or foolish, these choices (Uriens in the movie Excalibur: \"I saw what I saw. The boy drew the sword.\") define the characters. They stand up for what they believe is right, or sacrifice themselves knowingly, or do \"what needs to be done,\" and inspire readers. Scenes of heroic choices lift the hearts of readers, make them feel that there is good in the world, let them revel in moments of magnificence (\"The boy stood up to the dragon! I saw it! I was there!\"), and feel better for having done so.\nNo one wants to read a story of unrelieved gloom, wherein sordid characters the reader loathes or despises do nasty things to each other, there is no order nor moments of kindness or good triumphing in any way, and good doesn't win in the end. The happy, just ending is a cliché because it works, because readers want it and wait for it and feel somehow cheated if they don't get it (and very cheated if there's no glimmer of good or \"rightness\" at story-end, at all).\nEpic Fantasy is the genre of literature where we can see villainy most nakedly exposed, and where we expect to see heroes do their stuff. They may be reluctant heroes, they may be flawed (and these days, the prevailing cynical tastes of readers expect some measure of those flaws and that moral wrestling or self-doubt, taking such elements as validating \"realism\"), but we want to see them do the right thing. The daring, dangerous right thing. The, by George (not by the Dragon!), successful right thing.\nRight in front of our eyes, we want to see the world saved, and made safer and happier for us all.\nElizabeth Bear: Our earliest human narratives are fantasies: stories of men and women fighting monsters with powers natural and supernatural, and refusing to back down. Innana descends into Hell and is stripped of everything but her courage and determination. Gilgamesh and Enlil are loyal to one another through all the world's woes. Loki is friend and foe of the Aesir all at once.\nT.S. Eliot said, \"We fight rather to keep something alive than in the expectation that anything will triumph,\" and G.K. Chesterton (an enormously questionable fellow, but a pithy one) said, \"Fairy tales don't teach children that monsters exist. Children already know that monsters exist. Fairy tales teach children that monsters can be killed.\"\nSomewhere in the tension between those two statements, I think, lies the core of Epic Fantasy. We need it. It gives us heart in the face of a world full of dark lords and unpalatable choices. Enron or Sauron, we are all fighting something bigger than we are.\nIan C. Esslemont: I take this question to really be asking what is Epic Fantasy anyway? Why is some fantasy epic but others not? Is it a redundancy? Perhaps all fantasy is \"epic\". After all, some of what defines an epic in the traditional sense can be summed up as: the central heroic figure (or antihero), dangerous journeys, numerous misadventures, a strong element of the supernatural, long passages of dialogue, digressions, subplots.\nSo why \"epic\" fantasy? For my money, works that can be considered Epic Fantasy are those that attempt to go beyond merely telling the story of the messy fall of one particular king, or the journeys of this or that hero or heroine, to try to tackle larger questions. Beowulf asked the listeners to think about the nature of rulership, and their own traditions of blood feud and its consequences; The Odyssey allowed its listeners exposure to alternative societies and other ways of living; other epics attempted to sum up the essence of their particular cultures or national identities.\nThis is the opportunity the epic provides. It allows the writer to ask the big questions: who are we? Where have we been? Where are we going?\nOne of the things I see Steve [Erikson] asking in his epic novels is the role of mythology in society. Is it dead? What purpose does or did it serve in any society? Do we still need it? Perhaps it is important and to turn our backs upon it is to harm part of what makes us human.\nSteven Erikson: An easy answer to this would be to look at what constitutes Epic Fantasy in last decade or so, acknowledging the protean nature of any genre, suggesting that what was is no longer; and that what is has been built upon what came before. But before too long, I suspect, we'd get into a discussion of who represents Epic Fantasy, which works, which trends, which subjects of interest and so on, and I admit that pretty soon I'd be nodding off. Besides, nothing new has been invented in the genre, ever.\nSo I'll give you a different reason to nod off and offer up this (but I do so without taking any credit, only the blame, in that I'm going to repeat something Steve Donaldson said at an ICFA panel last month, and then riff on it): Epic Fantasy is at the core of all literature. Now, Steve cited The Iliad, Gilgamesh and a few other early works to back up his observation. Hard to disagree (I was arguing at the time that Epic Fantasy is at the core of Fantasy and that it needs to be addressed by scholars of the genre) and in one way Steve was riffing off of what I was saying. But I prefer his take over mine.\nGroan if you will, but I actually take pleasure in going back to those ancient texts and looking at them again, this time in the context of what purpose they may have served, and whether these narrative structures can be extracted from the cultures that produced them, and thereafter applied, roughly, to the subgenre of Epic Fantasy as found in present-day SF&F sections of bookstores.\nIf we take the supernatural (in these old texts) as representative of capricious Nature, including the forces of chance, mischance, unknown (and unknowable) causes to known (observable) effects; and see in the dialogue between humans and those external forces/entities a kind of universal struggle against the vagaries of Nature, then we arrive at a basic and fundamental theme. Personification, anthropomorphism, all the mechanisms seeking to understand, explain, predict, now exist as an active backdrop against which personal, human dramas are played out. Remove the gods and their magical power and the dialogue ceases being a dialogue, and instead becomes a monologue, an increasingly desperate harangue in the face of an indifferent, unknowing and uncaring audience (Nature). We call that Realism, and as such proclaim it to be a pinnacle of truth and unclouded vision, a rational height achieved by virtue of ... well, growing up. But from this lofty height, all slopes lead down and prove slippery. As far as I can see, realist fiction invites the slide into nihilism more readily than does Fantasy. After all, in this world here, prayers go unanswered, and if any omniscient entity looks down on us, it is so alien as to understand nothing of our needs and merely observes in helpless bafflement — one might even argue that life itself is the prayer and the only answer it ever earns is death. I'll know more about that after I die, and I'll get back to you on that.\nDigressing. The distinction of \"epic\" seems to me to speak to that vastness of backdrop, wherein a dialogue is asserted, where metaphors are made real, and the struggle of living is conveyed in terms of high drama and a resonance that spans the human condition. As with The Iliad and Gilgamesh. Other, non-Epic forms of Fantasy are more modest variations on the theme, skirting the ledge but not quite taking the leap. Maybe in the end, the definition of Epic comes down to the author's own scope of vision. Of course, it can be argued that one can go inward easily as far as one can reach outward, and 'epic-ness' can exist in a wholly human drama, and we tend to call this ... um, literary and then apply to it some kind of exclusivity.\nSteve's right, I think. Epic Fantasy is at the core of all literature. I first thought of it as the \"spine\" but maybe a tree is a better analogy. Writers of Epic Fantasy have crawled off the dangling leaf, onto the twig and then the branch, straight back to the trunk. Somewhere behind, very distant now, the leaves rustle in eternal agitation, each one crying out \"I am the centre of the universe! Look at me!\" Now, before everyone goes wild on value judgments, let me go back to what might be the most controversial thing I threw into this meager essay: nothing new has been invented in the genre, ever. In terms of literary evolution, we're the ones who never left, lost in the thick bark, antennae waving fruitlessly.\nConversely to all of that, maybe Homer and the poet who penned Gilgamesh just liked inventing things — another universal human trait — and so do we.\nErin Hoffman: I think of Epic Fantasy as the archetype's archetype. Most people are familiar with Campbell's Hero with a Thousand Faces, but I prefer a variation on this that combines Darwinian biological theory with Kierkegaardian psychological existentialism (how many dollar's worth of words was that?) put together by Ernest Becker in the early 70s. Basically, as a result of our biology and fundamental human psychology we have certain inherent expectations about cause and effect in the world—a kind of physics of our souls. This is why a story's ending can feel right or wrong, and why some stories seem to resonate with us so strongly that they stick with us our entire lives.\nPaul Kearney: The heart (or core) of Epic Fantasy? That must vary, I think, according to the writer's own bent. For me, it's a chance to tackle all sorts of issues on a grand scale, the macro of nation versus nation as opposed to the micro of minutiae in interpersonal relationships. Not that interpersonal relations are not essential to Epic Fantasy, but there can be a lot more riding on them, and hence they get an extra charge. Also, it seems to me that decision-making and basic emotions can be invested with so much more resonance when there is a lot more riding on them—the fate of armies, kingdoms, whole peoples.\nJuliet McKenna: As with any story, the core of fiction is an exploration of the human condition. Which is to say, life, love, loss, the pursuit of wealth, health and happiness — or vengeance if that's the way one or more of the above play out.\nEpic Fantasy draws on history, myth and folklore for its narrative threads and themes, offering the reader sufficient familiarity for engagement in a secondary world while leaving enough uncertainty to keep them alert and questioning. Since we must continually examine our assumptions about this strange place, its inhabitants, its customs and practices, we find ourselves examining our assumptions about our own world.\nAnd that cultural and artistic heritage offers the fantasy writer swords, sorcery, dragons, monsters, heroes, villains, and countless other dramatic story-telling resources, facilitating such exploration of the human condition in the context of adventures bristling with magical possibilities. What's not to love?\nPatrick Rothfuss: It depends on who you ask, really. In my opinion, Epic Fantasy is one of the most vaguely-defined genres out there.\nIt's sort of like \"pornography\" or \"art.\" Most everyone uses those terms very loosely, and they don't really have a definition for them. They operate under a policy of \"I know what it is when I see it.\"\nWith Epic Fantasy, the real question is what part of the story is supposed to be epic? The action? The length of time depicted? The length of the actual books?\nI've heard some people say that the difference is the detail involved in the description of the world. But that seems like a pretty weak defining characteristic to me. If that were the case, most science fiction would be epic. But people don't think of it that way.\nI don't claim to know, myself. But I think the rule of thumb most people use is the length of the books. If a book is more than 500 pages long, most people call it Epic Fantasy.\nRobin McKinley: Epic Fantasy—I haven't the least idea what's at the heart of Epic Fantasy as opposed to unEpic Fantasy, or urban fantasy, or hard-core heavy-metal science fiction or cozy murder mysteries about cats and knitting or the Commander Toad series. I would say that the heart of any good read is the liveness of it—its own beating heart. When I think specifically of Epic Fantasy I'm afraid I still think of Lord of the Rings [LOTR] ... and then there's a long pause before any other, more modern authors occur to me.\nWhen I was growing up LOTR was all there was—LOTR was in the process of creating a new genre. (I liked E. R. R. Eddison and was mesmerized by Gormenghast, but LOTR was the grail attained.) What's the heart of LOTR? Story. And Tolkien writes very well about \"Story\", too. I recommend Tree and Leaf to anyone who doesn't know it: just as true now as it was 50 years ago.\nI might suggest that because Epic Fantasy is so, well, epic, that hanging on to that sense of the liveness at the heart of your story is perhaps even more crucial when it's sprawling across a huge terrain. Not to mention more difficult to maintain. (See below.) But this does highlight one aspect of what I think of when I think of \"epic\" fantasy—that however many books there are of the story, it's still only one story. It's not just any series with a repeating character or characters, or the history of a country or an artifact or a school of magic—unless there's some comprehensive, overarching background structure that leads to some kind of really final climax. It also needs some of what the clichéd use of \"epic\" usually means in any context: grandeur, sweep, scope. It may be about rabbits or accountants, but it needs to feel Miltonian. All of which the poor sweating author has to keep track of through all 1,000,000,000,000 words. (I assume that anyone interested in a discussion of the parameters of Epic Fantasy will know that Tolkien wanted LOTR published as one book, and kicked like the dickens against his publisher saying three separate volumes or we won't do it.)\nEven if I am finally able to write all the seven or so Third Damar Novels that hang around in my mental shadows snickering to themselves and not quite letting me see or guess enough to get them down on paper, I doubt Damar will belatedly prove to be an epic. When I wrote the first two Damar novels all those years ago and before I realized I was about to hit the wall, I called it a Series of Indefinite Length—not an epic. Nor do I think it has the gravitas for an epic; but I'm not going to try to define what suitable gravitas is.\nBut I'm still someone who grew up re-reading Tolkien till LOTR sank ineradicably into my bones. There may be other definitions of Epic Fantasy now, or a widening of the boundaries.\nBrandon Sanderson: What's at the heart of Epic Fantasy? That's a tough one. We have a hard enough time deciding what strictly is science fiction and what strictly is fantasy, let alone talking about the subgenres. But this is something I've thought about a lot. When I released my first book, Elantris, which was a standalone, everyone called it an Epic Fantasy. In my head, I hadn't thought of it as an Epic Fantasy. For me, \"epic\" means covering a large span of time or a large geographic area, over multiple books, dealing with the rise and fall of nations. No single one of those things is absolutely essential, but these are the feelings that Epic Fantasy invokes for me. At the same time, you can have an epic in one volume—I would certainly consider Tigana by Guy Gavriel Kay to be epic. Most of his work is, and a lot of his books are single volumes.\nWhat's at the core of Epic Fantasy? I would say that it's a sense of grandness, whether it's grandness in scope of the number of books—but of course I wouldn't call something like Dirk Pitt epic despite the fact that there are many books about him. There's a grandness in theme, a grandness in the types of characters that we're dealing with.\nIt's one of those things that I'm not sure you can really define. It's more a \"you know it when you see it\" sort of thing.\nRowena Cory Daniells: I don't believe the media really reflects our world. I believe the majority of people are much better than the media makes them out to be. We only see the worst, the corrupt politicians and large corporations, the senseless deaths because of terrorists; meanwhile, the majority of people hold down jobs, feed their families, play with their pets, give to charity and look for greater meaning in their lives.\nI'm not saying that Epic Fantasy gives \"greater\" meaning to people's lives, but it does deal with a cleaner world where people hold to \"old fashioned\" values like honor and loyalty, and it does offer hope for a better ending. In Epic Fantasy you expect the good guys to suffer, but win out in the end.\nRobert V. S. Redick: Fortunately for us all, the heart of Epic Fantasy is a roomy one, and we'll never know all that it contains. I can only tell you what I find there: an amazed and fearful humility at the largeness of creation, at the scale of existence with which our own hearts and minds are (rather mysteriously) equipped to grapple, and at the deep capacity of our passage through life to change us, to bring us to a place irretrievably different from where we began. Usually this involves a physical passage, too—a journey—but there are epics like García Márquez's One Hundred Years of Solitude that create the same awe strictly by carrying us through time.\nKate Elliott: I can tell you what I enjoy most about Epic Fantasy. I like the sense that you're getting a wide lens view of a world, one that is punctuated by close-ups and medium shots. The word I would probably use to describe what I'm looking for in an epic is \"sweep,\" defined in my American Heritage Dictionary as (variously) \"to move or unbalance emotionally; to cause to depart, remove or destroy; to traverse with speed or intensity; to extend gracefully or majestically.\"\nWhat that means is that for me the heart of Epic Fantasy is the emotional response it engenders in the reader. That emotional response is going to be something different for each reader rather than a static characteristic required for all. For me it's a teenage girl standing on a wind-swept promontory overlooking a vast landscape and distant ocean; she's got a bow and arrows slung over her back and a falcata at her hip, a faithful dog and horse at her side, sturdy boots and a cloak, and a long journey ahead of her. By which I don't mean that any story—not even mine—has to have that scene in it to be Epic Fantasy. I mean that when I read Epic Fantasy, I want to feel a sense of discovery and adventure and anticipation and vista.\nWhy do you write Epic Fantasy?\nN. K. Jemisin: It's not a conscious choice. That's just the form in which the stories come into my head.\nMichael A Stackpole: I write it because I enjoy it. I really like having a huge canvas that can be explored. I also really like world building (it's the gamer in me). Once the world is set, I do what I can to break it and get things moving into an interesting tale. The story's evolution fascinates me; and dealing with the consequences of such things is the challenge that keeps me going.\nErin Hoffman: Oh, I write everything I write because I can't help it. It's not a lot more complicated than that. I love worlds and I love story. I would create both if I were locked in a box at the bottom of the ocean. Epic Fantasy lets me tap into the symbolic and try to imagine new mythologies. It helps me dig into the meaning in my own life and try to express it in a way that connects with other people.\nIan C. Esslemont: Why do I write it? Right, good question. I'm currently sketching out some other projects. I considered them a break from what I am doing in Malaz. But now that I take another look at them I see that each and every one of them could be considered \"epic\" in their own way! It seems I can't get away from it no matter how far I think I've gone. So, my answer is that I write it because I have no choice: everything I try just comes out that way (so far).\nAs to why I write it... I'm not sure. I do remember that I was an indifferent student in school, until Dostoyevsky's Crime and Punishment was assigned in English. It completely transformed my expectations of the written word by its scope, its demands, its depth. There's one possible excuse for my problem: I was traumatized by a Russian novel as a child.\nJ. V. Jones: I write Epic Fantasy because I grew up reading it. Tolkien, Ursula K. Le Guin, T.H. White: they took me to places that felt so real that even when their stories ended, their worlds continued to exist. I want to create that same kind of robust fully-realized setting where readers can imagine themselves rattling around in it, entering fortresses, taking the roads, and freezing their butts off in the mountains.\nRobert V. S. Redick: [I write Epic fantasy] because I dream it, and have been doing so pretty continuously since a friend brought me a copy of The Silver Chair from Europe after third grade. Innumerable books since then, along with a great deal of Dungeons & Dragons in my teenage years, gave it a unique place in my heart. I also believe in the power of epic stories. They fire the imagination so powerfully that they can leap over lesser barriers, forging connections between disparate minds and peoples. The Greek myths have done this for centuries; so has Shakespeare and Cervantes and Tolkien. I've seen the proof first-hand, everywhere I've traveled.\nJames Barclay: I'm not sure that I write Epic Fantasy. Not all the time, anyway. Certainly the Ascendants books are Epic Fantasy and they are vast indeed. But I'm not certain The Raven books count — they're Heroic Action Fantasy though the whole septology (if there ever could be such a word) is epic, I guess.\nOh, hang on, I do write Epic Fantasy, sorry.\nI love writing it because I get to throw my characters into settings and situations completely removed from the 21st century. Places I have designed and where I get to make the rules—though none are outlandish because when all is said and done, your characters have to swim where you put them, not get swamped by wonder so to speak.\nI love the escapist nature of Epic Fantasy. It is a fitting place for heroes and I enjoy writing about heroes and the conflict and complexity within them. And this was the genre I was drawn to when I was growing up. The effects of decades of reading it are lifelong and marvelous.\nTerry Brooks: Wait a minute. You mean I have a choice? What I write is how I am built. I spent a lot of early years experimenting with every form of fiction you can imagine—even romance (terrible effort, by the way). What I discovered was that I was drawn to big, sprawling historical epics with lots of words and endless places to go. But I hate research. So that helped me decide to write about things that couldn't be second guessed. I like it that I invent everything and control everything in my stories. I like the challenge of creating the puzzle and then finding out how the pieces fit.\nNow and then, I still get asked why I don't write legal thrillers. You were a lawyer, they say. Isn't that a long way from being a fantasy writer. Oh, no, I reply. It's only a short putt.\nK. V. Johansen: This air stuff — why do you breathe it? For me, Epic Fantasy is the natural mode in which to tell a story. When I was quite small, one of my favorite games was adventuring, which mostly involved carefully packing snacks (they had to be things that would keep on the trail, like dried fruit) and then riding around and around the house on an imaginary horse. I don't recall that I ever actually got anywhere, defeated any villains, or battled any dragons, although there were always definitely dragons over the horizon, but still, it was the idea of travelling into new places, wandering unknown lands. And of course, the fact that horses and swords (and provisions) were vital to this. Perhaps underlying that is something that appeals to all of us at times, that element of going away and transforming yourself, and coming back something different, greater and grander and respected. That's very satisfying to the imagination, and partaking of that along with the hero is one of the pleasures of Epic Fantasy.\nOr maybe the real reason I write Epic Fantasy is that at the age of eight I read The Lord of the Rings multiple times, and it sank into my marrow and told me, This is what Story means; this is what Language is; this is how words work magic.\nWell, either way, for me, this is the shape that stories naturally take. I've written other things, kids' science fiction set in a small town, picture books, literary criticism, but when I get back to a nice big secondary world with lots of history evolving underneath as I write and the map starting to unroll off in all directions, it's as if I've put on a really comfortable old pair of boots, a sort of, \"Yeah, I'm home,\" feeling.\nI also like writing about characters on the edges of things, on the edge of their society, not fitting there — on the edge of humanity, never quite what everybody else is, all my shapeshifters and demons and ... whatever Moth is. Epic Fantasy gives such characters room to move, to cut loose and find out what they can really be. Because they're on the edges, or are forced to the edges, they have the outsider's freedom to see clearly, and they can come back in like a storm and shake things up. Or they find that they have to, because they're not complete and utter outsiders either; they're not as remote from humanity as some of them (not mentioning any names) would like to think they are. They can't just walk away. (Well, if they did, they'd be different people than they are, and there wouldn't be a story.)\nGaie Sebold: I love the chance to explore, to create new worlds and new types of culture (this is all sounding a bit Star Trek, isn't it?), to stretch out. You don't necessarily need huge landscapes and a hundred characters in order to deal with big themes, but it's an enjoyable and immersive way of doing it. You can weave in several themes or ideas, or go into a really big one in detail, or both. And most importantly, it's fun. There's room to put in the oddities and the funky stuff— to play. If I can't dance, it's not my revolution, the saying goes; and if I can't play, why write?\nRowena Cory Daniells: Someone asked me the other day why I write fantasy. I said it was because I like to torture my characters. I was only half kidding. By creating a world I can extrapolate from real world events and test my characters, see what they're made of.\nIn King Rolen's Kin the three main characters face moral dilemmas that make them question what they believe to be right. In my new trilogy, The Outcast Chronicles, there is a race of people who are persecuted because of their gifts. Their leader is forced to make decisions for the good of the many. Just because fantasy is set on an invented world or subverts the rules of our world, doesn't mean it can also be used to the human condition. In fact, it gives the writer more freedom because they remove loaded nouns, (like Black of Jew), removing the associations and allowing the reader to identify with a character who might undergo challenges that they don't face in their everyday life.\nThe fantasy genre can work on several levels. It can deliver a rollicking read. It can deliver that sense of awe and wonder, and it can also be quite subversive as in the work of the wonderful Terry Pratchett.\nPatrick Rothfuss: Honestly? I'm not sure I do [write Epic Fantasy]. As I mentioned above, if you think Epic Fantasy means \"big\" fantasy, then yeah. Sure, I write it. My books are long.\nBut if Epic Fantasy means a story that centers around clashing armies, apocalypses, and other titanic, world-changing events, then that's not really me.\nTrudi Canavan: I never considered my first series, the Black Magician Trilogy, to be epic. The setting is too small. Now perhaps it qualifies because I have written/am writing four more books in that world. Together they have become quite an epic, but I didn't set out to write \"epic\".\nThe Age of the Five, my second trilogy, was intended to be epic. The setting was larger, with conflicts between continents rather than countries, and there were gods, immortals and thousands of years of history. The books, themselves, were bigger, too. Writing something \"big\" was fun, but no more fun than writing something on a smaller scale. It just suited the kind of story I was telling.\nSteven Erikson: I did my share of leaf-fluttering. Then autumn arrived and I dried up and fell off. Hit the ground, joined the humus (smelling like shit), and bits of me went back to feeding the tree. Oh, fuck all that. I went back to the ancient texts because they spoke to me in ways nothing modern ever did. And I had a bone to pick with insensate Nature.\nAlso, because it's fun. I grew up reading E. R. Burroughs and R. E. Howard: adventure in exotic places. Later on it was Donaldson who showed me Fantasy's serious, adult side, and what was possible within the genre. It is not contradictory to say that it's fun being serious.\nEd Greenwood: I write Epic Fantasy because I love to read it, can never get enough of it, and feel good when I finish a satisfying scene or a book full of it. I want more of it. All of which really means I want to be happy and more carefree, to believe that there are heroes who will stand forth when things grow dark. I want to celebrate such people, tell tales of heroism (and warning of folly and that we need to stand on guard against ever-lurking evil) that soothe and gladden and inspire. I want to know that there is magic, that there are dragons—and that there are shining knights or bumbling wizards or scared but determined just plain folks who will endure or resist or pry into secrets or stand and fight, against evil. It gives me respite from the mundane frustrations of unfair life.\nPaul Kearney: The big stage for me becomes another tool to ratchet up the intensity of pressure on characters. It brings into play such concepts as personal honor, political expediency versus personal decency, and is a good way to explore the self-sacrifice—or lack of it—which can define an individual caught in interesting times.\nPlus, to be frank, I enjoy writing about military campaigns, political machinations, and clashes of culture and belief. All that can be done on the small stage as it were, but as I've said above, it's easier to turn the screw on characters when there is so much riding on their decisions.\nJuliet McKenna: I'm a historian by inclination and education as well as a lifelong reader of fantasy fiction and myth. This is what sparks my imagination above all else and offers me an unparalleled depth and breadth of instinctive resources for story-telling purposes. While I read and enjoy SF, for example, I have nowhere near that same understanding of science and technology and so could not write it with anything approaching the same insight and passion.\nDavid Anthony Durham: Why do I write Epic fantasy? Three reasons.\nOne: Because I owe my love of reading - and the writing career that grew out of it— to fantasy. I wasn't a reader until Tolkien and Le Guin and Alexander got their claws into me. After them, I was. I think this is true of many other readers and writers. A lot of us forget it when we become grown-ups and get focused on grown-up things. I didn't want to do that. So part of writing fantasy, for me, is an act of tribute to a genre that gave me so much when I desperately needed it.\nTwo: Stories of the fantastic are more fundamental to being human than any other kind of stories. As soon as we had the language to, we were telling tales of heroes slaying monsters and of gods doing battle. I don't think of fantasy as beginning with Tolkien— although he's clearly the single most important figure in terms of the contemporary fantastic novel. For me, The Epic of Gilgamesh is fantasy. The Iliad and The Odyssey are fantasy. Beowulf is fantasy. These works may have meant different things to the people that first heard them, but they all have a narrative flare to them that's truly epic. They're filled with bombast, courage or delusion to either aspire to or to learn from. Considering that, what more venerated genre could one write in?\nThree: I love the unlimited creative possibilities of fantasy. I'd written three historical novels before starting the Acacia series. The third, Pride of Carthage, was about Hannibal's war with Rome. It was a massive conflict with amazing events and twists of fortune and inspired leadership. It was epic. Leaving that novel, I wanted another epic. The world building I'd done for the ancient world got me craving writing in an imagined world where I had more freedom to mash things together that were never mashed together in actual human history. How could I write a novel that mixed opium addiction with the Atlantic slave trade in a pre-industrial world that includes Nordic, African, European and Asian inspired cultures in the same empire, and introduce a foreign invasion that endangers them all, despite their differences? If I was writing straight history that wouldn't be possible. A lot of historical writers would probably never want to do something like that. I did, though. Fantasy was the obvious choice of genre that would allow me to recast all those things in one big package. With some magic, ancient curses, fantastical creatures at play as well. Gets my blood pumping.\nPeter Orullian: I write Epic Fantasy for a love of many of those elements I mentioned earlier: scale, the exploration of family, etc, and setting all those things against the invention of a rich secondary world peopled with characters whose goals stand in opposition to each other.\nPlus, ya know, magic, battle, like that.\nAlso, while it may be true that other genres allow for philosophical exploration, there's a sense in which fantasy lends itself better to this than its counterparts. I think this is because you're able to set aside definitions we use in our \"real\" world, and examine an idea without the baggage the real-world ascribes to that idea. Not that theme or social commentary is my aim, but the form allows for this to happen more organically, I think, than other genres do.\nBrandon Sanderson: The simplest answer is that it's what I loved to read when I was younger, and what I still love to read. I think all of us as readers are deeply influenced by the first things we came to love. For me, those early books that I came to love were Melanie Rawn's Sunrunner books, and Tad Williams' Memory, Sorrow, and Thorn, and Robert Jordan's Wheel of Time. In those books I loved the depth of characterization you could go into.\nI read lots of other things—I like to read widely—and it seems that in a shorter volume you can't dig into a culture, a world, and characters the same way you can in Epic Fantasy. I love to have a deep breadth of worldbuilding, and I love to have plots that span several books where when you get to the last one you say, \"Wow, that's what this was all about all along.\" I love to write that; I love to read it. So it's just what I love. It really comes down to that.\nVictoria Strauss: Writing about meaning and significance is as much of an escape and a thrill for the author as reading it is for the reader, so that's one reason.\nAnother: I'm not an obsessive world builder, but I love the freedom of inventing and working with an imaginary setting, as well as the challenge of keeping my characters behaving like real people (as opposed to Campbellian archetypes) within it.\nAlso important to me is the way that an imaginary setting makes it possible to explore real-world themes and issues (such as, in my last two books, religious fundamentalism and oppression) without the baggage of real-world history.\nBottom line: I just like making up wonderful things!\nRobin McKinley: I don't write Epic Fantasy.\nWhen I was first contacted about contributing to this discussion, I laughed. But then I thought sure, why not? All good stories are Story, and the rest is details.\nHaving said that I don't write Epic Fantasy... I'm writing the nearest I've come to epic right now, and it's ruining my life and what remains of my mind. My last novel, Pegasus, was running long in its early drafts, and I was running late toward my deadline, as I usually am, and I finally thought, that's what's going on, oh, hey, saved—it's two books. And whacked it in half. I wasn't entirely happy about doing this, and since this meant Pegasus ends on a cliffhanger, my readers aren't happy about it either, not being used to this kind of treatment from me, but it did solve the immediate problem.\nNow ... now I'm embroiled in, well, something pretty large and sprawly and possibly epic, and I'm even less happy. I think about people like George R. R. Martin or Patrick Rothfuss and I can't begin to imagine how they do it: how they keep track over that many words, that many pages, that many computer files, that many people, that many sub-plots and ramifications. How they—how the rest of you in this discussion—keep control. Of course all story-telling is a kind of deliberate losing control of what you're writing so your story can tell itself as well as possible through your fingers on the keyboard, the pen, or the bottle of root beer because you're using voice-recognition software. But this is a very specific, knife-edge kind of loss of control, and requires focused, dedicated concentration and awareness to achieve. And I'm having a gruesome, insomnia-causing time trying to keep that focus and concentration just on a second book of the same story.\nMy worst nightmare? Peg II could run to III. It's not going to. I couldn't stand it. One of the stories I've often told about my beginnings as a professional writer is that I wrote Beauty, my first published novel, as a break from working on a story about Damar. (Not one of the ones that's been published. One of the ones from Aerin's vision near the end of The Hero and the Crown.) And I needed that break because I'd just found out that Damar was not one story but lots of them, and I panicked. I haven't got the brain, the organizational skills, or the stamina.\nThe one novel I've had turned down was one of those Third Damar Novels—I discovered that it was more than one novel long, panicked again, and when I whacked it in half, I botched the job. At least I did the job cleanly with Pegasus.\n(There's perhaps an argument that my poor patient husband's and my Tales of Elemental Spirits series is my own personal if inadvertent epic. I'm not good at short stories; better than half my published novels started life as short stories. It took several years before the first Elementals volume, Water, came out. It then took seven years for the second volume, Fire, to appear, because my short stories kept turning into novels: Dragonhaven, Sunshine and Chalice all began life as Fire short stories. I'm now squeezing a lot of moaning mileage out of the fact that this tendency is getting worse— Pegasus started life as an AIR story ... and it's now two novels. Peter has all but one of his Elementals short—short—stories written ... and has had, for some time. Years. Years and years.)\nGav Thorpe: I'm drawn to the themes of politics and power. As a dedicated reader of history I am intrigued by the interplay of forces that shape societies and cultures. While at first history (real or fictional) can seem a faceless, all-encompassing process, it is far more often dictated by the actions of a powerful or dedicated few. While very few of my characters are 'heroic' in the traditional sense, they are all remarkable individuals, possessed of strength and purpose enough to have a profound effect on the worlds they live in, whether driven by ambition, vengeance, or expectation. Epic Fantasy allows one to paint a world with a broad brush, encompassing different and often conflicting ideologies and cultures. It is the interplay of these different powers, and the realpolitik that results from that interplay, that shape worlds and drive the narrative.\nElizabeth Bear: Beowulf and the dragon destroy each other: fantasy tells us he was right to have fought. I need stories that tell me it is right to keep fighting, when despair and capitulation are so easy.\nLynn Flewelling: Epic Fantasy, and speculative fiction in general, give the writer a huge canvas to work on, especially in multi book series. You create the world and all that's in it. You create the people and govern their motivations, and throw all sorts of interesting obstacles in their way. You can also tackle social issues from different angles than you can in the real world. Much of my fantasy is about how I think things could be, rather than how they are. I like to challenge readers, make them think. I don't soapbox; that's a turn off, for me at least. I just like to weave in a thread of it into the greater action.\nI also really enjoy weaving in things I uncover in my research, and what I observe in the real world. Much of what I include is based on real things, such as the food I describe at feasts, or the economic geography of a country. I studied archery and got so interested in it that I took it up myself. As for war, or the darker side of human nature, all I have to do is watch the news. Some readers found the fourth Nightrunner book, Shadows Return, hard to read because of the brutal depiction of slavery; every aspect of what I wrote was based on real world research. It wasn't pretty, and it wasn't supposed to be. Slavery is a brutal, dehumanizing business. That was the point.\nEpic Fantasy generally includes magic, too, with which I have a love/hate relationship. Too much of it replaces the more exciting element of character endeavor. I don't find \"let the wizard do it\" stories very interesting. That's probably why my main characters don't have any ability in that direction, but have to rely on their wits. I do have wizards, and magic in my books, but there is an internal logic to it, and limits to what it can do. And there are different kinds of magic associated with different cultures, too, so everybody isn't doing the same things.\nMost of all, I enjoy creating characters. I strive to make them as real and believable as a fictional character can be, and by real I mean if you take away the magic and swords and plunk them down in a contemporary novel, they would still function well. They must have hopes, flaws, emotions that the reader can identify with on some level or at least recognize. I write from multiple points of view, and try to get inside the skins of my villains just as much as my heroes. Duke Mardus, the nemesis of the first two Nightrunner books, was a brilliant sociopath. Jeffery Dahmer was in the news while I was creating Mardus, and he absolutely fascinated me. How could someone look so normal—in fact he looked a great deal like a good friend of mine—and be so utterly alien inside? So lacking in basic human empathy? And what that lack of empathy allowed Dahmer to do? It's stunning to think about. He reminded me of the sharks at the Boston Aquarium; the aquarium features a huge glass column of a tank at the center of the building and you can around it on a spiraling platform from bottom to top. I found myself often eye to eye with a shark. Have you ever looked a shark in the eye? It's inky black, cold, devoid of the sort of emotion you find in a dog or cat's. Soulless is the closest I can come to describing that black gaze. So, working with Jeffery Dahmer and sharks, I came up with a charming, intelligent, handsome monster. Mardus was a blast to write. Not sure what that says about me, but it was.\nThat being said, you have to avoid both the anachronism trap, and what I call the \"stick up the butt Shakespeare syndrome.\" It's a fine line. You want them to sound like fantasy characters. If they're in a medieval-type setting, they aren't going to say things like \"Cool!\" or \"That's totally awesome!\" That kind of dialog is jarring and pulls me off the page. On the other hand, you don't want to have them saying \"Odds bodkins\" and \"Wouldst thou embark upon this quest with me?\" At least I don't. I do my best to make them a product of their environment, but also have them speak to each other in a natural on the ear manner. It's how they would sound to each other.\nWhat is the relationship between characters and settings in Epic Fantasy?\nElizabeth Bear: The characters are a product of their setting, aren't they? They grow out of it. We are all products of the world, the society, the culture, the landscape we inhabit.\nJames Barclay: In any genre, every character is (or should be) affected by the settings in which they operate. After all, we are all products of our environments to a greater or lesser extent. We cannot help but be affected by what we experience and so it should be for Epic Fantasy characters. This takes the answer to the first question a little further because your characters have got to be credible, identifiable and fascinating within the settings you describe for them. Just to take one aspect, it simply isn't credible to have a coward working in a group of mercenaries. This is not a career choice he or she would make and to try and make it so just to be different is to invite ridicule.\nKate Elliott: People exist in a cultural context. Characters live within their landscape both in the ecological and the societal sense. The society/societies the characters come from will inform how they see the world, approach the conflicts they struggle with, and interact with others.\nAs a writer, I do not see character and setting as separate; I see them as intertwined in exactly the way my own character and person is intertwined with the world I live in. I write from that place, so even though it's also true that my approach, and thus the plot and character decisions I make, are necessarily informed by my own experience of the world, I must always attempt to see their world from their immersion in it.\nTerry Brooks: Well, you've probably heard it said multiple times that settings are frequently characters in a writer's work and every bit as important as the two-legged kind. Or in my case, four-legged. I often start a book with nothing more than a setting. Judine and I travel a lot, and when we find someplace wonderful in our wanderings, we document it with notes and pictures. I always know right away when a setting is going to form the basis for a book. But settings have other uses, too. Frequently, they can be employed to reflect the emotional makeup of a character or a character's responses. They can determine to a large extent the way a reader views a character. I guess I just think the two are inextricable.\nEd Greenwood: In a truly Epic Fantasy (as opposed to just a long quest tale), the setting is a vital part of the story, almost a character (or several characters) in itself. Most epics involve events that change the setting forever, in some meaningful (sometimes very large) way. In short, the moral choices characters make have a lasting, far-reaching impact on the setting. In badly-written Epic Fantasy, a majority of characters can become pawns, whatever free will they possess being overridden by \"the too long arm of happenstance\" or timing. Epic Fantasy works best when characters choose their own fates (or if you prefer, \"dooms\"). Characters may or may not be aware of their relationship to the setting, but the reader is made aware of the tight bond between characters and setting. Even when a protagonist is a \"fish out of water,\" his or her underlying link to the setting or being suited for the setting is usually revealed in the end. I have often explained to other writers working in my most popular setting: \"The Realms isn't geography; it's people. The characters are the setting.\"\nRowena Cory Daniells: The world and the society should shape the character and their driving needs. The story should only be able to happen to that character, at that time, in that particular world because of the person they are. We are all products of our times, whether we realize it or not. I love creating worlds and I love character driven stories. In King Rolen's Kin it is Byren's instinctive reaction to protect his friend that lands him in trouble but he couldn't act otherwise because that is who he is.\nRobert V. S. Redick: Epic, for me, is about the wonder of our passage through life. In an epic story, the characters we read about are the ones making that passage. For it to be meaningful it must become real, and for it to become real they must be real: consistent in themselves, true to what we know instinctively about the workings of the human heart (unless they are so alien that we do not even seek humanity in them), and believably sprung from the soil, history and values of a fully imagined place. This is true even of the transplanted character, the stranger in a strange land. If s/he comes from elsewhere, that elsewhere too must be solid and tangible, or we will never believe in that character's relationship to the setting of the book itself.\nMichael A Stackpole: Characters must either be rooted in the world or, on rare occasions, be utterly alien to it and forced to adapt. Having them deal with magic as if they've grown up with it, for example, is critical for making a world believable. The characters must be a product of the same forces and history that shaped the world as the world itself. Otherwise, they have no skin in the game, and their actions won't be in character with someone from that world. They'll have no stake in saving or destroying it, so they really don't belong in the story.\nPatrick Rothfuss: Characters and settings? Their relationship? I hear they're just friends. Characters wanted to get more serious, but Settings was all, \"I don't want to risk ruining what we already have.\" Characters was pissed, of course, because they'd made out that one time when they were drunk at Steve's house. But apparently that was just a one-time thing.\nSeriously? I have no idea how to answer that question. It's sort of like asking me, \"What's the relationship between Christianity and feudalism in the Middle Ages?\" It's a question so big you could write a book about it.\nThe simple answer? Their relationship is big, important, and complicated.\nIan C. Esslemont: The settings tend to be just as epic as the characters, i.e.: large.\nThe epic requires a lot of territory in order to unfold. This relationship need no longer be one-to-one. Inner emotional landscapes need not have their exterior analogues in the setting. However, particular settings can help pose questions to the reader such as, are there other ways to relate to the world? What really is the relationship of people to nature? Can one people's wasteland be bountiful to another? Travel, or 'the journey' can help examine this.\nLynn Flewelling: What's the point of having a well-realized world if you don't have interesting people running around in it, and vice versa? As you might guess, for me, the best fantasy is character driven; I have to care deeply about the people to chew through the big bug crusher books so many of us write. I want to see them grow. I want to see their faults and weaknesses, as well as their strengths and how that all affects their actions and the outcome of events. That sort of cause and effect steers my writing.\nYou have to have a believable world, and they have to be a believable entity within that world.\nJ. V. Jones: People are shaped by their cultures. What character traits are valued? Which ones are denounced? In the clanholds culture of A Sword of Shadows reckless bloody-mindedness is celebrated while cleverness is viewed with suspicion. That means that a character can choose to conceal his intelligence or move away from home to a place that embraces knowledge and learning. Every decision you make about your fantasy setting has consequences for your characters. Creating a world and casting the characters that populate it go hand-in-hand.\nGaie Sebold: I think at its best, it's the same as between characters and settings in the real world. People are shaped by the landscapes they experience. Someone who grows up in a highly technological, fast-paced city will have different responses and attitudes to someone who grows up in a tiny rural village, but the essential human realities remain the same. If the things you worry about every day are whether your son is going to get shot in a gang fight or whether your sheep are going to survive the winter, you're still worrying, you're still concerned with survival. How people react to moral choices, to the tough decisions, is going to be colored by their experiences, but the core of the person is revealed by which decisions they make. The landscapes of Epic Fantasy can, I think give a new dimension to these human struggles. Partly by taking away the mundanities, so the interesting stuff, the tough choices, aren't muddled and muddied by the boring taking-out-the-bins of daily life; but also by providing a new perspective. Put people in a new setting, and you see them and their choices in a different way. Like good stage design, good world-building affects the way you see the characters and the decisions they make.\nJuliet McKenna: Characters and settings? Each must influence the other to create a three-dimensional, believable world. A person's character is shaped by their status, their culture and environment, as much as by their individual temperament, even if or when they are rejecting one or more aspects of their surroundings. In turn, such rejection and challenge continually shapes and reshapes societies and cultures. Humanity has also, always, shaped the physical world to suit each society's needs and aspirations, for good and ill.\nThese processes are continuous, sometimes swift and dramatic, at other times slow and subtle. Either way, Epic Fantasy should reflect this ongoing fluidity to draw the reader into a convincing secondary world—or must provide a convincing explanation for whatever has halted such fluctuation, since that can, of course, be the whole point of a story.\nErin Hoffman: I subscribe to Steve Rasnic Tem's Gestalt \"dream characterization\" theory on this. He says, in short, that \"every object in a dream is a piece of the dreamer\". Everything we see in dreams is a part of us. The particular chair that you imagine, the monster behind the door, the color of the sky — all of these have meaning because they are generated by our symbolic unconscious mind in a fusion of emotional and sensory memory. In fiction, this connects to the way we describe things—in Sword of Fire and Sea, Vidarian, the protagonist, sees most things in the sensations of sea and ship life, because that's his—and how our fantastic settings reflect the state of the world and therefore the state of the protagonist. If the world is broken, the protagonist is broken; the progression that the world goes through reflects the progression and change of the characters in it. They shape each other. And in fantasy we are lucky to be gloriously unlimited in how far we take that notion.\nK. V. Johansen: For me, a story and its world usually arise out of an idea for a character in a setting and situation. They end up evolving together. As the character develops and story begins to crystallize around him (or her), the world grows as well. Blackdog began with the idea of a foreigner in town being possessed by ... something ... that attacked him in an alleyway. I can still sort of see that alleyway, though it certainly doesn't exist in the Blackdog world any more. The deserts grew out of the mountains, the mountains grew to enclose the lake, the lake grew out of the goddess ... the goddess had to exist to give Holla-Sayan, the possessed hero, meaning. He's not \"victim number one\" of a monster; he's the hero, and now that he's possessed by the Blackdog, I need to find out why, which involves discovering where he can go from there, literally and emotionally. Next thing I know, I'm trying to figure out how many miles a day a Bactrian camel can travel and what Kahzakhstan smells like.\nCharacters are very dependent on their settings in Epic Fantasy, because it's the setting—the landscape, the cultural and political background, and the cosmology—that gives structure to the emotional and psychological world inside their heads. People are shaped by how they live, by their culture and history. If the setting is just something assembled from cardboard stage-sets, it's hard to see how the characters can be convincingly alive. They'll risk being just cardboard props too. If readers are going to have literary belief (Tolkien's term) in the story, they need all aspects of it to work together to sustain that. Setting and characters need to have equally rich \"realism of presentation\" (and that's Lewis's phrase).\nPaul Kearney: The settings to a major extent define the characters themselves. The culture in which you dump your characters will effectively create for them a value system they can either follow or rebel against. We're all a product of the world we live in, a cliché but true. Also, if you make one character behave in a way that's alien to his own cultural values, you must back up his actions - what's he fighting against? ('Whaddya got?') Without a background to create the character against, he's just a tabula rasa, and his actions will lack the poignancy or resonance they would otherwise have.\nPeter Orullian: In more traditional Epic Fantasy—meaning, more medieval, and certainly pre-industrial—the number of vocations you might assign a character is narrower, as is typically the variety of landscape that character will walk through. Often you'll find a closer connection to, and perhaps reliance on, the \"land.\"\nIn some of these tales, the governance is of a feudal nature, making the character/setting tie that much stronger.\nBut on a more abstract level, there's a sort of \"feel\" or poignancy, I think, that is fairly unique to the genre. Whether set in a royal court, or a rustic tavern, or against a vista of open terrain, I'm drawn to the interaction of characters with or against the setting in Epic Fantasy because things of import seem to resonate from them.\nThat all sounds rather maudlin and high-falutin. I get it. But it doesn't change the fact either. Not always, but often the personal choices and sacrifices of the character are reflections of what is being played out on the larger stage of the politics and imperiled world. When a writer of Epic Fantasy does this without drubbing you over the head with it, the story has resonances a reader can feel and appreciate, even if they can't articulate why. It's sort of that thing where you say, \"I know it when I see it.\"\nBrandon Sanderson: In science fiction and fantasy in general the setting becomes more of a character. It's one of the ways a lot of us think of it. Certainly we're not the only genres that do this; historical novels often will dig very deeply into the setting and make a character out of it. But the way we do setting is what distinguishes our genres.\nIn Epic Fantasy, there is more time to delve into the setting, and the setting does become like a character. I love the great epics—if we look at Dune for instance, which is one of those borderline books where you can ask, is this science fiction? Yes, it is. Is it an epic? Yes, it is. It shares many of the same plot structures and feels of an Epic Fantasy. If we look at Dune, what's the relationship between character and setting? Well, the setting influences everything. It's deeply part of each of the characters in different ways, and it's deeply part of the plot.\nIn Epic Fantasy I really do feel that the setting should be deeply interwoven into the characters—that you can't really have the same characters without that setting.\nVictoria Strauss: I think it's the same as in any book where the setting is an important part of the action, and varies from writer to writer and book to book—although, since the settings are imaginary, authors have to work harder to ensure that characters interact plausibly with their cultures and surroundings. It's a very similar challenge to that faced by historical writers, who don't make up a setting out of whole cloth, but still must work with what's essentially an invented world, since there's no way to experience a historical context directly.\nCharacters in Epic Fantasy tend to be acted upon by their environments more intensely than characters in other forms of fiction. The unique qualities, challenges, and dangers of the imaginary world, and characters' struggles and encounters with these, often play a large part in driving the plot. On the other hand, you could say the same about Pearl Buck's The Good Earth, so this certainly isn't unique to Epic Fantasy. I think it does tend to be a more common theme, though.\nTrudi Canavan: It depends on the setting. Where the character spent their past will obviously shape their personality, and how they react to new environments. What interests me most when creating fantasy worlds is how the fantasy element might have influenced the development of human civilizations. In the Black Magician Trilogy magic comes from within a person and, except in exceptional circumstances, that person has to be taught how to access it. That meant the teachers are very powerful and choose who learns magic. Magicians became the highest class within society.\nIn the Age of the Five I used a different setting, in which magic imbues the world. Human use of magic is limited by their ability to draw it in, so while some can only light a candle others are so powerful they can alter their body, stay young and extend their lives. Another fun aspect of this setting was that plants and animals could use magic, too. But naturally they use it for the same purposes that drive life in this world: to acquire food, a mate and avoid being eaten.\nSteven Erikson: My first answer is somewhere up above: story as dialogue; setting as implacable nature, the myriad forces against which we must all struggle blah blah.\nMy second answer is more specific to the modern form of Epic Fantasy, and accordingly reveals some, uh, frustration. Characters need to go somewhere. That said, it does seem that in modern Epic Fantasy characters need to cross or climb a lot of mountains. I never got that. I've been in mountains. They're boring. Impoverished ecosystems, a hard place to scratch a living, able to sustain meager populations at best. Yet, somehow, they're always full of monsters and evil hordes spilling out of caves like termites from a nest. Once over the mountains, it's temperate rain forests, once again filled with malevolent creatures. But dammit, been in temperate rain forests, too, and they're also impoverished (even with salmon in the rivers and streams). Boreal forests are little better and far less imposing or brooding. Guess it's that whole northern Europe thing, JRR's legacy. Central plains can create and sustain huge populations, but cyclically. Riparine and coastal environments are pretty good for civilization. So are peculiarly situated island groups like the UK, taking the best of all environments and creating a quaint amalgam of temperate stolidity rife with shires, spooky but comfortably contained forests, patches of denuded, inimical moorland, ragged coastlines and smugglers' beaches, all topped off with about ten billion people jammed in cars every bank holiday (all, it seems, heading to Falmouth, Cornwall). Oddly enough, this last template (a place much like the UK) seems to fit well many fantasy novels ... how about that? One should never discount coincidence.\nCould go all psychological here and talk about forests as the underworld of our psyches, the shadowy unknown; mountains as the unattainable and unconquerable; rivers, meres, lakes and oceans as invitations to the subconscious; cities as the intricacies of the human mind, etc. But in the end none of that makes much difference. A character interacts with the setting either honestly or dishonestly: they are either part of their environment, or they're false (modern) intrusions, replete with all the wrong sensibilities. Anyway, if the setting's a giant white whale, better have an Ahab or two, and let loose the rage.\nIt's what you do then that counts.\nGav Thorpe: For the most part, the characters will be the ones doing the shaping. It is their desires, destinies and whims that can affect the world they live in. They are the agents of the change, not content to live in the world as they find it, and with the strength and determination to alter that world. For the most part, but not always. A story can still be epic if told from a lowlier point of view, as long as the events in which the characters are embroiled are suitably broad and game-changing. It is interesting to examine how momentous events affect the little people as much as it is entertaining to follow the exploits of those who hold the reins of power. It is also possible to show that the course of history can be determined not only by kings and dark lords, but by faithful servants and loyal minions.\nThe majority of my characters are the former type; individuals of political and physical prowess who can rule nations and lead armies. With these characters it is important to ensure that the physical conflicts in which they engage are driven by more personal goals and conflicts. The characters' motivations may be selfless, more often selfish, but always there is some emotional and psychological force behind their lofty aims. There must be a reason why these characters and no others are the ones to take control of events and direct them.\n\"Something Better: An Epic Discussion of Epic Fantasy, Part 2\" will appear in the August issue of Clarkesworld Magazine. Topics will include series, humor, and violence, among others.\nDramatis Personae\nLou Anders is the editorial director of Pyr Books and the editor or co-editor of such anthologies as, Swords & Dark Magic and Masked. www.louanders.com\nJames Barclay is the author of the recent (in the US) Demonstorm and the forthcoming (in the UK) Rise of the TaiGethan. www.jamesbarclay.com\nElizabeth Bear is the author of such novels as The Sea Thy Mistress and the forthcoming The Tempering of Men (with Sarah Monette). www.elizabethbear.com\nTerry Brooks is the author of Bearers of the Black Staff and the forthcoming The Measure of the Magic. www.terrybrooks.net\nTrudi Canavan is the author of The Rogue and the forthcoming The Traitor Queen. www.trudicanavan.com\nDavid Anthony Durham is the author of The Other Lands and the forthcoming The Sacred Band. www.davidanthonydurham.com\nIan C. Esslemont is the author of Stonewielder and the forthcoming Throne and Orb. www.malazanempire.com/site/authors/2-esslemont\nLynn Flewelling is the author of The White Road and the forthcoming Casket of Souls. www.sff.net/people/lynn.flewelling\nEd Greenwood is the author of Elminster Must Die! and Bury Elminster Deep. en.wikipedia.org/wiki/Ed_Greenwood\nJohn Jarrold is the founder of the John Jarrold Literary Agency. He has edited for such publishing houses as Random House, HarperCollins, Pan Macmillan, Simon & Schuster, Orion/Gollancz, and Time Warner. www.johnjarrold.co.uk\nN. K. Jemisin is the author of The Broken Kingdoms and the forthcoming The Kingdom of Gods. nkjemisin.com\nPeter Orullian is the author of The Unremembered and the forthcoming Vault of Heaven Book 2. www.orullian.com\nRobert V. S. Redick is the author of The Ruling Sea and The River of Shadows. www.robertvsredick.com\nPatrick Rothfuss is the author of The Name of the Wind and The Wise Man's Fear. www.patrickrothfuss.com\nBrandon Sanderson is the author of The Way of Kings and the forthcoming The Alloy of Law. www.brandonsanderson.com\nGaie Sebold's first novel Babylon Steel is forthcoming from Solaris in January of 2012. gaiesebold.weebly.com\nMichael A. Stackpole is the author of At the Queen's Command and the forthcoming novelization Conan the Barbarian. www.stormwolf.com\nGav Thorpe is the author of The Crown of the Conqueror and the forthcoming The Crown of the Usurper. mechanicalhamster.wordpress.com\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/epic_interview1/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Something Greater: An Epic Discussion of Epic Fantasy, Part 1 by Jeremy L. C. Jones"}