{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "c2DWAkWUJvnttvS1GPmX06IUUzc=", "id": null, "license": null, "comments": "", "raw_text": "Interview  The Border between Writing and Life: A Conversation with Marly Youmans  Reviewers call Marly Youmans' work angelic, beautiful, magnetic, wonderful and immersive. And it is all those things. She is praised for her boundless creativity and her uncanny ability to surprise even her most dedicated fans over and over again. She has often been referred to as a best kept secret of American poetry, of fantastic literature, of literary fiction.  \"I'm afraid that I'm known for never writing about the same thing twice (although The Curse of the Raven Mocker and Ingledove take place in the same world, one that fuses together the traditional Scots and Irish culture ways of western North Carolina with Cherokee culture),\" said Youmans. \"This tendency is not one that mainstream publishing encourages, and I make the situation more complicated by writing in a number of forms — lyric and narrative poetry, short story, novella, and novel.\"  While publishers may have trouble placing Youmans, readers know that her stories and poems, like incantations, are powerful, meaningful, and often enchanting.  \"As a young girl, I was obsessed with reading and thought of myself as somebody who would become a writer,\" said Youmans. \"As a result, I have never quite understood how people who don't have a ruling passion make it through the days. I love the way poetry can pour out — that's a delicious sensation. I like the way that following the thread of a story can obliterate one's usual sense of time and space, and the way the past can become an accessible place rather than lost time. I like being surprised by something new that feels like me and not-me, as though it had flowed to me from a distant source. Chasing the muse can become, at times, the pursuit of joy. The way words sound when you push them around in new combinations feels satisfying to me.\"  A native of South Carolina, Youmans now lives in Cooperstown, NY, along with her family and an array of local ghosts. She is the author, most recently, of Val/Orson and of the forthcoming collection of poems, The Throne of Psyche. As she was preparing for a summer of teaching at places like Hollins College and Shared Worlds, we had a chance to discuss the borders between writing and life.    You move back and forth between poetry and prose. How do the two genres/modes inform each other? What has each taught you about the other?  I started out as a poet and was a poet for many years until a former colleague of mine said to me, \"What does the world need with another poem?\" This silly little joke of a question stopped me. I had thought of myself as a poet for a long time, but now I wasn't one. Days passed, and I could feel that something was dead inside me. Since I couldn't manage without writing, I started making stories on the weekends. A year later I had a plump manuscript. When I became a poet again, I found that everything had changed. I wanted poems that were bigger in every way possible, and I wanted to tell stories in poems, and I wanted to bind myself in the alluring corset of form. All of this came as a great surprise to me.  Back then, I was a once-and-future poet who wrote fiction, and no doubt I had the faults and the virtues that come from such a mix. The good things poetry gave to my fiction were a love of tautness, a lack of understanding about how to pad a novel, and a grasp of sound. But I didn't know anything about plot, propulsion, or causality and didn't see why they should matter. I hope that I've learned a few things since then.  But even last year's book from P. S. Publishing, Val/Orson, may have some elements that are related to poetry. A story of tree sitters set in the California redwoods and inspired by the legend of Valentine and his feral twin brother, its chapters are short, tight, and titled: a little like a collection of poems.  What does writing fantastic literature allow you to do that you couldn't do in a book like The Wolf Pit, which is set during the Civil War?  I'm going to answer this one by walking around it, thinking...  All fiction and poetry is made. Realism and irrealism are simply categories so that people can sort books, often for the purpose of sales and marketing.  Now consider, say, neurological status among people who can function in the world. There's a spectrum populated by interesting but varied people, some of whom appear unusual — fantastic, even — and some of whom appear ordinary. At one point, out in left field, there's Asperger's Syndrome or mild autism, say, and at another point, somebody who appears \"a regular Joe.\" Now consider books and this matter of realism and irrealism. What we see as fantastic is at one point on a spectrum of books, realism at another. But the books are all made. They're made up, one hopes for the joy of making things. Realism is the raw material that stretches out on all sides of us. So I have a hard time putting much faith in labels.  My first book, Little Jordan, was reviewed as literary fiction. Yet a number of people reported that it and the nine stories that I wrote at about the same time were strange — some said that they had a sort of fairy-tale relation to time and place. The next book I wrote, Catherwood, was set in 1676 and took a young woman from the Old World to the New World. Everything about the New World was fabulous to Catherwood, and she expected to see a unicorn or \"a red Indian\" at any instant. In fundamental ways, that's not any different from what happens to a girl who falls down a rabbit hole or one who stows away on a starship to another planet. When I look forward to The Wolf Pit, I see a book that begins under the shadow of that most Southern and Gothic of stories, \"The Fall of the House of Usher.\" The bloody plantation-reflecting puddles in the first scene could be reflecting that cracked house. Robin, the Confederate soldier who walks across that bloody ground, is obsessed with the 12th-century account of green children found in a wolf pit in Suffolk. All the passages related to those children are uncanny, as are the ones where Robin and his sister blur into that mysterious history. But what could be weirder than parts of that novel that relate directly to historical events? To yank red corpses from the red clay of the Crater is a surreal act.  So I don't particularly see a line between those books and fantasies like The Curse of the Raven Mocker or Ingledove or even Glimmerglass.  Now, for just a moment, I'll think about whether I might be fibbing. Considering Glimmerglass, I see that a surreal landscape is a kind of cauldron for cooking up transformation. At the start of the story, Cynthia might as well be the invisible woman in Randall Jarrell's poem, \"The Woman at the Washington Zoo,\" who shrieks inwardly against what she is and longs to be radically changed. A failed painter, Cynthia runs after a physical Muse who appears repeatedly on the other side of a stream by her house. Flood, labyrinth, and the dead speak to her deepest self and demand her transformation far more forcefully than they could in a novel that found itself more to the right on the spectrum of books. The fantastic allows ideas and intangible forces to be embodied and made visible without reducing a story to allegory. Perhaps I was fibbing.  I'll just walk around this question for a few years more...  Cooperstown, where you've lived for the last decade or so, is a village rich in history — some might even say that it is stuck in time. What about Cooperstown captured your imagination?  Cooperstown is a border town settled somewhere between ordinary life and fiction. People regard places brought into novels and named by James Fenimore Cooper as major landmarks. They borrow his place names for shops, clubs, and nonprofit organizations. Though this is not Europe, we have two castles, a big Norman one hidden in the woods and Kingfisher Tower in the edge of Otsego Lake (Cooper's Lake Glimmerglass.) The Farmer's Museum is a faux nineteenth-century village with pretend graves but real buildings, each moved to a new location. Cooperstown is America's mythic site of the birth of baseball. It also has a kind of class structure that smacks of Henry James and Europe.  Ghosts are rampant. Writer and philanthropist Susan Fenimore Cooper was seen floating down the aisle of Christ Church and vanishing into the altar on the day of her death. The house across the street from me has an old lady ghost who gives directions to lost travelers and a haunted mirror. The wall outside has a buried chief who occasionally stirs and kicks it to pieces. Next door is a Carl Brandt painting, bolted through an outer wall to discourage poltergeist activity — the subject of the portrait refuses to have it removed. Carl Brandt was a painter and the first director of the Telfair Academy in Savannah, where one of my aunts used to take me when I was little, so I feel quite friendly toward his haunted painting of the teenage bride, Jenny Cooper Worthington.  Did it take a while for you to feel at home enough there to use it as a setting?  Evidently not. I lived in Cooperstown from July '92 through June '93. That winter, being sure I would never return to the spot, I wrote Catherwood as a kind of souvenir of and homage to the area.  Some years later when my husband asked me where I would be willing to live, I said this: \"Well, I would never live north of Cooperstown.\" These words are of the genre known as Famous Last Words. This time around, I have lived near the lake for eleven chilly years, and I have written a good many stories — plus the forthcoming Glimmerglass — about the place.  I am definitely a Southerner, and so I can never be completely at home here. But that feeling is also useful to a writer.  How have you altered it for Glimmerglass?  I have stolen pieces of the village and fitted them together in a new way. I have pilfered a cunning little gatehouse and the stream beside it, and I have invented a new historic mansion to go with the gatehouse. My mansion emerges from a hill; inside the hill is a labyrinth. I borrow Kingfisher Tower, the frozen surface of the lake in winter, and the bottom of the lake for my own odd purposes. (Cooper used the lake for water burial in the Leatherstocking Tales. I use it for a different kind of immersion. Like him, I let my characters visit the slightly submerged island where his Muskrat Castle stood in The Deerslayer.) I have also borrowed the spring floods that sometimes flood Lakefront Park so that only the bronze \"Indian Hunter and His Dog\" and the tops of the benches show.  In some anthologized stories and in the original version of Glimmerglass, I have called the village Templeton, as Cooper did, but I am dropping that because of Lauren Groff's book, Monsters of Templeton — it's her home village, after all.  Your life is, as you say, like a bug on a hot griddle. How do you balance so much — motherhood, multiple genres, day-to-day life — and still keep your creativity so vital, so seemingly boundless?  If you're a mother, you can't be fussy about writing time or writing conditions. I have three children and need to be present for them. Forgotten books, homework, appointments, music lessons, sports, long talks: many things lap up the day. I wrote The Wolf Pit during the night, sometimes going to bed at four in the morning and rising with my children at seven. It's not a way to write that I recommend, but it worked. I am able to plunge into a novel or story without any trouble with readiness, and I can write in the midst of noise. Revision — tweaking poems, cutting and tightening fiction, and so on — is especially doable while children come in and out. Another useful thing is that my husband likes to cook. I highly endorse marriage to a man who cooks!  What prompted you to retire from teaching so soon after earning tenure? How did that change your writing life?  A Tweedledum and Tweedledee contrariness?  I'm glad for my tenure and promotion because it's a kind of landmark in life, and I have great respect for the work of teachers. Leaving the profession meant more time to write, as well as more time for family. My feeling is that I can do two large things well, but that three major activities are not in my scope. Being a mother, being a teacher, and being a writer are all demanding activities, especially for somebody who is a bit obsessive. I prefer concentrating on the two that are most important to me and occasionally dabbling in the third. I admire women who manage all three.  Are there any similarities between teaching and writing?  They both demand boatloads of time, energy, and creativity.  Lastly, what are you working on now and what's next?  Right now I'm working on some revision of poems and doing some semi-final polishing on a 3-in-1 trilogy written for my youngest child. I'll probably submit it in a few months after a final read and scrub.  This summer I'm going to be writer-in-residence for the graduate program in children's literature at Hollins for a few weeks, and afterward I'll be at Shared Worlds. I'm also scheduled to write an essay for a book honoring my friend Clive Hicks-Jenkins on the occasion of his 60th birthday retrospective in Wales. After that, no doubt there will be something else...  Next year will see publication of The Throne of Psyche, a collection of poems from Mercer University Press, as well as Glimmerglass from P. S. Publishing. After that comes another collection of poems, The Foliate Head from Stanza Press, guaranteed to green your mind. That book already has three scrumptious division pages by Clive Hicks-Jenkins. He did the marvelous cover of Val/Orson and will be doing three more covers for my work in the near future. Last is a book inspired by the peculiar life of Robert E. Howard, Maze of Blood, also from P. S. Publishing. I find fascinating his neurological strangeness and his Southern entrapment. And I had a wonderful time creating faux-Howard characters. Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nThe Border between Writing and Life: A Conversation with Marly Youmans\nReviewers call Marly Youmans' work angelic, beautiful, magnetic, wonderful and immersive. And it is all those things. She is praised for her boundless creativity and her uncanny ability to surprise even her most dedicated fans over and over again. She has often been referred to as a best kept secret of American poetry, of fantastic literature, of literary fiction.\n\"I'm afraid that I'm known for never writing about the same thing twice (although The Curse of the Raven Mocker and Ingledove take place in the same world, one that fuses together the traditional Scots and Irish culture ways of western North Carolina with Cherokee culture),\" said Youmans. \"This tendency is not one that mainstream publishing encourages, and I make the situation more complicated by writing in a number of forms — lyric and narrative poetry, short story, novella, and novel.\"\nWhile publishers may have trouble placing Youmans, readers know that her stories and poems, like incantations, are powerful, meaningful, and often enchanting.\n\"As a young girl, I was obsessed with reading and thought of myself as somebody who would become a writer,\" said Youmans. \"As a result, I have never quite understood how people who don't have a ruling passion make it through the days. I love the way poetry can pour out — that's a delicious sensation. I like the way that following the thread of a story can obliterate one's usual sense of time and space, and the way the past can become an accessible place rather than lost time. I like being surprised by something new that feels like me and not-me, as though it had flowed to me from a distant source. Chasing the muse can become, at times, the pursuit of joy. The way words sound when you push them around in new combinations feels satisfying to me.\"\nA native of South Carolina, Youmans now lives in Cooperstown, NY, along with her family and an array of local ghosts. She is the author, most recently, of Val/Orson and of the forthcoming collection of poems, The Throne of Psyche. As she was preparing for a summer of teaching at places like Hollins College and Shared Worlds, we had a chance to discuss the borders between writing and life.\nYou move back and forth between poetry and prose. How do the two genres/modes inform each other? What has each taught you about the other?\nI started out as a poet and was a poet for many years until a former colleague of mine said to me, \"What does the world need with another poem?\" This silly little joke of a question stopped me. I had thought of myself as a poet for a long time, but now I wasn't one. Days passed, and I could feel that something was dead inside me. Since I couldn't manage without writing, I started making stories on the weekends. A year later I had a plump manuscript. When I became a poet again, I found that everything had changed. I wanted poems that were bigger in every way possible, and I wanted to tell stories in poems, and I wanted to bind myself in the alluring corset of form. All of this came as a great surprise to me.\nBack then, I was a once-and-future poet who wrote fiction, and no doubt I had the faults and the virtues that come from such a mix. The good things poetry gave to my fiction were a love of tautness, a lack of understanding about how to pad a novel, and a grasp of sound. But I didn't know anything about plot, propulsion, or causality and didn't see why they should matter. I hope that I've learned a few things since then.\nBut even last year's book from P. S. Publishing, Val/Orson, may have some elements that are related to poetry. A story of tree sitters set in the California redwoods and inspired by the legend of Valentine and his feral twin brother, its chapters are short, tight, and titled: a little like a collection of poems.\nWhat does writing fantastic literature allow you to do that you couldn't do in a book like The Wolf Pit, which is set during the Civil War?\nI'm going to answer this one by walking around it, thinking...\nAll fiction and poetry is made. Realism and irrealism are simply categories so that people can sort books, often for the purpose of sales and marketing.\nNow consider, say, neurological status among people who can function in the world. There's a spectrum populated by interesting but varied people, some of whom appear unusual — fantastic, even — and some of whom appear ordinary. At one point, out in left field, there's Asperger's Syndrome or mild autism, say, and at another point, somebody who appears \"a regular Joe.\" Now consider books and this matter of realism and irrealism. What we see as fantastic is at one point on a spectrum of books, realism at another. But the books are all made. They're made up, one hopes for the joy of making things. Realism is the raw material that stretches out on all sides of us. So I have a hard time putting much faith in labels.\nMy first book, Little Jordan, was reviewed as literary fiction. Yet a number of people reported that it and the nine stories that I wrote at about the same time were strange — some said that they had a sort of fairy-tale relation to time and place. The next book I wrote, Catherwood, was set in 1676 and took a young woman from the Old World to the New World. Everything about the New World was fabulous to Catherwood, and she expected to see a unicorn or \"a red Indian\" at any instant. In fundamental ways, that's not any different from what happens to a girl who falls down a rabbit hole or one who stows away on a starship to another planet. When I look forward to The Wolf Pit, I see a book that begins under the shadow of that most Southern and Gothic of stories, \"The Fall of the House of Usher.\" The bloody plantation-reflecting puddles in the first scene could be reflecting that cracked house. Robin, the Confederate soldier who walks across that bloody ground, is obsessed with the 12th-century account of green children found in a wolf pit in Suffolk. All the passages related to those children are uncanny, as are the ones where Robin and his sister blur into that mysterious history. But what could be weirder than parts of that novel that relate directly to historical events? To yank red corpses from the red clay of the Crater is a surreal act.\nSo I don't particularly see a line between those books and fantasies like The Curse of the Raven Mocker or Ingledove or even Glimmerglass.\nNow, for just a moment, I'll think about whether I might be fibbing. Considering Glimmerglass, I see that a surreal landscape is a kind of cauldron for cooking up transformation. At the start of the story, Cynthia might as well be the invisible woman in Randall Jarrell's poem, \"The Woman at the Washington Zoo,\" who shrieks inwardly against what she is and longs to be radically changed. A failed painter, Cynthia runs after a physical Muse who appears repeatedly on the other side of a stream by her house. Flood, labyrinth, and the dead speak to her deepest self and demand her transformation far more forcefully than they could in a novel that found itself more to the right on the spectrum of books. The fantastic allows ideas and intangible forces to be embodied and made visible without reducing a story to allegory. Perhaps I was fibbing.\nI'll just walk around this question for a few years more...\nCooperstown, where you've lived for the last decade or so, is a village rich in history — some might even say that it is stuck in time. What about Cooperstown captured your imagination?\nCooperstown is a border town settled somewhere between ordinary life and fiction. People regard places brought into novels and named by James Fenimore Cooper as major landmarks. They borrow his place names for shops, clubs, and nonprofit organizations. Though this is not Europe, we have two castles, a big Norman one hidden in the woods and Kingfisher Tower in the edge of Otsego Lake (Cooper's Lake Glimmerglass.) The Farmer's Museum is a faux nineteenth-century village with pretend graves but real buildings, each moved to a new location. Cooperstown is America's mythic site of the birth of baseball. It also has a kind of class structure that smacks of Henry James and Europe.\nGhosts are rampant. Writer and philanthropist Susan Fenimore Cooper was seen floating down the aisle of Christ Church and vanishing into the altar on the day of her death. The house across the street from me has an old lady ghost who gives directions to lost travelers and a haunted mirror. The wall outside has a buried chief who occasionally stirs and kicks it to pieces. Next door is a Carl Brandt painting, bolted through an outer wall to discourage poltergeist activity — the subject of the portrait refuses to have it removed. Carl Brandt was a painter and the first director of the Telfair Academy in Savannah, where one of my aunts used to take me when I was little, so I feel quite friendly toward his haunted painting of the teenage bride, Jenny Cooper Worthington.\nDid it take a while for you to feel at home enough there to use it as a setting?\nEvidently not. I lived in Cooperstown from July '92 through June '93. That winter, being sure I would never return to the spot, I wrote Catherwood as a kind of souvenir of and homage to the area.\nSome years later when my husband asked me where I would be willing to live, I said this: \"Well, I would never live north of Cooperstown.\" These words are of the genre known as Famous Last Words. This time around, I have lived near the lake for eleven chilly years, and I have written a good many stories — plus the forthcoming Glimmerglass — about the place.\nI am definitely a Southerner, and so I can never be completely at home here. But that feeling is also useful to a writer.\nHow have you altered it for Glimmerglass?\nI have stolen pieces of the village and fitted them together in a new way. I have pilfered a cunning little gatehouse and the stream beside it, and I have invented a new historic mansion to go with the gatehouse. My mansion emerges from a hill; inside the hill is a labyrinth. I borrow Kingfisher Tower, the frozen surface of the lake in winter, and the bottom of the lake for my own odd purposes. (Cooper used the lake for water burial in the Leatherstocking Tales. I use it for a different kind of immersion. Like him, I let my characters visit the slightly submerged island where his Muskrat Castle stood in The Deerslayer.) I have also borrowed the spring floods that sometimes flood Lakefront Park so that only the bronze \"Indian Hunter and His Dog\" and the tops of the benches show.\nIn some anthologized stories and in the original version of Glimmerglass, I have called the village Templeton, as Cooper did, but I am dropping that because of Lauren Groff's book, Monsters of Templeton — it's her home village, after all.\nYour life is, as you say, like a bug on a hot griddle. How do you balance so much — motherhood, multiple genres, day-to-day life — and still keep your creativity so vital, so seemingly boundless?\nIf you're a mother, you can't be fussy about writing time or writing conditions. I have three children and need to be present for them. Forgotten books, homework, appointments, music lessons, sports, long talks: many things lap up the day. I wrote The Wolf Pit during the night, sometimes going to bed at four in the morning and rising with my children at seven. It's not a way to write that I recommend, but it worked. I am able to plunge into a novel or story without any trouble with readiness, and I can write in the midst of noise. Revision — tweaking poems, cutting and tightening fiction, and so on — is especially doable while children come in and out. Another useful thing is that my husband likes to cook. I highly endorse marriage to a man who cooks!\nWhat prompted you to retire from teaching so soon after earning tenure? How did that change your writing life?\nA Tweedledum and Tweedledee contrariness?\nI'm glad for my tenure and promotion because it's a kind of landmark in life, and I have great respect for the work of teachers. Leaving the profession meant more time to write, as well as more time for family. My feeling is that I can do two large things well, but that three major activities are not in my scope. Being a mother, being a teacher, and being a writer are all demanding activities, especially for somebody who is a bit obsessive. I prefer concentrating on the two that are most important to me and occasionally dabbling in the third. I admire women who manage all three.\nAre there any similarities between teaching and writing?\nThey both demand boatloads of time, energy, and creativity.\nLastly, what are you working on now and what's next?\nRight now I'm working on some revision of poems and doing some semi-final polishing on a 3-in-1 trilogy written for my youngest child. I'll probably submit it in a few months after a final read and scrub.\nThis summer I'm going to be writer-in-residence for the graduate program in children's literature at Hollins for a few weeks, and afterward I'll be at Shared Worlds. I'm also scheduled to write an essay for a book honoring my friend Clive Hicks-Jenkins on the occasion of his 60th birthday retrospective in Wales. After that, no doubt there will be something else...\nNext year will see publication of The Throne of Psyche, a collection of poems from Mercer University Press, as well as Glimmerglass from P. S. Publishing. After that comes another collection of poems, The Foliate Head from Stanza Press, guaranteed to green your mind. That book already has three scrumptious division pages by Clive Hicks-Jenkins. He did the marvelous cover of Val/Orson and will be doing three more covers for my work in the near future. Last is a book inspired by the peculiar life of Robert E. Howard, Maze of Blood, also from P. S. Publishing. I find fascinating his neurological strangeness and his Southern entrapment. And I had a wonderful time creating faux-Howard characters.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/youmans_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Border between Writing and Life: A Conversation with Marly Youmans by Jeremy L. C. Jones"}