{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "1cU48z1bgZho16k9I5thAe7C6YY=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: 2020 Reader's Poll Finalists  In late January, we held the first phase of our annual Clarkesworld Magazine Reader’s Poll for best story and cover art. Maintaining the model we’ve used in recent years, the nomination phase took place online and lasted just under two days. The narrow window has continued to prove effective at minimizing the effects of ballot-stuffing and campaigning without having a significant impact on the participation level.  This year, it seemed clear from the start that a small group of works were destined to become finalists, but as the deadline approached the border blurred. At the buzzer, six stories tied for fifth place. Voters clearly felt passionately about these works, so it seems only fair to include them all as finalists, as a tie-breaker just didn’t seem fair. They are worthy contenders, after all.  Without further ado, here are this year’s finalists presented in alphabetical order:  Best Story  \r\n   “An Important Failure” by Rebecca Campbell (Novelette, August)  “The Translator, at Low Tide” by Vajra Chandrasekera (Short Story, May)  “Helicopter Story” by Isabel Fall (Novelette, January) Not currently available online.  “One Time, a Reluctant Traveler” by A. T. Greenblatt (Short Story, July)  “Distant Stars” by P H Lee (Short Story, April)  “Lone Puppeteer of a Sleeping City” by Arula Ratnakar (Novelette, September)  “Ask the Fireflies” by R. P. Sand (Novelette, September)  “AirBody” by Sameem Siddiqui (Short Story, April)  “To Sail the Black” by A.C. Wise (Novelette, November)  “A Stick of Clay, in the Hands of God, is Infinite Potential” by JY Neon Yang (Novelette, May)  Best Cover Art  “Alien Scout” by Arjun Amky (November) “Home Planet” by Beeple (April) “Monk's Mirror” by Joseph Diaz (August) “Family Portrait” by Yigit Koroglu (July) “Ancient Stones” by Francesca Resta (October) Congratulations to all our finalists!  Now it’s up to you to pick the winner in each category. Go to:  And rank the stories by your order of preference. Voting will close on February 15th at 8PM EST and the winners will be announced in our March issue.  Speaking of awards, DisCon III—the 79th World Science Fiction Convention—has opened the nomination period for this year’s Hugo Awards. Since there are still a few people who continue to nominate Clarkesworld for Best Semiprozine, I’d like to once again remind you that we haven’t been eligible for that award for a long time. Give your nomination to one of the many fine semiprozines out there instead. You can find a list at semiprozine.org.  Beyond that, at present, there isn’t a category for professional magazines, but you can nominate me for Best Editor Short Form if you are so moved, and of course, all our original fiction is eligible in their respective categories. The list of those works and the appropriate category for each story was included in last month’s editorial at clarkesworldmagazine.com/clarke_01_21/. Our 2020 cover artists are also eligible in the Best Professional Artist category.  Speaking from experience, I can tell you that each little nod you give means a lot. Recognition doesn’t pay the bills, but it has value, particularly after all everyone’s been through in 2020.  Thank you and happy voting! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: 2020 Reader's Poll Finalists\nIn late January, we held the first phase of our annual Clarkesworld Magazine Reader’s Poll for best story and cover art. Maintaining the model we’ve used in recent years, the nomination phase took place online and lasted just under two days. The narrow window has continued to prove effective at minimizing the effects of ballot-stuffing and campaigning without having a significant impact on the participation level.\nThis year, it seemed clear from the start that a small group of works were destined to become finalists, but as the deadline approached the border blurred. At the buzzer, six stories tied for fifth place. Voters clearly felt passionately about these works, so it seems only fair to include them all as finalists, as a tie-breaker just didn’t seem fair. They are worthy contenders, after all.\nWithout further ado, here are this year’s finalists presented in alphabetical order:\nBest Story\n- “An Important Failure” by Rebecca Campbell (Novelette, August)\n- “The Translator, at Low Tide” by Vajra Chandrasekera (Short Story, May)\n- “Helicopter Story” by Isabel Fall (Novelette, January) Not currently available online.\n- “One Time, a Reluctant Traveler” by A. T. Greenblatt (Short Story, July)\n- “Distant Stars” by P H Lee (Short Story, April)\n- “Lone Puppeteer of a Sleeping City” by Arula Ratnakar (Novelette, September)\n- “Ask the Fireflies” by R. P. Sand (Novelette, September)\n- “AirBody” by Sameem Siddiqui (Short Story, April)\n- “To Sail the Black” by A.C. Wise (Novelette, November)\n- “A Stick of Clay, in the Hands of God, is Infinite Potential” by JY Neon Yang (Novelette, May)\nBest Cover Art\n“Alien Scout” by Arjun Amky (November)\n“Home Planet” by Beeple (April)\n“Monk's Mirror” by Joseph Diaz (August)\n“Family Portrait” by Yigit Koroglu (July)\n“Ancient Stones” by Francesca Resta (October)\nCongratulations to all our finalists!\nNow it’s up to you to pick the winner in each category. Go to:\nAnd rank the stories by your order of preference. Voting will close on February 15th at 8PM EST and the winners will be announced in our March issue.\nSpeaking of awards, DisCon III—the 79th World Science Fiction Convention—has opened the nomination period for this year’s Hugo Awards. Since there are still a few people who continue to nominate Clarkesworld for Best Semiprozine, I’d like to once again remind you that we haven’t been eligible for that award for a long time. Give your nomination to one of the many fine semiprozines out there instead. You can find a list at semiprozine.org.\nBeyond that, at present, there isn’t a category for professional magazines, but you can nominate me for Best Editor Short Form if you are so moved, and of course, all our original fiction is eligible in their respective categories. The list of those works and the appropriate category for each story was included in last month’s editorial at clarkesworldmagazine.com/clarke_01_21/. Our 2020 cover artists are also eligible in the Best Professional Artist category.\nSpeaking from experience, I can tell you that each little nod you give means a lot. Recognition doesn’t pay the bills, but it has value, particularly after all everyone’s been through in 2020.\nThank you and happy voting!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_02_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: 2020 Reader's Poll Finalists by Neil Clarke"}