{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Gord Sellar", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "w1SLFmdAc05ofR3ozl2EMYiphuQ=", "id": null, "license": null, "comments": "", "raw_text": "Interview  My World Wobbled and Changed: An Interview with Soyeon Jeong  Soyeon Jeong is a major author of science fiction in South Korea, and a celebrated translator of science fiction (from English to Korean). She is also a practicing attorney, and has founded and directed a charity (which works to help children in developing nations gain a quality education), as well as founding and chairing the Science Fiction Writers Union of the Republic of Korea. It is hard to imagine the world of South Korean science fiction without her indefatigable contributions to it. Her short story “The Flowering” recently appeared in the April 2019 issue Clarkesworld.  I think you grew up in South Korean SF fandom in the 1990s. My impression is that SF was even more marginal in Korea back then—is that right? Can you tell us a little about what that was that like, what kinds of SF were available to you, and how you managed to connect with SF fandom here?  It wasn’t actually the ’90s but the early 2000s, for me. At that time, we weren’t connected via the web yet, but instead via a sort of Bulletin Board System that was called “PC communication” here. At the time, Korean SF fandom was a small group of lovely and nerdy people. There were some distinctive characteristics we shared: for example, most of us were avid bookworms who read many things besides SF, and many of us also spoke English. People wrote reviews of science fiction that hadn’t yet been translated to Korean, and there was a message board where people posted original stories.  Politically, fandom tended to lean to the left. In comparison with American fandom, I think it was something like a cross between the Futurians of the 1940s and the Clarion scene of the 1970s. I was a reader of both science books and SF, so I signed up with the fandom group. Then, in 2001, Korea’s SF fandom held its first SF convention, so I went, and for the first time I met the group’s other members. (Wow, they were real human beings—what a surprise!) At the time, I was the youngest person in the group.  The most important SF was already available in Korean: books by Asimov, Heinlein, and Le Guin. Also, Korean SF fandom was eager to introduce other SF—Roger Zelazny was quite popular, and Philip K. Dick was as well. Ursula K. Le Guin was already considered a classic here by then. Also, some fan-edited short story collections got printed. For example, we had a two-volume collection of feminist SF stories. Actually, that wasn’t exactly legal, but you know, it was fan publication (and it’s been out of print now for 30 years or so), but in that collection we had work by Joanna Russ, James Tiptree Jr., Pat Murphy. There were also collections of time travel stories and classic SF stories, all edited and translated by members of Korean fandom.  For myself, Kyobo Bookstore (the largest bookstore in Seoul at that time) had a good SF section. I could get the year’s best SF collections from there. After reading through the initial classics like Asimov and Zelazny—it might sound strange to put Asimov and Zelazny in the same sentence like that, but in Korea this made perfect sense—I just bought the year’s best anthologies, working my way backward, and then went on to get my favorite writers’ own publications.  We’re living in an age now when, at least for English-speakers, it seems increasingly accepted that there isn’t really a single “canon” of celebrated SF. I mean that lots of people now are more self-consciously building their own “personal canons” instead. Who are the authors (and creators) in your personal SF canon, and why do they have a place there? Also, are there any specific Korean fiction authors (genre or otherwise) who you took as exemplary or as role models?  Nancy Kress is definitely in my own SF canon. When I’m asked about what’s given me that famous “sense-of-wonder” experience, I always mention her “Beggars in Spain”—the novella—and “Out of All Them Bright Stars.” I read both in Gardner Dozois’ Year’s Best collections, and I was so awed. I felt like my world wobbled and changed. Later, I translated her short story collection, Beaker’s Dozen, which was an honor. Thanks to the benefits of Amazon and capitalism, I’ve read every publication by Nancy Kress before 2010. After that, I arrived at the 2L stage of law school . . .  The second year? I guess you didn’t have as much time to read after that?  Yes, that’s correct.  Also, Ursula K. Le Guin—she’s just such an important figure in SF in Korea. I guess Le Guin is the SF writer whose works are most completely translated to Korean. The Left Hand of Darkness has been simply a must-read novel for Korean SF readers, and it is indeed part of my personal canon as well. And On Wings of Song by Thomas M. Disch. I really wanted to translate that one, but no publishing company managed to agree to his agent’s conditions. (I’m still sour about that.)  As for talking about role models, as I’m a member of the earlier generation of modern Korean SF authors, I can’t think of any Korean SF writers who were exemplars for me when I was starting out. I know that I am a role model to many younger Korean writers, though—ha! For non-SF work, the poet Hwang In-suk is my role model. I hand-copied her work to learn how poets and essayists construct their sentences. As a writer, I am keenly aware of the rhythm and rhyme of each sentence. Often, I phrase my sentences in different ways to see which way the prose works best.  All of your works that have been translated to English so far have engaged with politics in some manner: “Cosmic Go” (which appeared in the anthology Readymade Bodhisattva earlier this year) deals with the struggles of an aspiring astronaut who is physically handicapped; “Home” (which appeared in Guernica in late February) confronted how radical inequality can result from technocratic systems (like actuarial tables) by which corporate and government policies are developed; and “The Flowering” (Clarkesworld, April 2019) tackled resistance to state censorship and the digital panopticon. Do you feel that engaging with political issues like these feels inextricably part of the work of writing SF, or is it more of a conscious choice you make when writing?  I didn’t think about the political or social aspects of my work when I first began my career as a writer. I think at the beginning it came out unconsciously. I was young, and as most young writers do, I wrote from my own experience and sentiments. “Cosmic Go” was my first short story, and I was 20 years old then. In my later work, I began to make a conscious choice to deal with such things, because I began to meet readers who liked that side of my work.  In 2007, I met a reader who said that she went on a trip with her handicapped brother for the first time in her life after reading my work. I met a teenaged reader who came to my lecture and whispered to me that my story, “The Shore of Masan,” which is quite a straightforward coming-out story of a young lesbian, was exactly like herself and that it had kept her alive. When you meet readers like that, you can’t help but look back on what you wrote, and try not to disappoint your readers.  As I read “The Flowering,” the past couple of decades flashed before my eyes—everything from the push for eradicating anonymity online here, to the 2009 “Minerva” prosecution, to the more recent scandal involving the National Intelligence Service and Twitter during an election . . . as well as how readily the public seems to have accepted the new norms. Is it fair to say that these things form the backdrop of “The Flowering,” and can you maybe fill in readers on that background a little, for those who know nothing about you, could you tell us a little more about the issues as you see them?  Actually, “The Flowering” was written before the Minerva and the NIS incident. The background is much more personal.  One of my undergraduate friends was a conscientious objector. In Korea, military service is mandatory for men, and no alternate form of service has been made available to people like him. It was only last year that this was found unconstitutional by the Court. Anyway, my friend was sentenced to a year and a half in prison. That was the first time I saw the criminal court and the prison. He was held at the Yeongdeungpo prison, and I went to visit him several times. Since I went to the court, I met his mother, his activist friends, and my own prosecutor friend, and it was such a strange experience.  To begin with, you get more than a year’s prison sentence just for being a pacifist. And in some ways, that’s considerate of the court, because under Korean military law, if the sentence is less than eighteen months, you have to go to the military anyway once you get out of prison. So then you get stuck in the prison complex, which is this building that’s like forty years old and stands in a busy part of Seoul. Because my friend was an educational elite—he was studying for a master’s in sociology at Seoul National University—he received a work assignment as part of the prison's administration system. He told me that most conscientious objectors end up helping the management of the prison, because they are usually well-educated, understand the system quickly, and are accustomed to following institutional rules. How ironic.  I couldn’t believe that more than 500 individuals went through this annually, and that society was so . . . how can I put this? So “conscientiously ignorant” about it. I saw the collective military experience of people in general: how people became uncomfortable when I talked about my conscientious objector friend, how I myself froze up and got a bit scared when I visited the prison, and also how the young activists kept a bubble of pride around themselves all through the experience. I think my story came out from those experiences.  I guess most English-speakers are more familiar with Korean SF in a different form—film and TV shows, which seem to be profoundly preoccupied with the past—memory, national history, trauma and fractured identity, colonial history, the sufferings of the dictatorship era, and so on. But SF films and SF books are usually pretty different in most places, so I wonder if you could tell us a bit about the divide between cinematic and literary SF within a South Korean context.  The quality of cinematic SF in South Korea has been questionable. I remember several ridiculous, high-budget blockbuster movies that could have been a good SF, but instead ended up being copies of Hollywood films or, worse and more often, just bad propaganda for nationalism and patriotism. I think the major reasons for this is that we experienced both colonial history and the dictatorship era. Those kinds of political themes may look much more interesting than literary Korean SF, and in South Korea, nationalism sells. So we have so many alternate history movies—which we consider a part of the SF genre here—that just sell nationalism.  Also, there’s the effect of Japanese movies and animation, which may have nudged our cinema in the wrong direction. Korean literary SF is not very much influenced by Japan: the major influence has been post-New Wave English-language SF. But in the media business, I think the influence of Japanese culture is more profound.  Still, I also find that recently Korean movie markets are discovering Korean literary SF and fantasy. Maybe it’s because both markets have matured, or maybe it’s the recently growing demand for diversity. I’m not really sure what the reason is, but I know that many screenwriters here are trying to write SF these days. And in the market, nowadays Korean SF writers are meeting agencies or buyers interested in Korean literary SF works. Also, many works are quite easy to bring to life on-screen, because the majority of Korean SF works tend to be more realistic. I mean, it wouldn’t take a lot of money to adapt “The Flowering” into a movie—you could just set it in modern-day Seoul and nobody would notice the difference. I think this kind of “realism” in Korean literary SF is now getting noticed.  As an SF writer working in the Korean language, probably the biggest challenge you and your fellow authors face is the limited size of your audience, the linguistic isolation of working in a language other than English. Hopefully that’s starting to change as translation of Korean SF becomes more common. Is this the biggest challenge Korean SF authors collectively face or are there others?  That’s not the biggest challenge! We also face low-paying publishers, and bad editors, and rip-off agencies! But, yes, it is indeed a challenge. The Korean market is small, and the standard expected by readers is high, with so many “best-of-the-best” works from abroad already having been translated. As a professional writer, this is indeed an issue. It’s difficult to make a living as a writer, and we don’t know how to introduce our work in other languages. I am not even sure if there is any demand for it. I’m positive that once it is introduced, Korean SF would attract an audience of readers in other languages, but it’s so hard get to that point. SF is part of pop culture, and I want Korean SF, and my own work, to be accepted as good work, not just as some exotic work to be examined. I deeply appreciate Clarkesworld for giving space for translated work.  You’re also a respected translator of English-language SF into Korean. Can you tell us more about that: how your translating informs your writing, and about the curatorial aspect of the work of translating foreign SF in Korea?  Sure. I always think about translation as curation, and I think most SF translators in Korea—maybe I can say all of them, since there aren’t that many of us here—share that sentiment. Many translators were the first to introduce a given SF author to Korean readers. We, translators, think hard about what to translate, and sometimes work very hard to persuade publishers. For example, my first SF translation was Kate Wilhelm’s Where Late the Sweet Birds Sang, my second was Elizabeth Moon’s The Speed of Dark, and my third was David Gerrolds’ The Martian Child. I think you can already see where I am going with this list—it was clear from the start. But most translators here have this kind of tendency. For example, Suhyun Lee, who has translated many of Le Guin’s works, also translated James Tiptree Jr. and Octavia Butler. (Oh, how I envy her! I really wanted to be the one to do it!) Sanghoon Kim, who translated Zelazny’s Amber Series, is the translator of most of Philip K. Dick’s works. Most of Arthur C. Clarke’s work is translated by Hokwan Ko, who is both a translator and a science journalist. Each translator definitely works as a curator in Korea, and a certain proportion of the SF readership is aware of this. Gord Sellar was born in Malawi, raised in Canada, and has lived in South Korea since 2002, where he has taught at universities, played saxophone in an indie-rock band, and worked as a writer, editor, and co-translator. He attended Clarion West in 2006, was nominated for the John W. Campbell Award for Best New Writer in 2009, and his fiction has appeared in Asimov's SF, Analog, Interzone, Clarkesworld, and several best of the year anthologies.", "text": "Interview\nMy World Wobbled and Changed: An Interview with Soyeon Jeong\nSoyeon Jeong is a major author of science fiction in South Korea, and a celebrated translator of science fiction (from English to Korean). She is also a practicing attorney, and has founded and directed a charity (which works to help children in developing nations gain a quality education), as well as founding and chairing the Science Fiction Writers Union of the Republic of Korea. It is hard to imagine the world of South Korean science fiction without her indefatigable contributions to it. Her short story “The Flowering” recently appeared in the April 2019 issue Clarkesworld.\nI think you grew up in South Korean SF fandom in the 1990s. My impression is that SF was even more marginal in Korea back then—is that right? Can you tell us a little about what that was that like, what kinds of SF were available to you, and how you managed to connect with SF fandom here?\nIt wasn’t actually the ’90s but the early 2000s, for me. At that time, we weren’t connected via the web yet, but instead via a sort of Bulletin Board System that was called “PC communication” here. At the time, Korean SF fandom was a small group of lovely and nerdy people. There were some distinctive characteristics we shared: for example, most of us were avid bookworms who read many things besides SF, and many of us also spoke English. People wrote reviews of science fiction that hadn’t yet been translated to Korean, and there was a message board where people posted original stories.\nPolitically, fandom tended to lean to the left. In comparison with American fandom, I think it was something like a cross between the Futurians of the 1940s and the Clarion scene of the 1970s. I was a reader of both science books and SF, so I signed up with the fandom group. Then, in 2001, Korea’s SF fandom held its first SF convention, so I went, and for the first time I met the group’s other members. (Wow, they were real human beings—what a surprise!) At the time, I was the youngest person in the group.\nThe most important SF was already available in Korean: books by Asimov, Heinlein, and Le Guin. Also, Korean SF fandom was eager to introduce other SF—Roger Zelazny was quite popular, and Philip K. Dick was as well. Ursula K. Le Guin was already considered a classic here by then. Also, some fan-edited short story collections got printed. For example, we had a two-volume collection of feminist SF stories. Actually, that wasn’t exactly legal, but you know, it was fan publication (and it’s been out of print now for 30 years or so), but in that collection we had work by Joanna Russ, James Tiptree Jr., Pat Murphy. There were also collections of time travel stories and classic SF stories, all edited and translated by members of Korean fandom.\nFor myself, Kyobo Bookstore (the largest bookstore in Seoul at that time) had a good SF section. I could get the year’s best SF collections from there. After reading through the initial classics like Asimov and Zelazny—it might sound strange to put Asimov and Zelazny in the same sentence like that, but in Korea this made perfect sense—I just bought the year’s best anthologies, working my way backward, and then went on to get my favorite writers’ own publications.\nWe’re living in an age now when, at least for English-speakers, it seems increasingly accepted that there isn’t really a single “canon” of celebrated SF. I mean that lots of people now are more self-consciously building their own “personal canons” instead. Who are the authors (and creators) in your personal SF canon, and why do they have a place there? Also, are there any specific Korean fiction authors (genre or otherwise) who you took as exemplary or as role models?\nNancy Kress is definitely in my own SF canon. When I’m asked about what’s given me that famous “sense-of-wonder” experience, I always mention her “Beggars in Spain”—the novella—and “Out of All Them Bright Stars.” I read both in Gardner Dozois’ Year’s Best collections, and I was so awed. I felt like my world wobbled and changed. Later, I translated her short story collection, Beaker’s Dozen, which was an honor. Thanks to the benefits of Amazon and capitalism, I’ve read every publication by Nancy Kress before 2010. After that, I arrived at the 2L stage of law school . . .\nThe second year? I guess you didn’t have as much time to read after that?\nYes, that’s correct.\nAlso, Ursula K. Le Guin—she’s just such an important figure in SF in Korea. I guess Le Guin is the SF writer whose works are most completely translated to Korean. The Left Hand of Darkness has been simply a must-read novel for Korean SF readers, and it is indeed part of my personal canon as well. And On Wings of Song by Thomas M. Disch. I really wanted to translate that one, but no publishing company managed to agree to his agent’s conditions. (I’m still sour about that.)\nAs for talking about role models, as I’m a member of the earlier generation of modern Korean SF authors, I can’t think of any Korean SF writers who were exemplars for me when I was starting out. I know that I am a role model to many younger Korean writers, though—ha! For non-SF work, the poet Hwang In-suk is my role model. I hand-copied her work to learn how poets and essayists construct their sentences. As a writer, I am keenly aware of the rhythm and rhyme of each sentence. Often, I phrase my sentences in different ways to see which way the prose works best.\nAll of your works that have been translated to English so far have engaged with politics in some manner: “Cosmic Go” (which appeared in the anthology Readymade Bodhisattva earlier this year) deals with the struggles of an aspiring astronaut who is physically handicapped; “Home” (which appeared in Guernica in late February) confronted how radical inequality can result from technocratic systems (like actuarial tables) by which corporate and government policies are developed; and “The Flowering” (Clarkesworld, April 2019) tackled resistance to state censorship and the digital panopticon. Do you feel that engaging with political issues like these feels inextricably part of the work of writing SF, or is it more of a conscious choice you make when writing?\nI didn’t think about the political or social aspects of my work when I first began my career as a writer. I think at the beginning it came out unconsciously. I was young, and as most young writers do, I wrote from my own experience and sentiments. “Cosmic Go” was my first short story, and I was 20 years old then. In my later work, I began to make a conscious choice to deal with such things, because I began to meet readers who liked that side of my work.\nIn 2007, I met a reader who said that she went on a trip with her handicapped brother for the first time in her life after reading my work. I met a teenaged reader who came to my lecture and whispered to me that my story, “The Shore of Masan,” which is quite a straightforward coming-out story of a young lesbian, was exactly like herself and that it had kept her alive. When you meet readers like that, you can’t help but look back on what you wrote, and try not to disappoint your readers.\nAs I read “The Flowering,” the past couple of decades flashed before my eyes—everything from the push for eradicating anonymity online here, to the 2009 “Minerva” prosecution, to the more recent scandal involving the National Intelligence Service and Twitter during an election . . . as well as how readily the public seems to have accepted the new norms. Is it fair to say that these things form the backdrop of “The Flowering,” and can you maybe fill in readers on that background a little, for those who know nothing about you, could you tell us a little more about the issues as you see them?\nActually, “The Flowering” was written before the Minerva and the NIS incident. The background is much more personal.\nOne of my undergraduate friends was a conscientious objector. In Korea, military service is mandatory for men, and no alternate form of service has been made available to people like him. It was only last year that this was found unconstitutional by the Court. Anyway, my friend was sentenced to a year and a half in prison. That was the first time I saw the criminal court and the prison. He was held at the Yeongdeungpo prison, and I went to visit him several times. Since I went to the court, I met his mother, his activist friends, and my own prosecutor friend, and it was such a strange experience.\nTo begin with, you get more than a year’s prison sentence just for being a pacifist. And in some ways, that’s considerate of the court, because under Korean military law, if the sentence is less than eighteen months, you have to go to the military anyway once you get out of prison. So then you get stuck in the prison complex, which is this building that’s like forty years old and stands in a busy part of Seoul. Because my friend was an educational elite—he was studying for a master’s in sociology at Seoul National University—he received a work assignment as part of the prison's administration system. He told me that most conscientious objectors end up helping the management of the prison, because they are usually well-educated, understand the system quickly, and are accustomed to following institutional rules. How ironic.\nI couldn’t believe that more than 500 individuals went through this annually, and that society was so . . . how can I put this? So “conscientiously ignorant” about it. I saw the collective military experience of people in general: how people became uncomfortable when I talked about my conscientious objector friend, how I myself froze up and got a bit scared when I visited the prison, and also how the young activists kept a bubble of pride around themselves all through the experience. I think my story came out from those experiences.\nI guess most English-speakers are more familiar with Korean SF in a different form—film and TV shows, which seem to be profoundly preoccupied with the past—memory, national history, trauma and fractured identity, colonial history, the sufferings of the dictatorship era, and so on. But SF films and SF books are usually pretty different in most places, so I wonder if you could tell us a bit about the divide between cinematic and literary SF within a South Korean context.\nThe quality of cinematic SF in South Korea has been questionable. I remember several ridiculous, high-budget blockbuster movies that could have been a good SF, but instead ended up being copies of Hollywood films or, worse and more often, just bad propaganda for nationalism and patriotism. I think the major reasons for this is that we experienced both colonial history and the dictatorship era. Those kinds of political themes may look much more interesting than literary Korean SF, and in South Korea, nationalism sells. So we have so many alternate history movies—which we consider a part of the SF genre here—that just sell nationalism.\nAlso, there’s the effect of Japanese movies and animation, which may have nudged our cinema in the wrong direction. Korean literary SF is not very much influenced by Japan: the major influence has been post-New Wave English-language SF. But in the media business, I think the influence of Japanese culture is more profound.\nStill, I also find that recently Korean movie markets are discovering Korean literary SF and fantasy. Maybe it’s because both markets have matured, or maybe it’s the recently growing demand for diversity. I’m not really sure what the reason is, but I know that many screenwriters here are trying to write SF these days. And in the market, nowadays Korean SF writers are meeting agencies or buyers interested in Korean literary SF works. Also, many works are quite easy to bring to life on-screen, because the majority of Korean SF works tend to be more realistic. I mean, it wouldn’t take a lot of money to adapt “The Flowering” into a movie—you could just set it in modern-day Seoul and nobody would notice the difference. I think this kind of “realism” in Korean literary SF is now getting noticed.\nAs an SF writer working in the Korean language, probably the biggest challenge you and your fellow authors face is the limited size of your audience, the linguistic isolation of working in a language other than English. Hopefully that’s starting to change as translation of Korean SF becomes more common. Is this the biggest challenge Korean SF authors collectively face or are there others?\nThat’s not the biggest challenge! We also face low-paying publishers, and bad editors, and rip-off agencies! But, yes, it is indeed a challenge. The Korean market is small, and the standard expected by readers is high, with so many “best-of-the-best” works from abroad already having been translated. As a professional writer, this is indeed an issue. It’s difficult to make a living as a writer, and we don’t know how to introduce our work in other languages. I am not even sure if there is any demand for it. I’m positive that once it is introduced, Korean SF would attract an audience of readers in other languages, but it’s so hard get to that point. SF is part of pop culture, and I want Korean SF, and my own work, to be accepted as good work, not just as some exotic work to be examined. I deeply appreciate Clarkesworld for giving space for translated work.\nYou’re also a respected translator of English-language SF into Korean. Can you tell us more about that: how your translating informs your writing, and about the curatorial aspect of the work of translating foreign SF in Korea?\nSure. I always think about translation as curation, and I think most SF translators in Korea—maybe I can say all of them, since there aren’t that many of us here—share that sentiment. Many translators were the first to introduce a given SF author to Korean readers. We, translators, think hard about what to translate, and sometimes work very hard to persuade publishers. For example, my first SF translation was Kate Wilhelm’s Where Late the Sweet Birds Sang, my second was Elizabeth Moon’s The Speed of Dark, and my third was David Gerrolds’ The Martian Child. I think you can already see where I am going with this list—it was clear from the start. But most translators here have this kind of tendency. For example, Suhyun Lee, who has translated many of Le Guin’s works, also translated James Tiptree Jr. and Octavia Butler. (Oh, how I envy her! I really wanted to be the one to do it!) Sanghoon Kim, who translated Zelazny’s Amber Series, is the translator of most of Philip K. Dick’s works. Most of Arthur C. Clarke’s work is translated by Hokwan Ko, who is both a translator and a science journalist. Each translator definitely works as a curator in Korea, and a certain proportion of the SF readership is aware of this.\nGord Sellar was born in Malawi, raised in Canada, and has lived in South Korea since 2002, where he has taught at universities, played saxophone in an indie-rock band, and worked as a writer, editor, and co-translator. He attended Clarion West in 2006, was nominated for the John W. Campbell Award for Best New Writer in 2009, and his fiction has appeared in Asimov's SF, Analog, Interzone, Clarkesworld, and several best of the year anthologies.", "source": "https://clarkesworldmagazine.com/another_word_06_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: My World Wobbled and Changed: An Interview with Soyeon Jeong by Gord Sellar"}