{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Izzy Wasserstein", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "4y/dorMZxTYO9PEBAD39Lyix7fY=", "id": null, "license": null, "comments": "", "raw_text": "1740 words, short story  Unplaces: An Atlas of Non-existence  Excerpts from the First Edition, with handwritten marginalia. Recovered from the ruins of Kansas City. Part of the permanent exhibit of the Museum of Fascisms.  Section 1: Places that Never Were  Avalon: Island home of the legendary sword Excalibur, attested to in Historia regum Britanniae. A land which produces all good things, Avalon has been claimed to be synonymous with various historical places, including Glastonbury, England, and Avallon, Burgundy. Smythe and Bliss (2018) claim this island once existed, but it is more probable that it is symbolic of a general longing for a better land beyond one’s own. [Lya: I had this book on loan from the Spencer Library when the Messianic Army reached Lawrence. After OKC, I knew they’d soon burn the collection. My beloved books are all gone, along with my years of research on lost places. The only book I was able to save isn’t even mine, and now I’m reduced to defacing it. Forgive me. I write these words out of hope that they will reach you, and out of faith that our words still matter.] El Dorado: The “city of gold” legend evolved from older stories of a golden prince, and was whispered to European conquerors desperate for riches. There is no evidence of the city’s existence, and the search for it certainly destroyed many other places, both real and once-real. As with many Unplaces, historical fact is obscured by conquerors eager to make their own history. In so doing they efface the past. [When I was a student—just months ago, though it seems much longer—these entries were mostly of academic interest to me, I’m ashamed to admit. Now they mean something more each day. Who wouldn’t send the Conquistadors away on a hunt for gold, if they could? Last we heard, most of the world—even most of Europe—was free from the fascists. Maybe it’s just the Americas that are fucked. Maybe the places that lack our particular combination of Authoritarianism and apocalyptic faith will overcome. I’d like to believe I’d never inflict this horror on someone else to save myself. But to see you again, Lya? All things are compromised—our world, our home, myself.] Erṣetu la târi: Attested to throughout ancient Mesopotamia as the land of the dead. One reached it by going through seven gates, and at each gate left behind an article of clothing, so that one arrived in the next life naked, a kind of un-birth. Szymborska (2020) argues that Erṣetu la târi may have once existed, given widespread belief in it. If so, however, there can be no evidence of its existence, for its name translates to “earth of no return.” [I want to leave Kansas City, to flee to someplace safer. But even if I was sure where to go, how would I get there? It’s not even safe to scavenge for food uptown. I’m fortunate that the militias mostly stay out of the old downtown, the areas that were never redeveloped. They may catch me even here, but I am as careful as my desperation allows. I stay in old brick buildings, long-abandoned warehouses, with clear views and multiple exits. There’s been no wealth in these neighborhoods for generations, and the militias prefer to root out subversives in areas they can loot.  Nevertheless, at night every creak and groan of the old buildings fills me with dread. If I am found, if this book is lost, these forgotten spaces will be my Erṣetu la târi.] Kyöpelinvuori: From the Finnish for “ghost mountain,” a place haunted by dead women. Some scholars argue it once existed, either predating Christianity in the region, or perhaps coming into existence as local gods were displaced by the arrival of new ones. Linna (2021) argues that dead women haunt liminal spaces in every culture. They exist where they can, and those who are silenced in life often speak in death. [Last night I dreamed I was a ghost, screaming because they’d found me at last. I woke fearing this book was my scream.] Leng, Plateau of: Antarctic Plateau colonized by Elder Things in the works of H. P. Lovecraft. When cultists successfully raised R’lyeh from what had been an empty seabed, expeditions were mounted to see if Leng had also been brought into existence. No evidence was forthcoming. “Our horrors are closer to home,” as Coates remarked. [Lovecraft panicked over people of color, immigrants, imagined them as murderous or worse. He should’ve worried about a different kind of cultist. A bunch of white kids slavering over Lovecraft’s statue brought R’lyeh back. I wonder how many of those kids march through the streets of North American cities now, in uniform? Having failed to end the world, have they settled for effacing it? I found a radio last week, and there are pirate stations, rebel stations. They urge us to hold onto hope, but they don’t report much good news. I do not know how to fight this evil. I write instead.] Zerzura: “The Oasis of Little Birds,” a white-walled city in the Sahara, guarded by giants. Attested to in Arabic texts since the 13th century CE, and possibly predating Herodotus. Farouk (2019) demonstrates that all extant references to the city are from foreigners, and that no local tales reference it. Thus the most likely origin of the Zerzura story is a combination of colonizers’ fears and hallucinations. Note that modern European interest in the city predates Imaginary Anthropology and so is unlikely to have made Zerzura real. [The militias swept the area today; I braced myself in the frames of the wall between floors, and managed to escape. This time. Fires spread across the skyline. I grow more desperate to leave. There is nowhere to go. I’d hoped, in saving this book, to find some insight that might help me, some way out, even if it is into unreality. Nothing.] Section 2: Places that Once Existed  Azeb: From the Hebrew for “leave behind, forsake, abandon.” Shown by Lee (2020) to be the place where lost objects gathered. Some have argued that it is synonymous with various cities of the dead, but loss and death have never been equivalent. Many documented methods of entering Azeb exist, though few exits have been found. There have been no verified reports of accessible entrances since at least 2017. It is likely, though not certain, that Azeb itself is forever lost to us. [I had a friend who went searching for Azeb. Never heard from her again. I knew ways in, of course: what scholar of lost things wouldn’t? Yesterday I tried to open a path, using the reflection of a full moon on still water, my own blood, and the second most valuable thing I own: a pair of dry socks. The way is closed. Seems I’ll meet my fate here, Lya, less than a mile from the last place it was safe for us to walk holding hands.] Cimmeria: The first triumph of Imaginary Anthropology (Goss, 2014), now lost due to conflict in the region and active condemnation of the discipline by foreign-backed warlords (may this book keep Cimmeria’s memory alive, though this author was unable to keep it from joining the other Unplaces. Some nights, she can still smell the bazaar). [I’m crying as I write this. Cimmeria’s lost forever, and we never walked its streets. So much has been lost, and now even history is being erased. Then they’ll make a new past, written in blood and marches and violent slogans and there will be nothing left.] Penglai: Once a mountain on an island in the eastern Bohai Sea, attested by some sources to be home to the Immortals. Penglai was a land of abundance, with fruit that could cure any disease. Demonstrated by Kusano (2017) to have once existed, it was lost no later than the 2nd century BCE, when Qin Shi Huang dispatched expeditions seeking the elixir of life that failed to locate it. [Lying awake last night, listening to gunfire in the distance, I wondered about the last person to set foot on Penglai. Did they know the paradise on which they walked would soon be gone forever? Did they treasure its memory? When they died, did Penglai die with them? I’m trying to hold on, Lya, but I feel everything slipping away.] Tlön: A parallel world to Earth, probably first brought into existence in the 19th century CE. Known to be definitively real by 1940 CE. In Tlön, only those things exist which are observed, and there is no deity to do the observing. For reasons which are still debated, this world was lost to us, apparently forever, with the use of the Bomb over Hiroshima. [In Tlön, a ruin might disappear from existence if there was not, say, a fox or a disinterested snake to observe it. The past is only as secure as our memory of it. When they find me, or I starve, or die in a fire, will this book survive? Will it serve as a memory? Or will everything that I remember die with me?  I hope you got out, Lya. I hope that “out” is a place that still exists. If you did, remember. Remember. I’ll do the same. It’s all that is left to me. Goodbye, goodbye.] [I thought I couldn’t go on. I thought I was done with words. Then you appeared to me—a dream, a vision, a fevered hallucination?—and whispered in my ear that this book is incomplete. You were right. And so, as the sun rises over the burned-out city, I add a new entry: Places that Might Yet Be:  Matsa: From the Hebrew “to find, to attain,” Matsa waits for those who reject utopias, who believe we are doomed if we allow the mistakes of the past to overtake us. Matsa will be a place and a journey. We make it real only by seeking it out.  In Matsa, we will not forgive the fascists. We will light flames for the dead, and we will train ourselves against forgetting. When they try to burn our books, to make our places into Unplaces, we will, each of us, carry the past with us.  If you find this book, make Matsa real. I will await you.  Yours Always,  Hannah] The Museum thanks Dr. Lya Carew for the generous gift of this book. Dr. Carew asks that those wishing to honor the memory of Hannah Leibowitz make donations to the Free Lawrence Library’s Matsa reconstructive history project. Izzy Wasserstein teaches writing and literature at a midwestern university, and writes poetry and fiction. Her work has appeared or is forthcoming from Pseudopod, GlitterShip, and Lady Churchill's Rosebud Wristlet. She shares a home with her spouse and their animal companions. She's a graduate of Clarion West and likes to slowly run long distances.", "text": "1740 words, short story\nUnplaces: An Atlas of Non-existence\nExcerpts from the First Edition, with handwritten marginalia. Recovered from the ruins of Kansas City. Part of the permanent exhibit of the Museum of Fascisms.\nSection 1: Places that Never Were\nAvalon: Island home of the legendary sword Excalibur, attested to in Historia regum Britanniae. A land which produces all good things, Avalon has been claimed to be synonymous with various historical places, including Glastonbury, England, and Avallon, Burgundy. Smythe and Bliss (2018) claim this island once existed, but it is more probable that it is symbolic of a general longing for a better land beyond one’s own.[Lya: I had this book on loan from the Spencer Library when the Messianic Army reached Lawrence. After OKC, I knew they’d soon burn the collection. My beloved books are all gone, along with my years of research on lost places. The only book I was able to save isn’t even mine, and now I’m reduced to defacing it. Forgive me. I write these words out of hope that they will reach you, and out of faith that our words still matter.]\nEl Dorado: The “city of gold” legend evolved from older stories of a golden prince, and was whispered to European conquerors desperate for riches. There is no evidence of the city’s existence, and the search for it certainly destroyed many other places, both real and once-real. As with many Unplaces, historical fact is obscured by conquerors eager to make their own history. In so doing they efface the past.[When I was a student—just months ago, though it seems much longer—these entries were mostly of academic interest to me, I’m ashamed to admit. Now they mean something more each day. Who wouldn’t send the Conquistadors away on a hunt for gold, if they could? Last we heard, most of the world—even most of Europe—was free from the fascists. Maybe it’s just the Americas that are fucked. Maybe the places that lack our particular combination of Authoritarianism and apocalyptic faith will overcome.\nI’d like to believe I’d never inflict this horror on someone else to save myself. But to see you again, Lya? All things are compromised—our world, our home, myself.]\nErṣetu la târi: Attested to throughout ancient Mesopotamia as the land of the dead. One reached it by going through seven gates, and at each gate left behind an article of clothing, so that one arrived in the next life naked, a kind of un-birth. Szymborska (2020) argues that Erṣetu la târi may have once existed, given widespread belief in it. If so, however, there can be no evidence of its existence, for its name translates to “earth of no return.”[I want to leave Kansas City, to flee to someplace safer. But even if I was sure where to go, how would I get there? It’s not even safe to scavenge for food uptown.\nI’m fortunate that the militias mostly stay out of the old downtown, the areas that were never redeveloped. They may catch me even here, but I am as careful as my desperation allows. I stay in old brick buildings, long-abandoned warehouses, with clear views and multiple exits. There’s been no wealth in these neighborhoods for generations, and the militias prefer to root out subversives in areas they can loot.\nNevertheless, at night every creak and groan of the old buildings fills me with dread. If I am found, if this book is lost, these forgotten spaces will be my Erṣetu la târi.]\nKyöpelinvuori: From the Finnish for “ghost mountain,” a place haunted by dead women. Some scholars argue it once existed, either predating Christianity in the region, or perhaps coming into existence as local gods were displaced by the arrival of new ones. Linna (2021) argues that dead women haunt liminal spaces in every culture. They exist where they can, and those who are silenced in life often speak in death.[Last night I dreamed I was a ghost, screaming because they’d found me at last. I woke fearing this book was my scream.]\nLeng, Plateau of: Antarctic Plateau colonized by Elder Things in the works of H. P. Lovecraft. When cultists successfully raised R’lyeh from what had been an empty seabed, expeditions were mounted to see if Leng had also been brought into existence. No evidence was forthcoming. “Our horrors are closer to home,” as Coates remarked.[Lovecraft panicked over people of color, immigrants, imagined them as murderous or worse. He should’ve worried about a different kind of cultist. A bunch of white kids slavering over Lovecraft’s statue brought R’lyeh back. I wonder how many of those kids march through the streets of North American cities now, in uniform? Having failed to end the world, have they settled for effacing it?\nI found a radio last week, and there are pirate stations, rebel stations. They urge us to hold onto hope, but they don’t report much good news. I do not know how to fight this evil. I write instead.]\nZerzura: “The Oasis of Little Birds,” a white-walled city in the Sahara, guarded by giants. Attested to in Arabic texts since the 13th century CE, and possibly predating Herodotus. Farouk (2019) demonstrates that all extant references to the city are from foreigners, and that no local tales reference it. Thus the most likely origin of the Zerzura story is a combination of colonizers’ fears and hallucinations. Note that modern European interest in the city predates Imaginary Anthropology and so is unlikely to have made Zerzura real.[The militias swept the area today; I braced myself in the frames of the wall between floors, and managed to escape. This time.\nFires spread across the skyline. I grow more desperate to leave. There is nowhere to go. I’d hoped, in saving this book, to find some insight that might help me, some way out, even if it is into unreality. Nothing.]\nSection 2: Places that Once Existed\nAzeb: From the Hebrew for “leave behind, forsake, abandon.” Shown by Lee (2020) to be the place where lost objects gathered. Some have argued that it is synonymous with various cities of the dead, but loss and death have never been equivalent. Many documented methods of entering Azeb exist, though few exits have been found. There have been no verified reports of accessible entrances since at least 2017. It is likely, though not certain, that Azeb itself is forever lost to us.[I had a friend who went searching for Azeb. Never heard from her again. I knew ways in, of course: what scholar of lost things wouldn’t? Yesterday I tried to open a path, using the reflection of a full moon on still water, my own blood, and the second most valuable thing I own: a pair of dry socks. The way is closed. Seems I’ll meet my fate here, Lya, less than a mile from the last place it was safe for us to walk holding hands.]\nCimmeria: The first triumph of Imaginary Anthropology (Goss, 2014), now lost due to conflict in the region and active condemnation of the discipline by foreign-backed warlords (may this book keep Cimmeria’s memory alive, though this author was unable to keep it from joining the other Unplaces. Some nights, she can still smell the bazaar).[I’m crying as I write this. Cimmeria’s lost forever, and we never walked its streets. So much has been lost, and now even history is being erased. Then they’ll make a new past, written in blood and marches and violent slogans and there will be nothing left.]\nPenglai: Once a mountain on an island in the eastern Bohai Sea, attested by some sources to be home to the Immortals. Penglai was a land of abundance, with fruit that could cure any disease. Demonstrated by Kusano (2017) to have once existed, it was lost no later than the 2nd century BCE, when Qin Shi Huang dispatched expeditions seeking the elixir of life that failed to locate it.[Lying awake last night, listening to gunfire in the distance, I wondered about the last person to set foot on Penglai. Did they know the paradise on which they walked would soon be gone forever? Did they treasure its memory? When they died, did Penglai die with them? I’m trying to hold on, Lya, but I feel everything slipping away.]\nTlön: A parallel world to Earth, probably first brought into existence in the 19th century CE. Known to be definitively real by 1940 CE. In Tlön, only those things exist which are observed, and there is no deity to do the observing. For reasons which are still debated, this world was lost to us, apparently forever, with the use of the Bomb over Hiroshima.[In Tlön, a ruin might disappear from existence if there was not, say, a fox or a disinterested snake to observe it. The past is only as secure as our memory of it.\nWhen they find me, or I starve, or die in a fire, will this book survive? Will it serve as a memory? Or will everything that I remember die with me?\nI hope you got out, Lya. I hope that “out” is a place that still exists. If you did, remember. Remember. I’ll do the same. It’s all that is left to me. Goodbye, goodbye.]\n[I thought I couldn’t go on. I thought I was done with words. Then you appeared to me—a dream, a vision, a fevered hallucination?—and whispered in my ear that this book is incomplete. You were right. And so, as the sun rises over the burned-out city, I add a new entry:\nPlaces that Might Yet Be:\nMatsa: From the Hebrew “to find, to attain,” Matsa waits for those who reject utopias, who believe we are doomed if we allow the mistakes of the past to overtake us. Matsa will be a place and a journey. We make it real only by seeking it out.\nIn Matsa, we will not forgive the fascists. We will light flames for the dead, and we will train ourselves against forgetting. When they try to burn our books, to make our places into Unplaces, we will, each of us, carry the past with us.\nIf you find this book, make Matsa real. I will await you.\nYours Always,\nHannah]\nThe Museum thanks Dr. Lya Carew for the generous gift of this book. Dr. Carew asks that those wishing to honor the memory of Hannah Leibowitz make donations to the Free Lawrence Library’s Matsa reconstructive history project.\nIzzy Wasserstein teaches writing and literature at a midwestern university, and writes poetry and fiction. Her work has appeared or is forthcoming from Pseudopod, GlitterShip, and Lady Churchill's Rosebud Wristlet. She shares a home with her spouse and their animal companions. She's a graduate of Clarion West and likes to slowly run long distances.", "source": "https://clarkesworldmagazine.com/wasserstein_03_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Unplaces: An Atlas of Non-existence by Izzy Wasserstein"}