{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Marissa Lingen", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "QhUtbRleo1cKvcdW+aEzH18PSU4=", "id": null, "license": null, "comments": "", "raw_text": "2920 words, short story  The Grandmother-Granddaughter Conspiracy  Dr. Hannah Vang watched the cephalid turn the box over with his tentacles. She leaned forward, aware of the timer out of the corner of her eye without watching it. He was a smart beastie, she knew, and would get into the box to get the icthyoid in it. The question was whether he’d learned anything from last time. It was the same box, the same latching mechanism, everything as much the same as she could make it.  The seconds ticked by. Finally the box sprung open, and Hannah sighed; seventy-two-point-three seconds. It had taken seventy-one-point-eight before.  The squid-like alien did not remember. Probably it could not remember. And that was going to be a problem.  Delta Moncerotis Four was home to a human colony of about twenty thousand. No one knew how many of the native cephalids there were, in seven different major species. They swarmed through the oceans, some of them phosphorescing merrily. They mingled with each other, except for the ones that didn’t seem to. They used things to pry into other things, if the other things were good to eat.  The two things they did not seem to do were remembering and communicating with the alien monkeys who had invaded the part of their planet they weren’t using anyway.  Which would not have been important if the alien monkeys in question hadn’t wanted to gently but firmly kick the cephalids out of the waters around their city to build an isolated area for human-edible aquaculture.  Hannah was sure that having the cephalids where they belonged would be good for the environment and good for the colonists. There was so much planet left to survey that the cephalid interactions with local coraloids and icthyoids might vary extremely, and, from her marine xenobiologist standpoint, interestingly. She had chosen a largely watery planet for a reason. But with an entire planet worth of oceans for the cephalids to inhabit, it was hard to convince the colony government that the specific area around the city was absolutely necessary for the continued well-being of anyone in particular.  “We change planets when we settle,” the governor had told her. “That’s just how it is. If it was an intelligent species—”  “They’re tool-users!” Hannah had protested.  “They appear to be opportunistic tool-users. You know that as well as I do. They’ll pick something up and make it into a skewer or a pry bar, and then they’ll drop it in the silt and do the whole thing over again with a different piece of vegetation or rock next time they need the very same tool. If they could tell us they wanted to be where they are, we’d listen. We’ve had a good record of that since the third wave of colonies.”  “I know. It’s just—even if they don’t remember things like us, they have their own interactions with their environment, that we barely know about yet!”  The governor had sighed. “If you can get any form of communication with them, we’ll see what they have to say. But if we can’t talk to them, we’ll have to treat them like animals.” At her sad look, the governor said, “We treat animals better than we used to.”  Still, even with the aquaculture developments well into development, Hannah found herself more determined, not less, that she would find some way to communicate. This was not proving easy with a species that seemed to figure everything out as if for the first time.  On the other hand, it made them easy to keep entertained. She left the cephalid with a ring puzzle it had seen a dozen times before, busily trying the different ways to get the rings unhooked, and went home for the night.  When the door slid open, Hannah could hear her mother’s voice in the living room. “You’re in my house, and you look like me, so you must be my daughter—no, granddaughter?”  “That’s right, Granny Dee,” Lily said. “I’m your granddaughter. Lily.”  “But I don’t remember you,” said Dee thoughtfully. Hannah closed her eyes and leaned against the door, letting them go through the ritual without her. It was best when Dee was not interrupted once she’d pulled the implant loose. The long pause was always the same. “And I remember that we’ve gotten good at curing genetic memory problems, so this isn’t the normal deterioration with age.”  “No, it isn’t,” said Lily. “You were in an accident. But we’ve got a device that can help you. You just have to plug this little cord back into the socket here, see?”  The pause here was even longer, as it always was: Dee deciding whether she could trust her granddaughter, then agreeing, as always, to plug the augmenter back in. And then Dee’s voice was surer, just as analytical but with better data. “I’m sorry, Lily.”  “Hey, no problem.” Hannah decided that was her cue to enter, just in time to see Lily kissing her grandmother on the cheek. “Could happen to anyone.”  In fact, if it could happen to anyone, if it was common the way organic memory problems were, they might have a better design. Hannah had asked her mother three times if she wanted to move back to a larger colony, someplace where they had the personnel and equipment for a more permanent implant. But Dee’s response had been impatient.  “This is your home,” she’d said. “And it’s my home, and more than all that, it’s Lily’s home. I don’t want to be somewhere else. We’ll plug it back in and go along with our lives, you and me and Brian and Lily. We’ll get by.”  But Brian had left. He couldn’t stand dealing with Dee, and Hannah, when she was honest with herself, couldn’t entirely blame him. Her mother couldn’t live alone with the implant’s unreliability, and the colony wasn’t big enough to have facilities. But she wished things had been otherwise.  “It’s easy for you,” Brian had said, throwing his clothes in his suitcase.  Hannah had let her voice rise: “Easy?”  For a moment he was the old Brian, the man she’d married. The one she’d counted on for Lily’s sake. “I shouldn’t have said that. I don’t mean easy. I know it’s not; she’s your mother. I know it’s not. But when you come home and she’s pulled the implant loose, she lets you talk her through to plugging it back in again. I don’t have time to deal with the constable every time I get back from work before Lily gets home from school! I don’t have the energy, Hannah. You know I always liked Dee, but—”  “But,” Hannah agreed.  “The good memories are getting soiled with every conversation with the constable,” said Brian. “With every time I have to justify my existence in my own house again.”  Lily was like most of the colony kids, tough and talented, resilient, not afraid of work. She was not thrilled to have her father living across town. She was not thrilled to have to plug her grandmother back together every few days. But Hannah was proud to see that her daughter already understood that her life was not a series of endless thrills; Lily did what needed doing without a great deal of fuss about it.  Hannah tried not to brood over dinner with her mother and her daughter. “Still nothing from the squids, huh?” said Lily.  “Nothing,” said Hannah miserably. “I keep thinking I’ve got a chance at least, and then—” She wiggled her fingers in the air like tentacles. “They’re so clever. They’re so very good at figuring things out. If the other species are as clever as the pink ones, no wonder there’s sort of a squiddy feel to the whole ocean.”  “But they’re still not clever enough to signal back and forth,” said her mother.  “They’re not the right kind of clever. It’s not what they do,” said Hannah. “I’m really starting to think we’re on the brink of proving—to beyond a shadow of my doubt anyway—that this is just not what they do.”  “But it’s what we do,” said Lily.  Hannah sighed. “Exactly.”  And if the alien species they encountered couldn’t bend far enough to do things the human way, would the humans bend enough to see how they were doing them instead? It had worked with some of the larger colonies of lichen-like species on Gamma Centauri Four, but elsewhere results were mixed. And on Earth, dogs and cats were immensely more popular as pets than squid and lichen.  The cephalid did not grow easier over the next few weeks. Hannah watched her clever subject make his morning rounds. The pink tentacles groped along the tank, then slowed, delicately searching for something in the silt. Hannah’s heart skipped a beat: had he hidden something there for later? Would he remember after all?  But no; after churning up the silt so that it wafted into the water, the cephalid resumed his exploration of the tank. He had likely been looking for a snack, and that was the sort of terrain in which juicy tidbits lurked. Instinct, not memory. Or perhaps they should think of it as species memory rather than individual memory? In that case, they’d be relying upon generations upon generations of mutation to teach the cephalids how to communicate with humans. Not, Hannah thought, heartening.  She tried putting one of the remote machines into the tank with the cephalid and showing it how to do a few of the tricks she’d done. It repeated them, watching; there was something there that looked like short-term memory. But it didn’t last. No matter how many times she went back to the same puzzles, the cephalids didn’t recall how to work them after they’d been out of sight, or after even a few minutes had passed.  Her return home was smooth and peaceful; Dee’s implant had stayed plugged in, and she and Lily were frying tofu for dipping in nuoc leo sauce. Their hands were equally sure, and all the tofu came out soft in the middle and crisp on the outside, just perfect, just the way Hannah liked it, just the way she could never make it herself.  Hannah watched Lily doing the dishes. She was nearing the age when colony kids found apprenticeships or went offworld to study. She wanted to ask Lily what she hoped to do, but she was afraid of the answer. Instead, she sought the mundane. “Got any plans for the weekend?”  “I’m taking Grandma to the beach again tomorrow,” said Lily. “She liked it last time. And I have astronomy homework.”  “Are you enjoying astronomy?” Hannah tried not to hold her breath for the answer. Astronomers traveled too much to keep close ties to their families on colony worlds; time dilation made it impossible.  “It’s fine. Biology’s better,” said Lily. “Biology looks back at you.”  “I think the astronomers would say that about astronomy.”  Lily shrugged. “Then I guess I’m not an astronomer.”  Hannah laughed and hugged her. “Have a good time at the beach with Grandma, then.”  Lily smiled her self-contained little smile. “Oh, we will.”  Later that night, when Lily was off typing homework answers into her handheld, Hannah sat down on the couch across from her mother’s armchair. Dee paused her book and looked expectant.  “Do you remember that microscope you got me when I was a kid? Maybe five years younger than Lily, maybe more,” said Hannah dreamily. Dee made an encouraging noise, so Hannah went on: “It came with one of those books showing what you would expect to see, and I looked at a drop of water—we were on Alpha Moncerotis Six then, remember? And it was so different from in the book. The little unicellular creatures swimming around on Alpha Mon Six were totally different from the Earth ones.  “And I loved it, I just loved it. I begged cultures from anybody who’d give me one. Cheek cells, hairs from whatever animal they were studying, plants from the colony, anything. It was the best present.”  “Funny, you remembering that after all these years.”  Hannah glanced down automatically, but her mother followed her gaze. “No, the unit’s fine. I really think the solder will hold it awhile longer. I just don’t remember. I didn’t before the injury, and I never will. I’m sorry I’ve forgotten it, because you sound like it was a hugely important piece of your childhood—I wish I could remember. But it’s like that, honey. There’ll be something Lily thinks is the worst thing you ever did to ruin her life, or the best thing you ever did to make it work, and you will blink at her and say, ‘I did? Did I? Oh.’”  “I suppose that’s how it works,” said Hannah. “I remember her first steps, and of course she doesn’t. Why shouldn’t there be things that are the other way around?”  “There have to be, or she wouldn’t be her own person,” said Dee.  “Well, she’s certainly that,” said Hannah ruefully.  “Oh yes,” said Dee. “She’ll surprise you. That’s what children are for.”  A few weeks later, Hannah looked up from the cephalid tank and its computer and found Lily and Dee standing there watching her.  “We have a surprise for you,” said Lily.  “Can it wait, honey?” Hannah cast her mother an imploring glance, but Dee looked as implacable as Lily. “I’m in the middle of work here.”  “Is it going well?” asked Dee.  Hannah glared at her. “You know it’s not.”  “A break will be good for you. Come.”  Hannah walked with her mother through their ocean-side research complex. Lily danced ahead of them like a much younger child. Hannah sighed. “You know I like to spend time with both of you, Mom, but—”  “Hush, dear. Watch Lily.”  Lily was peeling off her clothes; she had her wetsuit underneath. She climbed onto the lip of one of the cephalid tanks. Hannah and Dee caught up with her.  “Lil,” said Hannah, “I don’t think now’s the time.”  “This is what I wanted to show you, Mom.”  Dee passed a tiny flashlight and a little black box up to her granddaughter, who jumped in the tank with it. Hannah stepped forward ineffectually, knowing she couldn’t stop her. “Oh, Mom.”  “It’s not my unit, it’s the spare,” said Dee. “They’re waterproof. Lily’s tried this before.”  “And if the spare gets damaged—”  “Relax. This is important. We knew you wouldn’t approve right away, or we wouldn’t have done it without you.”  Hannah shook her head. “That my mother and my daughter should use that line against me, together.”  Dee rolled her eyes. “It’s not against you, it’s for you. Just watch.”  A curious cephalid was approaching Lily. She held out the leads to the memory unit. He probed them with one slender tentacle. Lily gently guided the leads into the cephalid’s mouth orifice.  “It’s got a light display,” said Dee. “I’ve been working on getting it connected to the output.”  “A light display?”  The cephalid engulfed the leads, and the light display made itself known: every diode in it blazed. Then they rippled in a random-looking series of patterns.  “We think he’s trying to remember how to work it,” said Dee. “We’re not sure. We thought you could figure it out.”  “An external memory unit with built-in communications,” said Hannah. “Oh my.”  “It was Lily’s idea. I told the nanites where to solder.”  Hannah took a breath and spoke gently. “Mom, you know that the cephalid may not be able to use your device as memory as we would understand it, right? Being able to light up the panel doesn’t necessarily mean being able to store thoughts as memory.”  “Oh, I know, dear. We thought of that. But we thought at least it’d be something to find out.”  “Oh yes,” Hannah agreed. “Definitely something to find out.”  Lily flashed the flashlight at the cephalid, three times. It recoiled. She flashed again, and the light display went dark. Then it lit up with a blue pattern, three times. Lily repeated it.  “She’s a natural,” said Hannah.  “Nature, nurture, whatever!” said Dee, grinning.  After a few more flash-patterns, Lily swam back to the lip of the tank. The cephalid made a green pattern at her, but she climbed out anyway.  “You can do it like a real experiment,” she said, shaking her black hair out. “You know how to design that sort of thing. Granny and I just got it together for you.”  “I’ll want to have a light bank set up,” said Hannah thoughtfully.  Lily pressed the tiny diode flashlight into her hand. “To begin with.”  Hannah turned to the cephalid and squeezed the trigger on the flashlight twice.  Two ripples of light appeared on the modified implant’s screen: first the blue pattern and then the green. “Hello again,” said Hannah aloud.  They had no idea what they’d done, she thought. If the cephalid could deal with an external electronic system, there had to have been something in their past that allowed for it. Something evolved? More likely something created and lost—and perhaps not by themselves? There would have to be a lot more xenoarchaeology before they would know who had been there before, and what they had taught the cephalids about the use of these tools.  But there would be time for that later. For now there was a conversation Hannah had wanted to have for a long time. Smiling at the retreating backs of her mother and daughter, she flashed the little flashlight in response.", "text": "2920 words, short story\nThe Grandmother-Granddaughter Conspiracy\nDr. Hannah Vang watched the cephalid turn the box over with his tentacles. She leaned forward, aware of the timer out of the corner of her eye without watching it. He was a smart beastie, she knew, and would get into the box to get the icthyoid in it. The question was whether he’d learned anything from last time. It was the same box, the same latching mechanism, everything as much the same as she could make it.\nThe seconds ticked by. Finally the box sprung open, and Hannah sighed; seventy-two-point-three seconds. It had taken seventy-one-point-eight before.\nThe squid-like alien did not remember. Probably it could not remember. And that was going to be a problem.\nDelta Moncerotis Four was home to a human colony of about twenty thousand. No one knew how many of the native cephalids there were, in seven different major species. They swarmed through the oceans, some of them phosphorescing merrily. They mingled with each other, except for the ones that didn’t seem to. They used things to pry into other things, if the other things were good to eat.\nThe two things they did not seem to do were remembering and communicating with the alien monkeys who had invaded the part of their planet they weren’t using anyway.\nWhich would not have been important if the alien monkeys in question hadn’t wanted to gently but firmly kick the cephalids out of the waters around their city to build an isolated area for human-edible aquaculture.\nHannah was sure that having the cephalids where they belonged would be good for the environment and good for the colonists. There was so much planet left to survey that the cephalid interactions with local coraloids and icthyoids might vary extremely, and, from her marine xenobiologist standpoint, interestingly. She had chosen a largely watery planet for a reason. But with an entire planet worth of oceans for the cephalids to inhabit, it was hard to convince the colony government that the specific area around the city was absolutely necessary for the continued well-being of anyone in particular.\n“We change planets when we settle,” the governor had told her. “That’s just how it is. If it was an intelligent species—”\n“They’re tool-users!” Hannah had protested.\n“They appear to be opportunistic tool-users. You know that as well as I do. They’ll pick something up and make it into a skewer or a pry bar, and then they’ll drop it in the silt and do the whole thing over again with a different piece of vegetation or rock next time they need the very same tool. If they could tell us they wanted to be where they are, we’d listen. We’ve had a good record of that since the third wave of colonies.”\n“I know. It’s just—even if they don’t remember things like us, they have their own interactions with their environment, that we barely know about yet!”\nThe governor had sighed. “If you can get any form of communication with them, we’ll see what they have to say. But if we can’t talk to them, we’ll have to treat them like animals.” At her sad look, the governor said, “We treat animals better than we used to.”\nStill, even with the aquaculture developments well into development, Hannah found herself more determined, not less, that she would find some way to communicate. This was not proving easy with a species that seemed to figure everything out as if for the first time.\nOn the other hand, it made them easy to keep entertained. She left the cephalid with a ring puzzle it had seen a dozen times before, busily trying the different ways to get the rings unhooked, and went home for the night.\nWhen the door slid open, Hannah could hear her mother’s voice in the living room. “You’re in my house, and you look like me, so you must be my daughter—no, granddaughter?”\n“That’s right, Granny Dee,” Lily said. “I’m your granddaughter. Lily.”\n“But I don’t remember you,” said Dee thoughtfully. Hannah closed her eyes and leaned against the door, letting them go through the ritual without her. It was best when Dee was not interrupted once she’d pulled the implant loose. The long pause was always the same. “And I remember that we’ve gotten good at curing genetic memory problems, so this isn’t the normal deterioration with age.”\n“No, it isn’t,” said Lily. “You were in an accident. But we’ve got a device that can help you. You just have to plug this little cord back into the socket here, see?”\nThe pause here was even longer, as it always was: Dee deciding whether she could trust her granddaughter, then agreeing, as always, to plug the augmenter back in. And then Dee’s voice was surer, just as analytical but with better data. “I’m sorry, Lily.”\n“Hey, no problem.” Hannah decided that was her cue to enter, just in time to see Lily kissing her grandmother on the cheek. “Could happen to anyone.”\nIn fact, if it could happen to anyone, if it was common the way organic memory problems were, they might have a better design. Hannah had asked her mother three times if she wanted to move back to a larger colony, someplace where they had the personnel and equipment for a more permanent implant. But Dee’s response had been impatient.\n“This is your home,” she’d said. “And it’s my home, and more than all that, it’s Lily’s home. I don’t want to be somewhere else. We’ll plug it back in and go along with our lives, you and me and Brian and Lily. We’ll get by.”\nBut Brian had left. He couldn’t stand dealing with Dee, and Hannah, when she was honest with herself, couldn’t entirely blame him. Her mother couldn’t live alone with the implant’s unreliability, and the colony wasn’t big enough to have facilities. But she wished things had been otherwise.\n“It’s easy for you,” Brian had said, throwing his clothes in his suitcase.\nHannah had let her voice rise: “Easy?”\nFor a moment he was the old Brian, the man she’d married. The one she’d counted on for Lily’s sake. “I shouldn’t have said that. I don’t mean easy. I know it’s not; she’s your mother. I know it’s not. But when you come home and she’s pulled the implant loose, she lets you talk her through to plugging it back in again. I don’t have time to deal with the constable every time I get back from work before Lily gets home from school! I don’t have the energy, Hannah. You know I always liked Dee, but—”\n“But,” Hannah agreed.\n“The good memories are getting soiled with every conversation with the constable,” said Brian. “With every time I have to justify my existence in my own house again.”\nLily was like most of the colony kids, tough and talented, resilient, not afraid of work. She was not thrilled to have her father living across town. She was not thrilled to have to plug her grandmother back together every few days. But Hannah was proud to see that her daughter already understood that her life was not a series of endless thrills; Lily did what needed doing without a great deal of fuss about it.\nHannah tried not to brood over dinner with her mother and her daughter. “Still nothing from the squids, huh?” said Lily.\n“Nothing,” said Hannah miserably. “I keep thinking I’ve got a chance at least, and then—” She wiggled her fingers in the air like tentacles. “They’re so clever. They’re so very good at figuring things out. If the other species are as clever as the pink ones, no wonder there’s sort of a squiddy feel to the whole ocean.”\n“But they’re still not clever enough to signal back and forth,” said her mother.\n“They’re not the right kind of clever. It’s not what they do,” said Hannah. “I’m really starting to think we’re on the brink of proving—to beyond a shadow of my doubt anyway—that this is just not what they do.”\n“But it’s what we do,” said Lily.\nHannah sighed. “Exactly.”\nAnd if the alien species they encountered couldn’t bend far enough to do things the human way, would the humans bend enough to see how they were doing them instead? It had worked with some of the larger colonies of lichen-like species on Gamma Centauri Four, but elsewhere results were mixed. And on Earth, dogs and cats were immensely more popular as pets than squid and lichen.\nThe cephalid did not grow easier over the next few weeks. Hannah watched her clever subject make his morning rounds. The pink tentacles groped along the tank, then slowed, delicately searching for something in the silt. Hannah’s heart skipped a beat: had he hidden something there for later? Would he remember after all?\nBut no; after churning up the silt so that it wafted into the water, the cephalid resumed his exploration of the tank. He had likely been looking for a snack, and that was the sort of terrain in which juicy tidbits lurked. Instinct, not memory. Or perhaps they should think of it as species memory rather than individual memory? In that case, they’d be relying upon generations upon generations of mutation to teach the cephalids how to communicate with humans. Not, Hannah thought, heartening.\nShe tried putting one of the remote machines into the tank with the cephalid and showing it how to do a few of the tricks she’d done. It repeated them, watching; there was something there that looked like short-term memory. But it didn’t last. No matter how many times she went back to the same puzzles, the cephalids didn’t recall how to work them after they’d been out of sight, or after even a few minutes had passed.\nHer return home was smooth and peaceful; Dee’s implant had stayed plugged in, and she and Lily were frying tofu for dipping in nuoc leo sauce. Their hands were equally sure, and all the tofu came out soft in the middle and crisp on the outside, just perfect, just the way Hannah liked it, just the way she could never make it herself.\nHannah watched Lily doing the dishes. She was nearing the age when colony kids found apprenticeships or went offworld to study. She wanted to ask Lily what she hoped to do, but she was afraid of the answer. Instead, she sought the mundane. “Got any plans for the weekend?”\n“I’m taking Grandma to the beach again tomorrow,” said Lily. “She liked it last time. And I have astronomy homework.”\n“Are you enjoying astronomy?” Hannah tried not to hold her breath for the answer. Astronomers traveled too much to keep close ties to their families on colony worlds; time dilation made it impossible.\n“It’s fine. Biology’s better,” said Lily. “Biology looks back at you.”\n“I think the astronomers would say that about astronomy.”\nLily shrugged. “Then I guess I’m not an astronomer.”\nHannah laughed and hugged her. “Have a good time at the beach with Grandma, then.”\nLily smiled her self-contained little smile. “Oh, we will.”\nLater that night, when Lily was off typing homework answers into her handheld, Hannah sat down on the couch across from her mother’s armchair. Dee paused her book and looked expectant.\n“Do you remember that microscope you got me when I was a kid? Maybe five years younger than Lily, maybe more,” said Hannah dreamily. Dee made an encouraging noise, so Hannah went on: “It came with one of those books showing what you would expect to see, and I looked at a drop of water—we were on Alpha Moncerotis Six then, remember? And it was so different from in the book. The little unicellular creatures swimming around on Alpha Mon Six were totally different from the Earth ones.\n“And I loved it, I just loved it. I begged cultures from anybody who’d give me one. Cheek cells, hairs from whatever animal they were studying, plants from the colony, anything. It was the best present.”\n“Funny, you remembering that after all these years.”\nHannah glanced down automatically, but her mother followed her gaze. “No, the unit’s fine. I really think the solder will hold it awhile longer. I just don’t remember. I didn’t before the injury, and I never will. I’m sorry I’ve forgotten it, because you sound like it was a hugely important piece of your childhood—I wish I could remember. But it’s like that, honey. There’ll be something Lily thinks is the worst thing you ever did to ruin her life, or the best thing you ever did to make it work, and you will blink at her and say, ‘I did? Did I? Oh.’”\n“I suppose that’s how it works,” said Hannah. “I remember her first steps, and of course she doesn’t. Why shouldn’t there be things that are the other way around?”\n“There have to be, or she wouldn’t be her own person,” said Dee.\n“Well, she’s certainly that,” said Hannah ruefully.\n“Oh yes,” said Dee. “She’ll surprise you. That’s what children are for.”\nA few weeks later, Hannah looked up from the cephalid tank and its computer and found Lily and Dee standing there watching her.\n“We have a surprise for you,” said Lily.\n“Can it wait, honey?” Hannah cast her mother an imploring glance, but Dee looked as implacable as Lily. “I’m in the middle of work here.”\n“Is it going well?” asked Dee.\nHannah glared at her. “You know it’s not.”\n“A break will be good for you. Come.”\nHannah walked with her mother through their ocean-side research complex. Lily danced ahead of them like a much younger child. Hannah sighed. “You know I like to spend time with both of you, Mom, but—”\n“Hush, dear. Watch Lily.”\nLily was peeling off her clothes; she had her wetsuit underneath. She climbed onto the lip of one of the cephalid tanks. Hannah and Dee caught up with her.\n“Lil,” said Hannah, “I don’t think now’s the time.”\n“This is what I wanted to show you, Mom.”\nDee passed a tiny flashlight and a little black box up to her granddaughter, who jumped in the tank with it. Hannah stepped forward ineffectually, knowing she couldn’t stop her. “Oh, Mom.”\n“It’s not my unit, it’s the spare,” said Dee. “They’re waterproof. Lily’s tried this before.”\n“And if the spare gets damaged—”\n“Relax. This is important. We knew you wouldn’t approve right away, or we wouldn’t have done it without you.”\nHannah shook her head. “That my mother and my daughter should use that line against me, together.”\nDee rolled her eyes. “It’s not against you, it’s for you. Just watch.”\nA curious cephalid was approaching Lily. She held out the leads to the memory unit. He probed them with one slender tentacle. Lily gently guided the leads into the cephalid’s mouth orifice.\n“It’s got a light display,” said Dee. “I’ve been working on getting it connected to the output.”\n“A light display?”\nThe cephalid engulfed the leads, and the light display made itself known: every diode in it blazed. Then they rippled in a random-looking series of patterns.\n“We think he’s trying to remember how to work it,” said Dee. “We’re not sure. We thought you could figure it out.”\n“An external memory unit with built-in communications,” said Hannah. “Oh my.”\n“It was Lily’s idea. I told the nanites where to solder.”\nHannah took a breath and spoke gently. “Mom, you know that the cephalid may not be able to use your device as memory as we would understand it, right? Being able to light up the panel doesn’t necessarily mean being able to store thoughts as memory.”\n“Oh, I know, dear. We thought of that. But we thought at least it’d be something to find out.”\n“Oh yes,” Hannah agreed. “Definitely something to find out.”\nLily flashed the flashlight at the cephalid, three times. It recoiled. She flashed again, and the light display went dark. Then it lit up with a blue pattern, three times. Lily repeated it.\n“She’s a natural,” said Hannah.\n“Nature, nurture, whatever!” said Dee, grinning.\nAfter a few more flash-patterns, Lily swam back to the lip of the tank. The cephalid made a green pattern at her, but she climbed out anyway.\n“You can do it like a real experiment,” she said, shaking her black hair out. “You know how to design that sort of thing. Granny and I just got it together for you.”\n“I’ll want to have a light bank set up,” said Hannah thoughtfully.\nLily pressed the tiny diode flashlight into her hand. “To begin with.”\nHannah turned to the cephalid and squeezed the trigger on the flashlight twice.\nTwo ripples of light appeared on the modified implant’s screen: first the blue pattern and then the green. “Hello again,” said Hannah aloud.\nThey had no idea what they’d done, she thought. If the cephalid could deal with an external electronic system, there had to have been something in their past that allowed for it. Something evolved? More likely something created and lost—and perhaps not by themselves? There would have to be a lot more xenoarchaeology before they would know who had been there before, and what they had taught the cephalids about the use of these tools.\nBut there would be time for that later. For now there was a conversation Hannah had wanted to have for a long time. Smiling at the retreating backs of her mother and daughter, she flashed the little flashlight in response.", "source": "https://clarkesworldmagazine.com/lingen_12_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Grandmother-Granddaughter Conspiracy by Marissa Lingen"}