{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Karl Bunker", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "bwTztjVvjbpfzdfnRG987N+GEfU=", "id": null, "license": null, "comments": "", "raw_text": "4250 words, short story, REPRINT  Gray Wings  It was just carelessness. I’d gotten into the wake turbulence of an old jetliner that was still low after taking off from Lagos. The wingtip vortices off of those old buckets can trail behind them for fifty or a hundred kilometers, and . . . well, I was careless.  So I tumbled and spun and twisted and generally had a bad time of it, and then I fell. By the time I was wings-up and face-down again, I didn’t have much altitude left and the ground was rushing up to greet me. My wings had folded in tight during my tumble, and at the speed I was falling I’d rip my sternum open if I tried to unfurl them too quickly. So I went easy, feathering open slowly. I turned into the wind, trying to translate my downward momentum into forward. I furled out more and more, listening to the fibers that held my chest together go snap, snap, snap.  But it was working; I was falling slower. There was a treeless valley to my right, so I teased out a banking turn in that direction. I skimmed over the crest of a low hill, glancing down to watch the ground blur past me with two meters to spare. Then I looked up again—too late.  There was a building straight ahead of me, and all I had time to do was close my eyes. I hit the thatched roof and ripped through it with a whooshing, crunching sound. Then there was another fraction of a second of blind freefall, and then my hands and chest and stomach hit a hard-packed dirt floor and I skidded to a stop.  I was lying inside a low building. There were broken lengths of wood and piles of straw scattered around me, underneath me, on top of me. I took a slow breath, then started looking at my body, moving as little as possible. There was a long ragged gash across my shoulder and partway down my right breast, but it was already closing. My left leg was worse, with both bones below the knee broken, the tibia piercing the skin and the fabric of my unitard. That seemed to be it for body damage. I turned my head carefully and looked back at my wings. “Shit!” I yelled. The main spar of both wings was snapped just before the elbow joint, the bloody carbon fibers extending like brush bristles from the broken ends.  I lay still for a while, just breathing. Then I sat up and grabbed my left shin above and below the break. I shut off all pain and deadened the muscles, and then started pulling and twisting. After a few attempts I got the broken ends of the bones lined up. I clamped both hands over the break and held, counting out 120 elephants. Somewhere around ninety my nerve-shutoff timed out and pain came roaring back, and I groaned and whimpered and sniffled.  When I was done counting, and a while after that, I opened my eyes again. I was lying on my side and there was an old woman looming over me. Black-skinned and deeply wrinkled, her mouth was open in what might have been a smile, showing several missing teeth. She said something in a language I didn’t understand, then in thickly accented English: “An anchel, yes? We have a little girl-child anchel fallen from heaven, eh?” She laughed, then straightened up and walked away, kicking aside a pile of straw as she went to a door and left.  I looked around at the building I was in. It seemed to be a small barn, with a hayloft and unglazed windows on all four walls. Beyond those walls, I was in the dead center of nowhere. I didn’t know where I was to within two hundred kilometers, and wouldn’t until I hit the Niger River sometime in the next day or so, where the beacon buoys would tell me whether to head upstream or down.  The door swung open again and two people came through it: The old woman and a young man. The woman spoke in her unknown language to the man, pointed at me, then at the hole in the roof. She laughed her thin, dry laugh. The man walked up to me and bent over at the waist, examining me. Belatedly, I thought to check the front of my unitard to see if my breasts were showing. Not that there’s much to look at there, but some cultures are touchy about that sort of thing. He systematically looked me over: legs, torso, arms, face, and finally the broken wings that sprouted from my back. Then he spoke, his accent not as thick as the old woman’s. “How bad you are hurt?” he said.  “I— I’m all right. My leg was . . . But it will heal.” I realized that he was in fact almost a boy, possibly still in his teens. He was tall and very thin and dressed in blue jean shorts and a T-shirt. “My name is Amy,” I said. “I’m flying in the Kitaroharo Race—do you know it?”  The young man looked up, through the hole in the roof to the sky beyond. “Yes,” he said slowly. “The flyer races. They give you wings and you fly; sometimes you race. I have heard of this—seen videos.” Suddenly he dropped to his knees. He bent his head, looking closely at my leg in the dim light. “Are you sure is okay? There is much blood.”  “Yes, it will be fine.” I peeled up the soggy leg of my unitard to reassure him. The pain had subsided to a dull throb by now.  With one finger he traced a path in the air, close to my skin but not touching it, following the line of the scar that showed where the bone had come through. It was a swollen, light-colored streak against the darker ash-gray of my skin. He withdrew his hand, closing his fingers. “You fix yourself? Of course—you have healing nanos, yes? Good. Very good.” He stood up again. “Dabir is me—is my name,” he said, touching his chest. He smiled, his teeth bright in the gloom. His face was beautiful, with wide, innocent eyes, high cheekbones, and a long nose that flared at the nostrils. “I am please to meet you, Amy.” The smile flashed again and he waved vaguely in the direction of the door he had come through. “Our connection is dead right now, but I can go to the village, to the computers there. Shall I call to Lagos maybe? Or you have family I should call? People who come get you?”  “No!” I blurted. “If you do that they’ll take me out of the race, and I won’t qualify for the Asiatics this season. I can’t win this race now, probably can’t even place in the top ten, but the time limit for finishing is still six days away. I can make it to Casablanca by then—” I twisted around to look at where my wings were broken, the upper parts of the spars dangling limply, “if I can repair my wings fast enough.”  “You can fix your wings yourself?” Dabir asked. “Like your leg?”  “Not quite. They need to be splinted until they self-repair, and I can’t reach them to do that. I’ll need help.”  Dabir went around behind me and crouched down again. A moment later he made a soft grunting sound. “You are bleeding,” he said. “The broken part of the wings—it bleeds.”  “Yes. They’re a part of me, connected to my blood supply. But it’s okay; they’ll only bleed a little, and it doesn’t hurt.” This wasn’t entirely true; I could feel the two breaks in the main spars, especially when the broken ends flexed, and while it wasn’t anything like the pain in my leg had been, it was damned unpleasant.  He came around in front of me again and squatted. He looked at me, meeting my eyes for a moment and then shyly looking away. He was sitting with his knees up and his forearms resting on them. His hands were long and delicate-looking, with tapering fingers. “Okay,” he said. “If you can explain to me how to make this splint, I will try to do it.”  Over the next hour or so, Dabir found four suitable pieces of wood and some heavy string. He got squeamish when I told him he’d have to punch a row of holes through the wing membrane so he could wrap the string around the spar and the two pieces of splint, but after some hesitation he did it. By the time he was finished my neck was stiff from craning to look around behind me to watch what he was doing. “Thank you,” I said when he was finally done. “That’s great. By tomorrow this time they should be strong enough to fly.”  “That soon?” Dabir shook his head, smiling. “Is amazing.”  As I rubbed the ache out of my neck I realized I was thirsty, hungry, and exhausted. The day had taken a lot out of me. “Could I have some water?” I said.  “Oh!” Dabir practically leapt to his feet, and then flinched, something in his leg or hip hurting him. His hands were covered with my blood, some of it dried and some still wet. “I am sorry,” he said. “I should have brought you water sooner. And food.” He left, walking quickly and with a limp. Crouching down to work on my wings must have aggravated something in his leg. A few moments later he was back with a big mug full of water, which he handed to me before hurrying away again.  This time he was gone for several minutes, and when he came back he had a plate of food. There were boiled greens and some kind of meat with a thick sauce. He held the plate out to me with one hand and a fork with the other.  “Oh, you didn’t have to do that, Dabir. There’s no need, really. I can eat anything. My nanos can digest cellulose—grass, raw leaves, anything. You don’t have to give me your . . . ” I stopped, feeling stupid. As I’d been speaking, Dabir’s hand and the plate it was holding drifted down and toward his side, until it looked like all the plate’s contents were about to spill onto the ground.  “You do not want?” he said.  I held my hands out for the plate and the silverware. “Yes, I do,” I said. “Thank you. It’s very kind of you.”  Once I started eating, I could barely shovel the food into my mouth fast enough. Dabir sat cross-legged—as I was sitting—on the dirt floor a few feet away from me. He wasn’t watching me eat, but wasn’t not watching either.  “What is this building?” I asked, partly to force myself to slow down my gobbling and partly just for something to say.  “A barn for goats we used to have,” he said. He made a loose-jointed wave of his arm that seemed to indicate more than just the building. “We had many goats. Then they all get a disease, last year. They all die.”  “Ah, that’s too bad,” I mumbled, staring down at my plate. I was trying to decide if the meat underneath the tamarind sauce was real or a synthetic, maybe from a UN-Aid rations pack. I went on eating.  A minute later the old woman came in, carrying another plate of food like mine, but with less meat. She handed it to Dabir, grinning her gap-toothed smile at some secret joke. She glanced at me, croaked a few dry, laughing words at Dabir in their language, grinned some more, and then went away. Dabir avoided my eyes after she was gone, and began to eat, deftly plucking food from his plate with his long, thin fingers.  I looked down at my own hands, at my charcoal-gray skin. I wondered if he thought I was born with skin this color, thought it had anything to do with race.  “My grandmother likes you,” Dabir said after a little while. “She calls you our little wounded angel.”  “That’s what she called me when she found me,” I said. “‘A little girl-child angel, fallen from heaven’ she said.” I paused. “Does she really think . . . ?”  He looked at me with a smile that made me feel like the idiot I was. “No, is only a joke,” he said. “Most strangers she doesn’t like very much.” His smile grew into a soft chuckle. “But you know, most strangers don’t fall out of the sky and land in our barn.”  I looked up at the roof of the barn. I’d broken through some of the timbers that supported the thatching, and about a third of the roof was slumping inward precariously. “I’m sorry about the damage,” I said. “Before I leave, give me your information and I’ll send money to you for repairs.”  He made a dismissive motion with his head. “Damage doesn’t matter. There are no goats now.”  “But you’ll be getting more, won’t you?”  “Tell me about flying,” he said. “What is it like?”  “It’s . . . pretty much what you would expect.” I got to my feet as I spoke, stretching myself out straight, testing my weight on the newly-repaired bones of my left leg. I took a few tentative steps, looking behind me at my wings to make sure Dabir’s splints were holding. Luckily the peaked roof of the barn was tall enough that I didn’t have to worry about the elbows of my wings hitting anything. “You’re up high, you look down, it’s quiet, it’s cold and windy, it’s wet when you fly into a cloud . . . ” I glanced at Dabir, feeling awkward. I didn’t talk about the feeling of the wings pulling at the air, catching it, clutching at it like it was some huge living thing carrying me on its back, the feeling of inhuman strength in my wings, the roaring, screaming, blazing intoxication of it all, burning through me with every flight, every liftoff, like a drug.  I stared down hard at the ground. When I looked at Dabir a moment ago I’d noticed for the first time that he had a long, ragged scar along the outside of his right leg, starting at the knee and stretching down halfway to his ankle. The skin was rough and puckered, the two sides of the gash misaligned; the wound must not have even been sutured, much less nano-healed.  “I’d like to walk around outside, if I may,” I said.  “Of course!” He bounced to his feet and walked with me to the door. With both of us standing, I barely came up to his shoulder. “You are small—tiny!” he laughed down at me. “But you are not so young as you look, yes? I mean, not a girl, like my grandmother thought at first.”  “No, Dabir, not so young as I look.” Moving carefully, I bent low to angle my folded wings through the doorway ahead of me. I thought of my friend Nila, and the party she’d thrown for me to celebrate my new wings. She’d had every door and doorway in her home modified into a gothic arch with a peak three meters high, so I could walk from room to room without bending over. And the next day, the party over, she’d had them all changed back.  Outside, the sun was getting low. Ahead of us was a sprawling field of some kind of crop; meter-high stalks of something dry and yellowing, with lots of bare dirt between each plant. To the right, not far away, was a tiny, unpainted wooden house with a flat roof of corrugated metal. It was crudely built, like the barn, but beyond that there was something about it that screamed of poverty and misery and ugliness. Looking at it made me feel hollowed out inside, and when I suddenly realized that Dabir might invite me in there, the thought terrified me.  “Not a good year for the millet,” Dabir said, as if apologizing, looking out over the field. “Good rain at first, but then not enough. Next year be better, we think.”  I walked in a mock-aimless direction, away from the house, taking deep breaths, waving my arms and flexing my wings slowly. I could feel energy from the sun soaking into my skin, coursing into the storage cells distributed through my body. But more than that I could feel that terrible little house, crouching behind me like a gargoyle. I was wishing desperately, frantically, that I could lift into the air and fly away now. That I could be back up in the cold sky where I belonged, where all of this would be far, far down, invisible below me.  Of course I’d known what I was flying over. I’d known people lived like this. Like this, and a hundred times worse than this in some places. There was famine in Sudan, the epidemic in New Guinea, collapsing economies here and there around the world. I knew all that, had known it since I was a child. But . . . But . . . But something.  Dabir was still at my side. “Are the splints holding okay?” I asked, half turning my back to him.  “Yes, they seem good,” he said after looking.  “This race I’m in, the Kitaroharo, is a solo race,” I said. “That means the racers have no support crew, no electronics, and we aren’t allowed to make contact with the local people. At least not on purpose. It’s okay if it happens by accident, if a racer makes a forced landing like I did. But normally we only land in remote areas, and we spend nights in the open, usually sleeping in trees. That’s why the race is only over sparsely populated areas.” I was saying all this with the plan of mumbling something about it being against the rules for me to spend the night in Dabir’s house, should he invite me.  “I am glad you crashed here,” he said, and then dipped his head in a gesture of embarrassment and apology. “I mean, I’m sorry you were hurt, but if you were going to crash somewhere . . . ” He grinned, waving his long, graceful hand as a way of finishing the sentence. “I am . . . happy to be able to help you.”  “You’ve been very generous, and I’m grateful,” I said. “With any luck I’ll be out of your hair tomorrow. Please let me know how I can send you some money, to pay for the barn, and to thank you for all your help.”  Dabir was looking at an angle into the sky, where there was nothing to look at. “And tomorrow . . . tomorrow I see you fly, yes?”  “Yes, tomorrow I fly.”  We walked around for a while in silence, ending up back at the barn as it was getting dark. Dabir went into his little house and came back out a few minutes later carrying a small, thin mattress and a blanket. “The roof in the house is low,” he said, holding his free hand palm-down a few inches over his head. “You would hit your wings. So you okay to sleep in here?” He nodded at the barn.  “Yes, that’s fine.”  Dabir went into the barn and laid the little mattress out on the floor. It was really just a blanket that had been folded in half and stitched up with something stuffed inside, probably dried millet leaves. “I’m sorry we have no better bed for you,” Dabir said, flipping out the blanket over the mattress.  “Dabir . . . Is this your bed?”  He tugged at the corners of the blanket, pretending not to hear me.  “I don’t need this, Dabir, really. I’m used to sleeping on the ground, and my body doesn’t get cold.” That last bit was pretty stupid of me, since the nighttime temperatures in this region are warm by anyone’s standards. Still feigning deafness, Dabir was backing away from the bed and from me, moving toward the door. “Damnit, Dabir . . . ” I said. I thought about picking the bed up and forcing it back into his arms, but I didn’t.  “Good night,” he said, smiling shyly and backing out the door.  As I lowered my face to his mattress there was the sweet smell of hay, and faintly beneath that, his sweat; a warm, living, human smell. I slept, jolting awake once through the night with my heart pounding from a dream I couldn’t remember.  The next morning I was up early, pacing around outside and slowly flexing my wings while keeping them mostly furled. There was barely a hint of dew on the ground, and it was evaporating away with the smell of wet dust. I heard someone coughing in the house. It was wet, hacking, feeble, coming from old lungs. It seemed it was never going to stop, and finally I went back into the barn and sat on the dirt floor and put my hands over my ears.  Some time later, Dabir came in with a bowl of porridge for my breakfast. While I ate, sitting cross-legged on the ground, I asked him to unlace the splints on my wings. When he was done with that I felt him running his hand over the wing membrane, feeling the texture of it. And then his hand was on my shoulder, near my neck, grazing over a part of me that wasn’t covered by my unitard.  “The wings, they look good,” he said. “The places where they were broken, there is only a small bump now.”  I went outside and made some experimental flaps with the wings half-unfurled, feeling for any twinges at the break sites. Nothing, or nothing too bad anyway. I flapped harder and harder, until Dabir was flinching and blinking his eyes at the rush of air and dust I was blowing up. The weight on my feet was becoming less and less, became nothing for a moment, and then another moment. I held my arms to the sides, tipped my body forward . . . And stopped, furling my wings in so quickly that I lost my balance, dropping to my knees and pitching forward to catch myself on my hands.  Dabir was at my side instantly, one hand on my arm and the other on my back. “Are you okay? Did you hurt something?” he asked.  “I’m all right.” I stayed on my hands and knees for a few moments. The left break site had flexed dangerously, and now it was throbbing with an ache that kept time with my heartbeat. “I just overdid it a little. I need a few more hours to heal.” I let Dabir help me to my feet, feeling his dry, callused hands holding me with gentleness and strength.  “Such power in your wings!” he said. “And they are huge when they open all the way! Amazing!” He was still holding me with one arm across my back, and with the word “huge” he swung his free arm over his head, sweeping it across the sky. “And your eyes!” he said.  “Eyes?”  “Your eyes, when you started to fly . . . ” He didn’t finish.  I went and sat on a bare patch of ground, spreading my wings out to the sun to gather energy and let the breaks finish healing. I fell asleep again.  When I woke I could see it was past noon already. I looked around for Dabir and found him in the millet field, deepening a dry irrigation ditch. “I’m ready to leave, Dabir,” I said.  “Ah.” He looked at me for a long time, and then smiled. “I get to see you fly. You finish this race and you qualify for the Asiatics, yes?”  “Yes,” I said, wishing I had his certainty about what I was going to do. We walked up to a small hillside where the high ground would help with my takeoff. Dabir’s grandmother was standing outside the doorway of the house, and when she saw me looking she lifted a hand and made one of her open-mouthed grins. “Dabir,” I said. “If you just tell me your last name, and the name of the nearest village, then I’ll be able to send you some money. It will pay for repairs to the barn, and enough so you could get some more goats, get medical care for your grandmother . . . ” My voice trailed away. He was just looking at me with that blank, boyish smile. Or maybe it was an old man’s smile. Maybe it was a smile of pity for the stupid, silly child who’d landed in his goat barn and who knew nothing, nothing, nothing about the world.  And then suddenly my arms are around him, my face pressed to his bony chest, my eyes wet. His hands touch my shoulders, my back, the side of my face, and then I turn away from him and I run down the hill, flapping frantically, tearing at the air, clawing my way up, and up, and up, then circling around to look down at him, both of his hands pressed to his mouth as he looks back up at me, his arm suddenly flailing out in a wave, piercingly childlike in the wild joy of it, and I climb up, straight up, pulling myself higher and higher to make him smaller, to make him smaller, to make him disappear.    Originally published in Asimov’s Science Fiction, April-May 2013. Karl Bunker's short stories have appeared in Asimov's, Fantasy & Science Fiction, Analog, Interzone, Cosmos, The Year's Best Science Fiction, The Best Science Fiction of the Year, and elsewhere. He lives in a small town north of Boston, MA with his wife, sundry pets, and an assortment of wildlife.", "text": "4250 words, short story, REPRINT\nGray Wings\nIt was just carelessness. I’d gotten into the wake turbulence of an old jetliner that was still low after taking off from Lagos. The wingtip vortices off of those old buckets can trail behind them for fifty or a hundred kilometers, and . . . well, I was careless.\nSo I tumbled and spun and twisted and generally had a bad time of it, and then I fell. By the time I was wings-up and face-down again, I didn’t have much altitude left and the ground was rushing up to greet me. My wings had folded in tight during my tumble, and at the speed I was falling I’d rip my sternum open if I tried to unfurl them too quickly. So I went easy, feathering open slowly. I turned into the wind, trying to translate my downward momentum into forward. I furled out more and more, listening to the fibers that held my chest together go snap, snap, snap.\nBut it was working; I was falling slower. There was a treeless valley to my right, so I teased out a banking turn in that direction. I skimmed over the crest of a low hill, glancing down to watch the ground blur past me with two meters to spare. Then I looked up again—too late.\nThere was a building straight ahead of me, and all I had time to do was close my eyes. I hit the thatched roof and ripped through it with a whooshing, crunching sound. Then there was another fraction of a second of blind freefall, and then my hands and chest and stomach hit a hard-packed dirt floor and I skidded to a stop.\nI was lying inside a low building. There were broken lengths of wood and piles of straw scattered around me, underneath me, on top of me. I took a slow breath, then started looking at my body, moving as little as possible. There was a long ragged gash across my shoulder and partway down my right breast, but it was already closing. My left leg was worse, with both bones below the knee broken, the tibia piercing the skin and the fabric of my unitard. That seemed to be it for body damage. I turned my head carefully and looked back at my wings. “Shit!” I yelled. The main spar of both wings was snapped just before the elbow joint, the bloody carbon fibers extending like brush bristles from the broken ends.\nI lay still for a while, just breathing. Then I sat up and grabbed my left shin above and below the break. I shut off all pain and deadened the muscles, and then started pulling and twisting. After a few attempts I got the broken ends of the bones lined up. I clamped both hands over the break and held, counting out 120 elephants. Somewhere around ninety my nerve-shutoff timed out and pain came roaring back, and I groaned and whimpered and sniffled.\nWhen I was done counting, and a while after that, I opened my eyes again. I was lying on my side and there was an old woman looming over me. Black-skinned and deeply wrinkled, her mouth was open in what might have been a smile, showing several missing teeth. She said something in a language I didn’t understand, then in thickly accented English: “An anchel, yes? We have a little girl-child anchel fallen from heaven, eh?” She laughed, then straightened up and walked away, kicking aside a pile of straw as she went to a door and left.\nI looked around at the building I was in. It seemed to be a small barn, with a hayloft and unglazed windows on all four walls. Beyond those walls, I was in the dead center of nowhere. I didn’t know where I was to within two hundred kilometers, and wouldn’t until I hit the Niger River sometime in the next day or so, where the beacon buoys would tell me whether to head upstream or down.\nThe door swung open again and two people came through it: The old woman and a young man. The woman spoke in her unknown language to the man, pointed at me, then at the hole in the roof. She laughed her thin, dry laugh. The man walked up to me and bent over at the waist, examining me. Belatedly, I thought to check the front of my unitard to see if my breasts were showing. Not that there’s much to look at there, but some cultures are touchy about that sort of thing. He systematically looked me over: legs, torso, arms, face, and finally the broken wings that sprouted from my back. Then he spoke, his accent not as thick as the old woman’s. “How bad you are hurt?” he said.\n“I— I’m all right. My leg was . . . But it will heal.” I realized that he was in fact almost a boy, possibly still in his teens. He was tall and very thin and dressed in blue jean shorts and a T-shirt. “My name is Amy,” I said. “I’m flying in the Kitaroharo Race—do you know it?”\nThe young man looked up, through the hole in the roof to the sky beyond. “Yes,” he said slowly. “The flyer races. They give you wings and you fly; sometimes you race. I have heard of this—seen videos.” Suddenly he dropped to his knees. He bent his head, looking closely at my leg in the dim light. “Are you sure is okay? There is much blood.”\n“Yes, it will be fine.” I peeled up the soggy leg of my unitard to reassure him. The pain had subsided to a dull throb by now.\nWith one finger he traced a path in the air, close to my skin but not touching it, following the line of the scar that showed where the bone had come through. It was a swollen, light-colored streak against the darker ash-gray of my skin. He withdrew his hand, closing his fingers. “You fix yourself? Of course—you have healing nanos, yes? Good. Very good.” He stood up again. “Dabir is me—is my name,” he said, touching his chest. He smiled, his teeth bright in the gloom. His face was beautiful, with wide, innocent eyes, high cheekbones, and a long nose that flared at the nostrils. “I am please to meet you, Amy.” The smile flashed again and he waved vaguely in the direction of the door he had come through. “Our connection is dead right now, but I can go to the village, to the computers there. Shall I call to Lagos maybe? Or you have family I should call? People who come get you?”\n“No!” I blurted. “If you do that they’ll take me out of the race, and I won’t qualify for the Asiatics this season. I can’t win this race now, probably can’t even place in the top ten, but the time limit for finishing is still six days away. I can make it to Casablanca by then—” I twisted around to look at where my wings were broken, the upper parts of the spars dangling limply, “if I can repair my wings fast enough.”\n“You can fix your wings yourself?” Dabir asked. “Like your leg?”\n“Not quite. They need to be splinted until they self-repair, and I can’t reach them to do that. I’ll need help.”\nDabir went around behind me and crouched down again. A moment later he made a soft grunting sound. “You are bleeding,” he said. “The broken part of the wings—it bleeds.”\n“Yes. They’re a part of me, connected to my blood supply. But it’s okay; they’ll only bleed a little, and it doesn’t hurt.” This wasn’t entirely true; I could feel the two breaks in the main spars, especially when the broken ends flexed, and while it wasn’t anything like the pain in my leg had been, it was damned unpleasant.\nHe came around in front of me again and squatted. He looked at me, meeting my eyes for a moment and then shyly looking away. He was sitting with his knees up and his forearms resting on them. His hands were long and delicate-looking, with tapering fingers. “Okay,” he said. “If you can explain to me how to make this splint, I will try to do it.”\nOver the next hour or so, Dabir found four suitable pieces of wood and some heavy string. He got squeamish when I told him he’d have to punch a row of holes through the wing membrane so he could wrap the string around the spar and the two pieces of splint, but after some hesitation he did it. By the time he was finished my neck was stiff from craning to look around behind me to watch what he was doing. “Thank you,” I said when he was finally done. “That’s great. By tomorrow this time they should be strong enough to fly.”\n“That soon?” Dabir shook his head, smiling. “Is amazing.”\nAs I rubbed the ache out of my neck I realized I was thirsty, hungry, and exhausted. The day had taken a lot out of me. “Could I have some water?” I said.\n“Oh!” Dabir practically leapt to his feet, and then flinched, something in his leg or hip hurting him. His hands were covered with my blood, some of it dried and some still wet. “I am sorry,” he said. “I should have brought you water sooner. And food.” He left, walking quickly and with a limp. Crouching down to work on my wings must have aggravated something in his leg. A few moments later he was back with a big mug full of water, which he handed to me before hurrying away again.\nThis time he was gone for several minutes, and when he came back he had a plate of food. There were boiled greens and some kind of meat with a thick sauce. He held the plate out to me with one hand and a fork with the other.\n“Oh, you didn’t have to do that, Dabir. There’s no need, really. I can eat anything. My nanos can digest cellulose—grass, raw leaves, anything. You don’t have to give me your . . . ” I stopped, feeling stupid. As I’d been speaking, Dabir’s hand and the plate it was holding drifted down and toward his side, until it looked like all the plate’s contents were about to spill onto the ground.\n“You do not want?” he said.\nI held my hands out for the plate and the silverware. “Yes, I do,” I said. “Thank you. It’s very kind of you.”\nOnce I started eating, I could barely shovel the food into my mouth fast enough. Dabir sat cross-legged—as I was sitting—on the dirt floor a few feet away from me. He wasn’t watching me eat, but wasn’t not watching either.\n“What is this building?” I asked, partly to force myself to slow down my gobbling and partly just for something to say.\n“A barn for goats we used to have,” he said. He made a loose-jointed wave of his arm that seemed to indicate more than just the building. “We had many goats. Then they all get a disease, last year. They all die.”\n“Ah, that’s too bad,” I mumbled, staring down at my plate. I was trying to decide if the meat underneath the tamarind sauce was real or a synthetic, maybe from a UN-Aid rations pack. I went on eating.\nA minute later the old woman came in, carrying another plate of food like mine, but with less meat. She handed it to Dabir, grinning her gap-toothed smile at some secret joke. She glanced at me, croaked a few dry, laughing words at Dabir in their language, grinned some more, and then went away. Dabir avoided my eyes after she was gone, and began to eat, deftly plucking food from his plate with his long, thin fingers.\nI looked down at my own hands, at my charcoal-gray skin. I wondered if he thought I was born with skin this color, thought it had anything to do with race.\n“My grandmother likes you,” Dabir said after a little while. “She calls you our little wounded angel.”\n“That’s what she called me when she found me,” I said. “‘A little girl-child angel, fallen from heaven’ she said.” I paused. “Does she really think . . . ?”\nHe looked at me with a smile that made me feel like the idiot I was. “No, is only a joke,” he said. “Most strangers she doesn’t like very much.” His smile grew into a soft chuckle. “But you know, most strangers don’t fall out of the sky and land in our barn.”\nI looked up at the roof of the barn. I’d broken through some of the timbers that supported the thatching, and about a third of the roof was slumping inward precariously. “I’m sorry about the damage,” I said. “Before I leave, give me your information and I’ll send money to you for repairs.”\nHe made a dismissive motion with his head. “Damage doesn’t matter. There are no goats now.”\n“But you’ll be getting more, won’t you?”\n“Tell me about flying,” he said. “What is it like?”\n“It’s . . . pretty much what you would expect.” I got to my feet as I spoke, stretching myself out straight, testing my weight on the newly-repaired bones of my left leg. I took a few tentative steps, looking behind me at my wings to make sure Dabir’s splints were holding. Luckily the peaked roof of the barn was tall enough that I didn’t have to worry about the elbows of my wings hitting anything. “You’re up high, you look down, it’s quiet, it’s cold and windy, it’s wet when you fly into a cloud . . . ” I glanced at Dabir, feeling awkward. I didn’t talk about the feeling of the wings pulling at the air, catching it, clutching at it like it was some huge living thing carrying me on its back, the feeling of inhuman strength in my wings, the roaring, screaming, blazing intoxication of it all, burning through me with every flight, every liftoff, like a drug.\nI stared down hard at the ground. When I looked at Dabir a moment ago I’d noticed for the first time that he had a long, ragged scar along the outside of his right leg, starting at the knee and stretching down halfway to his ankle. The skin was rough and puckered, the two sides of the gash misaligned; the wound must not have even been sutured, much less nano-healed.\n“I’d like to walk around outside, if I may,” I said.\n“Of course!” He bounced to his feet and walked with me to the door. With both of us standing, I barely came up to his shoulder. “You are small—tiny!” he laughed down at me. “But you are not so young as you look, yes? I mean, not a girl, like my grandmother thought at first.”\n“No, Dabir, not so young as I look.” Moving carefully, I bent low to angle my folded wings through the doorway ahead of me. I thought of my friend Nila, and the party she’d thrown for me to celebrate my new wings. She’d had every door and doorway in her home modified into a gothic arch with a peak three meters high, so I could walk from room to room without bending over. And the next day, the party over, she’d had them all changed back.\nOutside, the sun was getting low. Ahead of us was a sprawling field of some kind of crop; meter-high stalks of something dry and yellowing, with lots of bare dirt between each plant. To the right, not far away, was a tiny, unpainted wooden house with a flat roof of corrugated metal. It was crudely built, like the barn, but beyond that there was something about it that screamed of poverty and misery and ugliness. Looking at it made me feel hollowed out inside, and when I suddenly realized that Dabir might invite me in there, the thought terrified me.\n“Not a good year for the millet,” Dabir said, as if apologizing, looking out over the field. “Good rain at first, but then not enough. Next year be better, we think.”\nI walked in a mock-aimless direction, away from the house, taking deep breaths, waving my arms and flexing my wings slowly. I could feel energy from the sun soaking into my skin, coursing into the storage cells distributed through my body. But more than that I could feel that terrible little house, crouching behind me like a gargoyle. I was wishing desperately, frantically, that I could lift into the air and fly away now. That I could be back up in the cold sky where I belonged, where all of this would be far, far down, invisible below me.\nOf course I’d known what I was flying over. I’d known people lived like this. Like this, and a hundred times worse than this in some places. There was famine in Sudan, the epidemic in New Guinea, collapsing economies here and there around the world. I knew all that, had known it since I was a child. But . . . But . . . But something.\nDabir was still at my side. “Are the splints holding okay?” I asked, half turning my back to him.\n“Yes, they seem good,” he said after looking.\n“This race I’m in, the Kitaroharo, is a solo race,” I said. “That means the racers have no support crew, no electronics, and we aren’t allowed to make contact with the local people. At least not on purpose. It’s okay if it happens by accident, if a racer makes a forced landing like I did. But normally we only land in remote areas, and we spend nights in the open, usually sleeping in trees. That’s why the race is only over sparsely populated areas.” I was saying all this with the plan of mumbling something about it being against the rules for me to spend the night in Dabir’s house, should he invite me.\n“I am glad you crashed here,” he said, and then dipped his head in a gesture of embarrassment and apology. “I mean, I’m sorry you were hurt, but if you were going to crash somewhere . . . ” He grinned, waving his long, graceful hand as a way of finishing the sentence. “I am . . . happy to be able to help you.”\n“You’ve been very generous, and I’m grateful,” I said. “With any luck I’ll be out of your hair tomorrow. Please let me know how I can send you some money, to pay for the barn, and to thank you for all your help.”\nDabir was looking at an angle into the sky, where there was nothing to look at. “And tomorrow . . . tomorrow I see you fly, yes?”\n“Yes, tomorrow I fly.”\nWe walked around for a while in silence, ending up back at the barn as it was getting dark. Dabir went into his little house and came back out a few minutes later carrying a small, thin mattress and a blanket. “The roof in the house is low,” he said, holding his free hand palm-down a few inches over his head. “You would hit your wings. So you okay to sleep in here?” He nodded at the barn.\n“Yes, that’s fine.”\nDabir went into the barn and laid the little mattress out on the floor. It was really just a blanket that had been folded in half and stitched up with something stuffed inside, probably dried millet leaves. “I’m sorry we have no better bed for you,” Dabir said, flipping out the blanket over the mattress.\n“Dabir . . . Is this your bed?”\nHe tugged at the corners of the blanket, pretending not to hear me.\n“I don’t need this, Dabir, really. I’m used to sleeping on the ground, and my body doesn’t get cold.” That last bit was pretty stupid of me, since the nighttime temperatures in this region are warm by anyone’s standards. Still feigning deafness, Dabir was backing away from the bed and from me, moving toward the door. “Damnit, Dabir . . . ” I said. I thought about picking the bed up and forcing it back into his arms, but I didn’t.\n“Good night,” he said, smiling shyly and backing out the door.\nAs I lowered my face to his mattress there was the sweet smell of hay, and faintly beneath that, his sweat; a warm, living, human smell. I slept, jolting awake once through the night with my heart pounding from a dream I couldn’t remember.\nThe next morning I was up early, pacing around outside and slowly flexing my wings while keeping them mostly furled. There was barely a hint of dew on the ground, and it was evaporating away with the smell of wet dust. I heard someone coughing in the house. It was wet, hacking, feeble, coming from old lungs. It seemed it was never going to stop, and finally I went back into the barn and sat on the dirt floor and put my hands over my ears.\nSome time later, Dabir came in with a bowl of porridge for my breakfast. While I ate, sitting cross-legged on the ground, I asked him to unlace the splints on my wings. When he was done with that I felt him running his hand over the wing membrane, feeling the texture of it. And then his hand was on my shoulder, near my neck, grazing over a part of me that wasn’t covered by my unitard.\n“The wings, they look good,” he said. “The places where they were broken, there is only a small bump now.”\nI went outside and made some experimental flaps with the wings half-unfurled, feeling for any twinges at the break sites. Nothing, or nothing too bad anyway. I flapped harder and harder, until Dabir was flinching and blinking his eyes at the rush of air and dust I was blowing up. The weight on my feet was becoming less and less, became nothing for a moment, and then another moment. I held my arms to the sides, tipped my body forward . . . And stopped, furling my wings in so quickly that I lost my balance, dropping to my knees and pitching forward to catch myself on my hands.\nDabir was at my side instantly, one hand on my arm and the other on my back. “Are you okay? Did you hurt something?” he asked.\n“I’m all right.” I stayed on my hands and knees for a few moments. The left break site had flexed dangerously, and now it was throbbing with an ache that kept time with my heartbeat. “I just overdid it a little. I need a few more hours to heal.” I let Dabir help me to my feet, feeling his dry, callused hands holding me with gentleness and strength.\n“Such power in your wings!” he said. “And they are huge when they open all the way! Amazing!” He was still holding me with one arm across my back, and with the word “huge” he swung his free arm over his head, sweeping it across the sky. “And your eyes!” he said.\n“Eyes?”\n“Your eyes, when you started to fly . . . ” He didn’t finish.\nI went and sat on a bare patch of ground, spreading my wings out to the sun to gather energy and let the breaks finish healing. I fell asleep again.\nWhen I woke I could see it was past noon already. I looked around for Dabir and found him in the millet field, deepening a dry irrigation ditch. “I’m ready to leave, Dabir,” I said.\n“Ah.” He looked at me for a long time, and then smiled. “I get to see you fly. You finish this race and you qualify for the Asiatics, yes?”\n“Yes,” I said, wishing I had his certainty about what I was going to do. We walked up to a small hillside where the high ground would help with my takeoff. Dabir’s grandmother was standing outside the doorway of the house, and when she saw me looking she lifted a hand and made one of her open-mouthed grins. “Dabir,” I said. “If you just tell me your last name, and the name of the nearest village, then I’ll be able to send you some money. It will pay for repairs to the barn, and enough so you could get some more goats, get medical care for your grandmother . . . ” My voice trailed away. He was just looking at me with that blank, boyish smile. Or maybe it was an old man’s smile. Maybe it was a smile of pity for the stupid, silly child who’d landed in his goat barn and who knew nothing, nothing, nothing about the world.\nAnd then suddenly my arms are around him, my face pressed to his bony chest, my eyes wet. His hands touch my shoulders, my back, the side of my face, and then I turn away from him and I run down the hill, flapping frantically, tearing at the air, clawing my way up, and up, and up, then circling around to look down at him, both of his hands pressed to his mouth as he looks back up at me, his arm suddenly flailing out in a wave, piercingly childlike in the wild joy of it, and I climb up, straight up, pulling myself higher and higher to make him smaller, to make him smaller, to make him disappear.\nOriginally published in Asimov’s Science Fiction, April-May 2013.\nKarl Bunker's short stories have appeared in Asimov's, Fantasy & Science Fiction, Analog, Interzone, Cosmos, The Year's Best Science Fiction, The Best Science Fiction of the Year, and elsewhere. He lives in a small town north of Boston, MA with his wife, sundry pets, and an assortment of wildlife.", "source": "https://clarkesworldmagazine.com/bunker_03_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Gray Wings by Karl Bunker"}