{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nin Harris", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "p9Cpq+igNNNzjLUBUIgeHRhh0ZM=", "id": null, "license": null, "comments": "", "raw_text": "5970 words, short story  Every Plumage, Every Beak  In a secret-saturated forest that nestled between worlds, Saengdao’s people were the tamest of the monsters that terrorized the long nights. It was not just the garuda army that frightened the young Khinnaree. The watching trees were populated with tree-demons and vengeful fanged owl-women who loved the sweet flavor of Khinnaree blood.  Saengdao’s clawed avian feet scrambled the undergrowth of selasih, pegaga, and daun kesum. Sound assaulted her as much as fear—the croak of a toad nearly rendered her to tears. She wanted more than anything to be home in her family’s thatched hut that was built where the herbs grew sweet in crumbly soil rich with minerals and worms. Saengdao reached the half circle of wooden houses on stilts set up right before the ruins with a sob of relief. The front doors of the houses were accessed through wooden ladders that only agile human feet could climb.  An apsara perched on the edge of one of those doorways, her naked feet firmly braced upon the wooden steps. She was busy at work repairing a winnowing machine. The apsara looked up eagerly at Saengdao’s approach. “Saengdao? What news?”  Saengdao said, “The forest is busy tonight, Timah. You know what happened to us last night. The kayangan troops were mobilizing not just the one garuda. It was a troop of garudas, all fierce and proud. Their plumage was in brilliant hues, so brilliant!”  Saengdao looked down, eyeing her own subdued feathers with a critical eye.  “Nevermind that,” Timah said with some impatience, “How many of them were there?”  “Sixty of them. The owl-women were there with their feathers newly preened and their eyes hungry for blood. I saw one of the bunian lieutenants talking to them. I think one of the garuda saw me, but I did not stay to be sure,” Saengdao answered.  Timah got to her feet. Using the butt end of her rifle to steady herself, she climbed down from the house. She favored her sore ankle that was twisted from their misadventure of the previous night.  “They will be dancing again tonight,” Timah’s eyes were alight with avaricious excitement, “Perhaps we should have another look. The change we noticed in their dance last night may have something to do with the increase of garudas. Perhaps it is a new war-dance!”  “If it’s a war-dance, we should not be going, Timah,” Saengdao said. She hated that she automatically took on the tone of a nursemaid, but the truth was that she had been one for many years. Saengdao kept to this promise even when she would rather not. It was how she honored the memory of her mother.  “You’re such a fuss-pot, Saengdao. It’ll be fine! Here, take this. I’ve repaired our goggles,” Timah said as she reached into the pocket-belt she always wore over her sarong and brought out a slender pair of aquamarine goggles.  Saengdao took the goggles from Timah’s hand and positioned them above her bangs as usual. “They will not like it if they catch us at it again. It was bad enough last night, Timah. They sounded so angry. I’ve never heard music that angry before.”  “I will bring my rifle,” Timah said now, but she sounded unsure.  “We should not shoot at them. It would be disrespectful,” Saengdao said in her soft, anxious voice. She tucked a lock of her thick, jet-black hair behind her right ear before continuing, “Besides, I do not think that shooting will work, not with them. They own this forest. What are we to them but worms to be stepped upon?”  Timah frowned, barely paying attention to what Saengdao was saying. “Wait here,” she said.  When Timah used that tone of voice, Saengdao was too afraid to disagree. She hated that fear. She often hated how subservient she was, but it was never something she voiced. Timah had been her charge, and now her friend. She cared for Timah. That emotion did nothing to dilute her slow-bubbling resentment. Saengdao paced the ground before Timah’s hut, remembering the moment when she was sure the garuda had looked straight at her. She shivered at the thought of what might have happened to her, alone out there in the forest. She had felt her life in mortal peril like never before that night, and that caused the slow simmer of resentment against Timah’s continuous demands to escalate to dangerous, bubbling-hot liquid anger.  She felt it, and she breathed in her rage, terrified at the emotions that filled her. They were alien to her, but then, she had never been in mortal peril before. Saengdao wondered if this was how Timah’s mother had convinced her mother to take part in the border skirmish with the humans before they had died in battle. Anger, thick and exhilarating, filled her with a new determination, caused her thoughts to race in the moments when she was left alone.  Across the clearing in the moonlight, three young girls were playing with stones and squares drawn in the sand. They hopped from square to square on one leg, often shrieking in laughter when one of them stumbled and fell down on the red earth of the clearing, then recovering with the agility of the young. Another apsara was repairing a scooter, also stolen from humans, and augmented with parts scavenged from the Buried Kingdom.  The night-wind was cold. It was another sign that the bunian were close. She could almost feel the music that they made, still lacing her bloodstream and sending a chill piercing through her bones. Saengdao and Timah had both been transfixed by that music last night. So alien, so much more precise than the elegant, precise measure of the melodies usually played by the court musicians of the bunian princesses. Soon, the wooden vehicles would arrive. The communal clearing would be empty long before the bunian princesses performed their pre-landing ritual of aerial dances. It was not a sight that they were supposed to see.  Saengdao cocked her head to one side as a woman called out from inside the lighted house close to the three girls. The clearing between Timah’s village and Saengdao’s colony grew deserted. Doors and windows would be locked up and barred. Saengdao should be with her family too.  Timah approached with a rifle in one hand and a silver spear in another.  “Where did you get that?” Saengdao asked.  “Kenanga gave it to me. It’s one of theirs.”  “They will accuse us of stealing!”  “They won’t know. This thing will make us invisible to them. But we must be joined.”  Saengdao’s anger was beginning to show on her face. She narrowed her eyes at Timah and spoke in very slow, measure tones.  “We are not children anymore, Timah. I’m sorry but you’re not light anymore.”  “I wasn’t going to mount you, Saengdao,” Timah said airily, oblivious to Saengdao’s rage. Timah beckoned at Saengdao to follow her. The hibiscus bushes grew thick next to the clothesline Timah had constructed between two mango trees. Timah pulled out a brass vehicle from behind the bushes. Saengdao was engulfed by a nausea so intense that she had to look away in order to contain her gag reflex. The slit-eyed glance that she threw Timah would have been terrifying for its utter lack of warmth, had the apsara not been blithely unaware.  “It’s a chariot?” Saengdao asked.  Timah nodded, glee written on her face.  “It’s a chariot?” Saengdao asked again.  Timah’s eyes twinkled with unrepressed glee, “Isn’t it glorious? Here’s how it will work. I’ll attach this to you, and then you pull us into the forest. It’s a one-person war-chariot, made for your people.”  Timah was blithely unaware of what Saengdao was going through, nor the extent to which she had overreached, but she was not long unadvised of her friend’s emotional state.  “I pull you into the forest, Timah. Isn’t that what you mean? I am not your beast of burden!” Saengdao’s usual, soft-spoken voice grew harsh. Her soft and feminine features were convulsed with rage.  Timah gaped at her, confused and finally frightened, “I’m sorry, I meant no harm, Saengdao!”  “You never do, Timah. Do you even know the history of that torture machine that you plan to attach to me? Did you even bother to ask?” Saengdao looked at her best friend with eyes that had changed.  Timah shivered, now no longer oblivious to Saengdao’s rage, made more terrifying because her words came slow, soft, and clipped. “I’m sorry, Saengdao. I should have asked you first, but I thought it would be—”  “I don’t care what you thought. You never think these things through, Timah.”  Saengdao looked away, saying, “I’m done. You’ll have to go on without me.”  The Khinnaree returned to her family’s colony, her back straight, and her clawed feet almost attacking the ground she trod upon. She had managed to bank down the impulse to go berserk, but she knew it would one day transform her. She had seen it happen in her mother and in her aunts.  Timah stumbled into the woods, still in shock from Saengdao’s anger.  Timah had found the chariot in the shed where they stored all of the artifacts from the Buried Kingdom. Timah should have thought about it, about what it had done to the Khinnaree, and how it would have felt to be treated like a beast of burden. But she wanted them both to be invisible and they could only be invisible if they were connected to each other somehow. Timah now understood that for Saengdao, the chariot represented the subjugation and torture of her kind, a fettering of who they were, an exploitation of their powers.  The people of the Buried Kingdom had similarly ensnared the apsaras, harnessing their powers to create a kingdom that nestled half in the world of men, half in the world of apsaras, hidden from danger from both worlds, until one of the Kings dared too far, and dared to attempt a capture of a princess from Kayangan. Timah should have remembered the extent to which both of their people had been enslaved. She was severely disappointed in herself.  Timah sneaked into the forest, clutching the silver spear in one hand. The rifle was slung along her side, slapping slightly against her form. She wore a sarong with a wide leather belt that held ammunition for her rifle, various knives, and small packets of spell herbs for protection. She wore stones as talismans around her neck, strung together with string, and slippers made from treated tree bark.  Finally, she attached her modified goggles in order to see the celestial princesses better.  The princesses who floated down from the flying vehicles were always dressed differently. One night, they would be resplendent warlike goddesses in gleaming silver. The next night, they would be ethereal dancers in wispy robes of lilac. They sang as they hunted. They were both extremely feminine in a way that Timah envied, but also extremely fierce. Timah sucked on her lower lip as she watched, willing herself neither to move nor to breathe too loud. She was invisible to them so long as she held on to the silver spear, and so she clutched it in a death grip. What she did not know, however, was naturally the one thing that she should have known. She was invisible to the princesses, but not to their pets, their guardians.  The garuda of the celestial princesses of kayangan were larger than the colorful birds of paradise that could be found in the forest: the elegant and shy cenderawasih. Timah craned her neck, noticing that the garuda were now armored and wore curious goggles that she had never seen before: large and spiked at the edges.  Timah had no warning, no warning at all this time. Quieter than breath, a beak pulled her out of her hiding place, lodging itself in her cotton baju, thankfully not puncturing her skin. She dropped her spear and shrieked, before remembering she was supposed to be quiet. She shrieked again as the garuda flew up into the sky, hauling her along.  Her sisters wanted to know why she was so upset.  Saengdao ignored everyone, slinking to the corner of their hut to stare at the thatched wall. She did not join them for dinner, even though the scent of the glutinous rice, spiced fish, and the mangoes that she had plucked from the trees earlier in the day filled the hut. She ignored her sisters further as they danced the menorah after dinner, practicing for the harvest pageant of propitiation.  Her silence was of a sort that infected the others, and they finally settled down to talk quietly amongst themselves, their tail-feathers comfortably settled against the soft earthen floor.  Finally, her eldest sister Yong-Yut sat down beside her.  “What happened, Saengdao? Have you fought with Timah?”  “She found one of those war-chariots. She wanted me to harness myself up so that she could ride me,” Saengdao’s tones were soft so that only Yong-Yut could hear her.  Yong-Yut craned her elegant neck to look at her youngest sister.  “What she did was wrong, Saengdao. You were right to be angry. But was she aware about what it means to our people? Did she know those chariots were instruments of shame and torture?”  “Timah was thoughtless as usual. She only had a care about how we would get to see them. She only had a care about herself. As usual.”  “The bunian?”  “Yes.”  Yong-Yut shook her head. “No good will come of her obsession with those folk. They are woven of a thread far finer than our own rude form.”  “I know that. But she’s gone anyway, she says we’re all descended from them, and she means to learn more about our kinship.”  Yong-Yut gave her sister a deliberate look.  “Let me understand this. You let the girl you call your oath-sister go into the forest alone to spy on the bunian princesses, when you know she’s obsessed with them?”  “She brought that war-chariot out. She wanted me to comply with an act that has caused shame and dishonor to our kind for centuries!”  “I know, Yong-Yut. It was a terrible thing to have done, and very thoughtless of her. Still. Do you want something bad to happen to Timah? Really? Of the sort that may happen to her if the garudas capture her?”  Saengdao sighed, and said reluctantly, “No. Not really.”  “So come on then, you can go ahead with considering her unforgiveable after we’ve fished her out of whatever scrape she’s got herself into. You’ve got just cause, don’t get me wrong. But we can’t let her die. Our mother promised her mother, remember?”  “What makes you assume she’s in trouble?” Saengdao countered.  “You’re not with her, and she’s got artifacts she should not be anywhere near. And we both know what Timah can be like.”  Saengdao shook her head and groaned. “Do we have to do this?” she asked in plaintive tones.  “Yes, Saengdao, we really do.”  “I don’t like coming here,” Saengdao said to Yong-Yut the next day as they entered the ruins of the Buried Kingdoms.  “Well, most of us do make our livelihoods from scavenging these ruins, sister. You are now old enough to do the same.”  Yong-Yut beckoned at her to take a left turn as they entered a winding road almost covered by giant ferns.  “However, that is not why I’ve brought you today.”  Yong-Yut pointed at a thatched hut that looked far more spacious than the hut they shared with their siblings. The thatching looked new and elegant.  “Did you build this?”  “Yes! Very slowly, I did. Come inside, I want to show you what I’ve found.”  Saengdao followed Yong-Yut into the hut, which was spacious enough on the inside that Saengdao considered that they should be calling it a house. That was strange enough. Houses were not normal for their people. They were too used to needing to build homes they could quickly dismantle and carry on their broad backs. Building this thatched house within the grounds of the Buried Kingdom was even more terrifying, Saengdao thought.  Yong-Yut lifted what looked like a huge frame off the ground.  “What is that?” Saengdao asked.  “It is a war-kite, used to fire missiles into enemy troops. The Khinnaree used to be deployed in the armies of the Buried Kingdom for that purpose. But there are other uses for these kites.”  “Such as?”  “Haven’t you ever wondered what it would feel like to fly?” Yong-Yut asked her.  Saengdao almost flinched. “Not you too,” she said, tucking her hair behind her ear in a nervous gesture.  “My obsession with flight is not the same as your friend’s. I’m thinking about ways in which we should be able to defend ourselves. And flight is one way. I’ve managed to work out how to get it to work. Take this . . . ”  Saengdao took the war-kite that her sister held out to her, and then watched as Yong-Yut picked up a huge satchel and another war-kite. Both war-kites were enormous and had harnesses attached to them. Saengdao nearly staggered under the kite she held. It was not so much because it was heavy, for it was definitely incredibly light. But the sheer length and width of the wings made the entire contraption difficult to carry.  “Let’s go outside so we can get this to work,” Yong-Yut said.  “But why?”  “So we can find your friend.”  “You just want an excuse to use your new toys. You’re just as bad as her,” Saengdao said. “What about the fact that you want us harnessed into these kites in the same way we were harnessed into the chariots?”  “It’s different, Saengdao. I’ve changed these kites. These weren’t originally used for flying, but the Khinnaree would run with these kites on the ground to aim weapons at the enemy. But look! I’ve turned them into something that can make us fly!”  Yong-Yut worked as she spoke, pulling straps and other bits of scavenged leather out from her satchel, attaching hooks and strange brass buttons and other bits of leather in a crisscross pattern.  “What are you doing?” Saengdao asked.  “Attaching the harnesses for the war-kites to carry us. Patience, sister!”  Yong-Yut had her sister sitting down on a boulder before she strapped her into a harness, which was then attached to the giant, violet-hued war-kite.  Yong-Yut’s excitement was infectious, and Saengdao began to feel a measure of skeptical enthusiasm. “How do you expect these kites to carry us?” she asked. “We have never been able to fly because we are so dense.”  “The same way they used to carry huge weapons of war, except better! Look!”  Yong-Yut passed a rolled up piece of paper to Saengdao who stared at the illustrations they contained.  “Your friend’s people aren’t the only one who can make machinery out of what they’ve scavenged from these ruins, you know.”  “I just never thought we needed to do so. And why use the weapons and designs of our oppressors?”  “There will never come a time when we do not need to do what we are doing right now, sister. We work with what we have. We scavenge, because we were robbed. Now, be brave, the next bit may sound alarming. Stand up please, in the clearing over here.”  Yong-Yut attached what looked like a smaller leather satchel to her war-kite. Taking out a blowtorch, Yong-Yut started turning a dial on the satchel before attaching the blowtorch to a nozzle that jutted out from the satchel. A long jet of flame emerged from the nozzle. The satchel expanded, and a great force suddenly moved the war-kite upward.  “Just remember to keep your limbs relaxed and stay calm. Also, take this!”  Saengdao deftly caught the revved-up rifle that Yong-Yut threw at her and tried to remember to stay calm. It was not easy to do so, given that she was the most easily frightened of all of her sisters.  Yong-Yut’s war-kite was bigger than Timah’s. The satchel with its strange properties of fire and force was also bigger. She held in her hand a large rifle that also seemed equipped with a silver spear.  “I’m calling them propulsion-satchels,” Yong-Yut said, winking at the question in her sister’s face. She pulled Saengdao closer, attaching Saengdao’s harness to her own harness with a strong, woven rope.  “There’s a smaller silver spear attached to the inside of your rifle. Do you remember how to shoot that thing?” she asked, giving Saengdao a cheeky grin.  Saengdao snorted, being the sibling who was the most adept at hunting despite her nervous tendencies. “You know I do, but do we have to resort to violence?”  “Hopefully not, but it is good to be prepared.”  “Come on, Saengdao. We shouldn’t waste time.”  Yong-Yut pulled down her goggles to cover her eyes, and Saengdao did the same for her own pair.  The Empress’ wooden palace in the sky was the largest amongst all of the floating palaces, and naturally the grandest. Gold inlayed every wood-carved detail of her palace, and the ladders were studded with rubies and chalcedony. The Empress herself sat on a throne that was set so high in the throne room that thirty-six steps curved upward to meet her feet, clad in slippers of gold and jade.  Timah gazed upon the Empress in awe, wondering if this was the last sight of grandeur she would be granted before they ended her sad life. If so, she was glad to die, she thought. Her dearest wish had been fulfilled. The Empress laughed, and it was not a kind sound.  “I am assuming this is one of the little spies who kept returning to watch us. Of what race is this one, First Admiral?”  First Admiral was a woman dressed in a simple outfit of teal cotton trimmed with silver and teal songket. She circled the kneeling Timah and then answered.  “Of Malay-Thai extraction, descended from the apsaras of the Buried Kingdoms. She is one of our very distant kin, Your Imperial Majesty.”  “One of the little ones we rescued from those accursed Kings?”  “Yes, Your Imperial Majesty.”  “They know our rules, and they know the price for our rules. She was caught spying. Shall we behead her, or shall we claim her as tithe?”  Timah bit down hard on her lower lip so as not to embarrass herself with pleas.  First Admiral paused to look down at her. “She is not without competence, this one, Your Imperial Majesty. We may be in need of more tinkers in the time to come.”  The Empress exhaled. It was a long, tired sound.  “You think we have come to this? Recruiting human tinkers?”  “It’s worth a try, Your Majesty. We need to protect our palaces beyond what we’ve been doing. The empire of the air grows larger, and our people are no longer united as they once were.”  Curiosity overcame Timah despite her fear. She asked, “Your Imperial Majesty, I am not fit to kiss the ground beneath your dais, let alone breathe the air you breathe, let alone speak, but may I know why the bunian are at war?”  The Empress laughed again, this time a sound of shocked amusement.  “So, not fit to breathe the air we breathe, but daring to question our actions? So very insincere, little one.”  First Admiral glanced at Timah before looking up at the Empress, “Your Imperial Majesty, perhaps it would be good if her folk knew of what was going on. This impacts them as well. They are, after all, our kin.”  The Empress made a dismissive gesture with her hand.  “Tell her then. It makes no difference what these diluted by-blows know.”  First Admiral bowed in graceful and profound respect.  “We are not at war, little apsara. But there is a battle happening to determine which of the princesses will be the next Empress.”  Timah did not understand. The Empress barely looked older than Timah. The Empress met her eyes, a small smile playing about her regal lips.  “We do not serve as Empress forever, little apsara. After every decade, a contest happens to determine who serves next. This year, things have become rather strained.”  “Her Imperial Majesty’s daughter won the contest this year. The other princesses claim it was foul play because an engineer died during the contest. They have now mobilized in opposing camps to determine the next Empress,” First Admiral said.  Timah looked up at the Empress, suddenly realizing that the Empress was very possibly on the losing side of this battle.  “Why would they call foul?”  The Empress shrugged. “It was a technicality. It is not the first time such a thing has happened in our history. Not the first time an engineer has died, even. The violence with which these claims were made, however, is something new. We are growing more dependent on engineering. There was a time when we lived only on the power of sakti, but our connection to sakti grows weak. The world outside of kayangan grows stronger.”  Timah said, “Your Imperial Majesty, this unworthy being would be pleased to serve and help you in any way at all in this battle.”  The Empress shook her head slightly, frowning.  “What can you do, little apsara? You’re but a tinker.”  Timah was about to answer when a commotion broke out. She turned to look and saw six armed women bring forward Saengdao and Yong-Yut. They were harnessed to enormous kites that were dragging behind them. They struggled, their faces red, and their necks expanding in an alarming way. The sisters tried repeatedly to claw at the eyes of the bunian guards who pinioned their arms.  “First apsaras, and now the Khinnaree? Are we to have the entire raggle-taggle survivors of the Buried Kingdom up here in my throne room? Captain Misha, what is the meaning of this?”  “We found these two Khinnaree harnessed to armed war-kites that flew faster than our garuda, Your Imperial Majesty. We managed to overtake them when the winds slowed, and just before their machines died.”  “The propulsion-satchels lost power as we gained altitude,” Yong-Yut said to no one in particular, sounding incredibly disgruntled.  “Khinnaree mechanics and apsara tinkers,” the Empress said, her tone thoughtful, “I am going to need help to understand how such a strange event can come to pass. It is an anomaly, but may be fortuitous.”  The Empress’ thoughtful tone came hand in hand with a shining luminescence in her form, which grew until she was an oval of light that hurt the eyes. Timah immediately turned the dial on her goggles to compensate for the light-blindness. She gasped at what she saw.  The oval of light seemed to split itself. A bird that seemed to be made of both air and light emerged from the Empress’ form. It floated above the Empress in a delicate way, its movements soft and deliberate. The peace it brought filled everyone in the room.  “Holy Jentayu,” the Empress said, in a soft, reverent voice, “Give us guidance in this matter. Should we take these children as tithe or should we sacrifice them?”  The bird flew down from the throne, coming face-to-face with Timah. The bird was so beautiful that Timah could not bear to look full into the soft brown eyes that fiercely looked into hers. The bird then flew above her, almost gliding in the air, before it reached the two Khinnaree sisters, circling them.  Timah did not understand the ways of the Khinnaree, but she knew she had angered and hurt Saengdao. She wondered if the Jentayu would know of this. If so, would she be punished?  The Jentayu flew back to the Empress. The two of them merged in a brilliant ball of blue light that hurt Timah’s eyes even through her light-blindness setting. She closed her eyes and kept them closed.  It felt like a very long while before the Empress spoke. The entire room had descended into a reverent silence. It felt as though even the air had been sleeping until the Empress’ voice woke them up again.  “You two Khinnaree, come closer. Tell me of how you changed these war-kites.”  “I found close to two hundred war-kites in one of the armories in the Buried Kingdom, Your Imperial Majesty. I took two of them to work on. I also found the old engineering rooms of the Buried Kingdoms, where they combined minerals and gases to create fluids that could move objects across space. There were many diagrams in the engineering archives that gave instructions. I merely connected that design to the design of the war-kites so that I could fly,” Yong-Yut said, obviously trying to sound nonchalant. However, her eyes were almost shining with the pleasure of sharing what she had achieved.  “That was very ingenious of you, young Khinnaree. However, it is clear that your mechanical work needs refining. You had the speed, but not the lasting power. The lasting power is that of sakti, which has been keeping our palaces afloat.”  The Empress’ expression was inscrutable as she continued, “However, as sakti grows weak, technology must grow strong and evolve. These three denizens of the villages below will be useful in my daughter’s battle.”  First Admiral nodded, her eyes pleased at the Empress’ decision. Timah slumped in relief.  On her throne, the Empress surveyed her court with troubled eyes.  She spoke, “The Jentayu also said that we must consider these apsaras and Khinnaree as potential candidates for our future armies. She says that we must unite against a common danger in the future. We cannot merely be a city of bunian any longer. As the world outside of our kingdoms grows, our forests and our dominions will decrease. We will need to fortify ourselves.”  Timah wondered what that common danger could be, but she was too overcome with relief to dwell too long on the subject, too overcome to notice the sounds of anger and conflict that swept over the close to two hundred bunian that thronged the huge throne-room in the sky.  “Take them away to be outfitted and trained. I am weary and must retire,” said the Empress.  Timah stood up and made to run toward Saengdao. She stopped mid-stride at the cold look Saengdao gave her. Saengdao shook her head and turned away. The two sisters left with the armored guards.  Timah did not even bother to deny the hollow feeling within her. It was a feeling that would be her constant companion ’til the end of her days.  First Admiral had placed both the Khinnaree with an aerial defense engineering unit to be trained, while taking Timah to the floating annex for civilian engineers. One of the pavilions had been converted into a practical workshop, filled with bunian engineers, their elegant limbs encased in overalls made of kain pelekat.  “This is where we work on refining our machines, merging the powers of the elements to create new war-engines and ways to keep our city afloat and invisible,” First Admiral said, “We are trying our best to develop new technology to keep the palaces not just afloat, but to keep them hidden.”  “I do not know how I will ever be useful to beings so much more intelligent than me,” Timah said, self-conscious and shy. She was overcome with the brilliance and competence displayed by the bunian engineers at work. Her eyes hungered for the machines they were building.  “You are here to learn. You are not useful to us, yet. But you will be.” First Admiral said. Her voice was not unkind. “The Empress always looks further into the future than any of us—this is what happens when you are connected to the Holy Jentayu.”  “Am I not here to help with the battle between the Empress’ daughter and the other princesses?”  “That battle was lost before it began, child. Our story is about to change. Yours is only just beginning. Learn, for you will be the future of this Empire. All of you.”  Their food was served on bronze platters so grand that the two Khinnaree were shy.  “Your harnesses brought us to a different world, sister,” Saengdao said to Yong-Yut as they were fed piles of glutinous rice with shredded mango salad.  “Yes, my harnesses worked. But there is much to be done before the war-kites can be made useful in battle. I have much to do with the aerial defense engineering unit.”  Saengdao looked happier and calmer than she had been for a very long time. Nevertheless, her eyes seemed uncertain.  “Will you teach me, sister? I want to help. I am not smart like you, but I can do what needs to be done.”  Yong-Yut laughed. “Not smart, Saengdao? You always think less of yourself than you deserve. Perhaps asking you to be Timah’s nursemaid was not one of Mother’s better decisions. You may well prove to be the smartest of us all, Saengdao. This is a whole new world for us.”  Saengdao nodded her assent, staring at the clouds from the open doors of their floating pavilion. During their flight in the sky, moments before they were apprehended, Saengdao has seen the world stretched out before her and felt the rush of knowing instinctively how to keep the propulsion satchel going. She felt as though the hot rage that had engulfed her had transformed her into a different person. Her mind, so sluggish and ready to take instructions before, had turned into something else.  She was unsure if she knew what that thing was, but she was very sure that she never wanted to be in the vicinity of one who had willingly cast her in a subservient role for most of their life. Some friendships had to die so that some lives could begin.  Timah never saw her home again.  Thirty years later, the floating palaces had twenty war-kite squads of six equipped Khinnaree each, patrolling in shifts to protect the floating palaces, or the parts of the floating palaces to which they were assigned. Internecine wars became a trend amongst the bunian princesses. There were neither Khinnaree nor apsaras left in the villages below. Her bare feet forgot the feel of grass and the sweet dampness of forest herbs. Some days, she still saw the owl-women. One or two of them would fly high enough that they reached the floating palaces before they would be swept away by the wind or captured by the war-kite patrol units.  Timah would see Admiral Saengdao harnessed to her violet war-kite more than once as she patrolled with her sisters, flying in stately aerial formations. Admiral Saengdao’s uniform was a rich lavender songket, adorned with the silver accoutrements of her rank. She laughed as she worked, sounding far more lighthearted than the Khinnaree who had grown up with Timah.  Timah worked on the machines and propulsion satchels pioneered by Admiral Yong-Yut at the Avian Defense Engineering Unit for civil engineering purposes, keeping their homes afloat and equipped with the wherewithal to stay protected and invisible. The Khinnaree, on the other hand, worked on refining the war-kites so that more Khinnaree could be outfitted. Timah saw the Khinnaree flying past her workshop on a daily basis, harnessed to their war-kites.  Timah was kept mostly to her workshop when she was not summoned to court for new directives from the next two Empresses who came into power after the Empress who had taken her in had been murdered in her sleep by her daughter’s rivals.  The war-chariots of the past were never spoken of again. Arch-Admiral Yong-Yut had ordered for the immediate destruction of any war-chariot found in the ruins of the Buried Kingdom.  They remained only to haunt Timah in her dreams and in her moonlit vigils against the demons of self-defeat. Nin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee.", "text": "5970 words, short story\nEvery Plumage, Every Beak\nIn a secret-saturated forest that nestled between worlds, Saengdao’s people were the tamest of the monsters that terrorized the long nights. It was not just the garuda army that frightened the young Khinnaree. The watching trees were populated with tree-demons and vengeful fanged owl-women who loved the sweet flavor of Khinnaree blood.\nSaengdao’s clawed avian feet scrambled the undergrowth of selasih, pegaga, and daun kesum. Sound assaulted her as much as fear—the croak of a toad nearly rendered her to tears. She wanted more than anything to be home in her family’s thatched hut that was built where the herbs grew sweet in crumbly soil rich with minerals and worms. Saengdao reached the half circle of wooden houses on stilts set up right before the ruins with a sob of relief. The front doors of the houses were accessed through wooden ladders that only agile human feet could climb.\nAn apsara perched on the edge of one of those doorways, her naked feet firmly braced upon the wooden steps. She was busy at work repairing a winnowing machine. The apsara looked up eagerly at Saengdao’s approach. “Saengdao? What news?”\nSaengdao said, “The forest is busy tonight, Timah. You know what happened to us last night. The kayangan troops were mobilizing not just the one garuda. It was a troop of garudas, all fierce and proud. Their plumage was in brilliant hues, so brilliant!”\nSaengdao looked down, eyeing her own subdued feathers with a critical eye.\n“Nevermind that,” Timah said with some impatience, “How many of them were there?”\n“Sixty of them. The owl-women were there with their feathers newly preened and their eyes hungry for blood. I saw one of the bunian lieutenants talking to them. I think one of the garuda saw me, but I did not stay to be sure,” Saengdao answered.\nTimah got to her feet. Using the butt end of her rifle to steady herself, she climbed down from the house. She favored her sore ankle that was twisted from their misadventure of the previous night.\n“They will be dancing again tonight,” Timah’s eyes were alight with avaricious excitement, “Perhaps we should have another look. The change we noticed in their dance last night may have something to do with the increase of garudas. Perhaps it is a new war-dance!”\n“If it’s a war-dance, we should not be going, Timah,” Saengdao said. She hated that she automatically took on the tone of a nursemaid, but the truth was that she had been one for many years. Saengdao kept to this promise even when she would rather not. It was how she honored the memory of her mother.\n“You’re such a fuss-pot, Saengdao. It’ll be fine! Here, take this. I’ve repaired our goggles,” Timah said as she reached into the pocket-belt she always wore over her sarong and brought out a slender pair of aquamarine goggles.\nSaengdao took the goggles from Timah’s hand and positioned them above her bangs as usual. “They will not like it if they catch us at it again. It was bad enough last night, Timah. They sounded so angry. I’ve never heard music that angry before.”\n“I will bring my rifle,” Timah said now, but she sounded unsure.\n“We should not shoot at them. It would be disrespectful,” Saengdao said in her soft, anxious voice. She tucked a lock of her thick, jet-black hair behind her right ear before continuing, “Besides, I do not think that shooting will work, not with them. They own this forest. What are we to them but worms to be stepped upon?”\nTimah frowned, barely paying attention to what Saengdao was saying. “Wait here,” she said.\nWhen Timah used that tone of voice, Saengdao was too afraid to disagree. She hated that fear. She often hated how subservient she was, but it was never something she voiced. Timah had been her charge, and now her friend. She cared for Timah. That emotion did nothing to dilute her slow-bubbling resentment. Saengdao paced the ground before Timah’s hut, remembering the moment when she was sure the garuda had looked straight at her. She shivered at the thought of what might have happened to her, alone out there in the forest. She had felt her life in mortal peril like never before that night, and that caused the slow simmer of resentment against Timah’s continuous demands to escalate to dangerous, bubbling-hot liquid anger.\nShe felt it, and she breathed in her rage, terrified at the emotions that filled her. They were alien to her, but then, she had never been in mortal peril before. Saengdao wondered if this was how Timah’s mother had convinced her mother to take part in the border skirmish with the humans before they had died in battle. Anger, thick and exhilarating, filled her with a new determination, caused her thoughts to race in the moments when she was left alone.\nAcross the clearing in the moonlight, three young girls were playing with stones and squares drawn in the sand. They hopped from square to square on one leg, often shrieking in laughter when one of them stumbled and fell down on the red earth of the clearing, then recovering with the agility of the young. Another apsara was repairing a scooter, also stolen from humans, and augmented with parts scavenged from the Buried Kingdom.\nThe night-wind was cold. It was another sign that the bunian were close. She could almost feel the music that they made, still lacing her bloodstream and sending a chill piercing through her bones. Saengdao and Timah had both been transfixed by that music last night. So alien, so much more precise than the elegant, precise measure of the melodies usually played by the court musicians of the bunian princesses. Soon, the wooden vehicles would arrive. The communal clearing would be empty long before the bunian princesses performed their pre-landing ritual of aerial dances. It was not a sight that they were supposed to see.\nSaengdao cocked her head to one side as a woman called out from inside the lighted house close to the three girls. The clearing between Timah’s village and Saengdao’s colony grew deserted. Doors and windows would be locked up and barred. Saengdao should be with her family too.\nTimah approached with a rifle in one hand and a silver spear in another.\n“Where did you get that?” Saengdao asked.\n“Kenanga gave it to me. It’s one of theirs.”\n“They will accuse us of stealing!”\n“They won’t know. This thing will make us invisible to them. But we must be joined.”\nSaengdao’s anger was beginning to show on her face. She narrowed her eyes at Timah and spoke in very slow, measure tones.\n“We are not children anymore, Timah. I’m sorry but you’re not light anymore.”\n“I wasn’t going to mount you, Saengdao,” Timah said airily, oblivious to Saengdao’s rage. Timah beckoned at Saengdao to follow her. The hibiscus bushes grew thick next to the clothesline Timah had constructed between two mango trees. Timah pulled out a brass vehicle from behind the bushes. Saengdao was engulfed by a nausea so intense that she had to look away in order to contain her gag reflex. The slit-eyed glance that she threw Timah would have been terrifying for its utter lack of warmth, had the apsara not been blithely unaware.\n“It’s a chariot?” Saengdao asked.\nTimah nodded, glee written on her face.\n“It’s a chariot?” Saengdao asked again.\nTimah’s eyes twinkled with unrepressed glee, “Isn’t it glorious? Here’s how it will work. I’ll attach this to you, and then you pull us into the forest. It’s a one-person war-chariot, made for your people.”\nTimah was blithely unaware of what Saengdao was going through, nor the extent to which she had overreached, but she was not long unadvised of her friend’s emotional state.\n“I pull you into the forest, Timah. Isn’t that what you mean? I am not your beast of burden!” Saengdao’s usual, soft-spoken voice grew harsh. Her soft and feminine features were convulsed with rage.\nTimah gaped at her, confused and finally frightened, “I’m sorry, I meant no harm, Saengdao!”\n“You never do, Timah. Do you even know the history of that torture machine that you plan to attach to me? Did you even bother to ask?” Saengdao looked at her best friend with eyes that had changed.\nTimah shivered, now no longer oblivious to Saengdao’s rage, made more terrifying because her words came slow, soft, and clipped. “I’m sorry, Saengdao. I should have asked you first, but I thought it would be—”\n“I don’t care what you thought. You never think these things through, Timah.”\nSaengdao looked away, saying, “I’m done. You’ll have to go on without me.”\nThe Khinnaree returned to her family’s colony, her back straight, and her clawed feet almost attacking the ground she trod upon. She had managed to bank down the impulse to go berserk, but she knew it would one day transform her. She had seen it happen in her mother and in her aunts.\nTimah stumbled into the woods, still in shock from Saengdao’s anger.\nTimah had found the chariot in the shed where they stored all of the artifacts from the Buried Kingdom. Timah should have thought about it, about what it had done to the Khinnaree, and how it would have felt to be treated like a beast of burden. But she wanted them both to be invisible and they could only be invisible if they were connected to each other somehow. Timah now understood that for Saengdao, the chariot represented the subjugation and torture of her kind, a fettering of who they were, an exploitation of their powers.\nThe people of the Buried Kingdom had similarly ensnared the apsaras, harnessing their powers to create a kingdom that nestled half in the world of men, half in the world of apsaras, hidden from danger from both worlds, until one of the Kings dared too far, and dared to attempt a capture of a princess from Kayangan. Timah should have remembered the extent to which both of their people had been enslaved. She was severely disappointed in herself.\nTimah sneaked into the forest, clutching the silver spear in one hand. The rifle was slung along her side, slapping slightly against her form. She wore a sarong with a wide leather belt that held ammunition for her rifle, various knives, and small packets of spell herbs for protection. She wore stones as talismans around her neck, strung together with string, and slippers made from treated tree bark.\nFinally, she attached her modified goggles in order to see the celestial princesses better.\nThe princesses who floated down from the flying vehicles were always dressed differently. One night, they would be resplendent warlike goddesses in gleaming silver. The next night, they would be ethereal dancers in wispy robes of lilac. They sang as they hunted. They were both extremely feminine in a way that Timah envied, but also extremely fierce. Timah sucked on her lower lip as she watched, willing herself neither to move nor to breathe too loud. She was invisible to them so long as she held on to the silver spear, and so she clutched it in a death grip. What she did not know, however, was naturally the one thing that she should have known. She was invisible to the princesses, but not to their pets, their guardians.\nThe garuda of the celestial princesses of kayangan were larger than the colorful birds of paradise that could be found in the forest: the elegant and shy cenderawasih. Timah craned her neck, noticing that the garuda were now armored and wore curious goggles that she had never seen before: large and spiked at the edges.\nTimah had no warning, no warning at all this time. Quieter than breath, a beak pulled her out of her hiding place, lodging itself in her cotton baju, thankfully not puncturing her skin. She dropped her spear and shrieked, before remembering she was supposed to be quiet. She shrieked again as the garuda flew up into the sky, hauling her along.\nHer sisters wanted to know why she was so upset.\nSaengdao ignored everyone, slinking to the corner of their hut to stare at the thatched wall. She did not join them for dinner, even though the scent of the glutinous rice, spiced fish, and the mangoes that she had plucked from the trees earlier in the day filled the hut. She ignored her sisters further as they danced the menorah after dinner, practicing for the harvest pageant of propitiation.\nHer silence was of a sort that infected the others, and they finally settled down to talk quietly amongst themselves, their tail-feathers comfortably settled against the soft earthen floor.\nFinally, her eldest sister Yong-Yut sat down beside her.\n“What happened, Saengdao? Have you fought with Timah?”\n“She found one of those war-chariots. She wanted me to harness myself up so that she could ride me,” Saengdao’s tones were soft so that only Yong-Yut could hear her.\nYong-Yut craned her elegant neck to look at her youngest sister.\n“What she did was wrong, Saengdao. You were right to be angry. But was she aware about what it means to our people? Did she know those chariots were instruments of shame and torture?”\n“Timah was thoughtless as usual. She only had a care about how we would get to see them. She only had a care about herself. As usual.”\n“The bunian?”\n“Yes.”\nYong-Yut shook her head. “No good will come of her obsession with those folk. They are woven of a thread far finer than our own rude form.”\n“I know that. But she’s gone anyway, she says we’re all descended from them, and she means to learn more about our kinship.”\nYong-Yut gave her sister a deliberate look.\n“Let me understand this. You let the girl you call your oath-sister go into the forest alone to spy on the bunian princesses, when you know she’s obsessed with them?”\n“She brought that war-chariot out. She wanted me to comply with an act that has caused shame and dishonor to our kind for centuries!”\n“I know, Yong-Yut. It was a terrible thing to have done, and very thoughtless of her. Still. Do you want something bad to happen to Timah? Really? Of the sort that may happen to her if the garudas capture her?”\nSaengdao sighed, and said reluctantly, “No. Not really.”\n“So come on then, you can go ahead with considering her unforgiveable after we’ve fished her out of whatever scrape she’s got herself into. You’ve got just cause, don’t get me wrong. But we can’t let her die. Our mother promised her mother, remember?”\n“What makes you assume she’s in trouble?” Saengdao countered.\n“You’re not with her, and she’s got artifacts she should not be anywhere near. And we both know what Timah can be like.”\nSaengdao shook her head and groaned. “Do we have to do this?” she asked in plaintive tones.\n“Yes, Saengdao, we really do.”\n“I don’t like coming here,” Saengdao said to Yong-Yut the next day as they entered the ruins of the Buried Kingdoms.\n“Well, most of us do make our livelihoods from scavenging these ruins, sister. You are now old enough to do the same.”\nYong-Yut beckoned at her to take a left turn as they entered a winding road almost covered by giant ferns.\n“However, that is not why I’ve brought you today.”\nYong-Yut pointed at a thatched hut that looked far more spacious than the hut they shared with their siblings. The thatching looked new and elegant.\n“Did you build this?”\n“Yes! Very slowly, I did. Come inside, I want to show you what I’ve found.”\nSaengdao followed Yong-Yut into the hut, which was spacious enough on the inside that Saengdao considered that they should be calling it a house. That was strange enough. Houses were not normal for their people. They were too used to needing to build homes they could quickly dismantle and carry on their broad backs. Building this thatched house within the grounds of the Buried Kingdom was even more terrifying, Saengdao thought.\nYong-Yut lifted what looked like a huge frame off the ground.\n“What is that?” Saengdao asked.\n“It is a war-kite, used to fire missiles into enemy troops. The Khinnaree used to be deployed in the armies of the Buried Kingdom for that purpose. But there are other uses for these kites.”\n“Such as?”\n“Haven’t you ever wondered what it would feel like to fly?” Yong-Yut asked her.\nSaengdao almost flinched. “Not you too,” she said, tucking her hair behind her ear in a nervous gesture.\n“My obsession with flight is not the same as your friend’s. I’m thinking about ways in which we should be able to defend ourselves. And flight is one way. I’ve managed to work out how to get it to work. Take this . . . ”\nSaengdao took the war-kite that her sister held out to her, and then watched as Yong-Yut picked up a huge satchel and another war-kite. Both war-kites were enormous and had harnesses attached to them. Saengdao nearly staggered under the kite she held. It was not so much because it was heavy, for it was definitely incredibly light. But the sheer length and width of the wings made the entire contraption difficult to carry.\n“Let’s go outside so we can get this to work,” Yong-Yut said.\n“But why?”\n“So we can find your friend.”\n“You just want an excuse to use your new toys. You’re just as bad as her,” Saengdao said. “What about the fact that you want us harnessed into these kites in the same way we were harnessed into the chariots?”\n“It’s different, Saengdao. I’ve changed these kites. These weren’t originally used for flying, but the Khinnaree would run with these kites on the ground to aim weapons at the enemy. But look! I’ve turned them into something that can make us fly!”\nYong-Yut worked as she spoke, pulling straps and other bits of scavenged leather out from her satchel, attaching hooks and strange brass buttons and other bits of leather in a crisscross pattern.\n“What are you doing?” Saengdao asked.\n“Attaching the harnesses for the war-kites to carry us. Patience, sister!”\nYong-Yut had her sister sitting down on a boulder before she strapped her into a harness, which was then attached to the giant, violet-hued war-kite.\nYong-Yut’s excitement was infectious, and Saengdao began to feel a measure of skeptical enthusiasm. “How do you expect these kites to carry us?” she asked. “We have never been able to fly because we are so dense.”\n“The same way they used to carry huge weapons of war, except better! Look!”\nYong-Yut passed a rolled up piece of paper to Saengdao who stared at the illustrations they contained.\n“Your friend’s people aren’t the only one who can make machinery out of what they’ve scavenged from these ruins, you know.”\n“I just never thought we needed to do so. And why use the weapons and designs of our oppressors?”\n“There will never come a time when we do not need to do what we are doing right now, sister. We work with what we have. We scavenge, because we were robbed. Now, be brave, the next bit may sound alarming. Stand up please, in the clearing over here.”\nYong-Yut attached what looked like a smaller leather satchel to her war-kite. Taking out a blowtorch, Yong-Yut started turning a dial on the satchel before attaching the blowtorch to a nozzle that jutted out from the satchel. A long jet of flame emerged from the nozzle. The satchel expanded, and a great force suddenly moved the war-kite upward.\n“Just remember to keep your limbs relaxed and stay calm. Also, take this!”\nSaengdao deftly caught the revved-up rifle that Yong-Yut threw at her and tried to remember to stay calm. It was not easy to do so, given that she was the most easily frightened of all of her sisters.\nYong-Yut’s war-kite was bigger than Timah’s. The satchel with its strange properties of fire and force was also bigger. She held in her hand a large rifle that also seemed equipped with a silver spear.\n“I’m calling them propulsion-satchels,” Yong-Yut said, winking at the question in her sister’s face. She pulled Saengdao closer, attaching Saengdao’s harness to her own harness with a strong, woven rope.\n“There’s a smaller silver spear attached to the inside of your rifle. Do you remember how to shoot that thing?” she asked, giving Saengdao a cheeky grin.\nSaengdao snorted, being the sibling who was the most adept at hunting despite her nervous tendencies. “You know I do, but do we have to resort to violence?”\n“Hopefully not, but it is good to be prepared.”\n“Come on, Saengdao. We shouldn’t waste time.”\nYong-Yut pulled down her goggles to cover her eyes, and Saengdao did the same for her own pair.\nThe Empress’ wooden palace in the sky was the largest amongst all of the floating palaces, and naturally the grandest. Gold inlayed every wood-carved detail of her palace, and the ladders were studded with rubies and chalcedony. The Empress herself sat on a throne that was set so high in the throne room that thirty-six steps curved upward to meet her feet, clad in slippers of gold and jade.\nTimah gazed upon the Empress in awe, wondering if this was the last sight of grandeur she would be granted before they ended her sad life. If so, she was glad to die, she thought. Her dearest wish had been fulfilled. The Empress laughed, and it was not a kind sound.\n“I am assuming this is one of the little spies who kept returning to watch us. Of what race is this one, First Admiral?”\nFirst Admiral was a woman dressed in a simple outfit of teal cotton trimmed with silver and teal songket. She circled the kneeling Timah and then answered.\n“Of Malay-Thai extraction, descended from the apsaras of the Buried Kingdoms. She is one of our very distant kin, Your Imperial Majesty.”\n“One of the little ones we rescued from those accursed Kings?”\n“Yes, Your Imperial Majesty.”\n“They know our rules, and they know the price for our rules. She was caught spying. Shall we behead her, or shall we claim her as tithe?”\nTimah bit down hard on her lower lip so as not to embarrass herself with pleas.\nFirst Admiral paused to look down at her. “She is not without competence, this one, Your Imperial Majesty. We may be in need of more tinkers in the time to come.”\nThe Empress exhaled. It was a long, tired sound.\n“You think we have come to this? Recruiting human tinkers?”\n“It’s worth a try, Your Majesty. We need to protect our palaces beyond what we’ve been doing. The empire of the air grows larger, and our people are no longer united as they once were.”\nCuriosity overcame Timah despite her fear. She asked, “Your Imperial Majesty, I am not fit to kiss the ground beneath your dais, let alone breathe the air you breathe, let alone speak, but may I know why the bunian are at war?”\nThe Empress laughed again, this time a sound of shocked amusement.\n“So, not fit to breathe the air we breathe, but daring to question our actions? So very insincere, little one.”\nFirst Admiral glanced at Timah before looking up at the Empress, “Your Imperial Majesty, perhaps it would be good if her folk knew of what was going on. This impacts them as well. They are, after all, our kin.”\nThe Empress made a dismissive gesture with her hand.\n“Tell her then. It makes no difference what these diluted by-blows know.”\nFirst Admiral bowed in graceful and profound respect.\n“We are not at war, little apsara. But there is a battle happening to determine which of the princesses will be the next Empress.”\nTimah did not understand. The Empress barely looked older than Timah. The Empress met her eyes, a small smile playing about her regal lips.\n“We do not serve as Empress forever, little apsara. After every decade, a contest happens to determine who serves next. This year, things have become rather strained.”\n“Her Imperial Majesty’s daughter won the contest this year. The other princesses claim it was foul play because an engineer died during the contest. They have now mobilized in opposing camps to determine the next Empress,” First Admiral said.\nTimah looked up at the Empress, suddenly realizing that the Empress was very possibly on the losing side of this battle.\n“Why would they call foul?”\nThe Empress shrugged. “It was a technicality. It is not the first time such a thing has happened in our history. Not the first time an engineer has died, even. The violence with which these claims were made, however, is something new. We are growing more dependent on engineering. There was a time when we lived only on the power of sakti, but our connection to sakti grows weak. The world outside of kayangan grows stronger.”\nTimah said, “Your Imperial Majesty, this unworthy being would be pleased to serve and help you in any way at all in this battle.”\nThe Empress shook her head slightly, frowning.\n“What can you do, little apsara? You’re but a tinker.”\nTimah was about to answer when a commotion broke out. She turned to look and saw six armed women bring forward Saengdao and Yong-Yut. They were harnessed to enormous kites that were dragging behind them. They struggled, their faces red, and their necks expanding in an alarming way. The sisters tried repeatedly to claw at the eyes of the bunian guards who pinioned their arms.\n“First apsaras, and now the Khinnaree? Are we to have the entire raggle-taggle survivors of the Buried Kingdom up here in my throne room? Captain Misha, what is the meaning of this?”\n“We found these two Khinnaree harnessed to armed war-kites that flew faster than our garuda, Your Imperial Majesty. We managed to overtake them when the winds slowed, and just before their machines died.”\n“The propulsion-satchels lost power as we gained altitude,” Yong-Yut said to no one in particular, sounding incredibly disgruntled.\n“Khinnaree mechanics and apsara tinkers,” the Empress said, her tone thoughtful, “I am going to need help to understand how such a strange event can come to pass. It is an anomaly, but may be fortuitous.”\nThe Empress’ thoughtful tone came hand in hand with a shining luminescence in her form, which grew until she was an oval of light that hurt the eyes. Timah immediately turned the dial on her goggles to compensate for the light-blindness. She gasped at what she saw.\nThe oval of light seemed to split itself. A bird that seemed to be made of both air and light emerged from the Empress’ form. It floated above the Empress in a delicate way, its movements soft and deliberate. The peace it brought filled everyone in the room.\n“Holy Jentayu,” the Empress said, in a soft, reverent voice, “Give us guidance in this matter. Should we take these children as tithe or should we sacrifice them?”\nThe bird flew down from the throne, coming face-to-face with Timah. The bird was so beautiful that Timah could not bear to look full into the soft brown eyes that fiercely looked into hers. The bird then flew above her, almost gliding in the air, before it reached the two Khinnaree sisters, circling them.\nTimah did not understand the ways of the Khinnaree, but she knew she had angered and hurt Saengdao. She wondered if the Jentayu would know of this. If so, would she be punished?\nThe Jentayu flew back to the Empress. The two of them merged in a brilliant ball of blue light that hurt Timah’s eyes even through her light-blindness setting. She closed her eyes and kept them closed.\nIt felt like a very long while before the Empress spoke. The entire room had descended into a reverent silence. It felt as though even the air had been sleeping until the Empress’ voice woke them up again.\n“You two Khinnaree, come closer. Tell me of how you changed these war-kites.”\n“I found close to two hundred war-kites in one of the armories in the Buried Kingdom, Your Imperial Majesty. I took two of them to work on. I also found the old engineering rooms of the Buried Kingdoms, where they combined minerals and gases to create fluids that could move objects across space. There were many diagrams in the engineering archives that gave instructions. I merely connected that design to the design of the war-kites so that I could fly,” Yong-Yut said, obviously trying to sound nonchalant. However, her eyes were almost shining with the pleasure of sharing what she had achieved.\n“That was very ingenious of you, young Khinnaree. However, it is clear that your mechanical work needs refining. You had the speed, but not the lasting power. The lasting power is that of sakti, which has been keeping our palaces afloat.”\nThe Empress’ expression was inscrutable as she continued, “However, as sakti grows weak, technology must grow strong and evolve. These three denizens of the villages below will be useful in my daughter’s battle.”\nFirst Admiral nodded, her eyes pleased at the Empress’ decision. Timah slumped in relief.\nOn her throne, the Empress surveyed her court with troubled eyes.\nShe spoke, “The Jentayu also said that we must consider these apsaras and Khinnaree as potential candidates for our future armies. She says that we must unite against a common danger in the future. We cannot merely be a city of bunian any longer. As the world outside of our kingdoms grows, our forests and our dominions will decrease. We will need to fortify ourselves.”\nTimah wondered what that common danger could be, but she was too overcome with relief to dwell too long on the subject, too overcome to notice the sounds of anger and conflict that swept over the close to two hundred bunian that thronged the huge throne-room in the sky.\n“Take them away to be outfitted and trained. I am weary and must retire,” said the Empress.\nTimah stood up and made to run toward Saengdao. She stopped mid-stride at the cold look Saengdao gave her. Saengdao shook her head and turned away. The two sisters left with the armored guards.\nTimah did not even bother to deny the hollow feeling within her. It was a feeling that would be her constant companion ’til the end of her days.\nFirst Admiral had placed both the Khinnaree with an aerial defense engineering unit to be trained, while taking Timah to the floating annex for civilian engineers. One of the pavilions had been converted into a practical workshop, filled with bunian engineers, their elegant limbs encased in overalls made of kain pelekat.\n“This is where we work on refining our machines, merging the powers of the elements to create new war-engines and ways to keep our city afloat and invisible,” First Admiral said, “We are trying our best to develop new technology to keep the palaces not just afloat, but to keep them hidden.”\n“I do not know how I will ever be useful to beings so much more intelligent than me,” Timah said, self-conscious and shy. She was overcome with the brilliance and competence displayed by the bunian engineers at work. Her eyes hungered for the machines they were building.\n“You are here to learn. You are not useful to us, yet. But you will be.” First Admiral said. Her voice was not unkind. “The Empress always looks further into the future than any of us—this is what happens when you are connected to the Holy Jentayu.”\n“Am I not here to help with the battle between the Empress’ daughter and the other princesses?”\n“That battle was lost before it began, child. Our story is about to change. Yours is only just beginning. Learn, for you will be the future of this Empire. All of you.”\nTheir food was served on bronze platters so grand that the two Khinnaree were shy.\n“Your harnesses brought us to a different world, sister,” Saengdao said to Yong-Yut as they were fed piles of glutinous rice with shredded mango salad.\n“Yes, my harnesses worked. But there is much to be done before the war-kites can be made useful in battle. I have much to do with the aerial defense engineering unit.”\nSaengdao looked happier and calmer than she had been for a very long time. Nevertheless, her eyes seemed uncertain.\n“Will you teach me, sister? I want to help. I am not smart like you, but I can do what needs to be done.”\nYong-Yut laughed. “Not smart, Saengdao? You always think less of yourself than you deserve. Perhaps asking you to be Timah’s nursemaid was not one of Mother’s better decisions. You may well prove to be the smartest of us all, Saengdao. This is a whole new world for us.”\nSaengdao nodded her assent, staring at the clouds from the open doors of their floating pavilion. During their flight in the sky, moments before they were apprehended, Saengdao has seen the world stretched out before her and felt the rush of knowing instinctively how to keep the propulsion satchel going. She felt as though the hot rage that had engulfed her had transformed her into a different person. Her mind, so sluggish and ready to take instructions before, had turned into something else.\nShe was unsure if she knew what that thing was, but she was very sure that she never wanted to be in the vicinity of one who had willingly cast her in a subservient role for most of their life. Some friendships had to die so that some lives could begin.\nTimah never saw her home again.\nThirty years later, the floating palaces had twenty war-kite squads of six equipped Khinnaree each, patrolling in shifts to protect the floating palaces, or the parts of the floating palaces to which they were assigned. Internecine wars became a trend amongst the bunian princesses. There were neither Khinnaree nor apsaras left in the villages below. Her bare feet forgot the feel of grass and the sweet dampness of forest herbs. Some days, she still saw the owl-women. One or two of them would fly high enough that they reached the floating palaces before they would be swept away by the wind or captured by the war-kite patrol units.\nTimah would see Admiral Saengdao harnessed to her violet war-kite more than once as she patrolled with her sisters, flying in stately aerial formations. Admiral Saengdao’s uniform was a rich lavender songket, adorned with the silver accoutrements of her rank. She laughed as she worked, sounding far more lighthearted than the Khinnaree who had grown up with Timah.\nTimah worked on the machines and propulsion satchels pioneered by Admiral Yong-Yut at the Avian Defense Engineering Unit for civil engineering purposes, keeping their homes afloat and equipped with the wherewithal to stay protected and invisible. The Khinnaree, on the other hand, worked on refining the war-kites so that more Khinnaree could be outfitted. Timah saw the Khinnaree flying past her workshop on a daily basis, harnessed to their war-kites.\nTimah was kept mostly to her workshop when she was not summoned to court for new directives from the next two Empresses who came into power after the Empress who had taken her in had been murdered in her sleep by her daughter’s rivals.\nThe war-chariots of the past were never spoken of again. Arch-Admiral Yong-Yut had ordered for the immediate destruction of any war-chariot found in the ruins of the Buried Kingdom.\nThey remained only to haunt Timah in her dreams and in her moonlit vigils against the demons of self-defeat.\nNin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee.", "source": "https://clarkesworldmagazine.com/harris_09_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Every Plumage, Every Beak by Nin Harris"}