{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "R8BqhG0iOr1fSU45QZEQU0qk/mA=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Sapient Animals and Memory Particles: A Conversation with Lawrence M. Schoen  Life, death, and prophecy are common themes. When an author approaches them from a new angle, it’s like seeing a familiar photograph with a fresh set of eyes. In the case of Lawrence M. Schoen’s new novel, we get to see through a fresh set of animal eyes.  Barsk: The Elephants’ Graveyard was recently released from Tor Books and features a universe full of anthropomorphized animals, interplanetary politics, psychoactive drugs, and memory particles. Jorl, an elephant, must speak with a dead friend to unravel the secrets behind his homeworld’s number one export, a drug called koph. Meanwhile, a prescient child who should not exist and feels no pain becomes privy to a disturbing future. An incredible array of sapient animals vie for a monopoly on koph and it threatens the already uneasy balance of the galaxy.  Lawrence M. Schoen holds a PhD in cognitive psychology, has been nominated for the Campbell, Hugo, and Nebula awards, is an authority on the Klingon language, and operates the small press Paper Golem.   How did your experience in psychology factor into your creation of Nefshons, or subatomic particles of memory?  Quite heavily, actually. Most people tend to think of “memory” as a single thing, but as any cognitive psychologist will tell you, there are many different kinds of memories. The memory you have for some bit of information that you could look up online is very different from your personal memory of having done a thing, a distinction we might describe as encyclopedic rather than episodic.  Memory for names and faces are vastly different from other kinds of memories, as are the memories of how to do thing (like ride a bicycle or play the piano). And the memory for past actions (such as reading Barsk) is different than your memory of things you intend to do but haven’t gotten to yet (like order a copy of Barsk as a gift for a friend). And on and on, many additional kinds that all of us take for granted. Some of those types of memories are encoded in my fictional particles, the nefshons, most of them are not. Knowing which are which was key.  Has writing Barsk changed the way you think about memory?  It codified an idea I have about what it means to be an individual, that each of us can be described as a highly organized network of unique memories, a complex web of information that can, potentially, live on long after our physicality has run its course. More specifically, this was a way of conceptualizing immortality that really resonated for me. I can’t accept that death is truly final.  What are some of the challenges of anthropomorphizing animals?  For me the balance was in incorporating researchable characteristics of social behaviors and other patterns associated with the various species, and mapping them onto recognizable human behaviors. Basically, acknowledging that uplift isn’t simply about making animals talk, but about blending two different types of being into a workable and consistent whole.  How did the spiritual elements impact the worldbuilding?  The best answer to this is probably “vaguely.” A major portion of the book involves a drug and a technique that allows some people to effectively speak with the dead. My wife insists that a person’s nefshon construct is a fancy way of talking about their soul, but I stopped short of actually saying that in the book. As presented, it’s all just a blend of physics and psychology, and on Barsk it’s not as exotic as on other worlds because so many more Fant have had access to the drug. It’s more like the early days of telephonic communication when maybe one house in a neighborhood would have a phone and getting a call from a distant relative was a pretty big deal. Except in this case, that relative is dead.  If you had to be a species of animal existing in the Barsk universe, which animal would you be?  As you might imagine, I get this question a lot. I’m biased, because I think the Fant are very very cool, but I don’t know that I’d be able to endure their isolation from the larger galaxy, their preference for simplicity over technology, or the inherent intolerance of their situation. As a runner up—and I’m looking forward to developing more details with them in future tales—I think the Prairie Dogs are pretty compelling. I envision them living on mixed worlds where they’ve built elaborate underground cities amidst the surface cities of other races.  Has running a small press prepared you for publishing with one of the larger companies?  Not at all. The difference between small press and big press is not simply a matter of size. Rather, it’s one of complexity at every level and every stage of the process. More people are involved in every decision, and as a result every aspect of the thing takes longer. Plus, the resources at the command of a big press completely change the range of possibilities open to a book. It’s a beautiful thing and one that I’m very grateful to be experiencing with Barsk.  What is the day-to-day like at the Klingon Language Institute?  I like that people have an image of a physical place, as if there was an actual campus somewhere (and indeed, a professional artist once contacted me, came out to the college I was teaching at, and used it as inspiration to paint the representation of just such a facility). But the cruel reality is that in physical terms the KLI is a post office box about a mile from my house that I check once a week. Admittedly, a vast portion of my basement is filled with endless racks and bookshelves of Star Trek and Klingon memorabilia, books, videos, newspaper clippings, recordings of interviews, back issues of thirteen years of our quarterly journal, and the prosthetic head of Mark Lenard from his role as the first man to actually speak the language.  That said, all the real work goes on behind the scenes by a team of volunteers, generously donating their time and energy and expertise, and manifests in daily updates, additions, and changes to the website www.kli.org, which I’m happy to say is one of the oldest, continuously running websites in the world!  What other projects do you have in the works?  I’m still writing tales in my light and humorous series about the Amazing Conroy and his alien companion animal, Reggie.  I’m also working on a new Fantasy series about the spirits at the heart of cities as the source of humanity’s civilization, one that asks the question what happens when some of these spirits choose to stand in the way of their own development and thus ensure the status quo rather than allow themselves and humanity to continue to evolve.  And finally, I’m far from done with Barsk and the larger universe I’ve created for the Fant and the other races of the Alliance. I’ve already turned in proposals for what I see as the next two books in the series, continuing the story of both Jorl and Pizlo, but the possibilities after that are wide open.  Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nSapient Animals and Memory Particles: A Conversation with Lawrence M. Schoen\nLife, death, and prophecy are common themes. When an author approaches them from a new angle, it’s like seeing a familiar photograph with a fresh set of eyes. In the case of Lawrence M. Schoen’s new novel, we get to see through a fresh set of animal eyes.\nBarsk: The Elephants’ Graveyard was recently released from Tor Books and features a universe full of anthropomorphized animals, interplanetary politics, psychoactive drugs, and memory particles. Jorl, an elephant, must speak with a dead friend to unravel the secrets behind his homeworld’s number one export, a drug called koph. Meanwhile, a prescient child who should not exist and feels no pain becomes privy to a disturbing future. An incredible array of sapient animals vie for a monopoly on koph and it threatens the already uneasy balance of the galaxy.\nLawrence M. Schoen holds a PhD in cognitive psychology, has been nominated for the Campbell, Hugo, and Nebula awards, is an authority on the Klingon language, and operates the small press Paper Golem.\nHow did your experience in psychology factor into your creation of Nefshons, or subatomic particles of memory?\nQuite heavily, actually. Most people tend to think of “memory” as a single thing, but as any cognitive psychologist will tell you, there are many different kinds of memories. The memory you have for some bit of information that you could look up online is very different from your personal memory of having done a thing, a distinction we might describe as encyclopedic rather than episodic.\nMemory for names and faces are vastly different from other kinds of memories, as are the memories of how to do thing (like ride a bicycle or play the piano). And the memory for past actions (such as reading Barsk) is different than your memory of things you intend to do but haven’t gotten to yet (like order a copy of Barsk as a gift for a friend). And on and on, many additional kinds that all of us take for granted. Some of those types of memories are encoded in my fictional particles, the nefshons, most of them are not. Knowing which are which was key.\nHas writing Barsk changed the way you think about memory?\nIt codified an idea I have about what it means to be an individual, that each of us can be described as a highly organized network of unique memories, a complex web of information that can, potentially, live on long after our physicality has run its course. More specifically, this was a way of conceptualizing immortality that really resonated for me. I can’t accept that death is truly final.\nWhat are some of the challenges of anthropomorphizing animals?\nFor me the balance was in incorporating researchable characteristics of social behaviors and other patterns associated with the various species, and mapping them onto recognizable human behaviors. Basically, acknowledging that uplift isn’t simply about making animals talk, but about blending two different types of being into a workable and consistent whole.\nHow did the spiritual elements impact the worldbuilding?\nThe best answer to this is probably “vaguely.” A major portion of the book involves a drug and a technique that allows some people to effectively speak with the dead. My wife insists that a person’s nefshon construct is a fancy way of talking about their soul, but I stopped short of actually saying that in the book. As presented, it’s all just a blend of physics and psychology, and on Barsk it’s not as exotic as on other worlds because so many more Fant have had access to the drug. It’s more like the early days of telephonic communication when maybe one house in a neighborhood would have a phone and getting a call from a distant relative was a pretty big deal. Except in this case, that relative is dead.\nIf you had to be a species of animal existing in the Barsk universe, which animal would you be?\nAs you might imagine, I get this question a lot. I’m biased, because I think the Fant are very very cool, but I don’t know that I’d be able to endure their isolation from the larger galaxy, their preference for simplicity over technology, or the inherent intolerance of their situation. As a runner up—and I’m looking forward to developing more details with them in future tales—I think the Prairie Dogs are pretty compelling. I envision them living on mixed worlds where they’ve built elaborate underground cities amidst the surface cities of other races.\nHas running a small press prepared you for publishing with one of the larger companies?\nNot at all. The difference between small press and big press is not simply a matter of size. Rather, it’s one of complexity at every level and every stage of the process. More people are involved in every decision, and as a result every aspect of the thing takes longer. Plus, the resources at the command of a big press completely change the range of possibilities open to a book. It’s a beautiful thing and one that I’m very grateful to be experiencing with Barsk.\nWhat is the day-to-day like at the Klingon Language Institute?\nI like that people have an image of a physical place, as if there was an actual campus somewhere (and indeed, a professional artist once contacted me, came out to the college I was teaching at, and used it as inspiration to paint the representation of just such a facility). But the cruel reality is that in physical terms the KLI is a post office box about a mile from my house that I check once a week. Admittedly, a vast portion of my basement is filled with endless racks and bookshelves of Star Trek and Klingon memorabilia, books, videos, newspaper clippings, recordings of interviews, back issues of thirteen years of our quarterly journal, and the prosthetic head of Mark Lenard from his role as the first man to actually speak the language.\nThat said, all the real work goes on behind the scenes by a team of volunteers, generously donating their time and energy and expertise, and manifests in daily updates, additions, and changes to the website www.kli.org, which I’m happy to say is one of the oldest, continuously running websites in the world!\nWhat other projects do you have in the works?\nI’m still writing tales in my light and humorous series about the Amazing Conroy and his alien companion animal, Reggie.\nI’m also working on a new Fantasy series about the spirits at the heart of cities as the source of humanity’s civilization, one that asks the question what happens when some of these spirits choose to stand in the way of their own development and thus ensure the status quo rather than allow themselves and humanity to continue to evolve.\nAnd finally, I’m far from done with Barsk and the larger universe I’ve created for the Fant and the other races of the Alliance. I’ve already turned in proposals for what I see as the next two books in the series, continuing the story of both Jorl and Pizlo, but the possibilities after that are wide open.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/schoen_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sapient Animals and Memory Particles: A Conversation with Lawrence M. Schoen by Chris Urie"}