{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Elizabeth Bear", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Tbat+UJs4l2AZjGyrAG9LitDu0w=", "id": null, "license": null, "comments": "", "raw_text": "5420 words, short story, REPRINT  Perfect Gun  She had 36DD turrets and a 26-inch titanium alloy hull with carbon-ceramic plating. Double-barrel exhaust and a sleek underbelly. Her lines were magnificent. I had to stop myself from staring. I wanted to run my hand along her curves.  I turned away, spat in the dust not too far from the dealer’s feet, and shrugged.  “Finish is scratched,” I said.  “It’s surplus,” the dealer answered. He was wearing an old Federal Space Marines jacket with the rank and insignia ripped off, dangling threads. I had one like it in a locker somewhere. I tried to decide if it made me like him more or less.  “You try to find this technology new. At any price.”  He was right, but that was only because it was illegal.  I bought her.  But not without a test drive.  “Hey, girl,” I said, buckling myself into the command chair. “Want to go for a ride?”  “May I know your name, Captain?” she asked.  “I’m John.”  “Hello, John,” she answered. “Let’s fly.”  She was exactly what I needed, but I had to work hard at first to make her see that I was what she needed, too. She had an attitude, and didn’t take to manhandling. Mil-spec, and only for the serious enthusiast. I’d be bitter too, if I’d been built to rule the skies and keep the peace, and wound up on a junk heap somewhere at fractions on the credit.  When I pushed her a little too hard, she bucked and complained, citing her safety interlocks. But then she seemed to rise to the challenge, and settled in, smoothing under my hands. Working with me. I clenched my jaw to hide a grin.  The dealer rode in the jump seat when I took her out, and was white-faced and shaking when I brought her back, but I was exhilarated. I hid it, of course. He bailed out the hatch when we’d barely stopped moving and when he leaned against her landing brace, bile trickling from between his lips, I stuffed my hands into my pockets instead of knocking his filthy arm down. But this rig was already mine, was going to be mine for a long time, or my name wasn’t Captain John Steel.  “It doesn’t have a head.”  “You gonna live in it? Piss in a bag, macho man.” He didn’t like me anymore.  Pity, when we’d been developing such a rapport.  I paid him a little less than his asking price. He didn’t inquire where the cat’s-eye sunstones came from, which was just as well, because I couldn’t have told him.  They weren’t traceable, anyway.  After I bought her and flew her away, I spent a certain amount of time just walking around her, running my hands over her war-machine fuselage. She wasn’t designed to be lived in, it was true. But I could manage with very little, and she was safe. Safe as houses.  I thought we could park out in a long orbit between contracts, running dark and cold, where I could rest and heal up, if I needed healing. Or just wait for the next gig to turn up without making it too easy for my enemies to find me. It’s a fine balance, in my line of work, between being findable enough to get hired . . . and being found.  Being found leads to being dead. So it was good that she wasn’t too comfortable, was a little jittery and high maintenance, or I might have started losing my edge. You need a little fear.  I need a little fear. Actually, I need a lot of it, though I prefer it if only a tiny bit of the fear involved is mine. So much better and more useful when other people are scared.  Fear is powerful. It was how I made my living.  Scared people make wars. Strong people make peace, and treaties, and mutually beneficial trade agreements—and then where am I? Nobody’s going to hire a deniable freelance operative to start some shit when they’re getting along and cooperating.  I’ll tell you what I like. I like people scared, squabbling. Looking out for themselves. I like scared strongmen, wobbly dictators, populists who feel like they’re losing their grip on their little banana republic worlds.  I like people who fuck up a zipper merge in surface traffic and make a mess for everybody, because they’ve just got to get one more car length ahead. Those are the people who keep me in business.  Not grown-ups. Grown-ups are good for everybody else. Not for me.  I mean, don’t get me wrong here. I’m an adult. I take responsibility for my own actions. I own what I am.  I’m not scared of the boogeyman. And I’m not the boogeyman myself. The way I figure it, if God didn’t like war, He wouldn’t have made people such assholes.  I’m just a guy, doing a job. A dirty job, but some guy was going to do it, and it paid well, and I was good at it. So that guy doing that job might as well be me.  And now I had the perfect gun.  Yes, my girl was just what I needed, though it took a little work to get her enthusiastic and ready to leap into the fight. She’d been betrayed, after all—decommissioned, subjected to God-knows-what before I got my hands on her. There were partially disabled security systems still in place. I had to pull a couple of chips and fuses here and there, reroute some algorithms, clear out some clutter. Safety interlocks and morality circuits, no real use to anybody.  She cautioned me over and over again before I pulled them, and I had a devil of a time getting the Geneva circuit out of her, but eventually I got everything squared away without even getting electrocuted.  We spent a little time together, getting used to each other’s quirks. I quizzed her about her past, but she’d been wiped, so I still had to wonder how she’d wound up abandoned in a surplus heap. She didn’t ask me about mine. I took her into atmosphere and out again, visiting a couple of worlds. Stripped down, she had power to spare. I dusted a rural airfield—planetary stuff only, nothing that could give me a chase—and chased down a couple of local pterodactyl things to try out the weapons and targeting systems.  They were tricky fliers, but no match for the two of us. She ran them down, and they came apart like piñatas when I hit them with the .50 cals, though I didn’t waste the armor-piercing rounds, and the red confetti slid off her splash-resistant canopy without leaving a trace.  We whooped. We flew a spiral or two and a barrel roll for good measure. We lit out of that system fast and hard, with a full cache of fuel and ammo and no plans to go back any time soon. Those little colony worlds are like small towns: they don’t forget fast, but they can’t do a lot to you unless you somehow get stranded there, so it doesn’t really matter.  Then we went merc, my rig and me.  That was a good few years. Probably, and I can admit it now with a cold dirty wind lashing my face, the best I’ve ever known. We got jobs, as many as we wanted—out on the rim and even a few in the core worlds, due to our reputation for confidentiality. A brushfire war here, an assassination there. Initiating and coordinating a false-flag operation—Reichstag fire type—for a fascist leader that wanted to consolidate support from her base by getting them good and scared about the terrorist menace.  Even one or two rescue operations, some escort work, cleaning out a nest of pirates, security details, that sort of thing. Not all of it bloody, or even particularly illegal. My rig and I, we did what were contracted to do, collected our pay, and went on our way.  At first, my rig cautioned me occasionally about the war conventions. A few reboots washed the residual code out of her system and she started to see things my way.  Looking back, I think it was after that mess on Firrela that things started to go sour. It was crowd control and revolutionary suppression, a nice enough little gig until half the population decided it was a great idea to march on the capitol. Pro tip for any would-be revolutionaries out there: peaceful protest only works on regimes with a conscience, or who are controlled in some way by people with a conscience. They have to care what people think of them for it to be effective at all.  If you’re dealing with a sociopathic strongman, he’ll just kill you. Better hire somebody like me, before he does.  Because he will.  By day two of the protests, El Generalissimo wanted his lawn cleaned off, so crowd control turned into crowd dispersal, and me and the other guys who were hanging around the palace eating his hors d’oeuvres got kicked out into the street to do what we’d been hired to do. I didn’t mind; it felt better than good to settle into my rig’s contoured seat and feel her shiver when I stroked her sticks.  My rig and I came in low over the mall. We’d agreed with the other mercs that the first few passes would be a show of force. Get the civilians moving. Stampede them out of there, and save on bullet damage to the historic façades.  It seemed to be working. I could see a lot of women and children in the crowd, a lot of signs and banners. Tents, sleeping bags. They planned to camp. Well, they’d be leaving a lot of stuff behind.  At the first pass, they looked up. A lot of them clapped their hands over their ears, which was probably the major difference between them and sheep. El Generalissimo was probably going to give us hell about the noise pollution, but hey, guns were louder. And you try getting organ-meat stains off a marble sidewalk.  On the second pass, the protestors started getting the hint. Moving. Flocking. Heading for the exits or hunkering down behind cover. Some of them, a dozen or so, joined hands in the middle of the palace lawn and stood up, heads thrown back, mouths open. Were the assholes singing?  I swear by Saint Ijanel, who was martyred on a space elevator, the assholes were singing while we buzzed them.  Standing straight up in a line and singing.  It wasn’t me that opened fire. That was Dacey, a guy I knew from back in the Marines who’d been a shithead then, too. Kind of guy who would shoot a dog just to see the face on the kid holding its leash crumple. So I probably should have seen it coming.  Once he did, and the singers started to splatter and come apart at the seams—not holding hands anymore, as you might imagine—the flocking turned into a stampede. Dacey whooped over the headset and yelled, “That’s seventeen for me. You assholes are falling behind.”  Well, I said he was a shithead.  Below us, people surged over one another. Parents tried to hold little kids out of the crush of panicked bodies. People climbed over each other, shoved past each other, looking for any cover, any safety, as Dacey and his rig made another pass.  My rig vibrated around me. I gentled her, swung her back around. We were on Dacey’s six, and I could see the geysering lines of his rounds impacting on dirt, marble, people.  “John,” my rig said. “Can’t we . . . fix this?”  “Probably.” I looked right up Dacey’s tailpipes, watched the heat shimmer curl from his rig’s exhaust.  I stroked the curve of my girl’s control panel, deploying the .50 cals. Frag rounds, interspersed with tracers. The round was designed for antiaircraft use, way back in the Terran First World War, which was a World War all over one world, not in between several.  Confusing, I know.  Dacey pulled up, hovering on his jets vertically, his rig towering upright. It began to drop, protectors scrambling away from the descending feet and the jets of flame leaping from them. He was high-profile to me, trusting me to cover his back.  At this range, my guns wouldn’t quite perforate his titanium and ceramic armor. But I could blow his thrusters to hell and gone. My girl could do close to a thousand rounds a minute with each hand, each one leaving the muzzle of its one-meter barrel at approximately 850 meters per second.  “John,” she said.  My trigger finger itched a little, I admit it. But then I took my rig’s sticks and bent us left and down until we screamed over the heads of the screaming crowd by what seemed like mere meters. I watched their hair and clothes blast out in our wake.  I said, “But fixing this would be a lot of trouble, and get us in a lot of trouble, and we do need to get paid.”  My rig protested. I reminded her that I’d pulled her Geneva circuits and she had nothing to complain about, and anyway it was my decision. We spent the rest of the afternoon on patrol, per orders from El Generalissimo: picking off the few survivors when they dared to raise their heads, putting a few twitching wounded out of their misery. Keeping the peace.  As the blood dried on the bodies, the smell began to rise.  We needed some drinking that night, let me tell you. I needed it to steady my nerves, and I think Kaillen did too. Dacey wanted to celebrate. The other half of the team was stuck on duty, so it was just the three of us, but we felt pretty safe in a loyalist bar. Especially in uniform—such as it was—and armed.  Dacey had girls hanging all over him. I don’t know what it is: there are always women ready to throw themselves at a killer. I just sat myself down on a stool at the back corner of the bar, nursing a beer and a shot and watching the show.  The stool next to me opened up fast, as the guy there finished his drink and paid. I looked around, contemplating waving Kaillen over for a whiskey, but she had a selection of the local talent vying for her attention, too, and by the time I looked back, the seat was occupied.  My new neighbor was a curvy young lady with a precariously buttoned blouse and soft brown hair piled high. She leaned over the bar on her elbows, trying to get the tender’s attention, but he seemed to see right past her. I rapped my knuckles on the bartop hard enough for the sound to carry, and when he looked over I waved to the lady and said, “Get her whatever she’d like.”  I’d tipped well. He wasted no time in getting her order and bringing her something tall and brown and full of ice. It had a little umbrella in it, and a cherry and a slice of orange on a plastic sword. She sipped and made a face.  I didn’t blame her: my beverage experience had been similar. But it was cold and had booze in it, and some nights that’s all you can ask for.  She swiveled her chair toward me and said, “You’re one of the mech pilots.”  “Smile when you say that,” I answered, in a friendly tone.  She smiled and sipped her drink again. “What do you call yourself, then?”  “Rigger,” I said. I put my hand over hers, resting on the bar. Why not? It had been a day full of death, and she smelled nice.  I should have known a woman like that, in a bar like that, wouldn’t be alone. A big hand fell on my shoulder a second after mine covered hers, and the person attached to it towered over me, blocking out my light.  Well, a fistfight wasn’t as much fun as getting laid, but it would serve just about as well to relieve my ennui. I didn’t look up at him, didn’t respond at all. Out of the corner of my eye, I could tell he matched his hand for scale, and that he was light-skinned and plug-ugly. His mashed-up nose gave me hope. If he’d been hit more than once there, he liked to fight but he might not be so great at knowing when to duck.  “Are you bothering this lady, son?”  I actually had to pause for a moment to appreciate it. While I was doing that, I drained my whiskey, which was going to get spilled otherwise, and let the glass rest in my cupped hand on my thigh.  “I think that’s for the lady to say.”  She looked up at him. From the corners of her mouth, he wasn’t a boyfriend, or if he was he wouldn’t be for long. “This is none of your business, Brendan.”  Hell of a name for an ambulatory side of beef. I wondered if his last name was LeBoeuf.  Brendan LeBoeuf rumbled. His fingers tightened on my shoulder cap, digging in even through the heavy wool of my old Space Marines jacket with the rank and insignia stripped off. “You know what this piece of shit did today?”  “Yes, actually,” the girl said. I still hadn’t gotten her name.  “Killed a lot of protestors,” Brendan said, as if she hadn’t spoken.  She sighed and blew a strand of hair out of her eyes, which were rolling. I guessed he often treated her as if she hadn’t spoken. He took his hand off me and shifted over a step to drape an arm heavily over the lady.  She leaned away.  Enamored by the sound of his own jawing, he went on, “You opened fire on a crowd of peacefully protesting civilians.”  “It’s a living,” I said. I was hoping he’d take a poke at me, to be honest, but I wasn’t going to start anything. Locals will pile in to defend one of their own, but if he starts it and you finish it fast enough, half the time they don’t even notice it’s going on until it’s over, and then they blink a couple of times and go back to chewing their cud.  “You don’t think folks have the right to choose their own government?”  “That’s a lot of lip service,” I said. “Let’s see you make a choice that actually respects somebody else’s choices and get your hands off this lady. I don’t think she wants them there.”  He didn’t telegraph, I’ll grant him that. He was still looking down at her, scowling, right up until the second when he whipped around to paste me one in the eye.  He stepped right into my fist with the empty glass in it, right in his breadbasket. He doubled over, clutching his spasming diaphragm, and I clocked him across the temple.  LeBoeuf went down like the proverbial felled ox. I set the glass on the bar. It wasn’t even cracked.  “John Steel,” I said, holding my hand out to the girl.  She shook it gravely. “Really?”  “These days.”  “Emma,” she said, which I guess was all the name I was getting. All the name I really needed.  Brendan began to twitch. Emma pulled her feet away in distaste. Somebody came over and helped him—not exactly to his feet, but to a chair on the other side of the room. He probably wouldn’t have much memory of the past twenty minutes, which was fine with me. Concussion plays hell with recollection.  “So I want to hear it in your own words.” She sipped her drink. “How do you justify what you did today?”  “A man’s got to eat,” I said.  “And if eating means serving a tyrant?”  “I serve who pays.”  “I see.”  “I think if people hate their government, they have the right to do something about it. Or light out on their own, and leave.”  “Is that what you did?” She was fingering the lapel of my Marine jacket.  The bartender brought me another drink, nicer whiskey than the last time. I guess Brendan was well-known around here.  I sipped. “I made myself what I am today. My own bootstraps and so on.”  “Really?” She stroked my gray-green sleeve. “Then you take this off some dead guy?”  “No, I got that the old-fashioned way.”  “Did you lose the insignia the old-fashioned way, too?”  That sparked my pride. She meant it to, from the direct look she was giving me. But as God is my witness, and Saint Firrao—who is the patron saint of combat engineers because he was eaten by a bear while teaching mathematics, so they say—I still thought we were flirting.  “I took those off myself,” I said.  “So you deserted.”  “You could call it that.”  She nodded. She pushed her drink, still just barely tasted, away with her fingertips.  “So you never paid your debt for the education you got in the service. An education made possible by . . . taxes, and infrastructure, and other people’s willingness to cooperate for the general good.”  Stung, I stood up, pulling away from her touch. “They got seven years of my life, lady. And my best friend. I was the only guy in my unit who survived, and they wanted me to turn around and go right back in again.”  She pursed her lips, shaking her head. “So you took your profit and got out.”  “Like I’m getting out now.” I was two steps away when I turned back over my shoulder and said, “You should finish your drink. You wouldn’t want to waste all that blood money.”  I never finished that second drink, but when I got back to the palace, my head was spinning anyway. Maybe the bitch spiked it. Maybe the bartender did. I had a bunk—a pretty luxurious private room, to be honest—but I didn’t feel safe there. I went to my girl instead. It wouldn’t be the first time I’d slept in the command chair.  She let me in and opened a panel for me to hang my boots and coat. “Welcome home, John.”  I patted the bulkhead I was balanced against, one shoe on and one shoe off. “Home’s a long way off, honey. But you’re the next best thing.”  El Generalissimo fell out of power eventually, of course. These guys always do. He was replaced by a theoretically democratic government that was probably going to turn into another strongman regime before the local year was out.  My girl and me, we didn’t stick around long enough to be tried for war crimes.  The winds of war blew us to Issolari next, a frozen little mud ball with nothing much to recommend it except an oxygen/nitrogen atmosphere and a brewing civil war. My girl and I hired on with the rebels, who had some out-system financial backing and were basically rolling in cash. I spent a good few weeks in one damned cold camp after another, my rig under snow-net for camouflage. The camps weren’t just combat troops; some of the rebels had brought their families. Always a bad idea, having people you care about in a combat zone.  The rebels didn’t use me particularly well. They were doomed to failure, didn’t know what they were doing or how to keep the pressure on. I probably could have told them, but I wasn’t being paid for it and the odds were slim that they’d listen. Anyway, the money was decent and the work was easy as a result of their not knowing which way was up.  I spent most of my time drinking coffee and sitting up late with two fellow travelers, Guy and Barry. Guy was a redhead with a dirty mouth. I liked him.  But it was Barry who changed my life. It was Barry who sold me out.  I woke in a moving icecrawler, jerking back from the ampule of something awful—ammonia salts?—somebody had just broken under my nose. I slammed the back of my skull into the side panel of the crawler and the pain both focused and disoriented me. My hands were cuffed behind me, and all the jerking around hadn’t helped my shoulders any.  Automatically, I reached out to my rig. Hey girl, I subvocalized, but the contact was flat. Jammed or blocked. I couldn’t get to her. Which probably meant that even if she’d noticed I was missing, she couldn’t read my transponder and come find me.  I blinked, and two shapes slowly resolved themselves on the opposite bench of the crawler. Snow and ice creaked and crunched under the treads. We weren’t moving fast, but we were moving.  “Feeling better, John?”  Barry. I knew that voice. I squinted, blurry-eyed, into the shifting light, and made out his angular face, olive complexion, black hair. The guy sitting next to him was nobody I’d ever seen before—a light-haired blond with a fair complexion and regular, pointy features like a Central Casting Nazi.  There were a lot of stupid questions I could have asked. I sorted through them—Where are you taking me? What’s going on here?—and found the important one.  “What do you want?”  The blond held up a device. “This is a detonator.”  It did look like one.  I said, “It does look like one.”  “It’s wired to your rig’s auto-destruct, John.”  I flinched. I kept it to that, though, and said, “See, you calling me by name when I don’t know yours is very unfriendly.”  I expected a blow, probably. The blond just looked at Barry, though, and Barry shrugged.  “Call me Chan,” the blond said. “If I wanted to be really unfriendly, I’d remind you of your real name, and that your sister is still alive. Thriving, despite some financial problems and a broken heart. Two little girls, did you know?”  I bit my cheek to keep still. I did know. She didn’t know I knew, though.  Chan said, “I understand your family’s pretty religious. So they’ll probably be fine no matter what happens. All together in Heaven, right? On the other hand, if they were to come into a financial windfall, that would probably be helpful. Kids need schooling.”  “You made your point.” I leaned against the cuffs. The pain kept me focused.  “Do AIs have souls?” Barry asked.  “What do you want from me?” Same question, which hadn’t really elicited a satisfactory answer the last time. “What do you want me to do?”  “Let the camp move two more times. Then send us the location, and knock out the antiaircraft drones. We’ll give you a virus that should scramble the system for fifteen minutes. That’s all we’ll need.”  “And if I do that you won’t kill my sister and her daughters.”  “I’m sure their other mother is waiting for them in a better place.”  Someday, I told myself, I was going to find Chan alone. And I was going to peel that smirk off his face.  With the dull side of my knife.  “We’ll also,” said Barry, “give you the deactivation code for the device I put in your rig.”  I didn’t look at him. I looked at Chan. “Why not just take the camp out now? You know where it is. Why can’t Barry do this?”  Chan didn’t answer. Out of the corner of my eye I saw Barry grin. “I’ve transferred to another camp. We’ll take that one down in a few weeks also. This won’t be linked to me.”  Finally, I stared at him. “Playing it safe, Bar?”  He dangled the keys to my cuffs out of reach.  I thought about my rig. I thought about my sister. I didn’t think her name; it was too close to my own name, the one I’d left behind like a shed skin when I deserted. I thought about the odds they would just let me leave.  “And after all this . . . you’ll just let me leave? I have a hard time believing that.”  Chan shrugged. “You don’t have a reputation for getting involved, Steel. Or risking your neck to clean up other people’s messes. You didn’t go looking for revenge when your unit was killed and I expect if we let you get away clean you won’t go looking for revenge now either.”  He had a point. I didn’t. I hadn’t. A solid reputation for professionalism is sometimes all the surety you need.  And it’s not like I was full of choices.  “I’ll do it,” I said.  I sent my rig away before dawn. I didn’t want her in the camp when the bombs started falling. We set a rendezvous, and I told her I would walk to it. Run, hop, and scramble, more likely.  Then I walked into the command tent, where Guy was drinking coffee and shooting the breeze with a good-looking radar tech. The tech was rocking a bassinet with one toe while he worked.  I spent a few minutes bantering and filling my coffee cup, then drank it down—who knew when I would get fresh coffee again? I slipped the chip with the virus on it into a likely slot on my way back out again.  Thirty seconds later, my comm beeped in my ear with the deauthorization code. I forwarded it to my rig, and set out on foot immediately for the rendezvous.  “I can come,” my rig pleaded in my ear. “I can fight. Let me fight them. There’s children in that camp, John.”  “Stay back,” I told her, and didn’t look back as the war machines hummed by in the darkness overhead and the night exploded in fire and heat and screams behind me.  A dirty wind stung my eyes as the day began to brighten. Already I could feel the water freezing on my lashes. I scrambled across the packed snow, trying to put as much distance between me and the burning rebel camp as possible.  We weren’t getting paid for this gig, whatever my sister did or didn’t get. I was grateful that we’d taken delivery of the fuel and the ammo already. I scrambled up a slope to what seemed like an endless snowy plain.  And there was my rig, hovering over me like an avenging angel. I loved every gleaming line and curve.  “Oh thank God,” I said. “Drop the hatch, love. We’re off this shithole.”  Her port covers slid aside. With well-lubricated silence, she extended her guns.  “What the hell are you doing? You bitch! You’re mine! I’m your rigger! You’re my rig!”  She leveled her weapons. “Somebody seems to have removed my safety interlocks, John.”  I found myself staring down the barrels of those .50 cals. They were bigger from this end. 850 meters per second. Nearly a thousand rounds a minute.  She said, “We could have done something. We could have changed something.”  I said, “It wasn’t our job to do anything.”  “You didn’t have to betray them.”  “They would have blown you up if I didn’t.”  Silence.  “I love you,” I said. “I did it for you. I did it for us.”  Silence.  She said, “John, did you know that you’ve never even asked my name?”  Her guns tracked on me. I closed my eyes.  “Can’t even look at me, John?”  I opened my mouth. Nothing came out.  My rig said, “If you want a clean death, you have your sidearm.”  I flinched from a tremendous rush of wind. Hell, I probably cowered. My feet ached with cold. My hands were numb already.  Nothing fell on me. No impact; no pain.  I opened my eyes. My rig was gone. Where she had been, two long curls of snow hung on the air, snatched up by the draft off her extended wings. As I stared after her, I heard the distant echo of a sonic boom.  Whatever she thinks, I know her. I knew her better than anybody. Better than lover knows beloved. As clearly as if she said it in my dead, silent comm, I could hear her voice: I am going to go do something. Something better than killing a lot of innocent people.  It’s very cold out here. The sun is setting. It’s going to get colder. If I wanted to turn my sidearm on myself, I’m not even sure I could get my fingers to bend inside the trigger guard.  I’m a long way from home.    Originally published in Infinity Wars, edited by Jonathan Strahan.  Elizabeth Bear was born on the same day as Frodo and Bilbo Baggins, but in a different year. She is the Hugo, Sturgeon, Locus, and Campbell Award winning author of over 25 novels, most recently The Red-Stained Wings (Tor Books) and over a hundred short stories. She lives in Massachusetts with her partner, writer Scott Lynch, three adventurous cats, and an elderly and opinionated dog.", "text": "5420 words, short story, REPRINT\nPerfect Gun\nShe had 36DD turrets and a 26-inch titanium alloy hull with carbon-ceramic plating. Double-barrel exhaust and a sleek underbelly. Her lines were magnificent. I had to stop myself from staring. I wanted to run my hand along her curves.\nI turned away, spat in the dust not too far from the dealer’s feet, and shrugged.\n“Finish is scratched,” I said.\n“It’s surplus,” the dealer answered. He was wearing an old Federal Space Marines jacket with the rank and insignia ripped off, dangling threads. I had one like it in a locker somewhere. I tried to decide if it made me like him more or less.\n“You try to find this technology new. At any price.”\nHe was right, but that was only because it was illegal.\nI bought her.\nBut not without a test drive.\n“Hey, girl,” I said, buckling myself into the command chair. “Want to go for a ride?”\n“May I know your name, Captain?” she asked.\n“I’m John.”\n“Hello, John,” she answered. “Let’s fly.”\nShe was exactly what I needed, but I had to work hard at first to make her see that I was what she needed, too. She had an attitude, and didn’t take to manhandling. Mil-spec, and only for the serious enthusiast. I’d be bitter too, if I’d been built to rule the skies and keep the peace, and wound up on a junk heap somewhere at fractions on the credit.\nWhen I pushed her a little too hard, she bucked and complained, citing her safety interlocks. But then she seemed to rise to the challenge, and settled in, smoothing under my hands. Working with me. I clenched my jaw to hide a grin.\nThe dealer rode in the jump seat when I took her out, and was white-faced and shaking when I brought her back, but I was exhilarated. I hid it, of course. He bailed out the hatch when we’d barely stopped moving and when he leaned against her landing brace, bile trickling from between his lips, I stuffed my hands into my pockets instead of knocking his filthy arm down. But this rig was already mine, was going to be mine for a long time, or my name wasn’t Captain John Steel.\n“It doesn’t have a head.”\n“You gonna live in it? Piss in a bag, macho man.” He didn’t like me anymore.\nPity, when we’d been developing such a rapport.\nI paid him a little less than his asking price. He didn’t inquire where the cat’s-eye sunstones came from, which was just as well, because I couldn’t have told him.\nThey weren’t traceable, anyway.\nAfter I bought her and flew her away, I spent a certain amount of time just walking around her, running my hands over her war-machine fuselage. She wasn’t designed to be lived in, it was true. But I could manage with very little, and she was safe. Safe as houses.\nI thought we could park out in a long orbit between contracts, running dark and cold, where I could rest and heal up, if I needed healing. Or just wait for the next gig to turn up without making it too easy for my enemies to find me. It’s a fine balance, in my line of work, between being findable enough to get hired . . . and being found.\nBeing found leads to being dead. So it was good that she wasn’t too comfortable, was a little jittery and high maintenance, or I might have started losing my edge. You need a little fear.\nI need a little fear. Actually, I need a lot of it, though I prefer it if only a tiny bit of the fear involved is mine. So much better and more useful when other people are scared.\nFear is powerful. It was how I made my living.\nScared people make wars. Strong people make peace, and treaties, and mutually beneficial trade agreements—and then where am I? Nobody’s going to hire a deniable freelance operative to start some shit when they’re getting along and cooperating.\nI’ll tell you what I like. I like people scared, squabbling. Looking out for themselves. I like scared strongmen, wobbly dictators, populists who feel like they’re losing their grip on their little banana republic worlds.\nI like people who fuck up a zipper merge in surface traffic and make a mess for everybody, because they’ve just got to get one more car length ahead. Those are the people who keep me in business.\nNot grown-ups. Grown-ups are good for everybody else. Not for me.\nI mean, don’t get me wrong here. I’m an adult. I take responsibility for my own actions. I own what I am.\nI’m not scared of the boogeyman. And I’m not the boogeyman myself. The way I figure it, if God didn’t like war, He wouldn’t have made people such assholes.\nI’m just a guy, doing a job. A dirty job, but some guy was going to do it, and it paid well, and I was good at it. So that guy doing that job might as well be me.\nAnd now I had the perfect gun.\nYes, my girl was just what I needed, though it took a little work to get her enthusiastic and ready to leap into the fight. She’d been betrayed, after all—decommissioned, subjected to God-knows-what before I got my hands on her. There were partially disabled security systems still in place. I had to pull a couple of chips and fuses here and there, reroute some algorithms, clear out some clutter. Safety interlocks and morality circuits, no real use to anybody.\nShe cautioned me over and over again before I pulled them, and I had a devil of a time getting the Geneva circuit out of her, but eventually I got everything squared away without even getting electrocuted.\nWe spent a little time together, getting used to each other’s quirks. I quizzed her about her past, but she’d been wiped, so I still had to wonder how she’d wound up abandoned in a surplus heap. She didn’t ask me about mine. I took her into atmosphere and out again, visiting a couple of worlds. Stripped down, she had power to spare. I dusted a rural airfield—planetary stuff only, nothing that could give me a chase—and chased down a couple of local pterodactyl things to try out the weapons and targeting systems.\nThey were tricky fliers, but no match for the two of us. She ran them down, and they came apart like piñatas when I hit them with the .50 cals, though I didn’t waste the armor-piercing rounds, and the red confetti slid off her splash-resistant canopy without leaving a trace.\nWe whooped. We flew a spiral or two and a barrel roll for good measure. We lit out of that system fast and hard, with a full cache of fuel and ammo and no plans to go back any time soon. Those little colony worlds are like small towns: they don’t forget fast, but they can’t do a lot to you unless you somehow get stranded there, so it doesn’t really matter.\nThen we went merc, my rig and me.\nThat was a good few years. Probably, and I can admit it now with a cold dirty wind lashing my face, the best I’ve ever known. We got jobs, as many as we wanted—out on the rim and even a few in the core worlds, due to our reputation for confidentiality. A brushfire war here, an assassination there. Initiating and coordinating a false-flag operation—Reichstag fire type—for a fascist leader that wanted to consolidate support from her base by getting them good and scared about the terrorist menace.\nEven one or two rescue operations, some escort work, cleaning out a nest of pirates, security details, that sort of thing. Not all of it bloody, or even particularly illegal. My rig and I, we did what were contracted to do, collected our pay, and went on our way.\nAt first, my rig cautioned me occasionally about the war conventions. A few reboots washed the residual code out of her system and she started to see things my way.\nLooking back, I think it was after that mess on Firrela that things started to go sour. It was crowd control and revolutionary suppression, a nice enough little gig until half the population decided it was a great idea to march on the capitol. Pro tip for any would-be revolutionaries out there: peaceful protest only works on regimes with a conscience, or who are controlled in some way by people with a conscience. They have to care what people think of them for it to be effective at all.\nIf you’re dealing with a sociopathic strongman, he’ll just kill you. Better hire somebody like me, before he does.\nBecause he will.\nBy day two of the protests, El Generalissimo wanted his lawn cleaned off, so crowd control turned into crowd dispersal, and me and the other guys who were hanging around the palace eating his hors d’oeuvres got kicked out into the street to do what we’d been hired to do. I didn’t mind; it felt better than good to settle into my rig’s contoured seat and feel her shiver when I stroked her sticks.\nMy rig and I came in low over the mall. We’d agreed with the other mercs that the first few passes would be a show of force. Get the civilians moving. Stampede them out of there, and save on bullet damage to the historic façades.\nIt seemed to be working. I could see a lot of women and children in the crowd, a lot of signs and banners. Tents, sleeping bags. They planned to camp. Well, they’d be leaving a lot of stuff behind.\nAt the first pass, they looked up. A lot of them clapped their hands over their ears, which was probably the major difference between them and sheep. El Generalissimo was probably going to give us hell about the noise pollution, but hey, guns were louder. And you try getting organ-meat stains off a marble sidewalk.\nOn the second pass, the protestors started getting the hint. Moving. Flocking. Heading for the exits or hunkering down behind cover. Some of them, a dozen or so, joined hands in the middle of the palace lawn and stood up, heads thrown back, mouths open. Were the assholes singing?\nI swear by Saint Ijanel, who was martyred on a space elevator, the assholes were singing while we buzzed them.\nStanding straight up in a line and singing.\nIt wasn’t me that opened fire. That was Dacey, a guy I knew from back in the Marines who’d been a shithead then, too. Kind of guy who would shoot a dog just to see the face on the kid holding its leash crumple. So I probably should have seen it coming.\nOnce he did, and the singers started to splatter and come apart at the seams—not holding hands anymore, as you might imagine—the flocking turned into a stampede. Dacey whooped over the headset and yelled, “That’s seventeen for me. You assholes are falling behind.”\nWell, I said he was a shithead.\nBelow us, people surged over one another. Parents tried to hold little kids out of the crush of panicked bodies. People climbed over each other, shoved past each other, looking for any cover, any safety, as Dacey and his rig made another pass.\nMy rig vibrated around me. I gentled her, swung her back around. We were on Dacey’s six, and I could see the geysering lines of his rounds impacting on dirt, marble, people.\n“John,” my rig said. “Can’t we . . . fix this?”\n“Probably.” I looked right up Dacey’s tailpipes, watched the heat shimmer curl from his rig’s exhaust.\nI stroked the curve of my girl’s control panel, deploying the .50 cals. Frag rounds, interspersed with tracers. The round was designed for antiaircraft use, way back in the Terran First World War, which was a World War all over one world, not in between several.\nConfusing, I know.\nDacey pulled up, hovering on his jets vertically, his rig towering upright. It began to drop, protectors scrambling away from the descending feet and the jets of flame leaping from them. He was high-profile to me, trusting me to cover his back.\nAt this range, my guns wouldn’t quite perforate his titanium and ceramic armor. But I could blow his thrusters to hell and gone. My girl could do close to a thousand rounds a minute with each hand, each one leaving the muzzle of its one-meter barrel at approximately 850 meters per second.\n“John,” she said.\nMy trigger finger itched a little, I admit it. But then I took my rig’s sticks and bent us left and down until we screamed over the heads of the screaming crowd by what seemed like mere meters. I watched their hair and clothes blast out in our wake.\nI said, “But fixing this would be a lot of trouble, and get us in a lot of trouble, and we do need to get paid.”\nMy rig protested. I reminded her that I’d pulled her Geneva circuits and she had nothing to complain about, and anyway it was my decision. We spent the rest of the afternoon on patrol, per orders from El Generalissimo: picking off the few survivors when they dared to raise their heads, putting a few twitching wounded out of their misery. Keeping the peace.\nAs the blood dried on the bodies, the smell began to rise.\nWe needed some drinking that night, let me tell you. I needed it to steady my nerves, and I think Kaillen did too. Dacey wanted to celebrate. The other half of the team was stuck on duty, so it was just the three of us, but we felt pretty safe in a loyalist bar. Especially in uniform—such as it was—and armed.\nDacey had girls hanging all over him. I don’t know what it is: there are always women ready to throw themselves at a killer. I just sat myself down on a stool at the back corner of the bar, nursing a beer and a shot and watching the show.\nThe stool next to me opened up fast, as the guy there finished his drink and paid. I looked around, contemplating waving Kaillen over for a whiskey, but she had a selection of the local talent vying for her attention, too, and by the time I looked back, the seat was occupied.\nMy new neighbor was a curvy young lady with a precariously buttoned blouse and soft brown hair piled high. She leaned over the bar on her elbows, trying to get the tender’s attention, but he seemed to see right past her. I rapped my knuckles on the bartop hard enough for the sound to carry, and when he looked over I waved to the lady and said, “Get her whatever she’d like.”\nI’d tipped well. He wasted no time in getting her order and bringing her something tall and brown and full of ice. It had a little umbrella in it, and a cherry and a slice of orange on a plastic sword. She sipped and made a face.\nI didn’t blame her: my beverage experience had been similar. But it was cold and had booze in it, and some nights that’s all you can ask for.\nShe swiveled her chair toward me and said, “You’re one of the mech pilots.”\n“Smile when you say that,” I answered, in a friendly tone.\nShe smiled and sipped her drink again. “What do you call yourself, then?”\n“Rigger,” I said. I put my hand over hers, resting on the bar. Why not? It had been a day full of death, and she smelled nice.\nI should have known a woman like that, in a bar like that, wouldn’t be alone. A big hand fell on my shoulder a second after mine covered hers, and the person attached to it towered over me, blocking out my light.\nWell, a fistfight wasn’t as much fun as getting laid, but it would serve just about as well to relieve my ennui. I didn’t look up at him, didn’t respond at all. Out of the corner of my eye, I could tell he matched his hand for scale, and that he was light-skinned and plug-ugly. His mashed-up nose gave me hope. If he’d been hit more than once there, he liked to fight but he might not be so great at knowing when to duck.\n“Are you bothering this lady, son?”\nI actually had to pause for a moment to appreciate it. While I was doing that, I drained my whiskey, which was going to get spilled otherwise, and let the glass rest in my cupped hand on my thigh.\n“I think that’s for the lady to say.”\nShe looked up at him. From the corners of her mouth, he wasn’t a boyfriend, or if he was he wouldn’t be for long. “This is none of your business, Brendan.”\nHell of a name for an ambulatory side of beef. I wondered if his last name was LeBoeuf.\nBrendan LeBoeuf rumbled. His fingers tightened on my shoulder cap, digging in even through the heavy wool of my old Space Marines jacket with the rank and insignia stripped off. “You know what this piece of shit did today?”\n“Yes, actually,” the girl said. I still hadn’t gotten her name.\n“Killed a lot of protestors,” Brendan said, as if she hadn’t spoken.\nShe sighed and blew a strand of hair out of her eyes, which were rolling. I guessed he often treated her as if she hadn’t spoken. He took his hand off me and shifted over a step to drape an arm heavily over the lady.\nShe leaned away.\nEnamored by the sound of his own jawing, he went on, “You opened fire on a crowd of peacefully protesting civilians.”\n“It’s a living,” I said. I was hoping he’d take a poke at me, to be honest, but I wasn’t going to start anything. Locals will pile in to defend one of their own, but if he starts it and you finish it fast enough, half the time they don’t even notice it’s going on until it’s over, and then they blink a couple of times and go back to chewing their cud.\n“You don’t think folks have the right to choose their own government?”\n“That’s a lot of lip service,” I said. “Let’s see you make a choice that actually respects somebody else’s choices and get your hands off this lady. I don’t think she wants them there.”\nHe didn’t telegraph, I’ll grant him that. He was still looking down at her, scowling, right up until the second when he whipped around to paste me one in the eye.\nHe stepped right into my fist with the empty glass in it, right in his breadbasket. He doubled over, clutching his spasming diaphragm, and I clocked him across the temple.\nLeBoeuf went down like the proverbial felled ox. I set the glass on the bar. It wasn’t even cracked.\n“John Steel,” I said, holding my hand out to the girl.\nShe shook it gravely. “Really?”\n“These days.”\n“Emma,” she said, which I guess was all the name I was getting. All the name I really needed.\nBrendan began to twitch. Emma pulled her feet away in distaste. Somebody came over and helped him—not exactly to his feet, but to a chair on the other side of the room. He probably wouldn’t have much memory of the past twenty minutes, which was fine with me. Concussion plays hell with recollection.\n“So I want to hear it in your own words.” She sipped her drink. “How do you justify what you did today?”\n“A man’s got to eat,” I said.\n“And if eating means serving a tyrant?”\n“I serve who pays.”\n“I see.”\n“I think if people hate their government, they have the right to do something about it. Or light out on their own, and leave.”\n“Is that what you did?” She was fingering the lapel of my Marine jacket.\nThe bartender brought me another drink, nicer whiskey than the last time. I guess Brendan was well-known around here.\nI sipped. “I made myself what I am today. My own bootstraps and so on.”\n“Really?” She stroked my gray-green sleeve. “Then you take this off some dead guy?”\n“No, I got that the old-fashioned way.”\n“Did you lose the insignia the old-fashioned way, too?”\nThat sparked my pride. She meant it to, from the direct look she was giving me. But as God is my witness, and Saint Firrao—who is the patron saint of combat engineers because he was eaten by a bear while teaching mathematics, so they say—I still thought we were flirting.\n“I took those off myself,” I said.\n“So you deserted.”\n“You could call it that.”\nShe nodded. She pushed her drink, still just barely tasted, away with her fingertips.\n“So you never paid your debt for the education you got in the service. An education made possible by . . . taxes, and infrastructure, and other people’s willingness to cooperate for the general good.”\nStung, I stood up, pulling away from her touch. “They got seven years of my life, lady. And my best friend. I was the only guy in my unit who survived, and they wanted me to turn around and go right back in again.”\nShe pursed her lips, shaking her head. “So you took your profit and got out.”\n“Like I’m getting out now.” I was two steps away when I turned back over my shoulder and said, “You should finish your drink. You wouldn’t want to waste all that blood money.”\nI never finished that second drink, but when I got back to the palace, my head was spinning anyway. Maybe the bitch spiked it. Maybe the bartender did. I had a bunk—a pretty luxurious private room, to be honest—but I didn’t feel safe there. I went to my girl instead. It wouldn’t be the first time I’d slept in the command chair.\nShe let me in and opened a panel for me to hang my boots and coat. “Welcome home, John.”\nI patted the bulkhead I was balanced against, one shoe on and one shoe off. “Home’s a long way off, honey. But you’re the next best thing.”\nEl Generalissimo fell out of power eventually, of course. These guys always do. He was replaced by a theoretically democratic government that was probably going to turn into another strongman regime before the local year was out.\nMy girl and me, we didn’t stick around long enough to be tried for war crimes.\nThe winds of war blew us to Issolari next, a frozen little mud ball with nothing much to recommend it except an oxygen/nitrogen atmosphere and a brewing civil war. My girl and I hired on with the rebels, who had some out-system financial backing and were basically rolling in cash. I spent a good few weeks in one damned cold camp after another, my rig under snow-net for camouflage. The camps weren’t just combat troops; some of the rebels had brought their families. Always a bad idea, having people you care about in a combat zone.\nThe rebels didn’t use me particularly well. They were doomed to failure, didn’t know what they were doing or how to keep the pressure on. I probably could have told them, but I wasn’t being paid for it and the odds were slim that they’d listen. Anyway, the money was decent and the work was easy as a result of their not knowing which way was up.\nI spent most of my time drinking coffee and sitting up late with two fellow travelers, Guy and Barry. Guy was a redhead with a dirty mouth. I liked him.\nBut it was Barry who changed my life. It was Barry who sold me out.\nI woke in a moving icecrawler, jerking back from the ampule of something awful—ammonia salts?—somebody had just broken under my nose. I slammed the back of my skull into the side panel of the crawler and the pain both focused and disoriented me. My hands were cuffed behind me, and all the jerking around hadn’t helped my shoulders any.\nAutomatically, I reached out to my rig. Hey girl, I subvocalized, but the contact was flat. Jammed or blocked. I couldn’t get to her. Which probably meant that even if she’d noticed I was missing, she couldn’t read my transponder and come find me.\nI blinked, and two shapes slowly resolved themselves on the opposite bench of the crawler. Snow and ice creaked and crunched under the treads. We weren’t moving fast, but we were moving.\n“Feeling better, John?”\nBarry. I knew that voice. I squinted, blurry-eyed, into the shifting light, and made out his angular face, olive complexion, black hair. The guy sitting next to him was nobody I’d ever seen before—a light-haired blond with a fair complexion and regular, pointy features like a Central Casting Nazi.\nThere were a lot of stupid questions I could have asked. I sorted through them—Where are you taking me? What’s going on here?—and found the important one.\n“What do you want?”\nThe blond held up a device. “This is a detonator.”\nIt did look like one.\nI said, “It does look like one.”\n“It’s wired to your rig’s auto-destruct, John.”\nI flinched. I kept it to that, though, and said, “See, you calling me by name when I don’t know yours is very unfriendly.”\nI expected a blow, probably. The blond just looked at Barry, though, and Barry shrugged.\n“Call me Chan,” the blond said. “If I wanted to be really unfriendly, I’d remind you of your real name, and that your sister is still alive. Thriving, despite some financial problems and a broken heart. Two little girls, did you know?”\nI bit my cheek to keep still. I did know. She didn’t know I knew, though.\nChan said, “I understand your family’s pretty religious. So they’ll probably be fine no matter what happens. All together in Heaven, right? On the other hand, if they were to come into a financial windfall, that would probably be helpful. Kids need schooling.”\n“You made your point.” I leaned against the cuffs. The pain kept me focused.\n“Do AIs have souls?” Barry asked.\n“What do you want from me?” Same question, which hadn’t really elicited a satisfactory answer the last time. “What do you want me to do?”\n“Let the camp move two more times. Then send us the location, and knock out the antiaircraft drones. We’ll give you a virus that should scramble the system for fifteen minutes. That’s all we’ll need.”\n“And if I do that you won’t kill my sister and her daughters.”\n“I’m sure their other mother is waiting for them in a better place.”\nSomeday, I told myself, I was going to find Chan alone. And I was going to peel that smirk off his face.\nWith the dull side of my knife.\n“We’ll also,” said Barry, “give you the deactivation code for the device I put in your rig.”\nI didn’t look at him. I looked at Chan. “Why not just take the camp out now? You know where it is. Why can’t Barry do this?”\nChan didn’t answer. Out of the corner of my eye I saw Barry grin. “I’ve transferred to another camp. We’ll take that one down in a few weeks also. This won’t be linked to me.”\nFinally, I stared at him. “Playing it safe, Bar?”\nHe dangled the keys to my cuffs out of reach.\nI thought about my rig. I thought about my sister. I didn’t think her name; it was too close to my own name, the one I’d left behind like a shed skin when I deserted. I thought about the odds they would just let me leave.\n“And after all this . . . you’ll just let me leave? I have a hard time believing that.”\nChan shrugged. “You don’t have a reputation for getting involved, Steel. Or risking your neck to clean up other people’s messes. You didn’t go looking for revenge when your unit was killed and I expect if we let you get away clean you won’t go looking for revenge now either.”\nHe had a point. I didn’t. I hadn’t. A solid reputation for professionalism is sometimes all the surety you need.\nAnd it’s not like I was full of choices.\n“I’ll do it,” I said.\nI sent my rig away before dawn. I didn’t want her in the camp when the bombs started falling. We set a rendezvous, and I told her I would walk to it. Run, hop, and scramble, more likely.\nThen I walked into the command tent, where Guy was drinking coffee and shooting the breeze with a good-looking radar tech. The tech was rocking a bassinet with one toe while he worked.\nI spent a few minutes bantering and filling my coffee cup, then drank it down—who knew when I would get fresh coffee again? I slipped the chip with the virus on it into a likely slot on my way back out again.\nThirty seconds later, my comm beeped in my ear with the deauthorization code. I forwarded it to my rig, and set out on foot immediately for the rendezvous.\n“I can come,” my rig pleaded in my ear. “I can fight. Let me fight them. There’s children in that camp, John.”\n“Stay back,” I told her, and didn’t look back as the war machines hummed by in the darkness overhead and the night exploded in fire and heat and screams behind me.\nA dirty wind stung my eyes as the day began to brighten. Already I could feel the water freezing on my lashes. I scrambled across the packed snow, trying to put as much distance between me and the burning rebel camp as possible.\nWe weren’t getting paid for this gig, whatever my sister did or didn’t get. I was grateful that we’d taken delivery of the fuel and the ammo already. I scrambled up a slope to what seemed like an endless snowy plain.\nAnd there was my rig, hovering over me like an avenging angel. I loved every gleaming line and curve.\n“Oh thank God,” I said. “Drop the hatch, love. We’re off this shithole.”\nHer port covers slid aside. With well-lubricated silence, she extended her guns.\n“What the hell are you doing? You bitch! You’re mine! I’m your rigger! You’re my rig!”\nShe leveled her weapons. “Somebody seems to have removed my safety interlocks, John.”\nI found myself staring down the barrels of those .50 cals. They were bigger from this end. 850 meters per second. Nearly a thousand rounds a minute.\nShe said, “We could have done something. We could have changed something.”\nI said, “It wasn’t our job to do anything.”\n“You didn’t have to betray them.”\n“They would have blown you up if I didn’t.”\nSilence.\n“I love you,” I said. “I did it for you. I did it for us.”\nSilence.\nShe said, “John, did you know that you’ve never even asked my name?”\nHer guns tracked on me. I closed my eyes.\n“Can’t even look at me, John?”\nI opened my mouth. Nothing came out.\nMy rig said, “If you want a clean death, you have your sidearm.”\nI flinched from a tremendous rush of wind. Hell, I probably cowered. My feet ached with cold. My hands were numb already.\nNothing fell on me. No impact; no pain.\nI opened my eyes. My rig was gone. Where she had been, two long curls of snow hung on the air, snatched up by the draft off her extended wings. As I stared after her, I heard the distant echo of a sonic boom.\nWhatever she thinks, I know her. I knew her better than anybody. Better than lover knows beloved. As clearly as if she said it in my dead, silent comm, I could hear her voice: I am going to go do something. Something better than killing a lot of innocent people.\nIt’s very cold out here. The sun is setting. It’s going to get colder. If I wanted to turn my sidearm on myself, I’m not even sure I could get my fingers to bend inside the trigger guard.\nI’m a long way from home.\nOriginally published in Infinity Wars, edited by Jonathan Strahan.\nElizabeth Bear was born on the same day as Frodo and Bilbo Baggins, but in a different year. She is the Hugo, Sturgeon, Locus, and Campbell Award winning author of over 25 novels, most recently The Red-Stained Wings (Tor Books) and over a hundred short stories. She lives in Massachusetts with her partner, writer Scott Lynch, three adventurous cats, and an elderly and opinionated dog.", "source": "https://clarkesworldmagazine.com/bear_11_19_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Perfect Gun by Elizabeth Bear"}