{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JdeUHjsE957dpeIWoZSTZOIE8Qc=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Overthrowing the Royal We: A Conversation with Kate Elliott  Kate Elliott has far more books out than you probably know. Née Alis A. Rasmussen, she was born in Des Moines, IA, studied at University College of North Wales—Bangor and at Mills College in Oakland, CA, earning a BA in English. Her debut novel, The Labyrinth Gate, was published in 1988. In 1990, came the Highroad trilogy, A Passage of Stars, Revolution’s Shore, and The Price of Ransom.  Rasmussen took the pen name Kate Elliott in 1992 with the well-received novel Jaran. The series continued with His Conquering Sword and An Earthly Crown in 1993, and The Law of Becoming in 1994. In 1996, she wrote World Fantasy Award finalist The Golden Key with Melanie Rawn and Jennifer Roberson. Nebula Award finalist King’s Dragon started the seven book Crown of Starsseries in 1997, with the final entry, Crown of Stars, published in 2006. The Crossroads trilogy started with Spirit Gate in 2006 and the Spiritwalker trilogy started in 2010 with Cold Magic.  Andre Norton Award nominee, Court of Fives, was followed by Poisoned Blade in 2016, and Locus Award finalist Buried Heart in 2017; novellas Night Flower (2015) and Bright Thrones (2017) were added to the narrative later. Romantic Times Award winner Black Wolves was released in 2015 and the collection, The Very Best of Kate Elliott came out in that same year, while 2019 saw the publication of Throne of Eldraine: The Wildered Quest, a Magic the Gathering book.  Rasmussen used to do medieval sword fighting; she met her husband in a sword fight. In 2002 they moved to Hawaii, where she took up outrigger canoe paddling. She started writing at age nine and she never stopped. Her latest series, The Sun Chronicles, begins with Unconquerable Sun, due in July 2020: “Gender-spun Alexander the Great on an interstellar scale.”   Unconquerable Sun marks a return to space opera at novel length. Is the timing purely about the whims of the creative muse, or are there other aspects to it? Why space opera and why now?  Unconquerable Sun will be my twenty-seventh published novel. Since seven of my first eight published novels were science fiction, I started out thinking of myself as an SF writer more than as a fantasy writer. After this beginning, however, I became best known for the Crown of Stars epic fantasy series. Its success kept me in fantasy for quite a while longer. To be clear, I love both SF and F; to me they all nestle under the larger umbrella of speculative fiction. So, writing space opera now is really me going back to my roots in SF.  Are there important differences in craft or process with regards to writing space opera vs. writing fantasy?  It’s long been my opinion that science fiction and fantasy are about the present as filtered through the lens of some manner of fantastical and/or speculative element/s. In that sense I don’t perceive them as fundamentally different from each other because both are settings for speculative fiction. A series set so far in the future, as with Unconquerable Sun’s story-world, is essentially a secondary world even if there are many real-world references and a tenuous connection to Earth’s history and cultures. Probably the biggest difference is that I can get away with explaining less in space opera because it uses more modern terminology and familiar modes of daily life.  In terms of writing a multipoint-of-view narrative with a complex plot and epic aesthetic, SF and F feel very much the same. Space battles are harder to write, though, because they are even more unwieldy in terms of distance and time than fleet battles set on (say) Earth’s oceans.  In a 2018 Locus interview, you talked about your extensive research of Greco-Roman Egypt, particularly in the context of Court of Fives, and your description of Unconquerable Sun was: “A genderbent Alexander the Great-inspired space opera.” Does the new series bear significant similarities to Court of Fives?  As a story, no, not really. With a single point of view, Court of Fives is more tightly focused and less sprawling as a story. The main character is a girl who is a competitive athlete. The story also addresses issues of colonialism in an historical context built from the history of Greco-Roman Egypt while focusing on a girl whose mother is indigenous and father is of the conquering culture. In contrast, Sun (like Alexander the Great) is very much born into the center of power. The dominant (conquering) culture in the Court of Fives world is patriarchal, as the ancient Greeks were. That aspect also could not be more different from the Unconquerable Sun universe, which is often hierarchical and competitive, but definitely not patriarchal.  Having said that, I’ll note that the initial idea for Unconquerable Sun came about because of all the research I did for Court of Fives into the history and culture of Ptolemaic Egypt. Ptolemy became king and pharaoh of Egypt in the aftermath of the death of Alexander the Great during the Successor wars when A’s generals (including Ptolemy) fought over his empire. A core element of the Successor wars was their veneration of Alexander—or at least the way they all used the memory of his legendary status to support their own personal campaigns and ambitions. That meant the core element of any story about this period of history—both his reign and its aftermath—is Alexander himself. His story, with its far-flung marches and famous battles, also felt absolutely ripe for a space opera treatment, with a similar field of play but also a chance to reconfigure many of the cultural dynamics.  Thinking about it that way took me down yet another road. We in the USA know from our own electoral experiences how distrustful our culture can be of the very idea of female leadership. Women too rarely get a turn in fiction as charismatic, brilliant leaders with an unquestioned capacity to lead. In the end, I decided I wanted to write that story.  What were the most challenging aspects of writing Unconquerable Sun?  When you set out to create an analog story from a real historical set of events, the first and biggest thing you run up against is that the real story is far too complex and filled with far too many actual individuals to be useable “as is” in a fictional secondary world narrative. I have had to choose (and am still in the process of choosing) which real historical individuals get a direct analog, who can be combined with another one or two to create a composite character, and who has to be cut from the story altogether because otherwise there would be way too many people.  Most of us live in rich networks of family and acquaintances and can keep most everyone straight in our heads. That’s not true in the same way in fiction. Each new character has to be introduced and the reader must be given a way to remember who they are and why they matter. So, if your novel has ten characters, the reader can keep them straight and be involved in their stories. If your novel has one hundred characters, of whom seventy have speaking parts, it starts getting more difficult to dig into characterization and reader investment in those characters.  As a novelist I create character hierarchies so the reader will get to know a few people well, a few more middling well, and retain some basics about the rest or at least know which of the mains a minor character’s presence is associated with. Keeping character count fathomable has definitely been challenging.  Alongside with those choices I have to decide which elements of the historical and legendary life of Alexander the Great I will keep analogs of, and which I will punt to the side because there isn’t room. The most challenging aspect of writing this trilogy is the dynamic between creating an analog story that is also a unique story. I want the story to be recognizably inspired by Alexander the Great, to play narratively with specific aspects of his character and history, but at the same time I don’t intend for it to be his story in a mirror in a different setting, because Sun’s narrative needs to be its own distinctive history.  The book features Princess Sun, who has grown up in the shadow of her mother, and there’s a conspiracy to remove her as heir. She must rely on her wits and her companions to survive. What is Princess Sun like as a character; do you relate to her in specific ways?  Sun is a difficult character to write because people like the Alexander the Greats of this world have a mindset I find hard to write from the inside. Previous novels have tackled characters of this type—Camjiata in the Spiritwalker trilogy and Bakhtiian in the Jaran books, to name two—but in my other work they’re never seen from their own point of view but only from the outside. This allows a part of them—maybe the insatiable longing or the bottomless ambition—to remain mysterious by being one step away from the reader. Tackling it head-on in Sun has been quite challenging.  I don’t particularly relate to Sun in the sense of being a single-minded ambitious charismatic leader, but I do love her decisiveness and her impatience for wheel spinning, so I can relate to that.  Are there other characters you’ve written that you feel much closer to, or narratives that are more personal for you?  I can’t really write a character well if I don’t feel close to them in some way, and that includes villains. There’s always an element of my own personality I can draw on to embody a character even if I don’t have much else in common with them. For a villain it might be a part of me that I don’t like, say possessiveness or bigotry, but which I recognize in myself and can expand to create the impetus to drive that character’s actions. To make the primary antagonist in Court of Fives (Lord Gargaron) work I had to understand him and what he wanted and why he wanted it. That level of understanding in a way that makes me feel “close” to him; I get him, because if I can’t “get” a character I can’t write them well. For a character meant to be sympathetic I might highlight strengths as well as flaws; I have plenty of both and I use them to try to build characters who seem like real people with real personalities and real wants and needs.  There are times I foreground a more specifically personal element. For example, in Court of Fives I made main character Jes an athlete because I wanted to write a story about a girl who was an athlete because I am an athlete and, as a teen, I didn’t see stories about girls like me. In other ways Jes is completely unlike me, and her background and the way her story unfolds in the trilogy is meant to be unique and specific to her.  Caring about a character’s story and wanting to bring it to life on the page matters most to me. I write because I’m interested in a story and characters regardless of whether that story has a directly personal element for me, if that makes sense. Writing a story is what makes it personal for me.  Writing about a princess immediately evokes class, and we are, I’d argue, a somewhat class-conscious society. How do you write a narrative about a member of royalty and make that character someone whose story a reader will want to follow?  The toxic idea that some people are at an essential level better or purer or more deserving than others runs deeply through many cultures, and specifically it still permeates American culture. Our nation was founded by overthrowing monarchical rule, but at the same time the founders deliberately wrote inequality into the law. Given that history, it is interesting to see how royalty is employed in narrative, and how a supposedly forward-thinking genre like SF encoded and encodes bias and prejudice into its stories.  I don’t fully agree with people who claim fantasy writers all write about royalty because they love kings and princes because the fantasy genre is at root conservative (in the older sense of conservative toward past traditions). Science fiction has its own issues in this regard. For example, if the idea of meritocracy is founded on inequality of opportunity then it isn’t really a meritocracy and can’t be lauded as such. So why do so many SFF writers include royalty in their stories? Partly I think maybe because we’ve all read so many stories centered on royalty that it seems natural and proper as a focus for narrative. But that’s just one possible element. Obviously, I can’t answer for anyone except myself.  I have in the past written stories including major characters who are royalty. In some cases, as with Crown of Stars, to write a version of medieval Europe I used governing systems that were present at that time (although with major changes in gender relations, and with a nod to the fact that early medieval Europe had a great deal of local variety in how people were governed or how they might even govern themselves). I have also written stories about rebellion against an entrenched aristocratic order as well as narratives that specifically confront it as a system. I don’t think I’ve ever written a story in which there were no hierarchies at all. Hierarchy of one kind or another is a very human story.  In the case of Unconquerable Sun, the story of Alexander the Great is dependent in large part on his status as a member of the Argead royal house of the kingdom of Macedon. If one is going to write about a military campaign and rulership (and obviously no one needs to), there are great stories to be told about peasant youth or slave soldiers who rise up to become generals and then rulers. That’s not the Alexander story, however, and it’s been interesting to see which aspects of the story I have felt were embedded and which I felt I could alter, swap, cut, or transform. The position of heir to an established lineage is one I felt necessary to the story, even though my space opera Macedon analog is called the Republic of Chaonia. Is it really a republic or is it, as one low-ranking non-Chaonian soldier claims, “a tyrannical military dictatorship”? In other words, part of the story is about how people from different cultures see each other.  As for class, there’s a lot about the ancient world that can’t be directly compared to modern definitions and sociological understandings. Nevertheless, in the book there are plot-internal discussions of social disparities, since those do exist in Chaonia, while alternative sorts of disparities exist in other cultures like (say) the Phene Empire. Which, by the way, is not ruled by an emperor or a royal family who has inherited its status.  Court of Fives was deliberately a YA series. Are there aspects of YA writing that you’ve brought to Unconquerable Sun? And what do these distinctions mean to you?  My experience of YA was that my editors wanted the story to be single main character focused. That meant I had to limit my typical desire to sprawl out the plot to vaster fields of action. Court of Fives is tightly plotted around one character’s story and vision, with an emphasis on pacing.  Unconquerable Sun is adult SF. In book one the main characters are young—about twenty—which is a reflection of the story of Alexander the Great. The worldbuilding definitely sprawls more, which makes it more adult-genre-ish. I worked really hard with my editor Miriam Weinberg to make the pacing strong and relentless, skills I had improved on through writing the YA trilogy.  One of the things fans love about your books is the worldbuilding. What makes worldbuilding engaging for readers? Or, how do you write great worldbuilding? And what are some of the worldbuilding elements that stand out for you in the new book?  In my experience, different readers like different things in worldbuilding. Some want the worldbuilding to stay in the background, to be skim-able, not to get in the way. Others (like me) love an immersive world, one that feels “real” as you read, as if you could actually walk through it and see the sights and smell the cooking and hear the street sounds and know the touch of the air. As a worldbuilder I try to build those elements by using glimpses into daily life and what those routines and pieces of material culture mean to the people of that world; and also through showing how people interact with others, because social relations tell us a lot about a culture and its views of the people who live within it.  In the Unconquerable Sun setting I wanted to write about a set of cultures whose understanding of ancient Earth (that is, the world they came from generations before) is as fragmented and limited as our understanding of an ancient culture like the Sumerians or Mohenjo Daro, of which we have bits and pieces that we try to put together to understand who they might have been. But we’ll never fully know.  What excites you most about the new series, and what do you want readers to know about it?  All the Easter eggs hiding in the text.  You’ve mentioned that the book is influenced by the K-pop band Big Bang. Can you talk a bit about how this shows up in the book itself?  I saw Big Bang in concert a few years ago and literally walked out of the concert with Channel Idol in my head, a combination news and entertainment channel created and run by the government as a propaganda arm to build and sustain unity among a people involved in a long-term military struggle. It’s right there, immediately in the first chapter, impossible to miss. I don’t want to say more because this is a theme and element that plays out across the trilogy.  Your Kirkus review describes the book as action-packed and enthralling, edge of your seat. What is your approach to writing action?  First, make the reader care about the characters so that, when the action starts rolling, the reader cares about the outcome. Action for action’s sake, a sequence of running or fighting (etc.), is not intrinsically compelling without character investment. Layer your characters’ emotional struggles and needs into how the action plays out.  Second, deploy the Tade Thompson Fight Scene Clarity Test. It boils down to this: Establish early the landmarks, so the reader knows where everything is. Reference those landmarks as needed so the reader knows where the characters are (and what weapons they have). Make the lines of emotional tension clear.  Third, if you’re me, make sure you don’t interrupt action with tangents. If you need a quiet moment or a tangent, let any given sequence of action complete (however briefly) and use the quiet moment or tangent for breathing space before the next action sequence or as a way of putting a period on that particular bout of action. Vary the intensity. Don’t make it all one volume or speed. Use contrast, a pause for a whispered conversation or a sudden frantic race to a closing gate, to heighten the effect.  Behind the scenes, you have actually mentored other authors who’ve become successful in their own right. What does it mean to be a good mentor, and how do new authors develop that kind of relationship with someone more established?  I value so highly the connection between writing generations. Genre is always in conversation with itself. None of us pop up out of nowhere. The discussion constantly changes as new people come into the field while the global dynamic shifts around us. Change is bound to happen, and it has to happen to keep the genre alive and growing. A stagnant field is a dying field, and who wants that? I don’t. Someday, the evidence suggests, I will be dead, and I like the idea that the genre I’m part of stays alive as it grows from where it is now into something I won’t ever see.  So, it’s an honor for me to be able to do what I can to help aspiring writers of whatever age and young writers growing into their creative vision. Sometimes mentoring might simply be giving an encouraging word at the right time. Sometimes it involves reading a manuscript and offering critique. Sometimes a more experienced writer can give useful publishing advice to people who are struggling to figure out the basics of what to do and how to proceed. I was that new person once. The people who welcomed me and those who extended a helping hand made a difference in my career.  What makes a good mentor? Mentoring can’t be about you, the mentor, but rather must be about the person you are mentoring and what they may need. Mentoring should reflect the historical and generational conversation we are all involved in, how we reflect on what came before, interact with what is going on now, and create hopeful possibilities for the future.  How does a new author develop that relationship? That’s tougher to answer. Often it can be a matter of acquaintance. Get to know people at conventions, conferences, or online. It’s okay to ask questions. Remember that some writers don’t have the time, energy, or inclination to mentor, which is fine. Others might feel comfortable enough with a new acquaintance or friend to ask them if they want advice or help—and by the way it is always okay to say no, in either direction. You don’t have to mentor if you can’t manage it. You don’t have to accept an offer of mentoring if it doesn’t feel right to you. Look for organizations that welcome newer writers (and make sure they are legit and not predatory); look for zines that publish new writers. SFWA (Science Fiction and Fantasy Writers of America) has a Mentoring Initiative, which you can check out here: www.sfwa.org/other-resources/for-authors/mentoring-initiative  More than anything, I’d say mentoring is about community. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nOverthrowing the Royal We: A Conversation with Kate Elliott\nKate Elliott has far more books out than you probably know. Née Alis A. Rasmussen, she was born in Des Moines, IA, studied at University College of North Wales—Bangor and at Mills College in Oakland, CA, earning a BA in English. Her debut novel, The Labyrinth Gate, was published in 1988. In 1990, came the Highroad trilogy, A Passage of Stars, Revolution’s Shore, and The Price of Ransom.\nRasmussen took the pen name Kate Elliott in 1992 with the well-received novel Jaran. The series continued with His Conquering Sword and An Earthly Crown in 1993, and The Law of Becoming in 1994. In 1996, she wrote World Fantasy Award finalist The Golden Key with Melanie Rawn and Jennifer Roberson. Nebula Award finalist King’s Dragon started the seven book Crown of Starsseries in 1997, with the final entry, Crown of Stars, published in 2006. The Crossroads trilogy started with Spirit Gate in 2006 and the Spiritwalker trilogy started in 2010 with Cold Magic.\nAndre Norton Award nominee, Court of Fives, was followed by Poisoned Blade in 2016, and Locus Award finalist Buried Heart in 2017; novellas Night Flower (2015) and Bright Thrones (2017) were added to the narrative later. Romantic Times Award winner Black Wolves was released in 2015 and the collection, The Very Best of Kate Elliott came out in that same year, while 2019 saw the publication of Throne of Eldraine: The Wildered Quest, a Magic the Gathering book.\nRasmussen used to do medieval sword fighting; she met her husband in a sword fight. In 2002 they moved to Hawaii, where she took up outrigger canoe paddling. She started writing at age nine and she never stopped. Her latest series, The Sun Chronicles, begins with Unconquerable Sun, due in July 2020: “Gender-spun Alexander the Great on an interstellar scale.”\nUnconquerable Sun marks a return to space opera at novel length. Is the timing purely about the whims of the creative muse, or are there other aspects to it? Why space opera and why now?\nUnconquerable Sun will be my twenty-seventh published novel. Since seven of my first eight published novels were science fiction, I started out thinking of myself as an SF writer more than as a fantasy writer. After this beginning, however, I became best known for the Crown of Stars epic fantasy series. Its success kept me in fantasy for quite a while longer. To be clear, I love both SF and F; to me they all nestle under the larger umbrella of speculative fiction. So, writing space opera now is really me going back to my roots in SF.\nAre there important differences in craft or process with regards to writing space opera vs. writing fantasy?\nIt’s long been my opinion that science fiction and fantasy are about the present as filtered through the lens of some manner of fantastical and/or speculative element/s. In that sense I don’t perceive them as fundamentally different from each other because both are settings for speculative fiction. A series set so far in the future, as with Unconquerable Sun’s story-world, is essentially a secondary world even if there are many real-world references and a tenuous connection to Earth’s history and cultures. Probably the biggest difference is that I can get away with explaining less in space opera because it uses more modern terminology and familiar modes of daily life.\nIn terms of writing a multipoint-of-view narrative with a complex plot and epic aesthetic, SF and F feel very much the same. Space battles are harder to write, though, because they are even more unwieldy in terms of distance and time than fleet battles set on (say) Earth’s oceans.\nIn a 2018 Locus interview, you talked about your extensive research of Greco-Roman Egypt, particularly in the context of Court of Fives, and your description of Unconquerable Sun was: “A genderbent Alexander the Great-inspired space opera.” Does the new series bear significant similarities to Court of Fives?\nAs a story, no, not really. With a single point of view, Court of Fives is more tightly focused and less sprawling as a story. The main character is a girl who is a competitive athlete. The story also addresses issues of colonialism in an historical context built from the history of Greco-Roman Egypt while focusing on a girl whose mother is indigenous and father is of the conquering culture. In contrast, Sun (like Alexander the Great) is very much born into the center of power. The dominant (conquering) culture in the Court of Fives world is patriarchal, as the ancient Greeks were. That aspect also could not be more different from the Unconquerable Sun universe, which is often hierarchical and competitive, but definitely not patriarchal.\nHaving said that, I’ll note that the initial idea for Unconquerable Sun came about because of all the research I did for Court of Fives into the history and culture of Ptolemaic Egypt. Ptolemy became king and pharaoh of Egypt in the aftermath of the death of Alexander the Great during the Successor wars when A’s generals (including Ptolemy) fought over his empire. A core element of the Successor wars was their veneration of Alexander—or at least the way they all used the memory of his legendary status to support their own personal campaigns and ambitions. That meant the core element of any story about this period of history—both his reign and its aftermath—is Alexander himself. His story, with its far-flung marches and famous battles, also felt absolutely ripe for a space opera treatment, with a similar field of play but also a chance to reconfigure many of the cultural dynamics.\nThinking about it that way took me down yet another road. We in the USA know from our own electoral experiences how distrustful our culture can be of the very idea of female leadership. Women too rarely get a turn in fiction as charismatic, brilliant leaders with an unquestioned capacity to lead. In the end, I decided I wanted to write that story.\nWhat were the most challenging aspects of writing Unconquerable Sun?\nWhen you set out to create an analog story from a real historical set of events, the first and biggest thing you run up against is that the real story is far too complex and filled with far too many actual individuals to be useable “as is” in a fictional secondary world narrative. I have had to choose (and am still in the process of choosing) which real historical individuals get a direct analog, who can be combined with another one or two to create a composite character, and who has to be cut from the story altogether because otherwise there would be way too many people.\nMost of us live in rich networks of family and acquaintances and can keep most everyone straight in our heads. That’s not true in the same way in fiction. Each new character has to be introduced and the reader must be given a way to remember who they are and why they matter. So, if your novel has ten characters, the reader can keep them straight and be involved in their stories. If your novel has one hundred characters, of whom seventy have speaking parts, it starts getting more difficult to dig into characterization and reader investment in those characters.\nAs a novelist I create character hierarchies so the reader will get to know a few people well, a few more middling well, and retain some basics about the rest or at least know which of the mains a minor character’s presence is associated with. Keeping character count fathomable has definitely been challenging.\nAlongside with those choices I have to decide which elements of the historical and legendary life of Alexander the Great I will keep analogs of, and which I will punt to the side because there isn’t room. The most challenging aspect of writing this trilogy is the dynamic between creating an analog story that is also a unique story. I want the story to be recognizably inspired by Alexander the Great, to play narratively with specific aspects of his character and history, but at the same time I don’t intend for it to be his story in a mirror in a different setting, because Sun’s narrative needs to be its own distinctive history.\nThe book features Princess Sun, who has grown up in the shadow of her mother, and there’s a conspiracy to remove her as heir. She must rely on her wits and her companions to survive. What is Princess Sun like as a character; do you relate to her in specific ways?\nSun is a difficult character to write because people like the Alexander the Greats of this world have a mindset I find hard to write from the inside. Previous novels have tackled characters of this type—Camjiata in the Spiritwalker trilogy and Bakhtiian in the Jaran books, to name two—but in my other work they’re never seen from their own point of view but only from the outside. This allows a part of them—maybe the insatiable longing or the bottomless ambition—to remain mysterious by being one step away from the reader. Tackling it head-on in Sun has been quite challenging.\nI don’t particularly relate to Sun in the sense of being a single-minded ambitious charismatic leader, but I do love her decisiveness and her impatience for wheel spinning, so I can relate to that.\nAre there other characters you’ve written that you feel much closer to, or narratives that are more personal for you?\nI can’t really write a character well if I don’t feel close to them in some way, and that includes villains. There’s always an element of my own personality I can draw on to embody a character even if I don’t have much else in common with them. For a villain it might be a part of me that I don’t like, say possessiveness or bigotry, but which I recognize in myself and can expand to create the impetus to drive that character’s actions. To make the primary antagonist in Court of Fives (Lord Gargaron) work I had to understand him and what he wanted and why he wanted it. That level of understanding in a way that makes me feel “close” to him; I get him, because if I can’t “get” a character I can’t write them well. For a character meant to be sympathetic I might highlight strengths as well as flaws; I have plenty of both and I use them to try to build characters who seem like real people with real personalities and real wants and needs.\nThere are times I foreground a more specifically personal element. For example, in Court of Fives I made main character Jes an athlete because I wanted to write a story about a girl who was an athlete because I am an athlete and, as a teen, I didn’t see stories about girls like me. In other ways Jes is completely unlike me, and her background and the way her story unfolds in the trilogy is meant to be unique and specific to her.\nCaring about a character’s story and wanting to bring it to life on the page matters most to me. I write because I’m interested in a story and characters regardless of whether that story has a directly personal element for me, if that makes sense. Writing a story is what makes it personal for me.\nWriting about a princess immediately evokes class, and we are, I’d argue, a somewhat class-conscious society. How do you write a narrative about a member of royalty and make that character someone whose story a reader will want to follow?\nThe toxic idea that some people are at an essential level better or purer or more deserving than others runs deeply through many cultures, and specifically it still permeates American culture. Our nation was founded by overthrowing monarchical rule, but at the same time the founders deliberately wrote inequality into the law. Given that history, it is interesting to see how royalty is employed in narrative, and how a supposedly forward-thinking genre like SF encoded and encodes bias and prejudice into its stories.\nI don’t fully agree with people who claim fantasy writers all write about royalty because they love kings and princes because the fantasy genre is at root conservative (in the older sense of conservative toward past traditions). Science fiction has its own issues in this regard. For example, if the idea of meritocracy is founded on inequality of opportunity then it isn’t really a meritocracy and can’t be lauded as such. So why do so many SFF writers include royalty in their stories? Partly I think maybe because we’ve all read so many stories centered on royalty that it seems natural and proper as a focus for narrative. But that’s just one possible element. Obviously, I can’t answer for anyone except myself.\nI have in the past written stories including major characters who are royalty. In some cases, as with Crown of Stars, to write a version of medieval Europe I used governing systems that were present at that time (although with major changes in gender relations, and with a nod to the fact that early medieval Europe had a great deal of local variety in how people were governed or how they might even govern themselves). I have also written stories about rebellion against an entrenched aristocratic order as well as narratives that specifically confront it as a system. I don’t think I’ve ever written a story in which there were no hierarchies at all. Hierarchy of one kind or another is a very human story.\nIn the case of Unconquerable Sun, the story of Alexander the Great is dependent in large part on his status as a member of the Argead royal house of the kingdom of Macedon. If one is going to write about a military campaign and rulership (and obviously no one needs to), there are great stories to be told about peasant youth or slave soldiers who rise up to become generals and then rulers. That’s not the Alexander story, however, and it’s been interesting to see which aspects of the story I have felt were embedded and which I felt I could alter, swap, cut, or transform. The position of heir to an established lineage is one I felt necessary to the story, even though my space opera Macedon analog is called the Republic of Chaonia. Is it really a republic or is it, as one low-ranking non-Chaonian soldier claims, “a tyrannical military dictatorship”? In other words, part of the story is about how people from different cultures see each other.\nAs for class, there’s a lot about the ancient world that can’t be directly compared to modern definitions and sociological understandings. Nevertheless, in the book there are plot-internal discussions of social disparities, since those do exist in Chaonia, while alternative sorts of disparities exist in other cultures like (say) the Phene Empire. Which, by the way, is not ruled by an emperor or a royal family who has inherited its status.\nCourt of Fives was deliberately a YA series. Are there aspects of YA writing that you’ve brought to Unconquerable Sun? And what do these distinctions mean to you?\nMy experience of YA was that my editors wanted the story to be single main character focused. That meant I had to limit my typical desire to sprawl out the plot to vaster fields of action. Court of Fives is tightly plotted around one character’s story and vision, with an emphasis on pacing.\nUnconquerable Sun is adult SF. In book one the main characters are young—about twenty—which is a reflection of the story of Alexander the Great. The worldbuilding definitely sprawls more, which makes it more adult-genre-ish. I worked really hard with my editor Miriam Weinberg to make the pacing strong and relentless, skills I had improved on through writing the YA trilogy.\nOne of the things fans love about your books is the worldbuilding. What makes worldbuilding engaging for readers? Or, how do you write great worldbuilding? And what are some of the worldbuilding elements that stand out for you in the new book?\nIn my experience, different readers like different things in worldbuilding. Some want the worldbuilding to stay in the background, to be skim-able, not to get in the way. Others (like me) love an immersive world, one that feels “real” as you read, as if you could actually walk through it and see the sights and smell the cooking and hear the street sounds and know the touch of the air. As a worldbuilder I try to build those elements by using glimpses into daily life and what those routines and pieces of material culture mean to the people of that world; and also through showing how people interact with others, because social relations tell us a lot about a culture and its views of the people who live within it.\nIn the Unconquerable Sun setting I wanted to write about a set of cultures whose understanding of ancient Earth (that is, the world they came from generations before) is as fragmented and limited as our understanding of an ancient culture like the Sumerians or Mohenjo Daro, of which we have bits and pieces that we try to put together to understand who they might have been. But we’ll never fully know.\nWhat excites you most about the new series, and what do you want readers to know about it?\nAll the Easter eggs hiding in the text.\nYou’ve mentioned that the book is influenced by the K-pop band Big Bang. Can you talk a bit about how this shows up in the book itself?\nI saw Big Bang in concert a few years ago and literally walked out of the concert with Channel Idol in my head, a combination news and entertainment channel created and run by the government as a propaganda arm to build and sustain unity among a people involved in a long-term military struggle. It’s right there, immediately in the first chapter, impossible to miss. I don’t want to say more because this is a theme and element that plays out across the trilogy.\nYour Kirkus review describes the book as action-packed and enthralling, edge of your seat. What is your approach to writing action?\nFirst, make the reader care about the characters so that, when the action starts rolling, the reader cares about the outcome. Action for action’s sake, a sequence of running or fighting (etc.), is not intrinsically compelling without character investment. Layer your characters’ emotional struggles and needs into how the action plays out.\nSecond, deploy the Tade Thompson Fight Scene Clarity Test. It boils down to this: Establish early the landmarks, so the reader knows where everything is. Reference those landmarks as needed so the reader knows where the characters are (and what weapons they have). Make the lines of emotional tension clear.\nThird, if you’re me, make sure you don’t interrupt action with tangents. If you need a quiet moment or a tangent, let any given sequence of action complete (however briefly) and use the quiet moment or tangent for breathing space before the next action sequence or as a way of putting a period on that particular bout of action. Vary the intensity. Don’t make it all one volume or speed. Use contrast, a pause for a whispered conversation or a sudden frantic race to a closing gate, to heighten the effect.\nBehind the scenes, you have actually mentored other authors who’ve become successful in their own right. What does it mean to be a good mentor, and how do new authors develop that kind of relationship with someone more established?\nI value so highly the connection between writing generations. Genre is always in conversation with itself. None of us pop up out of nowhere. The discussion constantly changes as new people come into the field while the global dynamic shifts around us. Change is bound to happen, and it has to happen to keep the genre alive and growing. A stagnant field is a dying field, and who wants that? I don’t. Someday, the evidence suggests, I will be dead, and I like the idea that the genre I’m part of stays alive as it grows from where it is now into something I won’t ever see.\nSo, it’s an honor for me to be able to do what I can to help aspiring writers of whatever age and young writers growing into their creative vision. Sometimes mentoring might simply be giving an encouraging word at the right time. Sometimes it involves reading a manuscript and offering critique. Sometimes a more experienced writer can give useful publishing advice to people who are struggling to figure out the basics of what to do and how to proceed. I was that new person once. The people who welcomed me and those who extended a helping hand made a difference in my career.\nWhat makes a good mentor? Mentoring can’t be about you, the mentor, but rather must be about the person you are mentoring and what they may need. Mentoring should reflect the historical and generational conversation we are all involved in, how we reflect on what came before, interact with what is going on now, and create hopeful possibilities for the future.\nHow does a new author develop that relationship? That’s tougher to answer. Often it can be a matter of acquaintance. Get to know people at conventions, conferences, or online. It’s okay to ask questions. Remember that some writers don’t have the time, energy, or inclination to mentor, which is fine. Others might feel comfortable enough with a new acquaintance or friend to ask them if they want advice or help—and by the way it is always okay to say no, in either direction. You don’t have to mentor if you can’t manage it. You don’t have to accept an offer of mentoring if it doesn’t feel right to you. Look for organizations that welcome newer writers (and make sure they are legit and not predatory); look for zines that publish new writers. SFWA (Science Fiction and Fantasy Writers of America) has a Mentoring Initiative, which you can check out here: www.sfwa.org/other-resources/for-authors/mentoring-initiative\nMore than anything, I’d say mentoring is about community.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/elliott_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Overthrowing the Royal We: A Conversation with Kate Elliott by Arley Sorg"}