{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "E+6pWDVK4l+e8Jv4xpNZhlw0L9A=", "id": null, "license": null, "comments": "", "raw_text": "Interview  The Ten-Year Journey: A Conversation with E. Lily Yu  In 2011 Clarkesworld published E. Lily Yu's short story “The Cartographer Wasps and the Anarchist Bees,” which was a finalist for the Dell Award. The genre community also took notice: the story earned her nominations for a Million Writers Award, a Hugo Award, a Nebula Award, a World Fantasy Award, and a Locus Award. In 2012 Yu won the Astounding Award for Best New Writer.  E. Lily Yu received her A.B. at Princeton, then a M.A. at Cornell. She attended the Sewanee Writers’ Conference as a Tennessee Williams Scholar, then Clarion West. In 2017 she received the Artist Trust/LaSalle Storyteller Award.  Roughly thirty stories later, appearing at a range of venues, such as Cicada, McSweeney’s, Tor.com, Boston Review, Hazlitt, Terraform, and F&SF, plus multiple appearances in Year’s Bests, Yu has developed a reputation for boundary-breaking fiction, wonderful prose, and thorough research. Creatively, she isn’t interested in limitations: she writes poems, plays, novels, essays, stories, songs. She has worked on video games such as Destiny and Destiny 2. Her 2015 Uncanny Magazine story, “Woman at Exhibition,” was part of the Discenza-Straub exhibition at the Contemporary Jewish Museum in San Francisco; more recently, she taught an Interactive Fiction seminar for Clarion West.  Her debut novel, steeped in research from books, Persian language study, detention center visits, travel, and more, is called On Fragile Waves, and it’s due from Erewhon Books February 2, 2021.   What were some of the most important books for you when you were younger?  Ten years ago, my touchstones were A. S. Byatt’s Possession, John Crowley’s Little, Big, Junot Díaz’s The Brief Wondrous Life of Oscar Wao, and Karen Russell’s Swamplandia!  If you mean much younger, to the best of my recollection, third and fourth grade were marked by Redwall, The Chronicles of Narnia, The Boxcar Children, Laura Ingalls Wilder, Lang’s Fairy Books, Watership Down, Roald Dahl, Dick King-Smith, Kenneth Oppel, Laurence Yep, David Clement-Davies, Jack London, Arthur Conan Doyle, Tamora Pierce, Tanith Lee, Diana Wynne Jones; sixth grade was Lilian Jackson Braun, Jane Yolen, Patricia C. Wrede, Piers Anthony, Garth Nix, Diane Duane; by seventh grade I’d read all the Discworld and Douglas Adams books, and started on Guy Gavriel Kay; by eighth grade Charles de Lint, Laurie R. King, Mercedes Lackey, Patricia McKillip, and Pamela Dean. I also hauled home the Windling and Datlow best-of-the-year anthologies throughout middle school, though I quickly learned to skip stories that only had Ellen’s initials on them.  How did reading become writing, and when did you start taking writing seriously?  Blow on dandelion clocks, you get dandelions.  I always knew.  Are there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?  The courage required.  I wish I knew.  You had several notable short fiction sales before attending Clarion West in 2013. Then there’s this burst of stories appearing in 2013. Did Clarion West have a significant impact on your career or your craft?  It usually takes between six months and two years for a story of mine to be published, so I’d written all but one of the stories that were published in 2013 before attending Clarion West. That said, I benefited greatly from the instruction I received there, and you’ll recognize several of my teachers’ and classmates’ names in the acknowledgments of On Fragile Waves. Clarion West has also provided community and support for as long as I’ve lived in the Seattle area, both before and after my time at the workshop.  What is your short fiction writing process—is it spontaneous, or carefully planned and executed with lots of editing? And has this process changed much since back when you were starting out?  It depends on the story. Solicited stories tend to be planned. Other stories fall at unpredictable intervals, like apples or meteors, to be picked up and cleaned and baked and pied—or forged into swords—when I have the time.  I have less and less time these days. Though no less love.  On Fragile Waves opens with poetry, using space, sound, and silence to immerse the reader in war as well as to relate the moments of childbirth. But you are far more prolific as a published short fiction writer than a poetry writer. What is your relationship to poetry? Is it more personal, harder to write, or are there other reasons you focus more on short fiction?  I still write poems, but I don’t try to publish them. Poetry is difficult to place and doesn’t pay well outside the biggest magazines. Sending out and tracking poetry submissions isn’t a good use of my limited time, unlike sending out fiction, or, better still, reading other people’s fiction and poetry. I read Siken’s Crush while working on line edits for this book, and your question reminds me to get Beloit Poetry Journal again. They do beautiful work.  Power and helplessness are explored in On Fragile Waves. In your Lightspeed Spotlight for “The Valley of the Wounded Deer,” when asked how that story started, you said, “First came, as it does to all, the experience of cruelty from those with power.” What draws you to exploring power in your fiction?  The mesh-like, self-perpetuating networks of power that infiltrate our lives, whether formal or cultural, are both the strongest determinants of our behavior and the most invisible, least understood part of our lives. The American system of racism is one such network; corporate hierarchies are another; the global private prison industry is a third.  The more we can see the strands in these networks, how they interact, and how they influence what we think, do, and say, the more we can think, act, and speak freely and wisely, if we choose. A clear understanding of power not only frees the individual but also protects communities. There are plenty of unethical people who do see and pull these strings for their own benefit. They rely on others’ refusal to see power to get away with unsavory and destructive behavior. For the most part, unfortunately, that works.  If you are unfamiliar with what I’m describing, ask yourself, in a specific situation: to whom do I give the benefit of the doubt? And why? What evidence, particularly patterns of past behavior, supports or does not support that choice?  In your 2020 Debuts interview you said that On Fragile Waves took seven and a half years to write, and that when you started you weren’t able to write it. What were the most challenging aspects of it, the things you had to learn or do in order to write this book?  When the shape of the book showed itself to me, I was twenty. I knew that I was not yet the person who could write it, but that I could become that person, if I was willing to pay the cost. I also knew I could walk away. No one forces you to wear out seven pairs of iron shoes. You put them on because there is something greater and more valuable than your comfort and safety, than the years of your life that are poured out, at the end.  I did not know the journey would take ten years. I did not know how thoroughly the book would break me. I threw out three drafts—one of them twice the length of the published version—and rewrote the entire book four times, twice in longhand. And when I finally became the writer and artist and human being that the book needed, when I was satisfied with my work and the book was complete, every single major and minor publishing house rejected it.  I had to make peace with the fact that the best thing I’d ever written most likely would never see the light of day. That was difficult. I made my peace with it. After a year and a half on submission, I thanked my agent for his tremendous efforts and unwavering kindness and told him I thought it was time to give up.  He refused.  The morning that “The Valley of Wounded Deer” was published, I got out of bed in Ottawa, in the home of a kind and talented writer who has walked a similar road, to find an email from my agent. He had some news.  It was another month before I believed him.  Looking over some of your prior interviews, I get the sense of you as a person who dives deep into research and likes to get hands-on and experiential, if possible. What were some of the things you found (or did) that didn’t make it into this book?  I started researching this book in 2010 and finished the last major draft in 2018. I’m afraid I have forgotten almost as much as I’ve learned, especially the Persian. I also had five interstate moves in that period, so my notes are in disarray, and I’m not sure I’ve retained all my notebooks. But being chased by a pair of snarling, red-eyed dogs down the muddy side of a hill fort in Kabul was certainly an unforgettable experience.  Do you have any advice for new writers?  Trust the still small voice at your center. It will advise you better than anyone else.  Is another book on the way? What’s next, what’s coming up for you, or what are you working on that you can tell readers about?  At the moment, I’m collaborating on a short opera with Steven Tran for the Seattle Opera, as part of their Jane Lang Davis Creation Lab. This too has been a longtime dream. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nThe Ten-Year Journey: A Conversation with E. Lily Yu\nIn 2011 Clarkesworld published E. Lily Yu's short story “The Cartographer Wasps and the Anarchist Bees,” which was a finalist for the Dell Award. The genre community also took notice: the story earned her nominations for a Million Writers Award, a Hugo Award, a Nebula Award, a World Fantasy Award, and a Locus Award. In 2012 Yu won the Astounding Award for Best New Writer.\nE. Lily Yu received her A.B. at Princeton, then a M.A. at Cornell. She attended the Sewanee Writers’ Conference as a Tennessee Williams Scholar, then Clarion West. In 2017 she received the Artist Trust/LaSalle Storyteller Award.\nRoughly thirty stories later, appearing at a range of venues, such as Cicada, McSweeney’s, Tor.com, Boston Review, Hazlitt, Terraform, and F&SF, plus multiple appearances in Year’s Bests, Yu has developed a reputation for boundary-breaking fiction, wonderful prose, and thorough research. Creatively, she isn’t interested in limitations: she writes poems, plays, novels, essays, stories, songs. She has worked on video games such as Destiny and Destiny 2. Her 2015 Uncanny Magazine story, “Woman at Exhibition,” was part of the Discenza-Straub exhibition at the Contemporary Jewish Museum in San Francisco; more recently, she taught an Interactive Fiction seminar for Clarion West.\nHer debut novel, steeped in research from books, Persian language study, detention center visits, travel, and more, is called On Fragile Waves, and it’s due from Erewhon Books February 2, 2021.\nWhat were some of the most important books for you when you were younger?\nTen years ago, my touchstones were A. S. Byatt’s Possession, John Crowley’s Little, Big, Junot Díaz’s The Brief Wondrous Life of Oscar Wao, and Karen Russell’s Swamplandia!\nIf you mean much younger, to the best of my recollection, third and fourth grade were marked by Redwall, The Chronicles of Narnia, The Boxcar Children, Laura Ingalls Wilder, Lang’s Fairy Books, Watership Down, Roald Dahl, Dick King-Smith, Kenneth Oppel, Laurence Yep, David Clement-Davies, Jack London, Arthur Conan Doyle, Tamora Pierce, Tanith Lee, Diana Wynne Jones; sixth grade was Lilian Jackson Braun, Jane Yolen, Patricia C. Wrede, Piers Anthony, Garth Nix, Diane Duane; by seventh grade I’d read all the Discworld and Douglas Adams books, and started on Guy Gavriel Kay; by eighth grade Charles de Lint, Laurie R. King, Mercedes Lackey, Patricia McKillip, and Pamela Dean. I also hauled home the Windling and Datlow best-of-the-year anthologies throughout middle school, though I quickly learned to skip stories that only had Ellen’s initials on them.\nHow did reading become writing, and when did you start taking writing seriously?\nBlow on dandelion clocks, you get dandelions.\nI always knew.\nAre there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?\nThe courage required.\nI wish I knew.\nYou had several notable short fiction sales before attending Clarion West in 2013. Then there’s this burst of stories appearing in 2013. Did Clarion West have a significant impact on your career or your craft?\nIt usually takes between six months and two years for a story of mine to be published, so I’d written all but one of the stories that were published in 2013 before attending Clarion West. That said, I benefited greatly from the instruction I received there, and you’ll recognize several of my teachers’ and classmates’ names in the acknowledgments of On Fragile Waves. Clarion West has also provided community and support for as long as I’ve lived in the Seattle area, both before and after my time at the workshop.\nWhat is your short fiction writing process—is it spontaneous, or carefully planned and executed with lots of editing? And has this process changed much since back when you were starting out?\nIt depends on the story. Solicited stories tend to be planned. Other stories fall at unpredictable intervals, like apples or meteors, to be picked up and cleaned and baked and pied—or forged into swords—when I have the time.\nI have less and less time these days. Though no less love.\nOn Fragile Waves opens with poetry, using space, sound, and silence to immerse the reader in war as well as to relate the moments of childbirth. But you are far more prolific as a published short fiction writer than a poetry writer. What is your relationship to poetry? Is it more personal, harder to write, or are there other reasons you focus more on short fiction?\nI still write poems, but I don’t try to publish them. Poetry is difficult to place and doesn’t pay well outside the biggest magazines. Sending out and tracking poetry submissions isn’t a good use of my limited time, unlike sending out fiction, or, better still, reading other people’s fiction and poetry. I read Siken’s Crush while working on line edits for this book, and your question reminds me to get Beloit Poetry Journal again. They do beautiful work.\nPower and helplessness are explored in On Fragile Waves. In your Lightspeed Spotlight for “The Valley of the Wounded Deer,” when asked how that story started, you said, “First came, as it does to all, the experience of cruelty from those with power.” What draws you to exploring power in your fiction?\nThe mesh-like, self-perpetuating networks of power that infiltrate our lives, whether formal or cultural, are both the strongest determinants of our behavior and the most invisible, least understood part of our lives. The American system of racism is one such network; corporate hierarchies are another; the global private prison industry is a third.\nThe more we can see the strands in these networks, how they interact, and how they influence what we think, do, and say, the more we can think, act, and speak freely and wisely, if we choose. A clear understanding of power not only frees the individual but also protects communities. There are plenty of unethical people who do see and pull these strings for their own benefit. They rely on others’ refusal to see power to get away with unsavory and destructive behavior. For the most part, unfortunately, that works.\nIf you are unfamiliar with what I’m describing, ask yourself, in a specific situation: to whom do I give the benefit of the doubt? And why? What evidence, particularly patterns of past behavior, supports or does not support that choice?\nIn your 2020 Debuts interview you said that On Fragile Waves took seven and a half years to write, and that when you started you weren’t able to write it. What were the most challenging aspects of it, the things you had to learn or do in order to write this book?\nWhen the shape of the book showed itself to me, I was twenty. I knew that I was not yet the person who could write it, but that I could become that person, if I was willing to pay the cost. I also knew I could walk away. No one forces you to wear out seven pairs of iron shoes. You put them on because there is something greater and more valuable than your comfort and safety, than the years of your life that are poured out, at the end.\nI did not know the journey would take ten years. I did not know how thoroughly the book would break me. I threw out three drafts—one of them twice the length of the published version—and rewrote the entire book four times, twice in longhand. And when I finally became the writer and artist and human being that the book needed, when I was satisfied with my work and the book was complete, every single major and minor publishing house rejected it.\nI had to make peace with the fact that the best thing I’d ever written most likely would never see the light of day. That was difficult. I made my peace with it. After a year and a half on submission, I thanked my agent for his tremendous efforts and unwavering kindness and told him I thought it was time to give up.\nHe refused.\nThe morning that “The Valley of Wounded Deer” was published, I got out of bed in Ottawa, in the home of a kind and talented writer who has walked a similar road, to find an email from my agent. He had some news.\nIt was another month before I believed him.\nLooking over some of your prior interviews, I get the sense of you as a person who dives deep into research and likes to get hands-on and experiential, if possible. What were some of the things you found (or did) that didn’t make it into this book?\nI started researching this book in 2010 and finished the last major draft in 2018. I’m afraid I have forgotten almost as much as I’ve learned, especially the Persian. I also had five interstate moves in that period, so my notes are in disarray, and I’m not sure I’ve retained all my notebooks. But being chased by a pair of snarling, red-eyed dogs down the muddy side of a hill fort in Kabul was certainly an unforgettable experience.\nDo you have any advice for new writers?\nTrust the still small voice at your center. It will advise you better than anyone else.\nIs another book on the way? What’s next, what’s coming up for you, or what are you working on that you can tell readers about?\nAt the moment, I’m collaborating on a short opera with Steven Tran for the Seattle Opera, as part of their Jane Lang Davis Creation Lab. This too has been a longtime dream.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/yu_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Ten-Year Journey: A Conversation with E. Lily Yu by Arley Sorg"}