{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JOQzoj8hevJUuQYUXhGvjuKbcGI=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Lockdown  From all of us here at Clarkesworld, we wish you good health in these difficult times, particularly those of you who share my designation of “high risk” due to medical or age-related reasons. Covid-19 is a part of our daily lives. It’s hard to avoid when you can’t leave your house. I live in NJ, the second most infected state in the country. We’ve been under lockdown for over two weeks and just had a CDC travel advisory slapped on us. My wife and youngest son are working from home and adjusting to what will likely continue for weeks ahead. Staying home is easy when it’s your choice. Knowing you have to is a constant reminder.  This isn’t the first time I’ve had a sword hanging over my head, but that doesn’t make it any easier. I try to keep my focus on the present: we’re alive, we’re healthy, and we’re together. We shouldn’t lose track of the good things. If you’re reading this on the first of the month, Lisa and I are celebrating our 25th wedding anniversary. We might not be able to celebrate the way we would have liked—with family and friends—but we can and will celebrate. I can’t stress enough, just how lucky I am to have Lisa in my life. Previous swords had me thinking I wouldn’t make it to this milestone, but here we are and it is wonderful.  By now, I expected to be burying myself in TV and movies, but that hasn’t come to pass. Instead there’s been a lot of cleaning and a yard reclamation project—taking it back from the encroaching thorn bushes and honeysuckle. It’s a distraction that provides some exercise and mindlessness. Throughout the month I’ve alternated between burying myself in work and being unable to focus on it. There have been weeks where every submitted story has been responded to in 24 hours or less, followed by 3-4 days of silence. I don’t like that, but I keep reminding myself that under the sword, you do what you have to.  This is a time where deadlines should be a lot more flexible. We already have enough stress, so this shouldn’t be adding more. I see too many friends being placed under additional and unnecessary pressure to meet deadlines from workaholic bosses who think everyone will deal with this situation the same way. I also see a lot of conventions canceling and announcing their intentions to go fully online. I worry for the front line folks, mostly volunteers, who have to turn these monsters into a reality when most of the people leading the efforts have no experience in this medium. If I learned anything from being an instructional designer, it was that you can’t replicate the traditional face-to-face experience online and you certainly can’t rush it.  Amusingly, after canceling my trip to ICFA—ahead of the convention itself being canceled—I started asking around to see what people would think about having some online panels. The enthusiasm was quite high, so there is a demand. Quietly, I’ve been working in the background and trying to work out a viable project for Clarkesworld. Later this month, I’ll be announcing a series of free online panels that we’ll be hosting over the course of a month. As the software for these things can get very expensive, we’ve settled on a solution that will allow for an overflow room on our YouTube channel if the audience is too big. The only difference for those people is that they won’t be part of the main audience chat room. The goal is to keep it casual and focused around short fiction. Charging a fee would establish expectations and pressure I’m just not interested in at this time. It also removes a barrier—paywall—that I don’t think is appropriate under the current conditions. This side project will also allow me to do one of the things I’ve spoken about previously: a panel for foreign authors who would like to learn more about submitting short stories and being published in the US.  And now I think it’s time to pick up the cutters and head into the backyard. There’s a thorn bush that wants to distract me from the chaos. Hopefully you’ll find your thorn bush in this issue and can forget for just a little while. Stay safe and may things be better for us all in the days ahead. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Lockdown\nFrom all of us here at Clarkesworld, we wish you good health in these difficult times, particularly those of you who share my designation of “high risk” due to medical or age-related reasons. Covid-19 is a part of our daily lives. It’s hard to avoid when you can’t leave your house. I live in NJ, the second most infected state in the country. We’ve been under lockdown for over two weeks and just had a CDC travel advisory slapped on us. My wife and youngest son are working from home and adjusting to what will likely continue for weeks ahead. Staying home is easy when it’s your choice. Knowing you have to is a constant reminder.\nThis isn’t the first time I’ve had a sword hanging over my head, but that doesn’t make it any easier. I try to keep my focus on the present: we’re alive, we’re healthy, and we’re together. We shouldn’t lose track of the good things. If you’re reading this on the first of the month, Lisa and I are celebrating our 25th wedding anniversary. We might not be able to celebrate the way we would have liked—with family and friends—but we can and will celebrate. I can’t stress enough, just how lucky I am to have Lisa in my life. Previous swords had me thinking I wouldn’t make it to this milestone, but here we are and it is wonderful.\nBy now, I expected to be burying myself in TV and movies, but that hasn’t come to pass. Instead there’s been a lot of cleaning and a yard reclamation project—taking it back from the encroaching thorn bushes and honeysuckle. It’s a distraction that provides some exercise and mindlessness. Throughout the month I’ve alternated between burying myself in work and being unable to focus on it. There have been weeks where every submitted story has been responded to in 24 hours or less, followed by 3-4 days of silence. I don’t like that, but I keep reminding myself that under the sword, you do what you have to.\nThis is a time where deadlines should be a lot more flexible. We already have enough stress, so this shouldn’t be adding more. I see too many friends being placed under additional and unnecessary pressure to meet deadlines from workaholic bosses who think everyone will deal with this situation the same way. I also see a lot of conventions canceling and announcing their intentions to go fully online. I worry for the front line folks, mostly volunteers, who have to turn these monsters into a reality when most of the people leading the efforts have no experience in this medium. If I learned anything from being an instructional designer, it was that you can’t replicate the traditional face-to-face experience online and you certainly can’t rush it.\nAmusingly, after canceling my trip to ICFA—ahead of the convention itself being canceled—I started asking around to see what people would think about having some online panels. The enthusiasm was quite high, so there is a demand. Quietly, I’ve been working in the background and trying to work out a viable project for Clarkesworld. Later this month, I’ll be announcing a series of free online panels that we’ll be hosting over the course of a month. As the software for these things can get very expensive, we’ve settled on a solution that will allow for an overflow room on our YouTube channel if the audience is too big. The only difference for those people is that they won’t be part of the main audience chat room. The goal is to keep it casual and focused around short fiction. Charging a fee would establish expectations and pressure I’m just not interested in at this time. It also removes a barrier—paywall—that I don’t think is appropriate under the current conditions. This side project will also allow me to do one of the things I’ve spoken about previously: a panel for foreign authors who would like to learn more about submitting short stories and being published in the US.\nAnd now I think it’s time to pick up the cutters and head into the backyard. There’s a thorn bush that wants to distract me from the chaos. Hopefully you’ll find your thorn bush in this issue and can forget for just a little while. Stay safe and may things be better for us all in the days ahead.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_04_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Lockdown by Neil Clarke"}