{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Peng Simeng; S Qiouyi Lu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "TH14aA3dZaT0fqQ0QMfvfO6frb8=", "id": null, "license": null, "comments": "", "raw_text": "1930 words, short story  The Love Letters  People say that when the Creator made All, everything was given a purpose.  But Asteroid I121522525121 seemed to have been left out of that grand plan. This asteroid resided between two prosperous galaxies, but it had never been established as a starport like its neighbors. It had only stone and no ore, only subzero chill and no atmosphere, only howling gales and no birdsong. If even a cutthroat interstellar merchant fleet scanned the asteroid’s identification number, they would be loath to send even an exploratory probe to the asteroid’s surface.  Swept along by the endlessly turbulent sandstorms on this worthless asteroid were countless lead capsules. These capsules were the asteroid’s only remarkable feature. In fact, they were the cause of many people’s misfortunes—in the commonly used interstellar positioning system, the coordinates for Asteroid I121522525121 were just one numeral off from those for humanity’s old home planet. In the era when people had to manually enter coordinates, countless spaceships sent precious interstellar message capsules cascading to the barren lands of the asteroid below.  The messages in these lead capsules were supposed to travel through space and reach the eager hands of their hopeful recipients, but instead they languish in this information graveyard. They dance and stop, stop and dance, until one day, when time itself is in ruins, they too will stand still.  Among these countless capsules are four that endlessly flutter and rest, the messages saved in their titanium-encrusted cores below:  Dearest Persephone,  I feel I must write you this letter. You won’t believe it: Right now, a magnificent red giant is flitting past the hull of my spaceship, washing the command room in a cozy blush. The various instruments cast twinkling shadows on the ground, where I lie looking up at the ceiling. If you were beside me, you would surely fall in love with the sights outside. Yet even the present me still appreciates this moment, for it reminds me of the sunset on the day I left home . . . That day, you rained kisses on me so softly; they still fall every time I enter my dreams.  I’ve already been on this solo mission for 142 days now, dearest; I’m not always this weak and needy.  I’ve already landed on sixteen constellations in succession, explored every planet that could possibly hold crystal, stone, or ore, but I’ve only found disappointment . . .  At every free starport, countless captains who have already been through this cycle of disappointment would seize my ear and drag me from the pub while bellowing: The minerals have all been stripped bare! No one will ever find another planet rich with high-grade ore!  But I would also meet some eccentrics like me—people still sailing interplanetary ships to the most remote corners of the universe. Hope twinkles in their eyes. They would share their trade secrets with me: routes and tricks for success, and I took them all to heart.  With the hope that those captains gave me, I was always able to track down some kind of lead. In a previous galaxy, I even found a massive, undeveloped vein of ore for the first time—with only two million more years, it would be fully formed! Ah . . . it truly was such a pity.  Still, this at least showed me that my search method was effective. I felt that surely I was going to strike it big and find a planet rich with ore soon. Then, I could modestly slip back home with a ship full of gold bits . . . Dearest, you don’t need to worry; when that time comes, I won’t become arrogant and shallow like others who find their fortune and became new money; they make me want to vomit.  Although I may be empty-handed now, this beautiful, boundless universe captivates me and soothes my restless heart. I’ve always wanted to roam the open seas of the universe, even before birth; you can imagine how much more excited I am to be here searching for precious minerals.  Of course, fate sometimes watches out for me—I narrowly missed an ion storm, and I haven’t encountered anything else as dangerous that would sink my ship. So please don’t worry about me. I’m becoming more and more familiar with my ship. With every day that passes, we are closer to becoming one. I’m also beginning to have a better understanding of this ocean of stars. I wish you were by my side to see these magnificent celestial bodies. They make you feel infinitesimally small, and yet inspire your infinitesimal smallness, too.  Dearest, I will most certainly bring back a ship full of treasures. I know I have no right to make you wait like this, of course. At the last free port, I ran into one of our mutual friends, Heliconia. He said that you were still waiting for me. Ah . . . I felt so moved and grateful!  Lisa and Kirikou are resting in the deposit cabin. I hope they don’t discover that their captain is lamenting his anguish on the control cabin floor, or else they’ll ridicule me—they truly do love to ridicule people, those two.  Tomorrow I’ll set sail toward the Bach galaxy. I hope I can strike it rich there. Dearest, wish me luck.  Missing you,  Hushan  November 6, 2802  Dearest Persephone,  I don’t know what time it will be when you receive this letter—will it be during dawn, sunset, or a meteor shower? Whenever you receive this letter, please trust that I am thinking deeply of you. I just left the Bach galaxy where I ran into a bit of luck. Guess what? I found a vein of ore! At the time, I thought I could leave right then to be by your side! We shipped ore to the nearest free port, but those damned graders said that the ore was of a mediocre quality.  We immediately registered the planet, sold off the mining rights, and got some cash for them, but honestly, it wasn’t much.  Faced with the tiny number in my bank account, what should I do? Should I split the cash with Lisa and Kirikou, sell off the spaceship, then rush back to your arms?  No . . . I can’t do that. I don’t dare to say that I’ve never thought of doing such a thing. Our jade-green lake and little boat—the little wooden boat we’d paddle on together keeps appearing in my dreams. My adventures in the universe have me even more convinced that I won’t be drifting for much longer. There’s got to be a day when I can return home to go boating with you on that jade-green lake. That will be my final resting place.  But I can’t return home like this, at least not now.  I’m convinced that my ore-finding method is foolproof now. I just need to patiently wait for Lady Luck’s favor.  Believe me, I will return to your arms and recount the tales of my adventures. But not now, definitely not now. If I were to return now, I would only seclude myself on the lake, sighing all day with the weight of my melancholy heart . . .  After I issued an order to continue searching for ore, I restocked our supplies and patched up the spaceship. We’re currently en route to the Berlioz galaxy.  Dearest, will you forgive my selfishness?  Hushan  May 2, 2803  Dearest Persephone,  The Berlioz galaxy is hell! But I’m still alive.  Squalls, yellow sand, knifelike sunlight—if I hadn’t turned the protection on my eyegear up to the maximum strength, I wouldn’t have been able to open my eyes at all.  Every night, I would have to bury the spaceship with sand to hide from thunderstorms, then set sail amidst mud-like acid rain at daybreak.  The people here weren’t exactly welcoming. Ha, they were insects nearly as large as me. They charged my spaceship in columns, their sawtooth-like teeth gnawing kakaka on the outside of the spaceship, leaving a series of holes in their wake. The insects chased us from one planet to another, that gnawing sound penetrating into my dreams, disturbing me from my boat on the lake.  But the most terrifying sound wasn’t the one from outside. Rather, it was the endless arguing from inside the spaceship. I insisted on combing all ten planets of the Berlioz galaxy, but, as the results sank us deeper into despair, my plan caused my crew to lose hope. But this kind of foolish plan is the only way to ensure that we won’t miss any ore. Am I in the wrong?  Lisa left in the end. She didn’t believe that we could continue. She didn’t part on good terms, and we didn’t even wish her farewell. If you see her, please take her by the hand and tell her in that warm way yours that I don’t resent her for it anymore. In fact, I’m grateful for the time she spent with us on our expeditions. I’m thinking that with your way with words, surely she’ll understand.  Kirikou is still with me. His courage and persistence exceeded my expectations. We’re preparing to go to the dark corner of the Mahler galaxy to try our luck. That’s the place with the highest rate of ore formation; why haven’t we been there yet? Were we concerned about the massive underwater monsters? But what could be worse than the insects from the Berlioz galaxy?  These days, I often forget what you look like, so I look at pictures of you, staring at each of them in turn. Memory is a strange thing: your likeness is hazy, but I always recall the warmth of your kiss, the softness of your hands, the enchanting scent of your rose perfume. These are all marked in my memory, still unfading.  I think it won’t be long until we meet again. Please, for one last time, wait a little longer for me.  Hushan  October 6, 2804  Fennie, Fennie . . .  There’s water everywhere. The aft has split open; something keeps battering the hull. Our fate has been sealed.  Kirikou has already stopped breathing. I’m so grateful for his faith in me! He supported me from the beginning to the end, right until the very last moment. He supported having an android like me as captain, but I failed to live up to his expectations! I’ve decided; my body will stay here with him in eternal rest.  Do you regret falling in love with an android? Did I fail to live up to your love, too? Ah . . . Dearest, I only have a little time left; I must transfer the backup of my consciousness kernel into a lead capsule. Please put it into a new body.  When you open this letter, I will have returned. I love you.  Hushan  December 16, 2832  The above are the full contents of the metal cores. They are sealed perfectly intact inside those four capsules, chasing each other through vicious storms in their lonely dance, through the silent darkness, through endless gales.  These four capsules tumble with hundreds of thousands of others swirling through air thick with capsules. No one knows about them, and no one will know what is written in these capsules, what is hidden in them. They are carried by the long river of time. When, after the last person who can decipher these contents has died, only the grim rays of the universe will occasionally shine on these capsules, illuminating each tiny scratch on their titanium surfaces.  Until the river of time carries them to the very end.    Originally published in Chinese in Science Fiction World, February 2018.    Translated and published in partnership with Storycom.  Peng Simeng is a science fiction writer who used to work as a product manager in Tencent, the biggest internet company in China. A themed collection of her works has appeared in one of China's top SF magazines, Science Fiction World. Her novella \"Beast Boxing\" won honorable award in the 2017 Douban Read Writing Competition. She is currently studying in the Creative Writing master program at Beijing Normal University.", "text": "1930 words, short story\nThe Love Letters\nPeople say that when the Creator made All, everything was given a purpose.\nBut Asteroid I121522525121 seemed to have been left out of that grand plan. This asteroid resided between two prosperous galaxies, but it had never been established as a starport like its neighbors. It had only stone and no ore, only subzero chill and no atmosphere, only howling gales and no birdsong. If even a cutthroat interstellar merchant fleet scanned the asteroid’s identification number, they would be loath to send even an exploratory probe to the asteroid’s surface.\nSwept along by the endlessly turbulent sandstorms on this worthless asteroid were countless lead capsules. These capsules were the asteroid’s only remarkable feature. In fact, they were the cause of many people’s misfortunes—in the commonly used interstellar positioning system, the coordinates for Asteroid I121522525121 were just one numeral off from those for humanity’s old home planet. In the era when people had to manually enter coordinates, countless spaceships sent precious interstellar message capsules cascading to the barren lands of the asteroid below.\nThe messages in these lead capsules were supposed to travel through space and reach the eager hands of their hopeful recipients, but instead they languish in this information graveyard. They dance and stop, stop and dance, until one day, when time itself is in ruins, they too will stand still.\nAmong these countless capsules are four that endlessly flutter and rest, the messages saved in their titanium-encrusted cores below:\nDearest Persephone,\nI feel I must write you this letter. You won’t believe it: Right now, a magnificent red giant is flitting past the hull of my spaceship, washing the command room in a cozy blush. The various instruments cast twinkling shadows on the ground, where I lie looking up at the ceiling. If you were beside me, you would surely fall in love with the sights outside. Yet even the present me still appreciates this moment, for it reminds me of the sunset on the day I left home . . . That day, you rained kisses on me so softly; they still fall every time I enter my dreams.\nI’ve already been on this solo mission for 142 days now, dearest; I’m not always this weak and needy.\nI’ve already landed on sixteen constellations in succession, explored every planet that could possibly hold crystal, stone, or ore, but I’ve only found disappointment . . .\nAt every free starport, countless captains who have already been through this cycle of disappointment would seize my ear and drag me from the pub while bellowing: The minerals have all been stripped bare! No one will ever find another planet rich with high-grade ore!\nBut I would also meet some eccentrics like me—people still sailing interplanetary ships to the most remote corners of the universe. Hope twinkles in their eyes. They would share their trade secrets with me: routes and tricks for success, and I took them all to heart.\nWith the hope that those captains gave me, I was always able to track down some kind of lead. In a previous galaxy, I even found a massive, undeveloped vein of ore for the first time—with only two million more years, it would be fully formed! Ah . . . it truly was such a pity.\nStill, this at least showed me that my search method was effective. I felt that surely I was going to strike it big and find a planet rich with ore soon. Then, I could modestly slip back home with a ship full of gold bits . . . Dearest, you don’t need to worry; when that time comes, I won’t become arrogant and shallow like others who find their fortune and became new money; they make me want to vomit.\nAlthough I may be empty-handed now, this beautiful, boundless universe captivates me and soothes my restless heart. I’ve always wanted to roam the open seas of the universe, even before birth; you can imagine how much more excited I am to be here searching for precious minerals.\nOf course, fate sometimes watches out for me—I narrowly missed an ion storm, and I haven’t encountered anything else as dangerous that would sink my ship. So please don’t worry about me. I’m becoming more and more familiar with my ship. With every day that passes, we are closer to becoming one. I’m also beginning to have a better understanding of this ocean of stars. I wish you were by my side to see these magnificent celestial bodies. They make you feel infinitesimally small, and yet inspire your infinitesimal smallness, too.\nDearest, I will most certainly bring back a ship full of treasures. I know I have no right to make you wait like this, of course. At the last free port, I ran into one of our mutual friends, Heliconia. He said that you were still waiting for me. Ah . . . I felt so moved and grateful!\nLisa and Kirikou are resting in the deposit cabin. I hope they don’t discover that their captain is lamenting his anguish on the control cabin floor, or else they’ll ridicule me—they truly do love to ridicule people, those two.\nTomorrow I’ll set sail toward the Bach galaxy. I hope I can strike it rich there. Dearest, wish me luck.\nMissing you,\nHushan\nNovember 6, 2802\nDearest Persephone,\nI don’t know what time it will be when you receive this letter—will it be during dawn, sunset, or a meteor shower? Whenever you receive this letter, please trust that I am thinking deeply of you. I just left the Bach galaxy where I ran into a bit of luck. Guess what? I found a vein of ore! At the time, I thought I could leave right then to be by your side! We shipped ore to the nearest free port, but those damned graders said that the ore was of a mediocre quality.\nWe immediately registered the planet, sold off the mining rights, and got some cash for them, but honestly, it wasn’t much.\nFaced with the tiny number in my bank account, what should I do? Should I split the cash with Lisa and Kirikou, sell off the spaceship, then rush back to your arms?\nNo . . . I can’t do that. I don’t dare to say that I’ve never thought of doing such a thing. Our jade-green lake and little boat—the little wooden boat we’d paddle on together keeps appearing in my dreams. My adventures in the universe have me even more convinced that I won’t be drifting for much longer. There’s got to be a day when I can return home to go boating with you on that jade-green lake. That will be my final resting place.\nBut I can’t return home like this, at least not now.\nI’m convinced that my ore-finding method is foolproof now. I just need to patiently wait for Lady Luck’s favor.\nBelieve me, I will return to your arms and recount the tales of my adventures. But not now, definitely not now. If I were to return now, I would only seclude myself on the lake, sighing all day with the weight of my melancholy heart . . .\nAfter I issued an order to continue searching for ore, I restocked our supplies and patched up the spaceship. We’re currently en route to the Berlioz galaxy.\nDearest, will you forgive my selfishness?\nHushan\nMay 2, 2803\nDearest Persephone,\nThe Berlioz galaxy is hell! But I’m still alive.\nSqualls, yellow sand, knifelike sunlight—if I hadn’t turned the protection on my eyegear up to the maximum strength, I wouldn’t have been able to open my eyes at all.\nEvery night, I would have to bury the spaceship with sand to hide from thunderstorms, then set sail amidst mud-like acid rain at daybreak.\nThe people here weren’t exactly welcoming. Ha, they were insects nearly as large as me. They charged my spaceship in columns, their sawtooth-like teeth gnawing kakaka on the outside of the spaceship, leaving a series of holes in their wake. The insects chased us from one planet to another, that gnawing sound penetrating into my dreams, disturbing me from my boat on the lake.\nBut the most terrifying sound wasn’t the one from outside. Rather, it was the endless arguing from inside the spaceship. I insisted on combing all ten planets of the Berlioz galaxy, but, as the results sank us deeper into despair, my plan caused my crew to lose hope. But this kind of foolish plan is the only way to ensure that we won’t miss any ore. Am I in the wrong?\nLisa left in the end. She didn’t believe that we could continue. She didn’t part on good terms, and we didn’t even wish her farewell. If you see her, please take her by the hand and tell her in that warm way yours that I don’t resent her for it anymore. In fact, I’m grateful for the time she spent with us on our expeditions. I’m thinking that with your way with words, surely she’ll understand.\nKirikou is still with me. His courage and persistence exceeded my expectations. We’re preparing to go to the dark corner of the Mahler galaxy to try our luck. That’s the place with the highest rate of ore formation; why haven’t we been there yet? Were we concerned about the massive underwater monsters? But what could be worse than the insects from the Berlioz galaxy?\nThese days, I often forget what you look like, so I look at pictures of you, staring at each of them in turn. Memory is a strange thing: your likeness is hazy, but I always recall the warmth of your kiss, the softness of your hands, the enchanting scent of your rose perfume. These are all marked in my memory, still unfading.\nI think it won’t be long until we meet again. Please, for one last time, wait a little longer for me.\nHushan\nOctober 6, 2804\nFennie, Fennie . . .\nThere’s water everywhere. The aft has split open; something keeps battering the hull. Our fate has been sealed.\nKirikou has already stopped breathing. I’m so grateful for his faith in me! He supported me from the beginning to the end, right until the very last moment. He supported having an android like me as captain, but I failed to live up to his expectations! I’ve decided; my body will stay here with him in eternal rest.\nDo you regret falling in love with an android? Did I fail to live up to your love, too? Ah . . . Dearest, I only have a little time left; I must transfer the backup of my consciousness kernel into a lead capsule. Please put it into a new body.\nWhen you open this letter, I will have returned. I love you.\nHushan\nDecember 16, 2832\nThe above are the full contents of the metal cores. They are sealed perfectly intact inside those four capsules, chasing each other through vicious storms in their lonely dance, through the silent darkness, through endless gales.\nThese four capsules tumble with hundreds of thousands of others swirling through air thick with capsules. No one knows about them, and no one will know what is written in these capsules, what is hidden in them. They are carried by the long river of time. When, after the last person who can decipher these contents has died, only the grim rays of the universe will occasionally shine on these capsules, illuminating each tiny scratch on their titanium surfaces.\nUntil the river of time carries them to the very end.\nOriginally published in Chinese in Science Fiction World, February 2018.\nTranslated and published in partnership with Storycom.\nPeng Simeng is a science fiction writer who used to work as a product manager in Tencent, the biggest internet company in China. A themed collection of her works has appeared in one of China's top SF magazines, Science Fiction World. Her novella \"Beast Boxing\" won honorable award in the 2017 Douban Read Writing Competition. She is currently studying in the Creative Writing master program at Beijing Normal University.", "source": "https://clarkesworldmagazine.com/peng_11_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Love Letters by Peng Simeng, translated by S. Qiouyi Lu"}