{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Baoshu; Andy Dudak", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "RM+xzYsDorkh4NjxHyDpAwKWi1E=", "id": null, "license": null, "comments": "", "raw_text": "10830 words, novelette  Niuniu  1  Dong Fang still clearly remembers the joyous love of that rainy night.  It seemed quite bad at first. After three years of dating and two years of marriage, their formerly shy and sweet explorations had become routine business. Nevertheless, he was in the mood that night. At 11:00 p.m. he turned off the light and got in bed. He embraced Shen Lan’s voluptuous form, and she lazily accepted this. He poured curious requests in her ear, but she refused, her patience waning. She said she was tired and told him to hurry up and finish so they could sleep.  Dong Fang put forth his argument: “You used to promise me things. How can you break your promises?”  He’d forgotten this was not a matter to be reasoned out. Sure enough, Shen Lan launched her counterattack: “You promised me things too, and what came of it? And now you have the nerve to ask me to . . . ”  Contending with each other, they soon found new territory in the conjugal bed, from division of housework to their mortgage, from premarital promises to demanding parents-in-law. Dong Fang finally stormed out of the bedroom and went to the study to play a VR game. He massacred aliens to drain off his resentment.  After the game, Dong Fang removed his helmet and heard a thunderclap through the rain-battered window. He rushed into the bedroom to find Shen Lan awake, as expected, covering her ears, curled up with a blanket and tear-soaked pillow. Dong Fang knew she was afraid of thunder. She had been since childhood. And how long had she been in torment tonight? He had a soft spot for this phobia of hers, and declaring surrender, he pulled her into his arms.  “I’m sorry,” he said. “Don’t be afraid, it’s okay.” Weeping, Shen Lan beat him with light, quick blows.  “It’s all your fault,” she said. “I hate you so much!” Yet she accepted his embrace with fervor. Their bodies relaxed, and then they were twisting together and growing once more taut, like drawn bowstrings. Thunder and lightning swept over the city. Gale winds howled between buildings. Raindrops beat windowpanes. With mixed love and hatred, they dashed against each other, collided, fused, and clung to life’s summit.  They hadn’t been so deeply satisfied in a long time and wouldn’t be for ages to come. So, Dong Fang is certain: that was the night they conceived Niuniu.  Returning from work at 8:30, he opens their front door and sees little Niuniu amusing herself beside Shen Lan’s foot. She sees him, is immediately beaming and standing awkwardly. She staggers toward him, shouting, “Papa!” She grabs the hem of his jacket and he knows she wants to be held. He sets down his briefcase and picks her up, lifts her high. Niuniu shrieks excitedly, showing two rows of just-grown-in teeth.  “Careful,” Shen Lan says. “Please don’t drop our child!” Dong Fang reassures her, and she says, “Hey, didn’t you notice?”  “Notice what?”  “She can walk! Yesterday she could go two or three steps at most. You saw her do more just now! She can go from one end of the room to the other.”  Dong Fang puts Niuniu down and she starts walking straightaway. She can indeed stride, performing with a high and mighty air, though her knees still don’t bend properly, so she can only proceed swaying comically like a penguin. After a few steps she goes down, but luckily a floor mat cushions her fall. She gets up and changes direction, circling back around toward her parents.  Shen Lan shakes with laughter. Dong Fang gives a perfunctory smile, which gradually solidifies on his face, but Shen Lan doesn’t notice. “Such a clever child!” she says, nudging him. “In a few more days she’ll have the run of the room.”  “Or close to it,” Dong Fang says, unable to stop himself. “Isn’t it like this every time?” He immediately regrets it.  Shen Lan’s smile vanishes. Her gaze goes gloomy and cold. Dong Fang wants to say something to allay the mood, but there’s a muffled thump behind him. Niuniu has stepped on a stuffed animal and fallen. This time the fall was heavy. She banged her head, and now she’s wailing. Shen Lan pushes past Dong Fang. She picks up and hugs the child. “It’s okay darling. Mama’s here.”  “Mamama,” Niuniu babbles, burying her face in Shen Lan’s bosom.  Shen Lan goes on consoling her. She lowers her head to kiss the child, hair cascading like a waterfall to tickle Niuniu’s face and provoke giggles. Dong Fang finds the whole tableau repellant. He stands in the far corner of the living room, watching mother and daughter. In the faint lamplight, it’s like a scene of the Virgin Mary holding baby Jesus to her breast.  2  They knew they were having a girl with the first B ultrasound. Hospital regulations didn’t permit them to ask, but it was only set up that way to increase “gray income” for doctors. The parents-to-be didn’t broach the subject, but the doctor hinted. Although there were things the hospital wasn’t allowed to reveal, if one wanted to know, it wasn’t impossible. After that he was silent. Actually, Dong Fang didn’t especially want to know, but not asking seemed like it would be rude. So, he flashed a hundred yuan, and when the doctor didn’t take it, he fished out another hundred.  The doctor said, “Your child will take after her mother. Good news either way I think, boy or girl, but of course if you don’t want her, there is something we can do.”  Dong Fang didn’t value boys over girls, not as far as he knew himself. He didn’t think male or female made much difference. This child was coming fast. He’d been dizzy since finding out. But after learning he would have a daughter, he couldn’t help feeling disappointed. He realized he’d been hoping for a son, deep down, for father and son racing VR cars at breakneck speed, battling alien monsters, pursuing the interests of boys and men. It was difficult to understand what a daughter would mean to him.  Shen Lan, however, was quite happy. Back outside, she said a girl was fine by her. A few days before, she’d thought of an especially nice girl’s name: Dong Qingwan, indicating the child would be beautiful like the famed poet and courtesan Dong Xiaowan. The name also stealthily incorporated a line of verse from the Book of Songs: “There was a beauty all alone, pure . . . qing, and graceful . . . wan.”  Dong Fang, not won over, said, “A boy could have a good name too. For instance . . . Dong Shixuan?”  “What a mess,” Shen Lan said. “Why not Dong Shizhang? A kid named ‘chairman of the board . . . ’”  Dong Fang laughed in exasperation. Gazing out the car window on the way home, he buried his nonexistent son Dong Shixuan.  As for the childhood pet name, Shen Lan had another good idea: Wanwan, unique and pleasant to the ear. The name actually moved Dong Fang, as though a pretty and mild girl already stood before him. At that moment, he couldn’t help recalling the first time he’d seen Shen Lan. They’d been at university then. It had been a rainy day, and he’d come out of the library and spotted a young woman in a gauzy dress standing inside the entrance colonnade, sheltering from the rain. Her long hair lightly drifted. Faint anxiety was written on her face. She was like a lily in misty rain. Dong Fang couldn’t help stopping to look, and their gazes met. There seemed to be an expectation in the young woman’s eyes, but she turned away shyly. Dong Fang’s feet felt drawn toward her as if by magnetism. He didn’t normally strike up conversations with female students. Also, he wouldn’t know what to say. Maybe I could walk with her a bit? he thought. But no, she might be waiting for a friend, or even a boyfriend. Who knew? Such a beautiful girl was not likely to be single. He chuckled bitterly, and deciding against folly, turned to leave.  Now Dong Fang marvels at life, at how two people’s fates—no, three people’s—can be decided in an instant. If he indeed left that rainy day, everything would be different. Perhaps he would have emigrated, or gone down south. Then he would not have come to this city and married this young woman named Shen Lan. Of course, Niuniu would never have existed, and all that followed would not have happened.  The smart kettle issues a gentle, happy note, indicating the water has boiled. Dong Fang emerges from foggy memories. He pours water in the baby’s bottle, then mixes in powdered milk. Niuniu drinks powder imported from Australia, and the water is purified. It has to be maintained at forty-five degrees. A difference of a few degrees won’t do. Of course, these are not Niuniu’s demands. She could make do with anything, but Shen Lan’s standards are high, bordering on immoderate.  “About done?” Shen Lan calls from the bedroom. “Niuniu is quite hungry.”  The milk is not yet mixed. Dong Fang, in a fit of agitation, considers hurling the bottle at a wall and smashing it to pieces—but he endures. He shakes the milk until it’s ready and takes it to the bedroom. Niuniu has just been bathed. She’s playing with Shen Lan on the bed, rolling about and sucking her finger. She sees him coming with the bottle and sits up, bright-eyed. Dong Fang is a few seconds late handing the bottle over, and she starts crying. Shen Lan hastily takes the bottle. She holds Niuniu and lets her suckle. Niuniu drinks, glancing sidelong at Dong Fang, tears still streaming. There seems a sly and cunning light in her eyes.  3  Niuniu grew up on milk. Shen Lan’s milk was lacking, and though she tried breastfeeding at first, the child was always up late fussing and crying. Husband and wife believed she was sick until they realized she was just never full. Finally, they started relying on milk powder. It was probably guilt that drove Shen Lan to shop online for expensive overseas powdered milk, while still breastfeeding as much as possible.  Their daughter’s formal name was fixed as Dong Qingwan, but her childhood pet name soon changed from Wanwan to Niuniu. They’d hired a nanny for the first month confinement, and this woman, according to a naming custom of her home province, called her Niuniu now and then. Dong Fang’s parents were also staying with them at the time, helping to look after the baby. They loved the new name and started using it. Dong Fang followed suit. Maybe it was because Wanwan sounded too profound and elegant, suitable for the tender sentiment of a lover, but not quite fitting for a little girl, far inferior to the light, catchy cliché that was Niuniu. Shen Lan wasn’t crazy about this. She announced her daughter’s “primary pet name” was still Wanwan, that Niuniu was merely “secondary.” After this declaration, she herself started using Niuniu. No one spent further thought on primary versus secondary names.  Child-rearing was difficult and joyous. Days seemed like years, yet they were fleeting. Niuniu could laugh, Niuniu could roll over, Niuniu could sit up. Dong Fang and Shen Lan watched their daughter go from plump little larva to crawling kitten, then a walking, talking girl who liked pretty clothes and admiring herself in the mirror. Almost every day there was a pleasant new surprise. Dong Fang had felt he couldn’t be close to a daughter, but he immediately loved the little lady. Niuniu also got stuck on him. Seeing her papa, she would smile sweetly. A hug from him could stop her wailing. Sometimes she even needed his company to sleep, which made Shen Lan quite jealous.  That was their family’s golden age. Later, Dong Fang often wondered when it started to go amiss. Perhaps it was that day in the café.  Niuniu had just turned one. A client had made an appointment to meet with Dong Fang, but was late. Dong Fang, waiting in the café, saw a secondhand book on a bookshelf titled Niuniu. Amused, he read a bit while drinking coffee. It turned out to be the book he most regretted opening in his life, a writer narrating his daughter’s story. The girl was born with an incurable disease and passed away just after one year old. Dong Fang, after turning a few pages, felt something was wrong. Terrified, he dropped the book like a hot potato.  Back at home, he began calling his daughter Wanwan. Shen Lan asked him why, and he avoided answering. But after a couple days, he began to feel ridiculous. How many girls under the sun were called Niuniu, after all? And what was in a name, in sharing a name? But a few days later, Niuniu went to hospital for a checkup, and Dong Fang was filled with dread. By the time he got the results, he was weak in the knees.  Of course, it was all for nothing. Niuniu couldn’t have been healthier. He let go of senseless fear and started calling her Niuniu again. She continued to grow on schedule, merging harmoniously with her parents’ life. Impartially, she could not be reckoned beautiful. She was a few centimeters shorter than children her age, her hair sparse, eyes not large, nose a bit sunken, but what did these things matter? She was adorable beyond description when she smiled, and could melt anyone’s heart. She was the product of that rainy evening’s tender affection. It was as if Dong Fang and Shen Lan had met entirely for the sake of birthing the world’s most enchanting fairy.  And now, as before, she drinks milk.  She plays awhile, turns to her father for a bit, then pats her mama, and at last slowly closes her eyes. Her long lashes hang down. She nestles against her parents and sleeps. Shen Lan gazes into her hand device awhile, then turns off the light and closes her eyes. But Dong Fang can’t sleep. He listens in the dark. Shen Lan’s irregular breaths gradually tend toward even and long. When he judges her sound asleep, he gathers up Niuniu and gets out of bed.  In the bathroom, he turns on the light. Niuniu opens her eyes, not fully awake. Her little mouth opens and says, “Papa.”  Dong Fang reassures her and changes her diaper. There is no mess, of course. The white milk remained in her body awhile, then just drained out. She has not defecated. If she did, cleanup would be only slightly more complicated. It would come out in a long, narrow piece, but dehydrated and lacking any foul odor. In fact, raising this creature could be much simpler. For instance, they don’t need to feed her at all, but Shen Lan insists on it.  Diaper changed, he takes Niuniu to the sofa and places her on his lap, facing away. Niuniu fusses, twisting her body, babbling, fiddling with her feet. Dong Fang reaches for the back of her head. In her delicate hair, he flips something twice. The back of her head pops open, revealing a deep battery compartment. He digs out the two batteries, leaving her head half empty. Niuniu’s vitality is gone. Her body goes limp. She falls over in his lap.  When he first started changing her batteries, his hands would weaken or tremble. But for a long time now, he’s been doing the job with the ease of experience. He puts the batteries in their charger, goes to the closet, retrieves two spares, and returns to the sofa. But instead of replacing her batteries, he just stares down at her little body, lying there motionless, just like on that day of finality. Dong Fang suffers a familiar unease. He struggles to escape it, but he’s already being dragged into a swamp of memory and anguish.  4  It happened the day before Niuniu’s second birthday.  Her paternal grandfather and grandmother were coming over for her birthday, so Shen Lan decided to clean the apartment. Unfortunately, the nanny had asked for leave that day. Dong Fang was working overtime, so Shen Lan was on her own caring for the child while doing housework.  A tiny drone followed Niuniu, always hovering a meter or so before her eyes. The drone was the size of a hummingbird, with a cam on top. This hummingbird device had been developed mainly for monitoring children. Not all nannies were reliable, and parents, naturally treasuring their children, liked being able to keep a continual eye on things and set their minds at ease. Of course, it was good for more than that. The cam fed to Dong Fang’s office computer. He could check the window at the bottom of his screen at any time. Halfway across the city, he could see his daughter’s smiling face and be reminded why he was earning money—for a good kindergarten next year, for instance—and thus renew his diligence.  So, Dong Fang and Shen Lan saw what happened simultaneously.  Niuniu was on a plastic mat in the living room playing with smart blocks. These newly developed toys could shape-shift and assemble on their own, becoming fantastic oddities of every sort. They had been occupying Niuniu for two hours straight, allowing Shen Lan to feel at ease doing housework. And the hummingbird was on duty. If anything dangerous were about to happen, it would issue an alarm.  In order to sweep, Shen Lan had dragged a chair to the bay window. She’d also opened the casement for ventilation.  After a while, Niuniu lifted her head toward the window. An interesting notion clearly flashed through her mind. She giggled, stood up, and rushed over, babbling nonstop. Dong Fang saw this, but the hummingbird was aimed at Niuniu’s face, not the back of her head. He couldn’t see her aim, and he wasn’t paying much attention anyway, with a financial report on hand urgently needing completion.  Niuniu had never climbed on to a chair before. Moreover, the bay window was childproofed with a guardrail. By any measure, an accident was nearly impossible. But Niuniu had been growing every day, getting stronger. She climbed on to the chair, and from there was able to climb over the guardrail. She went to the window ledge, toward unfamiliar territory, toward exploration. By the time Shen Lan saw what was happening, Niuniu had one foot across the sill. She stepped on to the open casement. There was no barrier between her and the outside world. Having accomplished these virtuoso maneuvers, she was quite pleased with herself. Turning toward Shen Lan, she smiled sweetly. “Mama!” she called out, wanting Shen Lan to witness her magnificent feat.  Shen Lan turned, saw the shocking tableau, and rushed toward her daughter. In two or three steps she reached the bay window and grabbed for Niuniu’s arm. Meanwhile, at work, Dong Fang’s gaze drifted to the hummingbird window. He saw, and his trembling hand dropped a mug of coffee, which shattered on the floor.  Tragedy still might have been averted, but just then the hummingbird made a mistake. Its expert system finally judged Niuniu to be in danger. It flashed a piercing red light and a sharp, blaring alarm. This had an effect opposite to what was intended. Niuniu flinched away from the noise and light, toward the outside.  Her delicate balance was broken.  Her tiny form vanished from the seventh-floor window. Shen Lan reached for her tiny hand and grabbed air.  Shrieking, Shen Lan collapsed beside the window.  And yet, she was somewhat luckier than Dong Fang, who followed Niuniu with the diving drone, in mute witness to his daughter’s final moments. The building exterior rushed past the lens. Pedestrians and vehicles swiftly loomed, like a horrifying special effects scene in a movie. Niuniu’s eyes reflected the white clouds above. She still didn’t understand what was happening, but was clearly terrified, flailing her limbs, mouth open to cry out. Always before, crying had conjured loved ones, a tender embrace and care.  This time, it wasn’t to be. Earth rushed toward the lens. A heavy crashing sound followed. Niuniu’s expression was forever frozen in that moment before crying out. Scarlet quickly filled the other side of the frame.  Remembering all of this now, Dong Fang is on the verge of collapse. He supports himself on the tea table beside the sofa. He closes his eyes and opens them again. Closed, his daughter back then. Open, this Niuniu on the sofa before him. They are the same, almost impossible to differentiate.  But Niuniu is dead, Dong Fang thinks. Cremated, interred by him personally. But her image is always here, unceasingly calling to mind what he can’t stand recalling. Day in and day out, year after year. What kind of cruel life is this? Why does he still endure it?  Fury wells up. He grabs the little girl’s neck and lifts her off the sofa with one hand. “You’re not my Niuniu,” he says, fuming. “You never were. You’re fake. You’re a scam!”  He wouldn’t have to squeeze hard to snap her neck, the weakest part of her body. But the delicate neck has human body temperature, if no pulse. The girl’s eyes are closed. Her face is peaceful, like in sleep or repose in utero. No one could be hard-hearted enough to hurt such a weak child, whether she’s real or fake.  The strength drains from Dong Fang’s arm. Sighing deeply, he tosses her back on the sofa. He loads the spare batteries into her head, cursing under his breath, and closes the panel. Niuniu comes to life, turns over, crawls toward him calling, “Papa, Papa . . . ” For a long time now, this voice has been like a siren’s song, bewildering him, enticing him toward time’s abyss.  “You’re not Niuniu,” Dong Fang murmurs. “You can’t fool me anymore.”  Niuniu blinks innocently, and again says, “Papa.”  5  After the accident, most of the pressure came down on Shen Lan’s head. Niuniu had fallen on her watch, after all. Police took her away amid her neighbor’s whisperings. She stared blankly, like she didn’t understand what had happened. She was nearly prosecuted for homicide by criminal negligence, but the police eventually abandoned this.  Dong Fang met her as she came out, hair disheveled, in a trance, wan and sallow, almost otherworldly.  “Dong Fang,” she said, seizing his arm and weeping, “you have to believe me. It wasn’t on purpose. I really didn’t expect . . . I was so foolish. I just want to die. Your parents surely blame me, right? Do you blame me?”  Dong Fang turned away and hoarsely said, “Forget it. All of this is fate. As for my parents . . . well, I’ve spoken with them. They’re going back to their hometown.” He didn’t mention his father’s hypertension flare-up and hospitalization.  “That’s fine then.” Shen Lan seemed to relax and breathe, dabbing at her eyes. “So how is Niuniu? At the hospital, right? Will she be scarred from the fall? She hasn’t seen me for a few days. Does she miss me?”  Dong Fang stopped in his tracks, stunned and staring at his wife.  “What’s wrong? Is there something on my face?”  “Don’t tell me you don’t know. Niuniu . . . ”  “Never mind,” Shen Lan interrupted, growing nervous. “I’m sure she’s alright. At home waiting for me, right? We should get back. Let’s hurry. Let’s go home.”  Dong Fang briefly dared to think it was his own mistake. Niuniu was fine, nothing had happened. It had been a nightmare. In a trance, he followed Shen Lan home, earnestly hoping to see the nanny holding Niuniu. But there was no trace of her. Her diapers, clothes, toys, and drawing pads were scattered everywhere. It seemed she would jump out from her bedroom or from behind the sofa at any moment. He hadn’t dared stay at home the past few days. Everything was as it had been before the accident. Shen Lan entered, and without taking a moment to rest, began putting things in order.  She even started cleaning Niuniu’s toys.  Dong Fang composed himself and gathered his resolve. “Lan, what are you doing? Niuniu is . . . she’s . . . ” He couldn’t say it.  “She went with your parents.” Shen Lan looked up at Dong Fang. “And they’ll return in a few days, right?” Her tone was superficially calm, yet contained a faint tremor. There was desperate hope in her eyes, like someone dying of thirst begging for just one drop.  Dong Fang wanted to shout at her to stop. He wanted to curse her and vent his fury. “Stop fooling yourself!” he wanted to scream, but in the end he averted his gaze. “Yeah, they’ll take care of her awhile, then bring her back.”  He called an old classmate who now worked in a psychiatric ward, seeking advice on his wife’s situation. The classmate said Shen Lan was in temporary denial. If he could just keep from provoking her, she would get better after a while.  Dong Fang understood Shen Lan. He could barely accept the truth himself. But time would expose all illusions, heal all wounds, and make everyone face the truth. She just needed time.  Not long afterward, he was passing by that café and suddenly decided to go in for another look at Niuniu. Intriguingly, this book that had so frightened him before now gave him consolation. His Niuniu had gone fast, in an instant. She wouldn’t have known anything or thought anything. Everything had just ended. From her perspective it had been like going to sleep. She wouldn’t have suffered. At least she was more fortunate than the girl in the book, tortured by serious disease.  Years later, he reckons life is just unceasing death.  He sometimes sees photos of his two- or three-year-old self, or recalls his parents’ tales of that time, but he can’t remember any of it. He lived in a small southern town back then. The first language he learned was a pleasant-sounding Wu dialect, but at age four he moved north with his parents. He spoke standard Mandarin for a long time. Sometimes he returns to his hometown and hears the old dialect and barely understands it.  The Dong Fang of that time—innocent and young, full of southern colloquialisms—no longer exists, naturally. They’re all gone: childhood Dong Fang, adolescent Dong Fang, even pre-Shen Lan Dong Fang. If Niuniu had lived, she would be six or seven years old, vivaciously attending school—not this wobbly-walking infant. So, the Niuniu of back then is as good as dead, replaced by a series of new Niunius. What is there to feel bad about?  But Dong Fang knows this for sophistry.  He has lost many Niunius, not just one. Three-year-old Niuniu, five-year-old Niuniu, ten-year-old . . . it’s like they’ve fled against the flow of time, sweeping past Dong Fang and Shen Lan, faces unclear, one after another, back into the unrecoverable past, back to that plummeting child, and vanished like smoke. Life is so long, Dong Fang thinks. In the future, he will have more brushes with Niunius who might have been . . . fifteen-year-old Niuniu—no, at that point she would be called Dong Qingwan—twenty-year-old Dong Qingwan, thirty years old, forty. They’ll have their lives and careers, dispositions and attachments, and joys and griefs as they sweep by, passing from the points in time he would have met them, returning to the past, to that tragic moment, the instant in which they ceased to exist.  But he finds a kind of solace in this pain. It’s as if there’s another world where Niuniu is growing to adulthood. Perhaps the world, at that tragic moment, split in two. In one, Shen Lan grabbed Niuniu, averting the horror that might’ve followed. Unfortunately, he fell into the other world and is thus separated from Niuniu. They’re gradually getting further apart, never to meet again. But in each other’s worlds, they will both have new lives.  Nothing like the one he’s currently living.  Niuniu still fidgets next to him. Dong Fang twists her ear half a turn and she falls asleep. He installed this shortcut without telling Shen Lan. She couldn’t bear him treating this “daughter” like a toy.  He carries her back to the bedroom and lays her down. Shen Lan blearily embraces her. Niuniu needs a battery change once a day. She can also charge up directly, but that takes longer. Changing batteries is visually unpleasant but necessary. Dong Fang can only do it when Shen Lan sleeps. For years now, she has never awakened during these changings. He sometimes feels she is deliberate in this, or at least subconsciously conspiring.  She can’t face the truth, though she’s well aware of it.  Dong Fang lies down beside them. He stares into impenetrable darkness and can’t sleep most of the night. It’s not the first time, and it’s getting more common. Every time, the insomnia comes with a name, the name of someone who has never existed—yet it won’t fade from his mind.  Dong Shixuan.  6  The second time Dong Fang thought of this name was half a year after Niuniu passed.  For him, Shen Lan’s hysteria was not entirely a bad thing. He could at least escape his grief in psychology and psychiatry texts, seeking a way to cure his wife. The first step was to pack up Niuniu’s things. He told Shen Lan he would send them to his parents’ place, since Niuniu’s stay there was becoming extended. Shen Lan didn’t stop him, nor did she contact her in-laws to request a video call with Niuniu. Dong Fang sensed his classmate had been right. Deep down, Shen Lan knew what had happened. She just couldn’t accept it.  With Niuniu’s things and toys packed up in a dozen or so boxes, Dong Fang found he couldn’t throw them out like he’d meant to. It was too painful. He finally put them in a corner of the storage room. Shen Lan brought up Niuniu less and less. For a long time, she just stared at the photos of Niuniu on the wall. Dong Fang eventually sounded her out on taking them down, and she said nothing.  Later, he saw her staring at the blank wall and wiping away tears.  Neither of them mentioned Niuniu’s death, but Dong Fang sensed Shen Lan had accepted the fact of it. Their home was restored to its pre-Niuniu state. Dong Fang recalled their life before her, not so long ago, yet seemingly a lifetime past. In his sadness, Dong Fang also knew a bit of ease. Their marriage had returned to its starting point. They could set off on the journey once more.  He began propositioning Shen Lan. She was not enthusiastic, but she allowed nature to take its course. They continued that way once or twice a month, colorless unions, meager fare, indifferent, both parties mostly silent, as though all desire was dead and all that remained was desire’s corpse. Yet in bed, the marriage more or less recovered its most fundamental significance. They were no longer new parents, just a man and woman, not so old, able to find temporary happiness in each other’s bodies. Of course, Dong Fang began to wonder if something else might result.  He didn’t know when it started, but the name Dong Shixuan was on his mind by then. He thought perhaps it was not merely a name, but a premonition. Perhaps he could still bring this child into the world and quell their pain. Perhaps Niuniu and all that had happened was a mere interlude, and Dong Shixuan would be the resplendent symphonic movement. A boy named Shixuan, meaning “imposing man.” It might not be a boy, of course. Change out the characters and Shixuan became “daylily poem.” A boy or girl could rescue their life.  A . . . new . . . child.  But giving birth to a child was not yet a formal item on their agenda. Dong Fang knew it wasn’t urgent, and that Shen Lan wasn’t ready yet. The predestined child would have to wait for a better opportunity to come into their lives. He began to carefully plan an ocean cruise for them. It would start in the southern Pacific, including numerous island nations and enriching their experience with foreign customs. They had originally planned this as their honeymoon trip, but due to a shortage of funds, they’d abandoned it. Now, with the plan revived, Shen Lan’s enthusiasm was immediately apparent. Dong Fang saw the luster of youth return to her eyes, which had long been dormant. This excited him further. For many days they discussed what they should bring, where they would go, what they would do for fun, what they would eat, and talking of happy times they were filled with laughter, like two children.  Dong Fang yearned for this dreamlike trip. They would spend two months in warm southern winds, passing across blue, refreshing seas, accompanied by cetaceans during the day and the dazzling Milky Way by night. They would land on foreign coasts and appreciate radically different lifestyles. They might even make love on tempestuous seas, or kiss on uninhabited white beaches. Life would glow with splendor once more and soar over new horizons.  One night, three days before they were to set off, Dong Fang was working overtime to get everything done before the trip. Around 9:00, after numerous meetings, he was finished, and discovered an unfamiliar number had called him seven or eight times. He’d had his device on mute. He tried to call back but couldn’t connect. He didn’t pay this much mind. Most likely it was a work matter. He just hoped it wouldn’t interfere with the trip.  He returned home, not in the least on guard. He opened the door to find a middle-aged woman standing before him, hair gone partially white, vaguely familiar, a relative perhaps.  “You’re . . . ”  The woman smiled faintly. “Mr. Dong, don’t you remember me?” Her voice was deep and rich, singularly magnetic, and quite familiar, very like his paternal grandmother’s.  Suddenly he knew where he’d met her. It had been almost a year ago. He had nearly come to think of it as a dream.  Dong Fang said, “You . . . you’re . . . don’t tell me . . . ”  “Papa!”  A child’s voice behind the woman, young and tender and resonant.  It couldn’t have been more familiar. It had invaded his dreams thousands of times, woke him with a start at midnight to find tears on his pillow. Dizzy, forgetting all else, he went like a sleepwalker toward the voice. The woman moved aside conscientiously. Dong Fang saw Shen Lan standing there, cheeks tearstained, yet smiling beautifully. She was hugging a small girl. This child called him “Papa” and extended tiny arms toward him.  “Niuniu,” he heard himself say, “Niuniu! Niuniu!”  He dropped his briefcase and rushed toward mother and daughter. He embraced them, crying. In that moment he was happy beyond words. Work, travel, Dong Shixuan, all were unimportant. Niuniu had returned. The vanished era of joy had returned. His family was complete again. This was life’s highest and only meaning.  But all that was four years ago, and he’d been wrong.  Opening his eyes, Dong Fang thinks: I was gravely mistaken.  He finally got to sleep around five or six in the morning. Now it’s close to nine. Luckily, it’s Saturday and he doesn’t have to work. He hears the child’s piercing voice in the kitchen. Dong Fang goes out and sees breakfast leftovers on the table. Niuniu has eaten. Shen Lan is putting a pretty pink dress on her, meaning to take her downstairs to play in the park. Niuniu dances with anticipation. It’s a familiar scene to Dong Fang.  Mama, kitty cat! Dong Fang thinks.  “Mama,” Niuniu says, pointing out the door, “kitty cat!”  She wants to go out and see the cat. Actually, she can’t distinguish between cats and dogs. Shen Lan croons a lively song, placing Niuniu in the stroller. She buckles the safety belt and kisses the child’s forehead.  Tee hee!  “Tee hee,” Niuniu laughs.  Oh oh oh oh!  “Oh oh oh oh!” Niuniu happily hoots.  Now wave your hands.  Niuniu lifts her arms, excitedly flailing them. Dong Fang knows each seemingly careless movement and vocalization is controlled, precise as mathematics.  “Lan,” he can’t help saying, “we need to talk.”  “When we get back, okay?” She squats to adjust Niuniu’s clothes as the child fusses in the stroller.  Dong Fang wants to say more but resists. Irritation washes over him like background noise. He sees a bright red apple on the table and picks it up. He brings it toward his mouth.  Shen Lan rushes over and snatches it. “Come on! I’m bringing it for Niuniu. Are you competing with your daughter for food now?”  Dong Fang can no longer suppress his annoyance. “Daughter?” he blurts. “Whose daughter?”  “Are you crazy?” Shen Lan says, not meeting his gaze as she heads out. “What are you smoking, anyway? What are you talking about?”  “You know what I’m talking about. She’s not really your daughter. She’s not really a . . . person.”  Shen Lan’s glance is dismal. “Don’t go there,” she says, voice low but firm, “not now. To me she is Niuniu, and that’s good enough.”  Dong Fang finally erupts: “Stop fucking lying to yourself, okay? Niuniu wasn’t doomed to be an infant forever! Niuniu couldn’t retract teeth after growing them! She didn’t learn to walk then go back to crawling! We both know this is just a machine, a doll! You still take her to the park . . . don’t you know what the neighbors and security guards say about us behind our backs? I’ve had enough!”  Dong Fang’s uproar triggers bawling from Niuniu. She extends her little arms, seeking her mother’s bosom. Shen Lan hastily retrieves her from the stroller, softly consoling her. Niuniu sees her mother’s tears and gets even more upset. Dong Fang’s fury is extinguished, as if by a bucket of water. There’s still steam, but the fire is out. Tender, fatherly love refills his heart. He knows this is a misconception, but he can’t help it. And he hates himself all the more for it.  Wiping away tears, Shen Lan glares at him. As though evading terrible danger, she hugs Niuniu and goes out the door, kicking it closed with a bang. Dong Fang listens to her footfalls rapidly fade.  How did it come to this? he wonders. It all began with a seeming miracle. Niuniu came back, didn’t she? But the price was dreadful. Now they’re trapped in a long-gone past, unable to escape, as if they’ve fallen into the warped space-time of a black hole.  If he hadn’t taken that woman’s offer in the first place, everything might have been different.  7  On the day he interred Niuniu’s ashes, it was also raining. Shen Lan was in no condition to join him, and his parents were unwell. Dong Fang was on his own, managing everything. He didn’t know how he was sustaining the rush to get it all over with.  After the cinerary casket had been entombed, a heavy rain fell from the sky. Dong Fang stood gazing at the photo of Niuniu that had just been affixed to the façade. This is her home from now on, he thought. Can the rain get in? Will Niuniu freeze? Will she be afraid if she hears thunder? Can she reach out for a hug in there? No one would come and hold her anymore. No one would tuck her in at night. Would she be wondering how to come home? Could she find her way home?  The rain soaked his clothes. Tears flowed, mingling with rainwater. Soon he was weeping and choking.  Someone patted his shoulder and gave him a tissue. Dong Fang looked up to see a silver-haired woman holding an umbrella. She wore a gray pantsuit, and her face was kind. “Are you alright sir?” she said.  Dong Fang guessed she worked for the cemetery. “My daughter is dead,” he sobbed. “She wasn’t even two.”  The woman sighed. “I’m sure she was precious to you.” Her voice was slightly husky, sonorous, reminding Dong Fang of his long-gone paternal grandmother.  She led Dong Fang into a lobby. Not sure why, he began telling her Niuniu’s story. From mother’s womb to the ultimate fall, he said it all, things he didn’t wish to recall, things only Niuniu’s parents would be interested in. He’d kept it all inside for too long. He certainly hadn’t been able to talk to Shen Lan. The more he talked now, the more he wanted to say, and the less he could control himself. The woman listened, now and then passing him a tissue.  It took quite a while to say it all. He began to calm down. He wiped away tears and forced an embarrassed smile. “Sorry Miss. I think I’ve been wasting your time.”  “It’s fine,” she said. “I actually came here to find you.”  Dong Fang was nonplussed. “Excuse me?”  “Listen, if I were to tell you there’s a way to see your Niuniu again, how would that be?”  Dong Fang stared a bit. His temper rose and he glared at the woman. “What the hell do you mean?”  Not alarmed, the woman said, “I’m not just trying to make you feel better in this moment, and I’m not out of my mind. I have a way for you to see Niuniu again . . . an exact copy of her.”  “How is that possible?” Saying this, Dong Fang suddenly understood. “Hold on! You can’t be talking about an artificial person?”  The woman nodded.  He knew artificial person tech had been developing a long time. Several years before there’d been a breakthrough, combining a metal skeleton, an AI chip, and a fabricated human tissue exterior. The result was a living robot that could pass as human. At first welcomed by the marketplace, this tech soon developed a bad reputation: most consumers were ordering custom-made beauties, young men and women for satisfying secret longings. As one might imagine, some satisfaction modes were quite abnormal, giving rise to many controversies. Some models were even meant to resemble celebrities. These and other types meant to mimic real people led to legal disputes. Finally, the government prohibited artificial person production. But demand was still high. An underground industry persisted. Dong Fang had never imagined these things would have anything to do with him.  He recovered his faculties. “Sorry, I don’t need that. She wouldn’t be a real person.”  “Of course not,” the woman said, compellingly unperturbed, “but you wouldn’t be able to tell the difference. You said when you close your eyes you still see her. I guarantee our Niuniu would be an exact replica.”  An exact replica. Dong Fang shook his head. “It’s impossible.”  “Not at all. You just have to provide enough viable image data. Our modeling is precise. Using the latest nanometer-grade 3D printing tech, we control every detail of skin and hair . . . I won’t bore you with the technical details. Suffice it to say, you’d see her sweet smile, you’d hear her call you Papa, she would kiss your cheek, hold your hand as she learned to walk, and play. She would be with you forever, never to be taken away again.”  Dong Fang backed up a few steps, as if his daughter were rushing toward him, laughing and happy. He waved a hand, dispersing this sweet illusion. “But . . . she wouldn’t be real.”  “That’s true,” the woman said, patient and unflappable, “but she’d still be a three-dimensional photograph, a living sculpture. Wouldn’t that be the best possible commemoration of Niuniu?”  “It’s still a no.” Dong Fang struggled to resist ever-greater enticement. “I know producing an artificial human is very expensive. We don’t have that kind of money.”  The woman smiled, as if she’d anticipated these grounds for refusal. “Not as pricey as you might think. Quite doable for you. Moreover, you wouldn’t need to pay anything up front. You just register, transfer Niuniu’s data to us, and sit tight. We send the new Niuniu to your residence, and you pay later. Unsatisfied in any way? Return her within a month and pay nothing.”  “Then aren’t you operating at a huge loss?” Dong Fang couldn’t fathom their business model.  “Not to worry.” The woman smiled sincerely. “Customer satisfaction is our highest priority.”  In the end, Dong Fang surprised himself by registering. He sent all his photos and videos of Niuniu to the appointed web address. He waited, but it was like the company had vanished into thin air. There was no further news. Dong Fang reckoned the underground factory had been raided and shut down. Luckily it hadn’t touched him.  He soon forgot the matter.  Until the night he found that woman in his home and came to understand why she hadn’t taken advance payment: there was almost no risk to this business. Seeing a loved one return, nobody could return the goods, even if it meant bankruptcy.  And the cost was indeed high. They had to cancel their travel plans, in addition to maxing out several credit cards. But what did these things matter? Little Niuniu had returned. They were immersed in bliss for an entire year.  Shen Lan’s child-rearing glow returned, and their former life trajectory recapitulated. Niuniu seemed to grow all over again, from baby to young child, slowly learning to walk and master a few simple words and phrases. But one day she was back to where she’d started.  Dong Fang called to inquire about this. An imitation person was a machine, in essence. With imitation children this was all the more evident: they couldn’t really grow. At best, the machine skeleton could expand or contract in limited ways. Muscles could transform somewhat, teeth could emerge from and retreat into the gums. A one year old could grow to look two or so, at most. Of course they couldn’t grow up. AI algorithms with limb and trunk control made limited change possible, from crawling to walking, babbling to a few simple sentences, but this sort of development was unsustainable. In the end, the machine could be fixed at its terminal stage, or cycled back and allowed to “grow” once more. Shen Lan chose the latter, perhaps because it meant more child-rearing pleasure.  It has been four years since the new Niuniu’s arrival, four growth cycles.  During the first year, Dong Fang’s love of the child was no less than it had been toward the real Niuniu. His feelings cooled during the second year, but he was still quite taken with her. In the third year he grew wearier of the game, day by day. Finally, in this fourth year, he feels he will soon go mad. It’s like he’s fallen into a restless, never-ending time loop. Niuniu, having just learned to walk, goes back to self-satisfied crawling. She learns to speak, and just like that forgets it all. Every day recapitulates what happened on the corresponding day in years one, two, and three, and even five years ago with the real Niuniu.  But the days crawl on, his hair going gray, his parents having passed away. And that lifelike person, forever between one and two years old, never to grow up, plays ever more preposterous parent-child games with them. And when will such days end? When will he and Shen Lan be able to see the future?  Shen Lan is still invested. She has no problem repeating the cycle. With a machine to take care of, she doesn’t even want a second pregnancy. “Let’s wait awhile,” she always says. “Now is not the time.” Of course, Niuniu is stuck at the age she most needs care. Her needs will never end because she will never grow up. The opportune moment to get pregnant, to create Dong Shixuan, is endlessly postponed. Perhaps it will never come.  There has to be a conclusion. This morning, it couldn’t be clearer to Dong Fang. This absurd game is consuming their lives, and nonexistent Dong Shixuan’s life.  It must end.  8  Shen Lan is gone for a long time. Dong Fang calls and no one answers. She doesn’t come back with Niuniu until late afternoon. The door opens and the tiny form comes waddling in. “Papa! Papa!” she shouts, throwing herself into Dong Fang’s arms. She has obviously forgotten Dong Fang’s morning rant. Of course, she doesn’t really remember anything, running on fixed routines.  Dong Fang picks her up, harboring mixed emotions. Shen Lan comes toward him, expression serene. “You wanted to talk? Let’s talk.”  Dong Fang puts Niuniu down and points at the smart blocks on the floor. Niuniu rushes over in high spirits and starts playing. Dong Fang leads Shen Lan into the study, partially shutting the door. “Sorry,” he says, “my words might be a bit jarring, but that child is—”  “Relax, I’m not crazy. I know she’s not a real person. But so what? Dammit, Dong Fang, can’t you just let me raise her like a little pet?”  “If she really was a pet, that’d be fine! But you treat her like a daughter! You call her Niuniu, you give her powdered milk just like Niuniu . . . our Niuniu . . . used to get, with the same high-end dietary supplements, the same fruit and veg . . . she doesn’t need any of it! You get her the best toys, you take her out for walks, you cuddle her to sleep, you work harder than a nanny! Lan, you’ve neglected your career for four years, to stay at home and wait upon an artificial person. Don’t you think it’s a bit much?”  “A bit much? I just really like Niu . . . really like her. I like caring for her. What’s wrong with that? You often neglect food and sleep playing your VR games, don’t you?”  Dong Fang doesn’t know how to respond to this incongruous analogy. “I like her too, you know that. I’m not opposed to having her in our home, but we’re not young anymore. We need to start a new life. A better life. I’ve wanted a child all these years, a boy or a girl, one who isn’t Niuniu, who can grow up and go to school. But you . . . every time I . . . ”  “I want another child too.” Shen Lan’s voice begins to tremble, tears flowing. “I want a child who can grow up. But I keep thinking . . . with a new kid growing up and going to school, and us with a new life, what will become of Niuniu? There won’t be time to care for her. How will the new child regard this older sister? Don’t tell me we would treat her like an old toy, throw her in a closet, take her out for Spring Festival and other holidays. We can’t do that to her.”  “Here we go again.” Dong Fang is shaking. “You keep thinking of her as a real person. You keep considering her feelings. That’s precisely your problem. She’s not real! She can’t even be regarded as an android.”  “Nonsense. She might not be too clever, but she’s a . . . like Niuniu . . . I don’t know how to say it.”  “I do. Subconsciously at least, you feel she’s alive. Like in those scifi movies, a robot with human nature. But it’s delusional. She’s just a machine, and not even a clever one!”  Shen Lan’s gaze is cold. “Whatever. I don’t see it.”  “Fine.” Dong Fang nods. “I’ll prove it to you. I’ll show you what this child really is!”  He pulls up a video on his device. “Remember? This was five years ago, our Niuniu playing with those shape-changing blocks. She built a little pyramid, and we praised her cleverness. Now look at this Niuniu. She’s doing the same thing, like two peas in a pod. Look, almost exactly the same, movement for movement! Look . . . drops the blue block and picks it back up. See? Isn’t it exactly the same?”  Shen Lan, growing pale, looks from the video to her proximate Niuniu.  “This is the truth!” Dong Fang says. “Four years ago, I transferred all videos of Niuniu to that underground factory, all that we recorded, and thousands of hours from the hummingbird, nearly half her life. They restored Niuniu based on this data. Her appearance, obviously, but also inside. Later I researched the tech, the big data analysis, the psychological modeling, core personality reconstruction . . . it’s deceiving, sly nonsense. They just took all the content and put it in a database. Simple instructions mix these ready-made responses. For instance, see Papa and run for a hug, see Mama and want to suckle, like that. At best, minor adjustments are carried out based on the environment. This Niuniu is neither a person nor an AI. She has no personality. She’s just . . . it may sound funny . . . a 3D video of Niuniu’s life.”  “A video . . . ” Shen Lan sneers, as if fundamentally refusing to believe.  “Yes, a video! Honestly, this past year I’ve been watching her very carefully. Everything she does, every movement, replicates something Niuniu did. Whenever she’s in an environment corresponding to back then, she proceeds based on the source video. The data is rich, of course, so it’s not easy to perceive at a glance. For instance, Niuniu has about a dozen anger modes. For crying, it’s thirty odd. Laughing, more than fifty. Combine all the types and the number gets astronomical . . . but it’s all based on our Niuniu, on what happened to our Niuniu. There’s nothing new. It’s all replication! Reconstruction! But because infants at this stage of development are all generally similar . . . in their language, movement, and reactions . . . we don’t really perceive it.”  A breathless Dong Fang, having rendered his verdict, notices Shen Lan isn’t as shocked as he imagined she would be. “Is that all?” she says dully.  “It’s not enough?”  “I already knew! I mean it’s ridiculous. How long did you take care of her? What about me? You left early every morning and came home late. I was by her side all day. You really think I didn’t notice her speech and actions were completely identical to Niuniu’s? You think her underlying mechanisms weren’t obvious to me? Everything you’ve said I already knew. But all that is why I love her.”  “But that’s ridiculous!”  “Don’t you understand?” Shen Lan nods at the little girl amusing herself beyond the glass door. “If she were some top-notch imitation human, with independent personality and emotion algorithms, maybe I wouldn’t feel like this. But she’s a time machine. She takes us back to those times with Niuniu. Every word, every movement, every smile, all just like Niuniu’s. We never let go of Niuniu. She’s been with us all along.”  9  Dong Fang glares at his wife, panic-stricken. It was like he couldn’t recognize her. For a while he was at a loss. “So you really do know all this, better than me. You know but choose to stay in the past, seal yourself away in memories of Niuniu . . . but why, ultimately?”  “How about an example?” Shen Lan smiles bitterly, wretchedly. “Maybe you don’t know, but one time back then, Niuniu woke from a nap and no one was with her. The nanny had not arrived, I was in the shower with music, and she cried, louder and louder, getting terribly desperate, practically passing out from crying. After a while I just barely heard her. I didn’t even get dressed, just rushed out to pick her up. I consoled her for an hour, and she just wouldn’t quit crying. Well, not long ago, this scene happened again. I heard her calling out, the cadence the same, every undulation precise! It was Niuniu calling out again. What could I do? Just like back then, I went out and picked her up and consoled her. In that moment, she was my daughter. I’ve noticed you growing colder toward her over the past couple years. I noticed long ago. Cold, even cruel. But she still loves you. Still so attached to you. Regardless of how hard she’s crying, one hug from you does the trick. This wouldn’t be possible with another child, and why? Because she is our Niuniu from back then. She loves you as Niuniu did. There’s no difference at all! She loves you way more than she loves me. How can you let her down?”  “This is . . . ” Dong Fang suffers vertigo. Can it be that Niuniu has really traversed time? Has she come back to him via this artificial body? No, it’s irrational. He can’t be deceived. “Don’t try to fool me like you fool yourself. No matter how accurately she recreates Niuniu’s actions and speech, she has no real feelings, no inner life. She’s a shadow, a reflection. You and I can’t keep watch over a shadow our whole lives. We have to let her go.”  “You don’t get it. I can’t let her go. To each their own. Just don’t try to force me, okay?”  “How about you don’t force me?” Dong Fang roars, driven beyond forbearance. “Of course I know you can’t let her go. I’ve talked to psychologists. I know why. Because that day, which we never bring up—”  “Don’t say it!” Shen Lan interrupts, voice trembling.  “I could leave it alone, but we’re both well aware, aren’t we? That day Niuniu fell, it was entirely your—”  “Don’t you say it!” Shen Lan is growing frenzied. Niuniu turns to regard them with doubt and fear.  Shen Lan heads for the living room, but Dong Fang pulls her to a halt and firmly shuts the study door. It’s a special kind of glass, soundproofed, so Niuniu can’t hear them. She stares a few seconds more, then returns to her solitary play.  “Still not ready to face it?” Dong Fang says, ruthless, unaware of his secret thrill, as if a long-confined demon is finally breaking free: “You’ve sealed yourself off in a year of Niuniu memories, but you never visit that last day. Because you can’t go there, you just go ’round and ’round, repeating the cycle, raising her over and over. But it’s useless. We’ve always lived inside that day! We can’t leave it, and I’ve fucking had enough. This is your problem now. Why should I keep following you? You’ve got to face it, head on! Now! Face it!”  Shen Lan struggles in his grip. “What do you mean?” She looks into the living room, avoiding Dong Fang’s gaze. “Why’d you put the chair there? What is this? What do you want from . . . ”  Dong Fang clicks a remote control, and the casement of the bay window drifts open. This gets Niuniu’s attention. Her computer chip brain rapidly conducts a database search, finds a matching section of memory, activates a movement subroutine.  She stands up and waddles toward the chair.  “You fucking psycho!” Shen Lan cries. “What are you doing? Let go of me!”  Dong Fang maintains his grip, his other hand covering her mouth. He feels demonic, but he’s a joyful demon. “You have to face this! Face everything you created! I can’t bear the load forever! Look! Look! That day . . . your stupidity led to our daughter’s death!”  Niuniu can’t hear them. In no time she has climbed on to the chair. Then she climbs the guardrail, and she’s in the window bay. Dong Fang saw it with his own eyes back then. Now he sees it from a new angle, as if he’s time-traveled back to that day five years ago. Shen Lan stares, dumbfounded and paralyzed. This is the penultimate scene, Dong Fang thinks. Soon it will really be finished, and they’ll be able to start over.  Goodbye Niuniu. This time for real. Goodbye.  Niuniu climbs on to the windowsill. She looks over her shoulder, smiling sweetly at her parents. Dong Fang suddenly realizes he forgot something. This time there is no hummingbird drone, no final trigger of tragedy. Let it be, he thinks. Maybe this is enough.  Amid this distraction, Shen Lan renews her struggle, breaks free, pushing him into a bookshelf. She flings open the door and charges toward the window.  “Niuniu!”  She leaps the railing and lands on the window bay. She reaches for the girl on the windowsill. In that moment, she too has crossed endless time, back to the decisive moment five years before, meaning to change the iron fact of tragic predestination. Face savage, moved by maternal instinct, she has resolved to prevail, to change everything.  And this triggers Niuniu’s final reaction.  Seemingly terrified, shrinking from Shen Lan, she leans back.  “No!” Shen Lan shrieks. Five years ago, after a similar wail, she fainted. When she woke, the police cruiser had arrived downstairs.  But this time is different.  Without hesitation, Shen Lan puts a foot beyond the windowsill, pouncing outward. This time she seizes Niuniu, but it’s too late. Embracing the little girl, she turns her head, seeming not to understand what’s happening. Dong Fang, who has just rushed out of the study, briefly meets her gaze. A moment later, the hem of her fluttering dress vanishes over the windowsill.  Dong Fang hears himself screaming. He stumbles toward the window, hears a horrible, muffled sound. Leaning out the window, he sees Shen Lan far below, so small, lying on the road, her dress going scarlet, the redness expanding. Niuniu lies prostrate on top of her mother, howling, seemingly unaffected by the impact. People close in.  Before losing consciousness, Dong Fang sees a faint smile on his wife’s face.  10  On that rainy day, the young woman in white had become small with distance.  On that fateful day, young Dong Fang had gone quite far with his umbrella when he turned around, timidly gazing at the girl. She was hazy beyond the intervening fine rain. Mind made up, he headed back. Putting one foot in front of the other, treading through puddles, he drew closer, heart beating faster, as if it would burst from his chest into her embrace. He wasn’t sure if she saw him coming because he couldn’t look up. He would have to talk to her. May I accompany you home? Or could I lend you my umbrella? How could he talk to her without it sounding abrupt and awkward?  Ascending the steps, he was still racking his brain for suitable lines. He wasn’t paying attention to his footing. He slid, toppled, lost his umbrella, and landed in a deep puddle, mortified. When he looked up, there she was, extending her hand and smiling faintly. That smile, that face dripping with rain, would be branded on Dong Fang’s brain forever—no matter how she changed.  In that moment, Dong Fang somehow knew Shen Lan would always be a part of his life.  Nothing would separate them.  Thinking of the past, smiling, Dong Fang opens the front door. Little Niuniu amuses herself beside Shen Lan’s foot. She sees him, immediately beaming and awkwardly standing up. She staggers toward him, shouting, “Papa!”  Dong Fang puts down his briefcase and picks her up. He lifts her high. She shrieks excitedly.  “Careful,” Shen Lan says. “Please don’t drop our child!” Dong Fang reassures her, and she says, “Hey, didn’t you notice?”  “Notice what?”  “She can walk! Yesterday she could go two or three steps at most. You saw her do more just now! She can go from one end of the room to the other.”  Dong Fang puts Niuniu down. She starts walking straightaway. She can indeed stride, performing with a high and mighty air, though her knees still don’t bend properly, so she can only proceed swaying comically like a penguin. After a few steps she goes down, but luckily a floor mat cushions her fall. She gets up, snorts, and swinging her arms, continues to stagger.  Shen Lan shakes with laughter. Dong Fang laughs with her. “Her motor neurons are really developing. Maybe she’ll grow up to win honor for the country!”  They give Niuniu a bath, feed her milk together, then bring her to bed for sleep. She drinks a bit more, and they play with her awhile. She turns to her Papa’s side, then rolls over to pat her Mama. Finally, she closes her eyes, long lashes hanging down. Nestled against her parents, she sleeps. Shen Lan looks at her device for a bit, chats a little with Dong Fang, then turns off the lamp and closes her eyes. Dong Fang lies in the dark alone, eyes open. He listens to Shen Lan’s irregular breathing gradually even out.  When Shen Lan and Niuniu are both asleep, he stealthily rises.  He turns their bodies over to lie prone. He opens the backs of their heads and extracts the batteries. He takes the batteries to the recharger and fetches replacements. Mother and daughter resume their gentle breathing. Accompanied by their warm breath, Dong Fang is content. He closes his eyes and enters dreamland.    Originally published in Chinese in Flower City, fifth issue of 2018.    Translated and published in partnership with Storycom.  Baoshu is a science fiction and fantasy writer. He has published five novels and dozens of shorter works since 2010, including Three Body X: Redemption of Time, Ruins of Time (winner of the 2014 Chinese Nebula Award for Best Novel), Seven States of the Galaxy: Phantom From an Ancient Empire, and \"Everybody Loves Charles\" (winner of the 2015 Galaxy Award for Best Novella). He lives in Xi'an, China.  Andy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles.", "text": "10830 words, novelette\nNiuniu\n1\nDong Fang still clearly remembers the joyous love of that rainy night.\nIt seemed quite bad at first. After three years of dating and two years of marriage, their formerly shy and sweet explorations had become routine business. Nevertheless, he was in the mood that night. At 11:00 p.m. he turned off the light and got in bed. He embraced Shen Lan’s voluptuous form, and she lazily accepted this. He poured curious requests in her ear, but she refused, her patience waning. She said she was tired and told him to hurry up and finish so they could sleep.\nDong Fang put forth his argument: “You used to promise me things. How can you break your promises?”\nHe’d forgotten this was not a matter to be reasoned out. Sure enough, Shen Lan launched her counterattack: “You promised me things too, and what came of it? And now you have the nerve to ask me to . . . ”\nContending with each other, they soon found new territory in the conjugal bed, from division of housework to their mortgage, from premarital promises to demanding parents-in-law. Dong Fang finally stormed out of the bedroom and went to the study to play a VR game. He massacred aliens to drain off his resentment.\nAfter the game, Dong Fang removed his helmet and heard a thunderclap through the rain-battered window. He rushed into the bedroom to find Shen Lan awake, as expected, covering her ears, curled up with a blanket and tear-soaked pillow. Dong Fang knew she was afraid of thunder. She had been since childhood. And how long had she been in torment tonight? He had a soft spot for this phobia of hers, and declaring surrender, he pulled her into his arms.\n“I’m sorry,” he said. “Don’t be afraid, it’s okay.” Weeping, Shen Lan beat him with light, quick blows.\n“It’s all your fault,” she said. “I hate you so much!” Yet she accepted his embrace with fervor. Their bodies relaxed, and then they were twisting together and growing once more taut, like drawn bowstrings. Thunder and lightning swept over the city. Gale winds howled between buildings. Raindrops beat windowpanes. With mixed love and hatred, they dashed against each other, collided, fused, and clung to life’s summit.\nThey hadn’t been so deeply satisfied in a long time and wouldn’t be for ages to come. So, Dong Fang is certain: that was the night they conceived Niuniu.\nReturning from work at 8:30, he opens their front door and sees little Niuniu amusing herself beside Shen Lan’s foot. She sees him, is immediately beaming and standing awkwardly. She staggers toward him, shouting, “Papa!” She grabs the hem of his jacket and he knows she wants to be held. He sets down his briefcase and picks her up, lifts her high. Niuniu shrieks excitedly, showing two rows of just-grown-in teeth.\n“Careful,” Shen Lan says. “Please don’t drop our child!” Dong Fang reassures her, and she says, “Hey, didn’t you notice?”\n“Notice what?”\n“She can walk! Yesterday she could go two or three steps at most. You saw her do more just now! She can go from one end of the room to the other.”\nDong Fang puts Niuniu down and she starts walking straightaway. She can indeed stride, performing with a high and mighty air, though her knees still don’t bend properly, so she can only proceed swaying comically like a penguin. After a few steps she goes down, but luckily a floor mat cushions her fall. She gets up and changes direction, circling back around toward her parents.\nShen Lan shakes with laughter. Dong Fang gives a perfunctory smile, which gradually solidifies on his face, but Shen Lan doesn’t notice. “Such a clever child!” she says, nudging him. “In a few more days she’ll have the run of the room.”\n“Or close to it,” Dong Fang says, unable to stop himself. “Isn’t it like this every time?” He immediately regrets it.\nShen Lan’s smile vanishes. Her gaze goes gloomy and cold. Dong Fang wants to say something to allay the mood, but there’s a muffled thump behind him. Niuniu has stepped on a stuffed animal and fallen. This time the fall was heavy. She banged her head, and now she’s wailing. Shen Lan pushes past Dong Fang. She picks up and hugs the child. “It’s okay darling. Mama’s here.”\n“Mamama,” Niuniu babbles, burying her face in Shen Lan’s bosom.\nShen Lan goes on consoling her. She lowers her head to kiss the child, hair cascading like a waterfall to tickle Niuniu’s face and provoke giggles. Dong Fang finds the whole tableau repellant. He stands in the far corner of the living room, watching mother and daughter. In the faint lamplight, it’s like a scene of the Virgin Mary holding baby Jesus to her breast.\n2\nThey knew they were having a girl with the first B ultrasound. Hospital regulations didn’t permit them to ask, but it was only set up that way to increase “gray income” for doctors. The parents-to-be didn’t broach the subject, but the doctor hinted. Although there were things the hospital wasn’t allowed to reveal, if one wanted to know, it wasn’t impossible. After that he was silent. Actually, Dong Fang didn’t especially want to know, but not asking seemed like it would be rude. So, he flashed a hundred yuan, and when the doctor didn’t take it, he fished out another hundred.\nThe doctor said, “Your child will take after her mother. Good news either way I think, boy or girl, but of course if you don’t want her, there is something we can do.”\nDong Fang didn’t value boys over girls, not as far as he knew himself. He didn’t think male or female made much difference. This child was coming fast. He’d been dizzy since finding out. But after learning he would have a daughter, he couldn’t help feeling disappointed. He realized he’d been hoping for a son, deep down, for father and son racing VR cars at breakneck speed, battling alien monsters, pursuing the interests of boys and men. It was difficult to understand what a daughter would mean to him.\nShen Lan, however, was quite happy. Back outside, she said a girl was fine by her. A few days before, she’d thought of an especially nice girl’s name: Dong Qingwan, indicating the child would be beautiful like the famed poet and courtesan Dong Xiaowan. The name also stealthily incorporated a line of verse from the Book of Songs: “There was a beauty all alone, pure . . . qing, and graceful . . . wan.”\nDong Fang, not won over, said, “A boy could have a good name too. For instance . . . Dong Shixuan?”\n“What a mess,” Shen Lan said. “Why not Dong Shizhang? A kid named ‘chairman of the board . . . ’”\nDong Fang laughed in exasperation. Gazing out the car window on the way home, he buried his nonexistent son Dong Shixuan.\nAs for the childhood pet name, Shen Lan had another good idea: Wanwan, unique and pleasant to the ear. The name actually moved Dong Fang, as though a pretty and mild girl already stood before him. At that moment, he couldn’t help recalling the first time he’d seen Shen Lan. They’d been at university then. It had been a rainy day, and he’d come out of the library and spotted a young woman in a gauzy dress standing inside the entrance colonnade, sheltering from the rain. Her long hair lightly drifted. Faint anxiety was written on her face. She was like a lily in misty rain. Dong Fang couldn’t help stopping to look, and their gazes met. There seemed to be an expectation in the young woman’s eyes, but she turned away shyly. Dong Fang’s feet felt drawn toward her as if by magnetism. He didn’t normally strike up conversations with female students. Also, he wouldn’t know what to say. Maybe I could walk with her a bit? he thought. But no, she might be waiting for a friend, or even a boyfriend. Who knew? Such a beautiful girl was not likely to be single. He chuckled bitterly, and deciding against folly, turned to leave.\nNow Dong Fang marvels at life, at how two people’s fates—no, three people’s—can be decided in an instant. If he indeed left that rainy day, everything would be different. Perhaps he would have emigrated, or gone down south. Then he would not have come to this city and married this young woman named Shen Lan. Of course, Niuniu would never have existed, and all that followed would not have happened.\nThe smart kettle issues a gentle, happy note, indicating the water has boiled. Dong Fang emerges from foggy memories. He pours water in the baby’s bottle, then mixes in powdered milk. Niuniu drinks powder imported from Australia, and the water is purified. It has to be maintained at forty-five degrees. A difference of a few degrees won’t do. Of course, these are not Niuniu’s demands. She could make do with anything, but Shen Lan’s standards are high, bordering on immoderate.\n“About done?” Shen Lan calls from the bedroom. “Niuniu is quite hungry.”\nThe milk is not yet mixed. Dong Fang, in a fit of agitation, considers hurling the bottle at a wall and smashing it to pieces—but he endures. He shakes the milk until it’s ready and takes it to the bedroom. Niuniu has just been bathed. She’s playing with Shen Lan on the bed, rolling about and sucking her finger. She sees him coming with the bottle and sits up, bright-eyed. Dong Fang is a few seconds late handing the bottle over, and she starts crying. Shen Lan hastily takes the bottle. She holds Niuniu and lets her suckle. Niuniu drinks, glancing sidelong at Dong Fang, tears still streaming. There seems a sly and cunning light in her eyes.\n3\nNiuniu grew up on milk. Shen Lan’s milk was lacking, and though she tried breastfeeding at first, the child was always up late fussing and crying. Husband and wife believed she was sick until they realized she was just never full. Finally, they started relying on milk powder. It was probably guilt that drove Shen Lan to shop online for expensive overseas powdered milk, while still breastfeeding as much as possible.\nTheir daughter’s formal name was fixed as Dong Qingwan, but her childhood pet name soon changed from Wanwan to Niuniu. They’d hired a nanny for the first month confinement, and this woman, according to a naming custom of her home province, called her Niuniu now and then. Dong Fang’s parents were also staying with them at the time, helping to look after the baby. They loved the new name and started using it. Dong Fang followed suit. Maybe it was because Wanwan sounded too profound and elegant, suitable for the tender sentiment of a lover, but not quite fitting for a little girl, far inferior to the light, catchy cliché that was Niuniu. Shen Lan wasn’t crazy about this. She announced her daughter’s “primary pet name” was still Wanwan, that Niuniu was merely “secondary.” After this declaration, she herself started using Niuniu. No one spent further thought on primary versus secondary names.\nChild-rearing was difficult and joyous. Days seemed like years, yet they were fleeting. Niuniu could laugh, Niuniu could roll over, Niuniu could sit up. Dong Fang and Shen Lan watched their daughter go from plump little larva to crawling kitten, then a walking, talking girl who liked pretty clothes and admiring herself in the mirror. Almost every day there was a pleasant new surprise. Dong Fang had felt he couldn’t be close to a daughter, but he immediately loved the little lady. Niuniu also got stuck on him. Seeing her papa, she would smile sweetly. A hug from him could stop her wailing. Sometimes she even needed his company to sleep, which made Shen Lan quite jealous.\nThat was their family’s golden age. Later, Dong Fang often wondered when it started to go amiss. Perhaps it was that day in the café.\nNiuniu had just turned one. A client had made an appointment to meet with Dong Fang, but was late. Dong Fang, waiting in the café, saw a secondhand book on a bookshelf titled Niuniu. Amused, he read a bit while drinking coffee. It turned out to be the book he most regretted opening in his life, a writer narrating his daughter’s story. The girl was born with an incurable disease and passed away just after one year old. Dong Fang, after turning a few pages, felt something was wrong. Terrified, he dropped the book like a hot potato.\nBack at home, he began calling his daughter Wanwan. Shen Lan asked him why, and he avoided answering. But after a couple days, he began to feel ridiculous. How many girls under the sun were called Niuniu, after all? And what was in a name, in sharing a name? But a few days later, Niuniu went to hospital for a checkup, and Dong Fang was filled with dread. By the time he got the results, he was weak in the knees.\nOf course, it was all for nothing. Niuniu couldn’t have been healthier. He let go of senseless fear and started calling her Niuniu again. She continued to grow on schedule, merging harmoniously with her parents’ life. Impartially, she could not be reckoned beautiful. She was a few centimeters shorter than children her age, her hair sparse, eyes not large, nose a bit sunken, but what did these things matter? She was adorable beyond description when she smiled, and could melt anyone’s heart. She was the product of that rainy evening’s tender affection. It was as if Dong Fang and Shen Lan had met entirely for the sake of birthing the world’s most enchanting fairy.\nAnd now, as before, she drinks milk.\nShe plays awhile, turns to her father for a bit, then pats her mama, and at last slowly closes her eyes. Her long lashes hang down. She nestles against her parents and sleeps. Shen Lan gazes into her hand device awhile, then turns off the light and closes her eyes. But Dong Fang can’t sleep. He listens in the dark. Shen Lan’s irregular breaths gradually tend toward even and long. When he judges her sound asleep, he gathers up Niuniu and gets out of bed.\nIn the bathroom, he turns on the light. Niuniu opens her eyes, not fully awake. Her little mouth opens and says, “Papa.”\nDong Fang reassures her and changes her diaper. There is no mess, of course. The white milk remained in her body awhile, then just drained out. She has not defecated. If she did, cleanup would be only slightly more complicated. It would come out in a long, narrow piece, but dehydrated and lacking any foul odor. In fact, raising this creature could be much simpler. For instance, they don’t need to feed her at all, but Shen Lan insists on it.\nDiaper changed, he takes Niuniu to the sofa and places her on his lap, facing away. Niuniu fusses, twisting her body, babbling, fiddling with her feet. Dong Fang reaches for the back of her head. In her delicate hair, he flips something twice. The back of her head pops open, revealing a deep battery compartment. He digs out the two batteries, leaving her head half empty. Niuniu’s vitality is gone. Her body goes limp. She falls over in his lap.\nWhen he first started changing her batteries, his hands would weaken or tremble. But for a long time now, he’s been doing the job with the ease of experience. He puts the batteries in their charger, goes to the closet, retrieves two spares, and returns to the sofa. But instead of replacing her batteries, he just stares down at her little body, lying there motionless, just like on that day of finality. Dong Fang suffers a familiar unease. He struggles to escape it, but he’s already being dragged into a swamp of memory and anguish.\n4\nIt happened the day before Niuniu’s second birthday.\nHer paternal grandfather and grandmother were coming over for her birthday, so Shen Lan decided to clean the apartment. Unfortunately, the nanny had asked for leave that day. Dong Fang was working overtime, so Shen Lan was on her own caring for the child while doing housework.\nA tiny drone followed Niuniu, always hovering a meter or so before her eyes. The drone was the size of a hummingbird, with a cam on top. This hummingbird device had been developed mainly for monitoring children. Not all nannies were reliable, and parents, naturally treasuring their children, liked being able to keep a continual eye on things and set their minds at ease. Of course, it was good for more than that. The cam fed to Dong Fang’s office computer. He could check the window at the bottom of his screen at any time. Halfway across the city, he could see his daughter’s smiling face and be reminded why he was earning money—for a good kindergarten next year, for instance—and thus renew his diligence.\nSo, Dong Fang and Shen Lan saw what happened simultaneously.\nNiuniu was on a plastic mat in the living room playing with smart blocks. These newly developed toys could shape-shift and assemble on their own, becoming fantastic oddities of every sort. They had been occupying Niuniu for two hours straight, allowing Shen Lan to feel at ease doing housework. And the hummingbird was on duty. If anything dangerous were about to happen, it would issue an alarm.\nIn order to sweep, Shen Lan had dragged a chair to the bay window. She’d also opened the casement for ventilation.\nAfter a while, Niuniu lifted her head toward the window. An interesting notion clearly flashed through her mind. She giggled, stood up, and rushed over, babbling nonstop. Dong Fang saw this, but the hummingbird was aimed at Niuniu’s face, not the back of her head. He couldn’t see her aim, and he wasn’t paying much attention anyway, with a financial report on hand urgently needing completion.\nNiuniu had never climbed on to a chair before. Moreover, the bay window was childproofed with a guardrail. By any measure, an accident was nearly impossible. But Niuniu had been growing every day, getting stronger. She climbed on to the chair, and from there was able to climb over the guardrail. She went to the window ledge, toward unfamiliar territory, toward exploration. By the time Shen Lan saw what was happening, Niuniu had one foot across the sill. She stepped on to the open casement. There was no barrier between her and the outside world. Having accomplished these virtuoso maneuvers, she was quite pleased with herself. Turning toward Shen Lan, she smiled sweetly. “Mama!” she called out, wanting Shen Lan to witness her magnificent feat.\nShen Lan turned, saw the shocking tableau, and rushed toward her daughter. In two or three steps she reached the bay window and grabbed for Niuniu’s arm. Meanwhile, at work, Dong Fang’s gaze drifted to the hummingbird window. He saw, and his trembling hand dropped a mug of coffee, which shattered on the floor.\nTragedy still might have been averted, but just then the hummingbird made a mistake. Its expert system finally judged Niuniu to be in danger. It flashed a piercing red light and a sharp, blaring alarm. This had an effect opposite to what was intended. Niuniu flinched away from the noise and light, toward the outside.\nHer delicate balance was broken.\nHer tiny form vanished from the seventh-floor window. Shen Lan reached for her tiny hand and grabbed air.\nShrieking, Shen Lan collapsed beside the window.\nAnd yet, she was somewhat luckier than Dong Fang, who followed Niuniu with the diving drone, in mute witness to his daughter’s final moments. The building exterior rushed past the lens. Pedestrians and vehicles swiftly loomed, like a horrifying special effects scene in a movie. Niuniu’s eyes reflected the white clouds above. She still didn’t understand what was happening, but was clearly terrified, flailing her limbs, mouth open to cry out. Always before, crying had conjured loved ones, a tender embrace and care.\nThis time, it wasn’t to be. Earth rushed toward the lens. A heavy crashing sound followed. Niuniu’s expression was forever frozen in that moment before crying out. Scarlet quickly filled the other side of the frame.\nRemembering all of this now, Dong Fang is on the verge of collapse. He supports himself on the tea table beside the sofa. He closes his eyes and opens them again. Closed, his daughter back then. Open, this Niuniu on the sofa before him. They are the same, almost impossible to differentiate.\nBut Niuniu is dead, Dong Fang thinks. Cremated, interred by him personally. But her image is always here, unceasingly calling to mind what he can’t stand recalling. Day in and day out, year after year. What kind of cruel life is this? Why does he still endure it?\nFury wells up. He grabs the little girl’s neck and lifts her off the sofa with one hand. “You’re not my Niuniu,” he says, fuming. “You never were. You’re fake. You’re a scam!”\nHe wouldn’t have to squeeze hard to snap her neck, the weakest part of her body. But the delicate neck has human body temperature, if no pulse. The girl’s eyes are closed. Her face is peaceful, like in sleep or repose in utero. No one could be hard-hearted enough to hurt such a weak child, whether she’s real or fake.\nThe strength drains from Dong Fang’s arm. Sighing deeply, he tosses her back on the sofa. He loads the spare batteries into her head, cursing under his breath, and closes the panel. Niuniu comes to life, turns over, crawls toward him calling, “Papa, Papa . . . ” For a long time now, this voice has been like a siren’s song, bewildering him, enticing him toward time’s abyss.\n“You’re not Niuniu,” Dong Fang murmurs. “You can’t fool me anymore.”\nNiuniu blinks innocently, and again says, “Papa.”\n5\nAfter the accident, most of the pressure came down on Shen Lan’s head. Niuniu had fallen on her watch, after all. Police took her away amid her neighbor’s whisperings. She stared blankly, like she didn’t understand what had happened. She was nearly prosecuted for homicide by criminal negligence, but the police eventually abandoned this.\nDong Fang met her as she came out, hair disheveled, in a trance, wan and sallow, almost otherworldly.\n“Dong Fang,” she said, seizing his arm and weeping, “you have to believe me. It wasn’t on purpose. I really didn’t expect . . . I was so foolish. I just want to die. Your parents surely blame me, right? Do you blame me?”\nDong Fang turned away and hoarsely said, “Forget it. All of this is fate. As for my parents . . . well, I’ve spoken with them. They’re going back to their hometown.” He didn’t mention his father’s hypertension flare-up and hospitalization.\n“That’s fine then.” Shen Lan seemed to relax and breathe, dabbing at her eyes. “So how is Niuniu? At the hospital, right? Will she be scarred from the fall? She hasn’t seen me for a few days. Does she miss me?”\nDong Fang stopped in his tracks, stunned and staring at his wife.\n“What’s wrong? Is there something on my face?”\n“Don’t tell me you don’t know. Niuniu . . . ”\n“Never mind,” Shen Lan interrupted, growing nervous. “I’m sure she’s alright. At home waiting for me, right? We should get back. Let’s hurry. Let’s go home.”\nDong Fang briefly dared to think it was his own mistake. Niuniu was fine, nothing had happened. It had been a nightmare. In a trance, he followed Shen Lan home, earnestly hoping to see the nanny holding Niuniu. But there was no trace of her. Her diapers, clothes, toys, and drawing pads were scattered everywhere. It seemed she would jump out from her bedroom or from behind the sofa at any moment. He hadn’t dared stay at home the past few days. Everything was as it had been before the accident. Shen Lan entered, and without taking a moment to rest, began putting things in order.\nShe even started cleaning Niuniu’s toys.\nDong Fang composed himself and gathered his resolve. “Lan, what are you doing? Niuniu is . . . she’s . . . ” He couldn’t say it.\n“She went with your parents.” Shen Lan looked up at Dong Fang. “And they’ll return in a few days, right?” Her tone was superficially calm, yet contained a faint tremor. There was desperate hope in her eyes, like someone dying of thirst begging for just one drop.\nDong Fang wanted to shout at her to stop. He wanted to curse her and vent his fury. “Stop fooling yourself!” he wanted to scream, but in the end he averted his gaze. “Yeah, they’ll take care of her awhile, then bring her back.”\nHe called an old classmate who now worked in a psychiatric ward, seeking advice on his wife’s situation. The classmate said Shen Lan was in temporary denial. If he could just keep from provoking her, she would get better after a while.\nDong Fang understood Shen Lan. He could barely accept the truth himself. But time would expose all illusions, heal all wounds, and make everyone face the truth. She just needed time.\nNot long afterward, he was passing by that café and suddenly decided to go in for another look at Niuniu. Intriguingly, this book that had so frightened him before now gave him consolation. His Niuniu had gone fast, in an instant. She wouldn’t have known anything or thought anything. Everything had just ended. From her perspective it had been like going to sleep. She wouldn’t have suffered. At least she was more fortunate than the girl in the book, tortured by serious disease.\nYears later, he reckons life is just unceasing death.\nHe sometimes sees photos of his two- or three-year-old self, or recalls his parents’ tales of that time, but he can’t remember any of it. He lived in a small southern town back then. The first language he learned was a pleasant-sounding Wu dialect, but at age four he moved north with his parents. He spoke standard Mandarin for a long time. Sometimes he returns to his hometown and hears the old dialect and barely understands it.\nThe Dong Fang of that time—innocent and young, full of southern colloquialisms—no longer exists, naturally. They’re all gone: childhood Dong Fang, adolescent Dong Fang, even pre-Shen Lan Dong Fang. If Niuniu had lived, she would be six or seven years old, vivaciously attending school—not this wobbly-walking infant. So, the Niuniu of back then is as good as dead, replaced by a series of new Niunius. What is there to feel bad about?\nBut Dong Fang knows this for sophistry.\nHe has lost many Niunius, not just one. Three-year-old Niuniu, five-year-old Niuniu, ten-year-old . . . it’s like they’ve fled against the flow of time, sweeping past Dong Fang and Shen Lan, faces unclear, one after another, back into the unrecoverable past, back to that plummeting child, and vanished like smoke. Life is so long, Dong Fang thinks. In the future, he will have more brushes with Niunius who might have been . . . fifteen-year-old Niuniu—no, at that point she would be called Dong Qingwan—twenty-year-old Dong Qingwan, thirty years old, forty. They’ll have their lives and careers, dispositions and attachments, and joys and griefs as they sweep by, passing from the points in time he would have met them, returning to the past, to that tragic moment, the instant in which they ceased to exist.\nBut he finds a kind of solace in this pain. It’s as if there’s another world where Niuniu is growing to adulthood. Perhaps the world, at that tragic moment, split in two. In one, Shen Lan grabbed Niuniu, averting the horror that might’ve followed. Unfortunately, he fell into the other world and is thus separated from Niuniu. They’re gradually getting further apart, never to meet again. But in each other’s worlds, they will both have new lives.\nNothing like the one he’s currently living.\nNiuniu still fidgets next to him. Dong Fang twists her ear half a turn and she falls asleep. He installed this shortcut without telling Shen Lan. She couldn’t bear him treating this “daughter” like a toy.\nHe carries her back to the bedroom and lays her down. Shen Lan blearily embraces her. Niuniu needs a battery change once a day. She can also charge up directly, but that takes longer. Changing batteries is visually unpleasant but necessary. Dong Fang can only do it when Shen Lan sleeps. For years now, she has never awakened during these changings. He sometimes feels she is deliberate in this, or at least subconsciously conspiring.\nShe can’t face the truth, though she’s well aware of it.\nDong Fang lies down beside them. He stares into impenetrable darkness and can’t sleep most of the night. It’s not the first time, and it’s getting more common. Every time, the insomnia comes with a name, the name of someone who has never existed—yet it won’t fade from his mind.\nDong Shixuan.\n6\nThe second time Dong Fang thought of this name was half a year after Niuniu passed.\nFor him, Shen Lan’s hysteria was not entirely a bad thing. He could at least escape his grief in psychology and psychiatry texts, seeking a way to cure his wife. The first step was to pack up Niuniu’s things. He told Shen Lan he would send them to his parents’ place, since Niuniu’s stay there was becoming extended. Shen Lan didn’t stop him, nor did she contact her in-laws to request a video call with Niuniu. Dong Fang sensed his classmate had been right. Deep down, Shen Lan knew what had happened. She just couldn’t accept it.\nWith Niuniu’s things and toys packed up in a dozen or so boxes, Dong Fang found he couldn’t throw them out like he’d meant to. It was too painful. He finally put them in a corner of the storage room. Shen Lan brought up Niuniu less and less. For a long time, she just stared at the photos of Niuniu on the wall. Dong Fang eventually sounded her out on taking them down, and she said nothing.\nLater, he saw her staring at the blank wall and wiping away tears.\nNeither of them mentioned Niuniu’s death, but Dong Fang sensed Shen Lan had accepted the fact of it. Their home was restored to its pre-Niuniu state. Dong Fang recalled their life before her, not so long ago, yet seemingly a lifetime past. In his sadness, Dong Fang also knew a bit of ease. Their marriage had returned to its starting point. They could set off on the journey once more.\nHe began propositioning Shen Lan. She was not enthusiastic, but she allowed nature to take its course. They continued that way once or twice a month, colorless unions, meager fare, indifferent, both parties mostly silent, as though all desire was dead and all that remained was desire’s corpse. Yet in bed, the marriage more or less recovered its most fundamental significance. They were no longer new parents, just a man and woman, not so old, able to find temporary happiness in each other’s bodies. Of course, Dong Fang began to wonder if something else might result.\nHe didn’t know when it started, but the name Dong Shixuan was on his mind by then. He thought perhaps it was not merely a name, but a premonition. Perhaps he could still bring this child into the world and quell their pain. Perhaps Niuniu and all that had happened was a mere interlude, and Dong Shixuan would be the resplendent symphonic movement. A boy named Shixuan, meaning “imposing man.” It might not be a boy, of course. Change out the characters and Shixuan became “daylily poem.” A boy or girl could rescue their life.\nA . . . new . . . child.\nBut giving birth to a child was not yet a formal item on their agenda. Dong Fang knew it wasn’t urgent, and that Shen Lan wasn’t ready yet. The predestined child would have to wait for a better opportunity to come into their lives. He began to carefully plan an ocean cruise for them. It would start in the southern Pacific, including numerous island nations and enriching their experience with foreign customs. They had originally planned this as their honeymoon trip, but due to a shortage of funds, they’d abandoned it. Now, with the plan revived, Shen Lan’s enthusiasm was immediately apparent. Dong Fang saw the luster of youth return to her eyes, which had long been dormant. This excited him further. For many days they discussed what they should bring, where they would go, what they would do for fun, what they would eat, and talking of happy times they were filled with laughter, like two children.\nDong Fang yearned for this dreamlike trip. They would spend two months in warm southern winds, passing across blue, refreshing seas, accompanied by cetaceans during the day and the dazzling Milky Way by night. They would land on foreign coasts and appreciate radically different lifestyles. They might even make love on tempestuous seas, or kiss on uninhabited white beaches. Life would glow with splendor once more and soar over new horizons.\nOne night, three days before they were to set off, Dong Fang was working overtime to get everything done before the trip. Around 9:00, after numerous meetings, he was finished, and discovered an unfamiliar number had called him seven or eight times. He’d had his device on mute. He tried to call back but couldn’t connect. He didn’t pay this much mind. Most likely it was a work matter. He just hoped it wouldn’t interfere with the trip.\nHe returned home, not in the least on guard. He opened the door to find a middle-aged woman standing before him, hair gone partially white, vaguely familiar, a relative perhaps.\n“You’re . . . ”\nThe woman smiled faintly. “Mr. Dong, don’t you remember me?” Her voice was deep and rich, singularly magnetic, and quite familiar, very like his paternal grandmother’s.\nSuddenly he knew where he’d met her. It had been almost a year ago. He had nearly come to think of it as a dream.\nDong Fang said, “You . . . you’re . . . don’t tell me . . . ”\n“Papa!”\nA child’s voice behind the woman, young and tender and resonant.\nIt couldn’t have been more familiar. It had invaded his dreams thousands of times, woke him with a start at midnight to find tears on his pillow. Dizzy, forgetting all else, he went like a sleepwalker toward the voice. The woman moved aside conscientiously. Dong Fang saw Shen Lan standing there, cheeks tearstained, yet smiling beautifully. She was hugging a small girl. This child called him “Papa” and extended tiny arms toward him.\n“Niuniu,” he heard himself say, “Niuniu! Niuniu!”\nHe dropped his briefcase and rushed toward mother and daughter. He embraced them, crying. In that moment he was happy beyond words. Work, travel, Dong Shixuan, all were unimportant. Niuniu had returned. The vanished era of joy had returned. His family was complete again. This was life’s highest and only meaning.\nBut all that was four years ago, and he’d been wrong.\nOpening his eyes, Dong Fang thinks: I was gravely mistaken.\nHe finally got to sleep around five or six in the morning. Now it’s close to nine. Luckily, it’s Saturday and he doesn’t have to work. He hears the child’s piercing voice in the kitchen. Dong Fang goes out and sees breakfast leftovers on the table. Niuniu has eaten. Shen Lan is putting a pretty pink dress on her, meaning to take her downstairs to play in the park. Niuniu dances with anticipation. It’s a familiar scene to Dong Fang.\nMama, kitty cat! Dong Fang thinks.\n“Mama,” Niuniu says, pointing out the door, “kitty cat!”\nShe wants to go out and see the cat. Actually, she can’t distinguish between cats and dogs. Shen Lan croons a lively song, placing Niuniu in the stroller. She buckles the safety belt and kisses the child’s forehead.\nTee hee!\n“Tee hee,” Niuniu laughs.\nOh oh oh oh!\n“Oh oh oh oh!” Niuniu happily hoots.\nNow wave your hands.\nNiuniu lifts her arms, excitedly flailing them. Dong Fang knows each seemingly careless movement and vocalization is controlled, precise as mathematics.\n“Lan,” he can’t help saying, “we need to talk.”\n“When we get back, okay?” She squats to adjust Niuniu’s clothes as the child fusses in the stroller.\nDong Fang wants to say more but resists. Irritation washes over him like background noise. He sees a bright red apple on the table and picks it up. He brings it toward his mouth.\nShen Lan rushes over and snatches it. “Come on! I’m bringing it for Niuniu. Are you competing with your daughter for food now?”\nDong Fang can no longer suppress his annoyance. “Daughter?” he blurts. “Whose daughter?”\n“Are you crazy?” Shen Lan says, not meeting his gaze as she heads out. “What are you smoking, anyway? What are you talking about?”\n“You know what I’m talking about. She’s not really your daughter. She’s not really a . . . person.”\nShen Lan’s glance is dismal. “Don’t go there,” she says, voice low but firm, “not now. To me she is Niuniu, and that’s good enough.”\nDong Fang finally erupts: “Stop fucking lying to yourself, okay? Niuniu wasn’t doomed to be an infant forever! Niuniu couldn’t retract teeth after growing them! She didn’t learn to walk then go back to crawling! We both know this is just a machine, a doll! You still take her to the park . . . don’t you know what the neighbors and security guards say about us behind our backs? I’ve had enough!”\nDong Fang’s uproar triggers bawling from Niuniu. She extends her little arms, seeking her mother’s bosom. Shen Lan hastily retrieves her from the stroller, softly consoling her. Niuniu sees her mother’s tears and gets even more upset. Dong Fang’s fury is extinguished, as if by a bucket of water. There’s still steam, but the fire is out. Tender, fatherly love refills his heart. He knows this is a misconception, but he can’t help it. And he hates himself all the more for it.\nWiping away tears, Shen Lan glares at him. As though evading terrible danger, she hugs Niuniu and goes out the door, kicking it closed with a bang. Dong Fang listens to her footfalls rapidly fade.\nHow did it come to this? he wonders. It all began with a seeming miracle. Niuniu came back, didn’t she? But the price was dreadful. Now they’re trapped in a long-gone past, unable to escape, as if they’ve fallen into the warped space-time of a black hole.\nIf he hadn’t taken that woman’s offer in the first place, everything might have been different.\n7\nOn the day he interred Niuniu’s ashes, it was also raining. Shen Lan was in no condition to join him, and his parents were unwell. Dong Fang was on his own, managing everything. He didn’t know how he was sustaining the rush to get it all over with.\nAfter the cinerary casket had been entombed, a heavy rain fell from the sky. Dong Fang stood gazing at the photo of Niuniu that had just been affixed to the façade. This is her home from now on, he thought. Can the rain get in? Will Niuniu freeze? Will she be afraid if she hears thunder? Can she reach out for a hug in there? No one would come and hold her anymore. No one would tuck her in at night. Would she be wondering how to come home? Could she find her way home?\nThe rain soaked his clothes. Tears flowed, mingling with rainwater. Soon he was weeping and choking.\nSomeone patted his shoulder and gave him a tissue. Dong Fang looked up to see a silver-haired woman holding an umbrella. She wore a gray pantsuit, and her face was kind. “Are you alright sir?” she said.\nDong Fang guessed she worked for the cemetery. “My daughter is dead,” he sobbed. “She wasn’t even two.”\nThe woman sighed. “I’m sure she was precious to you.” Her voice was slightly husky, sonorous, reminding Dong Fang of his long-gone paternal grandmother.\nShe led Dong Fang into a lobby. Not sure why, he began telling her Niuniu’s story. From mother’s womb to the ultimate fall, he said it all, things he didn’t wish to recall, things only Niuniu’s parents would be interested in. He’d kept it all inside for too long. He certainly hadn’t been able to talk to Shen Lan. The more he talked now, the more he wanted to say, and the less he could control himself. The woman listened, now and then passing him a tissue.\nIt took quite a while to say it all. He began to calm down. He wiped away tears and forced an embarrassed smile. “Sorry Miss. I think I’ve been wasting your time.”\n“It’s fine,” she said. “I actually came here to find you.”\nDong Fang was nonplussed. “Excuse me?”\n“Listen, if I were to tell you there’s a way to see your Niuniu again, how would that be?”\nDong Fang stared a bit. His temper rose and he glared at the woman. “What the hell do you mean?”\nNot alarmed, the woman said, “I’m not just trying to make you feel better in this moment, and I’m not out of my mind. I have a way for you to see Niuniu again . . . an exact copy of her.”\n“How is that possible?” Saying this, Dong Fang suddenly understood. “Hold on! You can’t be talking about an artificial person?”\nThe woman nodded.\nHe knew artificial person tech had been developing a long time. Several years before there’d been a breakthrough, combining a metal skeleton, an AI chip, and a fabricated human tissue exterior. The result was a living robot that could pass as human. At first welcomed by the marketplace, this tech soon developed a bad reputation: most consumers were ordering custom-made beauties, young men and women for satisfying secret longings. As one might imagine, some satisfaction modes were quite abnormal, giving rise to many controversies. Some models were even meant to resemble celebrities. These and other types meant to mimic real people led to legal disputes. Finally, the government prohibited artificial person production. But demand was still high. An underground industry persisted. Dong Fang had never imagined these things would have anything to do with him.\nHe recovered his faculties. “Sorry, I don’t need that. She wouldn’t be a real person.”\n“Of course not,” the woman said, compellingly unperturbed, “but you wouldn’t be able to tell the difference. You said when you close your eyes you still see her. I guarantee our Niuniu would be an exact replica.”\nAn exact replica. Dong Fang shook his head. “It’s impossible.”\n“Not at all. You just have to provide enough viable image data. Our modeling is precise. Using the latest nanometer-grade 3D printing tech, we control every detail of skin and hair . . . I won’t bore you with the technical details. Suffice it to say, you’d see her sweet smile, you’d hear her call you Papa, she would kiss your cheek, hold your hand as she learned to walk, and play. She would be with you forever, never to be taken away again.”\nDong Fang backed up a few steps, as if his daughter were rushing toward him, laughing and happy. He waved a hand, dispersing this sweet illusion. “But . . . she wouldn’t be real.”\n“That’s true,” the woman said, patient and unflappable, “but she’d still be a three-dimensional photograph, a living sculpture. Wouldn’t that be the best possible commemoration of Niuniu?”\n“It’s still a no.” Dong Fang struggled to resist ever-greater enticement. “I know producing an artificial human is very expensive. We don’t have that kind of money.”\nThe woman smiled, as if she’d anticipated these grounds for refusal. “Not as pricey as you might think. Quite doable for you. Moreover, you wouldn’t need to pay anything up front. You just register, transfer Niuniu’s data to us, and sit tight. We send the new Niuniu to your residence, and you pay later. Unsatisfied in any way? Return her within a month and pay nothing.”\n“Then aren’t you operating at a huge loss?” Dong Fang couldn’t fathom their business model.\n“Not to worry.” The woman smiled sincerely. “Customer satisfaction is our highest priority.”\nIn the end, Dong Fang surprised himself by registering. He sent all his photos and videos of Niuniu to the appointed web address. He waited, but it was like the company had vanished into thin air. There was no further news. Dong Fang reckoned the underground factory had been raided and shut down. Luckily it hadn’t touched him.\nHe soon forgot the matter.\nUntil the night he found that woman in his home and came to understand why she hadn’t taken advance payment: there was almost no risk to this business. Seeing a loved one return, nobody could return the goods, even if it meant bankruptcy.\nAnd the cost was indeed high. They had to cancel their travel plans, in addition to maxing out several credit cards. But what did these things matter? Little Niuniu had returned. They were immersed in bliss for an entire year.\nShen Lan’s child-rearing glow returned, and their former life trajectory recapitulated. Niuniu seemed to grow all over again, from baby to young child, slowly learning to walk and master a few simple words and phrases. But one day she was back to where she’d started.\nDong Fang called to inquire about this. An imitation person was a machine, in essence. With imitation children this was all the more evident: they couldn’t really grow. At best, the machine skeleton could expand or contract in limited ways. Muscles could transform somewhat, teeth could emerge from and retreat into the gums. A one year old could grow to look two or so, at most. Of course they couldn’t grow up. AI algorithms with limb and trunk control made limited change possible, from crawling to walking, babbling to a few simple sentences, but this sort of development was unsustainable. In the end, the machine could be fixed at its terminal stage, or cycled back and allowed to “grow” once more. Shen Lan chose the latter, perhaps because it meant more child-rearing pleasure.\nIt has been four years since the new Niuniu’s arrival, four growth cycles.\nDuring the first year, Dong Fang’s love of the child was no less than it had been toward the real Niuniu. His feelings cooled during the second year, but he was still quite taken with her. In the third year he grew wearier of the game, day by day. Finally, in this fourth year, he feels he will soon go mad. It’s like he’s fallen into a restless, never-ending time loop. Niuniu, having just learned to walk, goes back to self-satisfied crawling. She learns to speak, and just like that forgets it all. Every day recapitulates what happened on the corresponding day in years one, two, and three, and even five years ago with the real Niuniu.\nBut the days crawl on, his hair going gray, his parents having passed away. And that lifelike person, forever between one and two years old, never to grow up, plays ever more preposterous parent-child games with them. And when will such days end? When will he and Shen Lan be able to see the future?\nShen Lan is still invested. She has no problem repeating the cycle. With a machine to take care of, she doesn’t even want a second pregnancy. “Let’s wait awhile,” she always says. “Now is not the time.” Of course, Niuniu is stuck at the age she most needs care. Her needs will never end because she will never grow up. The opportune moment to get pregnant, to create Dong Shixuan, is endlessly postponed. Perhaps it will never come.\nThere has to be a conclusion. This morning, it couldn’t be clearer to Dong Fang. This absurd game is consuming their lives, and nonexistent Dong Shixuan’s life.\nIt must end.\n8\nShen Lan is gone for a long time. Dong Fang calls and no one answers. She doesn’t come back with Niuniu until late afternoon. The door opens and the tiny form comes waddling in. “Papa! Papa!” she shouts, throwing herself into Dong Fang’s arms. She has obviously forgotten Dong Fang’s morning rant. Of course, she doesn’t really remember anything, running on fixed routines.\nDong Fang picks her up, harboring mixed emotions. Shen Lan comes toward him, expression serene. “You wanted to talk? Let’s talk.”\nDong Fang puts Niuniu down and points at the smart blocks on the floor. Niuniu rushes over in high spirits and starts playing. Dong Fang leads Shen Lan into the study, partially shutting the door. “Sorry,” he says, “my words might be a bit jarring, but that child is—”\n“Relax, I’m not crazy. I know she’s not a real person. But so what? Dammit, Dong Fang, can’t you just let me raise her like a little pet?”\n“If she really was a pet, that’d be fine! But you treat her like a daughter! You call her Niuniu, you give her powdered milk just like Niuniu . . . our Niuniu . . . used to get, with the same high-end dietary supplements, the same fruit and veg . . . she doesn’t need any of it! You get her the best toys, you take her out for walks, you cuddle her to sleep, you work harder than a nanny! Lan, you’ve neglected your career for four years, to stay at home and wait upon an artificial person. Don’t you think it’s a bit much?”\n“A bit much? I just really like Niu . . . really like her. I like caring for her. What’s wrong with that? You often neglect food and sleep playing your VR games, don’t you?”\nDong Fang doesn’t know how to respond to this incongruous analogy. “I like her too, you know that. I’m not opposed to having her in our home, but we’re not young anymore. We need to start a new life. A better life. I’ve wanted a child all these years, a boy or a girl, one who isn’t Niuniu, who can grow up and go to school. But you . . . every time I . . . ”\n“I want another child too.” Shen Lan’s voice begins to tremble, tears flowing. “I want a child who can grow up. But I keep thinking . . . with a new kid growing up and going to school, and us with a new life, what will become of Niuniu? There won’t be time to care for her. How will the new child regard this older sister? Don’t tell me we would treat her like an old toy, throw her in a closet, take her out for Spring Festival and other holidays. We can’t do that to her.”\n“Here we go again.” Dong Fang is shaking. “You keep thinking of her as a real person. You keep considering her feelings. That’s precisely your problem. She’s not real! She can’t even be regarded as an android.”\n“Nonsense. She might not be too clever, but she’s a . . . like Niuniu . . . I don’t know how to say it.”\n“I do. Subconsciously at least, you feel she’s alive. Like in those scifi movies, a robot with human nature. But it’s delusional. She’s just a machine, and not even a clever one!”\nShen Lan’s gaze is cold. “Whatever. I don’t see it.”\n“Fine.” Dong Fang nods. “I’ll prove it to you. I’ll show you what this child really is!”\nHe pulls up a video on his device. “Remember? This was five years ago, our Niuniu playing with those shape-changing blocks. She built a little pyramid, and we praised her cleverness. Now look at this Niuniu. She’s doing the same thing, like two peas in a pod. Look, almost exactly the same, movement for movement! Look . . . drops the blue block and picks it back up. See? Isn’t it exactly the same?”\nShen Lan, growing pale, looks from the video to her proximate Niuniu.\n“This is the truth!” Dong Fang says. “Four years ago, I transferred all videos of Niuniu to that underground factory, all that we recorded, and thousands of hours from the hummingbird, nearly half her life. They restored Niuniu based on this data. Her appearance, obviously, but also inside. Later I researched the tech, the big data analysis, the psychological modeling, core personality reconstruction . . . it’s deceiving, sly nonsense. They just took all the content and put it in a database. Simple instructions mix these ready-made responses. For instance, see Papa and run for a hug, see Mama and want to suckle, like that. At best, minor adjustments are carried out based on the environment. This Niuniu is neither a person nor an AI. She has no personality. She’s just . . . it may sound funny . . . a 3D video of Niuniu’s life.”\n“A video . . . ” Shen Lan sneers, as if fundamentally refusing to believe.\n“Yes, a video! Honestly, this past year I’ve been watching her very carefully. Everything she does, every movement, replicates something Niuniu did. Whenever she’s in an environment corresponding to back then, she proceeds based on the source video. The data is rich, of course, so it’s not easy to perceive at a glance. For instance, Niuniu has about a dozen anger modes. For crying, it’s thirty odd. Laughing, more than fifty. Combine all the types and the number gets astronomical . . . but it’s all based on our Niuniu, on what happened to our Niuniu. There’s nothing new. It’s all replication! Reconstruction! But because infants at this stage of development are all generally similar . . . in their language, movement, and reactions . . . we don’t really perceive it.”\nA breathless Dong Fang, having rendered his verdict, notices Shen Lan isn’t as shocked as he imagined she would be. “Is that all?” she says dully.\n“It’s not enough?”\n“I already knew! I mean it’s ridiculous. How long did you take care of her? What about me? You left early every morning and came home late. I was by her side all day. You really think I didn’t notice her speech and actions were completely identical to Niuniu’s? You think her underlying mechanisms weren’t obvious to me? Everything you’ve said I already knew. But all that is why I love her.”\n“But that’s ridiculous!”\n“Don’t you understand?” Shen Lan nods at the little girl amusing herself beyond the glass door. “If she were some top-notch imitation human, with independent personality and emotion algorithms, maybe I wouldn’t feel like this. But she’s a time machine. She takes us back to those times with Niuniu. Every word, every movement, every smile, all just like Niuniu’s. We never let go of Niuniu. She’s been with us all along.”\n9\nDong Fang glares at his wife, panic-stricken. It was like he couldn’t recognize her. For a while he was at a loss. “So you really do know all this, better than me. You know but choose to stay in the past, seal yourself away in memories of Niuniu . . . but why, ultimately?”\n“How about an example?” Shen Lan smiles bitterly, wretchedly. “Maybe you don’t know, but one time back then, Niuniu woke from a nap and no one was with her. The nanny had not arrived, I was in the shower with music, and she cried, louder and louder, getting terribly desperate, practically passing out from crying. After a while I just barely heard her. I didn’t even get dressed, just rushed out to pick her up. I consoled her for an hour, and she just wouldn’t quit crying. Well, not long ago, this scene happened again. I heard her calling out, the cadence the same, every undulation precise! It was Niuniu calling out again. What could I do? Just like back then, I went out and picked her up and consoled her. In that moment, she was my daughter. I’ve noticed you growing colder toward her over the past couple years. I noticed long ago. Cold, even cruel. But she still loves you. Still so attached to you. Regardless of how hard she’s crying, one hug from you does the trick. This wouldn’t be possible with another child, and why? Because she is our Niuniu from back then. She loves you as Niuniu did. There’s no difference at all! She loves you way more than she loves me. How can you let her down?”\n“This is . . . ” Dong Fang suffers vertigo. Can it be that Niuniu has really traversed time? Has she come back to him via this artificial body? No, it’s irrational. He can’t be deceived. “Don’t try to fool me like you fool yourself. No matter how accurately she recreates Niuniu’s actions and speech, she has no real feelings, no inner life. She’s a shadow, a reflection. You and I can’t keep watch over a shadow our whole lives. We have to let her go.”\n“You don’t get it. I can’t let her go. To each their own. Just don’t try to force me, okay?”\n“How about you don’t force me?” Dong Fang roars, driven beyond forbearance. “Of course I know you can’t let her go. I’ve talked to psychologists. I know why. Because that day, which we never bring up—”\n“Don’t say it!” Shen Lan interrupts, voice trembling.\n“I could leave it alone, but we’re both well aware, aren’t we? That day Niuniu fell, it was entirely your—”\n“Don’t you say it!” Shen Lan is growing frenzied. Niuniu turns to regard them with doubt and fear.\nShen Lan heads for the living room, but Dong Fang pulls her to a halt and firmly shuts the study door. It’s a special kind of glass, soundproofed, so Niuniu can’t hear them. She stares a few seconds more, then returns to her solitary play.\n“Still not ready to face it?” Dong Fang says, ruthless, unaware of his secret thrill, as if a long-confined demon is finally breaking free: “You’ve sealed yourself off in a year of Niuniu memories, but you never visit that last day. Because you can’t go there, you just go ’round and ’round, repeating the cycle, raising her over and over. But it’s useless. We’ve always lived inside that day! We can’t leave it, and I’ve fucking had enough. This is your problem now. Why should I keep following you? You’ve got to face it, head on! Now! Face it!”\nShen Lan struggles in his grip. “What do you mean?” She looks into the living room, avoiding Dong Fang’s gaze. “Why’d you put the chair there? What is this? What do you want from . . . ”\nDong Fang clicks a remote control, and the casement of the bay window drifts open. This gets Niuniu’s attention. Her computer chip brain rapidly conducts a database search, finds a matching section of memory, activates a movement subroutine.\nShe stands up and waddles toward the chair.\n“You fucking psycho!” Shen Lan cries. “What are you doing? Let go of me!”\nDong Fang maintains his grip, his other hand covering her mouth. He feels demonic, but he’s a joyful demon. “You have to face this! Face everything you created! I can’t bear the load forever! Look! Look! That day . . . your stupidity led to our daughter’s death!”\nNiuniu can’t hear them. In no time she has climbed on to the chair. Then she climbs the guardrail, and she’s in the window bay. Dong Fang saw it with his own eyes back then. Now he sees it from a new angle, as if he’s time-traveled back to that day five years ago. Shen Lan stares, dumbfounded and paralyzed. This is the penultimate scene, Dong Fang thinks. Soon it will really be finished, and they’ll be able to start over.\nGoodbye Niuniu. This time for real. Goodbye.\nNiuniu climbs on to the windowsill. She looks over her shoulder, smiling sweetly at her parents. Dong Fang suddenly realizes he forgot something. This time there is no hummingbird drone, no final trigger of tragedy. Let it be, he thinks. Maybe this is enough.\nAmid this distraction, Shen Lan renews her struggle, breaks free, pushing him into a bookshelf. She flings open the door and charges toward the window.\n“Niuniu!”\nShe leaps the railing and lands on the window bay. She reaches for the girl on the windowsill. In that moment, she too has crossed endless time, back to the decisive moment five years before, meaning to change the iron fact of tragic predestination. Face savage, moved by maternal instinct, she has resolved to prevail, to change everything.\nAnd this triggers Niuniu’s final reaction.\nSeemingly terrified, shrinking from Shen Lan, she leans back.\n“No!” Shen Lan shrieks. Five years ago, after a similar wail, she fainted. When she woke, the police cruiser had arrived downstairs.\nBut this time is different.\nWithout hesitation, Shen Lan puts a foot beyond the windowsill, pouncing outward. This time she seizes Niuniu, but it’s too late. Embracing the little girl, she turns her head, seeming not to understand what’s happening. Dong Fang, who has just rushed out of the study, briefly meets her gaze. A moment later, the hem of her fluttering dress vanishes over the windowsill.\nDong Fang hears himself screaming. He stumbles toward the window, hears a horrible, muffled sound. Leaning out the window, he sees Shen Lan far below, so small, lying on the road, her dress going scarlet, the redness expanding. Niuniu lies prostrate on top of her mother, howling, seemingly unaffected by the impact. People close in.\nBefore losing consciousness, Dong Fang sees a faint smile on his wife’s face.\n10\nOn that rainy day, the young woman in white had become small with distance.\nOn that fateful day, young Dong Fang had gone quite far with his umbrella when he turned around, timidly gazing at the girl. She was hazy beyond the intervening fine rain. Mind made up, he headed back. Putting one foot in front of the other, treading through puddles, he drew closer, heart beating faster, as if it would burst from his chest into her embrace. He wasn’t sure if she saw him coming because he couldn’t look up. He would have to talk to her. May I accompany you home? Or could I lend you my umbrella? How could he talk to her without it sounding abrupt and awkward?\nAscending the steps, he was still racking his brain for suitable lines. He wasn’t paying attention to his footing. He slid, toppled, lost his umbrella, and landed in a deep puddle, mortified. When he looked up, there she was, extending her hand and smiling faintly. That smile, that face dripping with rain, would be branded on Dong Fang’s brain forever—no matter how she changed.\nIn that moment, Dong Fang somehow knew Shen Lan would always be a part of his life.\nNothing would separate them.\nThinking of the past, smiling, Dong Fang opens the front door. Little Niuniu amuses herself beside Shen Lan’s foot. She sees him, immediately beaming and awkwardly standing up. She staggers toward him, shouting, “Papa!”\nDong Fang puts down his briefcase and picks her up. He lifts her high. She shrieks excitedly.\n“Careful,” Shen Lan says. “Please don’t drop our child!” Dong Fang reassures her, and she says, “Hey, didn’t you notice?”\n“Notice what?”\n“She can walk! Yesterday she could go two or three steps at most. You saw her do more just now! She can go from one end of the room to the other.”\nDong Fang puts Niuniu down. She starts walking straightaway. She can indeed stride, performing with a high and mighty air, though her knees still don’t bend properly, so she can only proceed swaying comically like a penguin. After a few steps she goes down, but luckily a floor mat cushions her fall. She gets up, snorts, and swinging her arms, continues to stagger.\nShen Lan shakes with laughter. Dong Fang laughs with her. “Her motor neurons are really developing. Maybe she’ll grow up to win honor for the country!”\nThey give Niuniu a bath, feed her milk together, then bring her to bed for sleep. She drinks a bit more, and they play with her awhile. She turns to her Papa’s side, then rolls over to pat her Mama. Finally, she closes her eyes, long lashes hanging down. Nestled against her parents, she sleeps. Shen Lan looks at her device for a bit, chats a little with Dong Fang, then turns off the lamp and closes her eyes. Dong Fang lies in the dark alone, eyes open. He listens to Shen Lan’s irregular breathing gradually even out.\nWhen Shen Lan and Niuniu are both asleep, he stealthily rises.\nHe turns their bodies over to lie prone. He opens the backs of their heads and extracts the batteries. He takes the batteries to the recharger and fetches replacements. Mother and daughter resume their gentle breathing. Accompanied by their warm breath, Dong Fang is content. He closes his eyes and enters dreamland.\nOriginally published in Chinese in Flower City, fifth issue of 2018.\nTranslated and published in partnership with Storycom.\nBaoshu is a science fiction and fantasy writer. He has published five novels and dozens of shorter works since 2010, including Three Body X: Redemption of Time, Ruins of Time (winner of the 2014 Chinese Nebula Award for Best Novel), Seven States of the Galaxy: Phantom From an Ancient Empire, and \"Everybody Loves Charles\" (winner of the 2015 Galaxy Award for Best Novella). He lives in Xi'an, China.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles.", "source": "https://clarkesworldmagazine.com/bao_11_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Niuniu by Baoshu, translated by Andy Dudak"}