{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ZSxpUNoSB+Gzzzp+WAaKVCsGESE=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Mushrooms Sprout From Dead Things: A Conversation with Silvia Moreno-Garcia  Silvia Moreno-Garcia was born in Baja California, Mexico, and grew up in various places throughout the country. Her parents worked at radio stations, and she grew up surrounded by vinyl records. Her great-grandmother was from Hidalgo, and Moreno-Garcia drew inspiration from her stories and oral storytelling. Moreno-Garcia’s introduction to horror literature was via a collection of stories by Edgar Allen Poe, which she discovered at a young age. Poe led to H. P. Lovecraft, which led to Frankenstein, Dracula, Carmilla, Dr. Jekyll and Mr. Hyde, and more. Her mother also read science fiction and fantasy, and had many books on hand, classics like Dune, authors from Tanith Lee to Tolkien. Her childhood reading also including books like The Count of Monte Cristo and Twenty Thousand Leagues Under the Sea.  Silvia Moreno-Garcia studied communications at Endicott College in Massachusetts, then returned to Mexico, where she married her husband. Together they moved to Canada. She studied journalism in Canada and earned a master’s in science and technology studies. Her thesis was “Magna Mater: Women and Eugenic Thought in the Work of H. P. Lovecraft.” She later worked in communications at the University of British Columbia.  Moreno-Garcia and Paula R. Stiles launched Innsmouth Free Press in 2009, a weird fiction publishing house. They produced fifteen issues of Innsmouth Magazine from 2009–2014, along with numerous anthologies, including several coedited by Moreno-Garcia and Stiles. She also coedited anthology Fungi with Orrin Grey. Moreno-Garcia edited other anthologies as well, such as 2013’s Dead North: Canadian Zombie Fiction and 2014’s Fractured: Tales of the Canadian Post-Apocalypse, both with Exile Editions; and Nebula Awards Showcase 2019 published by Parvus. She was coeditor of magazine The Dark from 2016–2020.  Silvia Moreno-Garcia’s short fiction hit the scene with “Mirror Life” in magazine Deep Magic, followed closely by “King of Sand and Stormy Seas” in Shimmer, both published in 2006. From there, her short fiction career remained steady, with work published across a range of anthologies and magazines, including Expanded Horizons, Lovecraft eZine, GigaNotoSaurus, AE – The Canadian Science Fiction Review, Fantasy Magazine, and Apex.  In 2013 Silvia Moreno-Garcia published two collections, Other Lives and This Strange Way of Dying, the latter of which received a Sunburst nomination. She has since received an avalanche of accolades and awards nods. Her 2015 anthology She Walks in Shadows, coedited with Stiles and published through Innsmouth, won a World Fantasy Award. Her debut novel Signal to Noise, published by Rebellion imprint Solaris in 2015, was a finalist for Aurora, Sunburst, Locus, and British Fantasy awards, and won a Copper Cylinder Award.  Other novels include Certain Dark Things in 2016 from St. Martin’s imprint Thomas Dunne, which was a Locus Award finalist; The Beautiful Ones in 2017 from Dunne, which was on the Locus Recommended Reading list; Gods of Jade and Shadow in 2019 from Del Rey, which was a Locus, Dragon, Aurora, and Nebula finalist, and won Sunburst and Ignyte awards; and Mexican Gothic in 2020 from Del Rey, which was a Mythopoeic, Shirley Jackson, Stoker, World Fantasy, and Nebula finalist, and won Aurora, Locus, and BFA awards, as well as coming in first in the Goodreads poll for horror. She also publishes work without speculative elements, such as finalist for the Los Angeles Times Book Prize, Velvet Was the Night.  Moreno-Garcia’s latest titles include The Return to the Sorceress, published by Subterranean Press in 2021; “The Tiger Came to the Mountains,” published as part of the Trespass Collection (2022); and novel The Daughter of Doctor Moreau, due this month from Del Rey.   What drew you to take on The Island of Doctor Moreau, what excited you about writing a novel loosely inspired by that work?  I had wanted to do something with Moreau for a long time but couldn’t find the proper shape to the story. I had ideas that didn’t gel—a daughter was a central element—and had been mulling them over for years, which is not unusual. Mexican Gothic was something that rolled around for a long time in bits and pieces, imagery that had no real rhyme or reason. The thing that always stopped me with Moreau was the setting. I didn’t know anything about an island in the Southern Pacific and therefore felt I couldn’t tackle it. Then I ended up realizing I could switch the action to southern Mexico and with that I knew exactly the time period I needed to use. It all clicked together. With the proper backdrop, I could begin working on characters, I could string together a plot. Ideas about race, class, colonialism, science, religion, family, and love suddenly became cohesive, and it was a story I wanted to tell.  One of the viewpoint characters is Carlota, Moreau’s daughter. What were your goals for writing this character, and what are your favorite things about her?  There are two opposing points of view. One of them is Montgomery, who is a jaded alcoholic who works in Doctor Moreau’s house, and the other is Carlota, a young woman who is coming into herself. They seem to be opposites, and part of what makes Carlota interesting is that she is naïve, sheltered, and dreamy, but also at times frustrating. Montgomery is frustrating too, but in a different way, and together they offer a full view of the world of Moreau.  You’ve talked before about how each book you write is different from the others. With The Daughter of Doctor Moreau, are there important stylistic differences, or differences in tone or narrative choices, as compared to your other novels?  This is a book that is loosely inspired by a nineteenth century work and with that come certain challenges. On the one hand, people who might have read The Island of Doctor Moreau might come at it with certain preconceptions and expectations. On the other hand, you have many people who have told me they never read it and know nothing about it. For them the name Moreau has no meaning. So, how do you build something that stands on its own? Something that is not simply a prequel or a sequel, or a pastiche, something that has a different point of view and a reason for existing beyond simply wanting to imitate or deconstruct Wells.  Are there stories or writers you loved, whose influence you see in The Daughter of Doctor Moreau?  I love nineteenth century writers. I love that slow, ornate tone that books like Madame Bovary or The Age of Innocence have. Flaubert’s extreme realism and lush paragraphs fascinate me, but I also quite like Maupassant, whose short stories strike you like a bullet to the heart.  This is your eighth novel. Are there aspects of writing this book that were still quite challenging, and how did you deal with those challenges?  This was a fairly fast and easy endeavor. There was the usual research that I conducted but putting pen to paper was quick and efficient. I was writing two thousand or three thousand words a day. This was during the beginning of the pandemic, when my job became remote. Because I was at home all the time, writing was the only way I was going “outside,” so I tended to write for longer stretches of time. Normally I might waffle around after my family has gone to bed, maybe try to read a bit or waste time with an app, but none of that seemed terribly interesting at the time, and I just wanted to write. So I wrote. I had a first draft quickly and then I revised from there. There’s normally a point at which I get stuck with a book but in this case, it was smooth sailing.  What kind of research did you do for The Daughter of Doctor Moreau, and what were some of your favorite interesting finds?  Old maps. That was probably the most fun part. It’s quite shocking to see what someone thought the world looked like a couple of centuries before.  Some readers think of you as a horror writer, and I have seen this book described as “adult literary horror.” What is “horror” for you, and what are the ways that this book ventures into or utilizes horror?  I consider The Daughter of Doctor Moreau a historical novel and a science fiction novel. Adult literary horror has a funny ring to it. Is horror too simple a word? Is it the association with “low” literature that necessitates its elevation via the term literary? On the other hand, if we simply call it “horror,” I fear people will expect big scares and this is not a Big Scare Book. I didn’t think The Island of Doctor Moreau was a Big Scare Book either. Violent, yes. Uncomfortable, that too.  I know we need to define and situate works, but I’m not sure we achieve the desired result most of the time. And then there’s the problems with automatic labels, people just stick them on and they don’t pause to think about what they mean, or if they really apply. A friend found a copy of The Beautiful Ones in the horror section: it’s a romantic novel of manners. Someone told me they read Velvet Was the Night, which is a noir, and kept expecting a monster to pop in, but it was a crime novel (yeah!). We are more used these days to seeing writers sticking to a single category, but I’m not a horror writer, or a fantasy writer, or a crime writer. I’m all these and more depending on the work you are talking about.  Getting back to The Daughter of Doctor Moreau, I think it’ll be appealing to people who like historical novels, and who enjoy a dose of science fiction and some Gothic uncanny elements. That’s a mouthful but more accurate. Although, in the end, as long as someone doesn’t call it “magic realist,” I suppose I should count myself happy. But that’s a different rant.  Did editing, composing book reviews, and other kinds of work have any impact on the way you write? And conversely, does being a successful author mean your reviews tend to have insights some reviewers might not have?  The same basic skills are transferable between one type of writing and the other. Working in corporate communications, writing for newspapers or magazines, they prepare you to handle things like deadlines and revisions in a very efficient way. I really think those who were lucky enough to train as journalists have an advantage over people who trained through an MFA, no offense. And yes, maybe I’m biased because I don’t have an MFA and came up through another route.  What is your usual process for putting together a short story, and was your process with the story, “The Tiger Came to the Mountains” similar or different than usual?  I don’t write short stories much anymore, but Jeff VanderMeer asked me if I wanted to be in an anthology project, and he told me about the theme. I mulled it over for a few days and said yes. It’s as simple as that. Once something strikes my fancy, I usually feel the need to begin working on it and don’t stop until it’s done. In that sense, the benefit of short stories is that I seldom stall, which I do with novels when I reach that “dead zone” where I think I can’t proceed and the whole book is useless.  What is the heart of this story, what do you want readers to know about it?  “The Tiger Came to the Mountains” is a historical story set around the time of the Mexican Revolution inspired by my great-grandmother’s life. A tiger from a circus is set loose in the countryside.  Looking at your career, comprising novels and shorter fiction and more, and filigreed with accolades including several awards . . . are there projects you didn’t complete?  Yeah, a lot of them. Most of them are not worth a damn. I simply cannibalize old work when I think there’s something to be found there. A title, a turn of phrase, an image. Things don’t necessarily gel the first time around. I keep a file folder with ideas for that reason. I’ve learned the difference between pushing through a project that has some meat in it and finishing a novel, and the bits that are best left to molder away in a drawer. Which doesn’t mean they are gone forever. Mushrooms sprout from dead things.  What else do you have coming up? What are you working on that people should know about?  I delivered my next novel to my editor, and it’s called Silver Nitrate. It’s set in early 1990s Mexico, and this is actually horror with perhaps a side of urban fantasy. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nMushrooms Sprout From Dead Things: A Conversation with Silvia Moreno-Garcia\nSilvia Moreno-Garcia was born in Baja California, Mexico, and grew up in various places throughout the country. Her parents worked at radio stations, and she grew up surrounded by vinyl records. Her great-grandmother was from Hidalgo, and Moreno-Garcia drew inspiration from her stories and oral storytelling. Moreno-Garcia’s introduction to horror literature was via a collection of stories by Edgar Allen Poe, which she discovered at a young age. Poe led to H. P. Lovecraft, which led to Frankenstein, Dracula, Carmilla, Dr. Jekyll and Mr. Hyde, and more. Her mother also read science fiction and fantasy, and had many books on hand, classics like Dune, authors from Tanith Lee to Tolkien. Her childhood reading also including books like The Count of Monte Cristo and Twenty Thousand Leagues Under the Sea.\nSilvia Moreno-Garcia studied communications at Endicott College in Massachusetts, then returned to Mexico, where she married her husband. Together they moved to Canada. She studied journalism in Canada and earned a master’s in science and technology studies. Her thesis was “Magna Mater: Women and Eugenic Thought in the Work of H. P. Lovecraft.” She later worked in communications at the University of British Columbia.\nMoreno-Garcia and Paula R. Stiles launched Innsmouth Free Press in 2009, a weird fiction publishing house. They produced fifteen issues of Innsmouth Magazine from 2009–2014, along with numerous anthologies, including several coedited by Moreno-Garcia and Stiles. She also coedited anthology Fungi with Orrin Grey. Moreno-Garcia edited other anthologies as well, such as 2013’s Dead North: Canadian Zombie Fiction and 2014’s Fractured: Tales of the Canadian Post-Apocalypse, both with Exile Editions; and Nebula Awards Showcase 2019 published by Parvus. She was coeditor of magazine The Dark from 2016–2020.\nSilvia Moreno-Garcia’s short fiction hit the scene with “Mirror Life” in magazine Deep Magic, followed closely by “King of Sand and Stormy Seas” in Shimmer, both published in 2006. From there, her short fiction career remained steady, with work published across a range of anthologies and magazines, including Expanded Horizons, Lovecraft eZine, GigaNotoSaurus, AE – The Canadian Science Fiction Review, Fantasy Magazine, and Apex.\nIn 2013 Silvia Moreno-Garcia published two collections, Other Lives and This Strange Way of Dying, the latter of which received a Sunburst nomination. She has since received an avalanche of accolades and awards nods. Her 2015 anthology She Walks in Shadows, coedited with Stiles and published through Innsmouth, won a World Fantasy Award. Her debut novel Signal to Noise, published by Rebellion imprint Solaris in 2015, was a finalist for Aurora, Sunburst, Locus, and British Fantasy awards, and won a Copper Cylinder Award.\nOther novels include Certain Dark Things in 2016 from St. Martin’s imprint Thomas Dunne, which was a Locus Award finalist; The Beautiful Ones in 2017 from Dunne, which was on the Locus Recommended Reading list; Gods of Jade and Shadow in 2019 from Del Rey, which was a Locus, Dragon, Aurora, and Nebula finalist, and won Sunburst and Ignyte awards; and Mexican Gothic in 2020 from Del Rey, which was a Mythopoeic, Shirley Jackson, Stoker, World Fantasy, and Nebula finalist, and won Aurora, Locus, and BFA awards, as well as coming in first in the Goodreads poll for horror. She also publishes work without speculative elements, such as finalist for the Los Angeles Times Book Prize, Velvet Was the Night.\nMoreno-Garcia’s latest titles include The Return to the Sorceress, published by Subterranean Press in 2021; “The Tiger Came to the Mountains,” published as part of the Trespass Collection (2022); and novel The Daughter of Doctor Moreau, due this month from Del Rey.\nWhat drew you to take on The Island of Doctor Moreau, what excited you about writing a novel loosely inspired by that work?\nI had wanted to do something with Moreau for a long time but couldn’t find the proper shape to the story. I had ideas that didn’t gel—a daughter was a central element—and had been mulling them over for years, which is not unusual. Mexican Gothic was something that rolled around for a long time in bits and pieces, imagery that had no real rhyme or reason. The thing that always stopped me with Moreau was the setting. I didn’t know anything about an island in the Southern Pacific and therefore felt I couldn’t tackle it. Then I ended up realizing I could switch the action to southern Mexico and with that I knew exactly the time period I needed to use. It all clicked together. With the proper backdrop, I could begin working on characters, I could string together a plot. Ideas about race, class, colonialism, science, religion, family, and love suddenly became cohesive, and it was a story I wanted to tell.\nOne of the viewpoint characters is Carlota, Moreau’s daughter. What were your goals for writing this character, and what are your favorite things about her?\nThere are two opposing points of view. One of them is Montgomery, who is a jaded alcoholic who works in Doctor Moreau’s house, and the other is Carlota, a young woman who is coming into herself. They seem to be opposites, and part of what makes Carlota interesting is that she is naïve, sheltered, and dreamy, but also at times frustrating. Montgomery is frustrating too, but in a different way, and together they offer a full view of the world of Moreau.\nYou’ve talked before about how each book you write is different from the others. With The Daughter of Doctor Moreau, are there important stylistic differences, or differences in tone or narrative choices, as compared to your other novels?\nThis is a book that is loosely inspired by a nineteenth century work and with that come certain challenges. On the one hand, people who might have read The Island of Doctor Moreau might come at it with certain preconceptions and expectations. On the other hand, you have many people who have told me they never read it and know nothing about it. For them the name Moreau has no meaning. So, how do you build something that stands on its own? Something that is not simply a prequel or a sequel, or a pastiche, something that has a different point of view and a reason for existing beyond simply wanting to imitate or deconstruct Wells.\nAre there stories or writers you loved, whose influence you see in The Daughter of Doctor Moreau?\nI love nineteenth century writers. I love that slow, ornate tone that books like Madame Bovary or The Age of Innocence have. Flaubert’s extreme realism and lush paragraphs fascinate me, but I also quite like Maupassant, whose short stories strike you like a bullet to the heart.\nThis is your eighth novel. Are there aspects of writing this book that were still quite challenging, and how did you deal with those challenges?\nThis was a fairly fast and easy endeavor. There was the usual research that I conducted but putting pen to paper was quick and efficient. I was writing two thousand or three thousand words a day. This was during the beginning of the pandemic, when my job became remote. Because I was at home all the time, writing was the only way I was going “outside,” so I tended to write for longer stretches of time. Normally I might waffle around after my family has gone to bed, maybe try to read a bit or waste time with an app, but none of that seemed terribly interesting at the time, and I just wanted to write. So I wrote. I had a first draft quickly and then I revised from there. There’s normally a point at which I get stuck with a book but in this case, it was smooth sailing.\nWhat kind of research did you do for The Daughter of Doctor Moreau, and what were some of your favorite interesting finds?\nOld maps. That was probably the most fun part. It’s quite shocking to see what someone thought the world looked like a couple of centuries before.\nSome readers think of you as a horror writer, and I have seen this book described as “adult literary horror.” What is “horror” for you, and what are the ways that this book ventures into or utilizes horror?\nI consider The Daughter of Doctor Moreau a historical novel and a science fiction novel. Adult literary horror has a funny ring to it. Is horror too simple a word? Is it the association with “low” literature that necessitates its elevation via the term literary? On the other hand, if we simply call it “horror,” I fear people will expect big scares and this is not a Big Scare Book. I didn’t think The Island of Doctor Moreau was a Big Scare Book either. Violent, yes. Uncomfortable, that too.\nI know we need to define and situate works, but I’m not sure we achieve the desired result most of the time. And then there’s the problems with automatic labels, people just stick them on and they don’t pause to think about what they mean, or if they really apply. A friend found a copy of The Beautiful Ones in the horror section: it’s a romantic novel of manners. Someone told me they read Velvet Was the Night, which is a noir, and kept expecting a monster to pop in, but it was a crime novel (yeah!). We are more used these days to seeing writers sticking to a single category, but I’m not a horror writer, or a fantasy writer, or a crime writer. I’m all these and more depending on the work you are talking about.\nGetting back to The Daughter of Doctor Moreau, I think it’ll be appealing to people who like historical novels, and who enjoy a dose of science fiction and some Gothic uncanny elements. That’s a mouthful but more accurate. Although, in the end, as long as someone doesn’t call it “magic realist,” I suppose I should count myself happy. But that’s a different rant.\nDid editing, composing book reviews, and other kinds of work have any impact on the way you write? And conversely, does being a successful author mean your reviews tend to have insights some reviewers might not have?\nThe same basic skills are transferable between one type of writing and the other. Working in corporate communications, writing for newspapers or magazines, they prepare you to handle things like deadlines and revisions in a very efficient way. I really think those who were lucky enough to train as journalists have an advantage over people who trained through an MFA, no offense. And yes, maybe I’m biased because I don’t have an MFA and came up through another route.\nWhat is your usual process for putting together a short story, and was your process with the story, “The Tiger Came to the Mountains” similar or different than usual?\nI don’t write short stories much anymore, but Jeff VanderMeer asked me if I wanted to be in an anthology project, and he told me about the theme. I mulled it over for a few days and said yes. It’s as simple as that. Once something strikes my fancy, I usually feel the need to begin working on it and don’t stop until it’s done. In that sense, the benefit of short stories is that I seldom stall, which I do with novels when I reach that “dead zone” where I think I can’t proceed and the whole book is useless.\nWhat is the heart of this story, what do you want readers to know about it?\n“The Tiger Came to the Mountains” is a historical story set around the time of the Mexican Revolution inspired by my great-grandmother’s life. A tiger from a circus is set loose in the countryside.\nLooking at your career, comprising novels and shorter fiction and more, and filigreed with accolades including several awards . . . are there projects you didn’t complete?\nYeah, a lot of them. Most of them are not worth a damn. I simply cannibalize old work when I think there’s something to be found there. A title, a turn of phrase, an image. Things don’t necessarily gel the first time around. I keep a file folder with ideas for that reason. I’ve learned the difference between pushing through a project that has some meat in it and finishing a novel, and the bits that are best left to molder away in a drawer. Which doesn’t mean they are gone forever. Mushrooms sprout from dead things.\nWhat else do you have coming up? What are you working on that people should know about?\nI delivered my next novel to my editor, and it’s called Silver Nitrate. It’s set in early 1990s Mexico, and this is actually horror with perhaps a side of urban fantasy.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/moreno-garcia_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mushrooms Sprout From Dead Things: A Conversation with Silvia Moreno-Garcia by Arley Sorg"}