{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Yoon Ha Lee", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "CfuWybAyzDN4WYzVgumHyBJLWzc=", "id": null, "license": null, "comments": "", "raw_text": "4010 words, short story  Between Two Dragons  One of the oldest tales we tell in Cho is of two dragons, twinborn and opposite in all desires. One dragon was as red as Earth, the other as blue as Heaven: day and night, fire and water, passion and calculation. They warred, as dragons do, and the universe was born of their battle.  We have never forgotten that we partake of both dragons, Earth and Heaven. Yet we are separate creatures with separate laws. It is why the twin dragons appear upon our national seal, separated by Man’s sinuous road. We live among the stars, but we remember our heritage.  One thing has not changed since the birth of the universe, however. There is still war.  Yen, you have to come back so I can tell you the beginning of your story. Everything is classified: every soldier unaccounted for, every starsail deployed far from home, every gram of shrapnel . . . every whisper that might have passed between us. Word of the last battle will come tomorrow, say the official news services, but we have heard the same thing for the last several days.  I promised I would tell no one, so instead I dream it over and over. I knew, when I began to work for the Ministry of Virtuous Thought, that people would fear me. I remind myself of this every time someone calls me a woman with no more heart than a stone, despite the saying that a stone’s weeping is the most terrible of all.  You came to me after the invaders from Yamat had been driven off, despite the fall of Spinward Gate and the capital system’s long siege. I didn’t recognize you at first. Most of my clients use one of the government’s thousand false names, which exist for situations requiring discretion. Your appointment was like any other, made under one such.  Your face, though—I could hardly have failed to recognize your face. Few clients contact me in person, although I can’t help wanting to hear, face-to-face, why my patients must undergo the changes imposed on them.  Admiral Yen Shenar: You were an unassuming man, although your dark eyes suggested a certain taut energy, and you were no stranger to physical labor. I wished I were in such lean good health; morning exercise has never done much for me. But your drab civilian clothes and the absent white gun did nothing to disguise the fact that you were a soldier. An admiral. A hero, even, in my office with its white walls and bland paintings of bamboo.  “Admiral,” I said, and stopped. How do you address the war hero of a war everyone knows will resume when the invaders catch their breath? I thought I knew what you wanted done. A former lover, a political rival, an inconvenience on the way up; the client has the clout to make someone disappear for a day and return as though nothing as changed, except it has. A habit of reverse-alphabetizing personal correspondence, a preference for Kir Jaengmi’s poetry over An Puna’s, a subversive fascination with foreign politics, excised or altered by my work. Sometimes only a favorite catchphrase or a preference for ginseng over green tea is changed, and the reprogramming serves as a warning once the patient encounters dissonance from family and acquaintances. Sometimes the person who returns is no longer recognizable. The setup can take months, depending on the compatibility of available data with preset models, but the reprogramming itself only takes hours.  So here you were, Admiral Yen Shenar. Surely you were rising in influence, with the attendant infelicities. It disappointed me to see you, but only a little. I could guess some of your targets.  “There’s no need for formality, madam,” you said, correctly interpreting my silence as a loss for words. “You’ve dealt with more influential people in your time, I’m sure.” Your smile was wry, but suggested despair.  I thought I understood that, too. “Who is the target?”  The despair sharpened, and everything changed. “Myself. I want to be expunged, like a thrall. I’m told it’s easier with a willing subject.”  “Heaven and Earth, you can’t be serious.”  The walls were suddenly too spare, too white.  I wondered why you didn’t do the obvious thing and intrigue against Admiral Wan Kun, or indeed the others in court who considered your growing renown a threat. No surprise: the current dynasty had been founded by a usurper-general, and ever since, the court has regarded generals and admirals with suspicion. We may despise the Yamachin, but they are consummate warriors, and they would never have been so frightened by the specter of a coup as to sequester their generals at the capital, preventing them from training with the troops they commanded on paper. We revere scholars. They have their sages, but soldiers are the ones they truly respect.  “Madam,” you said, “I am only asking you to do what the ministry will ask of another programmer a few days from now. It doesn’t matter what battles one wins in the deeps of space if one can’t keep out of political trouble. Even if we all know the Yamachin will return once they’ve played out this farce of negotiations . . . ”  You wanted me to destroy the man you were, but in a manner of your choosing and not your rivals’, all for the sake of saving Cho in times to come. This meant preserving your military acumen so you might be of use when Yamat returned to ravage Cho. Only a man so damned sure of himself would have chanced it. But you had routed the Yamachin navy at Red Sun and Hawks Crossing with a pittance of Chosar casualties, and no one could forget how, in the war’s early hours, you risked your command by crossing into Admiral Wan Kun’s jurisdiction to rally the shattered defense at Heaven’s Gate.  “Admiral,” I said, “are you sure? The half-death”—that’s the kindest euphemism—“might leave you with no more wit than a broken cup, and all for nothing. It has never been a safe procedure.” I didn’t believe you would be disgraced in a matter of days, although it came to pass as you predicted.  You smiled at that, blackly amused. “When calamity lands on your shoulder, madam, I assure you that you’ll find it difficult to mistake for anything else.” A corner of your mouth curled. “I imagine you’ve seen death in darker forms than I have. I have killed from vast distances, but never up close. You are braver by far than I have ever been.”  You were wrong about me, Admiral Yen, even if the procedure is easier with a willing patient. With anyone else, I would have congratulated myself on a task swiftly and elegantly completed.  You know the rest of the story. When you tell it to me, I will give you the beginning that I stole from you, even at your bidding. Although others know our nation Cho as the Realm Between Two Dragons, vast Feng-Huang and warlike Yamat, our national emblem is the tiger, and men like you are tigers among men.  Sometimes I think that each night I spin the story to myself, a moment of memory will return to you, as if we were bound together by the chains of a children’s fable. I know better. There are villains every direction I look. I am one of them. If you do not return, all that will be left for me is to remember, over and over, how I destroyed the man you should have been, the man you were.  By the time we took him seriously, he was an old man: Tsehan, the chancellor-general of Yamat, and its ruler in truth. Ministers came and ministers went, but Tsehan watched from his unmoving seat in Yamat’s parliament, the hawk who perched above them all.  He was not a man without refinement, despite the popular depiction of him as a wizened tyrant, too feeble to lead the invasion himself and too fierce to leave Cho in peace. Tsehan loved fine things, as the diplomats attested. His reception hall was bright with luxuries: sculptures of light and parabolic mirrors, paintings on silk and bamboo strips, mosaics made from shattered ancient celadon. He served tea in cups whose designs of seasonal flowers and fractals shifted in response to the liquid’s temperature or acidity. “For the people of Yamat,” he said, but everyone knew these treasures were for Tsehan’s pleasure, not the people’s.  War had nurtured him all his life. His father was a soldier of the lowest rank, one more body flung into Yamat’s bloody and tumultuous politics. It is no small thing, in Yamat—a nation at least as class-conscious as our own—to rise from a captain’s aide to heir-apparent of Chancellor-General Oshozhi. Oshozhi succeeded in bringing Yamat with its many would-be warlords under unified rule, and he passed that rule on to Tsehan.  It should not have surprised us that, with the end of Yamat’s bloody civil wars, Tsehan would thirst for more. But Cho was a pearl too small for his pleasure. The chancellor-general wanted Feng-Huang, vastest of nations, jewel of the stars. And to reach Feng-Huang, he needed safe passage through Cho’s primary nexus. Feng-Huang had been our ally and protector for centuries, the culture whose civilization we modeled ours after. Betraying Feng-Huang to the Yamachin would have been like betraying ourselves.  Yamat had been stable for almost a decade under Tsehan’s leadership, but we had broken off regular diplomatic relations during its years of instability and massacre. We had grown accustomed to hearing about dissidents who vanished during lunch, crèches destroyed by rival politicians and generals, bombs hidden in shipments of maiden-faced orchids, and soldiers who trampled corpses but wept over fire-scored sculptures. Some of it might even have happened.  When Tsehan sent the starsail Hanei to ask for the presence of a Chosar delegation and our government acquiesced, few of us took notice. Less than a year after that, our indifference would be replaced by outrage over Yamat’s demands for an open road to our ally Feng-Huang. Tsehan was not a falling blossom after all, as one of our poets said, but a rising dragon.  In the dream, he knew his purpose. His heartbeat was the drum of war. He walked between Earth and Heaven, and his path was his own.  And waking—  He brushed the hair out of his eyes. His palms were sweaty. And he had a name, if not much else.  Yen Shenar, no longer admiral despite his many victories, raised his hand, took aim at the mirror, and fired.  But the mirror was no mirror, only the wall’s watching eyes. He was always under surveillance. It was a fact of life in the Garden of Tranquility, where political prisoners lived amid parameterized hallucinations. The premise was that rebellion, let alone escape, was unlikely when you couldn’t be sure if the person at the corner was a guard or the hallucination of a childhood friend who had died last year. He supposed he should be grateful that he hadn’t been executed outright, like so many who had rioted or protested the government’s policies, even those like himself who had been instrumental in defending Cho from the Yamachin invasion.  He had no gun in his hand, only the unflinching trajectory of his own thoughts. One more thing to add to his litany of grievances, although he was sure the list changed from day to day, hour to hour, when the hallucinations intensified. Sourly, he wished he could hallucinate a stylus, or a chisel with which to gouge the walls, whether they were walls or just air. He had never before had such appreciation for the importance of recordkeeping.  Yen began to jog, trusting the parameters would keep him from smashing into a corner, although such abrupt pain would almost be welcome. Air around him, metal beneath him. He navigated through the labyrinth of overgrown bamboo groves, the wings of unending arches, the spiral blossoms of distant galaxies glimpsed through cracked lattices. At times he thought the groves might be real.  They had imprisoned him behind Yen Shenar’s face, handicapped him with Yen Shenar’s dreams of stars and shapes moving in the vast darkness. They had made the mistake of thinking that he shared Yen Shenar’s thrall-like regard for the government. He was going to escape the Garden if it required him to break each bone to test its verity, uproot the bamboo, break Cho’s government at its foundations.  The war began earlier, but what we remember as its inception is Sang Han’s death at Heaven’s Gate. Even the Yamachin captain who led the advance honored Sang’s passing.  Heaven’s Gate is the outermost system bordering Yamat, known for the number of people who perished settling its most temperate world, and the starsails lost exploring its minor but treacherous nexus. The system was held by Commandant Sang Han, while the province as a whole remains under the protection of Admiral Wan Kun’s fleet. Wan Kun’s, not Yen Shenar’s; perhaps Heaven’s Gate was doomed from the start.  Although Admiral Wan Kun was inclined to dismiss the reports of Yamachin warsails as alarmism, the commandant knew better. Against protocol, he alerted Admiral Yen Shenar in the neighboring system, which almost saved us. It is bitter to realize that we could have held Cho against the invaders if we had been prepared for them when they first appeared.  The outpost station’s surviving logs report that Sang had one last dinner with his soldiers, passing the communal cup down the long tables. He joked with them about the hundred non-culinary uses for rice. Then he warned the leading Yamachin warsail, Hanei, that passage through Cho to invade our ally Feng-Huang would not be forthcoming, whatever the delusion of Yamat’s chancellor-general.  Hanei and its escort responded by opening fire.  We are creatures of fire and water. We wither under a surfeit of light as readily as we wither beneath drowned hopes. When photons march soldier-fashion at an admiral’s bidding, people die.  When the Yamachin boarded the battlestation serving Heaven’s Gate, Sang awaited them. By then, the station was all but shattered, a fruit for the pressing. Sang’s eyes were shadowed by sleepless nights, his hair rumpled, his hands unsteady.  The Hanei’s captain, Sezhi Tomo, was the first to board the station. Cho’s border stations knew his name. In the coming years, we would learn every nuance of anger or determination in that soft, suave voice. Sezhi spoke our language, and in times past he had been greeted as one of us. His chancellor-general had demanded his experience in dealing with Cho, however, and so he arrived as an invader, not a guest.  “Commandant,” he said to Sang, “I ask you and your soldiers to stand down. There’s time yet for war to be averted. Surrender the white gun.” Sezhi must have been aware of the irony of his words. He knew, as most Yamachin apparently did not, that a Chosar officer’s white gun represented not only his rank but his loyalty to the nation. Its single shot is intended for suicide in dire straits.  “Sezhi-kan,” the commandant replied, addressing the other man by his Yamachin title, “it was too late when your chancellor-general set his eye upon Feng-Huang.” And when our government, faction-torn, failed to heed the diplomats’ warning of Tsehan’s ambitions; but he would not say that to a Yamachin. “It was too late when you opened fire on the station. I will not stand down.”  “Commandant,” said Sezhi even as his guards trained their rifles on Sang, “please. Heaven’s Gate is lost.” His voice dropped to a murmur. “Sang, it’s over. At least save yourself and the people who are still alive.”  Small courtesies have power. In the records that made it out of Heaven’s Gate, we see the temptation that sweeps over the commandant’s face as he holds Sezhi’s gaze. We see the moment when he decides that he won’t break eye contact to look around at his haggard soldiers, and the moment when temptation breaks its grasp.  Oh, yes: the cameras were transmitting to all the relays, with no thought as to who might be eavesdropping.  “I will surrender the white gun,” Sang said, “when you take it from me. Dying is easier than letting you pass.”  Sezhi’s face held no more expression than night inside a nexus. “Then take it I shall. Gentlemen.”  The commandant drew the white gun from its holster, keeping it at all times aimed at the floor. He was right-handed.  The first shot took off Sang’s right arm.  His face was white as the blood spurted. He knelt—or collapsed—to pick up the white gun with his left hand, but had no strength left to stand.  The second shot, from one of the soldiers behind Sezhi, took off his left arm.  It’s hard to tell whether shock finally caused Sang to slump as the soldiers’ next twelve bullets slammed into him. A few patriots believe that Sang was going to pick up the white gun with his teeth before he died, but never had the opportunity. But the blood is indisputable.  Sezhi Tomo, pale but dry-eyed, bowed over the commandant’s fallen body, lifting his hand from heart to lips: a Chosar salute, never a Yamachin one. Sezhi paid for that among his own troops.  And Yen—Admiral, through no fault of your own, you received the news too late to save the commandant. Heaven’s Gate, to our shame, fell in days.  There is no need to recount our losses to Yamat’s soldiers. Once their warsails had entered Cho’s local space, they showed what a generation of civil war does for one’s martial abilities. Our world-bound populations fell before them like summer leaves before winter winds. One general wrote, in a memorandum to the government, that “death walks the only road left to us.” The only hope was to stop them before they made planetfall, and we failed at that.  We asked Feng-Huang for aid, but Feng-Huang was suspicious of our failure to inform them earlier of Yamat’s imperial designs. So their warsail fleets and soldiers arrived too late to prevent the worst of the damage.  It must pain you to look at the starsail battles lost, which you could have won so readily. It is easy to scorn Admiral Wan Kun for not being the tactician you are, less adept at using the nexuses’ spacetime terrain to advantage. But what truly diminishes the man is the fact that he allowed rivalry to cloud his judgment. Instead of using his connections at court to disparage your victories and accuse you of treason, he could have helped unify the fractious factions in coming up with a strategy to defeat Yamat. Alas, he held a grudge against you for invading his jurisdiction at Heaven’s Gate without securing prior permission.  He never forgave you for eclipsing him. Even as he died in defeat, commanding the Chosar fleet that you had led so effectively, he must have been bitter. But they say this last battle at Yellow Splendor will decide everything. Forget his pettiness, Yen. He is gone, and it is no longer important.  “I have your file,” the man said to Yen Shenar. His dark blue uniform did not show any rank insignia, but there was a white gun in his holster. “I would appeal to your loyalty, but the programmer assigned to you noted that this was unlikely to succeed.”  “Then why are you here?” Yen said. They were in a room with high windows and paintings of carp. The guards had given him plain clothing, also in dark blue, a small improvement on the gray that all prisoners wore.  The man smiled. “Necessity,” he said. “Your military acumen is needed.”  “Perhaps the government should have considered that before they put me here,” Yen said.  “You speak as though the government were a unified entity.”  As if he could forget. The court’s inability to face in the same direction at the same time was legendary.  “You were not without allies, even then,” the man said.  Yen tipped his head up: he was not a short man, but the other was taller. “The government has a flawed understanding of ‘military acumen,’ you know.”  The man raised an eyebrow.  “It’s not just winning at baduk or other strategy games, or the ability to put starsails in pretty arrangements,” Yen said. “It is leadership; it is inspiring people, and knowing who is worth inspiring; it is honoring your ancestors with your service. And,” he added dryly, “it is knowing enough about court politics to avoid being put in the Garden, where your abilities do you no good.”  “People are the sum of their loyalties,” the man said. “You told me that once.”  “I’m expected to recognize you?”  “No,” the man said frankly. “I told them so. We all know how reprogramming works. There’s no hope of restoring what you were.” There was no particular emotion in his voice. “But they insisted that I try.”  “Tell me who you are.”  “You have no way of verifying the information,” the man said.  Yen laughed shortly. “I’m curious anyway.”  “I’m your nephew,” the man said. “My name wouldn’t mean anything to you.” At Yen’s scrutiny, he said, “You used to remark on how I take after my mother.”  “I’m surprised the government didn’t send me back to the Ministry of Virtuous Thought to ensure my cooperation anyway,” Yen said.  “They were afraid it would damage you beyond repair,” he said.  “Did the programmer tell them so?”  “I’ve only spoken to her once,” the man said.  This was the important part, and this supposed nephew of his didn’t even realize it. “Did she have anything else to say?”  The man studied him for a long moment, then nodded. “She said you are not the sum of your loyalties, you are the sum of your choices.”  “I did not choose to be here,” Yen said, because it would be expected of him, although it was not true. Presumably, given that he had known what the king’s decree was to be, he could have committed suicide or defected. He was a strategist now and had been a strategist then. This course of action had to have been chosen for a reason.  He realized now that the Yen Shenar of yesteryear might not have been a man willing to intrigue against his enemies, even where it would have saved him his command. But he had been ready to become one who would, even for the sake of a government that had been willing to discard his service.  The man was frowning. “Will you accept your reinstatement into the military?”  “Yes,” Yen said. “Yes.” He was the weapon that he had made of himself, in a life he remembered only through shadows and fissures. It was time to test his forging, to ensure that the government would never be in a position to trap him in the Garden again.  This is the story the way they are telling it now. I do not know how much of it to believe. Surely it is impossible that you outmatched the Yamachin fleet when it was five times the size of your own; surely it is impossible that over half the Yamachin starsails were destroyed or captured. But the royal historians say it is so.  There has been rejoicing in the temporary capital: red banners in every street, fragrant blossoms scattered at every doorway. Children play with starsails of folded paper, pretending to vanquish the Yamachin foe, and even the thralls have memorized the famous poem commemorating your victory at Yellow Splendor.  They say you will come home soon. I hope that is true.  But all I can think of is how, the one time I met you, you did not wear the white gun. I wonder if you wear it now.  for my parents, with additional thanks to Prof. Barry S. Strauss Yoon Ha Lee's works have appeared in Lightspeed, Tor.com, Beneath Ceaseless Skies, and The Magazine of Fantasy and Science Fiction. His collection Conservation of Shadows came out in 2013 from Prime Books. Currently he lives in Louisiana with his family and has not yet been eaten by gators.", "text": "4010 words, short story\nBetween Two Dragons\nOne of the oldest tales we tell in Cho is of two dragons, twinborn and opposite in all desires. One dragon was as red as Earth, the other as blue as Heaven: day and night, fire and water, passion and calculation. They warred, as dragons do, and the universe was born of their battle.\nWe have never forgotten that we partake of both dragons, Earth and Heaven. Yet we are separate creatures with separate laws. It is why the twin dragons appear upon our national seal, separated by Man’s sinuous road. We live among the stars, but we remember our heritage.\nOne thing has not changed since the birth of the universe, however. There is still war.\nYen, you have to come back so I can tell you the beginning of your story. Everything is classified: every soldier unaccounted for, every starsail deployed far from home, every gram of shrapnel . . . every whisper that might have passed between us. Word of the last battle will come tomorrow, say the official news services, but we have heard the same thing for the last several days.\nI promised I would tell no one, so instead I dream it over and over. I knew, when I began to work for the Ministry of Virtuous Thought, that people would fear me. I remind myself of this every time someone calls me a woman with no more heart than a stone, despite the saying that a stone’s weeping is the most terrible of all.\nYou came to me after the invaders from Yamat had been driven off, despite the fall of Spinward Gate and the capital system’s long siege. I didn’t recognize you at first. Most of my clients use one of the government’s thousand false names, which exist for situations requiring discretion. Your appointment was like any other, made under one such.\nYour face, though—I could hardly have failed to recognize your face. Few clients contact me in person, although I can’t help wanting to hear, face-to-face, why my patients must undergo the changes imposed on them.\nAdmiral Yen Shenar: You were an unassuming man, although your dark eyes suggested a certain taut energy, and you were no stranger to physical labor. I wished I were in such lean good health; morning exercise has never done much for me. But your drab civilian clothes and the absent white gun did nothing to disguise the fact that you were a soldier. An admiral. A hero, even, in my office with its white walls and bland paintings of bamboo.\n“Admiral,” I said, and stopped. How do you address the war hero of a war everyone knows will resume when the invaders catch their breath? I thought I knew what you wanted done. A former lover, a political rival, an inconvenience on the way up; the client has the clout to make someone disappear for a day and return as though nothing as changed, except it has. A habit of reverse-alphabetizing personal correspondence, a preference for Kir Jaengmi’s poetry over An Puna’s, a subversive fascination with foreign politics, excised or altered by my work. Sometimes only a favorite catchphrase or a preference for ginseng over green tea is changed, and the reprogramming serves as a warning once the patient encounters dissonance from family and acquaintances. Sometimes the person who returns is no longer recognizable. The setup can take months, depending on the compatibility of available data with preset models, but the reprogramming itself only takes hours.\nSo here you were, Admiral Yen Shenar. Surely you were rising in influence, with the attendant infelicities. It disappointed me to see you, but only a little. I could guess some of your targets.\n“There’s no need for formality, madam,” you said, correctly interpreting my silence as a loss for words. “You’ve dealt with more influential people in your time, I’m sure.” Your smile was wry, but suggested despair.\nI thought I understood that, too. “Who is the target?”\nThe despair sharpened, and everything changed. “Myself. I want to be expunged, like a thrall. I’m told it’s easier with a willing subject.”\n“Heaven and Earth, you can’t be serious.”\nThe walls were suddenly too spare, too white.\nI wondered why you didn’t do the obvious thing and intrigue against Admiral Wan Kun, or indeed the others in court who considered your growing renown a threat. No surprise: the current dynasty had been founded by a usurper-general, and ever since, the court has regarded generals and admirals with suspicion. We may despise the Yamachin, but they are consummate warriors, and they would never have been so frightened by the specter of a coup as to sequester their generals at the capital, preventing them from training with the troops they commanded on paper. We revere scholars. They have their sages, but soldiers are the ones they truly respect.\n“Madam,” you said, “I am only asking you to do what the ministry will ask of another programmer a few days from now. It doesn’t matter what battles one wins in the deeps of space if one can’t keep out of political trouble. Even if we all know the Yamachin will return once they’ve played out this farce of negotiations . . . ”\nYou wanted me to destroy the man you were, but in a manner of your choosing and not your rivals’, all for the sake of saving Cho in times to come. This meant preserving your military acumen so you might be of use when Yamat returned to ravage Cho. Only a man so damned sure of himself would have chanced it. But you had routed the Yamachin navy at Red Sun and Hawks Crossing with a pittance of Chosar casualties, and no one could forget how, in the war’s early hours, you risked your command by crossing into Admiral Wan Kun’s jurisdiction to rally the shattered defense at Heaven’s Gate.\n“Admiral,” I said, “are you sure? The half-death”—that’s the kindest euphemism—“might leave you with no more wit than a broken cup, and all for nothing. It has never been a safe procedure.” I didn’t believe you would be disgraced in a matter of days, although it came to pass as you predicted.\nYou smiled at that, blackly amused. “When calamity lands on your shoulder, madam, I assure you that you’ll find it difficult to mistake for anything else.” A corner of your mouth curled. “I imagine you’ve seen death in darker forms than I have. I have killed from vast distances, but never up close. You are braver by far than I have ever been.”\nYou were wrong about me, Admiral Yen, even if the procedure is easier with a willing patient. With anyone else, I would have congratulated myself on a task swiftly and elegantly completed.\nYou know the rest of the story. When you tell it to me, I will give you the beginning that I stole from you, even at your bidding. Although others know our nation Cho as the Realm Between Two Dragons, vast Feng-Huang and warlike Yamat, our national emblem is the tiger, and men like you are tigers among men.\nSometimes I think that each night I spin the story to myself, a moment of memory will return to you, as if we were bound together by the chains of a children’s fable. I know better. There are villains every direction I look. I am one of them. If you do not return, all that will be left for me is to remember, over and over, how I destroyed the man you should have been, the man you were.\nBy the time we took him seriously, he was an old man: Tsehan, the chancellor-general of Yamat, and its ruler in truth. Ministers came and ministers went, but Tsehan watched from his unmoving seat in Yamat’s parliament, the hawk who perched above them all.\nHe was not a man without refinement, despite the popular depiction of him as a wizened tyrant, too feeble to lead the invasion himself and too fierce to leave Cho in peace. Tsehan loved fine things, as the diplomats attested. His reception hall was bright with luxuries: sculptures of light and parabolic mirrors, paintings on silk and bamboo strips, mosaics made from shattered ancient celadon. He served tea in cups whose designs of seasonal flowers and fractals shifted in response to the liquid’s temperature or acidity. “For the people of Yamat,” he said, but everyone knew these treasures were for Tsehan’s pleasure, not the people’s.\nWar had nurtured him all his life. His father was a soldier of the lowest rank, one more body flung into Yamat’s bloody and tumultuous politics. It is no small thing, in Yamat—a nation at least as class-conscious as our own—to rise from a captain’s aide to heir-apparent of Chancellor-General Oshozhi. Oshozhi succeeded in bringing Yamat with its many would-be warlords under unified rule, and he passed that rule on to Tsehan.\nIt should not have surprised us that, with the end of Yamat’s bloody civil wars, Tsehan would thirst for more. But Cho was a pearl too small for his pleasure. The chancellor-general wanted Feng-Huang, vastest of nations, jewel of the stars. And to reach Feng-Huang, he needed safe passage through Cho’s primary nexus. Feng-Huang had been our ally and protector for centuries, the culture whose civilization we modeled ours after. Betraying Feng-Huang to the Yamachin would have been like betraying ourselves.\nYamat had been stable for almost a decade under Tsehan’s leadership, but we had broken off regular diplomatic relations during its years of instability and massacre. We had grown accustomed to hearing about dissidents who vanished during lunch, crèches destroyed by rival politicians and generals, bombs hidden in shipments of maiden-faced orchids, and soldiers who trampled corpses but wept over fire-scored sculptures. Some of it might even have happened.\nWhen Tsehan sent the starsail Hanei to ask for the presence of a Chosar delegation and our government acquiesced, few of us took notice. Less than a year after that, our indifference would be replaced by outrage over Yamat’s demands for an open road to our ally Feng-Huang. Tsehan was not a falling blossom after all, as one of our poets said, but a rising dragon.\nIn the dream, he knew his purpose. His heartbeat was the drum of war. He walked between Earth and Heaven, and his path was his own.\nAnd waking—\nHe brushed the hair out of his eyes. His palms were sweaty. And he had a name, if not much else.\nYen Shenar, no longer admiral despite his many victories, raised his hand, took aim at the mirror, and fired.\nBut the mirror was no mirror, only the wall’s watching eyes. He was always under surveillance. It was a fact of life in the Garden of Tranquility, where political prisoners lived amid parameterized hallucinations. The premise was that rebellion, let alone escape, was unlikely when you couldn’t be sure if the person at the corner was a guard or the hallucination of a childhood friend who had died last year. He supposed he should be grateful that he hadn’t been executed outright, like so many who had rioted or protested the government’s policies, even those like himself who had been instrumental in defending Cho from the Yamachin invasion.\nHe had no gun in his hand, only the unflinching trajectory of his own thoughts. One more thing to add to his litany of grievances, although he was sure the list changed from day to day, hour to hour, when the hallucinations intensified. Sourly, he wished he could hallucinate a stylus, or a chisel with which to gouge the walls, whether they were walls or just air. He had never before had such appreciation for the importance of recordkeeping.\nYen began to jog, trusting the parameters would keep him from smashing into a corner, although such abrupt pain would almost be welcome. Air around him, metal beneath him. He navigated through the labyrinth of overgrown bamboo groves, the wings of unending arches, the spiral blossoms of distant galaxies glimpsed through cracked lattices. At times he thought the groves might be real.\nThey had imprisoned him behind Yen Shenar’s face, handicapped him with Yen Shenar’s dreams of stars and shapes moving in the vast darkness. They had made the mistake of thinking that he shared Yen Shenar’s thrall-like regard for the government. He was going to escape the Garden if it required him to break each bone to test its verity, uproot the bamboo, break Cho’s government at its foundations.\nThe war began earlier, but what we remember as its inception is Sang Han’s death at Heaven’s Gate. Even the Yamachin captain who led the advance honored Sang’s passing.\nHeaven’s Gate is the outermost system bordering Yamat, known for the number of people who perished settling its most temperate world, and the starsails lost exploring its minor but treacherous nexus. The system was held by Commandant Sang Han, while the province as a whole remains under the protection of Admiral Wan Kun’s fleet. Wan Kun’s, not Yen Shenar’s; perhaps Heaven’s Gate was doomed from the start.\nAlthough Admiral Wan Kun was inclined to dismiss the reports of Yamachin warsails as alarmism, the commandant knew better. Against protocol, he alerted Admiral Yen Shenar in the neighboring system, which almost saved us. It is bitter to realize that we could have held Cho against the invaders if we had been prepared for them when they first appeared.\nThe outpost station’s surviving logs report that Sang had one last dinner with his soldiers, passing the communal cup down the long tables. He joked with them about the hundred non-culinary uses for rice. Then he warned the leading Yamachin warsail, Hanei, that passage through Cho to invade our ally Feng-Huang would not be forthcoming, whatever the delusion of Yamat’s chancellor-general.\nHanei and its escort responded by opening fire.\nWe are creatures of fire and water. We wither under a surfeit of light as readily as we wither beneath drowned hopes. When photons march soldier-fashion at an admiral’s bidding, people die.\nWhen the Yamachin boarded the battlestation serving Heaven’s Gate, Sang awaited them. By then, the station was all but shattered, a fruit for the pressing. Sang’s eyes were shadowed by sleepless nights, his hair rumpled, his hands unsteady.\nThe Hanei’s captain, Sezhi Tomo, was the first to board the station. Cho’s border stations knew his name. In the coming years, we would learn every nuance of anger or determination in that soft, suave voice. Sezhi spoke our language, and in times past he had been greeted as one of us. His chancellor-general had demanded his experience in dealing with Cho, however, and so he arrived as an invader, not a guest.\n“Commandant,” he said to Sang, “I ask you and your soldiers to stand down. There’s time yet for war to be averted. Surrender the white gun.” Sezhi must have been aware of the irony of his words. He knew, as most Yamachin apparently did not, that a Chosar officer’s white gun represented not only his rank but his loyalty to the nation. Its single shot is intended for suicide in dire straits.\n“Sezhi-kan,” the commandant replied, addressing the other man by his Yamachin title, “it was too late when your chancellor-general set his eye upon Feng-Huang.” And when our government, faction-torn, failed to heed the diplomats’ warning of Tsehan’s ambitions; but he would not say that to a Yamachin. “It was too late when you opened fire on the station. I will not stand down.”\n“Commandant,” said Sezhi even as his guards trained their rifles on Sang, “please. Heaven’s Gate is lost.” His voice dropped to a murmur. “Sang, it’s over. At least save yourself and the people who are still alive.”\nSmall courtesies have power. In the records that made it out of Heaven’s Gate, we see the temptation that sweeps over the commandant’s face as he holds Sezhi’s gaze. We see the moment when he decides that he won’t break eye contact to look around at his haggard soldiers, and the moment when temptation breaks its grasp.\nOh, yes: the cameras were transmitting to all the relays, with no thought as to who might be eavesdropping.\n“I will surrender the white gun,” Sang said, “when you take it from me. Dying is easier than letting you pass.”\nSezhi’s face held no more expression than night inside a nexus. “Then take it I shall. Gentlemen.”\nThe commandant drew the white gun from its holster, keeping it at all times aimed at the floor. He was right-handed.\nThe first shot took off Sang’s right arm.\nHis face was white as the blood spurted. He knelt—or collapsed—to pick up the white gun with his left hand, but had no strength left to stand.\nThe second shot, from one of the soldiers behind Sezhi, took off his left arm.\nIt’s hard to tell whether shock finally caused Sang to slump as the soldiers’ next twelve bullets slammed into him. A few patriots believe that Sang was going to pick up the white gun with his teeth before he died, but never had the opportunity. But the blood is indisputable.\nSezhi Tomo, pale but dry-eyed, bowed over the commandant’s fallen body, lifting his hand from heart to lips: a Chosar salute, never a Yamachin one. Sezhi paid for that among his own troops.\nAnd Yen—Admiral, through no fault of your own, you received the news too late to save the commandant. Heaven’s Gate, to our shame, fell in days.\nThere is no need to recount our losses to Yamat’s soldiers. Once their warsails had entered Cho’s local space, they showed what a generation of civil war does for one’s martial abilities. Our world-bound populations fell before them like summer leaves before winter winds. One general wrote, in a memorandum to the government, that “death walks the only road left to us.” The only hope was to stop them before they made planetfall, and we failed at that.\nWe asked Feng-Huang for aid, but Feng-Huang was suspicious of our failure to inform them earlier of Yamat’s imperial designs. So their warsail fleets and soldiers arrived too late to prevent the worst of the damage.\nIt must pain you to look at the starsail battles lost, which you could have won so readily. It is easy to scorn Admiral Wan Kun for not being the tactician you are, less adept at using the nexuses’ spacetime terrain to advantage. But what truly diminishes the man is the fact that he allowed rivalry to cloud his judgment. Instead of using his connections at court to disparage your victories and accuse you of treason, he could have helped unify the fractious factions in coming up with a strategy to defeat Yamat. Alas, he held a grudge against you for invading his jurisdiction at Heaven’s Gate without securing prior permission.\nHe never forgave you for eclipsing him. Even as he died in defeat, commanding the Chosar fleet that you had led so effectively, he must have been bitter. But they say this last battle at Yellow Splendor will decide everything. Forget his pettiness, Yen. He is gone, and it is no longer important.\n“I have your file,” the man said to Yen Shenar. His dark blue uniform did not show any rank insignia, but there was a white gun in his holster. “I would appeal to your loyalty, but the programmer assigned to you noted that this was unlikely to succeed.”\n“Then why are you here?” Yen said. They were in a room with high windows and paintings of carp. The guards had given him plain clothing, also in dark blue, a small improvement on the gray that all prisoners wore.\nThe man smiled. “Necessity,” he said. “Your military acumen is needed.”\n“Perhaps the government should have considered that before they put me here,” Yen said.\n“You speak as though the government were a unified entity.”\nAs if he could forget. The court’s inability to face in the same direction at the same time was legendary.\n“You were not without allies, even then,” the man said.\nYen tipped his head up: he was not a short man, but the other was taller. “The government has a flawed understanding of ‘military acumen,’ you know.”\nThe man raised an eyebrow.\n“It’s not just winning at baduk or other strategy games, or the ability to put starsails in pretty arrangements,” Yen said. “It is leadership; it is inspiring people, and knowing who is worth inspiring; it is honoring your ancestors with your service. And,” he added dryly, “it is knowing enough about court politics to avoid being put in the Garden, where your abilities do you no good.”\n“People are the sum of their loyalties,” the man said. “You told me that once.”\n“I’m expected to recognize you?”\n“No,” the man said frankly. “I told them so. We all know how reprogramming works. There’s no hope of restoring what you were.” There was no particular emotion in his voice. “But they insisted that I try.”\n“Tell me who you are.”\n“You have no way of verifying the information,” the man said.\nYen laughed shortly. “I’m curious anyway.”\n“I’m your nephew,” the man said. “My name wouldn’t mean anything to you.” At Yen’s scrutiny, he said, “You used to remark on how I take after my mother.”\n“I’m surprised the government didn’t send me back to the Ministry of Virtuous Thought to ensure my cooperation anyway,” Yen said.\n“They were afraid it would damage you beyond repair,” he said.\n“Did the programmer tell them so?”\n“I’ve only spoken to her once,” the man said.\nThis was the important part, and this supposed nephew of his didn’t even realize it. “Did she have anything else to say?”\nThe man studied him for a long moment, then nodded. “She said you are not the sum of your loyalties, you are the sum of your choices.”\n“I did not choose to be here,” Yen said, because it would be expected of him, although it was not true. Presumably, given that he had known what the king’s decree was to be, he could have committed suicide or defected. He was a strategist now and had been a strategist then. This course of action had to have been chosen for a reason.\nHe realized now that the Yen Shenar of yesteryear might not have been a man willing to intrigue against his enemies, even where it would have saved him his command. But he had been ready to become one who would, even for the sake of a government that had been willing to discard his service.\nThe man was frowning. “Will you accept your reinstatement into the military?”\n“Yes,” Yen said. “Yes.” He was the weapon that he had made of himself, in a life he remembered only through shadows and fissures. It was time to test his forging, to ensure that the government would never be in a position to trap him in the Garden again.\nThis is the story the way they are telling it now. I do not know how much of it to believe. Surely it is impossible that you outmatched the Yamachin fleet when it was five times the size of your own; surely it is impossible that over half the Yamachin starsails were destroyed or captured. But the royal historians say it is so.\nThere has been rejoicing in the temporary capital: red banners in every street, fragrant blossoms scattered at every doorway. Children play with starsails of folded paper, pretending to vanquish the Yamachin foe, and even the thralls have memorized the famous poem commemorating your victory at Yellow Splendor.\nThey say you will come home soon. I hope that is true.\nBut all I can think of is how, the one time I met you, you did not wear the white gun. I wonder if you wear it now.\nfor my parents, with additional thanks to Prof. Barry S. Strauss\nYoon Ha Lee's works have appeared in Lightspeed, Tor.com, Beneath Ceaseless Skies, and The Magazine of Fantasy and Science Fiction. His collection Conservation of Shadows came out in 2013 from Prime Books. Currently he lives in Louisiana with his family and has not yet been eaten by gators.", "source": "https://clarkesworldmagazine.com/lee_04_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Between Two Dragons by Yoon Ha Lee"}