{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Regina Kanyu Wang; Emily Jin", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "hspePKTIBs+7UXOet6pkQWQa4Eo=", "id": null, "license": null, "comments": "", "raw_text": "9680 words, novelette  The Winter Garden  The transition was much easier than I had imagined.  Standing by the console, I set the parameters following my usual observation procedure. I had memorized the numbers when Jin first mentioned them, and I double-checked his experiment records, just to make sure. I rotated the security knob counterclockwise, punched in the password number by number, then pressed the green confirm button. The thirty second countdown began. Nimbly, I hopped onto the transition platform and checked for one last time that the return-to-home-base anchor was with me. I took a deep breath, closed my eyes, and, after a moment of slight dizziness, found myself in an alternative universe.  The first thing I saw was a wooden door. I pushed the door open. Blinding light and blistering cold wind overwhelmed me at once. Instinctively, I turned to shield my face. The specks of fluorescent light caused by the transmission process slowly faded and the mops, brooms, and detergent became visible in the dark cluttered closet room where I landed. The world before my eyes was exactly as my peers had described. I had purposefully made the landing spot of my transmission a remote corner to avoid trouble. This alternative universe was not all that different from the world I came from: same physical constants, similar level of technological progress . . . the only differences were in minor historical details, market trends, and of course, some individuals’ fates.  Out of habit, I patted my sweater and pants lightly to get rid of the—nonexistent—dust. After my eyes grew accustomed to the light, I walked out of the closet room and found myself in a not-yet-open bar. I located the back door and exited.  It was a little past eight in the morning and the city of Dublin was just about to wake up from its slumber. The sky dawned blue. There was a light drizzle, and the rain landed on my face like cascading needles of ice. Already expecting the weather, I pulled the hood of my black down coat over my head. With quickening footsteps, I walked down the small street paved with cobblestones. The rain stopped when I took my second turn. The heavy rain clouds in the eastern corner of the sky dissipated, revealing a gold lining. A moment after, the clouds gathered, swallowing up the sunlight once again.  I turned onto Dame Street and entered the College Green from the west. The triangular open space in which traffic passed through, in fact, had no green at all; the few meager trees had lost all their leaves in the howling winter wind, their bare branches pointing upward. To my east, there was a small patch of yellow, withered grass next to the front entrance of the Dublin Trinity College. Historical buildings stood south. The north was the old Irish Houses of the Parliament, their gray-white outer walls blending into the overcast sky. The faces of the three statues above the colonnade were so weather-beaten that their features were barely recognizable. In the world where I came from, the Houses of the Parliament belonged to the Bank of Ireland. In this world, however, a sign indicating “Trinity College” marked the gate to the compound. I walked into a café in the next street, sat down by the long table with a street view, and ordered an Irish coffee. A drink so strong first thing in the morning might not be the wisest choice, but I needed the caffeine to keep myself alert, and the alcohol to give me courage.  Even after I had gone through the transition and landed in this alternative universe, I couldn’t bring myself to make a final decision.  I hated making decisions. If life was a series of single-choice questions on an exam sheet, then I would have long ago failed the exam for making too many mistakes. I chose the wrong parent to live with after their divorce; taking care of my mother, an alcoholic who could barely manage her own life, was the primary reason that I couldn’t attend a well-ranked high school. I chose the wrong subject to study when I applied to college, wasting my days away in a STEM-oriented university when my interest was actually in languages and literature. I chose the wrong advisor when I applied to graduate school—his popularity meant that the competition was especially cutthroat, and I often thought to myself that I would have been in graduate school already if I had aimed for a different advisor, or simply had better records . . . back onto the job market and having missed the hiring season, I found myself jobless with a degree in an area of technology so specialized that no company cared for it.  Finally, the dean, worried that I would impact our entire class’ employment rate on the university’s official records, introduced me to a temporary job within the university—manager of lab #03 of the Department of Quantum Physics. “Manager” was the most generous way to put it. My daily work mostly consisted of trivial errands, including coffee making, invoice organizing, delivering documents between offices, and occasionally putting in lightbulbs. I had no official post, no bonuses, no welfare, and not even winter and summer breaks.  The lab was small, with only a handful of members. Professor Zhang the lab director was rarely present, so Dr. Chen, a postdoc in the lab, took over most of the organizational and teaching duty. Dr. Chen came around once a week to check on the experiment progress of the students who were enrolled in the master’s-PhD joint program. The three students who worked in the lab regularly were about my age, and I called them by their last names, Jin, Yang, and Yu. Out of courtesy, they addressed me as Teacher Wang.  For the first few months, those students almost never spoke to me. Their working schedule was just as mysterious as the actual work that they were doing. No one arrived in the lab “on time.” Some would come in the evening, right before I was about to go home, and some would periodically move into the lab and stay for days. The general lab and the experiment room were separated by multiple doors. I never went into the innermost room. I had no idea what kind of experiments they were doing, and I was uninterested in finding out.  After a while, the students finally started to talk to me—I suspected that it was because of my ability to keep my nose out of trouble, and well, also because people forgot their keys or forgot to turn off the light from time to time. In the beginning, they hid the experiment from me and called it “highly confidential.” Then, as we grew more familiar, they started leaking more and more information. Professor Zhang and Dr. Chen didn’t seem to have found my presence a trouble, either. Gradually, more administrative responsibilities of the lab were handed over to me, including keeping all the experiment data.  Amongst the students, I talked to Jin the most. He was the one who revealed to me first that the lab’s project was about alternative universes; more precisely, transitioning between various alternative universes, and deciphering what their essence was.  Of course I knew that alternative universes existed. Everyone did. This finding intrigued most people. But why should I be personally concerned? To me, an alternative universe was the equivalent of an alien planet. I have never even traveled outside of China, let alone a different universe!  Jin told me that Brent Liu’s transition experiment thoroughly proved the existence of type III alternative universes, in which the wave function never collapsed. The primary world would split into an unending number of superposed worlds. After decoherence, those worlds would evolve into alternative universes utterly unrelated to each other, respectively located on each quantum branch of the Hilbert Space with infinite dimensions. Humans could transit between those alternative universes.  I didn’t really understand what he was saying.  “With every choice you make, the world would split into two, ultimately generating an infinite number of alternative worlds existing in parallel to each other,” explained Jin.  “Why do my choices matter so much?”  “No, no, it’s just an analogy. I’m not saying that the world would literally split because of your choice. It depends on quantum measurements and randomness. Our job is to transit between different alternative universes and study the nature of the macrocosm. One day, commercial inter-universe travels may be possible.”  I nodded, pretending that we were on the same page.  His words, though, were not completely useless. At least they offered me an explanation for why my life was a mess. I made all of the wrong choices and ended up in an alternative universe of misfortune. Never good at taking a stand growing up, I became even more hesitant about moving forward with my life. Scared that I would bring more pain and misery upon myself by making even more wrong choices, I always left the decision-making process ’til the last minute, so that time would weed out most of the alternatives. I would never have to make decisions when there were no other possibilities to start with.  The same went for my career. The dean advised that I should view the lab job as a fallback and seek new opportunities, but I have procrastinated with job-seeking since then, unable to decide which job-hunting platforms to upload my resume on. As a result, I ended up staying in the lab for years.  As I swallowed the last gulp of my coffee, my target appeared.  She got off a double-decker bus and turned around to speak to the driver, her long, black curls swishing in the air as her head swung. If I were correct, she would be one hundred and sixty-one centimeters in height and forty-three kilograms in weight, flat-chested. The lush and thick dark hair didn’t quite fit her stature; it made her look even more short and boney. Her coat, scarf, jeans, and sneakers were all black. As she started walking, I dashed out of the café and followed behind. She wasn’t a fast walker. Every time she lifted her left foot, her toes pointed slightly toward the outside, drawing a small curve before landing the step. I knew the way she walked better than anyone else. I couldn’t have been mistaken. She was the person I was looking for. Walking at her pace but a few meters behind, I followed her down the street. It was my first time following someone—thank God central Dublin was bustling, and the cars and pedestrians were enough to veil me from her sight.  She stopped at a junction, waiting for the tram to pass by. Before the red light turned green, she started to cross the road, swiftly passing through cars. A rule breaker. I had no choice but to follow. A small hassle was taking place before Trinity College’s front entrance, where two tourists were fighting over a clover-patterned green scarf. The scarf was the kind of basic merchandise that every souvenir store around here offered, but both tourists were insisting that they got hold of the scarf first. One of them was actually wearing a scarf that looked exactly the same, but no one bothered to point it out. She pushed through the crowd, clearly uninterested in stopping to watch. I didn’t want to risk getting too close, so I waited until she disappeared behind the wooden arch before I walked in. Behind the arch was an arcade with dim lighting that led to the main campus. Two large trees stood opposite to each other on the grass, their thin branches shuddering in the cold wind. A line of people gathered on the right. I scanned around with my eyes looking for her but couldn’t find her anymore.  My pulse quickened. Did I lose her? Did she know that I was following her? It looked like that she was a student here, and I was sure that she knew the campus much better than I did. Someone at her age would be enrolled in a PhD program. In my world, Trinity College was the best university in Ireland, consistently ranking amongst top one hundred in the world. Good for her. Apart from luck, she must have had a more decisive personality than I did, so that she was able to secure her grasp on every opportunity to success that came her way. If I were to confront her, would I stand a chance against her? I was overwhelmed with hesitation. What if I gave up on the plan entirely and treated this trip as a short vacation in Dublin? I have never been to Dublin, after all, but it would be ridiculous if I wasted my only chance of alternative universe transition on touring Dublin . . .  As I contemplated, she reappeared before my eyes, now wearing a flowy, sleeveless black robe with golden embroideries on the collar that resembled an academic dress. She strode toward the front of the line, speaking loudly in English. I pulled my hood down lower and approached the crowd, trying to make myself as unnoticeable as possible. She explained to the tourists the history of the campus. So, she is a student guide. A part-time job. The tour would last for half an hour and end at The Old Library, where tourists could see the famous Book of Kells and the Long Room. I snuck into the line. When she came over to collect our tour fee, I kept my head low, pretending to look at my phone, and handed her the money with my free hand. Her fingertips brushed across my palm. A light shiver went down the lines on my palm, stimulating my nerve endings. Did she recognize me? My heart was about to leap out of my chest. Just as when I was on the verge of blurting out to her who I was, she put the spare change into my hand and left for the tourist behind me. Inhale. Exhale. My racing heart slowed down. I didn’t have to make the decision . . . yet.  She led the tourists onto the campus, introducing buildings and customs in rapid English. Her voice was small and low, so for most of the time she had to shout at the top of her lungs to make sure that everyone heard her. I felt exhausted for her. Tagging along, I observed her discreetly and prayed that she wouldn’t notice my presence.  On the other hand, I couldn’t help but look around nonstop, barely able to take my eyes off the gorgeous campus. Historical buildings stood erect shoulder to shoulder, constructed from stone bricks dated hundreds of years ago. Seen from afar, the thin, delicate cracks on the mottled green walls resembled complex and mysterious runes. For one second, against the pale light, I thought I had seen someone standing on one leg on top of the bell tower. When I rubbed my eyes and landed my gaze on the person again, I realized that it was only a very large crow. An instant after, it spread its wings, took flight, and disappeared into the layers of heavy clouds.  This place was exactly how I imagined a university with hundreds of years of history would look like. The college years in my memory seemed even bleaker compared to the life she lived here. I vaguely remembered that I once dreamed about applying to universities abroad and changing a country to live in as well. Can I revive that dream?  The thirty-minute campus tour soon came to an end, and the group dispersed before The Old Library. Just as I was hesitating about whether to enter the library or to keep on following her, she came toward me. She walked in strides, her steps fast and steady. Sandwiched between the outer wall of the library and a crowd of tourists, I had nowhere to hide.  She brushed one side of her hair back. For the first time after I landed in this world, I gazed directly at her face. Her chin tilted up slightly and the corner of her lips were pulled into a firm line. There were two tiny moles on her right cheek. Her nose bridge was beautifully arched. Her eyes narrowed, and her dark brown pupils were fixed on me. A face and a scrutinizing expression that no one knew better than I did.  “Hey,” she said in Chinese, her arm crossed at her chest. “Which alternative universe did you come from?”  —Asked the version of myself in this alternative universe, in a voice and tone exactly the same as mine.  It was a hot, humid summer night. The air was so moist and sticky that it could almost glue together the wings of insects. I stayed in the lab past nine, waiting for the repairer to finish up fixing our air conditioning. I had already called mother and told her that I was going to be late today. When she called again, I hung up the phone. The work was done, and I had no more reason to stay behind, so I packed up extra slowly, delaying the time to go home as much as possible.  “Teacher Wang?” exclaimed Jin when he exited the innermost experiment room. “What keeps you here so late?”  “The air conditioning repairer was running behind schedule, so I had to wait. Did you just come back from a mission?”  Jin nodded. He started walking toward the lab door, but then halted after a few steps.  “What’s the matter?” I asked. “You’ve been gone for three days, haven’t you?”  “Yeah,” he sighed. “Teacher Wang, guess who I met on the mission this time?”  “Who? Professor Zhang? Yang? Yourself?” I threw a few random names at him, but I didn’t really care about his answer.  “No. It’s you.”  I was stupefied. Me? To be honest, even after knowing that alternative universes existed, I have never considered such a possibility. Theoretically, I knew that every alternative universe contained a different version of myself; but with the world so big and the transition between alternative universes so difficult, I couldn’t imagine that those versions of myself would be connected in any way.  “What do I . . . I mean, what does she look like?”  “She looks the same as you, except she has long hair. Have you considered changing your hairstyle? I think long curls would suit you well.”  “No, I’ll give it a pass. I’m short to begin with, and long curls would only make me look shorter. I like my current bob better. Clean and convenient.”  Jin muttered, and his face turned red.  “What did you say?”  “No, nothing.”  “So, where did you see her?”  “In Universe #34257, transition coordinates (61, 589, 37i) . . . ” Seeing my frowned eyebrows, he concluded, “On the streets.”  “What was she doing?”  “She was walking. We walked side by side for a while, then we parted ways.”  “Why didn’t you follow her?”  “Hey, I’m not a stalker! I had a mission to take care of, too . . . ”  “Then when are you going back again? Can you go check on her?”  Jin frowned and bit his lip. “I don’t think I can go back. Our research on that alternative universe is ending soon. Besides, even if I go back, I probably won’t end up in Dublin.”  “Dublin?”  “Yes. I saw her in a foreign country.”  “Does she live there?”  “I think so. Well, I don’t know for sure . . . ”  Jin couldn’t remember anything else. The silhouette of the woman that he had contoured, however, continued to linger in my mind. What would another version of myself be like, in an alternative universe? What choices had she made that led her to settle down in Dublin?  Perhaps she never broke up with Wu. Breaking up with my ex-boyfriend Wu was another major decision of mine that went wrong. During our senior year, he was offered a job opportunity in Ireland, and there was a chance that he could stay and obtain permanent residency. However, as a couple, we would have to endure long distance. He was torn between choosing his career and choosing to stay with me. I, on the other hand, was far more apathetic than I should be—what was the point of hanging on when we would very likely grow apart after leaving school anyway? I also had to admit that I was not in love with him the way he was in love with me. In the end, he told me that he wanted to give up the job for my sake. To me, his decision meant pressure instead of care and commitment. I told him that it would be better if we separated instead. After a period of anguish and back-and-forth communication, he deleted me on all social media and left for Ireland alone. I let out a sigh of relief the day he finally left.  It was already past noontime when her work shift ended. We went to an Irish restaurant near campus for lunch. After we sat down, she took off her coat and tugged down the sleeves of her black turtleneck sweater inside, but never removed her black rough-knit scarf. The waiter brought the menu to our table. After a quick glimpse, she handed it over to me, not bothering to take a closer look. I ordered fish and chips, and a mug of Guinness beer; all she had was a simple salad and water.  The food came. Mine was immensely oversized. I recognized the fish as cod, and it tasted quite plain and flavorless. The beer, though, was surprisingly smooth and foamy. “Do you want to try some of mine?” I asked, pushing my plate in her direction.  She shook her head and jabbed at the vegetables with her fork. “I have tried it hundreds of times. The same food every day almost drives me crazy.”  “Why don’t you cook?”  “Do you cook?” she shot back, giggling.  “No.” I responded candidly.  Mother didn’t cook either. We usually got takeout or ate in restaurants. I didn’t like cooking. Too much of a hassle.  “I’d rather choose the same food every day over cooking. Too much of a hassle. Besides, my husband doesn’t eat Chinese food anyway.”  “You’re married?”  “Yeah.”  “What is he like?”  “A local. An Irishman. I don’t have a lot of great things to share about him,” she said, pulling on her sleeves again to carefully conceal her wrists.  “I thought . . . well, in the world where I came from, Wu went to Dublin.”  “Oh, we broke up ages ago. I was not in love with him the way he was in love with me.”  “I feel the same,” I said, swallowing a large gulp of beer. The bitter taste filled my mouth. “Although I must say, I thought that you would have made a wiser decision.”  “Very funny. Stop thinking that you and I are completely different people. Remember, no matter what choice you make, the ending is all the same.”  “Well, at least you’re in Dublin and studying at Trinity College.”  “No, it’s only my part-time job. I can’t afford tuition as an international student, and they wouldn’t give me a stipend.”  “Then why—” I stopped myself short. I already knew the answer.  “Yes, I was only able to obtain permanent residency after I got married. Or, you might as well say that I got married for the sake of obtaining permanent residency,” her lips curled into a sneer.  “How long have you been here?”  “I can’t remember the exact time,” she took a sip of the water. “Two years, I suppose. In the beginning it was fine because everything here was still fresh and exciting to me. Remember being obsessed with Ulysses back in middle school despite not knowing what the book was talking about? When I first arrived, I traveled all over Dublin following in Bloom’s footsteps, like a pilgrimage.”  “Of course. I used to want to major in English and study in Ireland. James Joyce, Oscar Wilde, W. B. Yeats, Bram Stoker . . . all of my favorite authors were Irish. I gave up because I thought that literature was useless. My professed aspiration was only an illusion. I never worked on improving my English nor my qualifications to study abroad. Why, this is my first time in Dublin, because I was too lazy to even plan for a holiday.”  “When are you planning on going back? I’ll take you around the city if you’re not in a hurry.”  “No, not at all. I have no idea what’s going to happen when I get back. The lab should have found out by now that I’m here.”  “So you basically snuck into this universe?”  “Yes. Though without the return-to-home-base anchor, they can’t force me to go back. I brought it with me.”  “What is the return-to-home-base anchor?”  “Our lab members use it to mark the coordinates of our home world and the alternative universe we travel to. Once the transition is launched, the anchor will know precisely where I am. If they have the anchor, they can summon me back. Same goes if I activate the anchor from here,” I explained. “Have you been to other alternative universes? You didn’t seem surprised when you saw me, so I thought that you were familiar with the technology.”  She nodded. “I have, but in a different way.”  “I see.”  “Let’s take a walk, then. You might as well enjoy!”  “Sounds great. I would love to talk to you more.”  Deep down in my heart, I knew that I needed more information from her—if I wanted to carry out my plan. A short lunch conversation was far from enough.  We stood up and waved for the waiter to bring the check. She tugged down the sleeves of her sweater again.  I didn’t expect that mother would fall ill.  Well, I should have expected, given the amount of alcohol she consumed on a daily basis. More so, I should have persuaded her to do regular body checkups, so that she wouldn’t end up in the hospital when the pain in her guts became intolerable and discover out of the blue that she had advanced liver cancer. Conservative therapy was time-consuming and expensive; she would live for a few more years at best, unable to take care of herself during the entire course of therapy. Experimental therapy was the only chance to cure her illness, yet naturally it would expose her to more risk. Choices, more choices . . . damn it, why is life all about making choices? I was paralyzed by the immense fear of choosing the wrong option.  The lab became my safe haven, my only escape route. The smell of disinfectant, the groans and curses that mother made when she tossed and turned on the hospital bed, the weekly invoice that the nurses handed to me . . . with those things weighing down on my chest, I felt as if I were about to suffocate. I turned to alcohol the way mother did. I drank every time before visiting her and rinsed my mouth repeatedly so that she wouldn’t smell the alcohol on my breath. Apart from collecting a change of clothes for mother, I almost never went home. The cramped two-bedroom apartment was now too big and quiet, its emptiness a black hole that threatened to swallow me up.  To be honest, I wasn’t sure whether I would rather mother live or die. She didn’t love me; I knew that for a fact since childhood. She only loved herself. After she divorced father, she has always been accompanied by at least one boyfriend. I suspected that she secretly resented me for choosing to live with her, and I, the unwanted child, was her burden. But did I love her? I wasn’t sure, either. She was my only family. Father has remarried and moved to a different country. I had no partner or children of my own. Who else could I love, if not her? If occasional bickering was a way of showing that I cared, then perhaps I did love her.  As I was deeply lost in my thoughts, comparing the two treatment options over and over again, mother’s illness exacerbated. She passed away much quicker than I had anticipated. Once again—I waited until I had no choice left.  When Jin found me, I was locked up in my office, drinking alone.  “Teacher Wang! Teacher Wang!” Jin banged on my door. “Let me in!”  I dabbed at my face to dry the tears, hid the liquor bottle, and opened the window for fresh air. After I made sure that there was no way he could tell what had happened, I opened the door for him. “What’s the matter? Did you forget your keys again?”  “No. I’m just . . . I’m worried about you.”  “Me? I’m fine.”  Jin didn’t respond. He turned around and left for a moment, then came back into my office with a dozen bottles of beer. “Do you want to have a drink together, then?”  “You’re not worried that Professor Zhang would find out?” I smiled mockingly.  “No. He never shows up anyway,” laughed Jin, handing me a beer.  I pulled my chair over so that I could sit next to him. “I didn’t know that you drink. It’s too cold now, or else we could go outside. I love sitting on the stadium stairs, especially in the summer,” I took a swig.  “Teacher Wang, my mother passed away when I was a child, so . . . ” Jin stuttered.  “Hey. You don’t have to comfort me.”  “I’m sorry . . . ”  We fell silent. “Maybe the version of me you saw in that alternative universe lives a better life. Now I really want to travel to the past, meet her and tell her to talk to mother more often and make sure mother does regular body checkups. Even if mother tries to scold her, she should still take her to the hospital,” I said, then I laughed. “What am I saying? It’s not like I can meet her anyway. In sci-fi films, when two versions of the same person meet, they always . . . disappear together into thin air or something.”  “No, no, that’s all made up for effect. There are two rules to transition: first, the transition can only happen at the same point of time between alternative universes. It is not like time traveling, where the traveler can enter different points of time, change the past, or catch a glimpse of the future. One can only observe synchronous quantum branches, and the rate of time flow between different alternative universes is constant. That is, when one transitions to an alternative universe, time is still flowing as usual in their original universe, and the amount of time one spends in the alternative universe will be accounted for in the original universe as well. If your mother had passed away in the alternative universe already, just like in this one, there’s nothing you can do about it.”  “What a pity. When do you guys start working on time travel?”  “Time travel is impossible. According to Oe and Vonnegut’s research thirty years ago—”  “Okay, okay, I was only joking. What is the second rule, then? Can I meet myself?”  “Yes. The second rule is that the same individual in different alternative universes can coexist in the same world via transition. Every version of the individual is equal, and the interaction between them has little to no effect on the macrocosm. Perhaps some might feel mental impact upon encountering another version of themselves, but that is more about individual psychological differences than a general physical law. Normally, as long as we refrain from deliberately disturbing the balance of alternative universes and keep out of trouble, meeting other versions of ourselves won’t affect the order of things.”  “So, to be simple, it’s okay for me to meet another version of myself in an alternative universe, right?”  “That’s right, but time is another factor. If an individual leaves their original world for too long, the quantum void created by their absence would increase in size. Like a black hole, it would attract the alternative universe in which the individual lands in. We call that the quantum black hole effect. That way, the two worlds would reenter entanglement, resulting in a coalescence of the two worlds. The more the worlds overlap, the more differences between them would disappear, until they merge into a world with dual states.”  “Dual states?”  “Yang has been to an alternative universe like that,” said Jin, shuddering. “It was an accident. None of us knew what we were dealing with. After she came back, she told us that she has a strange, ominous feeling the moment she landed. All the people she met spoke nonsense, as if they were mad. Gradually, she realized that she was in a world with dual states, in which everyone lived double lives, bore the weight of two separate identities and memories. Only the misplaced individual who had caused the two worlds to collapse into one another could distinguish between their original universe and the alternative universe. Yang said that she was terrified, and she hoped that she would never have to go somewhere like that again.”  “Speaking of Yang, I think she’s interested in you,” I nudged him.  “What? Impossible!”  “You’re so oblivious. Even I can tell!”  “No, you’re the one who’s oblivious,” he responded, biting his lip.  “What?”  “Nothing!” His face was flushed.  Neither one of us spoke after that exchange. We sipped our beers in silence.  Soon after, Professor Zhang came around the lab to specifically meet with me. He began by sending his regrets, then claimed that I hadn’t been on top of my work for a while, and that the university wanted to keep the lab exclusive to lab members to maintain the work’s confidentiality. Eventually, he got to the main point of the conversation—to encourage me to go on leave without a definite return date, and of course the break was unpaid. Given my meager contract, he could technically fire me whenever he wanted to, and he was already being generous by hinting that it was best if I quit.  I had no reason to stay; but where else could I go? In despair, I remembered what Jin had said, about the other version of myself in an alternative universe. I could go to her. At first, I was frightened by my own idea. If they caught me using their machine, they would fire me at once. Upon further contemplation, however, I decided that nothing would be worse than the kind of life I faced right now.  If the version of me in that alternative world lived a better life, perhaps I could stay, and she . . .  The transition coordinates of Universe #34257 flashed into my mind.  During a weekend when the lab was empty, I easily obtained Jin’s experiment records and confirmed the values.  I took the step to save myself.  Side by side, we strolled down Grafton Street together, all the way to the southern part of the city. Neither one of us was looking to buy souvenirs, but even just walking between well-decorated stores and enthusiastic tourists made my heart lighten up. Every few dozen meters stood a street performer. We took a picture with an old woman who covered herself in paint and pretended that she was a bronze statue. We hit the forehead of a naked, tattooed man flexing his muscles, at his invite, with a brick and saw how his iron head shattered the brick. We peered into an eye-sized hole on a large wooden box for the peep show, having fun as if it were virtual reality. She saw the birth of a star a billion lightyears away, and I saw the forbidden love between a pair of twin sisters in a remote, closed off village.  We even bought ice cream cones. With the weather so cold, no matter how slow we nibbled at the ice cream, it wouldn’t melt. We talked about how we used to collect plastic bottles and tin cans from trash, sell them, and buy ice cream. Our childhood grocery shop only carried three different flavors, so we always chose the three-colored cups to taste all the flavors at once. We talked about how mother eventually found out that we were making money by fumbling through trash and was furious and ashamed. We were both punished, in slightly varying ways. We talked about how whenever mother brought a new boyfriend back, we would secretly bet on how long this one would last. For her, the longest record was three months and six days, and for me six months and three days—double the length. Our experience growing up was almost entirely identical save for minor details. Talking to her was like reviewing my own life. I had already forgotten many of those details and stories and couldn’t help but question whether her version was the correct one.  We finished the ice cream. A chocolate stain remained on her lip corner that glued a strand of hair to her face. I reached out with my hand to wipe at the same time she stuck out her tongue to lick. The tip of her tongue touched the tip of my finger, sticky, and slick. She turned her eyes to me, and for a split second her gaze fell out of focus. The clouds dispersed and a beam of sun landed on her. Her hair was smooth and shiny like black satin. She smiled. I smiled back. Her fluttering eyelashes and dimple made me realize all of a sudden why Wu as well as other people have said that I had a beautiful smile.  The end of Grafton Street was St. Stephen’s Green. The walkway was littered with people waddling with canes, pushing baby carriages, jogging, or cat-walking. I couldn’t believe my eyes: an extra-large Maine cat with long fur the color of snow and a collar dashed down the green, dragging its owner behind. The grass after rain was freshly green. The imbricating evergreen leaves were a color gradient of green, yellow, and red, reminding me of clouds at dusk. I would have mistaken the scene before my eyes for summer if it wasn’t for the bare branches of deciduous trees.  We stopped by the lake to watch ducks and swans mate, then sat down in the lakeside pavilion to rest. A lady walked over. Her tall, magnificent purple hat with dangling feathers seemed straight out of a literary classic. She showed us a full-fledged curtsy and told us, “a wedding is going to take place in here in five minutes. You can stay to watch, but the pavilion will be occupied.” So we went to the green and joined the crowd of guests. Most of the people here were dressed in vintage suits and dresses, as formal as the lady we met earlier. They spoke to one another in an unfamiliar, ancient-sounding language that we couldn’t understand. As more and more late-arrivers cheek-kissed and joined the audience, the crowd grew larger. I exchanged a glance with her, and we indicated to each other with our eyes that our black clothes were probably unsuited for the occasion.  “Do Irish people celebrate their weddings outside in winter?” I whispered to her.  She shrugged. “I don’t know.”  “What about your wedding?”  Her eyes narrowed. After a moment of silence, she said, “it was in the church.”  A priest dressed in white entered the pavilion and announced that the wedding would begin. The violinist’s music was melodious and melancholic. The groom and the best man emerged, dressed identically, and wearing the exact same solemn expression. For a moment, I thought they were the ones getting married.  The lady wearing the hat whispered in our ear, in English, “step aside, or else you’d be a part of the wedding pictures,” then she added, “I know what it feels like to appear in strangers’ wedding pictures. People in my profession almost always photobomb if we’re not careful enough.” She was wearing heavy makeup. The powder on her nose had faded, as well as her lipstick, revealing oily skin and pale lips. After a mere few seconds, however, she waved for us to come to the middle—as if she had completely forgotten what she had said before. “Come closer, girls,” she said, cheerfully. “Or else you won’t be a part of the wedding picture. To be in a photo on such a celebratory day is a blessing. Are you twins? How cute!”  We exchanged a glance. She shrugged. We did not move.  After the music ended, the bride appeared, walking down the aisle with her father by her side. With her delicate body wrapped in a semitransparent lace wedding dress, she smiled stiffly, and her shoulders were tense and shivering. Perhaps it was because of the cold weather. She was led into the pavilion and handed over to the groom, practically trembling at this point.  The priest began to read the vows, and the couple repeated after him. However, just as the two were about to exchange their rings, the groom’s expression changed. His gaze, previously filled with affection and longingness, turned cold and distant all of a sudden. He stared at his bride, as if she were a stranger. The best man rushed forward, stuffed the ring box into the groom’s hand, wrapped his arms around the groom, then broke into a crying fit. Some guests hurried into the pavilion and dragged the best man off. The groom examined his new wedding ring carefully, then turned to look in the direction in which the best man left. With a sharp cry he tossed the ring box into the lake and ran after the best man. The bride, on the other hand, let out a heavy sigh. Lifting the hem of her dress with her hands, she ran toward the railing, about to make a dive. Luckily, a few others caught her before she fell.  “What is going on?” I whispered to her. “Are they all drunk or something?”  Her lips twitched into a sarcastic smile. “Who knows? People here are drunk day and night,” she pointed a finger at her temple and drew circles. “Something went wrong in there.”  We continued with our park walk. I wanted to ask her about mother, but whenever the words came to the tip of my tongue, I became reluctant to speak them out loud. Her phone rang. I saw mother’s photo on the lit-up screen. I had the exact same screensaver, so I recognized it in a brief glimpse. In the picture, mother was grinning, ever so happy and carefree. I took the photo when mother was not looking. She asked me to delete it, but I kept it anyway.  She took her call standing a few meters away from me. I couldn’t hear what she was saying, but I could see how she frowned, pressed her palms to her forehead, shrugged, and stomped. Fortunately, the call did not last for long. She hung up quickly and trotted toward me.  “Are you okay?” I asked.  She shook her head and said nothing.  I could understand, though. Mother used to call me, sobbing, saying that she loved me, that she wanted to see my face and talk to me, and that I was the only thing left for her in this world. I could tell immediately that she was drunk whenever those words came out of her mouth, because the thought of me would never cross her mind when she was sober.  After her death, I received a call from a man who claimed to be mother’s friend. “She left some personal belongings behind with me,” he said. “Do you have time to pick it up?”  “Send them back in a package,” I responded, not really wanting to meet him.  He agreed and hung up without asking my address. A few days after, I received a tightly wrapped package sent from someone named Huang. In the package was a hard cover photo album in the style of the past century. In there I found hundreds of pictures of mother when she was young. Her bangs were permed and sprayed with mousse. She wore wide-legged pants and shirts with dolman sleeves, neatly mixing and matching vibrant colors. She beamed at the camera, her head held high, her hands on her hips. In the background of those photos were landmarks and scenery all over China. In every photo she was alone. I never realized that mother was so beautiful and confident, as radiant as the sun.  There was only one photo on the last page of the album, torn at the edges. Half of it was missing. The remaining half depicted mother with a baby in one of her arms. She looked slightly plumper than before, her hair undone, but she held her head high as usual, showing her signature pose—with one hand on her hip. The baby’s face was turned away from the camera, pouting, as if about to cry. That’s me.  Tears streamed down my face. I sobbed and sobbed. Time has frozen at once. I have never cried so hard in my life. Mother was gone. The only family left for me in this world was gone. I was left all alone. What should I do? How should I live?  “I should be asking you this question. Are you okay?” Her question dragged me back into reality.  I found myself tearing up. Panicking, I dabbed at my eyes with the back of my hand and explained, “it’s nothing. Just thought of mother. Don’t worry.”  “When I found out that mother had died, I cried for days,” she said.  I stared at her, stupefied.  “Yes. In my world, mother passed away as well. She was all alone back home, while I was here, in Dublin. I didn’t even get to see her one last time. I have never cried so hard in my life.”  “Who was calling you just now, then? I thought it was . . . ”  “Who?” Her eyes narrowed. “Oh, just a random person. Someone with serious problems. Not my mother.”  I nodded.  “Strange, isn’t it? I was so annoyed by mother when she was alive. I started missing her, though, after she died. The only family left for me in this world was gone.”  “I feel the same. Though I’m used to loneliness, the thought of actually being alone for the rest of my life scares the hell out of me,” I said. “It’s better now, though, knowing that at least we have each other.”  “Yes, me too,” she murmured. She lowered her eyes and her cheeks flushed.  I felt my heart skipping a beat. Perhaps I should abort my plan, I thought to myself. Or adjust my plan.  It got dark after four. Rain drizzled, then snowflakes drifted down with the wind. The park was soon near empty. Neither one of us wanted to leave our bench under the tree, though. We put our hoods up, tucked our necks into scarfs and our hands into coat pockets, and cuddled. We whispered to each other, and syllables coming out of our mouths froze into tiny icy particles. When the cold became unfathomable, we stood up and started heading toward Temple Bar, thinking that alcohol might warm us up.  The snow was still falling, but fortunately the flakes melted into water the moment they touched the ground. Tourists crowded the cobblestone street. No one had their umbrellas up. Between brick buildings were twinkling string lights blazing with color. The dim lights filtered through lines and lines of rainbow flags, casting dreamy shadows on the ground. Cheery, upbeat Irish traditional music reverberated through the district. The scent of alcohol and perfume permeated the air. We walked into a bar and ordered whiskey shots. I laughed at how the Irish added whiskey even to their coffee. She complained about how no alcohol stores around here carried baijiu.  On our fourth or fifth shot—I couldn’t remember for sure—we grabbed our glasses and joined the revelry. We squeezed into the crowd and swayed to the music. Bodies were pressed against bodies. No one seemed to realize that the band had missed a beat, followed by another. First the accordion, then the guitar and the banjo; the notes grew shril, and the pace quickened. Amidst the cacophony, the only instrument that remained normal was the tambourine, and yet its normalcy seemed even more strange and misplaced. Two people who were dancing intimately a split second ago broke apart and slapped each other. A girl with a dazed look on her face wrapped her arms around a stone statue and kissed it. A gentleman dressed in a fancy suit rolled on the floor as if he were performing Kung Fu. Paper cash in various colors and of different face values were tossed into the air. Translucent liquid with a pungent smell spread across the floor.  The world has turned upside down. Grasping her wrist, I made a run for the door. In the corner of the street where no one was looking, I kissed her on the lips. Her soft tongue tangled with mine. I grabbed a handful of her wavy hair and scrunched it up into a ball, then let it fall between my fingers. All of a sudden, I was curious: what would it feel like to make love to myself?  With our arms linked, we walked toward her home, singing, and laughing. The Liffey on a snowy night transformed into the milky way, a flowing silver river that cut through the vast darkness. We walked from Ha’penny Bridge all the way to the Samuel Beckett Bridge. In the night lights, the cable-stayed bridge resembled a colossal harp playing a silent melody. The Convention Center on the other shore bathed in rippling green light. We turned right onto Pearse Street and stopped by a building with snow-white walls and surrounded by a fence made from red bricks. She fumbled as she tried to open the half-glass half-wooden gate with her keys. I looked up at the sign on the gate. It said, “Winter Garden.”  After three cascading gates, I found myself in a space enclosed in an enormous glass dome that shielded everything inside from the wind and the snow. Winter Garden turned out to be a real greenhouse after all. A wide walking path lay straight ahead, and white two-story terraced houses lined its side, connected by spiraling lead-gray staircases. For every few meters there was a flower bed in which bright green plants grew. Those flowers had leaves that curled like seaweed, clustering around a long, straight stalk that spread out like tentacles at the end, each branch equivalent in length and dotted with small purple flowers. In the starlight they looked psychedelic and mesmerizing. They did not belong to this season. Perhaps they did not even belong to this time and this space.  She led me to house #78 and opened the door. Our bodies were still entangling as we stumbled down the hallway and entered the living room.  “Where’s your husband?” I asked as we took off each other’s coats.  “He’s not home today,” she responded.  When I unwound her scarf from her neck, she tried to push my hand away at first, but eventually she caved in. On her bare collarbone were purple bruises, same as the bruises on her forearm that she kept on hiding behind long sleeves.  I planted a kiss on one of the bruises, as gentle as a feather landing on the surface of a calm lake. “Why don’t you leave?” I whispered.  “It’s complicated to get a divorce here. Even more complicated for foreigners,” she said, wrapping her arm around my neck and hugging my head close to her chest. She tapped the back of my head with a finger, sending tingles down my spine. “I can’t leave even if I wanted to. This place is as hard to escape from as it is to stay in. Besides, my home is gone forever. There’s nowhere I can go.”  “We can leave together,” I looked into her eyes. “We can start a new life somewhere else, where no one knows who we are. I have made a lot of wrong choices. I’m sure you have too. I was foolish to think that your life was perfect . . . but it’s okay. It’s all over. Now we have each other.”  “Leave? Where? Another alternative universe?” She gave me a strange look. “We cannot coexist in the same space. We have the exact same face, fingerprints, irises, and DNA. One day someone will find out.”  “We can’t travel together back to the world I came from, but at least we can stay here together. We can move to the countryside, where there’s fewer people and less technology. We can tell them that we are twins. We can move to a different city, or a different country. There will always be a way,” I squeezed her hand.  “There will always be a way,” she repeated after me in a murmur, casting her eyes down. “That was what I thought before I came here. Who could have known about the goddamn winters? There’s never any sunlight. All you get is rain and snow,” her voice lowered. “In the beginning, he loved her. I thought that he would love me just the same.”  “I love you. I will always love you the same way I love myself,” I lifted her chin and forced her to look into my eyes.  She avoided my gaze. Pulling her hand away, she waddled toward the other corner of the room, carefully dodging the carpet. Her hands swept across the wine cabinet, the coffee table, the bookshelves, and finally the wide full body mirror encircled by intricate Celtic knots. Her reflection in the mirror wrapped her arms around her own body, her fingers clenching tightly. The room in the mirror was chaos: red-brown stains beneath the carpet with its edges rolled up, rows of empty wine bottles with broken corks on the wine cabinet, endless piles of takeout boxes under the coffee table, the tacky plastic potted plant next to the bookshelves . . . I wanted to free her from the mirror.  She stared into the eyes of her own mirror reflection. “He’s mad. Just like all of them. This is a world full of people who can’t distinguish between illusions and the reality. The worst one of them is neither dead nor alive, like Schrödinger’s cat. She’s always calling me, asking me to visit her. Sooner or later, I will go mad too.”  I followed over and hugged her from behind. The mirror reflected two faces that looked the exact same. The rhythms of our heartbeats were one. I licked her earlobe and whispered, “I’m different from them. I can distinguish between illusions and the reality. You are my reality.”  Abruptly, she turned around and kissed me. In a frenzy of passion, her tongue intertwined with mine, as if she was to consume me whole. The sight of the overlapping silhouettes in the mirror lit me up. I saw her twisting waist and my own eyes, hazy with desire. I began to undo her belt. She grabbed me and spun around in a half circle, so that I had my back to the mirror, and she could see the reflections. I nibbled at the skin on her neck and her collarbone. She threw her arms around my neck. The whiskey shots that we had drank earlier were burning in my body like a wildfire. I pulled the collar of her sweater down.  All of a sudden, I felt her hands around my neck tighten. A blunt object hit the back of my head. My remaining consciousness alerted me that I should immediately break away from her and run, but I didn’t know whether I should run out the door or activate the return-to-home-base anchor so that the people from the lab could summon me back. I froze, once again, from fear of making another wrong decision.  The second blow came, then the third, the fourth, harder and harder each time. As she jammed the object into the back of my head, she stuttered, “I’m sorry. I can’t stand this place anymore. The only way to keep the alternative universe stable is for you to stay here, and for me to take your place in the world you came from.”  I dropped to the floor. A loud bang came after. It was the stone statue that she used to attack me with. I remembered the second rule of transition: the quantum void, the world with dual states where everyone was mad . . .  I closed my eyes. A pair of hands fumbled through the layers of clothes I was wearing, snatching away the anchor. I couldn’t tell how much time had passed. In the limbo between reality and illusion, I heard someone singing. With my last strength I opened my eyes. She was in front of the mirror, cutting her hair short. Long, wavy black hair fell to the ground and curled up, reminding me of the leaves of the flowers in the Winter Garden. I couldn’t see her face, but I knew that her reflection now looked exactly like me.  Humming a familiar song, she activated the return-to-home-base anchor. The waves of purple light emitted by the transition were tentacle-resembling flowers. In the end, she had fulfilled my plan in my stead.    Originally published in Chinese in Fiction World, 6th issue, 2019.  Translated and published in partnership with Storycom.  Regina Kanyu Wang is a a writer, researcher, and editor, currently pursuing her PhD under the CoFUTURES project at the University of Oslo. She writes science fiction, nonfiction and academic essays in both Chinese and English. She has won multiple Xingyun Awards for Global Chinese SF (Chinese Nebula), SF Comet International SF Writing Competition, Annual Best Works of Shanghai Writers’ Association and more. Her stories can be found in her individual collections Of Cloud and Mist 2.2 and The Seafood Restaurant, various magazines, and anthologies. She is co-editor of the Chinese SF special issue of Vector, the critical journal of BSFA, The Way Spring Arrives and Other Stories, an all-women-and-non-binary anthology of Chinese speculative fiction, and the English version of The Making of The Wandering Earth: A Film Production Handbook. When she is not working on science fiction related projects, you can find her practicing krav maga, kali, boxing and yoga, or cooking various dishes and baking her favorite desserts.  Emily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature.", "text": "9680 words, novelette\nThe Winter Garden\nThe transition was much easier than I had imagined.\nStanding by the console, I set the parameters following my usual observation procedure. I had memorized the numbers when Jin first mentioned them, and I double-checked his experiment records, just to make sure. I rotated the security knob counterclockwise, punched in the password number by number, then pressed the green confirm button. The thirty second countdown began. Nimbly, I hopped onto the transition platform and checked for one last time that the return-to-home-base anchor was with me. I took a deep breath, closed my eyes, and, after a moment of slight dizziness, found myself in an alternative universe.\nThe first thing I saw was a wooden door. I pushed the door open. Blinding light and blistering cold wind overwhelmed me at once. Instinctively, I turned to shield my face. The specks of fluorescent light caused by the transmission process slowly faded and the mops, brooms, and detergent became visible in the dark cluttered closet room where I landed. The world before my eyes was exactly as my peers had described. I had purposefully made the landing spot of my transmission a remote corner to avoid trouble. This alternative universe was not all that different from the world I came from: same physical constants, similar level of technological progress . . . the only differences were in minor historical details, market trends, and of course, some individuals’ fates.\nOut of habit, I patted my sweater and pants lightly to get rid of the—nonexistent—dust. After my eyes grew accustomed to the light, I walked out of the closet room and found myself in a not-yet-open bar. I located the back door and exited.\nIt was a little past eight in the morning and the city of Dublin was just about to wake up from its slumber. The sky dawned blue. There was a light drizzle, and the rain landed on my face like cascading needles of ice. Already expecting the weather, I pulled the hood of my black down coat over my head. With quickening footsteps, I walked down the small street paved with cobblestones. The rain stopped when I took my second turn. The heavy rain clouds in the eastern corner of the sky dissipated, revealing a gold lining. A moment after, the clouds gathered, swallowing up the sunlight once again.\nI turned onto Dame Street and entered the College Green from the west. The triangular open space in which traffic passed through, in fact, had no green at all; the few meager trees had lost all their leaves in the howling winter wind, their bare branches pointing upward. To my east, there was a small patch of yellow, withered grass next to the front entrance of the Dublin Trinity College. Historical buildings stood south. The north was the old Irish Houses of the Parliament, their gray-white outer walls blending into the overcast sky. The faces of the three statues above the colonnade were so weather-beaten that their features were barely recognizable. In the world where I came from, the Houses of the Parliament belonged to the Bank of Ireland. In this world, however, a sign indicating “Trinity College” marked the gate to the compound. I walked into a café in the next street, sat down by the long table with a street view, and ordered an Irish coffee. A drink so strong first thing in the morning might not be the wisest choice, but I needed the caffeine to keep myself alert, and the alcohol to give me courage.\nEven after I had gone through the transition and landed in this alternative universe, I couldn’t bring myself to make a final decision.\nI hated making decisions. If life was a series of single-choice questions on an exam sheet, then I would have long ago failed the exam for making too many mistakes. I chose the wrong parent to live with after their divorce; taking care of my mother, an alcoholic who could barely manage her own life, was the primary reason that I couldn’t attend a well-ranked high school. I chose the wrong subject to study when I applied to college, wasting my days away in a STEM-oriented university when my interest was actually in languages and literature. I chose the wrong advisor when I applied to graduate school—his popularity meant that the competition was especially cutthroat, and I often thought to myself that I would have been in graduate school already if I had aimed for a different advisor, or simply had better records . . . back onto the job market and having missed the hiring season, I found myself jobless with a degree in an area of technology so specialized that no company cared for it.\nFinally, the dean, worried that I would impact our entire class’ employment rate on the university’s official records, introduced me to a temporary job within the university—manager of lab #03 of the Department of Quantum Physics. “Manager” was the most generous way to put it. My daily work mostly consisted of trivial errands, including coffee making, invoice organizing, delivering documents between offices, and occasionally putting in lightbulbs. I had no official post, no bonuses, no welfare, and not even winter and summer breaks.\nThe lab was small, with only a handful of members. Professor Zhang the lab director was rarely present, so Dr. Chen, a postdoc in the lab, took over most of the organizational and teaching duty. Dr. Chen came around once a week to check on the experiment progress of the students who were enrolled in the master’s-PhD joint program. The three students who worked in the lab regularly were about my age, and I called them by their last names, Jin, Yang, and Yu. Out of courtesy, they addressed me as Teacher Wang.\nFor the first few months, those students almost never spoke to me. Their working schedule was just as mysterious as the actual work that they were doing. No one arrived in the lab “on time.” Some would come in the evening, right before I was about to go home, and some would periodically move into the lab and stay for days. The general lab and the experiment room were separated by multiple doors. I never went into the innermost room. I had no idea what kind of experiments they were doing, and I was uninterested in finding out.\nAfter a while, the students finally started to talk to me—I suspected that it was because of my ability to keep my nose out of trouble, and well, also because people forgot their keys or forgot to turn off the light from time to time. In the beginning, they hid the experiment from me and called it “highly confidential.” Then, as we grew more familiar, they started leaking more and more information. Professor Zhang and Dr. Chen didn’t seem to have found my presence a trouble, either. Gradually, more administrative responsibilities of the lab were handed over to me, including keeping all the experiment data.\nAmongst the students, I talked to Jin the most. He was the one who revealed to me first that the lab’s project was about alternative universes; more precisely, transitioning between various alternative universes, and deciphering what their essence was.\nOf course I knew that alternative universes existed. Everyone did. This finding intrigued most people. But why should I be personally concerned? To me, an alternative universe was the equivalent of an alien planet. I have never even traveled outside of China, let alone a different universe!\nJin told me that Brent Liu’s transition experiment thoroughly proved the existence of type III alternative universes, in which the wave function never collapsed. The primary world would split into an unending number of superposed worlds. After decoherence, those worlds would evolve into alternative universes utterly unrelated to each other, respectively located on each quantum branch of the Hilbert Space with infinite dimensions. Humans could transit between those alternative universes.\nI didn’t really understand what he was saying.\n“With every choice you make, the world would split into two, ultimately generating an infinite number of alternative worlds existing in parallel to each other,” explained Jin.\n“Why do my choices matter so much?”\n“No, no, it’s just an analogy. I’m not saying that the world would literally split because of your choice. It depends on quantum measurements and randomness. Our job is to transit between different alternative universes and study the nature of the macrocosm. One day, commercial inter-universe travels may be possible.”\nI nodded, pretending that we were on the same page.\nHis words, though, were not completely useless. At least they offered me an explanation for why my life was a mess. I made all of the wrong choices and ended up in an alternative universe of misfortune. Never good at taking a stand growing up, I became even more hesitant about moving forward with my life. Scared that I would bring more pain and misery upon myself by making even more wrong choices, I always left the decision-making process ’til the last minute, so that time would weed out most of the alternatives. I would never have to make decisions when there were no other possibilities to start with.\nThe same went for my career. The dean advised that I should view the lab job as a fallback and seek new opportunities, but I have procrastinated with job-seeking since then, unable to decide which job-hunting platforms to upload my resume on. As a result, I ended up staying in the lab for years.\nAs I swallowed the last gulp of my coffee, my target appeared.\nShe got off a double-decker bus and turned around to speak to the driver, her long, black curls swishing in the air as her head swung. If I were correct, she would be one hundred and sixty-one centimeters in height and forty-three kilograms in weight, flat-chested. The lush and thick dark hair didn’t quite fit her stature; it made her look even more short and boney. Her coat, scarf, jeans, and sneakers were all black. As she started walking, I dashed out of the café and followed behind. She wasn’t a fast walker. Every time she lifted her left foot, her toes pointed slightly toward the outside, drawing a small curve before landing the step. I knew the way she walked better than anyone else. I couldn’t have been mistaken. She was the person I was looking for. Walking at her pace but a few meters behind, I followed her down the street. It was my first time following someone—thank God central Dublin was bustling, and the cars and pedestrians were enough to veil me from her sight.\nShe stopped at a junction, waiting for the tram to pass by. Before the red light turned green, she started to cross the road, swiftly passing through cars. A rule breaker. I had no choice but to follow. A small hassle was taking place before Trinity College’s front entrance, where two tourists were fighting over a clover-patterned green scarf. The scarf was the kind of basic merchandise that every souvenir store around here offered, but both tourists were insisting that they got hold of the scarf first. One of them was actually wearing a scarf that looked exactly the same, but no one bothered to point it out. She pushed through the crowd, clearly uninterested in stopping to watch. I didn’t want to risk getting too close, so I waited until she disappeared behind the wooden arch before I walked in. Behind the arch was an arcade with dim lighting that led to the main campus. Two large trees stood opposite to each other on the grass, their thin branches shuddering in the cold wind. A line of people gathered on the right. I scanned around with my eyes looking for her but couldn’t find her anymore.\nMy pulse quickened. Did I lose her? Did she know that I was following her? It looked like that she was a student here, and I was sure that she knew the campus much better than I did. Someone at her age would be enrolled in a PhD program. In my world, Trinity College was the best university in Ireland, consistently ranking amongst top one hundred in the world. Good for her. Apart from luck, she must have had a more decisive personality than I did, so that she was able to secure her grasp on every opportunity to success that came her way. If I were to confront her, would I stand a chance against her? I was overwhelmed with hesitation. What if I gave up on the plan entirely and treated this trip as a short vacation in Dublin? I have never been to Dublin, after all, but it would be ridiculous if I wasted my only chance of alternative universe transition on touring Dublin . . .\nAs I contemplated, she reappeared before my eyes, now wearing a flowy, sleeveless black robe with golden embroideries on the collar that resembled an academic dress. She strode toward the front of the line, speaking loudly in English. I pulled my hood down lower and approached the crowd, trying to make myself as unnoticeable as possible. She explained to the tourists the history of the campus. So, she is a student guide. A part-time job. The tour would last for half an hour and end at The Old Library, where tourists could see the famous Book of Kells and the Long Room. I snuck into the line. When she came over to collect our tour fee, I kept my head low, pretending to look at my phone, and handed her the money with my free hand. Her fingertips brushed across my palm. A light shiver went down the lines on my palm, stimulating my nerve endings. Did she recognize me? My heart was about to leap out of my chest. Just as when I was on the verge of blurting out to her who I was, she put the spare change into my hand and left for the tourist behind me. Inhale. Exhale. My racing heart slowed down. I didn’t have to make the decision . . . yet.\nShe led the tourists onto the campus, introducing buildings and customs in rapid English. Her voice was small and low, so for most of the time she had to shout at the top of her lungs to make sure that everyone heard her. I felt exhausted for her. Tagging along, I observed her discreetly and prayed that she wouldn’t notice my presence.\nOn the other hand, I couldn’t help but look around nonstop, barely able to take my eyes off the gorgeous campus. Historical buildings stood erect shoulder to shoulder, constructed from stone bricks dated hundreds of years ago. Seen from afar, the thin, delicate cracks on the mottled green walls resembled complex and mysterious runes. For one second, against the pale light, I thought I had seen someone standing on one leg on top of the bell tower. When I rubbed my eyes and landed my gaze on the person again, I realized that it was only a very large crow. An instant after, it spread its wings, took flight, and disappeared into the layers of heavy clouds.\nThis place was exactly how I imagined a university with hundreds of years of history would look like. The college years in my memory seemed even bleaker compared to the life she lived here. I vaguely remembered that I once dreamed about applying to universities abroad and changing a country to live in as well. Can I revive that dream?\nThe thirty-minute campus tour soon came to an end, and the group dispersed before The Old Library. Just as I was hesitating about whether to enter the library or to keep on following her, she came toward me. She walked in strides, her steps fast and steady. Sandwiched between the outer wall of the library and a crowd of tourists, I had nowhere to hide.\nShe brushed one side of her hair back. For the first time after I landed in this world, I gazed directly at her face. Her chin tilted up slightly and the corner of her lips were pulled into a firm line. There were two tiny moles on her right cheek. Her nose bridge was beautifully arched. Her eyes narrowed, and her dark brown pupils were fixed on me. A face and a scrutinizing expression that no one knew better than I did.\n“Hey,” she said in Chinese, her arm crossed at her chest. “Which alternative universe did you come from?”\n—Asked the version of myself in this alternative universe, in a voice and tone exactly the same as mine.\nIt was a hot, humid summer night. The air was so moist and sticky that it could almost glue together the wings of insects. I stayed in the lab past nine, waiting for the repairer to finish up fixing our air conditioning. I had already called mother and told her that I was going to be late today. When she called again, I hung up the phone. The work was done, and I had no more reason to stay behind, so I packed up extra slowly, delaying the time to go home as much as possible.\n“Teacher Wang?” exclaimed Jin when he exited the innermost experiment room. “What keeps you here so late?”\n“The air conditioning repairer was running behind schedule, so I had to wait. Did you just come back from a mission?”\nJin nodded. He started walking toward the lab door, but then halted after a few steps.\n“What’s the matter?” I asked. “You’ve been gone for three days, haven’t you?”\n“Yeah,” he sighed. “Teacher Wang, guess who I met on the mission this time?”\n“Who? Professor Zhang? Yang? Yourself?” I threw a few random names at him, but I didn’t really care about his answer.\n“No. It’s you.”\nI was stupefied. Me? To be honest, even after knowing that alternative universes existed, I have never considered such a possibility. Theoretically, I knew that every alternative universe contained a different version of myself; but with the world so big and the transition between alternative universes so difficult, I couldn’t imagine that those versions of myself would be connected in any way.\n“What do I . . . I mean, what does she look like?”\n“She looks the same as you, except she has long hair. Have you considered changing your hairstyle? I think long curls would suit you well.”\n“No, I’ll give it a pass. I’m short to begin with, and long curls would only make me look shorter. I like my current bob better. Clean and convenient.”\nJin muttered, and his face turned red.\n“What did you say?”\n“No, nothing.”\n“So, where did you see her?”\n“In Universe #34257, transition coordinates (61, 589, 37i) . . . ” Seeing my frowned eyebrows, he concluded, “On the streets.”\n“What was she doing?”\n“She was walking. We walked side by side for a while, then we parted ways.”\n“Why didn’t you follow her?”\n“Hey, I’m not a stalker! I had a mission to take care of, too . . . ”\n“Then when are you going back again? Can you go check on her?”\nJin frowned and bit his lip. “I don’t think I can go back. Our research on that alternative universe is ending soon. Besides, even if I go back, I probably won’t end up in Dublin.”\n“Dublin?”\n“Yes. I saw her in a foreign country.”\n“Does she live there?”\n“I think so. Well, I don’t know for sure . . . ”\nJin couldn’t remember anything else. The silhouette of the woman that he had contoured, however, continued to linger in my mind. What would another version of myself be like, in an alternative universe? What choices had she made that led her to settle down in Dublin?\nPerhaps she never broke up with Wu. Breaking up with my ex-boyfriend Wu was another major decision of mine that went wrong. During our senior year, he was offered a job opportunity in Ireland, and there was a chance that he could stay and obtain permanent residency. However, as a couple, we would have to endure long distance. He was torn between choosing his career and choosing to stay with me. I, on the other hand, was far more apathetic than I should be—what was the point of hanging on when we would very likely grow apart after leaving school anyway? I also had to admit that I was not in love with him the way he was in love with me. In the end, he told me that he wanted to give up the job for my sake. To me, his decision meant pressure instead of care and commitment. I told him that it would be better if we separated instead. After a period of anguish and back-and-forth communication, he deleted me on all social media and left for Ireland alone. I let out a sigh of relief the day he finally left.\nIt was already past noontime when her work shift ended. We went to an Irish restaurant near campus for lunch. After we sat down, she took off her coat and tugged down the sleeves of her black turtleneck sweater inside, but never removed her black rough-knit scarf. The waiter brought the menu to our table. After a quick glimpse, she handed it over to me, not bothering to take a closer look. I ordered fish and chips, and a mug of Guinness beer; all she had was a simple salad and water.\nThe food came. Mine was immensely oversized. I recognized the fish as cod, and it tasted quite plain and flavorless. The beer, though, was surprisingly smooth and foamy. “Do you want to try some of mine?” I asked, pushing my plate in her direction.\nShe shook her head and jabbed at the vegetables with her fork. “I have tried it hundreds of times. The same food every day almost drives me crazy.”\n“Why don’t you cook?”\n“Do you cook?” she shot back, giggling.\n“No.” I responded candidly.\nMother didn’t cook either. We usually got takeout or ate in restaurants. I didn’t like cooking. Too much of a hassle.\n“I’d rather choose the same food every day over cooking. Too much of a hassle. Besides, my husband doesn’t eat Chinese food anyway.”\n“You’re married?”\n“Yeah.”\n“What is he like?”\n“A local. An Irishman. I don’t have a lot of great things to share about him,” she said, pulling on her sleeves again to carefully conceal her wrists.\n“I thought . . . well, in the world where I came from, Wu went to Dublin.”\n“Oh, we broke up ages ago. I was not in love with him the way he was in love with me.”\n“I feel the same,” I said, swallowing a large gulp of beer. The bitter taste filled my mouth. “Although I must say, I thought that you would have made a wiser decision.”\n“Very funny. Stop thinking that you and I are completely different people. Remember, no matter what choice you make, the ending is all the same.”\n“Well, at least you’re in Dublin and studying at Trinity College.”\n“No, it’s only my part-time job. I can’t afford tuition as an international student, and they wouldn’t give me a stipend.”\n“Then why—” I stopped myself short. I already knew the answer.\n“Yes, I was only able to obtain permanent residency after I got married. Or, you might as well say that I got married for the sake of obtaining permanent residency,” her lips curled into a sneer.\n“How long have you been here?”\n“I can’t remember the exact time,” she took a sip of the water. “Two years, I suppose. In the beginning it was fine because everything here was still fresh and exciting to me. Remember being obsessed with Ulysses back in middle school despite not knowing what the book was talking about? When I first arrived, I traveled all over Dublin following in Bloom’s footsteps, like a pilgrimage.”\n“Of course. I used to want to major in English and study in Ireland. James Joyce, Oscar Wilde, W. B. Yeats, Bram Stoker . . . all of my favorite authors were Irish. I gave up because I thought that literature was useless. My professed aspiration was only an illusion. I never worked on improving my English nor my qualifications to study abroad. Why, this is my first time in Dublin, because I was too lazy to even plan for a holiday.”\n“When are you planning on going back? I’ll take you around the city if you’re not in a hurry.”\n“No, not at all. I have no idea what’s going to happen when I get back. The lab should have found out by now that I’m here.”\n“So you basically snuck into this universe?”\n“Yes. Though without the return-to-home-base anchor, they can’t force me to go back. I brought it with me.”\n“What is the return-to-home-base anchor?”\n“Our lab members use it to mark the coordinates of our home world and the alternative universe we travel to. Once the transition is launched, the anchor will know precisely where I am. If they have the anchor, they can summon me back. Same goes if I activate the anchor from here,” I explained. “Have you been to other alternative universes? You didn’t seem surprised when you saw me, so I thought that you were familiar with the technology.”\nShe nodded. “I have, but in a different way.”\n“I see.”\n“Let’s take a walk, then. You might as well enjoy!”\n“Sounds great. I would love to talk to you more.”\nDeep down in my heart, I knew that I needed more information from her—if I wanted to carry out my plan. A short lunch conversation was far from enough.\nWe stood up and waved for the waiter to bring the check. She tugged down the sleeves of her sweater again.\nI didn’t expect that mother would fall ill.\nWell, I should have expected, given the amount of alcohol she consumed on a daily basis. More so, I should have persuaded her to do regular body checkups, so that she wouldn’t end up in the hospital when the pain in her guts became intolerable and discover out of the blue that she had advanced liver cancer. Conservative therapy was time-consuming and expensive; she would live for a few more years at best, unable to take care of herself during the entire course of therapy. Experimental therapy was the only chance to cure her illness, yet naturally it would expose her to more risk. Choices, more choices . . . damn it, why is life all about making choices? I was paralyzed by the immense fear of choosing the wrong option.\nThe lab became my safe haven, my only escape route. The smell of disinfectant, the groans and curses that mother made when she tossed and turned on the hospital bed, the weekly invoice that the nurses handed to me . . . with those things weighing down on my chest, I felt as if I were about to suffocate. I turned to alcohol the way mother did. I drank every time before visiting her and rinsed my mouth repeatedly so that she wouldn’t smell the alcohol on my breath. Apart from collecting a change of clothes for mother, I almost never went home. The cramped two-bedroom apartment was now too big and quiet, its emptiness a black hole that threatened to swallow me up.\nTo be honest, I wasn’t sure whether I would rather mother live or die. She didn’t love me; I knew that for a fact since childhood. She only loved herself. After she divorced father, she has always been accompanied by at least one boyfriend. I suspected that she secretly resented me for choosing to live with her, and I, the unwanted child, was her burden. But did I love her? I wasn’t sure, either. She was my only family. Father has remarried and moved to a different country. I had no partner or children of my own. Who else could I love, if not her? If occasional bickering was a way of showing that I cared, then perhaps I did love her.\nAs I was deeply lost in my thoughts, comparing the two treatment options over and over again, mother’s illness exacerbated. She passed away much quicker than I had anticipated. Once again—I waited until I had no choice left.\nWhen Jin found me, I was locked up in my office, drinking alone.\n“Teacher Wang! Teacher Wang!” Jin banged on my door. “Let me in!”\nI dabbed at my face to dry the tears, hid the liquor bottle, and opened the window for fresh air. After I made sure that there was no way he could tell what had happened, I opened the door for him. “What’s the matter? Did you forget your keys again?”\n“No. I’m just . . . I’m worried about you.”\n“Me? I’m fine.”\nJin didn’t respond. He turned around and left for a moment, then came back into my office with a dozen bottles of beer. “Do you want to have a drink together, then?”\n“You’re not worried that Professor Zhang would find out?” I smiled mockingly.\n“No. He never shows up anyway,” laughed Jin, handing me a beer.\nI pulled my chair over so that I could sit next to him. “I didn’t know that you drink. It’s too cold now, or else we could go outside. I love sitting on the stadium stairs, especially in the summer,” I took a swig.\n“Teacher Wang, my mother passed away when I was a child, so . . . ” Jin stuttered.\n“Hey. You don’t have to comfort me.”\n“I’m sorry . . . ”\nWe fell silent. “Maybe the version of me you saw in that alternative universe lives a better life. Now I really want to travel to the past, meet her and tell her to talk to mother more often and make sure mother does regular body checkups. Even if mother tries to scold her, she should still take her to the hospital,” I said, then I laughed. “What am I saying? It’s not like I can meet her anyway. In sci-fi films, when two versions of the same person meet, they always . . . disappear together into thin air or something.”\n“No, no, that’s all made up for effect. There are two rules to transition: first, the transition can only happen at the same point of time between alternative universes. It is not like time traveling, where the traveler can enter different points of time, change the past, or catch a glimpse of the future. One can only observe synchronous quantum branches, and the rate of time flow between different alternative universes is constant. That is, when one transitions to an alternative universe, time is still flowing as usual in their original universe, and the amount of time one spends in the alternative universe will be accounted for in the original universe as well. If your mother had passed away in the alternative universe already, just like in this one, there’s nothing you can do about it.”\n“What a pity. When do you guys start working on time travel?”\n“Time travel is impossible. According to Oe and Vonnegut’s research thirty years ago—”\n“Okay, okay, I was only joking. What is the second rule, then? Can I meet myself?”\n“Yes. The second rule is that the same individual in different alternative universes can coexist in the same world via transition. Every version of the individual is equal, and the interaction between them has little to no effect on the macrocosm. Perhaps some might feel mental impact upon encountering another version of themselves, but that is more about individual psychological differences than a general physical law. Normally, as long as we refrain from deliberately disturbing the balance of alternative universes and keep out of trouble, meeting other versions of ourselves won’t affect the order of things.”\n“So, to be simple, it’s okay for me to meet another version of myself in an alternative universe, right?”\n“That’s right, but time is another factor. If an individual leaves their original world for too long, the quantum void created by their absence would increase in size. Like a black hole, it would attract the alternative universe in which the individual lands in. We call that the quantum black hole effect. That way, the two worlds would reenter entanglement, resulting in a coalescence of the two worlds. The more the worlds overlap, the more differences between them would disappear, until they merge into a world with dual states.”\n“Dual states?”\n“Yang has been to an alternative universe like that,” said Jin, shuddering. “It was an accident. None of us knew what we were dealing with. After she came back, she told us that she has a strange, ominous feeling the moment she landed. All the people she met spoke nonsense, as if they were mad. Gradually, she realized that she was in a world with dual states, in which everyone lived double lives, bore the weight of two separate identities and memories. Only the misplaced individual who had caused the two worlds to collapse into one another could distinguish between their original universe and the alternative universe. Yang said that she was terrified, and she hoped that she would never have to go somewhere like that again.”\n“Speaking of Yang, I think she’s interested in you,” I nudged him.\n“What? Impossible!”\n“You’re so oblivious. Even I can tell!”\n“No, you’re the one who’s oblivious,” he responded, biting his lip.\n“What?”\n“Nothing!” His face was flushed.\nNeither one of us spoke after that exchange. We sipped our beers in silence.\nSoon after, Professor Zhang came around the lab to specifically meet with me. He began by sending his regrets, then claimed that I hadn’t been on top of my work for a while, and that the university wanted to keep the lab exclusive to lab members to maintain the work’s confidentiality. Eventually, he got to the main point of the conversation—to encourage me to go on leave without a definite return date, and of course the break was unpaid. Given my meager contract, he could technically fire me whenever he wanted to, and he was already being generous by hinting that it was best if I quit.\nI had no reason to stay; but where else could I go? In despair, I remembered what Jin had said, about the other version of myself in an alternative universe. I could go to her. At first, I was frightened by my own idea. If they caught me using their machine, they would fire me at once. Upon further contemplation, however, I decided that nothing would be worse than the kind of life I faced right now.\nIf the version of me in that alternative world lived a better life, perhaps I could stay, and she . . .\nThe transition coordinates of Universe #34257 flashed into my mind.\nDuring a weekend when the lab was empty, I easily obtained Jin’s experiment records and confirmed the values.\nI took the step to save myself.\nSide by side, we strolled down Grafton Street together, all the way to the southern part of the city. Neither one of us was looking to buy souvenirs, but even just walking between well-decorated stores and enthusiastic tourists made my heart lighten up. Every few dozen meters stood a street performer. We took a picture with an old woman who covered herself in paint and pretended that she was a bronze statue. We hit the forehead of a naked, tattooed man flexing his muscles, at his invite, with a brick and saw how his iron head shattered the brick. We peered into an eye-sized hole on a large wooden box for the peep show, having fun as if it were virtual reality. She saw the birth of a star a billion lightyears away, and I saw the forbidden love between a pair of twin sisters in a remote, closed off village.\nWe even bought ice cream cones. With the weather so cold, no matter how slow we nibbled at the ice cream, it wouldn’t melt. We talked about how we used to collect plastic bottles and tin cans from trash, sell them, and buy ice cream. Our childhood grocery shop only carried three different flavors, so we always chose the three-colored cups to taste all the flavors at once. We talked about how mother eventually found out that we were making money by fumbling through trash and was furious and ashamed. We were both punished, in slightly varying ways. We talked about how whenever mother brought a new boyfriend back, we would secretly bet on how long this one would last. For her, the longest record was three months and six days, and for me six months and three days—double the length. Our experience growing up was almost entirely identical save for minor details. Talking to her was like reviewing my own life. I had already forgotten many of those details and stories and couldn’t help but question whether her version was the correct one.\nWe finished the ice cream. A chocolate stain remained on her lip corner that glued a strand of hair to her face. I reached out with my hand to wipe at the same time she stuck out her tongue to lick. The tip of her tongue touched the tip of my finger, sticky, and slick. She turned her eyes to me, and for a split second her gaze fell out of focus. The clouds dispersed and a beam of sun landed on her. Her hair was smooth and shiny like black satin. She smiled. I smiled back. Her fluttering eyelashes and dimple made me realize all of a sudden why Wu as well as other people have said that I had a beautiful smile.\nThe end of Grafton Street was St. Stephen’s Green. The walkway was littered with people waddling with canes, pushing baby carriages, jogging, or cat-walking. I couldn’t believe my eyes: an extra-large Maine cat with long fur the color of snow and a collar dashed down the green, dragging its owner behind. The grass after rain was freshly green. The imbricating evergreen leaves were a color gradient of green, yellow, and red, reminding me of clouds at dusk. I would have mistaken the scene before my eyes for summer if it wasn’t for the bare branches of deciduous trees.\nWe stopped by the lake to watch ducks and swans mate, then sat down in the lakeside pavilion to rest. A lady walked over. Her tall, magnificent purple hat with dangling feathers seemed straight out of a literary classic. She showed us a full-fledged curtsy and told us, “a wedding is going to take place in here in five minutes. You can stay to watch, but the pavilion will be occupied.” So we went to the green and joined the crowd of guests. Most of the people here were dressed in vintage suits and dresses, as formal as the lady we met earlier. They spoke to one another in an unfamiliar, ancient-sounding language that we couldn’t understand. As more and more late-arrivers cheek-kissed and joined the audience, the crowd grew larger. I exchanged a glance with her, and we indicated to each other with our eyes that our black clothes were probably unsuited for the occasion.\n“Do Irish people celebrate their weddings outside in winter?” I whispered to her.\nShe shrugged. “I don’t know.”\n“What about your wedding?”\nHer eyes narrowed. After a moment of silence, she said, “it was in the church.”\nA priest dressed in white entered the pavilion and announced that the wedding would begin. The violinist’s music was melodious and melancholic. The groom and the best man emerged, dressed identically, and wearing the exact same solemn expression. For a moment, I thought they were the ones getting married.\nThe lady wearing the hat whispered in our ear, in English, “step aside, or else you’d be a part of the wedding pictures,” then she added, “I know what it feels like to appear in strangers’ wedding pictures. People in my profession almost always photobomb if we’re not careful enough.” She was wearing heavy makeup. The powder on her nose had faded, as well as her lipstick, revealing oily skin and pale lips. After a mere few seconds, however, she waved for us to come to the middle—as if she had completely forgotten what she had said before. “Come closer, girls,” she said, cheerfully. “Or else you won’t be a part of the wedding picture. To be in a photo on such a celebratory day is a blessing. Are you twins? How cute!”\nWe exchanged a glance. She shrugged. We did not move.\nAfter the music ended, the bride appeared, walking down the aisle with her father by her side. With her delicate body wrapped in a semitransparent lace wedding dress, she smiled stiffly, and her shoulders were tense and shivering. Perhaps it was because of the cold weather. She was led into the pavilion and handed over to the groom, practically trembling at this point.\nThe priest began to read the vows, and the couple repeated after him. However, just as the two were about to exchange their rings, the groom’s expression changed. His gaze, previously filled with affection and longingness, turned cold and distant all of a sudden. He stared at his bride, as if she were a stranger. The best man rushed forward, stuffed the ring box into the groom’s hand, wrapped his arms around the groom, then broke into a crying fit. Some guests hurried into the pavilion and dragged the best man off. The groom examined his new wedding ring carefully, then turned to look in the direction in which the best man left. With a sharp cry he tossed the ring box into the lake and ran after the best man. The bride, on the other hand, let out a heavy sigh. Lifting the hem of her dress with her hands, she ran toward the railing, about to make a dive. Luckily, a few others caught her before she fell.\n“What is going on?” I whispered to her. “Are they all drunk or something?”\nHer lips twitched into a sarcastic smile. “Who knows? People here are drunk day and night,” she pointed a finger at her temple and drew circles. “Something went wrong in there.”\nWe continued with our park walk. I wanted to ask her about mother, but whenever the words came to the tip of my tongue, I became reluctant to speak them out loud. Her phone rang. I saw mother’s photo on the lit-up screen. I had the exact same screensaver, so I recognized it in a brief glimpse. In the picture, mother was grinning, ever so happy and carefree. I took the photo when mother was not looking. She asked me to delete it, but I kept it anyway.\nShe took her call standing a few meters away from me. I couldn’t hear what she was saying, but I could see how she frowned, pressed her palms to her forehead, shrugged, and stomped. Fortunately, the call did not last for long. She hung up quickly and trotted toward me.\n“Are you okay?” I asked.\nShe shook her head and said nothing.\nI could understand, though. Mother used to call me, sobbing, saying that she loved me, that she wanted to see my face and talk to me, and that I was the only thing left for her in this world. I could tell immediately that she was drunk whenever those words came out of her mouth, because the thought of me would never cross her mind when she was sober.\nAfter her death, I received a call from a man who claimed to be mother’s friend. “She left some personal belongings behind with me,” he said. “Do you have time to pick it up?”\n“Send them back in a package,” I responded, not really wanting to meet him.\nHe agreed and hung up without asking my address. A few days after, I received a tightly wrapped package sent from someone named Huang. In the package was a hard cover photo album in the style of the past century. In there I found hundreds of pictures of mother when she was young. Her bangs were permed and sprayed with mousse. She wore wide-legged pants and shirts with dolman sleeves, neatly mixing and matching vibrant colors. She beamed at the camera, her head held high, her hands on her hips. In the background of those photos were landmarks and scenery all over China. In every photo she was alone. I never realized that mother was so beautiful and confident, as radiant as the sun.\nThere was only one photo on the last page of the album, torn at the edges. Half of it was missing. The remaining half depicted mother with a baby in one of her arms. She looked slightly plumper than before, her hair undone, but she held her head high as usual, showing her signature pose—with one hand on her hip. The baby’s face was turned away from the camera, pouting, as if about to cry. That’s me.\nTears streamed down my face. I sobbed and sobbed. Time has frozen at once. I have never cried so hard in my life. Mother was gone. The only family left for me in this world was gone. I was left all alone. What should I do? How should I live?\n“I should be asking you this question. Are you okay?” Her question dragged me back into reality.\nI found myself tearing up. Panicking, I dabbed at my eyes with the back of my hand and explained, “it’s nothing. Just thought of mother. Don’t worry.”\n“When I found out that mother had died, I cried for days,” she said.\nI stared at her, stupefied.\n“Yes. In my world, mother passed away as well. She was all alone back home, while I was here, in Dublin. I didn’t even get to see her one last time. I have never cried so hard in my life.”\n“Who was calling you just now, then? I thought it was . . . ”\n“Who?” Her eyes narrowed. “Oh, just a random person. Someone with serious problems. Not my mother.”\nI nodded.\n“Strange, isn’t it? I was so annoyed by mother when she was alive. I started missing her, though, after she died. The only family left for me in this world was gone.”\n“I feel the same. Though I’m used to loneliness, the thought of actually being alone for the rest of my life scares the hell out of me,” I said. “It’s better now, though, knowing that at least we have each other.”\n“Yes, me too,” she murmured. She lowered her eyes and her cheeks flushed.\nI felt my heart skipping a beat. Perhaps I should abort my plan, I thought to myself. Or adjust my plan.\nIt got dark after four. Rain drizzled, then snowflakes drifted down with the wind. The park was soon near empty. Neither one of us wanted to leave our bench under the tree, though. We put our hoods up, tucked our necks into scarfs and our hands into coat pockets, and cuddled. We whispered to each other, and syllables coming out of our mouths froze into tiny icy particles. When the cold became unfathomable, we stood up and started heading toward Temple Bar, thinking that alcohol might warm us up.\nThe snow was still falling, but fortunately the flakes melted into water the moment they touched the ground. Tourists crowded the cobblestone street. No one had their umbrellas up. Between brick buildings were twinkling string lights blazing with color. The dim lights filtered through lines and lines of rainbow flags, casting dreamy shadows on the ground. Cheery, upbeat Irish traditional music reverberated through the district. The scent of alcohol and perfume permeated the air. We walked into a bar and ordered whiskey shots. I laughed at how the Irish added whiskey even to their coffee. She complained about how no alcohol stores around here carried baijiu.\nOn our fourth or fifth shot—I couldn’t remember for sure—we grabbed our glasses and joined the revelry. We squeezed into the crowd and swayed to the music. Bodies were pressed against bodies. No one seemed to realize that the band had missed a beat, followed by another. First the accordion, then the guitar and the banjo; the notes grew shril, and the pace quickened. Amidst the cacophony, the only instrument that remained normal was the tambourine, and yet its normalcy seemed even more strange and misplaced. Two people who were dancing intimately a split second ago broke apart and slapped each other. A girl with a dazed look on her face wrapped her arms around a stone statue and kissed it. A gentleman dressed in a fancy suit rolled on the floor as if he were performing Kung Fu. Paper cash in various colors and of different face values were tossed into the air. Translucent liquid with a pungent smell spread across the floor.\nThe world has turned upside down. Grasping her wrist, I made a run for the door. In the corner of the street where no one was looking, I kissed her on the lips. Her soft tongue tangled with mine. I grabbed a handful of her wavy hair and scrunched it up into a ball, then let it fall between my fingers. All of a sudden, I was curious: what would it feel like to make love to myself?\nWith our arms linked, we walked toward her home, singing, and laughing. The Liffey on a snowy night transformed into the milky way, a flowing silver river that cut through the vast darkness. We walked from Ha’penny Bridge all the way to the Samuel Beckett Bridge. In the night lights, the cable-stayed bridge resembled a colossal harp playing a silent melody. The Convention Center on the other shore bathed in rippling green light. We turned right onto Pearse Street and stopped by a building with snow-white walls and surrounded by a fence made from red bricks. She fumbled as she tried to open the half-glass half-wooden gate with her keys. I looked up at the sign on the gate. It said, “Winter Garden.”\nAfter three cascading gates, I found myself in a space enclosed in an enormous glass dome that shielded everything inside from the wind and the snow. Winter Garden turned out to be a real greenhouse after all. A wide walking path lay straight ahead, and white two-story terraced houses lined its side, connected by spiraling lead-gray staircases. For every few meters there was a flower bed in which bright green plants grew. Those flowers had leaves that curled like seaweed, clustering around a long, straight stalk that spread out like tentacles at the end, each branch equivalent in length and dotted with small purple flowers. In the starlight they looked psychedelic and mesmerizing. They did not belong to this season. Perhaps they did not even belong to this time and this space.\nShe led me to house #78 and opened the door. Our bodies were still entangling as we stumbled down the hallway and entered the living room.\n“Where’s your husband?” I asked as we took off each other’s coats.\n“He’s not home today,” she responded.\nWhen I unwound her scarf from her neck, she tried to push my hand away at first, but eventually she caved in. On her bare collarbone were purple bruises, same as the bruises on her forearm that she kept on hiding behind long sleeves.\nI planted a kiss on one of the bruises, as gentle as a feather landing on the surface of a calm lake. “Why don’t you leave?” I whispered.\n“It’s complicated to get a divorce here. Even more complicated for foreigners,” she said, wrapping her arm around my neck and hugging my head close to her chest. She tapped the back of my head with a finger, sending tingles down my spine. “I can’t leave even if I wanted to. This place is as hard to escape from as it is to stay in. Besides, my home is gone forever. There’s nowhere I can go.”\n“We can leave together,” I looked into her eyes. “We can start a new life somewhere else, where no one knows who we are. I have made a lot of wrong choices. I’m sure you have too. I was foolish to think that your life was perfect . . . but it’s okay. It’s all over. Now we have each other.”\n“Leave? Where? Another alternative universe?” She gave me a strange look. “We cannot coexist in the same space. We have the exact same face, fingerprints, irises, and DNA. One day someone will find out.”\n“We can’t travel together back to the world I came from, but at least we can stay here together. We can move to the countryside, where there’s fewer people and less technology. We can tell them that we are twins. We can move to a different city, or a different country. There will always be a way,” I squeezed her hand.\n“There will always be a way,” she repeated after me in a murmur, casting her eyes down. “That was what I thought before I came here. Who could have known about the goddamn winters? There’s never any sunlight. All you get is rain and snow,” her voice lowered. “In the beginning, he loved her. I thought that he would love me just the same.”\n“I love you. I will always love you the same way I love myself,” I lifted her chin and forced her to look into my eyes.\nShe avoided my gaze. Pulling her hand away, she waddled toward the other corner of the room, carefully dodging the carpet. Her hands swept across the wine cabinet, the coffee table, the bookshelves, and finally the wide full body mirror encircled by intricate Celtic knots. Her reflection in the mirror wrapped her arms around her own body, her fingers clenching tightly. The room in the mirror was chaos: red-brown stains beneath the carpet with its edges rolled up, rows of empty wine bottles with broken corks on the wine cabinet, endless piles of takeout boxes under the coffee table, the tacky plastic potted plant next to the bookshelves . . . I wanted to free her from the mirror.\nShe stared into the eyes of her own mirror reflection. “He’s mad. Just like all of them. This is a world full of people who can’t distinguish between illusions and the reality. The worst one of them is neither dead nor alive, like Schrödinger’s cat. She’s always calling me, asking me to visit her. Sooner or later, I will go mad too.”\nI followed over and hugged her from behind. The mirror reflected two faces that looked the exact same. The rhythms of our heartbeats were one. I licked her earlobe and whispered, “I’m different from them. I can distinguish between illusions and the reality. You are my reality.”\nAbruptly, she turned around and kissed me. In a frenzy of passion, her tongue intertwined with mine, as if she was to consume me whole. The sight of the overlapping silhouettes in the mirror lit me up. I saw her twisting waist and my own eyes, hazy with desire. I began to undo her belt. She grabbed me and spun around in a half circle, so that I had my back to the mirror, and she could see the reflections. I nibbled at the skin on her neck and her collarbone. She threw her arms around my neck. The whiskey shots that we had drank earlier were burning in my body like a wildfire. I pulled the collar of her sweater down.\nAll of a sudden, I felt her hands around my neck tighten. A blunt object hit the back of my head. My remaining consciousness alerted me that I should immediately break away from her and run, but I didn’t know whether I should run out the door or activate the return-to-home-base anchor so that the people from the lab could summon me back. I froze, once again, from fear of making another wrong decision.\nThe second blow came, then the third, the fourth, harder and harder each time. As she jammed the object into the back of my head, she stuttered, “I’m sorry. I can’t stand this place anymore. The only way to keep the alternative universe stable is for you to stay here, and for me to take your place in the world you came from.”\nI dropped to the floor. A loud bang came after. It was the stone statue that she used to attack me with. I remembered the second rule of transition: the quantum void, the world with dual states where everyone was mad . . .\nI closed my eyes. A pair of hands fumbled through the layers of clothes I was wearing, snatching away the anchor. I couldn’t tell how much time had passed. In the limbo between reality and illusion, I heard someone singing. With my last strength I opened my eyes. She was in front of the mirror, cutting her hair short. Long, wavy black hair fell to the ground and curled up, reminding me of the leaves of the flowers in the Winter Garden. I couldn’t see her face, but I knew that her reflection now looked exactly like me.\nHumming a familiar song, she activated the return-to-home-base anchor. The waves of purple light emitted by the transition were tentacle-resembling flowers. In the end, she had fulfilled my plan in my stead.\nOriginally published in Chinese in Fiction World, 6th issue, 2019.\nTranslated and published in partnership with Storycom.\nRegina Kanyu Wang is a a writer, researcher, and editor, currently pursuing her PhD under the CoFUTURES project at the University of Oslo. She writes science fiction, nonfiction and academic essays in both Chinese and English. She has won multiple Xingyun Awards for Global Chinese SF (Chinese Nebula), SF Comet International SF Writing Competition, Annual Best Works of Shanghai Writers’ Association and more. Her stories can be found in her individual collections Of Cloud and Mist 2.2 and The Seafood Restaurant, various magazines, and anthologies. She is co-editor of the Chinese SF special issue of Vector, the critical journal of BSFA, The Way Spring Arrives and Other Stories, an all-women-and-non-binary anthology of Chinese speculative fiction, and the English version of The Making of The Wandering Earth: A Film Production Handbook. When she is not working on science fiction related projects, you can find her practicing krav maga, kali, boxing and yoga, or cooking various dishes and baking her favorite desserts.\nEmily Xueni Jin (she/her) is a science fiction and fantasy translator, translating both from Chinese to English and the other way around. She graduated from Wellesley College in 2017, and she is currently pursuing a PhD in East Asian Languages and Literature at Yale University. As one of the core members of the Clarkesworld-Storycom collaborative project on publishing English translations of Chinese science fiction, she has worked with various prominent Chinese SFF writers. Her most recent Chinese to English translations can be found in AI2041: Ten Visions For Our Future, a collection of science fiction and essays co-written by Dr. Kaifu Lee and Chen Qiufan (scheduled to publish September 2021) and The Way Spring Arrives co-published by Tor and Storycom, the first translated female and non-binary Chinese speculative fiction anthology (scheduled to publish April 2022). Her essays can be found in publications such as Vector and Field Guide to Contemporary Chinese Literature.", "source": "https://clarkesworldmagazine.com/wang_09_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Winter Garden by Regina Kanyu Wang, translated by Emily Jin"}